{
  "url": "https://www.wikihow.com/Prevent-Blocked-Sweat-Glands",
  "title": "How to Prevent Blocked Sweat Glands",
  "steps": [
    {
      "title": "Wash your skin with antiseptic soap.",
      "content": "Wash your skin with antiseptic soap. Use a gentle, non-irritating soap to wash your skin, focusing on areas that are most likely to be affected by blocked sweat glands. These areas include the groin, armpits, beneath the breast, and any other area of skin that folds against itself. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Choose a mild, hypoallergenic soap to avoid irritating your skin. Exfoliating your skin may also prevent blocked sweat glands. Allow your skin to air-dry rather than rubbing dry with a towel. Wash daily, or twice a day if necessary to maintain cleanliness."
    },
    {
      "title": "Avoid tight clothing.",
      "content": "Avoid tight clothing. Any clothing that presses or rubs against your skin increases your chances of developing blocked sweat glands. Wearing loose clothing made of natural fibers, such as hemp, cotton or linen, is recommended to prevent blocked sweat glands. [5] X Research source Underwire bras can block sweat glands beneath the breasts. Try to find a supportive bra that doesn't press tightly against your skin. Tight waistbands can also block the sweat glands."
    },
    {
      "title": "Quit smoking.",
      "content": "Quit smoking. Research shows that smoking increases your chances of developing HS, though the cause is currently unknown. Smoking is one of the key risk factors for HS. In order to prevent blocked sweat glands, try to quit smoking. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you need help to quit smoking, talk to your medical health provider or a local health organization. Support groups, online groups, or individual coaches can help you quit smoking. Many companies have incentive programs to help their employees quit smoking. Keep trying until you find the one that works for you."
    },
    {
      "title": "Maintain a healthy weight.",
      "content": "Maintain a healthy weight. HS is most common among people who are overweight or obese. To prevent blocked sweat glands, try to maintain a healthy body weight. If you're overweight, consider joining a weight loss program for encouragement and support in making lifestyle changes. Eat a healthy diet, avoiding sugary snacks and fatty foods, and eat plenty of fresh vegetables and fruit. [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Talk to your health care provider about weight loss support groups and dietary needs. If you've already developed HS, losing weight can help prevent additional flareups."
    },
    {
      "title": "Don't shave your body hair.",
      "content": "Don't shave your body hair. Shaving the armpits or groin can result in rubbing bacteria into the glands. If you want to eliminate hair in areas most likely to develop HS, talk to your doctor or dermatologist about options for hair removal. [8] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Wearing perfume or perfumed deodorants or lotions may also irritate the skin. Use unscented, noncomedogenic products designed for sensitive skin. Because shaving the groin and armpits are culturally sensitive subjects, you may wish to talk to your doctor about finding support groups. Wearing concealing clothing is one way to navigate the social complexities of body hair."
    },
    {
      "title": "Keep your groin area cool and clean.",
      "content": "Keep your groin area cool and clean. Wear cotton undergarments to improve air flow, and avoid tight clothing. Wearing synthetic fabric undergarments restricts air flow and increases the likeliness of blocked sweat glands. [9] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Wash groin daily or twice daily, depending on your individual needs. Use gentle antibacterial soap and allow to air dry. Use lukewarm water to wash groin."
    },
    {
      "title": "Avoid overheating.",
      "content": "Avoid overheating. Heavy sweating can cause sweat glands to become inflamed. Exercise in the early morning or evening hours, when the temperatures are lower. Don't do \"hot\" yoga, as this is designed to increase sweating. [10] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source It is okay to \"overheat\" your body with exercise or by using a sauna. Antiperspirants can be too harsh for sensitive skin, resulting in blocked sweat glands. If you choose to wear an antiperspirant, check with your doctor for recommendations. Stay out of the sun during its most intense periods. Wear a wide-brimmed hat and sunscreen when you do spend time outdoors. Drink plenty of water and cool off in the shade or indoors whenever necessary."
    },
    {
      "title": "Know the symptoms of hidradenitis suppurativa (HS).",
      "content": "Know the symptoms of hidradenitis suppurativa (HS). The appearance of blackheads, pimples in the groin or anal area, beneath the breasts, or in the armpits can all be signs of HS. You might find painful, pea-sized lumps just beneath the skin. These lumps can persist for months or even years. Lesions - bumps or sores that leak fluid - may also be present and persist for months. These symptoms often start just after puberty with a single, painful bump. Women, African-Americans, overweight, smokers and people with familial history of HS are most likely to develop the symptoms of HS. Some people experience mild forms of HS that can be best treated at home. Others require help from a doctor or medical care provider. HS affects at least 1% of the population."
    },
    {
      "title": "Apply warm compresses to the affected area.",
      "content": "Apply warm compresses to the affected area. Laying a clean, warm washcloth over your skin for 10-15 minutes may help with pain associated with blocked sweat glands. If you have a painful, deep lump caused by a blocked sweat gland, this compress may provide some relief. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source You can also use a hot teabag as a compress. Make a cup of tea by steeping a teabag in boiling water. Then take the hot teabag and apply it to the affected area for pain relief. The warmth will help relieve pain, but it won't get rid of the bump."
    },
    {
      "title": "Wash your skin well with antibacterial soap.",
      "content": "Wash your skin well with antibacterial soap. Make sure to use a soap that doesn't irritate your skin. Find a fragrance-free soap that's designed for sensitive skin. Lather and rinse well. Allow your skin to air dry. You may wish to follow your washing with an over-the-counter antibiotic creme. Avoid comedogenic moisturizing creams, lotions, etc. as they may block your sweat glands and pores."
    },
    {
      "title": "Take zinc supplements.",
      "content": "Take zinc supplements. Studies suggest that zinc supplements may help to decrease the chances of additional inflammation. Zinc supplements include zinc sulfate, zinc acetate, zinc glycine, zinc oxide, zinc chelate, and zinc gluconate. These are generally considered safe when taken in the recommended dosages. While zinc appears safe during pregnancy in small amounts, check with your doctor and use with caution. Studies have not ruled out the possibility of harm to the fetus. Avoid zinc chloride. No studies have been done on its safety or effectiveness."
    },
    {
      "title": "Take antibiotics to address infections.",
      "content": "Take antibiotics to address infections. Your doctor may prescribe antibiotics to treat existing infections and to prevent new infections from arising. Some antibiotics are prescribed for long-term preventative use. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If there isn't bacterial infection, antibiotics may be prescribed to suppress additional flare-ups. Antibiotics can be taken orally, in pill form, or can be found in ointments to apply to the affected area."
    },
    {
      "title": "Try steroid medications to reduce inflammation.",
      "content": "Try steroid medications to reduce inflammation. Corticosteroid tablets (steroids), such as prednisolone, may be prescribed for short periods of time. This option is most effective when the symptoms of HS are acutely painful, creating difficulty in daily living mobility. Steroids shouldn't be used long-term, as they have negative side effects. Long-term side effects include osteoporosis, weight gain, cataracts, and mental health problems like depression. [13] X Research source Injections of steroid medication into the affected area can also be effective for short-term treatment."
    },
    {
      "title": "Ask your doctor about tumor necrosis factor (TNF)-alpha inhibitors.",
      "content": "Ask your doctor about tumor necrosis factor (TNF)-alpha inhibitors. A new class of injectable medications reduces inflammation and stop the progression of HS. These drugs include infliximab (Remicade ®); etanercept (Enbrel ®); adalimumab (Humira ®); golimumab (Simponi ®) and golimumab (Simponi Aria ®). [14] X Research source These medications are also used to treat inflammatory conditions such as rheumatoid arthritis (RA), psoriatic arthritis, juvenile arthritis, inflammatory bowel disease (Crohn’s and ulcerative colitis), ankylosing spondylitis and psoriasis. Because they are new, these medications are expensive. Most insurance plans should cover them, but check to see if your policy allows their use."
    },
    {
      "title": "Consider surgical treatment.",
      "content": "Consider surgical treatment. For severe cases of blocked sweat glands and HS, surgical treatment is a practical option. Lesions may be connected by \"tunnels\" beneath the skin, and removing these tunnels is called \"de-roofing.\" This surgery is generally effective at removing the affected area, but other sites may develop. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Surgical drainage of swollen area provides short-term relief. Surgical removal of the skin in all affected areas may be recommended. In these cases, skin grafting will need to be done to repair the areas and close the wound."
    }
  ]
}