{
  "url": "https://www.wikihow.com/Set-Boundaries-with-Narcissistic-Parents",
  "title": "How to Set Boundaries with a Narcissistic Mother or Father",
  "steps": [
    {
      "title": "The more concrete and clear your boundaries are, the easier it will be.",
      "content": "The more concrete and clear your boundaries are, the easier it will be. Reflect for a little and determine what concrete, specific boundaries you want to enforce . [1] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. Then, plot out how you want to frame these boundaries if—or when—you need to present them to your parent. [2] X Research source “Be nicer to me” is pretty hard to evaluate. “I want you to stop putting me down” is better, but still difficult to call out. Something like, “You cannot keep bringing up how I don’t make as much money as you think I should—especially in front of my spouse” or, “I do not want you to interrupt me in front of others to talk about yourself” will work."
    },
    {
      "title": "If you need to put your foot down, don’t beat around the bush.",
      "content": "If you need to put your foot down, don’t beat around the bush. If your heart-to-heart conversation is proving to be not enough and you want to set boundaries , spell it out for them. Talk to them privately, lay out your ground rules, and do not negotiate, argue, or discuss it. Make it clear that this is how it’s going to be from now on. [3] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. You could say: “I’ve tried to let it go, but I just can’t. You have to stop putting me down at family events. It’s completely unacceptable.” “You cannot give me unsolicited advice about raising my kids. I’m their parent, not you, and this needs to stop now.” “Stop acting like a victim when I don’t drop everything I’m doing to help you out. I’m tired of it and I’m not putting up with it anymore.”"
    },
    {
      "title": "Explain what happens if they don’t respect your boundaries.",
      "content": "Explain what happens if they don’t respect your boundaries. [4] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. Someone with narcissistic qualities may struggle to honor boundaries if there’s nothing to incentivize them. Come up with a consequence for crossing each boundary you set. Keep in mind, you must be willing to enforce them—not doing so may actually make the boundary even less valid in your parent’s eyes. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You may say: “If you don’t stop putting me down in front of others, I won’t invite you to family events. That’s it. No more Thanksgiving, no more Christmas, and no more annual barbeque.” “If you keep telling me how to raise my kids, they simply won’t be visiting grandpa and grandma anymore.” “If you keep playing the victim card, I simply won’t offer to help with anything. The next time you need me to give you a ride or fix your internet, you can just call someone else.”"
    },
    {
      "title": "They may not like the boundaries or consequences, but don’t let up.",
      "content": "They may not like the boundaries or consequences, but don’t let up. [6] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. Do not allow your parent to plead, discuss, or negotiate where your lines are drawn. They’re your lines, and putting your foot down sets the precedent early that you’re not going to be pushed around here. Feel free to explain why you’re doing this, or answer questions that they have, but don’t concede anything. [7] X Research source Phrases like, “This is non-negotiable,” “It’s not up for discussion,” and, “I’ve made my mind up” are going to be your best friend here. The more info you give them regarding your reasons here, the more room you might be giving them to feel like they can argue with you."
    },
    {
      "title": "Boundary-setting may anger your parent, but don’t fight fire with fire.",
      "content": "Boundary-setting may anger your parent, but don’t fight fire with fire. They may try to hurt your feelings just to destabilize the situation and wrestle some control back from you. Don’t let them get to you. If they say something to ruffle your feathers, play it off, smile, laugh, or just flat-out ignore it. They’re more likely to stop if they don’t get the reaction they want out of you. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source People with narcissistic traits often try to quarrel to gain control, so take that power away from them. Ignore it if they try to act like the victim. If they throw out counterarguments or try to intimidate you, do not get baited into responding. Remember, you aren’t negotiating here. These boundaries are concrete and you can’t let them think that there’s any chance you’ll change your mind."
    },
    {
      "title": "If your parent gets close to the line, act quickly and call it out.",
      "content": "If your parent gets close to the line, act quickly and call it out. It’s tempting to let small stuff go, and you should if that “little thing” is truly not a part of the problem. However, if you let your parent test the boundary, it will weaken over time. The moment you get a whiff that they’re crossing a line, call it out, tell them to stop, and remind them what’s at stake here. If you’re firm and fair, they should get the message eventually. [9] X Expert Source Sarah Schewitz, PsyD Licensed Clinical Psychologist Expert Interview. 15 April 2019. For instance, if your boundary focuses on negative comments in front of family and they start talking about how successful they were at your age, butt in with a, “Hey. Careful.” Even a raised eyebrow can send the signal that they shouldn’t push it further. Alternatively, if they text you after midnight asking for help with something trivial, reply, “I’m going to bed. We’re not doing this.”"
    },
    {
      "title": "If your parent seriously crosses the line or keeps pushing it, follow through.",
      "content": "If your parent seriously crosses the line or keeps pushing it, follow through. Enforcing a consequence is never fun, especially if you were hoping it would never come to this, but your parent is unlikely to ever change if you let things slide. On top of that, if you’re inconsistent, it’s going to be difficult to actually pull the trigger in the future when you want to enforce a consequence. [10] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. It may be painful, but remember, they’re the one crossing the line, not you. [11] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If they show some actual reform in the future, you can reverse the decision. The important thing here is that they know you’ll enforce the consequence, but letting it go if they apologize or actually stop is fair."
    },
    {
      "title": "If they cut it out, show them kindness, love, and appreciation.",
      "content": "If they cut it out, show them kindness, love, and appreciation. A parent with narcissistic traits may have to be treated in similar ways to how you’d treat a child. If they’re behaving well, reward them. Tell them that you genuinely appreciate them, show them love, and show up a little more often to spend time with them. If they’re respecting your boundary, it’s a sign that they’re respecting you and that your relationship is improving. [12] X Expert Source Sarah Schewitz, PsyD Licensed Clinical Psychologist Expert Interview. 15 April 2019. You can ask them to hang out more often, call them just to talk, or take them out to eat at their favorite restaurant. It can be hard to do this if you’ve got a lot of pent-up anger towards your parent. If they’re genuinely making an attempt to do better, you should too. If you need help letting it go, talking to a therapist or counselor may help."
    },
    {
      "title": "If it reaches the point where you need to step away, do it.",
      "content": "If it reaches the point where you need to step away, do it. [13] X Expert Source Rachel Eddins, M.Ed., LPC-S Licensed Professional Counselor Expert Interview. 23 March 2022. Let your parent know that you need some time alone due to their boundary-crossing behavior. Alternatively, you can simply stop responding to them and slowly disengage over time until you’re ready. If it’s necessary for your mental and emotional health, it may be your best move. [14] X Research source Don’t beat yourself up if it gets this far. You have nothing to feel bad about if you need some space. [15] X Expert Source Sarah Schewitz, PsyD Licensed Clinical Psychologist Expert Interview. 15 April 2019. Some people cut their parents off altogether. If you think this is the healthiest thing for you, don’t beat yourself up about it. [16] X Research source"
    },
    {
      "title": "Self-care",
      "content": "Self-care is essential when you’re dealing with narcissistic behaviors. Parents with narcissistic tendencies may excel at finding ways to get under your skin, especially when you’re trying to set boundaries. Look after yourself. Set time aside to get a massage, see friends, and pursue the things you care about. Meditate, exercise, and eat a healthy diet so that you feel your best. [17] X Research source Seeing a therapist can really help, especially if you find it emotionally taxing to deal with your parents. You may be surprised, but this is a very common problem, and a therapist will be able to offer insight. [18] X Research source"
    }
  ]
}