{
  "url": "https://www.wikihow.com/Polish-Granite-Counter-Tops",
  "title": "How to Polish Granite Countertops by Hand",
  "steps": [
    {
      "title": "Check the counter’s seal before you clean to prevent damage.",
      "content": "Check the counter’s seal before you clean to prevent damage. Granite countertops are sealed to protect the stone from being weakened and damaged from everyday use. To test the seal, pour a few drops of water or cooking oil onto the countertop and check that water beads form, as this indicates that the seal is working properly. If the water soaks into the countertop, apply a granite seal or contact a granite restoration professional to get it resealed. [2] X Research source Make sure you do this sealant test before you do any buffing and cleaning of the granite. Otherwise, you may further damage the deteriorated sealant or the granite itself."
    },
    {
      "title": "Clear the countertops of appliances and sweep away any debris.",
      "content": "Clear the countertops of appliances and sweep away any debris. First, unplug any appliances and set them somewhere safe, like the kitchen table. Also remove any cutting boards, spice racks, or anything else that’ll get in the way to create a clear, obstacle-free surface to work with. Then, use a spare rag or a dry sponge to wipe any crumbs or other large debris into the trash. [3] X Research source"
    },
    {
      "title": "Scrub down the countertop with soapy water and a sponge.",
      "content": "Scrub down the countertop with soapy water and a sponge. In a bucket or other large container, add 1 US tbsp (15 mL) of mild dish soap to 1 US gal (3.8 L) of warm water water. Then, soak a soft sponge in the soap solution and use it to scrub away at the countertops, removing any oil stains or other dirty spots. Move the sponge in an “S” pattern to attack stains from multiple angles. Or, use a commercial granite cleaning solution . Spray the solution lightly over the surface, then wipe it down with your cloth. Never use harsh chemicals on granite. Although granite is a hard-wearing material, it must be treated gently to keep it looking good. Avoid products that contain lemon, vinegar, lime, ammonia, bleach, or glass cleaners, as these chemicals can break down the sealant and damage the granite over time."
    },
    {
      "title": "Dry the countertops and scrape off stubborn stains with a razor blade.",
      "content": "Dry the countertops and scrape off stubborn stains with a razor blade. Thoroughly dry the countertops with a spare rag. Then, for more set-in or stubborn stains, don some safety gloves and wield a razor blade, or a bladed scraping tool . Tilt the razor blade so that it’s almost flush with the surface of the countertop, and carefully chip away at any remaining stains. Afterward, scrub the countertop again with your cleaning solution. [4] X Research source Or, cover stubborn stains with a 3:1 paste of baking soda and water, then cover the pasted spot with plastic wrap for 1-2 days to let the paste absorb the stain, then scrub it away with warm water. This is especially handy for cleaning oil stains ."
    },
    {
      "title": "Scrub the countertop with isopropyl alcohol to disinfect it.",
      "content": "Scrub the countertop with isopropyl alcohol to disinfect it. Now that the countertop is all clean, use a spray bottle to spritz it all over with isopropyl alcohol . Let the alcohol sit for 5 minutes to kill any germs, then wipe it away with a microfiber cloth soaked with warm water. [5] X Research source Or, mix 1 part of isopropyl alcohol with 1 part of warm water and use this solution to wipe down the countertop for a more hands-on disinfection."
    },
    {
      "title": "Rinse the countertop with warm water and dry it with a microfiber cloth.",
      "content": "Rinse the countertop with warm water and dry it with a microfiber cloth. Soak a rag with warm water and wipe down the counters one more time. Then, with a dry microfiber cloth, wipe the counters again to dry them off. Using a microfiber cloth rather than a rag or paper towel helps prevent streaking and gives your counters a uniform shine. [6] X Research source"
    },
    {
      "title": "Polish and buff the countertops with cooking oil and a microfiber cloth.",
      "content": "Polish and buff the countertops with cooking oil and a microfiber cloth. Now comes the finishing touch. Pour a few drops of cooking oil—like canola or olive oil—onto a microfiber cloth. Then, use the cloth to buff the entire countertop, working in small, circular motions. This gives your countertop added shine, and also grants it some stain resistance. [7] X Research source Work until the entire surface is coated in a thin, barely-there film of oil that’s a bit tacky to the touch. Be sure to buff the edges, too. Or, use a commercial granite polish for a more professional shine. Spray the solution lightly over the countertop and let it rest for the indicated time, usually 2-3 minutes, before buffing it in with a microfiber cloth."
    },
    {
      "title": "Hire a professional granite polishing service to remove deep scratches.",
      "content": "Hire a professional granite polishing service to remove deep scratches. In most cases, your granite countertop will polish up nicely using simple cleaning agents. However, sometimes the granite can be too deeply scratched or damaged for home remedies to work. Contact a granite restoration professional to get your granite countertop professionally polished, and looking as good as new! [8] X Research source Professionals use specialty tools and either wet or dry polishing techniques on the granite. These techniques are only recommended for professionals to use, as they can cause irreversible damage if they are done incorrectly. Remove smaller scratches at home by buffing a dab of granite polishing paste into the scratch."
    },
    {
      "title": "Clean up spills immediately to avoid stains and marks.",
      "content": "Clean up spills immediately to avoid stains and marks. Liquids that are left on granite for too long can cause dark, shadow-like marks to form, especially coffee, juices, wine, or sodas. Similarly, bright-colored beverages can stain light granite countertops. Get into the habit of wiping up spills with a soft cloth as soon as they occur to prevent stains from seeping into the granite. [9] X Research source Also, keep bottles of oil or soaps on a dish to prevents passive leaks onto the granite."
    },
    {
      "title": "Buff the granite with cooking oil to provide shine and stain resistance.",
      "content": "Buff the granite with cooking oil to provide shine and stain resistance. Apply cooking oil to a clean cloth, then make circular motions across the surface of the countertop. Use gentle pressure as you buff the surface. This will create a nice shine on your granite and temporarily reduce the risk of staining, as spills won't be able to soak into the granite as easily. [10] X Research source Repeat this periodically, such as daily or once a week, depending on your preferences. Use whatever oil you typically use for cooking. For example, you can use vegetable oil, olive oil, or avocado oil."
    },
    {
      "title": "Use a cutting board to prevent scratching the granite.",
      "content": "Use a cutting board to prevent scratching the granite. Although granite is very hard-wearing, it can still be damaged if you regularly cut straight on the surface. Always use a cutting board when you’re preparing food and try not to leave any sharp objects directly on the countertop. [11] X Research source This will also help to protect your knives and keep them sharp."
    },
    {
      "title": "Place hot objects on a heat-resistant surface on the countertop.",
      "content": "Place hot objects on a heat-resistant surface on the countertop. Hot pots, pans, hair straighteners, and curling irons can all cause micro-scratches to form when the granite undergoes a sudden change in temperature. Keep a silicone, heat-resistant pad or an insulated mat within easy reach of the countertop. [12] X Research source Hot objects can also cause the sealant to break down more quickly."
    },
    {
      "title": "Keep chemicals and cosmetics off the countertop to prevent damage.",
      "content": "Keep chemicals and cosmetics off the countertop to prevent damage. Granite countertops are vulnerable to harsh chemicals like citric acid, ammonia, and other ingredients that may be found in beauty products. [13] X Research source Makeup and nail polish may tarnish the granite and break down the sealant with long-term exposure. Place these products on a tray or a mat, or leave them in a cabinet instead."
    },
    {
      "title": "Reseal the countertop every 5-10 years to make it stain resistant.",
      "content": "Reseal the countertop every 5-10 years to make it stain resistant. The best defense against stains on your granite countertop is a good sealant. Sealants containing the ingredient fluorocarbon aliphatic resins are the most durable and water- and oil-repellent, and will last you up to 5-10 years. [14] X Research source Perform a sealant test every 6 months—place a few drops of water or oil onto the countertop and wait 15 minutes. If they’re absorbed into the counter, you granite needs a new coat of sealant."
    }
  ]
}