{
  "url": "https://www.wikihow.com/Roblox-Creepy-Games",
  "title": "Roblox: Creepy Games That are Sure to Scare You (20+ Games to Try)",
  "steps": [
    {
      "title": "Short Creepy Stories.",
      "content": "Short Creepy Stories. Short Creepy Stories was so scary that it was temporarily removed from Roblox. There are 11 short horror stories to play, plus two extras. If you're looking for a truly scary experience, look no further than this game! [1] X Research source Rating: 17+ (heavy realistic blood, moderate violence, moderate fear)"
    },
    {
      "title": "The Mimic.",
      "content": "The Mimic. The Mimic is a game that contains four stories inspired by Japanese urban legends. If you're a fan of Japanese horror, scary games, and jump scares, this is a must-play for you. [2] X Research source Rating: 13+ (blood, moderate violence, and moderate fear)"
    },
    {
      "title": "Doors.",
      "content": "Doors. Doors is a game that blends horror and puzzle gameplay for a truly unique experience. For the best experience, the Doors devs recommend to play without a guide and to \"use each death as a lesson.\" [3] X Research source Rating: All ages (mild violence)"
    },
    {
      "title": "Dead Silence.",
      "content": "Dead Silence. Dead Silence is a procedurally generated horror/puzzle game where you must investigate the legend of someone named Mary S. This game is based on the 2007 horror film of the same name. [4] X Research source Rating: N/A (developer did not specify)"
    },
    {
      "title": "Apeirophobia.",
      "content": "Apeirophobia. Apeirophobia is a horror game about exploring and documenting a liminal space (which the devs compare to \"backrooms\"). You'll find jump scares, flashing lights, and loud noises in this popular and creepy Roblox game. [5] X Research source Rating: 9+ (unrealistic blood, mild violence)"
    },
    {
      "title": "Piggy.",
      "content": "Piggy. Piggy is a survival horror game where you're trying to escape the eponymous Piggy while also dealing with other threats and puzzles. [6] X Research source Rating: 9+ (mild violence)"
    },
    {
      "title": "SCP:",
      "content": "SCP: Containment Breach. SCP: Containment Breach is a unique horror game where you can play as one of three classes: a Class D trying to escape, a Guard trying to rescue a Researcher, or an SCP trying to cause as much trouble as possible. This game is based on the popular SCP universe of creepy monsters. [7] X Research source Rating: N/A (developer did not specify)"
    },
    {
      "title": "Geisha.",
      "content": "Geisha. Geisha is a horror game where you must confront and survive encounters with vengeful Japanese spirits. Will you be able to solve the puzzles and escape the maze alive? This is a great pick for fans of Japanese horror! [8] X Research source Rating: All ages (unrealistic blood)"
    },
    {
      "title": "Alone in a Dark House.",
      "content": "Alone in a Dark House. In Alone in a Dark House , you must take on the role of an investigator trying to solve a mystery and also do your best to survive against a paranormal being at the same time. For the best (and creepiest) experience, the devs of this game recommend playing the game alone, in the dark, and with headphones on. [9] X Research source Rating: 13+ (realistic blood, moderate violence)"
    },
    {
      "title": "The Maze.",
      "content": "The Maze. The Maze is a survival horror game for people who like exploring. According to the devs, the Maze is very open, but \"once you get into the maze, it gets very enclosed.\" [10] X Research source Rating: N/A (developer did not specify)"
    },
    {
      "title": "Silent Dark.",
      "content": "Silent Dark. Fans of psychological horror will enjoy Silent Dark , a game that blends the line between dreams and reality. The original Silent Dark is no longer functioning, but Silent Dark: Remade is an updated version that is still playable. [11] X Research source Rating: 9+ (mild fear)"
    },
    {
      "title": "Light Bulb: Reillumination.",
      "content": "Light Bulb: Reillumination. A remake of the popular game Light Bulb , Reillumination is an intense psychological horror game where you must escape a maze before it catches you. Fans of intense thriller games should give this one a try. [12] X Research source Rating: N/A (developer did not specify)"
    },
    {
      "title": "Jim's Computer.",
      "content": "Jim's Computer. Jim's Computer doesn't initially look like a horror game, but many of its fans recommend it to players looking for a creepy new game to play. We don't want to give out too many spoilers, so you'll have to play this one for yourself to see what it's all about! [13] X Research source Rating: N/A (developer did not specify)"
    },
    {
      "title": "Residence Massacre.",
      "content": "Residence Massacre. In Residence Massacre , you must defend your home against a monster trying to destroy it. The devs warn that this game can be a little difficult for newcomers, but it's worth a shot if you like games that are a little bit on the harder side. [14] X Research source Rating: N/A (developer did not specify)"
    },
    {
      "title": "Roses.",
      "content": "Roses. In Roses , you must find and rescue your friend Max after he goes missing in an abandoned 1940s asylum. There are three chapters to play in this spooky game, and the devs estimate it takes about 25 minutes to play the game from start to finish. [15] X Research source Rating: All ages (unrealistic blood)"
    },
    {
      "title": "Frigid Dusk.",
      "content": "Frigid Dusk. Frigid Dusk is a game where you must investigate the aftermath of a stolen biological weapon. You can even team up with your friends and play the game on VR! Will you be able to uncover the mysteries of this spooky and creepy game? [16] X Research source Rating: N/A (developer did not specify)"
    },
    {
      "title": "The Rake Remastered.",
      "content": "The Rake Remastered. In The Rake Remastered , a monster known as the Rake lurks in the forest at night, looking for victims. Will you be able to survive? Fans of survival horror should give this game a try! [17] X Research source Rating: 13+ (realistic blood, mild violence)"
    },
    {
      "title": "Confinement.",
      "content": "Confinement. In Confinement , there are four chapters to beat. To move on to the next chapter, you must finish the one before it—which will prove to be a challenge with the game's souls-like horror gameplay. Can you escape confinement? [18] X Research source Rating: N/A (developer did not specify)"
    },
    {
      "title": "Evelyn.",
      "content": "Evelyn. In Evelyn , you assume the role of a police detective in 1921. You're investigating the mystery of Evelyn—will you be able to figure out what happened? Fans of puzzle/horror games should give this one a try! [19] X Research source Rating: All ages"
    },
    {
      "title": "Brutal Company.",
      "content": "Brutal Company. Brutal Company is a co-op game inspired by Lethal Company. In the game, you must explore alien planets and gather valuables to sell while avoiding traps and alien creatures. This game supports up to four players, but it's still fun with just two. [20] X Research source Rating: All ages (mild violence)"
    },
    {
      "title": "Specter.",
      "content": "Specter. Specter is a horror game inspired by Phasmophobia. In the game, you must explore an area, find evidence, and use that evidence to determine what type of ghost is haunting the area. The game is for four players but is still fun with two. [21] X Research source Rating: N/A (developer did not specify)"
    },
    {
      "title": "Breaking Point.",
      "content": "Breaking Point. Breaking Point is a murder mystery game where players must figure out the identity of a murderer. Fans of social deduction games like Among Us should give this one a try! [22] X Research source Rating: N/A (developer did not specify)"
    }
  ]
}