{
  "url": "https://www.wikihow.com/Record-a-Live-Concert",
  "title": "How to Record a Live Concert",
  "steps": [
    {
      "title": "Take a trip to the concert venue to determine how to set up your equipment.",
      "content": "Take a trip to the concert venue to determine how to set up your equipment. Plan on getting there ahead of the concert date, if possible. The best way to get an idea of what you’re dealing with is by going to another concert at the same place. Look around the room, figuring out where you can set up your recording gear. Look for a spot away from the crowd. Also, scope out the stage to see if you can fit some recording microphones on it. Pay close attention to the sound quality. It differs a lot depending on where you stand. If you know where the music is clearest, you can place your equipment there to capture it. The best time to check in on a venue is always when it’s in use. Try to get a sense of what to expect when you’re recording something. If you don’t have an opportunity to do that, go when it’s empty, if possible. The same rules apply if you’re filming at home or in a studio. Spend time planning out how you’re going to set everything up, including figuring out how to get the greatest possible sound quality."
    },
    {
      "title": "Ask the band and event staff what the show will be like.",
      "content": "Ask the band and event staff what the show will be like. Many concert venues have a front-of-house sound system that controls the sound quality. If you know the place uses one, introduce yourself to the operator. Ask them for help with your recording. Talk to the band as well, if you can, to figure out details like what instruments will be used and how they will be set up on the stage. Make sure you know what they expect the recording to be like as well. A church might have a piano and an organ, for example. If you didn’t know the musician was planning on playing the organ and you set your equipment there, then it throws off the entire concert. You can often hook your recorder up to the sound system to capture audio, but you need the operator’s permission. In addition, not all sound systems are set up the same way. Some setups only pick up certain parts of the music, like the bass."
    },
    {
      "title": "Select a good recorder with enough outlets to plug in the microphones.",
      "content": "Select a good recorder with enough outlets to plug in the microphones. Most people start out with a laptop. It’s a simple and inexpensive way to record, but it has several downsides that could become problems over a long recording session. For a more portable option, try using a handheld recorder. If you record lots of concerts, invest in a hardware recorder that can connect to more microphones. [1] X Research source Portable recorders are nice because they are very easy to move and set up, but they can run out of battery power right in the middle of your recording. Make sure you know where the electrical outlets are if you think this will be a problem! A computer will usually have space to plug in a single microphone. Some portable recorders have 2 outlets. Hardware recorders can have many outlets, which makes recording full concerts much easier. Recording hardware usually starts around $100 USD. Bigger, better hardware recorders can cost much more, on top of all the other equipment you may end up using."
    },
    {
      "title": "Place the recorder in a high spot facing the stage.",
      "content": "Place the recorder in a high spot facing the stage. The simplest way to do this is to put it on a stool or another stable platform close to the stage. To protect your recorder, look into buying a stand that holds it up like a microphone. If the venue has a sound control system, you may also be able to perch your recorder there for safe-keeping, but make sure it is above the crowd. [2] X Research source Placement matters, so try to keep the recorder close to the action. Test the sound by recording something and listening to the playback to ensure you have the best spot in the house. Make sure the recorder is out of the way and won’t be disturbed by anyone attending the concert. An accident can easily ruin an otherwise perfect recording, but broken equipment is no fun either."
    },
    {
      "title": "Connect the recorder to a microphone placed on stage.",
      "content": "Connect the recorder to a microphone placed on stage. If you’re only using one microphone, get an omnidirectional microphone and place it near the center of the stage. Omnidirectional means it records sound from all directions. You can get a decent one for about $100. Run the microphone cable back to your recorder, then plug it in to make sure it’s working. [3] X Research source Most recordings use multiple microphones for better sound quality. If you are able to, try placing a unidirectional microphone on either side of the stage. Shotgun and cardioid mics both pick up noise from a single direction. Another option is to use a separate microphone for each instrument, but this gets expensive very fast and takes up a lot of space. If you are able to do this, connect the mics to an audio recorder with space for multiple inputs. If you’re connecting to a sound system to capture audio, bring a mic splitter. It directs sound to both the sound system and your recorder. It prevents the sound system from messing up your recording."
    },
    {
      "title": "Use condenser mics and other gear to improve the sound quality.",
      "content": "Use condenser mics and other gear to improve the sound quality. If you have the space and budget for extra microphones, purchase a pair of condensers and place them to the left and right of the crowd. Condensers are fragile microphones that pick up a wide variety of sounds, making them great for recording things like crowd noise. You can use them with your regular microphones to capture more of the concert. Inexpensive ones are available for around $25, but, If you have them, they make a recording sound much fuller. [4] X Research source Preamps are devices that turn weak electrical signals from your microphones into strong, clear recordings. If you’re using a recording device with multiple microphone inputs, get a preamp for each microphone. They cost around $25 to start, so it is an investment. Mixers can also be used to record and combine audio tracks from different microphones while you’re recording. You can do this by connecting your recorder to the venue’s sound system or by plugging a recorder into your own mixer."
    },
    {
      "title": "Set the audio levels low on the recording.",
      "content": "Set the audio levels low on the recording. Turn the volume down low! If the microphones are set to a low level, then your recording is less likely to get distorted. Keep in mind that the musicians may turn their instruments up during the recording, creating more noise than you anticipated. When this happens, your recorder experiences clipping, a common type of distortion. If the sound volume is kept low, your recording may sound a little soft at first, but it will still be listenable. Clipping can sometimes be fixed by editing the recording afterward, but you can’t truly get rid of distorted audio. It can easily ruin an otherwise good recording. If you’re able to speak to the musicians before the recording, remind them not to turn their instrument volume up too high."
    },
    {
      "title": "Record the soundcheck to make adjustments before the concert.",
      "content": "Record the soundcheck to make adjustments before the concert. Test all of your equipment in advance to ensure it’s working and set appropriately. The soundcheck is the closest you will get to an accurate test before the actual event, so do an extra check then. Listen to the recording for weaknesses, such as thin or distorted audio. Find ways to fix these problems and improve the final recording. [5] X Research source For example, if the audio sounds a little weak or faint, move the microphones close to the instruments. Move them back if the music sounds a little loud or distorted. If you’re working with the band, ask them to play their instruments after each adjustment you make."
    },
    {
      "title": "Turn on your recorder and leave it in place during the concert.",
      "content": "Turn on your recorder and leave it in place during the concert. Stay by it to make sure it’s still working and that no one accidentally knocks it off its perch. You can’t really do much with what you’re recording until you get it back home. Watch the recorder screen to see that it’s receiving sound from each microphone you’re using. Also, check the microphone cords on occasion to see that they are all plugged in and working too. [6] X Research source If you notice any problems, make adjustments as best you can. You might be able to reposition your gear, for instance. If you took care when setting it up your equipment, the recording will most likely turn out fine. However, hiccups are inevitable, so having a backup plan always pays off!"
    },
    {
      "title": "Ask the venue’s sound operator to use their equipment to record.",
      "content": "Ask the venue’s sound operator to use their equipment to record. If you have a chance, introduce yourself to the sound operator in advance. Many venues have a front of house (FOH) sound system that controls sound in the venue, and you can use this to set up your recording equipment. However, the equipment varies wildly between venues, and not all sound operators work the same way. Let them know that you want to record the show, and ask for their help. [7] X Research source If you’re able to, call the venue operator or promoter in advance to ask for permission to record. No matter who you talk to, being polite will make it more likely that you get a great recording. Some sound operators won’t help you. They may be recording the show themselves or simply not have room for your equipment."
    },
    {
      "title": "Examine the sound system to determine how it works.",
      "content": "Examine the sound system to determine how it works. First, find out if the control panel has an output you can connect your recorder to in order to record sounds from it. Then, ask what instruments the operator plans on picking up through the mixer. The operator can cut out the sound from different instruments to prevent them from getting too loud, and it can have a serious effect on your recording. [8] X Research source Some setups only pick up certain instruments, like the bass. If you run into this problem, you can deal with it by using a mic splitter and your own microphones. A mic splitter sends a separate recording to your recorder and the sound system. If an instrument isn’t recorded through a microphone connected to the mixer, it is most likely being picked up through an amplifier. For example, guitars are often recorded this way, and, as soon as the guitarist turns up the amp, you get clipping in your recording."
    },
    {
      "title": "Connect your recorder to the sound system, if possible.",
      "content": "Connect your recorder to the sound system, if possible. If the mixer control panel on the sound system has an output and no one else is using it, you can take advantage of it. You will end up with a stereo recording, which means that the recorder picks up the sound in full. The downside is that it requires good cooperation between you, the sound operator, and the band. If they do something you don’t expect, it will show up on the recording. [9] X Research source Make sure that the sound system is receiving input from all of the instruments on stage, or else you may end up with an incomplete recording. The operator has to keep the sound levels consistent for this to work. If someone suddenly turns up an amp, for instance, your recording will end up distorted."
    },
    {
      "title": "Set up a mic splitter in order to capture sound independently.",
      "content": "Set up a mic splitter in order to capture sound independently. To be able to do this, you will have to get a separate piece of hardware. The mic splitter connects to both your recorder and the sound system so they both record the sound. Some venues already have splitters in place, but having your own doesn’t hurt. [10] X Research source You can get an inexpensive mic splitter with up to 8 outlets for about $300. Make sure your mic splitter has input ports for any extra microphones you plan on setting up."
    },
    {
      "title": "Set up extra microphones to record different parts of the concert.",
      "content": "Set up extra microphones to record different parts of the concert. If the venue allows you to set up microphones, you can connect them to a mic splitter to get a fuller sound. Try placing an omnidirectional microphone near the crowd, for instance, to pick up the concert’s sound in all directions. You could also set a few condenser microphones to the left and right of the stage, since they are much more sensitive than other types of microphones. To record individual instruments, place your own microphones on the stage, such as one near the drums. [11] X Research source Use multiple microphones to make a multitrack recording. By doing this, you can record each sound source separately. You can then edit all of these recordings into one perfect concert."
    },
    {
      "title": "Monitor the recording equipment while the concert is going on.",
      "content": "Monitor the recording equipment while the concert is going on. If you’re hooked up to the venue’s equipment, the sound operator will take care of things. Just make sure your recorder and microphones are on. Keep an eye on them throughout the show to ensure they all continue to work. You won’t be able to do much except keep the recorder running and reposition your equipment as needed. [12] X Research source Take a peek at the mixing board used by the sound operator. If you know how it works, you can figure out how it affects your recording. Note when the operator adjusts the volume levels and remind them of your recording if you think the changes will hurt it. If you know the performers, you may be able to give them instructions, such as reminding them not to tune their instruments up too high. It’s easy for them to forget while they are performing."
    },
    {
      "title": "Ask for permission before attempting to film a concert.",
      "content": "Ask for permission before attempting to film a concert. Contact the band to let them know you would like to film the show. If you’re going to an established concert venue, check in with the staff to ensure that filming is permitted. It’s best to do this as early as possible to plan accordingly. In some cases, they will make arrangements for you, such as setting up a filming area or interviews. Technically, it is illegal to record musicians without their permission, even if you’re just using a phone. However, most people won’t care if you record with a cell phone. For big concerts, you have to apply for a photo pass in order to do any sort of filming. You have to contact the band or concert organizer, but you won’t get a pass unless you’re a professional journalist or photographer."
    },
    {
      "title": "Find a good spot with a clear view of the stage.",
      "content": "Find a good spot with a clear view of the stage. If you’re filming the concert with permission, the place to be is usually at the foot of the stage. Many places will leave a little bit of space between the crowd and the stage. You can set up your cameras there, but you might also wish to place some along the sides of the stage to get a better variety of angles. You could also carry a camera around on stage, but make sure the performers know you’re going to do this. [13] X Research source If you’re a fan in the crowd, look for some space away from other people. Check near the sound engineer’s control booth, handicap areas, and speakers. Get up close to the stage if you are able to. To pick out good filming spots, arrive at the venue early. Try attending during another concert, for instance."
    },
    {
      "title": "Use multiple cameras to capture a better view throughout the concert.",
      "content": "Use multiple cameras to capture a better view throughout the concert. One camera is fine if that is all you have available. If you’re able to, however, you might want to set up a camera on either side of the stage. You could also set a camera further back for a wider angle. You might also use a handheld camera to carry around for more dynamic shots. [14] X Research source If you’re using multiple cameras, you most likely will need someone to operate each one. When filming, make sure each camera has a good view of the concert. Make sure it is stable so the video quality is as high as it can be."
    },
    {
      "title": "Set up tripods so you are able to film with better stability.",
      "content": "Set up tripods so you are able to film with better stability. Tripods serve as secure spots for cameras and phones, but they also allow you to do some filming tricks like panning across the stage. You can get inexpensive tripods for about $10. Use one for each camera you plan on setting up. Shakiness is a common nuisance in filming, but you can limit it with the right tools. [15] X Research source You could also use a device like a handheld phone clamp or camera steadier. These devices will give you a little more freedom of movement. If you’re going to hold a camera while filming, practice! Make sure you’re able to hold it steady, even while moving it. Make sure you have permission to bring equipment into a venue. If you’re going to a concert venue as a fan, you are most likely going to have to hold your phone up the entire time."
    },
    {
      "title": "Secure a microphone to your camera for better sound quality.",
      "content": "Secure a microphone to your camera for better sound quality. Try using a wireless microphone so you don’t have to deal with an extra cord hanging from your camera. If you can, get a shotgun microphone. When you point it directly at the stage, it will pick up only the sound ahead of it. You could also use a cardioid microphone for a fuller recording, since it picks up noises to the left and right, including from the crowd. [16] X Research source If you’re using your phone, get a plug-in microphone for better sound quality. There are some versions that plug directly into a phone’s headphone jack. Some microphones require you to plug in a microphone adapter first. If you’re recording audio professionally, set up microphones close to the stage to make the ultimate recording! Try using 1 or 2 microphones near the stage, for instance."
    },
    {
      "title": "Record the concert with a steady hand and little movement.",
      "content": "Record the concert with a steady hand and little movement. It’s concert time and you’re all set up. Turn on your recorder, then keep it pointed at the stage. You usually won’t have to do much but keep it steady while preventing other people from getting in your way. If you’re using a camera on a mount, try moving the camera around to capture different angles, but make sure the footage doesn’t come out shaky. [17] X Research source When filming, you’re better off standing in one place away from the crowds rather than trying to move around. You may not find a good spot elsewhere. For audio recordings, try to keep your recorder above the crowd. If you’re close enough, getting the best possible quality won’t be a problem, but the sound can get muffled if you move around too much."
    }
  ]
}