{
  "url": "https://www.wikihow.com/Slim-Thick",
  "title": "What Is the \"Slim Thick\" Body Type?",
  "steps": [
    {
      "title": "It’s an exaggerated hourglass body type with a small waist & large hips.",
      "content": "It’s an exaggerated hourglass body type with a small waist & large hips. Someone who is slim thick is physically fit and toned, with larger hips, butt, and thighs and a small waist. Many on social media post pictures of the slim-thick body type—in some cases achieved by manipulating the image—with hashtags like #thick, #thicc, and #slimthick in a positive way. [1] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Slim thick was first used as a way to describe the exaggerated hourglass look. More recently, people have started using it as a weight loss or strength training goal. For example, to describe the look, you might say, “Kim K. and Nicki Minaj slay the slim-thick look.” To talk about your fitness goals, you might say something like, “I’ve been working on my glutes because I want to be slim thick.” Some feel the slim-thick body type is a cross between an hourglass and a pear body type because it focuses on hips, thighs, and buttocks that are larger than the bust."
    },
    {
      "title": "It was made popular by pop culture figures like Kim Kardashian.",
      "content": "It was made popular by pop culture figures like Kim Kardashian. However, the slim thick body type (also styled as “slim thicc”) was popular in hip-hop culture in the 1990s and early 2000s. [2] X Research source This may have been a backlash against the thin ideal in white culture that ultra-thin models like Kate Moss embodied. More recently, Kardashian, Kylie Jenner, Beyoncé, and Nicki Minaj have made a slim-thick body type popular in the wider culture. Many have accused Kardashian, Jenner, and Beyoncé of getting butt implants or other procedures, but they haven’t confirmed the rumors. Minaj has talked about getting “butt injections.” The song “Baby Got Back” by American rapper Sir Mix-a-Lot (released in 1992) celebrates Black women with small waists and large butts. The intro to the song also features 2 thin white women criticizing a Black woman’s body. This highlights how Eurocentric beauty standards often devalue Black women’s bodies. [3] X Research source"
    },
    {
      "title": "Eat a healthy diet that’s low-calorie, low-fat and high in protein.",
      "content": "Eat a healthy diet that’s low-calorie, low-fat and high in protein. While you may not be able to change your body shape, you may be able to make some changes to your overall body size through diet. [4] X Research source Focus on eating a balanced diet with 10-35% of your diet focused on healthy protein sources to help you build muscle. Ajani says, “Controlling your caloric intake is the number one way to lose weight. It is impossible to lose weight if you don't have that in place.” Figure out how much protein you need by multiplying your body weight in pounds by .35 (or multiplying your body weight in kg by .8) to get the number of grams of protein to eat daily. Healthy protein sources are soy, beans, nuts, fish, lean chicken and beef, and low-fat dairy. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source While eating a healthy diet is always a good idea, don’t feel you have to change your body type to be attractive. All body types are beautiful, so you can look great just by being you!"
    },
    {
      "title": "Alternate cardio with strength-training exercises that work your glutes.",
      "content": "Alternate cardio with strength-training exercises that work your glutes. Cardio workouts like running, swimming, cycling, rowing, and jumping rope at a moderate pace tend to burn the most calories per hour. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Choose strength training exercises that focus on working your hips , like side-lying hip abductions and side lunges. Strengthen your glute muscles (buttocks) with exercises like glute bridges and front squats . Ajani recommends planning out your workouts and putting them on your calendar so you know exactly what workout you have scheduled each day. Lower-intensity cardio workouts like dancing, walking, jogging, and climbing stairs are also great ways to stay healthy and build cardiovascular endurance. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Shoot for at least 150 minutes of moderate aerobic activity spread out over a few days each week.<refhttps://www.mayoclinic.org/healthy-lifestyle/fitness/basics/fitness-basics/hlv-20049447</ref> Ajani recommends adding a few upper-body exercises for a more balanced workout and to give your other muscles a little bit of a rest. Modified pushups and bench presses are great choices because they work several muscles at once. Start strength training exercises by doing one set of 8-10 repetitions twice a week. Add a few reps each week until you can do 3 sets of 10-15 reps. Try not to go too fast too soon with your cardio and strength-training workouts, or you may risk injuring yourself. Remember, being strong and healthy is the goal!"
    },
    {
      "title": "Use shapewear to accentuate your waist and lift your butt.",
      "content": "Use shapewear to accentuate your waist and lift your butt. Try waist trainers and corsets to smooth and emphasize your waistline. Wear butt-lifting shaper shorts and panties designed to help lift and enhance your buttocks. Shapewear has a reputation for being uncomfortable, so take your measurements and compare them to each company’s size chart to get the right size. Many people use shapewear to accentuate their natural body shape, but don’t feel you have to wear shapewear if you don’t want to."
    },
    {
      "title": "Consider surgical procedures like a butt lift or body contouring.",
      "content": "Consider surgical procedures like a butt lift or body contouring. For some, plastic surgery may be the only option to get the slim-thick look. Slimming down your waist may require liposuction or body contouring. To enhance your buttocks, try implants or a Brazilian butt lift (BBL). A BBL is when your plastic surgeon removes fat from one area of your body with liposuction and then uses it to reshape your butt. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source The average cost for liposuction is $4,711. [9] X Research source The cost of body contouring surgery varies widely depending on your surgeon’s experience, hospital fees, anesthesia, tests, and post-surgery garments. [10] X Research source The average cost of butt implants is $7,964, and a BBL is $7,264. However, costs can vary depending on location, hospital fees, special pillows for recovery, etc. [11] X Research source Health insurance plans may not cover all or any cosmetic procedures. Elective surgery and other cosmetic procedures can be very expensive and carry risks—including death—so make sure you do plenty of research before deciding to change your body this way. Remember, you don’t need plastic surgery to look great."
    },
    {
      "title": "This body type mostly comes from genetics and hormones.",
      "content": "This body type mostly comes from genetics and hormones. Getting a slim-thick body is mostly up to your genetics. If women in your family tend to have small waists and larger hips, thighs, and butts, you may be able to achieve a similar body type. Studies have found that body shape is determined by genetics. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Hormonal changes, like in puberty and perimenopause, can change the shape of your body. Higher estrogen in puberty often causes girls’ hips to widen and fat to accumulate on their busts, thighs, and buttocks. [13] X Research source Lower estrogen in menopause often causes weight gain, especially around the middle of their bodies, and muscle loss. [14] X Research source These both affect the ability to achieve a slim-thick body. It can be an unrealistic goal for some people that can only be achieved through plastic surgery."
    },
    {
      "title": "A high waist-to-hip ratio is linked to a higher risk for chronic disease.",
      "content": "A high waist-to-hip ratio is linked to a higher risk for chronic disease. While many think that higher BMIs are related to a higher risk of heart attack, research has shown the right is more likely tied to a higher waist-to-hip ratio. [15] X Research source Additionally, using a waist trainer or corset long-term to make your waist smaller can cause breathing and heart problems, digestive issues, and weakening of your internal organs. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source BBL procedures can be particularly dangerous with the risk of injury, a fat embolism, or death. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Butt implants can cause chronic pain and permanent scarring. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Focusing on getting exercise and eating a nutritious diet is the best way to stay healthy and prevent disease."
    },
    {
      "title": "Idealizing an unachievable body type can harm your self-image.",
      "content": "Idealizing an unachievable body type can harm your self-image. In fact, one study found that the current popularity of the slim-thick ideal on social media has made girls even less satisfied with their bodies than the waif thin-ideal of the 1990s. This can lead to eating disorders and a negative body image because a slim-thick body isn’t achievable for everyone. [19] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source While it might seem that the slim-thick would be better for a woman’s self-image because it’s a larger body type, that isn’t the case. Some feel the popularity of the slim-thick body type is a sign that beauty ideals are becoming more diverse. [20] X Research source"
    }
  ]
}