{
  "url": "https://www.wikihow.com/Ripen-Mangoes",
  "title": "How to Ripen Mangoes Fast (& Tell When They’re Ripe)",
  "steps": [
    {
      "title": "Ripen a mango in a paper bag or newspaper.",
      "content": "Ripen a mango in a paper bag or newspaper. Place the unripe mango in a paper bag or wrap it in newspaper. Then, leave it in the bag or wrapped up on the kitchen counter overnight. Check for ripeness in the morning. Mangoes wrapped in a paper bag release ethylene, which is an odorless gas that speeds up the ripening process. When wrapping mangoes in a paper bag or newspaper, be sure not to close the bag completely. Some air and gas must escape, or mold and mildew might start forming. Add an apple or banana to the bag to speed up the ripening process even more. Adding more ethylene-emitting fruits increases the ethylene in the bag, giving you an even juicier mango quicker."
    },
    {
      "title": "Submerge a mango in a bowl of uncooked rice or popcorn kernels.",
      "content": "Submerge a mango in a bowl of uncooked rice or popcorn kernels. This old wives trick hails from India, where industrious moms hid unripe mangoes in bags of uncooked rice to speed up the ripening. [1] X Research source In Mexico, the trick is much the same, but uses uncooked popcorn kernels are used instead of rice. This method usually helps mangoes ripen within a day or two. Rice or popcorn helps trap ethylene gas around the mango, resulting in a much faster ripening process. In fact, this method is so effective that you sometimes risk overripening. Check every 6 or 12 hours for doneness."
    },
    {
      "title": "Place a mango in the microwave for 10 seconds.",
      "content": "Place a mango in the microwave for 10 seconds. While this isn’t the best way to ripen an unripe mango, it can work in a pinch. Simply use a fork or knife to carefully poke holes in the mango. Then, wrap the fruit in a paper towel and put it in the microwave for 10 seconds. Check the mango for ripeness. If it’s not ready, microwave in 10-second intervals until it is. [2] X Research source The mango is ready to eat when it’s slightly soft to the touch."
    },
    {
      "title": "Set a mango on the kitchen counter at room temperature.",
      "content": "Set a mango on the kitchen counter at room temperature. For this method, you only need time and patience. Like other fruits, mangoes may take several days to ripen, but this is the most natural way to get your mango plump, juicy, and ready to eat. Use the mango when it is soft to the touch and has a strong fruity smell."
    },
    {
      "title": "Smell the mango for a strong fruity aroma.",
      "content": "Smell the mango for a strong fruity aroma. Sniff the stem end of the mango. If it has a heavy, fruity, almost musky odor, it’s ripe. If you're struggling to find an aroma, chances are your mango isn't quite there yet. [3] X Research source"
    },
    {
      "title": "Squeeze the mango to see if it’s soft.",
      "content": "Squeeze the mango to see if it’s soft. Professional chef Andrea Lawson Gray suggests checking the firmness of the mango to determine if it’s ripe. She says a ripe mango “should be soft but not mushy.” A ripe mango feels similar to a ripe peach or ripe avocado. If the mango feels firm, it is still unripe. [4] X Research source"
    },
    {
      "title": "A ripe mango doesn’t have a specific color.",
      "content": "A ripe mango doesn’t have a specific color. Although most ripe mangoes are rich reds and burnt yellows, it depends on the variety, so they’re not always red and yellow. So, forget the look of mangoes when determining ripeness. Instead, use smell and softness as your guide."
    },
    {
      "title": "Don't be scared away by a few black spots on the surface of the mango.",
      "content": "Don't be scared away by a few black spots on the surface of the mango. Some people may think that mangoes that have a few splotchy, black blemishes on them are bad. While mangoes are notoriously susceptible to spoilage, black blotches don't necessarily mean the mango is bad. In fact, it may mean the mango has more sugar content. If the black spots are especially soft, cut the mango open and look for translucent fruit. This is a sign of spoilage, and these mangoes should be thrown away."
    },
    {
      "title": "Place a whole mango in the refrigerator when it’s ripe.",
      "content": "Place a whole mango in the refrigerator when it’s ripe. No wrap or container is necessary to store an unopened mango in the refrigerator. Simply clean the mango and place it in the fridge. Keeping the mango in the refrigerator helps slow down the ripening speed, so it’ll stay ripe longer and spoil slower. Typically, a whole ripe mango can last in the refrigerator for around 5 to 7 days. [5] X Research source Don't store a mango in the refrigerator before it has ripened. Like with all tropical fruits, refrigeration can halt the ripening process. [6] X Research source"
    },
    {
      "title": "Peel and chop a ripe mango and store it in the fridge or freezer.",
      "content": "Peel and chop a ripe mango and store it in the fridge or freezer. Place a chopped, ripe mango into an airtight container. The cut fruit can last in the container in the refrigerator for a few days and in the freezer for as long as 6 months. [7] X Research source"
    }
  ]
}