{
  "url": "https://www.wikihow.com/Read-the-Periodic-Table",
  "title": "How to Read the Periodic Table",
  "steps": [
    {
      "title": "Read the periodic table from top left to bottom right.",
      "content": "Read the periodic table from top left to bottom right. The elements are ordered by their atomic numbers, which increase as you move across and down the periodic table. The atomic number is how many protons the element’s atom possesses. You’ll also notice that each element’s atomic mass increases as you move across the table. This means you can recognize a lot about an element’s weight by just looking at its place on the table. [1] X Research source The atomic mass increases as you move across or down the table because the mass is calculated by adding up the protons and neutrons in each element’s atom. The number of protons increases with each element, which means the weight goes up, as well. Electrons are not included in the atomic mass, as they contribute much less to the atom’s weight than protons and neutrons."
    },
    {
      "title": "Observe that each element contains 1 more proton than its predecessor.",
      "content": "Observe that each element contains 1 more proton than its predecessor. You can tell this by looking at the atomic number. Atomic numbers are ordered from left to right. Since the elements are also arranged by group, you will see gaps on the table. [2] X Research source For example, the first row contains Hydrogen, which has an atomic number of 1, and Helium, which has an atomic number of 2. However, they are at opposite ends of the table, as they are in different groups."
    },
    {
      "title": "Recognize groups, which share physical and chemical properties.",
      "content": "Recognize groups, which share physical and chemical properties. Groups, also known as families, fall in a vertical column. In most cases, groups will share the same color, as well. This helps you identify which elements have similar physical and chemical properties to each other, which allows you to predict how they’ll behave. [3] X Research source Each element in a particular group has the same number of electrons in its outer orbital. [4] X Research source Most elements fall into 1 group, but Hydrogen can be placed with the Halogen family or the Alkali Metals. On some charts, it will appear with both. In most cases, the columns will be numbered 1-18, either above or below the table. The numbers may be shown in Roman numerals (IA), Arabic numerals (1A), or numerals (1). When you go down a group from top to bottom, it’s called “reading down a group.”"
    },
    {
      "title": "Notice why gaps exist in the table.",
      "content": "Notice why gaps exist in the table. Although elements are ordered based on their atomic number, they’re also arranged into groups and families that share the same physical and chemical properties. This helps you better understand how each element behaves. Since elements don’t always fall neatly into groupings as they increase in number, the periodic table contains gaps. [5] X Research source For example, the first 3 rows have gaps, as the Transition Metals don’t appear on the table until atomic number 21. Similarly, elements 57 through 71, which are the Rare Earth Elements, are usually pictured as a subset at the bottom right of the table."
    },
    {
      "title": "Notice that each row is called a period.",
      "content": "Notice that each row is called a period. All of the elements in a period have the same number of atomic orbitals, which is where their electrons go. The number of orbitals will match the number of the period. There are 7 rows, meaning that there are 7 periods. [6] X Research source For example, the elements in the period 1 have 1 orbital, while the elements in period 7 have 7 orbitals. In most cases, they’re numbered 1-7 down the left hand side of the table. When you move across a row from left to right, it’s called “reading across a period.”"
    },
    {
      "title": "Distinguish between metals, semi-metals, and non-metals.",
      "content": "Distinguish between metals, semi-metals, and non-metals. You can better understand the properties of an element by recognizing what type of element it is. Fortunately, most periodic tables use color to indicate whether the element is a metal, semi-metal, or non-metal. You’ll notice that metals occur to the left of the table, while non-metals fall on the right. Semi-metals are sandwiched between them. [7] X Research source Keep in mind that hydrogen can be grouped with either the Halogens or the Alkali Metals because of its properties, so it may appear on either side of the table or may be colored differently. Elements are labeled as a metal if they have luster, are solid at room temperature, conduct heat and electricity, and are malleable and ductile. Elements are considered a non-metal if they lack luster, don’t conduct heat or electricity, and are non-malleable. These elements are usually gases at room temperature but may also become a solid or liquid at certain temperatures. Elements are labeled as semi-metals if they have a mixture of properties of both metals and non-metals. [8] X Research source"
    },
    {
      "title": "Recognize the element’s 1 to 2-letter symbol.",
      "content": "Recognize the element’s 1 to 2-letter symbol. It most often appears in the center of the box in a large font. The symbol abbreviates the element's name, which is standardized across different languages. When you're doing experiments or working with elemental equations, you'll likely use the elements' symbols, so it's important to familiarize yourself with them. [9] X Research source This symbol is usually derived from the Latin form of the element’s name, but it may be derived from the widely accepted common name, especially for newer elements. For example, the symbol for Helium is He, which closely resembles the common name. However, the symbol for Iron is Fe, which is harder to recognize at first."
    },
    {
      "title": "Look for the full name of the element, if it’s present.",
      "content": "Look for the full name of the element, if it’s present. This is the name of the element that you will use when writing it out. For example, “Helium” and “Carbon” are the names of elements. In most cases, this will appear just below the symbol, but its placement can vary. [10] X Research source Some periodic tables may omit the full name, using just the symbol."
    },
    {
      "title": "Find the atomic number.",
      "content": "Find the atomic number. The atomic number is often located at the top of the box, either in the center or the corner. However, it could be located under the element symbol or name. Atomic numbers run sequentially from 1-118. [11] X Research source The atomic number will be a whole number, not a decimal."
    },
    {
      "title": "Recognize the atomic number is the number of protons in an atom.",
      "content": "Recognize the atomic number is the number of protons in an atom. All of an element’s atoms contain the same number of protons. Unlike with electrons, an atom cannot gain or lose protons. Otherwise, the element would change! [12] X Research source You’ll use the atomic number to find the number of electrons and neutrons as well!"
    },
    {
      "title": "Know elements contain the same number of electrons as protons.",
      "content": "Know elements contain the same number of electrons as protons. There is an exception if they're ionized. Protons have a positive charge, and electrons have a negative charge. Since regular atoms don’t have an electrical charge, that means electrons and protons are equal. However, an atom can lose or gain electrons, which makes it ionized. [13] X Research source Ions are electrically charged. If an ion has more protons, it is positive, which is indicated with a positive sign next to the ion’s symbol. If it has more electrons, the ion is negative, which is indicated with a negative symbol. You will not see a plus or minus symbol if the element is not an ion."
    },
    {
      "title": "Find the atomic weight.",
      "content": "Find the atomic weight. The atomic weight usually appears at the bottom of the box, below the element symbol. The atomic weight represents the combined weight of the particles in the nucleus, which includes protons and neutrons. However, isotopes complicate the calculation, so the atomic weight represents an average of the atomic mass of the element and the atomic mass of its isotopes. [14] X Research source Because the weights are averaged, most elements will have atomic weights that include decimals. Although it may appear as though the atomic weight increases in number from top left to bottom right, this is not true in all cases."
    },
    {
      "title": "Determine the mass number of the element you’re studying.",
      "content": "Determine the mass number of the element you’re studying. You can find the mass number by rounding the atomic mass to the nearest whole number. This accounts for the fact that the atomic weight is an average of all possible atomic masses for that element, including isotopes. [15] X Research source For example, the atomic weight of Carbon is 12.011, which rounds to 12. Similarly, the weight of Iron is 55.847, which rounds to 56."
    },
    {
      "title": "Subtract the atomic number from the mass number to find the neutrons.",
      "content": "Subtract the atomic number from the mass number to find the neutrons. The mass number is calculated by adding together the number of protons and neutrons. This allows you to easily find the number of neutrons in an atom by subtracting the number or protons from the mass number! [16] X Research source Use this formula: Neutrons = Mass Number - Protons For example, Carbon’s mass number is 12, and it has 6 protons. Since 12 - 6 = 6, you know Carbon has 6 neutrons. For another example, Iron’s mass number is 56, and it has 26 protons. Since 56 - 26 = 30, you know Iron has 30 neutrons. An atom’s isotopes will contain a different number of neutrons, which changes the atom’s weight."
    }
  ]
}