{
  "url": "https://www.wikihow.com/Put-Money-in-Escrow",
  "title": "How to Put Money in Escrow",
  "steps": [
    {
      "title": "Find out if your lender requires an escrow account.",
      "content": "Find out if your lender requires an escrow account. Even if your lender doesn't require you to set up an escrow account, you may want to ask if you can have one anyway. [2] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source An escrow account means you can pay a little each month toward your property tax and homeowner's insurance premiums, both of which normally are paid in large lump sums each year. Making monthly payments toward these expenses can be easier to budget. Keep in mind that without an escrow account, you'll have to put back money to pay these large annual expenses yourself. Escrow accounts typically are required if you have a federally guaranteed loan, such as a VA or FHA loan, or if you have a conventional mortgage in which you've borrowed more than 80 percent of the value of the property. [3] X Research source"
    },
    {
      "title": "Gather information.",
      "content": "Gather information. Your lender may need information from you about your homeowner's insurance and your property tax. [4] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source [5] X Research source If your lender doesn't have the correct information, you may end up getting a bill stating that your lender has not paid your taxes or premiums on your behalf. It can be complicated to get your money out of the escrow account in this situation. Based on the information you provide, your lender will calculate the amount of money you need to deposit in the escrow account each month to cover insurance premiums and property tax. You should use the total annual payments owed for tax and insurance to calculate your own payments and double-check the calculations made by your lender. Keep in mind that some premiums are paid to cover you for a period of several years, so you'll have to divide that premium by the number of years of coverage to get the annual cost for that policy."
    },
    {
      "title": "Notify the appropriate parties.",
      "content": "Notify the appropriate parties. If your mortgage lender, as your escrow agent, is paying your homeowner's insurance premiums and your property tax for you, make sure the bills are sent to the right place and not to you. Keep in mind that even if your lender is paying these bills, they are ultimately your responsibility. You must make sure that the correct amount is being paid on time. [6] X Research source"
    },
    {
      "title": "Determine the minimum balance.",
      "content": "Determine the minimum balance. Your lender and the bank typically will require the escrow account to be established with a minimum balance which is maintained at all times. Federal law limits the amount of money your lender can require you to keep in your escrow account. In most cases, the minimum balance must be an amount equal to about two monthly payments. This reserve covers any possible increase in taxes or premiums."
    },
    {
      "title": "Arrange to make monthly deposits.",
      "content": "Arrange to make monthly deposits. Your monthly deposit will be approximately one-twelfth of the total of your state property taxes and your annual homeowner's insurance premium. [7] X Research source Typically you will simply make a single monthly payment to your mortgage lender. Part of that payment will go towards your mortgage principal and interest, while the rest goes into your escrow account to cover your property taxes and insurance premiums. Keep in mind that if you don't keep up with your escrow deposits, you may be charged penalties from your lender and ultimately could face foreclosure. If your property taxes aren't paid, the state could place a tax lien on your home. If your homeowner's insurance isn't paid, this could lead to foreclosure if your mortgage lender requires you to maintain insurance coverage – and most do. The lender also may buy a policy and add the premium amounts to your loan balance. These insurance policies, usually called either \"force-placed\" or \"lender-placed\" insurance, tend to cost more and offer you fewer benefits than if you chose your own policy and paid for it yourself."
    },
    {
      "title": "Check your account regularly.",
      "content": "Check your account regularly. Keep up to date on the status of your account by monitoring the balance and your deposits. [8] X Research source Typically you can go online between annual statements to monitor the transactions posted to your escrow account."
    },
    {
      "title": "Receive your annual account statement.",
      "content": "Receive your annual account statement. Your lender is required by federal law to send you an annual statement of the transactions posted to your escrow account. [9] X Research source [10] X Research source The statement typically includes a list of all deposits and payments made out of the account, as well as an analysis of the expected activity for the next year. Compare your statement to your initial statement or the previous statement and make sure they are in agreement."
    },
    {
      "title": "Review totals from the state and your insurance company.",
      "content": "Review totals from the state and your insurance company. You may want to double-check any statements you've received for property taxes or insurance premiums to make sure they match the amounts listed on your escrow account statement. Verify the due dates for your taxes and premiums, especially if the lender has noted a change in the due date. The due date for these expenses can affect the amount of your monthly deposit. If your insurance premiums have increased, you should contact your insurance company and find out why – especially if you haven't had any claims. You may want to switch to a different insurance company to save money. If your property taxes have increased, you should contact your local taxing authority and make sure the assessment is accurate and they have correctly valued your property."
    },
    {
      "title": "Take care of any shortage.",
      "content": "Take care of any shortage. If there is not enough money in your escrow account to pay your taxes and insurance premiums, you typically have the option either of paying a larger escrow payment each month or making a lump-sum deposit to cover the shortage. Your escrow payments also may go up to account for increases in property tax or premium rates. So even if you make a deposit to cover the shortage in full, you still may be responsible for a higher escrow payment each month to account for those changes."
    }
  ]
}