{
  "url": "https://www.wikihow.com/Prepare-Notes-for-Public-Speaking",
  "title": "How to Prepare Notes for Public Speaking",
  "steps": [
    {
      "title": "Write your speech.",
      "content": "Write your speech. Before you can create effective speech notes, you must make your speech as good as possible. Construct an opening that will captivate the audience. Organize the important details of your topic into paragraphs with transitions between each paragraph. Finish with a memorable closing statement. [1] X Research source This is a draft. Pay attention to word choice and sentence structure. Make it as good as possible, but remember that you'll be able to fix any mistakes before you make your notes. Get all of your ideas on paper. It doesn't matter if they're crazy, inspiring, or weird. You have a chance to perfect what doesn't work later on. [2] X Research source"
    },
    {
      "title": "Read the speech aloud.",
      "content": "Read the speech aloud. Sit down in a quiet place and read the speech to yourself. Notice any areas where you can make adjustments. Pay attention to the flow. Ideas in your speech need to follow a logical order and have supporting evidence. Locate any stumbling blocks and spots that don't transition well. [3] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source It's a good idea to time yourself while you do this. That way, you'll know when you need to cut down your speech's length. Learn transitional phrases to help your speech flow naturally."
    },
    {
      "title": "Edit the speech.",
      "content": "Edit the speech. Go back and correct the issues you found during reading. Rearrange the order of ideas so that the speech flows smoothly from beginning to end. Change out difficult or complicated words for simpler alternatives. Your speech should have an easy, pleasant rhythm for your audience. [4] X Research source Highlight things that worked from your first draft and areas that you want to keep that need to be reworded."
    },
    {
      "title": "Get help from people you trust.",
      "content": "Get help from people you trust. Read your speech aloud again. Friends and family members can listen and give you advice. This is a good way to test the sound of the speech as well as practice public speaking. Have them point out the parts you need to improve. Record your own speech and listen to the phrases and pacing. Listen for any awkward phrases and try to smooth them out in the next draft. If you know someone who's given a public speech before, ask them to listen. They will have more experience and will be less biased."
    },
    {
      "title": "Break down your speech into keywords.",
      "content": "Break down your speech into keywords. Once your speech feels polished, start translating it into notes. Go through your speech and pick out key phrases. You can use highlighters to mark them. Each keyword represents a new thought in your speech. These keywords will be included in your notes, so make sure they're memorable. [5] X Research source"
    },
    {
      "title": "Select one idea per note card.",
      "content": "Select one idea per note card. Your notes serve as an outline. Avoid writing out large chunks of your speech. Instead, choose the keywords you highlighted earlier. These keywords represent specific topics that come up in your speech. Limit yourself to one memorable keyword per notecard. [6] X Research source For example, you are speaking about the life of a politician. You can use the word “Military” to show yourself when it's time to talk about their military experience. Images can also help solidify the order of your speech. Visualize uniformed soldiers marching in unison and you won't forget you need to talk about military training. Write out the first words of your transition sentences to help keep yourself on track."
    },
    {
      "title": "Mark your notes with timing details.",
      "content": "Mark your notes with timing details. Some speeches have time limits. You can time out your speech so you know when you need to get to certain points. When your timing is off, you'll know you need to change your pace or eliminate some speaking points. Also include related reminders, such as directions to smile, breathe, or use a prop at certain points. For example, if you need to introduce your second idea at the three minute mark, write three minutes on the card containing that idea."
    },
    {
      "title": "Write the words legibly.",
      "content": "Write the words legibly. Clearly-written words are easy to read when you glance down at your notecards. That's why it's important to keep your notes uncluttered. Make the keywords large near the top of your notes. Keep plenty of white space around the words. The white space causes them to stand out, which makes them easier to read. [7] X Research source Write the words in a pen that's legible to you. Black or blue ink works best. If you have bad handwriting, you can type out your notes. Cut and glue them onto your notes or print them directly by using the “Size” option in the “Print Layout” tab."
    },
    {
      "title": "Include brief details under the keywords.",
      "content": "Include brief details under the keywords. Follow the keywords with the details you need to express in your speech. Create bullet points or numbering beneath the words. Shorten the details as much as you can. These words should also be as large and legible as you can make them. For example, write out “award” or “Purple Heart” to remind yourself to mention the awards someone earned in service."
    },
    {
      "title": "Write out information that needs to be exact.",
      "content": "Write out information that needs to be exact. This includes statistics, quotations, and name pronunciations. If they are important to your speech, they're worth writing out. You may need to write them on a separate notecard. This ensures they're legible, but make sure you indicate when you need to read them. For instance, write down “75% pass” if you need to inform your audience how many people pass a class."
    },
    {
      "title": "Color-code your notes with highlights.",
      "content": "Color-code your notes with highlights. Get a couple of different highlighting markers from a general store. Assign each color a purpose. For instance, green can be for main ideas. Pink can be for supporting examples. Yellow can be for examples. Orange can be for quotations or transitions. These colors are useful for keeping your thoughts in order. Customize the color code to whatever works best for you. This works best if you color code while you practice your speech, but it could be distracting or confusing by the time you give the speech."
    },
    {
      "title": "Number the notes.",
      "content": "Number the notes. Go back and get all your cards in their final order. In one of the corners, mark the cards or pages with the number order. The keyword that comes up first in your speech should be number one. Number the rest of the cards so that you'll be able to avoid mixing them up. You can also bind the cards together. Use a drill or hole punch on the upper left corner of the notes. Loop a string through them. They'll be easy to flip and can't be mixed up. However, make sure the flipping of the notecards is not distracting to the audience."
    },
    {
      "title": "Rehearse the full speech.",
      "content": "Rehearse the full speech. Go ahead and recite your speech until you remember all the important parts. You don't need to memorize every word of the speech. The crucial points you need to convey to the audience are what you should know by heart. Read the speech aloud, focusing on controlling your speech and movements so you sound natural. [8] X Research source Memorizing a speech word-for-word is unhelpful because the audience can tell that you're reciting a script. Only use memorization and scripted words if you're painting a picture with your words or you need to tell a joke with comedic timing."
    },
    {
      "title": "Practice the speech with your notes.",
      "content": "Practice the speech with your notes. Put aside your script and pick up your notes. Attempt to deliver your speech. This time, use your notes when you get stuck. Continue to adjust your speech patterns and movements to make them sound natural. [9] X Research source Because you are using a minimal outline, your speech will sound a little different every time. However, it'll also sound more natural."
    },
    {
      "title": "Master your speech.",
      "content": "Master your speech. Rehearse the speech until you know what to do and feel comfortable referring to your notes. You can ask your friends and family to listen again. They'll be impressed with how well you perform. You'll also feel more confident because you're prepared. [10] X Research source You can time yourself again while giving the speech so you know exactly how long it is rather than making a guess. It can show you when you're going off-script too much. Keep in mind when you give the speech, you're bound to talk faster and the speech will be shorter."
    }
  ]
}