{
  "url": "https://www.wikihow.com/Make-an-Origami-Turtle",
  "title": "How to Make an Origami Turtle",
  "steps": [
    {
      "title": "Use an 8 1/2 x 11 piece of paper.",
      "content": "Use an 8 1/2 x 11 piece of paper. For this method, you want to use A4 paper, which is standard printer paper. For this method, it’s best to use a piece of paper that is the same color on both sides."
    },
    {
      "title": "Fold your piece of paper in half.",
      "content": "Fold your piece of paper in half. Make a vertical valley fold. [1] X Research source Take the left side of your paper and fold it over to the right. Crease the edge of your fold with your finger. You will now have a rectangle that is taller than it is wide. Unfold your paper."
    },
    {
      "title": "Turn the paper over.",
      "content": "Turn the paper over. Flip your paper over so the crease is facing up in a mountain fold. [2] X Research source"
    },
    {
      "title": "Fold the top left and right corners to the center crease.",
      "content": "Fold the top left and right corners to the center crease. Bring the top corners in so the inner edge aligns with the crease. The outer edge of the folded portion should make a right angle along the crease. [3] X Research source Do your best to make sure both folds are even. You should have two triangle shapes which are folded on top of the rest of your paper. This is a similar fold to that of a paper airplane. Press down on the creases to keep your folds in place."
    },
    {
      "title": "Turn the paper over again.",
      "content": "Turn the paper over again. Flip your paper over so the original side is facing up. The two triangle folds you just performed should now be facing the table. The center crease should be a valley fold."
    },
    {
      "title": "Fold the left and right corners to the center.",
      "content": "Fold the left and right corners to the center. Locate the corners in the middle of your paper and fold each in. Align your folds to the center crease. Flip the bottom flaps up. [4] X Research source Once you fold the sides in, find the two flaps on the bottom side of your paper and flip each up. You should now have a diamond shape at the top of your paper."
    },
    {
      "title": "Tuck in the bottom left and right points.",
      "content": "Tuck in the bottom left and right points. Take the points at the bottom of your paper and tuck each in to make a straight bottom edge. Tuck each point so it’s even with the bottom edge of your paper. Tuck the points under the top layer of paper, but above the bottom layer."
    },
    {
      "title": "Fold the top point down in half.",
      "content": "Fold the top point down in half. Fold the top of your paper down in a valley fold, toward you. Fold the diamond shape in half on a horizontal valley fold. Bing the point down so it’s even with the tip of the small triangle area, toward the bottom of your paper."
    },
    {
      "title": "Fold the top layer back up in half, over itself.",
      "content": "Fold the top layer back up in half, over itself. Take the lower third of the portion you just folded down and make a valley fold. Fold the paper up in a valley fold away from you so the tip extends past the horizontal edge at the top. You will now have the shape of a five-pointed star. Crease your fold with your finger to keep it in place."
    },
    {
      "title": "Fold the left and right bottom corners towards the middle.",
      "content": "Fold the left and right bottom corners towards the middle. Take both bottom corners and fold each into the center crease. Fold each side so the inner edge is even with the center. The tips of your folds will extend higher than the bottom edge from the fold in the previous step. Lift the bottom edge up so the tips of your current fold lay flat."
    },
    {
      "title": "Fold the tips of each flap down.",
      "content": "Fold the tips of each flap down. Take the two flaps you just folded up and fold a portion down toward you in a valley fold. You want to fold about ⅔ of each flap down so a portion of paper on each side is extending beyond the rest of your paper. These folds will make the back legs of your origami turtle."
    },
    {
      "title": "Flip your paper over.",
      "content": "Flip your paper over. Flip your turtle over to see your finished product. [5] X Research source Fold your turtle along the center crease and then unfold. This will give your turtle a more three-dimensional look, with the shell more pronounced. If you didn't use green paper, you can color in your paper green to make it look like a turtle."
    },
    {
      "title": "Use a square piece of paper.",
      "content": "Use a square piece of paper. To fold this turtle, you will need to use a square piece of paper. If you don’t have origami, or square paper, you can use printer paper. Lay your paper on a flat surface horizontally. Fold the top left corner down so the top edge is even with the bottom edge. Cut or tear away the excess paper. When you fold the corner down and crease the edge, you will have a triangle shape and a rectangle shape. Remove the rectangle portion. Unfold your paper and you will have a square."
    },
    {
      "title": "Perform a horizontal valley fold.",
      "content": "Perform a horizontal valley fold. A valley fold is made when you fold a portion of paper so the crease points down, making your paper look like a valley. Fold the top ⅓ of your paper in a valley fold. Take the top third of your paper and fold it down to create a valley fold."
    },
    {
      "title": "Perform a horizontal mountain fold.",
      "content": "Perform a horizontal mountain fold. A mountain fold is made when you fold a portion of paper so the crease is pointing up, causing your paper to look like a mountain. Take the bottom ⅓ of your paper and fold it back to create a mountain fold. Take the bottom third of your paper and fold it back to the other side your paper. Fold the paper back so the crease lines up with the bottom edge of your valley fold. Unfold your paper."
    },
    {
      "title": "Make two more horizontal valley folds.",
      "content": "Make two more horizontal valley folds. You should currently have a Z-fold, meaning the folds of your paper look like a Z . Your paper should be unfolded and split into three sections by the creases. Perform two more valley folds on the top and bottom sections, Folding the top and bottom thirds in half. Unfold after you make your creases. You will now have a total of four creases."
    },
    {
      "title": "Make a vertical valley fold.",
      "content": "Make a vertical valley fold. Just like before, you’re going to make a valley fold, this time vertically on the left ⅓ of your paper. Once you have folded, crease with your finger and unfold."
    },
    {
      "title": "Make a vertical mountain fold.",
      "content": "Make a vertical mountain fold. On the right ⅓ of your paper, make a mountain fold, folding the paper back. The vertical and mountain folds will culminate in another Z-fold."
    },
    {
      "title": "Make two more vertical valley folds.",
      "content": "Make two more vertical valley folds. Just like before, folding the outer thirds of your paper in half, make the valley folds. You will now have four vertical creases and four horizontal creases. Unfold your paper so it’s flat."
    },
    {
      "title": "Make two diagonal valley folds.",
      "content": "Make two diagonal valley folds. Take one corner of your paper and fold it over on a diagonal in a valley fold. Crease the paper, then unfold. With your paper unfolded, repeat the fold on the other side so you create an X shaped crease. [6] X Research source When you fold in a diagonal valley fold, you will have a triangle shape before unfolding."
    },
    {
      "title": "Perform four mountain folds.",
      "content": "Perform four mountain folds. This part can be a little tricky so take it one fold at a time. Flip your paper over so the opposite side is facing up. Locate the two rectangular areas in the top center of your paper. You will see two rectangles, one on top of the other formed by your earlier folds. Take the top left corner of your paper and fold it down to the right. Align the right edge to the first vertical crease on the right half of your paper. Crease only the top third of your paper. Repeat this fold, taking the top right corner and aligning it the left edge of the first crease on the left third. Repeat these folds with the bottom portion of your paper. Make a crease by pressing with your finger, then unfold so you have a square again. Flip your paper over so the original side is facing up. If done correctly, you will see two X shaped mountain folds on the top and bottom of your paper."
    },
    {
      "title": "Start applying your crease patterns.",
      "content": "Start applying your crease patterns. You will now have several creases, some which are valley creases, and some mountain. Work your way around your paper to make the crease patterns more prominent. [7] X Research source Create all the valley crease patterns by taking the outside valley folds and folding inward. You should fold an outer square pattern that creates a picture frame look. Inside your picture frame you will see a square with an X Shaped crease. Then unfold."
    },
    {
      "title": "Crease the valley folds on the corners to begin the arms and legs of your turtle.",
      "content": "Crease the valley folds on the corners to begin the arms and legs of your turtle. Each corner will look like a square due to your crease patterns. Crease the diagonal valley fold on each. Your paper should look like a square bowl with four pointed corners."
    },
    {
      "title": "Apply the crease patterns to your mountain folds.",
      "content": "Apply the crease patterns to your mountain folds. Keeping your valley fold crease patterns intact, go around creasing all your mountain folds. The square area in the center should look like the shell of your turtle. You may have to make small creases to individual sections and play with your paper to get the look right."
    },
    {
      "title": "Make two valley folds to flatten your paper.",
      "content": "Make two valley folds to flatten your paper. You should have a square section in the center of your paper that is created by two vertical mountain folds. Above and below that square are the two areas where you made the small X folds over the rectangles. Fold the top and bottom of your center square inward in a valley fold. Your paper should flatten with the center point of the X folds forming the tips of two triangles facing each other. [8] X Research source Follow the patterns of your creases as best you can. The creases will help you in folding your paper on top of itself. Press down and crease your edges. When you fold the paper, you want to flatten it on itself."
    },
    {
      "title": "Fold both triangles up.",
      "content": "Fold both triangles up. After you’ve flattened your paper and creased, make two more valley folds, flipping your triangles up. Keep your paper flat. You will have a square section in the center, which forms the shell. Above and below, you will have two triangles pointing away from one another."
    },
    {
      "title": "Fold the top portion of your turtle down in a valley fold.",
      "content": "Fold the top portion of your turtle down in a valley fold. Fold the triangle portion you just folded up, along with the legs of the turtle, back down in a valley fold and crease. Then unfold. Instead of folding just the triangle portion, you want to grab the portion of paper underneath and fold it as well."
    },
    {
      "title": "Fold the top portion of your turtle in a mountain fold.",
      "content": "Fold the top portion of your turtle in a mountain fold. Just below where you made your valley fold, make a mountain fold. Fold the head (triangle) and legs down, away from you, to create a three-dimensional aspect. Your mountain fold should be about 1 centimetre (0.39 in) below your valley fold."
    },
    {
      "title": "Rotate your paper 180-degrees.",
      "content": "Rotate your paper 180-degrees. Now repeat the valley and mountain folds you just made for the tail and legs. When completed, you should have two equal parts to your turtle."
    },
    {
      "title": "Flip your paper over.",
      "content": "Flip your paper over. Turn your paper over so the opposite side is facing you. Fold the arms down in a valley fold, keeping the triangle portion up. When you flip your paper over, you should see a vertical strip where the sides of your paper meet. Fold only the top rectangular arms down. Leave the legs as is."
    },
    {
      "title": "Make two vertical valley folds.",
      "content": "Make two vertical valley folds. Fold the outer ⅓ of your paper inward on either side. You’ll have to flatten the paper here. When you flatten your paper, leave the bottom layer of paper unfolded. This will separate the shell from the arms. When completed you should have two flaps overlaid on top of your paper."
    },
    {
      "title": "Fold these flaps up in diagonal valley folds.",
      "content": "Fold these flaps up in diagonal valley folds. Take the two flaps you just folded and fold each one upward to create two arms at a 45-degree angle on either side of the head. Press down on your creases to keep the front legs in place."
    },
    {
      "title": "Fold the back legs up.",
      "content": "Fold the back legs up. Fold the paper up on a diagonal valley fold to create the back legs. Fold the paper up so the inside edges meet up with the horizontal crease that makes up the bottom of the shell. Press down with your finger to crease."
    },
    {
      "title": "Fold the tail up.",
      "content": "Fold the tail up. fold up the bottom triangle, which is the tail, making a valley fold. Bring the tip of the triangle up to fit in the space between the legs. Then fold the tip back in a mountain fold over your previous valley fold. You want to make the tip stick out slightly from under the shell. When you flip your turtle back over you will see a tiny triangle that forms a small tail."
    }
  ]
}