{
  "url": "https://www.wikihow.com/Make-a-Trench",
  "title": "How to Make a Trench",
  "steps": [
    {
      "title": "Call a utility location service.",
      "content": "Call a utility location service. The service will locate any buried power lines, pipes, and other underground utilities. It is vital to wait for this before starting any digging, to avoid serious injury or property damage. In the U.S. and Canada, you can call the toll-free \"Digline\" number at 811."
    },
    {
      "title": "Determine the trench dimensions and purpose.",
      "content": "Determine the trench dimensions and purpose. Knowing the depth, width, and length of your trench will help you save effort and keep your trench the shape you desire. It may help you to mark widths, lengths and route of your trench using stakes and string. If available, you can use sandbags or other markers to outline the path of your trench. If you are digging a trench for electrical utilities or pipelines, dig at least 2.5 feet (0.8 m) deep in order to protect the pipes from frost, but no deeper than 4 feet. [1] X Research source The width of your trench will depend on your pipes, but will likely be narrow. If you are digging a trench for a sprinkler system, dig 9-12 inches deep and about 5 inches wide, depending on your sprinkler system. [2] X Research source"
    },
    {
      "title": "Purchase supplies.",
      "content": "Purchase supplies. You’ll need a D-handle sharp shooter shovel and a trenching or clean-out shovel. These can be purchased at any hardware or gardening store. For clearing roots, pruning shear or a Pulaski digging tool can help you quickly remove this obstruction. Wearing gloves will protect your hand from blisters and splinters, and comfortable work boots will provide foot protection and traction."
    },
    {
      "title": "Avoid obstructions.",
      "content": "Avoid obstructions. Be careful when you dig around trees or other pipes. Roots can add a significant time to your excavation, and a ruptured gas line will require you to call your gas provider immediately. Severed utility lines could also leave you without power until your electric company can fix the problem. If you're digging near trees, make sure that your trench will not invade the tree’s protected root zone (usually the part of the roots that lie directly below its branches). If you're digging near pipes, try to determine where any other pipes may be. New pipes should be at least 1.5 feet (0.5 m) away from another."
    },
    {
      "title": "Break up the dirt.",
      "content": "Break up the dirt. Use the D-handle shovel to loosen the dirt along both sides of the soon-to-be trench. This will make it easier to dig out the dirt in the middle while physically establishing your dig line alongside the guideline you laid. [3] X Research source Cut both sides of the hole with your shovel, break up the topsoil, and then work both sides of your trench until you have loosened enough soil to merit clearing."
    },
    {
      "title": "Dig out the trench middle.",
      "content": "Dig out the trench middle. Once you have accumulated enough loose soil, use the trenching shovel to remove it out of your way. This may be a pile off to the side, or it may be a location you choose prior specifically for backfill."
    },
    {
      "title": "Continue loosening and clearing the soil.",
      "content": "Continue loosening and clearing the soil. Depending on the depth and length of your trench, this could take a considerable amount of time and effort. Use your D-handle shovel to break up the soil and the trench shovel to clean it out until your trench is the desired length and depth. [4] X Research source If you run into roots, try to sever them with the pointed end of your shovel. If that doesn't work, you may need a Pulaski digging tool. [5] X Research source Pruning shears are another good option, if your shovel fails and you do not have a Pulaski digging tool on hand."
    },
    {
      "title": "Take safety measures with deep trenches.",
      "content": "Take safety measures with deep trenches. An unsupported trench can be extremely dangerous, as collapsing soil can kill someone standing in the trench. Any trench 3 feet (0.91 m) (0.9m) deep, and some shallower trenches in soft soil, should be supported by side walls (such as timber posts and panels) before digging any deeper. You can increase safety by \"benching\" (digging in tiered levels), or by digging the walls at a slope instead of vertically. Some experts will dig unsupported trenches up to 5 ft (1.5 m) in stable soil conditions. [6] X Trustworthy Source US Occupational Safety and Health Administration U.S. government agency responsible for setting and enforcing workplace safety standards Go to source However, follow the 3 ft (0.9 m) rule if you do not have expert supervision."
    },
    {
      "title": "Prepare to excavate.",
      "content": "Prepare to excavate. Garden trenches are smaller in nature, usually intended to border flower beds keeping overgrowth and crowding of your flowerbeds to a minimum. Even if your trench is shallow or only a spade deep, it can unearth unexpected and unwanted surprises. You should make sure the place you are digging is free of utility lines, pipes, roots, foundation, or other obstructions. Call 811 or another utility location service before you begin. To sever roots up to 1 ⁄ 2 in (1.3 cm) thick, place the blade of your shovel on the root and stomp on the flange of the blade to sever it. For larger roots, consider purchasing a Pulaski digging tool. While mechanical trenching devices will usually sever roots, they may react violently or unpredictably when they encounter a thick one. Consider removing roots by hand before using a machine."
    },
    {
      "title": "Clear debris and trim weeds and grass.",
      "content": "Clear debris and trim weeds and grass. A thicket of weeds can put a halt to digging quick, causing tangles with your shovel that will take time to cut through. Trimming lawn or plants as low reasonably possible"
    },
    {
      "title": "Mark your trench.",
      "content": "Mark your trench. Do this as you would for any other trenching or excavation project, using highly visible marking paint to establish the layout of your trench. This will help prevent you from making mistakes and wasting unnecessary effort."
    },
    {
      "title": "Loosen soil with your spade on one side.",
      "content": "Loosen soil with your spade on one side. Stepping on your spade to drive it through the dirt at about a 45 degree angle, insert your spade about 6 inches into the soil approximately 2 inches out from your guideline. [7] X Research source Angle your spade, so that your trench walls are slightly angled and the bottom outside edge of your trench sits beneath your guideline. [8] X Research source"
    },
    {
      "title": "Apply your spade to the opposite side.",
      "content": "Apply your spade to the opposite side. You should use the same angle you did previously to leave the outside bottom of your trench directly under your guideline and your trench walls slightly angled. Wiggle your spade back and forth to further loosen the soil, and remove what you can, switching to your clear-out shovel when convenient. [9] X Research source"
    },
    {
      "title": "Pack trench walls, install edging, and maintain.",
      "content": "Pack trench walls, install edging, and maintain. Using a trowel, you can pack soil along the trench walls to prevent collapse. With shears you can trim grass to more cleanly define the boundary of your trench, or you can lay plastic edging to minimize maintenance effort on your part. Debris like leaves and intrusions like growing plant matter might leave your trench looking less than tidy. Take time in spring and summer to keep it maintained. Plastic edging generally installs easily. Either lay it in the space you've excavated or place it in your trench with some light fill on top to keep it in place."
    },
    {
      "title": "Evaluate your abilities.",
      "content": "Evaluate your abilities. Only an experienced operator should attempt to dig a trench with a machine. These machines are very physically demanding, and can be extremely dangerous for an unskilled user. All ordinary trench safety precautions apply as well. This includes calling 811 or another utility location service before you begin, and having plans to shore up the trench walls if necessary."
    },
    {
      "title": "Consider the machine you will need.",
      "content": "Consider the machine you will need. Choosing a machine will depend on your budget and the size of the desired trench. Plotting the route of your trench with highly visible marking paint and thinking about the depth of your trench will help you determine the best trencher for your job. Most projects will only require a walk-behind trencher. Walk-behind trenchers can dig up to 3 feet deep and between 4-6 inches wide [10] X Research source On average, a ride-on trencher can dig up to 7 feet (2.1 m) deep and about 13 inches wide. Ride-on trenchers are usually only rented to professionals. Consider contracting a landscape company or a utility installation company to use this tool on your behalf."
    },
    {
      "title": "Decide to buy or rent the machine.",
      "content": "Decide to buy or rent the machine. Most hardware stores will allow you the option of renting a machine for a few hours, a day, or even a week. Unless you have considerable trenching to do, or unless you have future projects requiring a trencher, renting is probably the best option for your project. Trenchers usually cost anywhere from $70 to $200 to rent for a day or two, plus the cost of transport. [11] X Research source You may also find a more affordable trencher through online services, like Craig's List or eBay."
    },
    {
      "title": "Take safety precautions.",
      "content": "Take safety precautions. If you decide to operate a trencher, you might consider taking a free trench safety class. The main points you want to keep in mind are the stability of your trench, your footing, and the consistency of the soil, which will influence the effort you and your trenching machine will have to exert. Rocky soil or roots can cause stones or grit to become airborne, so it is recommended you wear safety glasses while operating your trencher. [12] X Research source There is also considerable danger from the rotating digging chain, and from the risk of the heavy, powerful machine getting away from you."
    },
    {
      "title": "Learn to properly operate the machine.",
      "content": "Learn to properly operate the machine. Each machine will be different, but most will have an ignition switch, a choke, and an engagement lever, which you will manipulate to control the trencher. [13] X Research source Due to variations in make and model, it is safest to familiarize yourself with operation manuals before use. If you rented a trencher, be sure to ask for a demonstration of the machine's operation, including a check that all safety and shut off switches are working properly. You should also have access to a copy of the manual, although you may be able to find this online by searching for the make and model information."
    },
    {
      "title": "Do not run the machine with people nearby.",
      "content": "Do not run the machine with people nearby. Be sure to keep all other people and pets far away while the machine is running. During operation, if you need to clear debris from a stuck chain or trench, or leave the machine for any reason, always shut off the machine completely. Never leave the machine running while you are not operating it. Even if the chain is disengaged, the machine can cause severe injury or death."
    },
    {
      "title": "Position and prime your machine.",
      "content": "Position and prime your machine. You'll want to double check that your path is clear, but now that you're aware of the basic functions of your trencher, turn on the ignition, pull out the choke, and position the digging chain where you want your trench to begin."
    },
    {
      "title": "Engage your machine and trench.",
      "content": "Engage your machine and trench. Pull the engagement lever/switch (depending on model) and walk slowly backward along the trench path you have plotted. As operating this machine requires you to walk backward, be careful not to trip and hurt yourself or do damage to your trenching machine. Large roots or stones might have to be cleared by hand. If your trencher stops for an unknown reason, turn the machine fully off, remove it from your trench, and clear any obstructions with a hand tool."
    }
  ]
}