{
  "url": "https://www.wikihow.com/More-than-a-Friendship",
  "title": "Is Your Friendship Turning Romantic? 6 Ways to Tell",
  "steps": [
    {
      "title": "You act differently around each other.",
      "content": "You act differently around each other. Does it seem like there's awkwardness that didn't exist before? Do you feel more or less physically affectionate? Any significant departure from normal could signal that the vibe between the two of you is changing and things are no longer strictly platonic. Because the two of you are seeing each other in a different way, it's almost as though you don't know each other or you're seeing each other for the first time. [1] X Research source For example, you might find that you feel compelled to ask your friend if you can get a glass of water when you're over at their place when normally you would just go get it without saying anything. You might also notice that the two of you seem to be paying more attention to your appearances when you're going to be hanging out together, or that you suddenly feel the urge to clean up your place a little if you know they're coming over later."
    },
    {
      "title": "Your body language becomes more intimate.",
      "content": "Your body language becomes more intimate. The two of you stand a little bit closer, lean in a little bit more, maybe even look for excuses to brush up against each other. If you're perpetually glued to each other's sides, that could be a sign that your relationship is evolving into something beyond friendship. [2] X Research source Are you thinking it might be just you? Try pulling away just a little or shifting your weight and see if your friend does the same to stay close—that could indicate the feeling is mutual. Kaplan emphasizes that \"what keeps people out of the friend zone is good body language. That means eye contact [and] facing... your legs and your feet towards the person you're speaking to.\""
    },
    {
      "title": "You want to get to know each other as whole people.",
      "content": "You want to get to know each other as whole people. When you're just friends, you typically only focus on the things the two of you have in common when you hang out together. But if your relationship is starting to deepen and evolve, you might suddenly find that you're interested in the other things your friend is into that don't involve you. This is because if things are starting to feel more like love, you want to get to know all of your friend. [3] X Research source The two of you might also start looking for new ways to help each other out and be really attentive to each other's wellbeing. If you're inclined to put your friend's needs ahead of your own, that's a sure sign that your friendship is moving into romantic territory."
    },
    {
      "title": "You dig deeper into each other's personal history.",
      "content": "You dig deeper into each other's personal history. As friends, you might have taken a more superficial approach to each other's lives. But if you're starting to look at each other with romantic interest, you'll want to delve into what makes each other tick. You'll want to know not just things about each other, but how those things affect your lives. [4] X Research source For example, your friend might start asking you to tell them more about how your mental illness affects your day-to-day life even though they've known about your diagnosis for years. Kaplan notes that this emotional vulnerability is something that \"really separates friends from romantic partners.\" She advises \"actually trying to kind of be vulnerable and confide in that person just a little bit without oversharing.\""
    },
    {
      "title": "You flirt with each other.",
      "content": "You flirt with each other. If you've been platonic friends for a while, chances are the two of you probably don't flirt with each other the way you would with a potential love interest. Has that suddenly changed? Are you suddenly sending each other a lot of winking emojis or tossing each other flirty off-hand compliments? It's likely that your relationship is evolving into something more than a friendship. [5] X Research source Jay notes that a little can go a long way: \"[G]iving them compliments here and there can be more than enough for them to know that you're interested in them.\" Flirting presents a great opportunity to test the waters and see if your friend can sense this change that's happening too. For example, you might say, \"Are we flirting with each other now? Really?\" Unsure if they're flirting or still being friendly? See what other wikiHow users have to say about telling the difference at the wikiHow forum post, \"How do you tell if someone's being flirty or friendly?\""
    },
    {
      "title": "Things just feel different in an indefinable way.",
      "content": "Things just feel different in an indefinable way. This is something somewhat elusive that it can be hard to put your finger on, but maybe you just feel like there's a little bit of a spark in the air—the air is a little electric whenever the two of you are together. Things seem just a little lighter and more magical. [6] X Research source You can also feel this in little moments. For example, you might hold eye contact for just a split second longer than normal and feel the flutter of butterflies in your stomach."
    },
    {
      "title": "Evaluate your needs and what you want in a relationship.",
      "content": "Evaluate your needs and what you want in a relationship. Are you interested in pursuing a committed romantic relationship with your friend or would you rather keep things more casual? There's not just one way to have a relationship—the two of you have the freedom to choose the dynamic that works best for you based on your needs. Here are some general types: A queerplatonic relationship might appeal if either you or your friend is on the asexual or aromantic spectrum. A situationship has the emotional connection of a traditional committed relationship without the same level of commitment. A friends with benefits relationship might evolve if you're sexually attracted to your friend but not interested in building a committed romantic relationship. Reader Poll: We asked 559 wikiHow readers, and 52% of them agreed that the most important thing to consider before hooking up with a friend is whether hooking up would damage your friendship . [Take Poll]"
    },
    {
      "title": "Choose a calm, private place to have a conversation.",
      "content": "Choose a calm, private place to have a conversation. A quiet setting allows you and your friend to focus on each other without distractions so that you can hear and understand each other. It also signals to your friend that you care about them and respect them. [7] X Research source Make sure there's enough privacy that both you and your friend will feel at ease talking about your deepest thoughts and feelings. It's hard to be open if you're worried that you might be overheard."
    },
    {
      "title": "Tell your friend about your thoughts or feelings.",
      "content": "Tell your friend about your thoughts or feelings. Opening up the conversation can be as simple as saying something like, \"I think things have felt a little different between us lately.\" If they ask how, tell them about the things you've noticed them doing. If you're the one with the feelings, you might tell them things that you've noticed lately about them and how you feel about them. [8] X Research source Stick with your direct observations and statements about your own feelings. Then, give your friend the chance to do the same thing without making any assumptions. Jay agrees that \"the best approach is being direct\" about your feelings. Emphasize that the friendship is very important to you and that you don't want to do anything that might jeopardize that."
    },
    {
      "title": "Listen to what your friend has to say.",
      "content": "Listen to what your friend has to say. While your friend is talking, give them your full attention. Make appropriate eye contact and listen actively to show your friend that you care about how they feel and what they have to say. [9] X Research source When your friend pauses, repeat back a paraphrase of your understanding of what they said. This helps you process what they said and also gives them the opportunity to correct any misunderstandings. If there's anything your friend says that you don't understand, ask open-ended questions to try to get to the heart of it. It might be that all you get from your friend is denial. Despite that all signs point to them having a romantic interest in you, they might claim they don't notice anything different. If that happens, just let it go. They might have feelings they're not ready to deal with yet."
    },
    {
      "title": "Decide together how you want to handle the situation.",
      "content": "Decide together how you want to handle the situation. Take a look at everything—your needs and wants, your friend's needs and wants, and how those fit together in the context of your relationship. Is your relationship going to change, and if so, how? Are you going to see each other more or less often? These are things the two of you can work out together. [10] X Research source If either you or your friend (or both of you!) are asexual or aromantic, this relationship could provide you with a very safe space to explore different relationship dynamics and find something that best suits each of your lives. If you decide for whatever reason that you're not interested in pursuing a potential romantic relationship, that's fine! You and your friend need to do what's best for each of you as well as for your friendship. Jay advises to be clear about what you want, \"just saying you like the friendship and you want to keep it in the friend zone and thanks but no thanks.\" Don't get caught in the trap of thinking that friendship is somehow less than a romantic relationship—your relationship with each other is your own and you have the opportunity to develop and define it in the way that works best for the two of you."
    },
    {
      "title": "Maintain open communication about the situation.",
      "content": "Maintain open communication about the situation. When your friendship feels like a bit of a gray area, it can be hard to figure out what's okay and what's not okay—sometimes on a daily basis. Try to create rules that you can apply to other situations so you can ultimately build something like a set of boundaries for the relationship. [11] X Research source For example, you might feel weird going out on a date with someone else since you started sleeping with your friend, but the two of you haven't had that DTR (define the relationship) talk yet. Just ask how they'd feel if you went out on the date. It's also possible that your friend is just fine with you dating other people as long as it's not anybody they know. Kaplan notes that \"ultimately, we tend to live in a world where we think people can read our minds but, ultimately, sometimes it's as simple as really just sharing with them what you're feeling and then they can kind of follow suit.\""
    },
    {
      "title": "Manage your own emotions.",
      "content": "Manage your own emotions. Your feelings can flip-flop all over the place when you're in an undefined relationship. One minute you're on cloud nine, the next you're sure that they hate you and don't even want to be friends with you anymore. Having good calming strategies and coping mechanisms to control these sorts of emotions will make the situation easier to deal with. [12] X Research source If you find yourself getting heated when you're with your friend, take a break for a minute before you resume the conversation. Step outside or into a different room and take a few deep breaths. Undefined relationships involve a lot of uncertainty and uncertainty causes anxiety in a lot of people. It's totally normal for you to feel insecure or stressed out about the situation."
    },
    {
      "title": "Set strong boundaries to protect yourself.",
      "content": "Set strong boundaries to protect yourself. It's totally possible to maintain a sort of undefined relationship with your friend if that's what it ends up being. Just be very honest with yourself about what makes you uncomfortable or sad and let your friend know. [13] X Research source For example, if it makes your heart skip a beat when they hug you but they've made it clear they don't want to be anything other than friends with you, you might ask them not to hug you for the time being. These boundaries keep you from continuing to get hurt so that you can continue to be friends while the unrequited feelings fizzle."
    },
    {
      "title": "Take things slowly and progress intentionally.",
      "content": "Take things slowly and progress intentionally. Because you were originally friends, you're already really familiar with each other and know each other really well. This means you run the risk of rushing into a different kind of relationship too quickly, which can cause all sorts of problems. Make a pact with your friend to take things slowly and deliberately and keep up an open conversation about your relationship transition. [14] X Research source Studies show people tend to be more satisfied with their romantic relationships when they consider their partner a close friend, so you're well on your way to building a solid foundation for a strong, healthy relationship."
    },
    {
      "title": "Make a conscious effort to date each other.",
      "content": "Make a conscious effort to date each other. If love is in the air, the two of you deserve to go through that new-relationship stage. Try specially-planned date nights to help you stir up that romance and feel tingly in all the right ways. [15] X Research source If you've been friends for a while, you're likely already pretty casual and comfortable around each other. You might want to step it up a notch, similarly to how you would dress and act around someone you'd been dating for a few weeks. It can be easy to slip back into \"friend mode,\" so make it a habit to constantly remind yourself of your new relationship status. Kaplan notes that \"experiences are a lot better for bonding than actual gifts. And so, a great thing to do is surprise them with tickets to something that you can experience together.\""
    },
    {
      "title": "Embrace the freedom that comes with a lack of commitment.",
      "content": "Embrace the freedom that comes with a lack of commitment. You love your friend and you love having them in your life—and they're not going anywhere! If you think about it, it's almost like you get to have your cake and eat it too. You can spend time with your favorite person while still flirting or going out with others. [16] X Research source If you and your friend have been physical with each other, make sure they know when you're physical with anyone else and whether you used protection. This openness shows that you care about them and their safety."
    },
    {
      "title": "Respect your friend's boundaries.",
      "content": "Respect your friend's boundaries. If you're making your friendship your top priority, you don't want to do anything that's going to make your friend feel upset or uncomfortable. Ask your friend to tell you if you do something that they're not okay with so that you can correct your behavior. [17] X Research source Remember that even if you don't share all of the same feelings, you're still friends! That means they still really love you and care about you—even if it's not in all the same ways. Your friend also might not be ready to deal with their emotions or handle a change in your relationship—and that's okay too. Have patience and show them that you love them and no matter what happens your relationship will be great."
    },
    {
      "title": "Put your friendship over everything else.",
      "content": "Put your friendship over everything else. Think of these romantic feelings as something that will only add to your relationship, not take away from it or destroy it. If you ever start to feel as though the romance is threatening your friendship, it's usually best to put the romance to the side—at least for now. [18] X Research source Stay alert to changes in each other's behavior as well as your own. If things start getting weird or uncomfortable, bring it up before it becomes too big of a deal. This might also mean that you decide to wait a while before you go public with the change in your relationship status. Take all the time you need for the two of you to be comfortable telling everyone you know."
    },
    {
      "title": "Keep the lines of communication open.",
      "content": "Keep the lines of communication open. When your relationship is transitioning to a different dynamic, you're both in a very vulnerable place. Be open and honest with each other and reach out to your partner the second anything starts to feel even a little off. If you can address a potential issue before it becomes a big deal, you can help the transition go a lot more smoothly. [19] X Research source You might want to schedule weekly relationship check-ins with your partner, at least for the first month or so while your relationship is transitioning. Having a scheduled check-in takes the pressure off of either of you to bring up a potentially sensitive subject. Make an effort to constantly reinforce the love and care you feel for your partner so that they always feel safe with you, even when they need to say something critical."
    }
  ]
}