{
  "url": "https://www.wikihow.com/Organize-Craft-Supplies",
  "title": "How to Organize Craft Supplies",
  "steps": [
    {
      "title": "Start with the stuff that’s in your way.",
      "content": "Start with the stuff that’s in your way. If something is basically already organized or put away, don’t pull it out now. Go a bit at a time, especially if you have a lot of stuff. Spend fifteen minutes sorting, or just sort one bag, bin, or area."
    },
    {
      "title": "Toss things you don’t need.",
      "content": "Toss things you don’t need. It can be hard to admit that a particular activity might have been a passing phase that you've outgrown, or that an unfinished project ought to remain so, but if you can reduce the amount of stuff, you'll have less of it to organize and to have to cram in somewhere. Go for the easy stuff first, to help yourself build momentum. Toss anything that's obvious: hopelessly tiny scraps, mostly empty packages, dried-up paints. Remember, you decide what's worth keeping. At the same time, organizing only goes so far if there's too much stuff. Be choosy about what you bring home from the craft store. Do you have a project in mind for this item? Do you have a place to put it? Do you really find it attractive or promising? Can you do the project? Anytime soon? Be realistic, and you'll save money, space, and time."
    },
    {
      "title": "Divide your supplies into smaller groups.",
      "content": "Divide your supplies into smaller groups. Sort by item type. Put glue sticks, bottles, and jars into one pile. Put decorative stickers into a different pile. Put fancy paper into a pile of its own. Better yet, sort by activity. Have one kit, bag, bin, or space for painting, one for paper crafts, one for yarn, knitting needles, etc."
    },
    {
      "title": "Think about where and how you do crafts.",
      "content": "Think about where and how you do crafts. If you have a craft area already, add drawers, bins, or shelves. If you knit in front of the TV, your organization may consist of a knitting basket or two with active projects that live by the sofa and a bin full of extra yarn and inactive supplies stashed away in a closet elsewhere. Try a drawer organizer or even a fishing tackle box to corral many small items. Something with multiple smaller spaces helps separate little stuff. If you have a lot of small items, like beads or buttons, giving each group its own small container or compartment that seals or closes tight can save spills. Do you craft on the go? A tote bag or even a purse-sized craft kit might be just the right organization system for you. Keep a project at hand when you go out to make use of wait times."
    },
    {
      "title": "Organizing isn’t a one-and-done situation.",
      "content": "Organizing isn’t a one-and-done situation. Sort a little bit whenever you start or finish a project or get new supplies. Rearrange if you notice something isn't working. If it's not where you looked for it, put it back where you will look for it next time. If it's not handy and you use it often, put it back near the top or closer to where you work."
    },
    {
      "title": "Keep things visible and accessible.",
      "content": "Keep things visible and accessible. It's best if you don't have to empty an entire bin to get out one item. Put the flat objects into the container first, standing up on one side if possible, and then place the non-flat objects on top of them or alongside. Put frequently used items near the top. For materials, like paper or fabric, try a filing system that displays them. Stand them on edge in a bin or drawer so that you can sort through them and see at a glance what you have. Smaller pieces might be rolled and stood up in a basket or bin. Repeat this process with different containers until everything is filed away."
    },
    {
      "title": "Don’t rely on sticky notes or anything that could fall off easily.",
      "content": "Don’t rely on sticky notes or anything that could fall off easily. For example, if a certain container holds glue, markers, and crayons, write that out and attach that to the container. This way, you will know what is in the container when you need to get something out of it in the future."
    }
  ]
}