{
  "url": "https://www.wikihow.com/Print-a-PDF-Email-Attachment",
  "title": "How to Print a PDF Email Attachment",
  "steps": [
    {
      "title": "Set up a printer",
      "content": "Set up a printer with your Android phone or tablet. You can use a classic printer, or a printer that's set up for cloud printing."
    },
    {
      "title": "Open your preferred mail app on your iPhone or iPad.",
      "content": "Open your preferred mail app on your iPhone or iPad. This may be the default mail app, which will usually have an envelope icon. Or, it might be the Gmail or Outlook app."
    },
    {
      "title": "Open the email with the PDF you wish to print.",
      "content": "Open the email with the PDF you wish to print. Search for it using the search bar, or scroll through to find it. Tap the email to open it."
    },
    {
      "title": "Open the PDF attachment.",
      "content": "Open the PDF attachment. Scroll to the bottom of the email and tap on the attachment. In the Outlook app, the attachments can be found at the top of the email."
    },
    {
      "title": "Select an app to view the PDF.",
      "content": "Select an app to view the PDF. The options will be listed at the bottom. Tap an app and select Always or Just this once to use that app. Any PDF viewer apps that you've downloaded, such as Adobe Acrobat, will show up here in addition to the ones that are pre-loaded on your phone or tablet. If you've already selected Always before or have set up a default PDF viewer app, you will not see this option."
    },
    {
      "title": "Tap the options button.",
      "content": "Tap the options button. This will look different in each PDF viewer app, but is usually indicated with 3 dots in the top right corner."
    },
    {
      "title": "Tap Print.",
      "content": "Tap Print . This is sometimes indicated with a printer icon."
    },
    {
      "title": "Select a printer.",
      "content": "Select a printer. Choose from all printers that are set up to your Android."
    },
    {
      "title": "Modify your settings if required.",
      "content": "Modify your settings if required. For instance, add more copies to print, specify which pages to print, or choose whether to print in color or grayscale."
    },
    {
      "title": "Tap Print.",
      "content": "Tap Print . Your PDF document will print from the selected printer."
    },
    {
      "title": "Set up AirPrint on your iPhone or iPad.",
      "content": "Set up AirPrint on your iPhone or iPad. Follow these instructions (Part 1: Connecting to AirPrint) – you can use the iPad instructions for iPhone as well."
    },
    {
      "title": "Open your preferred mail app on your iPhone or iPad.",
      "content": "Open your preferred mail app on your iPhone or iPad. This may be the default mail app, which looks like a blue icon with a white envelope. Or, it might be the Gmail or Outlook app."
    },
    {
      "title": "Open the email with the PDF you wish to print.",
      "content": "Open the email with the PDF you wish to print. Search for it using the search bar, or scroll through to find it. Tap the email to open it."
    },
    {
      "title": "Open the PDF attachment.",
      "content": "Open the PDF attachment. Scroll to the bottom of the email and tap on the attachment. In the Outlook app, the attachments can be found at the top of the email."
    },
    {
      "title": "Tap the Share button.",
      "content": "Tap the Share button. This is at the top or bottom of the screen, depending on your mail app. It looks like a square with an arrow pointing up."
    },
    {
      "title": "Tap Print.",
      "content": "Tap Print . This is at the bottom, indicated with a printer icon."
    },
    {
      "title": "Tap Printer to select a printer.",
      "content": "Tap Printer to select a printer. Choose from connected AirPrint printers."
    },
    {
      "title": "Modify your settings if required.",
      "content": "Modify your settings if required. For instance, add more copies to print, specify which pages to print, or choose whether to print in color or grayscale."
    },
    {
      "title": "Tap Print.",
      "content": "Tap Print . Your PDF document will print from the selected printer."
    },
    {
      "title": "Go to your inbox.",
      "content": "Go to your inbox. This might be Outlook.com, Gmail, iCloud, or another platform. Navigate to the website on a browser."
    },
    {
      "title": "Open the email with the PDF you wish to print.",
      "content": "Open the email with the PDF you wish to print. Search for it using the search bar, or scroll through to find it."
    },
    {
      "title": "Open the PDF attachment.",
      "content": "Open the PDF attachment. Click on the attachment, which is usually at the bottom of the email."
    },
    {
      "title": "Click Print.",
      "content": "Click Print . This is usually at the top indicated with a printer icon. This will open the PDF in your browser's PDF viewer."
    },
    {
      "title": "Select your printer at the top of the screen.",
      "content": "Select your printer at the top of the screen. This is usually called the \"Destination\". If your printer is not yet set up with your computer, set it up ."
    },
    {
      "title": "Modify your settings if required.",
      "content": "Modify your settings if required. For instance, add more copies to print, specify which pages to print, or choose whether to print in color or grayscale."
    },
    {
      "title": "Click Print.",
      "content": "Click Print . This is usually at the bottom of the screen. Your PDF document will print from the selected printer."
    }
  ]
}