{
  "url": "https://www.wikihow.com/Prepare-for-an-ECG",
  "title": "How to Prepare for an ECG",
  "steps": [
    {
      "title": "Prepare yourself for the equipment that will be attached to you.",
      "content": "Prepare yourself for the equipment that will be attached to you. In order to obtain an ECG, the technician will place a variety of small patches called \"electrodes\" over areas of your chest, your arms, and your legs. There will be about 10–15 electrodes in total, depending upon the complexity of information desired by your physician. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The placement of these patches (electrodes) may seem random, but they are in fact carefully calculated as the best possible positions, or \"vantage points,\" from which to record the electrical activity of the heart. The electrodes themselves are harmless. They do not emit electricity; they merely record and measure the electrical activity in your heart. This can provide a lot of useful information to your medical provider. [2] X Expert Source Shervin Eshaghian, MD Board Certified Cardiologist Expert Interview. 26 June 2020. The only problems one could have from the electrodes are either itchiness or, for men with hairy chests, the technician may require the chest hair in those areas to be shaved in order to optimize the adhesion of the electrodes to the skin (they do not stick properly when too much hair is present). The electrodes will then be attached via lead wires to the ECG machine, which records the information for the doctor as the procedure takes place. [3] X Research source"
    },
    {
      "title": "Be aware of how it will feel.",
      "content": "Be aware of how it will feel. The great thing about an ECG is that you do not feel anything as the procedure is underway. [4] X Research source Other than some possible mild irritation from the electrodes placed upon your skin, there is otherwise no sensation associated with the test itself. [5] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Remove your jewelry and any other accessories.",
      "content": "Remove your jewelry and any other accessories. [6] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Prior to undergoing the ECG, the technician performing the test will ask you to remove any jewelry or other accessories that could possibly interfere with the electrical readings. You will also be asked to remove clothing on the upper half of your body, so that your chest and arms are exposed, and you may be asked to wear shorts to better expose your legs. For your modesty, the technician will offer you a gown to cover yourself."
    },
    {
      "title": "Lie still for the duration of the test.",
      "content": "Lie still for the duration of the test. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The ECG will only take a few minutes in total once the procedure is underway (not counting equipment set-up time). For the duration of the test, it is important that you do not talk, move, or engage in any activity that could disrupt the test readings. Lie as still as possible in order to ensure the greatest accuracy of the results. Breathe normally (as you would at rest) as abnormal respiration could also interfere with test results."
    },
    {
      "title": "Follow-up with your doctor.",
      "content": "Follow-up with your doctor. There are no specific post-test instructions after an ECG; you should be able to just get up and leave after the test is over. [8] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source However, within the next few days you will want to check in with your doctor about your test results, and to receive any additional diagnostic tests or medications as needed. Be sure you know when and how to follow-up with your physician prior to leaving the test."
    },
    {
      "title": "Understand what an ECG is measuring.",
      "content": "Understand what an ECG is measuring. An ECG measures the electrical activity of the heart. As previously mentioned, the test itself does not send out any electricity; it merely records the natural electrical impulses of the heart cells. This, in turn, provides valuable information to your doctor about your heart rate, your heart rhythm (and whether it is regular or irregular), and the strength and coordination of each heartbeat as the impulses travel through the various aspects of the heart muscle. [9] X Research source"
    },
    {
      "title": "Be aware of possible reasons why your doctor may have ordered an ECG.",
      "content": "Be aware of possible reasons why your doctor may have ordered an ECG. [10] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source An ECG is an invaluable diagnostic tool in differentiating causes of chest pain, respiratory problems, or other suspicious symptoms that may be related to the heart and/or lungs. An ECG can also be used for other health-related purposes, such as clearing a patient before surgery, checking on the status of a pacemaker or other implanted cardiac device, or to evaluate the effectiveness of certain heart-related medications on one's overall heart function. The diagnostic pros of the procedure tend to outweigh the cons, as there are no side effects or negative ramifications of undergoing the procedure itself. The only possible \"con\" is the cost of the procedure, which depends upon whether or not it is covered under your healthcare plan. There are virtually no risks associated with an ECG. However, if you have concerns of any sort, feel free to discuss these with your doctor prior to undergoing the procedure. [11] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Obtain follow-up tests as needed.",
      "content": "Obtain follow-up tests as needed. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source An ECG alone may not be sufficient to gather all of the information that your doctor desires. Further diagnostic tests that are often performed for additional information following an ECG include: A \"Holter monitor\" test. This test is basically a 24-hour ECG. It obtains the same information about the electrical activity of your heart that a standard ECG does, but it does so over a much longer period of time, therefore capturing unusual beats or episodes that may not have shown up during a short ECG test. An \"event recorder.\" This is similar to a Holter monitor and to an ECG. However, it is something you use only when you are experiencing cardiovascular or respiratory symptoms, such as shortness of breath, unusual heartbeats (called palpitations), or light-headedness or dizziness, among other things. A \"stress test.\" If your symptoms arise primarily during exertion, your doctor may recommend a stress test to provoke your symptoms. This test also records the electrical activity of your heart, and it hopes to capture abnormalities provoked by exertion."
    }
  ]
}