{
  "url": "https://www.wikihow.com/Prove-to-Someone-That-You-Are-Not-a-Liar",
  "title": "How to Prove That You're Not Lying (With Expert Insight!)",
  "steps": [
    {
      "title": "Stay calm, and avoid getting angry or frustrated.",
      "content": "Stay calm, and avoid getting angry or frustrated. When you’re accused of something, especially if you’re telling the truth, your first reaction may be to get angry or defensive. While it’s a fair response to an accusation, it can actually make the other person believe the accusation is true. [1] X Research source Take a few deep breaths , stay calm , and remember that you are trying to resolve the situation and preserve your relationship with this person, not make things worse. If you need a reaction, act in a serious way. That way, you’re showing that you don’t take the accusation lightly and that you’re willing to work to prove it wrong."
    },
    {
      "title": "Look confident while telling your side of the story.",
      "content": "Look confident while telling your side of the story. You may never be able to satisfy some people, but you can defend yourself. And if you share your side of things and state your own truth with confidence, you may be able to convince other people who haven’t made up their minds yet. [2] X Research source Use your body language: Make eye contact , keep your stance wide and shoulders back, and lift your chin slightly. You might say, “This is what I know to be true, and I’m sorry you think I’m lying about it, but I can’t change my story because it’s what really happened.” Resist the urge to say anything more, as overly explaining can be misconstrued as lying or desperation."
    },
    {
      "title": "Ask the person what you can do to regain their trust.",
      "content": "Ask the person what you can do to regain their trust. Kang says that when you’re falsely accused, “your goal is to get to a reasonable open discussion.” If it's clear that you cannot convince this person of your honesty, ask for more information about why they distrust you. Once you know this, you can strive to earn their trust in the future. Tell the person, \"It looks like you don’t believe me, and I’m not sure what I can do about that, but I know I’m not lying, and I hope we can work together to prove that.\" For example, if they don’t trust you because you’re always late or tend to be overly secretive, you might decide to be a little more punctual or more transparent."
    },
    {
      "title": "Provide evidence of what happened.",
      "content": "Provide evidence of what happened. Kang says that evidence is key. The best way to prove to someone that you are not lying is to offer the person evidence that directly contradicts the claim. If you can think of any way to demonstrate your truthfulness, do so by backing up your statements with credible proof. However, in some cases, it may be impossible to show evidence that you're not lying. You might show evidence by producing paperwork, such as time stamps or receipts that show what you were doing. For example, if your girlfriend accuses you of lying about your location, you might show her a time stamp or login record that shows you were using a computer in the college library at that time."
    },
    {
      "title": "Gather witnesses or people who can vouch for your honesty.",
      "content": "Gather witnesses or people who can vouch for your honesty. Social proof is the concept of using others' opinions or beliefs to influence a person's decisions or behaviors. Kang suggests using “witnesses to prove that you are innocent.” If there isn't any physical evidence, you may be able to convince the person by employing someone (or several people) who can testify to your innocence. For example, if your mom feels certain that you snuck out to a party, you can back up your story by asking your friend's parents to testify on your behalf. If two adults—people your mom trusts—say that you were definitely at their house, your mom is more likely to believe you. This only works if the person trusts the witnesses. Otherwise, they might just think the witnesses are lying, too."
    },
    {
      "title": "Focus on the most important parts, not on laying out the whole picture.",
      "content": "Focus on the most important parts, not on laying out the whole picture. Some experts say that liars try to tell the whole story in chronological order to demonstrate their mastery of the facts, but people who tell the truth tend to focus only on the most important parts. [3] X Research source Keep the conversation focused on the relevant bits and avoid trying to prove your innocence by talking about other parts of the story. It’s tempting to walk the other person through your entire day, but only do this if they start making accusations about it. Otherwise, stick to the crucial moments."
    },
    {
      "title": "Make a promise, or tell them how much it matters to you.",
      "content": "Make a promise, or tell them how much it matters to you. Explain to the person who is accusing you of being a liar: \"I wouldn't lie to you, I promise.\" Or, let them know that your relationship means too much to you to jeopardize it with a lie. [4] X Research source It may be enough to make them reconsider their own perspective. Use your track record to your advantage. For example, you might say, \"I have never lied to you. Remember, that time when everyone else wasn't being straightforward with you, and I did?\" Be careful with this method, though, because some people will think you are manipulating them by making a false promise."
    },
    {
      "title": "Keep your words simple and straightforward.",
      "content": "Keep your words simple and straightforward. Research shows that liars often talk in more complex sentences than people who are telling the truth. [5] X Research source Even if you are telling the truth, speaking in complex sentences can make it seem like you are covering something up, being evasive, or trying to distract from something. Strive for clear, simple, and concrete sentences with a moderate level of detail. You might tell someone, \"No, I was not with anyone last night. I was at the computer lab on campus. I can show you my login time,\" rather than, \"Oh, what are you talking about? I would never do anything like that to you. I love you so much. Who could I have been with? Why don't you trust me?\""
    },
    {
      "title": "Avoid repeating questions before answering them.",
      "content": "Avoid repeating questions before answering them. Another science-tested characteristic of liars is the tendency to repeat a question or ask other questions before providing an answer. [6] X Research source If you didn't clearly hear a question, ask the person to repeat it himself. Repeating it from your own mouth makes it seem like you are delaying your response so you can think up an answer. For example: Let's say your partner asks, \"Where were you last night?\" If you say, \"Where was I last night?\" pause and then add, \"I was in the computer lab doing work,\" this seems less than honest because of the need to hesitate before providing your answer."
    },
    {
      "title": "Ask yourself if they’re suspicious because you’ve lied in the past.",
      "content": "Ask yourself if they’re suspicious because you’ve lied in the past. If you have been known to tell a fib or two in the past, it’ll help carefully examine this behavior, stop it , and try to learn from it. Even if you are telling the truth in this situation, you may have developed a reputation as a liar. Look at other times you have lied or been caught in a lie. Brainstorm ways you could have prevented the lies and been honest from the start. [7] X Research source Once you have decided to stop lying, you help convince others of your truthfulness by sharing details about your life upfront. By doing this, you remove the need to be questioned, and therefore, others don't have to wonder if your answers are lies. Rebuilding trust after lying is a long process, not something that happens overnight. It’ll take a lot of truth-telling to earn that trust back, but it’s possible."
    },
    {
      "title": "Be transparent with other people about your thoughts and actions.",
      "content": "Be transparent with other people about your thoughts and actions. If you have trouble opening up to others, it may explain why someone is doubtful of your honesty. You might be too secretive or guarded to earn other people’s trust. Strive to be more open and honest in your close relationships by following these tips: [8] X Research source Be more accepting of others and yourself. When you are constantly worried about what others will say or how they will look at you, you may lie just to say what you think they want to hear. Trust the people you love to care about you despite your flaws. Don't put off important conversations. Schedule time to talk about important matters when both parties are free to speak and think clearly. Live a life according to your values. Live your truth, and then you don't need to lie. Embrace constructive criticism . We may lie because we don't want others to judge or criticize us for our faults. When you are able to see criticism as a tool to improve, you won't have to rely on untruths to get you by."
    },
    {
      "title": "Meet the other person’s eye (just not too much).",
      "content": "Meet the other person’s eye (just not too much). Evading others' eyes is often seen as a sign of dishonesty. Eye contact is an effective way to show honesty and sincerity. [9] X Research source You are also able to forge a more intimate connection with another person by staring into her eyes. Just be sure not to overdo it. Too little eye contact can seem evasive, but too much can seem threatening or intimidating. Some experts suggest maintaining eye contact longer for one-on-one conversations. Aim for about 7-10 seconds at a time. It's okay to make more eye contact when you are listening and less when you are talking."
    },
    {
      "title": "Keep your body language open and comfortable.",
      "content": "Keep your body language open and comfortable. When we are telling the truth, we are more comfortable. In the midst of lying, we may be more uncomfortable. A liar may demonstrate closed-off and unfriendly body language. On the other hand, a truth-teller will orient towards the other person, smile, nod, and uncross their arms and legs. [10] X Research source Sometimes, even when you are telling the truth, you may put your guard up because someone is questioning your behavior or motives. However, the other person can wrongly interpret this as being defensive and think you're lying. Take a deep breath and try to relax with the knowledge that, no matter what, you know that your words are honest. Don't allow your anxiety about being questioned to undermine your ability to convey the truth."
    },
    {
      "title": "Humans are pretty bad at spotting liars, according to research.",
      "content": "Humans are pretty bad at spotting liars, according to research. You’ve probably seen articles online about signs that someone is lying to you or how to spot a liar. There may be some subtle signs when someone is lying, but most of the time, our mind tells us what we want to hear, which means we misinterpret those signs quite a bit, confusing stress for guilt. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Still, if you know what to look for, you also know what to avoid: Shifty eyes, or looking for an exit Getting flustered, agitated, or angry Swallowing or licking lips Nervous laughing Expanded vocabulary, or offering too much information Repeating words or sentences Fidgeting or playing with their hands"
    }
  ]
}