{
  "url": "https://www.wikihow.com/Revise-Quickly-and-Effectively",
  "title": "How to Revise Quickly and Effectively",
  "steps": [
    {
      "title": "Write down all of the subjects you are currently studying.",
      "content": "Write down all of the subjects you are currently studying. Be sure not to leave out any of them, even if you think you don't need to revise some topics."
    },
    {
      "title": "Order your subjects from most important to least important.",
      "content": "Order your subjects from most important to least important. This process requires a lot of thought, so be careful how you make your selections. Do not put your subjects in order of those you like best and least, but on how much work you think a subject needs."
    },
    {
      "title": "Decide how many hours of study you are going to do a day.",
      "content": "Decide how many hours of study you are going to do a day. If it's a week before the exams, aim for around 3-4 hours of good, solid revision. This means you'll have around 21-28 hours to revise in that week. If it's the night before the exams, aim for no more than three-four hours that day, so as not to stress yourself out. [1] X Research source"
    },
    {
      "title": "Set your time per subject.",
      "content": "Set your time per subject. Referring back to step two, dedicate how many hours/minutes you want to spend on each subject. [2] X Research source"
    },
    {
      "title": "Draw up a clear revision timetable.",
      "content": "Draw up a clear revision timetable . Space out your subjects so you don't have all of your dreaded subjects on one day, but have a variety. [3] X Research source"
    },
    {
      "title": "If you want more detail in your timetable, you can also list out the chapters that you will revise or exercises that you will do during each session.",
      "content": "If you want more detail in your timetable, you can also list out the chapters that you will revise or exercises that you will do during each session. This will help keep you on track with your study goals."
    },
    {
      "title": "Follow your revision timetable as much as possible.",
      "content": "Follow your revision timetable as much as possible. Having a strict routine will make you revise better. [4] X Research source f"
    },
    {
      "title": "Spend 25 percent of your revision time looking through your workbook and making brief, short notes whilst reading it.",
      "content": "Spend 25 percent of your revision time looking through your workbook and making brief, short notes whilst reading it."
    },
    {
      "title": "Spend 50 percent of your time doing some past papers - they're the closest thing you'll get to the actual exam, so make the most of them.",
      "content": "Spend 50 percent of your time doing some past papers - they're the closest thing you'll get to the actual exam, so make the most of them."
    },
    {
      "title": "Spend the remaining 25 percent revising online, though make sure not to get distracted by Facebook or any other social networking websites.",
      "content": "Spend the remaining 25 percent revising online, though make sure not to get distracted by Facebook or any other social networking websites. MyMaths .co.uk is a good site to revise from, with online lessons, homework, and practice tests to test your knowledge. They cover the curriculum for 11 to 16 year olds."
    },
    {
      "title": "Spend 50 percent of your time quickly reading the pieces that the exam will be on and taking as much in as you can.",
      "content": "Spend 50 percent of your time quickly reading the pieces that the exam will be on and taking as much in as you can."
    },
    {
      "title": "Spend the remaining 50 percent making notes on the pieces and trying to remember as much as possible, and trying out past papers.",
      "content": "Spend the remaining 50 percent making notes on the pieces and trying to remember as much as possible, and trying out past papers."
    },
    {
      "title": "Spend 25 percent of your time looking at past papers briefly and looking at the style of writing etc.",
      "content": "Spend 25 percent of your time looking at past papers briefly and looking at the style of writing etc."
    },
    {
      "title": "Spend 25 percent of your time focusing on writing techniques and how to use them.",
      "content": "Spend 25 percent of your time focusing on writing techniques and how to use them."
    },
    {
      "title": "Spend 25 percent of your time looking over your notes and re-writing them quickly.",
      "content": "Spend 25 percent of your time looking over your notes and re-writing them quickly. [5] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source"
    },
    {
      "title": "Spend the remaining 25 percent practicing your writing style.",
      "content": "Spend the remaining 25 percent practicing your writing style. storywrite.com is a website for people all over the world who wish to improve their writing. Check it out."
    },
    {
      "title": "Spend 30 percent of your time focusing on your writing piece and taking in as much vocabulary as you can.",
      "content": "Spend 30 percent of your time focusing on your writing piece and taking in as much vocabulary as you can. Use your dictionary or an online dictionary to look up useful phrases and write them down in a notebook, trying to memorize them as you go."
    },
    {
      "title": "Spend 30 percent of your time focusing on your oral examination.",
      "content": "Spend 30 percent of your time focusing on your oral examination. Write down all of the possible questions that could come up on a separate piece of paper. Fold them up and put them into a hat. Draw a question out and see if you can answer it."
    },
    {
      "title": "Spend 20 percent of your time practicing your listening skills.",
      "content": "Spend 20 percent of your time practicing your listening skills. The best way to do this is to spend time highlighting important words on your vocabulary list and listening to listening tapes online."
    },
    {
      "title": "Spend the remaining 20 percent of your time practicing your reading skills.",
      "content": "Spend the remaining 20 percent of your time practicing your reading skills. Listening and reading kind of tie in together. Highlight the important words on your vocabulary lists and take a look at the past papers online."
    },
    {
      "title": "Spend 20 percent of your time looking through your notes so that you know what you need to know.",
      "content": "Spend 20 percent of your time looking through your notes so that you know what you need to know."
    },
    {
      "title": "Look through the Specifications of your exam board paper.",
      "content": "Look through the Specifications of your exam board paper. Make notes on each point so that they make sense to you."
    },
    {
      "title": "Spend at least 20 percent looking through past papers and maybe 25% on answering some questions from any revision books you may have.",
      "content": "Spend at least 20 percent looking through past papers and maybe 25% on answering some questions from any revision books you may have."
    },
    {
      "title": "It is a good idea to briefly summarise your notes and if you are a visual learner, to summarise it all onto a mind map!",
      "content": "It is a good idea to briefly summarise your notes and if you are a visual learner, to summarise it all onto a mind map!"
    },
    {
      "title": "Spend 30 percent of your time re-writing notes quickly and trying to remember them.",
      "content": "Spend 30 percent of your time re-writing notes quickly and trying to remember them. Highlight them in different colours if you are a visual learner, record yourself saying them if you are an auditory learner, or make a dance from them if you are a kinesthetic learner. [6] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source"
    },
    {
      "title": "Spend the other 20 percent of your time reading or listening to notes and digesting them.",
      "content": "Spend the other 20 percent of your time reading or listening to notes and digesting them. [7] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source"
    },
    {
      "title": "Spend 50 percent of your time taking past papers and testing yourself.",
      "content": "Spend 50 percent of your time taking past papers and testing yourself."
    },
    {
      "title": "Practice your skills and make sure they're at the best level they can be.",
      "content": "Practice your skills and make sure they're at the best level they can be."
    },
    {
      "title": "For the question paper you may have to take, revise just like you would for Academic Subjects.",
      "content": "For the question paper you may have to take, revise just like you would for Academic Subjects."
    },
    {
      "title": "Be aware of what you will be required to do; practice that piano piece, refine your art skills etc..",
      "content": "Be aware of what you will be required to do; practice that piano piece, refine your art skills etc.."
    }
  ]
}