{
  "url": "https://www.wikihow.com/Paint-Mason-Jars",
  "title": "How to Paint Mason Jars",
  "steps": [
    {
      "title": "Wash the mason jar with hot, soapy water and then let it air dry.",
      "content": "Wash the mason jar with hot, soapy water and then let it air dry. [1] X Expert Source Amy Guerrero Arts & Crafts Specialist Expert Interview. 9 October 2020. Fill up the sink with hot water and some dish detergent. Submerge the jar and scrub it using a scrubbing brush. Then rest the jar on a tea towel to let it dry. [2] X Research source"
    },
    {
      "title": "Clean the mason jar with rubbing alcohol.",
      "content": "Clean the mason jar with rubbing alcohol. Saturate a cotton ball with rubbing alcohol and use it to clean the entire jar, both on the inside and the outside. This helps to remove oils, dust, grit, and soap that may still remain after you have washed the jar in the soapy water. [3] X Research source Use Goo Gone spray to remove any sticky residue leftover from the label. [4] X Expert Source Amy Guerrero Arts & Crafts Specialist Expert Interview. 9 October 2020. Make sure to clean the rim and the base of the jar with rubbing alcohol too. Any built-up oils or dirt on the jar can cause the paint to not dry properly."
    },
    {
      "title": "Rinse the jar with hot water and let it air dry.",
      "content": "Rinse the jar with hot water and let it air dry. Hold the jar under hot, running water to remove the rubbing alcohol residue. Make sure to rinse both the inside and the outside. Then place the jar on a tea towel and wait for it to dry. [5] X Research source"
    },
    {
      "title": "Get either chalk or acrylic paint.",
      "content": "Get either chalk or acrylic paint. [6] X Expert Source Amy Guerrero Arts & Crafts Specialist Expert Interview. 9 October 2020. Chalk or acrylic paint is the best type of paint to use when you want to paint mason jars in a distressed style. You can find a huge variety of different acrylic and chalk paint colors available at craft stores, home improvement stores, or online. [7] X Research source The most popular colors to choose for mason jars are white, grey, pastel pink, pastel blue, or pastel green. Avoid using other types of paint such as gloss, enamel, or satin finish. This is because brush strokes show up more with these types of paint and they tend not to distress as well. [8] X Research source"
    },
    {
      "title": "Paint the first coat of either chalk or acrylic paint on the mason jar.",
      "content": "Paint the first coat of either chalk or acrylic paint on the mason jar. Use a paintbrush to apply the paint to the outside of the jar. Use even, vertical strokes and make sure that you paint in the same direction across the whole jar. It isn’t necessary to paint the inside of the jar. [9] X Research source Try to apply an even amount of paint to the whole jar. Avoid having patches where the paint is too thin or too thick. It can be helpful to place the jar upside down while you are painting it so that you can reach the base easily. [10] X Research source"
    },
    {
      "title": "Let the first coat of paint dry.",
      "content": "Let the first coat of paint dry. If you used chalk paint, let the first coat dry for 30 minutes. For acrylic paint, let it dry for 24 hours. Keep the area where you are drying the mason jar well-ventilated. [11] X Research source Acrylic paint requires a much longer time to dry because it needs to cure before it is distressed. Otherwise, large strips of paint will come away during the process. [12] X Research source"
    },
    {
      "title": "Add the second coat of paint and let the mason jar dry for 24 hours.",
      "content": "Add the second coat of paint and let the mason jar dry for 24 hours. Once the first coat has dried, go over the first coat with the same color of paint. Then let the mason jar air dry for 24 hours regardless of if you used chalk or acrylic paint. [13] X Research source"
    },
    {
      "title": "Distress the paint using 80 grit sandpaper.",
      "content": "Distress the paint using 80 grit sandpaper. Rub a small square of the sandpaper over the top of the jar, over the wording, and along the edges. You only need to rub at the paint lightly for it to get the distressed look. [14] X Research source Alternatively, you can choose other areas of the jar to distress. If you are painting several mason jars, try distressing different areas to see what look you prefer. Some people prefer to distress every raised part of the jar. [15] X Research source"
    },
    {
      "title": "Wipe the mason jar with a clean cloth to remove the dust.",
      "content": "Wipe the mason jar with a clean cloth to remove the dust. Sanding away the paint to distress the jar can cause dust to build up. It is important to remove the dust before you apply the paint sealer, as otherwise, the dust will be sealed on. [16] X Research source"
    },
    {
      "title": "Seal the paint using a matte paint spray sealer.",
      "content": "Seal the paint using a matte paint spray sealer. Follow the directions on the bottle of the paint spray sealer. Coat the outside of the jar fully. This will help to protect the paint and the distressed look of the mason jar. Always use paint sealer in a well-ventilated area. [17] X Research source You can purchase paint sealers from craft stores or online. The matte spray sealer will give the paint a chalk-like appearance. Alternatively, choose a gloss spray sealer if you like the appearance of the paintbrush strokes."
    },
    {
      "title": "Get your preferred colors of acrylic paint.",
      "content": "Get your preferred colors of acrylic paint. Bold and bright colors such as blues, pinks, and purples are popular choices for mason jars that are painted from the inside. You can find acrylic paint at craft stores, home improvement stores, or online. [18] X Research source If you are painting several mason jars, experiment with 2-3 different colors of paint to create a unique set of painted jars. You can also mix different colors together to make your desired shades. Acrylic paint is the best type to use when you are painting mason jars from the inside. However, because acrylic paint is water-based, this means that you cannot fill the painted mason jars with water. Because of this, choose a different method of painting mason jars if you are wanting to use them for holding real flowers. [19] X Research source"
    },
    {
      "title": "Cover your work surface with newspaper, paper towels, or cardboard.",
      "content": "Cover your work surface with newspaper, paper towels, or cardboard. Your work surface will be getting a lot of paint on it during this process, as the paint needs to flow out from the jar. Make sure that the whole surface is covered so that it doesn’t get stained. [20] X Research source"
    },
    {
      "title": "Pour in enough paint to fill approximately 1⁄2 in (1.3 cm) of the jar.",
      "content": "Pour in enough paint to fill approximately 1 ⁄ 2 in (1.3 cm) of the jar. Directly pour the acrylic paint from the bottle into each mason jar. Don’t worry about getting the amount exactly right, as you can always add or remove paint if you need to. [21] X Research source The smaller the amount of paint that you pour into the jar, the longer you will need to spend guiding the paint around the jar. Contrastingly, the more paint that you add into the jar, the quicker the process will go, however, more paint will be wasted. [22] X Research source"
    },
    {
      "title": "Hold each jar mostly upside down and twirl it to move the paint.",
      "content": "Hold each jar mostly upside down and twirl it to move the paint. Once you have added the paint into the jar, gently turn it so that it is at an angle between 90° and 180°. Swirl each jar in your hand to guide it as it spreads over the full inside surface. [23] X Research source Try adding multiple colors of paint for a unique looking. [24] X Expert Source Amy Guerrero Arts & Crafts Specialist Expert Interview. 9 October 2020."
    },
    {
      "title": "Place the jars upside down on your work surface.",
      "content": "Place the jars upside down on your work surface. When the entire inside of the jar is covered with paint, hold the jar so that it's fully upside down and carefully rest it on your work surface. This will drain away the excess paint. [25] X Research source"
    },
    {
      "title": "Move the jars around every 15 minutes.",
      "content": "Move the jars around every 15 minutes. The excess paint will begin to gather at the base of each jar. Moving the jars to a different spot will let more excess paint escape and will prevent this paint from drying in the rim of each jar. [26] X Research source If you accidentally get paint on the outside of the jar, you can simply wipe it off with a damp cloth if it is still wet. If the paint has dried, just scratch it off with your fingernail."
    },
    {
      "title": "Turn the jars upright to air dry overnight.",
      "content": "Turn the jars upright to air dry overnight. Once there is very little excess paint draining from the jars, flip each one so that it rests the right way around. Leave the jars overnight in a well-ventilated area to properly dry. The mason jars will then be ready to use! [27] X Research source"
    },
    {
      "title": "Get the spray paint of your choice.",
      "content": "Get the spray paint of your choice. Spray paint is the best way to paint mason jars if you are wanting to create shiny, metallic jars. [28] X Expert Source Amy Guerrero Arts & Crafts Specialist Expert Interview. 9 October 2020. Look for gold, silver, or rose gold spray paints in craft stores, home improvement stores, or online. [29] X Research source You don’t have to choose metallic spray paints. Any glossy spray paint colors will work too."
    },
    {
      "title": "Use painter’s tape to create an optional block color design on the jar.",
      "content": "Use painter’s tape to create an optional block color design on the jar. Wrap painter’s tape around the mason jar in 1-2 different places to create a striped or block pattern. If you would prefer your mason jars to have a solid coating of spray paint, then you don’t need to use the painter’s tape at all. This means that you can spray paint the whole mason jar, but the areas underneath the painter’s tape won’t be covered. Alternatively, you can use lettering stickers to create words on your mason jar. Spell out a word or a short phrase around the jar so that when it’s painted, you will see the outline of the letters. The stickers will be removed once the paint has dried."
    },
    {
      "title": "Mist the jar lightly with spray paint from a distance of 10–16 in (25–41 cm).",
      "content": "Mist the jar lightly with spray paint from a distance of 10–16 in (25–41 cm). Follow the directions on the label of the spray paint can. Shake it adequately before you begin using it. To start spray painting, move the can back and forth while pressing down on the trigger to lightly mist the outside of the jar. Aim to get an even coverage over the jar and don’t worry if the coating looks too light, as you will add more coats of paint later. Make sure that you are in a well-ventilated area while you are spray painting. Open the windows and doors and follow all of the safety instructions on the spray paint label."
    },
    {
      "title": "Let the mason jar dry for 15 minutes.",
      "content": "Let the mason jar dry for 15 minutes. Leave the mason jar in a cool, well-ventilated location. This is so that the first coat of spray paint can dry before you add the next."
    },
    {
      "title": "Repeat the process until you are happy with the coating.",
      "content": "Repeat the process until you are happy with the coating. Continue to apply spray paint and then let the mason jar dry. Depending on the coverage that you want and the type of spray paint that you are using, it may take around 5 coats before you are happy. Aim to have an even, opaque coating over the surface of the jar. Applying several coats of spray paint ensures that jar is covered evenly and that paint drips don’t form."
    },
    {
      "title": "Remove the painter’s tape or stickers if necessary.",
      "content": "Remove the painter’s tape or stickers if necessary. Let the mason jar dry completely for approximately 45 minutes. The carefully peel away the painter’s tape or stickers. If you are having trouble removing the tape or stickers without some paint peeling away, first trace around the tape or each letter using a small, sharp utility or craft knife. You can also use the knife to gently scrape under the tape or lettering so that you can easily peel it away from the jar."
    }
  ]
}