{
  "url": "https://www.wikihow.com/Not-Cry",
  "title": "How to Not Cry",
  "steps": [
    {
      "title": "Consider what you are feeling when you feel like crying.",
      "content": "Consider what you are feeling when you feel like crying. You may feel the urge to cry in specific situations, like when confronting authority. Though that urge might feel like it is beyond your control, there is usually an identifiable cause. Even just identifying the cause can help you gain control or avoid the situation in the future. You may feel a range of emotions, such as: Sadness Fear Anxiety Joy Frustration Grief Depression"
    },
    {
      "title": "Determine what you are thinking about.",
      "content": "Determine what you are thinking about. Shedding tears will be related to the emotions you are feeling and the thoughts you are having at the time, even when they don't seem immediately related. Consider the kinds of thoughts you are having when you feel like crying, and seek to find the connection. For instance, if you feel the urge to cry in a happy situation, consider whether you think the situation is “too good to be true,” or is fleeting. If you feel the urge to cry when you are being evaluated (such as during a review at work), determine if your thoughts are causing you to feel judged harshly, singled out personally, inadequate, etc."
    },
    {
      "title": "Observe your internal feedback.",
      "content": "Observe your internal feedback. Even in tense situations, you have some control over your thoughts and feelings. When you are communicating with someone and feel the urge to cry, consider what you are telling yourself as you listen to this person. For instance, if you are being evaluated at work and your manager suggests there are areas you could improve upon, are you telling yourself this means “I am terrible at my job,” or are you concentrating on forming a specific plan of action to move forward? Similarly, if a friend is upset with you and you feel the urge to cry, ask yourself if you are telling yourself “My friend hates me,” or simply that “I have done something specific to hurt my friend, and I should not do this again.” Sometimes, the way you think could contribute to your crying. For example, you might overgeneralize a situation or think in terms of \"all or nothing.\" These can make a situation seem more dire than it is. Try to use logic to redirect your thoughts."
    },
    {
      "title": "Cut out self-criticism.",
      "content": "Cut out self-criticism. By observing your internal feedback, you can determine if you are being self-critical; this is a common reason for feeling the urge to cry. Consider your thoughts and feelings when you are communicating with others (or thinking to yourself). Identify and stop self-criticism. [1] X Research source Common forms of self-criticism include statements like “I'm too emotional,” “Men shouldn't cry,” and “I'm a failure.” Replace these criticisms with thoughts that are more self-compassionate, like “I worked really hard on that project, and I'm proud even if it didn't quite succeed,” or “I really care about this issue, and I know my feelings are invested in it.” A good way to reduce self-criticism is to think about what you would tell your best friend in this situation. Treat yourself the same way you would treat your friend."
    },
    {
      "title": "Expect others to understand.",
      "content": "Expect others to understand. Some people do not know how to react when someone cries in front of them. However, you should be able to expect that someone understands that there is a reason when you cry, and that it doesn't necessarily mean that you are being weak, inappropriate, unprofessional, etc. When you cry and others seem unprepared or surprised, you should nevertheless expect them to show empathy by saying something like “I can see this is something really important to you,” or “I know you are upset.” If you cry in front of someone who doesn't seem to know how to react, you don't have to ignore it. You can try saying something like “You see, this is really important to me,” or “I'm upset because ….” This will help the person understand what is going on."
    },
    {
      "title": "Push your tongue against the roof of your mouth.",
      "content": "Push your tongue against the roof of your mouth. Like pinching yourself, you can create a temporary distraction or sensation of slight pain by pushing your tongue against the roof of your mouth when you feel the urge to cry."
    },
    {
      "title": "Take a moment to breathe.",
      "content": "Take a moment to breathe. [2] X Research source Count to ten and take several slow, deep breaths. Getting plenty of oxygen can boost your mood and increase your alertness. In addition, having a moment to pause can help your thoughts catch up to your feelings, and dispel the urge to cry."
    },
    {
      "title": "Distract yourself by counting.",
      "content": "Distract yourself by counting. Choose a random number, such as 7, and start counting up to 100. Your brain will concentrate on the logical action of counting, which can reduce your emotional response."
    },
    {
      "title": "Ask to be excused from the environment.",
      "content": "Ask to be excused from the environment. [3] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source If you want to avoid crying in front of someone, like a manager at work, excuse yourself and leave the area. For instance, say you need to go to the restroom or get some air. A short break to take a walk or assess your feelings can buy you some time and stop the urge to cry."
    },
    {
      "title": "Use a prop.",
      "content": "Use a prop. Sometimes, having something else to focus on can distract you from the urge to cry. [4] X Research source For instance, if you have a stressful meeting with your boss and are afraid you might cry, take a notepad or other object with you. Focusing on this during the meeting can prevent tears."
    },
    {
      "title": "Try visualization techniques.",
      "content": "Try visualization techniques. If you often feel like crying in certain situations, try imagining them in your head and playing out alternative situations. Repeatedly visualizing better outcomes in imaginary scenarios, in which you don't cry, can help you handle an actual situation. For instance, if you have a tendency to cry during family conflicts, imagine a situation in which you talk to your family while remaining composed and confident. If you can imagine how you will appear when you don't cry, you'll have a plan. If you are trying to avoid crying when defending yourself, imagine situations in which you speak up. For instance, imagine meeting with your boss for an evaluation and saying “I appreciate your feedback on X issue. I'd like to offer my perspective on the same.” If you are trying to avoid crying when speaking in public, imagine yourself on a stage confidently delivering your speech, presentation, etc. Then, when you actually have to speak in public, you will already have rehearsed a good outcome."
    },
    {
      "title": "Talk to a counselor.",
      "content": "Talk to a counselor. If you feel like you have a serious problem controlling your emotions, don't be afraid to seek help. Counselors are trained to help you understand your emotions and to develop techniques for understanding and controlling your feelings."
    },
    {
      "title": "Rule out any underlying medical problems.",
      "content": "Rule out any underlying medical problems. Some medical conditions, like pseudobulbar affect and certain forms of depression, can cause outbursts of uncontrollable crying, or increase your likelihood of crying. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you often have the urge to cry, or can't seem to stop when you do, you may want to see your doctor to determine if there is an underlying cause that needs to be treated."
    },
    {
      "title": "Understand that crying has a purpose.",
      "content": "Understand that crying has a purpose. While scientists still don't fully understand why humans cry, its clear that there is a relationship between crying and the expression of emotion. [6] X Research source [7] X Research source Crying can actually make the crier feel better, and cause others to feel sympathy and empathy, thereby forging connections between people. [8] X Research source Remember that everyone has good reasons now and then to cry, and so you may not always need or want to stop. Try to avoid suppressing your emotions. It is healthier to accept that you are upset about something."
    },
    {
      "title": "Keep yourself from crying when you're at work or school.",
      "content": "Keep yourself from crying when you're at work or school. Having a good cry is an important way to release emotions, but if you do it a work or school, you may not end up feeling better afterward. Crying around colleagues or fellow students may attract attention that you don't want. While most people are understanding when you need to cry, some aren't, and you may not want to share such an intimate side of yourself with them. In addition, crying at work could be seen as unprofessional, especially if it happens during a meeting or another high-pressure moment."
    },
    {
      "title": "Learn how to stop the tears when someone makes a hurtful comment.",
      "content": "Learn how to stop the tears when someone makes a hurtful comment. Crying can be a normal reaction to hurt feelings. While there's nothing wrong with crying in response to hurt or anger, it can signal to the other person that you aren't fully in control of your emotions. If you don't want to give them the satisfaction, try techniques to keep yourself from crying over things like a bad work review or a rude comment."
    },
    {
      "title": "Practice not crying when you're afraid or stressed out.",
      "content": "Practice not crying when you're afraid or stressed out. Crying from fear is also normal, but there are times when you might not want to express yourself that way. For example, maybe you have a presentation to give, and your stage fright is so extreme that you fear you'll cry in front of the class. It's worth practicing distraction methods and other ways to keep yourself from crying until you're out of the spotlight."
    },
    {
      "title": "Let yourself cry when the time is right.",
      "content": "Let yourself cry when the time is right. Crying is a valid way to release all sorts of emotions. Some situations may not be right for crying, but others absolutely are. Let yourself cry when you're with people who know you and support you. Let yourself cry at memorials, funerals, and other spaces where expressing emotions is encouraged. And of course, let yourself cry when you're alone. Sometimes the best time to cry is when you don't have to worry about how your tears will affect other people, and you can just focus on yourself."
    }
  ]
}