{
  "url": "https://www.wikihow.com/Set-Up-AirPlay",
  "title": "Everything You Need to Know About Using AirPlay",
  "steps": [
    {
      "title": "Verify your iOS device is compatible with AirPlay.",
      "content": "Verify your iOS device is compatible with AirPlay. If you have an iOS device that’s capable of running iOS 4.2 or higher, you’re good to go. In other words, pretty much any modern iPhone or iPad can stream to an AirPlay receiver. Newer AirPlay-compatible devices, such as Roku and many smart TVs, require your iPhone or iPad to have AirPlay 2 capability. To use AirPlay 2, your iOS device must be running iOS 12.3 or later."
    },
    {
      "title": "Verify you own a device that works as an AirPlay receiver.",
      "content": "Verify you own a device that works as an AirPlay receiver. You can stream content to an Apple TV, AirPlay-compatible speakers, a Mac that’s been set up as an AirPlay receiver, or most newer smart TVs and streaming devices. If you’re not sure, look for a label on your device that says “Works with Apple AirPlay,” or check your user manual or the manufacturer’s website. To see a list of AirPlay-compatible TVs and speakers, check out this page from Apple . To stream to your Mac, you’ll need to make sure your Mac is set up as an AirPlay receiver . Go to Apple menu > System Settings > General > AirDrop & Handoff and toggle AirPlay Receiver on. In this menu, you can also choose who can stream to your Mac with AirPlay (e.g., just you or anyone on the same network) and whether a password is required."
    },
    {
      "title": "Connect your iOS device and AirPlay device to the same Wi-Fi network.",
      "content": "Connect your iOS device and AirPlay device to the same Wi-Fi network. Both your devices will need to be connected to Wi-Fi for AirPlay to work. If multiple networks are available, double-check that both devices are on the same network. [1] X Research source Williams suggests that you make sure that you have a reliable Wi-Fi signal. AirPlay requires a good internet connection to work properly."
    },
    {
      "title": "Sign into the same Apple Account on Apple devices.",
      "content": "Sign into the same Apple Account on Apple devices. While this isn’t strictly necessary for using AirPlay, it can make the connection process easier if you’re trying to stream to a Mac or Apple TV. Sign in on both your iPhone or iPad and your receiver device with the same Apple Account (formerly Apple ID). [2] X Research source For instance, if you’re streaming to your Mac and you’ve chosen to only allow streaming from “Current User,” you’ll need to log in with the same Apple Account for AirPlay to work."
    },
    {
      "title": "Open the Control Center on your iPhone or iPad.",
      "content": "Open the Control Center on your iPhone or iPad. On most models of iPhone and iPad, you can open the Control Center by swiping down from the top right side of the screen. If you have an iPhone with a Home button, swipe up from the bottom instead."
    },
    {
      "title": "Tap the Screen Mirroring icon.",
      "content": "Tap the Screen Mirroring icon. In newer versions of iOS, this button looks like a pair of overlapping rectangles. In earlier versions, it might look like a TV screen. Tapping this button displays a list of all AirPlay screen mirroring-compatible devices connected to your Wi-Fi network. [3] X Research source"
    },
    {
      "title": "Tap on the device to which you want to stream content.",
      "content": "Tap on the device to which you want to stream content. After selecting a device, AirPlay streaming will be enabled. On some devices, you may be prompted to enter a passcode on your iPhone or iPad to connect. This code will appear on the screen you’re trying to stream to from your iOS device."
    },
    {
      "title": "Navigate to the media you want to stream, then tap Play.",
      "content": "Navigate to the media you want to stream, then tap Play . The media content will now start playing on your AirPlay-compatible device. [4] X Research source"
    },
    {
      "title": "Stream from within apps as an alternative to Screen Mirroring.",
      "content": "Stream from within apps as an alternative to Screen Mirroring. Say you’re playing Apple Music and want to stream to a nearby speaker, or you’re watching a video in the Apple TV app and you want to stream just that (instead of everything on your phone’s screen) to your TV. Start playing the photo or video, then tap the AirPlay icon and select the device you’d like to stream to. You can use your iPhone or iPad to control playback while you watch or listen. [5] X Research source For videos, the AirPlay icon resembles a TV screen. If you’re listening to an audio file, look for a series of concentric circles with a triangle on the bottom. Some third-party apps, like YouTube, can also stream to devices using AirPlay. Tap the screen sharing icon (on YouTube, this looks like a screen with several curved lines in one corner), then select AirPlay & Bluetooth devices and select your device."
    },
    {
      "title": "Set up AirPlay to stream automatically (optional).",
      "content": "Set up AirPlay to stream automatically (optional). If you stream from your iPhone or iPad to a certain AirPlay device all the time, you can set up your phone or tablet to automatically connect when it detects that device. To do this: [6] X Research source Open Settings on your iPhone or iPad and go to General > AirPlay & Continuity . Tap Automatically AirPlay . Select Never to always connect manually, Ask if you want your iPhone or iPad to ask when it detects an AirPlay compatible device, or Automatic if you’d like to automatically start streaming from apps you regularly use with AirPlay."
    },
    {
      "title": "Install the latest updates on all your devices.",
      "content": "Install the latest updates on all your devices. This helps ensure AirPlay runs efficiently across all compatible Apple and third-party AirPlay devices. [7] X Research source"
    },
    {
      "title": "Make sure your devices are turned on and within range.",
      "content": "Make sure your devices are turned on and within range. You might have trouble connecting if you’re too far away from the receiver device, so try getting closer. Double-check that your receiver is getting power and booted up. If the device you’re streaming to is battery-powered, make sure it’s fully charged."
    },
    {
      "title": "Turn off your VPN.",
      "content": "Turn off your VPN. If you have a VPN on, try turning it off and then see if AirPlay works. Your VPN may be blocking local networking, which will prevent AirPlay from working correctly. [8] X Research source"
    },
    {
      "title": "Make sure both devices are on the same network.",
      "content": "Make sure both devices are on the same network. Double-check that your iPhone or iPad is connected to the same Wi-Fi network as the TV, Mac, speaker, or other device you’re trying to connect with. If your router has multiple bands, you’ll need to ensure that both devices are on the same band."
    },
    {
      "title": "Restart all your devices.",
      "content": "Restart all your devices. Turn your iPhone or iPad off and then on again, and restart your receiver device as well. This refreshes the Wi-Fi connection on both devices so AirPlay can be enabled, and may also help resolve any glitches that are preventing you from connecting."
    },
    {
      "title": "Make sure AirPlay is enabled on your Apple TV.",
      "content": "Make sure AirPlay is enabled on your Apple TV. This feature is normally enabled by default, but may be disabled on your Apple TV if it doesn’t display in Control Center. On your Apple TV, go to Settings > AirPlay and HomeKit and make sure AirPlay is turned on. [9] X Research source You might also need to adjust other settings, such as who can use AirPlay with your Apple TV and whether a password is required. Similarly, on a Mac, go to Settings > General > AirDrop & Handoff to ensure that AirPlay is enabled and all the settings are correct. For other AirPlay-compatible devices, consult the user manual or go to the manufacturer’s website to learn how to enable AirPlay."
    },
    {
      "title": "Check the volume on both devices if you can’t hear audio.",
      "content": "Check the volume on both devices if you can’t hear audio. Low or muted volume on one or both devices can interfere with sound when using AirPlay."
    },
    {
      "title": "Adjust your Home app settings.",
      "content": "Adjust your Home app settings. If you’re having trouble streaming to a device you set up in the Home app, you might need to change the settings to allow AirPlay connections. Open the Home app and go to ••• > Home Settings > Speakers & TV to view your device settings."
    },
    {
      "title": "Try using a wired Internet connection with an Ethernet cable.",
      "content": "Try using a wired Internet connection with an Ethernet cable. If your content lags or becomes interrupted while streaming on the Apple TV or other AirPlay-compatible device, this can help strengthen your network connection and prevent lagging. [10] X Research source"
    },
    {
      "title": "Relocate objects or devices that might be interfering with AirPlay.",
      "content": "Relocate objects or devices that might be interfering with AirPlay. Microwaves, baby monitors, and metal objects can cause interference with streaming between your iOS and AirPlay devices."
    }
  ]
}