{
  "url": "https://www.wikihow.com/Skim-Fat-from-Whole-Milk",
  "title": "How to Skim Fat from Whole Milk",
  "steps": [
    {
      "title": "Make sure your milk is not homogenized.",
      "content": "Make sure your milk is not homogenized. Homogenized milk has already had its fat molecules broken down before it is sent to the store. If your milk is straight from the cow, you know it hasn’t been homogenized yet. Check the label on your store-bought milk and make sure it says “non-homogenized” on it. [1] X Research source You can buy non-homogenized milk at many natural grocery stores or farmers markets."
    },
    {
      "title": "Pour the milk into a clear, airtight container, like a jar with a lid.",
      "content": "Pour the milk into a clear, airtight container, like a jar with a lid. Choose a container that you can make airtight. Mason jars, tupperware containers, or even cups with plastic wrap on top will work. Pour as much milk as you want to skim into your container. [2] X Research source You can purchase mason jars in bulk for a low price at most grocery stores. Use a clear container to make it easier to see the separation line between the milk and the fat."
    },
    {
      "title": "Let the milk sit in the fridge for 24 hours.",
      "content": "Let the milk sit in the fridge for 24 hours. Keep your milk in its container inside of your fridge. The fat will naturally rise to the top as your milk sits undisturbed. Be sure not to shake the milk or move it around as it is sitting. [3] X Research source Cold milk takes longer to separate, but leaving milk out at room temperature could cause it to spoil."
    },
    {
      "title": "Look for the “cream line” in your milk.",
      "content": "Look for the “cream line” in your milk. Once your milk has separated, you will be able to see a layer of cream, or fat, floating at the top of your container. The cream will be a slightly lighter color, and might have small bubbles in it. [4] X Research source Once you identify the cream line, you'll know how much cream to skim off the top."
    },
    {
      "title": "Open the container and scoop the cream off with a spoon.",
      "content": "Open the container and scoop the cream off with a spoon. Carefully scrape the layer of cream off the top of the milk with a spoon. You can save the cream to use in a recipe or rinse it down the drain. Be careful not to mix the cream back into the milk. [5] X Research source"
    },
    {
      "title": "Store your skim milk in the fridge and use it within 7 days.",
      "content": "Store your skim milk in the fridge and use it within 7 days. You can keep your skim milk in the container that you were using, or transfer it to a separate one. Be sure to store your skim milk at a cold temperature in the fridge. [6] X Research source Try putting skim milk into recipes as a healthier alternative to whole milk."
    },
    {
      "title": "Boil your raw, non-homogenized whole milk in a saucepan for 6 minutes.",
      "content": "Boil your raw, non-homogenized whole milk in a saucepan for 6 minutes. Pour your desired amount of milk into a saucepan and bring it to a boil. Keep the milk boiling for 6 minutes over medium heat. Stir it slightly so that the bottom of the milk does not burn. [7] X Research source This method works best for raw milk that is warm and straight from the cow."
    },
    {
      "title": "Take the saucepan off the heat and let the milk cool for 2 minutes.",
      "content": "Take the saucepan off the heat and let the milk cool for 2 minutes. You will see the cream, or the fat, start rising to the top as the milk cools down. Don’t stir or mix the milk once it is off the heat, or you will mix the fat back into the milk. [8] X Research source"
    },
    {
      "title": "Scoop the cream off the top of the milk with a spoon.",
      "content": "Scoop the cream off the top of the milk with a spoon. Gently scrape the milk off the top with a large spoon. You can use the cream for a recipe or wash it down your drain. Be sure not to mix or stir the cream back into the milk. [9] X Research source If you want to save your cream for a recipe, put it in an airtight container and save it in the fridge for up to 5 days."
    },
    {
      "title": "Cover your saucepan with a lid and refrigerate the milk for 8 hours.",
      "content": "Cover your saucepan with a lid and refrigerate the milk for 8 hours. As it cools, the milk will separate even further and the fat will rise to the top. Make sure the lid of your saucepan is as close to airtight as it can be. Set your saucepan somewhere where it will not be jostled or disturbed. [10] X Research source"
    },
    {
      "title": "Skim the cream from the saucepan with a spoon.",
      "content": "Skim the cream from the saucepan with a spoon. There will be a thick layer of cream floating on the top of your milk. Use a spoon to gently skim the rest of the cream off of the milk, making sure you don’t mix it back into the saucepan. [11] X Research source This cream will be thicker than the cream you scooped off before you chilled your milk."
    },
    {
      "title": "Store your skim milk in the fridge and use it within 7 days.",
      "content": "Store your skim milk in the fridge and use it within 7 days. Transfer your skim milk from a saucepan into another container, like a jar with a lid. Use your skim milk in recipes or drink it straight within 1 week of skimming it. [12] X Research source"
    }
  ]
}