{
  "url": "https://www.wikihow.com/Reset-an-Xbox-360",
  "title": "How to Factory Reset an Xbox 360",
  "steps": [
    {
      "title": "Reset your Xbox 360 to factory settings if you're selling it or experiencing major issues.",
      "content": "Reset your Xbox 360 to factory settings if you're selling it or experiencing major issues. This will delete everything on the Xbox 360, but it will not remove parental restrictions. To remove parental restrictions, you'll need to prove to Microsoft that you are authorized to remove them. See the next section for details."
    },
    {
      "title": "Back up anything you want to save.",
      "content": "Back up anything you want to save. Resetting your Xbox 360 to factory settings will delete everything on it. Before proceeding, make sure you back up anything you want to keep. [1] X Research source Connect an external USB hard drive to your Xbox 360 so that it appears as a storage device. Press the Guide button on your controller and select the \"Settings\" tab. Choose \"System Settings,\" select \"Storage,\" and then select your Xbox 360 hard drive. Select \"Transfer Content\" and then select your external hard drive. Select what you want to transfer and then click \"Start.\" You may have to wait a while for the transfer to complete."
    },
    {
      "title": "Press the Guide button on your Xbox controller.",
      "content": "Press the Guide button on your Xbox controller. This is the center button that has the Xbox logo."
    },
    {
      "title": "Select \"Settings\" and then choose \"System Settings.\"",
      "content": "Select \"Settings\" and then choose \"System Settings.\" This will display the different categories of system settings."
    },
    {
      "title": "Select \"Console Settings\" and then \"System Info.\"",
      "content": "Select \"Console Settings\" and then \"System Info.\" This will display a new window with various information about your console."
    },
    {
      "title": "Write down your \"Console Serial Number.\"",
      "content": "Write down your \"Console Serial Number.\" This is the serial number for your Xbox 360, and you may need it when resetting the system. You can also find your serial number next to the USB ports on the front of your Xbox 360, or on the back on the console above the A/V port. [2] X Research source"
    },
    {
      "title": "Return to \"System Settings\" and select the \"Storage\" option.",
      "content": "Return to \"System Settings\" and select the \"Storage\" option. This will display all of the storage devices connected to your Xbox 360."
    },
    {
      "title": "Highlight your Xbox 360 hard drive and press Y button.",
      "content": "Highlight your Xbox 360 hard drive and press Y button. This will open the Device Options menu for the hard drive."
    },
    {
      "title": "Select \"Format\" from the Device Options menu.",
      "content": "Select \"Format\" from the Device Options menu. You'll be prompted to confirm that you want to erase everything on the hard drive. If you're sure that you've backed everything important up, you can proceed."
    },
    {
      "title": "Enter your serial number if prompted.",
      "content": "Enter your serial number if prompted. You may be asked to enter your console serial number before you can begin the format. This is a safeguard to help prevent accidental formats. Enter in the serial number you wrote down earlier. This will not remove any parental controls that have been set. See the next section for details on removing parental controls."
    },
    {
      "title": "Delete your user.",
      "content": "Delete your user. After the format, you'll be taken back to the Home menu. You'll be logged out of Xbox Live, and all of your games will be gone. Go to Settings, System, Storage, then the location of your user, and delete it."
    },
    {
      "title": "Start the Initial Setup.",
      "content": "Start the Initial Setup. Go to Settings, System, and press \"Initial Setup.\" Select \"Yes\" to confirm."
    },
    {
      "title": "Press the Guide button on your Xbox controller.",
      "content": "Press the Guide button on your Xbox controller. This button is in the center and looks like the Xbox logo. This will open the Guide menu. If you are trying to bypass parental controls set by your parents, you won't be able to. Microsoft will require proof that you're authorized to change the parental control password."
    },
    {
      "title": "Open the Settings menu and select \"Family.\"",
      "content": "Open the Settings menu and select \"Family.\" This will open the parental controls section."
    },
    {
      "title": "Select \"Content Controls.\"",
      "content": "Select \"Content Controls.\" You'll be prompted to enter the current passcode."
    },
    {
      "title": "Enter the wrong passcode to force a reset.",
      "content": "Enter the wrong passcode to force a reset. Since you don't know the passcode to access the Family menu, enter the wrong one so that you are prompted to reset the passcode."
    },
    {
      "title": "Select \"Reset Pass Code\" when prompted.",
      "content": "Select \"Reset Pass Code\" when prompted. This will display the security question to reset the passcode."
    },
    {
      "title": "Answer the question if you can.",
      "content": "Answer the question if you can. If you were the one that set up the passcode, answer your security question and you'll be able to create a new passcode. If you don't remember the answer to the passcode or a previous owner enabled parental controls, read on."
    },
    {
      "title": "Contact Xbox Support if you can't answer the security question.",
      "content": "Contact Xbox Support if you can't answer the security question. If the previous owner had a passcode enabled and didn't remove it before selling it, or you don't remember the answer to your security question, you'll need to call Xbox Support to get a master reset passcode. You can contact support at support.xbox.com , via online chat or telephone. You'll be asked some questions to verify that you are allowed to disable parental controls (Xbox Support won't disable parental controls if it was your parents that enabled them). [3] X Research source"
    },
    {
      "title": "Enter the passcode provided by Xbox Support.",
      "content": "Enter the passcode provided by Xbox Support. If Xbox Support approves your request to reset the parental controls, you'll be given a pass code you can use to bypass the current code. You can then disable parental controls or create a new pass code."
    },
    {
      "title": "Clear your cache if you have troubles with your Xbox 360.",
      "content": "Clear your cache if you have troubles with your Xbox 360. If you're experiencing worse-than-normal performance in games, or the system is sluggish when moving between menus, clearing the system cache may help. This will be most effective with older Xbox 360 games. Clearing the system cache will not delete any of your games, save files, or media. It will delete any installed game updates, so these will need to be downloaded again when you play the game next."
    },
    {
      "title": "Press the Guide button on your Xbox controller.",
      "content": "Press the Guide button on your Xbox controller. This will open the Guide menu."
    },
    {
      "title": "Select \"Settings\" and then \"System Settings.\"",
      "content": "Select \"Settings\" and then \"System Settings.\" You'll see various settings categories."
    },
    {
      "title": "Select \"Storage.\"",
      "content": "Select \"Storage.\" You'll see all of your connected storage devices."
    },
    {
      "title": "Highlight any storage device and press the Y button.",
      "content": "Highlight any storage device and press the Y button. This will open the \"Device Options\" menu. It doesn't matter which storage device you select, as you'll be clearing the entire system's cache."
    },
    {
      "title": "Select \"Clear System Cache\" and then confirm.",
      "content": "Select \"Clear System Cache\" and then confirm. The cache will be deleted, which should only take a few moments. [4] X Research source"
    }
  ]
}