{
  "url": "https://www.wikihow.com/Perform-a-Trebuchet-with-a-Butterfly-Knife",
  "title": "How to Perform a Trebuchet with a Butterfly Knife",
  "steps": [
    {
      "title": "Choose the type of knife you will use.",
      "content": "Choose the type of knife you will use. It is possible to cut yourself while performing the trick so you’ll want to decide if you will use an actual butterfly knife. Training knives without blades are also available and are a great alternative to use when learning knife tricks. Another option is to wrap the knife blade with electrical tape to minimize the risk of being cut. [1] X Research source"
    },
    {
      "title": "Decide how you want the blade to be oriented when you finish the trick.",
      "content": "Decide how you want the blade to be oriented when you finish the trick. If you want the blade downward, start out with the safe handle. If you want it facing towards you, start out with the bite handle. The bite handle is the one that closes on the sharp edge of the blade. Starting out with the safe handle will be more dangerous because you will soon be switching your grip to the bite handle. This is how the trick is usually performed. You can start out by holding the bite handle until you perfect the trick. Your grip should be relatively close to the tang (pivot area) throughout the trick. Holding the knife here gives you more control while performing the trick."
    },
    {
      "title": "Understand how the trick works.",
      "content": "Understand how the trick works. Overall, the trick to performing a trebuchet is to use the momentum of the knife as you flip your wrist. The momentum will keep the knife spinning so that you can perform the trick smoothly."
    },
    {
      "title": "Throw the bite out away from you.",
      "content": "Throw the bite out away from you. As you do this, simultaneously wrap your middle, ring, and pinky fingers around the bite in preparation for the next step. Other than the possibly the aerial portion of the trick at the end, this first part of the trick requires the most practice. It tends to be the most awkward or unnatural movement for many people. Practice with either a dulled or taped blade or with the opposite handle so that you don't cut yourself starting off. When starting off with the safe handle there are several points where your finger will come between the blade and the bite handle, which you're going to be snapping the blade back into."
    },
    {
      "title": "Pinch the bite between your index finger and middle finger.",
      "content": "Pinch the bite between your index finger and middle finger. While pinching the bite, rotate the two gripping fingers around so you begin to get the latch on the bite pointing up and the blade hanging down. During this portion of the trick, it is sometimes easier to avoid a cut if you shift your blade outwards. Shifting the blade out will change your plane. This will need to be corrected during the aerial portion of the trick. Shifting your plane at high speeds can cause instabilities, which you do not want during the aerial."
    },
    {
      "title": "Shift the positioning of your fingers so that you are holding the handle between your index finger and thumb.",
      "content": "Shift the positioning of your fingers so that you are holding the handle between your index finger and thumb. Note that before shifting position, you were holding the handle between your index finger and middle finger. The middle finger can be curled back to be used as a plane for the handle to rotate on. It is extremely beneficial to grip the handle between your index finger and the back of the second digit of your middle finger."
    },
    {
      "title": "Snap the blade and the safe handle back; then cradle the handle in a reversed grip.",
      "content": "Snap the blade and the safe handle back; then cradle the handle in a reversed grip. Your middle finger will still be curled back in the same position as in the previous step. It can remain there until you nose over for the aerial portion of the trick. This step is where a large portion of the speed must come through for the trick to look as cool as possible. It also must be kept on one plane with the tang rotating around the index finger."
    },
    {
      "title": "Throw out the safe handle and shift your middle finger.",
      "content": "Throw out the safe handle and shift your middle finger. Your middle finger should still be holding the handle with the thumb by the second digit on top of the handle. This allows you to use the momentum of the blade being thrown out to carry both the blade and the safe handle around into the opposite position from where they were before. The best way to describe this motion is to take the 'V' formed by your index finger on top of the bite and the middle finger beneath it and completely flipping it over so that the middle finger is on top. Be sure to flip it in the direction that the momentum is taking the safe handle and the blade."
    },
    {
      "title": "Push the whole thing over with your index finger.",
      "content": "Push the whole thing over with your index finger. You are know beginning the aerial. For this portion of the trick, the blade is launched into the air and then caught with the same hand. This is the most difficult part of the trick to teach and learn. It is also the most dangerous part. If you are using a sharpened butterfly knife, it is best to angle the bite down. Otherwise, you are likely to be cut. It is highly recommended that you practice this step with a trainer or a taped blade."
    },
    {
      "title": "Grip with your index finger and middle finger.",
      "content": "Grip with your index finger and middle finger. The blade should begin to nose over and start falling by itself. Note that the bite handle will be angled downward. All of the momentum carried in this nose-over portion of the trick is now swinging the blade back towards your fingers."
    },
    {
      "title": "Toss the knife up in the air.",
      "content": "Toss the knife up in the air. Note that the blade was moving down toward you in the previous step. In order to toss the knife up in the air for the aerial, you will move your hand up so that the blade begins moving away from you in the opposite direction. [2] X Research source Once the knife is in the air, it should flip over before falling back down."
    },
    {
      "title": "Catch your knife by the handle as it comes back down.",
      "content": "Catch your knife by the handle as it comes back down. You have just finished the trebuchet trick. You now know how to open a butterfly knife in style."
    }
  ]
}