{
  "url": "https://www.wikihow.com/Not-Get-Creeped-out-by-a-Chain-Letter",
  "title": "How to Not Get Creeped out by a Chain Letter",
  "steps": [
    {
      "title": "Think:",
      "content": "Think: What is the chain mail? [1] X Research source Is it, \"BBQ at my house! I won't like if you don't come!\"? If it is, you're fine (it's not really an alarming thing, just a friend who expects you to show up and might be sore at you if you don't). If not, continue on."
    },
    {
      "title": "Don't get drawn into reading it.",
      "content": "Don't get drawn into reading it. Usually at the top there is something such as, \"Don't read this\" or \"Stop\". If there is, you should stop and delete it. Chain letters often tell you to \"read\" or \"don't read\" as a ploy, playing on your initial curiosity so if you read them, they'll eventually hit you with a bunch of baloney designed to push your panic button or use any other emotion you have against you for one purpose only: to get you spreading it further. However, if you are curious, or a rebel or just want to read it, continue. It's just a piece of text with maybe some graphics and animations. It can't actually do anything to you. [2] X Research source"
    },
    {
      "title": "Stay rational and sensible.",
      "content": "Stay rational and sensible. Often the email or comment will be some story, commonly about some monster or fictional dead kid attacking people. Don't lose your head and get scared. There's no such thing as monsters, you've known that since you were small. No chain letter is going to cause one to blip into existence to kill you or anyone else. You know dead people are dead, and can't go around attacking you, pulling you down some nonexistent well or do any of the things these supposedly creepy chain letters claim. None of these creepy stories forwards can actually cause that to happen, either. If you choose to read it, keep in mind the fact that every one of these scary chain email stories are absolutely untrue. Keep thinking this as you read it."
    },
    {
      "title": "Understand that the consequences of not following along with what the chain communication do not exist.",
      "content": "Understand that the consequences of not following along with what the chain communication do not exist. After you read the story, it will say something like, \"If you do not send this to ten more people, you will die in two days.\" Think again: Will this really happen to you? Will you actually die because you didn't send an email? How is it even possible that a made up story and text and pixels created by some anonymous hoaxer can actually kill you? It can't, any more than your computer monitor and keyboard. There's no more chance of a piece of made-up email tracking you down and killing you than there is of your computer suddenly coming to life and giving you a hug or a slap. Chain letter emails are not living beings and they are not magic. They can't physically do any more harm to anyone than an email you personally write. [3] X Research source"
    },
    {
      "title": "Don't send it to anyone else.",
      "content": "Don't send it to anyone else. Doing this stops other people getting it and passing it on and it getting worse. Not only will it spread this but other unsuspecting users will get frightened. [4] X Research source"
    },
    {
      "title": "Keep the email.",
      "content": "Keep the email. Even if it is absolutely creepy, keep the mail and smash it. Write out all of the things wrong with it and make yourself laugh at the utter ridiculousness of the story and the threat attached. Keeping the message is also a good way of stopping a troublesome emailer: you tell someone (teacher, parent, friend, etc.) you have proof of getting this unwanted email. If convenient, ask anyone else who is definitely not creeped out by the chain letter for their ideas. If you get them to dissect and ridicule the story for the fake-creepy, absurd junk it is, you and probably them will end up having a good laugh over it. This completely turns the tables on whoever actually started the chain letter that creeped out the unthinking, easily scared people who got it before you did and passed it on. Being a chain-breaker is good and never killed anyone."
    },
    {
      "title": "Confront the sender.",
      "content": "Confront the sender. The person that sent you the chain letter sent it because they either thought it was funny or were duped into sending it. If you know the person who sent you the email, let them know that the letter is fake and that they shouldn't send it to people. [5] X Research source"
    },
    {
      "title": "If they send you another email, follow steps 1-7 again.",
      "content": "If they send you another email, follow steps 1-7 again."
    },
    {
      "title": "If the person sends you three or more emails, tell someone else.",
      "content": "If the person sends you three or more emails, tell someone else. You can even report them to their internet service provider if they keep sending you unwanted email. The situation is getting out of hand. Tell the person you will block their address if they keep sending you this junk. You can also report them for spam in their mail app. Chain letters are against the terms of service of many ISPs - they are a type of spam. [6] X Research source"
    },
    {
      "title": "Report threats to a proper authority.",
      "content": "Report threats to a proper authority. If the chain letter includes a threat, such as: \"I will break into your house myself and (enter bad event) you!\", it may be appropriate to inform an authority (police, principal, etc.). (see Warnings). [7] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    }
  ]
}