{
  "url": "https://www.wikihow.com/Program-a-Dish-Network-Remote",
  "title": "How to Program a Dish Network Remote",
  "steps": [
    {
      "title": "Make sure that you have the correct type of remote.",
      "content": "Make sure that you have the correct type of remote. If you have a model 40.0, 50.0, 52.0, or 54.0 remote, you'll want to use this method. [1] X Research source If you have a 20.0, 20.1, 21.0, or 21.1 style remote, you'll need to use the next method instead. You can find your remote's style number in the manual."
    },
    {
      "title": "Turn on your TV.",
      "content": "Turn on your TV. Press your TV's Power button, then make sure that the TV is set to the Dish Network's input."
    },
    {
      "title": "Open the menu.",
      "content": "Open the menu. Press either the HOME button twice or the MENU button once. [2] X Research source This will depend on your remote's specific model number."
    },
    {
      "title": "Select Settings.",
      "content": "Select Settings . You'll find this option in the middle of the screen. Use the arrow buttons on your remote to navigate to it, then press ENTER or OK button on your remote."
    },
    {
      "title": "Select Remote Control.",
      "content": "Select Remote Control . It's at the top of the list of options on this screen."
    },
    {
      "title": "Select a product.",
      "content": "Select a product. Scroll down to the \"DEVICES\" heading, then select TV or Auxiliary Device depending on whether you want to program your remote for a TV or any other product (e.g., a DVD player)."
    },
    {
      "title": "Select the PAIRING WIZARD option.",
      "content": "Select the PAIRING WIZARD option. You'll find it near the top of the screen."
    },
    {
      "title": "Select your product's brand.",
      "content": "Select your product's brand. Select the letter combination that applies to your product's manufacturer, then scroll down through the list of manufacturers until you find the correct one and select it."
    },
    {
      "title": "Select Next.",
      "content": "Select Next . It's on the right side of the screen."
    },
    {
      "title": "Test your remote.",
      "content": "Test your remote. Depending on the product with which you're trying to pair your remote, this step will vary: TV — Press the Volume Up button and look for an increase in volume. Anything else — Press the Power button and look at the product to see if it turns on or off."
    },
    {
      "title": "Try a different code.",
      "content": "Try a different code. If testing your remote doesn't do anything, select Try Next Code at the bottom of the screen and then re-test your remote."
    },
    {
      "title": "Select Finished when you find the correct code.",
      "content": "Select Finished when you find the correct code. Once you find the correct code for your remote, selecting Finished at the bottom of the screen will complete the programming process. Your remote should now work with your TV or auxiliary product."
    },
    {
      "title": "Make sure that you have the correct type of remote.",
      "content": "Make sure that you have the correct type of remote. If you have a model 20.0, 20.1, 21.0, or 21.1 remote, you'll want to use this method. If you have a 40.0, 50.0, 52.0, or 54.0 style remote, you'll need to use the previous method instead. You can find your remote's style number in the manual."
    },
    {
      "title": "Open the remote model website.",
      "content": "Open the remote model website. Go to https://my.dish.com/support/products/remotes/how-to/program-to-tvother in your computer's web browser."
    },
    {
      "title": "Select your remote type.",
      "content": "Select your remote type. Click the 20.0, 20.1, 21.0, 21.1 heading near the top of the page."
    },
    {
      "title": "Click the three-digit remote control link.",
      "content": "Click the three-digit remote control link. It's in the step text of step 2 near the middle of the page. Doing so opens a pop-up window."
    },
    {
      "title": "Click the \"Select a Model\" drop-down box.",
      "content": "Click the \"Select a Model\" drop-down box. You'll see this box in the middle of the window. Doing so prompts a drop-down menu."
    },
    {
      "title": "Select your remote's name.",
      "content": "Select your remote's name. Scroll down until you find the specific model name and number for your remote, then click it. Again, you can find this number in your remote's manual."
    },
    {
      "title": "Select a product.",
      "content": "Select a product. Click the \"Select a Product Type\" drop-down box, then click the name of the product for which you want to program your remote (e.g., DVD )."
    },
    {
      "title": "Select a manufacturer.",
      "content": "Select a manufacturer. Click the \"Select a Manufacturer\" drop-down box, then click your product's manufacturer name."
    },
    {
      "title": "Review the available codes.",
      "content": "Review the available codes. Depending on the information you entered, you should see at least one three-digit code here. Some products may have 10 or more possible codes. If so, try to use one that has the highest \"Success Count\" rating (it should be the top code in the list) first."
    },
    {
      "title": "Turn on the product for which you want to program the remote.",
      "content": "Turn on the product for which you want to program the remote. For example, if you want to program the remote to work with your DVD player, make sure the DVD player is on."
    },
    {
      "title": "Point the remote at the product and hold the correct button.",
      "content": "Point the remote at the product and hold the correct button. This button will depend on what you're trying to program the remote for: TV — Press and hold the TV button at the top of the remote. Anything else — Press and hold either the AUX button (all products) or the DVD button (DVD players and VCRs)."
    },
    {
      "title": "Wait for the remote's four lights to flash.",
      "content": "Wait for the remote's four lights to flash. These lights are at the top of the remote. Once you see them flash, you can release the button you're holding and proceed with entering a code."
    },
    {
      "title": "Enter a code.",
      "content": "Enter a code. Using the remote's number pad, type in the three-digit code that you found for your product. You may need to enter an additional number depending on the product: If programming your remote for a VCR or DVD player, enter a 1 before you enter the three-digit code. If programming for any other non-TV product, enter a 2 before you enter the three-digit code. If you held down the AUX button while attempting to connect your remote with your TV, you'll enter a 0 before the three-digit code."
    },
    {
      "title": "Press #.",
      "content": "Press # . Doing so will enter your code."
    },
    {
      "title": "Look for three flashes.",
      "content": "Look for three flashes. These will appear near the TV , AUX , or DVD button depending on which one you used. If you see three flashes, your remote is now programmed for use with the selected product. If you don't see the three flashes, you'll have to try using a different three-digit code. If you run out of three-digit codes, try scanning for the code ."
    },
    {
      "title": "Understand how scanning works.",
      "content": "Understand how scanning works. Scanning allows you to manually run through all available codes for your selected product. While this is a good way to ensure that you'll eventually get the right code, it can also require you to scan through hundreds of codes before you find the correct one."
    },
    {
      "title": "Turn on the product for which you want to program the remote.",
      "content": "Turn on the product for which you want to program the remote. For example, if you want to program the remote to work with your DVD player, make sure the DVD player is on."
    },
    {
      "title": "Point the remote at the product and hold the correct button.",
      "content": "Point the remote at the product and hold the correct button. This button will depend on what you're trying to program the remote for: TV — Press and hold the TV button at the top of the remote. Anything else — Press and hold either the AUX button (all products) or the DVD button (DVD players and VCRs)."
    },
    {
      "title": "Wait for the remote's four lights to flash.",
      "content": "Wait for the remote's four lights to flash. These lights are at the top of the remote. Once you see them flash, you can release the button you're holding and proceed."
    },
    {
      "title": "Press the POWER button.",
      "content": "Press the POWER button. It should be at the top of your remote. This will signify that your remote is now ready to begin scanning."
    },
    {
      "title": "Start pressing the remote's \"Up\" or \"Down\" arrow.",
      "content": "Start pressing the remote's \"Up\" or \"Down\" arrow. This will start scanning through available codes. Each press of the arrow will test another code."
    },
    {
      "title": "Continue pressing the arrow until your product turns off.",
      "content": "Continue pressing the arrow until your product turns off. When your product turns off, you've found the correct code."
    },
    {
      "title": "Press #.",
      "content": "Press # . This will confirm the code and apply it to your remote."
    },
    {
      "title": "Press your remote's POWER button again.",
      "content": "Press your remote's POWER button again. Your product should turn on, signifying that your remote is now programmed for the product."
    }
  ]
}