{
  "url": "https://www.wikihow.com/Pin-on-a-Boutonniere",
  "title": "How to Pin on a Boutonniere or Corsage Perfectly",
  "steps": [
    {
      "title": "Hold the boutonniere correctly.",
      "content": "Hold the boutonniere correctly. The floral center should be facing you, and away from your date's chest. The greenery, such as the leaves, should be facing away from you, toward your date's chest."
    },
    {
      "title": "Lay the boutonniere flat against the left lapel of the suit.",
      "content": "Lay the boutonniere flat against the left lapel of the suit. Think of it as going above your date's heart. It should be roughly equidistant between the left and right edges of the lapel. [1] X Expert Source Rachel Cho Floral Designer & Plant Specialist Expert Interview. 20 August 2021."
    },
    {
      "title": "Move the boutonniere so that the flower is on or just below the broadest part of the lapel, covering the top button hole.",
      "content": "Move the boutonniere so that the flower is on or just below the broadest part of the lapel, covering the top button hole. [2] X Expert Source Rachel Cho Floral Designer & Plant Specialist Expert Interview. 20 August 2021. Position the stem at a slight angle so it is running parallel to the edge of the lapel. [3] X Research source"
    },
    {
      "title": "Lift the lapel to expose the back, holding the flower in place with your non-dominant hand.",
      "content": "Lift the lapel to expose the back, holding the flower in place with your non-dominant hand. Inserting the pin from the back will keep the pin hidden so the metal won't catch the light when you take pictures. [4] X Research source"
    },
    {
      "title": "Push the pin through the back of the lapel and through the stem of the boutonniere.",
      "content": "Push the pin through the back of the lapel and through the stem of the boutonniere. Position the pin so that it is facing down. The point of the pin should go through the stem where it is thick, just below where it attaches to the petals. [5] X Research source"
    },
    {
      "title": "Guide the pin back through the stem and lapel, as though sewing a stitch.",
      "content": "Guide the pin back through the stem and lapel, as though sewing a stitch. [6] X Research source The pin should be secure and lay vertically against the lapel. The overall movement is a simple push out all the way through the fabric and the flower stem, then weaving back in through the flower stem and fabric. [7] X Expert Source Rachel Cho Floral Designer & Plant Specialist Expert Interview. 20 August 2021. You can also think of the pin as going forward through the fabric and stem, then back through the fabric again. The head of the pin and the point of the pin will both end up on the back of the lapel, hidden from view."
    },
    {
      "title": "Wiggle the boutonniere to make sure it is securely fastened.",
      "content": "Wiggle the boutonniere to make sure it is securely fastened. Take a step back and examine the placement, making sure it is not askew or starting to pivot on the pin. [8] X Research source"
    },
    {
      "title": "Use a second pin if you need extra support.",
      "content": "Use a second pin if you need extra support. If the boutonniere is heavy, you may want to secure it with an second pin. Simply stitch the pin through the lapel and boutonniere as you did before, with this second pin about half an inch below the first. [9] X Research source"
    },
    {
      "title": "Figure out where to position the boutonniere.",
      "content": "Figure out where to position the boutonniere. If there is a pocket on the left side of shirt, this will make things easy--you'll want to pin the flower through the top middle of the pocket, where it may be slightly reinforced and a little stronger. If there is no pocket, you will pin through the upper left side of the shirt. You can imagine pinning it above the person's heart or where a pocket would be located. [10] X Research source Because the pin will be visible, you may want to choose a fancy gold pin or one with a decorative head. [11] X Research source"
    },
    {
      "title": "Pinch the fabric of the shirt between your fingers of your non-dominant hand and slide the pin through with your dominant hand.",
      "content": "Pinch the fabric of the shirt between your fingers of your non-dominant hand and slide the pin through with your dominant hand. It will appear as though you are pinning the fabric together. Push the pin completely through this fold of fabric. [12] X Research source Unlike on a lapel, the pin should be held horizontally, or parallel to the floor. With this method you are pinning the stem tightly against the chest and not actually piercing the stem of the boutonniere with the pin."
    },
    {
      "title": "Slide the stem of the boutonniere between the shirt and the pin.",
      "content": "Slide the stem of the boutonniere between the shirt and the pin. The pin should be over the stem and holding it against the fabric. You want the pin to cross the stem near the top, where it meets the petals of the flower. [13] X Research source Make sure the boutonniere is facing the right direction, with the flower facing toward you and away from the person wearing the boutonniere."
    },
    {
      "title": "Pinch the unpinned fabric on the other side of the boutonniere stem and push the pin all the way through.",
      "content": "Pinch the unpinned fabric on the other side of the boutonniere stem and push the pin all the way through. It should again be as though you are pinning together the fabric pinched between your fingers. [14] X Research source Imagine that the stem of the boutonniere is in a valley and the two folds of fabric that you pinned on either side are mountains."
    },
    {
      "title": "Stretch the shirt so that the fabric you pinned together lays flat against the chest.",
      "content": "Stretch the shirt so that the fabric you pinned together lays flat against the chest. When you look at the pin, it should go into the shirt, then out, then over the boutonniere stem, then into the shirt and then out a final time. [15] X Research source The shirt should be smooth and the flower secure."
    },
    {
      "title": "Feel the weight of the fabric.",
      "content": "Feel the weight of the fabric. The fabric of the dress may not be sturdy enough to support a corsage on its own, especially since they are often larger than boutonnieres. If the fabric is sheer, lace, or just feels very lightweight, you'll want to incorporate a slip or bra strap to make sure the corsage stays up. [16] X Research source"
    },
    {
      "title": "Slide the fingers of your non-dominant hand under the collar of the dress, leaving your thumb on the outside.",
      "content": "Slide the fingers of your non-dominant hand under the collar of the dress, leaving your thumb on the outside. You'll want to lift the fabric up away from the skin so there's no danger of poking your date. [17] X Research source The corsage, like the boutonniere, should be pinned to the left side of the dress. If you are pinning through a bra strap to secure the flower, use your fingers to lift that away from the skin as well."
    },
    {
      "title": "Place the corsage on the dress, right below the shoulder and across from the armpit.",
      "content": "Place the corsage on the dress, right below the shoulder and across from the armpit. Hold the arrangement in place with your thumb, making sure it is positioned straight. [18] X Research source"
    },
    {
      "title": "Hold the pin horizontally and weave it into the fabric and then out again, as though sewing a single stitch.",
      "content": "Hold the pin horizontally and weave it into the fabric and then out again, as though sewing a single stitch. Start from the side closest to the arm, so the head of the pin is pointing to the arm and the point of the pin is pointing toward the breast bone. If you are using the bra strap, the pin should pass through the dress and the strap, then out again."
    },
    {
      "title": "Pass the point of the pin over the stem of the flower.",
      "content": "Pass the point of the pin over the stem of the flower. The stem should be held tight between the fabric of the dress and the length of the pin. [19] X Research source"
    },
    {
      "title": "Weave the pin into the fabric and then out again, again like a simple stitch.",
      "content": "Weave the pin into the fabric and then out again, again like a simple stitch. Smooth the fabric of the dress so that the corsage lays flat against the chest. If you examine the pin, it should go into the dress (and possibly bra strap), then out, then over the stem of the flower, then into the dress and back out again. [20] X Research source"
    },
    {
      "title": "Locate the buttonhole on the left lapel of the suit and make sure it is open.",
      "content": "Locate the buttonhole on the left lapel of the suit and make sure it is open. Suits rarely come equipped with this buttonhole, which is specifically for a boutonniere, since wearing a flower in your lapel is not really in fashion. To be functional, the buttonhole should be open (not sewn shut), reinforced with stitching, and have a latch 1–2 inches (2.5–5.1 cm) below it on the back of the lapel. [21] X Research source If your jacket is lacking any of these elements, visit a dry cleaner or anywhere they do alterations and ask them to cut a buttonhole for you. [22] X Research source Don't do this with a rented or borrowed jacket. Just pin the boutonniere to your lapel instead."
    },
    {
      "title": "Slide the stem of the flower through the buttonhole, angling the stem down.",
      "content": "Slide the stem of the flower through the buttonhole, angling the stem down. The stem should pass through the latch as well, which will hold the flower in place. [23] X Research source The latch is essentially a thin cord (often silk) sewn onto the back of the lapel to help secure the flower and hold it upright. [24] X Research source"
    },
    {
      "title": "Push the flower into the buttonhole until the stem is not visible.",
      "content": "Push the flower into the buttonhole until the stem is not visible. Only the flower should be seen from the front of the lapel. [25] X Research source If the stem is too long, give it a snip so it won't peek out from under your lapel."
    }
  ]
}