{
  "url": "https://www.wikihow.com/Reset-Any-User%27s-Password-on-a-Mac",
  "title": "How to Reset Any User's Password on a Mac",
  "steps": [
    {
      "title": "Log in with the password you want to change.",
      "content": "Log in with the password you want to change. Use this method if you know the password you want to change. If you want to reset another user’s password or if you’ve forgotten all your passwords, use one of the methods below."
    },
    {
      "title": "Navigate to System Settings.",
      "content": "Navigate to System Settings. Open the Apple menu in the top left corner of your screen and select System Settings (or System Preferences in older versions of macOS). [1] X Research source"
    },
    {
      "title": "Click Users & Groups.",
      "content": "Click Users & Groups . You’ll find this in the sidebar on the left side of the System Settings window. You may need to scroll down. In older versions of macOS, you will see this option in the main System Preferences window. [2] X Research source"
    },
    {
      "title": "Click the i next to your username.",
      "content": "Click the i next to your username. Select the user whose password you want to change and click the i next to it. A new window will pop up."
    },
    {
      "title": "Select Change… next to the Password field.",
      "content": "Select Change… next to the Password field."
    },
    {
      "title": "Enter your current password, then type in the new one.",
      "content": "Enter your current password, then type in the new one. In the window that opens, you’ll be asked to type in your old password, then enter the new one twice. You can also enter a hint to help jog your memory in case you forget the new password. If you’re having trouble coming up with a good password, click the key symbol next to the New Password field for a suggestion."
    },
    {
      "title": "Click Change Password.",
      "content": "Click Change Password . Your changes will be saved. Next time you restart your Mac, you’ll need to log in with the new password."
    },
    {
      "title": "Log in with an administrator account.",
      "content": "Log in with an administrator account. As an administrator, you can reset the passwords of other user accounts on your Mac, even if you’ve forgotten them (or never knew them). The easiest way to do this is in System Settings . To start, log into your computer with your administrator username and password."
    },
    {
      "title": "Open System Settings.",
      "content": "Open System Settings . Click the icon in the top right corner of your screen, then select System Settings (or System Preferences )."
    },
    {
      "title": "Click Users & Groups.",
      "content": "Click Users & Groups . This option is located in the menu bar on the left side of the System Settings window. You might need to scroll down. In older versions of macOS, you will find Users & Groups in the main System Preferences window."
    },
    {
      "title": "Select i next to the user whose password you want to reset.",
      "content": "Select i next to the user whose password you want to reset. A new window will pop open. In older versions of macOS, you’ll have to click the padlock symbol and enter your admin login credentials again before you can select the user whose password you want to reset."
    },
    {
      "title": "Click Reset….",
      "content": "Click Reset… . A window will open with options for resetting the password."
    },
    {
      "title": "Enter the new password twice.",
      "content": "Enter the new password twice. Type the new password in the New Password field, then type it again in the Verify field. You can also enter a password hint to help the user remember their new password in case they forget it."
    },
    {
      "title": "Click Reset Password.",
      "content": "Click Reset Password . Next time the user logs in, they’ll need to use the new password you set up for them. Note that this is different from simply changing a password. You don’t need to know the current password to do it, but you or the user will need to update the password in the computer’s Keychain Access settings ."
    },
    {
      "title": "Restart your Mac.",
      "content": "Restart your Mac. If you’ve completely forgotten all your passwords, you can usually reset from the login screen at startup. To begin, restart your Mac to get to the login screen if you’re not there already. [3] X Research source If you can’t restart your Mac normally, press and hold the power button or Touch ID button until it turns off. Then press it again to power your computer on."
    },
    {
      "title": "Connect to the internet if you aren’t already.",
      "content": "Connect to the internet if you aren’t already. Some methods for resetting your password require an internet connection. Click the Wi-Fi button in the menu bar at the top of the screen and select a network."
    },
    {
      "title": "Try entering your password up to 3 times.",
      "content": "Try entering your password up to 3 times. After the third failed attempt, you’ll see some options to reset your password. You may see one or more of the following: “Restart and show password reset options” “Reset it using your Apple ID” “Reset it using your recovery key” “Your account is locked. Try again in [duration].” If you see this message, you’ll need to wait for the stated amount of time to go by, then restart your computer and try again."
    },
    {
      "title": "Restart if prompted to do so.",
      "content": "Restart if prompted to do so. If you get the “Restart and show password reset options” message, click it to restart your computer. This could go a few different ways depending on your settings: If you’re asked which volume to recover, choose your startup disk (usually Macintosh HD ). Sign in with your Apple ID and password if prompted. You might also need to enter a verification code from one of your other trusted devices . If you have FileVault set up, you may be prompted to enter the recovery key you got when you first enabled FileVault. If you’ve lost it, you’ll probably need to reset your password from Recovery Mode . You may see a message saying you don’t have iCloud recovery or a recovery key set up, in which case you’ll also need to reset from Recovery Mode. If you’re able to successfully use one of the previous options, you can then select a user whose password you want to reset. Click Next . Enter the new password, click Next , then click Restart ."
    },
    {
      "title": "Reset with your Apple ID and password.",
      "content": "Reset with your Apple ID and password. If you see this option, click on it to get started. Your Mac may restart (in which case, follow the instructions in the previous step to proceed), or it might immediately prompt you to enter your Apple ID and password. If the latter happens, log in with your Apple ID and click Reset Password . Next: Do one of the following, depending on how your Mac is set up: If prompted to save the user’s passwords to a new keychain, click OK . Your Mac will restart. You might be prompted to select an admin user whose password you know so you can reset from that account. If you don’t remember any passwords, click Forgot all passwords? Click Deactivate Mac if you see a Reset Password window with that option. Don’t worry—this won’t permanently erase or deactivate your account! It’s only temporary. Enter your new password for each account you’d like to reset, then click Next . Click Restart when you’re done."
    },
    {
      "title": "Reset with your recovery key if you have one.",
      "content": "Reset with your recovery key if you have one. If you enabled FileVault on your Mac, you should have a recovery key that you can use instead of your Apple ID and password. This is a long string of letters and numbers. If you see this option after three failed attempts to enter your password, click it. Then: Type in your FileVault recovery key. If you don’t have it, you’ll need to reset from Recovery Mode. Enter the new password and click Reset Password . Follow the prompts onscreen to finish the process."
    },
    {
      "title": "Try to enter your password a few times.",
      "content": "Try to enter your password a few times. After a few failed attempts, you may see a message giving you an option to reset your password. [4] X Research source"
    },
    {
      "title": "Use your Apple ID and password if prompted.",
      "content": "Use your Apple ID and password if prompted. You’ll only see this option if your account is set up to allow logging in with an Apple ID. If you get a message asking you to log in with your Apple ID: Click the play symbol next to the message and follow the on-screen instructions to set up your new password. Restart when prompted. Log in with your new password. You may need to update the password in your keychain settings ."
    },
    {
      "title": "Use your recovery key if FileVault is enabled.",
      "content": "Use your recovery key if FileVault is enabled. If you have FileVault set up, you might see a message asking you to reset using your recovery key. This is a long string of letters and numbers you got when you turned on FileVault. If you see this option: Click the play symbol next to the message asking if you want to reset with your recovery key. The Password field will change into a Recovery Key field. Type in your recovery key, making sure to include any capital letters and hyphens. Follow the onscreen prompts to create a new password, then click Reset Password . You may need to update your keychain with the new password."
    },
    {
      "title": "Start your Mac up in Recovery Mode if other methods fail.",
      "content": "Start your Mac up in Recovery Mode if other methods fail. If you’ve tried simpler methods for changing or resetting your password(s) without success, you might be able to do it in Recovery Mode. The right way to start up in Recovery Mode depends on what kind of processor your Mac has. [5] X Research source Apple silicon chip (M1, M2, or M3): Press and hold the power button until your Mac boots up and displays a screen with startup options. Click Options , then click the Continue button. Intel processor: Press and release the power button to start up your Mac as you usually would. As soon as you release the power button, press and hold Command+R until you see an Apple logo or a spinning globe. Connect to a Wi-Fi network if prompted to do so."
    },
    {
      "title": "Select Forgot all passwords?.",
      "content": "Select Forgot all passwords? . At this point, you might be prompted to sign in with a known administrator account so you can reset your password(s) from there. If you see this option and you don’t know an administrator password, click Forgot all passwords? If you don’t see this option, skip to the instructions for using the Reset Password assistant below."
    },
    {
      "title": "Reset the password with your Apple ID or recovery key.",
      "content": "Reset the password with your Apple ID or recovery key. Depending on how your computer is set up, you might be prompted to use your Apple ID or your FileVault recovery key to reset your forgotten password(s). Apple ID: If you’re prompted for your Apple ID, enter your Apple ID and password. You may be asked to enter a verification code sent to one of your trusted devices. Select the user whose password you want to reset. Enter the new password information and click Next , then click Exit . Go to Apple menu > Restart and log in with the new password. If you see an Activation Lock screen after you restart, click Exit to Recovery Utilities and proceed with the instructions below for using the Reset Password assistant. Recovery Key: If you’re asked for your recovery key, enter the combination of numbers and letters you received when you enabled FileVault on your computer. Make sure to include any capitalized characters and hyphens. Click Reset Password and choose the user whose password you want to reset. Enter the new password information and click Exit . Go to Apple menu > Restart . Log in with your new password."
    },
    {
      "title": "Use the Reset Password assistant if you don’t see the other options.",
      "content": "Use the Reset Password assistant if you don’t see the other options. If you aren’t able to reset with your Apple ID or your recovery key in Recovery Mode, you should see a Utilities window when you enter Recovery Mode. If you see this option: Click Utilities in the menu bar and select Terminal . This will launch the Terminal app . When the Terminal window opens, type resetpassword . Press Return . This will launch the Reset Password assistant."
    },
    {
      "title": "Click Forgot all passwords? if prompted for an admin password.",
      "content": "Click Forgot all passwords? if prompted for an admin password. Once you’re in the Reset Password assistant, you might be asked to log in with a known administrator password. If this happens, select Forgot all passwords? ."
    },
    {
      "title": "Select Deactivate Mac.",
      "content": "Select Deactivate Mac . Don’t worry, this is only temporary and won’t erase your Mac. Click Deactivate to confirm your selection."
    },
    {
      "title": "Enter your Apple ID and password if you see an Activation Lock screen.",
      "content": "Enter your Apple ID and password if you see an Activation Lock screen. If you have Activation Lock enabled, you’ll need to log in with your Apple ID and password to continue. After logging in, click Next ."
    },
    {
      "title": "Type in your new password.",
      "content": "Type in your new password. In the Reset Password window, enter your new password information. If you’re resetting for multiple accounts, click Set Password next to each account."
    },
    {
      "title": "Click Exit.",
      "content": "Click Exit . Once you’ve finished entering the new password information for every account you want to reset, click Exit ."
    },
    {
      "title": "Restart and log in with your new password.",
      "content": "Restart and log in with your new password. Open the Apple menu and select Restart . You should now be able to log in with your new password."
    },
    {
      "title": "Erase your Mac if nothing else works.",
      "content": "Erase your Mac if nothing else works. If you still can’t reset your password, you may need to reset your Mac completely and start fresh. You can also do this from Recovery Mode."
    },
    {
      "title": "Start up in Recovery Mode.",
      "content": "Start up in Recovery Mode. Follow the instructions in the Recovery Mode method to start up your Mac."
    },
    {
      "title": "Select Erase Mac in the Recovery Assistant menu.",
      "content": "Select Erase Mac in the Recovery Assistant menu. When asked to log in with an admin password, select Recovery Assistant > Erase Mac ."
    },
    {
      "title": "Confirm your selection.",
      "content": "Confirm your selection. In the Erase Mac window, click Erase Mac , then click Erase . Your Mac may restart to a screen with a flashing question mark. If this happens, hold down the power button for a few seconds until it powers down."
    },
    {
      "title": "Start up in Recovery Mode again and reinstall macOS.",
      "content": "Start up in Recovery Mode again and reinstall macOS. Once you restart, reinstall macOS and set your Mac up anew or from a backup."
    }
  ]
}