{
  "url": "https://www.wikihow.com/Measure-Elbow-Breadth",
  "title": "How to Measure Elbow Breadth",
  "steps": [
    {
      "title": "Stand up straight with your feet together.",
      "content": "Stand up straight with your feet together. It is easier to get your arm and elbow into the proper alignment, and therefore get a more accurate measurement, in this upright position. If you’re not concerned with precision accuracy, however, taking the measurement from a seated position won’t change the results by much."
    },
    {
      "title": "Extend your dominant arm straight out, parallel to the ground.",
      "content": "Extend your dominant arm straight out, parallel to the ground. If you’re right-handed, use your right arm, and use your left arm if you’re left-handed. If, however, you have to use your non-dominant arm (due to an injury, for instance), there will be little to no difference in the resulting measurement. [1] X Research source If you’re wearing long sleeves, roll them up so your elbow is fully exposed."
    },
    {
      "title": "Bend your elbow at a 90-degree angle and extend your fingers.",
      "content": "Bend your elbow at a 90-degree angle and extend your fingers. Your upper arm should be pointed straight forward, and your lower arm (and fingers) pointed straight upward. Position your wrist so that your palm is facing toward you and the back of your hand away from you. [2] X Research source Some sources recommend closing the fingers into a loose fist instead of extending them, but with the wrist in the same position. In either case, your resulting measurements should be essentially the same."
    },
    {
      "title": "Have a friend use a sliding caliper to measure, if possible.",
      "content": "Have a friend use a sliding caliper to measure, if possible. A sliding caliper is basically a ruler with two pincers attached to it. One pincer is stationary at the end of the ruler, and the other slides so you can measure the distance between the pincers. You can use a caliper intended for medical purposes, or even one made for home improvement or automotive uses. You can take the measurement with a caliper yourself, but it’s much easier to get an accurate measurement if someone else does it for you. If you don’t have a caliper, you’ll have to improvise and use your thumb and forefinger and a ruler to take a less accurate measurement."
    },
    {
      "title": "Measure the widest part of the elbow with the caliper.",
      "content": "Measure the widest part of the elbow with the caliper. Slide the pincers apart so they are comfortably wider than the elbow. Hold the caliper up to the elbow so that the stationary pincer and the base of the caliper are snug against the elbow. Slide the movable pincer until it is also snug against the elbow. The pincers should be pointed straight up at the same angle as the lower arm. The pincers should be firmly against the bones of your elbow, but you don’t need to squeeze them tightly. You should be able to slide the caliper straight down off the elbow without loosening the pincers."
    },
    {
      "title": "Use your other thumb and forefinger as a makeshift caliper, if needed.",
      "content": "Use your other thumb and forefinger as a makeshift caliper, if needed. If you only need a relatively accurate elbow measurement, pinch the thumb and forefinger of your non-dominant hand against either side of your dominant elbow. Your thumb and forefinger should be pointed upward at the same angle as your lower arm, and you should try to measure at the elbow’s widest point. [3] X Research source Pinch firmly enough that you feel the bone in your elbow, but don’t squeeze your thumb and forefinger with full pressure. Unlike using calipers, it’s just as easy for you to do this less-accurate measurement yourself as it is to have a friend do it."
    },
    {
      "title": "Measure the width between your thumb and forefinger with a ruler.",
      "content": "Measure the width between your thumb and forefinger with a ruler. Try your best to keep your thumb and forefinger in the same position, and slide them off of your elbow. Hold a ruler between them, or rest them on a ruler placed on a desktop. Record the measurement as accurately as you can. [4] X Research source It’s impossible for you to keep your thumb and forefinger in the exact same position the whole time, so this measurement can never be reliably accurate with any real precision. You might want to repeat the measurement a few times and use the average."
    },
    {
      "title": "Measure your body height.",
      "content": "Measure your body height . If you don’t have access to a stadiometer (the height measurement tool you find connected to weight scales in locker rooms and doctor’s offices), you can use a blank wall, a pencil, and a tape measure: [5] X Research source Stand up straight in your bare feet, with your feet together and your heels, buttocks, shoulder blades, and the back of your head touching the wall. Hold the pencil level on top of your head and mark the position on the wall. (Your reading will be more accurate if you have a friend do this.) Measure the distance up the wall from the floor to the mark."
    },
    {
      "title": "Search online for a body frame calculator.",
      "content": "Search online for a body frame calculator. Enter “body frame calculator” into your favorite search engine and check out a few of the results. Body frame calculators that use elbow breadth all require the same information: your sex, height, and elbow breadth. There isn't any noticeable difference in quality among the body frame calculators that tend to come up in search results. You can enter your data into several of them to confirm the results, if desired. If, however, you come across a site that asks for any type of personal information (beyond the basic data), choose a different calculator."
    },
    {
      "title": "Enter your sex, body height, and elbow breadth data.",
      "content": "Enter your sex, body height, and elbow breadth data. Simply type the required data into the relevant boxes, hit “calculate” (or similar), and you’ll have your results within seconds! [6] X Research source Your sex is required because there are different body frame scales (but the same Small, Medium, and Large categories) for males and females. You can use feet/inches or meters/centimeters for your measurements, but make sure you use the same scale for both your height and wrist breadth. Most body frame calculators will let you choose either measurement scale."
    },
    {
      "title": "Identify your body frame as Small, Medium, or Large.",
      "content": "Identify your body frame as Small, Medium, or Large. Your body frame category helps provide a general guide for your ideal weight range, which might also be provided with your results. However, your ideal weight range may vary due to health conditions or other factors, so it’s best to consult with your doctor about this information. [7] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Elbow breadth has been the recommended measurement tool (along with height and sex) for determining body frame size for many years. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can also use wrist circumference instead of elbow breadth (many body frame calculators offer this option), but this measurement can be more impacted by factors like age and body fat amounts. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}