{
  "url": "https://www.wikihow.com/Measure-a-Pulley-Belt-Size",
  "title": "How to Measure a Pulley Belt Size",
  "steps": [
    {
      "title": "Mark a line across the belt with a white marker.",
      "content": "Mark a line across the belt with a white marker. Hold the belt in 1 hand and take a white marker or a piece of chalk and mark a line on the outside of it. Make the line all the way across the width of the belt. [1] X Research source Make sure the line is thick enough to be visible and won’t rub off too easily while you’re measuring."
    },
    {
      "title": "Line up a measuring tape with the line on the belt.",
      "content": "Line up a measuring tape with the line on the belt. Use a flexible tape measure so you can wrap it around the surface of the belt. Line up the end of the tape where the measurements begin with the line you marked on the belt. [2] X Research source Make sure the marking is lined up exactly where the measurements begin, rather than with any metal clasp or plastic that may be on the end of the measuring tape."
    },
    {
      "title": "Wrap the measuring tape around the belt until it meets the mark.",
      "content": "Wrap the measuring tape around the belt until it meets the mark. Use 1 hand to hold the tape measure in place while you wrap it around the belt. Keep it flush with the surface of the belt and make sure there aren’t any folds or creases that could affect your measurement. Continue wrapping the tape measure until it meets the other end. [3] X Research source Keep tension on the measuring tape so your measurements are accurate."
    },
    {
      "title": "Hold your finger where the tape meets the mark and note the distance.",
      "content": "Hold your finger where the tape meets the mark and note the distance. Once you’ve wrapped the measuring tape around the belt, use your index finger to mark where they meet and then remove it. The point where they meet is the size of the pulley belt. [4] X Research source You can make a marking on the measuring tape or write down the measurements so you have them for future reference."
    },
    {
      "title": "Use string if the belt is on the pulley or if there is no belt.",
      "content": "Use string if the belt is on the pulley or if there is no belt. If you’re trying to find the size of a belt that is connected to pulleys without removing it, use a roughly 4 ft (1.2 m) long piece of string. You can also use string to find the belt size using the pulleys themselves if there is no belt."
    },
    {
      "title": "Hold 1 end of the string on top of the belt or 1 of the pulleys.",
      "content": "Hold 1 end of the string on top of the belt or 1 of the pulleys. Take the end of the string and choose a pulley to place it on top of. Use 1 hand to hold the string in place so it doesn’t move when you take your measurements. It doesn’t matter which pulley you choose, whether you have a belt attached to it or not."
    },
    {
      "title": "Wrap the string around the pulleys until it meets the other end.",
      "content": "Wrap the string around the pulleys until it meets the other end. Keeping the end of the string held against the pulley, bring the string around the other pulley until it meets it. Maintain tension on the string so its taut. [5] X Research source Use your hand to hold the string so it’s connected to the end."
    },
    {
      "title": "Mark the string where it meets the other end and remove it.",
      "content": "Mark the string where it meets the other end and remove it. Use a marker to make a line on the string where it meets the end on the pulley. Then, take the string off of the pulleys. [6] X Research source Make sure the marking is visible on the string."
    },
    {
      "title": "Lay the string flat and measure the distance between the end and the mark.",
      "content": "Lay the string flat and measure the distance between the end and the mark. Place the string on a flat, even surface and stretch it out so it’s straight and taut. Use a ruler or tape measure to measure the distance from the end of the string to the marking you made to find the size of the pulley belt. [7] X Research source"
    },
    {
      "title": "Inspect the surface of the belt to look for a code printed on it.",
      "content": "Inspect the surface of the belt to look for a code printed on it. If you have the belt that you need to measure, check the outer surface for a code printed in white letters. Look for a series of letters and numbers that are repeated in multiple locations along the belt. [8] X Research source If you don’t have a belt to measure, you’ll need to use the pulleys to determine the belt size. If the belt is really worn, you may not be able to see the code printed on the surface. If that’s the case, you’ll need to measure the belt itself."
    },
    {
      "title": "Look for an A, B, C, D, or E in front of the code to identify a classical belt.",
      "content": "Look for an A, B, C, D, or E in front of the code to identify a classical belt. A classical belt is the most common type of pulley belt and uses the letters A-E in the prefix to identify a specific top width and depth. Classical belt codes are designated by the inside circumference. So to find the pulley belt length, you need to add the width of the belt to the circumference measurement designated in the belt code. [9] X Research source If you’re replacing your pulley belt, choose a replacement that has the same prefix so you know it fits the pulleys."
    },
    {
      "title": "Identify an FHP belt by a 3L, 4L, or 5L prefix on the code.",
      "content": "Identify an FHP belt by a 3L, 4L, or 5L prefix on the code. Fractional horsepower belts, or FHP belts, are often found in appliances and small machines. Look for the prefix that identifies an FHP belt in the belt code. FHP belt codes designate the outside circumference measurement of the belt. To find the length of the belt, use the number following the FHP belt prefix. [10] X Research source For example, if the belt code reads, “4L360,” then the belt is 36 inches (91 cm) long. Choose a replacement FHP with the same prefix so it fits the pulleys properly."
    },
    {
      "title": "Find a 3V, 5V, or 8V prefix to identify a Deep V-belt.",
      "content": "Find a 3V, 5V, or 8V prefix to identify a Deep V-belt. Deep V, also known as narrow belts, are thicker than classical belts and are often used in compact drives. Their codes identify the outer circumference of the belt, so to find the length, look for the number that follows the prefix for an accurate measurement. [11] X Research source For instance, if the code on the belt looks like, “5V280,” then the belt length is 28 inches (71 cm). Choose a belt with the same prefix if you plan to replace your Deep V-belt."
    }
  ]
}