{
  "url": "https://www.wikihow.com/See-How-Many-Apps-Are-on-Your-iPhone",
  "title": "How to See How Many Apps Are on Your iPhone",
  "steps": [
    {
      "title": "Open your iPhone's Settings.",
      "content": "Open your iPhone's Settings . Do this by tapping the icon with gray cogs on your home screen. It may be in a folder labeled “Utilities.”"
    },
    {
      "title": "Tap General.",
      "content": "Tap General ."
    },
    {
      "title": "Tap About.",
      "content": "Tap About . This will display a table with various information about your phone."
    },
    {
      "title": "Find “Applications” in the table.",
      "content": "Find “Applications” in the table. The number displayed to the right of it shows how many third party apps are on your iPhone. It does not include any default iPhone apps or webpage links you saved to your screen."
    },
    {
      "title": "Open your iPhone's Settings.",
      "content": "Open your iPhone's Settings . This is the app with gray cogs located on your home screen. If you don't see it, check in a folder labeled \"Utilities.\""
    },
    {
      "title": "Scroll down and tap General.",
      "content": "Scroll down and tap General . You'll find it in the third set of options."
    },
    {
      "title": "Tap Storage and iCloud Usage.",
      "content": "Tap Storage and iCloud Usage ."
    },
    {
      "title": "Tap Manage Storage in the first set of options.",
      "content": "Tap Manage Storage in the first set of options. This will display apps that take up the most storage on your phone in descending order."
    },
    {
      "title": "Tap on an app.",
      "content": "Tap on an app. This will take you to a screen where you can view its version and documents & data size."
    },
    {
      "title": "Tap Delete App to remove the app from your phone.",
      "content": "Tap Delete App to remove the app from your phone. You may choose to do this on apps with a large documents & data size to make space on your phone. Note that you will not be able to recover information stored in an app once it is deleted."
    },
    {
      "title": "Tap Delete App again to confirm.",
      "content": "Tap Delete App again to confirm. You won't be able to delete some stock apps like Photos & Camera , but at least you'll know if it's time to do some cleaning."
    }
  ]
}