{
  "url": "https://www.wikihow.com/Remove-Paint-From-Auto-Fiberglass",
  "title": "How to Remove Paint From Auto Fiberglass",
  "steps": [
    {
      "title": "Check local regulations.",
      "content": "Check local regulations. It is illegal in many areas to sand paint from the fiberglass components off your car in the open air, while other places permit it if you use special attachments on a vacuum as you sand to catch as much particulate as possible. Check on the website for your town or state for laws in your area. The particulate from sanding off paint becomes airborne and can be bad for the environment. In some places, it is illegal to sand the paint off of your vehicle without a specialized facility."
    },
    {
      "title": "Find a safe place to sand.",
      "content": "Find a safe place to sand. Because the particulate you sand off of your vehicle can be hazardous to breathe, find an isolated or enclosed area you can sand your vehicle. Sanding out in the open will allow the particulate to spread further, possibly effecting anyone who lives nearby. A garage with an air filtration system is the best environment to sand your vehicle. If you are sanding outdoors, try to wait for a day that has very little wind."
    },
    {
      "title": "Wear appropriate safety gear.",
      "content": "Wear appropriate safety gear. Because of the dangers of airborne particulate while sanding, be sure to wear goggles and a respirator. You may consider using a regular paper or cloth face mask, but you will need to replace the mask periodically if dust becomes caked onto the mask. [1] X Research source Goggle style safety glasses are required to prevent the paint from getting into your eyes. You can purchase respirators at most hardware and auto parts stores."
    },
    {
      "title": "Choose the appropriate sand paper.",
      "content": "Choose the appropriate sand paper. You will need multiple grades of sandpaper to remove the paint and leave a smooth surface in the fiberglass. Start with 80 grit sandpaper and sand in a back and forth or circular motion to begin removing the paint. Switch to a finer grade sandpaper like 220 grit once you have removed the majority of the paint and re-sand the area. Don’t worry about making the fiberglass completely smooth; a slightly abrasive surface will help the new paint stick. Be careful not to sand beyond the paint and through the fiberglass. If you choose to use a power sander, be careful not to sand too deep through the paint with either grit of paper."
    },
    {
      "title": "Sand only as much as you have to.",
      "content": "Sand only as much as you have to. If you are planning on repainting the surface, you don’t need to remove all of the paint from the fiberglass. Instead, use the 120 grit sandpaper to remove any loose or bubbled paint, then score the rest of the surface by lightly sanding over all of it. [2] X Research source The new paint will stick to the scored paint you left on the fiberglass. Make sure to wash and rinse the part before repainting the fiberglass. It will be covered in dust from the sanding process."
    },
    {
      "title": "Choose an appropriate paste paint stripper.",
      "content": "Choose an appropriate paste paint stripper. There are a number of various paint stripper products available on the market. Choose a paint stripper that states it is intended for use on fiberglass on the package. A paint stripper paste is likely your best bet if you are removing paint from a component that is still on the vehicle. [3] X Research source Paste paint stripper is less likely to drip off of the fiberglass as it cures. All paint strippers can be dangerous to fiberglass if used improperly."
    },
    {
      "title": "Use painters tape to mask off edges.",
      "content": "Use painters tape to mask off edges. If you are not stripping the paint from the entire vehicle, use blue painters tape to mark the edges of where you intend to strip the paint from. This will provide you with a barrier to guide you as you apply the paint stripper. [4] X Research source Make sure to mark off the entire area you intend to strip."
    },
    {
      "title": "Put down drop clothes.",
      "content": "Put down drop clothes. Because you will need to leave the paint stripper on the paint for an extended period of time, make sure you put down drop clothes below where you applied it. This will catch any paint or stripper that falls from the vehicle as it cures. [5] X Research source Paint stripper and the paint it removes are bad for the environment, so it’s important to catch it and dispose of it appropriately. Be sure to apply the paint stripper under a roof of some sort so rain can’t wash any of it away as it cures."
    },
    {
      "title": "Determine cure time using a test patch.",
      "content": "Determine cure time using a test patch. Apply a small amount of paint stripper to an area of the fiberglass and allow it to cure. Read the instructions on the paint stripper to determine how long it should take for it to completely cure. [6] X Research source Check the stripper periodically to see if it has removed the paint beneath it. Keep track of how long it takes to remove the paint without damaging the fiberglass beneath it."
    },
    {
      "title": "Apply the paint stripper to the fiberglass.",
      "content": "Apply the paint stripper to the fiberglass. Follow the directions on the paint stripper to apply it to the painted fiberglass. Most paste strippers will come with an application dowel. Spread the stripper onto the painted fiberglass evenly in the thickness indicated in the directions. [7] X Research source Different types of paint strippers will have different application instructions. Gel based paint strippers are usually applied with a brush."
    },
    {
      "title": "Allow it to cure for the appropriate amount of time.",
      "content": "Allow it to cure for the appropriate amount of time. Leave the paint stripper on the paint for the amount of time you determined it would take to cure during the test. Make sure you do not leave the stripper on for much longer, as it can begin to eat away at the fiberglass if left on too long. [8] X Research source If you remove the paint stripper too soon, you will need to apply another coat to get the remainder of the paint off."
    },
    {
      "title": "Scrape the paint and the stripper off.",
      "content": "Scrape the paint and the stripper off. Some paint strippers need to be scraped off after curing to remove the paint. If the stripper came with a tool to use, scrape the stripper and paint off with it. If not, use a plastic scraper to remove the paint and stripper. [9] X Research source A metal scraper may damage the fiberglass you are removing the paint from. If the fiberglass is curved, use a scraper with a smaller width so you can better control how you apply pressure on the fiberglass."
    },
    {
      "title": "Rinse the paint and stripper off.",
      "content": "Rinse the paint and stripper off. If the paint stripper you purchased instructs you to rinse it off rather than scrape it, use a hose to spray the paint stripper off. These paint strippers are designed to be drained and will not harm the environment. [10] X Research source Do not use a high pressure washer to rinse the paint stripper off, as it may cause it to splash into your eyes. A regular garden hose will suffice to rinse this kind of paint stripper off."
    },
    {
      "title": "Reapply the stripper when necessary.",
      "content": "Reapply the stripper when necessary. After removing all of the paint stripper, evaluate the fiberglass and determine if you need to reapply paint stripper to any areas. If so, repeat the process until you remove all of the necessary paint. If there are any small nooks or edges in the fiberglass, it may take multiple tries to remove the paint."
    }
  ]
}