{
  "url": "https://www.wikihow.com/Signs-Your-Deceased-Pet-Is-Visiting-You",
  "title": "35 Signs Your Deceased Pet Is Still With You",
  "steps": [
    {
      "title": "You may hear unexplained footsteps, barking, howling, or scratching.",
      "content": "You may hear unexplained footsteps, barking, howling, or scratching. You may also hear other sounds you associate with your pet, like whimpering or the jingling of their collar. If you hear these sounds when no animals are around, it may be your pet’s way of comforting you and letting you know they haven’t left your side. [1] X Research source"
    },
    {
      "title": "You may catch a whiff of a scent that reminds you of your pet.",
      "content": "You may catch a whiff of a scent that reminds you of your pet. This smell could be your pet’s scent, the fragrance of their shampoo, or the odor of their favorite treat. If you’re picking up on these scents even after all of your pet’s belongings are gone, your pet may be signaling to you that they’re still nearby and thinking of you. [2] X Research source"
    },
    {
      "title": "You may inexplicably feel your pet jumping onto your lap.",
      "content": "You may inexplicably feel your pet jumping onto your lap. Or you could swear that you felt them by your side as you snoozed away last night. You may even see little pawprints on your bed or blankets. Feeling your pets cuddle with or brush up against you is a common sign that their spirit’s still lingering around. [3] X Research source"
    },
    {
      "title": "You may think you saw your pet, then turn around, and nothing’s there.",
      "content": "You may think you saw your pet, then turn around, and nothing’s there. You could blame it on a shifting shadow or a trick of the light, but it may be the spirit of your deceased pet. Your animal may be trying to make its presence known. [4] X Research source The next time you think you see your pet, acknowledge it out loud and tell them how much you love receiving visits from them. These types of visits are most commonly reported among dog owners, as dogs like to stay close to their families, even in the afterlife. Most people believe that you see spirits using peripheral vision rather than direct vision, so it makes sense that you’re only seeing them out of the corner of your eye. You may not even see them, but sense that they’re looking at you and watching over you."
    },
    {
      "title": "Your living pet may be staring at something you can’t see.",
      "content": "Your living pet may be staring at something you can’t see. They may even look like they’re playing with another animal but are really playing by themselves. It’s possible that they can see your deceased pet and are enjoying their company. [5] X Research source If your current pet never lived with your past one, it may become protective of its food, toys, or favorite spots in the house."
    },
    {
      "title": "You may experience a sudden rush of comforting and loving energy.",
      "content": "You may experience a sudden rush of comforting and loving energy. This energy may feel like goosebumps or a warm sensation spreading across your body. Some people believe that this phenomenon is due to an animal’s spirit entering the room and bringing their higher vibrational frequency along with them."
    },
    {
      "title": "You can’t escape your animal’s shedding, even in the afterlife.",
      "content": "You can’t escape your animal’s shedding, even in the afterlife. Finding physical evidence of your pet’s presence is one way that they let you know they’re still around. Cats, in particular, are known to leave little pieces of themselves behind since they live most of their life in the astral world and sometimes don’t even realize they’ve crossed over. [6] X Research source"
    },
    {
      "title": "Your pet may be moving their toy around the house.",
      "content": "Your pet may be moving their toy around the house. Maybe you left your pup’s favorite tennis ball in the bedroom, and suddenly, you find it in the kitchen. This could be a sign that your pet is wanting to play! [7] X Research source"
    },
    {
      "title": "You may find crumbs of your pet’s favorite treat around the house.",
      "content": "You may find crumbs of your pet’s favorite treat around the house. Pets love food, and that doesn’t change once they cross over to the afterlife! Finding bits of their favorite food or hearing a familiar munching sound may mean that your pet has come for a visit—and found a snack along the way."
    },
    {
      "title": "You may have a sudden hankering for your pet’s favorite treat.",
      "content": "You may have a sudden hankering for your pet’s favorite treat. If your dog always begged you for deli meat, for example, you may be craving sub sandwiches around the clock. This is your pet’s way of remembering the bond you shared and how happy you made them when you shared your food."
    },
    {
      "title": "Your pet may use meaningful objects in your home to send a message.",
      "content": "Your pet may use meaningful objects in your home to send a message. For example, you may find yourself pulled to look at a picture frame over and over again. Your pet may be trying to give you advice, trigger a shared memory, or remind you of all the love and joy you shared. Open yourself up to whatever message your pet is trying to send you."
    },
    {
      "title": "You may find yourself in a familiar place without realizing it.",
      "content": "You may find yourself in a familiar place without realizing it. Maybe you’re taking an aimless walk or drive and letting your mind empty as you process your grief . If you find yourself in your pet’s favorite park, neighborhood, or other beloved location, it’s a sign that your pet is with you and guiding you there."
    },
    {
      "title": "Your pet may be trying to play with you or get your attention.",
      "content": "Your pet may be trying to play with you or get your attention. Perhaps they’re hiding your personal belongings somewhere you’d never put them. Or maybe the same object keeps getting knocked off a shelf or kitchen countertop. [8] X Research source Dogs often knock off items close to the ground, usually in the living room and kitchen. Cats, on the other hand, can access almost any part of the house and may mess with items on your bookshelf, kitchen counter, or wardrobe. These playful actions by your pet are not meant to spook you. They’re just trying to engage with you and have a little harmless fun!"
    },
    {
      "title": "Your pet may be reaching out to you by leaving scratches or teeth marks.",
      "content": "Your pet may be reaching out to you by leaving scratches or teeth marks. These markings are most likely to appear on the same pieces of furniture where your pet used to scratch or chew. You may initially feel frustrated that your pet’s way of communicating with you is by damaging your nice leather sofa (yay!). [9] X Research source However, you should feel happy to know that nothing has changed and your pet is still with you. Finding scratches or markings after a pet’s death is actually a rare sign of spiritual contact, and it may indicate that you are particularly connected to the spirit world."
    },
    {
      "title": "Your pet may be using telepathy to bring these memories to your mind.",
      "content": "Your pet may be using telepathy to bring these memories to your mind. They may be trying to boost your mood, make you laugh, or remind you of all your fun times. While these memories may make you feel sad that your pet is no longer with you, remember that it’s a sign that your pet is still with you and thinking of you in some way. [10] X Research source"
    },
    {
      "title": "Your pet may be sending you messages through the soundwaves.",
      "content": "Your pet may be sending you messages through the soundwaves. Let’s say you named your dog “Rocky,” and “Eye of the Tiger” starts popping up on the radio. Or maybe you had a bird that was always whistling Beyoncé songs, and now Beyoncé is constantly appearing on your For You playlists. [11] X Research source Your pet may choose songs that they think will uplift you, guide you, and remind you of the beautiful times you shared."
    },
    {
      "title": "Their name may suddenly appear everywhere you look.",
      "content": "Their name may suddenly appear everywhere you look. This could be on social media, in newspapers, or even on billboards. Whatever the specific circumstances, repeatedly seeing your pet’s name is a sign that they’re reaching out to you. [12] X Research source"
    },
    {
      "title": "Many pet owners experience vivid dreams about their furry friends.",
      "content": "Many pet owners experience vivid dreams about their furry friends. In these dreams, pets are often relaying messages of comfort and reassurance. [13] X Research source Your pet may be trying to let you know that they’re still with you during this difficult time. [14] X Research source This dream should not be frightening or upsetting—when you wake, you should feel calm, emotionally fulfilled, and spiritually connected to your pet."
    },
    {
      "title": "Animals sometimes manifest themselves as mists or balls of light.",
      "content": "Animals sometimes manifest themselves as mists or balls of light. Appearing as an unexplained orb or ball of light may be your deceased pet’s way of comforting and supporting you during your time of grief. You may also see this luminous phenomenon when dealing with an obstacle in your personal life. Your pet may be reaching out to let you know that you’re never truly alone and that they’ll be by your side as you heal and overcome this hurdle."
    },
    {
      "title": "Your lights may flicker or your TV turns on and off on its own.",
      "content": "Your lights may flicker or your TV turns on and off on its own. After ruling out any faulty wiring or dead batteries, consider the possibility that your pet is trying to communicate with you through electronic devices. [15] X Research source"
    },
    {
      "title": "You may get a call from an unknown number that’s really from your pet.",
      "content": "You may get a call from an unknown number that’s really from your pet. But, when you pick up, you only hear static on the other line. This call could be a way that your pet is trying to connect and communicate with you. [16] X Research source Phone calls are a common way that both human and animal spirits are thought to communicate with the world of the living."
    },
    {
      "title": "Your house may suddenly feel freezing for no apparent reason.",
      "content": "Your house may suddenly feel freezing for no apparent reason. This temperature change may be occurring because your pet is visiting from the afterlife and drawing heat from the surrounding environment. [17] X Research source When you feel a sudden chill sweep across your room, say hello to your pet and thank them for their visit. Also known as “cold spots,” these sudden drops in temperature are associated with visits from both human and animal spirits."
    },
    {
      "title": "You may spot a stray cat or other animal in need of nurturing.",
      "content": "You may spot a stray cat or other animal in need of nurturing. The appearance of this animal may be a sign from your deceased pet that you need a new companion to love and care for. [18] X Research source Some people even believe that a new animal knocking at your door may be the reincarnation of your previous pet."
    },
    {
      "title": "Seeing your deceased pet’s lookalike may be unsettling.",
      "content": "Seeing your deceased pet’s lookalike may be unsettling. But if you see an animal that looks, walks, and behaves just like your deceased pet, it’s probably not a coincidence. It may be your pet coming to say hello in the hopes of boosting your mood and reconnecting with you!"
    },
    {
      "title": "Part of your pet’s soul may have jumped into another living being.",
      "content": "Part of your pet’s soul may have jumped into another living being. Eyes are the window to the soul, after all. If you lock eyes with someone and feel an instant connection, then realize that their eyes are unmistakably similar to your deceased pets; that’s more than a coincidence. This is a sign that your dog wants to protect you and find ways to be around you."
    },
    {
      "title": "Your pet may connect with you through insects or flying animals.",
      "content": "Your pet may connect with you through insects or flying animals. They may send a bird your way to show that they’re feeling free and happy in the afterlife. Some of the most common birds associated with these messages are blue jays , red robins, cardinals , and goldfinches. [19] X Research source Your beloved animal may also send a dragonfly or butterfly to flit past you or perch on your hand as a way to encourage you to embrace change and a new chapter. Ladybugs may also be a sign that your pet wants you to live life to the fullest."
    },
    {
      "title": "Your pet may try to connect with you through nature.",
      "content": "Your pet may try to connect with you through nature. You could see the shape of your pet in the clouds or something that reminds you of them. Your pet is trying to say hello and let you know that they’re somewhere peaceful. [20] X Research source"
    },
    {
      "title": "Rainbows may be your pet’s way of greeting you.",
      "content": "Rainbows may be your pet’s way of greeting you. If you were just thinking of your pet when a rainbow suddenly appeared, it’s even more likely that this is a message from beyond. Your pet wants you to know that they’re happy and okay on the other side. [21] X Research source"
    },
    {
      "title": "Your pet may be telling you that they’re still around.",
      "content": "Your pet may be telling you that they’re still around. If you see daffodils pop up in the dead of winter or even a summer flower flourishing in the fall, this may be a message from your pet. They want you to know that they’re okay and content with experiencing life in a different form."
    },
    {
      "title": "Repeat numbers carry special significance.",
      "content": "Repeat numbers carry special significance. You may see angel numbers on a clock, license plate, or anywhere else where number patterns appear. Certain angel numbers are especially significant and may communicate a message from your pet to you. The repeating angel number 11:11 , for example, may be your pet telling you that you’re on the right path and to stay strong."
    },
    {
      "title": "You may see numbers representing your pet’s death date or birthday.",
      "content": "You may see numbers representing your pet’s death date or birthday. Significant dates could also include the anniversary of their adoption. For example, if your pet passed away on May 6th, you may see 05:06 on a digital clock. [22] X Research source The appearance of these numbers is a sign that your pet is visiting you or sending positive energy your way."
    },
    {
      "title": "Feathers are strongly associated with angels and the spiritual world.",
      "content": "Feathers are strongly associated with angels and the spiritual world. Having a feather fall at your feet or land on your doorstep is a possible sign that your deceased pet is visiting you. They’re letting you know that they’re safe and at peace. [23] X Research source"
    },
    {
      "title": "You may see heart shapes naturally formed by nature.",
      "content": "You may see heart shapes naturally formed by nature. Maybe you see leaves, rocks, or clouds that take the shape of a heart. These hearts are a symbol of love sent from your beloved animal companion."
    },
    {
      "title": "If your pet can’t touch you, they may use the breeze to do so instead.",
      "content": "If your pet can’t touch you, they may use the breeze to do so instead. Feeling a light breeze brush across your skin—especially on a windless day—is a sign that your pet is near. They want you to know that they’re always with you and helping you on your journey to healing."
    },
    {
      "title": "Your pet’s aura may appear when they’re visiting you or your home.",
      "content": "Your pet’s aura may appear when they’re visiting you or your home. Close your eyes or soften your vision. Try to envision your pet and the energy that surrounds them. If you notice a specific color around you, this is a sign that your deceased pet is still with you. An animal’s aura typically resembles the color of their owner’s aura. Don’t be concerned if you can’t see your pet’s aura— seeing auras takes time, practice, and a strong psychic link to the spiritual world."
    }
  ]
}