{
  "url": "https://www.wikihow.com/Recognize-and-Prevent-a-Pinworm-Infection",
  "title": "How to Recognize and Prevent a Pinworm Infection",
  "steps": [
    {
      "title": "Know how pinworms spread.",
      "content": "Know how pinworms spread. Pinworms can affect young and old alike. The means of transmission is fecal-oral. They are spread person-to-person by the ingestion of pinworm eggs that have contaminated fingers, bedding, clothing, and other items. [1] X Research source For instance, a child with a pinworm infection may itch their rectum and get eggs on their fingers or under their fingernails, then transmit them to an object or another person, or even re-infect themselves."
    },
    {
      "title": "Assess risk.",
      "content": "Assess risk. As you can imagine, the more you’re around people that have poor or undeveloped hygiene skills, the greater your risk. [2] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source High risk : Children in school/preschool, people who are institutionalized, as well as family, household members, and caregivers of the first two groups. Children’s hands go everywhere and usually without being consistently washed. They are also often putting their hands/fingers in their mouth, touching toys, tables, each other, wiping their hands on clothes, etc. The same goes for those in institutions. For both of these groups, their environments are a pinworm Petri dish. Moderate-risk : As you might guess based on those that are high-risk, those that come into contact with any or all of the high-risk individuals are in the moderate-risk category. There’s not much you can do other than make sure you follow standard hygiene guidelines. Since you can’t avoid people just because they may have pinworms, all you can do is take care of yourself as best you can. Low-risk : This is basically everyone else. Adults who have little to no contact with either the high-risk group or fairly limited contact with the moderate-risk group are at low risk for pinworm infections."
    },
    {
      "title": "Familiarize yourself with pinworms' lifecycle.",
      "content": "Familiarize yourself with pinworms' lifecycle. After a pinworm egg is digested, there is an incubation period of one to two months or longer for the adult gravid female to mature in the small intestine. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Once mature, the adult female worm migrates to the colon and lays eggs around the anus at night, when many of its hosts are asleep. When they lay their eggs, they use \"glue\" that adheres the eggs to the anus and it is this substance that triggers the skin's itching sensation. This is why the itching is usually worse at night: the worms are migrating to the area around the rectum to lay their eggs."
    },
    {
      "title": "Know how they transfer.",
      "content": "Know how they transfer. Scratching an itch can transfer microscopic pinworm eggs to your fingers. From there, the eggs can be transferred to the mouth or other mucous membranes. [4] X Research source This hand-to-mouth transaction can also be accomplished indirectly as well. The eggs can be passed to various surfaces such as a shirt or desk, where they can live for two to three weeks and picked up on the hands of others who, eventually, put unwashed hands to their mouth."
    },
    {
      "title": "Be alert for other signs of infestation.",
      "content": "Be alert for other signs of infestation. In addition to a noticeable irritation in the rectal area, someone can have a pinworm infection without having any symptoms. When symptoms are present, they are likely to be: [5] X Research source Restlessness and poor sleep (especially when this has not been an issue before) Bedwetting Irritability (such as teeth-grinding) Vaginal discharge in females Bacterial skin infections"
    },
    {
      "title": "Look for actual signs of the worm.",
      "content": "Look for actual signs of the worm. If any of these symptoms are occurring, checking for the worms can be done using the naked eye, as follows: [6] X Research source You may be able to see worms in the anal (rectal) area, especially if you look about two or three hours after the infected person has fallen asleep. Use a flashlight (torch) to help you see clearly. You might also see the worms in the toilet after he or she goes to the bathroom. Look to see if the worms are wriggling in bowel movements. The worms are very small, about this long: ___. They may look like little bits of white thread. They may also be found on children's underwear in the morning."
    },
    {
      "title": "Take a sample of the infected area.",
      "content": "Take a sample of the infected area. If you suspect a pinworm infestation, your doctor may ask you to place a piece of clear, sticky tape against the rectum. Pinworm eggs will stick to the tape. Your doctor will be able to see these eggs under the microscope. [7] X Research source The doctor might also take some samples from under the infected person’s fingernails and examine them for eggs. You may also use a pinworm paddle. This spatula-like device literally “scoops” the area and holds the spatula end in a plastic test tube."
    },
    {
      "title": "Practice and teach proper handwashing techniques.",
      "content": "Practice and teach proper handwashing techniques . The best way to prevent an infestation begins here. Your hands are the part of your body most likely to transfer the pinworm eggs so keeping them clean means those eggs go down the drain. Make sure you and your family wash your hands before eating or handling food, after using the bathroom, and after changing a diaper. Use warm water with mild soap and vigorous hand-washing for about 30 seconds—think two cycles of \"Happy Birthday\" or the \"ABC song.\" Wash your hands before, during, and after any and all activities with institutionalized friends/relatives, co-workers, etc. Keep your hands away from your mouth whenever you are in a school or institutional environment. Be sure to wash your hands after attending to children who are being treated for pinworms. [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Keep fingernails clean and trimmed short.",
      "content": "Keep fingernails clean and trimmed short. Avoid biting your fingernails . Remember—this is a pinworm egg’s favorite hiding place. If you’ve come into contact with them or scratched an itch where the pinworms are hiding (e.g. clothes, exposed skin), they’ll be hiding under your nails. Be careful not to trim them too short as that can cause other health issues for you or your loved one’s fingers. Always make sure to clean under the fingernails both when washing your hands and taking baths/showers. It should be a general practice to keep that area clean."
    },
    {
      "title": "Avoid scratching the skin around the anus area.",
      "content": "Avoid scratching the skin around the anus area. Have children wear close-fitting sleepwear and underpants and mittens. This will make it harder for them to scratch at night and pick up the worms. Every family member should shower or bathe every morning and change undergarments daily (showering may be preferred to avoid contaminated bathwater). During treatment, shower at night and in the morning to remove eggs that have been laid during the night."
    },
    {
      "title": "Avoid eating in the bedroom.",
      "content": "Avoid eating in the bedroom. Doing so increases the risk of contact with the pinworm eggs."
    },
    {
      "title": "Use hot water and high heat in your dryer for all bedding, towels, and clothes you suspect or know have come into contact with those infected.",
      "content": "Use hot water and high heat in your dryer for all bedding, towels, and clothes you suspect or know have come into contact with those infected. In fact, to be better safe than sorry, wash everything in hot water. Just be careful not to put that red sock in with the whites. When you handle the bedding, clothing, and towels of an infected person (or one you may suspect is infected), do so carefully. Avoid shaking the articles and wash infected articles (underwear, bed linen, sleepwear, and towels ) separately from other washing."
    },
    {
      "title": "Bathe your rooms with light.",
      "content": "Bathe your rooms with light. Keeps drapes/curtains/blinds open all day because pinworm eggs are sensitive to sunlight. [9] X Research source"
    }
  ]
}