{
  "url": "https://www.wikihow.com/Rasterize-in-Illustrator",
  "title": "How to Rasterize in Illustrator",
  "steps": [
    {
      "title": "Open your Adobe Illustrator application.",
      "content": "Open your Adobe Illustrator application."
    },
    {
      "title": "Choose to open an existing document in the dialogue box that appears.",
      "content": "Choose to open an existing document in the dialogue box that appears. You want to choose a document that already contains vector images that you want to rasterize."
    },
    {
      "title": "Select the object you want to rasterize.",
      "content": "Select the object you want to rasterize. If you want to rasterize more than 1 object, press the \"Control\" button as you click on objects that you want to select."
    },
    {
      "title": "Choose whether you would like to permanently rasterize the object or if you want to create an appearance of a pixel-based image.",
      "content": "Choose whether you would like to permanently rasterize the object or if you want to create an appearance of a pixel-based image. The latter is called \"Raster Effects.\" You will use 2 separate methods to accomplish these options."
    },
    {
      "title": "Click the Object menu in the top horizontal toolbar after you have selected your objects.",
      "content": "Click the Object menu in the top horizontal toolbar after you have selected your objects."
    },
    {
      "title": "Select \"Rasterize.\"",
      "content": "Select \"Rasterize.\""
    },
    {
      "title": "Choose the following rasterization options.",
      "content": "Choose the following rasterization options. Select the Color Mode that you would like to use. Choose RGB or CMYK. This may depend upon your printer or display preference. This specifies which wavelengths of light will be reflected. CMYK (Cyan, Magenta, Yellow, Black) inks are very common in digital art and printing, where RGB (Red, Green, Blue) are commonly used in files received from scanners. If you are printing a document and you do not know what Color Mode your printer prefers, it is best to check with them before rasterizing your images or document. Choose the resolution. The resolution determines the number of pixels per inch. Choose \"Use Document Raster Effects Resolution to use global resolution settings.\" Choose your background. Select a white background if you would like Illustrator to fill in the background on the object. Choose \"transparent\" if you do not want the vector image to be on a background. Deselect the \"Anti-Alias\" option. This will keep the crisp lines of your object instead of blurring them when they are rasterized."
    },
    {
      "title": "Select \"Ok\" to permanently rasterize your vector object.",
      "content": "Select \"Ok\" to permanently rasterize your vector object."
    },
    {
      "title": "Click the Effects menu in the top horizontal toolbar, after you have selected your objects.",
      "content": "Click the Effects menu in the top horizontal toolbar, after you have selected your objects."
    },
    {
      "title": "Select \"Rasterize\" from the Effects options.",
      "content": "Select \"Rasterize\" from the Effects options."
    },
    {
      "title": "Select the Rasterization options, exactly as you would if you were permanently rasterizing an object.",
      "content": "Select the Rasterization options, exactly as you would if you were permanently rasterizing an object."
    },
    {
      "title": "Go to the Appearance panel to modify or delete the effect.",
      "content": "Go to the Appearance panel to modify or delete the effect. Find where the raster effect is listed and double click it to make alterations. You can also click on the effect and click the delete button."
    },
    {
      "title": "Save your changes to record the Illustrator rasterization or raster effect.",
      "content": "Save your changes to record the Illustrator rasterization or raster effect."
    }
  ]
}