{
  "url": "https://www.wikihow.com/Prevent-Chafing",
  "title": "How to Prevent Chafing",
  "steps": [
    {
      "title": "Wear the proper clothing when working out.",
      "content": "Wear the proper clothing when working out. When exercising, its important to wear workout clothes that aren’t too tight and are made out of synthetic fibers, not cotton. Unlike cotton, synthetic fibers lift moisture from your body as you sweat. So there will be less of a chance of wet skin rubbing against each other, which leads to chafing. [2] X Research source Wear compression shorts if you are cycling or running long distances to prevent chafing between your legs. Choose exercise clothing and sports bras that have smooth seams to avoid rubbing against your skin, especially your underarm area. If you notice your skin chafes when you wear a certain pair of shorts or pants during your workout, switch to a different pair."
    },
    {
      "title": "Switch from cotton underwear to hiking underwear if you are going to be active outside.",
      "content": "Switch from cotton underwear to hiking underwear if you are going to be active outside. If you are a runner or hiker and want to prevent chafing in your groin area, wear underwear that is made of synthetic fibers. [3] X Research source Avoid underwear made out of modal, rayon, viscose, tencel, lyocell, and bamboo. These are all wood fibers and behave very similarly to cotton when they get damp or wet."
    },
    {
      "title": "Change out of sweaty clothes right away.",
      "content": "Change out of sweaty clothes right away. To prevent chafing, its important to stay dry as wet skin can make chafing worse. So don’t stay in wet or sweaty clothing after a workout or a long day in the heat. Change into dry, clean clothes right away. [4] X Research source"
    },
    {
      "title": "Keep the area clean.",
      "content": "Keep the area clean. If you are experiencing chafing between your thighs, gently clean the area to remove any dirt or sweat. If you are experiencing chafing in another part of your body, like your nipples, or your underarms, clean this area well after a workout or a long day outside. Do not scrub or rub the area. Instead, wipe it gently with a warm wet cloth. Use mild soap that is unscented so it won’t irritate your skin."
    },
    {
      "title": "Try Bandelettes.",
      "content": "Try Bandelettes. Bandelettes are bands of stretchy lace 6” long that also have a silicone grip that fits on your thighs.They prevent rubbing by forming a barrier between your thighs. [5] X Research source Order Bandelettes online and measure your thighs to find the right size. This is a great option if you are squeamish of lubricants or powders and want a product you can slip on easily."
    },
    {
      "title": "Wear boxer briefs under skirts and dresses.",
      "content": "Wear boxer briefs under skirts and dresses. A pair of fitted men’s boxer-briefs are super breathable, as they are made with cotton, and they fall at the perfect spot on your thighs to prevent any touching or rubbing."
    },
    {
      "title": "Apply a lubricant to reduce friction on your skin.",
      "content": "Apply a lubricant to reduce friction on your skin. One of the most popular products used by runners to prevent chafing is body glide. [6] X Research source Simply apply it to areas that are prone to chafing, like between your legs, under your arms, and on your nipples. The lubricant should stay on your skin and absorb moisture during even the hottest days of the year. Another lubricant that you can get over the counter is Monistat Soothing Care Chafing Relief Powder Gel. Other popular lubricant products include HikeGoo and Red11. [7] X Research source"
    },
    {
      "title": "Use a powder to remove moisture on your skin.",
      "content": "Use a powder to remove moisture on your skin. Look for a powder that has micro-particle polymers that glide over your skin and absorb sweat. Try a powder that will keep your skin dry, like the bizarrely named Lady Anti Monkey Butt Powder. [8] X Research source"
    },
    {
      "title": "Put bandaids on your nipples.",
      "content": "Put bandaids on your nipples. Thought this may be a bit DIY, cutting band aids in half and applying them to your nipples will create a barrier between your clothing and your skin as you run. [9] X Research source You can also apply NipGuard [10] X Research source to the area before a run to prevent chafing in the nipple area."
    },
    {
      "title": "Apply petroleum jelly to the area.",
      "content": "Apply petroleum jelly to the area. Before you step out for a run or for a walk on a hot day, apply petroleum jelly to any areas on your body that are prone to chafing, like between your thighs or under your arms. [11] X Research source"
    },
    {
      "title": "Use natural oils.",
      "content": "Use natural oils. Baby oil, almond oil, and lavender oil can help to soothe any irritated areas on your skin and keep your skin from rubbing together. [12] X Research source"
    },
    {
      "title": "Make your own lubricant.",
      "content": "Make your own lubricant. If petroleum jelly is not enough to stop the chafing, create your own lubricant by mixing together vitamin creams and natural creams. [13] X Research source Mix equal parts Vitamin A and Vitamin D ointment with petroleum jelly. Then, add Vitamin E cream and Aloe Vera cream to the mixture. The aloe vera should give the homemade cream a nice smell and consistency. Aloe Vera is a great addition because it protects your skin from chafing and can help to heal any irritated skin."
    },
    {
      "title": "Apply baby powder or talcum powder to any chafe prone areas.",
      "content": "Apply baby powder or talcum powder to any chafe prone areas. This will help to keep your skin dry and prevent any chafing, especially on a hot day. [14] X Research source"
    },
    {
      "title": "Clean the chafed area.",
      "content": "Clean the chafed area. Gently wipe between your thighs, under your arms, or over your nipples with water, or a warm wet cloth. Be sure to dry the area well after washing it. [15] X Research source"
    },
    {
      "title": "Apply petroleum jelly or aloe vera gel to the area.",
      "content": "Apply petroleum jelly or aloe vera gel to the area. This will sooth and heal the chafed skin. [16] X Research source If the area is very painful, swollen, bleeding, or crusty looking, talk to your doctor about a prescription for a medicated ointment."
    },
    {
      "title": "Let your skin heal before being active again.",
      "content": "Let your skin heal before being active again. Continued friction in the area will only make it worse and could lead to infection. So take a break from your morning run or walk. Switch to pants instead of shorts for a few days. [17] X Research source If the chafing does not improve after several days, talk to your doctor. You may need medicated ointment or cream to heal the chafing ."
    }
  ]
}