{
  "url": "https://www.wikihow.com/Recycle",
  "title": "Recycling 101: Common Recyclables & What to Avoid",
  "steps": [
    {
      "title": "Recycle clean, rinsed items to avoid contamination.",
      "content": "Recycle clean, rinsed items to avoid contamination. Rinse plastic and glass items before adding them to your bin. If there is any food waste, oil residue, or paint on your item, just throw it out. When your items are collected, they may mix with other items, leading to further contamination at the plant. [1] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Food, alcohol, wood, clothing, lighting, tires, concrete, and foam are the most common contaminants. These items can render your entire bin unrecyclable, so just throw them out. If you doubt whether something is clean enough to be recycled, throw it in the garbage just to play it safe. The risk is rarely worth it."
    },
    {
      "title": "Sort your recyclables, if necessary.",
      "content": "Sort your recyclables, if necessary. Some recycling plants will sort your recyclables for you, but local laws occasionally require you to sort the materials yourself. Typically, you’ll need to separate paper and plastic, but the requirements differ everywhere. Look up the local laws for your area. [2] X Research source Even if it isn’t required, do your best to keep similar items together to make things easier for the recycling facility. Stack cardboard on top of other cardboard, and keep your aluminum cans in the same portion of the bin."
    },
    {
      "title": "Put recyclables directly into your bin without bagging them.",
      "content": "Put recyclables directly into your bin without bagging them. Regular plastic bags can't be recycled curbside. If you want to bag your items, use plastic recycling bags , if your local collection allows their use. Plastic bags become tangled at processing equipment and some places will dispose anything in plastic bags into the trash. [3] X Research source Plastic bags can be recycled in specific locations, and often, supermarkets and retailers offer a small bin at the entrance of their stores for your convenience. [4] X Research source You can also learn more about how to recycle plastic bags here ."
    },
    {
      "title": "Follow your city's recycling guidelines.",
      "content": "Follow your city's recycling guidelines. Every region has different rules regarding what they will and won’t take for recycling. Visit your state’s government website or type “Recycling Rules in [CITY]” into Google. [5] X Research source If you can’t find any information online, call your local sanitation department to find out where you can find more information."
    },
    {
      "title": "Pick up recycling containers if your city doesn’t provide them.",
      "content": "Pick up recycling containers if your city doesn’t provide them. Some cities offer free recycling bins, while others don’t. If you need to, buy 20 to 50-gallon recycling bins to put on the curb for pick up. Once your recyclables are collected, check the container for any residue or waste and clean the container out with water as needed. If any non-recyclable material gets on your otherwise-clean recyclables, the plant won’t be able to process your stuff! [6] X Research source"
    },
    {
      "title": "Paper",
      "content": "Paper Most paper products are recyclable, so don’t throw out your newspapers, old notebooks, or egg cartons! All of these, including magazines, colored paper, phonebooks, and more, can be recycled. [7] X Research source Simply wrap them in twine, place them in a paper-designated bin, or use a recycling paper bag to flatten and stack paper goods to make them easier to process. [8] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Most recycling plants can even take stapled paper, spiral notebooks, and sticky notes. [9] X Research source If you have gift wrap that has a shiny, laminated texture, it probably can’t be recycled. You likely won’t be able to recycle anything that holds liquid, paper towels, or paper coated in plastic. [10] X Research source Shredded paper or paper exposed to liquids cannot be recycled. With that said, some municipalities may still take these products and separate what’s recyclable from what isn’t, so check with your local government. [11] X Research source Refrigerated/frozen food boxes are generally NOT recyclable due to the way they're made except \"aseptic cartons,\" like milk and juice cartons. [12] X Trustworthy Source State of Oregon Official website for the State of Oregon Go to source"
    },
    {
      "title": "Plastic",
      "content": "Plastic Check the symbol printed on plastics to see if they’re recyclable. The number inside the triangle on plastic goods is the resin number, which tells you what plastic the material is made of. Most municipalities will accept some of these plastics, while others are rarely recyclable. [13] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Plastics with a 1, 2, or 5 are almost always recyclable. So long as they aren’t contaminated, throw them in the recycling bin. Number 3 plastic, which is PVC, and number 7 plastic, a miscellaneous category, are rarely recyclable. Check with your local government or recycling service to see if they’ll take these. Plastics with a 4 or 6 are occasionally recyclable, depending on where you live. A few plastic items may seem to be recyclable but aren’t such as plastic bags, straws, disposable cups, and tissue boxes. [14] X Research source"
    },
    {
      "title": "Glass",
      "content": "Glass Glass is one of the few materials that can be infinitely recycled. The major barrier here is that people tend to throw out bottles and glasses without rinsing them out first, which leads to many issues with contamination. [15] X Research source In some states, you can make money by turning your glasses into a collection center. The one exception here is broken glass. It poses a hazard to sanitation workers and is extremely difficult to process. Throw out any broken glass. If the glass had any oil or hazardous residue, throw it out safely. You may contaminate other materials if you toss them in the recycling bin."
    },
    {
      "title": "Metal",
      "content": "Metal Clean aluminum foil, tools, and pots can be recycled. Aerosol cans can also be recycled, so long as you’ve emptied them out by pressing the nozzle. Sustainability Specialist Kathryn Kellogg recommends rinsing empty food cans under water before placing them in the bin. [16] X Expert Source Kathryn Kellogg Eco-friendly Living Expert Expert Interview. 28 June 2019. If the metal is sharp or damaged in a way where someone may cut themselves, don’t put it in your recycling bin. The only metals that can’t be recycled are metals that contain mercury (like metal thermometers) or cathode ray tubes, which are found in old TVs and computers. [17] X Research source Metals with electrical wiring, like a dryer or iPod, are usually not recyclable. However, these products can often be taken apart for scrap, so check with your local recycling center or scrapyard."
    },
    {
      "title": "Batteries",
      "content": "Batteries Many areas have computers or big box stores with bins for battery recycling. In some municipalities, you can set them out for curbside pickup if they’re in a separate container. If you’re recycling standard disposable batteries, put a strip of electrical tape on each of the leads or put them in a plastic bag to keep them from accidentally conducting electricity. [18] X Research source You can find a recycling center or drop-off location for batteries in the United States by visiting http://www.call2recycle.org/ . There are also mail-in services you can use to ship your batteries to a recycling center meant specifically for this. [19] X Research source The process for recycling rechargeable batteries or car batteries is complicated. For anything outside of those basic batteries that go in your remote, contact your local government or recycling plant to see where you can take them. [20] X Research source"
    },
    {
      "title": "Electronics",
      "content": "Electronics You may be able to put smaller electronics directly in the bin, but it’s worth calling your local government or recycling plant to get more info. Electronics are usually taken apart to retrieve the plastics or metals that can be recycled, so don’t assume that an old phone or laptop needs to go in the trash. [21] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source You can also contact big box retailers, like Best Buy, which usually offer recycling services for electronics. [22] X Research source You can recycle TVs, computers, cameras, drones, musical equipment, printers, and speakers. Just make sure that you remove any batteries before setting them out. [23] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source You may need to arrange a junk removal service to pick up large appliances. Sustainability Specialist Kathryn Kellogg recommends donating old electronics. Many nonprofit organizations and schools will accept old computers. [24] X Expert Source Kathryn Kellogg Eco-friendly Living Expert Expert Interview. 28 June 2019. If you’re getting rid of a computer or phone, be sure to wipe it of any personal information before you throw it out. [25] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Printer cartridges",
      "content": "Printer cartridges Call your local office supply store if an ink or toner cartridge is at the end of its life. The vast majority of office supply stores will accept old printer cartridges. Kathryn Kellogg advises that most printer manufacturers will recycle cartridges if you mail them out. [26] X Expert Source Kathryn Kellogg Eco-friendly Living Expert Expert Interview. 28 June 2019. You can actually refill ink and toner cartridges a few times before you need to dispose of them, so do that to reduce waste if you can! Ink and toner cartridges aren’t exceptionally difficult to recycle, but most people just toss them out because they don’t know they can be processed! [27] X Research source"
    },
    {
      "title": "Oil",
      "content": "Oil Oil requires a unique process to be recycled. So, contact your local government, waste management company, or recycling center to dispose of it correctly. Oil is a contaminant that can make recycling other goods impossible, so don’t pour it down the drain or gutter. [28] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Spent oil can also contaminate water supplies since getting it out of water is so difficult. [29] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Hazardous waste",
      "content": "Hazardous waste If you’ve got a spent container of paint thinner or weed killer, it can almost certainly be recycled. Unfortunately, this stuff can’t go in your typical recycling bin. [30] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Contact your local government to learn how to recycle these items. Sometimes, you may need to drop them off at a recycling plant designed specifically for hazardous waste. Examples of these kind of products include: [31] X Research source Cleaning products, like oven cleaner or rust remover, and home improvement goods, like solvents and paint. Anything containing mercury, like thermometers and fluorescent lights. Automotive materials, like fuel, antifreeze, and filters. Needles, syringes, and medicine."
    },
    {
      "title": "Trash dirty diapers, household items, and tanglers.",
      "content": "Trash dirty diapers, household items, and tanglers. Many items seem recyclable but aren’t. This includes common household items or tanglers, like USB cords, garden hoses, ceramic cookware, insulated coffee cups, shower curtains, liners, and mirrors. [32] X Research source If they're in good condition, consider donating them to a local charity. However, items beyond repair can be placed in the regular trash. In the case of dirty diapers, flush excrement down the toilet and place the diaper in the trash. [33] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Additionally, items that aren’t recyclable include packing peanuts, Styrofoam, plastic utensils, bubble wrap, laminated packaging, and toys. [34] X Research source"
    },
    {
      "title": "Hire a private trash company for construction projects.",
      "content": "Hire a private trash company for construction projects. If you plan on gutting out a bathroom or adding a room extension to your home, major projects require getting your own dumpster to safely dispose of heavy debris, like drywall, furniture, and more. This can be arranged through a construction or private trash removal company. [35] X Research source If you’re working on a small project, you can place up to six items (bags or bundles) curbside. However, it must be light enough to be lifted by two people and small enough to fit in a garbage truck. [36] X Research source Dumpsters range by location and size of the dumpster, but it can cost between $400 to $850."
    },
    {
      "title": "Recycling promotes a healthier planet.",
      "content": "Recycling promotes a healthier planet. Recycling can prolong the life of already extracted materials instead of continuously extracting timber, water, and minerals for new products. It diverts waste away from landfills and incinerators, reducing the harmful effects of pollution and emissions contributing to climate change. On average, the United States contributes 146.1 million tons of waste. [37] X Research source However, through recycling and composting, we can divert 94 million tons of items that end up in landfills. [38] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Recyclables are collected and processed into new products.",
      "content": "Recyclables are collected and processed into new products. Have you ever noticed a product that says it's made of recycled materials? The goods you toss into those giant blue bins get sorted, cleaned, and processed into new materials instead of made from raw materials and natural resources. A plastic bottle or take-out container can be used in recovered plastic for carpeting, park benches, or a tube for your favorite beauty product. [39] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Additionally, other items made of recycled content include car bumpers, cereal boxes, comic books, glass containers, motor oil, nails, and so much more!"
    }
  ]
}