{
  "url": "https://www.wikihow.com/Pack-Necklaces-for-Traveling",
  "title": "How to Keep Necklaces from Tangling When Traveling",
  "steps": [
    {
      "title": "Unroll a large piece of plastic wrap.",
      "content": "Unroll a large piece of plastic wrap. On a hard surface, unroll a sheet of plastic wrap that is large enough for your necklaces to rest vertically with 2 inches (5.1 cm) of space between each necklace. Unroll it slowly and place it on the surface immediately so that it doesn’t stick onto itself or anything else. [1] X Research source You can use regular plastic wrap or press and seal plastic wrap for this method of storing necklaces."
    },
    {
      "title": "Space the necklaces evenly across the plastic wrap.",
      "content": "Space the necklaces evenly across the plastic wrap. Gather the necklaces you want to pack and set them carefully onto your workspace. When holding up a necklace at the clasp, the necklace should fall in a nearly straight vertical line. Lay them onto the plastic wrap exactly like this, leaving 2 inches (5.1 cm) of space between each necklace so that they don’t get tangled. [2] X Research source When traveling with more than 6 necklaces, you may want to split the necklaces onto 2 separate sheets of plastic wrap as this can be easier to deal with. If so, repeat the directions for each batch of necklaces."
    },
    {
      "title": "Cut another sheet of plastic wrap that is the same size as the first one.",
      "content": "Cut another sheet of plastic wrap that is the same size as the first one. Your second sheet of plastic wrap will lay directly onto the sheet with your necklaces, so try to cut a piece that is the same size, or slightly larger, than the original sheet. [3] X Research source Don’t forget that plastic wrap is super sticky. Do your best to carefully remove it from the roll while holding onto each cut edge so it doesn’t become unruly."
    },
    {
      "title": "Place the second piece of plastic wrap on top of the first sheet.",
      "content": "Place the second piece of plastic wrap on top of the first sheet. Carefully holding the second piece of plastic wrap with a hand on each cut side, place it onto the first sheet covered in necklaces. You are essentially sandwiching the necklaces between each sheet of plastic wrap. [4] X Research source Be sure the necklaces between the plastic wrap stay separated. Use your fingers to adjust the necklaces as needed."
    },
    {
      "title": "Press to seal the necklaces between the two sheets of plastic wrap.",
      "content": "Press to seal the necklaces between the two sheets of plastic wrap. Now that your necklaces are sandwiched between two sheets of plastic wrap, press firmly between and around each necklace. [5] X Research source This will seal each necklace in plastic wrap, so they remain straight and separated. This will ensure that they don't fall into a tangled mess."
    },
    {
      "title": "Roll the sheet of wrapped necklaces and pack with your belongings.",
      "content": "Roll the sheet of wrapped necklaces and pack with your belongings. Carefully roll up the sheet of plastic-wrapped necklaces as though rolling a towel. This will make the necklaces easier to pack. Your final result will be a thick roll of plastic wrapped necklaces that can easily slip into your suitcase. [6] X Research source Since you have already secured each necklace within the plastic wrap, they will remain separated and safe when rolled up."
    },
    {
      "title": "Gather one straw for each necklace you plan to pack.",
      "content": "Gather one straw for each necklace you plan to pack. Once you have decided how many necklaces you want to pack, collect enough straws to match up with each necklace. [7] X Research source The type of plastic straw used will depend on the size of your necklaces. Thin straws will work well for thin chain necklaces, while straws with a larger opening will be best for necklaces that have more bulk."
    },
    {
      "title": "Unclasp a necklace and thread it through a straw.",
      "content": "Unclasp a necklace and thread it through a straw. Take the first necklace you want to pack and unclasp it. Once unclasped, drop the chain into the straw until it comes out the other end. At this point, you should have a straw strung on your necklace as though it were a pendant. [8] X Research source If your necklace has a pendant, slide it towards one end of your necklace so you can thread most of the chain through the straw. Leave the pendant outside of the straw, as it probably won't fit."
    },
    {
      "title": "Close the clasp of each necklace.",
      "content": "Close the clasp of each necklace. Once the chain of your necklace is running through each end of the straw, clasp the necklace to secure it. Repeat this with each necklace you intend on packing. [9] X Research source The straw ensures that the necklace won’t get tangled with itself or another piece of jewelry. It will keep the necklace pulled taught and secure."
    },
    {
      "title": "Place necklaces into a toothbrush holder or Ziploc bag.",
      "content": "Place necklaces into a toothbrush holder or Ziploc bag. Once you have a pile of necklaces strung onto the plastic straws, you will want to place them in a bag or holder to help them stay protected during travel. Use a large Ziploc bag to store your necklaces. Once you have placed the necklaces into the bag, roll the bag up so the necklaces don’t move around in transit. If you are only bringing a few necklaces, try dropping them into a plastic toothbrush holder to keep them safe and secure."
    },
    {
      "title": "Pack chunky necklaces by slipping them through a toilet paper tube.",
      "content": "Pack chunky necklaces by slipping them through a toilet paper tube. You can follow these same instructions for packing chunky necklaces– instead of using a straw, try a cardboard toilet paper roll. You can also use a paper towel tube for long chunky necklaces. Cut the roll down to the right size if necessary."
    },
    {
      "title": "Leave your most valuable pieces at home.",
      "content": "Leave your most valuable pieces at home. When it comes to traveling with jewelry, a general rule of thumb is to keep in mind the type of vacation when choosing what to pack. If you can avoid bringing expensive items, it is probably best to do so. However, if you are taking a trip where you need to bring your more expensive necklaces, you’ll just want to follow certain precautions to keep them safe. If you are going on a leisurely trip, try not to bring anything you are going to worry about losing. Bring a few neutral pieces that will work with multiple outfits but that you don’t have a lot of emotional or financial attachment to. Consider leaving particularly sentimental pieces (like wedding rings) at home. Wear a less valuable alternative on your ring finger during your trip."
    },
    {
      "title": "Make a list of all the necklaces you are traveling with to keep track of them.",
      "content": "Make a list of all the necklaces you are traveling with to keep track of them. When traveling with expensive necklaces, take the time to make a quick list of the necklaces you brought with you. Take one list with you and leave another at home (or email it to yourself). Having a list will help you keep track of your necklaces, which will especially come in handy if you misplace one or cannot remember which ones you packed. [10] X Research source It may be smart to take photos of the necklaces before you leave for your trip. If you misplace jewelry that is insured, photographs can be helpful when making a claim."
    },
    {
      "title": "Pack necklaces in your carry-on to keep them close by.",
      "content": "Pack necklaces in your carry-on to keep them close by. Always keep expensive necklaces in bags that won’t leave your sight. If flying, pack them in your carry-on. Don’t leave your jewelry in an unattended suitcase. [11] X Research source Carrying the necklaces in your purse or personal bag is your best bet when it comes to traveling with expensive necklaces."
    },
    {
      "title": "Store expensive necklaces in the in-room safe.",
      "content": "Store expensive necklaces in the in-room safe. When staying at a hotel, use the in-room safe to store expensive items when you aren’t wearing them. This will give you an extra sense of security when leaving the hotel room for the day. [12] X Research source"
    }
  ]
}