{
  "url": "https://www.wikihow.com/Make-a-Video-Call-on-Skype",
  "title": "How to Make a Skype Video Call on Any Device",
  "steps": [
    {
      "title": "Select the contact you want to call.",
      "content": "Select the contact you want to call. Click the Contacts tab at the top of the menu on the left side of the Skype window. Click the name of the person you want to call. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You’ll need to add at least one contact before you can make a video call. To do so, click the New Contact button at the top of the list of contacts. Search for the person you want to add using their Skype name, full name, phone number, or email address. You can also add their phone number to your contacts if they don’t have a Skype account, or invite them to join Skype. You can audio call people on mobile or landline phones with Skype, but your contact will need a Skype account in order to receive a video call from you. If you haven’t already downloaded and installed Skype, you can get the desktop app here . Launch the app and follow the instructions to sign in or set up a new account ."
    },
    {
      "title": "Click the video call button.",
      "content": "Click the video call button. This is the video camera icon at the top right corner of the screen. You’ll see it after you select a contact. You may be asked for permission for Skype to use your video camera and microphone. Click \"Allow\" to proceed with the call. If the person you’re calling is online, the call should ring a few times until they either pick up or the call times out. If they’re offline, the call will end immediately."
    },
    {
      "title": "Start a group chat to add more people to the call.",
      "content": "Start a group chat to add more people to the call. If you want to do a group call, there are a couple ways to do it: Click the Chats tab at the top of the lefthand menu pane, then select a group chat and click the Video Call button to call the whole group. To make a new group chat/call, select a contact or one-on-one chat, then click the Create New Group button at the top right side of the window. It looks like a person with a + sign. Add the other members of your group, then click the Video Call button."
    },
    {
      "title": "End the call when you’re done.",
      "content": "End the call when you’re done. End the call by pressing the End Call button on the bottom of the video call window. This is a red button with an icon of a phone receiver facing down. You may need to move your cursor around the inside of the video call window to reveal the hang-up button. Once you’ve called a contact, you can always call them again by clicking the Calls tab at the top of the lefthand menu bar, then hovering over their name in the call log. Click the Video Call icon to start a new video call."
    },
    {
      "title": "Tap the Contacts tab.",
      "content": "Tap the Contacts tab. It’s at the bottom of the screen in the Skype app."
    },
    {
      "title": "Tap the name of the contact you want to call.",
      "content": "Tap the name of the contact you want to call. Scroll through your list of contacts and tap the person you want to video call. If the person isn’t in your list, tap the blue New Contact button near the bottom of the screen. It looks like a person’s head and shoulders with a + sign. Look the person up by their Skype name, full name, email address, or phone number. They’ll need to have a Skype account to receive video calls from you over Skype. Tap Invite to Skype if the person you want to call isn’t on Skype already."
    },
    {
      "title": "Tap the Video Call icon.",
      "content": "Tap the Video Call icon. You’ll see this at the top of the page after you select a contact. Allow access to your mobile device’s microphone and camera if prompted. Once you tap the call button and give any requested permissions, the call will ring a few times until the person picks up or the call times out. The call will hang up almost immediately if they aren’t online."
    },
    {
      "title": "Create a group chat to make a group call (optional).",
      "content": "Create a group chat to make a group call (optional). To make a video call with multiple participants, you’ll need to add everyone you want to call to a single chat. Here’s how: Tap the Chats tab at the bottom of the screen, then tap the New Chat button near the bottom of the screen. Tap New Group Chat . Enter a group name and tap the right arrow button. Select the contacts you want to add, then tap Done . Select your group chat from the Chats list, then tap the Video Call button at the top right corner of the screen. It looks like a video camera with curved lines above and below it."
    },
    {
      "title": "End the call when you’re done.",
      "content": "End the call when you’re done. When you’re finished chatting, tap the red End call button at the top right corner of the screen. This will hang up the video call. Once you’ve made a call, you can always call the person back by going to your call log. Tap the Calls icon at the bottom of the screen and scroll through your call records until you find them. Tap the Video Call icon next to the call record to start a new video call."
    }
  ]
}