{
  "url": "https://www.wikihow.com/Prevent-a-Suicide",
  "title": "How to Prevent a Suicide",
  "steps": [
    {
      "title": "Pay attention to risk factors.",
      "content": "Pay attention to risk factors. There are some life events that make a person more likely to attempt suicide. If you know what to look for, you will have a better chance at preventing it from happening. Pay attention to the stressors going on in the person’s life and consider whether they might be placing the person at risk for suicide. Make a mental note of whether the person has attempted suicide in the past. You may have to just ask, “Have you ever considered suicide?” Be aware if anyone the person knows has recently died, especially from suicide. The death of someone close to them can cause some people to consider suicide. This is especially true for teenagers. [1] X Research source Find out if there is history of suicide in their family. You may have to ask them directly or ask one of their family members. Pay attention if the person is or has been a victim of violence, bullying, humiliation, or abuse. These situations can lead a person to view suicide as an option. Notice if the person has suffered a loss such as being laid off from work, a divorce or break-up, or even if their reputation has been severely damaged. Be alert if the person has a serious illness such as chronic pain or exhaustion with no end in sight. Sometimes people view suicide as a way to end their pain."
    },
    {
      "title": "Listen for verbal warnings.",
      "content": "Listen for verbal warnings. Often a person considering suicide will give verbal clues about what they are planning. Knowing what phrases to listen for can help you recognize when the person is suicidal and help them before they go through with it. [2] X Research source Be alert for phrases that suggest the person feels they are a burden on people like, \"Everyone is better off without me\" or \"They won't have to deal with me\". Listen for signs that they feel no one cares about them or understands such as: \"No one cares what happens to me\"; \"Nobody gets me\"; or \"You just don't understand!\" Pay attention if the person indicates that they don’t see any point in living by saying things like, \"I have nothing to live for\", \"I'm just so tired of life\". Notice if they say something hopeless such as: \"It's too late now. I can't go on\"; \"There is nothing left to do\"; \"What's the use\"; or, \"I just want the pain to stop.\""
    },
    {
      "title": "Notice their emotions.",
      "content": "Notice their emotions. You can help prevent a suicide by paying attention to how the person feels and is acting emotionally. There are some emotional warning signs that the person might be contemplating suicide. [3] X Expert Source Catherine Boswell, PhD Licensed Psychologist Expert Interview. 29 December 2020. If they aren’t expressing their feelings, then ask them. You might say, “How are you doing emotionally? How do you feel?” Have they expressed a sense of personal failure, hopelessness, or guilt? Do they seem depressed, anxious, or overwhelmed? Notice if they are crying a lot or are upset all the time. Make a note of whether they are moody or irritable. Do they get angry at things that didn’t bother them before? Sometimes people may even seem calmer and happier than they have been in a while. They may be looking forward to an end to their pain and suffering. Pay special attention to this sign, especially if they have been feeling down for a long time."
    },
    {
      "title": "Look for changes in behavior.",
      "content": "Look for changes in behavior. People that are thinking about suicide may show behavioral warning signs. Paying attention to how the person is acting can help you prevent their suicide. Pay special attention if the person is talking, reading, or writing about death/suicide. Notice if they seem disinterested in things they used to enjoy. Have they stopped participating in regular activities? Giving away personal possessions, especially items of value, for no reason is a sign someone might be considering suicide. Buying weapons or pills and visiting places like bridges, overpasses, rooftops, etc. may be signs a person may be planning suicide."
    },
    {
      "title": "Assess their intent.",
      "content": "Assess their intent. Find out how serious the person is about taking their life. Get all the information you can. This way you can take appropriate action to prevent their suicide. Ask the person, “Are you considering suicide right now? In the next few hours, days, or weeks?” Find out if they have a plan and the means to do it by asking, “Do you have a plan for how to do it? Do you already have the weapon?” Keep in mind that they may not be honest about their intent. Consider their warning signs and risk factors, as well as what they tell you."
    },
    {
      "title": "Use your 'CLUES'.",
      "content": "Use your 'CLUES'. This acronym stands for Connect, Listen, Understand, Express concern, and Seek help. Using the steps of ‘CLUES’ will help you remember what to do to prevent a suicide or help someone else in trouble. [4] X Expert Source Catherine Boswell, PhD Licensed Psychologist Expert Interview. 29 December 2020."
    },
    {
      "title": "Connect with the person.",
      "content": "Connect with the person. One of the worst things for a person contemplating suicide is feeling that no one understands or cares. The key is to help this person stop feeling invisible. Talking to them builds a connection and lets them know that you care. Actively show that you hear what is being said and understand that their pain is real. [5] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. Telling them things like, “It’s not that bad” or “Things will get better” doesn’t help and may make the person feel like you don’t understand or aren’t listening to them. Instead, say things like, “You aren’t alone. I’m here to listen and help” or “I may not understand exactly how you feel, but I know I want to help you in any way I can.”"
    },
    {
      "title": "Listen to them.",
      "content": "Listen to them. If the person is upset, admits they are considering suicide, and/or shows a lot of the warning signs for suicide, don’t leave them alone. Stay with them, talk with them, and listen to what they have to say. [6] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. You don’t have to say a lot, or even anything. Just being present with them and listening to them talk about how they feel can prevent a suicide. If you can’t stay, then contact someone else that you and the person trust to come stay. Don’t leave until the other person arrives. Remove any distractions (cut off the TV, log-off the computer) so that you can focus on the person, but keep your phone nearby so you can call for help."
    },
    {
      "title": "Understand how they feel.",
      "content": "Understand how they feel. Although you may have never considered suicide, try to sympathize with how the person is feeling. Don't tell them how they should feel or what they should do. Just express your desire to support them and understand what they are feeling. Reflect what is said back to the person to show that you understand how they feel. [7] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. For example, if they say \"I've tried everything, but don't know what else to do.\" You can reply, \"I understand. It's frustrating when you've tried so many things but there's no relief.”"
    },
    {
      "title": "Express your concern.",
      "content": "Express your concern. Let the person know that you are worried and want to help. Just knowing that you care about them, how they are feeling, what they are going through, and their life may help prevent a suicide. [8] X Research source Be yourself and be honest when you talk to them and express your concern. [9] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. Say something like, “I don’t know how to solve your problems, but I do know that I am worried about the effect they are having on you. I don’t want you to die.”"
    },
    {
      "title": "Seek help.",
      "content": "Seek help. The person's safety is the number one priority, and you might not be able to handle it on your own. Talking to a professional about the person that is contemplating suicide can get them the help that they need. This is especially true when the person won’t seek help on their own. [10] X Expert Source Catherine Boswell, PhD Licensed Psychologist Expert Interview. 29 December 2020. You can contact a crisis hotline like the 988 Suicide and Crisis Lifeline (which can be reached by calling or texting 988), or text 741741 to get in touch with a trained counselor at the Crisis Text Line if you're more comfortable sending a message if you're in the United States. [11] X Trustworthy Source National Institute of Mental Health Informational website from U.S. government focused on the understanding and treatment of mental illness. Go to source You can also contact the emergency services number for your area if you think the person is seriously ready to attempt suicide. Contact a crisis counselor, religious leader, therapist, doctor, psychologist or other professional that has the training needed to prevent a suicide. Tell them, “I am with someone that is suicidal”. The person may get upset when you call for help, but you are doing the right thing to prevent a suicide. Explain to the person that you are only trying to help them and that is why you are contacting a professional. You might say, “I’m not trying to upset you. I just want to help and this is the best way for me to do that.”"
    },
    {
      "title": "Let someone close to them know.",
      "content": "Let someone close to them know. Lots of times someone that is suicidal will ask you not to tell anyone else about what is going on. You don’t need to tag their friends in a Facebook post saying the person is suicidal, but you should let someone close to them know what is going on. This way, the person has a support team looking out for them and trying to prevent the suicide. The stress of this won’t be only on your shoulders. If the person is under 18, then tell an adult you trust. You can tell the person, “I don’t want to make you mad, but we need help with this. I’ll call Coach.” You could explain to the person that you aren’t going to mention suicide. This can help you and the person feel better about you asking for help. For example, “I’m not going to mention suicide. I’m just going to say we have some emotional stuff we need help with.” If the person is being abused by someone, you should avoid telling the abuser. Instead, you should talk to a teacher, coach, or supervisor about your concerns. Take the source of their issues into account when deciding who to talk to. For example, if the source of the problem is a teacher, then don't go to that teacher with your concerns."
    },
    {
      "title": "Set up a safety plan.",
      "content": "Set up a safety plan. You can prevent a suicide by setting up a plan in advance for handling suicide attempts or signs that a person is planning suicide. This way everyone on the support team will know what to do. You can download a Suicide Prevention Safety Plan from the Suicide Prevention Lifeline website. Include a list of people that will check on the suicidal person, important phone numbers, etc. Include the person when you are making the plan and if possible, have a professional help make it. Also, encourage them to see a therapist so that they can work on their issues and help them to identify a support system, such as friends and family."
    },
    {
      "title": "Check-in frequently.",
      "content": "Check-in frequently. Don’t stop checking on the person immediately after the suicide crisis is over. Regular check-ins allow you to recognize any warning signs or new risk factors for suicide. They also let the person know that you still care about them and how they are doing. Make sure other people on the support team are checking in with the person as well. Checking on the person doesn’t have to be a serious thing. It can be meeting up for ice cream and a chat about how the week is going. You don’t have to ask, “Are you thinking about suicide?” every time you get together, but do be on the lookout for warning signs."
    },
    {
      "title": "Encourage healthy living.",
      "content": "Encourage healthy living. One way to prevent a suicide is to encourage the person to do things that will help keep them healthy in general. Encourage them to eat well, get enough sleep, get physical activity, and socialize. Work with them to develop a bedtime routine to make sure they are getting enough rest. Suggest activities that you can do together like hiking, playing a sport, or swimming that will also get the person physically active. Buy the person a journal so that they can express their feelings instead of holding them in."
    },
    {
      "title": "Take care of yourself.",
      "content": "Take care of yourself. Trying to prevent a suicide can be physically, emotionally, and mentally draining on you. Make sure you are doing the things you need to do to take care of yourself, just like you are doing for the person considering suicide. Get enough sleep and eat healthy meals. Spend time with your friends and family doing things you enjoy. Go to see a funny movie, take a bike ride, or have a picnic. Start practicing meditation or using other stress-reduction and coping strategies. Even just taking a few deep breaths can help calm you from the stress of trying to prevent a suicide."
    },
    {
      "title": "Recognize emotional abuse.",
      "content": "Recognize emotional abuse. If someone threatens suicide as a way to get you to do what they want (whether you believe them or not), it’s emotional abuse. You aren’t responsible for someone choosing suicide. And you shouldn’t feel pressured to do something you aren’t comfortable doing because someone is threatening suicide. If you know someone that threatens suicide when you don’t do what they want, you should tell someone you trust. For example, if your boyfriend says he will kill himself every time you say you want to leave him, you should tell a close friend, your parents, or someone else you trust. You can also call or text the 988 Suicide & Crisis Lifeline or text the Crisis Text Line at 741741 if you're in the United States, or dial your national emergency number. They can help the person threatening suicide and you. Calling for help will also let the person know that even though you aren’t giving into what they want, you do take their suicide threat seriously."
    }
  ]
}