{
  "url": "https://www.wikihow.com/Reject-a-Guy-Who-Wants-Your-Number",
  "title": "How to Reject a Guy Who Wants Your Number",
  "steps": [
    {
      "title": "Just tell him no.",
      "content": "Just tell him no. You don't necessarily have to give him an explanation or a reason why. You can just tell him that you're not interested, or you don't want to give him your number. If you use this method, make sure you really don't want to keep in touch with the guy, even if you see him again. [1] X Research source For instance, you could say, \"Thanks for asking, but I'm not interested.\" You can also just give him a number to stay in touch as friends, as long as you are abundantly clear about it. For instance, you could say, \"I don't mind giving you my number, but I would only do so as friends. I'm not interested in anything else right now.\""
    },
    {
      "title": "Try a little less direct approach.",
      "content": "Try a little less direct approach. If you want, you can take a direct, but not quite as direct approach. For instance, you can try to soften the blow by leading with something you like about the guy. That way, the rejection won't come as hard. [2] X Research source As an example, you could say, \"I'm flattered, but I don't think I'm in a place to be dating right now. I have to say no.\" This approach helps make it less about him, so he won't feel as hurt."
    },
    {
      "title": "Make sure you include the word \"no.\"",
      "content": "Make sure you include the word \"no.\" When you're using the direct or indirect approach, \"no\" needs to be in what you say. If you hem and haw around it without actually using the word \"no,\" you leave him thinking he may still have a chance with you. You don't need to be mean, just direct. [3] X Research source For instance, saying \"I'm not sure I want to date right now\" leaves it a little uncertain. Instead, make sure you make it clear. \"I'm not interested in dating right now, so I have to say no.\" Be polite but firm. Thank the guy for his interest. Say that you're flattered he is interested. However, let him know that you're not looking for a relationship at the moment, and hence, you're not able or willing to share your number."
    },
    {
      "title": "Don't apologize.",
      "content": "Don't apologize. It's a natural reaction. You want to apologize for making the person feel bad. However, you don't need to apologize for not wanting to give out your number. In addition, it can draw attention to the fact that you feel sorry for him, which in turn can make him feel worse. [4] X Research source"
    },
    {
      "title": "Give out a fake number.",
      "content": "Give out a fake number. This option can be a little risky, since he can call it right then and see if it is actually your number. However, it can be a way to get someone to stop asking you out in an indirect way. [5] X Research source Also, make sure the number you're giving isn't someone else's number. You can look up most numbers online to see if they connect to a person. You don't want to be giving out a person's number to a stranger. If you happen to run into him again and he asks you about it, just ask to see the number, then say \"Whoops! Wow, I spaced out. I totally wrote down one of the numbers wrong.\" And when he asks for the number again you can do the same thing. (If you're going to see him more than twice, it's best to just tell the truth.)"
    },
    {
      "title": "Give out a hotline number.",
      "content": "Give out a hotline number. Some hotlines have been designed specifically for rejecting guys. Others are just a silly way to give a fake number. Either way, you can use these numbers to hand out to the guys you meet so you don't have to give your number. [6] X Research source Another option is the rejection line. It explains to the guy that you've given him a false number as a way of rejecting him with a bit of humor thrown in. The number is (605) 475-6968. [7] X Research source"
    },
    {
      "title": "Use a friend as a boyfriend.",
      "content": "Use a friend as a boyfriend. Another option is to take a guy friend with you when you're out who's willing to pretend to be your boyfriend. That way, if you need to reject someone, you can use him as a decoy. You could say, \"Oh, I would if I were single, but I'm here with my boyfriend.\" It helps to grab your decoy boyfriend's arm at this point."
    },
    {
      "title": "Use safety as an excuse.",
      "content": "Use safety as an excuse. One way to sidestep the issue is to say that you don't ever give out personal information to strangers as a way of staying safe. Of course, this has an element of truth for most people, so you're really not lying. [8] X Research source You could say, \"I'm sorry, I don't give out my number to strangers. I've had some bad experience with doing that in the past, so I don't give out my number anymore.\" If you make it so he realizes it's a general rule, he won't feel so personally rejected."
    },
    {
      "title": "Use a boyfriend as an excuse.",
      "content": "Use a boyfriend as an excuse. Even if you don't have a boyfriend, you could pretend to have a boyfriend to make the rejection easier. If the guy thinks you have a boyfriend, then it's nothing personal against him. [9] X Research source As an example, you could say, \"I can't give you my number. I have a boyfriend.\" Most guys will walk away without another thought at that point."
    },
    {
      "title": "Turn the tables.",
      "content": "Turn the tables. Another way to sidestep the issue is to ask for his number instead. That way, the power is in your hands, and you can do with it what you want. Just make sure to take the number yourself. Don't hand him your phone, as he could use it to give himself your number. [10] X Research source It may seem cruel to take a number just to blow the guy off later. However, if a guy won't leave you alone, it's a good way to get him to stop."
    },
    {
      "title": "Stay safe.",
      "content": "Stay safe. Don't be afraid to walk away if you need to do so. If a guy turns hostile after rejection, get security involved and then leave where you are as soon as possible. It's always better to be safe than sorry. [11] X Research source If you're not in a place that has security, tell management or call the police if you feel your safety is threatened. It's also a good idea to go out in groups. While guys don't limit asking girls out to clubs, when you are going out to the club, take some friends with you."
    }
  ]
}