{
  "url": "https://www.wikihow.com/Set-Homepage-in-Google-Chrome",
  "title": "How to Change the Homepage or Startup Page in Google Chrome",
  "steps": [
    {
      "title": "Open Google Chrome.",
      "content": "Open Google Chrome. You can use Chrome on your Windows, Mac, or Linux computer. Your homepage is where you're redirected after clicking the house icon near the address bar. This is different from your startup page . [1] X Research source Chrome should update automatically. If it isn't updated, you can update it manually ."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . This is in the top right corner of your Chrome window."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . You can find this towards the bottom of the drop-down menu."
    },
    {
      "title": "Click Appearance.",
      "content": "Click Appearance . This tab is in the left panel."
    },
    {
      "title": "Toggle on \"Show home button\".",
      "content": "Toggle on \"Show home button\". This button will appear in the top, to the left of the address bar. This is what you'll click to be redirected to your homepage. If this is already enabled, skip this step."
    },
    {
      "title": "Enter a URL in the \"Custom web address\" field.",
      "content": "Enter a URL in the \"Custom web address\" field. This is below the New Tab page option. The bubble will fill out automatically. If you want to set your homepage as a new page page, select that option instead."
    },
    {
      "title": "Click the Home button.",
      "content": "Click the Home button. It's the house-shaped icon in the top left corner of your browser window; doing so should take you to your selected homepage!"
    },
    {
      "title": "Open Google Chrome.",
      "content": "Open Google Chrome. You can use Chrome on your Windows, Mac, or Linux computer."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . This is in the top right corner of your Chrome window."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . You can find this towards the bottom of the drop-down menu."
    },
    {
      "title": "Click On startup.",
      "content": "Click On startup . This tab is in the left panel."
    },
    {
      "title": "Select Open a specific page or set of pages.",
      "content": "Select Open a specific page or set of pages . This is the third option. Alternatively, you can select Open the New Tab page or Continue where you left off . If you select Continue where you left off , Chrome will open the last tab(s) that were active when you previously closed Chrome."
    },
    {
      "title": "Click Add a new page.",
      "content": "Click Add a new page . This is the first option. A pop-up menu will open."
    },
    {
      "title": "Enter a URL.",
      "content": "Enter a URL. Make sure it's a valid web address."
    },
    {
      "title": "Click Add.",
      "content": "Click Add . This is the blue button. Now when you start Google Chrome, you'll see the designated page."
    },
    {
      "title": "Open the Google Chrome app.",
      "content": "Open the Google Chrome app. Currently, you can only change your homepage on the Chrome app for Android . If you have an iPhone or iPad, you won't be able to change your Chrome's homepage."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . This is at the top-right corner."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . You can find this in the pop-up menu."
    },
    {
      "title": "Tap Homepage.",
      "content": "Tap Homepage . This is underneath the Advanced header."
    },
    {
      "title": "Select a homepage.",
      "content": "Select a homepage. You can select Chrome's homepage to enter a URL in the Custom section."
    }
  ]
}