{
  "url": "https://www.wikihow.com/Paint-over-Gloss-Paint",
  "title": "How to Paint over Gloss Paint",
  "steps": [
    {
      "title": "Remove furniture, decor, or anything else that could get in your way.",
      "content": "Remove furniture, decor, or anything else that could get in your way. Clear out any obstacles that could get in your way while you’re working paint over the gloss paint. Take out chairs and furniture, take down any paintings or wall art, and keep out any people or pets who could get in the way. [1] X Research source If you’re painting over a small item that has gloss paint, such as a vase, make sure your workspace is clear of any obstructions."
    },
    {
      "title": "Lay down a drop cloth to protect your floor from paint.",
      "content": "Lay down a drop cloth to protect your floor from paint. Use plastic sheeting or drop cloths to cover the floor as well as anything else you want to keep protected from paint. Even if the area isn’t directly beneath what you’re painting, the paint can drip or splatter, so be sure to cover the area well. [2] X Research source If you’re painting an object at a workspace, cover the workspace so you don’t make a mess while you’re working. You can find plastic sheeting and drop cloths at paint supply stores, at home improvement stores, and online."
    },
    {
      "title": "Use painter’s tape to mask off areas you don’t want to get paint on.",
      "content": "Use painter’s tape to mask off areas you don’t want to get paint on. Tape off the floorboards and tape the edges of your plastic sheeting or drop cloths so they’re flush against the edges and will keep paint out. Apply the tape to any trim or any other areas you want to be protected. [3] X Research source"
    },
    {
      "title": "Wear rubber gloves and a face mask for safety.",
      "content": "Wear rubber gloves and a face mask for safety. Put on a pair of gloves to keep paint from getting onto your hands. Wear a face mask to avoid inhaling the dust particles produced when you sand down the gloss paint. [4] X Research source The flakes and dust from the gloss paint can irritate your lungs and throat. You can find rubber gloves and face masks at home improvement stores, at department stores, and online."
    },
    {
      "title": "Sand the paint in circular motions with 180-grit sandpaper.",
      "content": "Sand the paint in circular motions with 180-grit sandpaper. The glossy surface of the paint needs to be removed so the new paint can properly adhere to it. Lightly sand the entire surface of the paint evenly so it’s no longer slick and glossy. [5] X Expert Source Jeff Baldwin Residential Painter Expert Interview. 26 February 2021 Be sure to work the sandpaper into any corners or crevices so you can remove the glossy sheen. [6] X Research source Don’t try to remove or scrub off the paint, just the glossy surface. Use a fine-grit sandpaper between 180 and 220-grit. Rougher sandpaper will strip and damage the paint."
    },
    {
      "title": "Combine dish soap, white vinegar, and warm water.",
      "content": "Combine dish soap, white vinegar, and warm water. Fill a medium-sized bucket with 1 US quart (0.95 L) of warm water. Add 1 teaspoon (4.9 mL) of dish soap and 1 ⁄ 4 teaspoon (1.2 mL) of white vinegar into the bucket of water. Stir the mixture well to fully combine it. [7] X Research source Use warm water so the mixture fully combines and forms soapy suds that will more effectively lift dirt, dust, and grime."
    },
    {
      "title": "Dip a clean sponge into the solution and then wring it dry.",
      "content": "Dip a clean sponge into the solution and then wring it dry. To avoid creating streaks and oversaturating the gloss paint, use as little water as possible when you’re cleaning it. Submerge a sponge into the cleaning solution and then squeeze out the excess water so it’s almost completely dry. [8] X Research source Use a gentle sponge, such as a cellulose sponge, without a scrubbing surface. You can find gentle sponges at department stores and online."
    },
    {
      "title": "Wipe the surface of the paint with the damp sponge.",
      "content": "Wipe the surface of the paint with the damp sponge. Use gentle, circular motions to clean the surface of the gloss paint and remove any dust, dirt, or grime. If there are stains on the paint, spend more time softly rubbing it to lift them off. [9] X Research source Focus on removing the dust left behind after sanding the paint. Avoid scrubbing the gloss paint so you don’t damage it. Be sure to clean any corner and cracks as well."
    },
    {
      "title": "Dry the gloss paint with a clean towel.",
      "content": "Dry the gloss paint with a clean towel. Use a dry and clean towel or cloth to wipe away any moisture from the surface of the paint. Dry the paint gently so you don’t get any fibers from the cloth trapped in it and you don’t chip or damage the paint, which can affect the appearance of the new paint you plan to add. [10] X Research source You could also let the paint air dry for an hour. But touch it with your finger to make sure it’s dry before you move on."
    },
    {
      "title": "Use a paintbrush or roller to apply a bonding primer in broad strokes.",
      "content": "Use a paintbrush or roller to apply a bonding primer in broad strokes. A primer will help prevent peeling and chipping when you paint over the gloss paint. Apply a thin, even layer over the entire surface with the gloss paint. [11] X Expert Source Jeff Baldwin Residential Painter Expert Interview. 26 February 2021 Start at the top of the surface and work your way down so you can cover the area evenly. [12] X Research source Choose a bonding primer for the best adhesion to the surface with gloss paint. You can find bonding primer at paint supply stores, at home improvement stores, at department stores, and online."
    },
    {
      "title": "Wait at least 1 hour to allow the primer to dry.",
      "content": "Wait at least 1 hour to allow the primer to dry. Check the packaging of the primer to find out the recommended drying times. Leave the primer undisturbed to allow it to fully dry. Test that it’s dry by lightly touching it with your finger. If none of the primer comes off on your fingertip, then it’s dry. [13] X Research source Turn on a ceiling fan or place a fan in the room so you can improve airflow and help the primer dry faster."
    },
    {
      "title": "Use broad strokes to apply an even layer of paint.",
      "content": "Use broad strokes to apply an even layer of paint. Use a paintbrush, a paint roller , or a paint sprayer to apply the new coat of paint over the surface with gloss paint. Start at the top of the surface and work your way down for even coverage. [14] X Research source You can use oil-based, water-based latex, acrylic, or any other type of paint to paint over the gloss paint because the surface has been sanded and prepared. You can find paint at paint supply stores, at home improvement stores, at department stores, and online."
    },
    {
      "title": "Let the paint dry for 1 hour.",
      "content": "Let the paint dry for 1 hour. Wait at least an hour and then check the paint to see if it’s dry by lightly touching it with your finger. Check the packaging of the paint for specific drying times."
    },
    {
      "title": "Add a second coat of paint for complete coverage.",
      "content": "Add a second coat of paint for complete coverage. After the first coat is completely dry, apply a second coat of paint so the gloss paint and primer aren’t visible at all. Cover the entire surface evenly with the second coat and allow it to fully dry. [15] X Research source If you can still see through the first 2 coats, add another once the paint is dry."
    }
  ]
}