{
  "url": "https://www.wikihow.com/Pierce-Your-Own-Nose",
  "title": "How to Pierce Your Own Nose",
  "steps": [
    {
      "title": "Envision your piercing.",
      "content": "Envision your piercing. Look at various styles of nose piercing and decide what you want. For your first home piercing, consider a simple stud or a nose ring . Think about how you're going to look with this piercing, and make sure that you know exactly what you want. Consider getting your nose pierced professionally. A professional job is usually a much safer, cleaner, and less painful experience. If you pierce your nose at home, you risk bleeding, infection , or a botched job. [1] X Research source On the other hand, it can be fulfilling to do the piercing yourself."
    },
    {
      "title": "Buy the jewelry.",
      "content": "Buy the jewelry. You can find piercing studs, rings , and bars in jewelry stores, tattoo parlors, and novelty shops. Try searching online if you know exactly what you want. Make sure that you're buying sterile, unused jewelry, and consider starting with something small. Make sure you have the right size, length, and thickness. Do not use a ring, an earring, or anything that has been used before. Be aware that some people have allergies to certain metals. Nickel allergies are the most common metal allergy and may cause a painful rash. Gold, cobalt, and chromate are other common sources of metal allergy. [2] X Research source If your skin looks cracked or blistered after the piercing, you should remove the piercing and see a doctor as soon as possible. Consider using titanium jewelry, or stainless steel – anything that will not easily corrode. Look for metals that are free of nickel: 14-24 karat yellow gold, sterling silver, copper, or platinum. Polycarbonate plastic is usually safe to use."
    },
    {
      "title": "Wait until your skin is clear.",
      "content": "Wait until your skin is clear. If you try to pierce over (or near) an infected skin blemish, the piercing itself will face a higher risk of infection . Thus, if you have any acne or blackheads, wait a few days or weeks until the rash recedes. Wash your face regularly, and consider using a pore-cleansing (or medicated) facial scrub."
    },
    {
      "title": "Prepare the needle.",
      "content": "Prepare the needle. Be sure to use a fresh needle; if it isn't pre-packaged, then you can't be sure that it hasn't been used before. Use a hollow needle – these are more effective. Use a thin gauge, between 20G (.81mm) and 18G (1.0mm), and make sure that the hole is not smaller in diameter than your jewelry. [3] X Research source Take the needle out of the packaging, when you are ready, and be sure to sterilize it before you put it into your skin. A safety pin, a pushpin, an earring, or a sewing needle will make the piercing more prone to infection; it can be hard to properly sterilize these objects. The point may also be too dull to pierce, which can tear the tissue and put too much stress on the piercing. Don't set the needle down anywhere, lest it gets contaminated. If you must set it down, use a clean tissue or a sterilized tray."
    },
    {
      "title": "Sterilize everything.",
      "content": "Sterilize everything. This includes the needle, the jewelry, and any other tools that you will handle during the piercing process. Soak the needle in rubbing alcohol, and then boil it in hot water. Wash your hands with antibacterial soap, and then put on latex gloves. Do not touch anything that has not been sterilized. Change the gloves every time you touch your nose. Put on a fresh pair of gloves just before you do the actual piercing."
    },
    {
      "title": "Mark your nose.",
      "content": "Mark your nose. Use a sharpie to make a small dot on your skin where you want the stud to go. Look in the mirror and make sure that it's right. If the mark is too low or too high, wash it away and adjust it. Draw and redraw the mark until you are completely satisfied."
    },
    {
      "title": "Clean the area before piercing.",
      "content": "Clean the area before piercing. Dab a cotton swab with rubbing alcohol, then wipe down the area that you plan to pierce. Watch out for your eyes: the alcohol will sting. Consider using an ice cube to make the area numb . Hold the ice against your nostril for up to three minutes, until you can't feel the tissue. Be aware that this might make your skin tighten up, which could make it more difficult to pierce."
    },
    {
      "title": "Use a piercing clamp.",
      "content": "Use a piercing clamp. If you have a piercing clamp, tighten it so that it secures the area that you plan to pierce. Consider buying a clamp if you don't have one already. The clamp should hold the space open so that you don't poke the inside of your nose or your finger."
    },
    {
      "title": "Calm yourself.",
      "content": "Calm yourself. Take a deep breath before beginning. If you are shaking, take a moment to relax and find your center. Take solace in the fact that a nose piercing is relatively simple, as piercings go. There is not much skin or fat to pierce in your nose, so the procedure is straightforward, and the pain is relatively minimal."
    },
    {
      "title": "Pierce your nose.",
      "content": "Pierce your nose. Look in the mirror and line up the needle with the dot that you marked. Take a breath, and then do it quickly. Push the needle in perpendicular to the surface of your skin and take care to slide straight through the tissue. You will feel pain, but it will be temporary. Remember: the more quickly you perform the piercing, the more quickly it will be over. Try not to poke the inside of your nostril. If you are piercing the side of your nostril, you don't want to push too deep – or it will be more painful."
    },
    {
      "title": "Immediately insert the ring or stud.",
      "content": "Immediately insert the ring or stud. It's essential that you're quick about it. The wound will begin to heal as soon as you remove the needle, meaning that the hole will begin to close. You want the hole to heal around your jewelry so that it's a natural fit. If you wait too long, you will have pierced your skin for nothing!"
    },
    {
      "title": "Clean the piercing",
      "content": "Clean the piercing twice a day. Use a sterile saline solution, a 50/50 water-and-soap solution, or hydrogen peroxide. Twice a day, saturate a cotton swab with the cleaning solution, then let it soak into the pierced area for a few minutes. Wipe your piercing from inside and outside your nose. If you've given yourself a nose ring, rotate it slightly each time you clean it. [4] X Research source If you are especially worried about infection, it's okay to clean the piercing as often as every few hours. Avoid cleaning too often, however, if you're using a particularly harsh cleaning agent. Repeat this process every day until the piercing heals. Your nose will be swollen and sore for a few days after the job, but it should feel normal before the week is over. Be aware that the piercing may take as long as 3-4 months to completely \"heal\". Be aware that hydrogen peroxide may disrupt scarless wound healing. Many piercing professionals advocate the use of this chemical as a cleaning agent, but you should be aware of the risks. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Avoid infection!",
      "content": "Avoid infection! Always wash your hands before handling the piercing and clean it regularly. If you are fastidious about cleaning the piercing, and you were careful to sterilize all of your equipment, you shouldn't need to worry. If, however, your piercing is still red and painful a week later, there's a chance that the wound has become infected. Seek medical advice before it gets worse. Consider using antibiotics like Neosporin and antibacterial soap to protect the wound. These products can seriously reduce the risk of inflammation. If you don't clean your piercing regularly, you may need to use heavy-duty prescription antibiotics – which can be costly and questionable for your health."
    },
    {
      "title": "Don't remove the piercing for too long.",
      "content": "Don't remove the piercing for too long. If you take it out for longer than a few hours, there's a chance that the hole will close up. The skin of your nostril heals very quickly, and you might have to pierce it again if the stud no longer fits. Leave your stud in for at least three months before changing it out with something else."
    },
    {
      "title": "Ask for advice.",
      "content": "Ask for advice. If you have any questions, do not hesitate to ask around at your local piercing parlor. Although you didn't get your piercing done there, they will probably be willing to give you advice if you ask nicely. If you have any medical concerns, don't hesitate to visit your doctor."
    }
  ]
}