{
  "url": "https://www.wikihow.com/Save-a-Dying-Kitten",
  "title": "How to Save a Dying Kitten",
  "steps": [
    {
      "title": "Find a box.",
      "content": "Find a box. If you don’t have a pet carrier available, you will need to find a box to put the kitten in. Make sure that the box is big enough for the kitten to comfortably stand up and turn around, but not so big that it will dangerously roll around when you turn corners. [1] X Research source Secure the top of the box so that the kitten cannot crawl out. Put air holes in the sides of the box so that the kitten has abundant fresh air. To help the kitten feel safer and to absorb any vomit or urine, place an old towel or t-shirt in the box with the kitten."
    },
    {
      "title": "Keep the kitten warm.",
      "content": "Keep the kitten warm. Newborn kittens don’t have the ability to regulate their own temperature and will rely on their mother or you to keep them warm. Wrap a towel or blanket around the box that you’re keeping the kitten in, but make absolutely sure that you have left the air holes unobstructed. [2] X Research source You can also wrap the kitten up in a towel or old shirt to give it extra warmth. Just as you need to keep the air holes free and clear, if you wrap the kitten up, ensure that you’ve left the kitten’s head and airways unobstructed."
    },
    {
      "title": "Locate the nearest vet.",
      "content": "Locate the nearest vet. Your kitten needs medical attention right away. You may need to find an emergency veterinarian if the kitten needs immediate attention and your local veterinarian can’t see you. Get your kitten to the nearest vet to improve its chances of survival, but remember that an emergency appointment does typically cost more than a routine veterinarian visit. [3] X Research source Use a search engine and type “emergency veterinarian near me.” Or, simply type in veterinarian and your zip code in the search bar. Or call your local Humane Society and ask for a referral."
    },
    {
      "title": "Transport the kitten to the vet.",
      "content": "Transport the kitten to the vet . Your kitten is already in a box or carrier, and now you need to transport it to the veterinarian. Kitty might make crying sounds or meow quite a bit during the drive, and that’s okay. It just means that your kitten is uncomfortable with riding in a car; unfortunately, you need to get it to the vet and don’t have time to let kitten adjust to the carrier. Just wrap make sure that you have soft cloths in the carrier or box and that you drive cautiously, making no sudden movements with the car or turns that would cause the kitten to roll around inside the carrier. [4] X Research source Some kittens do better when they can see out the car’s windows, and others do better they can’t. You can try both positions and see which your kitten handles better."
    },
    {
      "title": "Resuscitate the kitten with CPR.",
      "content": "Resuscitate the kitten with CPR . Cardiopulmonary resuscitation (CPR) is the simulated heartbeat and breathing performed by a rescuer on an unresponsive patient, and works on humans, cats, and a variety of other animals. Only administer CPR if you are confident that the kitten is not breathing or heartbeat. While CPR is being administered, designate someone to contact your veterinarian. If nobody else is available, contact them yourself if you’re able. [5] X Research source Clear the kitten’s airway of any obstructions. If the kitten has a foreign object lodged in their throat, use your finger to dislodge the object. If their mouth, throat, and lungs are full of fluid, hold the kitten with their head facing toward the ground so that gravity will help you clear their airway. Put your mouth around the kitten’s nose and mouth and give three small puffs of air. You only need to give little puffs because the kitten’s lungs are too small to take in much air. Use discretion and remember that there are diseases that are transmitted between cats and humans. Administer a breath every 20 seconds. If your kitten is not breathing but has a heartbeat, only offer rescue breaths and skip chest compressions. Feel the kitten’s chest for a heartbeat. If no heartbeat is located, take the cat’s chest between your forefinger and thumb and administer chest compressions by squeezing the chest behind the kitten’s bent elbow. Check for a heartbeat every minute. Don’t perform CPR for more than five minutes, as survival is unlikely at that point."
    },
    {
      "title": "Control bleeding.",
      "content": "Control bleeding. If your kitten has a long or deep cut, or a deep puncture wound, you will need to control their bleeding so that they don’t bleed out. Fortunately, you control a kitten’s bleeding almost exactly like you would a human’s. The goal is to get the wound clean, the bleeding controlled, and the cat to a veterinarian as soon as possible for stitches. Clean around the edges of the wound with water or antiseptic solution. Once the edges of the wound are clean, use clean gauze or cloth to apply firm, direct pressure. Apply pressure for 5-10 minutes, and don’t lift the gauze or cloth to check the wound. That will only promote the wound to bleed again. Once the bleeding is controlled, tape the gauze or cloth down and get the kitten to a vet. Try to limit the kitten’s movement so that they don’t restart the bleeding or tear off their bandage."
    },
    {
      "title": "Control its temperature.",
      "content": "Control its temperature. Kittens are prone to hypothermia and need heat, which is typically provided by the mother cat. If the mother is unable or unwilling to warm up the kitten, or if she isn’t present, you’ll need to warm the kitten quickly and safely. Place the kitten in a box with bedding, such t-shirts or old, soft towels and warming bottles, also known as hot water bottles. Newborn kittens aren’t able to regulate their own temperatures and rely on their mother to do it for them. Don’t use a blow dryer or other mechanized heat source that blows heat directly on the kitten. This could actually cause them to overheat."
    },
    {
      "title": "Fight fading kitten syndrome.",
      "content": "Fight fading kitten syndrome. Even with an attentive mother and perfect care, some kittens in a litter may pass before they are weaned. Kittens who die before they wean are called fading or wasting kittens. There are several health conditions that contribute to these losses and the mortality rate among kittens. Catching symptoms of fading kitten syndrome early is the kitten’s best chance at survival, but you must remember that sometimes these losses are often unavoidable. [6] X Research source If you suspect that you have a fading kitten, get them to a veterinarian right away, which is their best chance at survival. Some causes of fading kittens are congenital defects, traumatic birth, environmental toxins, blood type incompatibility between mother and kitten, prematurity or low birth weight, parasitic, bacterial, or viral infections, environmental temperature too hot or too cold, and even dehydration ."
    },
    {
      "title": "Watch for lethargy.",
      "content": "Watch for lethargy. Kittens are naturally playful, curious, and energetic. They sleep quite a bit, as babies do, but when they’re awake, kittens are bundles of inquisitive energy. If your kitten is lethargic, meaning that they sleep all day or don’t seem to have any energy when they’re awake, this could be a sign that something is wrong. You’ll need to get your kitten to a veterinarian to determine the underlying issue. [7] X Research source"
    },
    {
      "title": "Monitor how much the kitten eats.",
      "content": "Monitor how much the kitten eats. Kittens, especially newborns, need to eat every two or three hours. If the kitten is refusing to eat, especially for several hours, this could be a sign that the kitten is unwell. Kittens cannot go too long without food, and abstaining from food over several hours could mean that the kitten has an upset stomach or something much worse. Get the kitten to a vet if they won’t eat. [8] X Research source"
    },
    {
      "title": "Pay attention to the kitten’s vomit.",
      "content": "Pay attention to the kitten’s vomit. Babies spit up, and kittens, being babies, will vomit occasionally. This typically means that they were over eager and ate too fast or ate too much. If your kitten is vomiting persistently, though, this is likely a sign that something is wrong with your cat and that they need medical attention. [9] X Research source Some websites advocate giving animals over-the-counter, anti-vomiting medicine made for humans. Under no circumstances should you give this to a kitten. Take the animal to a veterinarian so that they can administer medicine that won’t be fatal to your kitten."
    },
    {
      "title": "Shield your kitten from bacteria and viruses.",
      "content": "Shield your kitten from bacteria and viruses. Kittens have very weak immune systems, and if a kitten was unable to nurse from its mother right away, it will have missed out on the antibodies in colostrum. Without that precious colostrum, your kitten has no immune system at all. Bacterial and viral infections are real dangers in kittens because of their slight immune systems. If you notice lethargy, diarrhea, or vomiting in your kitten, take them to a vet right away as they may have a potentially fatal infection. [10] X Research source"
    }
  ]
}