{
  "url": "https://www.wikihow.com/Melt-Paraffin-Wax",
  "title": "How to Melt Paraffin Wax",
  "steps": [
    {
      "title": "Measure the correct weight of wax for the project you’re doing.",
      "content": "Measure the correct weight of wax for the project you’re doing. Use a digital or analog kitchen scale to measure out the wax. The amount of wax depends on what you're using it for. For home therapeutic treatments, 4 pounds (1.8 kg) is a common recommendation. Wax often comes in 4 pounds (1.8 kg) blocks. If you’re making a candle, then cut enough wax to fill the container you’re placing the candle in. Weigh the container you're putting the wax in first, before adding the wax. Then, subtract that from the total weight to determine how much wax you have. For candles, take the weight of the container you're using and multiply it by the number of candles you're making. The result is the weight of wax you need. If you're using 6 oz (170 g) containers and want to make 10 candles, then you need 60 oz (1,700 g) of wax for the job."
    },
    {
      "title": "Cut up the wax into smaller pieces if it came in a large block.",
      "content": "Cut up the wax into smaller pieces if it came in a large block. Wax melts much more efficiently in smaller pieces. Place the block on a flat, solid surface. Use a knife to slice the wax up into square pieces no more than 2 inches (5.1 cm) on each side. [1] X Research source Sometimes paraffin wax comes in flake form rather than blocks. In this case, you don't have to cut it up further. The sizes and shapes don’t have to be exact. Just break the block up so the wax melts better. Be very careful when using a knife. Keep your fingers away from the blade."
    },
    {
      "title": "Cover the bottom of a double boiler with water.",
      "content": "Cover the bottom of a double boiler with water. Wax will burn if you heat it directly over a flame, so use a double boiler instead. Take the bottom portion and fill it with water. The amount of water depends on the size of the boiler. Put the top part on and make sure the water doesn’t touch it. If it does, dump some water out. [2] X Research source If you don’t have a double boiler, you can make one easily. Just use 2 pots of different sizes. Make sure one fits inside the other without touching the bottom. Fill the bottom part with water."
    },
    {
      "title": "Place the wax in the top part of the double boiler.",
      "content": "Place the wax in the top part of the double boiler. Once the wax is all cut up, add it to the top of the boiler. Spread it around evenly so it doesn’t pile up in one spot. [3] X Research source If you made your own double boiler, make sure the top part doesn't have any holes in it or the wax will leak through. Your double boiler may not be big enough to fit all the wax if you're making a large batch. If that's the case, melt the wax in smaller batches."
    },
    {
      "title": "Place the double boiler on the stove over a low heat.",
      "content": "Place the double boiler on the stove over a low heat. Place the boiler so its center is over the stovetop burner. Then turn on a low-medium flame to start heating the wax. [4] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source Confirm that the water in the boiler isn’t touching the top part. This could burn the wax."
    },
    {
      "title": "Add 1 cup (237 ml) of mineral oil if you’re melting wax for a skin treatment.",
      "content": "Add 1 cup (237 ml) of mineral oil if you’re melting wax for a skin treatment. Mineral oil helps keep the wax watery and provides moisturizing benefits for your skin. If you’re using paraffin wax to treat dry skin or arthritis, add the mineral oil just as the wax begins melting. Stir the wax and oil together. [5] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source Mineral oil is safe for use and helps alleviate dry, cracked skin. [6] X Research source Skip this step if you’re using the wax for a candle."
    },
    {
      "title": "Stir the wax occasionally as it melts in the double boiler.",
      "content": "Stir the wax occasionally as it melts in the double boiler. Watch the wax and stir it to break up chunks to help it melt faster. Use a stirring stick for the best results so there is less surface area for the wax to stick to. [7] X Research source Don’t stir constantly. Only stir every few minutes as the wax melts."
    },
    {
      "title": "Turn off the flame when the wax melts completely.",
      "content": "Turn off the flame when the wax melts completely. Monitor the wax to see when it all melts. Give it one final stir to make sure there are no solid pieces left over. If it’s entirely liquid, then turn the flame off. [8] X Research source Don’t leave the wax unattended or continue heating it after it melts. The wax could burn or start boiling and cause a fire."
    },
    {
      "title": "Wait for the wax to cool if you’re using it for a therapeutic treatment.",
      "content": "Wait for the wax to cool if you’re using it for a therapeutic treatment. Hot wax can burn your skin, so allow it enough time to cool before using it. When the wax develops a solid film on its surface, that means it’s cool enough to use on your skin. [9] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source If you’re not sure whether the wax is cool enough, check it with a thermometer. Make sure the temperature is below 125 °F (52 °C) before you put the wax on your skin."
    }
  ]
}