{
  "url": "https://www.wikihow.com/Minimize-a-Full-Screen-Computer-Program",
  "title": "How to Minimize a Full Screen Computer Program",
  "steps": [
    {
      "title": "Look for the \"Exit full-screen\" button.",
      "content": "Look for the \"Exit full-screen\" button. If you can find a button in your window that exits full-screen mode, you can simply click it and then click the - button in the top-right corner of the window to minimize it. Double-clicking most video player windows (e.g., VLC or YouTube) will take you out of full-screen mode."
    },
    {
      "title": "Press Esc to exit full-screen.",
      "content": "Press Esc to exit full-screen. If you're watching a video or viewing photos in full-screen mode, this key will exit full-screen mode."
    },
    {
      "title": "Use the Windows key (⊞ Win) to display the taskbar.",
      "content": "Use the Windows key ( ⊞ Win ) to display the taskbar. Pressing this key, which resembles the Windows logo, will force the desktop's taskbar to display at the bottom of the screen. You can then click the full-screen program's icon to minimize it, or you can press the \"Show Desktop\" bar in the far-right corner of the taskbar."
    },
    {
      "title": "Press ⊞ Win+M to minimize all open windows.",
      "content": "Press ⊞ Win + M to minimize all open windows. This will exit any full-screen windows and minimize each window to the taskbar. Keep in mind that re-opening any of these windows will prompt them to resume in full-screen mode. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Press ⊞ Win + ⇧ Shift + M to open all minimized programs again."
    },
    {
      "title": "Press Ctrl+Alt+Del to interrupt the program.",
      "content": "Press Ctrl + Alt + Del to interrupt the program. Especially if you're playing a game that's freezing, pressing this combination of keys will almost always take you out of the window. To get to the desktop: Click Task Manager . Click the Processes tab. Click the full-screen program. Click End task ."
    },
    {
      "title": "Manually shut down your computer.",
      "content": "Manually shut down your computer. If you're encountering a full-screen program that won't close, press and hold your computer's Power button (or, if it's a desktop, remove the power cable) until the computer shuts down. When you restart your computer, all previously open windows will be closed."
    },
    {
      "title": "Use the ⌘ Command+Ctrl+F shortcut.",
      "content": "Use the ⌘ Command + Ctrl + F shortcut. This command removes windows from full-screen mode, at which point you can click the yellow \"Minimize\" button in the top-right corner of the window."
    },
    {
      "title": "Try using the Esc key to exit full-screen mode.",
      "content": "Try using the Esc key to exit full-screen mode. It's in the top-left side of the keyboard. The Esc key is ideal for exiting full-screen YouTube videos or photos on your computer. You can click the window's yellow \"Minimize\" button after disabling full-screen mode. Pressing Esc while playing a game won't minimize the game."
    },
    {
      "title": "Press ⌘ Command+M to minimize the current window.",
      "content": "Press ⌘ Command + M to minimize the current window. Return to it by clicking the new minimized icon in your Dock, next to the Trash icon. Some programs will simply exit full-screen after using this shortcut, meaning you'll need to click the yellow \"Minimize\" button to fully minimize the program."
    },
    {
      "title": "Hide your window by pressing ⌘ Command+H.",
      "content": "Hide your window by pressing ⌘ Command + H . This will turn all windows in the program invisible. Specific windows will not show up in your Dock; you will need to click the application icon, such as TextEdit or Safari, instead."
    },
    {
      "title": "Toggle off full-screen mode with ⌘ Command+F or ⌘ Command+⏎ Return.",
      "content": "Toggle off full-screen mode with ⌘ Command + F or ⌘ Command + ⏎ Return . If none of the above shortcuts work, one of these key combinations might force the window to minimize. If you have a game window open, look at the key bindings to see if there is an option for minimizing or exiting full-screen. If you are playing a game through Steam, the Steam application may interfere with your ability to minimize programs."
    },
    {
      "title": "Force-quit the full-screen program.",
      "content": "Force-quit the full-screen program. If the program is frozen and none of the previous options have worked, press ⌘ Command + ⌥ Option + Esc , click the program, and click Force Quit ."
    },
    {
      "title": "Manually shut down your computer.",
      "content": "Manually shut down your computer. If you're encountering a full-screen program that won't close, press and hold your computer's Power button (or, if it's a desktop, remove the power cable) until the computer shuts down. When you restart your computer, all previously open windows will be closed."
    }
  ]
}