{
  "url": "https://www.wikihow.com/Make-an-Insulated-Cat-House",
  "title": "How to Build a DIY Insulated Cat House: A Step-by-Step Guide",
  "steps": [
    {
      "title": "Purchase a large plastic storage container and a slightly smaller one.",
      "content": "Purchase a large plastic storage container and a slightly smaller one. The simplest way to put together a DIY insulated cat house is to use two plastic storage containers of mismatched sizes. In a nutshell, you'll insert the smaller container into the larger one, then install insulation material in the intervening space between the walls of both containers. [1] X Research source Your storage containers don't have to be any specific size. A good standard pairing is around 30 gallons (110 L) for the larger container and about 18 gallons (68 L) for the smaller one. It may seem counterintuitive, but small shelters are actually preferable to big ones because it’s easier for a cat to warm a tight space with its body heat."
    },
    {
      "title": "Cut a 6 in (15 cm) square in the side of the large storage container.",
      "content": "Cut a 6 in (15 cm) square in the side of the large storage container. Trace the dimensions onto the outside of the container with a ruler and pencil, then slice through the material using a utility knife. This opening will serve as the door to the cat house. Avoid making your door any bigger than it needs to be. Most cats can squeeze into openings as small as 6–8 inches (15–20 cm) wide. [2] X Research source"
    },
    {
      "title": "Trim a sheet of 1 in (2.5 cm) styrofoam to fit the container floor.",
      "content": "Trim a sheet of 1 in (2.5 cm) styrofoam to fit the container floor. Take a rough measurement of the bottom of the container and use these numbers to cut the styrofoam . It doesn’t have to be an exact fit—just make sure it covers as much of the floor as possible. After cutting the styrofoam, set it on the bottom of the storage container. [3] X Research source Styrofoam is one of the best insulators there is. Not only is it extremely cheap, it also maintains temperatures better than other more expensive materials. [4] X Research source"
    },
    {
      "title": "Use additional styrofoam to line the walls of the container.",
      "content": "Use additional styrofoam to line the walls of the container. Measure, mark, and cut the same way you did with the previous pieces. Leave a 2–3 in (5.1–7.6 cm) gap just beneath the lip of the container to allow the lid to fit into place properly. The insulation you cut for the walls may not be perfectly square, depending on the type of container you’re using. There’s no need to secure the insulation to the walls of the container, as you’ll be installing a second, smaller container later, which will hold the pieces in place."
    },
    {
      "title": "Cut through the interior insulation where the door will go.",
      "content": "Cut through the interior insulation where the door will go. Simply run your utility knife along all four edges of the opening in the storage container and lift out the cut insulation. Be sure to sweep away any dust or debris that happens to collect near the door before proceeding. Don’t forget this step. If you do, curious felines won’t be able to get into your cat house!"
    },
    {
      "title": "Place the second, slightly smaller storage container inside the first.",
      "content": "Place the second, slightly smaller storage container inside the first. Keep in mind that the second container needs to be 2–3 inches (5.1–7.6 cm) smaller on all sides to fit into the first one with the surrounding insulation. After inserting the interior container, cut out a hole for the door using the first opening you made. [5] X Research source If possible, purchase two containers with the same basic style and shape in different sizes to ensure that they’ll fit together properly. [6] X Research source The double-container setup is far more durable and harder for frigid winds, moisture, and would-be predators to penetrate than a single layer."
    },
    {
      "title": "Cover the bottom of the interior container with insulation.",
      "content": "Cover the bottom of the interior container with insulation. If you like, you can cut one more piece of styrofoam to go over the bottom surface of the inner compartment. This will ensure that any kitties who curl up inside will be extra cozy. This step isn’t a necessity (your cat house will already be quite hospitable thanks to the insulated storage containers), but it can make a nice touch."
    },
    {
      "title": "Cut a final piece of styrofoam to go on the top of the cat house.",
      "content": "Cut a final piece of styrofoam to go on the top of the cat house. This piece should be big enough to lay over the edges of the wall pieces and close off the interior insulation. Now, all six sides of the shelter will be lined with a heat-retaining layer. [7] X Research source Try to make sure there are no gaps or cracks in the top layer of insulation that could allow precious warmth to escape."
    },
    {
      "title": "Place the lid on the outer container.",
      "content": "Place the lid on the outer container. Now that your homemade insulated cat house is complete, all that’s left to do is cover it up. Align the larger container lid with the edges of the outer container and press down firmly. Make sure it locks in place. [8] X Research source Once you’ve got the lid on, lay a few heavy objects, such as bricks, paver stones, or scrap lumber, on top to weigh down the shelter. It will then be safe from strong winds and inquisitive critters. For added security, use bungee cords or a few strips of duct tape to hold the lid on."
    },
    {
      "title": "Position the cat house in a quiet, out-of-the-way area.",
      "content": "Position the cat house in a quiet, out-of-the-way area. It’s best to keep the shelter out of sight, even if you live in a place where there aren’t a lot of wild animals around. If you have dogs, situate it behind a fence or similar enclosed structure to prevent them from hanging around and harassing innocent occupants. [9] X Research source Consider setting up your cat house with the door 5–6 inches (13–15 cm) away from a wall. Narrow confines will discourage other animals from making entry."
    },
    {
      "title": "Elevate the shelter so that it’s not sitting directly on the ground.",
      "content": "Elevate the shelter so that it’s not sitting directly on the ground. Arrange 2 in (5.1 cm) x 4 in (10 cm) wood blocks, cinder blocks, or similar materials into a rectangular frame and prop your cat house on top. This will create some airflow underneath the shelter and keep the floor inside from becoming uncomfortably cold. If you don’t elevate your cat house, ground chill can creep up and lower the temperature inside, making it harder for cats to stay warm."
    },
    {
      "title": "Spread 2–3 inches (5.1–7.6 cm) of straw over the floor of your cat house.",
      "content": "Spread 2–3 inches (5.1–7.6 cm) of straw over the floor of your cat house. Pile the straw up thickly all the way to the corners of the interior container. It will serve as a kind of bedding that cats can burrow in for added warmth and security. [10] X Research source It may be easiest to remove the top from your cat house in order to put your straw bedding and other amenities in place. Straw is a more effective insulator than hay, as it’s resistant to rot and mold and won’t absorb excess moisture."
    },
    {
      "title": "Set a bowl of food in one corner.",
      "content": "Set a bowl of food in one corner. The cats who find their way into your shelter might be hungry as well as chilly. Kill two birds with one stone by pouring some well-balanced dry cat food into a dish and placing it inside the shelter, where it won’t get rained on or eaten by other animals. [11] X Research source Dry food is the most practical feeding solution. Since it doesn’t spoil or dry out, it will stay fresh much longer than other types of food. Come back and check the amount of the food in the bowl every few days and refill it as needed."
    },
    {
      "title": "Leave a large container of water on the ground outside.",
      "content": "Leave a large container of water on the ground outside. Water containers should always be kept outside of the cat house. If they accidentally get turned over, they could soak everything inside, leaving it soggy and prone to mildew or even frost. Make sure you also select a non-breakable container to put water in, such as a small plastic tub or repurposed food container. That way, you won’t have to worry about it breaking and possibly hurting a cat or any other animals. A heated water bowl will help ensure that the water you put out never freezes. You can usually find these at pet stores for around $20-30."
    },
    {
      "title": "Throw in some toys to provide a little entertainment.",
      "content": "Throw in some toys to provide a little entertainment. If you have any extra cat toys lying around at home, consider adding one or two in your cat house. They’ll give visiting cats something to play with and occupy themselves with while they wait out cold nights. Stuffed mice, hemp scratcher balls, and anything with feathers will offer hours of play for feisty felines . Avoid toys with bells, squeakers, crunchies, or other noise-makers. These could attract the wrong type of attention from prowling predatory animals."
    },
    {
      "title": "Scatter some catnip around the door to lure nearby cats inside.",
      "content": "Scatter some catnip around the door to lure nearby cats inside. No cat can resist the musky perfume of catnip . When they catch a whiff of its tantalizing scent, they’ll come running, and discover a safe place to stay in the process. [12] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source If there’s a mouse toy in your cat house, stuff it full of catnip rather than sprinkling the herb onto the ground or bedding and making a mess. Some cats become aggressive when exposed to catnip. If you think it might cause a tussle, it may be best to leave it out."
    }
  ]
}