{
  "url": "https://www.wikihow.com/Shorten-Mini-Blinds",
  "title": "How to Shorten Mini Blinds",
  "steps": [
    {
      "title": "Measure the height of the window.",
      "content": "Measure the height of the window. You need this to determine the exact length that you need for the mini-blinds. Start with the inside top of the casing where the blinds will be mounted, and measure all the way to the windowsill below."
    },
    {
      "title": "Place the mini-blinds on a flat surface and expand to the full length.",
      "content": "Place the mini-blinds on a flat surface and expand to the full length. Measure from the top of the blind casing to the blind slat that most closely corresponds with the window measurements. Move downward 1 additional slat to allow a little room for error. Mark the first slat to be removed with a marker or pen."
    },
    {
      "title": "Remove the rail plugs.",
      "content": "Remove the rail plugs. Mini-blinds are equipped with plastic plugs on the underside of the bottom rail. Most designs will feature 3 plugs along the length of the rail. Releasing the plugs allows access to the lift cord and the 3 string ladders on the mini-blinds. [1] X Research source You can usually just pull out the plugs without having to do anything fancy."
    },
    {
      "title": "Untie the knot on the lift cords and pull upward.",
      "content": "Untie the knot on the lift cords and pull upward. This action will slide the lift cords through the holes in the bottom rail and the slats immediately above the rail. Continue to pull the cords upward until the marked slat is freed from the cords. [2] X Research source"
    },
    {
      "title": "Slide the bottom rail out of the string ladders.",
      "content": "Slide the bottom rail out of the string ladders. This will provide you with better access to the blind slats. [3] X Research source"
    },
    {
      "title": "Remove the desired number of slats.",
      "content": "Remove the desired number of slats. With the lift cords no longer threaded through the slats, this requires sliding each of the slats out of the 3 string ladders. [4] X Research source"
    },
    {
      "title": "Reattach the bottom rail.",
      "content": "Reattach the bottom rail. Slide the rail back into the string ladders just under the remaining blind slats. Trim off any unused sections of the ladders that you no longer need. [5] X Research source"
    },
    {
      "title": "Reconnect the lift cords.",
      "content": "Reconnect the lift cords. Tie a new knot in each of the 3 ends. Use the measuring tape to make sure the knots are in the ideal position so the cords are all the same lengths, and the slats will hang evenly."
    },
    {
      "title": "Replace the rail plugs.",
      "content": "Replace the rail plugs. Make sure that all 3 are securely in position, and then hang the adjusted mini-blind in the window. Take a moment to try raising and lowering the blinds, as well as opening and closing them to make sure they are functioning properly."
    }
  ]
}