{
  "url": "https://www.wikihow.com/Redial",
  "title": "How to Redial",
  "steps": [
    {
      "title": "Hang up the phone.",
      "content": "Hang up the phone. If the phone number you've called is currently busy, hang up the phone before you attempt to redial the number. Note that this method will only work with landline phones equipped with a “Redial” button. If your phone does not have this feature, you will need to use a different method."
    },
    {
      "title": "Pick the phone up and press the “Redial” button.",
      "content": "Pick the phone up and press the “Redial” button. Pick the phone back up and look for a button marked with the word “Redial.” Press this button and listen to the dial tone. The phone should automatically redial the last number you dialed. It will not redial the last number to call you, however. If you place the handset next to your ear, you should hear the phone dial and connect to the other line. It will ring as usual if the line is no longer busy, but you will hear a busy tone if the other line is still busy."
    },
    {
      "title": "Repeat as needed.",
      "content": "Repeat as needed. If the phone number is still busy, you can hang up and try again later using the same procedure. There is no limit on the number of times you can redial the last number, so you can continue pressing the redial button until you reach the intended recipient."
    },
    {
      "title": "Hang up.",
      "content": "Hang up. If the number you are trying to reach is busy, hang up the phone before attempting to redial it. Note that this method works when you are dialing from a landline telephone and are attempting to call a local number. It may not work on cell phones, toll free numbers, long-distance calls, or international calls. This service may not be offered by every telephone company. Check with your service provider to find out if \"Repeat Dialing\" is part of your service package. Several companies that offer this feature include Bright house, Cox, Optimum, and Verizon."
    },
    {
      "title": "Pick up the phone and dial *66.",
      "content": "Pick up the phone and dial *66 . Pick your phone back up and dial *66 using the keypad. Check the handset and wait until you hear a normal dial tone before dialing this star code. If you are using a rotary phone, dial 1166 instead."
    },
    {
      "title": "Hang up again.",
      "content": "Hang up again. Once you hang up, a service known as \"repeat dialing\" should be activated. The system will check the other phone number every 30 seconds throughout the next 30 minutes. Once it is no longer busy, your phone will ring. You can receive normal phone calls while repeat dialing is in effect and the process should not be disturbed."
    },
    {
      "title": "Answer the phone after it rings.",
      "content": "Answer the phone after it rings. When the line you have requested becomes available, your phone should ring with a special ringtone. Answer the phone to be connected to the other line. This ringtone will usually vary from your standard ringtone. As soon as you pick up the phone, the system should connect the call, and the phone you are trying to reach should ring."
    },
    {
      "title": "Cancel repeat dialing if necessary.",
      "content": "Cancel repeat dialing if necessary. Repeat dialing expires automatically after 30 minutes, but if you need to cancel it before that time ends, do so by picking up the phone and dialing *86 . Expect to hear a confirmation tone or announcement that verifies your canceled request."
    },
    {
      "title": "Hang up the phone.",
      "content": "Hang up the phone. If you are greeted with a busy dial tone, press the \"End Call\" button to hang up the phone. You can only redial the number after ending your current call. Note that this method should work for nearly all cell phones, include both standard mobile phones and smart phones."
    },
    {
      "title": "Press the “Call” button.",
      "content": "Press the “Call” button. Press the \"Call\" button on your phone or open the \"Phone\" app. [1] X Research source If you do not have a smart phone, you will need to open your call log by pressing the green \"Call\" button on your phone's keypad. This button will usually be marked with a green telephone icon. If you have a smart phone, you will need to open your call log by navigating to the \"Phone\" app and tapping it once."
    },
    {
      "title": "Navigate to your recent calls, if necessary.",
      "content": "Navigate to your recent calls, if necessary. In most cases, you will automatically be shown a list of your most recent calls as soon as you open your call log. If your recent calls do not show up, you will need to navigate to that menu option. Scroll through the list of menu options in your call log and select the one marked \"Recent.\" Hit the \"Enter\" button on a standard mobile phone or tap on the \"Recent\" button if using a smart phone."
    },
    {
      "title": "Select the last call.",
      "content": "Select the last call. The last call you dialed should be at the top of your list. If it isn't already selected, scroll through your calls until that number becomes highlighted. If you received another call after dialing the number you are trying to reach, the call you received will appear above the one you dialed. Make sure that the number you select is the one you wish to redial before you continue."
    },
    {
      "title": "Press the “Call” button again.",
      "content": "Press the “Call” button again. Hit the \"Call\" button again to redial the highlighted phone number. If you are not using a smart phone, you will need to call the number by hitting the green \"Call\" button on your phone's keypad. If you are using a smart phone, selecting the number will usually open a set of options. From those options, tap on the \"Call\" or “Dial” button."
    },
    {
      "title": "Hang up.",
      "content": "Hang up. If the number you have attempted to call is busy, tap on the red \"End Call\" button to hang up the phone. You can only redial a number after hanging up the phone. Note that this technique will only work with the iPhone. It does not work with other smart phones or standard mobile phones. Additionally, this method will only work with numbers you have dialed from the keypad. It does not work with numbers you have dialed from your Favorites, Recents, or Contacts."
    },
    {
      "title": "Open the “Phone” app.",
      "content": "Open the “Phone” app. Tap once on the \"Phone\" icon to open the application. If you just hung up, the \"Phone\" app should automatically reopen to the keypad. If it doesn't open the keypad, however, you will need to navigate to the keypad before continuing. To open the keypad, simply tap on the \"Keypad\" icon on the bottom phone menu. You only need to tap on the icon once to open the keypad."
    },
    {
      "title": "Press the “Call” button.",
      "content": "Press the “Call” button. Tap the green \"Call\" button once from the iPhone keypad. The last number you dialed should be displayed at the top of the screen. Verify that this number is the number you wish to redial before you continue. Note that there is no time limit regarding redials, so you can redial a phone number you called weeks ago if it still remains the last number you dialed from the keypad."
    },
    {
      "title": "Press the “Call” button again.",
      "content": "Press the “Call” button again. With the phone number displayed at the top of the screen, tap the \"Call\" button once more to call the number. If the phone number you are trying to reach is still busy, you can hang up and repeat the process as many times as necessary until the other party answers."
    }
  ]
}