{
  "url": "https://www.wikihow.com/Prevent-Rice-from-Sticking-to-the-Bottom-of-a-Pot",
  "title": "How to Prevent Rice from Sticking to the Bottom of a Pot",
  "steps": [
    {
      "title": "Run the rice under cool water for 1 minute to remove starch.",
      "content": "Run the rice under cool water for 1 minute to remove starch. Put your rice into a fine mesh strainer and run it under cool water in the sink. Try to rinse it for about 1 minute, or until all of the rice gets wet. [1] X Research source Rice often has a layer of starch on it that can make it super sticky when it gets wet. Rinsing this off will help prevent it from sticking to your pot."
    },
    {
      "title": "Add a 1:1 ratio of water and rice to the pot.",
      "content": "Add a 1:1 ratio of water and rice to the pot. For example, if you are cooking 1 cup (128 g) of rice, add 1 cup (240 mL) of water to the pot. If you use too little water, the rice could end up burning at the bottom and sticking to your pot. Try to leave about 2 inches (5.1 cm) of space at the top of the pot so the water doesn’t boil over. [2] X Research source Using too much water can make your rice soggy and watery. If you are making long grain white rice, use 1.25 cups (300 mL) of water for every 1 cup (128 g) of rice. You can also add a pinch of salt to the water if you’d like to flavor your rice a little bit."
    },
    {
      "title": "Place a tight-fitting lid over your rice to trap in steam.",
      "content": "Place a tight-fitting lid over your rice to trap in steam. A lid will trap the steam inside of the pot and let the rice cook in a moist environment. Without a lid, your rice could end up burning and sticking to the bottom of the pot. Make sure your lid fits snugly on top of the pot. [3] X Research source Cook your rice on low heat so the water doesn’t boil over."
    },
    {
      "title": "Avoid stirring the rice while it cooks so it doesn't stick together.",
      "content": "Avoid stirring the rice while it cooks so it doesn't stick together. When you stir the rice, it releases starch that makes it sticky. Although it can be tempting to peek at your rice or stir it around, keep the lid on tight and don’t touch the rice until it’s fully cooked and rested. [4] X Research source"
    },
    {
      "title": "Let the rice simmer for 18 to 20 minutes.",
      "content": "Let the rice simmer for 18 to 20 minutes. If you cook your rice for too long, it could end up burning and sticking to the pot. Set a timer on your phone or your stove and take the rice off the heat right away. [5] X Research source Your rice may still have a little bit of water on it when your timer goes off, but that’s okay. It will absorb into the rice when you let it rest."
    },
    {
      "title": "Remove the pot from the heat and let the cooked rice sit for 10 minutes.",
      "content": "Remove the pot from the heat and let the cooked rice sit for 10 minutes. Keep the lid on top of the pot and slide it over to a burner that’s off. Allow your rice to sit for 5 to 10 minutes so it can absorb more of the steam that it’s been cooking in. [6] X Research source This will help to loosen up the bottom layer of rice and make it easier to scoop out of the pot. It will also make the rice more fluffy and less crunchy."
    },
    {
      "title": "Fluff the rice up with a fork before you serve it to break up the grains.",
      "content": "Fluff the rice up with a fork before you serve it to break up the grains. Keep the rice in the pot you cooked it in and grab a fork. Remove the lid carefully by holding it away from yourself to avoid getting burned by the steam. Stick the fork into the middle of the rice and gently pick it up to fluff the grains of rice. Keep fluffing until you’ve disturbed all of the grains of rice. [7] X Research source This will help to loosen the bottom layer of rice, and it will also make your rice lighter in texture."
    },
    {
      "title": "Scoop the rice with a large spoon to reach the bottom of the pot.",
      "content": "Scoop the rice with a large spoon to reach the bottom of the pot. You can use a plastic or wooden spoon to scoop out your rice. Scrape the spoon onto the bottom of the pot to ensure you’re getting all of it off the bottom, and enjoy your delicious meal! [8] X Research source"
    }
  ]
}