{
  "url": "https://www.wikihow.com/Retwist-Dreads",
  "title": "How to Retwist Your Own Dreadlocks for Beginners",
  "steps": [
    {
      "title": "Pin away unnecessary hair.",
      "content": "Pin away unnecessary hair. If you have to retwist an entire head's worth of dreads, you should start at the nape of the neck. Pin away the upper dreads with clips to leave an inch (2.54 cm) thick row of dreads across the base of the neck."
    },
    {
      "title": "Gather hair at the base of the lock.",
      "content": "Gather hair at the base of the lock. Apply a little dread wax or gel to your fingers, then take a single dreadlock, and gather any loose hair at its base between your forefinger and thumb. Twist this hair between your fingers so that it entangles with the main lock of already twisted hair. [1] X Expert Source Amber Rose Licensed Cosmetologist Expert Interview. 13 April 2021. While twisting, you should pull the hair away from the scalp toward the already twisted/formed end of the lock. Exert pressure on the dread as you extend it outward and roll. This may cause some minor discomfort, but it shouldn't cause the hair to break. If you feel hair snap while twisting, this is a completely natural part of the retwisting process. By matting and entangling the hair together, you'll reform the dread. Dreads that have come out of their ropes/locks and are mostly untwisted might require you to re-dread your hair from scratch. [2] X Research source"
    },
    {
      "title": "Palm roll the dreadlock.",
      "content": "Palm roll the dreadlock. After the lock has been finger rolled, it's ready to be palm rolled. Apply a little dreadlock wax or gel to your palms, then gather the finger twisted hair between your palms. Firmly roll the hair between your palms, sliding down the lock as you do. [3] X Expert Source Amber Rose Licensed Cosmetologist Expert Interview. 13 April 2021. For the firmest, tightest retwisted dreads, you may need to palm roll each lock several times. Loose hair in locks can be stubborn. In some cases, you may need to roll with extra firm pressure, but be careful not to hurt the person whose hair you're retwisting. Dreadlocks that have been palm rolled can be pinned out of the way to keep finished locks from mixing in with those that are unfinished. [4] X Research source"
    },
    {
      "title": "Re-pin your hair and twist the next layer of dreads.",
      "content": "Re-pin your hair and twist the next layer of dreads. Now that the base layer of dreads at the nape of the neck have been retwisted, you can remove your pins to release the next layer of hair you'll be retwisting. The hair above this layer that's hanging in the way can be pinned off to the side. Retwist the dreads one at a time with your fingers and palms until all dreads have been retwisted. You should work methodically, at about an inch (2.54 cm) of scalp per row/layer to ensure no locks are missed. [5] X Research source"
    },
    {
      "title": "Finish at the front of the head.",
      "content": "Finish at the front of the head. Continue to retwist your dreads in this fashion in inch (2.54 cm) thick rows until you reach the front of the scalp. When you reach the front of the head, you won't need to pin any hair out of the way, and can simply retwist the final dreads. [6] X Research source"
    },
    {
      "title": "Dry the dreads of product, if necessary.",
      "content": "Dry the dreads of product, if necessary. Some waxes or dreadlock gels become set in place with the application of light to moderate heat after retwisting. In most cases, the dreads will be dry in 20 to 30 minutes or less. If a hair dryer is inaccessible, you can also allow your hair to air dry after it is retwisted. If any of the products you used on your dreadlocks are heat activated, you should consider using a gentle heat to help activate this feature. [7] X Research source"
    },
    {
      "title": "Identify dreads in need of retwisting.",
      "content": "Identify dreads in need of retwisting. As time passes, your hair will grow at the base of your scalp, creating loose hair at the base of your dreads. In other cases, your locks may have become loose or messy. If your dreads have any of these features, it's likely time to get a retwist. [8] X Research source You may need to retwist the base of all the dreadlocks you are working on, or you may only need to work on one side or section. While you work on a specific dread, use a rattail comb to outline the square perimeter of the lock. Then, clip away the surrounding hair. This helps prevent the dread from becoming fuzzy, uneven, or stuck to another lock."
    },
    {
      "title": "Collect your supplies.",
      "content": "Collect your supplies. To retwist your dreads most effectively, you should use products while working the hair to freshen and strengthen it. At a minimum, you'll want some a rattail comb, clips, a towel, and dreadlock friendly gel or wax while retwisting. Some dreadlock gel is specially formulated to help lock the hair of your dreads into ropes of hair. You might want to consider using this kind of product to help maintain your dreads. Some dreadlock wearers suffer from a dry scalp. If this is your situation, you may want to use a scalp cleansing serum before retwisting. [9] X Research source"
    },
    {
      "title": "Position the locks for comfort while working.",
      "content": "Position the locks for comfort while working. If you're retwisting an entire head of dreadlocks, it can take quite some time before you complete your job. To ensure the best retwisting, choose a work environment that positions the dreadlocks at a level that is easy for you to work at. Depending on your height and body type, the ideal work height can vary. Generally, you'll want the head you are working on to be at roughly chest level. If you can, have the person you're working on sit in a straight-backed chair. This generally puts them at the right height and makes them easy to maneuver. [10] X Research source"
    },
    {
      "title": "Wash your hair.",
      "content": "Wash your hair. You may want to use a shampoo specially formulated for dreadlocks, but a regular shampoo will also work. Use your fingers to massage the shampoo into the scalp with water. After the dreads have been thoroughly soaped, you're ready to rinse. You should avoid shampooing your dreads for a minimum of two weeks after having them done to keep the locks firm and secure. The shampoo you choose should be low lather and should suit the needs of your scalp. Many people with dreads suffer from dry scalps. If you do too, you should use a shampoo formulated for dry scalps. You may want to use a clean nylon to contain your dreads when washing. This can help keep your locks from coming apart while being washed."
    },
    {
      "title": "Rinse out the shampoo and add conditioner, if desired.",
      "content": "Rinse out the shampoo and add conditioner, if desired. You don't have to use conditioner on your hair, but doing so can improve your hair's strength, softness, and luster. Take your hair conditioner in your hands and massage it into the scalp and dreadlocks until all locks are moisturized and loose. [11] X Expert Source Amber Rose Licensed Cosmetologist Expert Interview. 13 April 2021. Do not condition new locks that are less than 3 months old. Follow the label recommendations of your conditioner for best results. Generally, you should let the conditioner set in the locks for a few minutes. After you have finished conditioning, you should rinse the conditioner from your hair, turning off the shower and wringing out excess moisture from the locks as you do. Some dreadlock wearers choose to skip conditioning, as it can loosen the tightness of your locks."
    },
    {
      "title": "Prevent grease drips with a towel.",
      "content": "Prevent grease drips with a towel. Your dreadlocks can pick up a lot of buildup throughout daily life, and this can drip unpleasantly down the neck if you're not careful. After rinsing out the conditioner, keep the washed head bent so drips fall onto the shower floor and not down the body. Then: Gather a towel around the base of the neck. Blot the dreads there to absorb moisture, then hold the towel firmly in place with your hands. Straighten the head. Excess moisture will trickle down the head and get caught in the towel you are holding at the base of the neck. After the hair has mostly stopped dripping, use dry portions of the towel to blot/wring excess moisture from the dreads."
    },
    {
      "title": "Dry the dreadlocks completely.",
      "content": "Dry the dreadlocks completely. Failing to dry your dreads completely can leave your cool hairdo smelling like a wet dog. For this reason, you may want to use a hair dryer to make certain your dreads are dry. However, you can also allow your hair to air dry before retwisting, though this might take some time to fully dry. Hair that is wet stretches more than hair that is dry. Due to this, you may have the best and most consistent results if you wait until the dreadlocks are completely dry before retwisting. Due to the thickness of most dreads, moisture deep inside a lock can sometimes be missed while drying. For this reason, you may want to dry for 10 minutes more than you think necessary."
    }
  ]
}