{
  "url": "https://www.wikihow.com/Remove-Burn-Marks-on-Wood",
  "title": "How to Remove Burn Marks on Wood",
  "steps": [
    {
      "title": "Purchase fine steel wool to remove the burned surface.",
      "content": "Purchase fine steel wool to remove the burned surface. The steel wool method works best with small, shallow burns such as from cigarette ash. Visit a local hardware store and purchase the finest steel wool they sell. Steel wool with a ranking of 0000 (the finest) is ideal. If you can't find steel wool in a hardware store, check in a local home-improvement store. Unlike sandpaper, lower numbers of steel wool are finer, but \"fine\" steel wools are marked with different numbers of zeroes. For example, 000 steel wool is \"extra fine,\" and 00 is \"fine.\""
    },
    {
      "title": "Dampen the piece of fine steel wool with mineral oil.",
      "content": "Dampen the piece of fine steel wool with mineral oil. Before setting the steel wool against the wood, pour about 1 ⁄ 2 teaspoon (2.5 mL) of mineral oil over the wool. This will lubricate the tendrils of the steel wool and prevent them from scratching the wood. Purchase mineral oil at any hardware store or home-improvement store. If you don't have mineral oil on hand, you could use another non-drying oil like lemon oil."
    },
    {
      "title": "Scrub the dampened steel wool back and forth across the burn marks.",
      "content": "Scrub the dampened steel wool back and forth across the burn marks. Hold the steel wool in 1 hand, and rub it in a single direction on top of the burn mark in your hardwood. Rub along the grain of the wood, not across it (or you'll risk damaging the wood further). After 10-12 passes, you'll notice that the burn mark has lightened substantially. Keep rubbing with the steel wool until the burn is gone."
    },
    {
      "title": "Blot the oily area dry with a damp clean cloth.",
      "content": "Blot the oily area dry with a damp clean cloth. Once the burn mark has been erased, pick up a clean scrap of cotton cloth and run a little tap water over it. You want the cloth to be lightly damp, so wring out as much water as you can. Don't rub back and forth across the wood, but lightly press the cloth down onto the oily surface to soak up the oil left behind by the steel wool. If the cloth is too wet, you'll end up leaving a water stain on the wood. You shouldn't need to apply any kind of furniture polish when you're just dealing with a minor burn mark. In nearly all cases, the oil will be enough to seal the area."
    },
    {
      "title": "Scrape off deeper burn marks using the blade of a utility knife.",
      "content": "Scrape off deeper burn marks using the blade of a utility knife. The only way to remove burn marks deeper than about 1 ⁄ 8 in (0.32 cm) is to scrape out the burned wood itself. Take a utility knife and drag the edge of the blade over the burn to remove the damaged wood. Work in short strokes and make sure you're following along the wood grain, not cutting across it. [1] X Research source Purchase a utility knife (and spare blades if you like) at a hardware store. Some stationery or office-supply stores may also sell them."
    },
    {
      "title": "Smooth out the damaged area with fine-grained sandpaper.",
      "content": "Smooth out the damaged area with fine-grained sandpaper. If the wood surrounding the burn wasn't damaged when you scraped out the burn, you should be able to even out the surface of the wood with sandpaper. Sand along the wood grain (not across it) using back and forth motions until the groove (where the burn used to be) has been smoothed out. [2] X Research source Local hardware stores will sell sandpaper. Choose fine sandpaper with a number around 360 or 400. (When working with sandpaper, higher numbers indicate finer grain.)"
    },
    {
      "title": "Brush off the leftover wood shavings with a damp rag.",
      "content": "Brush off the leftover wood shavings with a damp rag. When you've finished scraping away the burn mark and sanding the surface of the wood, you'll be left with a small pile of wood shavings. To remove them from the wood, dampen a rag and rub it along the surface of the wood to remove the shavings. [3] X Research source It's important that the rag you use is lightly damp. Otherwise, you'll just end up pushing the shavings around."
    },
    {
      "title": "Apply a layer of tung oil to the wood to restore its color.",
      "content": "Apply a layer of tung oil to the wood to restore its color. You can purchase tung oil at a paint-supply store or a home-improvement store. Dip a piece of clean cloth into the tung oil and rub it over the formerly burned section of wood. Work in strokes about 3–5 inches (7.6–12.7 cm) long, and be sure to apply the oil along the wood grain, not across it. [4] X Research source Depending on the color of the wood you're repairing, you can also try using a linseed oil . The two oils are similar, and the only major difference is that linseed oil yellows over time. This will work to your advantage, though, if the wood you're repairing has yellow tones."
    },
    {
      "title": "Let the oil soak into the wood overnight.",
      "content": "Let the oil soak into the wood overnight. Since tung oil (and linseed oil) is nondrying, it will take several hours to absorb into the hardwood and harden in place fully. So, follow the directions provided on the tung oil's packaging regarding, as some tung-oil manufacturers may ask you to wipe off the oil rather than letting it soak into the wood. [5] X Research source If you're dealing with hardwood flooring and have kids or pets in your home, keep them away from the oily floor until it's dry."
    },
    {
      "title": "Fill the divot with wood epoxy",
      "content": "Fill the divot with wood epoxy until it's flush with the rest of the flooring. Wood epoxy contains a number of chemical components that should be mixed together following the manufacturer's instructions. Once the epoxy has reached a putty-like consistency, use a spackle knife to press the epoxy into the hardwood hole where the burn mark used to be. [6] X Research source Let the epoxy dry overnight, or for 6-8 hours. During this time, be sure to keep any wandering children or curious animals away from the epoxy. You should have no problem finding an assortment of wood epoxies at a local hardware store or home-improvement store."
    },
    {
      "title": "Sand the epoxy flush with the flooring using coarse sandpaper.",
      "content": "Sand the epoxy flush with the flooring using coarse sandpaper . A sheet of 80-grit sandpaper would work well for this step. Rub the sandpaper back and forth several times across the dried epoxy until you've smoothed it down to the same level as the surrounding flooring. Be careful to avoid sanding too much on the hardwood flooring itself. You don't want to scuff up the undamaged wood accidentally. [7] X Research source Once you're finished with the 80 grit, if you like, try sanding again with 120-grit sandpaper to ensure that the epoxy is smooth."
    },
    {
      "title": "Stain",
      "content": "Stain or paint the filled burn mark to match the color of your flooring. Use stain or paint based on whether the surrounding flooring has been painted or stained (in most cases, hardwood will need to be stained). Dip a 3 in (7.6 cm) paintbrush into the stain (or paint), and apply a smooth coat across the area you've repaired. Give the stain (or paint) at least 4-5 hours to dry, and apply a second layer if the new layer is darker than the rest of the flooring. [8] X Research source If you're unsure of the exact color of your flooring, you can test out sample paint or stain colors before using them. Test the material on a small, out-of-the-way corner of the flooring."
    },
    {
      "title": "Mix together a thick paste of baking soda and water.",
      "content": "Mix together a thick paste of baking soda and water. If you're dealing with a burn on a dark wood surface, the burn itself is most likely white in color. To remove the burn mark, combine about 1 tsp (0.3 g) of baking soda and 1 ⁄ 8 teaspoon (0.62 mL) of water in a small bowl. Use 1 finger (or a spoon if you prefer) to mix the 2 ingredients together until they form a thick paste. [9] X Research source Keep the consistency of the paste dry. If you add too much water to the mixture, you'll end up giving the wood surface a water stain!"
    },
    {
      "title": "Buff the paste into the burn with a clean cloth.",
      "content": "Buff the paste into the burn with a clean cloth. Scoop up a small dab of the thick baking soda paste with the corner of a scrap of clean cotton cloth. Rub the paste into the light-colored wood burn to gradually darken the color of the burn and eventually remove the burn mark altogether. [10] X Research source If a single dab of paste isn't enough to remove the burn mark, apply 2 or even 3 more dabs of the paste."
    },
    {
      "title": "Apply a furniture polish",
      "content": "Apply a furniture polish to the restored surface of the wood. Spray a commercial wood polish onto a second scrap of clean cloth. Then, rub the polish into the surface of the wood. This will remove the gritty baking-soda paste and help the restored patch match the rest of the wood. Wipe along the grain of the wood, and apply the polish in smooth strokes, each about 8–10 inches (20–25 cm) long. [11] X Research source If you don't already have a furniture polish on hand, purchase some at a local hardware store."
    }
  ]
}