{
  "url": "https://www.wikihow.com/Open-a-Door-with-a-Credit-Card",
  "title": "How to Open a Door with a Credit Card",
  "steps": [
    {
      "title": "Slide the card into the vertical crack between the door and frame.",
      "content": "Slide the card into the vertical crack between the door and frame. Insert the card into the gap between the doorknob and door frame and then slide it down next to the doorknob. Push it in as far as it will go at a ninety degree angle to the door. [1] X Research source"
    },
    {
      "title": "Tilt the card towards the doorknob.",
      "content": "Tilt the card towards the doorknob. Tilt the side of your credit card facing you towards the doorknob until it is almost touching it. You’ll be able to push the credit card further into the gap between the door and door frame. [2] X Research source"
    },
    {
      "title": "Bend the card back the opposite way.",
      "content": "Bend the card back the opposite way. Bending the card back the other way will make the card slip under the angled end of the slant-latch, forcing it back into the door. Quickly open the door and unlock it on the other side. [3] X Research source"
    },
    {
      "title": "Lean on the door and wiggle the card back and forth to open it.",
      "content": "Lean on the door and wiggle the card back and forth to open it. If your door did not easily pop open, try leaning against the door while bending your card back and forth a few times. This will add more pressure to the latch and should open it. [4] X Research source"
    },
    {
      "title": "Check for unlocked windows.",
      "content": "Check for unlocked windows. Walk around to all of the ground-level windows that your home has and try to open them. If you find that one is unlocked, pop the screen out and open the window as wide as you can. Then, climb through to get inside. [5] X Research source Climbing through a window can be dangerous. Only try this if you’re confident in your ability to climb inside safely."
    },
    {
      "title": "Call your roommates.",
      "content": "Call your roommates. If you live with friends or a significant other, call or text them to see if they’re nearby. If so, ask if one of them would mind stopping by the home to let you in. While this may require that you wait a few minutes on your front porch steps, it doesn’t involve potentially damaging your property or paying expensive service fees. Also, consider walking to a nearby coffee shop to pass the time if you live somewhere where this is possible."
    },
    {
      "title": "Call your landlord.",
      "content": "Call your landlord. This is a great option if your landlord lives onsite. Give them a call to see if they’re home and ask nicely if they’d mind letting you in. Even if they don’t live onsite, they may work nearby and be kind enough to swing by and help you out."
    },
    {
      "title": "Hire a locksmith as a last resort.",
      "content": "Hire a locksmith as a last resort. If you don’t have any roommates and your landlord isn’t available to help, it might be time to call a locksmith. Hire them to come to your home and change the locks so that you can get in. While this will effectively solve the problem, it may be pricey, so it’s a good idea to only do it if you’re out of options."
    }
  ]
}