{
  "url": "https://www.wikihow.com/Respond-when-Someone-Judges-You",
  "title": "How to Respond when Someone Judges You",
  "steps": [
    {
      "title": "Try not to take any judgmental words personally.",
      "content": "Try not to take any judgmental words personally. That can feel like a tall order, especially in a one-on-one conversation where you feel judged. Remember that a judgmental person’s words are a reflection of their own beliefs—and not you. Critical people criticize themselves more than anyone else, so the judgment they pass isn’t actually about you, though it can feel personal. [1] X Research source If you’re not sure how to stop taking the judgment personally, start by remembering your value. Remind yourself of all the things you do well, and keep a list of your best traits and achievements to boost your confidence. Space out your initial reaction and your response. If you give yourself time to think, you can process and let go of your anger before responding to judgmental words."
    },
    {
      "title": "Practice empathy to understand the source of this person’s judgment.",
      "content": "Practice empathy to understand the source of this person’s judgment. Consider why they might be judging you in the first place. It could be that they were judged themselves by parents, family, or friends, in which case this person’s critical attitude would be something they learned (and not necessarily intentional). While that doesn’t excuse their behavior, having empathy can inform your response. [2] X Research source Say things like “I understand why you feel that way,” or “I see where you’re coming from, but…” when you respond to someone’s judgment. For example: “I’m not sure I agree, but I understand your position and I’m going to take time to think it over. Thank you for sharing.” You don’t have to agree with any judgment you feel is unfair, but you can be respectful and empathetic when you confront people."
    },
    {
      "title": "Judgmental people may not know they’re being rude or unreasonable.",
      "content": "Judgmental people may not know they’re being rude or unreasonable. Ask this person to explain what they said, and find out their motivation for saying it. Some people have good intentions but no tact and end up sounding judgmental when they’re trying to help. Before you interpret this person’s words a certain way, make sure you know their true meaning and why they felt the need to judge you. [3] X Research source You could tell them, “It seems like something is bothering you. Can we talk more about it?” Another example could be, “What are you trying to say? If you have constructive criticism, I’m open to hearing it.” That way, you're giving the other person a gentle reminder to phrase their words constructively."
    },
    {
      "title": "Be polite but firm when you call out judgmental people.",
      "content": "Be polite but firm when you call out judgmental people. If somebody crosses a line and makes you feel criticized, tell them how you feel. Explain that you’re upset, why their words have bothered you, and what you need from them to ensure this doesn’t happen again. This person should know your limits and what topics you’re willing to talk about with them. [4] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For example, if someone is bringing up a topic you’re not comfortable with, you can say, “I appreciate your concern, but I’m not ready to talk about this. Let’s talk about something else.” If someone is giving you criticism you didn’t ask for, you could say, “I feel like I need to deal with this my way, and I have a plan that works for me.”"
    },
    {
      "title": "An “I” statement can help you respond graciously to judgment.",
      "content": "An “I” statement can help you respond graciously to judgment. Judgmental people often say things like, “You should think about this my way.” In response, a good example of an “I” statement would be, “I hear you, but it’s my choice.” When you use an “I” statement, you can show the other person that you’re not attacking or demeaning their perspective—you’re just maintaining your right to have a different one. [5] X Research source [6] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 11 June 2020. Other good “I” statements could be, “I have my own ideas about this,” or “I prefer to look at the situation a different way.” Another example could be: “I understand you may feel differently, but I know how I feel—and I would appreciate you respecting my views as I respect yours.” “I” statements are difficult to disagree with because you can acknowledge your differences without turning the conversation into an argument."
    },
    {
      "title": "You may want to retaliate, but negativity never helps the situation.",
      "content": "You may want to retaliate, but negativity never helps the situation. Being judged is never fun, and it’s natural for you to feel hurt and emotional right after it happens. Do what you need to so that you stay calm and collected, rather than sinking to this judgmental person’s level. Getting defensive or judgmental in return is unlikely to help them see the error of their ways, and more likely to start a fight. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Resist the urge to use sarcasm or angry comments in response to the judgment. If you get angry, take several deep breaths until you feel yourself calming down. Excuse yourself briefly if you need to. Talk a quick walk, and return to the conversation when you feel ready. Say, “I know you want to talk but this is a sensitive subject for me. I need a moment before we continue; excuse me.”"
    },
    {
      "title": "Agree to disagree and pick something more compelling to talk about.",
      "content": "Agree to disagree and pick something more compelling to talk about. If neither hints nor politely explaining yourself seems to get through, you can take control of the conversation and change its direction. Pick a subject you know this person would enjoy talking about and start asking questions. The conversation will lighten back up, and you won’t have to deal with any more judgment for the moment. [8] X Research source Saying “Thank you,” is a good way to end a topic of discussion without saying “Stop talking about this.” For example, you could say, “I appreciate your input, thank you,” before moving on. Another example could be: “Understood and thank you for sharing your perspective. But while we’re talking I wanted to get your recommendation for a new TV show—I don’t know what to watch next!” Bring a friend if you know that someone is likely to be judgmental. That way, you’ve got someone to back you up and help redirect the conversation when needed. “Oh! That reminds me, my friend had a question for you.”"
    },
    {
      "title": "There’s always a silver lining, even when dealing with difficult people.",
      "content": "There’s always a silver lining, even when dealing with difficult people. It may be easier for you to respond to judgment when you’ve thought about the bright side or found a reason to be grateful. For instance, if you’re having trouble with a co-worker, you can remind yourself that you have a job and be thankful for that. If a friend is judging you, think about your support system of other friends who can back you up. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Think of each situation where you feel judged as a learning experience. Judgment is inevitable at times because many people do it naturally. Every time you face it, you learn to deal with it more effectively. Even if your relationship with the judgmental person is damaged or cut off, you can be grateful that you stood up for yourself and took care of your personal needs."
    },
    {
      "title": "Remember that a judgmental opinion is not a fact.",
      "content": "Remember that a judgmental opinion is not a fact. You’ll be happier in life if you learn to let go of your pain. Remind yourself that regardless of what other people think, you don’t deserve to feel bitter or insecure about who you are. Know that you’re stronger for having dealt with this person’s judgment, and then move forward with your life. You don’t need to depend on other people for happiness, least of all the person judging you. Their opinion doesn’t affect your worth as a person. Focus on living in the moment. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You’ll be most depressed when you obsess over the past or future. On the other hand, when you let go of those worries and live firmly in the present, you’re more likely to enjoy your life."
    },
    {
      "title": "Stop speaking with someone who doesn’t respond to any other tactic.",
      "content": "Stop speaking with someone who doesn’t respond to any other tactic. Make a polite exit and keep your distance from this person in the future. It may be difficult to cut off communication with a co-worker or family member, but you can at least try to limit contact to group gatherings where you aren’t alone with them. [11] X Research source To make your exit, you could say, “I don’t think we’re seeing eye to eye, and I’d prefer not to discuss this anymore.” Alternatively, you could make an excuse. “Sorry to cut this short, but I have a busy schedule. I should get going.” For a quick parting comeback, you could say, “You haven’t seen my journey, so I would appreciate it if you didn’t judge my choices in life” or “You know, I find that the people who know the least about you have the most to say.” If someone is consistently negative, judgmental, and unable to respect the boundaries you set, you may need to walk away for good."
    },
    {
      "title": "Spend time on people who accept you rather than dwelling on the negative.",
      "content": "Spend time on people who accept you rather than dwelling on the negative. Remember that it’s not your job to make a judgmental person change; your mental health comes first. Standing up to someone who judges you is hard, and cutting them off can be even harder, but you’ll be happier if you put energy into more positive relationships. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source After dealing with a judgmental person, make a point to talk it over with someone you trust completely, like a family member or close friend. Getting support immediately after a difficult conversation can make the ordeal feel less troubling!"
    }
  ]
}