{
  "url": "https://www.wikihow.com/Make-a-Top-Knot-Bun",
  "title": "4 Cute Top Knot Buns You Can Do at Home",
  "steps": [
    {
      "title": "Pull your hair into a high ponytail.",
      "content": "Pull your hair into a high ponytail. Comb back your hair away from your hairline, then take your hair and pull it into a high ponytail near the top of your head. Secure it tightly with a hair tie. Brush or comb the sides of your hair up if needed to make sure all the hair runs straight up into the ponytail. [1] X Research source It may be easier to do a top knot bun on second or third-day hair rather than clean hair. If you have curly or textured hair, begin by blow-drying your hair straight. This way, you'll have a smooth, neat ponytail. If you have frizzy hair, add a small amount of gel or serum around your hairline before brushing the hair into a ponytail to ensure that your hairstyle is sleek."
    },
    {
      "title": "Divide your ponytail into two sections.",
      "content": "Divide your ponytail into two sections. Take the hair in your ponytail and divide it into two equal-sized sections. [2] X Research source Add a small amount of mousse or styling cream to each section with your fingers or a comb to make the hair extra smooth. If your hair is thin, keep your hair in one section. [3] X Research source"
    },
    {
      "title": "Wrap the two sections around each other to create one whole ponytail.",
      "content": "Wrap the two sections around each other to create one whole ponytail. Take one section of hair in each hand and twist them together all the way down the ponytail to make them into one piece. [4] X Research source Twisting your hair like this can make your top knot even more smooth and prevent flyaways. Optionally, pull on each section of hair after you twist them together to create more volume. [5] X Research source If your hair is thin or fine, twist the one section. [6] X Research source If your hair is short, consider wrapping hair extensions around the base of your ponytail. Tilt your head to the side as you wrap. Wrap the end of the extension around the bottom of the base to keep it in place. [7] X Research source If necessary, secure your extension with a hair tie or rubber band."
    },
    {
      "title": "Wrap your hair around the hair tie.",
      "content": "Wrap your hair around the hair tie. Take your twisted hair and wrap it in a clockwise direction around your hair tie. Tuck the end of the hair underneath the hair tie. [8] X Research source"
    },
    {
      "title": "Pin the top knot in place.",
      "content": "Pin the top knot in place. Once you finish wrapping, use several bobby pins the same color as your hair to pin the top knot in place, both at the top and bottom of the bun. Or use a hair clip to secure the bun. [9] X Research source Spray with hairspray to give the style extra hold. If you have textured or kinky, curly hair, style the front edges of your hair with an old toothbrush or comb dipped in gel. Brush the baby hairs into small swirls along your hairline. [10] X Research source"
    },
    {
      "title": "Comb your hair into a ponytail.",
      "content": "Comb your hair into a ponytail. Work with second or third-day hair or spray your hair with dry shampoo to give it some texture. Then comb your hair into a high ponytail near the top of your head, securing it with a hair tie. [11] X Research source Optionally, pull out the hairs in front of your ears to frame the sides of your face. This style is especially good for those with curly or wavy hair since curly hair can give you a more voluminous look naturally."
    },
    {
      "title": "Tease your ponytail with a brush to make it more voluminous.",
      "content": "Tease your ponytail with a brush to make it more voluminous. Take about a quarter of your hair from the ponytail and hold it straight up above your head. Use a brush or comb to tease the hair, starting at the midpoint of the hair and combing down to the base of the ponytail. Repeat until you have lightly teased each section of hair. [12] X Research source If your hair is thinner, use the brush to tease the ponytail all at once. Backcombing your hair makes it more voluminous and textured so that your top knot is fuller."
    },
    {
      "title": "Smooth the top of the ponytail.",
      "content": "Smooth the top of the ponytail. After backcombing your hair, take the comb and lightly brush the very top layer of hair in the ponytail, leaving the teased hair in the center. Brush from the base of the ponytail down to the tips of the hair to create a smooth top layer. [13] X Research source Comb very gently with a brush rather than a comb, which can be easier to work with on backcombed hair. Smoothing this very top layer of the ponytail will keep the top knot looking smooth, even if the hair in the center of the top knot is full and textured."
    },
    {
      "title": "Wrap your hair in a bun around the base of the ponytail.",
      "content": "Wrap your hair in a bun around the base of the ponytail. Take the hair of your ponytail and loosely wrap it clockwise around the base of the ponytail. [14] X Research source When you reach the tips of your hair, tuck the hair underneath the hair tie."
    },
    {
      "title": "Pin the bun in place with bobby pins.",
      "content": "Pin the bun in place with bobby pins. After you twist your hair into the top knot, secure the style with several bobby pins. [15] X Research source Use your fingers to pull small sections of the bun out to give it more volume and then spray lightly with hairspray to give it a better hold. Optionally, pull pieces of hair out from the sides of your head to create a naturally messy look."
    },
    {
      "title": "Put your hair in a high ponytail.",
      "content": "Put your hair in a high ponytail. Pull back your hair into a high ponytail. If it helps, you can brush your hair back so that your hair is smooth and bump-free. [16] X Research source Master hairstylist Christine George recommends using a hair donut for an easy way to create a clean, professional-looking bun. She says, \"All the girls in my salon use it.\" Your hair has to be medium-length, though, or “at least past your shoulders.” Remove all tangles from your hair with a brush before styling."
    },
    {
      "title": "Put a hair donut around the base of your ponytail.",
      "content": "Put a hair donut around the base of your ponytail. Poke your hair through a hair donut and pull it all the way to the base of your ponytail. [17] X Research source If you don't have a hair donut, you can also cut the toe off of a clean tube sock and roll it up into a donut shape. [18] X Research source If your hair is thin, hold your ponytail straight up in the air with one hand and backcomb it with the other, starting at the midsection and working down to the base. Backcombing your hair can give it more volume to completely cover the donut."
    },
    {
      "title": "Wrap your hair around the donut.",
      "content": "Wrap your hair around the donut. Take your hair and start to wrap it clockwise around the hair donut to completely cover it. When you reach the tips of your hair, tuck the tips under the donut. If your hair is thick, wrap sections of your hair around and under the donut. Wrap clockwise and counterclockwise until all the hair forms a tight bun. [19] X Research source"
    },
    {
      "title": "Pin the ends of your hair in place underneath the hair donut.",
      "content": "Pin the ends of your hair in place underneath the hair donut. Use several bobby pins to pin your hair around the hair donut and secure the tips in place. [20] X Research source Optionally, spritz the bun with hairspray to prevent flyaways and to give the style extra hold."
    },
    {
      "title": "Part your hair horizontally from the top of one ear to the other.",
      "content": "Part your hair horizontally from the top of one ear to the other. To do this half-up top knot, pull the front of your hair back into a horizontal part that divides the top of your hair from the bottom. Use your fingers to part the hair at about ear level on both sides and pull the top layer of hair back towards the back of your head. [21] X Research source Since this is a laid-back look, you don't have to precisely part your hair on each side, as long as each side is roughly symmetrical. This look can work on short or long hair."
    },
    {
      "title": "Hold your hair in a ponytail.",
      "content": "Hold your hair in a ponytail. Take the top section of hair and gather it into a high ponytail on the top of your head. Hold it in a ponytail using one hand. [22] X Research source Optionally, apply a texturizing spray to the top separated chunk of your hair and work it in with your fingers to create a little extra volume. [23] X Research source"
    },
    {
      "title": "Wrap your hair into a bun.",
      "content": "Wrap your hair into a bun. Hold your hair in a ponytail with the fingers of one hand. Use the other hand to wind your hair clockwise around the base of the ponytail that you’re holding up with your fingers. [24] X Research source If you have short hair, make a small loop and hold it in place with your fingers instead of wrapping your hair around."
    },
    {
      "title": "Secure your bun with an elastic hair tie.",
      "content": "Secure your bun with an elastic hair tie. After you have wrapped the hair around until you reach the tips, or have made a small loop if you have short hair, use a hair tie to secure the bun. If you want a fuller-looking top knot, pull the bun gently with your fingers to make it bigger. [25] X Research source If the hair tie shows, use bobby pins to pin the hair around the tie and get the bun in the shape that you want. [26] X Research source"
    }
  ]
}