{
  "url": "https://www.wikihow.com/Sell-Books-on-Amazon",
  "title": "A Beginner’s Guide to Selling Books on Amazon",
  "steps": [
    {
      "title": "Create an Amazon shopper account if you do not already have one.",
      "content": "Create an Amazon shopper account if you do not already have one. Navigate to the main Amazon page, then click on the \"Your Account\" tab in the upper right corner. You will be asked to provide an e-mail address, password, and basic contact information. After submitting these details, you should receive a confirmation e-mail to notify you that your regular shopper Amazon account has been created. [1] X Research source Write down the username and password somewhere secure so you don’t forget your login information."
    },
    {
      "title": "Make a Professional Seller account if you represent a business.",
      "content": "Make a Professional Seller account if you represent a business. Use a Professional account if you plan to sell books as a business endeavor and anticipate selling more than 40 books per month. Go to the seller account start page to begin setting up your account. Click on the \"Your Account\" tab in the upper right corner of the page to visit your account page. On the right side of your account page, there should be a heading called \"Your Other Accounts.\" Click on \"Your Seller Account\" at the top of the list to begin the process to establish a seller account. You must sign in again before your seller account can be activated. [2] X Research source A Professional Seller account has a $39.99 monthly subscription fee but no per sale closing fee. A Professional Seller account also allows you to use feeds and spreadsheets to manage your inventory, as well as provides access to order reports."
    },
    {
      "title": "Create an Individual Seller account if you’re moving limited inventory.",
      "content": "Create an Individual Seller account if you’re moving limited inventory. If you’re a casual book seller trying to get rid of a little personal overstock (i.e. fewer than 40 books per month), you’re better off with an Individual account. Set up your Individual Seller account by following the same steps as you would for a Professional account. Navigate to the “Your Accounts” tab and click on “Your Seller Account.” Sign in, and select that you’d like to open a Professional Seller account. [3] X Research source An Individual Seller account has no monthly fee but charges $0.99 as a per sale closing fee."
    },
    {
      "title": "Enter your payment information to legitimize your seller page.",
      "content": "Enter your payment information to legitimize your seller page. You will need to provide valid checking account information to be able to receive payments when you sell your books. Under the \"Settings\" tab on your seller account page, see a link called \"Account Info.\" On this page, notice a \"Deposit Method\" section. Click the \"Edit\" button to enter your information. Select the country in which your bank account is located under \"Bank Location Country.\" Enter the routing number and checking account number. Click \"Submit.\" [4] X Research source Wait to start selling books until you receive a confirmation e-mail. This can take several days since Amazon must first confirm the account with your bank."
    },
    {
      "title": "Search for the title of the book you wish to sell.",
      "content": "Search for the title of the book you wish to sell. You can search for the title by going to the \"Sell Your Stuff\" page linked on your main seller account page. [5] X Research source On the \"Sell Your Stuff\" page, type the title or ISBN into the search box. Make sure that \"Books\" is selected as the product category. Click on \"Start Selling\" to begin your listing. You can also find the book titles you’d like to sell by finding the book through a standard Amazon search. Once you locate the book and go to its corresponding item detail page, click on the \"Sell on Amazon\" button on the right side of the screen to begin your listing."
    },
    {
      "title": "List a new book’s title if you’re selling a book that’s new to Amazon.",
      "content": "List a new book’s title if you’re selling a book that’s new to Amazon. If the book you want to sell has not been listed on Amazon already, you can begin a new listing for it by searching for the ISBN on the “Sell Your Stuff” page. Type in all of the relevant information about the book, including its title, author, ISBN, SKU, and publisher information. When no results come up, Amazon will direct you to begin a new listing. [6] X Research source hhttps://sell.amazon.com/learn/how-to-sell-books You’ll need to list new book titles if, for example, you work for a book publisher or small press that’s putting out new books regularly."
    },
    {
      "title": "Set the price of the book depending on its status.",
      "content": "Set the price of the book depending on its status. Decide what price you want to sell your book for and input that information in the corresponding field. If the book has already been listed on Amazon, a good way to determine the price you should sell it for is by noting the price that other sellers have listed their copies at. Since you are just beginning as a seller, you will need to list your copy at a low price in order to convince potential buyer's to purchase yours over someone else's. [7] X Research source Alternately, if your book is in very good condition and you’d like to get a little more money for it, raise the price by a few dollars. You can always log back in and change the price at a later time."
    },
    {
      "title": "Describe the condition of the book you’re selling.",
      "content": "Describe the condition of the book you’re selling. The condition of a used book ranges from \"Like New\" to \"Acceptable.\" A book can be listed as \"New\" only if it has never been touched or read. Also type a brief description of the condition and note whether your book is hardcover or paperback. Be accurate and descriptive, since sellers rely on these descriptions to choose which books to purchase! [8] X Research source A book is \"Like New\" if everything appears as though the book has never been touched. The dust cover must be intact with no tears. The spine should show no creasing and the pages must be completely clean and intact. A book is \"Very Good\" if the pages and dust cover are intact and clean and if the spine is undamaged. The pages can show evidence of mild folding. A book is \"Good\" if the pages and cover are intact. The spine can show limited signs of wear and the pages may include limited highlighting. The book can also have a \"From the library of\" label. A book is \"Acceptable\" if the pages and cover are intact. The pages can include notes and highlighting, as long as the text is not obscured. The spine can also show creasing, but it must remain sturdy and intact. If a book is \"Unacceptable,\" it cannot be sold on Amazon. A book is \"Unacceptable\" if it includes missing pages, obscured text or ripped covers."
    },
    {
      "title": "Select the shipping method you plan on providing.",
      "content": "Select the shipping method you plan on providing. Unless you plan to use Fulfillment by Amazon, it’s the seller’s responsibility to ship the books to the customer. The most common shipping method is to charge the customer $3.99 USD for the book to arrive within 7-10 business days. Then, click “Save” to confirm all of the details you’ve provided about the book and finalize the listing. [9] X Research source Once you save your listing, the book will be made available for sale on Amazon. This means that customers will be able to see the book when they search for the title on the website."
    },
    {
      "title": "Ship the book to the seller once they’ve purchased it.",
      "content": "Ship the book to the seller once they’ve purchased it. You’ll receive an email from Amazon once someone has bought one of the books you’ve listed. The email will contain the buyer’s name and address. Package the book in an envelope or box, write the buyer’s address and your return address on the front, and ship the book via your preferred shipping service. Amazon requires you to ship within 2 business days of receiving the order. [10] X Research source It’s standard practice for Amazon to reimburse sellers $3.99 USD for each book sold. This means that, if you’re selling large books that cost more than $4 to ship, you could feasibly lose money on shipping."
    },
    {
      "title": "Change a previous book listing to \"Fulfilled by Amazon.",
      "content": "Change a previous book listing to \"Fulfilled by Amazon. \" If you’ve already set up a seller account and listed a few books to sell, it’s easy to switch the account to Fulfilled by Amazon (FBA). On your Seller Central page, select \"Manage Inventory\" under the \"Inventory\" section of your account. Select the book you want to convert. Check the box next to the book in the far left column. Go to the \"Actions\" pull-down menu on the page. From this menu, select \"Change to Fulfilled by Amazon.\" [11] X Research source Amazon should take you to the conversion page next. Click on the \"Convert\" button to change the listing."
    },
    {
      "title": "Ship your book inventory to Amazon the nearest fulfillment center.",
      "content": "Ship your book inventory to Amazon the nearest fulfillment center. When you begin signing up for FBA, Amazon will provide you with a list of fulfillment centers. Select the one nearest your location and follow the instruction about shipping your book or books to that fulfillment center. Amazon will generate PDF product and shipment labels for your book. Print these labels and attach them to your shipping envelope as directed. [12] X Research source You can use Amazon's discounted shipping to send the book to the fulfillment center. Alternatively, you can also use your own carrier if you find that option to be cheaper or otherwise preferred."
    },
    {
      "title": "Monitor the listing and let Amazon handle the rest.",
      "content": "Monitor the listing and let Amazon handle the rest. You will receive an email notification when Amazon receives your books. The Amazon fulfillment center will scan your inventory, record item dimensions and conditions, and input this information into the online tracking system. When a customer purchases a book you are selling with FBA, Amazon will ship the order to the customer and update your listing. You will receive another email notification when your product has been purchased and shipped. [13] X Research source Outbound shipping costs are included in your service fees. Amazon stores and ships your products. All you need to do is monitor the listing for your own records."
    },
    {
      "title": "Submit an Advantage application to join the program.",
      "content": "Submit an Advantage application to join the program. The Advantage program is designed for sellers who intend to distribute their own work or large quantities of other books they are legally allowed to distribute. Unlike the other types of Amazon seller accounts, Amazon requires potential Advantage members to submit a special application. In order to participate, you will need North American distribution rights for any titles you enroll. The account you set up for an Advantage membership will require the same information as a standard selling account. You will need to input your name, e-mail, password, mailing address, and bank account. You will also need a valid e-mail address, access to the Internet, and a U.S. bank account. To start the application process, navigate to the Advantage home page at: https://advantage.amazon.com/ . Click on the “Apply” button to be directed to the application. Note that as a member of the Advantage program, you do not need to maintain a selling account or manage buying orders and feedback."
    },
    {
      "title": "Enroll at least 1 book title under your Advantage account.",
      "content": "Enroll at least 1 book title under your Advantage account. Your Advantage account won’t be active until books are registered under it. Click on “Enroll” under your Advantage account, and type in the details of each book you’d like to sell through the program. Each title must have an ISBN, and each physical book copy must have a valid barcode. [14] X Research source After you enroll a title through the Advantage account, you will receive an initial order e-mail with instructions on how to log in and confirm your order. To confirm an order, you will need to log into your member page and select the \"Orders\" tab. After clicking on the corresponding Order ID number, you will confirm the order and receive shipping instructions."
    },
    {
      "title": "Print your shipping label and packing slip for each order.",
      "content": "Print your shipping label and packing slip for each order. You can print out these slips from your order confirmation page after you’ve confirmed the order. The packing slip should be included in the box along with the books you ship. Place the shipping label on the outside of the box using heavy-duty packaging tape. [15] X Research source"
    },
    {
      "title": "Mail your products to an Amazon shipping center for distribution.",
      "content": "Mail your products to an Amazon shipping center for distribution. It’s your responsibility to send your books to an Amazon distribution center, but Amazon will handle shipping the books to the customers. Amazon will instruct you on which fulfillment center to send your books to, and the address will be on the shipping label. You will be notified when your order is received at the facility. [16] X Research source Amazon should have provided you with the distribution center’s address after you enrolled your book(s). If they didn’t, contact the Advantage program and inquire where your books should be shipped to. If you ship an order to an Amazon fulfillment center that does not meet its requirements, Amazon may ship it back to you at your expense."
    },
    {
      "title": "Let Amazon sell the books and ship them out to customers.",
      "content": "Let Amazon sell the books and ship them out to customers. Amazon will take care of getting the books into the customers’ hands. You will receive payment (via direct deposit) from Amazon once customers have purchased your books. Under the Advantage program, the books are put up for sale under Amazon's name rather than your seller name. You will not receive feedback for the purchase or the condition of the book. Amazon will also handle any returns if customers are dissatisfied with the books. [17] X Research source For this reason, the Advantage program is ideal for booksellers or publishers who prefer to have a hands-off approach to selling and shipping their own books."
    }
  ]
}