{
  "url": "https://www.wikihow.com/Pay-a-Pet-Sitter",
  "title": "How to Pay a Pet Sitter",
  "steps": [
    {
      "title": "Determine the going rate for pet sitters in your area.",
      "content": "Determine the going rate for pet sitters in your area. Before you decide what to pay a pet sitter, you should determine the pay rates in your area. You do not want to mistakenly offer your sitter too much or too little for the job. Browse the Yelp pages in your area for pet sitting companies and individual pet sitters. Find a link to their website from there and see what rates they typically charge. [1] X Research source Make a running list of pay rates and then scan your list. You can calculate an average by adding all the rates and dividing them by the number of pet sitters. However, if rates are generally around, say, $20/hour or $60/day you might not need to do the math to get a sense of average pay rates. Pay attention to things that affect pay rates. In some areas, pet sitters may charge more for overnight stays, animals who need medications, and other issues. [2] X Research source"
    },
    {
      "title": "Consider any extenuating circumstances regarding your pets.",
      "content": "Consider any extenuating circumstances regarding your pets. A pet sitter might want to charge more under certain circumstances. Keep in mind you might need to pay a bit more given some of the following: A pet that has specific medical needs, like certain medications or issues with bladder or bowel control If you live in a rural area and a lot of travel is involved to get to your place Dogs that require long walks Multiple pets Overnight stays Other circumstances that require increased time and care [3] X Research source"
    },
    {
      "title": "Talk to your pet sitter about the pay rate.",
      "content": "Talk to your pet sitter about the pay rate. Once you've done some research, talk to your pet sitter about the pay rate. The two of you can work out an arrangement that feels fair. Be respectful during negotiations. Your pet sitter might have a higher payment rate in mind than you. Try to be understanding of your pet sitter and willing to make compromises. Settle on a payment plan. Determine whether you're paying by hour or day. Make sure to include any situations where you might need to pay more or less. For example, if your pet makes a mess that needs to be cleaned up you might have to pay $10. If your pet sitter forgets to change the litter box, you could withhold $5 from the paycheck. Just make sure you're transparent about pay rate ahead of time to avoid any disagreements later on. [4] X Research source"
    },
    {
      "title": "Pay in cash.",
      "content": "Pay in cash. The easiest way to pay a pet sitter is to simply pay in cash. Pet sitters might even prefer cash and request it. Simply calculate how much you owe and get that cash amount from a bank or ATM. [5] X Research source"
    },
    {
      "title": "Pay by check.",
      "content": "Pay by check. If you had a pet sitter stay for a long time, you might owe them a large amount. In this case, you and the pet sitter might feel more comfortable paying with a check. Simply make the check out to the pet sitter for the amount owed. He or she can simply deposit the check into their account or cash it at a bank."
    },
    {
      "title": "Transfer funds electronically.",
      "content": "Transfer funds electronically. A lot of people do not carry checks as banking is becoming increasingly electronic. There are ways to electronically transfer money if you owe a large amount and do not want to pay in cash. Some banks allow you to wire transfer money between accounts. However, this can be a complicated as you might need certain aspects of your pet sitter's banking information. He or she may be uncomfortable giving this information out. You can try talking to your bank to see if there's any way to get pas this rule. There is also usually a fee with wire transfers. PayPal is an online money transfer system that allows you to send money to other users. If you have a PayPal account and your pet sitter does as well this might be an easy means of payment."
    }
  ]
}