{
  "url": "https://www.wikihow.com/Reference-Letter-for-Coworker",
  "title": "How to Write a Recommendation Letter for a Colleague",
  "steps": [
    {
      "title": "Introduce yourself and explain how you know your coworker.",
      "content": "Introduce yourself and explain how you know your coworker. Start the letter by telling the recipient your name and position title so they understand why you’re qualified to provide a reference. Then, explain how long you worked with your coworker and what tasks or projects you collaborated on. [1] X Research source Example : “My name is Gabriel Smith and I am an accountant at Z Company. I have had the pleasure of working with Gianna Russo for the past 4 years. I highly recommend Gianna for the position of Senior Accountant at A Corporation.”"
    },
    {
      "title": "Provide examples of your coworker’s skills and accomplishments.",
      "content": "Provide examples of your coworker’s skills and accomplishments. In the next few paragraphs, talk about what makes your coworker qualified for the role or program. Give specific examples of how their qualities led to success or had a positive impact on others. For instance, you might explain how their determination and sales skills boosted revenue by 15%. [2] X Research source Example : “Gianna is an incredibly dedicated employee who has an impressive ability to remain calm under pressure. During our first year working together, she had a challenging client who was on a tight deadline. She reviewed the client’s portfolio quickly and provided them with a thorough recommendation. The client was so pleased that they referred their colleagues to work with Gianna.” In general, talk about 2 to 3 qualities in the body of your letter and provide 3 to 5 sentences for each one. Tip : Tailor your examples to the skills or qualifications the role/program is looking for. For instance, if your coworker is applying to law school, talk about relevant skills like communication, critical thinking, and prior law experience."
    },
    {
      "title": "Be honest, concise, and professional when writing the letter.",
      "content": "Be honest, concise, and professional when writing the letter. While you want to speak positively about your coworker, don’t over-embellish their accomplishments or exaggerate their qualifications. Aim for a formal, respectful tone by sticking to the facts and keeping your writing to the point. [3] X Research source The average length of a reference letter is about 1 to 1.5 pages (single-spaced). While you might have a lot of great things to say, be clear, concise, and stick to only a few examples. [4] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Write in active voice instead of passive so your sentences are punchy and concise. As a plus, this helps highlight your coworker’s qualities more strongly."
    },
    {
      "title": "Close the letter by reaffirming your recommendation.",
      "content": "Close the letter by reaffirming your recommendation. At the end of your letter, summarize your coworker’s qualities and qualifications to confirm they’re a good candidate. Then, reiterate your recommendation of them for the role or program. [5] X Research source Example : “Gianna is a driven and hardworking employee who’s creative problem-solving skills will be an asset at A Corporation. She has my highest recommendation for the Senior Accountant position.”"
    },
    {
      "title": "Include your contact information and sign your name.",
      "content": "Include your contact information and sign your name. Make sure the recipient knows how to contact you if they have any questions or want further information about your coworker. Then, add a professional sign-off and write your name. Example : “Please do not hesitate to contact me if you have any questions or need any additional information. You can reach me at (111) 111-1111 or gabrielsmith@email.com. Sincerely, Gabriel Smith”"
    },
    {
      "title": "Format your recommendation like a professional letter.",
      "content": "Format your recommendation like a professional letter. Whether you’re submitting the letter electronically or sending it through the mail, use a professional format : [6] X Research source Write the recipient’s name and address at the top of the letter. Write the date. Greet the recipient professionally . Include an introduction and 2-3 body paragraphs. Add a concluding paragraph. Finish with a formal closing and your name."
    },
    {
      "title": "Thoroughly proofread your letter.",
      "content": "Thoroughly proofread your letter. Make sure your reference letter is free from spelling and grammar mistakes to ensure it reads professionally. Also, make any tweaks to ensure your information is correct, your tone is professional, and your language is concise. [7] X Research source"
    },
    {
      "title": "Determine if you can write a positive, helpful letter.",
      "content": "Determine if you can write a positive, helpful letter. In general, only write a reference letter for your coworker if you can confidently recommend them for the role or program and if you have first-hand knowledge of their skills and accomplishments. If you don’t think you can give them a positive or helpful reference, Dr. McCutcheon recommends that you “decline and tell [your colleague] that you don’t feel able to write a strong letter.” Declining your coworker’s request can be uncomfortable, so Dr. McCutcheon suggests being polite, honest, and brief. He says you “have every right to communicate your reason(s) in a polite, professional manner.” For instance, use this template provided by Dr. McCutcheon: “Dear Jonathan, I’m glad to hear that you are currently pursuing a career path that you find compelling. I am, unfortunately, unable to provide a suitable reference for you since our time working together was quite brief. I wish you every success in your next chapter.”"
    },
    {
      "title": "Find out what your coworker is applying to.",
      "content": "Find out what your coworker is applying to. Ask your coworker to provide you with the position or program description, as well as the relevant skills, requirements, and qualifications the role/program is looking for in a candidate. This helps you determine what qualities to highlight in your letter. [8] X Research source"
    },
    {
      "title": "Review your coworker’s resume.",
      "content": "Review your coworker’s resume. Familiarize yourself with your coworker’s professional experience, academic history, and achievements. This helps you understand their skills, qualifications, and goals to write a strong letter. [9] X Research source Take a moment to reflect on your time working with your coworker, too. Think about the qualities they exhibited and the achievements they made during your time together."
    },
    {
      "title": "Ask your coworker what they want you to highlight.",
      "content": "Ask your coworker what they want you to highlight. According to Garrido, one of the most effective ways to write your letter is to ask your colleague “what they'd like you to share” about their skills, qualifications, and accomplishments. She recommends asking them, “What are the things you really want me to highlight?” and “What are the kinds of positions you're looking for?” to help you draft your letter. Garrido says this is a good approach because your colleague is likely asking other people to write them letters, so “they don't want all of them to say the exact same thing.” As an example, Garrido says you might “highlight customer service” while “somebody else highlights professionalism” and “another one highlights attention to detail.” This is a great way to “make sure someone has a well-rounded approach.”"
    },
    {
      "title": "Check who you are addressing the letter to.",
      "content": "Check who you are addressing the letter to. It’s important to properly address the recipient so your letter comes across professionally and respectfully. Make sure to use the recipient’s proper title (e.g., Mr., Ms., Mrs., Dr.), too. [10] X Research source If your coworker doesn’t know the recipient’s name, say “To whom it may concern” or “Hiring Manager for XYZ Company.”"
    },
    {
      "title": "Find out the due date for the letter.",
      "content": "Find out the due date for the letter. Ask your coworker if there is a submission deadline to ensure you turn in your letter on time. This helps you understand how long you have to collect all the information you need and provides a timeline for finalizing the letter. [11] X Research source"
    },
    {
      "title": "Check how and where to submit the letter.",
      "content": "Check how and where to submit the letter. The company or academic program your coworker is applying to might have certain guidelines for writing and submitting the letter. For instance, there might be an online portal where you paste your letter. Or, the company/program might ask that you email it to a specific person or general address."
    },
    {
      "title": "Professional reference letter",
      "content": "Professional reference letter Dear Mr. Jackson, I am pleased to recommend Corbin Williams for the Director of Marketing position at B Company. My name is Selena Rodrigo, and I am a fellow Marketing Manager at Y Firm. I’ve had the pleasure of working with Corbin for the past 8 years, who has been an invaluable member of our team. Corbin consistently raises the bar for what it means to be a Marketing Manager. He is an innovative thinker who creates bold strategies to maximize our company’s revenue. This past year, Corbin harmonized our website and social media platforms for a new campaign he implemented. His efforts singlehandedly increased the company’s revenue by 20% and boosted our online engagement by 200%. Corbin is also an inspiring and motivating leader. He encourages his team members to share their ideas and supports the implementation of their plans. While many of Corbin’s team members have been promoted and moved up in the company, not a single one has left. This speaks to the genuine care and respect he has for his team members, as well as how he leads with compassion, collaboration, and integrity. In addition to Corbin’s impressive strategic vision and leadership skills, he is a creative problem-solver who’s able to pivot at a moment’s notice and deliver successful campaigns on a tight deadline. I am confident that Corbin will be a great asset to B Company. Should you have any further questions, please contact me at (111) 111-1111. Sincerely, Selena Rodrigo"
    },
    {
      "title": "Academic reference letter",
      "content": "Academic reference letter Dear Dr. Miller, My name is Ahmed Khalid and I am a seventh-grade English teacher at ABC Middle School. I’ve had the pleasure of working alongside Juliet Andrews in the seventh-grade English department for the past 3 years. Juliet is a passionate teacher who is committed to her student’s success. For that reason, I highly recommend her for admission to the Masters in Teaching program at XYZ University. During our 3 years working together, Juliet has demonstrated her strong dedication to her students’ progress. For example, Juliet meets with each student individually to create a personalized curriculum that matches their learning style and strengths. I’ve seen first-hand how much her students have grown and how much they enjoy going to her class. Juliet is also devoted to improving classroom practices and curriculum development. In her first year at ABC Middle School, Juliet started quarterly professional development training to teach faculty and staff about various topics, like addressing student mental health and tailoring instruction styles to meet students’ needs. Her training has had a positive impact on student success and teacher retention. Not only is Juliet a great teacher, but she is a great colleague who leads with positivity and is always willing to help. I believe that Juliet will be a tremendous asset to the Masters program. Please do not hesitate to reach out if you have any further questions. You can contact me at a.khalid@email.com or (111) 111-1111. Regards, Ahmed Khalid"
    },
    {
      "title": "",
      "content": "Dear [Recipient Name], My name is [Your name], and I am a [job title] at [Company]. I have had the pleasure of working with [Coworker’s name] for [duration of time]. I highly recommend [Coworker] for the [name of position or program] at [Company or Institution]. During our time working together, [Coworker] has demonstrated a remarkable [quality (e.g., work ethic, leadership skills, determination)]. For example, they [detailed evidence of quality]. [Coworker] also demonstrated that they are [quality (e.g., detail-oriented, a positive team player, a problem-solver)]. As an example, they [detailed evidence of quality]. In addition to [qualities mentioned], [Coworker] is [quality], [quality], and [quality]. I am confident that they will be an asset to [Company or Institution]. Should you have any further questions, please contact me at [phone number and/or email address]. Sincerely, [Your name]"
    },
    {
      "title": "How long does it take to write a reference letter?",
      "content": "How long does it take to write a reference letter? The average reference letter typically takes 30 to 60 minutes to write. However, if this is your first letter, it may take you a bit longer. How long it takes you just depends on how much you have to say, how much you have to edit, and what other responsibilities you have going on in your life."
    },
    {
      "title": "What do I do if I don’t think I can write a strong reference?",
      "content": "What do I do if I don’t think I can write a strong reference? If you don’t have many positive things to say about your coworker, whether you don’t know them well or don’t think they’re a good candidate, it’s best to politely decline their request. Dr. McCutcheon agrees that this is the best course of action, as it “gives them the opportunity to find another writer that may have more positive reviews of their work.” If you want to proceed with writing the letter, Dr. McCutcheon recommends that you write what your coworker “does well and frame their weaknesses as ‘areas of growth’ rather than as a negative review.”"
    },
    {
      "title": "What should I avoid when writing a reference letter?",
      "content": "What should I avoid when writing a reference letter? Avoid making very general or vague statements—you want to write about specific qualities that make your coworker stand out. Also, avoid including irrelevant information. The qualities you talk about should match the skills or qualifications the position or program is looking for."
    },
    {
      "title": "What’s the purpose of a reference letter?",
      "content": "What’s the purpose of a reference letter? Companies and academic institutions use reference letters as part of the hiring or acceptance process to learn more about the candidate and make a decision. Hearing from the candidate’s colleagues validates their qualities and accomplishments, demonstrating that they are a good fit for the role or program."
    }
  ]
}