{
  "url": "https://www.wikihow.com/Play-Dodgeball",
  "title": "How to Play Dodgeball",
  "steps": [
    {
      "title": "Gather 3 or more people per team.",
      "content": "Gather 3 or more people per team. You will need to have at least 3 people on each side of the court to play a traditional game of dodgeball. However, you may have as many players per side as you like. Make sure that all of the players are wearing rubber-soled shoes, such as sneakers, so that they do not slip on the court."
    },
    {
      "title": "Arrange 1 or more balls at the center of the court.",
      "content": "Arrange 1 or more balls at the center of the court. There should be at least 1 ball available for players to throw, but the game will be even faster-paced if you use multiple balls. Place the ball or balls on the centerline. If you are only using 1 ball, place it at the midpoint of the centerline. If you are using 2 or more balls, spread them evenly along the centerline."
    },
    {
      "title": "Set a timer for 10 minutes.",
      "content": "Set a timer for 10 minutes. This is the maximum amount of time that a match can go on, so set a timer before you play the first game. Each game may only last for a minute or 2, but you may play multiple games to decide the overall winner of the match. Another option is to decide the winner based on the number of games won, such as the first team to win 3 games, or the team that wins the most out of 7 games."
    },
    {
      "title": "Rush to the balls in the center of the court when play begins.",
      "content": "Rush to the balls in the center of the court when play begins. When you are ready to start the game, blow a whistle or shout “go!” and then allow the players to run towards the balls. Any player may grab a ball, but teams may want to choose their fastest player to rush for the ball if you are only playing with 1 ball. After the first player gets a ball in their hands, they should wait for 5 seconds before throwing it at someone. This is to ensure that the other players have an adequate chance to get to a ball as well."
    },
    {
      "title": "Try to dodge balls that the other team throws at you.",
      "content": "Try to dodge balls that the other team throws at you. As the players rush for balls and aim them at the other team, try to dodge the opposing team’s balls. Move around the court to avoid getting hit. You may move to any part of the court to avoid getting hit as long as you stay inside your side of the court. If you successfully dodge a ball, then you can pick it up and throw it at the other team. If the ball hits you, then you are out and must leave the court. If you catch a ball that someone throws at you, then the person who threw the ball is out. However, you must catch the ball before it hits you."
    },
    {
      "title": "Throw balls at the other players to get them out.",
      "content": "Throw balls at the other players to get them out. Once you pick up a ball, you have to throw it within 5 seconds. Make sure not to throw the balls too hard or you may hurt someone! Also, only throw balls below the level of the other players’ shoulders to avoid hitting them in the head. If a ball hits someone in the head, then it does not count. If you wait longer than 5 seconds to throw a ball, then you lose your chance to throw it. Roll the ball gently over to your opponents. Avoid crossing the center line in the court as you approach it to throw a ball. You will be out if you cross the line. Never throw the ball at another player’s head or at a player who is on the ground!"
    },
    {
      "title": "Win by tagging out all of the opposing team's players.",
      "content": "Win by tagging out all of the opposing team's players. The object of the game is to be the team with players left on the court. If your team tags out all of the opposing team’s players first, then your team wins! Even if you only have one player left on the court and the other team has no players left, your team wins the game. If desired, you may switch sides after each game. This is to ensure that no team has an unfair advantage. After 10 minutes of play, the team with the most games won is the winner of the match."
    },
    {
      "title": "Draw a large chalk circle with evenly spaced X marks around it.",
      "content": "Draw a large chalk circle with evenly spaced X marks around it. You can draw a large circle or semi-circle on a slab of concrete, or use an extra-large jump rope to form a semi-circle on the edge of a basketball court. Then, use chalk or tape to create an X mark for each player who will be on the outside of the court. [1] X Research source If you are playing on a court that already has circles on it, you may also choose one to be the circular court. The circle should be at least 10 ft (3.0 m) across."
    },
    {
      "title": "Start with half your players inside the court and the other half outside.",
      "content": "Start with half your players inside the court and the other half outside. The fewer players you have inside of the court, the harder it will be for them to dodge the balls. To keep the game fair, you may want to start with half of your players inside the circle and the other half outside of the circle. Have each of the players outside the circle stand on an X mark. [2] X Research source For example, if you have a total of 8 players, then position 4 of them inside of the circle and the other half outside of the circle. These players may wear flags or special jerseys to differentiate them from the players outside of the court."
    },
    {
      "title": "Throw balls at the players in the circle if you are standing on an X.",
      "content": "Throw balls at the players in the circle if you are standing on an X. Make sure that you do not throw the ball too hard or you may hurt a fellow player! You cannot move from your X when you throw the ball and you can only retrieve a ball if you can reach it without leaving your X. The players inside of the circle can move anywhere within the circle to dodge the balls that you throw. [3] X Research source If you are outside of the circle, aim your throws below the other players’ shoulders to avoid hitting someone in the head. In some settings, you may only be allowed to throw the ball underhand. [4] X Research source Do not throw the ball at a down player or a player’s head!"
    },
    {
      "title": "Dodge the balls if you are inside the circle.",
      "content": "Dodge the balls if you are inside the circle. You have to leave the center of the circle if you get hit. The object of the game is to avoid getting hit. If you get hit by a ball, you are out and must leave the circle. Sit or stand on the sidelines until the game is over. [5] X Research source The game is over after 2 minutes and the team with the most players left on the court wins. Switch sides after each game."
    },
    {
      "title": "Place a few balls in the center of a gym or court.",
      "content": "Place a few balls in the center of a gym or court. The object of survivor dodgeball is to be the last person standing. Start with a few balls in the center of the court that anyone can run and grab. You can play with as many or as few balls as you want, but this game is more fun with at least a few balls so that they are easier to get. [6] X Research source Try starting for 1 ball for every 2 to 3 players, such as 4 balls for 8 to 12 players."
    },
    {
      "title": "Stand on the outskirts of the court.",
      "content": "Stand on the outskirts of the court. There are no teams in survivor dodgeball, so everyone can decide where they want to stand at the beginning of the game. The players may spread out, or try to position themselves somewhere that they might have an advantage. [7] X Research source For example, if you want to be 1 of the first players to get to the balls, then you might try to stand as close to the balls as possible. Although there are no teams, you may ally with another player early in the game and work together to get other players out. However, you will eventually have to face off with this person if you are the last player standing."
    },
    {
      "title": "Run towards the center of the court to get a ball when the game starts.",
      "content": "Run towards the center of the court to get a ball when the game starts. When it is time for the game to begin, shout “go!” or blow a whistle. All of the players can run to the center of the court and try to get a ball when they hear this signal. [8] X Research source If you are not very fast, then you might want to stay near the outskirts and save your energy for evading balls."
    },
    {
      "title": "Throw the ball at other players to get them out.",
      "content": "Throw the ball at other players to get them out. Make sure not to aim at another player’s head! Aim the balls below the waist. Also, never throw the ball at other players when they’re down, and don’t throw the ball too hard! When you get a ball in your hands, throw it at another player right away to try to get them out. [9] X Research source Remember, there are no teams in survivor dodgeball, so you may throw the ball at anyone on the court. If the ball hits the person, then they are out. If they dodge the ball, then they can pick it up and try to throw it back at you, so be ready to run!"
    },
    {
      "title": "Keep playing until only 1 player remains.",
      "content": "Keep playing until only 1 player remains. As players get hit by balls, they will have to leave the court and sit or stand on the sidelines. The last person standing is the winner of survivor dodgeball, so keep playing until there is just 1 person left on the court. [10] X Research source To keep everyone in the game to the end, you can have players who have been tagged outwear a special jersey or flag. These players can continue to pick up balls and throw them at players who are still in, but these players will not be able to win the game."
    }
  ]
}