{
  "url": "https://www.wikihow.com/Reduce-TSH-Levels",
  "title": "How to Reduce TSH Levels",
  "steps": [
    {
      "title": "Maintain a diet rich in Vitamin B and iodine.",
      "content": "Maintain a diet rich in Vitamin B and iodine. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Have a diet rich in healthy sources of protein like tofu, chicken, and beans as well as Vitamin B rich foods like whole grains, nuts, and seeds. Add a good balance of fruits and vegetables to your diet, specifically sea vegetables, as they are rich in iodine. Foods high in natural iodine are good for your thyroid. [3] X Research source You could try having sea vegetables like kelp, nori, and kombu at least once a day. Sprinkle kelp over your salads or soups for added iodine. Add kombu to your beans or meat. Wrap foods in nori. Add nuts and seeds to stir fries, quinoa, and salads."
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. [4] X Expert Source Damaris Vega, MD Board Certified Endocrinologist Expert Interview. 11 November 2020. Daily physical activity is associated with lower thyroid hormone levels as well as reduced inflammation and a stronger immune system. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Exercise can also help boost your metabolism and counteract some of the side effects of an underactive thyroid, such as fatigue, depression and weight gain. Go for regular runs or bike rides, or join a gym and take workout classes. Make it a habit to be active for at least 30 minutes a day. You can also try taking a yoga class to help you stay active and to reduce your stress levels. Look for yoga classes at your local gym or yoga studio."
    },
    {
      "title": "Get enough Vitamin D every day.",
      "content": "Get enough Vitamin D every day. Aim to get at least 20 to 30 minutes of sun exposure in the early morning or the evening. Expose your arms, legs, and face to the sun. Low vitamin D levels have been found to be associated with hypothyroidism. Bringing those levels up may improve your symptoms of hypothyroidism. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you live in an area that gets very little direct sunlight, especially during the winter months, speak to your doctor about taking Vitamin D supplements. Most people typically receive enough vitamin D from sunlight from April through September, with levels dropping from October through March. Dietary sources of vitamin D include oily fish (like salmon or herring), red meat, liver, egg yolks, and fortified foods (like some cereals). [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Reduce stress and anxiety.",
      "content": "Reduce stress and anxiety. Keep your stress and anxiety levels low to avoid agitating your thyroid. Do relaxing activities like painting, drawing, and knitting. Try doing a hobby you enjoy to release stress and anxiety. Working out can also be a good way to reduce your stress levels. [8] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source You can also do deep breathing exercises to help reduce your stress levels or take a weekly yoga class. While reduced stress may help lower your TSH levels and improve thyroid function, most research on this correlation has been conducted on rats. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source More human testing is needed to confirm the efficacy of reduced stress on TSH levels."
    },
    {
      "title": "Have your TSH levels tested.",
      "content": "Have your TSH levels tested. If you are exhibiting some of the effects of hypothyroidism, such as constipation, hoarseness, and fatigue, go to the doctor to discover for sure whether or not you have hypothyroidism. At the appointment, your doctor will do a blood test to find out if your thyroid is underactive. [10] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Ask your doctor for a prescription for thyroid medication.",
      "content": "Ask your doctor for a prescription for thyroid medication. The most reliable way to lower your TSH levels due to hypothyroidism is to take a synthetic thyroid hormone called levothyroxine. [11] X Expert Source Damaris Vega, MD Board Certified Endocrinologist Expert Interview. 11 November 2020. This drug is available by prescription from your doctor. It is an oral medication that restores your hormone levels and reverses the symptoms of hypothyroidism. You will need to take it once a day, typically 30–60 minutes before breakfast on an empty stomach. [12] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Once you begin taking medication, your symptoms should start to improve within 3–5 days. The medication should be fully effective in 4–6 weeks. [13] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Always follow your doctor's instructions on dosage. Never take more than the recommended dose of the medication. Thyroid medication must be taken for life to maintain lower TSH levels, but luckily, it is relatively inexpensive. Your doctor will break down the exact costs for the medication."
    },
    {
      "title": "Learn the side effects of the medication.",
      "content": "Learn the side effects of the medication. If you have a dose that is too high and you get an excessive amount of the thyroid hormone, you can experience side effects. Your doctor may need to adjust your dosage to fit your body's needs. You may also be prescribed a specific medication that your body doesn't respond well to. Get emergency medical help if you have signs of an allergic reaction to levothyroxine including hives, difficulty breathing, and/or swelling of your face, lips, tongue, or throat. [14] X Research source Contact your doctor immediately if you experience any of the following symptoms: [15] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Fast or irregular heart rate Chest pain and/or difficulty breathing Fever, hot flashes, and/or excessive sweating Feeling unusually cold Weakness, tiredness, and/or sleep problems Memory problems, feeling depressed, or feeling irritable Muscle aches Dryness of skin, dryness of hair, or hair loss Changes in your menstrual periods Vomiting, diarrhea, appetite changes, and/or weight changes [16] X Research source"
    },
    {
      "title": "Do not take certain supplements at the same time as the medication.",
      "content": "Do not take certain supplements at the same time as the medication. Iron, calcium, and fiber supplements can affect your body's ability to absorb the medication, as well as proton pump inhibitors (like Prilosec or Prevacid), soy products, and multivitamins containing minerals. Wait 3–4 hours after taking your medication to have these supplements. [17] X Research source You should also avoid having medications that contain cholestyramine and aluminum hydroxide. [18] X Research source Speak to your doctor if you are on other medications or supplements before you take thyroid medication. [19] X Expert Source Damaris Vega, MD Board Certified Endocrinologist Expert Interview. 11 November 2020. Generally, thyroid medication is most effective when taken on an empty stomach about 30 minutes before eating."
    },
    {
      "title": "Try “natural” thyroid medications with caution.",
      "content": "Try “natural” thyroid medications with caution. “Natural” thyroid replacement medication comes from animal thyroids, usually pigs. You can buy it online as a food supplement. However, the medication is not purified and not regulated by the Food and Drug Administration (FDA). Avoid buying or taking any “natural” thyroid medication that is not prescribed or recommended by your doctor. [20] X Research source You can be prescribed these “natural” alternative medication options in either extract or desiccated form. If you're interested in learning more, ask your doctor about Armour Thyroid, a natural thyroid extract that is available by prescription. [21] X Research source"
    },
    {
      "title": "Monitor your progress on the medication.",
      "content": "Monitor your progress on the medication. Have regular check ins with your doctor to confirm your TSH levels are going down with the help of the medication. In some cases, your doctor may adjust your dosage after two to three months to ensure your body is getting enough of the hormone. [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source After one to two months on the medication at the correct dose, your symptoms should improve and you should feel less tired. Your eating habits and weight should also improve. Typically, your doctor will retest your TSH levels after 6–8 weeks of using levothyroxine or another medication and adjust your dosage if needed."
    },
    {
      "title": "Get your TSH levels tested every 6–12 months.",
      "content": "Get your TSH levels tested every 6–12 months. [23] X Expert Source Damaris Vega, MD Board Certified Endocrinologist Expert Interview. 11 November 2020. Arrange for an annual test with your doctor to ensure your TSH levels are where they should be. Your doctor should test your levels at least once a year to confirm the medication is working. Generally, you’ll get tested every 4–6 months when first starting the medication before transitioning to annual testing. [24] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You may need to get your levels tested more frequently if you're on a new dose of levothyroxine, you’re pregnant, or you show symptoms of incorrect dosage. [25] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Taking thyroid hormone replacement medication is a lifelong requirement for people with hypothyroidism. Do not stop taking your medication if you start to feel better, as your symptoms will likely return."
    }
  ]
}