{
  "url": "https://www.wikihow.com/Plant-an-Amazon-Sword-Plant",
  "title": "How to Plant an Amazon Sword Plant",
  "steps": [
    {
      "title": "Make sure the water’s pH is between 6.5 and 7.5.",
      "content": "Make sure the water’s pH is between 6.5 and 7.5. Most tap or well water will usually fall within this pH range, but you should still test it before adding Amazon Sword plants to your aquarium. You can buy pH testing kits specifically for aquariums from your local pet store (though they can also be purchased online). Controlling an aquarium’s pH level is done through the use of alkaline buffers, which increase water’s pH level, and acid buffers which lower it. To reach and maintain a pH level in the 6.5 to 7.5 range, you’ll likely need to use a combination of these products. Always follow the product’s instructions to safely control your aquarium’s pH level."
    },
    {
      "title": "Regulate the aquarium’s temperature.",
      "content": "Regulate the aquarium’s temperature. For optimal growth, the water’s temperature should stay between 72 and 82 degrees Fahrenheit (22 to 28 Celsius). Use a thermometer to check the tank’s temperature regularly and adjust accordingly. If the water is too cold, install an aquarium heater. The wattage you need will depend on your aquarium’s size, with 100 watts being suited for 20 gallon tanks, 175 watts for 55 gallon tanks and 300 watts for 100 gallon tanks. To cool an aquarium in hotter seasons, you can replace the glass top with a screen, and position a fan so it blows across the water. If the water is too warm for an extended period, you should consider getting a chiller, which will help cool the water. [1] X Research source"
    },
    {
      "title": "Give your aquarium 10-12 hours of light a day.",
      "content": "Give your aquarium 10-12 hours of light a day. While Amazon Swords can tolerate various light intensities, you’ll want to keep them in low to medium lighting conditions. Too much light might cause leaf burn, making your plant more likely to start wilting. Make sure to keep the lights on for a good chunk of the day to promote growth. [2] X Research source"
    },
    {
      "title": "Provide nutrient-rich soil for your plant.",
      "content": "Provide nutrient-rich soil for your plant. Amazon Sword plants need nutrient-rich soil, especially rich in iron, in order to thrive. If you need to add soil (also called substrate) to your aquarium tank without removing everything, you can use a PVC pipe, two inches in diameter (5 cm) to deliver the substrate. Gently push the pipe into your existing soil to create a seal, then pour your substrate through. Lift the PVC pipe slightly to spread it around the bottom of the tank. When you plant your sword plant, add a root tab for some extra nutrients. Alternatively, you can use a liquid plant food appropriate for aquariums. [3] X Research source If needed, you can also transfer your fish and uproot any plants in your tank to change your soil. You shouldn’t need to remove the water from the tank to do this. [4] X Research source"
    },
    {
      "title": "Push the plant deep into your soil.",
      "content": "Push the plant deep into your soil. Scoop out a small hole, wide enough to cover the Amazon Sword’s root bundle. The hole should be high enough that the plant’s crown (where the roots meet the stem) is just at the soil line. Set the plant in the hole and scoop the dirt back onto the roots. It’s important that you pack the dirt tightly around the roots to prevent the plant from floating up. Make sure not to cover the plant’s crown, as you bury the roots. [5] X Research source"
    },
    {
      "title": "Arrange Amazon Swords in the background of your tank.",
      "content": "Arrange Amazon Swords in the background of your tank. Amazon Swords can grow quite large, so you want to avoid placing them near the middle or the front of your aquarium. Not only will they obscure your view of the tank, but they can overtake other plants and even block out the tank’s lights. [6] X Research source"
    },
    {
      "title": "Trim the plant to control growth.",
      "content": "Trim the plant to control growth. Amazon Sword plants can grow to be up to 20 inches in height, and will grow long running stalks that spread into new plants. If you don’t have a particularly large tank, it’s even more important to prune the plant effectively. Prune it away from the light sources, which it tends to snuff out, and keep it from spreading too wildly around the tank. It’s best to use shears for this. [7] X Research source"
    },
    {
      "title": "Remove dead leaves.",
      "content": "Remove dead leaves. Wilting Amazon Sword leaves won’t heal or regain their green sheen. Once you notice leaves that have turned transparent, brown or are wilting, you should pluck them from the main plant. You can use shears to trim them off, but you can also just pull them off with your hands. Grab the leaf as close to the stem as possible, and pull upwards. Dead leaves should come off without using too much pressure. [8] X Research source"
    },
    {
      "title": "Watch the plant for algae.",
      "content": "Watch the plant for algae. Aquariums are complex ecosystems, and any number of factors might cause algae to start growing on your Amazon Swords. If this starts to happen, use a microfiber cloth to wipe off the algae regularly. If the situation doesn’t resolve itself after a few days, it might be caused by a nutrient imbalance in the tank, overfeeding or improperly maintained filters."
    }
  ]
}