{
  "url": "https://www.wikihow.com/Open-XML",
  "title": "How to Open XML",
  "steps": [
    {
      "title": "Find the XML file you want to open.",
      "content": "Find the XML file you want to open. XML files are encoded in plaintext, so you can open them in any text editor and be able to clearly read it. [1] X Research source"
    },
    {
      "title": "Right-click the XML file and select \"Open With.\"",
      "content": "Right-click the XML file and select \"Open With.\" This will display a list of programs to open the file in."
    },
    {
      "title": "Select \"Notepad\" (Windows) or \"TextEdit\" (Mac).",
      "content": "Select \" Notepad \" (Windows) or \"TextEdit\" (Mac). These are the pre-installed text editors for each operating system and should already be on the list. Any basic text editors will work. [2] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 24 February 2021. If they aren't on the list, you'll need to browse for them. Notepad is located at %SystemRoot%\\system32\\notepad.exe , and TextEdit can be found in your Applications folder. You can use more advanced code editors like Notepad++ or TextMate as well, which can be useful for syntax highlighting and advanced editing. You can still see all of the information using a simple text editor. [3] X Research source"
    },
    {
      "title": "Interpret the text on the screen.",
      "content": "Interpret the text on the screen. Your XML file will open in your text editor. The complexity of the file is dependent on what it was created for. Use the tag labels to find the information you are looking for. Generally the labels will be fairly self-explanatory, allowing you to browse through the data and find the information you need. You'll likely see <?xml version=\"1.0\" encoding=\"UTF-8\"?> at the top. This indicates that the following content is in XML format. XML uses custom tags to house pieces of data. Each of these tags are created for whatever program is using it, so there is no common syntax to the markup labels. For example, one XML file may have a <body></body> section, and other might have <message_body></message_body> , but both may function similarly. Tags can be nested inside other tags, creating a tree. For example, each <note></note> tag may have several tags inside, such as <title></title> and <date></date> ."
    },
    {
      "title": "Find the XML file you want to open.",
      "content": "Find the XML file you want to open. While you can use any basic text editor to open an XML file (see above), opening the file in a browser may make it a little easier to navigate. This is because most browsers automatically indent nested tags and allow you to collapse each section of the XML tree."
    },
    {
      "title": "Right-click the file and select \"Open With.\"",
      "content": "Right-click the file and select \"Open With.\" This will let you choose the program you want to use to open the file. [4] X Research source"
    },
    {
      "title": "Select a web browser from the list of programs.",
      "content": "Select a web browser from the list of programs. You can open the XML file in any web browser. Oftentimes, your web browser will already be on the list of suggested programs. If it isn't, you'll need to browse for it on your computer. [5] X Research source"
    },
    {
      "title": "Read the XML file in your browser.",
      "content": "Read the XML file in your browser. The XML file will open in a new tab in your browser. All of the contents will be displayed, and your browser will automatically indent nested tags. This can make it easier to tell which data belongs to which set. [6] X Research source"
    },
    {
      "title": "Expand or minimize sections for easier reading.",
      "content": "Expand or minimize sections for easier reading. The big advantage to using a browser to read XML files is the ability to control what you see. Click the arrows or +/- buttons next to each section to expand or minimize it."
    },
    {
      "title": "Open Excel.",
      "content": "Open Excel . Excel will not usually pop up as a suggested program, so the quickest way to open the file is to open Excel first. Excel can convert an XML file into a table, which can be useful for visually processing the information."
    },
    {
      "title": "Click \"File\" and select \"Open.\"",
      "content": "Click \"File\" and select \"Open.\" This will display the Open menu."
    },
    {
      "title": "Click the \"Browse\" button.",
      "content": "Click the \"Browse\" button. This will let you look for files on your computer."
    },
    {
      "title": "Open the XML file on your computer.",
      "content": "Open the XML file on your computer. You should be able to navigate to it and see it by default, but if you can't, click the \"Type\" menu and select \"XML Files.\""
    },
    {
      "title": "Select \"As an XML table.\"",
      "content": "Select \"As an XML table.\" This will convert the XML file into an Excel table. You will generally be informed that the XML file does not refer to a schema. Click \"OK\" to have Excel construct one for you based on the tags in the file."
    },
    {
      "title": "Read your XML file.",
      "content": "Read your XML file. Your XML file will be organized into a table based on the tag structure. You can use Excels sorting and filtering tools to customize the table from here. [7] X Research source You may have difficulties rendering complex XML files as tables. [8] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If your XML file has lots of nested tags, you may want to use an XML viewer instead."
    },
    {
      "title": "Download an XML viewer program.",
      "content": "Download an XML viewer program. If you deal with lots of XML files, you may want to get a viewer or XML editor. These can make handling complex XML files much easier. There are a variety of programs available, both free and paid. A popular free, open-source reader is XML Explorer ( https://xmlexplorer.github.io/ ). Different programs will fit different needs. If you need to create a lot of XML files, you may want a professional XML editor. These allow you to automate and collaborate on large XML projects."
    },
    {
      "title": "Open the XML file in your new program.",
      "content": "Open the XML file in your new program. Many XML programs will set themselves as the default program for XML files, allowing you to simply double-click the XML file to open it. If you can't, right-click the XML file and select \"Open With.\" Browse for your newly-installed program."
    },
    {
      "title": "Read your XML.",
      "content": "Read your XML. Programs like XML Explorer allow you to collapse sections, as well as turn syntax highlighting on and off. More advanced programs may allow you to make edits and create additional entries."
    }
  ]
}