{
  "url": "https://www.wikihow.com/Restart-Your-Computer-Using-the-Keyboard",
  "title": "How to Restart Your Computer Using the Keyboard",
  "steps": [
    {
      "title": "Press and hold the Alt key.",
      "content": "Press and hold the Alt key. You can use the Alt key that's on the left or right side of your keyboard."
    },
    {
      "title": "Press and hold the F4 key.",
      "content": "Press and hold the F4 key. You'll see a row of F keys at the top of your keyboard. This key combination will close any active applications and windows, including any browser windows you have open. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Depending on some laptop models, you may need to press and hold the Fn key to use function keys ( Fn + Alt + F4 )."
    },
    {
      "title": "Repeat the above process to close all applications.",
      "content": "Repeat the above process to close all applications . Press Alt + F4 until every browser and application is closed. [2] X Research source"
    },
    {
      "title": "Select \"Restart\" and press ↵ Enter.",
      "content": "Select \"Restart\" and press ↵ Enter . Using the directional arrow keys on your keyboard, select \"Restart\" from the drop-down menu if it isn't already selected. This window will appear only if all the applications and windows are closed on your computer. After you've selected this, your computer will restart without the use of your mouse. [3] X Research source"
    },
    {
      "title": "Use different key shortcuts to restart (if the previous steps did not work for you).",
      "content": "Use different key shortcuts to restart (if the previous steps did not work for you). Press ⊞ Win + X then use your arrow keys to select Shut down or sign out and press Enter . Then, using the arrow keys, navigate to Restart and press Enter ."
    },
    {
      "title": "Press and hold the Ctrl key.",
      "content": "Press and hold the Ctrl key. You can use the Ctrl key on either side of your Space bar. [4] X Research source"
    },
    {
      "title": "Press and hold the Power button (without a Touch ID sensor) or the Media Eject button (with a Touch ID sensor).",
      "content": "Press and hold the Power button (without a Touch ID sensor) or the Media Eject button (with a Touch ID sensor). A dialogue will pop up, asking if you want to restart, sleep, or shut down . Use your keyboard arrow keys to select \"Restart\" and press Return . [5] X Research source If you have a Touch ID sensor, pressing the Power button won't work."
    },
    {
      "title": "Use another keyboard shortcut.",
      "content": "Use another keyboard shortcut. Press Ctrl + ⌘ Command + Power or Ctrl + ⌘ Cmd + Eject Media to force your Mac to restart. [6] X Research source"
    }
  ]
}