{
  "url": "https://www.wikihow.com/Read-in-a-Moving-Vehicle",
  "title": "How to Read in a Moving Vehicle",
  "steps": [
    {
      "title": "Find a quiet space to read.",
      "content": "Find a quiet space to read. If you are on in vehicle with a lot of space, like a train or a boat, find a spot that has minimal distractions. In a smaller vehicle, like a plane or a bus, it may be hard to move around. Try looking for empty seats in the back of the plane or the bus."
    },
    {
      "title": "Get comfortable.",
      "content": "Get comfortable. Your position is very important for reading in a vehicle where your space might be limited. Adjust your seat so that you have enough legroom. If possible, try leaning against the car door or leaning on the seat next to you. Uncomfortable positions can really hinder your reading. If you're in a position that's causing you pain, you may be more likely to feel nauseated when reading in a car."
    },
    {
      "title": "Rest your book against something.",
      "content": "Rest your book against something. Hold your book firmly. Lean it against the window or car door. Also try resting it in your lap or on the seat next to you."
    },
    {
      "title": "Have some food and water with you.",
      "content": "Have some food and water with you. It's important to stay hydrated when taking a long journey. If you aren't getting enough water, you could easily become nauseated or dizzy very quickly. If this happens, take a sip. Food can also help to settle your stomach and help you get comfortable again. Bring light snacks. Heavy foods can lead to nausea. Bring snacks that don’t irritate your digestive system. Apples, pretzels, and carrots are examples of light snacks to take on your trip."
    },
    {
      "title": "Know when to stop.",
      "content": "Know when to stop. Reading in a moving vehicle can be challenging for several reasons. Bumps in the road, turbulence, background noise, and other distractions may make reading impossible. You may want to take a break until things calm down. Don't push yourself. If you're getting a headache or you can't understand what you're reading, take some time off from the book. There's no point to reading if you aren’t understanding the material."
    },
    {
      "title": "Slouch in your seat and hold the book at eye level.",
      "content": "Slouch in your seat and hold the book at eye level. Sit down low in your seat. Hold the book to your eye level and begin reading. Keep your line of sight toward the book at the same level as your line of sight out of the window. Looking downward while your side vision registers movement from outside the window causes symptoms of motion sickness. Keep your head up and your lines of vision on an equal plane. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Cover your peripheral vision.",
      "content": "Cover your peripheral vision. Avoid developing motion sickness by blocking the side vision entirely. Use your hand or a window curtain to do this. If you are on a ship, go beneath the deck and move toward the center where you are likely to experience the least amount of movement. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Turn your back to the window.",
      "content": "Turn your back to the window. Pivot your body so that your back is to the window closest to you. This will stop your eyes from seeing movement in your peripheral vision. [4] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "Sit in an area with the least amount of movement.",
      "content": "Sit in an area with the least amount of movement. Cars don’t have many seating options, but larger vehicles like buses, boats, and planes do. When reading on a boat or plane, find a place to sit where you won’t feel the motion of the vehicle. On a boat, sit in the lower cabins near the center. On a plane, sit close to the wings. If you’re on the bus, avoid sitting in the back where you’ll feel more bumps and have less access to fresh air."
    },
    {
      "title": "Read at night.",
      "content": "Read at night. When it is dark outside it is much harder to see out of the windows. If you can’t see out of the window, you are less likely to get motion sickness. Bring a flashlight or book light to only light up the words on the page."
    },
    {
      "title": "Be careful about what you eat.",
      "content": "Be careful about what you eat. Avoid getting in a moving vehicle when your stomach is too empty or too full. Do not consume a lot of alcohol, fatty foods, or foods that tend to irritate your stomach."
    },
    {
      "title": "Be strategic about where you sit.",
      "content": "Be strategic about where you sit. People who suffer from motion sickness often find a place to sit where they can see what is going on around them. This is usually in the front of the vehicle with eyes facing forward and enjoying the view. [5] X Research source In a car, sit in the front seat, face forward, and avoid altering your gaze too much. On a boat, sit as close to the front as possible. It might be bumpy, but having full view of the scene ahead often keeps motion sickness at bay. When riding on a train, sit so that you are facing in the direction that the train is going. That way you won’t see any backward motion when the train starts moving."
    },
    {
      "title": "Breathe and get fresh air.",
      "content": "Breathe and get fresh air. Breathe slowly and deeply to help calm your stomach. If possible, move to place where you can get some fresh air. [6] X Research source If you’re in a car, open the windows and take slow, deep breaths. If you’re on a ship, move to the outdoor areas. On a train it may be harder to get fresh air if you’re underground. If possible, open windows when you are above ground. It it is safe, move to the space between the cars where there are fewer people and more breathing room. On an airplane, try getting up for a walk. On big planes there is often space in the back where the food is kept. It tends to be less stuffy back there since there are fewer people."
    },
    {
      "title": "Close your eyes.",
      "content": "Close your eyes. Lean back and close your eyes. Closing your eyes will shut out the movement and give your body a rest from all the sensory input. Try to relax and get some sleep."
    },
    {
      "title": "Use acupressure bands.",
      "content": "Use acupressure bands. Acupressure wristbands can be worn while on a long journey that might result in motion sickness. They put pressure on the inner point on your wrist to stop uncomfortable sensations of motion sickness. [7] X Research source Bracelets can be purchased at drugstores and online. You can also make a bracelet or use your fingers to ease nausea."
    },
    {
      "title": "Eat ginger.",
      "content": "Eat ginger. Though its efficacy is still debated, ginger has been found in some studies to be effective against nausea and vomiting. If you tend to feel nauseated while in the moving vehicle, try chewing on a piece of a raw ginger or sucking on a ginger candy. [8] X Research source"
    },
    {
      "title": "Take medication.",
      "content": "Take medication. Several medications are available to ease the discomfort of motion sickness. Try taking Dramamine or Meclizine 30 to 60 minutes before you expect to experience sickness. Use medication as a last resort. Side effects of Dramamine include drowsiness, constipation, blurred vision and dry throat, nose, or mouth. Contact a doctor if you experience confusion, rapid heartbeat, or a tremor. [9] X Research source A common side effect of Meclizine is drowsiness. More serious side effects include coughing, difficulty swallowing, and skin irritation like a rash, hives, or swelling. Contact a doctor if you experience serious side effects. [10] X Research source"
    },
    {
      "title": "Take breaks from the vehicle.",
      "content": "Take breaks from the vehicle. If possible, take breaks from your ride in the moving vehicle. If you are on a long car ride, stop and take a short break to stretch your legs, take in some fresh air, and drink some cold water. Long train rides and bus rides also sometimes allow opportunities for short breaks. Take advantage of any stops, and put your feet on solid ground for few minutes. [11] X Research source"
    }
  ]
}