{
  "url": "https://www.wikihow.com/Read-the-Defense-As-a-Quarterback",
  "title": "How to Read the Defense As a Quarterback",
  "steps": [
    {
      "title": "Look at the safeties.",
      "content": "Look at the safeties. If they are deep, run the ball,or throw a quick pass. If they are not, play-action to look like you are going to run the ball. Look for the safeties to be in a zone, unless it's a blitz, when they will most likely be in man. [1] X Research source"
    },
    {
      "title": "Look for a zone defense.",
      "content": "Look for a zone defense. The safeties will be playing close to the middle. If you see the safeties and cornerbacks freeze in coverage, attack the space between them. [2] X Research source"
    },
    {
      "title": "Check for holes.",
      "content": "Check for holes. This is the most important thing to look for. If a receiver is not going to be in a hole, change the route."
    },
    {
      "title": "Look for a blitz.",
      "content": "Look for a blitz. If the linebackers or safeties are cheating toward the line at all, be ready to dump the ball off. Remember that linebackers might try to sack you. If you see a linebacker that looks like they will blitz, let the linemen know by saying something like this: Cover him! or Get this guy! so that they can keep them away from you. [3] X Research source"
    },
    {
      "title": "Be familiar with the opponent's defensive tendencies.",
      "content": "Be familiar with the opponent's defensive tendencies. Know what to expect in each game. You need to be able to recognize cover-1, 2, 3, and 4. [4] X Research source"
    },
    {
      "title": "Know the type of defense the opponent is running.",
      "content": "Know the type of defense the opponent is running. The two typical defense you will see are 4-3 and 3-4. 4-3 consists of 4 defensive lineman and 3 linebackers. 3-4 consists of 3 defensive lineman and 4 linebackers."
    },
    {
      "title": "Know the weak areas, the hard-to-cover spots.",
      "content": "Know the weak areas, the hard-to-cover spots. Know the zones of the field that are easiest to exploit for each specific type of coverage."
    },
    {
      "title": "Recognize which defenders are cheating or overcompensating.",
      "content": "Recognize which defenders are cheating or overcompensating. For example, a safety in cover-2 is creeping up and jumping the 15-yd quick post. A QB must recognize this and make the safety pay by pump-faking and then airing the ball out for the double-move fly route. This requires great focus."
    },
    {
      "title": "Look at how loose or tight the corners are playing.",
      "content": "Look at how loose or tight the corners are playing. If they are keeping a cushion, you need to make the quick throw such as a WR screen, quick out, curl, stop, or slant. If they are playing tight bump-and-run, you need to look to the fly, corner, fade, deep post, or deep out."
    },
    {
      "title": "Recognize mismatches.",
      "content": "Recognize mismatches. If you are lucky enough to have a standout wide receiver, there will be times when the defense gets locked into a mismatch. You must instantly recognize it, seeing when a poor defender is on that receiver, and exploit it by going to that receiver. Get the ball in his hands and let him go to work."
    },
    {
      "title": "Pay attention to game film.",
      "content": "Pay attention to game film. If you're going to be able to read a defense like a book, you first need to understand the language the book is written in. Watch the film carefully and pay attention to the body language of each and every defender before each and every play. Look for patterns, and when you actually get on the field, you'll know exactly what's coming. You can also play realistic video games such as Madden NFL 16. That can help you read a defense and get game-time experience outside of practice."
    },
    {
      "title": "Do most of your work before the snap.",
      "content": "Do most of your work before the snap. You won't have very much time to read the defense after the snap. After the snap glance to make sure the defense wasn't disguising the coverage, and then make the throw that you know will be open."
    },
    {
      "title": "Read during the pre-snap.",
      "content": "Read during the pre-snap. If the safeties are next to each other while the corners are tight on their receivers, the safeties are going to be in cover two while the corners will play man. If a safety lines up on the tight end, all the defensive backs are playing man."
    },
    {
      "title": "After the snap, do not keep your eyes on one spot.",
      "content": "After the snap, do not keep your eyes on one spot. During your drop-back, remember the location of the routes. The defense has the ability to follow your eyes."
    },
    {
      "title": "Read the defense in layers.",
      "content": "Read the defense in layers. Safeties, linebackers, D-line. Read what coverage the safeties are running, which will tell you what all the DBs are doing. Then the LBs: if one is missing, find the receiver in that hole. Then look at the D-line to find out where the first pressure will come from."
    }
  ]
}