{
  "url": "https://www.wikihow.com/Remove-Clogged-Pores-Under-Your-Eyes",
  "title": "How to Remove Clogged Pores Under Your Eyes",
  "steps": [
    {
      "title": "Exfoliate if you want to slough away dead skin cells under your eyes.",
      "content": "Exfoliate if you want to slough away dead skin cells under your eyes. You can purchase an exfoliating scrub at your local drug store or make your own natural scrub . Exfoliants work by using small granules to remove dead cells from your skin, and leave your skin feeling smooth and healthy. [1] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Dab a bit of the scrub onto your fingertips and gently massage it into your face using small, circular motions. Pay special attention to the area under your eyes, but take care not to apply too much pressure—the skin there is very delicate and can easily be damaged. Rinse your face with warm water and pat it dry. If you don’t like the feeling of the granules, try carefully dry brushing under your eyes with a long-bristled brush."
    },
    {
      "title": "Use an alpha hydroxy wash if you want to dissolve the dead skin cells.",
      "content": "Use an alpha hydroxy wash if you want to dissolve the dead skin cells. Washing with a facial cleanser containing alpha hydroxy acid is a great option for those who find exfoliating too uncomfortable or irritating to the skin. The alpha hydroxy acid works as a chemical exfoliant rather than a mechanical one (like a scrub). [2] X Research source Rub a squirt of the cleanser and warm water between your hands to create a lather. Gently massage the lather onto your face for about 1 minute. Try to spend some extra time on the area under your eyes, but be careful not to get the cleanser inside of them. Rinse your face with warm water and pat it dry with a clean towel."
    },
    {
      "title": "Apply anti-acne moisturizer under your eyes after removing dead cells.",
      "content": "Apply anti-acne moisturizer under your eyes after removing dead cells. Look for ingredients like benzoyl peroxide and adapalene, which are less likely to cause any negative skin reactions. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Make sure that moisturizer is marketed with a label like “non-comedogenic,” “oil-free,” or “won’t clog pores.” [4] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Dab a small amount of the moisturizer onto your fingertips and gently massage it into the skin under your eyes. Take care not to get the moisturizer inside of your eyes. Use this moisturizer sparingly and only apply it to the affected area to avoid over-drying. Avoid using moisturizers under your eye area that contain salicylic acid because this may irritate your eyes."
    },
    {
      "title": "Wash your face with a mild cleanser to remove makeup, dirt, and oil.",
      "content": "Wash your face with a mild cleanser to remove makeup, dirt, and oil. Splash your face with warm water to help create a good lather. Add a dollop of facial cleanser to your fingertips and gently massage the cleanser onto your face using circular motions. Pay special attention to the area under your eyes and be sure to remove all traces of makeup and dirt. [5] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If your facial cleanser doesn’t seem to remove all of your makeup, try using makeup remover wipes or a face wash specially formulated for removing makeup. It’s best to use your hands when washing your face because wash cloths and sponges can irritate the skin. The delicate skin around your eyelids is especially prone to irritation. After washing, thoroughly rinse your face with warm water and pat it dry with a clean towel."
    },
    {
      "title": "Fill a pot with water and heat it to steaming on the stove.",
      "content": "Fill a pot with water and heat it to steaming on the stove. After filling the pot with water, place the lid on top and set it on the stove. Heat the water over medium-high heat until it begins to simmer and produce steam. Then remove the pot from the heat. Make sure that the water isn’t boiling! [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Pour the water into a heat-safe bowl and place it on a level surface.",
      "content": "Pour the water into a heat-safe bowl and place it on a level surface. Use a large ceramic or glass bowl for the water. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For extra pampering, add a handful of fresh or dried herbs, or 5 drops of essential oils like peppermint, green tea, or chamomile to the water. [8] X Research source If you have acne-prone skin, try adding a couple drops of tea tree oil. If your skin is dry, try adding rose, lavender, or borage. Make sure to clear the area of clutter. You will need to have enough space to lean yourself and a large towel over the bowl."
    },
    {
      "title": "Drape a towel over your head and lean over the bowl of steaming water.",
      "content": "Drape a towel over your head and lean over the bowl of steaming water. Cover your entire head, neck, and shoulders with the towel. The edges of the towel should be surrounding the bowl so that it creates a tent. Hold your face a safe distance above the bowl. You should be able to feel the steam hitting your face, but it shouldn’t be too hot or uncomfortable. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Continue steaming your face for 5-10 minutes. Avoid over-steaming. Too much steam can cause excessive drying, which can stimulate more oil production and lead to more clogged pores. Many people think that the steam works to open up your pores. This is a myth. The steam works to loosen debris, making cleansing and exfoliating more effective."
    },
    {
      "title": "Wash your face regularly with a mild facial cleanser.",
      "content": "Wash your face regularly with a mild facial cleanser. Washing your face at nighttime before you go to bed is the best time to wash your face to remove makeup, dirt, and oil that has built up throughout the day. [10] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Massage a dollop of cleanser and warm water onto your face, paying special attention to under your eyes. Always use gentle face cleansers that are non-abrasive to your skin. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Consider using makeup remover wipes before washing your face, or a wash specially made for removing makeup, if you regular facial cleanser still leaves behind traces of makeup."
    },
    {
      "title": "Exfoliate your face 1-2 times per week to keep your skin healthy.",
      "content": "Exfoliate your face 1-2 times per week to keep your skin healthy. Regular exfoliation can help prevent acne, reduce wrinkles, and shrink your pores—leaving them less likely to clog. Some dermatologists recommend chemical exfoliants, which are easier on your skin. [12] X Research source Be careful when exfoliating under your eyes so that you don’t damage the delicate skin in that area."
    },
    {
      "title": "Change your pillowcase once per week.",
      "content": "Change your pillowcase once per week. Your pores may be getting clogged due to the oil and dirt on your pillowcase. Changing your pillowcase once per week may help to reduce the amount of oil and dirt that gets onto your eyelids while you sleep. [13] X Research source Make sure to use a hypoallergenic detergent to wash your pillowcase. You might also consider switching to a silk or high-quality satin pillowcase since these do not hold onto as much dirt and oil as some other pillowcase fabrics do. [14] X Research source"
    },
    {
      "title": "Avoid switching out your facial care products too often.",
      "content": "Avoid switching out your facial care products too often. Frequently changing your skin care products may also be a cause of clogged pores and breakouts. Stick with the facial cleanser and moisturizer that work best for you and avoid trying new ones too often. [15] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you think that your current skin care products might be to blame, then it is okay to try something new. Just make sure that you don’t switch back and forth. For acne treatments specifically, stick with them for 6-8 weeks before you switch. It takes a bit of time for these products to start working. [16] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "See a dermatologist if you have white, raised bumps under your eyes.",
      "content": "See a dermatologist if you have white, raised bumps under your eyes. These bumps may be milia, which are caused by dead skin cells becoming trapped under the surface of the skin. The milia are often mistaken for clogged pores, but the skin actually needs to be lanced for treatment. [17] X Expert Source Heather Richmond, MD Board Certified Dermatologist Expert Interview. 15 September 2020. While there are home treatments for removing milia found on other areas of your face, it should never be done around your eyes. Rubbing your eyes less can often prevent milia from forming. [18] X Expert Source Heather Richmond, MD Board Certified Dermatologist Expert Interview. 15 September 2020. If extraction isn't effective, your doctor may also prescribe a retinol to prevent milia from forming. [19] X Expert Source Heather Richmond, MD Board Certified Dermatologist Expert Interview. 15 September 2020."
    }
  ]
}