{
  "url": "https://www.wikihow.com/Set-Up-an-Axolotl-Tank",
  "title": "How to Set Up an Axolotl Tank",
  "steps": [
    {
      "title": "Find a suitable tank.",
      "content": "Find a suitable tank. Axolotls need plenty of room to grow, as they generally reach a foot long in length. A 20 gallon long is your best option if your axolotl is a baby in 1-5\" in length. If your axolotl is over 6\", you will need to upgrade the tank to a 30 or 40 gallon. Axolotls prefer length to swim and not necessarily much depth to dive deeper or shallower. Long versions of tanks above a 20 gallon work best."
    },
    {
      "title": "Purchase the right equipment.",
      "content": "Purchase the right equipment. To set up an axolotl tank, you will need a gravel vacuum, thermometer, and a sponge or bubble filter. Remember, axolotls prefer a temperature between 60-64°F. While you shouldn't use gravel in the tank due to the ease of swallowing rocks, you should purchase a gravel vacuum to sift through the sand and suck up any waste. A sponge filter is best, as they suck in particles to allow for the growth of beneficial bacteria while producing oxygenation and circulation to pick up most of the loose debris."
    },
    {
      "title": "Do not house your axolotl in a high-flow area.",
      "content": "Do not house your axolotl in a high-flow area. Axolotls must not be in a high flow area because it will cause them stress, and they will die. They like to walk on the bottom of the tank with minimal current."
    },
    {
      "title": "Buy your axolotl accessories for their tank.",
      "content": "Buy your axolotl accessories for their tank. Your axolotl will need sand to lay at the base of the tank and decorations, such as rocks or caves. Sand of any color that is safe for axolotls will be suitable, but it is best to have a bare bottom tank for baby axolotls, as they might accidentally ingest substrate. Rocks (as big as the axolotl's head), fake plants, or plastic caves are a few examples of decorations you can plant in your axolotl tank. Make sure the decorations in the tank are not sharp, as they could easily scratch and injure your axolotl. If you are using rocks, place the decorations in a pattern and provide caves for shade because of their sensitivity to light. Rocks can often-times be stacked or staggered."
    },
    {
      "title": "Add water to the tank.",
      "content": "Add water to the tank. A water conditioner is a necessity due to the traces of chlorine in tap water, which is toxic and will kill freshwater aquatic animals like axolotls. The water conditioner eliminates chlorine through chemical reactions. Different products may have different instructions on how much to use when putting the conditioner in."
    },
    {
      "title": "Cycle the water before placing your axolotls inside.",
      "content": "Cycle the water before placing your axolotls inside. Cycling the water should be done to convert ammonia to nitrite to produce beneficial bacteria that will help maintain the fish economy. A tank is cycled by first adding ammonia, such as household ammonia, and allowing the tank to run and build up beneficial bacteria in the filter and substrate. This process takes 6 to 8 weeks on average, so make sure you prepare in advance. The tank will be cycled once the water conditions level out and become consistent. The pH of an axolotl tank should be anywhere from 6.5 to 8, but 7.4 to 7.6 is ideal."
    },
    {
      "title": "Test the water quality.",
      "content": "Test the water quality. Even though the water may look clean, the water quality could still be unsuitable for your axolotls to live in. Check the water quality weekly using a water tester kit. Compare the water to suitable charts to see if it is safe for your axolotls to live in the water."
    },
    {
      "title": "Pick out your axolotl.",
      "content": "Pick out your axolotl. There are different types of axolotls to choose from, with five main types that are commonly sold. This includes the Wild Legalistic, White Albino, Golden, and Melanoma. There are more types of Axolotls, especially when crossbred."
    },
    {
      "title": "Do not house axolotls with other fish.",
      "content": "Do not house axolotls with other fish. Axolotls do not co-exist peacefully with other fish. Because axolotls have very poor vision, they will bite at any movement. There is a great chance your axolotl will end up eating the fish in the tank. For the fish and axolotl's safety, it's best only to keep axolotls of the same size in the tank."
    },
    {
      "title": "Acclimate your axolotl.",
      "content": "Acclimate your axolotl. When coming home from the store with your axolotl, you should start by putting them in the water with the bag and allow them to acclimate for 15-30 minutes. After the time is up; you can safely open the bag and let your axolotls free in the tank. It's important to allow your axolotls to transition instead of adding them straight to the tank. Otherwise, you can put them into shock and cause fatality if the water temperatures are too far apart."
    },
    {
      "title": "Provide your axolotls with food.",
      "content": "Provide your axolotls with food. Axolotls are carnivores; they eat frozen or dried bloodworms, night crawlers, and other insects, and thawed calf liver. Feed your adult axolotl once every 1-2 days. Make sure you have a dish to drop their food into the tank to help your axolotls locate the food to prevent it from getting lost or wasted in the substrate."
    },
    {
      "title": "Monitor your axolotl in their tank.",
      "content": "Monitor your axolotl in their tank. Each new axolotl parent should observe their tank every hour to ensure their axolotl is acclimating well to its new environment. Look for any behavioral changes to indicate something may be wrong. Observe your axolotl's eating habits, as a declined appetite is usually the first sign of illness."
    },
    {
      "title": "Clean the tank frequently.",
      "content": "Clean the tank frequently. Axolotls excrete quite often. This waste has to be cleaned up to prevent build-up, as decomposition can cause ammonia and nitrate levels to spike. Clean your tank using a gravel vacuum. Even if you do not use gravel, the vacuum helps keep the bottom of the tank clean and assists with water changes. A clean sponge can help clean any algae build-up on the side of the glass. Keep your tank out of direct sunlight to prevent algae buildup. 20% of water per week should be changed to maintain water conditions."
    }
  ]
}