{
  "url": "https://www.wikihow.com/Play-SkyBlock-in-Minecraft",
  "title": "How to Play SkyBlock in Minecraft: Singleplayer or Multiplayer",
  "steps": [
    {
      "title": "Search for a Skyblock map.",
      "content": "Search for a Skyblock map. There are many variations on Skyblock-style maps that you can download for Minecraft , all made by different users. Go to https://www.google.com and type skyblock map in the search bar to find websites with the latest versions of Skyblock maps. [2] X Research source Some websites that have a Skyblock map include the following: https://www.planetminecraft.com/project/classic-skyblock-map-for-minecraft-1-14/ https://www.minecraftmaps.com/skyblock-maps"
    },
    {
      "title": "Download a Skyblock map.",
      "content": "Download a Skyblock map. When you find a Skyblock custom map you want to download, click the download button to download a zip file with the map files."
    },
    {
      "title": "Extract the map file to the Minecraft save folder.",
      "content": "Extract the map file to the Minecraft save folder. On Windows and Mac, you can use the built-in extraction tools to open the zip file and extract the entire folder to the Minecraft save folder. The Minecraft save folder is located at the following locations depending on the system and the version of Minecraft you are playing (the \"<username>\" folder is the actual name of the Windows, MacOS, or Linux user). [3] X Research source Java Edition on Windows 10/11: C:\\Users\\<username>\\ AppData\\Roaming\\.minecraft\\saves Windows 10 (Bedrock) Edition: C:\\Users\\<username>\\AppData\\Local\\Packages\\Microsoft.MinecraftUWP_8wekyb3d8bbwe\\LocalState\\games\\com.mojang\\minecraftWorlds Java Edition on Mac: Users /<username>/library/application support/minecraft/saves Java Edition on Linux: /home/<username>/.minecraft/saves/ On Windows, it may be necessary to show hidden files and folders to navigate to the Minecraft save folder."
    },
    {
      "title": "Launch Minecraft.",
      "content": "Launch Minecraft. Click the Minecraft launcher (Java Edition) or the Minecraft icon (Windows 10 Edition) to launch Minecraft. If it's not on your Desktop, click the icon in the Windows Start menu, or Applications folder on Mac."
    },
    {
      "title": "Click Play.",
      "content": "Click Play . It's the green button at the bottom of the Minecraft Launcher or the large gray button on the title screen of Minecraft Windows 10 Edition. [4] X Research source"
    },
    {
      "title": "Click Single Player (Java Edition only).",
      "content": "Click Single Player (Java Edition only). On the Java Edition of Minecraft, click Singleplayer to display a list of Singleplayer maps."
    },
    {
      "title": "Click the Skyblock map.",
      "content": "Click the Skyblock map. Once the map is copied to the save folder, it will show up in the list of saves on Minecraft. Click the Skyblock map to load it. [5] X Research source Some maps created in Java Edition may not work properly on Windows 10 (Bedrock) Edition and vise-versa. [6] X Research source"
    },
    {
      "title": "Click Play Selected World (Java Edition Only).",
      "content": "Click Play Selected World (Java Edition Only). This will launch the map and start the game."
    },
    {
      "title": "Search for a Minecraft Skyblock server.",
      "content": "Search for a Minecraft Skyblock server. To play Minecraft online, you'll need to join a custom server. Go to https://www.google.com and search Minecraft Skyblock server . This will produce a list of web pages that contain a list of Skyblock servers. If you are playing Windows 10 (Bedrock) edition, include \"Windows 10\" or \"Bedrock\" in your search. This will produce a list of websites that contain a list of Minecraft servers. Some servers include the following. https://minecraft-server-list.com/sort/Skyblock/ (Java Edition) https://topminecraftservers.org/type/Skyblock (Java Edition) https://minecraftservers.org/type/skyblock (Java Edition) https://minecraftpocket-servers.com/tag/skyblock/ (Bedrock Edition)"
    },
    {
      "title": "Click Copy below a server you want to add.",
      "content": "Click Copy below a server you want to add. Most websites that list servers have a button that says \"Copy\" below each server in the list. Clicking this button copies the address of the server. For Minecraft Windows 10 Edition, you will need to copy the server address, and also click the Server banner and write down the port number."
    },
    {
      "title": "Launch Minecraft.",
      "content": "Launch Minecraft. Click the Minecraft Launcher or Minecraft Java Edition or the Minecraft icon for Minecraft Windows 10 Edition. If it's not on your desktop, click it in the Windows Start menu, or the Applications folder on Mac."
    },
    {
      "title": "Click Play.",
      "content": "Click Play . It's the green button at the bottom of the Minecraft Launcher or the large gray button on the title screen of Minecraft Windows 10 Edition."
    },
    {
      "title": "Click Multiplayer or Servers.",
      "content": "Click Multiplayer or Servers . If you are playing Minecraft Java Edition, click Multiplayer . If you are playing Windows 10 Edition, click Servers ."
    },
    {
      "title": "Click Add Server.",
      "content": "Click Add Server . On Minecraft Java Edition, it's in the lower-right corner of the multiplayer menu. On Minecraft Windows 10 Edition, it's at the top of the list of servers."
    },
    {
      "title": "Add the server information.",
      "content": "Add the server information. Type the name of the server in the field that says \"Server name\". Paste the address you copied in the field that says \"Server address\". On Minecraft Windows 10 Edition, you will also need to enter the port number in the field that says \"Port\"."
    },
    {
      "title": "Click Save or Done.",
      "content": "Click Save or Done . This saves the server to your list of servers. If you are playing Windows 10 Edition, click Save . If you are playing Java Edition, click Done ."
    },
    {
      "title": "Click the Minecraft server you just added.",
      "content": "Click the Minecraft server you just added. This loads a game on the server. You will most likely spawn on a central hub that contains different games, instructions, and other players."
    },
    {
      "title": "Locate the Skyblock game.",
      "content": "Locate the Skyblock game. Different servers have a different layout. Some servers have a variety of games in addition to Skyblock. Look for Skyblock. This may be a villager with the label \"Skyblock\", a portal labeled \"Skyblock,\" or a wall with instructions to start a game."
    },
    {
      "title": "Follow the instructions.",
      "content": "Follow the instructions. Follow any instructions displayed to start a new Skyblock game. It's going to be different on each server. There is most likely a terminal command you can use to start a new Skyblock island or join an existing one. Press T to open the terminal. Once you type the command listed in the instructions, you will start a new Skyblock island."
    },
    {
      "title": "Use the \"sneak\" mode to avoid walking off the edge.",
      "content": "Use the \"sneak\" mode to avoid walking off the edge. Hold down the shift key as you move around to engage the \"sneak\" mode."
    },
    {
      "title": "Gather saplings from the first tree.",
      "content": "Gather saplings from the first tree. No saplings = no more trees, so if you do not collect at least one sapling from your first tree, you will need to start over. Break the leaves of the first tree to break gather saplings."
    },
    {
      "title": "Gather wood from the first tree.",
      "content": "Gather wood from the first tree. After you gather a few saplings from the leaves, break the wood of the tree using your hand."
    },
    {
      "title": "Plant a sapling on a block of dirt furthest from your spawn corner.",
      "content": "Plant a sapling on a block of dirt furthest from your spawn corner. This will keep the tree away from your lava and prevent the loss of a tree (and apples and saplings) to fire later. You can improve your chances of catching saplings by using a few dirt blocks from your top layer to expand the platform out and around the bottom of the tree."
    },
    {
      "title": "Harvest wood and saplings each time the tree matures.",
      "content": "Harvest wood and saplings each time the tree matures. When the saplings mature, gather saplings from the leaves, and then wood. Replant the saplings you collect. [7] X Research source"
    },
    {
      "title": "Craft a crafting table.",
      "content": "Craft a crafting table. When you have enough wood, craft a workbench. Be careful to reserve two wood blocks (don't turn them into planks) to create your first charcoal later."
    },
    {
      "title": "Craft a wooden pickaxe.",
      "content": "Craft a wooden pickaxe. Use some of your wood to craft wood plank blocks and sticks by hand. Then use the crafting table to craft a wooden pickaxe. [8] X Research source"
    },
    {
      "title": "Create a 2X2 water pool.",
      "content": "Create a 2X2 water pool. You can craft a pool from the two ice blocks in your supply chest. You should have enough dirt to create a 2x2 pool, but you can use plank blocks on the side which will be furthest from your lava if necessary. This will create a never-ending water supply since any bucket pulled from this pool is replenished automatically."
    },
    {
      "title": "Create a cobblestone generator.",
      "content": "Create a cobblestone generator. One of the simplest methods is to dig a hole 4 blocks long and the second block 2 blocks deep. Now put a bucket of water on the end with the 2 deep hole and lava on the other end. [9] X Research source To make a basic cobble generator do it in this form (D=Dirt, W=Water, S=air space, L=Lava): D-W-S-S-L-D D-S-D D-S-D An alternate, more compact generator can be made as follows: (D=Dirt block, A= Air block, C=Cobblestone block, W= Water and L=Lava) A-A-W-C-L-D D-W-W-D-A-D D-D-D-D-D-D"
    },
    {
      "title": "\"Mine\" the cobblestone from your generator.",
      "content": "\"Mine\" the cobblestone from your generator. You can generate cobblestone by mixing flowing water with lava. You can combine your water source and your cobblestone generator if you wish."
    },
    {
      "title": "Craft a furnace.",
      "content": "Craft a furnace. Use the crafting table to craft a furnace from eight cobblestone blocks and burn one block of wood using the second reserved block of wood as fuel to get your first charcoal. Craft torches."
    },
    {
      "title": "Craft a fishing rod.",
      "content": "Craft a fishing rod. Use sticks and some of the string from the supply chest to craft a fishing rod. With the fishing rod and your furnace, you can keep yourself fed while waiting for your garden to produce."
    },
    {
      "title": "Continue to generate and harvest cobblestone.",
      "content": "Continue to generate and harvest cobblestone. Once you have a supply of cobblestone, extend your platform to the bottom of the island and collect the dirt, taking care not to mess up the cobble generator. If you craft cobblestone slabs, you can double the surface area you can create with the same amount of raw material. This slab method also has the advantages of preventing mobs from spawning in dimly lit areas. To avoid losing dirt blocks, create a platform or \"tray\" underneath your SkyBlock to catch anything that falls off the top. You can do this by opening a one-block hole in your cobblestone and placing a bucket of water into it, creating a waterfall that you can swim down through. Drop down and place 4 blocks of cobblestone in a column/tower going down. Swim back up for air, then drop back down through the water to place a single block perpendicular to your column at the bottom of your column directly under your original hole... and swim back up. Hop out of the water, pick up the water with the bucket. Place a ladder and drop back down to the bottom perpendicular block you placed and build/expand a lower level or \"tray\" 4 blocks below your original SkyBlock. \"Tray\" expanding below the main level. This can be left dark as a mob spawner or lit to prevent mobs at the player's discretion."
    },
    {
      "title": "Consider creating a mob spawner.",
      "content": "Consider creating a mob spawner . You can do this by building a platform with no lighting. This will give you access to mob drops such as string, bones (bone meal for gardening), specialized tools, etc. Since you have no iron, you won't be able to use hoppers. Instead, just run along the sides and pick up the drops manually."
    },
    {
      "title": "Consider creating a \"pasture\".",
      "content": "Consider creating a \"pasture\". This should be 24 blocks away from your main work area in order to spawn animals for food and other resources. [10] X Research source"
    },
    {
      "title": "Play your own way.",
      "content": "Play your own way. The rest is up to you. You can make a cool house, create a more efficient mob grinder, make a large mob farm, the possibilities are endless. Skyblock ends when either you have completed all the challenges, or are unable to go any further without cheating."
    }
  ]
}