{
  "url": "https://www.wikihow.com/Melt-Copper",
  "title": "How to Melt Copper",
  "steps": [
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. DIY foundries consist of the furnace body, insulation/lining, crucible, propane tank and burner, as well as a lid. You will also need protective gloves, a suitable face guard, and a set of lifting tongs for moving the crucible. Keep in mind that while it is possible to construct a safe furnace, it is exceedingly important that you properly insulate your foundry to prevent any injury to yourself or others. DIY furnace bodies are typically cylindrical and made of metal. Depending on the size of your furnace — which you can determine by the volume of metal you would like to melt — you can use metal cans from bulk food purchases, or a stainless steel crockpot. Kaowool (a ceramic fiber with high-heat resistance) is an ideal lining for metal melting furnaces. Crucibles are the container in which you will place the metal scraps to be melted. The liquified copper will pool here; it is necessary that you use a material that will not melt or crack at the temperatures needed to melt your copper. Clay graphite is a common choice. [1] X Research source For the propane burner, you do not want something used for cooking, but instead a torch-like fixture to position through the foundry exterior and by the crucible. These are widely available online. The lid will be fashioned out of a smaller top portion of whatever you choose to be your foundry body. Foundry lids have a small hole in the top that allows for ventilation and the prevention of dangerous pressure build-up."
    },
    {
      "title": "Ensure that your safety equipment is of a high quality.",
      "content": "Ensure that your safety equipment is of a high quality. High temperature gloves used in the molten metal industry, as well as a face shield of durable material are recommended. It is useful to know that your flame itself will not be reaching the necessary temperatures; thanks to proper insulation, the crucible center will be super-heated to a point where copper will melt."
    },
    {
      "title": "Use an induction furnace.",
      "content": "Use an induction furnace. Because copper has a high melting temperature of 1083°C (1981°F), induction furnaces are typically needed. Although highly expensive industrial machines, induction furnaces will guarantee for a level of safety that is not present in self-constructed foundries. The two most common types are double push-up, and tilting furnaces. [2] X Research source Double push up furnaces rapidly heat metal in individual \"shots\" or rounds. The advantage here is that you can start and stop your process easily and not waste energy when only melting a small amount of metal. Tilting furnaces are often used in industrial settings. They continuously melt large amounts of copper and are automated to pour into a ceramic container or any desired metal cast/mold."
    },
    {
      "title": "Obtain necessary fuel.",
      "content": "Obtain necessary fuel. If you decide to build your own furnace, you will need enough fuel to provide a consistent burn. In the casting industry, natural gas is the essential go-to. However, it is also possible to work with charcoal alone. Originally metal workers used charcoal and coal. Presently propane and natural gas are used because it saves time and allows blacksmiths to focus on their work. One downside of charcoal is that it gives off harmful smoke and will require more attention in maintaining proper temperature."
    },
    {
      "title": "Compose the outer body.",
      "content": "Compose the outer body. For small scale copper metal melting it will be sufficient to create a furnace 6 in. to 1 ft. in diameter. Furnaces are commonly shaped like cylindrical prisms. Bulk canned foods (such as peaches and soups) can provide a metal can of the proper size and shape for your DIY furnace. For something larger, stainless steel crockpots can also be easily converted into a foundry."
    },
    {
      "title": "Line the foundry bottom with a kiln shelf brick, or fire brick.",
      "content": "Line the foundry bottom with a kiln shelf brick, or fire brick. This will catch any flux or spilled metal and prevent further to damage to people or materials outside the foundry."
    },
    {
      "title": "Line the interior floor and walls.",
      "content": "Line the interior floor and walls. Use kaowool. Kaowool is a synthetic mineral wool (sometimes referred to as ceramic fiber) that has a high heat-resistance. It is not necessary to use adhesive between the foundry walls and the kaowool. Simply arch and form the kaowool into place along the curved interior walls; it will hold its form. Kaowool is made of a blend of alumina, silica, and kaolin."
    },
    {
      "title": "Coat the exposed kaowool (which will form your foundry interior) with ITC-100 or satanite.",
      "content": "Coat the exposed kaowool (which will form your foundry interior) with ITC-100 or satanite. This will increase its durability over time and help to maintain the high temperatures needed to melt copper and other metals. ITC-100 is an infrared reflector which will send back up to 98% of the heat that touches it. coating used inside of kilns and elements. Using this can help protect your kiln, and also save fuel. Satanite needs to be mixed with water until it forms a pasty solution, and then painted onto the kaowool with a brush."
    },
    {
      "title": "Drill an entrance hole for the propane tank.",
      "content": "Drill an entrance hole for the propane tank. Using an electric drill and hole-cutter bit, drill through the foundry exterior roughly two inches above the interior floor's height. The entrance should be angled down at roughly 30˚. Should any metal fall from the crucible (or should the crucible break), this will prevent any dangerous material falling into the propane tube. The circumference of the hole should be only slightly larger than that of the propane burner, so that is held securely in place."
    },
    {
      "title": "Prepare your propane burner.",
      "content": "Prepare your propane burner. Propane burners for a forge can be purchased online. These important devices attach to your propane tank and create the consistent flame that will be building temperature inside the forge. Once the burner is safely attached to your propane tank, slide it snuggly into the pre-drilled entrance. Do not insert the burner completely through the hole. The flare should be 1.5in. from the chamber center to protect it from high-temperature damage. Always keep your propane tank's valves closed when not in use."
    },
    {
      "title": "Create a lid.",
      "content": "Create a lid. If you are using a can as your foundry, simply cut the top 2 inches off and line the interior with kaowool and a proper coating. Drill a hole in the top of your lid. This will serve to release pressure and allow you to safely add metal scraps into the forge while it is at peak temperatures."
    },
    {
      "title": "Insert the crucible.",
      "content": "Insert the crucible. Crucibles are made of steel, silicon carbide, and often clay graphite. They resist high temperatures and will hold and heat the copper you are melting. Keep in mind that you will also need proper tongs to grasp the crucible if you intend to pour your liquid copper solution into any molds. Tongs must hold the crucible firmly within slipping. [3] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source If you would like to make your own crucible, you can repurpose old materials like fully used fire extinguishers."
    },
    {
      "title": "Obtain copper to melt.",
      "content": "Obtain copper to melt. Scraps of copper are common in many home appliances and electronics. Copper is used to make wires, electronics, appliances and motors, and is therefore commonly found around the house. You can find copper in cookware, furniture, wires and pipes. Appliances that utilize copper include air conditioners, dishwashers, heat pumps, freezers, refrigerators, washing machines, clothes dryers, garbage disposals, dehumidifiers, and stoves. Decorative and utilitarian items can also contain copper: fire screens, large clocks, bells, jewelry, etc. Be aware that it is illegal to melt U.S. pennies or nickels."
    },
    {
      "title": "Bring your scraps to foundry location.",
      "content": "Bring your scraps to foundry location. Depending on the size of scraps this can mean more than just carrying a few wires to your backyard. Potentially you have large, heavy slabs of copper that will require more serious effort to move. This may involve either light or heavy-duty trucks, conveyor belts, and potentially stationary or mobile cranes depending on the scale of you operation. [4] X Trustworthy Source US Occupational Safety and Health Administration U.S. government agency responsible for setting and enforcing workplace safety standards Go to source"
    },
    {
      "title": "Break and separate your copper pieces.",
      "content": "Break and separate your copper pieces. Because of the various shapes of recycled copper pieces, it can be physically difficult to efficiently fit them in a foundry. Working with larger slabs of metal will require heavy manual labor. Commonly the \"drop-ball\" method is used, which involves using heavy duty machinery to slam the pieces at high speed in order to break it apart. Be aware that this process can create a serious safety hazard. Flying pieces of metal quickly become a physical threat. Make sure this process is performed in isolation. Anyone near the operation should be protected by appropriate blockades, walls, etc. to ensure they will not be struck and/or injured."
    },
    {
      "title": "Torch cut your copper scraps.",
      "content": "Torch cut your copper scraps. Once you have reduced all larger pieces of copper to a workable size, use a torch to produce samples that will fit easily in a foundry. Torches using compressed gas are most common in the cutting of metals. [5] X Trustworthy Source US Occupational Safety and Health Administration U.S. government agency responsible for setting and enforcing workplace safety standards Go to source Always wear a face mask to protect yourself from burning debris. Copper has a high heat-resistance and can be difficult (though not impossible) to cut with a gas torch. Plasma torches and powder cutting torches are often used when cutting super-conductors like copper and bronze."
    },
    {
      "title": "Compact your metal scraps.",
      "content": "Compact your metal scraps. Use an automated metal baler to pressure high quantities of metal scraps into smaller pieces. Balers are typically made of steel, operating with a hydraulic ram to crush the desired materials. [6] X Research source"
    },
    {
      "title": "Position your foundry over sand or dirt.",
      "content": "Position your foundry over sand or dirt. Molten metal can explode if it is spilled and comes in contact with concrete, so it is safest to do your DIY foundry work over dirt and sand, substances that will safely absorb the high-temperature material."
    },
    {
      "title": "Place the crucible in the foundry.",
      "content": "Place the crucible in the foundry. Inspect the interior of your foundry for any foreign objects that could interfere with the crucible's balance or the melting process. Also ensure the crucible is entirely dry. If molten metal comes in contact with foreign objects or water, an explosion can occur. [7] X Research source Before lighting your flame, also ensure that the crucible fits securely inside."
    },
    {
      "title": "Turn on your propane burner.",
      "content": "Turn on your propane burner. Lighting the flame will begin the process of building a formidable internal temperature high enough to melt your copper. As the charcoal begins to burn, your foundry is almost ready to take in metal scraps."
    },
    {
      "title": "Cover the foundry with your lid.",
      "content": "Cover the foundry with your lid. With only a hole on the top, your foundry should be almost entirely closed off at this point. Now the crucible's interior space can create the intensity needed to superheat whatever scraps of copper will be placed inside. Let your foundry crucible heat up for about 30 minutes—you should always let the temperature stabilize before you melt anything."
    },
    {
      "title": "Place copper pieces in the crucible.",
      "content": "Place copper pieces in the crucible. As they are already compacted and cut from earlier steps, it should be easy to fit a large amount of pieces in at once, and make your melting process more efficient. Be careful though not to insert so many pieces that, once melted, would cause overflow and breaching of the crucible's lip. Always wear heat-resistant gloves and a face guard when beginning the actual metal melting process."
    },
    {
      "title": "Check the temperature.",
      "content": "Check the temperature. Copper melts at 1981°F. In order to check that your foundry is hot enough you will need to use a high-temperature thermocouple probe. There are both disposable and reusable models available for purchase from different companies within the metal working industry."
    },
    {
      "title": "Pour melted copper into a mold or cast.",
      "content": "Pour melted copper into a mold or cast. Once the desired amount of copper is ready. Prepare the mold on a safe space (ideally sand or another heat-resistant ground surface. Grasp the crucible with your tongs, lift it from the foundry and slowly pour your liquified copper into the desired cast."
    }
  ]
}