{
  "url": "https://www.wikihow.com/Remove-E-Clips",
  "title": "How to Remove an E Clip: 3 Best Methods",
  "steps": [
    {
      "title": "Align your remover tool with the edge of the E-clip.",
      "content": "Align your remover tool with the edge of the E-clip. Most E-clip removers have a smooth, curved edge. Line up the curved edge on your tool with the curve of the E-clip, and place your tool just below the E-clip. [1] X Research source There are several different types of E-clip removers, and you can use them all in a similar way."
    },
    {
      "title": "Push upwards and apply steady, moderate pressure.",
      "content": "Push upwards and apply steady, moderate pressure. Once your tool is aligned with the E-clip, simply press up on the tool to remove it from its position. [2] X Research source Be careful not to use too much pressure, or the E-clip may go flying!"
    },
    {
      "title": "Store your E-clip in a dry location until you use it next.",
      "content": "Store your E-clip in a dry location until you use it next. Place your E-clip in a storage jar, bin, or container. You can easily use them again and again for other projects involving tools. You can store these in your shop or in a tool box, for instance."
    },
    {
      "title": "Move the middle of the E-clip toward the side so you can grasp it.",
      "content": "Move the middle of the E-clip toward the side so you can grasp it. To easily remove the E-clip, you want the curved side of the E-clip facing you. If necessary, use your fingers or a pair of needle-nose pliers to twist it around. The E-clip should slide easily with moderate pressure."
    },
    {
      "title": "Grab the center of the E-clip with needle-nose pliers.",
      "content": "Grab the center of the E-clip with needle-nose pliers. Pinch the middle of your E-clip with the tip of your needle-nose pliers. Hold the pliers securely so you can remove the clip. Needle-nose pliers work the best to easily remove the E-clips. However, you can use other types of pliers as well, like slip-joint pliers or locking pliers."
    },
    {
      "title": "Pull the E-clip toward you with moderate pressure.",
      "content": "Pull the E-clip toward you with moderate pressure. While grasping the E-clip, pull back on your pliers to take the clip out of its position. If you are having trouble gripping the E-clip, adjust your pliers so the tip is closer to the middle."
    },
    {
      "title": "Align the screwdriver with 1 of the small grooves in the middle.",
      "content": "Align the screwdriver with 1 of the small grooves in the middle. Place the tip of your screwdriver inside the groove on the clip. Each E-clip has 2 small grooves in the middle, 1 for the left side and 1 for the right side. You can use either groove to help remove the E-clip. [3] X Research source For best results, use a screwdriver that is proportionate to the size of the E-clip."
    },
    {
      "title": "Place your finger directly next to the E-clip to catch it when it moves.",
      "content": "Place your finger directly next to the E-clip to catch it when it moves. Hold your index finger of your non-dominant hand up to the E-clip along the top edge. [4] X Research source This way, you can prevent the E-clip from flying far away when you remove it."
    },
    {
      "title": "Push up on the screwdriver with moderate pressure.",
      "content": "Push up on the screwdriver with moderate pressure. Hold your screwdriver with your dominant hand, and push the tool upwards consistently. [5] X Research source The E-clip should easily come out. If it doesn’t, apply a bit more pressure."
    }
  ]
}