{
  "url": "https://www.wikihow.com/Mediate-Family-Arguments",
  "title": "How to Mediate Family Arguments",
  "steps": [
    {
      "title": "Think about everyone's perspective.",
      "content": "Think about everyone's perspective. [1] X Expert Source Jessica Notini, JD Negotiation & Mediation Coach Expert Interview. 27 March 2020. Before attempting to mediate disagreements, make sure you look at all sides of the argument. While you shouldn't take sides when attempting to mediate, you don't want anyone to think you're overlooking their point of view. Take some time to think about why everyone feels wronged or hurt in the situation. [2] X Research source You will have to resist the urge to judge here. It can be difficult to look at family situations objectively, especially if you're emotionally involved in the conflict. Try to think about how you would react to hearing about the conflict as an outsider. Examine why both parties feel wronged and hurt. Consider your family's history and what role, if any, this plays in the drama. Also, look within yourself. Have you done or said anything that could have escalated the situation? How do you think other family members felt about some of your actions? Try acknowledging this out loud, such as by saying, “I shouldn’t have raised my voice. I am sure it was upsetting for you to hear that.” Acknowledging this out loud and leading by example can set the tone for other people to follow suit! You want to behave admirably and have people want to replicate that."
    },
    {
      "title": "Reflect on how the conflict affects other family members.",
      "content": "Reflect on how the conflict affects other family members. Mediating drama can be difficult. However, it's important to have the strength and resolve to work towards a solution despite the stress of it. One way to keep yourself strong is to remind yourself who is getting hurt. Oftentimes, a conflict between two family members affects everyone in the family. [3] X Research source Think about who's caught in the middle. For example, if your two uncles are fighting, maybe their kids are in the middle. While all the cousins like to get together once in a while, it's become awkward due to the rift between their fathers. The fact other family members are affected is something you can use to encourage resolution. If the two opposing sides do not want to meet, remind them of how their drama adversely affects those around them. This may be the push they need to mend fences."
    },
    {
      "title": "Ask other family members about how they're feeling.",
      "content": "Ask other family members about how they're feeling. As a mediator, you want to have as nuanced an understanding of the situation as possible. The best way to understand someone's point of view is to ask. Before getting everyone together for a talk, ask a variety of family members how they feel about the situation. [4] X Research source You don't want to engage in bad-mouthing. However, try to encourage everyone to explain why they're feeling the way they do. Use active listening techniques to emphasize to them that they've been heard and understood. For example, \"Uncle Dave, you seem really tense about seeing Uncle Clark for Thanksgiving. Is there something going on there?\""
    },
    {
      "title": "Look for the underlying issue.",
      "content": "Look for the underlying issue. With families especially, an argument is rarely about the surface-level issue. If a family member reacts very negatively to a seemingly trivial thing, chances are there's some kind of old feud or resentment at play. Reflecting on your family's history can help you trace the roots of feuds and address the situation more effectively. [5] X Research source For example, if your uncles are fighting because one of them made a passing joke about the other's job, chances are there is more going on. Maybe one uncle always outshined the other growing up. Maybe they have always been very competitive with one another. In this case, the issue isn't just about personal tact when it comes to humor. The issue is about insecurity. Knowing this will make it easier to address everyone's feelings when mediating the issue."
    },
    {
      "title": "Establish ground rules for the discussion.",
      "content": "Establish ground rules for the discussion. When you get your family together to talk, you need to establish some rules. Be sure to encourage the various parties to help in this process of creating rules. That way you won't seem like you're lecturing or being condescending. This will also help to assure the conversation runs smoothly and everyone can express themselves. A good general ground rule is that only one person can talk at a time. You can discourage others from interrupting. You can start off by saying something like, \"Even if you disagree with what someone is saying, it's important to let that person talk for the sake of this mediation. You can respond when they're done.\" You can also have general rules about managing emotion. Let everyone know that, no matter how angry they get, no one should raise their voice or use foul language."
    },
    {
      "title": "Encourage everyone to control their emotions.",
      "content": "Encourage everyone to control their emotions. It's not uncommon for tensions to run high when discussing family conflict. There may be times when people get emotional and angry. Try to rein in the emotional outbursts as much as you can. While everyone has a right to their personal feelings, make it clear these feelings must be expressed in an appropriate, productive fashion. [6] X Research source Let someone know if they're getting out of control. Say something like, \"Uncle Clark, you're starting to raise your voice\" or \"Uncle Dave, you shouldn't use words like that. It's not productive.\" Remember not to try to shout over them when they raise their voice. Keep your tone gentle and your voice soft. Use brief prompts such as \"let's keep it down\" to keep them on track when they start to stray. You can also ask if they'd like to take a moment to breathe or compose themselves."
    },
    {
      "title": "Paraphrase people's thoughts.",
      "content": "Paraphrase people's thoughts. [7] X Expert Source Jessica Notini, JD Negotiation & Mediation Coach Expert Interview. 27 March 2020. It's important that everyone feels truly heard during a mediation. After someone speaks, briefly paraphrase their words. Give them a chance to clarify if you're misinterpreting something. This way, everyone will feel heard during a mediation. For example, \"Uncle Dave, I'm hearing you feel like Clark was being condescending about your job. You worked really hard for the promotion, and while you don't mind joking around, you felt like Clark should have congratulated you first.\""
    },
    {
      "title": "Make sure everyone has a chance to express themselves.",
      "content": "Make sure everyone has a chance to express themselves. Do not end the conversation until everyone has expressed themselves. Go around the room and give everyone the chance to talk. Then, go around the room again and let everyone respond. Before ending the conversation, say something like, \"Does that cover it? Does anyone else have something they would like to share?\" You never want to end a negotiation before all parties have vented their feelings and frustrations about a situation."
    },
    {
      "title": "Work on healing the relationships.",
      "content": "Work on healing the relationships. The solution you reach during a mediation is rarely cut and dry. You may not have an exact, specific game plan. However, everyone should leave with some idea of how to heal broken relationships. [8] X Research source It's not your job to offer exact courses of action. However, you can offer suggestions on how family members could better treat one another in the future. Think about what has been said during mediation. Look for areas where change is needed. Remember to seek the input of others. Ask them specifically what they are willing to do to help improve the situation. Start with your own areas of change if appropriate. Suggest something that needs to be different in the future. For example, \"As a person's career is so vital to their sense of self, maybe we should all use more sensitivity when joking about someone's job.\" You should also agree to work actively on letting go of the feud. For example, \"For the next couple of months, let's agree not to bring this up. We don't have to talk about it over Thanksgiving. I think this will give everyone a chance to let some of this go and move forward.\""
    },
    {
      "title": "Strive for forgiveness.",
      "content": "Strive for forgiveness. You can start by forgiving the family members in question yourself. Even if you were not directly involved in the feud, you were probably affected by the drama in some way. Choose forgiveness. Remember, you can't control someone else's actions but you can control your own response. [9] X Research source You can also encourage other family members to forgive. However, remember you cannot force someone to feel a particular way."
    },
    {
      "title": "Keep your expectations realistic.",
      "content": "Keep your expectations realistic. If a family argument or conflict has been going on for a while, you're not going to fix it overnight. [10] X Expert Source Jessica Notini, JD Negotiation & Mediation Coach Expert Interview. 27 March 2020. Moving forward, expect that things will continue to be strained. If the family members in question are difficult and melodramatic by nature, they may be unwilling to completely mend fences. At the next holiday or get-together, accept there may still be tension despite your best efforts. [11] X Research source Keep in mind that it might take several conversations before a situation is better. Give everyone involved a break, but don't be afraid to revisit the issue down the line to see where areas of progress exist. Express pleasure about this and encourage everyone to keep trying."
    }
  ]
}