{
  "url": "https://www.wikihow.com/Pick-Up-Line-Responses",
  "title": "How to Respond to a Cheesy Pick-Up Line: 40+ Clever Comebacks",
  "steps": [
    {
      "title": "Did it hurt when you fell from heaven?",
      "content": "Did it hurt when you fell from heaven? They might also ham it up, come up and ask you if you're okay, act all concerned, and then deliver the line. Here are some ways you can respond: If you're interested: \"Oh, nothing a drink and some conversation won't fix.\" If you might be interested: \"Heaven? You must have me confused with someone else. I'd certainly remember if I'd been to heaven!\" If you're not interested: \"No, but I did scrape my knees crawling up out of hell.\""
    },
    {
      "title": "Are you a bank loan? Because you've got my interest!",
      "content": "Are you a bank loan? Because you've got my interest! There are other ways to finish this one, but they're all along the same theme. A finance-based response can work really well. Here are some ideas: If you're interested: \"Well, you must be a re-fi because you've got mine as well.\" If you might be interested: \"How often is that interest compounding?\" If you're not interested: \"Your card was just declined.\""
    },
    {
      "title": "If beauty was a crime, you'd be serving a life sentence.",
      "content": "If beauty was a crime, you'd be serving a life sentence. This and lines like it are clearly intended as compliments, so unless the person is super creepy, it's usually best to take it as such, even if you're not interested. Here are some options: If you're interested: \"Guilty as charged, but only if you're my accomplice.\" If you might be interested: \"Aww thanks! I'll remember that if I feel down about aging 20 years from now!\" If you're not interested: \"Thanks for the compliment, but I'm not interested.\""
    },
    {
      "title": "Do you have a bandage? Because I scraped my knee falling for you.",
      "content": "Do you have a bandage? Because I scraped my knee falling for you. In the reverse of the \"fall from heaven\" line, the person delivering the pick-up line is the one who pretends to be injured and needs assistance. How do you respond? If you're interested: \"I don't, but I could kiss it and make it better.\" If you might be interested: \"Poor thing! Why don't you sit right here and tell me all about it.\" If you're not interested: \"They might have a first-aid kit behind the bar. Ask for burn relief gel.\""
    },
    {
      "title": "I seem to have lost my phone number, can I have yours?",
      "content": "I seem to have lost my phone number, can I have yours? This pick-up line is one of those that really goes for broke. It might seem almost a little too forward, but this sort of line is usually dropped by someone who's looking for something short and sweet rather than a serious, long-term relationship. [1] X Research source Keeping that in mind, here's what you might say: If you're interested: \"Well, you can't have my number without me—I'm afraid we're a package deal.\" If you might be interested: \"And without one of your own, what are you planning on doing with it?\" If you're not interested: \"I just had it disconnected.\""
    },
    {
      "title": "Are you Wi-Fi? Because I seem to feel a connection.",
      "content": "Are you Wi-Fi? Because I seem to feel a connection. It's almost sweet and doesn't objectify you nearly as much as some pick-up lines do. At least it isn't entirely focused on your appearance! Here are some ways you could respond: If you're interested: \"You're not trying to hack my network, are you?\" If you might be interested: \"Yes, but you'll need the password. This is a secure network.\" If you're not interested: \"Signal's weak over here. Try on the other side of the room.\""
    },
    {
      "title": "Is it hot in here or is it just you?",
      "content": "Is it hot in here or is it just you? This line uses the art of misdirection to slip in a sexy little compliment. It also gives you plenty of openers depending on whether you're interested: If you're interested: \"Whew! I definitely felt the temperature rise when you walked over here.\" If you might be interested: \"Actually I was feeling a little chilly. Maybe a fresh drink and some warm conversation would do the trick.\" If you're not interested: \"Yeah, it's definitely just me.\""
    },
    {
      "title": "Are you from Tennessee? Because you're the only 10 I see!",
      "content": "Are you from Tennessee? Because you're the only 10 I see! When someone asks you this, they're not necessarily interested in whether you're from the Volunteer State. It's really just a compliment about your appearance wrapped in cheese. Here are some responses: If you're interested: \"Oh, I'm Virginia, and you know what they say... Virginia is for lovers!\" If you might be interested: \"Actually, I'm from Missouri, the 'Show Me' state, so why don't you show me why I should keep talking to you?\" If you're not interested: \"Nah, I'm an Oklahoma Sooner, which is when you should be walking away—sooner.\""
    },
    {
      "title": "I must be in a museum because you're a work of art.",
      "content": "I must be in a museum because you're a work of art. It's quite a sweet pick-up line, but at the same time, it really is a bit over the top. Here are some things you can say back: If you're interested: \"Oh, but what good is a work of art in a museum if you can't touch it and experience it for yourself?\" If you might be interested: \"Tell me about your favorite painting, then.\" If you're not interested: \"If this is a museum, I'm afraid I'm going to have to ask you to leave. You're disturbing the other patrons.\""
    },
    {
      "title": "Do you believe in love at first sight, or should I walk by again?",
      "content": "Do you believe in love at first sight, or should I walk by again? This come-on is definitely a classic, overused pick-up line. Of course, the person usually doesn't really mean that they've fallen head-over-heels in love with you. Treat this over-the-top line like any other. Here are some potential responses: If you're interested: \"I don't know if this is love, but I definitely don't want you to walk away.\" If you might be interested: \"Maybe... why don't you buy me a drink and we can talk about it?\" If you're not interested: \"Nah, just walk away.\""
    },
    {
      "title": "If you were a chicken, you'd be impeccable.",
      "content": "If you were a chicken, you'd be impeccable. Did you laugh? Because that's really the whole point of this clever little pun of a line. Laughter is a great way to break the ice—as long as the two of you share a similar sense of humor. You might respond: If you're interested: \"You know, I saw you across the room and I had great egg-spectations for you.\" If you might be interested: \"I'm normally not into puns, but omeletting that one slide.\" If you're not interested: \"That was cute but I'm not interested. I wish you the best of cluck.\""
    },
    {
      "title": "I'm no photographer, but I can see the two of us together.",
      "content": "I'm no photographer, but I can see the two of us together. This one might feel a bit cringe, but the person who uses it has their heart in the right place. While most people pull out these lines when they're looking for a one-night thing, this could indicate the person has their eye on something longer term. Respond accordingly: If you're interested: \"Are you sure you're not a photographer? Why not take a selfie so we can remember how we looked the day we met?\" If you might be interested: \"Your focus might be a bit off, but why don't we discuss your camera settings over drinks?\" If you're not interested: \"I think you left your lens cap on.\""
    },
    {
      "title": "If I was in charge of the alphabet, I'd put \"U\" and \"I\" together.",
      "content": "If I was in charge of the alphabet, I'd put \"U\" and \"I\" together. That's right, another somewhat cheesy attempt to turn strangers into lovers. Play off the alphabet line with responses like these: If you're interested: \"Well, if it was up to me, I'd start it U R A Q T.\" (\"You are a cutie.\") If you might be interested: \"Good thing you're not in charge of the alphabet then because that would totally mess up the song.\" If you're not interested: \"I'd just put N and O together myself.\""
    },
    {
      "title": "It's good that I have my library card because I'm totally checking you out.",
      "content": "It's good that I have my library card because I'm totally checking you out. This line at least gets points for honesty, right? And you can never go wrong with supporting the library! Here are some possible responses: If you're interested: \"Well, you must be a librarian because you've definitely increased my circulation!\" If you might be interested: \"Well thanks for supporting the library. What's your favorite book genre?\" If you're not interested: \"Yeah, I just got transferred to a different branch.\""
    },
    {
      "title": "You're so sexy you made me forget my pick-up line.",
      "content": "You're so sexy you made me forget my pick-up line. That's right, when all else fails, you might get hit with a pick-up line that's pretending not to be a pick-up line. How do you react? Here are some options: If you're interested: \"That's okay, you don't need a pick-up line to grab my attention.\" If you might be interested: \"Well, why don't you buy me a drink, and we can brainstorm together and see if we can come up with it.\" If you're not interested: \"Sounds like everyone's better off.\""
    },
    {
      "title": "Rate the pick-up line on a scale of 1 to 10.",
      "content": "Rate the pick-up line on a scale of 1 to 10. This approach is a great response to keep in your back pocket because it can go any number of ways depending on the score you choose to give. It also gives you the perfect opportunity to comment on the person who delivered the line in the first place. Here are some examples: \"Oooh. I'll give the line itself 2 out of 10, but you get 3 bonus points for enthusiasm. You're at 5 out of 10, care to give it another shot?\" \"10 out of 10! Brilliant execution, highly recommended. Come on over, let's tell you what you've won!\" \"Yeah, no. 1 out of 10 on the line, can't recommend. Maybe just approach me like a normal person next time.\""
    },
    {
      "title": "Ask them their success rate with that line.",
      "content": "Ask them their success rate with that line. Does this person seem a little too confident, and you want to take them down a notch? You can use this response no matter what the line is and get them thinking about how successful these lines really are. For example, you might say, \"Oh, that's a good one. Say, what's your rate of success with that line? I'm guessing...\" Then, you can fill in the percentage depending on what you want to tell the person. If you think the line was terrible, you might even say 0%! If you feel pretty certain that they've struck out several times already, you might say, \"Ooooh! Do I get a prize for being the 10th person you've used that line on tonight?\""
    },
    {
      "title": "Laugh and ask them for another pick-up line.",
      "content": "Laugh and ask them for another pick-up line. It's totally possible that the person with the cheesy pick-up line is actually an awesome person who just gets anxious trying to chat up new people. Call out the fact that they used a pick-up line and go kind of meta with it, encouraging them to share other cheesy pick-up lines so the two of you can laugh together. For example, you might say, \"Oh wow, it's been a while since I heard a pick-up line quite that silly—I love it! Give me another one!\" Your tone is typically going to indicate whether you're open to further interaction with them or you're just trying to let them down easy."
    },
    {
      "title": "Say something completely random and unrelated.",
      "content": "Say something completely random and unrelated. Confusion is the name of the game here. When you respond with something that has nothing to do with the pick-up line they just used, it confuses them and puts them off balance. At that point, they might rethink their strategy and try to introduce themselves more directly (they might also just walk away). For example, when someone comes up to you with a pick-up line, you might respond, \"Tigers are the only species of cat that has striped skin.\" This is a really great strategy if you're the type of person who always goes out armed with lots of random facts."
    },
    {
      "title": "Play off something in the line to start a legitimate conversation.",
      "content": "Play off something in the line to start a legitimate conversation. Research shows that pick-up lines can launch a conversation. [2] X Research source If you're actually interested in trying to make a connection with the person, this tactic might work in your favor. Take a single word or topic from the pick-up line that you can use to turn the conversation in a different direction. For example, if they use a pick-up line that has something to do with magic or magicians, you might ask them when the last time they went to a magic show was. The possibilities are endless here, and whatever you say doesn't even really have to be related to the subject of the pick-up line—you're really just spinning off on a kind of tangent. It also allows you to steer the conversation more in a direction that you're comfortable with."
    },
    {
      "title": "Stare at them blankly.",
      "content": "Stare at them blankly. You have to be good at maintaining your composure to pull this one off. Basically, when they come up with the line, you stare them dead in the eye and hold eye contact until they look away, just like when you had a staring contest as a kid. The key is not to giggle or even smile—keep a completely blank, emotionless expression on your face the whole time. Eventually, they will look away, or say something, or try to get you to something. If the vibes are right, it might end up with both of you collapsing in giggles! This is a lot similar to simply ignoring them, except that with this response, they're 100% sure that you heard them."
    },
    {
      "title": "Be honest and direct if you’re not into the pick-up line.",
      "content": "Be honest and direct if you’re not into the pick-up line. Playful banter can be fun, but if you're not feeling it, just let the person know that directly. You're being mature and showing them respect—even if you feel like the pick-up line was borderline disrespectful. If you're ultimately looking for a relationship and not just a casual fling, directness is definitely the way to go. [3] X Research source For example, you might say, \"Hey, I'm not really into pick-up lines—they just don't feel genuine. I'd prefer to connect with a real person. What's your name?\""
    },
    {
      "title": "Set boundaries with the person if appropriate.",
      "content": "Set boundaries with the person if appropriate. If someone's pushing your boundaries from the moment they first step foot in your life, that's a huge red flag. You can keep things light and still let the person know how you expect to be treated and what you'll do if they don't respect the boundaries you've set. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Setting boundaries is perhaps even more important if you're actually interested in the person and want to get to know them better. The way you interact with each other now will set the stage for your future conversations."
    },
    {
      "title": "Be bold and flirty when texting on an app.",
      "content": "Be bold and flirty when texting on an app. If someone starts messaging you, that means you've already both swiped right, so you're doing something right. It can be fun and flirty to play around with cheesy pick-up lines , especially if you can change them up to suit the context of texting on a dating app. Go ahead and kick it up to the next level with flirty responses like these: Hey, can I have your name? Why, don't you have one? Tell me your favorite thing about yourself. Let's just skip the small talk and get right to flirting. Do you believe in love at first text, or should I type something else? Why don't we meet for a drink before I answer that question? I want you to know that I'm 100% committed to this Tinder relationship. I would expect nothing less! I've been blinded by your beauty. I'm going to need your name and number for my insurance company. Oh, I'd text you, but you wouldn't be able to see it!"
    }
  ]
}