{
  "url": "https://www.wikihow.com/Share-Liked-Songs-on-Spotify",
  "title": "Share Liked Songs on Spotify: 2 Easy Ways on Desktop & Mobile",
  "steps": [
    {
      "title": "Go to https://nonnullish.github.io/share-liked-songs/ in a web browser.",
      "content": "Go to https://nonnullish.github.io/share-liked-songs/ in a web browser. If you're using Spotify on your phone, tablet, or in a web browser, it's not possible to copy Liked Songs to a new playlist like in the desktop app . Share Liked Songs is a free tool developed by a Spotify listener to help users create a playlist from their Liked Songs that's easy to share, even if you're not using the desktop app. [1] X Research source You can get to this free tool using any web browser on your computer, Android, iPhone, or iPad. If you only want to share a single liked song, you can just click or tap the three dots on the song title, select Share , and choose a sharing method. [2] X Research source"
    },
    {
      "title": "Click Continue with Spotify.",
      "content": "Click Continue with Spotify . This opens a page that describes the access Share Liked Songs will need to create your shareable playlist. If you're not already signed in to Spotify in your web browser, enter your login information when prompted to sign in now."
    },
    {
      "title": "Review the terms and click Agree.",
      "content": "Review the terms and click Agree . To use Share Liked Songs, you'll need to give the app permission to access your Spotify account data. This won't give the app developer your passwords or any of your personal information, and you can always remove these permissions later."
    },
    {
      "title": "Click Get Your Playlist.",
      "content": "Click Get Your Playlist . Share Liked Songs will now generate a new playlist containing the songs from your Liked Songs list. When the playlist is ready, its URL will appear at the bottom of the page. If you've liked more than 10,000 songs, Share Liked Songs will only be able to access the first 10,000."
    },
    {
      "title": "Click the URL to open your new playlist.",
      "content": "Click the URL to open your new playlist. You now have a playlist called Liked Songs that's easy to share! Your new playlist is public by default. If you want it to be private or only visible to people you share it with, click the three dots at the top of the playlist, then choose Make private . [3] X Research source To share the playlist, click or tap the three horizontal dots at the top of the playlist, choose Share , and then choose a sharing method. For example, if you're on an Android or iPhone, you can share your Liked Songs in a text message, on Twitter, or virtually anywhere else. You can also click or tap Copy link (on mobile) or Copy link to playlist (on a computer) to copy the playlist's URL to your clipboard so you can paste it anywhere."
    },
    {
      "title": "Open the Spotify app on your PC or Mac.",
      "content": "Open the Spotify app on your PC or Mac. The trick is to make sure you're using the official PC or Mac Spotify desktop app, as the web version of the app won't allow you to select all of your Liked Songs at once. If you normally use Spotify in your web browser, you'll need to install the Spotify desktop app, which you can get from https://explore.spotify.com/us/pages/desktop-app . If you're using Spotify on your Chromebook or just don't want to install the desktop app, you can use the Share Liked Songs tool to create your playlist instead. Creating a playlist is easy, even if you don't have Spotify Premium . If you only want to share a single liked song, you can just click the three dots on the song title, select Share , and choose a sharing method."
    },
    {
      "title": "Create a new playlist for your Liked Songs.",
      "content": "Create a new playlist for your Liked Songs. To do so, just click + Create Playlist in the left panel. [4] X Research source This creates a new playlist with a generic name, like \"My Playlist #73.\" You'll probably want to click the generic playlist name and give it a name like \"Songs I Like.\""
    },
    {
      "title": "Click your Liked Songs.",
      "content": "Click your Liked Songs . You'll see it near the top of the left panel. It's the purple-and-white heart icon near the top of the left panel. Now you'll see all of those Liked Songs you haven't been able to share until now."
    },
    {
      "title": "Click any of your Liked Songs once to select it.",
      "content": "Click any of your Liked Songs once to select it. This highlights the song."
    },
    {
      "title": "Press Ctrl+A (PC) or ⌘ Cmd+A (Mac) to select all songs at once.",
      "content": "Press Ctrl + A (PC) or ⌘ Cmd + A (Mac) to select all songs at once. This keyboard shortcut will highlight all of the songs in your Liked Songs list, including those that aren't visible on the screen."
    },
    {
      "title": "Drag the highlighted songs to your new playlist in the left panel.",
      "content": "Drag the highlighted songs to your new playlist in the left panel. Your newest playlist should be at the top of your playlists in the left panel. Dragging the highlighted area will copy all of the songs from Liked Songs to your new playlist."
    },
    {
      "title": "Share your new playlist.",
      "content": "Share your new playlist. Once you've copied the songs, click your new playlist in the left panel to check it out—all of your Liked Songs should be there! [5] X Research source To make your Liked Songs playlist public so it appears on your profile, click the three dots at the top and choose Make public . To copy the link to your Liked Songs playlist so you can share it with others, click the three dots, select Share , and then choose Copy link to playlist ."
    }
  ]
}