{
  "url": "https://www.wikihow.com/Memorize-Times-Tables",
  "title": "How to Memorize Times Tables",
  "steps": [
    {
      "title": "Make a times table chart.",
      "content": "Make a times table chart. It should be a large square divided into 10 vertical sections (columns) and 10 horizontal sections (rows) to make 100 smaller squares. Number each column from 1 to 10 from left to right. Number each row from 1 to 10 from top to bottom. Next, fill in each square with the number you get when you multiply the number of the row with the number of the column. For instance, the square in row 2 and column 3 should be 6, because 2 times 3 is 6. [2] X Research source Put this chart somewhere you’ll see it often, like on your fridge or in your bedroom. If you are memorizing up to the 12s instead of the 10s, give your chart 12 columns and 12 rows, so that you have a total of 144 squares."
    },
    {
      "title": "Practice counting up by 2s, 3s and 4s.",
      "content": "Practice counting up by 2s, 3s and 4s. This is called “skip-counting.” You start with the number you’re counting by, then keep adding that same number. For instance, if you were skip-counting by 3s, you would say “3, 6, 9, 12…” because each of those numbers is what you get if you add a 3. This will help you remember which numbers you get when you multiply by a 2, 3, or 4. [3] X Research source"
    },
    {
      "title": "Practice reciting the 2, 3 and 4 times columns in order.",
      "content": "Practice reciting the 2, 3 and 4 times columns in order. Look at your times table and read the column for 2, 3, and 4 out loud. For instance, you would say “2 times 1 is 2, 2 times 2 is 4, 2 times 3 is 6,” and so on. [4] X Research source You should practice this for about 5-10 minutes twice a day until you can do it easily without looking at the table. [5] X Research source"
    },
    {
      "title": "Learn to say the 2s, 3s, and 4s backwards.",
      "content": "Learn to say the 2s, 3s, and 4s backwards. Start at the bottom of each column and start reciting backwards. For instance, for the 2s you would start with “2 times 10 is 20, 2 times 9 is 18,” etc. Do this until you can say them backwards easily without checking the table."
    },
    {
      "title": "Ask someone to quiz you on what you just learned.",
      "content": "Ask someone to quiz you on what you just learned. Have a friend ask you multiplication questions about the numbers 2, 3, and 4. Have them start by asking you in order (“What is 2 times 1? What is 2 times 2? What is 2 times 3?\" etc.). Do that for 5-10 minutes twice a day, until you can answer each question easily, then have them start asking you the same questions but out of order (“What is 3 times 7? What is 2 times 5?\" etc.). [6] X Research source"
    },
    {
      "title": "Have someone ask you multiplication questions backwards.",
      "content": "Have someone ask you multiplication questions backwards. Instead of saying “2 times 3 equals what?” they will say “6 equals 2 times what?” This will help you really understand each multiplication problem back to front. This is sometimes easier when you can look at the numbers, since you will be used to seeing certain numbers together. Try doing written problems too."
    },
    {
      "title": "Write multiplication problems on triangular flashcards.",
      "content": "Write multiplication problems on triangular flashcards. Cut triangles out of thick construction paper and write the 2 numbers you’re multiplying on 2 of the corners, with the answer on the third corner. That way, you can quiz yourself by looking at 2 corners and figuring out what’s on the third corner. You should only do this once you’re comfortable answering multiplication questions backwards. This exercise is also helpful for learning division. You can also find triangular multiplication flashcards to print out here: https://donnayoung.org/math/tricard1bl.htm"
    },
    {
      "title": "Repeat this process for the rest of the times table.",
      "content": "Repeat this process for the rest of the times table. Divide the remaining columns up and memorize the 5s, 6s, and 7s, then the 8s, 9s, and 10s (and the 11s and 12s if you're learning them). Don’t stop practicing columns once you’ve learned them!"
    },
    {
      "title": "Read stories about multiplication.",
      "content": "Read stories about multiplication. There are several stories written to help readers make sense of multiplication, such as “The Best of Times” by Greg Tang. [7] X Research source Learning with fun stories can help you remember the answers to tricky multiplication questions."
    },
    {
      "title": "Play “Math Card War” with a friend.",
      "content": "Play “Math Card War” with a friend. Take a regular deck of playing cards and take out all the (Jokers) cards. Jacks is 11, Queens is 12, and Kings is 0 (13 if your advanced). Divide the deck evenly among whoever is playing. Each turn, every player draws 2 cards from the top of their deck and multiplies the number on their first card by the number on their second card. Whoever’s cards multiply to the highest number wins that turn, and gets to keep the cards that the other players put down. The player who ends up with all the cards in the deck wins."
    },
    {
      "title": "Play a multiplication game like “Timez Attack.”",
      "content": "Play a multiplication game like “Timez Attack.” Timez Attack is a free computer game designed to help players learn their times tables. Ask an adult or parent to help you download the game onto a computer that you can use. [8] X Research source Greg Tang’s website also has fun multiplication games such as Kakooma, a puzzle that lets you pick the right answer out of a pattern: https://tangmath.com/kakooma"
    },
    {
      "title": "Use songs to help you memorize the times table.",
      "content": "Use songs to help you memorize the times table. You can find fun songs about multiplication online with your parent or teacher’s help, or ask your local librarian if they have any CDs of multiplication songs at the library. [9] X Research source Try searching for “Mr. DeMaio time table songs” or “NumbeRock math songs” on YouTube for some fun educational tunes."
    },
    {
      "title": "Watch videos about the times table.",
      "content": "Watch videos about the times table. You can ask for an adult’s help finding multiplication songs online, or ask them to order a video series like “Times Tales.” Learning with stories, sights and sounds will give you more ways to remember the times table. [10] X Research source"
    },
    {
      "title": "Use a multiplication learning app.",
      "content": "Use a multiplication learning app. “Llama Drama,” “Understanding Math Times Tables,” and “Montessori Math Multiplication” are all high-rated math learning apps that your parents can download onto a phone or tablet. “Zap Zap Math” is another fun app that can be downloaded for free."
    },
    {
      "title": "Make goals and reward yourself when you meet them.",
      "content": "Make goals and reward yourself when you meet them. If your goal is to memorize the 2s, 3s, and 4s in a week, talk to your parents about something fun you can do if you meet that goal, like go out for ice cream or go to the movies. Remember - you only get your reward if you meet your goal, so work hard! You can also put a gold star or sticker next to each row on the times table that you’ve memorized to keep track of how much you’ve learned."
    },
    {
      "title": "Use your fingers to keep track when you multiply.",
      "content": "Use your fingers to keep track when you multiply. If you want to double check your answer, try skip-counting and holding up 1 finger for each number. For instance, if your problem is 2x6, you can skip-count by 2s until you are holding up 6 fingers. You should be on the number 12 when you get to your sixth finger, which is the correct answer. [11] X Research source"
    },
    {
      "title": "Figure it out using “landmark numbers.”",
      "content": "Figure it out using “landmark numbers.” You can use the multiplication problems you do know to figure out the ones you don’t. If you don’t know what 5x6 is, but you do know what 6x6 is, find the answer to 6x6 and then subtract 6. Any time the problem you’re working on is close to one you know the answer to, find the answer you know and then add or subtract to get the right answer."
    },
    {
      "title": "Learn the 9s trick.",
      "content": "Learn the 9s trick. Hold your fingers out in the front of you and count on them from left to right until you get to the number you’re multiplying by 9 (for instance, if you’re multiplying 9 times 3, count 3 fingers). Bend that finger down. Now count the fingers that are up on the left side - that’s the first digit of your answer. Count the fingers that are up on the right side - that’s the second digit. [12] X Research source"
    }
  ]
}