{
  "url": "https://www.wikihow.com/React-when-Your-Boyfriend-Kisses-You-in-Front-of-Your-Friends",
  "title": "How to React when Your Boyfriend Kisses You in Front of Your Friends",
  "steps": [
    {
      "title": "Let yourself blush or be surprised if you weren’t expecting it.",
      "content": "Let yourself blush or be surprised if you weren’t expecting it. Sometimes when your boyfriend kisses you, you may not be expecting it, like if he comes up behind you. If you blush easily and can feel the heat rising to your cheeks, there may be nothing you can do to stop it. Trust that the moment will pass quickly. [1] X Research source You could even call attention to your reddening cheeks by saying something like, “I can feel my face getting hot!” Chances are, your friends will laugh a little and you can move on from the moment. You’ll have explained the blush and can redirect the attention elsewhere in the group, which should help your skin calm down quickly."
    },
    {
      "title": "Kiss your boyfriend back for a few seconds.",
      "content": "Kiss your boyfriend back for a few seconds. If you want to, it’s okay to return the kiss, but try to keep it short so your friends won’t feel uncomfortable. This should just be a peck and shouldn’t involve french kissing or heavy petting. Remember, you’re in front of other people so it’s not the right time to move into a really intense, passionate kiss. [2] X Research source If your relationship is new, this can be a great way to get other people used to seeing you together, too."
    },
    {
      "title": "Return to the conversation or activity you were doing before the kiss.",
      "content": "Return to the conversation or activity you were doing before the kiss. It may be really exciting to see and kiss your boyfriend, but if you’re with other people, you should try and be in the moment with everyone. It’s okay to hold hands or sit next to each other, but avoid keeping your lips locked for more than a few seconds. [3] X Research source Be sensitive to the others in your group. Maybe you have a friend who just went through a breakup or who is crushing hard on someone who doesn’t feel the same way."
    },
    {
      "title": "Avoid making out in front of your friends or ignoring them.",
      "content": "Avoid making out in front of your friends or ignoring them. No one wants to watch you and your boyfriend slip from a quick kiss to a full-on make-out session. That can make people feel alienated and uncomfortable, which definitely isn’t how you want people to feel when your boyfriend is around. [4] X Research source If your boyfriend seems like he is moving toward a more passionate moment, gently end the kiss and pull back from him to signal that you’re done for the time being."
    },
    {
      "title": "Smile at your boyfriend and hold his hand after the kiss.",
      "content": "Smile at your boyfriend and hold his hand after the kiss. In general, hand holding is a really acceptable form of public affection, and holding your boyfriend’s hand after a kiss will show him that you feel fondly toward him. Especially if you are new to kissing in public, this can affirm that what he did was okay with you. If your boyfriend just joined your group and someone was already sitting beside you, ask if it’s okay to change seats, or just have your boyfriend sit somewhere else. There will be plenty of time for handholding later on!"
    },
    {
      "title": "Leave the group if you want some one-on-one time with your boyfriend.",
      "content": "Leave the group if you want some one-on-one time with your boyfriend. If you do decide you’d like to spend some alone time with your boyfriend, go for a short walk together. This could give you some extra time to connect or kiss more without making anyone in your group feel uncomfortable. [5] X Research source If you do go off alone, make sure you rejoin the group before too long so nobody starts to worry about you. Try saying something like, “John and I are going to go for a walk to catch up, but we’ll be back in a little while.”"
    },
    {
      "title": "Pull back from the kiss gently but firmly.",
      "content": "Pull back from the kiss gently but firmly. If you’re taken by surprise when your boyfriend kisses you and you feel uncomfortable, it’s okay to step back or pull back. Try to avoid jerking away from him, because this might make him feel like you don’t like him. In the beginning of a new relationship it’s normal to expect that this might come up, especially if you and your boyfriend haven’t talked about boundaries yet. Avoid making big eyes or acting grossed out. If you can, maintain a neutral expression so that your friends don’t make a big deal out of the kiss."
    },
    {
      "title": "Touch them on their shoulder or leg to reassure them.",
      "content": "Touch them on their shoulder or leg to reassure them. If you want to reassure your boyfriend that you still like them, try placing your hand on their shoulder or leg or even hold his hand. These smaller displays of affection can reaffirm that he didn’t do anything wrong and that you still like him. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If he tries to kiss you again, try turning away from him a little bit and starting a conversation with someone else."
    },
    {
      "title": "Act like things are normal so no one starts to feel uncomfortable.",
      "content": "Act like things are normal so no one starts to feel uncomfortable. If you act nonchalant and like nothing big just happened, your boyfriend and your friends will feel more at ease, too. If you get squirmy or start ignoring your boyfriend, this might make everyone else feel uncomfortable. There will be a time and place to talk to your boyfriend later. If he pushes you and asks why you don’t want to kiss, you could say something simple like, “Can we talk about that later?” or “Oh, I don’t really love public displays of affection.”"
    },
    {
      "title": "Talk privately to explain why you didn’t want to kiss in public.",
      "content": "Talk privately to explain why you didn’t want to kiss in public. Don’t just rely on your body language to communicate with your boyfriend. When you have a few minutes to talk alone, use your words to explain how you feel. [7] X Expert Source Michelle Jacoby Matchmaker & Dating Coach Expert Interview. 7 September 2021. Chances are, your boyfriend won’t want to make you uncomfortable and will be glad to know how you feel. [8] X Research source You could say something like, “I really like you, but I feel uncomfortable kissing in front of other people. Could we keep that private between the two of us?” Or, “I love kissing you, but I don’t want to make anyone else feel uncomfortable. I’d prefer it if we just held hands in public and don’t kiss in front of other people.” If your boyfriend doesn’t respect what you tell him, though, you may want to think about ending the relationship . If you tell someone you don’t like to be touched in whatever particular way, that needs to be respected."
    },
    {
      "title": "Set boundaries so you both are aware of the other person’s needs.",
      "content": "Set boundaries so you both are aware of the other person’s needs. Now that you and your boyfriend are talking about what you are comfortable with, go ahead and set some boundaries. Maybe you can agree to a quick peck in public but nothing longer than that, or perhaps you are only okay with hand-holding in front of other people. [9] X Expert Source Michelle Jacoby Matchmaker & Dating Coach Expert Interview. 7 September 2021. [10] X Research source Boundaries can change over time, too, so don’t be afraid to revisit this conversation in a couple of months if your feelings have changed."
    }
  ]
}