{
  "url": "https://www.wikihow.com/Measure-Helmet-Size",
  "title": "How to Measure Helmet Size",
  "steps": [
    {
      "title": "Determine helmet shape.",
      "content": "Determine helmet shape. You should consider helmet shape before measuring for helmet size. This is especially important if you are looking for a motorcycle helmet. There are three main types of shapes, which are long oval, intermediate oval, and round oval. The helmet shape matters for most helmet types, though it is more important for motorcycle and riding helmets. [1] X Research source Long oval means that the shape of the head, and helmet, is longer front-to-back than side-to-side. Intermediate oval means that the shape of the helmet will be slightly longer from front-to-back than from side-to-side. This is the most common shape. A round oval shape is one that is almost equal from front-to-back as it is side-to-side."
    },
    {
      "title": "Wrap the flexible measuring tape around your head.",
      "content": "Wrap the flexible measuring tape around your head. You should position it just above your eyebrows. Make sure the measuring tape lays flat against your head but doesn't pinch. It should be level all the way around. [2] X Research source Doing this on your own is a challenge. Ask a friend or family member for help, or use a mirror to help you level the tape. If you're measuring your head circumference on your own, cross the ends of the tape on the front of your head to make reading the measurement easier."
    },
    {
      "title": "Read the measurement off the tape.",
      "content": "Read the measurement off the tape. Take several measurements. The largest measurement you take is the measurement to go by. Write down this measurement so that you will remember it when it comes to choosing a helmet. [3] X Research source"
    },
    {
      "title": "Determine helmet type.",
      "content": "Determine helmet type. The type of helmet you choose depends on what you need it for. Each type of helmet is designed to withstand the specific types and forces of impact unique to that sport. For example, don't wear a bicycle helmet for climbing, or a batting helmet on your motorcycle. In some instances, there may be multiple types of helmet for one sport, like biking. A mountain bike helmet is made specifically for an off-road terrain. A road helmet is lightweight and compact for aerodynamic advantages. A BMX bike helmet is made to fit the demands of BMX racing. A leisure helmet is a helmet made without more advanced features."
    },
    {
      "title": "Select a helmet designed to fit your head circumference.",
      "content": "Select a helmet designed to fit your head circumference. Most helmets are designed to fit a range of head circumference measurements. Most helmet manufacturers list the head circumference prominently on the helmet packaging. You may see a size designation--small, medium or large--that correlates with a helmet sizing chart that lists head circumference measurements."
    },
    {
      "title": "Try the helmet on.",
      "content": "Try the helmet on. Try the helmet on before purchasing to make sure it fits correctly. The helmet should cover both your forehead and the back of your head. If you put it on and shake your head front and back or side to side, the helmet shouldn't wobble in either direction. And if somebody puts their hand on top of the helmet and twists it, your head should go with the helmet. If the helmet twists freely on your head, it's too loose."
    },
    {
      "title": "Adjust the helmet's chin strap.",
      "content": "Adjust the helmet's chin strap. If the helmet requires a chin strap, check it before use. It should fit snugly, but not pinch. The chin strap shouldn't restrict your ability to breathe, swallow, or speak. It should not, however, be so loose that you can easily fit a finger between the strap and your chin."
    },
    {
      "title": "Try additional padding.",
      "content": "Try additional padding. Many helmets come with removable padding that can be washed after use to keep them hygienic. It is also an option to buy additional padding to add to the helmet. You should only buy additional padding if you can not find a helmet that fits you snugly and properly."
    },
    {
      "title": "Inspect before use.",
      "content": "Inspect before use. Check the helmet or have it inspected before each use. The helmet should not be cracked, missing foam, or damaged in any way. If the helmet is damaged, do not use it. Instead, return it to the store, or send it back to the manufacturer. If you must return the helmet, do not ride, bike, or play until you receive another one."
    }
  ]
}