{
  "url": "https://www.wikihow.com/Oval-Face-Shape",
  "title": "What Is an Oval-Shaped Face? An Expert Guide",
  "steps": [
    {
      "title": "An oval shape is longer than it is wide.",
      "content": "An oval shape is longer than it is wide. Additionally, the width of the forehead is slightly smaller than the width of the cheekbones, and the jawline and chin are more rounded rather than sharp. [1] X Research source Picture the shape of an upside-down egg, with the wider part representing the top half of your face and the narrower bottom representing the chin, and you'll have a general idea of the shape. Celebrities with oval-shaped faces: Beyoncé, Bella Hadid, Charlize Theron, Julia Roberts, Cindy Crawford, Rihanna, Tyra Banks, Jessica Alba, Ryan Gosling, Ryan Reynolds, Jake Gyllenhaal, Justin Bieber"
    },
    {
      "title": "Measure your face to determine if it’s longer than it is wide.",
      "content": "Measure your face to determine if it’s longer than it is wide. One of the defining characteristics of oval-shaped faces is that the length measurement is bigger than the width measurement, so this is a good place to start. Here’s how to take them: [2] X Research source Using a flexible tape measure or a ruler, measure from the center of your hairline down to the center of your chin. Next, measure the distance between the highest point of one cheekbone and the highest part of your other cheekbone. Keep the tape measure flat, rather than curving it across your face. Compare the two measurements. If the length (hairline to chin measurement) is greater than the width (cheekbone to cheekbone measurement), this is a sign that you have an oval-shaped face."
    },
    {
      "title": "Compare your forehead and cheekbone widths to see if your forehead is smaller.",
      "content": "Compare your forehead and cheekbone widths to see if your forehead is smaller. In most oval-shaped faces, the forehead width will be slightly smaller than the cheekbone width. [3] X Research source Measure across the center of your forehead from your hairline on one side of your face to your hairline on the other side of your face. Don't curve the tape measure around your face—keep it flat. If your forehead measurement is slightly greater than your cheekbone measurement, this is another sign you have an oval-shaped face."
    },
    {
      "title": "Check the proportions between your chin, lips, nose, eyes, and hairline.",
      "content": "Check the proportions between your chin, lips, nose, eyes, and hairline. Sanderson explains that oval faces are very proportional, meaning the distance from the chin and the lips, from the lips and the nose, from the nose to the eyes, and from the eyes to the hairline are all roughly equal. You can use your tape measure or ruler to check the distance between these points on your face, or you can just use your hands. For example, Sanderson says an oval face may be something like “three fingers from lips to chin, three fingers from lips to nose, three fingers from eyes to nose, and three or four fingers from the top of the forehead to the eyes.”"
    },
    {
      "title": "Check to see if the lines of your face are more rounded than angular.",
      "content": "Check to see if the lines of your face are more rounded than angular. Oval-shaped faces tend to have soft curves, rather than sharp lines or angles. [4] X Research source For example, if your jawline is slightly rounded, rather than dramatic, and your cheekbones appear curved, rather than stark and prominent, these are more signs you have an oval face."
    },
    {
      "title": "Oval face shapes look amazing with a wide range of haircuts.",
      "content": "Oval face shapes look amazing with a wide range of haircuts. If you’ve determined you have an oval-shaped face, you’re in luck–pretty much any haircut will look fantastic on you! In fact, Pittman explains that oval is considered the “ideal” face shape when it comes to hair cutting. The balanced proportions and symmetry make it super versatile and easy to flatter, whether you want a pixie, bob, mid-length cut, or long flowing locks. [5] X Research source"
    },
    {
      "title": "Consider trying out some bangs.",
      "content": "Consider trying out some bangs. If your oval face is a bit on the longer side, Pittman recommends getting some bangs or fringe. “That horizontal line going across [your forehead] actually reduces how long your face looks, and it creates some width,” which balances things out."
    },
    {
      "title": "Avoid cuts with too much volume at the top.",
      "content": "Avoid cuts with too much volume at the top. Although most hairstyles suit oval-shaped faces, one thing to steer clear of is a pixie cut with a lot of volume in an upward direction. This elongates the face, and since ovals are already proportional, it might make your face look a bit too long. [6] X Research source A shorter pixie or a pixie with the hair styled downward would be totally fine, though!"
    },
    {
      "title": "Opt for a sleek bun or ponytail.",
      "content": "Opt for a sleek bun or ponytail. A sleek bun or high pony would look super chic, elegant, and sophisticated on an oval-shaped face. Oval faces have very balanced proportions and a lot of symmetry, and wearing your hair up can really highlight these attributes! [7] X Research source"
    },
    {
      "title": "Go for a long, straight hairstyle with a middle part.",
      "content": "Go for a long, straight hairstyle with a middle part. Long, straight hair is a classic look for oval face shapes. [8] X Research source This sleek style draws attention to your face’s balanced proportions and soft curves, and parting your hair in the middle enhances your natural symmetry. [9] X Research source"
    },
    {
      "title": "Try out some curls or beachy waves.",
      "content": "Try out some curls or beachy waves. If your oval face is a little on the long and narrow side, go for some waves or curls . The volume of these styles adds some width to your face, which balances out your proportions. [10] X Research source If you have straight hair, use a curling iron or heatless curl set to create this look, or if you have naturally curly hair, just go about your regular curl routine!"
    },
    {
      "title": "Put some blush on the apples of your cheeks.",
      "content": "Put some blush on the apples of your cheeks. Oval-shaped faces are narrower than they are long, so it’s a good idea to draw some attention to your cheeks to create a bit more width there. To do this, apply some blush to the apples of your cheeks, then blend it upward toward your temples. This creates a lifted, flattering look. [11] X Research source"
    },
    {
      "title": "Contour your forehead.",
      "content": "Contour your forehead. When it comes to contouring, the goal for an oval-shaped face is to balance out the length and make the face seem slightly shorter. To do this, apply cream or powder contour across the top of your forehead, blending it into the hairline. This draws attention away from an elongated forehead and creates a more balanced look. [12] X Research source"
    },
    {
      "title": "Apply highlighter to your cheekbones, nose, and brow bones.",
      "content": "Apply highlighter to your cheekbones, nose, and brow bones. Since oval-face shapes tend to have pretty amazing bone structure already, you usually won’t need to do much contouring aside from your forehead. Instead, use liquid or powder highlighter to draw attention to the prominent points of your face. Apply it onto your cheekbones, down the bridge of your nose, and across your brow bones. [13] X Research source"
    },
    {
      "title": "Try rectangular or square glasses.",
      "content": "Try rectangular or square glasses. As with haircuts, the good news for oval faces is that they look good in pretty much all frame shapes. That being said, rectangular and square shapes are a good place to start if you’re unsure. The sharper angles of these shapes contrast nicely with the softer, rounded edges of most oval faces, creating a super harmonious look. [14] X Research source"
    },
    {
      "title": "Go for some cat-eye frames.",
      "content": "Go for some cat-eye frames. The pointed edges of cat-eye glasses draw attention to your cheekbones, which is perfect for oval-shaped faces. They create the illusion of a bit more width, which is very balancing if your oval face is on the longer or narrower side. [15] X Research source"
    },
    {
      "title": "Try aviator or clear glasses.",
      "content": "Try aviator or clear glasses. The thinner frames of aviator glasses and the see-through frames of clear glasses give your facial features a chance to truly shine. They don’t draw attention away from your balanced proportions and natural symmetry—instead, they blend into the background, so your amazing bone structure can be the star of the show. [16] X Research source"
    },
    {
      "title": "Oblong and oval faces are similar, but not the same.",
      "content": "Oblong and oval faces are similar, but not the same. Both are longer than they are wide, but oblong faces tend to be a bit more angular (similar to a square-shaped face), whereas oval faces are more curved. The jawline on an oblong face also tends to be a bit wider, whereas the jaw on an oval face is more narrow. [17] X Research source"
    },
    {
      "title": "There are five other possible face shapes you could be.",
      "content": "There are five other possible face shapes you could be. If you’re actually not quite sure that you have an oval face, one of these other shapes might be a better fit. Here's a short overview of each so you can check: Round: The length and width of the face are about equal, and the hairline and jawline are both rounded. The angles of the face are softer and curved rather than angular. Square: The forehead, cheekbones, and jawline are about equally wide (or very close in measurement). The proportions are similar to round faces, but features are sharper and more angular. Diamond: Essentially a more angled version of an oval face. The face is longer than it is wide, and the cheeks are slightly wider than the forehead, but the angles are sharper, and the cheekbones are more prominent. [18] X Research source Heart : The face is widest at the brows and cheekbones and tapers down to a narrow, pointed chin. This shape often has a widow’s peak, as well. Oblong/Rectangular : The cheeks, jawline, and forehead are all the same width (or similar widths), and the face is longer than it is wide."
    }
  ]
}