{
  "url": "https://www.wikihow.com/Open-Cable-Ties",
  "title": "How to Undo Zip Ties Without Breaking Them",
  "steps": [
    {
      "title": "Find the box-shaped locking mechanism at one end of the zip tie.",
      "content": "Find the box-shaped locking mechanism at one end of the zip tie. A ready-to-use zip tie has one end that tapers to a point while the other is capped with a tiny cube. When used, the pointy end is fed through a slot in the cube to form a loop and then pulled tight. The cube is the locking mechanism that catches on teeth along the tie and keeps it from worming back out through the slot. [1] X Research source Zip ties (also called cable ties) can be put to a wide variety of practical uses, including organizing cords, creating a quick key ring, or locking your backpack."
    },
    {
      "title": "Bend the zip tie’s loose end back to expose the locking mechanism.",
      "content": "Bend the zip tie’s loose end back to expose the locking mechanism. The zip tie’s loose end tends to curve over the locking mechanism once it’s fed through it. Bending the zip tie away from that side of the cube exposes the locking mechanism, so you’re able to “unlock” the tie. [2] X Research source"
    },
    {
      "title": "Depress the locking bar with your fingernail or a screwdriver.",
      "content": "Depress the locking bar with your fingernail or a screwdriver. Look underneath the loose end of the zip tie where it exits the cube. There’s a small bar or tab that catches on the zip tie’s teeth. Use your fingernail or a pocket-size screwdriver to push down on the bar. This releases the locking mechanism. [3] X Research source Or, try pushing the sharp end of a safety pin through the lock to hold the bar up. Just be careful not to prick your finger! Another option is to use a pair of needle-nose pliers to gently squeeze the box and disengage the locking bar."
    },
    {
      "title": "Pull the loose end back through the lock.",
      "content": "Pull the loose end back through the lock. Keep pushing down on the bar. As you do, use your other hand to slowly draw the loose end back through the cube. Once it’s out, you’re all done! [4] X Research source"
    },
    {
      "title": "Refrain from trimming zip ties to reuse them.",
      "content": "Refrain from trimming zip ties to reuse them. Many people like to trim the tail of a zip tie for a neater look. To use the same tie over and over again for different things, leave the loose end long after locking the tie. All that excess may be unsightly but remember: once you snip it off, you’ll only be able to use that tie for bundles of the same size or smaller. Instead of cutting off the end, tuck it into the loop of the zip tie for a neater look."
    },
    {
      "title": "Anticipate wear and tear when reusing a zip tie.",
      "content": "Anticipate wear and tear when reusing a zip tie. Keep in mind that single-use zip-ties are designed to be used one time. Even though you can technically undo and use them again, expect the plastic teeth to wear down the more you undo and retie them. Also, keep in mind that manipulating the locking mechanism damages it a little each time. The tie may develop a looser grip over time, so avoid using old ones to tie anything that really, really needs to be secured. If the zip tie gets easier and easier to undo every time you use it, the teeth may be wearing down. Toss it and use a new one."
    },
    {
      "title": "Use reusable cable ties for jobs that require unlocking the tie regularly.",
      "content": "Use reusable cable ties for jobs that require unlocking the tie regularly. If you’re constantly using and reusing single-use ties for short-term projects, consider another option. Invest in some cable ties that are specifically designed for reuse. They work the same way as a standard zip tie, except they have a small button or trigger on the clocking mechanism, so they’re easier to unlock. [5] X Research source Reusable zip ties cost a little more than standard zip ties, but the money may be worth it if it saves you time. Reusable zip ties are much easier to open, so they may not be ideal to use for something that needs to stay secure for an extended time."
    },
    {
      "title": "Try worming your hands out of the zip tie.",
      "content": "Try worming your hands out of the zip tie. When a captor binds your hands, be sure to squeeze them into fists with the tops of your hands facing up. This makes your hands and wrists take up more space, causing your restraints to be larger. [6] X Research source Then, when no one’s looking, relax your hands and turn your palms toward each other. Focus on worming your thumbs out first to make the rest easier. [7] X Research source Always try this method to escape being tied up first. Another method requires you to tighten the cable tie (which will make trying to do this afterward much tougher)."
    },
    {
      "title": "Or, spring the zip tie’s locking mechanism open with a shim.",
      "content": "Or, spring the zip tie’s locking mechanism open with a shim. If you’re being held with other prisoners, coordinate between yourselves. Find a shim of some sort that’s small and firm enough to manipulate the bar inside the locking mechanism. Have one person use the shim to free the other by lifting the bar from the zip tie’s grooved tracks. Once it’s lifted, pull the tie free of the mechanism. [8] X Research source Possible shims are a nail, screw, fork, pin, pen, pencil, key, or the corner of a credit card. If nothing’s in reach, try your fingernail. This is method works best with a partner, but is also possible on your own."
    },
    {
      "title": "Tighten the zip tie and then snap it in two.",
      "content": "Tighten the zip tie and then snap it in two. To snap the zip tie, use your hands or teeth to position the cable tie’s locking mechanism (which is where the tie is weakest) in between your wrists. Pin the locking mechanism between your hands or the balls of your thumbs. Then grip the tie’s loose end between your teeth and pull to tighten it as much as possible. Next: [9] X Research source Raise your hands above your head and then swing them down in toward your stomach as fast as you can. As you swing your arms down, focus on touching your shoulder blades together and sticking your elbows out like wings. Repeat if needed until the locking mechanism snaps in between your hands."
    }
  ]
}