{
  "url": "https://www.wikihow.com/Shut-Off-a-Jammed-Horn",
  "title": "How to Shut Off a Jammed Horn",
  "steps": [
    {
      "title": "Push the horn several times.",
      "content": "Push the horn several times. Pushing on your steering wheel a few times may dislodge a stuck switch in the horn's assembly. [1] X Research source You can also try twisting your steering wheel back and forth a few times."
    },
    {
      "title": "Disconnect the car battery",
      "content": "Disconnect the car battery . This will silence the horn, and if you're lucky it may reset the horn and solve the problem (although there may be an underlying issues that causes it to recur). [2] X Research source It's also a good idea to disconnect the battery before trying the steps below, to reduce the danger of electric shock or short circuits. Follow these steps to disconnect the battery safely: Turn off the engine. (Leave it off for the steps below as well.) Wear insulated gloves and safety goggles. Remove all metal jewelry. Find a socket wrench that fits the terminal (typically ⅜ inches). Disconnect the negative terminal first. This typically has a - symbol and is connected to a black wire. Use caution to avoid creating a short with the wrench or wire. Disconnect the positive terminal."
    },
    {
      "title": "Disconnect the fuse connected to the horn.",
      "content": "Disconnect the fuse connected to the horn. Check your car's manual to find out where the fuse box is located. The fuse box cover or the manual should have a diagram that tells you which fuse is part of the horn's wiring. Turn off the ignition, then pry the fuse out by hand or with fuse pullers. If you do not have your car manual, search online for your make and model, followed by \"manual\" or \"fuse diagram.\" The fuse box is usually located under the driver's side dash, in the driver's side doorjamb, or in the glovebox. [3] X Research source Many cars have a second fuse box in the engine compartment. Some models, especially older ones, run several electrical components on the same fuse as the horn. Inspect the fuse diagram so you know what else will be affected."
    },
    {
      "title": "Remove the horn relay.",
      "content": "Remove the horn relay. Most cars have a horn relay, which feeds extra current into your horn. This is usually a cube with a diagram on the side, plugged into a slot in the under-hood fuse box. [4] X Research source An inoperative relay typically stops your horn from working, but it is possible for it to jam the horn in an on position. [5] X Research source Even if the relay is not the problem, removing it should disable the horn. Refer to the wiring schematic on the fuse box lid or in your owner's manual to identify the correct relay. If your horn sounds different than usual or you do not hear the usual clicking sound when you press it, the relay is likely shorted. Replace it and try to discover the cause of the short, such as a damaged wire or water in the fuse box."
    },
    {
      "title": "Disconnect the horn itself.",
      "content": "Disconnect the horn itself. If your car has no relay and the horn's fuse is on the same circuit as other important components, remove the horn itself. This is located under the hood, usually behind the front grille or attached to the firewall behind the engine. [6] X Research source The horn is typically shaped like a loudspeaker or a toroid (doughnut). Disconnect the wires leading to the horn. Cover the exposed wires with electrical connectors or electrical tape to prevent a short if you plan on driving the car to an auto repair shop. Many cars have two horns, but these are usually attached to the same unit. Refer to your owner's manual wiring schematic if you are having trouble locating the horns. The battery must be disconnected while removing this part. Remove all jewelry and dangling clothing before reaching below the hood."
    },
    {
      "title": "Look for moisture that could be causing a fault.",
      "content": "Look for moisture that could be causing a fault. This may happen after a severe rainstorm, or if your car has been power washed under the hood by yourself or your dealer. If you see any moisture in the fuse box, disconnect the battery and leave the car to dry out. Severe water buildup or corrosion may require a mechanic to repair. [7] X Research source"
    },
    {
      "title": "Install an auxiliary horn button.",
      "content": "Install an auxiliary horn button. If the switch inside your steering column is jammed, one solution is to install an auxiliary horn that bypasses this switch, available from any auto parts store. Check your owner's manual to make sure you wire it to the 12v line that powers your horn. This is best used as a temporary fix until you can get the faulty part replaced."
    },
    {
      "title": "Have an experienced mechanic remove the airbag.",
      "content": "Have an experienced mechanic remove the airbag. The remaining solutions involve the steering column, which also contains an airbag in most cars. If you do not properly deactivate and remove the airbag, it may deploy with extreme force. Some cars have a backup battery for the airbag which may allow it to deploy even when the main battery is disconnected. Do not to try this yourself unless you are confident you have the expertise to disable it safely, and you have an owner's manual to guide you. [8] X Research source Always disconnect the battery first and wait at least thirty minutes for the power to drain from the airbag system."
    },
    {
      "title": "Dry out water in the steering column.",
      "content": "Dry out water in the steering column. If there is any corrosion or moisture inside the steering column, water could be shorting your system and causing the stuck horn. Try drying it with an air compressor, and spraying damp parts with an electrical cleaner. Reassemble the steering column once it is dry, and the horn may work again."
    },
    {
      "title": "Replace the switch or clock spring.",
      "content": "Replace the switch or clock spring. If the electrical parts are all functional, the horn switch under the steering wheel may be jammed. Another possibility is a broken clock spring: the coil that winds and unwinds as you turn the wheel to maintain the electrical connection. The clock spring is especially likely to be the problem if your airbag warning light is on, or if you have noticed other issues with electrical components on your steering column. [9] X Research source You may wish to have a mechanic install the clock spring."
    }
  ]
}