{
  "url": "https://www.wikihow.com/Resist-the-Temptation-of-Popping-Pimples",
  "title": "How to Resist the Temptation of Popping Pimples",
  "steps": [
    {
      "title": "Prevent skin damage by avoiding picking.",
      "content": "Prevent skin damage by avoiding picking. Realize that by popping your pimples, they will probably bleed and form scabs. If you choose to pick at these scabs, scars will continue to erupt across your face. There is also a good chance it will get infected. Finally, the pimples will worsen and your face will take longer to clear. [1] X Expert Source R. Sonia Batra, MD, MSc, MPH Board Certified Dermatologist Expert Interview. 19 February 2021"
    },
    {
      "title": "Keep your hands busy.",
      "content": "Keep your hands busy. Many people pop pimples when they space out or don’t realize that they are doing it. Try activities like reading, crossword puzzles, handheld games, or similar activities when you have free time. Recognizing ahead of time that your hands are liable to drift when you aren’t thinking will help you control them when they do. [2] X Research source"
    },
    {
      "title": "Limit your face time.",
      "content": "Limit your face time. Looking in the mirror is a reminder of your pimple. When you know you have a pimple, avoid looking long in the mirror in the bathroom and opening your visor mirror in the car. You’ll be surprised how quickly your pimple seems to go away if you take measures to avoid being reminded of it. You might even try putting a sticky note on your bathroom mirror that says something like, “Hands off your face!” This way you can look in the mirror, but be reminded not to pop your pimples. [3] X Research source"
    },
    {
      "title": "Replace the urge to pop with something else.",
      "content": "Replace the urge to pop with something else. In many cases, these habits are a result of impulses that come and go pretty quickly. There are numerous ways to divert your natural urge to touch your skin. Try wearing a rubber band on your wrist and snapping it gently when you feel like popping. Or, you can clench your fists for several seconds or even a half minute. [4] X Research source"
    },
    {
      "title": "Cover your fingers.",
      "content": "Cover your fingers. One easy thing to do is wear gloves around the house. It will make it harder for you to pop a pimple, and it keeps your finger oils from getting on your face. This is great if you touch your face a lot, and it will keep dirt off your face. When you are out, cover your primary picking fingers with small adhesive bandages to put a barrier between them and your pimple. [5] X Research source"
    },
    {
      "title": "Don’t pick popped pimples.",
      "content": "Don’t pick popped pimples. Opening them up does not make them go away. Instead, you are irritating your skin and increasing the risk of infection. If you accidentally popped your pimple, the best thing to do is leave it alone. The more time you keep your hands off the face, the quicker your skin will totally heal."
    },
    {
      "title": "Consider habit reversal training.",
      "content": "Consider habit reversal training. This is training you do with a therapist. They will show you the ways your subconscious forms unhealthy habits and how to break them. Ask your doctor if they can make a recommendation, or do a simple web search to find habit reversal training therapists in the area."
    },
    {
      "title": "Gently scrub with a skin cleanser.",
      "content": "Gently scrub with a skin cleanser. Splashing water is a good way to keep your face clean regularly. If your skin is especially dirty or you want to help a pimple heal faster, try a skin cleanser, or exfoliating scrub. However you wash your face, make sure to pat your face dry with a towel to avoid irritating your skin. [6] X Research source"
    },
    {
      "title": "Apply benzoyl peroxide.",
      "content": "Apply benzoyl peroxide. This is a simple chemical agent that dries out the affected area of skin. Though keeping your skin hydrated is a good way to keep it healthy, drying pimples helps them heal more quickly. [7] X Expert Source R. Sonia Batra, MD, MSc, MPH Board Certified Dermatologist Expert Interview. 19 February 2021 A doctor can prescribe a safe benzoyl peroxide cream."
    },
    {
      "title": "Use antibiotics if necessary.",
      "content": "Use antibiotics if necessary. It is rare, but possible for a pimple to get infected even if you don’t pop it. See your doctor for antibiotics to fight the infection. It is important to heal an infected pimple early to reduce the risk of scarring or other long-term problems. If your pimples are red, inflamed, or painful, they may be infected. Antibiotics are an easy way to treat this. [8] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Ask a doctor about other treatments if you have severe acne.",
      "content": "Ask a doctor about other treatments if you have severe acne. They can prescribe treatments like Accutane, which reduces the amount of oils your skin produces. It also probably means that your skin needs special products to keep it healthy. Over the counter products may be a part of your chronic problem. [9] X Research source"
    },
    {
      "title": "Consider using cover-up.",
      "content": "Consider using cover-up. This will be easier for girls than guys – both in obtaining makeup and feeling comfortable using it. You will be less likely to feel the need to aid your pimple in healing the rough way if you are less self-conscious about it. Though it is unlikely that your friends will comment on the pimple, applying cover-up may make you feel more secure."
    },
    {
      "title": "Shift attention elsewhere.",
      "content": "Shift attention elsewhere. You are most likely the only person fixating on your pimple, but there are ways to get others not to focus on it. Try using mascara or eye shadow to bring out your eyes if they are one of your best features. You may also want to try getting a hair-cut or buying some new clothes to detract from your pimples."
    },
    {
      "title": "Try not to dread comments.",
      "content": "Try not to dread comments. Especially if you are a teen, you may be afraid that people will make jokes or comments about your pimple. The worst part of this may be the anticipation. Remember that most people will only joke with you if they like you. Brush off the comment and play it cool. Treat their comment like you treat your pimple: leave it alone and it will go away."
    },
    {
      "title": "Try not to stare at or fixate on your pimple.",
      "content": "Try not to stare at or fixate on your pimple. Avoid looking in mirrors. This will help you keep from obsessing over it. It is important to keep a healthy distance from the pimple. Keep in mind that everyone gets pimples from time to time – especially teenagers, but adults as well. The pimple will go away on its own in no time."
    },
    {
      "title": "Think about your lifestyle.",
      "content": "Think about your lifestyle. Pimples are an unavoidable aspect of adolescence for most people. Unfortunately, they are caused more by genetics and hormones than anything you do or don’t do. Nonetheless, there are ways you can reduce the number and frequency of your acne. Do you often rest your hands on your face? This is a common way that people get acne, as the dirt and oil from your hands clogs the pores on your face. Try putting your hands in your pockets when they are not busy until you train yourself not to rest your hands on your face. Are you stressed out? Feeling under pressure or stressed can contribute to acne. If this is simply a phase of your life, take comfort in knowing that your face will clear up as soon as your life slows down a little. Eating greasy foods do not cause pimples, but being in greasy environments does. If you work at a restaurant, rinse your face every time you use the restroom. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}