{
  "url": "https://www.wikihow.com/Pass-a-Hair-Follicle-Drug-Test",
  "title": "How to Pass a Hair Follicle Drug Test",
  "steps": [
    {
      "title": "Know when you'll have to take a drug test.",
      "content": "Know when you'll have to take a drug test . Drug testing laws vary by state and country. Job applicants are commonly drug tested as part of the hiring process, especially for low or entry-level jobs. In the United States, federal agencies that require drug testing adhere to testing procedures set by the Substance Abuse and Mental Health Services Administration (SAMHSA). Private employers generally have more freedom in their drug testing procedure. However, laws vary from state to state. In the United States, companies that hire commercial drivers are required to have a drug testing program in place. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Certain employers might require you to be drug tested even after you are hired. Random drug-testing may be part of the terms of employment, or you may be required to undergo a test if you are involved in a workplace accident. Make sure you understand a company's drug testing policy before accepting a job offer . Research your local laws if you are unsure whether certain activities or jobs require drug testing."
    },
    {
      "title": "Know which drugs are most commonly tested for.",
      "content": "Know which drugs are most commonly tested for. In the United States, employers that follow SAMHSA testing guidelines generally test for five specific classes of drugs. These drugs are: Amphetamines (methamphetamine, amphetamines, ecstasy(MDMA)) Cocaine (Powder and \"crack\" forms) THC (marijuana, hash, edible cannabis products) Opiates (heroin, opium, codeine, morphine) Phencyclidine (PCP, angel dust) Alcohol is occasionally tested for in addition to the above drugs."
    },
    {
      "title": "Know which drugs employers may also choose to screen for.",
      "content": "Know which drugs employers may also choose to screen for. Private employers are not required to perform the basic SAMHSA test. Many opt for an expanded test that screens for additional drugs. The most common additions are: Barbiturates (phenobarbital, butalbital, secobarbital, downers) Benzodiazepines (Valium, Librium, Xanax) Methaqualone (Quaaludes) Methadone (a drug used to treat heroin addiction) Propoxyphene (Darvon compounds) Nicotine (and nicotine by-product, cotinine)"
    },
    {
      "title": "Know which drugs aren't usually screened for.",
      "content": "Know which drugs aren't usually screened for. The following drugs are detectable in a hair test, but are only rarely tested for. Hallucinogens (LSD, mushrooms, mescaline, peyote) Inhalants Anabolic Steroids Hydrocodone (Oxycodone, Vicodin)"
    },
    {
      "title": "Understand how a hair test works.",
      "content": "Understand how a hair test works. After you consume any drug, the active chemicals in the drug will circulate through your body. These chemicals, or certain other chemicals produced when your body processes the drug (called metabolites), can accumulate in your hair follicles. As a strand of hair grows, its follicle will deposit these chemicals in it. Hair tests look for these chemicals in a small sample of your hair."
    },
    {
      "title": "Understand how your hair is processed.",
      "content": "Understand how your hair is processed. Hair tests cut a small sample of your hair (usually 1-3 clumps of about 50 strands each [2] X Research source ). Most cuts are taken from the back of the head so as not to ruin your haircut. The standard detection window for the hair test is 90 days. Because hair grows about 1.5 inches (3.8 cm) in 90 days, hairs with a length of about 1.5 inches (3.8 cm) are targeted for cutting. Longer hairs will give a longer window of detection.For instance, a 6-inch long strand of hair can potentially reveal drug use from a year ago. However, 90 days is the most common testing window, so, generally, long strands of hair are cut to 1.5 inches (3.8 cm) before being tested. Depending on the drug and the specifics of the testing process, a hair test may or may not be able to detect whether or not use has been discontinued. For instance, opiates bind tightly to the shaft of hair, while cocaine can migrate along the hair shaft. In this case, certain tests can detect the approximate date of the opiate use based upon its position in the hair shaft, while this is impossible for cocaine. [3] X Research source If no hair is available on your head (you're bald or have a shaved head), hair from other parts of your body can be tested. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Note: Because it can take up to a week for drug-affected hair to grow above the scalp, hair tests can miss very recent drug use. [5] X Research source For this reason, some employers will also require a urine test, which can detect most drug use within the last few days. Know which tests you will have to take."
    },
    {
      "title": "Immediately stop any drug use.",
      "content": "Immediately stop any drug use. As soon as you know you'll have to undergo a drug test, stop taking drugs. If possible, cease all drug use before you even begin looking for jobs. Hair tests can detect the use of some drugs, like cannabis , up to 90 days after it's occurred. [6] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Because of this, it may be best to stop drug use up to three months before you think you'll be in the job market."
    },
    {
      "title": "If you're desperate, try a home remedy.",
      "content": "If you're desperate, try a home remedy. If you've used drugs often within the last 90 days and you have a hair test at the end of the week, you may consider using a commercially-available product or a DIY home-method to improve your chances of passing your test. These methods have not been proven to work in a scientific setting. They are supported only by individual, unverified stories of success."
    },
    {
      "title": "At home before your test, begin by saturating your hair with white vinegar.",
      "content": "At home before your test, begin by saturating your hair with white vinegar. You will probably gag, but it's worth it! Work the vinegar through your hair slowly, over a 10 minute period to get maximum saturation."
    },
    {
      "title": "Let the vinegar sit for 15-20 minutes.",
      "content": "Let the vinegar sit for 15-20 minutes. Refrain from rinsing. This gives the vinegar time to sink into the hair and scalp."
    },
    {
      "title": "Next, soak your hair with a salicylic acid acne treatment.",
      "content": "Next, soak your hair with a salicylic acid acne treatment. Use a treatment with a 2% salicylic acid concentration. Again, pour slowly and allow liquid to soak into your hair. Leave the vinegar and acne treatment in your hair for about 30 minutes."
    },
    {
      "title": "Work one capful of liquid detergent through your hair thoroughly.",
      "content": "Work one capful of liquid detergent through your hair thoroughly. Do not rinse the vinegar and acid out of your hair before doing this."
    },
    {
      "title": "Add a dash of water to 1 scoop of powder detergent to make a paste.",
      "content": "Add a dash of water to 1 scoop of powder detergent to make a paste. Scrub this onto your scalp and hair. Let this mixture sit for about 20-30 minutes. If possible, concentrate these products on more the back of your head. Samples are most commonly taken from this area."
    },
    {
      "title": "Rinse all the products out of your hair.",
      "content": "Rinse all the products out of your hair. Do not wash or condition."
    },
    {
      "title": "Dye your hair",
      "content": "Dye your hair using a standard store-bought dying kit. Rinse well. Use the conditioner treatment that usually comes with the hair colour kit."
    },
    {
      "title": "Repeat as needed.",
      "content": "Repeat as needed. Instructions for this remedy vary - some recommend repeating once a day in the four or five days leading up to your test, while some recommend only one treatment."
    },
    {
      "title": "Shop around for a hair treatment.",
      "content": "Shop around for a hair treatment. A quick online search should reveal a variety of commercially-available shampoos and treatments that claim to thwart hair drug tests. These can be expensive, so search for a well-reviewed, reasonably affordable one. Beware false reviews and testimonials. It's easy for unscrupulous companies to pay for positive reviews or even fabricate them entirely."
    },
    {
      "title": "Research your product.",
      "content": "Research your product. Don't depend on testimonials on the site that's selling the product - seek out forum posts and other candid online discussions. Often, if a product doesn't work, you'll be able to find irate complaints or rants online. Choose a product with a money-back guarantee. It seems obvious, but it bears mentioning. Because these products can be quite expensive, you'll want to protect your investment if you end up losing the job."
    },
    {
      "title": "Use your purchase as directed.",
      "content": "Use your purchase as directed. Remember that, because these products aren't scientifically verified, you're not guaranteed success."
    },
    {
      "title": "Get a lawyer",
      "content": "Get a lawyer . It's unlikely you'll be hired if you took the test as part of an application process. However, if you took the test after an accident or for a probation program, you will probably be subject to criminal penalties. A lawyer can help you dispute the results of the test and advise you how to proceed."
    },
    {
      "title": "Try to seek a second test.",
      "content": "Try to seek a second test. Dispute the results any way you can in an attempt to get a second chance. One way to do this is to claim that a failed test is the result your consuming something innocent that gives a false positive. Some things that can give false positives are: Poppy seeds. Because opiates are derived from the poppy plant, muffins or bagels with poppy seeds can give false positives. Adderall/ADHD medication. Medicines prescribed in the treatment of ADHD are usually members of the amphetamine family of drugs. Certain cold/flu medications. Over-the-counter cold drugs can contain the active ingredient pseudoephedrine, which is a stimulant used in the manufacture of methamphetamine (meth.) Nicotine replacement therapy products, such as gums like Nicorette, patches such as Nicoderm CQ, prescription nicotine inhalers, and other nicotine-based smoking cessation aids will cause a positive result for nicotine and cotinine. Heavy exposure to second-hand smoke ('passive smoking') may also cause a positive nicotine/cotinine test, even if you yourself have not used nicotine or tobacco More employers are testing employees and job applicants for nicotine/cotinine, and a positive result may result in loss of employment or a refusal to hire, even if you are in a medically prescribed smoking cessation program, and even if you are not a smoker but merely live in a smoking household."
    },
    {
      "title": "Accept any treatment options.",
      "content": "Accept any treatment options. Occasionally, instead of firing an employee who fails a drug test, employers will require the employee to undergo a treatment program or recommend they seek help on their own. Treating an employee can be much less expensive for the employer than a hefty severance package. In this case, don't refuse treatment, even if you're a responsible user - you'll probably be fired and might lose your pension or benefits."
    }
  ]
}