{
  "url": "https://www.wikihow.com/Sit-with-Hemorrhoids",
  "title": "How to Sit Comfortably if You Have Hemorrhoids",
  "steps": [
    {
      "title": "Adjust your positioning on the toilet.",
      "content": "Adjust your positioning on the toilet. For most of human history, people defecated by squatting in the woods or over a hole in the ground — and a billion or more people around the world still utilize this position today. Squatting with your knees against your abdomen creates a better internal alignment for the release of a bowel movement (and tends to speed the process), and some experts believe this positioning significantly reduces the likelihood of developing hemorrhoids. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If squatting is a step beyond where you're willing to go to deal with hemorrhoids, try raising your feet while on the toilet. Place a low bench or pile of books under your feet. This will improve your internal alignment and may help you pass stools faster and reduce hemorrhoid-causing pressure."
    },
    {
      "title": "Cushion your butt while sitting.",
      "content": "Cushion your butt while sitting. Sitting itself is the real problem when it comes to hemorrhoids, so sitting for too long in even the most comfortable, “cushiony” chairs may leave you with rectal pain and itching; however, a softer seat is preferable to a hard one, so stick a thick cushion or pillow under your rear end when sitting down on a hard chair, bench, etc. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source You can also find a range of products marketed as “hemorrhoid cushions” (or similar) online. There is no guarantee that any of these will help more than a pillow, but they might. “Donut” style cushions of the type used when someone has had surgery or suffered an injury in the anal region are another option to consider. Try them and see what works best for you."
    },
    {
      "title": "Keep your backside cool and dry.",
      "content": "Keep your backside cool and dry. If you've ever had hemorrhoids, you probably know that getting hot and sweaty “between the cheeks” can make your anus unbearably itchy and uncomfortable. Standing or especially sitting in constrictive, heat- and moisture-trapping clothing can make things even worse. Along with keeping the area clean and dry, then, choosing the right clothing can help soothe your posterior pain. [3] X Research source Choose loose-fitting clothing (including undergarments) made of breathable fabrics like cotton. Change into a fresh pair of underwear if the ones you have on get damp from sweat."
    },
    {
      "title": "Spend less time on the toilet.",
      "content": "Spend less time on the toilet. Using the toilet often reveals the presence of hemorrhoids, by way of red blood in the water or on your bath tissue. Sitting on the toilet is also one of the major causes of hemorrhoids, especially if you spend a lot of time there or strain while defecating. The quicker you can get on the toilet, have a bowel movement, and get off, the better. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Don't linger on the toilet unnecessarily, for instance by finishing a chapter in your bathroom reading material of choice or playing on your phone. If your toilet routine takes more than a few minutes because of regular constipation , look into methods of relief like drinking more water, eating more fiber-rich foods, and taking fiber supplements and/or stool softeners. Also, “when you gotta go” — use the toilet right away. “Holding it in” can cause or exacerbate constipation."
    },
    {
      "title": "Don't sit for long stretches elsewhere, either.",
      "content": "Don't sit for long stretches elsewhere, either. Sitting causes increased pressure on the veins in and around your anus, and these stressed veins are where hemorrhoids form. Try standing instead of sitting when watching TV, working at a desk (look for an adjustable model that allows you to both sit and stand), and at other times during your daily routine. It's good for your health and your fight against hemorrhoids. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source When you do need to sit, take breaks to stand up and move around every so often. This can help prevent the pooling of blood that causes hemorrhoids, and can relieve some of the pain of existing hemorrhoids."
    },
    {
      "title": "Get moving while you're standing up.",
      "content": "Get moving while you're standing up. Standing up instead of sitting is good for your health, and exercising instead of standing still is even better. Walking, dancing, gardening, or any other moderate-intensity activity will benefit your body in many ways — including possibly easing your constipation. [6] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Exercise can also help you lose excess weight, which will in turn decrease the pressure on the veins in your posterior when you sit down."
    },
    {
      "title": "Take action against constipation.",
      "content": "Take action against constipation. Anyone can get hemorrhoids, but people with regular constipation almost always get them. Sitting on the toilet for long stretches and straining to push out hard, compacted stools is a “one-two punch” for hemorrhoid formation and discomfort. [7] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source One of the easiest ways to battle constipation is to drink more water. Women are recommended to consume 9 cups (2.2 liters) of fluids daily and men are recommended to consume 13 cups (3 liters). Also, add more fiber to your diet. Eat more vegetables, fruits, and high-fiber grains like oats. Look at the side effects of any medications or supplements you are taking. Constipation may be caused by certain medications. Talk to your doctor about discontinuing or switching your medication if this is the case. Consider also using a fiber supplement or stool softener as well. Consult your doctor before undertaking any long-term regimen, however. Keep in mind that to most effectively avoid constipation, you will want to do a combination of these things. Increasing exercise, fluids, and fiber intake, as well as discontinuing any problematic medications, will all work together to ease constipation better than any one treatment done alone."
    },
    {
      "title": "Keep your “hemorrhoid zone” clean.",
      "content": "Keep your “hemorrhoid zone” clean. Regular, gentle cleaning and drying can help cool and soothe your hemorrhoids. Try, for instance, using pre-moistened (but fragrance-free) wipes instead of standard toilet paper, which tends to be more abrasive and clean less thoroughly. [8] X Research source Shower or — preferably — bathe daily and gently clean the area with water alone. Pat the area dry or use a hair dryer on the lowest setting. You can also use a sitz bath , which is a basin that fits over your toilet bowl and allows you to soak and clean only the target area. Use clean, cool water and sit for 10 to 15 minutes, three times per day (or more as needed)."
    },
    {
      "title": "Try topical treatments or medications.",
      "content": "Try topical treatments or medications. The range of treatments and medications available at any pharmacy provides a clear indication of just how common hemorrhoids are. Try various options and see what provides you with relief, but don't use any hemorrhoid treatment for more than two weeks without clearing it with your doctor first. [9] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Hemorrhoid creams or ointments (such as a well-known “preparation”) can help shrink hemorrhoidal tissues and soothe itching and discomfort. Ointments or pads containing witch hazel may also be effective in dealing with itchiness and pain. On a more basic level, placing a wrapped ice pack or cold compress in your intergluteal cleft (or your \"butt crack\") can provide temporary relief from pain and inflammation. Pain-relieving medications like acetaminophen or ibuprofen may also provide some measure of relief from hemorrhoidal discomfort."
    },
    {
      "title": "Consult your doctor.",
      "content": "Consult your doctor. If you have rectal itching and discomfort, can feel small protrusions outside your anus, and/or see small amounts of red blood when you defecate, you more than likely have hemorrhoids; however, in rare instances, more serious conditions ranging from anal fissures to internal bleeding to cancer may be the cause. The smartest choice is to see your doctor and verify that you are dealing with hemorrhoids, then discuss treatment options. [10] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source While most hemorrhoids can be treated at home, some may require intervention by your doctor. Treatments can range from “banding” hemorrhoids so they wither and fall off to surgical removal (hemorrhoidectomy). The nature of your hemorrhoids, your level of discomfort, and many other factors will come into play as you and your doctor determine your best course of treatment."
    }
  ]
}