{
  "url": "https://www.wikihow.com/Repair-Damaged,-Curly-Hair",
  "title": "How to Repair Damaged, Curly Hair",
  "steps": [
    {
      "title": "Get a trim.",
      "content": "Get a trim. Split ends can’t be repaired, no matter what a product promises. In fact, split ends will continue to split up the hair shaft if they are not trimmed, so the longer you leave them untrimmed, the more damaged your hair will become. [1] X Research source Have a stylist trim off the ends of your hair once every six to eight weeks. If you absolutely cannot go to a stylist, use the sharpest scissors you have to snip off the ends. It's best to ask for help if you must do it at home. Ask your stylist for a professional recommendation about how much of a trim you really need. If you’re concerned about losing length, let the stylist know that you’d like to keep as much hair as you can. Listen to their professional opinion. Stylists know hair and want you looking your best."
    },
    {
      "title": "Take a chemical break.",
      "content": "Take a chemical break. Chemicals cause damage, so give your hair time to recover by avoiding dyes and straighteners. While it may feel like a sacrifice now, even a short break from chemicals can do wonders for speeding up your hair’s repair progress. [2] X Research source If you’re used to having color-treated hair, there are options for coloring your hair without chemicals. These natural treatments are less harsh on your hair. You can try hennas for reds, indigos for dark hair, and citrus for lighter hair. If you choose to try these options, be sure to follow the product directions. Try wearing your natural curls for a while. If you hate the look of your hair and miss having a straightener, try styling your hair into braids or twists. You can also incorporate hats or hair wraps into your outfits. If you are miserable with your natural texture, mix it up with some fun wigs from your local beauty supply store. Wigs allow you to experiment with a variety of styles, colors, cuts, and lengths."
    },
    {
      "title": "Use a deep conditioner.",
      "content": "Use a deep conditioner. Restore and retain much needed moisture so that your brittle hair will feel soft again. After your hair becomes damaged, moisture is a necessity. [3] X Expert Source Jenny Tran Professional Hair Stylist Expert Interview. 19 May 2020. You can find many deep conditioners on the market, but you may also have just what you need in your kitchen cupboard. [4] X Research source Create your own deep conditioning treatments. Aloe vera, honey, coconut oil, olive oil, and shea butter are all great conditioners that you may already have on hand. If you don’t, they are cheap to pick up from your local grocery store. [5] X Research source Mayonnaise, avocados, and bananas also nourish your hair, so incorporate them into your moisturizing regimen. Try mixing two or three of the kitchen-moisturizers for an easy treatment. For example, you could mix coconut oil, honey, and banana. Apply the deep conditioning treatment to damp hair and place a shower cap over your hair. Using a shower cap traps in the moisture so that your hair is better able to soak it in. [6] X Research source You can leave it on overnight, or you can set aside 30 minutes to an hour to let it sit. Too many overnight treatments can make your hair limp. Once a week is the recommended frequency for best results. [7] X Research source"
    },
    {
      "title": "Do a hot oil treatment.",
      "content": "Do a hot oil treatment. While you can purchase hot oil treatments from your local beauty supply or drug store, you can also use oils such as coconut oil to do a hot oil treatment. In fact, coconut oil is a great oil for repairing your damaged curls. [8] X Research source Put your oil into a container. You may want to invest in an inexpensive squeeze container from your local beauty supply store, but a small cup, jar, or bowl will work. [9] X Research source Immerse the container in hot water to warm your oil. [10] X Research source Once your oil has become a warm liquid, apply it to your hair. [11] X Research source Cover your head in a shower cap. To keep in the heat, tie a scarf or towel around your head. [12] X Research source You can also sit under a hooded dry to apply heat to your hair. Do not get your oil too hot. Avoid microwaves and stoves."
    },
    {
      "title": "Use a protein treatment.",
      "content": "Use a protein treatment. Protein treatments improve the health of your hair by putting a barrier around your hair follicle and protecting the hair shaft, which will prevent additional damage. Proteins also temporarily repair damaged hair by filling in the frayed areas of your hair shaft. [13] X Research source Use a reconstructor if your hair is really damaged, but as the texture of your hair improves, a deep-penetrating treatment will be a better choice. [14] X Research source Be careful not to use protein treatments too often; while they are great for repairing and protecting hair, they can also damage your hair if you use them too often. [15] X Research source This is because your hair is made of protein."
    },
    {
      "title": "Replace your products.",
      "content": "Replace your products. If you are using products that contain damaging chemicals or aren’t formulated for curls, then they may be adding to your hair’s damage. Consider switching to natural formulas that are specially formulated for curly hair. Stay away from sulfates, which strip your hair’s natural oils and lead to frizziness. [16] X Research source Look for products that offer moisturizing."
    },
    {
      "title": "Wash your hair less.",
      "content": "Wash your hair less. Hair only needs to be washed every other day at most. You may want to limit shampooing to once or twice a week, especially if you have very dry hair. [17] X Expert Source Jenny Tran Professional Hair Stylist Expert Interview. 19 May 2020. It’s okay to condition your hair more often, so you may find that you like to apply conditioner most days of the week. Protect your hair from moisture by using a shower cap. On no-shampoo wash days, wet your hair and apply conditioner. Continue your shower as you normally would. Alternatively, use no shampoo at all with the Curly Hair Method ."
    },
    {
      "title": "Use conditioner.",
      "content": "Use conditioner. People with curly hair should never skip conditioner. Allow your conditioner to soak into your hair for at least three minutes. It’s easy to accomplish this if you put the conditioner on your hair at the beginning of the shower so that it sits on your hair as you cleanse and shave. [18] X Expert Source Jenny Tran Professional Hair Stylist Expert Interview. 19 May 2020."
    },
    {
      "title": "Apply a leave-in conditioner.",
      "content": "Apply a leave-in conditioner. Try one that’s formulated for curly hair for best results, but any leave-in will help the condition of your hair. Use your leave-in conditioner before using other products, such as curl creams or heat protectants. [19] X Expert Source Jenny Tran Professional Hair Stylist Expert Interview. 19 May 2020."
    },
    {
      "title": "Use a wide-tooth comb.",
      "content": "Use a wide-tooth comb. It is best to finger detangle first, and then start combing the ends of your hair, working your way closer to the scalp. While it’s best to do this in the shower while the conditioner is on your hair, you can also use a leave-in conditioner once you’re out of the shower. [20] X Research source"
    },
    {
      "title": "Apply oil.",
      "content": "Apply oil. Using oil as part of your regular hair routine is different from a hot oil treatment. To add oil to your routine, pour a dime size of room temperature oil into your palm and smooth it onto your hair like you would a mousse. You can use oil on either damp or dry hair, depending on your hair texture and how frequently you wash it. Oils help nourish and protect your hair, so applying oil to your hair will both repair the strands and help you avoid further damage. Many popular brands offer their own blend of oils. While these provide an excellent solution that helps you avoid measuring oils or investing in several oils to create a blend, these products often contain other additives. You don’t have to buy a hair product; using plain oils is fine. Coconut oil is a great option because it balances your hair. [21] X Research source Many people cook with coconut oil, so you may find that it’s an economical option for you due to its multiple uses. Argan oil is also a popular oil for hair."
    },
    {
      "title": "Use curl creams.",
      "content": "Use curl creams. Curl creams minimize frizz and smooth out your curls. Not all curl creams are created equally, however. Make sure that you are avoiding sulfates and alcohols when you choose a curl cream. Many people with curly hair find that mixing two or more creams or gels creates the best curl hold for their hair. You can also mix oil with cream or gel to create your own curl-hold options. Keep in mind that everyone’s hair is different, so it is important to try out different things and see what works best for you."
    },
    {
      "title": "Allow hair to air-dry.",
      "content": "Allow hair to air-dry. Air drying has two benefits. First, it protects your hair from heat damage. Second, it allows your hair to dry into tighter curls with fewer flyaways, which means a better hair day. As a bonus, you’ll also save time on styling your hair, making air-drying a win-win-win."
    },
    {
      "title": "Limit heat.",
      "content": "Limit heat. Sometimes you may want to blow out or straighten your hair, but always make sure to apply a heat protectant product first. Minimal heat styling should not damage your hair if you’re otherwise caring for it; however, avoid using heat too often. [22] X Research source"
    },
    {
      "title": "Stick to one chemical process.",
      "content": "Stick to one chemical process. If you must dye or straighten your hair, choose one. Multiple chemical processes fry curly hair, so if you want to have nourished locks, you must choose one process. [23] X Research source"
    },
    {
      "title": "Use tangle-free hair accessories.",
      "content": "Use tangle-free hair accessories. When you style your hair, avoid accessories like ponytail holders, rubber bands, or bobby pins that can snarl hair, causing more damage. Instead, try soft headbands or cloth ties."
    },
    {
      "title": "Protect your hair from heat styling.",
      "content": "Protect your hair from heat styling. When you need to use heat to get your desired style, limit the amount of time you apply the heat and use heat protectants. Let your hair partially air-dry when using heat styling. For example, you could allow your hair to dry halfway while you get ready, and then use the hair dryer to finish drying it. Make sure that your hair is completely dry before using a hair straightener. If you use a straightener on wet or damp hair, it can singe your hair as the water evaporates. When you do use heat to style your hair, apply a heat protectant. This product comes in sprays or creams, depending on what you choose. While silicones are usually bad for your hair, heat protectants with silicones are actually better because they are so heat resistant, allowing them to better protect your hair. [24] X Research source"
    },
    {
      "title": "Protect your hair from the sun.",
      "content": "Protect your hair from the sun. When you’re spending time outside, use a cute hat or hair wrap to shade your hair. If you can’t wear a hat, try a product that contains a sunscreen."
    },
    {
      "title": "Secure your hair at night.",
      "content": "Secure your hair at night. Sleep in a satin hair wrap or on a satin pillowcase to minimize damaging friction. [25] X Research source As a bonus, you’ll look cute and avoid bedhead in the morning."
    }
  ]
}