{
  "url": "https://www.wikihow.com/Ride-an-Elevator",
  "title": "How to Ride an Elevator",
  "steps": [
    {
      "title": "Press the \"up\" or \"down\" button.",
      "content": "Press the \"up\" or \"down\" button. When you arrive to the elevator, decide which way you are going and be ready to wait. An elevator's arrival time can be affected by many factors such as elevators' traffic, the amount of floors, rush hours, and available elevators due to unforeseen maintenance or closures."
    },
    {
      "title": "Allow any people to leave before entering.",
      "content": "Allow any people to leave before entering. Stand clear of the door. This etiquette is practiced in a lot of public situations such as subways or buses, and elevators are no different. Also, keep in mind elevators serve individuals with mobility issues or people handling large loads of cargo or furniture. Take a step aside and allow passengers enough space to make their way out of the elevator. [1] X Expert Source Tami Claytor Etiquette Coach Expert Interview. 29 September 2020. Take a second to ensure that the elevator car stops at your floor."
    },
    {
      "title": "Make certain the elevator is going in your direction.",
      "content": "Make certain the elevator is going in your direction. Most elevators have signals to show if they are going down or up. In the case where you cannot find any signal, ask the passengers on the elevator which way they are headed. Avoiding going in the wrong the direction, especially if the building has a lot of floors."
    },
    {
      "title": "Decide if the elevator has enough space.",
      "content": "Decide if the elevator has enough space. When the elevator stops at your floor, it might not mean people will exit. If the doors open and passengers do not get out, assess what space remains. If you cannot see enough room for you, let the doors close and wait for another elevator."
    },
    {
      "title": "Enter and find an empty spot in the elevator.",
      "content": "Enter and find an empty spot in the elevator. Elevators vary in size and available space. Locate a section where you will feel comfortable for the ride and that is convenient for your exit. The back of the elevator is the ideal location two-fold: it leaves room for other passengers to enter or exit, and it secures a good spot for longer rides."
    },
    {
      "title": "Select your floor.",
      "content": "Select your floor. Elevators have buttons on either sides of the door. The majority of the floor buttons are numbered; basement, garage, street level, lobby, etc. may be represented by letters. If someone is standing closer to the buttons than you, they might offer to select for you. If they do not, kindly ask them to select the floor. In some elevators, double-tapping on a lighted button allows you to cancel a floor call."
    },
    {
      "title": "Secure all your belongings.",
      "content": "Secure all your belongings. If you are riding with groceries, book bags, or any other items, be sure to hold on to them properly. [2] X Research source If the elevator ride is empty, you may leave your items on the floor, especially for longer rides. However, holding on to your items ensures more space for potential passengers."
    },
    {
      "title": "Be courteous when traveling with children or pets.",
      "content": "Be courteous when traveling with children or pets. Elevators can be crowded, and ensuring the safety and comfort of others should be on your mind. If you travel with a pet, be sure to secure it with a leash or carry it; not all people are comfortable with pets roaming freely. Also, be sure to have your children close to you. It is also good practice to have them be mindful of others' spaces."
    },
    {
      "title": "Control noise levels.",
      "content": "Control noise levels. The most proper elevator etiquette would be to keep noise levels from silence to minimal. [3] X Research source Conversations either in person or over the phone should cease when possible. Use headphones for listening to music instead of playing it out loud. If you are traveling with an infant, kindly refrain from riding while the child is crying."
    },
    {
      "title": "Calm your nerves and anxieties.",
      "content": "Calm your nerves and anxieties. Riding an elevator may be difficult for some people with worries such as germs or confined spaces. If you know riding an elevator is a difficult but unavoidable task, prepare yourself for the ride by multiple means. Choose portable, hand-held activities. Read a book, check your email, send text messages, check social media, create to do lists, or any small task that requires enough focus to ease your mind. [4] X Research source Listen to soothing music. A nice pair of head phones and delicate tunes can ease your thoughts for a better ride. Ride elevators more often. Practice makes perfect, and conquering a fear is no different. Taking more elevator rides will help you get use to the activity. Think of a calm setting. Train yourself to create soothing settings that relax you, and enter that mental picture when you ride the elevator."
    },
    {
      "title": "Pay attention to the stops.",
      "content": "Pay attention to the stops. As you ride, be aware of stops for two reasons. First, passengers need to enter and exit; you might have to give people space to help them slip in or out. [5] X Research source Also, each stop brings you closer to your floor, and you may be able to move towards the door. However, in the event that you are not close to an exit, being ready will help you get to your floor without any issues. [6] X Research source Some elevators have recorded voice announcements to indicate which floor they will stop at next."
    },
    {
      "title": "Excuse yourself as you walk through the elevator.",
      "content": "Excuse yourself as you walk through the elevator. People on elevators have many distractions in their heads and often give you their backs as they face the elevator door. Saying excuse me or pardon me will signal your intentions of exiting, and they will move to help you leave. [7] X Research source"
    },
    {
      "title": "Make sure the door opens on your floor.",
      "content": "Make sure the door opens on your floor. When the elevator stops at your exit, the doors should open either automatically or manually. Most elevators have a button to open the doors while some older models use latches. In the case when the door won't open, search for an intercom or alarm button. If the elevator is jammed, qualified assistants will be notified."
    },
    {
      "title": "Ask someone to hold the door for you.",
      "content": "Ask someone to hold the door for you. Walking around people in a crowded elevator might not give you enough time to reach the doors before closing. Ask someone close enough to make sure the door will remain open for you."
    },
    {
      "title": "Exit quickly.",
      "content": "Exit quickly. Using an elevator should be a convenience and a time saver. Missing your floor will only delay you. Also, be mindful that other passengers may need to exit as well. Being swift about your exit helps everyone."
    }
  ]
}