{
  "url": "https://www.wikihow.com/Read-Football-Odds",
  "title": "How to Read Football Odds & Probability",
  "steps": [
    {
      "title": "Understand that the favored team must win by more than the points listed to pay out.",
      "content": "Understand that the favored team must win by more than the points listed to pay out. Check the odds of the game you want to bet on and find the team that has a “-” sign next to its point spread. Check the number listed after the “-” sign so you know how many points the team needs to win by to pay out the bet. If the team doesn’t win by more than the number listed, then you lose the bet. [1] X Research source For example, if the number next to the team says -5, then the team needs to win by more than 5 points in order for you to win a bet. The number for the point spread may also be a fraction or decimal, such as -4 ½ or -4.5. In this case, the team must win by the next round number of points, which is 5 in this example."
    },
    {
      "title": "Know that the underdog pays out if they win, or lose by fewer points than the spread.",
      "content": "Know that the underdog pays out if they win, or lose by fewer points than the spread. Check the point spread odds for which team has a plus sign next to the numbers. If the team wins by any number of points, then you win the bet. You can also win the bet if the team loses by less than the number of points listed by the bookie. If the team loses by more than the amount listed, then you lose the amount you wagered. [2] X Research source For example, if the odds were listed as +4.5, then the team must either win the game by any point margin, or lose by less than 5 points."
    },
    {
      "title": "Get your original bet back if the point spread results in a tie.",
      "content": "Get your original bet back if the point spread results in a tie. Usually when you win a bet, you’ll get your original bet back plus an additional amount based on the odds. If the point spread for both of the teams is a round number, then there could be a tie, also known as a “push.” If a team scores the exact amount listed on the point spread, then you do not win additional money, but you’ll receive the wager you placed. [3] X Research source For example, if a team is listed as -4 and they only win by 4 points, then there is no winner and you get your original bet."
    },
    {
      "title": "Make a pick’em bet if neither of the teams are favored.",
      "content": "Make a pick’em bet if neither of the teams are favored. If there isn’t an obvious underdog for the game you’re betting on, then the odds may be listed as “Pick.” If the point spread doesn’t have a number, choose which team you think will win the game overall. If the team you selected wins, then you win the bet. [4] X Research source"
    },
    {
      "title": "Know that money line odds are based only on which team wins.",
      "content": "Know that money line odds are based only on which team wins. money line odds are different than point spreads since they don’t concern what the score of the game was. If you bet on the winning team in a money line bet, then you get paid out. However, if you bet on the losing team, then you lose the money you wagered on them. [5] X Research source Favored teams usually cost more to place a bet and pay out less. Underdog teams cost less and let you win more money, but they’re riskier since the team may not be as good."
    },
    {
      "title": "Pay the negative amount listed for the favored team in order to win $100 USD.",
      "content": "Pay the negative amount listed for the favored team in order to win $100 USD. Look for the team that has a “-” sign next to the money line odds so you know which team is favored. Check the number listed next to the “-” sign so you know how much money you need to wager. If you wager the amount listed and the favored team wins, then you win your bet back as well as an additional $100 USD. [6] X Research source For example, if the odds are listed as -250, then you need to pay $250 USD in order to win an additional $100 USD."
    },
    {
      "title": "Make a $100 USD bet to win the amount listed for the underdog.",
      "content": "Make a $100 USD bet to win the amount listed for the underdog. Check which team has the “+” sign next to the money line odds on the listing. If you think the team is going to win, make a $100 USD wager on them for your bet. If they win the game by any point margin, then you receive your original bet back as well as the amount listed on the odds. [7] X Research source For example, if the team has money line odds of +235, then you pay a $100 USD wager. If the team wins, you get back a total of $335 USD back. Wagers on the underdog tend to be riskier since the team is not expected to win."
    },
    {
      "title": "Combine your bets into a parlay for a larger payout.",
      "content": "Combine your bets into a parlay for a larger payout. You can only place parlay bets if you already bet on multiple other games. If you’re confident that all of the bets you made are correct and will win, then you can ask to parlay to them together to earn a better payout. However, if even 1 of the bets you made loses, then you lose the parlay completely. [8] X Research source Some bookies may offer a “teaser” parlay that lets you adjust the point spread to help an underdog or favored team win. The payoffs on “teaser” are usually not as high as a regular bet or parlay."
    },
    {
      "title": "Bet if the score is going to be above or below the over/under odds.",
      "content": "Bet if the score is going to be above or below the over/under odds. The over/under is a single number that’s usually listed for football games, and the number refers to the total number of points both teams score. If you think the teams will score more points than the number listed, then bet over. Otherwise, if you think the team will score less, bey under the number listed. [9] X Research source For example, the over/under may be listed as 42, which means the teams’ combined score must be greater in order to win. If the combined scores are the same as the over/under number, then you receive the amount you originally wagered."
    },
    {
      "title": "Understand prop bets may have different odds.",
      "content": "Understand prop bets may have different odds. Prop bets can be made on any aspect of a football game and are usually based on a yes or no question. For example, you may bet that a quarterback is going to pass a certain number of yards. Talk to your bookie about any prop bets to see what the odds are for them, and make your wager based on them. [10] X Research source Some prop bets are completely left up to chance. For example, some people make prop bets on the coin toss during the Super Bowl."
    }
  ]
}