{
  "url": "https://www.wikihow.com/Reduce-Histamine-in-Your-Body",
  "title": "How to Reduce Histamine in Your Body",
  "steps": [
    {
      "title": "Fresh, non-preserved foods:",
      "content": "Fresh, non-preserved foods: Generally, any food with preservatives is high in histamines. This means that fresh, non-packaged food is your best bet. Try to eat as many fresh meals as you can to keep your histamine levels down. [1] X Research source Meat, poultry, and fish are all fine, as long as they aren't packaged or preserved. Frozen foods, like meat, fish, and vegetables, are usually okay as well, as long as they were frozen fresh and don’t have any added preservatives. It might help to cook some of your own meals , so this is a great time to learn some new recipes!"
    },
    {
      "title": "Fruits and vegetables:",
      "content": "Fruits and vegetables: Most of these are safe, and they’re always healthy choices. Incorporate plenty of fresh fruits and vegetables in your meals to get essential vitamins and nutrients in your diet. [2] X Research source There are some exceptions to this rule. Generally, avocados, bananas and plantains, citrus fruits, eggplant, and spinach are all high in histamines, so steer clear of those."
    },
    {
      "title": "Whole grains:",
      "content": "Whole grains: These are naturally lower in histamines, so they shouldn't cause any trouble. Feel free to include bread, pasta, rice, oats, and flour in your normal diet. [3] X Research source Sourdough bread and yeast products like marmite tend to be higher in histamines than whole-grain breads, so try to avoid these. [4] X Research source Whole grain and whole wheat products tend to be healthier than white varieties, so switch over to these types if you usually eat white bread and rice."
    },
    {
      "title": "Milk substitutes and eggs:",
      "content": "Milk substitutes and eggs: Dairy products like cheese and milk tend to raise your histamine levels, but milk substitutes are fine. Replace the milk in your diet with soy, oat, or coconut types instead. Fresh eggs are also fine. Some people tolerate goat or sheep milk better than cow milk, so try this out if you want more dairy in your life. There are also cheeses made from these milk sources. [5] X Research source"
    },
    {
      "title": "Fermented, pickled, or preserved foods:",
      "content": "Fermented, pickled, or preserved foods: Any type of preservatives tend to be high in histamines. Cut out things like cured or smoked meat, sausages, bacon, canned items, or anything packed in vinegar. Common fermented foods include yogurt, kefir, miso, and pickles. Sauerkraut, in particular, has shown high concentrations of histamine. Frozen meals are usually high in preservatives too, so skip these as much as you can."
    },
    {
      "title": "Citrus fruits:",
      "content": "Citrus fruits: While these are delicious, and normally healthy, citrus fruits trigger your body to release histamine. Avoid oranges, lemons, limes, grapefruits, and similar foods. This goes for citrus fruit juices too. Cut out the orange juice and lemonade. Remember to still have plenty of non-citrus fruits in your diet. This is important to get all the nutrients you need to stay healthy."
    },
    {
      "title": "Beans and legumes, tomatoes, eggplant, spinach, and avocados:",
      "content": "Beans and legumes, tomatoes, eggplant, spinach, and avocados: Vegetables are usually very healthy, but not if you have histamine intolerance. Most are fine, but tomatoes, eggplant, spinach, and avocados release histamines. Most legumes and beans are also high in histamines, so you’ll have to avoid them too. [6] X Research source"
    },
    {
      "title": "Milk and cheeses:",
      "content": "Milk and cheeses: These dairy products tend to release histamines. Either cut them out or use dairy substitutes to avoid triggering your symptoms. [7] X Research source Remember that you can still have milk substitutes from soy or coconut. Histamine levels in cheeses may vary depending on the age and temperature it was stored."
    },
    {
      "title": "Tree nuts, cinnamon, and chocolate:",
      "content": "Tree nuts, cinnamon, and chocolate: Products from trees like this tend to be higher in histamines, and allergens in general. Be careful to avoid tree nut products, as well as products like cinnamon and chocolate. This goes for items containing tree nuts too. Almond milk, for example, might bother you."
    },
    {
      "title": "Wine and beer:",
      "content": "Wine and beer: Both of these drinks have a lot of preservatives, especially sulfites. They are more likely to raise your histamines than other types of alcohol. Technically all alcohol is bad for your histamine levels, so if you’re very sensitive, quitting drinking altogether is a good idea."
    },
    {
      "title": "See an allergist if you have symptoms of histamine intolerance.",
      "content": "See an allergist if you have symptoms of histamine intolerance. Histamine intolerance is tough to spot, and you can’t diagnose it yourself at home. Testing and monitoring from an allergist is the only surefire way to know if you have the condition. If you do suspect that you have a histamine intolerance, make an appointment with an allergist to get tested. The main symptoms of histamine intolerance look like seasonal allergies. You might experience sneezing, itchy eyes, congestion, headaches, and hives after eating histamine-rich foods. Some people also experience gastrointestinal issues like bloating, diarrhea, or constipation. There are no reliable lab tests for histamine intolerance, so your doctor will probably suggest switching to a strict, histamine-free diet to see if that makes you feel better."
    },
    {
      "title": "Take antihistamines to control your symptoms.",
      "content": "Take antihistamines to control your symptoms. Antihistamine medications block histamines in your body and prevent them from causing trouble. If your symptoms don’t get better with dietary changes, ask your doctor for the best medication to control your symptoms. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Common antihistamines include loratadine, diphenhydramine, and cetirizine. Don’t take antihistamines without asking your doctor first. These are usually not meant for long-term use. Your allergist might also prescribe a stronger antihistamine."
    },
    {
      "title": "Work with a dietician if you have trouble sticking to your diet.",
      "content": "Work with a dietician if you have trouble sticking to your diet. A low-histamine diet is tough, so it’s completely normal if you need some help. See a dietician and tell them about your histamine intolerance. They can draw up a diet plan for you so you don’t have to stress about picking the right foods. [9] X Research source Allergists usually work closely with dieticians, so ask your allergist for a recommendation or a referral."
    }
  ]
}