{
  "url": "https://www.wikihow.com/Recognize-Cellulitis-Symptoms",
  "title": "How to Recognize Cellulitis Symptoms",
  "steps": [
    {
      "title": "Pay attention to inflammation, redness, and warmth.",
      "content": "Pay attention to inflammation, redness, and warmth. These are the tell-tale sign of cellulitis. Inflammation, redness, and warmth in the affected region of your body will likely be the first signs of infection. Patients should monitor their infection closely. Consider: Inflammation and redness might occur after some pain at the point of infection. Once you notice inflammation and redness at the point of infection, you should monitor it closely as the infection can spread very quickly. If the infection turns from red to a purple or violet color and expands, you should see a doctor as soon as possible. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Observe a central area that is swollen and potentially filled with pus.",
      "content": "Observe a central area that is swollen and potentially filled with pus. A good indication of cellulitis is that we can observe a central area – the initial place of infection – that is abscessed and swollen. This initial place of infection is often filled with pus. Treatment might, in some cases, demand that the abscess is drained. [2] X Research source"
    },
    {
      "title": "Report sensitivity and pain to touch the skin.",
      "content": "Report sensitivity and pain to touch the skin. Many patients inflicted by cellulitis report sensitivity to the infected area if touched. While this sensitivity or pain might be minimal at first, it can quickly develop into a much more intense level of pain and discomfort. If your pain increases in intensity quickly, contact a medical professional. [3] X Research source"
    },
    {
      "title": "Feel a heat or warmth radiating from the infected area.",
      "content": "Feel a heat or warmth radiating from the infected area. A common symptom of cellulitis is that the infected area is warm or even hot to the touch. At first this warmth might seem like nothing, but it can quickly escalate and cause discomfort to the patient. In addition, heat or warmth radiating from the infected area is an indication that the infection is spreading and expanding, possibly becoming systemic. [4] X Research source"
    },
    {
      "title": "Watch from swollen glands.",
      "content": "Watch from swollen glands. Serious cases of cellulitis will spread beyond the initially infected region to become systemic and impact the rest of the body. One common sign of systemic cellulitis is swollen lymph glands. You should consider that: Lymph glands nearest to the infection will swell first. Lymph glands may become tender and exhibit pain when touched. Swollen lymph glands indicate that the infection is spreading well beyond the initially infected region and the patient requires immediate medical care. Lymph nodes are located on your neck, in your armpits, and around your groin, among other places."
    },
    {
      "title": "Notice if you experience fever and/or chills.",
      "content": "Notice if you experience fever and/or chills. While systemic symptoms vary from patient to patient, bad cases of cellulitis can cause someone to experience a fever or chills. The fever or chills might seem to go and come with no predictability; however, the worse the infection is, the more the fever and chills will persist. Fever is an indication of a serious case of systemic infection. See your doctor immediately if your case of cellulitis is accompanied by fever and/or chills. [5] X Research source A doctor might advise Tylenol or other fever reducing medicines."
    },
    {
      "title": "Feel fatigued for no apparent reason.",
      "content": "Feel fatigued for no apparent reason. People who suffer from a serious case of cellulitis may experience fatigue for no apparent reason. They will feel tired and drained of energy. A feeling of fatigue is a systemic symptom that indicates a case of cellulitis that is expanding. Consult your doctor immediately if your cellulitis is accompanied by prolonged fatigue."
    },
    {
      "title": "Notice if you are sweating for no apparent reason.",
      "content": "Notice if you are sweating for no apparent reason. Another symptom of a serious systemic case of cellulitis is when the patient sweats for no clear reason. Sweating may or may not be accompanied by fatigue, fever, and or chills. Regardless, a case of cellulitis accompanied by sweating is an indication that the infection is expanding and affecting more than the area of initial infection."
    },
    {
      "title": "Pay attention to pain that seems more serious than the size of the infection would indicate.",
      "content": "Pay attention to pain that seems more serious than the size of the infection would indicate. Many serious cases of cellulitis will have associated pain emanating from the infected area. This pain will seem much more severe than the size of the infection would suggest. If you have an infection with intense pain, you should contact a doctor immediately."
    },
    {
      "title": "Observe lymphangitic spread.",
      "content": "Observe lymphangitic spread. Lymphangitic spread appears as red lines emanating outward from the infected area. If you observe this spreading, it means that your cellulitis is potentially severe. Observed spreading indicates that the infection is radiating outward and will become a systemic infection if it goes untreated. [6] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Treat wounds immediately to help prevent infection.",
      "content": "Treat wounds immediately to help prevent infection . Treating wounds immediately is important because cellulitis can be introduced to the body through an open wound. Any open would, however innocuous and seemingly harmless, can create an opportunity for the development of cellulitis. Inflammation generally starts at the point where skin was previously broken. As a result, you should treat all newly opened wounds as soon as possible. Introduction of cellulitis can be caused by: Cuts Blisters Burns Cracks in the skin Surgical wounds Sites of intravenous catheter insertion"
    },
    {
      "title": "Recognize that cellulitis is caused by a bacterial infection.",
      "content": "Recognize that cellulitis is caused by a bacterial infection. Cellulitis is most often caused by Streptococcus type A and Staphylococcus aureus ; however, while these are the two most common causes, it can be caused by other types of bacteria. Blood test and cultures are needed in order to determine exactly the type of bacteria that is causing cellulitis. [7] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you have a known or suspected underlying condition, such as diabetes, your doctor will likely want to perform more tests. Be conscious of methicillin-resistant Staphylococcus aureus (MRSA), which is a bacteria that is resistant to antibiotic treatment. Oral medication will not work on this type of infection and you will need to be given vancomycin intravenously. MRSA must be treated quickly or it can become life-threatening."
    },
    {
      "title": "Take antibiotics to treat cellulitis.",
      "content": "Take antibiotics to treat cellulitis. Treatment for mild forms of cellulitis include elevation of the affected area and treatment of the underlying conditions. Patients that have edema as one of their underlying conditions may benefit from compression stockings or diuretics. Nevertheless, antibiotics are usually the best solution to heal this type of infection. Antibiotics are used orally or intravenously depending of severity affected skin area. [8] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source For mild infections, your doctor may give you the oral antibiotic cephalexin. In more severe cases, you may be treated with vancomycin or meropenem. One major complication of cellulitis includes infection of deeper structures, such as bone. This can lead to a disease called osteomyelitis, which is the infection of the bone and requires aggressive treatment. In cases of recurrence of disease treatment with antibiotics may last up to several months."
    }
  ]
}