{
  "url": "https://www.wikihow.com/Pack-Chocolates",
  "title": "How to Pack Chocolates",
  "steps": [
    {
      "title": "Make or find a cardstock gift box for your chocolates.",
      "content": "Make or find a cardstock gift box for your chocolates. Small cardstock boxes make ideal decorative boxes for chocolates. They keep the chocolates cool to prevent heat from melting them. You can fold one yourself or purchase a small paper gift box from most craft stores. [1] X Research source Measure your chocolates beforehand to make sure you choose or fold a box large enough for them. You can also use a metal canister as an alternative, but metal is more likely to attract heat."
    },
    {
      "title": "Spray paint",
      "content": "Spray paint the box for a sophisticated flair. If you'd prefer a box with a more subtle, solid color, try spray painting it. Holding the paint can about 8 inches (20 cm) away from the box, spray a light and even coat on the surface. Give the box 2-3 spray paint coats, letting it dry for 30-60 minutes between applications. [2] X Research source If you spray paint your box, do so before you place the chocolates inside. Wait for the paint to dry and seal the chocolates inside a plastic bag to prevent paint from touching them. Using glitter spray paint can give the box vibrancy without compromising its simpler design."
    },
    {
      "title": "Place the chocolates into the box.",
      "content": "Place the chocolates into the box. Before adding any tissue papers or decorations to the box, put the chocolates inside to make sure they fit. If you're packing individual chocolates, place them on a candy cup to prevent them from touching any decorations."
    },
    {
      "title": "Stuff the container with tissue paper.",
      "content": "Stuff the container with tissue paper. After you place the chocolates in the box, pad it with tissue paper. This prevents the chocolate from breaking as you handle the box and helps to keep it cool. [3] X Research source Although you can use bubble wrap to keep the chocolates cool and intact, tissue paper is much more decorative. Try finding tissue paper in bold colors or patterns to help it make a celebratory statement. You can also wrap tissue paper around the bottom and top of the box for an extra flair."
    },
    {
      "title": "Wrap your container in decorative paper.",
      "content": "Wrap your container in decorative paper. This can make the container look more ornate, especially if you're gifting your chocolates to someone else. Cut the decorative paper to fit the sides of your container and use craft glue or a glue stick to secure it in place. [4] X Research source You can use art paper, construction paper, wrapping paper, wallpaper samples, or even newspaper to decorate your container."
    },
    {
      "title": "Decorate the box with stamps or stickers.",
      "content": "Decorate the box with stamps or stickers. If your box is a solid color, use a decorative stamp or sticker to give it color. Use between 1-3 types of stamps or stickers at most, as too much decoration can overwhelm the box's style. Avoid using both stamps and stickers to avoid oversaturating the box with decoration. You can also glue buttons or beads to the box for a more unique design. [5] X Research source In a pinch, colored office supply stickers can function as a simple decoration. You can purchase colored sticker dots from most office supply stores. [6] X Research source"
    },
    {
      "title": "Tie a ribbon to your container.",
      "content": "Tie a ribbon to your container. Ribbons can give your container a decorative flair. Tie the ribbon on top of or around the container, or tie the ribbon into a bow and glue it to the top or side. [7] X Research source Curl the ribbons with scissors to make them look especially ornamental."
    },
    {
      "title": "Purchase overnight shipping for your chocolates, if possible.",
      "content": "Purchase overnight shipping for your chocolates, if possible. Chocolate is sensitive to temperature changes and will not look or taste the same after it's melted. If overnight or one-day shipping is an option for your package, choose it to ensure that your chocolates stay in their best condition. [8] X Research source As a rule, chocolate doesn't stay in good condition for more than 3 days in the mail. Avoid shipping chocolates right before a weekend or holiday, as they're likely to sit in a sorting facility for several days. Because chocolate can melt on hot days even with overnight shipping, don't send chocolates during warm seasons."
    },
    {
      "title": "Pack your chocolate in a box 2-3 times the size of their package.",
      "content": "Pack your chocolate in a box 2-3 times the size of their package. This will give you enough room for cushioning so the chocolates stay cool and intact. If your box is too tight, the chocolate is more likely to overheat. [9] X Research source Avoid shipping chocolates that are not held inside a container, wrapper, or plastic bag. Unwrapped chocolate is more likely to make a mess when shipped. You don't have to be exact with your measurements of the package—approximation is fine."
    },
    {
      "title": "Wrap the chocolates with plastic wrap if it's in a decorative container.",
      "content": "Wrap the chocolates with plastic wrap if it's in a decorative container. This will keep the container intact while you ship it. Handle the container carefully while wrapping it to avoid breaking the decorations. Try to seal the chocolates as tightly as possible to keep the container secure. Plastic wrap can also protect your chocolates from moisture and help insulate them."
    },
    {
      "title": "Pad the box with mylar bubble wrap.",
      "content": "Pad the box with mylar bubble wrap. Mylar-coated bubble wrap deflects heat and insulates the chocolates to keep them cool. Before placing the chocolates in the box, wrap them in the bubble wrap. After you've put them in, stuff the box with extra bubble wrap if you have room. [10] X Research source Don't use newspaper as padding for chocolate, as it won't provide enough cushioning. If you want to add more padding, try packing peanuts instead. Fill in all of the extra gaps with a packing material to keep your chocolates secure in the box."
    },
    {
      "title": "Add a final layer of mylar on top.",
      "content": "Add a final layer of mylar on top. Before closing the package, place a mylar layer on top approximately the same length and width as the box. This final layer will help keep your chocolates in place if they are bumped or jostled during the shipping process."
    },
    {
      "title": "Seal the box seams tightly.",
      "content": "Seal the box seams tightly. Fold the box flaps down and use packing tape to seal the box's seams in place. Apply 2-3 layers of tape to make sure the package stays closed while shipping it."
    },
    {
      "title": "Leave your chocolates in the fridge or freezer until you pack them.",
      "content": "Leave your chocolates in the fridge or freezer until you pack them. Until you transfer your chocolates to its decorative or shipping container, make them cold for as long as possible. After you've packed your chocolates, put them back in the fridge until you either deliver or ship them. While in the fridge or freezer, keep your chocolates in an airtight container. Sandwich bags with a zipper are ideal. [11] X Research source"
    },
    {
      "title": "Keep your package out of direct sunlight until you ship or deliver it.",
      "content": "Keep your package out of direct sunlight until you ship or deliver it. When exposed to sunlight, chocolate melts quickly. If you've taken your chocolates out of the fridge, keep them in a cool place away from bright lights and heat."
    },
    {
      "title": "Use gel cold packs to chill the chocolates.",
      "content": "Use gel cold packs to chill the chocolates. Put a cold pack in the freezer and, when it's cold, slip it in your chocolate's container or shipping box. To protect your chocolates from moisture, place it in a zipper sandwich bag before you place it in the package. [12] X Research source Don't use ice packs to cool your chocolates, as these melt and can ruin their packaging. To keep your chocolates cold while shipping them, you can leave the gel pack in the box."
    },
    {
      "title": "Try dry ice as an alternative to cold packs if you're shipping your chocolates.",
      "content": "Try dry ice as an alternative to cold packs if you're shipping your chocolates. Dry ice keeps chocolate cold for longer but can irritate your skin. Put on gloves and goggles, and place your chocolates in a sealed plastic container before packing it. Ask your local shipping store how much dry ice you can put in a package, then place it alongside the chocolates and bubble wrap. If you pack your chocolates with dry ice, you must write \"Contains Dry Ice\" on the package. [13] X Research source"
    }
  ]
}