{
  "url": "https://www.wikihow.com/Secure-a-Bookcase-to-a-Wall",
  "title": "How to Secure a Bookcase to a Wall",
  "steps": [
    {
      "title": "Purchase a set of Velcro straps.",
      "content": "Purchase a set of Velcro straps. [1] X Research source They should include long screws and wall anchors that will hold the straps firmly to your wall. You will not need to drill into the case itself using this method."
    },
    {
      "title": "Use a stepladder and a pencil to draw a horizontal line where your bookcase meets the wall.",
      "content": "Use a stepladder and a pencil to draw a horizontal line where your bookcase meets the wall. [2] X Research source"
    },
    {
      "title": "Remove the books and move the bookcase away from the wall.",
      "content": "Remove the books and move the bookcase away from the wall. Use a stud finder to search for wall studs. If possible, find two studs and secure the bookcase with two straps to ensure a good hold. [3] X Research source Secure the bookcase into wall studs whenever possible, instead of using wall anchors. It is best to secure the bookcase without the books in it, and then fill it up once you are finished."
    },
    {
      "title": "Mark the stud locations with a pencil.",
      "content": "Mark the stud locations with a pencil. Draw a vertical line. The two crosshairs are the locations where you will drill your wood screws into the wall."
    },
    {
      "title": "Ask someone to line up the straps vertically and hold them in place.",
      "content": "Ask someone to line up the straps vertically and hold them in place. Make sure the adhesive layer is facing down. You will peel back the clear plastic cover after you are done drilling."
    },
    {
      "title": "Drill the wood screws into the center of the straps, where there are holes for the screws.",
      "content": "Drill the wood screws into the center of the straps, where there are holes for the screws. Use a cordless drill. The number of screws may depend on the brand of Velcro straps you use. [4] X Research source If you couldn’t find a stud, you will need to make pilot holes and insert the wall anchors. Then, screw the wood screws directly into the wall anchors, where your lines meet."
    },
    {
      "title": "Move your bookcase back into place, at the level where your screws are placed in the wall.",
      "content": "Move your bookcase back into place, at the level where your screws are placed in the wall. Peel back the clear cover from the sticky adhesive and press the strap onto the top of the bookcase. For best results, don’t remove the adhesive strip to realign, or it may lose some of its hold. [5] X Research source"
    },
    {
      "title": "Remove the books.",
      "content": "Remove the books. Move the bookcase out of the way."
    },
    {
      "title": "Use a stud finder to locate studs in your wall.",
      "content": "Use a stud finder to locate studs in your wall. Use a yardstick to mark the center of the stud with a vertical line. [6] X Research source"
    },
    {
      "title": "Replace your bookcase, positioning it at a point right between the wall studs.",
      "content": "Replace your bookcase, positioning it at a point right between the wall studs. If this is impossible, you can attach your brackets at the top, into a center stud."
    },
    {
      "title": "Use a stepladder to gain access to the top of the shelf.",
      "content": "Use a stepladder to gain access to the top of the shelf. For tall shelves, this is the best place to secure a bookcase into a stud because it is the least noticeable place."
    },
    {
      "title": "Place an “L” bracket so that it is flush with the wall and the shelf.",
      "content": "Place an “L” bracket so that it is flush with the wall and the shelf. You can also use door chain latches in place of L brackets if you want to move the shelf regularly. Install the chain on the wall and the slide on the top of the shelf. [7] X Research source"
    },
    {
      "title": "Drill the L bracket into the top of the shelf with your cordless screwdriver using screws that will go all the way through the top of the shelf.",
      "content": "Drill the L bracket into the top of the shelf with your cordless screwdriver using screws that will go all the way through the top of the shelf."
    },
    {
      "title": "Ask a friend to hold the bookcase flush with the wall if it is tipping forward.",
      "content": "Ask a friend to hold the bookcase flush with the wall if it is tipping forward. Drill the other side of the L bracket into the wall with washers and three-inch wood screws. Drill until the screw head is almost even with the bracket, but avoid stripping the screw. If you can’t find a stud, you should install wall anchors before you drive screws into drywall or masonry. Drill a pilot hole into the wall and push the wall anchor in. Then, align the brackets and drill with three-inch screws."
    },
    {
      "title": "Repeat on either side of the shelf.",
      "content": "Repeat on either side of the shelf. Place an L bracket between the wall and the side of your shelf, where it will hit a stud. Repeat the same procedure on either side of the shelf. [8] X Research source"
    }
  ]
}