{
  "url": "https://www.wikihow.com/Remove-Liquid-Latex",
  "title": "How to Remove Liquid Latex",
  "steps": [
    {
      "title": "Wash the area with warm, soapy water.",
      "content": "Wash the area with warm, soapy water. You can use soap or body wash paired with warm water to loosen the latex. Massage the area with your hands or a scrubber to help the latex lift from your skin. If you bought a latex kit, it may have come with a bottle of body wash designed to wash away the latex. Regular body wash works just as well."
    },
    {
      "title": "Gently pull the latex away from your skin.",
      "content": "Gently pull the latex away from your skin. Grasp an edge between your fingers and pull it up to reveal your skin underneath. You may wish to have a warm washcloth that you use to sooth the skin while removing the latex. The latex will be extremely stretchy, so keep your fingers or the washcloth against the area where the latex and your skin meet to reduce painful pulling on your skin. The longer the latex has been on your body, the easier it may be to remove; over time, perspiration and your skin's natural oils will loosen the latex."
    },
    {
      "title": "Saturate areas where the latex is stuck.",
      "content": "Saturate areas where the latex is stuck. If the latex has adhered to your body hair, cover the affected area with warm, soapy water and massage gently. Pay special attention to your hairline, eyebrows, and other sensitive areas that have large amounts of growth. Don't yank the latex off or you risk pulling out hair."
    },
    {
      "title": "Rinse your body in warm water once the latex has been removed.",
      "content": "Rinse your body in warm water once the latex has been removed. This will clear away any of the smaller pieces that may still be in your hair or on your skin. Pat your body dry with a towel."
    },
    {
      "title": "Shave the areas where you plan to use latex.",
      "content": "Shave the areas where you plan to use latex. Since the latex is most difficult to remove in areas with a lot of hair growth, shaving first will make it much easier to remove the latex later. Shaving your legs, arms, facial hair, and so on will save you from pain when you're finished with your costume. [2] X Research source Even areas that don't seem especially hairy may have fine, invisible baby hairs to which the latex will adhere. Don't forget to shave your back, stomach, and so on."
    },
    {
      "title": "Moisturize your body before applying latex.",
      "content": "Moisturize your body before applying latex. Using a good moisturizer just before applying latex is another way to help it come off more easily later. Slathering on some lotion protects your skin and hairs from getting too \"attached\" to the latex. Ensure that the area in which you are applying latex is thoroughly clean before applying any moisturizer."
    },
    {
      "title": "Use oil to protect sensitive areas.",
      "content": "Use oil to protect sensitive areas. If you don't want the latex to stick to your eyebrows, eyelids, and other sensitive areas, you can use olive oil, almond oil or another oil you have on hand to protect them. Just be careful not to let it drip to the places where you want a flawless latex finish."
    }
  ]
}