{
  "url": "https://www.wikihow.com/Nurse-a-Baby-Rabbit",
  "title": "How to Nurse a Baby Rabbit",
  "steps": [
    {
      "title": "Choose the correct formula.",
      "content": "Choose the correct formula. The best things to feed your baby bunny are kitten milk replacer (KMR) or goat milk. You can get these items from a veterinarian’s office or from a pet store. Rabbit’s milk has a higher calorie count than other milks, so you need to add calories to the formula. Add 100% heavy whipping cream that has no added sugar."
    },
    {
      "title": "Give them warm formula.",
      "content": "Give them warm formula. When you feed the bunny, you want to make sure that you heat the formula. The formula should be warm, but not hot. It should be around the same temperature as what you would give to an infant. [2] X Research source Avoid microwaving the formula. Instead, place the formula in the syringe. Then, put hot water into a bowl and place the syringe in the bowl until it reaches a warm temperature."
    },
    {
      "title": "Protect the formula from contamination.",
      "content": "Protect the formula from contamination. It is very important that you don’t feed your bunny contaminated formula. One good way to avoid this is to throw away all formula after using it instead of saving what is left. [3] X Research source If you make up formula ahead of time, check it each time to make sure it hasn’t gone bad. Look for lumps, a skin on top of it, or a change in color."
    },
    {
      "title": "Use a syringe to give the formula.",
      "content": "Use a syringe to give the formula. The best way to give the bunny the formula is with a syringe. This method helps get the formula directly into the mouth. Make sure the needle has been removed from the syringe. Try a 1cc syringe when the bunny is first born. Use a 3mL syringe when the bunny grows older. [4] X Research source You can get these from your vet, online, or from pet stores. You can also use an eyedropper."
    },
    {
      "title": "Hold the syringe correctly.",
      "content": "Hold the syringe correctly. When using the syringe or eyedropper, you want to hold it properly to avoid suffocating the bunny. To get the syringe in the mouth, move it side to side at first to insert it. Then move it to the front of the mouth. [5] X Research source Make sure the syringe is pointed towards the side or bottom of the mouth, not the throat. This protects the bunny from getting choked if too much formula comes out."
    },
    {
      "title": "Position the bunny properly.",
      "content": "Position the bunny properly. When you feed the bunny, don’t hold them so they are upside or on their backs. This is not how they would naturally nurse. It may also cause them to suffocate on the milk. Instead, keep them in an upright position. [6] X Research source Move their head to where it’s slightly higher than their body. Make sure you have a good hold on the bunny, but don’t grip them too tight. This can make it hard for them to breathe and nurse. Feed the bunny so they’re close to the floor. This is safer in case the bunny jumps out of your hand."
    },
    {
      "title": "Know bunnies nurse slowly.",
      "content": "Know bunnies nurse slowly. Most bunnies will nurse slowly and take their time as they eat. This is normal. Don’t rush the bunny and try to make them eat faster than they want. Instead, set aside enough time for the bunny to nurse at their own pace. [7] X Research source Make sure to go slow with the plunger on the syringe. Let the bunny get all the formula and swallow before pushing any more formula."
    },
    {
      "title": "Avoid force feeding the bunny.",
      "content": "Avoid force feeding the bunny. Babies often resist being fed at first, so you’ll need to be patient. If the rabbit spits out the syringe, wet the baby’s lips with milk and gently try again. Be patient and keep repeating the process until the bunny willingly takes the milk. If you get frustrated or the baby becomes upset, take a break and try again later."
    },
    {
      "title": "Make sure to feed the bunny enough times throughout the day.",
      "content": "Make sure to feed the bunny enough times throughout the day. When you nurse a baby rabbit, make sure that you feed them the proper amount of times throughout the day. Only feeding them once or twice a day can make them too hungry, so they may overeat when they get access to food. [8] X Research source Feed the bunny multiple times throughout the day. When they are first born, feed them small meals every couple of hours while you are awake. Once they are into their second week, reduce that to around every three to four hours while you are awake. By the time they are at their fourth week, you may be able to spread out the feedings again. Check with a vet or a rabbit expert to make sure that you feed the bunny at the correct frequency and in the correct amount for the rabbit's age. You may need to feed the bunnies less. It sometimes depends on the bunny or the breed. As long as the babies are gaining weight steadily, you are probably fine."
    },
    {
      "title": "Watch the cues to know when to stop feeding.",
      "content": "Watch the cues to know when to stop feeding. When you feed the bunny, don’t feed them more than they want. You may think they need to keep eating, but the bunny will let you know when they are full. Watch the cues from the bunny. If they stop eagerly trying to get the formula, it’s time to stop. [9] X Research source Watch the bunny’s tummy. Once it starts to get slightly rounded in shape, you can stop. They’ve had enough for now. If they start crying, it is time to feed them again."
    },
    {
      "title": "Feed the correct amount.",
      "content": "Feed the correct amount. Each time you feed your bunny, you want to make sure you are feeding them the right amount. While watching the cues of the bunny is the best way, you can also have a general idea of the amount of formula needed each day, spread out over your feedings. Each week, you should increase how much you feed the bunnies. Newborns should get around four to five cc of formula. In week two, you should feed them around 10 to 15 cc. In week three, shoot for 15 to 30 cc, and after that, give 30 cc."
    },
    {
      "title": "Wash your hands.",
      "content": "Wash your hands. To avoid spreading bacteria to baby bunnies or yourself, make sure to wash your hands before and after feeding the bunnies. Use disinfectant soap and wash with hot water. [10] X Research source After washing your hands, consider rubbing your hands on fresh hay to make them be more appealing to the baby bunny."
    },
    {
      "title": "Help the bunny eliminate waste.",
      "content": "Help the bunny eliminate waste. If the bunny is a newborn, they need help to urinate and defecate. This should be done after you nurse them. Take a damp cloth or cotton ball and stroke it over the bunny’s genital area. The bunny should start urinating and defecating. Continue to stroke the bunny until the bunny is finished. You should only have to do this until their eyes open, so for around two weeks."
    },
    {
      "title": "Add in pellets and hay.",
      "content": "Add in pellets and hay. When the baby opens their eyes, you can start adding in pellets and hay to their food options. Place the hay and pellets in the corner of their box or nest so the baby bunny can get them if they want them. Don’t give the bunny any fruit and vegetables just yet. Use plain pellets that don’t have any additives, like seeds or banana chips. The pellets should high in fiber. For hay, try timothy, orchard, or alfalfa hay."
    },
    {
      "title": "Determine if the bunny needs to be nursed.",
      "content": "Determine if the bunny needs to be nursed. If your baby bunnies have access to their mother, chances are they are being nursed. You may not see her nurse them, however. This is because rabbits will only nurse their babies a few times each day. Healthy babies will have pink skin, be warm, and appear active. [11] X Research source Check for neglect by seeing if the babies are cold, if they are crying throughout the day, if they are a bluish color, if their skin looks unhealthy and shriveled, and if they are not gaining weight or have a sunken stomach. Try not to disturb wild nests of baby bunnies, even if you don’t see the mother. Mother rabbits don’t stay with their babies in the wild to protect the nest. If you have an orphaned bunny or a neglected, unhealthy bunny, you may need to nurse them."
    }
  ]
}