{
  "url": "https://www.wikihow.com/Prevent-Sunburn-from-Peeling",
  "title": "How to Stop a Sunburn from Peeling: Quick Healing Tips",
  "steps": [
    {
      "title": "Get out of the sun quickly when you notice you’re peeling.",
      "content": "Get out of the sun quickly when you notice you’re peeling. If you’re in the sun and your skin starts to feel hot, tingly, and red, it’s important to limit the damage by getting out of the sun as soon as possible. The longer you stay in the sun, the worse your sunburn will be and the more likely it is to peel. [1] X Research source The faster you start treating your sunburn , the more you’ll limit the damage—which could help keep peeling to a minimum. Limit your exposure to the sun as much as possible while your sunburn is healing. Try not to go outside when the sun is strongest, between about 10:00 AM and 2:00 PM. Wear SPF 30 sunscreen or higher and cover your skin with lightweight clothing if you do have to go outside."
    },
    {
      "title": "Get in cool water to stop the burn right away.",
      "content": "Get in cool water to stop the burn right away. Immediately cooling down your skin may help limit the damage from your sunburn. If you’re swimming in a cool lake, pool, or ocean, hop in for a quick swim to help stop the burn. Or, go inside and take a cool bath or shower. [2] X Research source Don’t stay in the water for too long, as this can dry your skin out even more. [3] X Research source To avoid irritating your sunburned skin, skip the soap and don’t scrub your skin while you’re in the bath or shower. After your swim or shower, use a soft towel to gently dab at your skin. Don’t rub yourself with the towel—this can irritate your skin even more. Stop drying your skin while it’s still a little wet."
    },
    {
      "title": "Apply a moisturizing cream or aloe gel.",
      "content": "Apply a moisturizing cream or aloe gel. After your shower, while your skin is still damp, gently smooth a lightweight, fragrance-free moisturizer onto your sunburn. [4] X Research source The moisturizer will help trap water against your skin—and that extra moisture may help your skin heal faster. [5] X Research source The faster your skin heals, the less likely you are to peel. Moisturizer will soften the dead skin—this may make your peeling less obvious, and it could help you avoid the temptation to pick at your peeling skin. Softening the skin may also speed up the natural sloughing process, helping your peeling go away faster. Continue moisturizing frequently throughout the healing process. If it hurts too much to apply a lotion or gel, try a spray-on moisturizer ."
    },
    {
      "title": "Take an over-the-counter pain reliever.",
      "content": "Take an over-the-counter pain reliever. OTC pain medications like aspirin, ibuprofen, and naproxen can help take away some of the stinging, burning feeling of a sunburn. [6] X Research source And taking it right after you get sunburned might help prevent some swelling, which may help limit peeling. [7] X Research source Be sure to read the label before taking any medications, and talk to your doctor about which medications are safe if you’re pregnant, breastfeeding, or on a prescription that might interact with OTC meds. Don’t give aspirin to teens or children under 16 due to the risk of Reyes syndrome."
    },
    {
      "title": "Drink plenty of water to avoid getting dehydrated.",
      "content": "Drink plenty of water to avoid getting dehydrated. Sunburns pull moisture to the surface of your skin. This can leave you dehydrated, so it’s especially important to drink extra water for the first 2 or 3 days after you get a sunburn. [8] X Research source Staying hydrated may also help your sunburn heal faster, which can help your peeling go away sooner. [9] X Research source"
    },
    {
      "title": "Soothe your skin with cool showers, baths, and cold compresses.",
      "content": "Soothe your skin with cool showers, baths, and cold compresses. For the first few days after you get a sunburn, your skin will be tender, and it could become more inflamed if it gets irritated. Taking cool showers or baths and applying cold compresses can help reduce that inflammation, which may help limit how much you peel. [10] X Research source Spending too much time in the water can dry out your skin, so limit your baths or showers to about 10 minutes each. However, it’s okay to take several cool baths a day if you need to. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If your sunburn starts to blister, take baths instead of showers—the water from a shower could pop the blister. To make a cool compress, wrap an ice pack in a clean, soft towel and hold that against the sunburn. [12] X Research source This will soothe your skin, and it may also reduce inflammation, which might help prevent some peeling. [13] X Trustworthy Source Seattle Children's Hospital Health information provided by Seattle Children's hospital. Go to source Don’t put ice directly on your sunburn or you could damage the skin even more."
    },
    {
      "title": "Keep your skin covered with loose, soft clothing.",
      "content": "Keep your skin covered with loose, soft clothing. Choose soft, breathable fabrics that feel nice against your skin. And try to keep as much of your sunburn covered as possible so you don’t accidentally bump or scrape it and irritate it even more. [14] X Research source If it hurts too much to wear clothes over your sunburn, try something like a bathing suit top that matches your tan lines. Continue treating the burn with pain medicines, cool baths, and moisturizer until you’re comfortable enough to cover up. Avoid scratchy fabrics that could irritate your skin."
    },
    {
      "title": "Try a lightweight cream or gel made with aloe or soy.",
      "content": "Try a lightweight cream or gel made with aloe or soy. Aloe vera gel can help reduce inflammation and may promote faster healing. [15] X Research source Soy-based moisturizers may also help you heal faster. [16] X Research source Hydrocortisone cream can help soothe itchy, peeling skin. Use 1% cortisone cream to help reduce some of your itching, redness, swelling for the first few days—but don’t use hydrocortisone creams on babies or small children unless directed by their pediatrician. Avoid using creams or lotions made of petroleum or other oils. These can trap heat against your skin, making you uncomfortable and potentially worsening the burn. And don’t use creams that contain benzocaine or lidocaine—these may cause an allergic reaction, which can make your sunburn worse. [17] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Peeling occurs as your body gets rid of dead skin cells.",
      "content": "Peeling occurs as your body gets rid of dead skin cells. A sunburn damages the top layers of your skin—more serious sunburns mean the burn goes into deeper layers. As your skin starts to heal, those damaged layers of skin separate and fall off, resulting in a peeling sunburn. [18] X Research source"
    },
    {
      "title": "You can do more damage to your skin if you peel your sunburn.",
      "content": "You can do more damage to your skin if you peel your sunburn. Don’t peel away the dead skin—just let it come off on its own. As Dr. Pierre-Louis explains, “if you’re peeling and pull [the skin] off, you could potentially go into the dermis, and that could lead to a scar.” Avoid using exfoliating products, and don’t scrub your skin to try to make it peel faster. [19] X Research source Also, don’t pop any blisters, as this increases your risk of getting an infection. [20] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "If you have a sunburn, your skin will be red and tender.",
      "content": "If you have a sunburn, your skin will be red and tender. If you have a more serious sunburn, the damage will go further into the skin, and you may experience swelling, blistering, and dehydration. If your burn is severe, you may also experience nausea, dizziness, fever, chills, and headache—see a doctor if you develop these symptoms. [21] X Research source"
    },
    {
      "title": "Effects of sun exposure include sunburns, premature aging, and skin cancer.",
      "content": "Effects of sun exposure include sunburns, premature aging, and skin cancer. Dr. Goldenberg says that exposure to the sun causes UV radiation, “which is known to mutate skin cells and lead to skin cancer, premature aging, and skin discoloration.” Dr. Pierre-Louis agrees, saying that “no matter if you’re a fair skin type or darker skin type, you should use sunscreen every day to reduce your risk of skin cancer. Sunscreen also helps you prevent fine lines, wrinkles, and brown spots. If you have a darker skin type, wearing sunscreen will help you have a more even tone as you age.”"
    },
    {
      "title": "Most sunburns take about a week to heal.",
      "content": "Most sunburns take about a week to heal. Minor sunburns only affect the top layer of your skin, so they'll heal pretty quickly. If the sunburn isn't very serious, you should notice the redness going away within a few days, and you'll usually be healed in about 5–7 days. [22] X Research source If you have a more serious sunburn, like one that blisters, it can take up to two weeks to heal. That's because the sunburn has damaged more layers of skin. [23] X Research source You’ll usually stop peeling once the sunburn is healed."
    },
    {
      "title": "Get medical help if you have a lot of blistering or a fever.",
      "content": "Get medical help if you have a lot of blistering or a fever. Severe sunburns can turn into a medical emergency, so check with your doctor if you have large blisters, burns over a lot of your body, or a fever and chills. [24] X Research source Other signs that you should see a doctor include: Dizziness Lightheadedness Confusion Headache [25] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Muscle cramps Swelling of the face [26] X Research source Rapid breathing or increased heart rate Signs of infection, like red streaks radiating from your sunburn or pus coming from the burn The sunburn is on a baby under 1 year old"
    },
    {
      "title": "Wear SPF 30 sunscreen every day.",
      "content": "Wear SPF 30 sunscreen every day. Dr. Pierre-Louis says that the best way to prevent sunburn is to apply a thick layer of SPF 30 sunscreen to any exposed skin every day before you go outside—\"you should be able to see the product on your skin.” She also recommends to “reapply your sunscreen every two hours if you’re sunbathing or suntanning. If you’ve gotten wet or you’ve sweated the sunscreen off, reapply it even sooner.” “If you’re using a mineral sunscreen,” Dr. Pierre-Louis continues, “use one that contains zinc or titanium and looks white when you put it on—you’ll be protected from the sun right away. If you’re using a chemical sunscreen that looks clear, wait about 20 minutes before going out in the sun.”"
    },
    {
      "title": "Cover up with tight-weave fabrics that block the sun.",
      "content": "Cover up with tight-weave fabrics that block the sun. Dr. Goldenberg advises that covering up with sun-protective clothing and a wide-brimmed hat can help reduce your exposure to the sun. Look for clothing made with UPF fabrics—these are especially good at blocking the sun’s UVA and UVB rays."
    },
    {
      "title": "Take extra precautions from 10:00 AM to 2:00 PM.",
      "content": "Take extra precautions from 10:00 AM to 2:00 PM. The best way to prevent peeling is to avoid getting a sunburn in the first place. Dr. Goldenberg advises to stay out of the sun when the sun is strongest and you’re more likely to burn. If you do have to go outside during this time, cover up, try to stay in the shade, and wear sunscreen."
    },
    {
      "title": "Do sunburns always peel?",
      "content": "Do sunburns always peel? No, not all sunburns peel, but many do. The best way to avoid peeling is to prevent sunburn in the first place. [27] X Research source"
    },
    {
      "title": "Does aloe vera help treat sunburn?",
      "content": "Does aloe vera help treat sunburn? Yes, aloe vera is a gentle moisturizer that can help soothe a sunburn. It may also help your sunburn heal faster. [28] X Research source"
    },
    {
      "title": "How can I fix my peeling sunburn overnight?",
      "content": "How can I fix my peeling sunburn overnight? Unfortunately, there’s no way to speed up the healing process once a sunburn has occurred—it will usually take anywhere from a few days to a week to heal, or longer for a severe burn."
    },
    {
      "title": "How can I stop my sunburn from peeling on my face?",
      "content": "How can I stop my sunburn from peeling on my face? Moisturizing your face while it heals may help limit how much your skin peels. However, the only way to fully prevent peeling is to avoid getting a sunburn on your face in the first place."
    },
    {
      "title": "Why is my skin peeling if I don’t have a sunburn?",
      "content": "Why is my skin peeling if I don’t have a sunburn? Peeling skin can be caused by skin conditions like dry skin, dermatitis, eczema, and psoriasis. It can also be due to certain infections. Also, some medications and skin care products can lead to peeling skin, including some acne and anti-aging treatments. [29] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}