{
  "url": "https://www.wikihow.com/Manage-Family-Finances",
  "title": "How to Manage Family Finances",
  "steps": [
    {
      "title": "Talk openly about your finances.",
      "content": "Talk openly about your finances. While this is important all the way through life, it is especially important to establish financial honestly before you get married. If one partner has a poor credit history or large debts that are not brought up before marriage, it can lead to resentment and problems down the road. Before getting married, you should meet with your loved one and discuss his current financial situation, including how much he makes, where that money goes, his credit history, and any large debts he is carrying. This sets the tone for financial openness in the rest of your lives together. [1] X Research source"
    },
    {
      "title": "Meet regularly to talk about money.",
      "content": "Meet regularly to talk about money. Decide on a time of the month to get together specifically to discuss your finances. Perhaps this meeting can coincide with the arrival of the monthly bank statement or the due date of monthly bills. In any case, use your time at this meeting to assess the previous month's expenditures, mark your progress towards long-term goals, and to propose any changes or major purchases that you want to make. Only by talking about money regularly can you make doing so a comfortable and productive experience."
    },
    {
      "title": "Don't make one person the sole manager of the family's money.",
      "content": "Don't make one person the sole manager of the family's money. Many families choose to allow one person to take charge of all the family's finances; however, this places an unnecessary burden on that person and leads to others' being unaware of the family's current financial situation. In addition, if that person leaves through death or divorce, it leaves the others completely unaware of how to manage or even access the family's finances. Solve this problem by splitting up tasks between you or by managing finances in alternating months. Both you and your spouse should attend any meetings with financial professionals, such as those with a loan officer or investment advisor. [2] X Research source"
    },
    {
      "title": "Decide on an account setup.",
      "content": "Decide on an account setup. Families have options when it comes to setting up joint accounts. Some choose to keep everything together while others keep their finances mostly separate. At minimum, you should have a joint account to pay for household expenses and your mortgage payment. At the end of the month, you can split these expenses in half and each transfer in an equal amount of money into this account to pay these expenses. Having separate account can prevent arguments that might arise from one person's spending habits. Just make sure to set limits to how much money each of you can spend each month so that one person doesn't end up spending all of the family's money."
    },
    {
      "title": "Build up individual credit.",
      "content": "Build up individual credit. Even though your finances will be combined, it is still important for each of you to have a strong credit score. Doing so will ensure not only that your credit will be good when you apply for credit jointly, but also that your credit history will remain intact if you split up. A simple way to manage this is by having separate credit cards, each established only in the name of the spouse who uses it."
    },
    {
      "title": "Choose a budget format.",
      "content": "Choose a budget format. Before you create a budget, you'll have to decide how to keep that budget. While many people can get away with just using a notepad and pen, others find it easier to track their spending through a spreadsheet or financial software. There are a number of a free software platforms available online that you can use to establish and track a budget. For example, programs like Mint.com and Manilla offer free budgeting services. If you want full service financial software, try Quicken or Microsoft Money. [3] X Research source"
    },
    {
      "title": "Assess your current spending habits.",
      "content": "Assess your current spending habits. For a month, write down a note every time you spend money, even for very small amounts. Record the amount spent and what it was you paid for. At the end of the month, sit down with your spouse and total up both your spending. Add in major expenditures to get a clear picture of where the family's money went that month. Split up expenses by category (home, car, food, etc.) if you can. Then, compare that amount to your combined, after-tax income. This is your starting point for determining a budget. It may also be helpful to work with your bank statement to make sure you didn't miss any recurring payments or online purchases when totaling your expenses. [4] X Research source"
    },
    {
      "title": "Come together to create a budget.",
      "content": "Come together to create a budget . Look at your compiled spending habits. Do you have a surplus? Or are you spending more than you make? Work from here to identify areas where you can cut back, if needed. If at all possible, try to free up money that can be put into savings or into the retirement fund. Create spending limits on certain categories, like food and entertainment, and try to stick to them over time. Remember to always leave room in your monthly budget for unexpected expenses, like small medical bills or car repairs. [5] X Research source"
    },
    {
      "title": "Work to improve and change your budget as needed.",
      "content": "Work to improve and change your budget as needed. Return to your budget regularly to eliminate unnecessary spending or to adjust your budgeted amounts as needed. For example, having a child may cause you to have to completely restructure your budget. In any case, constantly seek out areas where you can cut back and save more. You'll find that you can be just as happy while spending much less than you do now."
    },
    {
      "title": "Decide on long-term goals together.",
      "content": "Decide on long-term goals together. Have an open conversation about your savings goals, including saving for a house, for retirement, and for other large purchases like a car or boat. Make sure that you both agree that the purchase or expense in question is worth saving for and that you agree on the amount needed. This will help coordinate your savings and investment efforts."
    },
    {
      "title": "Create an emergency fund",
      "content": "Create an emergency fund . Every family should strive to keep an emergency savings fund for when things go south. Who knows when one of you might lose a job or experience unexpected medical problems? An emergency fund can help you avoid future debt and provide some financial security and flexibility. [6] X Research source The traditional wisdom is to keep three to six month's salary in a savings account; however, this would be more than enough for some families and not nearly enough for others. Luckily, there are several financial calculators online that you can use to calculate roughly how much you need to save to cover your expenses. Try searching for emergency fund calculators using a search engine. There is also an app, HelloWallet, that offers this type of calculator. [7] X Research source"
    },
    {
      "title": "Reduce your debt",
      "content": "Reduce your debt . Your first goal should be to pay off your existing debt. Only by paying down student loans, car loans, and other debt can you qualify for more credit as a couple and move forward with saving for other goals. To eliminate debt, work together to pay more than the minimum payment on each loan (as long as there are no prepayment penalties for doing so). Work with your spouse to create a plan and schedule for paying off your outstanding debt. If necessary, have one of you in charge of making sure that debt payments have been made each month."
    },
    {
      "title": "Save for retirement",
      "content": "Save for retirement . Couples should start planning for retirement as early as possible. This is because, due to the effects of compound interest, money placed in a retirement fund at a young age will earn much more interest over its life than the same amount of money put in at a later age. Make sure to make every effort to increase your retirement savings, including seeking to max out your employer's 401(k) match (if they have one), maxing out IRS-limits for 401(k) savings, and regularly increasing your retirement savings amounts if you can fit it into the budget. You should save for retirement before putting money into education funds for your children. This is because there will always be scholarships and grants available for education, but not for your retirement. If you don't have a combined retirement portfolio, be sure to coordinate your risk profiles and asset allocations. [8] X Research source"
    },
    {
      "title": "Plan for educational expenses.",
      "content": "Plan for educational expenses. If you're planning to fund part or all your child's higher education, it's best to start saving early on. Start by investigating options like 529 savings plans, which have special tax benefits for students. Speak with a financial advisor to learn more and get started saving today. If you don't have much time before your child leaves for school, look into government loans and grants, as well as your option in earning federal student aid. [9] X Research source"
    },
    {
      "title": "Don't make large purchases without discussing them first.",
      "content": "Don't make large purchases without discussing them first. Establish a monetary limit for what constitutes a \"major\" purchase. Obviously, this will differ between families, but the important thing is that you have a set limit. For any purchases above this limit, decide that the spouse making the purchase must have the approval of the other before going through with it. If either of you ever breaks this rule, be sure to tell the other immediately. Keeping large expenditures private is just asking for trouble."
    },
    {
      "title": "Avoid taking on unnecessary debt.",
      "content": "Avoid taking on unnecessary debt. Keep each other on track by avoiding taking on debt for medium-sized purchases like furniture or jewelry. Plan these purchases out beforehand with your spouse so that you can combine your resources and afford the full amount of the purchase. This will save you money on interest payments in the long term. In addition, always check in with each other about credit card debt. It may be in your best interest to help a spouse with her credit card payment if she can't make it; missing a monthly payment will hurt your combined credit, which you will need if you apply for a large loan like a mortgage."
    },
    {
      "title": "Use software to monitor your finances.",
      "content": "Use software to monitor your finances. With all of the budgeting and financial planning software available today, you'd be a fool not to take advantage of these useful tools. For starters, try tracking your monthly budget in a shared spreadsheet like those available in Google Drive. This type of document allows both of you to access and change the sheet as needed. For budgeting, there is are apps available like HomeBudget or Mint, which summarize the family budget and assets into a simple user interface. There are also apps for keeping track of financial paperwork, like FileThis. Try a few of these apps out and decide which ones work for you. Most of them are free or inexpensive to use, or at least offer a trial period. [10] X Research source"
    }
  ]
}