{
  "url": "https://www.wikihow.com/Prune-a-Mango-Tree",
  "title": "How to Prune a Mango Tree",
  "steps": [
    {
      "title": "Cut the tree's main shoot after it grows to 1 metre (3.3 ft) or over.",
      "content": "Cut the tree's main shoot after it grows to 1 metre (3.3 ft) or over. This promotes growth of the trunk, as well as strong horizontal branches that will form the skeleton of your tree. After it reaches this initial height—which should happen after 12 to 18 months—cut the main shoot back to 0.6 to 0.7 metres (2.0 to 2.3 ft) using pruning shears. Always cut below the \"ring of buds,\" which is the concentrated spiral of leaves on the primary stem. [1] X Research source Cutting above the \"ring of buds\" creates a weak point and promotes uneven spacing between newly grown shoots."
    },
    {
      "title": "Remove a few of the horizontal branches underneath the first cut.",
      "content": "Remove a few of the horizontal branches underneath the first cut. About 6 or 7 will probably grow in total. Leave about 3 to 4 horizontal shoots behind, each equally spaced apart. Never remove all of the branches, as these horizontal shoots will eventually form the tree's primary scaffolding. [2] X Research source"
    },
    {
      "title": "Allow your primary scaffold limbs to grow over 1 metre (3.3 ft) long.",
      "content": "Allow your primary scaffold limbs to grow over 1 metre (3.3 ft) long. The 3 or 4 horizontal limbs that you let grow be should reach an average length about 18 to 24 months after planting. Once they do, cut them back to 1 metre (3.3 ft). Again, always cut below the \"ring of buds.\" [3] X Research source Pinch off any leaves with your fingers during pruning. [4] X Research source Continue to cut the horizontal shoots below your initial cut into the second year. Once your tree begins to bear fruits—which should happen in the second or third year after planting—you can move on to fruiting pruning procedures."
    },
    {
      "title": "Attach weights to shoots that grow vertically.",
      "content": "Attach weights to shoots that grow vertically. The shoots that extend from your buds should be extending horizontally, as these limbs have more strength and bear fruit earlier. Suspend commercial plant anchors (or other heavy objects) from vertically growing shoots using a string. Weights should be heavy enough that they pull the branches into a horizontal position, but not so heavy that they curve downward. [5] X Research source For best results, leave weights attached for approximately 3 months."
    },
    {
      "title": "Prune immediately following harvesting using loppers.",
      "content": "Prune immediately following harvesting using loppers. After you harvest your fruits, it's important to prune in preparation for the next season of fruit bearing. Summer pruning is also ideal because the wounded parts of the tree heal faster. Use lopping shears for large branches up to 50 millimetres (2.0 in) in diameter. Avoid pruning the sides of the tree when possible."
    },
    {
      "title": "Cut lower branches to 1.2 metres (3.9 ft) from ground level.",
      "content": "Cut lower branches to 1.2 metres (3.9 ft) from ground level. This is called skirting and will make it easier for you to conduct weed removal, watering, and fertilizer application. The goal is to maintain a modest tree height and clean up its lower region. Keeping a modest tree height improves flowering and, in turn, fruit production."
    },
    {
      "title": "Remove any strong vertical shoots as opposed to horizontal shoots.",
      "content": "Remove any strong vertical shoots as opposed to horizontal shoots. During your regular inspections, always favor horizontal shoots that show potential for growth. This promotes a strong, compact structure. [6] X Research source Leaving a few vertical branches is fine if you have enough horizontal branches to provide support (around 3 to 4 primary limbs). Your mango trees should have a solid, fully formed structure after 3 years."
    },
    {
      "title": "Trim branches down to 50.8 centimetres (20.0 in) in length.",
      "content": "Trim branches down to 50.8 centimetres (20.0 in) in length. Focus on trimming horizontal shoots, and do so immediately after harvest. This is especially important during the second or third year following planting, as trimming helps your tree put more energy into fruit production. [7] X Research source Continue this procedure through the second year and then stop."
    },
    {
      "title": "Conduct pre-flowering pruning in the middle of May.",
      "content": "Conduct pre-flowering pruning in the middle of May. This pruning is time-sensitive and should be completed during a 2 to 4 week period right before the flowering season starts. Ideally, it will be followed immediately by flowering, not vegetative growth. [8] X Research source Use pruning saws for branches and trunks up to 150 millimetres (5.9 in) in diameter. Avoid pruning after flowering—this can cause crop loss."
    },
    {
      "title": "Remove 1 major limb per year.",
      "content": "Remove 1 major limb per year. The larger structural limbs are important for growth, but also draw energy from fruit production. Choose a limb that supports the most amount of unruly growth (such as vertical branches). By removing a small amount over time, also known as \"thinning cuts,\" you can mediate vegetative growth and keep your fruits fresh. [9] X Research source Cut the limbs right down to the trunk."
    },
    {
      "title": "Cut side branches at least 50 centimetres (20 in) from neighboring trees.",
      "content": "Cut side branches at least 50 centimetres (20 in) from neighboring trees. Side branches are the ones that extend perpendicular from the major structural limbs. Afterwards, cut down the branch that is attached to the side branch (the one parallel to the main branch). Trim it down to just under the spot where the side branch extends. [10] X Research source Take care to make a clean cut when cutting the remaining branch, as it needs to continue growing healthily."
    },
    {
      "title": "Remove branches that clutter the inside of the tree.",
      "content": "Remove branches that clutter the inside of the tree. Focus on dead twigs, branches, and middle topmost twigs that take up lots of space. This makes it easy to control pests and diseases through better spray penetration. It also leaves the tree more open to sunlight, which is beneficial for fruit color. [11] X Research source Always focus on removing vertical branches over horizontal branches. [12] X Research source"
    },
    {
      "title": "Apply pruning paint to side branches after the cut regions dry.",
      "content": "Apply pruning paint to side branches after the cut regions dry. This will seal the surface and promote faster healing by holding in water. It also prevents bacteria and fungi from infecting your newly cut branches. [13] X Research source Pruning paint isn't a necessity, but it is recommended if there are known pests and diseases in the area."
    }
  ]
}