{
  "url": "https://www.wikihow.com/Remove-Eggplant-Seeds",
  "title": "How to Remove Eggplant Seeds",
  "steps": [
    {
      "title": "Remove the seeds if you want to decrease the bitterness of your eggplant.",
      "content": "Remove the seeds if you want to decrease the bitterness of your eggplant. The seeds are what hold most of the bitter flavor in an eggplant. You don’t have to remove them, but if you prefer your eggplant to be less bitter, go ahead and get rid of them. [1] X Research source Older eggplants have more seeds, and are thus more bitter. Seeds that are turning brown also tend to be more bitter. If you’re using small, young eggplant, you might not have to remove the core because it won’t have a lot of seeds or bitterness anyways."
    },
    {
      "title": "Slice your eggplant in half lengthwise.",
      "content": "Slice your eggplant in half lengthwise. Place the eggplant on a cutting board and hold it still with your non-dominant hand. Carefully slice it in half lengthwise using a sharp kitchen knife with your dominant hand. [2] X Research source Be careful not to cut towards the hand that is holding the eggplant steady. Always keep your fingers out of the way of your knife. If you want round slices of eggplant for your recipe, you can go ahead and cut it into slices instead of horizontally."
    },
    {
      "title": "Scrape out the seedy core using a metal spoon.",
      "content": "Scrape out the seedy core using a metal spoon. Hold half of the eggplant in your non-dominant hand and hold a metal spoon in your dominant hand, with your thumb pressed against the handle near the head of the spoon and the curved part of the spoon facing down. Stab the tip of the spoon into the top end of the seedy core, then drag the spoon down along the flesh to scrape the soft core out. Repeat this for the other half of the eggplant. [3] X Research source If you cut your eggplant into slices instead of horizontally, you can slide the edge of the spoon or the tip of a knife around the soft core of each slice to remove the seeds instead of scraping them out."
    },
    {
      "title": "Use your kitchen knife to slice or cube the eggplant flesh.",
      "content": "Use your kitchen knife to slice or cube the eggplant flesh. You will now be left with just the seeded flesh of the eggplant. Cut and cook the eggplant according to what your recipe calls for. [4] X Research source You don’t have to remove the skin to cook and eat eggplant."
    },
    {
      "title": "Scoop the seeds out of an eggplant into a bowl of water.",
      "content": "Scoop the seeds out of an eggplant into a bowl of water. Fill a bowl with clean, cool water. Slice an eggplant lengthwise on a cutting board using a sharp kitchen knife. Hold a metal spoon with your thumb near the base of the handle and use it to scrape out the soft, seedy core from each half of the eggplant into the bowl of water. Keep scraping until all the pulp and seeds are in the water. [5] X Research source The bowl of water will help you separate the seeds from the core’s pulp."
    },
    {
      "title": "Use your fingers to rub the seeds off the pulp and into the water.",
      "content": "Use your fingers to rub the seeds off the pulp and into the water. Grab pieces of pulp and rub them firmly between your fingertips under the surface of the water to separate the seeds from the pulp. Keep doing this until you clean all the seeds off the pieces of pulp and the seeds are floating around in the water. [6] X Research source There may be some seeds that are more deeply embedded in pieces of pulp that you can’t get out just by rubbing them. You can try to dig them out if you want, or you can just do the best you can and rub the majority of the seeds off."
    },
    {
      "title": "Pour the water out through a mesh strainer and rinse the seeds with water.",
      "content": "Pour the water out through a mesh strainer and rinse the seeds with water. Pick out the big, firm chunks of pulp from the strainer until you’re left with just seeds and soft pulp. Blast high-pressure water from a sink or hose through the strainer until all the soft pulp gets pushed through and there are only seeds left. Make sure the strainer you use is made of fine mesh, so the seeds don’t slip through it."
    },
    {
      "title": "Dry the seeds for 1-2 days in a well-ventilated area.",
      "content": "Dry the seeds for 1-2 days in a well-ventilated area. Dump the seeds out onto dry paper towels or newspaper and pat them dry. Transfer the seeds to a clean, dry plate and spread them out evenly. Leave them to dry for 1-2 days. If the seeds stay too wet, they might germinate. Make sure you soak up all the excess moisture with paper towels or newspaper before you transfer them to a plate. Any dry, well-ventilated place is fine to leave your seeds to dry. Try to keep them out of direct sunlight so they don’t get cooked."
    },
    {
      "title": "Store your dried seeds in a clean, dry container for up to 5 years.",
      "content": "Store your dried seeds in a clean, dry container for up to 5 years. Transfer the seeds to something like a jar, envelope, or sealable baggy and seal the container. Keep them somewhere cool and dry and they will be good for up to 5 years. It might be a good idea to label the container with the date you stored the seeds, so you know how long they are good for."
    }
  ]
}