{
  "url": "https://www.wikihow.com/Play-Monopoly-with-Alternate-Rules",
  "title": "How to Play Monopoly with Alternate Rules",
  "steps": [
    {
      "title": "Decide on a rule for landing on unclaimed properties.",
      "content": "Decide on a rule for landing on unclaimed properties. If you land on an unclaimed space that you can either not afford or choose not to buy, the official rules state that you must have an auction for that property. However, many people either: Let the person decline purchasing the property without any action. Ban that person from purchasing that property if they land on it again while it is unclaimed."
    },
    {
      "title": "Add money to Free Parking.",
      "content": "Add money to Free Parking. Pay all fees to the bank (such as from a Chance or Community Chest) to the middle of the board. The next person to land on Free Parking collects the pot in the middle. Add some money (usually $50 or $500) so anyone who lands on Free Parking doesn't leave empty handed."
    },
    {
      "title": "Receive extra money for landing on “Go.”",
      "content": "Receive extra money for landing on “Go.” Receive an extra $50 or $100 in addition to the $200 if you land on Go. You could also collect double money for landing on GO, which would be $400. The amount you receive for landing on Go should be decided before the game starts. [1] X Research source"
    },
    {
      "title": "Add random fees.",
      "content": "Add random fees. Make players pay fees for random offenses. These offenses should be decided before the beginning of the game. The fees could involve dice. For example, if someone makes a sloppy dice roll, then make them pay $50 to the center of the board. If someone rolls the dice off of the table, make them pay $50 or $100. The rules can be made up by the players and be as random as anyone that knocks over a real estate piece has to pay a fine. [2] X Research source"
    },
    {
      "title": "Require players to be honest about rent.",
      "content": "Require players to be honest about rent. Typically, real estate owners have to keep an eye on other players to see who lands on their property. If the real estate owner doesn’t catch a player landing on the property, then the player doesn’t have to pay. Play an honest game by requiring everyone to pay rent, even if the real estate owner doesn’t see that the player has landed on the real estate. [3] X Research source"
    },
    {
      "title": "Allow players to go straight to hotels.",
      "content": "Allow players to go straight to hotels. If a player has enough money, allow him or her to buy a hotel immediately. The price of the hotel should be equal to five houses. Even if there are not enough houses left to buy, that will not matter with this alternate rule for players with a lot of money. All that matters is if the player has enough money for five houses. [4] X Research source This option will benefit players with a lot of money, but hurt the players with little money."
    },
    {
      "title": "Make the option of unlimited property.",
      "content": "Make the option of unlimited property. In a usual game, a player is only allowed to buy a certain amount of property based on what is left, and once it is gone, the other players do not have the option of buying real estate. Allowing an unlimited amount of houses and hotel gives players who struggled in the beginning a chance to catch up as the game progresses. You can choose to remember how many houses and/or hotels you own, or mark them with a small piece of paper. [5] X Research source"
    },
    {
      "title": "Let players have double hotels.",
      "content": "Let players have double hotels. Alter the rule to allow players to have two hotels on a piece of property. When other players land on that property, they must pay the price of rent for two hotels. It is also an option to have one hotel and build up to another hotel buy having multiple houses on the property. [6] X Research source For example, if a property has one hotel and three houses on Boardwalk, then the rent would be $3400."
    },
    {
      "title": "Form a partnership.",
      "content": "Form a partnership. Two or more players can form a partnership when they have a monopoly between them. Each player can buy property (houses and hotels) for that property, as long as they follow the rules for building property. Once the partnership is formed, it can be left between dice rolls. If a partner leaves, the other partner is forced to sell his or her portion of the partnership. [7] X Research source You can also make it an option for the remaining partner to buy the former partner’s portion of property."
    },
    {
      "title": "Make non-monopoly building an option.",
      "content": "Make non-monopoly building an option. Allow players to build properties on certain locations, even if they do not own the entire set of properties. This can be an option, but make the cost of property double what it normally is. If the player decides to sell it back to the bank, the player only receives half of what the cost normally is. [8] X Research source"
    },
    {
      "title": "Choose an “Angel of Death.”",
      "content": "Choose an “Angel of Death.” Put strips of paper into a hat and draw a star on only one of the slips. The player that draws the star will be the “Angel of Death.” This player should reveal that they are the Angel of Death. After two hours, this person has the option of ending the game without a winner at any time. The Angel of Death, however, must still be in the game to end it. [9] X Research source"
    },
    {
      "title": "Alter railway rules.",
      "content": "Alter railway rules. If you own more than one railway, and you land on one of your own railways, you may \"take a train\" to another one of your railroads on your next move instead of rolling the dice. If another player lands on one of your railways, they may travel to another of your railroads in the same way by paying an agreed upon \"ticket fare\" in addition to the regular rent. [10] X Research source"
    },
    {
      "title": "Allow unlimited doubles.",
      "content": "Allow unlimited doubles. Typically, three consecutive doubles will land a player in Jail. It is an option to allow a player to roll unlimited doubles with no consequences. This is great for the lucky player that rolls more than three consecutive doubles, but may get frustrating for the rest of the players. [11] X Research source"
    },
    {
      "title": "Play a game with hostile takeovers.",
      "content": "Play a game with hostile takeovers. If a player offers to pay 'N' times the face value of a property (Value of N is decided before starting the game) which is owned by another player, who doesn't want to sell it, then the fate of the proposed trade is decided by rolling the dice by both players involved (Aggressive Buyer & Noncommittal Seller). Whoever score highest wins his side of the trade. Hostile bids have to be either on single properties, or if the property is developed then the face value should include the development face value. If the seller owns a pack of single color of properties, the bid has to be for N times the face value of pack (pack cannot be broken by hostile takeover). Only two hostile bids are allowed between two players before the buyer completes one round around the board. Only one bid per property per player per round. The seller has to pay 30% of the trade value to the bank as tax (this also prevents immediate reverse hostile take over)"
    },
    {
      "title": "Play a shorter game.",
      "content": "Play a shorter game. Games of Monopoly can be played for hours at a time with seemingly no end in sight. It is, however, possible to play a shorter game that will only last an hour to and hour and a half. To make the game shorter (use a slightly different set of rules: Pass out two or three free properties from the bank to each player at the beginning of the game. Only three houses are required before building a hotel instead of four. Always get out of jail on your first turn, whether you use a get out of jail free card, roll doubles, or pay $50. Always pay a flat $200 when landing on Income Tax. End the game when one person goes bankrupt. All players must add up their properties and houses/hotels at purchase price, their cash, and their mortgaged properties half of the purchase price. The winner is the player with the highest total value. If you wish for a shorter game, do NOT include any of the \"house rules\" which allow for more money."
    }
  ]
}