{
  "url": "https://www.wikihow.com/Mask-Shards-Hollow-Knight",
  "title": "Easiest and Best Ways to Get Mask Shards in Hollow Knight",
  "steps": [
    {
      "title": "Mask Shards increase your health.",
      "content": "Mask Shards increase your health. Four Mask Shards equal one Ancient Mask, which increases the health points of your character by 1. And with 16 Mask Shards in Hollow Knight, you can get up to 4 Masks in the game. You can increase this health pool more with charms and lifeblood cocoons. Increased health will make your enemies a little easier to beat since you won't die as quickly as before."
    },
    {
      "title": "Buy for 150 Geo.",
      "content": "Buy for 150 Geo. Find Sly in the Forgotten Crossroads and he will allow you to purchase this Mask Shard once he opens his shop in Dirtmouth. To find him in the Forgotten Crossroads, look in the southeastern region of the map."
    },
    {
      "title": "Buy for 500 Geo.",
      "content": "Buy for 500 Geo. After you found Sly in Forgotten Crossroads and after you've purchased the first Mask Shard, you can buy the second one."
    },
    {
      "title": "Buy for 800 Geo.",
      "content": "Buy for 800 Geo. You'll need the Shopkeeper's Key from Crystal Peak to purchase this mask shard. Without the key, you won't see the shard for sale."
    },
    {
      "title": "Buy for 1,500 Geo.",
      "content": "Buy for 1,500 Geo. You'll need the Shopkeeper's Key from Crystal Peak to purchase the 3rd shard as well as this mask shard. Without the key, you won't see the shard for sale."
    },
    {
      "title": "Defeat the Brooding Mawlek boss.",
      "content": "Defeat the Brooding Mawlek boss. It's in the western reaches of Forgotten Crossroads. When you enter the crossroads, head left and continue in that direction until you find a large vertical shaft, then drop down and take the 3rd exit on the left."
    },
    {
      "title": "Rescue 5 Grubs.",
      "content": "Rescue 5 Grubs. If you've rescued 5 Grubs, go talk to the Grubfather in Grubhome (the northwestern corner of Forgotten Crossroads) to receive a Mask Shard."
    },
    {
      "title": "Avoid Gloams.",
      "content": "Avoid Gloams. In the southern reaches of Forgotten Crossroads, you'll find yourself in a large cavern with plenty of invincible Gloams. You need to get to a ledge in the lower left corner without touching or running into any Gloams. Once you're at the ledge, drop down and you'll find a Mask Shard in a little alcove. It's recommended that you have Mantis Claw or Monarch Wings for this."
    },
    {
      "title": "Avoid the spikes.",
      "content": "Avoid the spikes. Located in the bottom right side of Queen's Station, which is to the far left of the Fungal Wastes map, you'll find a room full of spikes/thorns that you need to avoid. Use wall dashes and jumps to get through the tiny maze. Mantis Claw is required."
    },
    {
      "title": "Bretta's house.",
      "content": "Bretta's house. You need to rescue Bretta from the Fungal Wastes before you can visit her house to get the Mask Shard."
    },
    {
      "title": "Defeat No Eyes' and go to the next room.",
      "content": "Defeat No Eyes' and go to the next room. You'll see the shard floating in the middle of this room. The Lumafly Lantern in required. Buy it from Sly in Dirtmouth for 1,800 Geo."
    },
    {
      "title": "Swim to the bottom.",
      "content": "Swim to the bottom. Since this level is almost always completely dark, the Lumafly Lantern is recommended. From Conifer's room, go left until you reach the next room, then pick the path that goes down."
    },
    {
      "title": "Use Monarch Wings and Mantis Claw to get to the shard.",
      "content": "Use Monarch Wings and Mantis Claw to get to the shard. Since the area is impossible to traverse without those two things, they are required. You'll need Monarch Wings to double-jump up the wall then use Mantis Claw to wall-jump to Fungal Core (a sub-area of Fungal Wastes). Once you're in Fungal Core, go left and drop off each ledge until you find a hole in the bottom left corner. Drop down it and follow the path to the bottom, then drop down a massive hole to Deepnest."
    },
    {
      "title": "Defeat the Crystal Guardian and Enraged Guardian.",
      "content": "Defeat the Crystal Guardian and Enraged Guardian. You need Monarch Wings and Mantis Claw. Once you defeat the Crystal Guardian at Crystal Peak, you'll head up to the small room that's north of the Crystal Guardian's room. Defeat the Enraged Guardian and get your shard."
    },
    {
      "title": "Find the shard after baiting a Hive Guardian to break a wall.",
      "content": "Find the shard after baiting a Hive Guardian to break a wall. Go to the far right side of the screen to attract a Guardian and then repeatedly wall-jump until the Guardian uses its charging bounce attack, which should break it open. Once the wall is broken, you can simply pick up the Mask Shard."
    },
    {
      "title": "Collect 1,500 Essence.",
      "content": "Collect 1,500 Essence. You need the Dream Nail to continue. After you have the Dream Nail, you can continue to challenge Whispering Roots and Dream Warriors to collect Essence. With the Dream Nail, you can return to bosses that you've already defeated and challenge their much more powerful counterparts to fight you in return for Essence. After collecting 1,500 Essence, return to The Seer in Resting Grounds for your Mask Shard."
    },
    {
      "title": "Complete the Grey Mourner side quest.",
      "content": "Complete the Grey Mourner side quest. This Mask Shard can be the most difficult to get because of certain restrictions. With the Delicate Flower from the Grey Mourner, you must travel to a grave in Queen's Gardens without using a Dreamgate teleport or Stagways, and without taking any damage. If you're trying the side quest and your flower breaks, you can always return to the Grey Mourner for a replacement. [1] X Research source Once you complete the side quest, return to the Grey Mourner for your Mask Shard."
    }
  ]
}