{
  "url": "https://www.wikihow.com/React-if-a-Guy-Tries-to-Make-You-Jealous",
  "title": "How to React if a Guy Tries to Make You Jealous",
  "steps": [
    {
      "title": "Evaluate the actions in question.",
      "content": "Evaluate the actions in question. When dealing with a crush who makes you jealous, you might wonder if his efforts at jealousy are intentional or accidental--and if you don't ask yourself this question, you probably should. Your crush might flirt with other girls in front of you to get your attention, but it's also possible that he's just a natural flirt who does it without thinking. This issue typically occurs when the guy in question flirts with you and several other girls. It can be hard to know if he genuinely likes you, or if he's flirting indiscriminately. To figure out if he might like you more than the other girls he flirts with, ask yourself if there's a difference between his flirtation with you and his flirtation with others. For instance, when you see him in the hallway, pay attention to where his eyes are. If he immediately locks eyes with you, that's probably a good sign. On the other hand, if he's looking at another girl and barely acknowledges you (or doesn't acknowledge you at all), that's probably a bad sign. [1] X Research source Try not to assume that a guy who talks endlessly about his girlfriend in front of you is doing so to make you jealous. It's possible that he's genuinely head-over-heels for her and just trying to let you know. [2] X Research source Even if he's honestly using his girlfriend to make you jealous and spur romantic feelings in you, the disloyalty and disrespect this behavior demonstrates should be a warning sign telling you to stay away from a potentially toxic mate."
    },
    {
      "title": "Be honest about your feelings.",
      "content": "Be honest about your feelings. If you think your crush really is trying to make you jealous, the best thing you can do is tell him how you feel. There's a decent chance that his actions are caused by insecurity about how you feel. Letting him know that your feelings of attraction are mutual may resolve the problem. This step is easier said than done, of course, and you do face the risk of rejection by following through and telling your crush you want to date him. Even so, clearing the air is the only way to fix the issue before it gets worse. Wait until the next time you two find yourselves flirting in a private, one-on-one setting, then let him know you're interested in something more. Wait for his response before determining how to approach the topic of jealousy. Reader Poll: Did you know that out of 962 wikiHow readers, 71% said that they've never actually asked out their crush? [Take Poll] While asking out your crush can be nerve wracking, by having the courage to ask, you’ll find out if they like you back and feel proud for putting yourself out there!"
    },
    {
      "title": "Point out the problem.",
      "content": "Point out the problem. You'll need to deal with the jealousy issue regardless of how your crush responds to your feelings, but the exact method will vary on his reply. If your crush is interested in dating you, let him know in a casual, joking manner that he needs to save his flirting for you. Try to avoid making him feel guilty, but make it clear that you don't want him flirting with other girls. If your crush is lukewarm or rejects the idea of dating you, politely ask him to tone down the flirting he does with you. Dealing with regular flirtation from a guy who won't commit will only play with your emotions; it isn't healthy for either of you to continue like that."
    },
    {
      "title": "Say your farewells if things don't work out.",
      "content": "Say your farewells if things don't work out. If your crush doesn't change his ways after you tell him your feelings and point out the problem, you're better off cutting ties. Starting a relationship with a guy who can't stop flirting will likely lead to continued frustration and insecurity, which will damage the relationship in the long run. Continuing a friendship with a one-sided crush is always difficult, but if he's continuing to lead you on when he should know better, the best thing you can do for yourself is move on."
    },
    {
      "title": "Discuss your feelings.",
      "content": "Discuss your feelings. Sit down with your boyfriend and let him know how his recent actions are making you feel. Try to set boundaries about behaviors that are and aren't acceptable. [3] X Research source It's possible that your boyfriend isn't actually trying to make you jealous, and simply isn't aware of the fact that his interactions with another girl are causing you to feel jealous. Letting him know can help limit the behavior in the future. Even if he meant to make you jealous, it's possible that he has his own insecurities with the relationship. Opening the topic up to discussion can give you both the chance to talk things over while also giving him the chance to reassure you about his feelings. [4] X Research source"
    },
    {
      "title": "Stay calm.",
      "content": "Stay calm. Before, during, and after your discussion, you need to remain calm. Don't explode when your boyfriend says or does something that makes you feel jealous. Talk about your feelings using \"I\" statements (i.e. \"I feel...\") instead of placing blame (i.e. \"You make me feel...\"). If the misunderstanding is genuine, staying calm with help you work things out more completely and with as little conflict as possible. If your boyfriend is intentionally trying to push your buttons, however, exploding at him will only give him the reaction he wants. Instead of responding the way he expects, keep your cool and be the mature one when you talk things out. If his behavior continues even after you bring the issue to his attention, he might have some toxic control issues, and it might be in your best interest to break things off."
    },
    {
      "title": "Offer some reassurance.",
      "content": "Offer some reassurance. Oftentimes, a guy may try to make you jealous because he feels insecure about your feelings for him. His insecurity doesn't make the behavior acceptable, but it does make it quite normal. His attempts at making you jealous might be his way of trying to capture your attention. By \"reminding\" you that he's a catch, he's trying to win more of your affection. Try to reconnect with your boyfriend to give him the reassurance he needs. Compliment him. Be appreciative when he does good things for you. Cuddle, kiss, and be intentional about giving him signs of physical affection as you feel comfortable with. [5] X Research source"
    },
    {
      "title": "Manage your own insecurities.",
      "content": "Manage your own insecurities. In addition to dealing with your boyfriend's insecurities, you also have to manage your own. Being more confident about your self-worth will usually make it easier to stop obsessing over feelings of jealousy, [6] X Research source ultimately leaving you with more energy to strengthen your relationship. Show compassion to yourself. Admit it when you fall victim to jealous, and assure yourself that it's a natural feeling you don't need to be ashamed of. Only by accepting the feeling at face value can you learn to overcome it. Take time to focus on your own interests independent of the relationship. Developing yourself as an individual can make it easier to see what you bring to the relationship, which can make it easier to accept that your boyfriend loves you. [7] X Research source"
    },
    {
      "title": "Ignore him.",
      "content": "Ignore him. [8] X Research source If your ex-boyfriend is intentionally trying to throw his new relationship in your face, giving him a jealous response will mean giving him exactly what he wants. Don't respond when he talks to you via email, texting, or social media. If he tries making you jealous in person, reply in as neutral a manner as possible before ending the conversation and walking away. In addition to not replying to him directly, you also need to resist the temptation to post that vague, passive-aggressive status update on Facebook or Twitter, and avoid complaining to mutual friends who might let him know. Stay persistent. It's possible that he may put more effort into making you jealous initially, but if you're consistent, he should eventually get the message that it won't work."
    },
    {
      "title": "Limit his opportunities.",
      "content": "Limit his opportunities. If he's especially stubborn and the behavior is really getting to you, respond by cutting him off. Unfriend, unfollow, and block him via social media. If things get really bad, block his phone number from your phone and mark his email address as spam. He might temporarily feel pleased upon realizing that he succeeded in making you upset, but now that he's unable to continue the behavior, he'll have no choice but to stop it."
    },
    {
      "title": "Avoid rebounds.",
      "content": "Avoid rebounds. You might feel tempted to fight fire with fire--or, in this case, fight jealousy with jealousy--but this usually isn't a good idea. Getting into a new relationship just to make your ex jealous won't be fair to you or the new guy you start dating. Furthermore, flaunting around a new boyfriend you genuinely like can damage the new relationship, too. Using your boyfriend to get back at your ex keeps your focus on the old relationship--and adding fuel to the fires of jealousy will mean keeping the war between you and your ex alive indefinitely. You'll be much better off cutting ties with your ex and focusing on your attentions solely on your new sweetheart."
    },
    {
      "title": "Resist the temptation to get back together.",
      "content": "Resist the temptation to get back together. Even if the opportunity to get back together with your ex comes up, and even if you're tempted to take it, don't. An ex who goes out of his way to make you jealous is clearly capable of hurting you. This is not the sort of guy who's worthy of your love and affection."
    }
  ]
}