{
  "url": "https://www.wikihow.com/Play-Teacher",
  "title": "How to Play Teacher",
  "steps": [
    {
      "title": "Find a good spot for your classroom.",
      "content": "Find a good spot for your classroom. Find a spot that you can set out enough chairs for your students. If you're playing at home, your bedroom might be too small. Instead, ask your parents if you can move around some furniture to set up your main classroom. Use folding chairs, if you have them, and set them up in rows. For desks, you can use little stools. You can also just use chairs. Pick the front of the classroom and put a big piece of paper on the wall, like the a chalk board. Use markers to write on the paper instead of chalk."
    },
    {
      "title": "Pick other school rooms, if you want to.",
      "content": "Pick other school rooms, if you want to. If you're playing at home, try to plan out your whole school. Make each room in the house a different room in the school. Good school rooms to have for your play include: Bathroom Principal's office Detention room and you might want to add an office Playground Lunchroom or cafeteria"
    },
    {
      "title": "Gather the supplies a classroom would normally always use.",
      "content": "Gather the supplies a classroom would normally always use. To really play school, you'll need at least a couple of things. Ask your \"students\" to bring their own supplies, or try to find enough around your house. Try to find: Pencils, pens, or crayons Notebooks or paper Books Binders Erasers"
    },
    {
      "title": "Pick your grade-level that you want to teach.",
      "content": "Pick your grade-level that you want to teach. Do you want to teach the grade you're in? Your favorite grade you already went through? Or maybe you want to jump all the way up and teach a high school class? Could be fun. Pick the grade the sound the most fun and then change your lesson so it matches. Also, pick a subject! Do you want to teach math? Science? English? Pick a specific subject that will be fun and plan a lesson."
    },
    {
      "title": "Bring in the students.",
      "content": "Bring in the students. You need to have some people to teach! Invite some friends over, or ask your siblings or other family members if they'd like to play with you. Can't find anyone to play? Line up stuffed animals or other toys, so you'll have a classroom ready to go. Put each student in a separate chair in the classroom. You can assign seats, or let students choose their own. You could even put name tags on each desk, or have the students make them. Take your place at the front of the classroom and tell everyone to quiet down, because school is about to start."
    },
    {
      "title": "Teach a short lesson.",
      "content": "Teach a short lesson. Now that you've got your group of students gathered, start teaching! Write things on the paper that you've got on the wall to help you show the students what they're supposed to learn. You could even do a fun activity, like having the students \"dissect\" different stuffed animals and talk about what they find, if you want to have a science class. This could be a fun way to spend school time."
    },
    {
      "title": "Have the students take notes.",
      "content": "Have the students take notes. Give each one of your students pieces of paper, or notebooks, so they can write things down and do little assignments, or take notes. Tell them specifically what they should do. You could also have them read out what they've written. If you're teaching English class, you could say, \"Write about what you did this weekend in a timed writing!\" and then have everyone read it out."
    },
    {
      "title": "Ask the students questions.",
      "content": "Ask the students questions. When you're the teacher, you've got a good chance to put everyone else on the spot. Throw out math questions and call on people randomly, or call on people with really silly or difficult questions. \"Mr. Anderson, please come to the front of the class and explain how dinosaurs kiss to us. We're waiting!\" Turn the questions into a game. Ask all your students, \"What's 132 minus 17?\" and let them figure it out fast. Whoever gets the answer right quickest gets a candy. Some teachers like to play bingo to get students involved. That could be a good way to play, as well."
    },
    {
      "title": "Have students come to the board.",
      "content": "Have students come to the board. It's scary in real school, but at your pretend school it can be a lot of fun. Have each student come up to the board to answer a question, or to write in their answer to a question that you've asked. Ask a math problem, or give them a silly prompt to draw something. Tell all the students that whoever can draw the best brontosaurus gets a gummy worm."
    },
    {
      "title": "Go to lunch.",
      "content": "Go to lunch. After a little school, have all your students line up and walk to the \"lunch room.\" If you can get your parents to be in charge of the cafeteria, that would be perfect. Have sandwiches and milk, or whatever you normally eat at lunch, ready to eat like you do at school. Then sit all together and have your lunch like normal."
    },
    {
      "title": "Go to recess.",
      "content": "Go to recess. After lunch, have everyone go outside and play recess like you do at school, or see if your parents will take you to a park, to play on the playground stuff there."
    },
    {
      "title": "Take turns.",
      "content": "Take turns. It's fun being in charge, but you shouldn't get to be in charge all the time. Make sure that each time you play you take plenty of different turns, switching back and forth between being teacher and student. Even if you're really good at it. Have lots of different roles at your school that you can switch between. Have one person be a student, one person be a teacher, and one person be a principal, or detention person. Take turns between all of them."
    },
    {
      "title": "Make up a new name for yourself as \"the teachers name.\"",
      "content": "Make up a new name for yourself as \"the teachers name.\" Pick a regular type of name, like Mr. Smithson or Mrs. Black, or pick a totally silly teacher name like Miss Serious or Mr. Stinkypits. Pick whatever name you like, or make one up on your own. Insist that all the students call you by the right name."
    },
    {
      "title": "Dress like a teacher.",
      "content": "Dress like a teacher. Teachers definitely have a style. Dress up in some of your nicer clothes, and wear glasses if you can to pretend to be the teacher. Pull up your pants too high and comb your hair really well. Walk like an old person. If your mom has a funny old dress that she wouldn't mind you playing with, that could be perfect for a teacher costume. Ask if you can get one at a second-hand store, if you don't have one, for a costume. Male teachers should wear ties and glasses. Suspenders if possible."
    },
    {
      "title": "Talk like a teacher.",
      "content": "Talk like a teacher. Lower your voice and talk very seriously when you're pretending to be the teacher. Don't laugh at anything and call everyone \"Mr. Josh\" or \"Miss Angela.\" Be very stern, like a teacher would be. If you all have the same teacher, you could always just do an impression of the things that your teacher says. Try to learn some big words to use when you're playing teacher, since teachers are always trying to teach. \"Well isn't that odiferous?\" you could say, when something stinks."
    },
    {
      "title": "Be organized.",
      "content": "Be organized. Keep a bunch of \"school stuff\" really organized on a desk at the front of your classroom, with everything labeled with post-it notes, if you have them. Write up a little name tag for yourself, or have little baskets to put all your school supplies in. Or, you could always have your desk really messy, if your teacher has a really messy one. That could be a funny way to make school fun."
    },
    {
      "title": "Don't be too strict.",
      "content": "Don't be too strict. It's supposed to be fun! Try to keep your students quiet and settled, but they'll probably mostly want to mess you up and say silly things, since this isn't real school. That's ok. Make a fun game out of sending students to detention or giving them silly punishments, but don't take it too seriously. Most of your friends will probably want to goof off in your classroom. That's fine. It's all in good fun. Assign one person to be the detention monitor, and have fun!"
    }
  ]
}