{
  "url": "https://www.wikihow.com/Preserve-Roses-in-Resin",
  "title": "Drying & Preserving Roses in Resin: A Step-by-Step Guide",
  "steps": [
    {
      "title": "Choose roses at the peak of their bloom for the most vibrant color.",
      "content": "Choose roses at the peak of their bloom for the most vibrant color. Avoid picking roses that haven’t opened up yet or that are already starting to brown or droop, as these won’t look as nice when preserved. Either buy roses from a store or cut them from a rose bush. [1] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source If you’re cutting your own from a rose bush, wear garden gloves to protect your skin from the thorns."
    },
    {
      "title": "Trim away the majority of the leaves from the roses’ stems.",
      "content": "Trim away the majority of the leaves from the roses’ stems. Either pull the leaves off by hand or use a pair of scissors to cut them off where they intersect with the stem. If you’re worried about getting pricked by thorns, shave them off first. [2] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source If you want, leave a few leaves in place and incorporate them into your design. They can add a nice pop of color against the rose. Depending on which drying method you use, now may also be the time to trim or remove the stem altogether, like if you’re using a desiccant to dry them. If you’re hanging them to dry, keep the stems for now."
    },
    {
      "title": "Place the roses in a container of silica gel to dry them for 2 to 7 days.",
      "content": "Place the roses in a container of silica gel to dry them for 2 to 7 days. Select a container with an airtight lid that will fit the entire rose without squishing it. Pour a thin layer of silica gel , or another desiccant, into the container, then add the rose. Scoop more gel around the outside of the rose, then fill in the middle, aiming to get as much gel between the petals as possible. Continue adding silica gel until the rose is completely submerged, then cover tightly with the lid. [3] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source A desiccant is any substance that can be used as a drying agent, and they’re found at most gardening stores. In general, it takes a few days to a week to dry flowers with this method. Check on your rose periodically, and make sure it is completely dry before removing. It should feel similar to tissue paper when it’s ready. When it’s time to remove your rose, gently empty the container into a larger dish and shake the silica gel off the rose, or use a makeup brush or paint brush to dust off the excess. To speed up the process, add the roses and desiccant to a microwave safe container, and microwave it along with a mug full of water for 2 minutes. Poke through the desiccant with a toothpick to check the roses, and continue microwaving them in 1-minute intervals until they’re fully dry. Carefully remove the container and let it sit for 24 hours before removing the roses. [4] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source"
    },
    {
      "title": "Alternatively, hang the roses upside down to dry.",
      "content": "Alternatively, hang the roses upside down to dry. Wrap a 6 to 8 inches (15 to 20 cm) piece of twine around the stems 3-4 times, then tie a bow as tight as possible so the bundle of roses won’t come apart. On a hook or nail, hang the roses upside down in a dry, air place away from sunlight for 1-2 weeks. Check on them every 5-10 days to see if they’re dry to the touch. They should feel crispy and the petals should no longer be soft or pliable. [5] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source If you don’t have twine, a rubber band will work just as well. Just wrap it around several times until it’s tight against the stems. The color may fade if the roses are exposed to sunlight, so choose an area like a closet or a cupboard where there isn’t a lot of moisture. Excessive moisture may prevent the roses from drying properly and could even cause them to grow mold. Once the roses are fully dried, cut away the stem. It would likely be too long to fit in the mold properly and just get in the way. If you want to use any of the leaves, cut them off and set them to the side along with the rosebuds."
    },
    {
      "title": "Use a convection oven to dry roses in 3-4 hours.",
      "content": "Use a convection oven to dry roses in 3-4 hours. Lay the roses out on a clean baking sheet and preheat the oven to 100 °F (38 °C). Place the baking sheet on the lowest rack and leave the roses in the oven for 2-3 hours. Check them after that time and add an additional hour if they aren’t dry yet. [6] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source A normal oven may not be able to go as low as 100 °F (38 °C) and often has more moisture than a convection oven. You can still try this method with a normal oven, but be aware that you may not get the same results."
    },
    {
      "title": "Use clear polyester casting resin for the cheapest option.",
      "content": "Use clear polyester casting resin for the cheapest option. Polyester casting resin dries clear, so you’ll be able to see the rose inside really well. It also dries a little slower than epoxy resin, which means you have a little more time to arrange the rose and perfect your craft. This resin is available at most craft stores or online. [7] X Research source"
    },
    {
      "title": "Choose an epoxy resin if you want an amber cast to the finish.",
      "content": "Choose an epoxy resin if you want an amber cast to the finish. Epoxy resin is typically faster-drying and longer-lasting than polyester resin, though both options should create keepsakes that will last for years. If you like the idea of a lightly tinted finish, epoxy resin is the way to go. [8] X Research source It’s possible to buy clear epoxy resins, but the cost is much higher than what you would pay for a clear polyester resin."
    },
    {
      "title": "Wear gloves and work in a well-ventilated area.",
      "content": "Wear gloves and work in a well-ventilated area. Resin has a strong odor, so it’s best to work outside if possible. If you have to work inside, open as many windows as you can and use a fan to circulate the air. Consider wearing a face mask as well if you’re sensitive to strong smells. Resin can be difficult to get off skin, so wear rubber gloves to protect your hands. [9] X Research source If you do need to remove resin from your skin , mix 1/2 tablespoon (4.5 grams) of poppy seeds with 1 tablespoon (15 mL) of dish soap. Rub the mixture into your hands for 60 seconds without adding water. Then add water, wash your hands, and scrub away any remaining resin. The poppy seeds act as an exfoliant to rough up the resin and get it to detach from your skin. If you don’t have poppy seeds, coffee grounds would also work."
    },
    {
      "title": "Pour enough resin into a disposable measuring cup to fill your mold.",
      "content": "Pour enough resin into a disposable measuring cup to fill your mold. If your mold doesn’t state how much resin it can hold, simply pour water into it and then pour that water into your measuring cup to see how much liquid there is. Pour the water out and add the same amount of resin to the measuring cup. [10] X Research source Buy resin molds at most craft stores or online. Plastic molds work just fine, but craft expert Shelley Williams recommends silicone, or latex-rubber, molds because they’re more flexible and easier to remove once the resin is set. Because resin is so hard to clean off, disposable measuring cups guarantee that you won’t accidentally ruin your normal measuring cups. Buy them online, at craft stores, or at most local grocery stores. Look for ones that include measurements on the side so it’s easy to pour the right amount of resin."
    },
    {
      "title": "Add the catalyst to the resin and stir.",
      "content": "Add the catalyst to the resin and stir. Follow the instructions on your resin container to add the correct amount of catalyst liquid . In general, the catalyst makes up 1-2% of the total volume of the resin, so if your mold holds 4 ounces (110 g), you would need to add about 16 drops. Once you’ve added the catalyst, stir the mixture with a wooden skewer for at least 60 seconds. Make sure it is mixed well so that the catalyst gets activated. The resin container should have a chart on the back that explains how much catalyst to use. The catalyst heats the resin and helps it harden, or cure. Without it, your mold would never harden into a beautiful keepsake. If you don’t have a wooden skewer, use something else that is also disposable, like a plastic spoon or popsicle stick."
    },
    {
      "title": "Pour the stirred resin into the mold.",
      "content": "Pour the stirred resin into the mold. After combining the catalyst and resin, carefully pour the mixture into the mold you’ve chosen for your roses. Be careful not to drip the resin onto your work surface or get it onto the edges of the mold itself. [11] X Research source If you’re worried about spills, lay some old newspaper underneath your work station. Williams says to wipe up spilled resin as quickly as possible: “If it wasn’t already hardened, alcohol could work since it’s kind of sticky,” but if you spill after the catalyst has been added, “you just want to wipe it really well with a paper towel.”"
    },
    {
      "title": "Place the rose into the resin in the design that you want.",
      "content": "Place the rose into the resin in the design that you want. Depending on the type of mold you chose, be aware of which side will be the top. For example, if you’re using a domed mold, insert the rose into the resin facedown so that it’ll be visible once it’s right-side up. Use the wooden skewer to push the rose into place. [12] X Research source The rose will likely rise to the top of the resin, which is okay. Right now, focus on getting it into a general placement. You’ll push it deeper a bit later on. This is also the time to add the dried leaves if you saved any, or other dried flowers. Alternatively, secure your rose into position before pouring the resin. Pierce the center of the rose with a toothpick. Tape two popsicle sticks together and slide the toothpick between them. Position the popsicle sticks so the rose is suspended in the center of the mold. This will hold it in place as you pour the resin."
    },
    {
      "title": "Let the resin set to a gel-like consistency for about 10 minutes.",
      "content": "Let the resin set to a gel-like consistency for about 10 minutes. If after 10 minutes the resin is still very liquidy, set a timer for an additional 10 minutes. The resin should be pliable so you can push the rose in further without it popping back up, but not so hard that you can’t make any adjustments. [13] X Research source If you’re working indoors or in a humid climate, it may take closer to 30 minutes for the resin to get to the right consistency."
    },
    {
      "title": "Finalize the positioning once the resin is the right consistency.",
      "content": "Finalize the positioning once the resin is the right consistency. Use your wooden skewer to push the rose deeper into the resin. If it floated off to the side, push it back into place. Use this time to arrange any other flowers or leaves that are in the mold. [14] X Research source It’s very hard to make roses look bad. Even if things are a bit off-center, the end result will still look beautiful."
    },
    {
      "title": "Let the resin harden completely, then remove the mold.",
      "content": "Let the resin harden completely, then remove the mold. Consult the back of the resin container to see how long they recommend for the curing process. It usually takes several hours, but if your mold is very large or deep, it could take longer. Once it’s completely hardened, loosen or peel away the mold to reveal your creation. Use your preserved rose as a decorative accent around your home, as a paperweight, or give it away as a gift! [15] X Research source If the resin is still sticky to the touch, it’s not done. When it’s fully dry, it should be smooth and hard. The molds should come away clean, which means you can reuse them for other resin projects!"
    }
  ]
}