{
  "url": "https://www.wikihow.com/Play-Pinball",
  "title": "How to Play Pinball",
  "steps": [
    {
      "title": "Read the instructions on the front panel.",
      "content": "Read the instructions on the front panel. Every pinball machine has a different way to rack up points. Find the instructions cars near in the front left of the machine and read over how to get bonuses and accumulate points while you play. [1] X Research source Compare any symbols on the instruction card to the symbols inside the machine. Make sure you understand what each instruction is referencing."
    },
    {
      "title": "Study the layout of the machine.",
      "content": "Study the layout of the machine. Pinball machines have a busy interior that may seem overwhelming at first, but many machines have similar structures. Pay attention to where the components are that will earn you points and will move the ball."
    },
    {
      "title": "Pull the plunger to release the ball.",
      "content": "Pull the plunger to release the ball. The plunger is the handle at the front of the machine that you pull and release to shoot the ball into the machine. Use it whenever you start your pinball game or when you lose the ball."
    },
    {
      "title": "Use the flippers to hit and shoot the ball.",
      "content": "Use the flippers to hit and shoot the ball. The flippers are the paddles at the bottom of the machine that you use to hit the ball. The buttons for the flippers are typically found on the left and right sides of the machine. Check to see if you only have 2 flippers, or if there are additional flippers near the top of the machine."
    },
    {
      "title": "Use the bumpers to get points and bounce the ball.",
      "content": "Use the bumpers to get points and bounce the ball. Bumpers are found throughout the entire machine and will bounce the ball away. Common places for bumpers are at the top of the machine and just above the bottom flippers."
    },
    {
      "title": "Watch the display on top to see what to aim for next.",
      "content": "Watch the display on top to see what to aim for next. The display will display goals and your current score. Check the display often when you have control of the ball so you know the next goal for your machine. [2] X Research source Some pinball machines will tell a story the longer you play them. Tune into the screen so you don’t miss anything. Make sure you have control of the ball when you check the screen. You don’t want to lose a ball because you looked away. Listen to sound cues as well. Many times a voice will tell you what you should shoot at next."
    },
    {
      "title": "Only use one flipper at a time.",
      "content": "Only use one flipper at a time. When you try to use both flippers, you’re more likely to miss the ball. Instead, look at the direction the ball is coming and only use the closest flipper. If the ball is on the left use the left flipper, and use the right flipper if the ball is falling down the right. [3] X Research source Use both flippers only if the ball is falling directly down the middle. Nudge the machine slightly to move the ball into safety. Anticipate the ball’s movements instead of reacting to it. Reacting to the ball will only make you have less control."
    },
    {
      "title": "Rest the ball on the flippers to slow the ball down.",
      "content": "Rest the ball on the flippers to slow the ball down. When the ball comes down, activate the nearest flipper and let the ball rest in the pocket made by the path and flipper. When you’re ready to shoot the ball, let the flipper fall so the ball rolls. [4] X Research source Activate the flippers slowly so you don’t accidentally hit the ball back up into the machine. If you’re able to slow down and think about your next move, you’ll be able to make your balls last longer and get a higher score."
    },
    {
      "title": "Learn where the ball goes with different parts of the flipper.",
      "content": "Learn where the ball goes with different parts of the flipper. After you’ve stopped the ball, try hitting it on different places with the flipper. For example, let the ball get closer to the end of the flipper before activating it to hit the opposite side of the machine. This is known as a forehand hit. [5] X Research source Each pinball machine will play differently, even if they’re the same game. Take the first ball of each game to learn the machine and how it shoots."
    },
    {
      "title": "Practice backhand shots by hitting the ball near the top of the flipper.",
      "content": "Practice backhand shots by hitting the ball near the top of the flipper. Rather than letting the ball roll down the flipper, hit it immediately to aim for a spot on the same side of the machine as the flipper. Practice hitting the ball a few times to see where the ball goes when you shoot it. [6] X Research source For example, if you’re using the right flipper, hitting the ball near the top of the flipper will make it go right."
    },
    {
      "title": "Nudge the machine to change the ball’s course.",
      "content": "Nudge the machine to change the ball’s course. If you notice the ball falling where you can’t capture it, such as straight down the middle or on either side, push the whole pinball machine to the side to change the ball’s direction. A light nudge every now and then will help you play longer and get a high score. [7] X Research source If you nudge the machine too hard or multiple times, the machine may freeze and you’ll lose your ball. This is known as a “tilt.”"
    },
    {
      "title": "Save the ball by quickly hitting each flipper.",
      "content": "Save the ball by quickly hitting each flipper. When the ball is falling near the middle of the machine, quickly alternate between the 2 flippers so the ball bounces between them. Many players will do this naturally, but practice doing this with more control. This technique is often referred to as the “slap save.”"
    },
    {
      "title": "Pass the ball from one flipper to the other.",
      "content": "Pass the ball from one flipper to the other. Catch the ball with either the right or left flipper. Lightly hit the flipper so the ball bounces over to the opposite side. Activate the opposite flipper to catch the ball on the other side. [8] X Research source If the ball is coming down the machine fast, let it bounce off the flippers without activating them to slow it down and gain more control."
    },
    {
      "title": "Stop the ball by hitting it as the flipper is at the top of its movement.",
      "content": "Stop the ball by hitting it as the flipper is at the top of its movement. Time your hit so the flipper stops moving just as the ball hits it. This will cause the ball to immediately slow down and get trapped so you have control again. This technique is known as the “flip catch.” This technique will take practice and timing. Don’t be discouraging if your ball bounces back up out of control the first few times you try it."
    }
  ]
}