{
  "url": "https://www.wikihow.com/Save-a-Web-Page-as-a-PDF-in-Google-Chrome",
  "title": "3 Simple Ways to Save a Web Page as a PDF in Google Chrome",
  "steps": [
    {
      "title": "Open the web page you want to save in Google Chrome.",
      "content": "Open the web page you want to save in Google Chrome. This browser has a built-in Save to PDF option you can use to save web pages. Google Chrome is available to download on Windows, Mac, and Linux. [1] X Research source Make sure Chrome is updated ."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . This is in the top-right corner of the window."
    },
    {
      "title": "Click Print.",
      "content": "Click Print . This will open the Print window. Alternatively, you can press CTRL + P (Windows) or CMD + P (Mac) to quickly open this window."
    },
    {
      "title": "Click the \"Destination\" drop-down menu.",
      "content": "Click the \"Destination\" drop-down menu. If you have any printers connected, you'll see them listed here."
    },
    {
      "title": "Click Save as PDF.",
      "content": "Click Save as PDF . You can find this in the drop-down menu. If you're using a Microsoft device, you may also see Microsoft Print to PDF . This option will also create a PDF."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . This is the blue button at the bottom of the window. A pop-up window will open."
    },
    {
      "title": "Select a save location and click Save.",
      "content": "Select a save location and click Save . For some devices, the default location may be set to the Downloads folder. The web page will be saved to your computer as a PDF file ."
    },
    {
      "title": "Open a webpage in the Google Chrome app.",
      "content": "Open a webpage in the Google Chrome app. This browser app allows you to save any webpage as a PDF file."
    },
    {
      "title": "Tap .",
      "content": "Tap . You can find this in the address bar on the right. A pop-up menu will open."
    },
    {
      "title": "Tap Print.",
      "content": "Tap Print . This will be below the list of apps."
    },
    {
      "title": "Tap at the top.",
      "content": "Tap at the top. You can find this on the right of Options ."
    },
    {
      "title": "Tap Save to Files.",
      "content": "Tap Save to Files . Alternatively, you can select an app on the list to share via Messages , Mail , or another app."
    },
    {
      "title": "Select a save location and tap Save.",
      "content": "Select a save location and tap Save . The PDF will be saved to the Files app. If you selected an app, select the location or recipient and send it."
    },
    {
      "title": "Open a webpage in the Google Chrome app.",
      "content": "Open a webpage in the Google Chrome app. This browser app allows you to save any webpage as a PDF file."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . You can find this in the top-right corner."
    },
    {
      "title": "Select Save as PDF.",
      "content": "Select Save as PDF . On some devices, you may need to tap the Share icon first."
    },
    {
      "title": "Select a save location and tap Save.",
      "content": "Select a save location and tap Save . The PDF will be saved to your Android. You can usually find PDF files in the Documents folder."
    }
  ]
}