{
  "url": "https://www.wikihow.com/Mayan-Zodiac",
  "title": "What Are the Mayan Zodiac Signs?",
  "steps": [
    {
      "title": "Crocodile",
      "content": "Crocodile The first day sign is aggressive yet protective of its loved ones. Crocodiles are energetic and creative and enjoy taking charge in any situation, although they sometimes behave selfishly. They have a natural power and influence that they must be careful to use for good. Crocodile signs do well with team-building projects and charity work that allow them to be creative and generous. [1] X Research source Yucatec/Quiche Maya Name: Imix/Imšx [2] X Research source Core Significance: Integrity Strengths: Innovative, enthusiastic, protective Weaknesses: Aggressive, selfish, domineering Direction Association: East Color/Gem Association: Red/ Red Jasper Gets along with: Wind Faces challenges with: Monkey Preferred occupations: Teacher, artist, psychologist, caregiver"
    },
    {
      "title": "Wind (or Hummingbird)",
      "content": "Wind (or Hummingbird) The second day sign is highly intellectual, flexible, and lively. [3] X Research source Wind signs are skilled at a variety of tasks, but prefer idealistic and romantic pursuits. However, they can be indecisive and insecure, so they struggle with commitment or feeling like their accomplishments are enough. [4] X Research source Yucatec/Quiche Maya Name: Ik’/Iq [5] X Research source Core Significance: Justice Strengths: Intelligent, energetic, multi-talented Weaknesses: Indecisive, insecure, overthinker Direction Association: North Color/Gem Association: White/ Sodalite Gets along with: House Faces challenges with: Grass Preferred occupations: Entrepreneur, politician, spiritualist, artist"
    },
    {
      "title": "House (or Bat or Night)",
      "content": "House (or Bat or Night) The third day sign values structure and tradition, and they struggle to let go of conventional beliefs. Due to their quiet and slightly stubborn nature, they may seem intimidating to others. But House signs are just deep thinkers who reflect often and seek out security, loyalty, and faithfulness. [6] X Research source Yucatec/Quiche Maya Name: Ak’bal/Aq’ab’al [7] X Research source Core Significance: Patience Strengths: Self-reflective, loyal, patient Weaknesses: Stubborn, traditional, withdrawn Direction Association: West Color/Gem Association: Blue/ Snowflake Obsidian Gets along with: Lizard Faces challenges with: Reed Preferred occupations: Doctor, soldier, mathematician, travel guide"
    },
    {
      "title": "Lizard (or Seed)",
      "content": "Lizard (or Seed) The fourth day sign is highly performance-driven and independent. Lizards are high-achievers who enjoy being the center of attention . They have high self-esteem and are seen by others as energetic and dynamic. [8] X Research source They are extremely passionate about what they do, which sometimes results in argumentative or self-centered behavior. Yucatec/Quiche Maya Name: K’an/K’at [9] X Research source Core Significance: Manifestation Strengths: Passionate, principled, dynamic Weaknesses: Aggressive, argumentative, self-centered Direction Association: South Color/Gem Association: Yellow/ Dumortierite Gets along with: Serpent Faces challenges with: Jaguar Preferred occupations: Artist, gardener, shop owner, curator"
    },
    {
      "title": "Serpent",
      "content": "Serpent The fifth day sign is powerful, charismatic, and emotional. Serpents are highly intelligent and easily tap into the feelings and needs of others. They effortlessly attract the attention and admiration of people around them. [10] X Research source However, their high threshold for empathy means their feelings sometimes get the best of them and they express it via angry outbursts or over-dramatic shows of emotion. Yucatec/Quiche Maya Name: Chikchan/Kaan [11] X Research source Core Significance: Resolution Strengths: Charismatic, empathetic, considerate Weaknesses: Temperamental, dramatic, assertive Direction Association: East Color/Gem Association: Red/Amethyst Gets along with: Death Faces challenges with: Eagle Preferred occupations: State official, lawyer, judge, nurse"
    },
    {
      "title": "Death (or Owl or Transformer)",
      "content": "Death (or Owl or Transformer) The sixth day sign represents a special connection to the spiritual world. [12] X Research source People born under the Death sign are generally practical and generous and put their energy toward helping their communities. [13] X Research source However, they quickly become burned out from frequently prioritizing others, so they may become resentful of close friends and family or sensitive that their energy isn’t being returned. Yucatec/Quiche Maya Name: Kimi/Kame [14] X Research source Core Significance: Understanding Strengths: Grounded, generous, selfless Weaknesses: Oversensitive, self-sacrificing, fragile Direction Association: North Color/Gem Association: White/Carnelian Gets along with: Death Faces challenges with: Eagle Preferred occupations: Counselor, doctor, philosopher, historian"
    },
    {
      "title": "Deer",
      "content": "Deer The seventh day sign is strong, protective, and innovative. While Deer signs value family and loved ones, they also need freedom to roam and explore. They tend to be deeply in touch with their sensuality and may be described by others as eccentric. [15] X Research source Deer signs aren’t bothered by other people’s opinions, but they do feel easily wounded by people who disappoint them or break their trust. Yucatec/Quiche Maya Name: Manik’/Kiej [16] X Research source Core Significance: Ascension Strengths: Protective, original, loving Weaknesses: Sensitive, evasive, guarded Direction Association: West Color/Gem Association: Blue/Amazonite Gets along with: Rabbit Faces challenges with: Earth Preferred occupations: Public servant, sociologist, scientist, spiritual coach"
    },
    {
      "title": "Rabbit (or Star)",
      "content": "Rabbit (or Star) The eighth day sign is the clever, active, and competitive Rabbit. These signs enjoy music, humor, and debating important topics with others. They infuse everything they do with playfulness and energy. [17] X Research source However, their competitive and playful reputation sometimes gets to their head if they don’t think they’re good enough, and they become nervous and insecure. Yucatec/Quiche Maya Name: Lamat/Q’aniel [18] X Research source Core Significance: Unity Strengths: Lively, energetic, intelligent Weaknesses: Competitive, self-centered, insecure Direction Association: South Color/Gem Association: Yellow/ Hematite Gets along with: Water Faces challenges with: Knife Preferred occupations: Counselor, agriculturalist, musician, spiritual leader."
    },
    {
      "title": "Water (or Offering)",
      "content": "Water (or Offering) The ninth day sign leads with kindness and sincerity. Water signs are deeply emotional and sometimes struggle under the weight of their powerful and overwhelming feelings. This struggle can lead them to become obsessive about certain situations and force their emotions onto others. However, these feelings can also be channeled into passion, imagination, and sometimes spiritual pursuits. [19] X Research source Yucatec/Quiche Maya Name: Muluk/Toj [20] X Research source Core Significance: Duality Strengths: Kind, passionate, sincere Weaknesses: Overly-emotional, domineering Direction Association: East Color/Gem Association: Red/ Lapis Lazuli Gets along with: Dog Faces challenges with: Storm Preferred occupations: Warrior, priest, farmer, midwife"
    },
    {
      "title": "Dog",
      "content": "Dog The tenth day sign represents curiosity, adventure, and trustworthiness. Just like their animal counterpart, people born under the Dog sign are loyal leaders and companions who enjoy contributing to a team. [21] X Research source Dogs sometimes struggle to develop emotional maturity and open up to others, but they are deeply loyal to the people they trust. Yucatec/Quiche Maya Name: Ok/Tzi [22] X Research source Core Significance: Patience Strengths: Curious, loyal, collaborative Weaknesses: Emotional immaturity, trust issues Direction Association: North Color/Gem Association: White/ Bloodstone Gets along with: Monkey Faces challenges with: Flower Preferred occupations: Teacher, doctor, academic researcher, judge"
    },
    {
      "title": "Monkey",
      "content": "Monkey The eleventh day sign is all about performance and entertainment. The Monkey sign enjoys being the center of attention and feeling connected to others. They are funny, chatty, and outwardly sociable, although they may struggle with close personal relationships. [23] X Research source Sometimes their close friends and families become frustrated by their constant need to impress others. Yucatec/Quiche Maya Name: Chuwen/B’aatz [24] X Research source Core Significance: Manifestation Strengths: Funny, talkative, sociable Weaknesses: Superficial, vain, scatterbrained. Direction Association: West Color/Gem Association: Blue/ Aventurine Gets along with: Monkey Faces challenges with: Flower Preferred occupations: Salesperson, singer/dancer, agriculturist, priest"
    },
    {
      "title": "Grass (or Road)",
      "content": "Grass (or Road) The twelfth day sign represents compromise and healing. People born under the Grass sign are easygoing and adaptable, and they work hard to both help others and achieve their own goals. Grass signs are also extremely sensitive and prone to hiding their hurt from others. [25] X Research source Yucatec/Quiche Maya Name: Eb/Eey’ [26] X Research source Core Significance: Resolution Strengths: Industrious, nurturing, flexible Weaknesses: Reserved, over-sensitive, closed-off Direction Association: South Color/Gem Association: Yellow/ Malachite Gets along with: Reed Faces challenges with: Wind Preferred occupations: Retailer, hunter, explorer, researcher"
    },
    {
      "title": "Reed (or Corn)",
      "content": "Reed (or Corn) The thirteenth day sign is powerful and forceful. Reed signs are knowledgeable, accomplished, and have strong opinions. While they are popular with others, they may be argumentative or struggle to accept perspectives that go against their own intellectual beliefs. [27] X Research source Overall, however, they want peace, harmony and ease in their relationships and surrounding environment. Yucatec/Quiche Maya Name: Ben/Aaj [28] X Research source Core Significance: Understanding Strengths: Wise, determined, problem-solver Weaknesses: Argumentative, close-minded, authoritative Direction Association: East Color/Gem Association: Red/ Turquoise Gets along with: Jaguar Faces challenges with: House Preferred occupations: Farmer, healer, investigator, administrator, poet"
    },
    {
      "title": "Jaguar (or Ocelot)",
      "content": "Jaguar (or Ocelot) The fourteenth day sign rules over healing, counseling, and psychic abilities. People born under Jaguar tend to keep things close to their chest, but they are great listeners that enjoy helping other people and hearing about their lives. [29] X Research source They are also deeply strategic, which sometimes appears as manipulative. But Jaguars are always well-intentioned and deeply value their interpersonal relationships. Yucatec/Quiche Maya Name: Ix/Ix-B’alam [30] X Research source Core Significance: Ascension Strengths: Empathetic, intuitive, loving Weaknesses: Secretive, guarded, competitive Direction Association: North Color/Gem Association: White/ Moonstone Gets along with: Eagle Faces challenges with: Lizard Preferred occupations: Warrior, animal trainer, philosopher, doctor"
    },
    {
      "title": "Eagle",
      "content": "Eagle The fifteenth day sign is independent, open-minded, and, as its animal symbol suggests, eagle-eyed. Eagle signs are perfectionists with expansive vision and great attention to detail. They are also extremely autonomous and enjoy seeking out new experiences and adventures far from home. [31] X Research source However, the eagle can be overly critical of both themselves and others. Yucatec/Quiche Maya Name: Men/Tz’ikin [32] X Research source Core Significance: Prosperity Strengths: Open-minded, independent, adventurous Weaknesses: Restless, guarded, stubborn Direction Association: West Color/Gem Association: Blue/ Unakite Gets along with: Vulture Faces challenges with: Serpent Preferred occupations: Poet, sculptor, painter, diplomat"
    },
    {
      "title": "Vulture (or Candle)",
      "content": "Vulture (or Candle) The sixteenth day sign represents authority and status. Vulture signs are serious and realistic people who see the benefits that come with power and status. They think it’s important to take lessons from every part of life, both good and bad. Although their realism may be perceived as cynicism or emotional unavailability, they are wise and humorous individuals at their core. [33] X Research source Yucatec/Quiche Maya Name: Kib/Ajmaq [34] X Research source Core Significance: Wisdom Strengths: Knowledgeable, reflective, realistic Weaknesses: Jaded, serious, low self-esteem Direction Association: South Color/Gem Association: Yellow/ Smokey Quartz Gets along with: Earth Faces challenges with: Death Preferred occupations: Politician, judge, doctor, administrator"
    },
    {
      "title": "Earth (or Earthquake)",
      "content": "Earth (or Earthquake) The seventeenth day sign is a forceful and progressive intellectual thinker. People born under the Earth sign like to shake things up, using their ideals to change societal structures and traditional ways of thinking. [35] X Research source Their brain is always bouncing around between their next great ideas, but they struggle to pause and focus on emotional needs. Yucatec/Quiche Maya Name: K’aban/N’oj [36] X Research source Core Significance: Action Strengths: Philosophical, innovative, community-oriented Weaknesses: Condescending, nervous, emotionally reserved Direction Association: East Color/Gem Association: Red/ Agate Gets along with: Knife Faces challenges with: Deer Preferred occupations: Artist, doctor, agriculturalist, judge"
    },
    {
      "title": "Knife (or Flint)",
      "content": "Knife (or Flint) The eighteenth day sign represents courage, strength, and logic. [37] X Research source Knife signs tend to be self-sacrificing and go out of their way to accommodate others, which means they often repress their own feelings. [38] X Research source However, they love to have deep conversations and apply practical logic to both their work and their relationships. Yucatec/Quiche Maya Name: Etz’nab/Tijax [39] X Research source Core Significance: Stability Strengths: Logical, courageous, thoughtful Weaknesses: Self-sacrificing, emotionally guarded, workaholic Direction Association: North Color/Gem Association: White/Rhodonite Gets along with: Storm Faces challenges with: Rabbit Preferred occupations: Healer/doctor, politician, strategist, athlete"
    },
    {
      "title": "Storm (or Rain)",
      "content": "Storm (or Rain) The nineteenth day sign is all about the mind. Storm signs live up in their head, making for compassionate, mentally active, and friendly personalities. They are usually skilled in a variety of disciplines, although they’re drawn to roles where they can heal and connect with others. [40] X Research source However, their focus on neatness and order can become restrictive, and they could benefit from being more laidback from time to time. Yucatec/Quiche Maya Name: K’awak/Kawoq [41] X Research source Core Significance: Empowerment Strengths: Friendly, generous, spiritual Weaknesses: Strict, impractical, sensitive Direction Association: West Color/Gem Association: Blue/ Jade Gets along with: Flower Faces challenges with: Water Preferred occupations: Midwife, weather forecaster, fisherman, weaver"
    },
    {
      "title": "Flower (or Sun)",
      "content": "Flower (or Sun) The twentieth day sign is the final one in the cycle. Flower signs symbolize beauty and perfection. Individuals born under this sign may be a bit socially awkward, but that’s only because they spend so much time dreaming about their lofty ideals. They are true romantics who will give themselves entirely to their friends and romantic partners. [42] X Research source Yucatec/Quiche Maya Name: Ahaw/Jun Ajpub [43] X Research source Core Significance: Flow Strengths: Loving, creative, imaginative Weaknesses: Impractical, delicate, restless Direction Association: South Color/Gem Association: Yellow/ Rose Quartz Gets along with: Crocodile Faces challenges with: Dog Preferred occupations: Musician, athlete, politician, leader"
    },
    {
      "title": "Mayan astrology is based on 20-day cycles.",
      "content": "Mayan astrology is based on 20-day cycles. In the Maya sacred calendar known as the Tzolk’in , the calendar is divided into thirteen periods of 20 days. [44] X Research source Each of these days is associated with a glyph or visual image, often an animal. [45] X Research source These visual symbols are the origin of each Mayan Zodiac symbol. The most important sign in Mayan astrology is the day sign, which reveals a person’s dominant personality traits, strengths, weaknesses, and destiny. [46] X Research source Someone’s day sign is determined by which date in the 20-day calendar cycle they were born and which symbol rules over that day. This is distinct from the more well-known Western Zodiac, where the position of the Sun at the time of birth (or what constellation it was in) determines someone’s sign ."
    },
    {
      "title": "Determine someone’s Mayan sign with an online calculator.",
      "content": "Determine someone’s Mayan sign with an online calculator. Find a trustworthy site with a Mayan Zodiac calculator and enter a birthdate. This Mayan Wisdom Project’s calculator will give the name of the heart sign (day sign) in Quiche Maya. The description gives more information about this sign’s associated symbol. [47] X Research source Day signs are mathematically complicated to calculate, as they follow the 20-day cycles within the Mayan calendar. Three people born three days in a row will all have different signs. Two people born 20 days apart, however, will have the same sign. For example, someone born on January 7th, 2004 will have a Water sign. But someone born on January 8th of the same year will be a Dog because it’s the next sign in the 20-day cycle. [48] X Research source However, someone born on January 27th, 2004—twenty days or a full cycle later—will also be born under the Water sign."
    },
    {
      "title": "Trecena (or trecana) signs are a secondary sign in Mayan astrology.",
      "content": "Trecena (or trecana) signs are a secondary sign in Mayan astrology. While they use the same symbols as day signs, trecena signs represent a person’s underlying traits (like a Moon sign in modern astrology). The trecena is determined by a 13-day cycle that runs throughout the Mayan calendar, separate from the 20-day cycle that determines the day sign. [49] X Research source The sign that ruled on someone’s birthday during the trecena cycle is their trecena sign. Finding someone’s trecena sign requires an in-depth assessment from an expert service or individual who provides full Mayan Zodiac readings. [50] X Research source"
    },
    {
      "title": "Galactic tones provide more information about someone’s life path.",
      "content": "Galactic tones provide more information about someone’s life path. Each tone is represented by a number, ranging from 1-13. The symbolism of each number reveals how a person will embody their dominant sign and channel it toward their destiny. [51] X Research source Use this calculator to see the galactic tone number of any birthdate, given alongside the day/heart sign. One: Unity, new beginnings, and innovation. Two: Intuition, community outreach, and duality. Three: Socialization, admiration, and artistic pursuits. Four: Stability, routine, and support. Five: Curiosity, investigation, and knowledge. Six: Balance, leadership, and family. Seven: Reflection, autonomy, and spirituality. Eight: Justice, authority, and financial success. Nine: Patience, leadership, and generosity. Ten: Manifestation, innovation, and creation. Eleven: Transformation, collaboration, and imagination. Twelve: Communication, understanding, and charisma. Thirteen: Order, ascension, and psychic power."
    }
  ]
}