{
  "url": "https://www.wikihow.com/Remove-an-Ingrown-Hair",
  "title": "Ingrown Hair Won’t Go Away? Easy At-Home Solutions & Prevention Tips",
  "steps": [
    {
      "title": "Exfoliate the area",
      "content": "Exfoliate the area to remove the skin covering the ingrown hair. Twice a day, scrub the ingrown hair gently using an over-the-counter exfoliator or an exfoliating glove. This will help to remove any dead skin cells, dirt, and oils that might be trapping the ingrown hair. It may also physically nudge the tip of the hair out of your skin. [1] X Research source Try to scrub the ingrown hair from a variety of directions to loosen as much of the surrounding skin as possible. You can purchase an exfoliating scrub or a loofah glove at your local supermarket or drug store."
    },
    {
      "title": "Do not damage the surrounding skin through exfoliation.",
      "content": "Do not damage the surrounding skin through exfoliation. You'll need to exfoliate enough to loosen the skin covering the ingrown hair but shouldn't exfoliate so much that it damages your skin. If the area surrounding the ingrown hair becomes painful, looks raw, or starts to bleed, stop exfoliating immediately. When in doubt, exfoliate more gently but for a longer period. Say, 10 minutes."
    },
    {
      "title": "Apply a warm, moist washcloth to the area for a few minutes.",
      "content": "Apply a warm, moist washcloth to the area for a few minutes. Wet a washcloth with hot water, wring it out, and press it against the ingrown hair for 5 minutes. [2] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source When the washcloth cools down, run it under hot water again. This will soften the skin and bring the ingrown hair to the surface, making it easier to pluck out. [3] X Research source If you can see the ingrown hair embedded in the skin, this treatment will soften the hair and bring it closer to the surface. If you can't initially see the hair, leave the washcloth on until it rises to the skin's surface."
    },
    {
      "title": "Tease the hair out of the skin using a sterile needle and tweezers.",
      "content": "Tease the hair out of the skin using a sterile needle and tweezers. It may take a little time to coax the hair out, so persevere and do not cut the skin. Once you've exposed the tip of the hair with the needle, use a pair of sharp-tipped tweezers to pull the end of the hair out of the skin. Don't pluck the hair out completely if you can avoid doing so; just make sure that the ingrown end is out of the skin. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Be sure to sterilize the needle before you get started. Sometimes you'll see a “loop” in the ingrown hair: the top of the hair where, instead of growing out through the skin, it curves over and grows down or sideways. This means that the tip of the hair has begun growing down into the skin. Try to pass the tip of a needle through the curve at the top of the ingrown hair and tug lightly. The end will often come loose. If you don't see the loop of the ingrown hair after exfoliating your skin and applying the warm washcloth, don't dig for the hair. You could damage your skin or draw blood. You can sterilize your tools by boiling them in water or by cleaning them with rubbing alcohol or running them through a hot flame until they turn bright red. If you heat them, let them completely cool before using them. Wash your hands before working on an ingrown hair and consider wearing nitrile gloves to prevent the spread of any bacteria."
    },
    {
      "title": "Give the ingrown hair a week to clear up.",
      "content": "Give the ingrown hair a week to clear up. In most cases, ingrown hairs will disappear without any intervention on your part. Typically, the ingrown hair will find a way to grow out through the skin that’s been blocking it. While waiting for the ingrown hair to clear up, do not pick or scratch at the ingrown hair. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source While you’re waiting for the ingrown hair to disappear, avoid shaving over the bump. If you nick the area, you’ll risk infecting or worsening the ingrown hair. Sometimes ingrown hairs can go away on their own, but sometimes they won't. Watch the ingrown hair to see if it gets better or worse. [6] X Expert Source Marsha Durkin, RN Registered Nurse Expert Interview. 29 May 2019."
    },
    {
      "title": "Apply a dab of acne medication to the ingrown hair.",
      "content": "Apply a dab of acne medication to the ingrown hair. Ingrown hairs are pretty similar to pimples, especially when the ingrown hair is accompanied by pus. Apply benzoyl peroxide or salicylic acid several times a day for a few days. [7] X Research source This, combined with daily exfoliation, is often enough to remove the ingrown hair since swelling will be reduced, giving the hair more room to grow out (rather than in). You can purchase acne cream at any drugstore or pharmacy."
    },
    {
      "title": "Apply a steroid cream to an infected ingrown hair.",
      "content": "Apply a steroid cream to an infected ingrown hair. If your ingrown hair starts to fill with white or yellow pus, it’s infected. In this situation, before you remove the hair, you must treat the infection . Do this by rubbing a small dollop of steroid cream on the top of the infected skin. The cream will reduce swelling and help clear up the infection. [8] X Research source Some steroid creams—like cortisone—are available over the counter. For a stronger steroid, visit your doctor, and ask for a prescription to a steroid cream."
    },
    {
      "title": "Wash often-shaved areas with warm water and moisturizing soap.",
      "content": "Wash often-shaved areas with warm water and moisturizing soap. Hairs are most likely to become ingrown in areas of your body that you shave often. So, keep these areas clean by washing them often. If you get ingrown hairs frequently, you can also apply an antiseptic to provide extra protection against infection. [9] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source You may also wish to apply a daily topical solution to prevent any further ingrown hairs from developing."
    },
    {
      "title": "Grab a sharp, clean razor whenever you’re about to shave.",
      "content": "Grab a sharp, clean razor whenever you’re about to shave. Dull blades are a recipe for ingrown hairs—if you use disposable razors, always grab a new one when you’re about to shave. As you go, take time to rinse the hair out of the razor between each shaving stroke so the blade doesn’t get clogged. [10] X Research source"
    },
    {
      "title": "Rinse the area you’ll shave with warm water before shaving.",
      "content": "Rinse the area you’ll shave with warm water before shaving . According to board-certified dermatologist Mohiba Tareen, \"If you shave when your skin is dry, you’ll put yourself at a higher risk for getting ingrown hairs and skin irritation.\" So, rinse with warm water 2 or 3 minutes before shaving. You can also wash with a mild facial cleanser before you shave. When you apply your shaving cream, let it sit for another 2 or 3 minutes to soften the skin before you begin shaving. [11] X Research source Tareen also suggests \"massaging the area in a circular motion before you shave—this helps bring the hair out of the follicle, so it will be less likely to curve back on itself, creating an ingrown hair.\" Apply a warm compress to the area, or even take a warm shower to help stimulate blood flow to the area. [12] X Expert Source Mohiba Tareen, MD FAAD Board Certified Dermatologist Expert Interview. 26 March 2020."
    },
    {
      "title": "Shave in the direction that your hair grows.",
      "content": "Shave in the direction that your hair grows. While you can get a closer shave by shaving against the direction of hair growth, you’re less likely to get ingrown hairs if you shave in the same direction. [13] X Trustworthy Source DermNet NZ Online clinical resource website written and run by dermatologists providing evidence-based information about dermatology and skin health Go to source Board-certified dermatologist Mohiba Tareen also advises \"making sure that the blade is sharp and new. A dull, overused razor will spread bacteria and leave a jagged edge on the hair, which could lead to more ingrown hairs.\" When you're finished shaving, Tareen suggests \"applying a cool compress to your skin, which constricts the blood vessels and soothes the area.\" The longer and straighter the hair, the less likely it is to curl back into the skin, so try shaving less closely by using an electric shaver or single-blade razor instead of a multi-blade razor. [14] X Expert Source Mohiba Tareen, MD FAAD Board Certified Dermatologist Expert Interview. 26 March 2020. If you’re waxing your hair, pull off the wax in the opposite direction that your hair is growing. [15] X Trustworthy Source American College of Obstetricians and Gynecologists Professional association of OB/GYNs focused on education and public outreat initiatives Go to source"
    },
    {
      "title": "Wear loose, comfortable clothing that doesn’t chafe.",
      "content": "Wear loose, comfortable clothing that doesn’t chafe. Wearing tight clothes creates friction, which can lead to ingrown hairs. To prevent future flare-ups, slip into loose (preferably cotton) clothes that don’t rub against your skin. [16] X Research source Make sure that your underwear is loose and comfortable—if you can, steer clear of garments like G-strings."
    },
    {
      "title": "Avoid pulling on your skin while you shave.",
      "content": "Avoid pulling on your skin while you shave. Some people like to pull their skin tight as they shave—this actually does more harm than good, though, as it can lead to ingrown hairs. To protect your skin during future shaves, leave it be. [17] X Research source"
    },
    {
      "title": "Let your hair grow out.",
      "content": "Let your hair grow out. The longer your hair is, the less likely it is to become ingrown within your skin. [18] X Trustworthy Source Cedars Sinai Hospital Website of one of the world's leading hospitals Go to source If shaving is an important part of your routine (like shaving your beard), be sure to do it on a regular basis (like every day or every other day) so your hair doesn’t have a chance to become ingrown. [19] X Research source"
    },
    {
      "title": "Try depilatory creams, laser hair removal, or electrolysis instead.",
      "content": "Try depilatory creams, laser hair removal, or electrolysis instead. You’re much less likely to get ingrown hairs if you use depilatory creams to remove your body hair—this is a topical cream that gets rid of hair on the surface of your skin. If you’d like a more permanent solution, talk to a dermatologist or hair removal specialist about laser hair removal or electrolysis. [20] X Research source Electrolysis and laser hair removal often take multiple sessions to completely remove the hair, but the results are permanent (as opposed to shaving and depilatory creams). [21] X Research source"
    }
  ]
}