{
  "url": "https://www.wikihow.com/Rune-Knight-5e",
  "title": "How to Build a Rune Knight in D&D 5th Edition: Abilities, Feats, Stats & More",
  "steps": [
    {
      "title": "Rune Knight is a fighter subclass that uses magic runes in combat.",
      "content": "Rune Knight is a fighter subclass that uses magic runes in combat. Rune Knights combine combat prowess with the power of runes—a practice originated by giants who specialized in “rune cutting.” Rune Knights might learn their skills from a giant, a mystical sage, or simply study the giant runes they encounter in the world; regardless, they learn to harness that magic for themselves. [1] X Research source When you take the Rune Knight subclass, you’ll gain a few bonus proficiencies right away: your PC (player character) will be proficient with smith’s tools and able to speak, read, and write Giant. The Rune Knight subclass is available in Tasha’s Cauldron of Everything , a 2020 sourcebook for D&D 5e."
    },
    {
      "title": "Yes, Rune Knight is one of the stronger fighter subclasses.",
      "content": "Yes, Rune Knight is one of the stronger fighter subclasses. Every subclass has its perks and drawbacks, but overall, Rune Knight is a solid choice if you’re looking for a subclass with lots of firepower. Its rune abilities make this subclass super versatile, able to run into the thick of battle and dominate enemies while still controlling the battlefield with a few choice magical abilities. [2] X Research source Along with Rune Knights, Echo Knights, Eldritch Knights, and Battle Masters are often considered some of the strongest fighter subclasses available in D&D 5e."
    },
    {
      "title": "Rune Carver",
      "content": "Rune Carver At 3rd level, your Rune Knight can use runes to enhance their gear. After finishing a long rest, your PC can inscribe runes on a number of objects equal to the number of runes they currently know. The object must be a weapon, suit of armor, shield, piece of jewelry, or something that can be worn or held; the rune remains until the end of your next long rest. [3] X Research source Remember: an object you imbue with a rune can only carry one rune at a time. You can choose to learn 2 runes right away, and you can replace one of those known runes with a different one each time your PC gains a level. Your Rune Knight will learn additional runes after reaching certain levels: Level 3: 2 Runes Level 7: 3 Runes Level 10: 4 Runes Level 15: 5 Runes If a rune requires a saving throw, the save DC equals 8 + your PC’s proficiency bonus + your PC’s Constitution modifier. To learn more about each rune option, see the section below!"
    },
    {
      "title": "Giant Might",
      "content": "Giant Might At 3rd level, your Rune Knight PC can infuse themselves with the power of a giant. You can use the Giant Might feature a number of times equal to your PC’s proficiency bonus, recovering all uses after a long rest. As a bonus action, you can activate this ability (which lasts for 1 minute), and your PC will take on several giant-like qualities, including: [4] X Research source If your Rune Knight’s size is smaller than Large, they become a Large creature (along with their gear), but if they’re already Large, their size stays the same. They’ll gain advantage on Strength checks and saving throws (meaning they can roll twice and take the higher result). Once per turn, one of their attacks with a weapon or unarmed strike will deal an extra 1d6 damage to a target. The damage bonus from Giant’s Might is definitely helpful in any combat scenario, and the size transformation can actually be stacked with the Enlarge/Reduce spell to make your PC extra big!"
    },
    {
      "title": "Runic Shield",
      "content": "Runic Shield Runic Shield is available at the 7th level, allowing your Rune Knight to protect their allies with giant magic. If another creature within 60 feet is hit by an attack roll, your Rune Knight can force the attacker to reroll (and use the new result) as a reaction. You must be able to see the creature to protect them with this ability. [5] X Research source You can use Runic Shield a number of times equal to your PC’s proficiency bonus, and all expended uses are refreshed after a long rest. Runic Shield is especially great for negating critical hits against your allies, preventing them from taking massive amounts of damage. However, it’s not super useful when protecting allies with a low armor class (since they’re so easy to hit anyway). Use it judiciously to help allies with a chance of dodging an attack!"
    },
    {
      "title": "Great Stature",
      "content": "Great Stature When your Rune Knight gains this feature at the 10th level, you can roll 3d4 (4-sided dice). Add up your rolls; your Rune Knight will permanently grow a number of inches equal to the results of your rolls—meaning their height will increase by anywhere from 3 to 12 inches! You’ll also deal an extra 1d8 damage with Giant’s Might (rather than 1d6). [6] X Research source While a sudden growth spurt for your PC can be fun to address narratively, it doesn’t have a huge impact on gameplay beyond the damage increase—which is still minimal."
    },
    {
      "title": "Master of Runes",
      "content": "Master of Runes Master of Rune is a 16th-level feature that allows your PC to invoke each rune from the Rune Carver feature twice (rather than once). Additionally, all uses of each rune can be recovered by finishing either a short or a long rest. [7] X Research source This is super helpful because it means your PC can reuse the same rune several times per day, so long as they take an hour-long break for a short rest at some point."
    },
    {
      "title": "Runic Juggernaut",
      "content": "Runic Juggernaut At the 18th level, Runic Juggernaut increases the extra damage your PC can deal with Giant’s Might to 1d10. Additionally, using Giant’s Might increases your PC’s size to Huge (instead of Large), and their reach increases by 5 feet whenever they’re considered Huge. [8] X Research source When considered Huge, your PC can actually attempt to grapple Gargantuan-sized creatures, which definitely wouldn’t be possible otherwise. This includes Ancient Dragons, Krakens, and Purple Worms (to name a few)."
    },
    {
      "title": "Cloud Rune",
      "content": "Cloud Rune Named after cloud giants, the Cloud Rune grants advantage on Sleight of Hand and Deception checks to creatures wearing or carrying an object inscribed with it. Plus, when your PC (or a creature within 30 feet) is hit by an attack, you can use a reaction to force a different creature within 30 feet to become the target of the attack using the same roll regardless of the attack’s range. [9] X Research source Once invoked, runes can’t be used again until after a short or long rest. Thus applies to all of them—not just the Cloud Rune. The ability to transfer attacks onto enemies can be super helpful, especially when trying to whittle down an enemy with lots of hit points. Still, keep in mind that the attack roll must still be compared to the new target’s armor class—so it’s not guaranteed to hit."
    },
    {
      "title": "Fire Rune",
      "content": "Fire Rune Fire Runes double your proficiency bonus for any ability check made using your proficiency with a tool. Additionally, you can use the rune to summon fiery shackles after hitting a creature with a weapon attack; the target takes an extra 2d6 fire damage and must succeed a Strength saving throw or be restrained for 1 minute. Then, the target will keep taking 2d6 fire damage at the start of each turn. [10] X Research source This ability isn’t guaranteed to last for a full minute, however; your target can repeat their saving throw at the end of each turn and banish the shackles on a success."
    },
    {
      "title": "Frost Rune",
      "content": "Frost Rune Frost Runes are imbued with the power of frost giants. They grant advantage on Animal Handling and Intimidation checks—and, additionally, you can invoke the rune at any time to make your PC sturdier. When activated, a Frost Rune can cause your PC to gain a +2 bonus to all Strength or Constitution-based ability checks and Saving throws for the next 10 minutes. [11] X Research source Advantage on Constitution saves can be useful when resisting harmful spells like Cone of Cold, while advantage on Strength checks can help with climbing and grappling attempts."
    },
    {
      "title": "Stone Rune",
      "content": "Stone Rune Associated with stone giants, Stone Runes grant advantage on Insight checks and darkvision out to a range of 120 feet. You can also spend a reaction to invoke the rune when a creature you can see ends its turn within 30 feet; the rune forces the creature to make a Wisdom saving throw, and if they fail, that creature is charmed by you for 1 minute. [12] X Research source While charmed with a Stone Rune, a creature’s speed is 0, and they fall into a stupor, gaining the incapacitated condition. Charmed creatures can repeat their saving throw at the end of each subsequent turn, and the effect will end on a success. Using the Stone Rune’s charm ability to incapacitate enemies is a fantastic way to control the battlefield—and you can use it to stop large, powerful enemies with low Wisdom scores in their tracks."
    },
    {
      "title": "Hill Rune",
      "content": "Hill Rune Hill Runes take on the power of hill giants, granting your PC advantage on saving throws against being poisoned—and resistance to poison damage. When you invoke the rune as a bonus action, your PC can also gain resistance to bludgeoning, piercing, and slashing damage for 1 minute. [13] X Research source Your Rune Knight PC can only use Hill Runes at the 7th level or higher. This rune is a fantastic choice to use in battles where enemies have the power to deal a lot of weapon-based damage. With additional poison resistance, they’ll have a much harder time draining your PC’s hit points."
    },
    {
      "title": "Storm Rune",
      "content": "Storm Rune Channeling the power of storm giants, Storm Runes grant advantage on Arcana checks, and your PC can’t be surprised so long as they aren’t incapacitated. You can invoke the rune as a bonus action, putting your PC in a prophetic state for 1 minute (or until incapacitated). When you or a creature within 60 feet makes an attack roll, saving throw, or ability check, you can use a reaction to give the roll advantage or disadvantage. [14] X Research source Your Rune Knight PC can only use Storm Runes at the 7th level or higher. The ability to impose advantage or disadvantage on just about any roll for 1 minute is super handy; you can protect allies from dangerous spells and potentially force enemies to take damage they might not otherwise. It’s also smart to consider using this rune’s ability on your turn to give enemies disadvantage against another rune (like the fiery shackles from your Fire Rune)."
    },
    {
      "title": "Give Rune Knights high Strength and Constitution scores.",
      "content": "Give Rune Knights high Strength and Constitution scores. Strength (STR) empowers the Rune Knight’s attacks, and Constitution (CON) gives them more hit points (and sets their saving throw DC). Then, try giving your PC middle-of-the-road Dexterity (DEX) and Wisdom (WIS) scores since DEX and WIS saving throws are super common. Finally, Intelligence (INT) and Charisma (CHA) are unnecessary and can be their lowest stats. [15] X Research source Examples of solid Rune Knight ability scores include: Standard Array: STR 15, DEX 13 (or 12), CON 14, INT 10 (or 8), WIS 12 (or 13), CHA 8 (or 10) Manual (Rolled): STR 18, DEX 12, CON 16, INT 9, WIS 14, CHA 10 Point Buy: STR 15, DEX 12, CON 15, INT 8, WIS 13, CHA 8"
    },
    {
      "title": "Try choosing a species with complementary abilities to a Rune Knight.",
      "content": "Try choosing a species with complementary abilities to a Rune Knight. There’s no wrong way to build a Rune Knight, which means there’s no correct or incorrect choice for your PC’s species; still, certain species come with features that can work well with a Rune Knight’s abilities and create a more powerful fighter. If you want suggestions, consider the following species: [16] X Research source Bugbear. They have the long-limbed feature, which grants extra reach on melee attacks—and the Runic Juggernaut feature could expand their reach even further. Elf . As either a wood or high elf, you can swap out their free weapon proficiencies for Expertise on any skill or tool (like athletics). Dragonborn . The dragonborn’s breath weapon also relies on CON saves, and since your PC’s CON will already be high as a Rune Knight, it’ll work well with a breath weapon. Duergar. Duergar can cast the Enlarge/Reduce spell, which can stack on top of Giant’s Might. Fairy. Fairies can also cast Enlarge/Reduce, and Giant’s Might can automatically make a fairy “Large,” so there are still plenty of strong combat options for a fairy Rune Knight. Goliath. Goliaths are related to giants, giving you a lore-related reason to make your goliath fighter a Rune Knight. Half-Elf. Half-elves can gain proficiency in 2 skills of choice and add an extra +1 bonus to one ability score, which is useful for pretty much any class or subclass. Loxodon. Loxodon can grapple creatures with their trunks (as elephant-folk), which is handy when their hands are full carrying other weapons. You can also use a feat like Great Weapon Master to make grapple checks with advantage. Orc. Orcs gain extra mobility from Adrenaline Rush and added durability from Relentless Endurance, making them a great choice for any fighter build. Warforged. Warforged are naturally sturdy with an innate armor bonus, resistance to poison, and immunity to disease, making them a strong choice for any fighter build. Variant Human. Variant humans are never a bad choice for any class because they get a bonus feat at level 1. Any race with a natural weapon. A PC with natural weapons can keep their hands free and grapple and shove opponents (which the Rune Knight subclass is great for) while still being considered “armed.” This includes races like aarakocra, centaur, dhampir, leonin, lizardfolk, tabaxi, and tortles."
    },
    {
      "title": "Pick feats that play to the Rune Knight’s existing strengths.",
      "content": "Pick feats that play to the Rune Knight’s existing strengths. Feat are optional abilities you can give your PC when they reach certain levels; Rune Knight fighters can choose a feat at levels 4, 6, 8, 12, 14, 16, and 19—meaning you’ll have several opportunities to choose feats for your Rune Knight as they level up. Consider choosing feats such as: [17] X Research source Aberrant Dragonmark. Not only does it grant a +1 bonus to CON, but it also grants a sorcerer cantrip and 1st-level spell that both use your PC’s CON score—making them surprisingly powerful! Try a ranged cantrip like Firebolt or Chill Touch. Chef. Chef gives your Rune Knight a unique way of healing the party (despite being a fighter) and grants a +1 to WIS or CON, making it a cool feat when you want your PC to have some extra utility. Great Weapon Master. This ability is great for any fighter because it lets you add extra damage to attacks in exchange for a penalty to accuracy. It’s well-worth having! Healer. With high CON, your Rune Knight will probably be one of the hardiest PCs on the battlefield—which puts them in an ideal position to revive less-sturdy allies, and Healer lets them do just that using healer’s kits. Martial Adept. This lets you learn maneuvers normally reserved for the Battle Master subclass, giving your Rune Knight more options in combat. Polearm Master. This feat is mainly useful if your Rune Knight is going to use a polearm weapon; it lets them take bonus action attacks with the other end of their weapon. Resilient. This is a simple feat that can improve your saving throws; consider choosing WIS or DEX. Sentinel. This gives your Rune Knight even more control of the battlefield by triggering opportunity attacks when an opponent leaves their reach—and that range expands when combined with Giant’s Might. Skill Expert . Skill Expert grants Expertise in 1 skill and increases an ability score by +1—which means you can raise your fighter’s STR score and give them expertise in Athletics. Tavern Brawler . This lets you make a grapple check as a bonus action as long as you’re making an unarmed strike—so it’s a great feat for a Rune Knight PC with natural weapons."
    },
    {
      "title": "Fighting styles",
      "content": "Fighting styles In D&D 5e, fighter PCs can become masters of particular fighting styles, which add flavor to the way they fight in combat and grant additional abilities or bonuses. You can give your Rune Knight any fighting style that sounds fun to you—but if you want an optimized PC, consider choosing from the following fighting styles: [18] X Research source Blind Fighting . This grants your PC blindsight, allowing them to effectively see anything that isn’t behind total cover even while blinded. Defense . Defense simply offers a +1 bonus to armor class, which will always be useful for a fighter! Dueling . This offers a +2 damage bonus on attacks made while wielding a single weapon—and you can still squeeze extra damage out of this by using a spear along with the Polearm Master feat. Unarmed Fighting . Giant’s Might combined with Unarmed Fighting can give your PC unparalleled grappling abilities, letting you tackle and hold larger opponents in battle."
    },
    {
      "title": "Weapons",
      "content": "Weapons Just like any other customization choice, there’s no wrong weapon to choose for your Rune Knight PC. If you’re looking to optimize them, however, a few weapons can really supplement the Rune Knight’s subclass features well, including spears, two-handed weapons, and unarmed strikes or natural weapons. [19] X Research source Spears count as polearms, and yet they’re one-handed weapons, meaning you can still get a bonus action attack with Polearm Master and grapple opponents while holding a spear. Two-handed weapons include greatswords, greataxes, glaives, halberds, and mauls. They generally deal more damage—and glaives are also compatible with the Polearm Master feat. Since grappling requires a free hand, relying on your PC’s natural weapons (if they have any) is a great way to ensure they’re still “armed” but also have a hand free for a grapple attempt. A weapon enlarged by Giant’s Might may also count as an “oversized weapon,” meaning its base damage would increase. However, that’s not explicitly confirmed in the Rune Knight rules, so consult your DM if you’d like to implement that rule."
    },
    {
      "title": "Armor",
      "content": "Armor Generally, any type of heavy armor is the optimal choice for a Rune Knight. They tend to be heavy-hitters with high Strength and Constitution—so their armor should reflect that! Plate armor is just about the heaviest armor you can get your hands on in D&D 5e, so be sure to equip your Rune Knight with a set when you get the chance. [20] X Research source At level 1, you can equip a fighter PC with either chain mail or leather. Until you can upgrade, pick the chain mail (which is heavy armor)."
    },
    {
      "title": "Multiclassing lets your Rune Knight gain additional classes.",
      "content": "Multiclassing lets your Rune Knight gain additional classes. Ultimately, the decision to multiclass (or not) is totally up to you. [21] X Research source Rune Knights definitely don’t need any extra abilities granted from subclassing; a plain level 20 Rune Knight can be incredibly strong on their own! If you do want to multiclass, consider the following classes: Barbarian . Barbarians and fighters generally mesh well; barbarians rely on STR and CON (just like Rune Knights). Plus, the barbarian’s Rage feature paired with Giant’s Might and the fighter’s Action Surge could be insanely powerful. Ranger . Gloom Stalker rangers get an extra attack at the start of combat with their Dread Ambusher feature and can choose an additional fighting style, giving you more ways to fight in combat."
    }
  ]
}