{
  "url": "https://www.wikihow.com/Prepare-For-a-Long-Distance-Run",
  "title": "How to Prepare For a Long Distance Run",
  "steps": [
    {
      "title": "Identify your goal.",
      "content": "Identify your goal. If you aren’t doing cross-country as a school or college sport, you have the freedom to decide exactly how long you want your long-distance run to be. Long-distance runs span a range from a 3K (three kilometers, or under 2 miles) all the way up to a marathon (over 40 kilometers, or 26 miles) or an ultra-marathon (over 60 kilometers, or 37 miles). [1] X Research source Think about your previous athletic experience and how hard you want to push yourself. If you're amping up from a sedentary lifestyle, talk to a doctor before starting a new exercise regimen. You can work together to develop a plan that takes your strengths and weaknesses into account. It is important not to jump into training too quickly, otherwise an overuse injury, such as a stress fracture, is very likely. Start out with lower mileage and work your way up. You will want to consider your body’s limitations, including asthma or injuries, in your decision. Also take the availability of safe places to run near you into account (like trails, sidewalks and paths)."
    },
    {
      "title": "Figure out a training plan.",
      "content": "Figure out a training plan. You probably don’t want to wait, but it’s important to give your body time to adjust to long-distance running. Depending on your fitness level, it takes a new runner about 3 to 6 months to prepare for a half marathon and about 6 to 12 months to prepare for a marathon. [2] X Research source You’re going to be building up to the race, so there’s no need to strain yourself right off the bat. If you’re running a very long race, like a half or full marathon, make use of a professionally developed training plan. There are plenty available on the Internet, or you can reach out to a local running or athletic store for resources. There's no need to run every day. It's actually best not to. Shoot for three or four days a week, with one of those days perhaps being an extra-long weekend run. Be aware that you won’t necessarily run the full distance before the race. The only time marathon runners actually run marathons is on race day! [3] X Research source"
    },
    {
      "title": "Run slow.",
      "content": "Run slow. [4] X Expert Source Francisco Gomez Fitness Coach Expert Interview. 24 October 2019. This is counterintuitive but essential. You can’t sustain a sprint for ten miles, so don’t try. Pace yourself--you can always build up speed later in your training. The most important thing right now is learning to cover a lot of ground. [5] X Research source"
    },
    {
      "title": "Take smaller steps.",
      "content": "Take smaller steps. The number of steps you take per minute is called your cadence. Professional runners actually run with shorter steps than an average person--they just make those steps faster. Maintaining a shorter stride will also help protect you from strain and injury. A cadence of 180 is ideal. To figure out what it’s like to perform this way, run on a treadmill and watch a clock with a second hand. Time your steps so that you’re taking three steps every second. [6] X Research source"
    },
    {
      "title": "Shake up your routine with speed work.",
      "content": "Shake up your routine with speed work. Running at exactly the same pace for ten miles can get a little monotonous. Once you’ve started to feel comfortable running long distance, mark offset periods of speedwork: increase your pace to a near-sprint for a half-mile, then recover for a mile at your normal jogging pace. [7] X Research source"
    },
    {
      "title": "Finish strong.",
      "content": "Finish strong. If you’re comfortable running for a long time and you’ve gotten the hang of speedwork, you can start to familiarize yourself with the fast finish. Ramp up the pace for the last few miles of your run to train your body to power through the last bits of a long race. Do not do a fast finish every time you go for a run. Save it for special occasions! It’s best once a week at most."
    },
    {
      "title": "Find a runner’s group.",
      "content": "Find a runner’s group. If you want to get feedback, motivation, and potential new friends, locate a runner’s group near you. They’re all over the place and they exist for all different levels and events. Try Googling your area’s running groups, or ask for a referral at a running supply store. [8] X Research source Running groups can help you by getting you motivated to leave the house. If you have a scheduled time to run, it’s easier to honor it. Another advantage of a running group is that it keeps you from getting bored while you run, if you’re social. Furthermore, a little friendly competition before the race never hurt anyone."
    },
    {
      "title": "Stretch.",
      "content": "Stretch. [9] X Expert Source Francisco Gomez Fitness Coach Expert Interview. 24 October 2019. You don’t need to twist yourself up like a pretzel, but a few gentle stretches can go a long way toward protecting you from injury. Make sure you stretch your arms as well as your legs, because it is possible to get a shoulder cramp. Stretch before and after every run, and after you wake up for bonus points. Be sure that you are warmed up before you stretch. It is important for your muscles to be warm when you stretch. To stretch your hamstrings, do the figure-4. Sit on the ground with one leg extended in front of you, and the other bent so that its knee touches the floor and its foot touches the other leg’s knee. Reach toward your extended foot, and hold. To stretch your quads, stand on one leg and grab the ankle of your other leg. Gently pull it back. If you have trouble balancing here, tighten your abs. To stretch your shoulders, move one arm so that your hand is between your shoulder blades and your elbow is pointing up. Grab the elbow with your opposite hand and pull carefully. [10] X Research source"
    },
    {
      "title": "Take walk breaks if you need them.",
      "content": "Take walk breaks if you need them. It’s good to keep a consistent pace, but stopping your running to walk every now and then is actually good for your muscles and breath. Plus, if you’re doing a long run or race, you’ll need to stop running to rehydrate anyway."
    },
    {
      "title": "Stay hydrated.",
      "content": "Stay hydrated. This doesn't only help you run longer without losing your breath, but it also helps reduce the chance of getting cramps. 8 glasses (64 ounces, or about 2 liters) a day is the gold standard, but everybody is different—experiment until you find an amount of water that feels right for your body without weighing it down. [11] X Research source It's possible to overdo it with hydration; excess water might make you feel bloated or weighted down. Listen to your thirst cues, and don't keep chugging water if you feel like there's no room in your stomach for it."
    },
    {
      "title": "Carb up.",
      "content": "Carb up. A couple hours before you run, fuel yourself correctly! Carbohydrates are the preferred fuel for long-distance runners, and the right ones burn slowly and consistently to give you plenty of energy. You can throw a little fat into your pre-running meal as well (like olive oil or peanut butter), but save heavy-protein foods like steak or tofu for later. The best carbohydrates are the so-called “complex” ones, which give you excellent energy without a crash. Focus on whole grains like whole-wheat bread, oatmeal, and brown rice; root vegetables like sweet potatoes; and pulses like beans, peas, and lentils. Avoid simple carbohydrates, like heavily sugared cereals and doughnuts."
    },
    {
      "title": "Embrace good habits.",
      "content": "Embrace good habits. A long-distance run asks a lot of your body. Therefore, you'll want to treat your body right, so it performs for you. This means emphasizing the things you already do to keep it in good shape, and eliminating any habits that might be holding you back. Do not smoke! It shortens your breath and constricts your blood vessels. [12] X Research source Drink in moderation (if at all). Alcohol dehydrates you, and too much of it can keep your body from absorbing protein from food. [13] X Research source This means you'll have to work even harder to build muscle. Get some sleep. Sleep helps your body refresh and regenerate, and sharpens your mind, too. [14] X Research source Everybody is different—shoot for 8 hours of sleep, and adjust if that feels like too much or too little."
    },
    {
      "title": "Don’t push too hard before the race.",
      "content": "Don’t push too hard before the race. You may want to double-check that you can finish a run as long as the event that you’ve prepped for. Resist the urge! It’s important to go easy on yourself so you’ve got the maximum amount of energy for the run. [15] X Research source If you feel like you’re going to go wild without some physical activity, you can always do yoga, stretch, or dance. Remember to sleep, too."
    },
    {
      "title": "Eat extra carbs.",
      "content": "Eat extra carbs. If you live in a town that annually holds a big race, you might have noticed that the night before, the town often holds a giant pasta dinner in town hall or a public park. The carbohydrate consuming that you did during your training should reach a frenzy right before the race. Lean into it--food is fuel, and pasta is delicious. If you have a running group or squad, have a pasta potluck and wish each other luck the night before."
    },
    {
      "title": "Wake up and move around.",
      "content": "Wake up and move around. Start off on the day of the big race by waking up with extra time. Do a few dynamic stretches or jumping jacks, or anything to get your blood pumping, Make sure you don't push yourself too hard, though. Save your energy for the race. [16] X Research source"
    },
    {
      "title": "Eat a good breakfast.",
      "content": "Eat a good breakfast. Fiber and hydration are important now more than ever. If you’re not usually a breakfast person, it’s still important to eat something. [17] X Expert Source Francisco Gomez Fitness Coach Expert Interview. 24 October 2019. A healthy breakfast of complex carbohydrates and a little protein and fat, paired with a big glass of water, can really help you run faster. Some great breakfast ideas include oatmeal with peanut butter; a banana with a handful of nuts; and toast, dates, and protein spread. Avoid sugary foods such as donuts or muffins for breakfast, as they won't give you any energy or stamina for your run."
    },
    {
      "title": "Hydrate to dominate.",
      "content": "Hydrate to dominate. [18] X Expert Source Francisco Gomez Fitness Coach Expert Interview. 24 October 2019. A big glass of water (around 16 ounces) is a good idea in the hour leading up to the race; dehydration is real, and drinking a moderate amount of water will help you avoid it. [19] X Research source Plan to supplement this with water stops along the route, but don't overdo it. If you drink too much water during the race, it'll end up slowing you down. Check if there will be hydration stations available during the race. If not, you can run with a small water bottle."
    },
    {
      "title": "Warm up and psych down.",
      "content": "Warm up and psych down. There's a performance aspect to running a race, and it's possible to get a little nervous in the hours leading up to it. This is one case in which you don't want to meditate or nap if you're anxious. After all, if you get too relaxed, you won't run as well. So shoot for a physically and mentally calm, but alert, state. Deep breathing and gentle stretching can help prepare both your body and mind. Try tensing your already-tense muscles, then relaxing them. [20] X Research source It may seem simple, but smiling helps transform your outlook and relax your body. Try it! [21] X Research source"
    },
    {
      "title": "Do your best.",
      "content": "Do your best. You’ve been training for weeks or months, and you’re all ready to begin your long-distance run. No matter what happens, be proud of yourself! You set a goal and sweated a lot as you worked toward it. Hopefully, your first race is so fun that you decide to stick with long-distance running."
    }
  ]
}