{
  "url": "https://www.wikihow.com/Prank-Your-Mom",
  "title": "How to Prank Your Mom",
  "steps": [
    {
      "title": "Put fake bugs into a box of cereal or rice to gross out your mom.",
      "content": "Put fake bugs into a box of cereal or rice to gross out your mom. Buy some small, cheap, fake bugs and put a handful of them into a box of food that you know your mom is going to use, like her favorite cereal, the flour canister, or a bag of rice. Close the container back up and give it a few good shakes to spread the “bugs” around. When she goes to eat that food the next time, she will think it is full of bugs! Make sure you are around when she opens the container to use it! Try catching your prank on video."
    },
    {
      "title": "Fill a donut with ketchup or mayonnaise instead of jelly or cream.",
      "content": "Fill a donut with ketchup or mayonnaise instead of jelly or cream. Go to a donut shop and order a few jelly or cream filled donuts. When you get home, gently squeeze out the filling and throw it away. Put a little ketchup or mayonnaise into a large ziplock bag, snip off one of the bottom corners of the bag, and refill the donut. Then, just wait until your mom picks up a donut and bites into it! Try to match the color of the original donut filling to whatever you are filling it with (avoid filling a jelly donut with mayonnaise, because your mom might notice the multiple colors and get suspicious). If you’re really ambitious, you could try making your own filled donuts at home!"
    },
    {
      "title": "Switch out condiments or beverages with similar colored substitutes.",
      "content": "Switch out condiments or beverages with similar colored substitutes. For example, you could fill the mayonnaise jar with yogurt, fill a bottle of Sprite with water, put toothpaste in between sandwich-cookies, or mix M&Ms with skittles. You could also switch out a bottle of red wine with grape juice, clear liquors with water, or a colored liquor (like creme de menthe) with mouthwash. Make sure to save the original food or drink item (like the alcohol or mayonnaise) or buy a replacement to keep you from getting into trouble."
    },
    {
      "title": "Leave upside down cups of ice on the counter.",
      "content": "Leave upside down cups of ice on the counter. After your mom goes to bed, go to the kitchen and fill a glass cup halfway up with ice cubes. Place a paper towel overtop of the glass, flip it over so it’s upside down, then pull the paper towel out from underneath it. In the morning, your mom will come downstairs to find an upside down cup full of water (from the ice melting) and she will have to figure out how to clean it up! [1] X Research source If you need to help your mom clean up the water, simply put a large bowl under the edge of the counter, slide the glass forward, and dump the water into the bowl."
    },
    {
      "title": "Make “orange juice” using the powdered cheese from mac and cheese.",
      "content": "Make “orange juice” using the powdered cheese from mac and cheese. Take out the powdered cheese from a box of macaroni and cheese, and mix it with water. You can use a large juice pitcher, or just mix it in a large glass. Either leave the “juice” in the fridge for your mom to find and drink on her own, or bring her a glass yourself. [2] X Research source If your mom doesn’t normally drink orange juice and you bring her a glass, she might be suspicious. In this case, it might be better to leave it in the fridge for her to find on her own. Using warm water might help the powdered cheese dissolve faster and not be clumpy. If you do use warm water, make sure to refrigerate the “juice” so it’s cold before trying to serve it to your mom."
    },
    {
      "title": "Slip a few raisins into her morning cup of coffee.",
      "content": "Slip a few raisins into her morning cup of coffee. Distract your mom for a few moments, and when she is in the other room or looking elsewhere, put 3 or 4 raisins into her cup of coffee. When she gets to the bottom of the cup, she’ll think there are bugs in it! [3] X Research source To distract your mom, you could ask her to find something for you in another room, or simply ask her to look at something across the room (e.g. “Hey mom, what is that on the wall over there?”)."
    },
    {
      "title": "Decorate a cardboard box to look like a cake.",
      "content": "Decorate a cardboard box to look like a cake. Use a shoebox or something similar and cover it with icing. Write a message on the cake, like “Happy Birthday, Mom,” or “We Love You!” When she goes to cut into the cake, she’ll be very confused! Make sure you have a real cake ready for her, though, so that your prank isn’t too cruel. You can get a good video of your mom trying to cut into the “cake” so you can share it with her later."
    },
    {
      "title": "Make your mom think it’s later or earlier than it really is.",
      "content": "Make your mom think it’s later or earlier than it really is. Wait until your mom is in bed, then go around the house and change all of the clocks to be a few hours later than it really is (so if it’s really 11 p.m., change all the clocks to read 1 a.m.). Don’t forget to change your mom’s alarm clock! When she wakes up in the morning, she will just go about her normal routine, though she may be confused as to why it’s darker outside than usual. If your mom uses her cellphone as her alarm clock, this trick might be harder to pull off. If your mom works or has somewhere she needs to be in the morning, don’t move the time backwards and make her late—that will probably get you in trouble!"
    },
    {
      "title": "Swap out family photos for pictures of a celebrity, like Nicholas Cage.",
      "content": "Swap out family photos for pictures of a celebrity, like Nicholas Cage. Find images online of a celebrity, and print out different sizes of that image. Over the course of a week, swap out family photos for pictures of this celebrity, or tape their face over someone else’s in a photo (be careful that the tape or sticky tac you use won’t rip the photo when you take it off later). Wait for your mom to notice that all the family photos have been taken over! [4] X Research source You could even put the celebrity photo on the inside of cabinet doors or under your mom’s pillow to confuse her even more."
    },
    {
      "title": "Add drops of food coloring to your mom’s toothbrush to dye her teeth.",
      "content": "Add drops of food coloring to your mom’s toothbrush to dye her teeth. Red, blue, and green work the best for this prank. Simply take the food coloring and add 1 or 2 drops to the bristles on your mom’s toothbrush. Try to put the drops in the middle of the brush and as close to the base as you can so the color doesn’t attract your mom’s attention. When she goes to brush her teeth at night, she will look up into the mirror to see colored foam and her teeth will be dyed! [5] X Research source Luckily, your mom can just brush her teeth a few more times (after she’s rinsed out her toothbrush) and her teeth should come clean."
    },
    {
      "title": "Paint a bar of soap with clear nail polish so it won’t get soapy.",
      "content": "Paint a bar of soap with clear nail polish so it won’t get soapy. Take a bottle of clear nail polish and a dry bar of soap, and coat it with the nail polish. Let it dry on a paper towel before you put it back into the shower or by the sink. When your mom goes to wet the bar of soap, it won’t get soapy and will confuse her. [6] X Research source Either buy a new bar of soap for your mom or make sure there are spares in the cupboard so she doesn’t have to go without!"
    },
    {
      "title": "Superglue the toilet paper so it can’t be unrolled.",
      "content": "Superglue the toilet paper so it can’t be unrolled. Carefully unroll a few squares of toilet paper and put super glue onto the underside. Either wear rubber gloves or be very cautious so you don’t accidentally get super glue on your hands! Once the glue has been applied, re-roll the toilet paper—now it won’t unroll when someone goes to use it! You could even take a roll of toilet paper from the cupboard, superglue it, and put in back in place. The prank will be delayed until the roll is used, but it could be even more confusing for your mom to take a “new” roll of toilet paper out and have it not work!"
    },
    {
      "title": "Put a rubber band around the sink sprayer to douse your mom in water.",
      "content": "Put a rubber band around the sink sprayer to douse your mom in water. Get a rubber band, hair tie, or an elastic, and wrap it around the sink sprayer a few times until the spray button is held down. The next time your mom turns on the sink water, the sprayer will automatically go off and get her wet! Be careful that you remember you did this so you don’t accidentally spray yourself."
    },
    {
      "title": "Make a fake home screen on your mom’s phone.",
      "content": "Make a fake home screen on your mom’s phone. First, take a screenshot of your mom’s home screen. Then move all the apps off of it onto the next page. Then, change your mom’s background to be the screenshot you took. When she opens her phone and tries to open an app, she will think her phone is frozen! [7] X Research source Be careful to not delete any apps when you’re moving them!"
    },
    {
      "title": "Use the autocorrect function on your mom’s phone to confuse her.",
      "content": "Use the autocorrect function on your mom’s phone to confuse her. From your mom’s phone, access the settings app. Go to “General,” then to “Keyboards.” From there, select “Text Replacement.” Once there, click the “+” button at the top right corner. In the “Shortcut” space, put a word your mom commonly texts, like “No” or “Call me.” In the “Phrase” space, put something funny, like “I like chicken” or “My child can have whatever they want.” When your mom texts, that word will automatically correct to whatever phrase you entered! [8] X Research source To delete the autocorrect, you just go back into the “Text Replacement” category and delete your entry."
    },
    {
      "title": "Text your mom song lyrics line by line.",
      "content": "Text your mom song lyrics line by line. Choose a song that also sounds like it could be a conversation, like Adele’s “Hello” or Justin Bieber’s “Sorry.” Then, text your mom one line of the lyrics at a time. She will respond to your messages thinking you're trying to talk to her about something important! See how long it takes for her to realize what’s going on. If your mom starts to freak out or get really concerned, you may want to call her or tell her what’s going on so she doesn’t think you are having a mental breakdown!"
    },
    {
      "title": "Send your mom a text that was “meant for someone else.”",
      "content": "Send your mom a text that was “meant for someone else.” For example, you could text your mom “Got 2 grams (0.071 oz) for $40,” immediately followed by “Ignore that, sorry,” and see how she responds! This is a popular prank on the internet right now, so you can show her other people’s responses, too. Other fun ideas to text are: “Don’t tell my mom I got suspended,” “I think I can sneak out around 11,” and “I’m not ready to be a parent.”"
    }
  ]
}