{
  "url": "https://www.wikihow.com/Ripen-Green-Tomatoes",
  "title": "How to Ripen Green Tomatoes",
  "steps": [
    {
      "title": "Move potted plants inside and leave them in direct sunlight.",
      "content": "Move potted plants inside and leave them in direct sunlight. Tomatoes stop ripening when the temperature gets cold. If the weather is getting cold and your tomato plants are potted, then finishing off the ripening process is easy. Just pick up your plants and move them inside where it’s warmer. Leave them near a window in direct sunlight. The warmer temperature and sunlight help the tomatoes continue ripening. Then pick tomatoes as they ripen and turn red. [1] X Research source Tomato plants grow best when the temperature is around 70 °F (21 °C), so make sure your home temperature is near that."
    },
    {
      "title": "Cover outdoor plants at night with blankets or row covers.",
      "content": "Cover outdoor plants at night with blankets or row covers. If your tomato plants aren’t potted and the season is ending, then you have to pick them or cover them until they ripen. Using a blanket or row cover helps ripen your plants in the last few days before the weather gets cold. Cover the entire tomato plant and make sure no parts are sticking out. Then check them every day and pick the ripe ones. [2] X Research source Row covers are a better choice for this method because they’re designed to keep plants warm. Buy them at garden stores or online. Take the covering off during the day so the plants get sunlight. This method also works if there is an unexpected early frost, but the weather is supposed to warm up afterward."
    },
    {
      "title": "Pull up the entire tomato plant, including its roots, and move it inside.",
      "content": "Pull up the entire tomato plant, including its roots, and move it inside. If the weather has turned and your tomatoes still aren't ripe, dig up the entire plant and let it continue ripening inside. Start by digging around the plant roots with a gardening shovel. Then work the plant out of the ground, roots and all. [3] X Research source Shake off all the dirt and debris from the plant so it doesn’t make a mess in your home. If any tomatoes fall off while you’re pulling the plant up, ripen them in a bag or box."
    },
    {
      "title": "Hang the tomato plant in a cool basement or cellar.",
      "content": "Hang the tomato plant in a cool basement or cellar. These locations have a better environment for ripening tomatoes when they’re still on the vine. There are several ways to hang the plants upside down. Use one that works best for you. Continue monitoring the tomatoes and pick them as they ripen. [4] X Research source For the simplest solution, tie a string to a nail in your ceiling rafter. Then tie the string around the base of the plant and leave it hanging upside down. You can also punch a hole in the bottom of a bucket. Then tuck the plant through that hole and suspend the bucket from the ceiling. Place a sheet or pan beneath the plant to catch any falling dirt and leaves."
    },
    {
      "title": "Pick the tomatoes if they aren’t ripe yet when the season ends.",
      "content": "Pick the tomatoes if they aren’t ripe yet when the season ends. If the weather has gotten cold but you still have green tomatoes, then you’ll have to finish the ripening process indoors. Pick each tomato and be careful not to bruise or crush any. Inspect them and dispose of any damaged ones. They won't ripen properly. [5] X Research source Leave the stem attached on all the tomatoes you pick. This helps them ripen better."
    },
    {
      "title": "Wash and dry the tomatoes",
      "content": "Wash and dry the tomatoes after picking them. Before you start the ripening process, wash each tomato thoroughly. This removes any bugs or mold spores that could damage the tomato during the ripening process. Run each tomato under cool, running water. Then dry it with a towel. [6] X Research source Make sure the tomatoes are dry because mold grows best in moist environments."
    },
    {
      "title": "Place the tomatoes in a paper bag or cardboard box.",
      "content": "Place the tomatoes in a paper bag or cardboard box. The specific container depends on how many tomatoes you have. If you only have a few, then use a paper bag. If you have a full vine or more, use a cardboard box with more room. Arrange the tomatoes so they don’t touch each other. [7] X Research source If you have a lot of tomatoes to ripen, use multiple boxes or bags. Too many tomatoes in one place will eat up all the ethylene, the chemical that makes plants ripen."
    },
    {
      "title": "Add a banana with green ends to the bag or box.",
      "content": "Add a banana with green ends to the bag or box. Bananas naturally produce ethylene, the chemical that makes plants ripen. While tomatoes produce the chemical on their own, bananas produce much more, and boost the ripening process. Introduce a banana to aid the tomatoes. [8] X Research source Use a banana that is still slightly underripe and still has green ends. A brown banana won’t produce anymore ethylene. If you place the tomatoes in multiple containers, add a banana to each one."
    },
    {
      "title": "Seal the bag or box.",
      "content": "Seal the bag or box. Tomatoes need an ethylene-rich environment to ripen properly, so seal the container you’re using. This traps the ethylene and helps your tomatoes absorb as much as they can. If you’re using a paper bag, roll the top down. If you’re using a box, close the top and use a strip of tape to hold it closed. [9] X Research source Don’t make the container airtight or too tight to open. You’ll still have to check every day for signs of rotting, bruising, or mold growth, so make sure you can open the container easily."
    },
    {
      "title": "Check the tomatoes daily for mold or rotting.",
      "content": "Check the tomatoes daily for mold or rotting. Open the container each day and check each tomato. Look for dark brown or black spots on its skin, which indicate that the tomato is starting to rot. Also look for growths on the tomato from mold. Remove tomatoes with these signs and dispose of them. [10] X Research source"
    },
    {
      "title": "Remove the tomatoes when they ripen.",
      "content": "Remove the tomatoes when they ripen. When the tomatoes turn red, they’re ripe and ready to use. Pick out the ripe ones and enjoy! [11] X Research source In warmer environments, around 65–70 °F (18–21 °C), the ripening process takes 1-2 weeks. In cooler environments, the process takes closer to a month. Use the ripe tomatoes within a week of removing them for optimal taste and freshness. If you won’t use them right away, place them on a windowsill in direct sunlight."
    }
  ]
}