{
  "url": "https://www.wikihow.com/Prove-You%27re-Responsible-to-Your-Parents",
  "title": "How to Prove You're Responsible to Your Parents",
  "steps": [
    {
      "title": "Take care of yourself whenever possible.",
      "content": "Take care of yourself whenever possible. If you usually rely on your parents to get you up at 7:00 in the morning for school, set an alarm for 6:50 and beat them to the punch. When it’s time for a snack, make it yourself instead of asking one of your parents to make it for you. Taking care of yourself will demonstrate that you’re maturing and require less supervision and fewer restrictions. If a parent asks if you need anything, say “It’s okay, I can get it!” This will show them that you’re not only willing to get things on your own, but that you prefer to take care of yourself. If a parent offers to make you a snack, flip the offer around on them. Say, “Why don’t I make us something to eat” instead. Even if they decline the offer, they’ll be impressed."
    },
    {
      "title": "Avoid emotional outbursts during disagreements.",
      "content": "Avoid emotional outbursts during disagreements. There’s nothing wrong with not seeing eye-to-eye with your parents on everything, and they won’t expect you to agree with everything they say. Part of being a responsible person though is being able to regulate your feelings and not throw a tantrum when you don’t get your way. Keep your voice down and be respectful during disagreements. Even if you don’t win, your parents will respect you for maintaining the right tone. [1] X Research source If you know that you’re going to lose an argument, state your case and then admit defeat. Saying “you’re right” is a good way to demonstrate your emotional maturity. Acknowledge when you’re getting upset. It’s okay to say, “Sorry, I need a second to calm down. I’m getting upset and want to cool off for a moment.”"
    },
    {
      "title": "Complete your schoolwork and work hard in class.",
      "content": "Complete your schoolwork and work hard in class. Complete your homework on time, don’t forget to turn it in, take diligent notes in class, and don’t get into trouble at school. Showing your parents that you can be successful at school is one of the biggest indicators that you’re capable of handling more responsibility. It also illustrates that you care about your future, which is a big plus. [2] X Research source Consider making a deal with a teacher that you’re fond of to make a positive phone call home if you do well on a major assignment. Even if your teacher mentions that it was your idea, it will show them that you care about what they think."
    },
    {
      "title": "Save your money to show them that you aren’t impulsive.",
      "content": "Save your money to show them that you aren’t impulsive. Start saving your money if you have a part-time job, weekly allowance, or make money when you do your chores. This will show your parents that you understand the importance of delayed gratification and that you’re capable of thinking about the big picture. Use a piggy bank or ask your parents to hold on to your money for you so that they can see you making an active effort to save. [3] X Research source Saving money is also an essential step in showing your parents that you’re serious about buying something. If you want to buy something badly enough that you’re willing to save your money, then you’ll show them how much it really means to you."
    },
    {
      "title": "Admit when you change your opinion to prove that you’re developing as an adult.",
      "content": "Admit when you change your opinion to prove that you’re developing as an adult. Changing your mind on something is a major sign of emotional and intellectual growth. Whether it’s a food, movie, or book, admitting that something isn’t as bad as you once claimed it was will show your parents that your worldview is developing. A growing mind will see new ways of looking at things and will provide your parents with proof that you’re ready for new responsibilities. Simple comments can go a long way. If you’re sitting down for a family meal, say “I used to really dislike this kind of food, but I’m starting to like it as I get older.”"
    },
    {
      "title": "Express gratitude and avoid bragging to show that you’re growing up.",
      "content": "Express gratitude and avoid bragging to show that you’re growing up. Say “thank you” and “you’re welcome,” and show gratitude when your parents cook for you or drive you somewhere. You may not have noticed, but your parents do lots of little things for you every day. If you notice and acknowledge them, they’ll be appreciative, which will make them more likely to trust you in the future. [4] X Research source Bragging shows that you don’t understand how to be humble. Don’t talk about how good you are. If you are doing the right thing, your parents will notice without you bringing it up."
    },
    {
      "title": "Do what you’re supposed to before they have a chance to ask.",
      "content": "Do what you’re supposed to before they have a chance to ask. One of the easiest ways to illustrate that you’re capable of being responsible to take initiative with the responsibilities that you already have. If you know you have a weekly chore coming up, do it before they get a chance to ask you. If you usually work on your homework on Sunday night, do it during the day on Saturday before they even think to remind you. [5] X Research source Don’t go out of your way to seek out new responsibilities to prove that you can handle them if you aren’t already taking care of the stuff you normally need to do."
    },
    {
      "title": "Own your mistakes and be honest about them.",
      "content": "Own your mistakes and be honest about them. One of the biggest signs that you’re responsible is the ability to admit when you’re wrong. Your parents don’t expect you to be perfect, but they do expect you to be honest. [6] X Expert Source Kirsten Parker, MFA Mindset & Action Coach Expert Interview. 22 July 2020. Admitting and owning your mistakes will prove that you’re capable of self-reflection and being humble, and your parents will take note. [7] X Research source Don’t shy away from opportunities to admit you messed up. It’s only going to get worse if you put it off or avoid it. Feel free to explain mistakes but don’t make excuses. “Sorry, I forgot to take the trash out because I got caught up in my game” sounds much better than “I couldn’t take the trash out because I was playing a game.”"
    },
    {
      "title": "Keep your promises and do what you say you will.",
      "content": "Keep your promises and do what you say you will. Whether you promised to take the trash out after dinner or agreed to stop playing that game after 10 more minutes, stick to your word and keep your promises. It shows your parents that you are consistent and mean what you say, which will make them more comfortable when they give you more responsibility. [8] X Research source Don’t make promises that are unrealistic. Even if you make an effort to follow through, it won’t matter if you break your promise. Getting straight A’s on your report card will be hard to do if you’re already averaging a C in each class!"
    },
    {
      "title": "Respect curfews and bedtimes without making a fuss about it.",
      "content": "Respect curfews and bedtimes without making a fuss about it. One of the worst things you can do when you’re trying to prove that you’re responsible is to violate the boundaries that your parents have already set for you. Make sure that you’re home well before your curfew is up and make an honest effort to be in bed before they have to tell you it’s bedtime. If you can follow their rules consistently, then you will show them that you’re capable of taking on more responsibilities. [9] X Research source"
    },
    {
      "title": "Prove to your parents that you can take care of a pet by caring for others.",
      "content": "Prove to your parents that you can take care of a pet by caring for others. If you want to get a dog or cat, ask your parents about it. If they don’t think that you’d take care of it, show them that you can by taking care of the people in your household. Fetch things for your parents when they ask and look out for your siblings. If you can demonstrate that you can care for others, then you can build the argument that you’re responsible enough for a pet. [10] X Research source If your parents are concerned about the expense, ask them about getting a rabbit . Rabbits are excellent pets that require very little money to purchase and care for. If your parents don’t want to jump right into a dog or cat, offer to start with something small like a hamster or fish."
    },
    {
      "title": "Show that you can handle a cell phone by taking care of family electronics.",
      "content": "Show that you can handle a cell phone by taking care of family electronics. To prove that you can handle a cell phone, you’ll have to demonstrate that you can use technology responsibly. Don’t walk around the house with your parent’s tablet without looking where you’re going and wash your hands before using the family computer. Don’t get caught staying up past your bedtime to play games and keep social media usage well below 30 minutes each day. [11] X Research source"
    },
    {
      "title": "Convince your parents to get you a car by doing research and staying safe.",
      "content": "Convince your parents to get you a car by doing research and staying safe. If you want to show your parents that you can handle a car, don’t do anything disobedient or risky to prove that you can stay safe. Parents will care deeply about your well-being if you get behind the wheel of a car, so show them that you know how to be careful. Come home on time and call to check in when you’re away from home. Show them that you care about safety as well by researching which makes and models are the safest. [12] X Research source Research the financial requirements and start saving up. Your parents will take the idea more seriously if you understand the financial burden and show that you are willing to chip in. It can help to point out the benefits for your parents when asking about getting a car. Explain that they won’t need to drive you around or pick you up from things if they get you a vehicle."
    },
    {
      "title": "Ask for things at an appropriate time and don’t rush your parents.",
      "content": "Ask for things at an appropriate time and don’t rush your parents. One of the worst ways to get what you want is to ask at the wrong time. If your parents have just woken up or gotten home from work, they will feel ambushed and be more likely to say no. Be upfront about what you want from them and ask during calm downtime when you’re spending time together as a family. Expensive purchases can take a long time to evaluate. Rushing your parents is one of the best ways to avoid getting what you want. Prepare your parents for what you want to talk about my mentioning it at the start. Say, “I’d like to talk to you about getting a dog,” and then give them a moment to form their initial thoughts before stating your case."
    },
    {
      "title": "Communicate with your parents to establish goals.",
      "content": "Communicate with your parents to establish goals. If there’s a specific reason that you’re trying to prove that you’re responsible, be honest with them about it and set up a goal together. If you are consistent and open about meeting their expectations, it will show that you can be trusted to follow through. Don’t try to turn conversations about responsibility into a negotiation. Instead of saying things like, “If I do the chores for the rest of the month you should let me get a new phone,” try “how can I prove that I can take care of a new phone?” Make the conversation about the process, not the reward."
    }
  ]
}