{
  "url": "https://www.wikihow.com/Set-Up-Your-HTC-Vive",
  "title": "How to Set Up Your HTC Vive",
  "steps": [
    {
      "title": "Get a powerful computer.",
      "content": "Get a powerful computer. You need Intel i7 and Nvidia 1800 or better to run HTC Vive virtual reality. The computer you get does not have to be a gaming computer; it just has to be very powerful."
    },
    {
      "title": "Get the HTC Vive or HTC Vive Pro, controllers, and sensors \"base stations\".",
      "content": "Get the HTC Vive or HTC Vive Pro, controllers, and sensors \"base stations\". You can find it online or in stores. Because of how popular the HTC Vive Pro is, the bundle is out of stock much of the time. If you want the HTC Vive Pro, then you will probably need to get the equipment separately."
    },
    {
      "title": "Go to vive.com/setup.",
      "content": "Go to vive.com/setup . Select the appropriate VR headset, scroll down, and download the installer and setup guide."
    },
    {
      "title": "Run the installer and follow along with the prompts.",
      "content": "Run the installer and follow along with the prompts. The prompts will help you with set up, as follows."
    },
    {
      "title": "Sign into Steam and HTC's VivePort.",
      "content": "Sign into Steam and HTC's VivePort. You need a Steam account in order to run SteamVR, a necessary component for HTC Vive. You need an HTC VivePort account and a subscription to get access to free games every month."
    },
    {
      "title": "Mount your base stations.",
      "content": "Mount your base stations. The base stations need to be at least two meters off the ground to function properly, and they need to be less than five meters apart. Without them, you will not be able to use your headset. Use the included mounts and screws, or use a tripod/light stand or clip mounts. Just make sure that you screw the base station in a few turns, then position and angle your base station towards your play area. The Vive Cosmos does not come with base stations built-in, but you can purchase them separately and use them provided that you purchase the tracking faceplate for your headset. Instead, the Vive Cosmos has several cameras strategically positioned to track the room."
    },
    {
      "title": "Plug the base stations into two AC power outlets.",
      "content": "Plug the base stations into two AC power outlets. Feel free to use extension cords. One base station should have the letter \"B\", and the other \"C\". If they do not, press the button on the back to change the channel to B and C. If using cable sync, change the channel on the \"B\" station to \"A\"."
    },
    {
      "title": "Plug the link box into the computer.",
      "content": "Plug the link box into the computer. There are three cables that plug in: a Mini DisplayPort to DisplayPort connector, a USB 3.0 cable, and an AC power cable. Plug the Mini DisplayPort into the control box and the other into your computer's dedicated graphics card. Also make sure your monitor is connected to your dedicated graphics. This is needed so that SteamVR can detect and display the contents of the headset, as well as improve performance. Plug the USB cable into a USB 3.0 port. Plug the AC power cable into an AC power outlet."
    },
    {
      "title": "Plug in the headset.",
      "content": "Plug in the headset. Then turn on the link box. Your computer should start installing drivers for the link box and headset. On HTC Vive (not Vive Pro), make sure that all three headset cables are connected to the link box."
    },
    {
      "title": "Pair the controllers with the link box.",
      "content": "Pair the controllers with the link box. Press the system button (the button above the squeezer but below the touchpad) to turn the controller on. The LED should light blue, then turn green momentarily. If your controllers are not turning on or light red, then make sure they are charged. Charge them with their included charger. If the controller lights stay blue, then try pairing through SteamVR. Start SteamVR, click on the arrow, choose \"Pair Controller\", and follow the instructions to pair the controllers. Vive Cosmos controllers will blink dimly first then brighten up once powered up. If the white light stays blinking, then try pairing through SteamVR. Start SteamVR, click on the arrow, choose \"Pair Controller\", and follow the instructions to pair the controllers."
    },
    {
      "title": "Choose your play area size.",
      "content": "Choose your play area size. If you are playing in a small space such as an office or bedroom, then choose \"Standing or sitting only\". If you are playing in a large space such as a living room or family room, then choose \"Room-to-Room scale\"."
    },
    {
      "title": "Establish tracking.",
      "content": "Establish tracking. Turn on and place the controllers and headset somewhere visible by the base stations. Then click on \"Next\"."
    },
    {
      "title": "Locate your monitor.",
      "content": "Locate your monitor. Press and hold the trigger on one of the controllers, while pointing it at your monitor. Click \"Next\"."
    },
    {
      "title": "Calibrate the floor.",
      "content": "Calibrate the floor. Place your controllers on the floor, and press the \"Calibrate floor\" button to calibrate it. You can also press the trigger on one of the controllers, and then place the controller on the floor. The progress bar will fill once the controller is on the floor. Click \"Next\"."
    },
    {
      "title": "Set your boundaries.",
      "content": "Set your boundaries. Click \"Next\" then trace your play area with one of the controllers. The area will automatically orient itself, but you can change the position and direction of your play area. For best comfort, play facing away from the monitor with the tether on the headset running behind your back. You can choose \"Advanced mode\" to choose four corners of your play area, instead of tracing a box."
    },
    {
      "title": "Click on \"Finish\".",
      "content": "Click on \"Finish\". You can always recalibrate your room by clicking on the arrow in SteamVR and choosing \"Room setup\"."
    },
    {
      "title": "Put on and adjust the headset.",
      "content": "Put on and adjust the headset. Measure your pupillary distance, or distance between the centers of your eyes, and adjust the lenses accordingly. Adjust the head strap so it fits snugly, and turn the wheel on the right (if there is one) to move the visor and adjust the focus."
    },
    {
      "title": "Plug in headphones into the headset or change to computer audio output (if using the non-pro version of the headset).",
      "content": "Plug in headphones into the headset or change to computer audio output (if using the non-pro version of the headset)."
    },
    {
      "title": "Immerse yourself in the virtual environment.",
      "content": "Immerse yourself in the virtual environment. Start playing!"
    }
  ]
}