{
  "url": "https://www.wikihow.com/Run-a-Dinner-Fundraiser",
  "title": "How to Run a Dinner Fundraiser",
  "steps": [
    {
      "title": "Set your goal.",
      "content": "Set your goal. Decide how much you want to raise, i.e. your net gain after expenses are deducted. [1] X Research source Linking your goal directly to a clear objective will make it easier to get people to attend. Perhaps you’re raising money to cover the cost of a new roof for your coop nursery school, or to send a missionary to China. Don’t just raise money. Raise it for a reason. First, decide the specific thing you are trying to accomplish, then analyze how much it will cost. If raising money for a new roof, for instance, you would want to cost the project with contractors. If raising money to help cover general costs at a nursery school, you would want to know total costs (last year’s, plus expected additional costs for the coming year) and total expected revenue (tuition) in order to set a goal. Goals should be specific, measurable, and achievable. The last of these is important. Set high goals, but be realistic about whether you can achieve them. Not everyone you invite will attend your fundraising dinner. If you have an auction, not everything will sell. Do research or ask around to determine how much people are willing to pay for tickets before you set the price. You don’t want to price people out, but you also want to be sure you hit your goals."
    },
    {
      "title": "Set up your team.",
      "content": "Set up your team. Regardless of the scale of your event, you will need to assign staff or volunteers to coordinate various portions of the dinner: Invitations and marketing Sales and donations Location and decorations Food and catering Entertainment Special events (auction, bake sale, etc.) Set up and break down Thank you notes"
    },
    {
      "title": "Establish a host committee.",
      "content": "Establish a host committee. If you are running a foundation or non-profit with high level donors, you will want to call on wealthy donors, business leaders, and local celebrities to set up a “host committee” – people who contribute large amounts to the event and encourage others to do so as well. [2] X Research source Try to reach out first to people who have shown a past interest in the cause your dinner seeks to fund. Call or meet with them to discuss the event, why it is important, and how they can help. Also be sure to include key stakeholders – for example an executive from a corporation sponsoring your event. Though your committee is geared mostly towards soliciting donations, it helps to create subcommittees with clearly defined tasks – volunteer recruitment, fundraising and sponsorship, entertainment – so that committee members feel ownership of the entire event without feeling overburdened."
    },
    {
      "title": "Create a budget.",
      "content": "Create a budget. You can’t decide how much to charge for tickets, or how many additional activities you’ll need (auctions, bake sales, etc.) until you know your budget. List all expenses, such as: [3] X Research source Staff. Invitations. Space rental. Catering. Entertainment. Transportation. Security. Utilities. Extra for unforeseen costs."
    },
    {
      "title": "Choose a space.",
      "content": "Choose a space. If preparing your own food, you will need access to somewhere with a kitchen. Schools or churches can save money by hosting the event. Non-profits with interesting settings, like zoos and libraries, should also consider hosting. For most dinner fundraisers, though, you will want to rent a space. When renting, be sure to ask these questions: Does the venue offer discount rates for non-profits? Are there days of the week the space costs less? If you are a large scale non-profit with many members, ask if they are willing to donate space in return for free advertising in your promotional materials (emails, flyers, Facebook page, etc.). Will the vendor consider waiving costs like security, cleanup, etc. for non-profits? Are they willing to give a percentage of the food or alcohol tab back to your cause?"
    },
    {
      "title": "Decide on food.",
      "content": "Decide on food. Are you going to cater the event or make your own? Is it going to be buffet style or a sit-down meal? Will there be desert? Coffee? Alcohol? Remember, the more you spend on food, the more you will have to charge for tickets if you want to hit your fundraising goals. Table service is more formal, but is also more time consuming and expensive. A buffet is less formal and less expensive. If making your own food, consider picking a meal that is easy to prepare for lots of people like spaghetti with salad and garlic bread, or hamburgers and veggieburgers with salad. [4] X Research source Having guests bring dessert will save on time and money. [5] X Research source If catering, ask if local restaurants will consider catering for free in lieu of a donation. Mention that this will be great advertising for their business. You’ll also need to have a plan for what to do with leftover food. Consider donating it."
    },
    {
      "title": "Think about adding entertainment.",
      "content": "Think about adding entertainment. For expensive dinners, you will want to consider live music, and perhaps a speaker. A band also goes over well for churches or schools, but also consider using free talent – a talent show, the school band or the church choir. [6] X Research source"
    },
    {
      "title": "Consider combining your dinner with an auction or bake sale.",
      "content": "Consider combining your dinner with an auction or bake sale. Auctions, in particular, can bring in a lot of extra money, but they take work. You’ll need an auction coordinator to solicit donations from local businesses. For schools and churches, also consider having the parents or members donate their own skills or prepare their own items, like gift baskets."
    },
    {
      "title": "Know your audience.",
      "content": "Know your audience. Is this a broad invitation – the entire church, school, or town? Or are you focusing on a particular group – church members who have made large donations, a grade or class at school, or people involved with your project? Knowing your audience will also help you decide where to hold your event and what type of food and entertainment to choose."
    },
    {
      "title": "Word of mouth.",
      "content": "Word of mouth. For schools and churches, this is the easiest and most effective means of advertisement, since you have your members / students in front of you at least once a week. Tell them about the upcoming fundraiser and why it is important. Try to tell a compelling story. That’s the best way to get people to spread the word. Framing your event as a story will best capture attention. Start with the need you are addressing and a concrete example of it before moving onto the even itself. For example: Last week the kids’ art projects all got wet when the roof leaked; we’re holding a fundraising dinner to raise money for a new roof. It will be great! For churches, be sure to mention the fundraiser in sermons, at bible studies, and other church events in the weeks leading up to it. For schools, discuss the fundraiser at school meetings and PTA meetings. Also send informational fliers for parents home with children. For non-profits, be sure to mention the fundraiser whenever you can, Every conversation, especially with potential donors, is a chance to hype your event."
    },
    {
      "title": "Use direct mail and email.",
      "content": "Use direct mail and email. Lower budget fundraisers might want to stick with email to save money. For more expensive fundraisers, send well-produced mailings. A series of mailings or emails in the months leading up to the event works best."
    },
    {
      "title": "Post flyers and posters in neighborhood stores and public spaces.",
      "content": "Post flyers and posters in neighborhood stores and public spaces. A simple flyer will suffice to get the word out. When posting, be sure to talk about your event to store owners. Word of mouth can be even more powerful than your flyer. [7] X Research source Coffee shops often have boards where you can post fliers. Local retail stores will often let you put fliers in their window. If a church or school, be sure to post fliers on the grounds in multiple places where people will see them."
    },
    {
      "title": "Use social media and the internet.",
      "content": "Use social media and the internet. Adults in the U.S. spend an average of 42 minutes a day on Facebook, 34 on Tumblr, 21 on Instagram and Pinterest, and 17 on Twitter. If you want to reach people, you need to be online, too. Create a Facebook page. You can give updates, post pictures of the venue, and run contests that get people engaged (most clever post, best fundraiser themed picture, etc.). [8] X Research source At the very least, use the Event app on Facebook to create a page for your event and invite friends who might be interested. Start a blog. It takes time and effort, but a blog is a great way to tell people the story of your event and what you are trying to accomplish, as well as getting them excited for the big night. Consider farming out blog duties to a number of people, each writing an article a day. Tweet. Twitter has a smaller reach than Facebook, but can be useful, particularly for driving people to your blog or Facebook page. Buy ads. Look for local websites that offer inexpensive banner ads, or consider targeted advertising on Facebook. For higher impact, use your ads to direct people to your blog."
    },
    {
      "title": "Advertise in local papers and magazines.",
      "content": "Advertise in local papers and magazines. Particularly for neighborhood events, an ad in the local paper can be very effective. Be sure to include the basics: who, what, when, where, and why."
    },
    {
      "title": "Make a YouTube video.",
      "content": "Make a YouTube video. It does not have to be a work of art. A couple of people talking about how important your cause is, or a few pictures with voice over, is enough. Link to the video from your Facebook page or send a link in one of your email announcements."
    },
    {
      "title": "Send a news release to local media.",
      "content": "Send a news release to local media. Let newspapers, radio stations, television stations, and magazines know that you are hosting an event and that you would like coverage. Provide lots of information so the event is easy for them to write up. Even small events can often get an article in the local newspaper. Larger, more expensive events might attract more coverage."
    },
    {
      "title": "Make a plan.",
      "content": "Make a plan. You should have a schedule of events, and all staff or volunteers should know where they need to be during the event and the flow of activities. Be sure you have also discussed timing with any vendors. [9] X Research source You’ll want to include things like: When vendors and volunteers need to arrive to set up. When volunteers will meet before the event to discuss and rehearse as needed. When guests will arrive and how they will be greeted, guided into the event. When entertainment or additional activities like auctions will start. When food service will start. When and how food clean-up will begin. When the event will end. Who will stay for clean up and break down."
    },
    {
      "title": "Have a person assigned to troubleshooting.",
      "content": "Have a person assigned to troubleshooting. Not everything will go perfectly. If you are at a high-level fundraiser and are trying to speak with important guests, you don’t want to have to be troubleshooting at the same time. Local fundraisers can also be harrowing if everyone is worrying about last minute details. Assigning someone this task will make everyone else’s life easier."
    },
    {
      "title": "Arrive early to set things up.",
      "content": "Arrive early to set things up. If you are preparing your own food or providing your own entertainment, you’ll need to arrive several hours early to start cooking and setting up. If you are catering and hiring entertainment, your event organizers will still need to arrive early in the day to make sure that the space is open and vendors are arriving and setting up as promised."
    },
    {
      "title": "Check that everything is in order.",
      "content": "Check that everything is in order. Before guests arrive, you’ll want to go through a series of checks to make sure everything is running smoothly. Check: [10] X Research source The sound system. The lights. The décor. The number or chairs. The silverware / flatware. The readiness of performers and food."
    },
    {
      "title": "Help the guest park.",
      "content": "Help the guest park. You should work out where guests will park in advance. Have people on the street ready to direct traffic. For events at rented spaces, it is nice to have valet parking available."
    },
    {
      "title": "Greet the guests.",
      "content": "Greet the guests. Have people posted outside to direct people in. For events during the winter, a coat check or a place to hang jackets is important. You will of course also need people at the entrance to greet guests, take their tickets, and distribute a program if there is one. A program not only informs guests about the order of events, it is also a great opportunity to reinforce your fundraising message by including information about your cause."
    },
    {
      "title": "Work the room.",
      "content": "Work the room. You will want to be sure to take advantage of the opportunity to talk to attendees about your cause and projects. While the dinner’s goal is to make money, it is also an opportunity to cultivate donors. Be friendly and introduce guests to one another, but don’t be afraid to also specifically ask for commitments to annual pledges or special projects. [11] X Research source"
    },
    {
      "title": "Stay on time.",
      "content": "Stay on time. This is imperative. Having your dinner drag on too long is a sure way to lose your guests' interest. Someone should be tasked with the job of keeping the dinner running on time. That means you need to start on time, hit your marks during the night, and end on time. [12] X Research source"
    },
    {
      "title": "Send thank you letters.",
      "content": "Send thank you letters. Your efforts are not over when the dinner ends. It is important to continue to cultivate donors and volunteers so that they will be willing to give more time and money in the future. Be sure to send thank you notes to all contributors, volunteers, and vendors. [13] X Research source"
    },
    {
      "title": "Let people know how great the event was.",
      "content": "Let people know how great the event was. The best way to have a great fundraiser is to make it an annual thing, so that word of mouth has time to spread. Start getting ready for next years fundraiser right away by reminding everyone how great this year’s was. Post event photos to Facebook, twitter, or instagram. Contact local media to let them know how successful the fundraiser was. [14] X Research source"
    },
    {
      "title": "Do a post-dinner autopsy.",
      "content": "Do a post-dinner autopsy. If you want next year’s event to be even better, you need to learn from this one. The event leaders should meet in the week after the event to discuss what worked and what could have worked better. This is especially important for organizations like schools, which may not have the same volunteers from year to year. Writing down what you have learned can create institutional knowledge you can pass on to the next bunch of parents."
    }
  ]
}