{
  "url": "https://www.wikihow.com/Screenshot-on-Chrome",
  "title": "How to Take a Screenshot on Google Chrome: Desktop or Mobile",
  "steps": [
    {
      "title": "Consider using your computer's screenshot function.",
      "content": "Consider using your computer's screenshot function. You can use your computer's built-in screenshot function to take a screenshot on Windows or take a screenshot on Mac by going to the Chrome page in question and then pressing your computer's proper key combination. You can also take a screenshot on Chromebook using a keyboard shortcut. [1] X Research source This is a good method for making desktop wallpapers, since it captures the entire screen. You could even change your Google Chrome wallpaper to your screenshot."
    },
    {
      "title": "Press Windows key + PrtScn (Windows).",
      "content": "Press Windows key + PrtScn (Windows). This will take a screenshot of your entire screen and save it to the “Screenshots” folder in the “Pictures” section of File Explorer. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You can also press Windows key + shift + s to open the Snipping Tool for more screenshot options. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Press shift + cmd + 3 (Mac).",
      "content": "Press shift + cmd + 3 (Mac). This will take a screenshot of the entire screen. You can also press shift + cmd + 4 to capture a portion. [4] X Research source"
    },
    {
      "title": "Press shift + ctrl + show windows (Chromebook).",
      "content": "Press shift + ctrl + show windows (Chromebook). Or, you can press the Screenshot key if your Chromebook has it. The key symbol is a circle in a rectangle, resembling a camera. Either way, you’ll be given the option to take a full screenshot, a partial screenshot, or a window screenshot. [5] X Research source"
    },
    {
      "title": "Press shift + ctrl + show windows.",
      "content": "Press shift + ctrl + show windows . This will open the Screenshot tool at the bottom of the screen. The show windows key is a rectangle with two parallel lines. This method will allow you to take a screenshot of the entire screen, part of the screen, or a window. [6] X Research source Alternatively, you can press the Screenshot key to open the Screenshot tool. Its icon is a circle in a rectangle."
    },
    {
      "title": "Click the Screenshot button.",
      "content": "Click the Screenshot button. It’s a gray camera icon in the Screenshot tool menu."
    },
    {
      "title": "Choose a screenshot type.",
      "content": "Choose a screenshot type. Selecting the type will either take the screenshot (full screen screenshot), prompt you to select an area to screenshot (partial screenshot), or choose a window (window screenshot). You can select from three options: [7] X Research source Full screen screenshot : Take a screenshot of the entire screen. Partial screenshot : Allows you to draw a rectangular outline around the part of the screen you want to capture. Windows screenshot : Allows you to select a window to screenshot."
    },
    {
      "title": "Type chrome://flags in the URL bar and press ↵ Enter.",
      "content": "Type chrome://flags in the URL bar and press ↵ Enter . When you go to this URL in Google Chrome, the Chrome Flags menu will open. This is the official settings page for turning on debugging and experimental features in Google Chrome. [8] X Research source"
    },
    {
      "title": "Search screenshot in the search bar.",
      "content": "Search screenshot in the search bar. The search bar is labeled “Search flags” and is located at the top of the page."
    },
    {
      "title": "Select Enabled in the drop down menu next to “Desktop Screenshots.”",
      "content": "Select Enabled in the drop down menu next to “Desktop Screenshots.” This feature allows you to take screenshots using the Google Chrome web browser. [9] X Research source"
    },
    {
      "title": "Select Enabled in the drop down menu next to “Desktop Screenshots Edit Mode.”",
      "content": "Select Enabled in the drop down menu next to “Desktop Screenshots Edit Mode.”"
    },
    {
      "title": "Click Relaunch.",
      "content": "Click Relaunch . This is a blue button at the bottom of the screen. This will restart Google Chrome and apply the selected flags features. [10] X Research source"
    },
    {
      "title": "Click the share button in the URL bar.",
      "content": "Click the share button in the URL bar. It’s an arrow in a box. A sharing options menu will appear."
    },
    {
      "title": "Select Screenshot.",
      "content": "Select Screenshot . This will prompt you to select a portion of the web page. The web page will become darker and your cursor will turn into the plus (+) icon."
    },
    {
      "title": "Click and drag over the portion you want to screenshot.",
      "content": "Click and drag over the portion you want to screenshot. A rectangle will appear showing you the part of the page that will be captured."
    },
    {
      "title": "Release the mouse button to take the screenshot.",
      "content": "Release the mouse button to take the screenshot. The screenshot will be copied to your clipboard."
    },
    {
      "title": "Click Download and select a location.",
      "content": "Click Download and select a location. After taking the screenshot, a pop up menu will appear in the top right of the browser. Selecting Download will allow you to download the screenshot to a location on your computer."
    },
    {
      "title": "Press Ctrl+⇧ Shift+I (Windows) or ⌘ Command+⌥ Option+I (Mac).",
      "content": "Press Ctrl + ⇧ Shift + I (Windows) or ⌘ Command + ⌥ Option + I (Mac). This is the Windows shortcut to inspect the webpage elements ."
    },
    {
      "title": "Press Ctrl+⇧ Shift+P (Windows) or ⌘ Command+⇧ Shift+P (Mac).",
      "content": "Press Ctrl + ⇧ Shift + P (Windows) or ⌘ Command + ⇧ Shift + P (Mac). This will open the Run menu in the Element Inspector."
    },
    {
      "title": "Type in screenshot.",
      "content": "Type in screenshot . When you type this in the Run search bar, you’ll see four choices."
    },
    {
      "title": "Press the up and down arrows to choose an option.",
      "content": "Press the up and down arrows to choose an option. You can select from the following options: capture screenshot - capture the entire screen capture area screenshot - capture a portion of the screen capture full size screenshot - capture the entire page capture node screenshot - capture a specified HTML item"
    },
    {
      "title": "Press ↵ Enter.",
      "content": "Press ↵ Enter . This will confirm your selection and either take a screenshot, or prompt you to select a portion of the screen."
    },
    {
      "title": "Open the GoFullPage page.",
      "content": "Open the GoFullPage page . This Chrome extension is free to install, and will take a screenshot of your entire page (not just the window's contents) in Google Chrome."
    },
    {
      "title": "Click Add to Chrome.",
      "content": "Click Add to Chrome . This blue button is in the upper-right corner of the page."
    },
    {
      "title": "Click Add extension when prompted.",
      "content": "Click Add extension when prompted. Doing so installs the Full Page Screen Shot extension in your Chrome browser."
    },
    {
      "title": "Go to the page you want to screenshot.",
      "content": "Go to the page you want to screenshot. Open the website, service, or item of which you want to take a screenshot."
    },
    {
      "title": "Click the GoFullPage icon.",
      "content": "Click the GoFullPage icon. It's the gray camera icon at the top-right corner of Chrome. If you don't see it, click the puzzle piece icon at the top-right corner of Chrome to display all of your extensions."
    },
    {
      "title": "Wait for Chrome to finish capturing the screen.",
      "content": "Wait for Chrome to finish capturing the screen. Depending on how long the page is, this can take anywhere from a second to a minute or two. Once the image opens in a new tab, you can proceed."
    },
    {
      "title": "Download the image.",
      "content": "Download the image. Click the PDF download button in the upper-right corner of the page to download the image as a PDF file, or click the downward facing arrow to the right of the PDF icon to download the image as a PNG file. If prompted to allow Full Page Screen Shot access to your downloads, click Allow on the prompt. You may be asked to specify a download location before your screenshot will download."
    },
    {
      "title": "Consider using your iPhone's screenshot function.",
      "content": "Consider using your iPhone's screenshot function. You can use your iPhone's screenshot feature to take a screenshot of your preferred Chrome page if you don't want to download an app to take the screenshot for you. If your iPhone has both Home and side buttons (power/sleep button), press them at the same time, then quickly release them. [11] X Research source For iPhone 14 and other Face ID models, press the volume up button and side button at the same time, then quickly release. [12] X Research source If you want to use your iPhone's on-screen AssistiveTouch feature instead, proceed with the rest of this method."
    },
    {
      "title": "Open your iPhone's Settings.",
      "content": "Open your iPhone's Settings. Tap the Settings app icon, which resembles a gray box with gears on it."
    },
    {
      "title": "Tap Accessibility.",
      "content": "Tap Accessibility . It has an icon of a person in a circle."
    },
    {
      "title": "Tap Touch.",
      "content": "Tap Touch . This is in the Accessibility menu and has an icon of a hand."
    },
    {
      "title": "Tap AssistiveTouch.",
      "content": "Tap AssistiveTouch . This option is at the top of the Touch menu."
    },
    {
      "title": "Tap AssistiveTouch.",
      "content": "Tap AssistiveTouch . This will open the settings menu for AssistiveTouch."
    },
    {
      "title": "Tap the gray \"AssistiveTouch\" switch .",
      "content": "Tap the gray \"AssistiveTouch\" switch . The switch will turn green and you should see a gray square appear on your iPhone's screen. You’re now ready to use AssistiveTouch to take screenshots of Google Chrome on your iPhone!"
    },
    {
      "title": "Go to the page you want to screenshot.",
      "content": "Go to the page you want to screenshot. Open the Google Chrome website which you want to take a screenshot of."
    },
    {
      "title": "Tap the AssistiveTouch icon.",
      "content": "Tap the AssistiveTouch icon. It's a gray cube with a circle inside on your screen. Tapping it opens the AssistiveTouch menu."
    },
    {
      "title": "Tap Device.",
      "content": "Tap Device . You'll see this iPhone-shaped button on the right side of the AssistiveTouch menu."
    },
    {
      "title": "Tap More.",
      "content": "Tap More . This is at the bottom of the AssistiveTouch menu."
    },
    {
      "title": "Tap Screenshot.",
      "content": "Tap Screenshot . It's at the top of the AssistiveTouch menu. Doing so will take a screenshot of your Chrome contents, AssistiveTouch menu not included."
    },
    {
      "title": "Consider using your Android's screenshot function.",
      "content": "Consider using your Android's screenshot function. You can use your Android's screenshot feature to take a screenshot of your preferred Chrome page if you don't want to download an app to take the screenshot for you. Press the volume down button and power button at the same time to take a screenshot. [13] X Research source The screenshot shortcut varies by Android model. You can also try holding down the power button and selecting “screenshot.” [14] X Research source If you want to use an app instead, proceed with the rest of this method."
    },
    {
      "title": "Download the Screenshot Easy app.",
      "content": "Download the Screenshot Easy app. If you don’t want to use your Android's built-in screenshot functionality, you can download a screenshotting app. Screenshot Easy is a good choice: Open your Android's Play Store . Tap the search bar. Type in screenshot easy . Tap Screenshot Easy in the results menu. Tap INSTALL ."
    },
    {
      "title": "Open Screenshot Easy.",
      "content": "Open Screenshot Easy. Tap OPEN in the Google Play Store, or tap the camera-shaped Screenshot Easy app icon in your Android's App Drawer. When prompted, tap ALLOW to give Screenshot Easy access to your photos. You may be prompted to start capturing. If so, tap CANCEL before continuing."
    },
    {
      "title": "Tap the gray \"OVERLAY ICON\" switch .",
      "content": "Tap the gray \"OVERLAY ICON\" switch . The switch will turn blue, indicating that a camera-shaped icon will appear on your Android's screen even when the Screenshot Easy app is minimized."
    },
    {
      "title": "Tap START CAPTURE.",
      "content": "Tap START CAPTURE . It's a blue button at the top of the screen."
    },
    {
      "title": "Tap OK when prompted.",
      "content": "Tap OK when prompted. This turns on the screenshot feature for Screenshot Easy. On Samsung items, you'll tap START NOW here instead."
    },
    {
      "title": "Press the Home button.",
      "content": "Press the Home button. It's at the bottom of your Android's housing. Doing so minimizes the Screenshot Easy app."
    },
    {
      "title": "Open Google Chrome.",
      "content": "Open Google Chrome. Tap the Chrome app icon, which resembles a red, yellow, green, and blue ball."
    },
    {
      "title": "Go to the page you want to screenshot.",
      "content": "Go to the page you want to screenshot. Open the website, service, or item of which you want to take a screenshot."
    },
    {
      "title": "Tap the Screenshot Easy icon.",
      "content": "Tap the Screenshot Easy icon. It's the camera icon that should be in the top-left corner of the screen. Doing so will take your screenshot and, after a few seconds, open the screenshot in the Screenshot Easy app."
    },
    {
      "title": "Save your screenshot.",
      "content": "Save your screenshot. Once the screenshot opens, you can save the screenshot to your Android by doing the following: Tap ⋮ in the top-right corner of the screen. Tap Save . Tap Save as . Tap Android when prompted. Tap SAVE when prompted. View your screenshot by opening your Android's Photos or Gallery app and selecting the screenshot from the list of recent items. [15] X Research source"
    },
    {
      "title": "Disable the screenshot icon when done.",
      "content": "Disable the screenshot icon when done. When you're ready to turn off the screenshot icon, re-open the Screenshot Easy app, then tap STOP CAPTURE at the top of the screen. An ad will usually play after disabling the screenshot icon. You can skip the ad by minimizing or closing the Screenshot Easy app."
    }
  ]
}