{
  "url": "https://www.wikihow.com/Save-a-Google-Doc",
  "title": "5 Easiest Ways to Download or Save a Document in Google Docs",
  "steps": [
    {
      "title": "Open a document in Google Docs.",
      "content": "Open a document in Google Docs. If you want to save the Google Docs document to your computer, you can download it as a file. Google Docs automatically saves when you're connected to a Wi-Fi network. If it's fully synced, you'll see a cloud icon with a checkmark at the top toolbar."
    },
    {
      "title": "Click File.",
      "content": "Click File . This is in the top toolbar. A drop-down menu will open."
    },
    {
      "title": "Hover over Download.",
      "content": "Hover over Download . More options will appear."
    },
    {
      "title": "Select a file type.",
      "content": "Select a file type. In most cases, you'll want to save it as either a PDF document (.pdf) or a Microsoft Word document (.docx) . You can also download a file in OpenDocument Format (.odt), Rich Text Format (.rtf), Plain Text (.txt), Web Page (.html, zipped), or EPUB Publication (.epub). Depending on your web browser's settings, you may need to confirm the download or select a save location before your file will download. The file will be saved to your computer."
    },
    {
      "title": "Open the Google Docs app.",
      "content": "Open the Google Docs app. If you aren't already logged into your Google account, do so now. Use this method to download a Google Docs file to the iOS Files app."
    },
    {
      "title": "Tap ••• next to the document.",
      "content": "Tap ••• next to the document. This will open a pop-up menu."
    },
    {
      "title": "Tap Send a copy.",
      "content": "Tap Send a copy . This is below Copy link ."
    },
    {
      "title": "Select a format.",
      "content": "Select a format. On iOS, you can only save the document as a PDF (.pdf) or Microsoft Word (.docx) document."
    },
    {
      "title": "Tap OK.",
      "content": "Tap OK . It may take a few seconds to prepare the file."
    },
    {
      "title": "Tap Save to Files.",
      "content": "Tap Save to Files . You may need to pull up the menu to see this option. If you have another app you want to save it or send it to, tap the app from the list."
    },
    {
      "title": "Select a save location and tap Save.",
      "content": "Select a save location and tap Save . This is in the top-right corner. The Google Doc will be saved to your iPhone or iPad."
    },
    {
      "title": "Open the Google Docs app.",
      "content": "Open the Google Docs app. If you aren't already logged into your Google account, do so now."
    },
    {
      "title": "Tap ⋮ next to the document.",
      "content": "Tap ⋮ next to the document. This will open a pop-up menu."
    },
    {
      "title": "Tap Download.",
      "content": "Tap Download . This is in the drop-down menu. [1] X Research source If prompted, tap ' Allow to allow access to your Android's files. The file will be saved to your Android. You can find it in your Download folder."
    },
    {
      "title": "Open a document in Google Docs.",
      "content": "Open a document in Google Docs. You can use Google Docs in a browser at https://docs.google.com/ . If you aren't already logged into your Google account, do so now. Google Docs automatically saves when you're connected to a Wi-Fi network. If it's fully synced, you'll see a cloud icon with a checkmark at the top toolbar. Use this method to save a copy of a document to your own Google Drive, whether it's a document you created or shared by someone else."
    },
    {
      "title": "Click File.",
      "content": "Click File . This is in the top toolbar. A drop-down menu will open."
    },
    {
      "title": "Click Make a copy.",
      "content": "Click Make a copy . A new window will open."
    },
    {
      "title": "Enter a name (optional).",
      "content": "Enter a name (optional). If you don't enter a new name, it'll be \"Copy of [document title]\" by default. If desired, you can check the boxes for Share it with the same people and/or Copy comments and suggestions ."
    },
    {
      "title": "Click Make a copy.",
      "content": "Click Make a copy . This is the blue button at the bottom-right corner. A new tab will open with your new copy. If you don't need it, you can close it. You can find your new copy on your Google Docs home page."
    },
    {
      "title": "Open the Google Docs app.",
      "content": "Open the Google Docs app. If you aren't already logged into your Google account, do so now."
    },
    {
      "title": "Tap ••• next to the document.",
      "content": "Tap ••• next to the document. This will open a pop-up menu."
    },
    {
      "title": "Tap Make a copy.",
      "content": "Tap Make a copy . You may need to pull up the menu to see this option. The saved copy will open automatically. It will be saved to your Google Drive. You can find it on your Google Docs home page."
    }
  ]
}