{
  "url": "https://www.wikihow.com/Register-a-Company-in-Kenya",
  "title": "How to Register a Company in Kenya",
  "steps": [
    {
      "title": "Gather your Kenyan ID and make an eCitizen account online.",
      "content": "Gather your Kenyan ID and make an eCitizen account online. eCitizen is the online portal through which the Kenyan government conducts much of its official business. It’s free to use and easy to sign up for. When creating a personal account, you’ll need to type in your Kenyan ID number (found on government-issued identification) and your name. Also enter a working email address. [1] X Research source Start your eCitizen account online at: https://accounts.ecitizen.go.ke/en/register . Click on “Create an account” in the top-right corner. If you’re a foreign citizen living in Kenya, you can use your Foreigner Certificate number instead of your Kenyan ID number. A Kenyan company can have directors who live abroad and are not Kenyan citizens. At least one of the director will have to be a Kenyan citizen, though, so that they can access eCitizen and submit certain forms."
    },
    {
      "title": "Upload a 5.5 cm × 5.5 cm (2.2 in × 2.2 in) passport photo.",
      "content": "Upload a 5.5 cm × 5.5 cm (2.2 in × 2.2 in) passport photo . eCitizen requires you to upload a recognizable passport photo of yourself before registering your eCitizen account. Visit a drugstore or post office to have the photograph taken. When the photo is being taken, maintain a neutral expression and look directly into the camera. Take off a hat or glasses if you’re wearing a pair. Once you have a digital copy of the photo, upload it to the eCitizen portal to complete your profile. [2] X Research source The photo that you use needs to have been taken within 6 months of when you’re registering your company."
    },
    {
      "title": "Navigate to the Business Registration Service home page.",
      "content": "Navigate to the Business Registration Service home page. After creating your account, you can access the eCitizen online portal. Visit the eCitizen home page, and you’ll see that there are 3 agencies that you can login to: the National Safety and Transport Authority, Business Registration Service, and Department of Immigration Services. Select the Business Registration Service. [3] X Research source This will redirect you to the home page for the Business Registration Service. This page can only be accessed once you’ve created an eCitizen account. Prior to making the account, you cannot link directly to the Business Registration Service page."
    },
    {
      "title": "Begin your application by choosing a business type.",
      "content": "Begin your application by choosing a business type. Once you’re in the Business Registration Service, click on “Make Application.” On the next screen, click “Business Name Application.” From there, choose the type of business you’d like to create. [4] X Research source There are 6 main types of business entities in Kenya. These are: Sole proprietorships Registered companies (public or private) Partnership Limited liability partnership A branch office of a foreign registered company Business societies"
    },
    {
      "title": "Enter the name that you’d like your business to have.",
      "content": "Enter the name that you’d like your business to have. In the indicated field, type in the business’s intended name (e.g., Sally’s Print Shop or QuickFix Automotive Services). The name may be rejected if it is too close to the name of an already-registered Kenyan business. You should hear back from the Registration Service within 2 business days regarding if the name is acceptable or not. [5] X Research source If the name is accepted, the registrar will reserve the name for 30 days. You have this much time to complete the business registration."
    },
    {
      "title": "Pay the Kes.",
      "content": "Pay the Kes. 150 fee to file your name search. The Kenyan government requires potential business owners to pay a small fee to run the business-name search. You can pay online with a credit card. Enter your name and credit card number into the respective text boxes, and pay the fee to begin the name search. [6] X Research source The eCitizen site does not notify you via email once the name has been approved. So, you’ll need to log back in to your account on a daily basis to check if the approval has been granted. Kes. 150 is roughly equivalent to $1.50 USD."
    },
    {
      "title": "Fill out the company registration form CR1.",
      "content": "Fill out the company registration form CR1. Begin by writing the company’s name and the location of its business office. Form CR1 also asks for the names and other personal information of all of the directors and shareholders of your Kenyan company (including any who may live abroad). Scan a copy of the ID cards and color passport photos of all company directors and shareholders. Print these documents out and attach them to the completed form CR1. [7] X Research source If you have company directors who live outside of Kenya, also include a copy of their government-issued ID from the country that they reside in."
    },
    {
      "title": "Write out the company’s directors’ addresses on form CR8.",
      "content": "Write out the company’s directors’ addresses on form CR8. The Kenyan government requires businesses to provide the official residential addresses of the director or directors (including any directors who live outside of Kenya). Print out a copy of form CR8 and write in the name and business type of your company. Then write down the legal name and home address (not PO box) for all company directors. Sign and date the form to finalize it. [8] X Research source"
    },
    {
      "title": "State your businesses’ nominal capital holdings on form BN6.",
      "content": "State your businesses’ nominal capital holdings on form BN6. The KRA requires all new businesses to declare their capital holdings. On form BN6, fill in your business’s name and your own name. Then, under the corresponding text boxes, provide the amount of capital that your company possess in Kenyan shillings. If your company is publicly traded, also state how many shares the company’s capital holdings are divided into. [9] X Research source"
    },
    {
      "title": "Pay the Stamp Duty based on the amount of capital your company has.",
      "content": "Pay the Stamp Duty based on the amount of capital your company has. An agency called the Kenya Revenue Authority (KRA) oversees stamp duty collection. The KRA will reach out once your business name has been registered and instruct you how to pay the Stamp Duty. They’ll ask you to provide the Kenyan ID number of all of your company’s employees and shareholders. [10] X Research source The amount of money that you pay will be equal to 1% of your company’s nominal capital, but the minimum is Kes. 2,140 based on the minimum nominal capital of Kes. 2,000. As part of completing the Stamp Duty requirements, you’ll also be charged Kes. 100 for each document (i.e., each shareholder’s personal information) that the KRA must approve. Sending in the required information and paying the Stamp Duty should take between 5–10 days to complete."
    },
    {
      "title": "Draft a Memorandum and Article of Association to outline your business objectives.",
      "content": "Draft a Memorandum and Article of Association to outline your business objectives. The Kenyan government requires new businesses to file 2 documents which describe the objectives, rules, subscribers, and authorized share capital of your company: the Memorandum of Association and Article of Association. Draft these documents before filing your final registration paperwork. These documents are typically prepared by an advocate, but can also be drawn up by an administrative assistant or the company’s director. [11] X Research source The Memorandum of Association details your business’s name, location, its business object, states the value of each company share, and specifies how many shareholders the company has. The Article of Association contains the company’s rules and regulations. It lists each member’s liability, the powers of the company directors, the rights of all company members, and how directors are to be appointed and removed from their position. Take a look at a sample Article of Association online at: https://ag.ecitizen.go.ke/index.php?id=9 ."
    },
    {
      "title": "File the completed forms and pay the fee at a Kenyan Registrar’s office.",
      "content": "File the completed forms and pay the fee at a Kenyan Registrar’s office. Collect the CR1, CR8, and BN6 forms as well as the Memorandum and Article of Association (along with all accompanied scanned and copied documents) and seal them in a large envelope. Mail these documents to the Registrar’s office. Or, if you live in Nairobi, deliver them to the Business Registration department in person. [12] X Research source To finish registering your company, you’ll also need to pay the mandatory fee of Kes. 10,650 either through the eCitizen portal or by check or credit card at the Registrar’s office. Mail or deliver the forms to: The Chief Registrar of The Judiciary Supreme Court Building P.O. Box 30041 (00100) Nairobi, Kenya"
    },
    {
      "title": "Download your business certificate from the eCitizen platform.",
      "content": "Download your business certificate from the eCitizen platform. The Kenyan government will take roughly 1 week to review all of the forms that you’ve sent in, make scans and copies, and register your business with the KRA. Once everything has been approved and your business is officially registered, the business certificate will be posted online in your eCitizen portal. [13] X Research source The amount of time this takes can vary. You may need to wait for a period of about 21 days. With the business certificate in-hand, you’re ready to begin running your business in Kenya!"
    }
  ]
}