{
  "url": "https://www.wikihow.com/Shampoo-a-Carpet",
  "title": "How to Properly Shampoo Your Carpet",
  "steps": [
    {
      "title": "Move all your furniture off the carpet.",
      "content": "Move all your furniture off the carpet. Anytime you shampoo carpet, take all of your furniture completely out of the room if possible. If you’re limited for space and not able to move it out of the room, then shift the furniture all to the side of the room with the least amount of stains or dirt. Find a temporary spot to keep small pieces of furniture and any other clutter from the room. [1] X Research source If you can’t or don’t want to move large pieces of furniture, place squares of aluminum foil or plastic film under the legs or bases to protect them from moisture."
    },
    {
      "title": "Vacuum the room thoroughly.",
      "content": "Vacuum the room thoroughly. Run your vacuum through the room to remove larger dirt, hair, and dust balls so it doesn’t get caught in the shampooer. Go in straight lines up and down the room and then go over the area again in the opposite direction. Your vacuum will also fluff the carpet up, which helps the shampoo reach deep into the fibers so it’s more effective. [2] X Research source As you vacuum, look for stains and set a sticky note or marker of some kind on the spot so you can easily find and pretreat it before shampooing. If you want to clean your carpet without a machine sprinkle some powder carpet cleaner before you vacuum. Let it sit for at least 30 minutes before vacuuming it up. [3] X Research source"
    },
    {
      "title": "Pretreat carpet stains",
      "content": "Pretreat carpet stains with a stain remover . If you’re dealing with a fresh stain, blot up as much as you can with a clean white towel. Spray the stain with the remover and let it sit for a minute or two according to the directions on the package. Blot the stain again with another clean cloth to lift up as much of the stain as possible. Treat all of the stains on your carpet so the shampooer can wash them out more easily. [4] X Research source Test your stain remover on an inconspicuous spot on your carpet first to ensure it doesn’t change the color. To treat stains naturally, try using baking soda or spraying the stain with a solution made from equal parts water and distilled white vinegar. [5] X Research source"
    },
    {
      "title": "Read the instructions for your shampooer.",
      "content": "Read the instructions for your shampooer . Buy a shampooer or rent one for the day from your local hardware store. There are a variety of shampooers and carpet cleaners, and they each work a little differently, so always read through the manual before you start. Some shampooers work if you push them forward like a vacuum. [6] X Research source Others may require you to walk backward and pull the shampooer along with you. [7] X Research source If your shampooer rental didn’t come with instructions, look up the brand and model name online along with “instructions” or “tutorial.” You may find a manual or helpful video online specifically for your cleaner. Before you get a shampooer, check if it's been verified by the Carpet and Rug Institute (CRI), which ensures the machine meets carpet cleaning standards. Machines that aren’t certified may not clean as effectively."
    },
    {
      "title": "Fill the shampooer’s water tank with warm water.",
      "content": "Fill the shampooer’s water tank with warm water. Locate the clean water tank on your shampooer, and open the fill valve. Use a cup or pitcher to pour warm water into the tank until you reach the max fill line. After that, close the fill valve. [8] X Research source Some shampooers have a removable water tank so it’s easier to fill."
    },
    {
      "title": "Add carpet shampoo to the water tank or soap compartment.",
      "content": "Add carpet shampoo to the water tank or soap compartment. Choose a soap that’s designed to work with the shampooer you have because not every soap will work with every machine. Pour only the amount of soap that is directed, which is usually about 1 ⁄ 2 cup (120 ml) per 1 US gal (3.8 L) of water. [9] X Research source If your shampooer has a separate soap compartment, pour the shampoo into it. Otherwise, add the shampoo directly to the clean water tank. [10] X Research source Most shampooers work well without soap and will still flush dirt and stains out of the carpet. Only use the recommended amount of soap listed in the cleaner’s manual. Spot-test the shampoo in an inconspicuous spot of your carpet before putting it into your shampooer. Make sure it doesn’t cause any damage or color-bleeding"
    },
    {
      "title": "Pull the shampooer in a straight line to wash your carpet.",
      "content": "Pull the shampooer in a straight line to wash your carpet. Start in the corner of your room furthest from the entryway so you don’t walk over an area you just cleaned. Hold down the button on the handle and slowly pull the shampooer backward in a straight line. Go slowly so the cleaner moves about 1 foot (30 cm) every 1–2 seconds so the shampoo and brushes have time to scrub the carpet fibers. Let go of the button when you’re about 6 inches (15 cm) from the opposite wall. [11] X Research source"
    },
    {
      "title": "Work across the room in long, overlapping strips.",
      "content": "Work across the room in long, overlapping strips. When you reach the wall on the opposite side of the room, turn around, move the shampooer over so it slightly overlaps the strip you just cleaned, and walk back toward the wall where you started. Keep pulling the shampooer in long strips until you reach the entryway [12] X Research source Shampooers are not meant to be pulled back and forth in a random pattern like vacuums, so making straight lines across the room will give you a deeper clean."
    },
    {
      "title": "Listen for the shampooer getting louder to know when it’s empty.",
      "content": "Listen for the shampooer getting louder to know when it’s empty. As you run your shampooer, it will suck up all the dirt and water into a separate tank. Listen for the shampooer’s motor to get louder, which is a sign the float valve in the dirty water tank has engaged and filled up. Stop shampooing immediately so you don’t damage the machine. [13] X Research source The shampooer might also have a visible light or gauge that shows you that the dirty water tank is full. Alternatively, watch the water levels of the clean and dirty tanks, and stop if you’re almost out of clean water."
    },
    {
      "title": "Empty the dirty water tank into the toilet or outside when it’s full.",
      "content": "Empty the dirty water tank into the toilet or outside when it’s full. Disconnect the dirty water tank from your shampooer and carefully carry it outside or to your bathroom. Since the water can be really dirty or have bad odors, flush it down your toilet or pour it on the ground outside. Rinse the dirty water tank out before reattaching it to your shampooer. [14] X Research source If you’re not finished cleaning your carpet yet, refill the shampooer with more water and carpet cleaner. Depending on the size of your room, you may have to refill the tank multiple times. [15] X Research source To get your carpets the cleanest, run your shampooer over the same strip of carpet until the water looks clear in the tank."
    },
    {
      "title": "Run the shampooer a second time with cold water and no soap.",
      "content": "Run the shampooer a second time with cold water and no soap. Your shampooer may leave behind some soap or dirt after you run it, so fill the tank with clean, cold water and skip the carpet shampoo. Pull the shampooer over your carpet to make a second pass over the entire room to rinse out all of the leftover residue and remaining dirt. [16] X Research source Cold water helps prevent the soap from foaming up again. Take off your shoes and socks this time around so you don’t leave any dirt on the freshly cleaned carpet."
    },
    {
      "title": "Let your carpet dry for 6–10 hours before moving furniture back in.",
      "content": "Let your carpet dry for 6–10 hours before moving furniture back in. Avoid walking on your carpet while it’s drying so it stays clean. Turn on an overhead fan, open windows, or place fans around the room to help increase the airflow and speed up your drying time. Once the carpet is completely dry, move your furniture back into the room. [17] X Research source If you put furniture back on wet carpet, it can leave indentations and create mildew. Your carpet will dry faster during warm weather, but may take longer if there’s high humidity. If you still see a little soap residue leftover after your carpet dries, do a final pass with your vacuum to suck it up."
    },
    {
      "title": "Rinse and empty both tanks of the shampooer.",
      "content": "Rinse and empty both tanks of the shampooer. After your final pass, dump any remaining water out of both water tanks. Rinse the water tanks out thoroughly so that no grime remains in them. If the tank has a cap of any kind, leave it off for a day or two to allow the excess water to completely evaporate. [18] X Research source Emptying the tanks all the way keeps mildew from growing and keeps the machine in top working order."
    }
  ]
}