{
  "url": "https://www.wikihow.com/Print-from-Your-iPhone",
  "title": "2 Simple Ways to Print Photos and Documents from an iPhone",
  "steps": [
    {
      "title": "Make sure you have an AirPrint-supported printer.",
      "content": "Make sure you have an AirPrint-supported printer. Check your printer's manual or manufacturer's website to double-check its capabilities. Your printer and your phone must be connected to the same Wi-Fi network. [1] X Research source If you don't own an AirPrint-compatible printer, you can still use AirPrint by finding a network that has an AirPrint-supported printer at your workplace, school, etc. Avoid printing documents with sensitive information in public places. Your printer may need to be set up before you can print wirelessly. Since this process will vary depending on your printer model, consult your printer's manual to see what you need to do to set up your printer."
    },
    {
      "title": "Open an app that supports AirPrint.",
      "content": "Open an app that supports AirPrint. Most apps from Apple fit this category, including Mail, Safari, and Photos. You can also print emails, documents, and pictures from your Files app . For example, open Photos to print a photo from your Camera Roll."
    },
    {
      "title": "Select the item you want to print.",
      "content": "Select the item you want to print. If you're in the Photos app, tap a photo. If you're in the Mail or Files apps, click on a document or file."
    },
    {
      "title": "Tap \"Share\".",
      "content": "Tap \"Share\". This icon and location may look different depending on the app. You may also see a left-facing arrow or ••• ."
    },
    {
      "title": "Scroll down and tap Print.",
      "content": "Scroll down and tap Print . This may also look like a printer icon. If you don't see this option, make sure you're using an app that supports AirPrint."
    },
    {
      "title": "Tap Printer.",
      "content": "Tap Printer . This is at the top of the menu. A pop-up menu will open with available printers."
    },
    {
      "title": "Tap the AirPrint-enabled printer.",
      "content": "Tap the AirPrint-enabled printer. This should be in the list. If you don't see your printer, make sure the printer is on the same Wi-Fi network as your iPhone. You can also bring your iPhone closer to the printer."
    },
    {
      "title": "Edit the printing options.",
      "content": "Edit the printing options. Use the - and + buttons to specify the number of copies you want to print. You can also adjust the Paper Size, Orientation, Scaling, and Layout."
    },
    {
      "title": "Tap Print.",
      "content": "Tap Print . This is in the top-right corner. The file will begin to print from your iPhone. To view your print job, swipe up or double-press the Home button to open the App Switcher. Navigate to the Print Center app. To cancel a print job, tap it in the Print Order list. Then, tap Cancel Printing . Check out tips about printing from an iPhone on wikiHow’s “How do you print easily from an iPhone?\" forum page ."
    },
    {
      "title": "Download the printing app for your printer.",
      "content": "Download the printing app for your printer. Open the App Store and search for your printer's app. Most popular printers have a dedicated app, such as: HP Smart Canon PRINT Epson iPrint Brother Mobile Connect"
    },
    {
      "title": "Set up your printer app.",
      "content": "Set up your printer app. While this process will vary based on the app you downloaded and the printer you're using, most cases will involve making sure your printer is online, adding the printer to your phone's app, and setting up preferences (e.g., default printing in black-and-white or color)."
    },
    {
      "title": "Select a print option.",
      "content": "Select a print option. Most printer apps will have dedicated icons for documents, photos, etc. Tap the one you want to print. A browsing menu should open."
    },
    {
      "title": "Select the item you want to print.",
      "content": "Select the item you want to print. Use the printer app to navigate to the file in your iPhone, and then tap it to open it."
    },
    {
      "title": "Edit the printing options.",
      "content": "Edit the printing options. This will vary depending on the app. Adjust the number of copies, orientation, color options, and more. Some printer apps may allow you to edit the photo within the app itself."
    },
    {
      "title": "Tap Print.",
      "content": "Tap Print . After editing, select the Print button or icon to send the print job to your connected printer."
    },
    {
      "title": "Use a Bluetooth adapter.",
      "content": "Use a Bluetooth adapter. This adapter can add Bluetooth capabilities to a non-Bluetooth printer. When the adapter is installed, connect your printer and iPhone to the same Wi-Fi network. You should be able find the printer in the AirPrint menu."
    },
    {
      "title": "Use a wired USB adapter.",
      "content": "Use a wired USB adapter. If your iPhone isn't connecting to your printer via Bluetooth, you can try connecting it directly. You'll need to purchase a Lightning to USB or USB-C to USB. Plug one end into your phone and the other end into your printer. Open a photo or file and tap Share → Print → select your printer → Print ."
    },
    {
      "title": "Update your iPhone.",
      "content": "Update your iPhone. If you're running an older version of iOS, you may have trouble connecting via AirPrint or Bluetooth. To update : Go to Settings . Tap General . Tap Software Update . Tap Download and Install ."
    }
  ]
}