{
  "url": "https://www.wikihow.com/Measure-Your-Neck-Size-and-Sleeve-Length",
  "title": "Measuring Neck Size & Sleeve Length for a Perfect Dress Shirt Fit",
  "steps": [
    {
      "title": "Wrap a measuring tape around your neck.",
      "content": "Wrap a measuring tape around your neck. Position the tape about one inch from where your neck meets your shoulders. This may also coincide with the bottom part of your Adam's apple. [1] X Research source Take your measurement with a length of string or ribbon if you don’t have a flexible measuring tape. Then, measure the string with a ruler or yardstick."
    },
    {
      "title": "Hold the tape tight against your skin.",
      "content": "Hold the tape tight against your skin. Come fully around the neck, leaving no extra space between your neck and the tape. Don't pull too tightly to avoid creating unnecessary tension; just enough so you get a true measurement. Make sure the tape is level and not held at an angle."
    },
    {
      "title": "Note the number where the measuring tape meets.",
      "content": "Note the number where the measuring tape meets. This is the actual neck size . The dress shirt size will be half an inch bigger. [2] X Research source For example, if you measure your neck to be exactly 15 inches (38 cm) around, then your dress shirt size will be 15½ inches (39.5 cm). If you measured on a 1/4 inch/centimeter, then round up to the nearest 1/2 inch/centimeter. For example, if your neck size was 16.25, round up to 16.5. Your neck size should range between 14 - 19 inches or 35.5 - 48.3 centimeters."
    },
    {
      "title": "Stand with your arms at your sides.",
      "content": "Stand with your arms at your sides. To get the proper sleeve measurement, hold your arms slightly bent. Place your fingers tucked into the front pockets of your pants."
    },
    {
      "title": "Place your measuring tape in the middle of your upper back.",
      "content": "Place your measuring tape in the middle of your upper back. The proper placement is slightly below the nape of your neck. Pew says, “For sleeve measurement…there's the department store way that you use for checking your shirt size. And that measure is from the nape of the neck, down across the point of the shoulder, and then down the arm to where the sleeve should hit.” [3] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021. If you’re unable to reach this spot, ask a friend to help you take this measurement."
    },
    {
      "title": "Take the measurement between your upper back and shoulder.",
      "content": "Take the measurement between your upper back and shoulder. Measure the length from the middle of the upper back to the stitching at the shoulder of your shirt. Write this measurement down, as you will need it later."
    },
    {
      "title": "Take your shoulder-to-wrist measurement.",
      "content": "Take your shoulder-to-wrist measurement. Measure the length from the top stitching on your shoulder to the bottom of your wrist. Aim for hitting your wrist bone with the measuring tape. Be careful not to measure too high above the wrist, or the dress shirt's sleeves will be too short. [4] X Research source"
    },
    {
      "title": "Add the measurements to determine your sleeve length.",
      "content": "Add the measurements to determine your sleeve length. Add the measurement between your upper back and shoulder to the shoulder-to-wrist measurement. This will give you your sleeve length. Pew says, “I usually like to be a little generous with that measurement. Because if you get it exactly right on there, when you reach forward, your shirt sleeves are gonna pop way up.” [5] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021. The value should range anywhere from about 32 - 37 inches (81.3 - 94 cm). [6] X Research source The neck and sleeve length will be enough to find the right fit for most ready-to-wear or pre-made shirts."
    },
    {
      "title": "Take your upper arm and wrist measurements for tailored shirts.",
      "content": "Take your upper arm and wrist measurements for tailored shirts. If you’re having your shirt tailored, you need to measure around your biceps (or upper arm) and wrist. Including these measurements will give your shirt the most precise fit so you can really dress to impress . Measuring Your Biceps: Stand in a relaxed posture with your arm hanging down at your side. [7] X Research source Wrap the tape measure around your upper arm at the largest part, usually near your armpit. Don’t flex or pull the tape too tightly. Note the number and then round it up to the nearest half inch (1.27 cm) for the correct measurement. For example, if your measurement is 13.25 inches (33.7 cm), round up to 13.5 inches (34.3 cm). Measuring Your Wrist: Wrap the tape measure around your wrist just above the wrist bone. [8] X Research source Hold the tape tight, but not so tight that it cuts into your skin. Note the number. This is your wrist measurement. Do not add any extra."
    },
    {
      "title": "Shoulder width",
      "content": "Shoulder width Use a tape measure to determine the width between the outer edges of your shoulders for a tailored fit. Take this measurement wearing a shirt that fits you well. Due to the location of the measurement, you may need help from a friend. Stand up straight, looking straight ahead, with your arms and shoulders relaxed. Placing the end of the tape where the shoulder meets the arm, measure across the back to the same spot on the opposite arm. [9] X Research source When measuring, make a gentle arc over the tops of the shoulder blades. Note your measurement so it’s easy to compare to a manufacturer’s size chart."
    },
    {
      "title": "Chest",
      "content": "Chest This measurement helps you find the right size and fit so your shirt won’t be too baggy around the chest or have gaping buttons. Take this measurement while wearing a thin, well-fitted t-shirt for the best results. Pew recommends, “To measure the chest of a person, man or woman, you need to go across the broadest part. So, for either a man or a woman, that will incorporate going over the shoulder blades.” [10] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021. Wrap a tape measure around the fullest part of your chest, usually right up under the armpits, with the tape measure running over your shoulder blades in the back. Then, note your measurement. [11] X Research source Make sure your arms are relaxed. Don’t puff out your chest or arch your back."
    },
    {
      "title": "Shirt length",
      "content": "Shirt length If you’re taller than average or have a long torso, it’s useful to know what length of shirt works best for you. Determine this by measuring from the base of your neck to where you would like the shirt to end. There’s no perfect place where the shirt hits. In most cases, the shirt will be tucked in, so you want enough to tuck it in comfortably but not so much that it’s bunched in the top of your pants. Ask a friend to help you measure since this measurement is taken along your back. Place the end of the measuring tape at the center of the base of your neck. Measure along the spine to the desired shirt length. If the shirt is tucked in, this is usually at the bottom of the buttocks. For a shirt that will be worn untucked, subtract 2 inches (5 cm) from the measurement to the bottom of the buttocks. [12] X Research source"
    },
    {
      "title": "Use your measurements to determine the correct shirt size.",
      "content": "Use your measurements to determine the correct shirt size. Men's shirt sizes come in a two-part number. [13] X Research source When choosing a men’s shirt , the first number on the shirt's tag is the neck measurement, and the second is the sleeve measurement. For example, a shirt may be sized as 16/34, meaning a 16 neck size and a 34 sleeve length. Use both your neck and sleeve measurements to find the right size."
    },
    {
      "title": "Compare your measurements to a ready-to-wear size.",
      "content": "Compare your measurements to a ready-to-wear size. If the shirts you are browsing don't offer an exact measurement but rather the traditional \"small,\" \"medium,\" or \"large\" options, you can use your measurements to find the equivalent in this style of sizing. When in doubt about your size, it’s better to choose a shirt that’s a little large than a shirt that’s too small. A tailor can alter a larger shirt using your measurements for a perfect fit. [14] X Research source Men’s sizing is not universal. Check each manufacturer’s website for the specific measurements of their clothing. Sizing typically corresponds to the following: [15] X Research source Small: neck size of 14–14.5 in (36–37 cm), sleeve length of 33 in (84 cm), chest size of 35–37 in (89–94 cm), and waist size of 29–31 in (74–79 cm). Medium: neck size of 15–15.5 in (38–39 cm), sleeve length of 34 in (86 cm), chest size of 38–40 in (97–102 cm), and waist size of 32–34 in (81–86 cm). Large: neck size of 16–16.5 in (41–42 cm), sleeve length of 35 in (89 cm), chest size of 41–43 in (100–110 cm), and waist size of 35–37 in (89–94 cm). Extra-Large: neck size of 17–17.5 in (43–44 cm), sleeve length of 36 in (91 cm), chest size of 44–46 in (110–120 cm), and waist size of 38–40 in (97–102 cm)."
    },
    {
      "title": "Classic Fit",
      "content": "Classic Fit Also referred to as a Regular fit, this is the traditional fit for dress shirts. It has a comfortable, boxy fit with plenty of room in the sleeves. There are often two pleats near the back yoke of the shirt to allow more freedom of movement. [16] X Research source This style has been around for several decades and is offered by most menswear retailers. The Classic fit is the most comfortable style if you wear a jacket over your dress shirt. A Modern-fit shirt is cut a little slimmer than a Classic shirt but not as narrow as a Slim-fit shirt."
    },
    {
      "title": "Slim Fit",
      "content": "Slim Fit The Slim-fit dress shirt has become more popular for men who want to look classy wearing a dress shirt without a jacket, which has become more acceptable. It’s tailored with less fabric than the Classic fit, and features back darts and high armholes. This gives the shirt a sleeker look without being skin-tight. [17] X Research source This fit is very similar to an Athletic or Fitted shirt style. A Super Slim fit is cut even narrower than the Slim fit, and is usually best for slimmer men who have a hard time finding shirts that fit properly."
    }
  ]
}