{
  "url": "https://www.wikihow.com/Remove-Newfolder.Exe-Virus",
  "title": "How to Remove Newfolder.Exe Virus",
  "steps": [
    {
      "title": "Open the Command Prompt.",
      "content": "Open the Command Prompt. Go to \"Start\" and search \"cmd\" without quotation marks. Click \"Run.\" This will cause a black window to appear."
    },
    {
      "title": "Enter the following commands one by one.",
      "content": "Enter the following commands one by one. These will delete the preliminary stages of the virus. [1] X Research source taskkill /f /t /im “New Folder.exe” taskkill /f /t /im “SCVVHSOT.exe” taskkill /f /t /im “SCVHSOT.exe” taskkill /f /t /im “scvhosts.exe” taskkill /f /t /im “hinhem.scr” taskkill /f /t /im “blastclnnn.exe”"
    },
    {
      "title": "Enable Task Manager and Regedit.",
      "content": "Enable Task Manager and Regedit. Because one of the symptoms of the Newfolder.exe virus is disabling things like Task Manager and Regedit, you will need to reenable them after you delete the virus. You can do this by entering the following commands one by one: [2] X Research source reg add HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System /v DisableTaskMgr /t REG_DWORD /d 0 /f reg add HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System /v DisableTaskMgr /t REG_DWORD /d 0 /f reg add HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System /v DisableRegistryTools /t REG_DWORD /d 0 / reg add HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System /v DisableRegistryTools /t REG_DWORD /d 0 /f"
    },
    {
      "title": "Enable \"View Hidden Files.\"",
      "content": "Enable \"View Hidden Files.\" To do this, go to the \"Start Menu\" and select \"Control Panel.\" From here, go to \"Appearance and Personalization\" and then \"Folder Options.\" Select \"View Tab,\" \"Advanced Settings,\" and finally \"Show Hidden Files, Folders, and Drives\". Click \"OK.\""
    },
    {
      "title": "Delete the following files one by one.",
      "content": "Delete the following files one by one. These will delete the rest of the virus. [3] X Research source C:\\WINDOWS\\SCVVHSOT.exe C:\\WINDOWS\\SCVHSOT.exe C:\\WINDOWS\\hinhem.scr C:\\WINDOWS\\system32\\SCVHSOT.exe C:\\WINDOWS\\system32\\blastclnnn.exe C:\\WINDOWS\\system32\\autorun.ini C:\\Documents and Settings\\All Users\\Documents\\SCVHSOT.exe"
    },
    {
      "title": "",
      "content": "Find and download a Newfolder Removal Tool. If you feel uncomfortable removing the virus manually, there are several free tools that you can employ instead. Newfolder Removal Tool is the most recommended option because it is free, easy to download, and has high success rates. To download the tool, simply go to http://www.new-folder-virus.com and select the download option."
    },
    {
      "title": "Run the tool.",
      "content": "Run the tool. This may take anywhere from ten to thirty minutes to run fully. It will then show you all of the files associated with the virus. Select “Next” in order to remove them."
    },
    {
      "title": "Fix your Registry.",
      "content": "Fix your Registry. Viruses and Malware affect your registry and you can fix it by following the methods outlined in the fix your computer registry for free."
    }
  ]
}