{
  "url": "https://www.wikihow.com/Paint-Your-Nails-for-School-if-You-Are-a-Guy",
  "title": "How to Paint Your Nails for School if You Are a Guy",
  "steps": [
    {
      "title": "Select a polish color that you can wear confidently.",
      "content": "Select a polish color that you can wear confidently. While darker shades like black, gray, or navy blue are popular colors for guys to wear, there’s no reason to restrict yourself to these shades. Painting your nails is a fun way to express yourself, so take some risks: [1] X Research source If you want to channel school spirit, paint your nails alternating school colors. You can start with just one hand, or fully commit and alternate nail colors on both hands. Coordinate the color of your nails with an outfit of your choice. You could even match your nails with your shoes or jacket."
    },
    {
      "title": "Pick a darker color for more eye-catching nails.",
      "content": "Pick a darker color for more eye-catching nails. Generally, darker shades of polish will be more noticeable. If you want people to notice your nails, try a bold color, such as black, navy blue, or green. On the other hand, if you prefer a less noticeable color, choose light shades that are close to your nail color."
    },
    {
      "title": "Paint your nails with a bold, statement-making shade.",
      "content": "Paint your nails with a bold, statement-making shade. Bold or bright colors like red and yellow will catch everyone’s attention. If you’re interested in matching different bold colors of nail polish, consult a color wheel to see which colors will look good together. Or you could deliberately clash colors, if that’s more of your aesthetic. For example, you could paint your left-hand nails blue, and your right-hand nails orange. These complimentary colors will look good together. If you’d like to clash colors, try painting some nails purple and other nails red. To really draw people’s eye, you could paint every nail a different bold color."
    },
    {
      "title": "Pick a transparent or clear lacquer for subtler nails.",
      "content": "Pick a transparent or clear lacquer for subtler nails. If you want to ease into painting your nails or aren’t comfortable starting with a bright, bold color, begin with a transparent polish. [2] X Research source A transparent peach or light brown color (depending on your skin tone) will not be obvious, but will add a pop of color to your nails. If you’d rather avoid color altogether, a single layer of clear nail polish will still add a noticeable sheen to your nails."
    },
    {
      "title": "Wash your fingernails with soap and water.",
      "content": "Wash your fingernails with soap and water. Your nails need to be washed clean before you begin to paint them, otherwise the polish will stick to small flecks of dirt, rather than your nail. Also, clean out any dirt from underneath your nails so it won’t stick to the nail polish once you apply it. Make sure your nails are trimmed at the length you want them. [3] X Research source For a more precise manicure, use a cuticle tool to push back your cuticles ."
    },
    {
      "title": "Swab your nails with nail polish remover.",
      "content": "Swab your nails with nail polish remover. Soak a clean cotton ball in nail polish remover, and swipe the cotton ball over each of your fingernails. Nail polish remover will clean your fingernails of any grease or oils that the soap and water may not have removed. [4] X Research source You can use either acetone or non-acetone polish remover for this step. Wash your hands again to clean off allow the nail polish remover. If you don’t clean this off, the polish may not stick well to your nails."
    },
    {
      "title": "Apply a base coat to your nails.",
      "content": "Apply a base coat to your nails. Before applying the color you’ve chosen, start with a base coat. This will ensure that the polish stays on your nails for as long as possible. The base coat will adhere firmly to your nails and will give the polish a soft surface that it can easily stick to. Wait a few minutes for the base coat to dry before applying the polish. You can use a clear or base coat nail polish. Either will be available at any drug store or nail salon. For a more vibrant color overall, you can even use white nail polish as a base coat. [5] X Research source"
    },
    {
      "title": "Paint each nail in three smooth strokes.",
      "content": "Paint each nail in three smooth strokes. Apply one stroke to the left side of each nail, one stroke to the center, and one stroke to the right side. This method will help you avoid getting polish on the skin next to your nails. [6] X Research source Paint the nails of one hand and wait for them to dry before continuing onto the other hand. It's better to apply your polish in 3 strokes rather than 2—this gives you more of control over the polish."
    },
    {
      "title": "Clean any excess polish off of the skin around your nail.",
      "content": "Clean any excess polish off of the skin around your nail. When painting your nails, try not to get any nail polish on the skin around your nail. If that does happen, immediately wipe it with a cotton ball soaked in nail polish remover. Do this on a nail-by-nail basis, before the paint has dried. Otherwise, it’ll be much harder to clean off the dried polish from your skin. You can also use a small angled brush or round brush to apply the acetone."
    },
    {
      "title": "Apply a second coat of nail polish.",
      "content": "Apply a second coat of nail polish. If you want your nails to be a darker color, or if you want the polish to be more opaque, add another layer of polish. As before, paint each nail using three full strokes. Be careful, though; if you add too much polish, it will start to lump together on your nails and you’ll have to start over. Once you’ve painted a second layer of paint onto your nails, wait for them to dry."
    },
    {
      "title": "Apply a slow-setting topcoat.",
      "content": "Apply a slow-setting topcoat. Once your layer(s) of polish have dried, apply topcoat over each nail. Topcoat will dry to form a hard, protective finish. This way, your nail polish won’t be scratched off the first time you bump your fingers against a hard surface. [7] X Research source Both slow- and fast-setting topcoats will be available at a local drugstore or salon. Opt for the slow-setting; it will give your nails better protection and keep the colors bright for longer."
    },
    {
      "title": "Rock your look with confidence.",
      "content": "Rock your look with confidence. Nail polish is a fun way to add extra flair or style to your look, and is a great way to make yourself feel bold and stylish. [8] X Research source Even if most of your male friends don’t paint their nails, you can still wear the look confidently. Who knows, you may even start the next trend at your school!"
    },
    {
      "title": "Ignore bullies, or ask them to stop harassing you.",
      "content": "Ignore bullies, or ask them to stop harassing you. If you’re being harassed because you chose to paint your nails, you don’t have to change your behavior or stop painting them. If a bully makes snide comments about you behind your back or in a non-aggressive way, it’s best to ignore them. However, if the harassment has continued for months or if the bully gets in your face, calmly ask them to leave you alone and stop hassling you. [9] X Research source Say something like: “Leave me alone please. The things you’re saying about me are rude and hurtful, why don’t you mind your own business.” “The fact that I paint my nails is none of your business. I want you to stop making fun of me.” If you get angry and react with hostility, it will often motivate the bully to harass you more. Talk to a school counselor or to your parents for advice on how to handle the bullies ."
    }
  ]
}