{
  "url": "https://www.wikihow.com/Put-Sprinkles-on-the-Side-of-a-Cake",
  "title": "How to Put Sprinkles on the Side of a Cake",
  "steps": [
    {
      "title": "Place your cake on a baking tray to catch fallen sprinkles.",
      "content": "Place your cake on a baking tray to catch fallen sprinkles. The baking tray will contain the sprinkles as you apply them to the cake. It will be easier to apply the sprinkles to an elevated cake, so if you have a cake stand, rest your cake on that, and then set the stand in the baking tray. [1] X Research source Make sure that the cake is completely cooled before applying the icing; otherwise, the sugar coating will melt. [2] X Research source"
    },
    {
      "title": "Apply a thin layer of your chosen icing around the cake to seal the crumbs.",
      "content": "Apply a thin layer of your chosen icing around the cake to seal the crumbs. This is called a crumb-coat and it helps to give your icing a smoother appearance. Having a smooth icing surface will make distributing the sprinkles on the cake easier for all application methods. Cover the cake with buttercream icing, ganache, or your favorite flavor of frosting. Just make sure that the layer is thin and evenly displaced. Use an icing or frosting that’s room temperature so it’ll spread easily."
    },
    {
      "title": "Allow the crumb-coat to chill in the refrigerator for 20 minutes to harden.",
      "content": "Allow the crumb-coat to chill in the refrigerator for 20 minutes to harden. Some icings, like a thin ganache, may take less time to set, but other icings, like a thick buttercream, may take longer. After 20 minutes, gently tap the outside of the cake with a clean hand to see if the frosting has hardened. If the frosting is still tacky, let the cake chill for another 5 minutes before taking it out of the refrigerator."
    },
    {
      "title": "Cover your cake with a second, thicker layer of icing.",
      "content": "Cover your cake with a second, thicker layer of icing. It is easiest to apply most coatings with an offset spatula. Continue to coat the cake evenly until you reach a desired thickness of icing. Freshly applied icing will create a sticky surface for the sprinkles to adhere to. [3] X Research source If you are planning to roll your cake in the sprinkles, do not frost the top of the cake as you will have to hold the bottom and top of the cake to roll it. [4] X Research source If you want to use fondant , cover the cake with fondant as you normally would."
    },
    {
      "title": "Choose sprinkles that will complement the icing and the cake flavor.",
      "content": "Choose sprinkles that will complement the icing and the cake flavor. Draw inspiration from some of the ingredients in your cake. If your cake has candied cherries in it, accent the outside with a white icing and vibrant red sprinkles. Also, note the color of your icing. Sprinkles that are a dark color may not be as noticeable against a dark chocolate icing as they would against a vanilla icing. [5] X Research source Pick sprinkles colors that complement seasonal and holiday cakes. Choose a mixture of orange, purple, and black sprinkles to decorate a pumpkin spice cake during the fall or around Halloween. Think about using red, pink, and white sprinkles for anniversaries or Valentine’s Day. Use nonpareils for a speckled rainbow look, or ovular jimmies for bigger splotches of color. Mix both sprinkle styles together to vary the visual texture. Use large confetti sprinkles or sugar coated chocolate sprinkles for a minimalist look or mix them with smaller sprinkles to make them stand out."
    },
    {
      "title": "Pour the sprinkles into a shallow bowl to apply them easily.",
      "content": "Pour the sprinkles into a shallow bowl to apply them easily. You will need to apply the sprinkles before the second layer of icing hardens. If the bowl is too deep, you may not be able to quickly reach in and grab the sprinkles. [6] X Research source Start with at least 1-2 cups (176-352 g) of sprinkles, and then pour more in your bowl later if needed. This should densely cover the entire cake."
    },
    {
      "title": "Pat a handful of sprinkles onto the base of the cake.",
      "content": "Pat a handful of sprinkles onto the base of the cake. Use gentle, not firm, pats when doing this. Avoid pressing the sprinkles too deeply into the frosting. Work on the cake in layers, starting at the base and working upwards. This will ensure that the sprinkles are applied evenly. Repeat this process for the middle and upper portions of the cake as well. This method works great for large or layered cakes that may be too fragile to roll in a tray of sprinkles."
    },
    {
      "title": "Use an offset spatula to gently smooth out the layer of sprinkles.",
      "content": "Use an offset spatula to gently smooth out the layer of sprinkles. This will remove any excess sprinkles that clumped against the icing and will reveal spots where the sprinkles did not stick. If there are patches without sprinkles, firmly, but carefully, press in sprinkles to those missed areas. [7] X Research source Repeat this process around the entire cake until it is evenly covered to your satisfaction."
    },
    {
      "title": "Pat sprinkles onto the top of the cake to complete the look.",
      "content": "Pat sprinkles onto the top of the cake to complete the look. Pay special attention to the top ridge of the cake, and try to use your fingers to gently blend the sprinkles. Don’t feel like you have to use a similar sprinkle color or design on the top. Have fun with the sprinkle colors and shapes. [8] X Research source If you used rainbow sprinkles on the sides, make the top of the cake a single color like purple or yellow to contrast. If you used a dense sprinkle coating on the sides, sporadically scatter larger confetti sprinkles on top. This will help break up the busy design on the side of the cake."
    },
    {
      "title": "Use a stencil to create a sprinkle design on top of your cake.",
      "content": "Use a stencil to create a sprinkle design on top of your cake. Purchase a stencil, or make a personal one out of parchment paper. This is a great alternative to covering the entire top of the cake with sprinkles. Using parchment paper, cut out a stencil of a flower, heart, or another shape that will go well with your cake. The stencil can also be words or numbers, like someone’s name for a birthday or the numerical year for a New Year’s Eve cake. [9] X Research source Draw and cut out a stencil design of your choice into parchment paper. Rest the stencil on top of your frosted cake and smooth it out to remove any bubbles. Use a small brush to apply a thin coat of corn syrup to the stencil outline and then fill in the stencil with fine or small sprinkles. Finally, put the cake in the refrigerator to set for 20 minutes, and then carefully lift and remove the stencil."
    },
    {
      "title": "Fill a shallow pan or baking sheet with 1 cup (176 g) of sprinkles.",
      "content": "Fill a shallow pan or baking sheet with 1 cup (176 g) of sprinkles. Spread out the sprinkles to a width that will cover the side of your cake when you roll it. Use fewer sprinkles if you want more of a scattered design on your cake, or use more sprinkles to densely coat your cake. [10] X Research source This method is ideal for small, dense cakes that you can move around in your hands."
    },
    {
      "title": "Place one hand on the bottom and top of your cake and transfer it to the pan.",
      "content": "Place one hand on the bottom and top of your cake and transfer it to the pan. Use a single quick movement to do this. Do not drop or plop the cake onto the pan, as this might cause the cake to crumble or break. [11] X Research source The top of the cake should not be frosted when you do this. Icing along the top of the cake will make it harder for you to transfer. [12] X Research source"
    },
    {
      "title": "Rest the cake on its side and gently roll it through the sprinkles to cover it.",
      "content": "Rest the cake on its side and gently roll it through the sprinkles to cover it. Allow the weight of the cake to press the sprinkles into the icing. Applying extra pressure to the cake will bury the sprinkles in the icing. [13] X Research source Add more sprinkles onto the baking sheet if you start to run out before your cake is fully covered."
    },
    {
      "title": "Lift the cake by the unfrosted ends and set it on a plate or cake stand.",
      "content": "Lift the cake by the unfrosted ends and set it on a plate or cake stand. Some of the sprinkles may fall off as you rest the cake on the plate or stand. This is because the icing is still setting, and needs time to harden properly. [14] X Research source Use your hand or an offset spatula to smooth out any imperfections that occurred during the transfer."
    },
    {
      "title": "Use an offset spatula to frost the top of the cake.",
      "content": "Use an offset spatula to frost the top of the cake. If you applied a crumble-coat and then a second layer of frosting, repeat that same process so the texture of the top of the cake matches the sides. Be careful when icing the edge of the cake, so you do not disturb the sprinkles set into the sides. [15] X Research source"
    },
    {
      "title": "Press sprinkles onto the top of the cake until it is completely covered.",
      "content": "Press sprinkles onto the top of the cake until it is completely covered. If you start by putting 1 or 2 handfuls of sprinkles in the center, it will make spreading out the sprinkles easier. Instead of using your hand, use an offset spatula to evenly spread the sprinkles around the top of the cake. [16] X Research source"
    },
    {
      "title": "Melt 1 ⅓ cup (200 g) of candy melts in a small pot over a medium heat.",
      "content": "Melt 1 ⅓ cup (200 g) of candy melts in a small pot over a medium heat. Make sure to stir the mixture continuously to keep it from burning. Use white, milk, or another grade of chocolate candy melts to do this. Pick whichever one will complement the flavor and color scheme of your cake best. You do not have to use candy melts. Instead, melt baking chocolate or another chocolate form. Just know that melting white chocolate bars or chips will have a slightly more yellowed appearance than the candy melts. Take the melted white chocolate and stir in a few drops of food coloring to create a colorful base for the sprinkles. Pick a color that will contrast nicely with the selection of sprinkles you chose."
    },
    {
      "title": "Add ⅛ cup (28 g) of shortening to thin out the melted chocolate.",
      "content": "Add ⅛ cup (28 g) of shortening to thin out the melted chocolate. Continue to stir in the mixture until the chocolate fully melts and the shortening disperses. If the mixture still seems too thick to spread over the fondant on your cake, add more shortening until you reach a consistency you are satisfied with. Instead of shortening, add an equal amount of cocoa butter to thin the mixture."
    },
    {
      "title": "Use an offset spatula to quickly spread the mixture onto the fondant.",
      "content": "Use an offset spatula to quickly spread the mixture onto the fondant. Your goal is to create an even, thin layer around the sides of the cake. The candy melts will harden within about 8 minutes of application, so you need to ice the fondant as quickly as possible to ensure that the sprinkles will stick. If you are adding sprinkles to the top of the cake, spread the mixture around the top as well."
    },
    {
      "title": "Use your hand to press the sprinkles around the base of the cake.",
      "content": "Use your hand to press the sprinkles around the base of the cake. To do this effectively, use one hand to press on the sprinkles and the other to rotate the cake. It will help to apply the sprinkles in layers, working from the bottom of the cake upwards. This will give you more application control. If you have a turntable, set your cake on top of it and spin it to apply the sprinkles to speed up the process. Repeat this process for the middle and upper portions of the cake. If you want to apply sprinkles to the top of the cake, press in sprinkles there as well."
    },
    {
      "title": "Press the sprinkles gently into the fondant with an offset spatula.",
      "content": "Press the sprinkles gently into the fondant with an offset spatula. This will smooth out any lumpy or clotted sprinkle placement around the cake, and remove excess sprinkles that did not adhere. Fill in any glaring holes or empty patches in the design by pressing more sprinkles onto the cake. [17] X Research source Pay particular attention to the top edge as you may have to specifically press in sprinkles to that area."
    },
    {
      "title": "Allow the cake decorations to finish setting before you move or serve it.",
      "content": "Allow the cake decorations to finish setting before you move or serve it. The candy melts mixture should not take more than 5 minutes to finish hardening. Once the cake has set, transport it to the table to show off to your family members and friends."
    }
  ]
}