{
  "url": "https://www.wikihow.com/Seatgeek-Customer-Service",
  "title": "How to Reach SeatGeek Support By Phone Number, Chat & Email",
  "steps": [
    {
      "title": "Call 888-497-4335 for ticket inquiries and general support.",
      "content": "Call 888-497-4335 for ticket inquiries and general support. SeatGeek's phone number is not readily available on their website, so we contacted the company via the Live Chat function for you. Their chatbot recommends calling 888-497-4335 for immediate live support. Dial the number and listen carefully for any prompts on the other line to connect to a ticket representative. SeatGeek's Event Experts are available from 9 am to 1 am EST. [1] X Research source Similarly, phone and instant chat support is available for any last-minute issues within 7 days of your event. Go to the Contact Support page in the SeatGeek app for help. [2] X Research source"
    },
    {
      "title": "Visit SeatGeek's Help Center page to start a Live Chat.",
      "content": "Visit SeatGeek's Help Center page to start a Live Chat. Go to SeatGeek's Help Center and tap the chat icon on the bottom right of the page. Choose one of the two pre-selected topics, \"Help with a Canceled Event\" or \"Help with Selling MLB Tickets,\" or type your question into the chat. If the support bot cannot resolve the issue, you'll be redirected to a live representative. [3] X Research source The support bot is available 24/7. SeatGeek's Event Experts are available from 9 am to 1 am EST. [4] X Research source"
    },
    {
      "title": "Email checkout@seatgeek.com with any questions or concerns.",
      "content": "Email checkout@seatgeek.com with any questions or concerns. Compose a message to SeatGeek's customer service team using your preferred email provider. Offer a subject that summarizes your issue. Then, detail your issue in the main body of your message. Include the date of your event and an order number to streamline the process. [5] X Research source If you're having an issue accessing your tickets, a subject could be \"Ticket Inquiry\" or \"URGENT: Ticket Access Issue.\""
    },
    {
      "title": "Use the Live Chat feature to fill out an online form for an email response.",
      "content": "Use the Live Chat feature to fill out an online form for an email response. Go to the SeatGeek's Help Center , tap the chat icon, and type in \"Contact Support.\" Then, click \"Email\" and fill out their online form, providing your email address, subject, and issue description. Include the event date and order number, and attach any files that may support your claim. Submit when you're ready."
    },
    {
      "title": "Refer to SeatGeek's FAQ or Help Center for assistance.",
      "content": "Refer to SeatGeek's FAQ or Help Center for assistance. Need to change, cancel, or get a refund after placing a ticket order? No problem! SeatGeek's Help Center is filled with frequently asked questions and articles that may help resolve common concerns. Select one of the top questions or use the search bar for specific inquiries. [6] X Research source It's important to note that you can get personalized support by logging into your SeatGeek account. [7] X Research source"
    },
    {
      "title": "How can I get a refund on my tickets?",
      "content": "How can I get a refund on my tickets? SeatGeek is a marketplace that allows fans to buy and sell tickets. Therefore, the company cannot refund, cancel, or exchange tickets. Unfortunately, all sales are final. You can only receive a full refund if an event is canceled and not rescheduled. Alternatively, the company may offer credit for use on a future purchase. If you don't want the tickets, re-list them on SeatGeek's Marketplace by tapping \"Sell Tickets.\" Set a price and click \"List Tickets.\" [8] X Research source"
    },
    {
      "title": "Why can't I access my SeatGeek tickets?",
      "content": "Why can't I access my SeatGeek tickets? If you can't access your SeatGeek tickets, log in or create a SeatGeek account using the same email that the tickets were transferred to. Then, go to the Tickets section of your account to accept the transfer. [9] X Research source Some tickets are delivered through a third-party service called AXS. Within 24-48 hours of the event, you'll receive an email from AXS prompting you to log in or register to access your tickets. [10] X Research source"
    },
    {
      "title": "What if SeatGeek isn't the seller of the tickets?",
      "content": "What if SeatGeek isn't the seller of the tickets? Check your order confirmation email to review the seller's name and contact information. Your transaction record may also include a contact phone number for the seller. Contact them for any inquiries related to your order. [11] X Research source"
    }
  ]
}