{
  "url": "https://www.wikihow.com/Make-a-Word-Template",
  "title": "How to Create or Add a Template on Microsoft Word",
  "steps": [
    {
      "title": "Open the Word document you want to make into a template.",
      "content": "Open the Word document you want to make into a template. This method creates a document template with customized font styles, paragraph styles, and more. Once you make a template, you can use it to quickly start a new document with your preferences. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you're looking for a way to create a document for others to fill out, see our guides to create a form or add fillable fields instead."
    },
    {
      "title": "Customize your Word document.",
      "content": "Customize your Word document. Add all the attributes you want your new template to have, including selecting a font, adjusting line spacing and or paragraph spacing, adjusting margins, and selecting styles and colors for text. You can also add images , graphs , bar charts , and more to your custom template."
    },
    {
      "title": "Click the File menu and select Save As.",
      "content": "Click the File menu and select Save As . When you're finished editing your template, you can save it in the Word template format. If you don't see Save As, try Save as Copy ."
    },
    {
      "title": "Click This PC on Windows.",
      "content": "Click This PC on Windows. Templates need to be saved in the Custom Office Templates folder on your computer. It may not work if you save it to a cloud service, such as OneDrive or iCloud. If you're using a Mac, select the Where box and choose a save location. Otherwise, it will be saved in the Templates folder."
    },
    {
      "title": "Click the drop-down menu and select Word Template.",
      "content": "Click the drop-down menu and select Word Template . This is in the Save as type drop-down menu. This changes the file type to the Word Template format. If your document has macros, you'll need to select Word Macro-Enabled Document instead. Alternatively, you can select \"Word 97-2003 Template\" if you plan on using the template in an earlier version of Word."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . This will save your Word template to the Custom Office Templates folder."
    },
    {
      "title": "Open Microsoft Word.",
      "content": "Open Microsoft Word. You should see your home page. If you already have a file open, click the File menu and select Open instead."
    },
    {
      "title": "Double-click This PC (Windows) or Where (Mac).",
      "content": "Double-click This PC (Windows) or Where (Mac). This opens your computer's file picker window."
    },
    {
      "title": "Go to the \"Templates\" folder.",
      "content": "Go to the \"Templates\" folder. Any templates you've created will be in this folder. The folder location will vary depending on your device. On Windows : Go to This PC/Documents/Custom Office Templates . On Mac : Go to /Users/username/Library/Group Containers/UBF8T346G9.Office/User Content/Templates ."
    },
    {
      "title": "Select your template and click Open.",
      "content": "Select your template and click Open . This will open your Word template for editing."
    },
    {
      "title": "Edit your template.",
      "content": "Edit your template. Make the necessary changes to your template."
    },
    {
      "title": "Save the template.",
      "content": "Save the template. To save your changes, you can press Ctrl + S (Windows) or Command + S (Mac) to quickly save. You can also click File > Save . The template is now updated with your changes. Once your template is saved, you can close it."
    },
    {
      "title": "Open Microsoft Word.",
      "content": "Open Microsoft Word. If you have created a template and are ready to use it to create a new document, this method will show you how. When you open Word, you should see your home page."
    },
    {
      "title": "Click the File menu and select New (Windows).",
      "content": "Click the File menu and select New (Windows). If you are using a Mac desktop or MacBook, click the File menu and select New from template instead."
    },
    {
      "title": "Click Personal.",
      "content": "Click Personal . On some devices, this may be Custom instead."
    },
    {
      "title": "Select your template.",
      "content": "Select your template. This creates a new Word document from the selected template. You can now make changes to the template as needed. When you save the document, it will not replace the template—it will be a whole new Word document."
    },
    {
      "title": "Open Microsoft Word.",
      "content": "Open Microsoft Word. If you want to skip making your own template and instead try one of Microsoft's templates, you can do so from the Word application. If you open the application alone, you'll see the home screen with suggested templates. If you open an existing document, click File > New . You can also check out Microsoft Create in your browser to see templates for all Microsoft Products, including Word, PowerPoint, Excel, and Designer. [2] X Research source"
    },
    {
      "title": "Enter keywords into the search field.",
      "content": "Enter keywords into the search field. Results will load as you type. You can enter words such as \"calendar\", \"resume\", \"social media\", and more."
    },
    {
      "title": "Click a template.",
      "content": "Click a template. This will open a preview in full view and display some details about the template. If you don't like the template, close it and select a new one."
    },
    {
      "title": "Click Create.",
      "content": "Click Create . A new document will be created from the template. You can now fill in the template. Be sure to save your document when you're finished."
    }
  ]
}