{
  "url": "https://www.wikihow.com/Remove-Ice-from-a-Driveway",
  "title": "How to Get Ice Off a Driveway (with & without Salt)",
  "steps": [
    {
      "title": "Clear away any snow that's on top of the ice.",
      "content": "Clear away any snow that's on top of the ice. Using any kind of deicer is pointless if there is snow piled on the ice. Use a snow shovel to push the snow off of the ice before you do anything else. You don't have to get the snow completely off, but try to get it down to two inches (5 cm) or less. [1] X Research source If you have a plow that attaches to a four wheeler, tractor, or snowblower, it's much faster to clear the snow this way."
    },
    {
      "title": "Keep rock salt away from plants and pets.",
      "content": "Keep rock salt away from plants and pets. Rock salt contains chemicals that are harmful to animals and plant life. When you spread the salt, make sure not to throw any on the grass or plants near your driveway. Also, make sure that your pets do not eat the salt if you have them outside."
    },
    {
      "title": "Sprinkle rock salt evenly over the ice.",
      "content": "Sprinkle rock salt evenly over the ice. You'll need about four pounds (1.8 kg) of rock salt per 1000 square feet (93 square meters) of driveway. Scoop up the salt with an old plastic cup and slowly shake it out over the surface of the driveway. Don't pile too much salt on any specific spot. [2] X Research source The freezing temperature of saltwater is lower than that of regular water, so this is the basic principle that causes salt to melt ice. If you have a push behind rotary spreader, like the kind you'd use for yard fertilizer, fill it with salt and use it to spread the salt quickly and evenly. Calcium chloride pellets and magnesium chloride pellets can be substituted and applied in the same fashion."
    },
    {
      "title": "Splash some warm water around on the salt.",
      "content": "Splash some warm water around on the salt. Letting the salt sit on the ice will melt it slowly, but adding warm water to the mix will speed things up. Fill a spray bottle with lukewarm water and mist the entire area where you laid the salt. Simply pouring water from a jug would work too, but it will distribute the water unevenly. [3] X Research source For larger areas, try using a garden hose. You can even hook it up to a sink faucet if you have the right fittings. This is not necessary if you are using calcium chloride pellets or magnesium chloride pellets."
    },
    {
      "title": "Wait for the ice to soften.",
      "content": "Wait for the ice to soften. Thin ice will probably melt in 5-10 minutes, but for thicker ice you'll need to wait longer. It could take up to 30 minutes or so. If it's below freezing outside, you should wait inside to keep warm. Check the ice a couple of times until you notice that it has melted."
    },
    {
      "title": "Shovel the melted ice off of the driveway.",
      "content": "Shovel the melted ice off of the driveway. To completely remove ice from the driveway, use a metal snow shovel to scrape off the slush that remains. If you leave the mostly melted ice on the driveway, there's a risk of it freezing again. [4] X Research source You can also use a big floor squeegee to remove watery slush so that it doesn't re-freeze into a thin layer of slippery ice. If you are in a hurry or it's obvious that the ice has totally melted to water, don't worry about shoveling off the slush."
    },
    {
      "title": "Remove snow from on top of the ice.",
      "content": "Remove snow from on top of the ice. If you have ice on your driveway, you probably have some snow too. Any method that melts ice will melt snow, too, so you can't effectively remove the ice if you don't remove the snow first. Push it off of the driveway with a plow, snowblower, or snow shovel."
    },
    {
      "title": "Fill a spray bottle with 70% isopropyl alcohol.",
      "content": "Fill a spray bottle with 70% isopropyl alcohol. Grab a spray bottle that's at least a quart (about one liter) or a half gallon (about 2 liters). Add the alcohol and put the spray nozzle back on. If you want to make the alcohol last longer, dilute it with water to a 50/50 ratio. [5] X Research source Note that diluted alcohol may be slightly less effective at melting the ice. If you don't have a spray bottle, carefully use a sharp knife to poke four or five holes in the cap of the alcohol bottle and spray the alcohol in this way. If you need to treat a larger area, you could mix the alcohol and water in a small garden pump sprayer."
    },
    {
      "title": "Spray the alcohol around on the ice.",
      "content": "Spray the alcohol around on the ice. Walk from side to side on the driveway, spraying the alcohol as you go. If you're able to bend over, hold the bottle about a foot away from the ice so it hits it more directly. If the alcohol runs out before you cover the driveway, refill the bottle and continue. [6] X Research source"
    },
    {
      "title": "Shovel the melted ice off to the side.",
      "content": "Shovel the melted ice off to the side. After you leave the alcohol sitting on the ice for 15 to 30 minutes, grab a sturdy metal snow shovel. Break up the ice and push it off to the side of the driveway. In a pinch, you don't have to shovel it off, but you risk it freezing again. [7] X Research source"
    },
    {
      "title": "Install some snow-melt mats.",
      "content": "Install some snow-melt mats. You'll find many ice-melt mats on the market. Many are systems that are installed under the driveway, which may be more expensive. Some mats may allow you to lay them out on top of the ice to melt it."
    },
    {
      "title": "Pour or spray hot water on the ice.",
      "content": "Pour or spray hot water on the ice. Use a pot on the stove or an electric kettle to boil as much water as you can safely carry outside. Pour the water around on the ice to melt it. If you have a metal watering can, this is a great way to spread the water around. [8] X Research source If you have a way to attach a hose to the hot water in your house, this is a great way to spray down the icy driveway. You may need to shovel the melted icy slush after you pour water on it."
    },
    {
      "title": "Mix water and vinegar in a watering can.",
      "content": "Mix water and vinegar in a watering can. Use a ratio of 1:1 of warm water and vinegar. Once you have mixed it up in the can, pour it around on the ice. Let it sit for a few minutes to start melting the ice. Use an ice chisel or a heavy metal shovel to chop up the melting ice. [9] X Research source"
    },
    {
      "title": "Use pickle brine to melt ice.",
      "content": "Use pickle brine to melt ice. Pickle brine can melt ice as cold as -6 degrees Fahrenheit (-21 degrees Celsius). Pour the brine onto the icy area to melt the ice. Let it sit for several minutes, then use your ice chisel or a heavy metal shovel to scrape away the ice. Additionally, you can pre-wet your driveway with pickle brine to prevent the ice from sticking to the pavement. This makes it easier to remove."
    }
  ]
}