{
  "url": "https://www.wikihow.com/Save-a-Game-on-Red-Dead-Redemption",
  "title": "How to Save a Game on Red Dead Redemption",
  "steps": [
    {
      "title": "Find the nearest safe house.",
      "content": "Find the nearest safe house. Safe houses are indicated by a house icon on your map. Blue house icons represent safe houses that have yet to be bought or rented. Green house icons represent safe houses that you have purchased or rented for the night."
    },
    {
      "title": "Tie up your horse.",
      "content": "Tie up your horse. If you are traveling on horseback, you can ensure that your horse does not wander off while you're sleeping by tying it up to the horse hitch out front. Not all safe houses have horse hitches."
    },
    {
      "title": "Approach the bed.",
      "content": "Approach the bed. Enter the safe house and approach the bed. You can only use the bed if you've purchased or rented the safe house."
    },
    {
      "title": "Press the Save button.",
      "content": "Press the Save button. When standing next to the bed, a message will appear informing you that you can save your game. Press △ (PS3) or Y (Xbox 360) to start the save process. Marston will lie down on the bed."
    },
    {
      "title": "Choose to save.",
      "content": "Choose to save. When you lie down, time will advance six hours. You can choose to save, or you can cancel to get up. This can be useful for advancing the game time without going through the whole save process."
    },
    {
      "title": "Choose a save file.",
      "content": "Choose a save file. If you choose to save, you will be asked to select a save file. You can overwrite an existing save, or create a new one. [1] X Research source"
    },
    {
      "title": "Find an open area.",
      "content": "Find an open area. In order to set up a campsite, you will need to find a flat, open area that is not inside a town, settlement, or hideout. If you try to set a campsite up in an area that doesn't allow it, you will receive a message telling you to find a new spot."
    },
    {
      "title": "Open your Satchel.",
      "content": "Open your Satchel. You can make a basic campsite without having to purchase anything. You can access the Satchel by pressing SELECT (PS3) or ◁ BACK (Xbox 360)."
    },
    {
      "title": "Select \"Kits\".",
      "content": "Select \"Kits\". These are your tools. Your Basic Campsite will be on the list. You can purchase an Improved Campsite, but you can save with either version. Select the Campsite from your kit to set it up. You can also come across camps that other characters have set up. These appear randomly throughout the game. You cannot save at these camps."
    },
    {
      "title": "Save your game.",
      "content": "Save your game. When you build your campsite, you will automatically squat down next to it. You can start the save process by pressing △ (PS3) or Y (Xbox 360). Marston will lie down on the bedroll."
    },
    {
      "title": "Choose to save.",
      "content": "Choose to save. When you lie down, time will advance six hours. You can choose to save, or you can cancel to get up. This can be useful for advancing the game time without going through the whole save process."
    },
    {
      "title": "Choose a save file.",
      "content": "Choose a save file. if you choose to save, you will be asked to select a save file. You can overwrite an existing save, or create a new one. [2] X Research source"
    }
  ]
}