{
  "url": "https://www.wikihow.com/Remove-Vertical-Blinds",
  "title": "How to Unclip Vertical Blinds: Easy DIY Guide",
  "steps": [
    {
      "title": "Unclip the cord tensioner if you have one.",
      "content": "Unclip the cord tensioner if you have one. Most vertical blinds have a continuous loop cord or drawstring that you pull to rotate the blinds open or closed. On some blinds, this cord is secured to the wall or window frame with a clip called a cord tensioner. You’ll need to release the cord tensioner in order to take down the blinds. The exact way you remove this can vary: Some tensioners have one or two visible screws. Simply remove these screws to release the cord. [1] X Research source On some models, you’ll need to pry off the cover, then remove a screw to free the cord. Some blinds won’t have a tensioner attached to the cords, and on cordless blinds, there won’t be a drawstring at all."
    },
    {
      "title": "Lift the valance or pull it outward to remove it.",
      "content": "Lift the valance or pull it outward to remove it. If your vertical blinds have a valance—a decorative border covering the rail—you’ll need to remove it to access the vanes. Hold the bottom of the valance and gently push it upwards to lift it off of the clips, then pull it towards you to remove it. [2] X Research source To avoid damaging the valance, remove it from the center first, then work out to the sides. Some valances are just resting on the headrail of the blinds. These can just be lifted off of the rail. If the valances are clipped in place, be sure the valance is free of each clip before you try to pull it down. Otherwise, the clips could break."
    },
    {
      "title": "Rotate the blinds so that they are partially open.",
      "content": "Rotate the blinds so that they are partially open. It will be easiest to remove the blinds if they’re open at an angle. Look at the vanes to see which side has the clip. Then, pull the bead chain on the side of the blinds to open the vanes so the side with the clip is facing you. [3] X Research source If the clip is visible on both sides of the vane, rotate the vanes so the longer side of the clip is facing you. If the clips have a hook, the hook should be facing you. The clips holding each vane are also known as the vane carriers."
    },
    {
      "title": "Slide a plastic card between the vane carrier and the vane.",
      "content": "Slide a plastic card between the vane carrier and the vane. Position a flat, sturdy card under the bottom of the vane carrier, underneath the hook. Slide the card upwards to wedge it between the vane and the carrier. This will disrupt the grip that holds the vane in place and prevent you from breaking the thin plastic that runs along the top. [4] X Research source Use something like a library card or membership card—avoid using anything important like your driver’s or credit card. On some vertical blinds, you just need to push the vane upward into the clip, then pull the vane down or rotate it sideways to release it. [5] X Research source"
    },
    {
      "title": "Gently pull down to detach each vane.",
      "content": "Gently pull down to detach each vane. Once the vane is released the clip, pull the vane downwards to remove it. Do this slowly to prevent damage to the vane. If you used a card to unclip the vane, pull it out of the clip after the vane is freed. [6] X Research source The carriers that hold the vanes should not be removed from the blind rail. Stack the vanes neatly in a safe spot to avoid damaging them."
    },
    {
      "title": "Locate the spring clips on the back of the headrail.",
      "content": "Locate the spring clips on the back of the headrail. Most vertical blinds are held in place by brackets that are secured with a simple spring clip. Depending on the length of your blinds, there may be one clip at each end of the headrail. There could also be one or more clips in the middle of the headrail. [7] X Research source The headrail is the piece that’s left attached to the brackets after you remove the vanes. If you can’t see behind the vertical blinds, try feeling along the back of the track to find the clips."
    },
    {
      "title": "Hold the headrail with one hand and press the spring clip on the back.",
      "content": "Hold the headrail with one hand and press the spring clip on the back. Use hold hand to steady the headrail. Try pressing up on the spring clip with your thumb. In some cases, that’s all it will take to release the headrail—you’ll feel the back of the headrail drop down once the the clip is released. [8] X Research source If the clip is difficult to release, try pushing it with a flathead screwdriver."
    },
    {
      "title": "Tilt the headrail forward to release the front.",
      "content": "Tilt the headrail forward to release the front. After the back part of the headrail has been released from the clips, the front part may still be held in place. If that happens, tilt the back of the headrail down and toward you. The front of the headrail should slip free. [9] X Research source Older vertical blinds will sometimes be a little harder to remove. You may need to apply gentle force to pop the track free. But if it’s still firmly attached, feel along the back of the track again—there may be a hidden spring clip that hasn’t been released yet."
    },
    {
      "title": "Remove the brackets and fill the holes if you aren't replacing the blinds.",
      "content": "Remove the brackets and fill the holes if you aren't replacing the blinds. Once the track is free, all that will be left are metal brackets. If you want to get rid of those, use a screwdriver to remove the small screws attaching the brackets to your wall. If the screws are very tight, use an electric screwdriver. To hide the holes, use a putty knife to apply plaster or joint compound. Paint over it once the surface is dry. If there are wall anchors, you may have to remove them with needle-nose pliers. [10] X Research source If you are simply replacing the blinds, check to see if the new blinds will fit into the old brackets. If so, you can leave them in place to save yourself time and trouble."
    },
    {
      "title": "Store the blinds securely if you won’t be using them again.",
      "content": "Store the blinds securely if you won’t be using them again. Place the headrail on top of the stacked vanes. Wrap the entire assembly with plastic wrap or clear packing tape to secure it, then lay it flat somewhere safe where the blinds won’t be damaged, like under a bed or in an attic. Wrap the cord neatly around the headrail and vanes so it won’t get damaged. Lay the wand parallel to the headrail. Consider labeling the blinds so you know where they came from—like Living Room East Window or Front Bedroom. If you’re taking your blinds down temporarily, like to clean them or repair them , check out our section on putting them back up ."
    },
    {
      "title": "Place the front of the headrail against the clips, then tilt the back into place.",
      "content": "Place the front of the headrail against the clips, then tilt the back into place. Line up the headrail under the mounting clips. Tilt the headrail so the front edge rests against the clips. Then, rotate the back edge up and toward the window. [11] X Research source You should hear a click when the headrail snaps into place. Feel along the back edge of the headrail to ensure each clip is engaged."
    },
    {
      "title": "Push each vane into the clip.",
      "content": "Push each vane into the clip. Carefully insert the slotted end of a vane into one of the clips. Push upward until you feel it snap into place. On some vertical blinds, you may need to gently tug down on the vane to ensure it’s seated in the clip. [12] X Research source Make sure the finished (or smooth) side of each vane faces toward the long or hooked slide of the clip."
    },
    {
      "title": "Attach the cord to the tensioner.",
      "content": "Attach the cord to the tensioner. If you removed a tensioner from your corded vertical blinds, put it back on now. Place the tensioner all the way at the bottom of the cord loop, then reattach the screw (or screws) to lock it in place. If you pried off a cap, pop it back into place as well. [13] X Research source Tensioners are an important safety feature—they protect children and pets from getting tangled in the blinds. If you have a tensioner for your corded blinds, don’t skip replacing it. If you have a valance, slide it back onto the clips or rest it on top of the headrail to finish the installation."
    },
    {
      "title": "Shades or Blinds",
      "content": "Shades or Blinds Vertical blinds may not be your thing, but there are plenty of other styles of blinds and window shades that may work better. For instance, horizontal blinds are less likely to tangle, they’re inexpensive, and they offer plenty of privacy. When they’re kept closed, blinds and shades can also help your home be up to 60% more energy efficient. [14] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Other types of blinds and shades include: Roller blinds Roman blinds Honeycomb shades Window quilts"
    },
    {
      "title": "Curtains",
      "content": "Curtains Curtains are an elegant option for any window. Go with sheer panels if you still want plenty of natural light, or opt for a heavier fabric if you want more of a blackout effect. And because curtains are available in nearly any color, pattern, and texture you can imagine, it’s easy to find something that will suit your style. [15] X Research source Add a valance or cornice to the top of your curtains for a classic finishing touch."
    },
    {
      "title": "Indoor Shutters",
      "content": "Indoor Shutters Who says shutters are only for the outside of a house? Bring a charming rustic touch indoors with shutters that you can swing open for full light or close for privacy. [16] X Research source For more versatility, choose a louvered shutter so you can open and close the slats to adjust the natural lighting in the room."
    },
    {
      "title": "Window Film",
      "content": "Window Film Want a temporary solution for covering your windows without hanging anything on the wall? Try a removable window film . Cut the cling to size, then apply it to the window like a decal . Typically, this involves spraying the glass with water, then smoothing the film onto the glass and squeegeeing to remove air bubbles. Choose a tinted but transparent window film if you want to see through the window, or go with a translucent or patterned film for more privacy. Be sure you choose a removable film—it will be indicated on the packaging or product listing. When you’re ready to remove the film, just peel it away and clean the window."
    }
  ]
}