{
  "url": "https://www.wikihow.com/Pick-Up-Girls-While-Walking-Down-the-Street",
  "title": "How to Pick Up Girls While Walking Down the Street",
  "steps": [
    {
      "title": "Always be prepared to meet a new girl.",
      "content": "Always be prepared to meet a new girl. If you are looking to pick to girls, it helps to be mentally and physically prepared to do so. Before you go out, have a few funny anecdotes lined up, should the opportunity to talk to a girl arise. Continually scan your environment for suitable candidates; you never know when a hottie is going to wander by. Pay attention to your surroundings so that when an opportunity arises for small talk, you can quickly think up an icebreaker comment about something nearby. [1] X Research source"
    },
    {
      "title": "Dress neatly, in a fashion that reflects your personality.",
      "content": "Dress neatly, in a fashion that reflects your personality. If you are a slacker dressed in a business suit, the disconnect between your personality and your clothing is going to come across very quickly in conversation and confuse the girl, or make her uncomfortable. Dress in a way that advertises the kind of person you are, but do choose the nicest clothes of your preferred type that you have available. At very least, make sure that your clothing and hair are clean and presentable. If you’ve got a few extra bucks to spend, invest in a new pair of shoes."
    },
    {
      "title": "Figure out where the girls are.",
      "content": "Figure out where the girls are. If you want to pick up girls, you need to go to where they are. Choose a place with a lot of foot traffic to hang out, such as a street with many restaurants, the sidewalk outside of a popular coffee shop, or the arcade in front of a big bookstore. Also, plan your search for a time of day when the girls who walk by are likely to have a bit of time to spare. People who are rushing to get to work or an early class are unlikely to be in the mood to stop and chat. Aim for the lunch hour, or mid-morning, when many people go out for a coffee break."
    },
    {
      "title": "Look like you have a purpose, besides picking up girls.",
      "content": "Look like you have a purpose, besides picking up girls. Most women will be put off by a man (or woman) slouching on a street corner, calling out to various girls as they walk by. No one enjoys being harassed in the street! Your advance will seem far less threatening and contrived if it appears you are busy or out running errands. Even though you may actually just be walking around aimlessly looking for girls, it’s best to have some kind of destination in mind, in case an opportunity for conversation or an invitation arises (“I was just on my way to the Farmer’s market, would you care to join me?”) You can also try “getting lost” in the vicinity of a known destination, so you can ask a girl for directions. (“I was just looking for the Apple store, but seem to be turned around. Can you help me out?”)"
    },
    {
      "title": "Try to make eye contact as you pass by.",
      "content": "Try to make eye contact as you pass by. If a girl catches your attention, try to quickly make eye contact and smile as you walk past her. Don’t stare for too long, and then look away for a few seconds to give her a chance to look you over, if she is also interested."
    },
    {
      "title": "Glance back and try to see if she noticed you.",
      "content": "Glance back and try to see if she noticed you. If you glance back and catch her looking at you, smile and give a quick wave. If she smiles or waves back, walk right up to her. Then proceed straight to the third part : Starting the Conversation. If you do not see her looking back, that does not necessarily mean she is not interested. She may not have seen you, or you may have missed her glance. You’re going to have to keep at it to find out. If you do catch her looking back, and she quickly turns away from you and walks on, that’s a signal that she knows you were trying to connect with her, and is brushing you off. Let this one go."
    },
    {
      "title": "Turn back and approach the girl from the side.",
      "content": "Turn back and approach the girl from the side. You can either walk quickly to catch up to her, or follow her until she reaches a crosswalk and has to stop. Walk a few blocks if you have to, in order to approach her in a calm and natural fashion. [2] X Research source Do not tap her on the back or startle her from behind. This can come across as threatening. It would also be inappropriate and frightening to the woman if you were to run after her, or approach her all sweaty and out of breath. As Han Solo once advised, “fly casual.”"
    },
    {
      "title": "Do not stalk the girl.",
      "content": "Do not stalk the girl. There is a huge difference between following a person for a few blocks in order to catch up and introduce yourself, and stalking someone. Do not follow the girl for more than two or three blocks, and pay close attention to her signals. If she does not make it easy for you to catch up to her, she is most likely not interested. If the girl seems to be speeding up, making it hard for you to catch up, she is aware of your approach, and trying to shake you off. If she gets out her phone to make a call, this is another strategy for shaking off an unwanted advance. Take it as a hint to back off and leave her alone. Do not try to follow her until she is done with her call, or the next call she makes could be to the police. Don’t follow a person into an office building or other place of business. If she casually wanders into a coffee shop or store, you may try approaching her there, but bear in mind that there is a good chance she is alarmed by your approach, and looking for witnesses and/or assistance in getting rid of you."
    },
    {
      "title": "When you catch up to the girl, first excuse yourself to get her attention.",
      "content": "When you catch up to the girl, first excuse yourself to get her attention. You might startle her if you begin talking without warning, so it’s good to open with something along the lines of “Excuse me, but I saw you walk by a few minutes ago, and just wanted to say ‘hi’. . . “ and go from there."
    },
    {
      "title": "Try breaking the ice with a casual comment about your surroundings.",
      "content": "Try breaking the ice with a casual comment about your surroundings. If you don’t feel comfortable starting with “excuse me,” try making a brief comment about something in the surrounding area. [3] X Research source If you are standing in front of a restaurant, you might say “Something smells good, doesn’t it?” If a bus just drove off leaving a person behind at the stop, you might remark “TriMet, right?” and give her a knowing glance."
    },
    {
      "title": "Pay her a specific compliment.",
      "content": "Pay her a specific compliment. Better yet, try for a compliment that invites some kind of explanation or response. Is she wearing an interesting hat? Say “Cool hat, where did you get it?.” Does she have a unique hair color? Try: “Your hair is amazing, what would you call that shade?” Is she sporting the t-shirt of your favorite band? Tell her that it's one of your favorites and ask her if she saw their show at the last (awesome) venue. Crass compliments about butts and sexiness will offend many women, so it’s best to avoid them."
    },
    {
      "title": "Focus on nonverbal communication.",
      "content": "Focus on nonverbal communication. 55 % of human communication is visual, and another 38% is vocal, so your body language and how you speak are both far more important than anything you actually have to say. Smile and maintain eye contact. Stand confidently, with your chest out and shoulders back. Begin with your body turned slightly away from her, then turn your body towards her when you she says something engaging or amusing to show your increased interest. Try to keep the pitch of your voice low, and resist the temptation to speak too quickly. Be friendly. [4] X Research source"
    },
    {
      "title": "Keep the conversation going, but only if it seems welcome.",
      "content": "Keep the conversation going, but only if it seems welcome. Try to stay in the conversation for two full minutes, even if you fear the conversation is boring. Talk about the weather, or current events. Ask her if she did anything fun over the weekend, or if she’s seen the newest Marvel flick. It doesn’t matter what you say, so long as you keep her talking. The longer the conversation goes on, the better your chances are of making a connection. You should probably aim to keep talking for a good five to ten minutes before asking for her number. [5] X Research source Pay attention to the conversational clues she gives you. If she switches topics, do it too. If a girl is interested in you, she is going to help you out and do her part to keep the conversation rolling. If you are doing all the work, it’s probably not going well, and you should prepare to walk away gracefully."
    },
    {
      "title": "Ask for her number.",
      "content": "Ask for her number. If your initial conversation has gone well, go ahead and take the next step. You aren’t going to get to know everything about each other right there in the middle of the street. Ask her for her number, and let her know that you’ll be calling or texting her soon. Then tell her how happy you are to have met her, and let her get on with her day. If you have some free time, you could invite her to walk with you for a bit, or sit down for a cup of coffee, but the anticipation of having to wait to get to know you more can often work to your advantage, so don’t prolong it too long."
    },
    {
      "title": "Know when you’re beat, or when your advance is unwelcome.",
      "content": "Know when you’re beat, or when your advance is unwelcome. Oftentimes, the girl that you approach simply won’t be interested in you. In some cases, especially if your approach was awkward or inadvertently threatening, she may be frightened, irritated by, or even angry at your advance. Be mindful of the signals she gives off, and always be respectful. If the woman fails to respond, does not return your smile, or looks away when you attempt eye contact, she is probably not interested and is trying to be polite about it. Take the hint and move on! If she turns away, or walks off, do not try to follow her, just let her go and don’t take it personally. If she says something rude to you, don’t retaliate. Remember that YOU are the one who tried to intrude on her life uninvited, not the other way around. If you feel like you have to say something, say “I’m sorry to have bothered you,” or “Have a great day!” and leave it at that."
    },
    {
      "title": "Be aware of the line between a friendly pick-up attempt and sexual harassment, and do not cross it.",
      "content": "Be aware of the line between a friendly pick-up attempt and sexual harassment, and do not cross it. Sexual harassment laws vary by region, but in most places, making unwanted sexual advances towards another person is a criminal offense. [6] X Trustworthy Source US Equal Employment Opportunity Commission U.S. government agency that enforces civil rights in the workplace Go to source Keep your interactions with the girls you try to pick up respectful and polite. Don’t say anything to a girl you just met that you wouldn’t tell in front of your grandmother or a priest ! Back away at the first sign of disinterest."
    }
  ]
}