{
  "url": "https://www.wikihow.com/Preserve-Boxwood-Cuttings",
  "title": "How to Preserve Boxwood Cuttings",
  "steps": [
    {
      "title": "Cut 6–8 in (15–20 cm) branches off a boxwood plant.",
      "content": "Cut 6–8 in (15–20 cm) branches off a boxwood plant. Select healthy branches that are about 6–8 inches (15–20 cm) long and carefully cut them off with a sharp knife or garden shears. Keep in mind that you can preserve many cuttings at once, so don’t be afraid to select multiple branches. Continue to sever the branches off your boxwood plant until you have enough to complete your project. For the best results, you should treat high-quality cuttings as soon as they have been cut. Keep in mind that the treatment will not hide discoloration or dried leaves. If you’re using the cuttings for a project, you can adjust the size after they’ve been preserved. You can also buy high-quality cutting from home and gardening stores."
    },
    {
      "title": "Crush the end of your boxwood stems.",
      "content": "Crush the end of your boxwood stems. Re-cut the end of each stem before placing it in the solution, by cutting off approximately 1 inch (2.5 cm). Then, use a mallet or hammer to crush the ends of the stems. When placed in the solution, the crushed ends will absorb more of the glycerin solution. [1] X Research source"
    },
    {
      "title": "Choose a container for the glycerin solution.",
      "content": "Choose a container for the glycerin solution. Find a container that you can use for several weeks to preserve your cuttings. Make sure to choose a plastic or glass container that is tall and narrow. Do not use a metal container. Choosing a tall and narrow container will allow for the stem to be immersed in a greater depth of the solution with minimal waste. Rinse the container before using it. Mason jars make for good containers when preserving your cuttings. [2] X Research source"
    },
    {
      "title": "Mix 2 cups (16 oz) of warm water with 1 cup (8 oz) of glycerin.",
      "content": "Mix 2 cups (16 oz) of warm water with 1 cup (8 oz) of glycerin. Use a half-gallon (2 L) mixing container and combine both of the liquid ingredients together. Stir vigorously, but don't create air bubbles. If you need more glycerin solution, use a ratio of 1:2 glycerin to warm water and adjust the rest of the ingredients accordingly."
    },
    {
      "title": "Mix green floral dye, citric acid, and 1/2 cup (4 oz) of hot water together.",
      "content": "Mix green floral dye, citric acid, and 1/2 cup (4 oz) of hot water together. These ingredients will make up your dye mixture and will be added to the glycerin and water mixture after. Pour 1/2 cup (4 oz.) of hot water, 1 tsp. (4.92 ml) of green floral dye, and 1 tsp. (4.92 ml) of citric acid in a separate bowl. Stir continuously until the mixture is dissolved. Once you've mixed them together, combine them to your half-gallon (2 L) mixing container and continue to both liquid solutions together until they are well incorporated. The dye will help the plant to retain its natural color. If you don't use dye your boxwood cuttings will turn a golden hue."
    },
    {
      "title": "Weigh the boxwood cuttings.",
      "content": "Weigh the boxwood cuttings. You can pack as many boxwood cuttings into a single container that you want, as long as you have enough glycerin solution. For every ounce (28 g) of cuttings add 1 fluid ounce (0.125 cup) of glycerin solution in the container. Weigh your boxwood cuttings on a scale so that you know how much of the solution has to go into each container. Using the correct amount of solution will ensure that the cuttings will be flexible and won't run out of solution to absorb."
    },
    {
      "title": "Pour the proper amount of solution into your container.",
      "content": "Pour the proper amount of solution into your container. Get the container that you set aside previously for your boxwood cuttings and pour the glycerin solution into the container. Use a measuring cup to make sure that you're pouring the right amount of solution into the container. For instance, if you had 10 ounces (280 g) of boxwood cuttings, you'd need 10 fluid ounces (1.25 cups) of the solution."
    },
    {
      "title": "Place the cuttings in your container.",
      "content": "Place the cuttings in your container. Make sure the stems are arranged loosely in the container to allow for the maximum absorption of the solution. Ensure that the air can circulate around each leaf to allow for the best possible absorption of the glycerin."
    },
    {
      "title": "Leave the cuttings in the solution for 2-3 weeks.",
      "content": "Leave the cuttings in the solution for 2-3 weeks. Leave the cuttings in their containers for 2-3 weeks, or until all of the solution has been absorbed. When the cuttings are ready, they will be glossy and flexible to the touch. [3] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source For best results, create an environment that has an air temperature of between 60 and 75 degrees Fahrenheit (15.5 and 23.8 degrees Celsius), has a medium humidity, good air circulation, and is lit but not in direct sunlight."
    },
    {
      "title": "Hang the cuttings in the sun for 3 to 5 days.",
      "content": "Hang the cuttings in the sun for 3 to 5 days. When all of the solution has been absorbed, remove the cuttings. If there's any excess solution on the stems, rinse it off under cold water. Place the cuttings in a warm, sunny, and dry location for 3 to 5 days. This will allow the remainder of the water to evaporate and for the dye and glycerin to set. [4] X Research source"
    },
    {
      "title": "Move them to a dark area for 2 to 6 weeks.",
      "content": "Move them to a dark area for 2 to 6 weeks. To complete the drying process, hang the cuttings upside down in a dark, dry, and warm place for 2 to 6 weeks. After this, they should be preserved for an indefinite amount of time. Use them in a wreath-making project, put them in a vase, or use the leaves for your next craft."
    }
  ]
}