{
  "url": "https://www.wikihow.com/Reference-in-Oxford-Style",
  "title": "How to Reference in Oxford Style",
  "steps": [
    {
      "title": "Insert footnotes.",
      "content": "Insert footnotes. Click on the “insert” tab in your word processor, then choose “footer.” Microsoft Word and Google Docs both have this feature. Your citations will appear as follows: [2] X Research source Journal or print article with author: 1 T. Rock. This Smells Delicious. Journal of Cooking, vol. 40, no. 6, 2005: pp. 272-273. Journal or print article without author: 1 Cooking Makes People Happy. Journal of Cooking, vol. 40, no. 6, 2005: pp. 250-254. Book with one author: 2 T. Rock. Cooking is Fun, New York: Great Books Press, 2008, p. 22. Book with multiple authors: 2 T. Rock, J. Cena, and R. Flair. This is Cooking, New York: Great Books Press, 2009, p. 55. Book with no authors: 2 They Keep Cooking, New York: Great Books Press, 2008, pp. 46-47. Chapter in a book: 3 T. Rock. Get a Spatula. In Cooking is Fun, 46-58. New York: Great Books Press, 2008. Internet article: 4 T. Rock. I Love to Cook. Fun Cooking. 08-24-08. http:www.funcookingmag.com/I-love-to-cook/2008 (Accessed 2009-08-24). [3] X Research source"
    },
    {
      "title": "Include the superscript numbers on that page.",
      "content": "Include the superscript numbers on that page. The size of your footer will depend on how many sources you cited on a particular page. For example, the superscript number is bold: 1 T. Rock. This smells delicious. Journal of Cooking , vol. 40, no. 6, 2005, pp. 272-273. Put a space after the superscript number."
    },
    {
      "title": "Start with the author's first initial and last name.",
      "content": "Start with the author's first initial and last name. In the footnotes, the author's first name will be listed first, not the surname. For example, your entry should read M. Twain. If there is no author name, begin the entry with the title, starting with the first word that is not an article, meaning not “A,” “An,” or “The.” [4] X Research source If there are more than two authors, list them all in the same manner. If there are two authors, use \"and\" between them. If there are more than two authors, separate the names using commas, with \"and\" before the last author. For example, the author's name is bold: 1 T. Rock . This smells delicious. Journal of Cooking , vol. 40, no. 6, 2005, pp. 272-273."
    },
    {
      "title": "List the title of the work.",
      "content": "List the title of the work. An article or chapter title will be listed first without italics. You will then list the journal or book title in italics. If there is only a book title, you will list just the book title in italics. For example, the title of the article is bold: 1 T. Rock. This smells delicious . Journal of Cooking , vol. 40, no. 6, 2005, pp. 272-273. For example, the title of the journal is bold: 1 T. Rock. This smells delicious. Journal of Cooking , vol. 40, no. 6, 2005, pp. 272-273."
    },
    {
      "title": "Add the volume and issue number if you have one.",
      "content": "Add the volume and issue number if you have one. If you are using a journal article, you need to specify for the reader which one they should refer to when looking for your source material. List these directly after the article name, separated by commas. For example, the volume and issue number are bold: 1 T. Rock. This smells delicious. Journal of Cooking , vol. 40, no. 6 , 2005, pp. 272-273."
    },
    {
      "title": "Use the publishing city and publisher if it's a book.",
      "content": "Use the publishing city and publisher if it's a book. Look on the title page of the book for the publishing company. List the company's city, then the company name. If there is more than one city listed, choose the one closest to your city. For example, the city and publisher are bold: 2 T. Rock. Cooking is Fun , New York: Great Books Press , 2008, p. 22."
    },
    {
      "title": "Include the year number.",
      "content": "Include the year number. For a journal or article, put the year after the volume and issue number. If you're citing a book, put the year after the publisher. For example, the year in a journal article is bold: 1 T. Rock. This smells delicious. Journal of Cooking , vol. 40, no. 6, 2005 , pp. 272-273."
    },
    {
      "title": "Finish with the page number.",
      "content": "Finish with the page number. If there is a page number to cite, place it last. Write p. before one page and pp. before multiple pages. For example, the page number for a journal article is bold: 1 T. Rock. This smells delicious. Journal of Cooking , vol. 40, no. 6, 2005, pp. 272-273 . For example, the page number for a book is bold: 2 T. Rock. Cooking is Fun , New York: Great Books Press, 2008, p. 22 ."
    },
    {
      "title": "Create a separate page at the end of your document.",
      "content": "Create a separate page at the end of your document. Your reference page will include all of your sources on one page. You can copy and paste the entries from your footnotes, but be prepared to fix the author names, which will be listed differently. [5] X Research source Title your page \"Reference List.\" [6] X Research source On your reference page, you will list author surname first, rather than the author's first name."
    },
    {
      "title": "List all of your references in alphabetical order by surname.",
      "content": "List all of your references in alphabetical order by surname. While in the text of the paper you will list the sources in the order you cite them, on your reference list they will be organized by alphabetical order. List the author's surname first for each entry. Otherwise, your entries will look exactly the same as they did in the footnotes. [7] X Research source If there is no author, use the first word in the title. [8] X Research source A typical journal entry will look like this: Rock, T. This smells delicious. Journal of Cooking , vol. 40, no. 6, 2005, pp. 272-273. A typical book footnote will look like this: Rock, T. Cooking is Fun , New York: Great Books Press, 2008, p. 22. A book chapter entry will look like this: Rock, T. Get a Spatula. In Cooking is Fun , New York: Great Books Press, 2008, pp. 46-58. An internet article looks like this: Rock, T. I love to cook. Fun Cooking . 08-24-08. http:www.funcookingmag.com/I-love-to-cook/2008 (Accessed 2009-08-24). [9] X Research source If there are two authors, alphabetize it by the first author's last name, then list the remaining authors. [10] X Research source"
    },
    {
      "title": "Arrange pieces by the same author according to date.",
      "content": "Arrange pieces by the same author according to date. If you used two pieces by T. Rock that were published in 2005 and 2006, then you would list them in that order, regardless of the title names. [11] X Research source"
    },
    {
      "title": "Provide page ranges for articles and chapters.",
      "content": "Provide page ranges for articles and chapters. The reference page is where you will provide precise page ranges for your citations. If you are citing a whole book, then you do not need to provide a page range. If you are using a section of a work, such as an article that appeared in a journal or a chapter in a book, then you need to provide that exact page range in your reference page entry. [12] X Research source For example, the page range is in bold: Rock, T. This smells delicious. Journal of Cooking , vol. 40, no. 6, 2005, pp. 272-273 . Use a p. for one page or a pp. for multiple pages."
    }
  ]
}