{
  "url": "https://www.wikihow.com/Sing-Deeper",
  "title": "How to Sing Deeper",
  "steps": [
    {
      "title": "Establish good technique.",
      "content": "Establish good technique. Vocalists typically spend years training to perfect their skill. Do your best to master your current vocal range before attempting to expand it. Whenever possible, work with a professional voice teacher to help guide you. These experienced teachers are likely to pinpoint the exact ways in which you can improve. They can also teach you methods of protecting your voice and steer you away from damaging techniques. This is especially important if you are attempting to add to your vocal range, as you will be purposefully testing your limits. To find the right voice teacher, do an online search for teachers in your area. Ask for recommendations from friends and acquaintances, then narrow your search by choosing teachers who specialize in the area you want to improve. Meet with at least 3 teachers to determine which one you connect with the best."
    },
    {
      "title": "Use strong breath support.",
      "content": "Use strong breath support. Even though lower notes require less air than high notes, it's still important to develop good breath support. [1] X Research source Aim to a balance, as too-shallow breath will prevent a singer from holding a note, while breathing too deeply can cause tension and strain. [2] X Research source This added tension can reduce your vocal range, as your vocal cords need to be relaxed to sing low notes. [3] X Research source Regular aerobic exercise will increase your lung capacity, which is a benefit for any vocalist. Pre-performance light aerobic exercise has also been shown to positively impact the efficiency of vocal warm-ups. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Use a personal humidifier to hydrate your vocal cords.",
      "content": "Use a personal humidifier to hydrate your vocal cords. Your vocal cords will be relaxed and loose while singing low notes. To help keep them in great shape, use a personal humidifier before you begin warming up. You can also use it after exercising your vocals. This device is like a sauna for your voice and will help keep it in good shape."
    },
    {
      "title": "Warm up your voice",
      "content": "Warm up your voice . Before singing, always make sure to warm up first. A good vocal warm-up will release tension and prepare your voice to use its full vocal range. Take a few breaths. Keep your posture upright with your shoulders and chest low and relax. Breathe normally and focus your attention on the muscles of your chest, neck, and shoulders. Are any of these tense? Keep breathing and focus on relaxing these muscles. Practice your scales. Sing a few notes, starting in a low pitch and ending in a high one. Do the same, only from high to low this time. Do this with a few different sounds (such as \"oo,\" \"me,\" and \"e\"). Make a \"kazoo\" buzz. Round your lips, inhale, and then exhale while making a \"woo\" sound at a single pitch. There should be a slight buzzing. Do a few scales like this. [5] X Research source"
    },
    {
      "title": "Accept your limitations.",
      "content": "Accept your limitations. While there are steps you can take to train your voice, there is a practical limit to how low you can get your voice to go. Your vocal range is determined by your unique anatomy, and it isn't something you can change. If you are naturally a tenor, you will probably not be able to reach the lowest notes that a bass singer can. Instead of attempting the impossible, work with the range you have. Keep in mind that your range is mostly determined by the length of your vocal cords, which usually correlates with the length of your neck. The longer your vocal cords, the deeper your voice will go. Men tend to have larger vocal cords compared to women. For that reason, men usually have lower singing voices. [6] X Research source"
    },
    {
      "title": "Remember to keep your larynx relaxed and low.",
      "content": "Remember to keep your larynx relaxed and low. The larynx naturally dips when we inhale. Maintaining this lowered position is a major component of what some vocalists call singing with an \"open throat.\" Allow your volume to decrease as you sing the lowest notes in your range to ensure your larynx stays relaxed. [7] X Research source Relaxing your larynx will help you to utilize your full low range potential. Many inexperienced vocalists sing with a raised larynx. This produces a much higher, softer sound lacking depth. The second major aspect of an \"open throat\" is a lifted soft palate. However, this action is largely important for singing higher notes rather than low ones. The larynx is also colloquially known as the voice box. It is a complex organ that regulates the tension of your vocal cords and consequently the sound of your voice. The Adam's apple, a structure clearly visible on the throat of most men and some women, is part of the larynx. [8] X Research source"
    },
    {
      "title": "Avoid techniques to control the larynx itself.",
      "content": "Avoid techniques to control the larynx itself. While a longer (or \"dropped\") larynx will produce a slightly deeper sound, exercising direct control of your larynx will damage your voice. Forcing an unnaturally low (or \"depressed\") larynx is not advised. Instead, you will work to control and relieve tension in the muscles surrounding it. Another common mistake is using the tongue to push down on the voice box. While this will technically lower your larynx, it will actually cause the muscles in your throat to tighten, damaging your voice's sound and range. [9] X Research source Remember that the ideal open throat should be free of tension. If you ever find yourself straining, reevaluate your technique."
    },
    {
      "title": "Begin by feeling your voice box.",
      "content": "Begin by feeling your voice box. Gently place your hand over it. If you can't see your larynx, feel for a slight bump on the front of your throat right under your jaw. Make sure your fingers are only lightly touching your larynx without exerting pressure on it."
    },
    {
      "title": "Sing a few different notes with your hand still in place.",
      "content": "Sing a few different notes with your hand still in place. Pay attention to any changes in position your larynx may make. Is it moving up with your higher notes? If you feel your larynx slightly tilt or pivot, rather than move upwards, then you already have this technique mastered. Your larynx must move slightly for your voice to change pitch. Never hold your larynx in place with your hand. This technique can cause bruising and seriously damage your voice."
    },
    {
      "title": "Try to sing without raising your larynx.",
      "content": "Try to sing without raising your larynx. The position of your larynx can be seen as a barometer for spotting tension in your throat. Keeping these muscles relaxed is key for vocal quality in general and is especially important for achieving deeper notes. If you're having trouble keeping your larynx low, try deep breathing exercises. Slowly inhale and exhale while feeling your larynx with your hand. When your larynx is low during inhalation, pay attention to which muscles in your throat and jaw relax. Try to replicate this when singing. This may take some time to master properly, especially if you're new to singing. Don't get discouraged if you can't do it right away."
    },
    {
      "title": "Massage your throat.",
      "content": "Massage your throat. As you sing low notes, your vocal cords shorten and thicken to produce the sound and they vibrate slower than they do when singing high notes. [10] X Research source The only way for you to effectively keep your larynx low is to relax its associated muscles. If you're having trouble maintaining a low larynx, try using either your fingers or an electric massager to gently work over your throat. Press your fingers or massager down firmly but without force. Gently move your fingers from side to side. Start at your hyoid bone, which is located between your chin and larynx. Massage this area and the muscles surrounding it. Massage your larynx using your hands and breathing exercises. Place the backs of your hands on either side of your larynx and gently move it from side to side. Then, use the back of your hand to hold it to the right and take a few slow, deep breaths through your nose. Do the same with your larynx held to the left. [11] X Research source"
    },
    {
      "title": "Resonate in your chest.",
      "content": "Resonate in your chest. Place your hand on your chest, just below your collarbone. Relax, then sing a few low notes. Use your hand to feel the gentle vibration in your chest as you sing. Ensure the resonation doesn't occur higher up in your throat. Practice holding low notes to give the resonation time to relax into your chest. [12] X Research source"
    },
    {
      "title": "Determine the bottom of your vocal range.",
      "content": "Determine the bottom of your vocal range. In order to safely learn to sing lower notes, you will first need to find the lowest note you can currently sing. Either use a pre-recorded tool online or have a partner play notes on a piano. Starting from C4, try to sing that note. Work your way down until you reach a note you either cannot match at all or that you strain to sing. The previous note is the bottom of your current range. [13] X Research source Because it can be difficult to judge our own voices accurately, it is especially helpful to have a vocal coach or someone else with musical training for this step. Or, use an app like SingScope if you need help."
    },
    {
      "title": "Start slowly.",
      "content": "Start slowly. Try your best to work on just the next lowest note after the bottom of your vocal range. Practice with a scale that includes just a few other notes along with the one you're working on. Perform these scales daily for roughly half an hour. Stop the exercise if your voice begins to strain. Practice relaxing into low notes each day to increase your vocal flexibility. The vocal cords are muscles, so frequent practice can help strengthen them, allowing you to sing lower notes over time. [14] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source For example, if C2 is the lowest note you have currently mastered, try singing B1 next."
    },
    {
      "title": "Perfect the note before moving on.",
      "content": "Perfect the note before moving on. Before going to the next lower note, it's important that you can consistently hit your new note. If you can't comfortably sing one note lower, you will not be able to perform the note below it. If you're finding that your voice breaks frequently during these exercises, you will likely benefit from revisiting a higher note and working on that one first."
    }
  ]
}