{
  "url": "https://www.wikihow.com/Retrieve-an-Item-That-Was-Flushed-Down-a-Toilet",
  "title": "How to Retrieve an Item That Was Flushed Down a Toilet",
  "steps": [
    {
      "title": "Grab the item with your hands if it’s still visible.",
      "content": "Grab the item with your hands if it’s still visible. If you can still see the item after it was flushed, you may be able to retrieve the item by sticking your hand in the toilet, grabbing ahold to the item, and pulling it out. [1] X Research source To make this process as sanitary as possible, put on a pair of elbow-length rubber gloves before sticking your hand in the toilet. If there is a lot of water in the toilet bowl, it may be easier to reach the item if you use a disposable cup or container to scoop out some of the water first. Make sure that you wash your hands and the item thoroughly after retrieving it from the toilet."
    },
    {
      "title": "Try using a bent hanger to hook onto the item.",
      "content": "Try using a bent hanger to hook onto the item. First, take a metal hanger and untwist the end that is twisted around the neck of the hanger hook. Straighten the hanger out as much as possible before bending one end into a small hook shape. Then, carefully stick the hook end down the toilet drain and try to grab hold of the item with the hook. When pushing the hook end down the drain, try to gently trace the top of the drain pipe to avoid pushing the item further down. Then, when the hook is down as far as it can go, push it down and gently trace the bottom of the drain pipe as you pull the hook back up. Hopefully, the hook will catch hold of the item on its way out. Depending on how your toilet drain is shaped, you may need to bend the hanger to allow it to bend into the drain pipe. If the item is made of common metal, try pushing a flexible magnetic retriever into the toilet drain and through the toilet trap. However, this won't work on solid gold or silver. [2] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 13 December 2021."
    },
    {
      "title": "Use a drain snake if the item is far down the toilet drain.",
      "content": "Use a drain snake if the item is far down the toilet drain. First, stick the coiled or hooked end of the drain snake down into the toilet drain until you can feel the item or know that you’ve reached the place where it’s resting or lodged. Once you’ve located the item, try to grab hold of the item by pushing the coil or hook slightly past the item, then catching it as you pull the snake back up the drain. [3] X Research source If you aren’t sure where the item is and didn’t feel it as you pushed the drain snake down, push the snake down as far as it will go. Then, try to feel around for the item as you slowly pull the drain snake back out. Drain snakes are available online and at most home improvement stores. When choosing a drain snake to use, choose an option that has a coiled or hooked end. This will make it easier for you to grab ahold of the item."
    },
    {
      "title": "Remove the dry dust bag and filter if your wet vacuum has a dry option.",
      "content": "Remove the dry dust bag and filter if your wet vacuum has a dry option. First, remove the top of the vacuum’s collection tank. Then, following the instructions for your particular vacuum model, remove the dry dust bag and filter from the collection tank. This will keep both the dust bag and filter from getting wet and growing mildew over time. [4] X Research source After removing the dry dust bag and filter, put the top back on the collection tank."
    },
    {
      "title": "Direct the vacuum hose into the toilet.",
      "content": "Direct the vacuum hose into the toilet. Plug in the vacuum cord and turn on the vacuum. Then, hold onto the hose of the vacuum and direct the end of the hose into the toilet. Push the hose as far down the drain as possible. [5] X Research source You may feel or hear the item move as you push the hose down. If so, direct the end of the hose so that the opening points at the item."
    },
    {
      "title": "Turn the vacuum on to start sucking up the water.",
      "content": "Turn the vacuum on to start sucking up the water. Turn the vacuum on to start sucking up the toilet water. Keep sucking up the water until you hear the object pass through the hose, or until the collection tank is full. [6] X Research source Some wet/dry vacuums have a separate setting when vacuuming water, so make sure that you turn your vacuum on accordingly."
    },
    {
      "title": "Check the vacuum’s collection tank to retrieve the item.",
      "content": "Check the vacuum’s collection tank to retrieve the item. If you heard or saw the item go through the vacuum’s hose, or if the collection tank is starting to get full, turn the vacuum off. Then, remove the top of the vacuum’s collection tank and look into the tank to see if the item was sucked up through the hose. If you see the item, you can retrieve it with your hands, a shovel, or any item with a scoop or hook on the end. [7] X Research source If you don’t see the item in the collection tank but you suspect that it was sucked up, check the vacuum’s hose as well. The item may have gotten lodged in the hose."
    },
    {
      "title": "Empty the collection tank and vacuum again.",
      "content": "Empty the collection tank and vacuum again. If the item is not in the collection tank or hose, it’s likely that it’s still in the toilet. To try again, first empty the water out of the collection tank. Then, put the hose back into the drain and turn the vacuum on again. Keep vacuuming until you hear or see the item get sucked into the hose, or until the collection tank gets full again. You may need to repeat this process a few times before the item gets sucked up into the vacuum."
    },
    {
      "title": "Flush the toilet to refill the toilet bowl with water.",
      "content": "Flush the toilet to refill the toilet bowl with water. After you’ve retrieved the item, flush the toilet once or twice. The toilet bowl should refill with water and be ready to use. [8] X Research source"
    },
    {
      "title": "Turn off the toilet’s water supply.",
      "content": "Turn off the toilet’s water supply. First, locate the valve on the side, behind, or towards the bottom of the toilet. Then, turn the valve clockwise several times until it won’t turn anymore. This will turn off the toilet’s water supply, which will help you avoid any flooding and keep the toilet from flushing while you work. [9] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 13 December 2021. If you can’t find the valve or if the valve is stuck in place, you’ll likely need to turn off the water to your house for a short time. In most cases, you can do this by switching off the water supply from the control unit, which is usually located in the basement or an interior closet."
    },
    {
      "title": "Take the lid off the toilet’s tank.",
      "content": "Take the lid off the toilet’s tank. Most toilets have a water tank in the back behind the bowl that has a removable lid. Carefully lift the lid to remove it from the tank and set it aside. This will allow you to easily access the inside of the tank, and will help keep the lid from falling off or getting crack when you remove the toilet. [10] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 13 December 2021."
    },
    {
      "title": "Remove all the remaining water from the tank and bowl.",
      "content": "Remove all the remaining water from the tank and bowl. Using a wet vacuum or small container, vacuum or scoop out all the water from both the tank and the toilet bowl. This will keep any water from spilling or splashing onto you or the bathroom floor, and will make the toilet lighter and easier to lift. You can also use a baster to suction water out of the tank and bowl."
    },
    {
      "title": "Unscrew the bolts or screws from the bottom of the toilet.",
      "content": "Unscrew the bolts or screws from the bottom of the toilet. In most cases, your toilet will be connected to the floor by at least 2 bolts or screws. Using either a wrench or a screwdriver (depending on whether your toilet has bolts or screws), unscrew the bolts or screws from either side of the bottom of the toilet. This will disconnect your toilet from the floor and enable you to remove it from the ground. [11] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 13 December 2021. Set the bolts or screws aside in a safe place so you’ll be able to use them later to re-secure your toilet into place."
    },
    {
      "title": "Detach the water supply line from the tank.",
      "content": "Detach the water supply line from the tank. Locate the large bolt that attaches the water supply line to the back of the toilet’s tank. Then, twist the bolt counter-clockwise until it comes undone and the water line is detached. [12] X Research source The water line bolt is usually a large plastic bolt with ridges to make it easier to grip and unscrew."
    },
    {
      "title": "Lift the toilet and lay it on its side.",
      "content": "Lift the toilet and lay it on its side. In order for you to be able to look up inside the toilet to retrieve the flushed item, you’ll need to lay the toilet on its side. To do this, find a grip on either side of the toilet that feels comfortable and secure. Then, carefully lift the toilet up away from its spot on the ground. Lay it down on its side carefully. Toilets are very heavy, so be sure to lift with your legs, not your back. [13] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 13 December 2021. You may also want to get someone to help you lift the toilet and get it safely down on its side. You may want to lay a towel or blanket down on the ground so that your toilet will be protected when you lay it on its side."
    },
    {
      "title": "Look inside the toilet to retrieve the flushed item.",
      "content": "Look inside the toilet to retrieve the flushed item. With the toilet is laying on its side, check inside the waste opening to see if you can find and reach the flushed item. If you can see the item, you should be able to reach it with your hands or with any other retrieval device. [14] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 13 December 2021. The inside of the waste opening may be dark, so it can be helpful to have a flashlight on hand to help you see into the toilet. In addition to the waste opening, you may also want to look at the wax ring that runs along the bottom of the toilet, as very small items, such as a piece of jewelry, could’ve gotten caught on the wax ring."
    },
    {
      "title": "Put the toilet back and re-secure it into its place.",
      "content": "Put the toilet back and re-secure it into its place. Carefully turn the toilet back upright and lift it back into place. Reconnect the toilet to the ground by twisting the bolts or screws back into the bottom. Then, reconnect the water line and twist the valve counter-clockwise to turn the toilet’s water supply back on. Flush the toilet once or twice to refill the tank and bowel, and then your toilet should be ready to use again."
    }
  ]
}