{
  "url": "https://www.wikihow.com/Run-a-.Jar-Java-File",
  "title": "How to Run a .Jar Java File",
  "steps": [
    {
      "title": "Install Java",
      "content": "Install Java on your computer if it isn't installed. You can't run JAR files without Java installed on your computer. If you don't already have Java installed, go to Java's website at https://www.java.com/en/download/ and click the Free Java Download button below the latest version of Java, then install Java once it downloads. You may have to restart your computer for Java to be fully implemented."
    },
    {
      "title": "Double-click the JAR file.",
      "content": "Double-click the JAR file. If it's executable and you have Java installed, it should open. If it doesn't open, proceed to the next step. You may see a pop-up window asking which program you want to use to open the file. If so, click Java(TM) and then click OK ."
    },
    {
      "title": "Make sure your JAR file is an executable file.",
      "content": "Make sure your JAR file is an executable file. JAR files that you download in order to set up programs are different from \"library\" JAR files, which store data that a program running Java can use. Since they don't have interfaces like executable JAR files, you cannot run non-executable JAR files. For example, many of the JAR files in a program's data folders are not executable files. If you downloaded your JAR file from online, make sure you clicked the Windows version of the file rather than the Mac version."
    },
    {
      "title": "Update Java.",
      "content": "Update Java. If your JAR file produces an error when you double-click it, you may need to update Java. To do so: Open Start . Scroll down and click the Java folder. Click Check For Updates . Click Update Now on the Update tab."
    },
    {
      "title": "Double-click your JAR file again.",
      "content": "Double-click your JAR file again. If it doesn't open this time, the file you're trying to open isn't executable and thus cannot be \"run\" in the traditional sense."
    },
    {
      "title": "Install Java",
      "content": "Install Java on your computer if it isn't installed. You can't run JAR files without Java installed on your computer. If you don't already have Java installed, go to Java's website at https://www.java.com/en/download/ and click the Download button below the latest version of Java, then install Java once it downloads. When installing a non-Apple file on Mac, you may have to first click OK on the warning, click the Apple menu , click System Preferences , click Security & Privacy , unlock the menu, click Open Anyway next to the file's name, and then click Open when prompted before you can install the file."
    },
    {
      "title": "Try double-clicking your JAR file.",
      "content": "Try double-clicking your JAR file. If it's executable and you have Java installed, it should open. If double-clicking the file doesn't open it, proceed to the next step."
    },
    {
      "title": "Make sure your JAR file is an executable file.",
      "content": "Make sure your JAR file is an executable file. JAR files that you download in order to set up programs are different from \"library\" JAR files, which store data that a program running Java can use. Since they don't have interfaces like executable JAR files, you cannot run non-executable JAR files. For example, many of the JAR files in a program's data folders are not executable files. If you downloaded your JAR file from online, make sure you downloaded the Mac version and not another operating system's version."
    },
    {
      "title": "Update Java.",
      "content": "Update Java. If your JAR file produces an error when you double-click it, you may need to update Java. To do so: Open the Apple menu . Click System Preferences . Click Java . Click the Update tab. Click Update Now ."
    },
    {
      "title": "Double-click your JAR file again.",
      "content": "Double-click your JAR file again. If it doesn't open this time, the file you're trying to open isn't executable and thus cannot be \"run\" in the traditional sense."
    }
  ]
}