{
  "url": "https://www.wikihow.com/Pin-a-Tweet",
  "title": "Your Ultimate Guide to Pinned Tweets: What, How, and Why",
  "steps": [
    {
      "title": "A pinned tweet is a tweet that is static at the top of your profile.",
      "content": "A pinned tweet is a tweet that is static at the top of your profile. When someone clicks on your Twitter profile, they will see all of your tweets in chronological order underneath your bio. If you have a tweet you want someone to see before your other tweets, you can pin it. As of July 2023, Twitter is now called \"X\" and tweets are now called \"posts.\" However, many users are still using the terms \"Twitter\" and \"tweet.\""
    },
    {
      "title": "Navigate to the tweet you want to pin.",
      "content": "Navigate to the tweet you want to pin. You can get there from your Twitter profile or from a direct link you might have to the tweet. [1] X Research source"
    },
    {
      "title": "Click the three-dot menu in the upper-right corner of the tweet.",
      "content": "Click the three-dot menu in the upper-right corner of the tweet. This will drop down a menu with various options. [2] X Research source"
    },
    {
      "title": "Select Pin to your profile.",
      "content": "Select Pin to your profile . It's the second option, and has a pin icon. The tweet will now be the first tweet on your profile with a tag that says Pinned . [3] X Research source You can unpin the tweet by clicking the three-dot menu on your pinned tweet and selecting Unpin from profile . You can also replace your pinned tweet by pinning a new tweet without unpinning your current pinned tweet."
    },
    {
      "title": "Pinned tweets get more visibility.",
      "content": "Pinned tweets get more visibility. If you have a tweet you want people to see the second they hop onto your profile, having a pinned tweet is perfect for that—especially if you have a popular account that gets a lot of views."
    },
    {
      "title": "Pinned tweets can be an extension of your bio.",
      "content": "Pinned tweets can be an extension of your bio. Twitter bios can only be 160 characters long. However, Tweets for standard Twitter users can have 280 characters, which can drastically increase the amount of information you can include near the top of your profile."
    },
    {
      "title": "Pinned tweets can hold extra important information.",
      "content": "Pinned tweets can hold extra important information. If you have links to a shop or other social media accounts, pinning them in a tweet makes it easier for others to get to your shop or socials without you having to put it in your bio or retweet often."
    },
    {
      "title": "A popular tweet.",
      "content": "A popular tweet. If you have a tweet that went viral , you may want to pin it to your profile to either show off your achievement or so others can see what you wrote."
    },
    {
      "title": "A funny tweet.",
      "content": "A funny tweet. If you wrote a tweet that you think is particularly funny, pinning it to your profile means that everyone who clicks on your profile will see it as well."
    },
    {
      "title": "Links you want others to find.",
      "content": "Links you want others to find. If you have an online store or you're a content creator, having a pinned tweet with your shop link or latest blog post or video is an easy way to direct traffic to those links. Many users also put links to their other social medias in their pinned tweet so followers can find them elsewhere."
    },
    {
      "title": "An introduction.",
      "content": "An introduction. Twitter bios are pretty short, so it's hard to go in depth about yourself in them. If you want to have a little more room to introduce yourself to potential Twitter followers, a pinned tweet can work great for that."
    },
    {
      "title": "Your favorite tweet.",
      "content": "Your favorite tweet. Simply put, you can pin any tweet you want to the top of your profile. If you have a tweet you really like, pin it to your profile so new followers (and you!) can find it and see it easily."
    }
  ]
}