{
  "url": "https://www.wikihow.com/Plant-Hostas",
  "title": "How to Plant Hostas",
  "steps": [
    {
      "title": "Wait for the right time to plant hostas.",
      "content": "Wait for the right time to plant hostas. Hostas aren't overly sensitive to cold, so you can plant them as soon as the ground is warm enough to work in the spring. Spring and late summer are the ideal times to plant hostas, because they are in active growth phases and will take root easily. If you're going to plant hostas in late summer, do it at least six weeks before the first frost. [1] X Trustworthy Source University of Georgia Cooperative Extension Division of the University of Georgia focused on research and community education Go to source"
    },
    {
      "title": "Choose a location with the right amount of shade.",
      "content": "Choose a location with the right amount of shade. Hostas are shade-tolerant plants that require minimal amounts of sunlight – though they also won’t thrive in deep shade. The ideal location is somewhere protected from strong winds and hail, that’s shaded between the hours of noon and 4 p.m., and that receives some filtered sunlight. You can protect hostas from sun, wind, and hail by planting them under established trees. Make sure you don’t plant them too close to the roots, however, or the hostas will have to compete for nutrients. Hosta’s shade tolerance depends on the type. As a rule, those with yellow leaves can survive more sunlight than hostas with green, blue, or white leaves. Blue hostas need the most protection from the sun. [2] X Research source Hostas will also thrive near outer building corners that still get some mild sun exposure."
    },
    {
      "title": "Amend and till the soil.",
      "content": "Amend and till the soil. In the area where you want to plant the hostas, till the ground to a depth of 8 inches (20 cm) using a manual tiller, rototiller, or hoe. [3] X Research source Amend the soil with organic matter that will loosen the soil, discourage rodents, and acidify the soil slightly. Good organic matter for hostas includes aged manure or compost, peat moss, and leaf mulch. The ideal pH for hostas is between 6 and 6.5. Hostas don’t need a large space for planting. If you're planting individual hostas, the hole only needs to be as wide as the root system."
    },
    {
      "title": "Soak the plants.",
      "content": "Soak the plants. Sometimes hostas come from nurseries in bags with bare roots. It’s especially important to soak the roots if that’s the case with your hostas, because it will help prepare the plants for transplanting. Choose a bucket or bowl that’s slightly smaller than the crown of the hosta. Fill the bucket with cold water. Rest one hosta crown on the rim of the bucket so the roots are soaking in the water below. Repeat for each hosta. Soak the plants for at least an hour before transplanting. If you're not transplanting the hostas immediately, leave them soaking to keep the roots moist."
    },
    {
      "title": "Untangle the roots.",
      "content": "Untangle the roots. Right before planting, remove the hostas from the buckets and use your hands to gently untangle the roots. Use your fingers to carefully comb the roots so there aren't any tangles, and ensure all the roots are facing the direction they're growing in. Hostas, especially potted ones, are susceptible to tangled roots. The plants can strangle themselves if you try to plant them in the ground with their roots tangled."
    },
    {
      "title": "Dig holes and plant the hostas.",
      "content": "Dig holes and plant the hostas. For each hosta, dig a hole in your prepared garden bed that’s about 2.5 feet (76 cm) wide and 1 foot (30 cm) deep. Place one hosta in each hole, making sure the roots don’t become bent or tangled. Fill the hole loosely with soil, but do not pack the soil around the roots. Make sure only the roots of the plant are buried, and that the entire crown is above the ground. [4] X Research source Water each plant thoroughly immediately after planting. Leave enough space between the hostas to accommodate for their mature width. This will depend on the variety of hosta you have. If you're not sure, leave about 3 feet (76 cm) of space between the hostas."
    },
    {
      "title": "Add a top layer of mulch.",
      "content": "Add a top layer of mulch. The mulch will help keep the soil moist, prevent weeds from growing, and protect the plants from rodents. After planting, add a 3-inch (7.6-cm) layer of mulch to the top of the garden bed around the hostas. Ideal mulch for hostas includes shredded bark, pine needles, or mulched leaves."
    },
    {
      "title": "Provide the plants with consistent moisture.",
      "content": "Provide the plants with consistent moisture. Soak the soil after you plant the hostas. Keep the soil evenly and consistently moist throughout the life of the plants. Hostas that are exposed to lots of sunlight need even more water to prevent burning. [5] X Research source Give the hostas about an inch (2.5 cm) of water per week during active growing phases in spring and summer."
    },
    {
      "title": "Prune dead leaves in fall.",
      "content": "Prune dead leaves in fall. Hostas will enter a dormant state in fall and winter, meaning they won’t grow and won’t require as many nutrients. When fall arrives, prune the hostas by trimming off dead or yellow leaves. [6] X Research source Dying leaves can still suck nutrients from a plant, so you can help the hostas conserve energy for winter by removing these leaves in fall."
    },
    {
      "title": "Prepare the hostas for winter.",
      "content": "Prepare the hostas for winter. Hostas are hardy plants and will survive the winter, but they’ll have a better chance of thriving if you prepare them for the colder months. After the ground freezes, cover the ground around the hostas with fallen leaves, and pack more leaves around the crowns of the plants. [7] X Research source Leave the hostas packed and covered with leaves until after the last frost in spring. Covering the plants with organic matter will also help maintain the soil temperature and moisture level."
    }
  ]
}