{
  "url": "https://www.wikihow.com/Raise-Friendship-Level-in-the-Pok%C3%A9mon-Games",
  "title": "How to Raise Friendship Level in the Pokémon Games",
  "steps": [
    {
      "title": "Walk 128 steps.",
      "content": "Walk 128 steps. This has a chance or raising your entire party's friendship level by +2 points, or +1 level at friendship levels 200 - 255. Generation 7 games include the following: Pokémon Sun, Moon, Ultra Sun, and Ultra Moon. These steps apply to all games in Generation 7, unless otherwise stated. To avoid lowering a Pokémon's level, don't let it faint. Don't use Heal Powder, Energy Root, Revival Herb, or Energy Powder."
    },
    {
      "title": "Get a massage.",
      "content": "Get a massage. You can get a message at Konikoni City. This raises your Pokémon's friendship level between +10 to +40 points."
    },
    {
      "title": "Get a friendly drink, lunch, or combo at the food stalls.",
      "content": "Get a friendly drink, lunch, or combo at the food stalls. This raises your Pokémon's level between +5 to +20 points, depending on what you order."
    },
    {
      "title": "Visit the hot springs at Isle Avue.",
      "content": "Visit the hot springs at Isle Avue. This raises your Pokémon's level +5 points."
    },
    {
      "title": "Battle against the Island Kahuna, an elite four member, or the Champion.",
      "content": "Battle against the Island Kahuna, an elite four member, or the Champion. This raises your Pokémon's friendship level +5 points at levels 0-99, +4 points at levels 100 - 199, and +3 points at levels 200 - 255."
    },
    {
      "title": "Level up your Pokémon.",
      "content": "Level up your Pokémon. You can level up your Pokémon in battle. This will raise your Pokémon's level +5 points at friendship levels 0 -99, +3 points at friendship levels 100 - 199, and +2 points at friendship levels 200 - 255."
    },
    {
      "title": "Use a Wing.",
      "content": "Use a Wing. This raises your Pokémon's friendship level +3 points at levels 0 - 99, +2 levels at levels 100 - 199, and +1 point at 200 - 255."
    },
    {
      "title": "Use vitamins.",
      "content": "Use vitamins. These include the following: HP Up, Protein, Iron, Calcium, Zinc, Carbos, PP Up, PP Max, and Rare Candy."
    },
    {
      "title": "Using EV Berries.",
      "content": "Using EV Berries. These include the following: Pomeg Berry, Kelpsy Berry, Qualot Berry, Hondew Berry, Grepa Berry, and Tamato Berry."
    },
    {
      "title": "Use a battle item.",
      "content": "Use a battle item. This raises your Pokémon's frienship level +1 point at frienship levels 0–199. Battle items include the following: X Attack, X Defense, X Speed, X Sp. Atk, X Sp. Def, X Accuracy, Dire Hit, and Guard Spec."
    },
    {
      "title": "Walk 128 steps.",
      "content": "Walk 128 steps. This has a chance or raising your entire party's friendship level by +2 points, or +1 level at friendship levels 200 - 255. The games that are included in Generation 6 are the following: X, Y, Omega Ruby, and Alpha Sapphire versions. These steps apply to all Generation 6 Pokémon games unless otherwise noted. To avoid lowering a Pokémon's level, don't let it faint. Don't Heal Powder, Energy Root, Revival Herb, or Energy Powder"
    },
    {
      "title": "Get a massage.",
      "content": "Get a massage. In games X and Y, talk to the lady in Cyllage City. In Omega and Sapphire, she is located in Mauville City. In X and Y, you can also get a massage at Secret Pals."
    },
    {
      "title": "Do super training with a soothing bag.",
      "content": "Do super training with a soothing bag. This raises your Pokémon's friendship level +20 points."
    },
    {
      "title": "Order a drink at the Juice Shoppe.",
      "content": "Order a drink at the Juice Shoppe. A custom made colorful shake will raise your Pokémon's friendship level +12 up to +32 points, depending on what berries are used. You can also raise your Pokémon's friendship level +4 points by ordering a Rare Soda, Ultra Rare Soda, Perilous Soup, or EV Juices"
    },
    {
      "title": "Battle against the gym leader, an elite four member, or the Champion.",
      "content": "Battle against the gym leader, an elite four member, or the Champion. This raises your Pokémon's friendship level +5 points at levels 0-99, +4 points at levels 100 - 199, and +3 points at levels 200 - 255."
    },
    {
      "title": "Use a Wing.",
      "content": "Use a Wing. This raises your Pokémon's friendship level +3 points at levels 0 - 99, +2 levels at levels 100 - 199, and +1 point at 200 - 255."
    },
    {
      "title": "Use vitamins.",
      "content": "Use vitamins. These include the following: HP Up, Protein, Iron, Calcium, Zinc, Carbos, PP Up, PP Max, and Rare Candy. This will raise your Pokémon's level +5 points at friendship levels 0 -99, +3 points at friendship levels 100 - 199, and +2 points at friendship levels 200 - 255."
    },
    {
      "title": "Level up your Pokémon.",
      "content": "Level up your Pokémon. You can level up your Pokémon in battle. This will raise your Pokémon's level +5 points at friendship levels 0 -99, +4 points at friendship levels 100 - 199, and +3 points at friendship levels 200 - 255."
    },
    {
      "title": "Using EV Berries.",
      "content": "Using EV Berries. These include the following: Pomeg Berry, Kelpsy Berry, Qualot Berry, Hondew Berry, Grepa Berry, and Tamato Berry. This will raise your Pokémon's level +5 points at friendship levels 0 -99, +3 points at friendship levels 100 - 199, and +2 points at friendship levels 200 - 255."
    },
    {
      "title": "Use a battle item.",
      "content": "Use a battle item. This raises your Pokémon's frienship level +1 point at frienship levels 0–199. Battle items include the following: X Attack, X Defense, X Speed, X Sp. Atk, X Sp. Def, X Accuracy, Dire Hit, and Guard Spec."
    },
    {
      "title": "Walking 128 steps.",
      "content": "Walking 128 steps. This has a 50% chance of raising your entire parties friendship level by +1 point. Generation 5 games include the following: Black, White, Black 2, and White 2 versions. This applies to all Pokémon in the games. To avoid lowering a Pokémon's level, don't let it faint, or Heal Powder, Energy Root, use Revival Herb, or Energy Powder. Try and cure any status effects such as Poisoned, Paralyzed, Burning, and Frozen. Sleeping does not decrease Friendship Level."
    },
    {
      "title": "Talk to a lady on Castelia Street.",
      "content": "Talk to a lady on Castelia Street. She gives your Pokémon a massage. This raises your Pokémon's friendship level anywhere between +5 to +30 points."
    },
    {
      "title": "Visit the beauty salon.",
      "content": "Visit the beauty salon. This raises your Pokémon's friendship level +10 to +50 points, depending on which service you get."
    },
    {
      "title": "Get a friendly drink or friendly combo at the Cafe.",
      "content": "Get a friendly drink or friendly combo at the Cafe. This raises your Pokémon's friendship level +5, +10, or +20 points, depending on what you order."
    },
    {
      "title": "Battle against the gym leader, an elite four member, or the Champion.",
      "content": "Battle against the gym leader, an elite four member, or the Champion. This raises your Pokémon's friendship level +5 points at levels 0-99, +4 points at levels 100 - 199, and +3 points at levels 200 - 255."
    },
    {
      "title": "Learn TM or HM.",
      "content": "Learn TM or HM. This raises your Pokémon's friendship level by +1."
    },
    {
      "title": "Use vitamins.",
      "content": "Use vitamins. These include the following: HP Up, Protein, Iron, Calcium, Zinc, Carbos, PP Up, PP Max, and Rare Candy."
    },
    {
      "title": "Level up your Pokémon.",
      "content": "Level up your Pokémon. You can level up your Pokémon in battle. This will raise your Pokémon's level +5 points at friendship levels 0 -99, +3 points at friendship levels 100 - 199, and +2 points at friendship levels 200 - 255."
    },
    {
      "title": "Use a battle item.",
      "content": "Use a battle item. This raises your Pokémon's friendship level +1 point at friendship levels 0–199. Battle items include the following: X Attack, X Defense, X Speed, X Sp. Atk, X Sp. Def, X Accuracy, Dire Hit, and Guard Spec."
    },
    {
      "title": "Avoid PCS.",
      "content": "Avoid PCS. Depositing a Pokémon into a PC and leaving it there will slowly decrease the friendship level of the Pokémon."
    },
    {
      "title": "Use the Pokémon.",
      "content": "Use the Pokémon. Battling in itself is a key element for raising your friendship level, as Pokémon who are not used while in the party will slowly go into negative friendship, while those who are used often will gain friendship."
    },
    {
      "title": "Walk 128 steps.",
      "content": "Walk 128 steps. This has a 50% chance of raising your entire parties friendship level by +1 point. Generation 4 includes the following games: Diamond, Pearl, Platinum, HeartGold, and SoulSilver versions. These steps apply for all Generation 4 games. To avoid lowering a Pokémon's level, don't let it faint, or use Heal Powder, Energy Root, Revival Herb, or Energy Powder."
    },
    {
      "title": "Give your Pokémon a massage.",
      "content": "Give your Pokémon a massage. Massages are available at Ribbon Syndicate. You can only do this in Diamond, Pearl, and Platinum."
    },
    {
      "title": "Give your Pokémon a haircut.",
      "content": "Give your Pokémon a haircut. You can do this by visiting the Haircut Brothers. You can only do this in HeartGold and SoulSilver."
    },
    {
      "title": "Groom your Pokémon.",
      "content": "Groom your Pokémon. You can do this by talking to Daisy. You can only do this in HeartGold and SoulSilver."
    },
    {
      "title": "Level up your Pokémon in battle.",
      "content": "Level up your Pokémon in battle. This raises their friendship level +3 points at friendship levels 0 - 199, and +1 point at friendship levels 200 - 255."
    },
    {
      "title": "Using EV Berries.",
      "content": "Using EV Berries. EV berries help when you make a mistake in EV training. EVs are Effort Values and they are obtained by beating Pokémon.These berries include the following:Pomeg Berry, Kelpsy Berry, Qualot Berry, Hondew Berry, Grepa Berry, and Tamato Berry."
    },
    {
      "title": "Walking 128 steps.",
      "content": "Walking 128 steps. This has a 50% chance of raising your entire parties friendship level by +1 point. Generation 3 games include the following: LeafGreen, FireRed, Sapphire, Ruby, and Emerald versions. These steps apply to all Generation 3 games. To avoid lowering a Pokémon's level, don't let it faint, use Heal Powder, use Energy Root, use Revival Herb, or use Energy Powder."
    },
    {
      "title": "Groom your Pokémon.",
      "content": "Groom your Pokémon. Talk to Daisy to groom your Pokémon. This raises their friendship level +3 points at friendship levels 0 - 199, and +1 point at friendship levels 200 - 255. This only applies to FireRed and LeafGreen, since Daisy is the only groomer in this generation."
    },
    {
      "title": "Use vitamins.",
      "content": "Use vitamins. These include; HP Up, Protein, Carbos, Calcium, Zinc, Iron, and PP Up."
    },
    {
      "title": "Raise your Pokémon's level.",
      "content": "Raise your Pokémon's level. You can level up your Pokémon in battle. Friendship level will be raised +5 points at friendship levels 0 -99, +3 points at friendship levels 100 - 199, and +2 points at friendship levels 200 - 255."
    },
    {
      "title": "Use EV berries.",
      "content": "Use EV berries. EV berries help when you make a mistake in EV training. EVs are Effort Values and they are obtained by beating Pokémon. (ex. defeat a Pikachu and get an Effort Value in speed.) These berries include the following: Pomeg Berry, Kelpsy Berry, Qualot Berry, Hondew Berry, Grepa Berry, and Tamato Berry."
    },
    {
      "title": "Catch the Pokémon in a Luxury Ball.",
      "content": "Catch the Pokémon in a Luxury Ball. This adds an extra point to any increases in friendship."
    },
    {
      "title": "Give a Pokémon the Soothe Bell.",
      "content": "Give a Pokémon the Soothe Bell. This increases friendship boosts by 50%."
    },
    {
      "title": "Walk 512 steps.",
      "content": "Walk 512 steps. All Pokémon in your party will get a raise in its friendship level of +1 point. These steps apply to the following versions: Gold, Silver, and Crystal. In these games, all Pokémon have a friendship level, instead of just one. Also, there are many changes to the friendship levels in this generation. To avoid lowering a Pokémon's level, don't let it faint, or use Heal Powder, Energy Root, Revival Herb, or Energy Powder."
    },
    {
      "title": "Take your Pokémon to be groomed.",
      "content": "Take your Pokémon to be groomed. Depending on who you talked to, and how satisfied the Pokémon is, the friendship level will rise at different rates. Talk to Daisy in Pallet Town, or one of the brothers in the underground at Goldenrod City. Talking to the younger brother will raise your friendship level at a higher rate."
    },
    {
      "title": "Use vitamins.",
      "content": "Use vitamins. These include; HP Up, Protein, Carbos, Calcium, Zinc, Iron, and PP Up."
    },
    {
      "title": "Raise your Pokémon's level in battle.",
      "content": "Raise your Pokémon's level in battle. Friendship level will be raised +5 points at friendship levels 0 -99, +3 points at friendship levels 100 - 199, and +2 points at friendship levels 200 - 255. Leveling up at met locations will double the amount of friendship points your Pokémon receive."
    },
    {
      "title": "Raise the level of your Pikachu.",
      "content": "Raise the level of your Pikachu. This will give it a boost in its friendship. Friendship level will be raised +5 points at friendship levels 0 -99. It will be raised +3 points at friendship levels 100 - 199. It will be raised +2 points at friendship levels 200 - 255. [1] X Research source Friendship only applies to the Yellow Version, since it was when you could talk to your Pikachu and see how he likes you. When the series started out, there were three games distributed in America. However, it wasn't introduced in Red or Blue versions. Avoid depositing Pokémon and fainting. This lowers Pikachu's friendship level."
    },
    {
      "title": "Use a healing item.",
      "content": "Use a healing item. You can use an HP restoring item, or a status condition healing item (other than full heal). This will also raise Pikachu's friendship level. Note that any item will work on raising Pikachu's friendship. It doesn't even have to work. If you try to use a Thunder Stone, it won't raise Pikachu's friendship level. He refuses to use the Thunder Stone every time."
    },
    {
      "title": "Challenging Pokémon Gym leaders.",
      "content": "Challenging Pokémon Gym leaders. This will also raise Pikachu's friendship level by +3 points at friendship levels, 0 - 199, and +2 points at friendship levels 200 - 255."
    }
  ]
}