{
  "url": "https://www.wikihow.com/Remove-Milk-Stains",
  "title": "How to Remove Milk Stains",
  "steps": [
    {
      "title": "Blot the area as soon as possible.",
      "content": "Blot the area as soon as possible. When removing milk stains from clothing or fabric, you must blot the stain as soon as possible. Letting the milk dry into the fibers of your clothing makes it harder to remove the stains later. Soak a cotton rag or sponge with cold water and blot the stain in the area where you spilled the milk. [1] X Research source Rubbing and scraping the milk stain may make the stain worse."
    },
    {
      "title": "Soak your clothing in cold water.",
      "content": "Soak your clothing in cold water. Soak your clothing in a bucket or tub of cold water for five minutes if you have a bad milk stain. Soaking a milk stain will help loosen up the fabric and will prevent discoloration when you wash your item. If the milk has hardened onto your clothing, you can use a flat edged tool to scrape it off. Using warm or hot water can worsen the stain, so avoid doing this. For really bad stains, soaking your clothing overnight could help remove the stain. [2] X Research source"
    },
    {
      "title": "Pretreat the stain with a liquid detergent or fabric cleaner.",
      "content": "Pretreat the stain with a liquid detergent or fabric cleaner. Pretreat the area by rubbing detergent or another fabric cleaner into the stain before washing it. You should only need a couple of drops. As an alternative to liquid detergent, you can use a solution of equal parts baking soda and water. Pretreating the stain before washing it will help lift the stain from the fabric. Other cleaners, like Oxiclean, can also do a great job at reducing the appearance of milk stains. [3] X Research source Cleaners with enzymes do a great job of removing stains but could affect those with sensitive skin."
    },
    {
      "title": "Wash the item of clothing or fabric.",
      "content": "Wash the item of clothing or fabric. Put the clothing in a washing machine as you normally would. If you don't have access to a machine, you can wash the item by hand. Once the item has been washed, check the area to see if the stain has washed out. If it's still there, pretreat and wash your piece of clothing again until you no longer see the stain."
    },
    {
      "title": "Dry your clothing.",
      "content": "Dry your clothing. Do not dry your clothes if you can still see the milk stain. This can set the stain, and make it harder to remove later. [4] X Research source If the stain is visible, continue to pretreat and clean it until the stain is gone. Check the item's clothing tag to see if it's safe to put it in a mechanical dryer. If it's not, then you can pin up your clothes to dry them."
    },
    {
      "title": "Remove furniture covers after the spill occurs.",
      "content": "Remove furniture covers after the spill occurs. If you spill milk on a couch cushion, it's important that you remove the cover as soon as possible so that you can clean it separately. Allowing the spill to seep into the cushion will make it harder to remove later. Always know the fabric you are about to clean. Are you cleaning synthetic or natural fiber? Synthetic fabric can be more forgiving, while natural fiber can hold the stain more. Natural fibers, blends, and rayon-based fabrics can be problematic and do not respond well to certain cleaning agents or wetting (which can cause permanent damage to the fabric). Always vacuum the upholstery and carpet to remove any insoluble soil."
    },
    {
      "title": "Blot the area with cold water.",
      "content": "Blot the area with cold water. Before you apply any cleaners to the stain, see how much of the milk you can extract from the carpet or piece of furniture by blotting it. [5] X Research source Use a cotton rag or sponge and run it under cold water before trying to blot it. Do not rub the stain or you may make it bigger. Avoid overwetting—this can cause water marks and wicking issues."
    },
    {
      "title": "Mix liquid dishwashing soap with cold water.",
      "content": "Mix liquid dishwashing soap with cold water. Use one tablespoon (14.78 mL) of liquid dishwashing detergent with two cups (480 mL) of warm water. Stir the solution until it's well mixed. This solution will help you extract any milk left over from blotting it with water. [6] X Research source The solution should be sudsy when it's fully mixed."
    },
    {
      "title": "Blot the stain with a rag dipped in the detergent solution.",
      "content": "Blot the stain with a rag dipped in the detergent solution. Dip your cloth into the solution and get the cloth saturated. Apply the wet cloth to the stain so that you transfer the solution onto your carpet. Continue to blot the stained area of your carpet until it's no longer visible. Use neutral cleaners when dealing with upholstery and avoid harsh chemicals. Avoid using cleaning solutions that contain optical brighteners. They can cause damage and set the stain."
    },
    {
      "title": "Treat stubborn stains with ammonia and water.",
      "content": "Treat stubborn stains with ammonia and water. If you can't get the stain out using soap and water, you may have to use stronger chemicals. Mix two cups (480 mL) of warm water with one tablespoon (14.78 mL) of ammonia to create your solution. Get a new rag and dip it into the solution. Once the cloth is saturated, continue to dab the area that is stained. [7] X Research source Use gloves when handling cleaning chemicals or supplies. Never mix chlorine bleach with ammonia because it creates a dangerous chemical smoke that has harmful health effects. [8] X Research source"
    },
    {
      "title": "Rinse the area with cold water and dry it.",
      "content": "Rinse the area with cold water and dry it. Use a fresh rag and dab the area with cold water. The goal is to remove any cleaners or ammonia that you used to lift the stain from the carpet. Once you've sufficiently blotted the area, no more suds or cleaner should remain on the carpet. Finish the area by using a dry rag to get any excess water that remains. Hanging your rug up will help it dry. [9] X Research source Use a fan for rapid drying."
    },
    {
      "title": "Sponge the area with water.",
      "content": "Sponge the area with water. If the tag on your clothes says \"dry clean only\" you shouldn't put them in a conventional washing machine. Instead, sponge the area with cold water. If the stain is not coming out, you can lubricate your sponge with mineral oil or lard to help lift the stain from the fabric. Make sure to lubricate the stain thoroughly and keep it wet as soon as you notice the stain."
    },
    {
      "title": "Apply a couple of drops of mild liquid detergent to the stained area.",
      "content": "Apply a couple of drops of mild liquid detergent to the stained area. Create a mixture using 1 teaspoon (4.92 mL) of a mild liquid detergent with one cup (240 mL) of water. Using a dropper, carefully put some mild detergent on the surface of your stained clothing. You only need a few drops before sponging and dabbing the area again. You should start to see the stain begin to lift. Continue to sponge the area with water and mild detergent until you lift the stain."
    },
    {
      "title": "Apply hydrogen peroxide for chocolate milk stains.",
      "content": "Apply hydrogen peroxide for chocolate milk stains. You can use 3% hydrogen peroxide to remove stubborn chocolate milk stains. Use the dropper again to apply the hydrogen peroxide to the stain, before blotting up the area with a spare cloth. Continue to do this until you lift the stain from the piece of clothing."
    },
    {
      "title": "Flush the stain with cold water and allow it to dry.",
      "content": "Flush the stain with cold water and allow it to dry. Once there is no visible sign of the stain, you can flush the mild detergent off of your shirt with cold water. You don't need to get the entire garment wet, you only need enough water to flush the chemicals from your shirt fully. Do not allow visible stains to dry on non-washable fabric because they will be harder to remove later on. When you're done, you can take your clothes to a professional dry cleaner to ensure that the stain is completely removed."
    }
  ]
}