{
  "url": "https://www.wikihow.com/Plan-a-Garage",
  "title": "How to Plan a Garage",
  "steps": [
    {
      "title": "Use your property deed to identify your property’s boundaries.",
      "content": "Use your property deed to identify your property’s boundaries. The property lines may limit where you can place your garage. These lines are noted on the deed, which you get when you buy the home. Then, step outside to find the boundaries. Use the landmarks on your property to estimate where the boundaries are. [1] X Research source If you don’t have the deed available, you can visit the your area’s zoning department. They will have maps displaying your property."
    },
    {
      "title": "Choose a spot for your garage.",
      "content": "Choose a spot for your garage. Spend some time thinking about what you want out of your garage.If you want an accessible garage, you might place it right next to your home. On the other hand, you might place the garage further back and give it a different design from your house. Depending on the location, you may need to spend more on features to get the kind of garage you want. The space available on your property, as well as local regulations, can influence where you place your garage."
    },
    {
      "title": "Measure the amount of space you have available for your garage.",
      "content": "Measure the amount of space you have available for your garage. Bring a tape measure outside. After measuring out any property lines that might interfere with your project, make a rough measurement of your space. Try to mark down the maximum amount of space you have available as well as how much of it you want to set aside with your garage. Writing down these measurements is recommended. Show them to any architects or contractors you hire."
    },
    {
      "title": "Get an attached garage for easy access.",
      "content": "Get an attached garage for easy access. Many modern garages are attached, which means they connect directly to a home. This type tends to be a little costlier to build, since you will need to install a door between your house and garage. When it is finished, though, you can reach the garage without having to step outside. [2] X Research source You will need space to put the garage next to the home as well as space in your home to install a door. For this type of garage, you also need to consider how the garage's roofing connects to the house."
    },
    {
      "title": "Build a detached garage if you need more building space.",
      "content": "Build a detached garage if you need more building space. Detached garages can be positioned anywhere on your property. This is useful if you don’t have space next to your home for a garage. This type of garage is cheaper to build and can offer a little more stylistic creativity. [3] X Research source Since the garage isn’t attached to the house, you have more leeway in the design. You still want it to fit well with your home, but it doesn’t have to look identical to the home. Detached garages can still be positioned right next to a home. The garage will be a free-standing structure not connected to the home."
    },
    {
      "title": "Design a second floor for more storage space.",
      "content": "Design a second floor for more storage space. Even if you can’t widen the garage, you may be able to make it taller. The building codes in your area are likely to limit this, but there are a few ways to work around them. You may be able to build an attic, a loft, or alter the garage’s framing to clear out more space. [4] X Research source For example, you can build a dormer. A dormer is a small projection on the roof, but isn’t technically a second floor. Depending on your garage, you may even be able to build a separate room above it. Remember that you will also need to install stairs or a ladder. If you don't want your garage to have a second floor, consider including wall and overhead storage in your design. [5] X Expert Source Robert Rybarski Organizational Specialist Expert Interview. 31 January 2020."
    },
    {
      "title": "Choose the size and number of doors you need for your garage.",
      "content": "Choose the size and number of doors you need for your garage. The size of your garage door depends on how you use your garage. An average garage door is about 7 ft (2.1 m) tall and 9 ft (2.7 m) wide. If you plan on parking trucks and other vehicles, you may need a taller garage with bigger doors. Also plan for any other doors you need, such as back doors or attachment doors. [6] X Research source Also consider the number of doors you need. You may want separate doors to park multiple cars, but you can get 1 large door instead. Features like electronic door openers cost extra, but they can be installed at a later date."
    },
    {
      "title": "Establish a budget to avoid overspending on the garage.",
      "content": "Establish a budget to avoid overspending on the garage. The blueprint is the first concern you need to handle. The blueprint costs money to make. Any features you add to the garage, as well as the materials you use, can up the final cost of your project. Also consider any contractors you need to hire. You can research the costs for most features and services online before speaking with contractors. You can discuss building costs with any contractors you need to hire. They can offer alternatives if you exceed your budget. Adding a storage loft, for example, may cost you $1,000 USD. You may then need to pay extra for a pull-down ladder to reach it."
    },
    {
      "title": "Calculate how big you want the garage to be.",
      "content": "Calculate how big you want the garage to be. Settle on an ideal size for your garage. This will depend on how much parking and storage space you need. Wider, deeper garages are good if you want to park large or multiple vehicles. Keep this size in mind as you begin working on a blueprint and speaking to contractors. [7] X Research source If you want space for a workshop, for instance, you may want a smaller garage without car parking. The space you have available depends on the zoning regulations in your area as well as the size of your property."
    },
    {
      "title": "Place windows around the room for visibility.",
      "content": "Place windows around the room for visibility. Most garages will have a couple of windows. This is especially useful if you plan on converting your garage into a workshop, since the windows can let in light and fresh air. However, you will need to determine the placement and add this to your plan. Freestanding windows are placed away from garage doors and attachment walls. You may be able to place windows on your doors to let in more light."
    },
    {
      "title": "Position the wall outlets so they are accessible.",
      "content": "Position the wall outlets so they are accessible. A trained architect or electrician can help with this. The electrical wiring needs to reach all outlets and light fixtures without being intrusive. You may need to add more wiring and outlets if you plan on using your garage as a workspace. [8] X Research source You may want to install a sub panel if you plan on having air conditioning or using power tools. It acts like a second circuit breaker."
    },
    {
      "title": "Add heating, air conditioning, and other special features.",
      "content": "Add heating, air conditioning, and other special features. These features are often not included in a garage because they raise the cost of building too much. However, if you plan on spending a lot of time in the garage, they can be worth installing. You often need to install these features before you lay the garage’s foundation. [9] X Research source For example, you may want a radiant in floor heating system or a water drain. These need to be installed before the floor is finished."
    },
    {
      "title": "Install a retaining wall if you live near a hill.",
      "content": "Install a retaining wall if you live near a hill. Retaining walls are stone or concrete walls that hold soil in place. If your garage is near a slope, you need a retaining wall to prevent soil from sliding into it. Get a construction company to build the wall for you if you aren’t comfortable building it yourself. [10] X Research source Building a retaining wall is similar to setting up the garage’s foundation. You will need to dig and level the ground in addition to cutting and assembling the wall material."
    },
    {
      "title": "Purchase garage plans online.",
      "content": "Purchase garage plans online. Type “garage plans” into a search engine. You can find a lot of free plans to download right away, or you can buy different plans off of various websites. These plans provide you or your contractors a blueprint on how to construct the garage. Paid plans may cost you $100 to $200. [11] X Trustworthy Source State of Oregon Official website for the State of Oregon Go to source Try to get a plan that shows exactly what you want your garage to look like. You can always make adjustments to the plan, such as if you want a bigger garage or extra features."
    },
    {
      "title": "Hire an architect or drafters to customize plans for you.",
      "content": "Hire an architect or drafters to customize plans for you. An architect or an architectural drafter can sketch plans for you. Hiring someone to create new plans costs $1,000 or more, so this service is a significant part of your budget. However, they can make sure your garage is exactly what you want while still complying with local building codes. [12] X Research source Architects and drafters can match your garage to your home or add custom features to existing plans. If you get plans elsewhere, you can still hire a drafter to make alterations. Sometimes you can have them customize an existing plan for as little as $50."
    },
    {
      "title": "Sketch your plans yourself to save money.",
      "content": "Sketch your plans yourself to save money. Get a pencil and a piece of graph paper, then draw out the garage you want. Try to make it as accurate as possible. You may need to take measurements of your building space so you can include them in your drawing. Many times, you can work directly from the plan you have sketched. [13] X Research source Depending on where you live, you may still be required to get a plan from an architect. They can often copy your sketch. If you don’t draw, having a photo of your ideal garage can help. You can find images online or snap photos when you see garages you like. Take the pictures to your architect."
    },
    {
      "title": "Submit a permit application to your local building authority.",
      "content": "Submit a permit application to your local building authority. Consult your local government to learn about their building rules and application process. You will most likely need to bring them a sketch of your project. The sketch should show exactly what kind of garage you plan on building and prove that it falls within the authority’s regulations. [14] X Research source The location of your garage and its size can affect the chances of getting your application approved. If you hire an architect or other contractors, they can usually help you get your application approved."
    },
    {
      "title": "Pay the fees for the building application.",
      "content": "Pay the fees for the building application. Your government will likely charge an administration fee, which varies in cost from place to place. Fork over the money when you turn in your application. The building authority will then review your application. You will typically need to pay by check or with a credit or debit card. You may also need to pay additional fees for inspections. Many times, contractors handle these fees and include the cost in the final bill they give you."
    },
    {
      "title": "Wait 6 to 8 weeks to get your application approved.",
      "content": "Wait 6 to 8 weeks to get your application approved. During this time, the building authority considers your permit. Anyone in the community with an objection to the project has an opportunity to discuss it. Once the hearings are over, the local council sends you an approval notice, which means you can begin building the garage. Most objections come from the building authority and have to do with local building regulations. You may need to adjust your proposal to get the permit. If the review seems to be taking a long time, call the building authority to speed up the process."
    },
    {
      "title": "Have an inspector check the garage as it is built.",
      "content": "Have an inspector check the garage as it is built. Check your local government’s building regulations to see when you need to have an inspector look at your garage. You will usually need to have someone come out a couple of times during the process. The main times are when you lay the concrete foundation and build the frame. The inspector checks the work to see if it follows local building codes. If you hire contractors, they will often contact an inspector for you. You may need to have an inspector review the work at other times, such as when electrical wiring is installed and after the garage is completed."
    },
    {
      "title": "Call the utility company to mark underground utilities in the area.",
      "content": "Call the utility company to mark underground utilities in the area. Underground utility lines, such as water or gas lines, can easily be damaged during construction. In addition, you cannot build over these lines. Contact your utility companies so they can mark the location of the lines with paint and little flags. [15] X Research source If you want to build over a line, you will need to ask the utility company to move it first."
    },
    {
      "title": "Stake out the construction area.",
      "content": "Stake out the construction area. Once you have your plans in hand, position wooden stakes around the area’s perimeter. Connect the stakes with twine, then let the twine rest on the ground. This boundary maps out the construction area so you can see where the work needs to be done. [16] X Research source Double check to make sure the utility lines aren’t in the building area."
    },
    {
      "title": "Grade the building area by leveling it.",
      "content": "Grade the building area by leveling it. The construction process is started by flattening the land. You or an excavator you hire will dig up the area marked by the stakes and twine. You will usually need heavy construction equipment to dig a hole for the garage’s foundation. [17] X Research source The foundation is the garage’s concrete base. The soil around it may be shifted to form a slope, which helps water drain away from the garage."
    },
    {
      "title": "Dig out footings to keep the garage steady.",
      "content": "Dig out footings to keep the garage steady. Footings are trenches dug around the foundation. They are filled with concrete, which prevents the garage from sinking into soft soil. The trenches are big and deep, usually running along the sides of the foundation. You will need to hire an excavator to do this. [18] X Research source Unless you have experience constructing building foundations, you are better off hiring a professional with an excavator instead of doing it yourself."
    },
    {
      "title": "Install any in-ground drains or heating elements.",
      "content": "Install any in-ground drains or heating elements. These features need to be put into place before the foundation is complete. Once you pour concrete for the foundation, you cannot install in-ground features without breaking your garage floor. Install these features by laying them in the ground and connecting them to any necessary utility lines. [19] X Research source If you have contractors working on the garage, make sure they know that you want these features in your garage."
    },
    {
      "title": "Pour",
      "content": "Pour the concrete for the foundation. After the soil is settled, it is time to fill in the footings and create the foundation. You or your contractor will need to mix a lot of concrete, pour it into the construction area, and then smooth it out. Once the concrete dries, you can begin building your garage. [20] X Research source Let a building company handle this if you don’t have much experience creating foundations. A good foundation ensures your garage is stable."
    }
  ]
}