{
  "url": "https://www.wikihow.com/Peel-a-Kiwi",
  "title": "How to Peel a Kiwi",
  "steps": [
    {
      "title": "Hold the kiwifruit firmly in your non-dominant hand.",
      "content": "Hold the kiwifruit firmly in your non-dominant hand."
    },
    {
      "title": "Place the blade of the knife or peeler at the top of the kiwifruit.",
      "content": "Place the blade of the knife or peeler at the top of the kiwifruit. Use your dominant hand to hold the peeler or knife."
    },
    {
      "title": "Apply gentle pressure until you feel the skin give under the blade.",
      "content": "Apply gentle pressure until you feel the skin give under the blade. You may need to make a small nick in the skin to get a hold."
    },
    {
      "title": "Use a sawing motion to peel from the bottom to the top of the kiwifruit - peeling away from your hand to avoid accidentally cutting yourself.",
      "content": "Use a sawing motion to peel from the bottom to the top of the kiwifruit - peeling away from your hand to avoid accidentally cutting yourself. Peel gently – don't cut deeply or you'll remove too much of the flesh of the fruit."
    },
    {
      "title": "Work your way around the whole kiwifruit using the gentle sawing motion.",
      "content": "Work your way around the whole kiwifruit using the gentle sawing motion."
    },
    {
      "title": "Cut off both ends of the kiwifruit using a serrated paring knife.",
      "content": "Cut off both ends of the kiwifruit using a serrated paring knife ."
    },
    {
      "title": "Slip a spoon in between the skin and the flesh of the fruit (a tablespoon is usually a good size of spoon to use).",
      "content": "Slip a spoon in between the skin and the flesh of the fruit (a tablespoon is usually a good size of spoon to use). The back of the spoon should rest against the inside of the skin."
    },
    {
      "title": "Apply a small amount of pressure against the skin and gently turn the kiwifruit with your other hand, scooping the flesh away from the skin.",
      "content": "Apply a small amount of pressure against the skin and gently turn the kiwifruit with your other hand, scooping the flesh away from the skin. When the spoon gets back to the starting point, the kiwifruit should pop out of the skin."
    },
    {
      "title": "Fill a pot with enough water to cover the kiwifruit.",
      "content": "Fill a pot with enough water to cover the kiwifruit. Bring the water to a rolling boil ."
    },
    {
      "title": "Drop the whole kiwifruit into the boiling water and blanch it for 20 to 30 seconds.",
      "content": "Drop the whole kiwifruit into the boiling water and blanch it for 20 to 30 seconds."
    },
    {
      "title": "Scoop the kiwifruit out of the boiling water and run it under cold water.",
      "content": "Scoop the kiwifruit out of the boiling water and run it under cold water. When it's cool to the touch, you should be able to peel the skin off with your fingers."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}