{
  "url": "https://www.wikihow.com/Read-a-Caliper",
  "title": "How to Read a Caliper",
  "steps": [
    {
      "title": "Identify your caliper.",
      "content": "Identify your caliper. Use the instructions for vernier calipers if your tool has two scales, one sliding over the other. If your tool has one scale and a round dial instead, see the dial caliper instructions instead. If you are using a digital caliper, the measurement should be displayed on an electronic screen, typically with the option to switch between mm (millimeters) and inches (in). Before you take the measurement, close the larger jaws completely and press the Zero , Tare or ABS button to set the closed position to a value of zero."
    },
    {
      "title": "Check for zero errors.",
      "content": "Check for zero errors. Loosen the screw or screws holding the sliding scale in place. Move the sliding scale until the larger jaws of the caliper are fully pressed against each other. Compare the 0 positions on the sliding scale and the fixed scale, which is engraved on the caliper body. If the two 0 marks are lined up exactly, skip ahead to reading the measurement . Otherwise, continue to the next step to correct the error."
    },
    {
      "title": "Use an adjustment wheel if present.",
      "content": "Use an adjustment wheel if present. While this is not common, some vernier calipers have an adjustment wheel on the sliding scale, which can be pushed to adjust the sliding scale without affecting the caliper jaws. If your model has this wheel, push it until the zeroes on the sliding scale and fixed scale line up, then skip ahead to reading the measurement . Otherwise, continue to the next step. Watch the jaws closely to make sure you are not pushing a fine adjustment screw, which opens and closes the jaws by small amounts."
    },
    {
      "title": "Calculate a positive zero error.",
      "content": "Calculate a positive zero error. If the sliding scale's 0 is to the right of the fixed scale's 0, read the measurement on the fixed scale that lines up with the sliding scale's 0. This is a positive zero error, so write this down with a + sign. For example , if the sliding scale's 0 is at 0.9mm on the fixed scale, write down \"zero error: +0.9 mm.\""
    },
    {
      "title": "Calculate a negative zero error.",
      "content": "Calculate a negative zero error. If the sliding scale's 0 is to the left of the fixed scale's 0, take the following steps: With jaws closed, look for a mark on the sliding scale that lines up exactly with a value on the fixed scale Move the sliding scale so that mark lines up with the next highest value. Repeat until the sliding scale 0 is to the right of the fixed scale 0. Note the amount of distance moved. Read the value on the fixed scale that lines up with the sliding scale's 0. Subtract the amount of distance moved from the value you just read. Write down this zero error, including the negative sign. For example , the 7 on the sliding scale lines up with the 5mm mark on the fixed scale. Move the sliding scale until it is further right than the fixed scale, then line up the 7 with the next fixed-scale mark: 7mm. Note that you moved a distance of 7 - 5 = 2mm . The sliding scale's 0 is now located at the 0.7mm mark. The zero error is equal to 0.7mm - 2mm = -1.3mm."
    },
    {
      "title": "Subtract the zero error from all measurements.",
      "content": "Subtract the zero error from all measurements. Any time you take a measurement, subtract your zero error from the result to get the actual dimensions of the object. Don't forget to take the sign of the zero error (+ or -) into account. For example, if your zero error is +0.9mm, and you take a measurement that reads 5.52mm, the actual value is 5.52 - 0.9 = 4.62mm. For example, if your zero error is -1.3mm, and you take a measurement that reads 3.20mm, the actual value is 3.20 - (-1.3) = 3.20 + 1.3 = 4.50mm."
    },
    {
      "title": "Adjust the jaws to take a measurement.",
      "content": "Adjust the jaws to take a measurement. Clamp the large, flat jaws around an object to measure an outside dimension. Insert the smaller, curved jaws into an object and expand them outward to measure the interior dimension. Tighten the locking screw to keep the scale in place. Slide the scale to open or close the jaws. If your caliper has a fine adjustment screw, you can use this to make more precise adjustments."
    },
    {
      "title": "Read the fixed scale value.",
      "content": "Read the fixed scale value. Once you have the caliper jaws in the right position, look at the fixed scale, engraved onto the body of the caliper. Typically there is an imperial and a metric fixed scale; either one will work. Take these steps to find the first couple digits of your measurement: Find the 0 value on the smaller, sliding scale, next to the fixed scale you are using. On the fixed scale, find the nearest mark to the left of that 0, or exactly on it. Read that mark's value just like you would read a ruler – but note that the imperial side of a caliper divides each inch into tenths, not sixteenths as most rulers do."
    },
    {
      "title": "Check the sliding scale for additional digits.",
      "content": "Check the sliding scale for additional digits. Examine the sliding scale carefully, starting at the 0 mark and moving right. Stop when you find a mark that lines up exactly with any mark on the fixed scale. Read this value on the sliding scale as you would a regular ruler, using the unit engraved on the sliding scale. The value of the fixed-scale mark makes no difference. You only need to read the value on the sliding scale."
    },
    {
      "title": "Add the two values together to get your final answer.",
      "content": "Add the two values together to get your final answer. This should be a simple case of writing the fixed scale digits, then writing the sliding scale digits afterward. Check the unit engraved on each scales just to make sure. For example, your fixed scale measures 1.3 and is marked \"inches.\" Your sliding scale measures 4.3 and is marked \"0.01 inches,\" meaning it represents 0.043 inches. The exact measurement is 1.3 inches + 0.043 inches - 1.343 inches. If you found a zero error earlier, don't forget to subtract it from your measurement."
    },
    {
      "title": "Check for a zero error.",
      "content": "Check for a zero error. Close the jaws completely. If the needle on the dial doesn't point to zero, rotate the dial with your fingers, until the zero is beneath the needle. [1] X Research source You may need to loosen a screw at the top or base of the dial face before you can do this. [2] X Research source If so, remember to tighten the screws again after you've made the adjustment."
    },
    {
      "title": "Take the measurement.",
      "content": "Take the measurement. Close the larger, flat jaws around an object to measure the outside diameter or width, or insert the smaller, curved jaws into an object and expand to measure the interior diameter or width."
    },
    {
      "title": "Read the scale value.",
      "content": "Read the scale value. The scale engraved on your caliper can be read just as you would a regular ruler. Find the value at the inner edge of your caliper's jaws. The scale should be labeled with a unit, typically cm (centimeters) or in (inches). Note that the inches scale of a caliper is typically an engineer's scale, with each inch divided into ten parts (0.1) or five parts (0.2). This is different from most rulers, which display sixteenths or eighths of an inch."
    },
    {
      "title": "Read the dial value.",
      "content": "Read the dial value. The needle on the dial points to an additional value for more precise measurement. The units should be labeled on the dial face, typically 0.01 or 0.001 cm or in."
    },
    {
      "title": "Add the two values together.",
      "content": "Add the two values together. Convert both measurements to the same unit, then add them together. For many applications, you may not need to use the most precise digits. For example, the fixed scale displays 5.5 and is labeled cm. The needle on the dial points to 9.2 and is labeled 0.001 cm, so this represents 0.0092 cm. Add them together to get a measurement of 5.5092 cm. Unless you are working on a project that requires extreme precision, you can probably round this to 5.51 cm."
    }
  ]
}