{
  "url": "https://www.wikihow.com/Prune-Rose-of-Sharon",
  "title": "How and When to Prune Rose of Sharon for Healthy, Attractive Growth",
  "steps": [
    {
      "title": "Prune rose of Sharon in late winter or early spring.",
      "content": "Prune rose of Sharon in late winter or early spring. Flowers bloom from new growth on rose of Sharon plants. So, it’s best to prune your plant before it starts to grow. Aim to prune and trim your plant in the late winter or early spring before leaves and buds form. Cutting back your rose of Sharon too early or too late can “shock” the plant, leaving it vulnerable to the elements and stunting healthy new growth. Rose of Sharon plants typically start growing leaves in late spring, though they can sometimes come in as late as mid-summer. The plants typically flower from mid-summer to early fall."
    },
    {
      "title": "Snip off dead, damaged, and diseased branches.",
      "content": "Snip off dead, damaged, and diseased branches. Look for branches on your rose of Sharon that are rotted, brittle, or colorless. Then, use a pair of clean, sharp pruning shears to cut the stem as close to the larger, connecting branch as possible. [1] X Research source If you’re cutting a long branch, only remove the dead or damaged portion. Make sure you leave the portion of the branch that is alive and healthy. If you’re not sure whether a branch is actually dead, scrape off a little bit of the bark. If the wood underneath is light green, it is alive. For thick or stubborn branches, use a pair of heavy-duty loppers or a handheld pruning saw ."
    },
    {
      "title": "Remove crisscrossing and unruly branches.",
      "content": "Remove crisscrossing and unruly branches. Inspect your rose of Sharon for any branches that cross over each other or rub against one another. Then, choose which branch to snip off—it’s not necessary to remove them both. Just cut back the stem to the main branch or to a node, which is the bump-like structure on the stem. [2] X Research source If one of the crisscrossing branches is more twisted or unruly than the other, snip that one off."
    },
    {
      "title": "Cut back interior branches that block airflow and sunlight.",
      "content": "Cut back interior branches that block airflow and sunlight. Move your focus to the inside of the plant and look for branches that are close together and old. Simply use your shears to cut back these branches to a node at your desired length. [3] X Research source Old branches are often longer than new ones and may be less vibrant in color. Leave about 8 to 12 inches (20-30 cm) of space between the interior branches. This gives them enough space to flower beautifully in the summer. Thinning out the interior of your shrub opens them up, letting in more light and airflow that helps prevent pests and diseases. It can also make it look neater."
    },
    {
      "title": "Snip the tops of old branches to encourage side growth.",
      "content": "Snip the tops of old branches to encourage side growth. Inspect the top of the rose of Sharon for any tall, upright branches. Then, take your shears and cut the stem back to a node at the height you like. Cut back the oldest and tallest stems first before moving on to newer growth. [4] X Research source Removing length from the top of the plant encourages more energy to go towards the side branches."
    },
    {
      "title": "Remove any visible suckers from the base of the plant.",
      "content": "Remove any visible suckers from the base of the plant. Rose of Sharon occasionally produces suckers, which are slender stalks of new growth that grow from the roots. They typically appear near the trunk or around the base of the plant. The best way to deal with suckers is to snip each stalk as close to the ground as possible. [5] X Research source Cutting back the suckers destroys their connection to the rose of Sharon’s roots and makes them slower to grow back. Suckers typically return within a few months. So, you may need to cut them back 2 to 3 times a year. Suckers can sap vital nutrients from the soil if they're not removed right away, harming your plant. Plus, they can be an eyesore. If you let the sucker grow, it may develop its own roots and become a clone of the original plant. [6] X Research source"
    },
    {
      "title": "Prune lightly for many small flowers, or prune heavily for fewer large flowers.",
      "content": "Prune lightly for many small flowers, or prune heavily for fewer large flowers. How much you prune your rose or Sharon comes with a trade-off. Removing little to no branches usually means your plant will produce lots of small flowers. If you do a large pruning, it will typically produce fewer flowers but they’ll be significantly bigger. In general, younger plants only need a light pruning. Older plants or ones you’ve never pruned may need a greater pruning. Warning : Do not remove more than ⅔ of the rose of Sharon’s size. This can shock or weaken your plant. [7] X Research source"
    },
    {
      "title": "Renew old shrubs by cutting back up to ⅔ of their total size.",
      "content": "Renew old shrubs by cutting back up to ⅔ of their total size. If your rose of Sharon isn’t faring well or it’s very large and unruly, it’s okay to prune a bit more than normal. Find the longest and oldest branches on your plant. Then, cut a few of them down to the ground. Just make sure you aren’t removing more than ⅔ of its total size. [8] X Research source As long as you leave the base of the plant intact and keep most of the newer growth, it will return to produce eye-catching blooms year after year. Your rose of Sharon might not bloom the year that you cut it back. However, this helps it produce even more growth and blooms the following year. The practice of significantly reducing a plant's overall size is referred to as “renewal,” “rejuvenation,” or “hard” pruning. This is useful for promoting healthy new growth in old or failing plants."
    },
    {
      "title": "Remove any seed pods before they open.",
      "content": "Remove any seed pods before they open. After some rose of Sharon varieties flower, they develop brown seed pods. [9] X Research source Simply look for round, grape-sized pods on your shrub’s stems. Then, snip them off where they attach to the stem using a pair of clean pruning shears. Remove the pods in late fall or early winter. Compost them or throw them in the trash where they won’t come into contact with the soil. Handle the seed pods carefully to keep them from splitting open accidentally. When the seed pods reach maturity, they fall off the plant and scatter tiny seeds. This could leave you with a small forest of unwanted rose of Sharon plants."
    },
    {
      "title": "Trim tall, upright branches to your desired height.",
      "content": "Trim tall, upright branches to your desired height. As the rose of Sharon grows, it typically expands upwards rather than outwards. To help solve this problem, trim off the branches that protrude well beyond the others at a node. Either cut your shrub into a shallow “V” shape or gently round it off at the top, rather than hacking it straight across. [10] X Research source For a more natural appearance, trim the individual branches so they’re slightly different heights. If left unattended, the average rose of Sharon can grow 8 to 12 feet (2.4-3.7 m) tall. Note : Don’t trim off more than ⅔ of the rose of Sharon’s size so it doesn’t get shocked or damaged. [11] X Research source"
    },
    {
      "title": "Shape your rose of Sharon to its environment.",
      "content": "Shape your rose of Sharon to its environment. Trim excess growth from the bottom and sides of your shrubs to make them a better fit for the area in which they’re growing. This also prevents them from overtaking other plants and features in your yard. [12] X Research source Remember, you can trim up to ⅔ of the plant’s overall size without harming it. Any branches you cut will rebloom when new growth comes in."
    },
    {
      "title": "Prune your shrubs into a tree shape, if you desire.",
      "content": "Prune your shrubs into a tree shape, if you desire. Identify the point at the base of the shrub where the largest lower branches intersect. Then, use your loppers or pruning saw to remove all smaller branches around the point, up to about half the height of the trunk. This gives a bush-like rose of Sharon a neat, upright form similar to a Crape myrtle or Japanese maple. [13] X Research source Remove new offshoots on the central branch as soon as they begin popping up to preserve the plant’s new shape. While the rose of Sharon is technically a flowering shrub, many gardening enthusiasts prefer to raise them as small trees, which can make them easier to maintain. [14] X Research source Giving your rose of Sharon a tree shape can be useful if space in your garden is limited and you don’t have room for a full-sized shrub."
    },
    {
      "title": "Plant rose of Sharon where it gets 6 hours of direct light per day.",
      "content": "Plant rose of Sharon where it gets 6 hours of direct light per day. Rose of Sharon tends to grow and flower the best when it receives lots of bright, direct light. Choose a location for it where it gets at least 6 hours of sun each day. [15] X Research source Rose of Sharon plants are very tolerant of all kinds of conditions. They also grow well in partial sun or partial shade."
    },
    {
      "title": "Grow rose of Sharon in moist, well-draining soils.",
      "content": "Grow rose of Sharon in moist, well-draining soils. Rose of Sharon plants grow well in almost all types of soil. However, they typically grow the best in spots that have well-draining soil that stays relatively moist. For instance, rose of Sharon can grow in sandy, loamy, and clay-based soils. While rose of Sharon is drought and wet-tolerant, it doesn’t do well when it’s grown in very dry or soggy soil."
    },
    {
      "title": "Water rose of Sharon plants when the soil is dry.",
      "content": "Water rose of Sharon plants when the soil is dry. Rose of Sharon doesn’t need a lot of constant care to grow well. Just try to water your plant when the top 1 to 2 inches (2.5-5 cm) of soil are dry. [16] X Research source In very hot and dry weather, you may need to water your rose of Sharon more often. Be careful of overwatering your rose of Sharon. This can cause it to drop its buds and not flower."
    },
    {
      "title": "Fertilize rose of Sharon in the early spring.",
      "content": "Fertilize rose of Sharon in the early spring. In the late winter or early spring, sprinkle a slow-release shrub fertilizer around the base of your rose of Sharon. Fertilizing your plant helps encourage it to grow. [17] X Research source Follow the directions on the fertilizer to give your plant the correct amount of food. Do not over-fertilize your rose of Sharon, as this can cause any buds to fall off the plant."
    },
    {
      "title": "Spray pests with water or horticultural oil.",
      "content": "Spray pests with water or horticultural oil . Rose of Sharon plants are resistant to pests and diseases. However, they can get infested by aphids, thrips, white flies, or Japanese beetles. Hose off these pests with water. Or, spray your plant with horticultural oil if they don’t go away. Pests like aphids and thrips can cause your plant to drop its buds and flowers."
    }
  ]
}