{
  "url": "https://www.wikihow.com/Repair-a-Book%27s-Binding",
  "title": "How to Repair a Book's Binding",
  "steps": [
    {
      "title": "Purchase an acid-free book or binding glue.",
      "content": "Purchase an acid-free book or binding glue. Most craft or hobby stores carry book or binding glue. It usually comes in a tall, thin tube. Make sure you purchase an acid-free glue: if you use a glue with acid in it, it can cause the pages of your book to disintegrate or eat away at the spine of the book."
    },
    {
      "title": "Remove the loose pages.",
      "content": "Remove the loose pages. Set them aside so you don’t get any glue on them. Make sure you set them aside in the right order. You don’t want to accidentally glue them back into your book out of order!"
    },
    {
      "title": "Apply a thin layer of the glue.",
      "content": "Apply a thin layer of the glue. Open the book and squeeze some glue onto the inside of the book’s spine, where the pages have pulled away. Using a popsicle stick, spread the glue so that it covers the spine evenly."
    },
    {
      "title": "Set the pages back on the spine.",
      "content": "Set the pages back on the spine. Make sure you have them in the right order first! Then carefully line up the top and bottom of each set of pages so they’re even with the pages still attached to the spine of the book. Firmly press the edge of the set of pages to the spine so that the edge evenly attached to the spine. You might need to wiggle the pages a bit to get them to line up exactly with the rest of the book. That’s okay, but work quickly so the pages don’t end up sticking where they’re not supposed to!"
    },
    {
      "title": "Hold the book closed with a rubber band.",
      "content": "Hold the book closed with a rubber band. This helps keep all the pages evenly in place while the glue dries. You can also stack other, heavier books on top of the book you’ve repaired."
    },
    {
      "title": "Let the book dry for 24 hours.",
      "content": "Let the book dry for 24 hours. After the 24 hours are up, carefully remove the rubber band (or other books) and gently flip through the pages of the book. They should all feel secure. If they don’t, you may need to repeat the gluing process."
    },
    {
      "title": "Gather your equipment.",
      "content": "Gather your equipment. You’ll need book adhesive, knitting needles or plastic rods (for applying the adhesive), wax paper, and a piece of flat plastic. It’s best if your adhesive is in a tall bottle, since this will allow you to cover the needles or plastic rods for application to the spine. [1] X Research source"
    },
    {
      "title": "Stand the book on its tail.",
      "content": "Stand the book on its tail. Then very gently, use one hand to open the gap between the pages and the hinge as far as possible without causing more damage. [2] X Research source"
    },
    {
      "title": "Dip the needle or rod in adhesive.",
      "content": "Dip the needle or rod in adhesive. Then gently insert the needle or rod into the gap between the pages and spine and twirl it against both the text block and the spine. This should ensure an even coat of adhesive to both parts, which will help it adhere better. [3] X Research source If there is a gap all along the entire spine of the book, you’ll need to flip the book over so it’s resting on its top and repeat the process."
    },
    {
      "title": "Lay the book flat.",
      "content": "Lay the book flat. Firmly and evenly press the text block so that it is flat against the spine. Then use your piece of flat plastic to press the endpaper (the blank pages at the beginning of the book) into the hinge. This helps make sure that all of the pages stick to the spine and none of them tear. [4] X Research source"
    },
    {
      "title": "Place a piece of wax paper between the cover and pages.",
      "content": "Place a piece of wax paper between the cover and pages. You should press it back as far into the hinge as it will go. This prevents any adhesive from leaking out onto the cover of the book and will make sure your book opens properly when it’s dry. [5] X Research source"
    },
    {
      "title": "Run your flat piece of plastic along the hinge.",
      "content": "Run your flat piece of plastic along the hinge. This is the little indent between the edge of the spine and the cover of the book. Apply even pressure as you run your plastic along this ridge. [6] X Research source"
    },
    {
      "title": "Press the book overnight.",
      "content": "Press the book overnight. Set the book on top of a flat board, with a knitting needle slightly thicker than the cover of the book resting on top of the bottom board. Place the book on the bottom board, lining up the knitting needle with the hinge of the book. Repeat this process with a knitting needle resting on the top hinge and another board on top. Set about 10 lbs (4.5 kg) of weight on top of the book and leave it overnight. [7] X Research source"
    },
    {
      "title": "Remove the hinge from the book.",
      "content": "Remove the hinge from the book. It’s harder to repair a hinge that’s still clinging to the book by threads, so removing it actually makes your life easier. Cut away any threads or loose paper so that the text block is even and clean. [8] X Research source"
    },
    {
      "title": "Cut a piece of single-stitched binder tape.",
      "content": "Cut a piece of single-stitched binder tape. You can find this type of tape in most craft stores. Cut the tape so that it’s the same height as the text block. Don’t use the height of the cover for measuring the tape since the text block is usually shorter than the cover and you’ll end up with too much tape. [9] X Research source"
    },
    {
      "title": "Apply adhesive to one side of the tape.",
      "content": "Apply adhesive to one side of the tape. It’s best to use a brush for this application since it lets you apply the adhesive evenly. [10] X Research source"
    },
    {
      "title": "Attach the tape to the text block and spine.",
      "content": "Attach the tape to the text block and spine. Hold the tape by the dry tabs and line up the stitching with the edge of the text block. Stick one tab with adhesive to the first page of the text block and the other to the spine of the text block. Use a flat piece of plastic to rub the tape, ensuring that it sticks to the text block. [11] X Research source"
    },
    {
      "title": "Let the adhesive dry.",
      "content": "Let the adhesive dry. This can take anywhere from a few hours to overnight. You should be able to tell if the adhesive is dry by running your finger over the top – you’ll be able to feel if there’s any wetness under the tape. [12] X Research source"
    },
    {
      "title": "Place waxed paper on top of the text block and in the spine.",
      "content": "Place waxed paper on top of the text block and in the spine. You should lay it on top of the binder tape that is already glued to the text block and under the binder tape that hasn’t been glued yet. [13] X Research source"
    },
    {
      "title": "Apply adhesive to the other two tabs.",
      "content": "Apply adhesive to the other two tabs. Then gently bring the cover up so the edge of the cover fits along the seam of the binder tape. [14] X Research source"
    },
    {
      "title": "Press the spine firmly against one tab.",
      "content": "Press the spine firmly against one tab. This should be the tab sitting parallel to the spine, between the spine and the text block. When you pull the cover up, the spine should lay flat against this tab. [15] X Research source"
    },
    {
      "title": "Attach the last tab to the cover.",
      "content": "Attach the last tab to the cover. Smooth it with a flat piece of plastic so that it lays flat against the cover. Close the book and run your flat plastic piece along the spine so that the tab sticks to the spine. [16] X Research source"
    },
    {
      "title": "Secure with rubber bands and let dry overnight.",
      "content": "Secure with rubber bands and let dry overnight. The rubber bands will help all of the adhesive dry evenly and make sure that the tabs all lay flat against the spine and text block. Let it all dry overnight so that it doesn’t fall apart when you pick it up. [17] X Research source"
    },
    {
      "title": "Remove the rubber bands and waxed paper.",
      "content": "Remove the rubber bands and waxed paper. Open your book carefully and flip through the pages so the book can adjust to the repair. [18] X Research source"
    }
  ]
}