{
  "url": "https://www.wikihow.com/Remove-Dog-Saliva-Stains",
  "title": "How to Remove Dog Saliva Stains",
  "steps": [
    {
      "title": "Mix together vinegar, water, baking soda, and mild dish detergent.",
      "content": "Mix together vinegar, water, baking soda, and mild dish detergent. Combine 1/4 cup of white vinegar with a teaspoon each of dish detergent and baking soda. Sprinkle in the baking soda slowly so the solution doesn't fizz too violently, then top it off with a cup (240 mL) of cold water. Combine the ingredients in a clean spray bottle so you can easily apply the solution to the stain. Hot water can cook the proteins in dog saliva and make it set, so use cold water instead."
    },
    {
      "title": "Use the solution on water-safe clothing, upholstery, and hard surfaces.",
      "content": "Use the solution on water-safe clothing, upholstery, and hard surfaces. Your vinegar solution will work well for washable fabrics, water-safe upholstery , carpeting , windows, floors, and walls. However, stay on the safe side and check your tags for care instructions before attempting stain removal. You should also test the solution on an inconspicuous spot before treating the stain. Furniture tags typically include letter codes. W stands for water-safe, S means solvent cleaners only (no water), WS means either will do, and X means vacuum only or have the piece professionally cleaned. [1] X Research source If your furniture tag has an S, use alcohol or a store-bought solvent cleaner. If you can't find a letter code, don't use water just to stay on the safe side."
    },
    {
      "title": "Spray the cleaning solution onto the stain.",
      "content": "Spray the cleaning solution onto the stain. If your item is water-safe, spray it lightly with the solution without soaking it. When treating a fabric stain, let the solution sit for up to 15 minutes. For hard surfaces, there's no need to let the solution sit. If you don't have a spray bottle, dab the stain with an absorbent white cloth soaked in the solution. The vinegar solution could case a colored cloth's dye to bleed onto your fabric, so use a white one instead."
    },
    {
      "title": "Wipe away the solution with a damp cloth.",
      "content": "Wipe away the solution with a damp cloth. Wet a clean white cloth with cold water, then wring out excess water. For fabrics, blot the stain with it to flush out the vinegar solution. For hard surfaces, just wipe away the vinegar solution. [2] X Research source"
    },
    {
      "title": "Dry the spot and repeat the process, if necessary.",
      "content": "Dry the spot and repeat the process, if necessary. Allow the spot to air dry or dab it with a cloth to quicken the drying process. Once it's dry, inspect the stain. If necessary, repeat the process until the stain has disappeared."
    },
    {
      "title": "Apply 70% isopropyl alcohol to the stain.",
      "content": "Apply 70% isopropyl alcohol to the stain. If your item isn't water-safe, lightly spray the drool spot with rubbing alcohol. Apply the alcohol with an absorbent white cloth if you don't have a spray bottle. Microsuede or microfiber, for instance, have the look of suede, but are easier to clean. However, these and other upholstery fabrics often fall into the S, or solvents only, category. If you have them handy or feel like running to the store, you could also just use alcohol-based furniture cleaning wipes. [3] X Research source Rubbing alcohol creates a lot of fumes, so make sure that you're using it in a well-ventilated space. It also helps to dilute it with a little bit with water."
    },
    {
      "title": "Blot the stain with a clean, dry cloth.",
      "content": "Blot the stain with a clean, dry cloth. Use a white cloth instead of a colored one to prevent dye from bleeding onto your fabric. Try not to rub hard into the stain. Instead, blot the spot gently to lift the stain out of the fabric. [4] X Research source"
    },
    {
      "title": "Fluff the treated area with a soft brush.",
      "content": "Fluff the treated area with a soft brush. You might find that microfiber or microsuede fabric feels stiff after you've cleaned it. A quick, gentle fluff with a soft bristled brush, nail brush, or toothbrush will do the trick. [5] X Research source"
    },
    {
      "title": "Blot silk carefully with a small amount of rubbing alcohol.",
      "content": "Blot silk carefully with a small amount of rubbing alcohol. Apply a tiny amount of alcohol with a dry white cloth, and dab the spot slowly and carefully to avoid damaging the fabric. Cleaning silk can be tricky, and you'll need to check the care instructions and test first in an inconspicuous area. If your silk garment is labelled dry clean only, it's best to bring it to a professional."
    },
    {
      "title": "Clean velvet with lemon juice and baking soda.",
      "content": "Clean velvet with lemon juice and baking soda. Pour two tablespoons of baking soda into a bowl, then add enough lemon juice to create a foamy paste. Wet a soft, white cloth with the foam, then use it to lightly blot the stain. Use the gentlest touch possible, and don't rub the solution into the velvet pile. [6] X Research source Give the spot three to five hours to dry. You can also use a fan to quicken the drying process."
    },
    {
      "title": "Use a commercial cleaner for leather and suede.",
      "content": "Use a commercial cleaner for leather and suede. Store-bought cleaning wipes or solutions are your best choice for leather furniture and car seats. [7] X Research source Cleaning suede is even trickier than leather, so commercial products and professional cleaning are the safest choices. If you're feeling bold, you can lightly dab suede with white vinegar, let it dry, then brush it with a suede brush. [8] X Research source"
    }
  ]
}