{
  "url": "https://www.wikihow.com/Ride-Caltrain",
  "title": "How to Ride Caltrain",
  "steps": [
    {
      "title": "Review the route map and find the stations nearest where you wish to go.",
      "content": "Review the route map and find the stations nearest where you wish to go. Caltrain has only one line that serves San Jose, but there is a station where you can transfer to BART if needbe."
    },
    {
      "title": "Find the stations nearest your starting point and your destination.",
      "content": "Find the stations nearest your starting point and your destination. You can use Caltrain's route planner to do so. Then check the schedules (like BART, scheduling differs between weekdays and weekends). [1] X Research source Decide when you wish to arrive at your destination and work back from that."
    },
    {
      "title": "Find our the fare required for the trip you will take.",
      "content": "Find our the fare required for the trip you will take. Caltrain determines fares by the number of zones traveled. One-way fares range from $3.75 for traveling within one zone to $15.00 for traveling within six zones. Because of the coronavirus pandemic, fares have been heavily discounted. Use the fare chart and the map to determine how many zones you will cross."
    },
    {
      "title": "Use route planning tools to plan your trip.",
      "content": "Use route planning tools to plan your trip. When using these services, make sure to select the \"Public transit\" option, else you will be shown walking, biking, or driving directions. Your fare may also be visible."
    },
    {
      "title": "Go to the train station where you start your trip.",
      "content": "Go to the train station where you start your trip. Look for the Caltrain logo to identify the station. Like BART, parking is limited and fills up very early on the weekdays. You need a Caltrain parking permit to park at any Caltrain station, except for Millbrae station, which requires a BART parking permit."
    },
    {
      "title": "Buy a ticket.",
      "content": "Buy a ticket. Ticket machines at each station take cash and change as well as credit and debit cards. You can also purchase tickets from the station attendant. Payment for train rides is dependent on the number of zones traveled, not the number of stops. Tickets are valid for one-time use only. Check to see if you are eligible for any of the discounts. Students, seniors, persons with disabilities, Medicare holders, and youth (5-18) are eligible. One child accompanied by a parent/guardian 4 and under rides free. You can upgrade the number of zones traveled at the same machines. Both tickets must be present. Clipper Cards are also dispensed at Caltrain stations."
    },
    {
      "title": "Check for announcements on system-wide delays before entering the station.",
      "content": "Check for announcements on system-wide delays before entering the station. Such announcements can be found on Caltrain's website and at your station. This will help you avoid running late."
    },
    {
      "title": "Tag your Clipper Card at the Clipper reader.",
      "content": "Tag your Clipper Card at the Clipper reader. If you do not want to use a physical ticket, you can use a Clipper Card. Keep your Clipper Card with you so you can provide proof of payment. If you do not have Clipper, you need to validate your ticket at the same machine."
    },
    {
      "title": "Board the correct train for your destination.",
      "content": "Board the correct train for your destination. Trains will stop at the platform for a few minutes to allow for boarding/deboarding. Make sure that you are headed in the correct direction. If you have a bike, make sure to board the car labeled \"bike car\". Some train car are not wheelchair accessible. If you are in a wheelchair, board a car that has the wheelchair symbol."
    },
    {
      "title": "Show proof of payment to the conductor.",
      "content": "Show proof of payment to the conductor. Before or shortly after departing, the conductor will walk through the train to check that you and other riders paid for your ride. If you have not paid, you can get a citation."
    },
    {
      "title": "Practice good train ettiquette.",
      "content": "Practice good train ettiquette. Keep the center aisle clear, and remain seated for the ride. Per federal law, seats near the doors are reserved for seniors, pregnant people, and persons with disabilities. Keep your belongings secured."
    },
    {
      "title": "Exit the train.",
      "content": "Exit the train. Keep in mind that doors open on different sides at different stations. Also, the rear doors may not open at some stations, requiring you to traverse several train cars to get to the exit. Check for all your personal items before making your way to the door. Items left behind will make their way to Caltrain's lost and found. Lost items can be reported here ."
    },
    {
      "title": "Touch your Clipper Card at the Clipper reader.",
      "content": "Touch your Clipper Card at the Clipper reader. If you used Clipper to get on the train, you must tag off at the appropriate station. The appropriate fare will be deducted from your Clipper Card. Not tagging off will result in you paying the maximum possible fare for the ride. Transfers to BART is available at Millbrae station. Transfers to VTA are available at Mountain View, San Jose Diridon, and Tamien stations. Transfers to MUNI are available at San Francisco station. Transfers to Amtrak and the Altamont Corridor are available at San Jose Diridon and Santa Clara stations."
    }
  ]
}