{
  "url": "https://www.wikihow.com/See-if-Someone-Read-Your-Text-on-Android",
  "title": "2 Ways to See If Someone Read Your Text Messages on Android",
  "steps": [
    {
      "title": "Open the Google Messages app.",
      "content": "Open the Google Messages app. It has a white icon with a blue speech bubble. Google Messages is the official Android texting app and comes preinstalled on most Androids. If you have a different texting app. Some Android phone manufacturers, such as Samsung and Xiaomi come with their own messaging app preinstalled. If your phone does not have Google Messages, you can download it from the Google Play Store. To see read receipts in Google Messages, both you and the person you're texting must be using a texting app that supports RCS, and have read receipts enabled. Read receipts require an internet connection, so you'll need to have Wi-Fi or cellular data enabled."
    },
    {
      "title": "Tap your profile picture.",
      "content": "Tap your profile picture. It's in the upper-right corner. If you have not uploaded a profile picture to your Google account, this icon will be a colored circle with your initial in the middle."
    },
    {
      "title": "Tap Messages settings.",
      "content": "Tap Messages settings . It's towards the bottom of the menu. This opens the Settings menu."
    },
    {
      "title": "Tap RCS Chats.",
      "content": "Tap RCS Chats . It's at the top of the Settings menu. This displays the RCS Chats settings."
    },
    {
      "title": "Ensure the toggle switch next to \"Turn on RCS chats\" is on .",
      "content": "Ensure the toggle switch next to \"Turn on RCS chats\" is on . It's the first option at the top of the menu. If the toggle switch is blue and to the right, it is on. If it is not on, tap the toggle switch to turn it on."
    },
    {
      "title": "Ensure the toggle switch next \"Send read receipts\" is on .",
      "content": "Ensure the toggle switch next \"Send read receipts\" is on . It's the next option below \"Turn on RCS chats\" If the toggle switch is not on, tap it to turn it on."
    },
    {
      "title": "Send a text message while connected to the internet.",
      "content": "Send a text message while connected to the internet. RCS is available when sending text messages over the internet. When a text message is delivered to the server, you will see a single checkmark below the text message. When it is delivered to the person's phone, you will see two checkmarks. When the message has been read, both checkmarks will turn into colored circles. This indicates the message has been read. [1] X Research source It is not possible to see if someone with an iPhone has read your text messages. iPhones use proprietary technology for read receipts that only works with iMessage app on iPhones and iPads."
    },
    {
      "title": "Open the Messages app on your Samsung Galaxy phone.",
      "content": "Open the Messages app on your Samsung Galaxy phone. It's the light blue-green icon with a white outline of a chat bubble. If you're using a Samsung Galaxy Note10, S10, or later, and your mobile provider supports RCS, you can see when another Android user has read your texts. [2] X Research source Samsung Messages comes preinstalled on all Samsung Galaxy phones. After enabling read receipts with this method, you'll be able to see when another person using Samsung Messages or Android Messages (who has also enabled read receipts) has read your texts ."
    },
    {
      "title": "Tap the menu icon ⋮.",
      "content": "Tap the menu icon ⋮ . It's the three vertical dots at the upper-right corner of your texting app."
    },
    {
      "title": "Tap Settings on the menu.",
      "content": "Tap Settings on the menu. This displays your messaging settings."
    },
    {
      "title": "Tap Chat Settings.",
      "content": "Tap Chat Settings . This is where you'll find your advanced texting features, including the option to enable read receipts. [3] X Research source"
    },
    {
      "title": "Toggle the \"Share read status\" switch to the On position .",
      "content": "Toggle the \"Share read status\" switch to the On position . This is the option that lets you know when the message is opened by the recipient (and vice-versa). If you want to be able to see when the other person is typing (and vice-versa), you can also toggle on \"Show typing indicators.\""
    },
    {
      "title": "Send a text message while connected to the internet.",
      "content": "Send a text message while connected to the internet. When your friend (who also turned on read receipts) reads your message, you'll see the word \"Read\" and a time stamp beneath it. Your friend will see a similar thing when you've read their message. If you're not connected to the internet, your texts will be sent through SMS. SMS texts won't display read receipts. If you find that you are not seeing read receipts from people using Google Messages, try downloading Google Messages and using that instead. Samsung Messages and Google Messages are designed to work seamlessly together, but there could be hiccups here and there. It is not possible to see if someone with an iPhone has read your text messages. iPhones use proprietary technology for read receipts that only works with iMessage on iPhones and iPads."
    }
  ]
}