{
  "url": "https://www.wikihow.com/Pair-a-Cell-Phone-Over-Bluetooth-in-a-2012-Ford-Fusion-with-a-Two%E2%80%90Lined-Display",
  "title": "How to Pair a Cell Phone Over Bluetooth in a 2012 Ford Fusion with a Two‐Lined Display",
  "steps": [
    {
      "title": "Learn the different buttons you'll need to pair your phone.",
      "content": "Learn the different buttons you'll need to pair your phone. It'll take the up and down buttons from the Seek/Track cursor control \"switch\" between the set of buttons for Phone, Scan, Cat/Fold, and Sound, Menu, and Text which can be found between the two rows of radio preset buttons and radio type buttons. Ensure that you aren't in the Sirius settings, as these come with different settings altogether. You can also control pairing over your Ford's steering wheel buttons in the bottom right corner which is geared toward radio and phone functions. Just make sure you use the tuning up and down (marked with double arrows left and right (left for down, right for up)) to move through the menus."
    },
    {
      "title": "Learn where the button can be found for saying \"OK\" to your system.",
      "content": "Learn where the button can be found for saying \"OK\" to your system. At the center of the tune \"switch,\" you'll find the button marked \"OK\". It'll also be marked with a play/pause indicator. You can also control pairing over your Ford's steering wheel buttons in the bottom right corner which is geared toward radio and phone functions. Just make sure you use the OK button, just below the \"Media\" button."
    },
    {
      "title": "Do some initial preparation.",
      "content": "Do some initial preparation. Make sure your car is in Park. Make sure to have your phone on you and ready. Make sure it's unlocked and you are in your Settings menu or app inside the Bluetooth menu (especially if the phone is a smartphone such as an iPhone or Android). You will need to complete adding a visual pin during pairing right into your phone, and you will need to make sure the car can connect via Bluetooth so should be discoverable."
    },
    {
      "title": "Press the Phone button, either from your dashboard or from your steering wheel.",
      "content": "Press the Phone button, either from your dashboard or from your steering wheel. Both buttons look like phones with a ray extending downward. On the dashboard, it'll be found above the seek cursor left corner. On the steering wheel controls, it'll be on a two-item switch on the third line of buttons just below your tuning buttons, to the left of \"Media.\" This will activate your Ford's phone menu, and tell you what phones have been paired."
    },
    {
      "title": "Press the OK button when you see a notification that there are no phones paired.",
      "content": "Press the OK button when you see a notification that there are no phones paired."
    },
    {
      "title": "Let your Ford Sync system ask you if you'd like to \"Add a Bluetooth Device\".",
      "content": "Let your Ford Sync system ask you if you'd like to \"Add a Bluetooth Device\". Respond by pressing \"OK\" again."
    },
    {
      "title": "Wait for the system to say \"Find SYNC\", then press OK.",
      "content": "Wait for the system to say \"Find SYNC\", then press OK."
    },
    {
      "title": "Tap the new Bluetooth connection's entry on your smartphone.",
      "content": "Tap the new Bluetooth connection's entry on your smartphone. It should, by the end list \"Sync.\" Use your phone to input the six numbers PIN/code that is displayed onscreen."
    },
    {
      "title": "Wait for the SYNC system to say it's complete, then run through instructions with your phone nearby.",
      "content": "Wait for the SYNC system to say it's complete, then run through instructions with your phone nearby."
    },
    {
      "title": "Set up additional items.",
      "content": "Set up additional items. Your SYNC will ask if you'd like to make this phone the primary phone, download your phone book, set up 911 Assist (if available), and several other questions. If you don't want a feature set up, just press the down arrow (for dashboard buttons) or left arrow (for steering wheel buttons)."
    },
    {
      "title": "Exit your phone's settings.",
      "content": "Exit your phone's settings. You can leave the menu alone, start a phone call using the Phone button, or navigate with the seek buttons to exit out of your settings (downward to \"Return\" (the first time out of Bluetooth Devices, and into your main Phone settings, then down arrow to Exit the Phone menu)down button."
    },
    {
      "title": "Recognize that pairing subsequent phones is a little more tuning-intensive and that you'll need to move between menus more commonly.",
      "content": "Recognize that pairing subsequent phones is a little more tuning-intensive and that you'll need to move between menus more commonly."
    },
    {
      "title": "Do the same preparation steps.",
      "content": "Do the same preparation steps. Make sure the car is in Park, you are on your Bluetooth settings page, and your Bluetooth is in discovery mode."
    },
    {
      "title": "Press the Phone button to activate the phone feature.",
      "content": "Press the Phone button to activate the phone feature."
    },
    {
      "title": "Move with your cursor's up and down keys to step through several options - to System Settings.",
      "content": "Move with your cursor's up and down keys to step through several options - to System Settings. If you use the down cursor, you will \"walk\" through Phone Redial, Call History, Phonebook, Text Message, Phone Settings, SYNC Services, 911 Assist, Vehicle Health Report, Mobile Apps, and onto System Settings. However, you may find it easier if you walk \"up\" the list, which will provide \"Exit Phone Menu\" and then System Settings."
    },
    {
      "title": "Press the OK button on your Ford Sync system buttons.",
      "content": "Press the OK button on your Ford Sync system buttons."
    },
    {
      "title": "Scroll until \"Bluetooth Devices\" is displayed.",
      "content": "Scroll until \"Bluetooth Devices\" is displayed. It should be the first option in the menu, but if you've stepped down to \"Advanced\" or \"Return\", you've gone too far. There are only three items on this menu. When you press OK from the settings, Ford Sync may land you on the \"Advanced\" menu, and you may need to move up to the Bluetooth Devices menu first, pressing OK to access, or it may land you in Bluetooth Devices automatically - after a Ford Sync system update (which happened in 2020, and which happens every so often)."
    },
    {
      "title": "Scroll through the list using the 4-way scroller until \"Add Bluetooth Device\" is selected.",
      "content": "Scroll through the list using the 4-way scroller until \"Add Bluetooth Device\" is selected. This is where things get messy - where pairing a subsequent phone adds a few more steps. You may find it easier to press the down arrow one time from the top - if the menu displays Return, because it'll cycle through the list again and at the top you'll find this setting."
    },
    {
      "title": "Wait for \"Find Sync\" to display in the two-lined display and press the OK button when it does.",
      "content": "Wait for \"Find Sync\" to display in the two-lined display and press the OK button when it does."
    },
    {
      "title": "Return to your phone and complete some pairing.",
      "content": "Return to your phone and complete some pairing. Tap the new Bluetooth connection entry on your smartphone. It should, by the end list \"Sync.\" Use your phone to input the six numbers PIN/code that is displayed onscreen."
    },
    {
      "title": "Let the system tell you when pairing is successful.",
      "content": "Let the system tell you when pairing is successful."
    },
    {
      "title": "Set up additional items.",
      "content": "Set up additional items. Your SYNC will ask if you'd like to make this phone the primary phone, download your phone book, turn on 911 Assist™ (if available), and several other questions. If you don't want a feature set up, just press the down arrow (for dashboard buttons) or left arrow (for steering wheel buttons)."
    },
    {
      "title": "Exit your phone's settings.",
      "content": "Exit your phone's settings. You can leave the menu alone, start a phone call using the Phone button, or navigate with the seek buttons to exit out of your settings (downward to \"Return\" (the first time out of Bluetooth Devices, and into your main Phone settings, then down arrow to Exit the Phone menu) down button."
    }
  ]
}