{
  "url": "https://www.wikihow.com/Put-Both-of-Your-Legs-Behind-Your-Head",
  "title": "How to Put Both of Your Legs Behind Your Head",
  "steps": [
    {
      "title": "Improve your leg flexibility.",
      "content": "Improve your leg flexibility. Stretch for at least 10 minutes each day – you can do this in one large chunk, or in several separate sections. [1] X Research source Some people may need more time, especially if they have a larger midsection or less lower back flexibility, so adjust as needed. Stretch after a physical activity like dancing or running. The more flexible you are, the easier it will be to put your legs behind your head. Start the first day with a 10-second front lunge on both feet. Put one foot out and kneel with your back leg out. Push your hips forward, switch legs, and repeat. Do a 10-second butterfly stretch. Sit on the floor or ground and bring both of your feet together. Then, pull your feet towards your body, and bring your head as close to your toes as possible. Perform a 20-second star-watching stretch. Kneel with your rear off of your feet. Reach upward and backward, and try to touch your toes. Push your torso up and look at the ceiling or sky. Increase your time 5 seconds everyday."
    },
    {
      "title": "Practice the splits",
      "content": "Practice the splits . You don't strictly need to be able to do the splits to put your legs behind your head, but it can be a good way to increase your flexibility. [2] X Research source"
    },
    {
      "title": "Be patient.",
      "content": "Be patient. Don't try anything too drastic until your body is flexible and used to contorting. If you try to overextend, you may injure yourself, which will delay your progress even further."
    },
    {
      "title": "Eat well to stay trim.",
      "content": "Eat well to stay trim. Maintain a healthy diet and try to stay away from junk foods. Try eating salads and raw foods, and stay away from unnecessary carbohydrates."
    },
    {
      "title": "Try going to a local yoga class.",
      "content": "Try going to a local yoga class. Yoga will help relax your body while stretching. If you can't go to a class, try looking up yoga routines that you can do at home."
    },
    {
      "title": "Practice the lotus pose",
      "content": "Practice the lotus pose . In the lotus pose, your legs are crossed with both of your feet resting on top of your legs. This is a difficult position, so you may need to build up to it over the course of days, weeks, or months. Once you can do this, you can do this, try it without using your hands. [3] X Research source"
    },
    {
      "title": "Bring your feet to your chest.",
      "content": "Bring your feet to your chest. Use your hands to bring your right foot, then your left foot, up to your chest. Practice until you can do it without feeling anything."
    },
    {
      "title": "Keep at it.",
      "content": "Keep at it. Bring your feet higher and higher each day until you can bring them behind your head. You may need to put one leg behind your head, to start."
    },
    {
      "title": "Start by doing the \"candlestick\" position.",
      "content": "Start by doing the \"candlestick\" position. First, lie supine on your back. Engage your core, and slowly raise your legs straight up into the air. Use your arms for support, if you have trouble. [4] X Research source"
    },
    {
      "title": "Move one foot closer to your head.",
      "content": "Move one foot closer to your head. When you can do the candlestick position well, without needing support from your arms, try moving one foot closer to your head. You should be able to do this with one foot on the floor near your head, both with a bent knee and a straight knee. When you can do this well with each leg separately, try with both legs at the same time. Make sure to bend your knees."
    },
    {
      "title": "Try putting one foot behind your head.",
      "content": "Try putting one foot behind your head. While sitting up, try placing one foot behind your head or as close as you can manage. Doing this a couple of times every day, and it should become easier and easier. Remember to practice equally with each of your legs. [5] X Research source"
    },
    {
      "title": "Try putting both legs up.",
      "content": "Try putting both legs up. Do the same as the previous step just with both legs at the same time and you should succeed! This can take up to 3 weeks to master and may take beyond that as well so don't worry if you don't seem to be getting anywhere."
    }
  ]
}