{
  "url": "https://www.wikihow.com/Sew-a-Circle",
  "title": "How to Sew Circles and Pucker-Free Circular Seams and Hems",
  "steps": [
    {
      "title": "Trace an object about the same size as the circle you want to sew.",
      "content": "Trace an object about the same size as the circle you want to sew. This is perhaps the quickest and easiest way to get a circle onto your fabric—just find a dish, cup, bowl, or anything else that's round. Set it on your fabric and trace around the edge with a pencil to mark your circle. [1] X Research source Hold the fabric tight as you trace to keep it from bunching up and ruining your line."
    },
    {
      "title": "Use a thumbtack and thread to make your own drawing compass.",
      "content": "Use a thumbtack and thread to make your own drawing compass. Put your thumbtack on a table with the point sticking up. Lapel pins work great for this too! Just poke the point through a strip of painter's tape (sticky-side down), then secure the tape to the table to hold the thumbtack in place. [2] X Research source"
    },
    {
      "title": "Press your fabric over the point of the thumbtack.",
      "content": "Press your fabric over the point of the thumbtack. Position your fabric over the thumbtack and pierce the fabric wherever you want the center of your circle to be. Then smooth out your fabric so you can draw on it."
    },
    {
      "title": "Tie off one end of the thread and cut it to match the size you want.",
      "content": "Tie off one end of the thread and cut it to match the size you want. The thread determines the size your circle will be. Since the point of the tack is the center of the circle, the thread will be the radius, or half the diameter of the circle. Tie the end of the thread to the point of the tack, then pull the thread taut to decide how large you want your circle to be. [3] X Research source When you cut the thread, remember to leave a little extra—you'll be tying the other end around your pencil so you can draw your circle. If you need an exact size, measure it out with your measuring tape and mark the thread with a pen or fabric marker so you'll know exactly how long it needs to be."
    },
    {
      "title": "Pull the thread taut to draw a circle on the fabric.",
      "content": "Pull the thread taut to draw a circle on the fabric. [4] X Research source For small circles, it's likely easier to simply move the pencil and draw the circle. If you're making a larger circle, leave the pencil in place and rotate the fabric underneath it—applying just enough pressure with the pencil for it to make a mark. You might want to have someone help you by holding the fabric taut as you draw the circle. If you're drawing by moving the pencil, it might help to have someone hold the fabric taut or tape the fabric down so that it doesn't move."
    },
    {
      "title": "Line up the fabric in your sewing machine.",
      "content": "Line up the fabric in your sewing machine. Slide your fabric under the all-purpose foot of your sewing machine so that the needle will come down directly on the line of the circle you drew. Smooth out the fabric so that you can see the whole circle and guide the fabric with your hands. [5] X Research source If you want to use the thumbtack as a guide, measure the radius of your circle, then tape down your thumbtack exactly that distance away from the needle of your sewing machine. Pierce your fabric in the same spot you did when you drew the circle and as you sew, the thumbtack will hold your fabric in place. [6] X Research source This also works for hand-sewing or embroidery—just stitch slowly and follow the circular line that you drew on the fabric and your circle will turn out perfect."
    },
    {
      "title": "Stitch slowly, turning the fabric as you go.",
      "content": "Stitch slowly, turning the fabric as you go. Keep both hands on the fabric to guide it and keep it flat. As you feed the fabric through, turn it slightly so the needle follows the curved line. If you make incremental rotations each time the needle comes up after making a stitch, you'll stay on target. Maintain this rhythm all the way around the circle to finish. [7] X Research source If you're sewing a really small circle, just use 1 or 2 fingers from each hand to guide the fabric. With the thumbtack in place, you don't have to worry about turning the fabric—it will automatically rotate around the tack. [8] X Research source"
    },
    {
      "title": "Stack 2 fabric circles together and pin around the perimeter.",
      "content": "Stack 2 fabric circles together and pin around the perimeter. Lay 2 fabric circles that are the same size on top of each other so the sides you want to show are touching. Then, take sewing pins and insert them through both pieces of fabric near the circular edge. Try to place a pin every 2 to 3 inches (5.1 to 7.6 cm). [9] X Research source Use the pins to keep the circles from shifting off of each other as you're sewing. Make sure the sides of the fabric that you want to show are on the inside , touching each other. After you sew the seam, you can turn it inside out so the raw edges and stitches don't show."
    },
    {
      "title": "Straight-stitch about 1⁄2 inch (1.3 cm) from the edge of the fabric.",
      "content": "Straight-stitch about 1 ⁄ 2 inch (1.3 cm) from the edge of the fabric. Set your sewing machine to a short straight stitch. Place your fabric under the all-purpose foot and start sewing, leaving a seam allowance ( 1 ⁄ 2 inch (1.3 cm) is a good seam allowance, but you can use whatever you feel comfortable with). [10] X Research source If you find it difficult to follow your seam allowance, try marking it with a pencil. You can also use a whipstitch as a guide to keep your seam straight all the way around the circle. [11] X Expert Source Alessio Iadicicco Apparel Manufacturing Specialist Expert Interview. 20 May 2021."
    },
    {
      "title": "Guide the fabric pieces around with both hands as you sew.",
      "content": "Guide the fabric pieces around with both hands as you sew. Go slowly, turning and feeding the fabric a stitch at a time. Your machine will follow the curve as long as you're turning the fabric consistently. Once you get the hang of how much you need to turn the fabric, you can speed up a little. [12] X Research source If the seam is getting away from you, stop the machine and lift the foot to adjust the fabric and correct the curve. Feel free to take out the pins as you sew around the circle—the stitches will hold them in place."
    },
    {
      "title": "Stop sewing about 3 inches (7.6 cm) before you close the circle.",
      "content": "Stop sewing about 3 inches (7.6 cm) before you close the circle. The gap allows you to reach in and turn the fabric inside-out so the seam is hidden and the right face of the fabric is showing. If you're sewing a larger circle (or have larger hands), feel free to leave a larger gap to compensate. [13] X Research source"
    },
    {
      "title": "Cut triangular notches about every 1⁄2 inch (1.3 cm) around the seam allowance.",
      "content": "Cut triangular notches about every 1 ⁄ 2 inch (1.3 cm) around the seam allowance. Cut from the edge of the fabric to the seam so that the top point of the triangle is as close to the seam as possible without cutting into it. Go slowly and be careful—if you cut into the seam, your stitches will unravel and you'll be back at square one. [14] X Research source The size of the notches depends on the overall size of your circle. Generally, they just make it easier for you to trim the excess fabric from the seam allowance."
    },
    {
      "title": "Trim excess fabric from the seam allowance.",
      "content": "Trim excess fabric from the seam allowance. Taking care not to cut into the actual seam, cut out the fabric between your triangular notches. Leave about 1 ⁄ 4 inch (0.64 cm) of seam allowance. Go all the way around the circle so your fabric won't pucker when you turn it inside out. [15] X Research source"
    },
    {
      "title": "Turn the circle inside-out and sew the gap closed.",
      "content": "Turn the circle inside-out and sew the gap closed. Set your sewing machine to straight-stitch across the gap. Remember to leave about 1 ⁄ 4 inch (0.64 cm) of seam allowance when you sew the gap closed so your circle stays even. [16] X Research source If you want to make a pillow , fill the fabric circle with foam or polyester, then close the gap."
    },
    {
      "title": "Baste the fabric on the wrong side about 1⁄8 inch (0.32 cm) from the rounded edge.",
      "content": "Baste the fabric on the wrong side about 1 ⁄ 8 inch (0.32 cm) from the rounded edge. [17] X Research source Slide your fabric under the all-purpose foot of your sewing machine, then baste the fabric by making a straight stitch without backstitching. This type of stitch, also called a tacking stitch, is designed to be loose and temporary. [18] X Research source Sew slowly, turning the fabric a little each time the needle lifts to follow the curve. Leave a seam allowance of about 1 ⁄ 8 inch (0.32 cm) from the edge."
    },
    {
      "title": "Make a second round of basting stitches 1⁄4 inch (0.64 cm) from the edge.",
      "content": "Make a second round of basting stitches 1 ⁄ 4 inch (0.64 cm) from the edge. Go back to where you started to add a second round of stitches inside the first. This second round isn't strictly necessary, but it provides a little insurance in case the first row of stitches breaks when you pull on them to gather the fabric. [19] X Research source Use the first line of basting stitches that you made as a guide for turning the fabric as you feed it into your sewing machine."
    },
    {
      "title": "Pull the ends of the threads to bunch the fabric together.",
      "content": "Pull the ends of the threads to bunch the fabric together. Take the loose ends of the thread and pull gently to bring the stitches tighter together. The seam allowance will bunch up while the fabric itself remains smooth. [20] X Research source If the fabric tends to bunch up more in one area, just distribute the bunches with your fingers so it looks more even."
    },
    {
      "title": "Fold over the gathered edge and pin it in place.",
      "content": "Fold over the gathered edge and pin it in place. Fold over as much fabric as you want for the seam allowance of your hem. Insert a pin about every 1 inch (2.5 cm) or so to hold the fabric in place. [21] X Research source"
    },
    {
      "title": "Use a zigzag stitch",
      "content": "Use a zigzag stitch to finish the hem. Set your sewing machine for a zigzag stitch and slowly sew the fabric. Sew slowly and turn the fabric as you feed it through so the needle follows the curve of the fabric, using the two rows of basting stitches as a visual guide. [22] X Research source While you can use any stitch you like for the hem, the zigzag stitch prevents the fabric from fraying. Since your basting stitches aren't visible when the fabric is right-side out, there's no need to remove them."
    }
  ]
}