{
  "url": "https://www.wikihow.com/Melt-Peanut-Butter",
  "title": "How Do You Melt Peanut Butter? Easy & Effective Steps",
  "steps": [
    {
      "title": "Measure your peanut butter.",
      "content": "Measure your peanut butter. Scoop spoonfuls of peanut butter from the jar into your prepared measuring cup and smooth down for accuracy. Using a spatula, scrape the peanut butter into a microwave-safe bowl. Repeat until you have enough for your recipe. Spray your measuring cup with cooking spray before you begin, to get the peanut butter out more easily. [1] X Research source"
    },
    {
      "title": "Microwave on high for 30 seconds.",
      "content": "Microwave on high for 30 seconds. Cover the bowl with a microwave-safe lid or paper towel to avoid messy splatters. Use a timer to make sure you remove the bowl after 30 seconds to prevent burning. It's best to use pot holders to take the bowl out of the microwave safely."
    },
    {
      "title": "Stir and repeat.",
      "content": "Stir and repeat. Stir the peanut butter, then return the bowl to the microwave for 30-second increments until it reaches the desired consistency. Be careful not to heat it for too long, or the peanut butter may liquify [2] X Research source . When it's done, remove from the microwave and enjoy."
    },
    {
      "title": "Measure your peanut butter.",
      "content": "Measure your peanut butter. Spray your measuring cup with cooking spray before you begin, to get the peanut butter out more easily. [3] X Research source Scoop spoonfuls of peanut butter from the jar into your prepared measuring cup and smooth down for accuracy. Using a spatula, scrape the peanut butter into a room-temperature saucepan. Repeat until you have enough for your recipe. Don’t turn on the heat yet in order to avoid burning the peanut butter."
    },
    {
      "title": "Turn the burner on low heat.",
      "content": "Turn the burner on low heat. Once your peanut butter has been measured into the saucepan, place the pan on the stove and turn the burner on low. Gradually heat the peanut butter to keep it from having a burnt taste."
    },
    {
      "title": "Stir continuously.",
      "content": "Stir continuously. Using a spoon, stir gently as the peanut butter slowly heats up. Stirring constantly prevents the peanut butter from sticking to the pan and heating unevenly. It should take about 5 minutes for the peanut butter to melt."
    },
    {
      "title": "Remove from heat.",
      "content": "Remove from heat. As soon as the peanut butter reaches the desired consistency, remove it from the stove. Taking it off of the heat immediately prevents it from thinning out too much or burning to the pan. Add to your recipe and enjoy."
    },
    {
      "title": "Measure your peanut butter.",
      "content": "Measure your peanut butter. Spray your measuring cup with cooking spray before you begin, to get the peanut butter out more easily. Scoop spoonfuls of peanut butter from the jar into your prepared measuring cup and smooth down for accuracy."
    },
    {
      "title": "Scoop peanut butter into the blender or food processor.",
      "content": "Scoop peanut butter into the blender or food processor. Using a spatula, scrape your measured peanut butter into the blender or food processor. Add two tablespoons of water per tablespoon of peanut butter. For a creamier consistency, you can use milk in place of water. If you're making a savory sauce, you can use the other ingredients, like soy sauce, for example, in place of water."
    },
    {
      "title": "Blend on low speed for 30 seconds.",
      "content": "Blend on low speed for 30 seconds. To liquify the peanut butter, turn it up to a higher speed. Once the peanut butter reaches the desired consistency, turn off the blender or food processor, add the peanut butter to your recipe and enjoy."
    }
  ]
}