{
  "url": "https://www.wikihow.com/Quit-Drinking-Medication-Treatment-Support",
  "title": "How to Stop Drinking: 12 Tips for Success",
  "steps": [
    {
      "title": "Keep a drinking log so you know when and why you drink.",
      "content": "Keep a drinking log so you know when and why you drink. You might do this for as long as 3 or 4 weeks but try to do it for at least one week. The longer you keep the log, the more patterns will emerge that you can identify and do something about. Write down every drink you have, what time it is when you have it, the circumstances around you, and your feelings. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You might also note who's with you or if you're alone. If you're always with the same people, you might need to avoid hanging out with them for a little while if you want to stop drinking. Recording your feelings is also important because it can help you uncover why you drink. It could be as simple as wanting to loosen up and have a little fun—but it could also be because you felt stressed out, or because someone did something that upset you."
    },
    {
      "title": "Write down your reasons for getting and staying sober.",
      "content": "Write down your reasons for getting and staying sober. Putting your reasons in writing helps you remember those reasons when you're having cravings for alcohol later on. In addition to your main list, you might also write individual reasons on sticky notes and put them up all over your home to remind you. You might also set reminders on your phone to encourage you not to drink (set them especially for times when you're normally tempted to drink). Here are some reasons you might include: [2] X Research source My relationships will improve I'll have more time and energy to spend with the people I care about I'll get better sleep and feel well-rested in the morning I'll save money by not going to bars all the time My physical health will improve"
    },
    {
      "title": "Talk to your family and friends.",
      "content": "Talk to your family and friends. Tell your family and friends that you've decided to stop drinking and list the reasons that you want to quit. Then, ask them for help and support and see what they're willing to do. Remember that they care about you—it might surprise you how willing they are to step up and help. [3] X Research source For example, you might say, \"I know that my drinking has been causing some problems in my life, and that's why I've decided to quit. I could really use your support with this.\" If you have specific things you want them to do, tell them. Otherwise, you can brainstorm ideas for things they can do to help you."
    },
    {
      "title": "Change your environment and habits to avoid triggers.",
      "content": "Change your environment and habits to avoid triggers. What this means depends on when and where you typically drink. If you always drink with particular friends, for example, you might need to avoid hanging out with them for a while. Get rid of any alcohol you have in your house so you won't be tempted to drink at home. And avoid places where you know you'll be tempted to drink, like bars and sporting events. [4] X Research source If you've tried to quit drinking in the past, reflect on those experiences. Think about what made you start drinking again and you'll know what to avoid this time around. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Keep busy with activities that require you to be up and moving.",
      "content": "Keep busy with activities that require you to be up and moving. You'll be less tempted to drink if you're active. Keeping your hands busy is particularly helpful—you can't hold a drink if both hands are occupied! Drinking is typically a passive thing that you do while you're just sitting around somewhere. Getting out and moving will help decrease the urge to grab a drink. [6] X Research source For example, if you usually have a drink in front of the TV after dinner, you might go for an evening walk or jog rather than plopping down and watching a show. You might also consider picking up a new hobby , like woodworking or painting, that requires you to use your hands."
    },
    {
      "title": "Prioritize self-care and work on being more mindful.",
      "content": "Prioritize self-care and work on being more mindful . Quitting drinking might not be easy, but it's important to take care of yourself during this time. Give yourself a little extra love, whether that means getting a pedicure or taking a long bubble bath. Try meditation or practice yoga to improve your mindfulness and keep yourself in the moment. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source When you're more mindful, you'll be less likely to succumb to the urge to drink. You'll be able to identify the craving for what it is and let it go."
    },
    {
      "title": "Join a mutual-support group.",
      "content": "Join a mutual-support group. Recovery support groups, such as AA, are there to help you embrace sobriety. You can talk to other people who are getting sober and know that you're not alone—there are others who've had similar experiences with alcohol who came to the same decision you did. Attend meetings regularly and stay active in the group to learn more tips for staying sober. Here are some groups you can look up in your local area: [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Women for Sobriety Alcoholics Anonymous SMART Recovery Al-Anon and Alateen (support groups for friends and family of people with alcohol use disorder (AUD))"
    },
    {
      "title": "See a therapist to work through your drinking triggers.",
      "content": "See a therapist to work through your drinking triggers. Therapy helps you dig down to the root causes of your drinking habit and develop better coping mechanisms for dealing with those things that drive you to drink. Here are some different types of therapy that might work for you: [9] X Research source Cognitive-Behavioral Therapy: This therapy focuses on the feelings that trigger the urge to drink. Once you identify what causes these feelings, you can work on eliminating that cause. Motivational Enhancement Therapy: This therapy focuses on forming a plan to quit, then giving you the tools to stick to that plan, including building up your self-esteem and self-confidence. Marital and Family Counseling: If your drinking has caused problems with your relationships, this therapy can help you heal the damage. You're also showing your family that you care about them and care about making a change."
    },
    {
      "title": "Try medication if you have moderate to severe alcohol use disorder (AUD).",
      "content": "Try medication if you have moderate to severe alcohol use disorder (AUD). The FDA has approved 3 medications for the treatment of AUD. All of these medications are prescribed by a doctor. Sometimes you'll take them in a supervised setting, such as in a residential treatment facility. But typically, you can take them on your own. [10] X Research source Naltrexone : This is typically the first drug doctors try to treat AUD. It lowers your craving for alcohol. Naltrexone isn't recommended for people who take opioids or have liver problems. Acamprosate: This drug rebalances the chemicals in your brain that might've been altered by severe drinking. By doing this, it helps diminish cravings for alcohol. Doctors prescribe acamprosate for people with liver problems who can't take naltrexone. Disulfiram: This is the first drug the FDA approved to treat AUD. It keeps the liver from breaking down alcohol, which means you'll feel sick if you drink while you're taking the drug. Nausea, vomiting, chest pain, and headaches can last for up to an hour after you drink. [11] X Research source"
    },
    {
      "title": "Make new friends who don't drink.",
      "content": "Make new friends who don't drink. If your previous social life revolved around drinking, you might find it difficult to continue hanging out with the same people. This can be especially tough if you feel like you were really close to those people. Hanging out in places where alcohol isn't available can help you meet new sober friends. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If your old friends are willing to hang out with you in a non-drinking environment, that's great! But if they're too wedded to the idea that they can't have fun without alcohol, it might be time to distance yourself from them. If you have the ability to do so, you might even try moving to a different town or city where no one knows you as a drinker. This makes it a lot easier to have a sober social life."
    },
    {
      "title": "Visit your doctor if you think you have a problem with drinking.",
      "content": "Visit your doctor if you think you have a problem with drinking. This is especially important if you think you might have become dependent on alcohol. You might experience withdrawal symptoms that can be unpleasant—your doctor can help come up with a plan that will minimize those symptoms. [13] X Research source Your doctor can also recommend therapists, counselors, and other healthcare professionals who can help you. Remember that everything you say to your doctor is confidential. If you don't want people in your life to know that you think you have a problem with alcohol, you don't have to worry about it getting out. They won't tell anyone."
    },
    {
      "title": "Get inpatient treatment if you have severe AUD.",
      "content": "Get inpatient treatment if you have severe AUD. If you have severe AUD, you likely feel as though you don't trust yourself to avoid temptation when you're out in the world surrounded by opportunities to drink. With inpatient residential treatment, you stay in a hospital or recovery facility for at least a month. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Residential treatment equips you with tools for sober living. You'll also have regular therapy and talk to other people who are also getting sober. There are also hybrid methods, such as intensive outpatient treatment, that combine residential treatment but allow you to continue to work or go to school and live at home."
    },
    {
      "title": "AUD means that your drinking causes distress and harm.",
      "content": "AUD means that your drinking causes distress and harm. People who have AUD typically need help to quit drinking entirely. AUD exists on a spectrum from mild to severe. If you're not sure if you have AUD, ask yourself the following questions. A \"yes\" to 2 or 3 of these indicates mild AUD. If you answered \"yes\" to 4 or 5, you could have moderate AUD. A \"yes\" to 6 or more indicates severe AUD. In the past year, have you: [15] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Drank more or drank for longer than you originally intended? Wanted to quit drinking or even tried to quit drinking, but couldn't? Spent most of your time either drinking or recovering from drinking? Felt strong urges to drink? Had problems at home, work, or school caused by your drinking? Kept drinking despite issues with people you care about, such as family or friends? Gave up activities you enjoyed so you could drink more? Gotten into dangerous situations while drinking, such as practicing unsafe sex or drinking and driving? Kept drinking despite the fact that it made you feel upset, depressed, or anxious? Developed a tolerance for alcohol so you had to drink more to get drunk? Had withdrawal symptoms, such as shakiness or irritability, when you didn't drink alcohol for a while?"
    }
  ]
}