{
  "url": "https://www.wikihow.com/Not-Get-Caught-Cheating",
  "title": "How to Not Get Caught Cheating",
  "steps": [
    {
      "title": "Think twice about cheating on your partner.",
      "content": "Think twice about cheating on your partner. People have many reasons for wanting to cheat: they may be angry at their partner, feel trapped in a relationship they weren't ready for to begin with or which has grown dull and lifeless, or be taking out frustrations about something completely unrelated to the relationship. However, there are numerous negative consequences associated with infidelity in a relationship. You may think that you can get away with it and not get caught; even if you do, studies show that cheating partners experience high levels of shame and guilt associated with their actions. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Although many couples are able to work through their issues when infidelity comes to light, many relationships dissolve from the lack of trust bred by your betrayal. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Most importantly, consider the suffering your partner will experience should your infidelity come to light. If you are not willing to accept your role in their pain, don't go through with your plans. The repercussions of your breach of trust could follow your partner into their future relationships, negatively affecting their ability to find happiness even after they've left you behind. Should your actions come to light, you may very well lose the respect of your friends and family, and that can be a painful consequence to live with. Try to live up to your communities expectations of you. If you are truly unhappy in a relationship, you should have an honest conversation where you either make a plan with your partner to work together to improve it, or decide to end the relationship so you can move on with someone else. However, if you decide to move ahead with your plans, you should take the following into consideration. Reader Poll: We asked 1226 wikiHow readers how they would respond if they discovered their partner was cheating, and 61% of them said end the relationship immediately. [Take Poll] If you’re tempted to cheat, it’s probably best just to end the relationship anyway before things get messy."
    },
    {
      "title": "Set up a separate email address.",
      "content": "Set up a separate email address. One of the easiest and sloppiest ways to get caught having an affair is to leave evidence of it around in easily accessible places. Create a new email address used only to communicate with the person or people you are cheating with. Don't tell anyone else about it or use it for anything other than your affair. If you also use this account as a burner account for online updates or to catch spam, it will feel normalized. You want there to be a certain level of anxiety attached to this account. This way, you will remember to log out every single time you access it. Only write to your affair through this account, never through your regular account. Keep your regular account logged in on your computer as you normally would, so your partner has access to it if they grow suspicious and start snooping. They won't find anything there."
    },
    {
      "title": "Clear browser history — but only partially.",
      "content": "Clear browser history — but only partially . Each time you do anything online related to your affair, take a moment to clear your web browser's history of the sites related to your affair. Note that this applies to more than just your fake email address; do this for every site related to your affair, such as Yelp reviews for a restaurant where you want to meet them, directions to a park where you're going to meet them, reservation sites for hotels, etc. Don't clear your entire browser history, as this will look suspicious — nobody keeps their entire history clean. Instead, go through your history and manually delete suspicious websites as soon as you're finished using them."
    },
    {
      "title": "Use the “private browsing” mode on your web browser.",
      "content": "Use the “private browsing” mode on your web browser. The best way to ensure that you don't accidentally leave any evidence of your activities behind in your browser history is to always use the “private browsing” setting when doing something you don't want to get caught doing. If you are using a major browser to surf the internet, you likely have a private browsing option available to you. Safari [3] X Research source , Chrome [4] X Trustworthy Source Pew Research Center Nonpartisan thinktank conducting research and providing information on public opinion, demographic trends, and social trends Go to source , Firefox [5] X Research source , Opera, and Explorer [6] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source all allow you to use the internet without recording evidence of it on your computer. Note that this does not mean you are completely anonymous while browsing. Websites still know your I.P. address visited their sites. As a result, you can see targeted ads generated from your “private” browsing session. [7] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source To avoid getting caught through your targeted ads, make sure you close out all private windows every time you're finished using them. This will delete the cookies that lead to suspicious targeted ads."
    },
    {
      "title": "Lock your cell phone.",
      "content": "Lock your cell phone. If your phone is already locked and your partner doesn't know the code, you're in the clear. However, if your phone isn't locked or if your partner knows the code, you need to re-secure your phone. Create a believable explanation for why you need to suddenly secure your phone. You might say that some people at work got into it and found private pictures of you and your partner, or that they sent a string of text messages to people in your contact list. If your partner is accustomed to knowing the code to your phone, it would be highly suspicious of you to suddenly insist on privacy. Don't try to change the password, but don't use your phone for any suspicious activity. If you need to communicate with your affair through your phone, use the private browsing option on its browser to log into your “cheating” email account. Remember to log out and close the private window to delete cookies when you're done."
    },
    {
      "title": "Use your phone minimally.",
      "content": "Use your phone minimally. If your partner sees a sudden spike in calls or texts to your affair's phone number, this could raise suspicions. Keep phone calls brief, and text only when necessary. The majority of your communication should be conducted through your designated email account."
    },
    {
      "title": "Buy a prepaid cell phone.",
      "content": "Buy a prepaid cell phone. A prepaid cell phone would allow you to communicate with your affair freely without worrying about the charges showing up on a monthly phone bill. However, it's highly risky because being caught with a strange, secret phone would make even the most trusting partner wonder. If you do use a prepaid cell phone, be incredibly careful about not getting caught with it. Have an excuse prepared just in case your partner does end up finding it. You might say that a colleague left it behind in the office and you forgot to drop it off to them on your way home, for example."
    },
    {
      "title": "Don't use credit cards on suspicious purchases.",
      "content": "Don't use credit cards on suspicious purchases. Any questionable charges — hotel rooms, out-of-town businesses — will show up on your monthly statement. Suspiciously large charges such as dinners for two at a nice restaurant might also attract attention. Whenever making purchases you don't want to get caught making, use cash rather than card to avoid leaving a paper trail behind."
    },
    {
      "title": "Buy separate birth control.",
      "content": "Buy separate birth control. There is absolutely no reason that the amount of condoms or other birth control should fluctuate unexpectedly within a committed, monogamous relationship. Missing or extra condoms are a flaming red flag. The birth control you use outside of your relationship should be kept completely separate from that you use with your partner. Buy separate condoms when sleeping with your affair. Purchase small packs or individual condoms rather than boxes, so you won't get caught with extra condoms stashed in your car. Throw away unused condoms before returning home instead of keeping them around."
    },
    {
      "title": "Laugh at their suspicions instead of getting mad.",
      "content": "Laugh at their suspicions instead of getting mad. By getting mad, you're signalling to your partner that you have a negative reaction to their accusation, rather than a bewildered one. Anger also transitions quickly into an argument, and arguments get drawn out and linger in the back of the mind. You want to avoid attaching lasting, negative memories to this conversation, and the best way to do that is to keep it from getting heated. Don't laugh in a mean-spirited way, and don't make fun of your partner for having their suspicions. Simply act surprised or bewildered by the suspicions, as though it never would have occurred to you that you were acting in a questionable way."
    },
    {
      "title": "Talk to them about their suspicions.",
      "content": "Talk to them about their suspicions. After your initial lighthearted reaction, you don't want to run away from the conversation, as this might make them feel like you're not taking their feelings seriously. That resentment can also linger and fester, so you want to address this head-on. Tell them that you're sorry they feel that way and that you didn't even know that you were causing them to feel insecure in the relationship. Allow them to voice their concerns, and be a good listener — don't interrupt them or get defensive. Make note of their specific suspicions, as this will let you know what mistakes you're making."
    },
    {
      "title": "Promise to make an effort to work on those trust issues.",
      "content": "Promise to make an effort to work on those trust issues. A good partner will feel bad about making them worry, so assure them that even though they have nothing to worry about, you will make an effort to be more attentive to them."
    },
    {
      "title": "Change some of your suspicious behaviour.",
      "content": "Change some of your suspicious behaviour. If you let your partner speak honestly, they may have given you a list of specific concerns they have about your behaviour. If you change that behaviour without warning, it may only make them even more suspicious. However, if you have an open conversation with them about how you promise to change those behaviours, they will interpret your changed behaviours as dedication to working on your relationship. Tripping all over yourself to completely change your behaviours might make you look like you're overreacting or have a guilty conscience. Don't make dramatic changes. Simply change your behaviour enough to demonstrate that you're making an effort to maintain trust in the relationship."
    },
    {
      "title": "Stop the affair or put it on hold.",
      "content": "Stop the affair or put it on hold. If your partner is too on-target with their suspicions, it may be time to call off the affair, or at least put it on hold until the danger passes. Even after the conversation about your partner's fears, even after you promise to make them feel safer in the relationship, your partner may still harbour suspicion. Don't take unnecessary risks."
    }
  ]
}