{
  "url": "https://www.wikihow.com/Order-a-Drink-at-a-Bar",
  "title": "How to Order a Drink at a Bar",
  "steps": [
    {
      "title": "Choose your drink.",
      "content": "Choose your drink. While you choose, stand away from the bar to indicate that you’re not ready to order. If the bar isn’t very busy, consider talking to the bartender for drink recommendations. If the bar is busy and you don’t know what you want: Look at the bar menu for cocktail or wine choices. Order a simple well drink, such as a rum and Coke. Look at the beer taps on the wall and choose one that looks interesting."
    },
    {
      "title": "Wait to be noticed.",
      "content": "Wait to be noticed. Once you’re ready to order, stand close to the bar with your hands on the counter. This will indicate that you want to order a drink. Once the bartender is ready, they will approach you and ask you for your order. Never whistle, snap, yell, or wave money at the bartender."
    },
    {
      "title": "Order your drink.",
      "content": "Order your drink. Speak loudly and clearly, especially if the bar is crowded. If you’re ordering multiple drinks, order them all at the same time. If the bartender needs clarification on your order, they will say so. When ordering mixed drinks, say the liquor type or brand name first and then what kind of mixer you’d like. For example: “I would like a rum and Coke, please.” “Two Bacardi and sodas, please.” “I need 1 margarita on the rocks and 2 pints of Guinness. Thank you!” “May I have a glass of your house Chardonnay?”"
    },
    {
      "title": "Pay for your drinks.",
      "content": "Pay for your drinks. Once the bartender hands you your drinks, they will tell you the total. Make sure you already have your cash or credit card ready. Otherwise, you will waste time rummaging through your pockets or your purse. [1] X Research source If you want to keep ordering drinks, use your credit card to open a tab. Your bartender will add drinks to this tab and charge your card at the end of the night. If you pay with cash, you may not be able to open a tab."
    },
    {
      "title": "Tip your bartender if appropriate.",
      "content": "Tip your bartender if appropriate. Depending on where you live, it may be appropriate or expected to tip your bartender. You can leave a cash tip in the tip jar or write a tip on your credit card receipt. In the US, you should leave 10%-20% of the bill total as a tip. In the UK, it's not as common to tip at the bar, but it is common to tip at a restaurant. In France, the service charge is included in the bill. In Australia, it's uncommon to tip the bartender. In Brazil, tips are not expected but they are appreciated. Consider tipping 10% of the bill total. [2] X Research source"
    },
    {
      "title": "Know when you’re in a restaurant bar.",
      "content": "Know when you’re in a restaurant bar. Restaurant bars are bars that are attached to or inside a restaurant. These bars are usually small, consisting of a bar counter and a few tables. The bartenders make drinks for the restaurant as well as for the bar patrons. If you'd like, you can order drinks that follow the theme of the restaurant. For example: Tex-Mex and Mexican restaurants usually specialize in margaritas. Seafood restaurants that call the bar area the “Tiki Bar” usually serve tropical cocktails. [3] X Research source Upscale restaurant bars usually serve wine and expensive cocktails."
    },
    {
      "title": "Recognize a beer bar.",
      "content": "Recognize a beer bar. Beer bars specialize in beer and often don’t carry nicer liquors or wine. A beer bar usually has at least 12 beer taps along the wall. Beer bars can also be called taverns, breweries, and craft beer bars. If you’re not sure what kind of beer you like, talk to the bartender for a recommendation or ask for a beer sample. Lagers are the most common beers. They are generally a golden color. Wheat beers are lighter colored beers with a crisp yeast flavor. Ales range in color from light brown to black. These beers have a deep, mellow flavor. IPAs (India Pale Ales) are golden beers with a hoppy, floral flavor. Porters are dark, foamy beers with a roasted malty flavor. [4] X Research source"
    },
    {
      "title": "Identify a wine bar.",
      "content": "Identify a wine bar. Wine bars usually have an extensive wine list and may not carry beer or liquor. These bars often serve small appetizers to enjoy with your wine. [5] X Research source If you’re not familiar with wine, ask your bartender for recommendations. Riesling is a light, often slightly sweet, white wine with floral and crisp apple or pear notes. Sauvignon Blanc is a mid-bodied white wine, often with tart citrus notes. Chardonnay is a somewhat denser white wine with apple, light citrus, often creamy/buttery notes. Pinot Noir is a red wine with complex red fruit flavors and often an earthy undertone. Merlot is a red wine with jammy fruit and baking spice notes. Cabernet Sauvignon is a denser, often tannic, red wine with dark fruit notes."
    },
    {
      "title": "Learn to recognize cocktail bars.",
      "content": "Learn to recognize cocktail bars. Cocktail bars, also called Mixology bars, pride themselves on quality craft cocktails. These bars often have a trendy atmosphere and an extensive cocktail menu. Order something from the menu, as cocktail bars usually create unique drinks that are exclusive to their establishment. If you’re feeling adventurous, ask the bartender for recommendations. [6] X Research source Martinis are a classic choice. These strongly flavored drinks can be ordered with or without olives, shaken over ice, or stirred. A Jack Rose is a mellow, pink drink made with sweet apple brandy. Order a Bourbon Sweet Tea for a refreshing, boozy drink. If you want a sweet drink, order a velvety Chocolate Martini. [7] X Research source"
    },
    {
      "title": "Order a pint of beer.",
      "content": "Order a pint of beer. A pint is a customary unit of measurement containing about 16 fluid ounces in the US and 20 fluid ounces in the UK. [8] X Research source Pint glasses can come in many shapes that are used for specific types of beer. A goblet is usually used to serve dark ales. A sturdy glass mug can be used to serve American ales and porters. A standard pint glass has straight sides and can be used to serve any kind of beer. A snifter is used to serve Scottish and Belgian ales. [9] X Research source"
    },
    {
      "title": "Ask for a well drink.",
      "content": "Ask for a well drink. Well drinks are mixed drinks that are made with well liquor, also called house liquor. This can be any cheap, generic brand of liquor that is stocked for the purpose of making inexpensive mixed drink. If you don’t specify what kind of liquor you want in your drink, you will usually get the well liquor. Most bars stock these well liquors: Rum Vodka Gin Tequila Whiskey"
    },
    {
      "title": "Understand mixers.",
      "content": "Understand mixers. When ordering a mixed drink, specify the liquor first and the mixer second. Mixers are non-alcoholic beverages that can dilute and improve the flavor of medium- and low-quality alcohols. However, it is considered wasteful to add mixers to expensive, premium alcohol as it will ruin the flavor. Standard mixers include: Soda, or soda water Cola, such as Coca Cola or Dr. Pepper Cranberry juice, also called “cran” Tonic, or tonic water Lighter colored sodas, such as Sprite, ginger ale, or ginger beer"
    },
    {
      "title": "Order a tall or short mixed drink.",
      "content": "Order a tall or short mixed drink. The terms “tall” and “short” refer to the size of the drink and the amount of mixer in it. However, both drink sizes have the same amount of alcohol in them. If you don’t specify what size you want, you will usually get a short drink. When ordering, specify the size before the liquor type. For example: “I would like a tall rum and Coke, please.” “Can I have a short gin and tonic?” “I’d like a tall vodka cranberry.”"
    },
    {
      "title": "Specify a “single” or “double.”",
      "content": "Specify a “single” or “double.” By default, most mixed drinks are singles, meaning they only have 1 serving of liquor mixed in. However, if you order a double, you will get 2 servings of liquor in the drink. You can specify the drink size before or after saying the drink name. For example: “Give me a double vodka cranberry, please.” “Can I have a tequila soda, double?” “I’d like a double gin and tonic, please.”"
    },
    {
      "title": "Order straight liquor “neat” or “on the rocks.”",
      "content": "Order straight liquor “neat” or “on the rocks.” A glass of liquor can be ordered with ice (on the rocks) or without ice (neat). These drinks are usually ordered without mixers. However, margaritas are the exception, as they can be served frozen or over ice. [10] X Research source Specify how you want the drink served before any other descriptors. For example: “Can I have a neat double whisky, please?” “I’d like a margarita on the rocks, please.” “Can I have 2 neat Glenlivets?”"
    }
  ]
}