{
  "url": "https://www.wikihow.com/Paint-a-Car-with-a-Spray-Can",
  "title": "How to Paint a Car with a Spray Can",
  "steps": [
    {
      "title": "Sand",
      "content": "Sand the car using 600-grit sandpaper. Rub down the metal surfaces of the area you are painting using 600-grit sandpaper. Rub the sandpaper back and forth over the entire area. You will slowly start to see the paint flaking away from the car. Once the majority of the paint has been removed, switch to 1500-grit sandpaper. [1] X Research source Make sure that any rust on the car is thoroughly sanded off. This is a long process but will make your paint job look much better."
    },
    {
      "title": "Repair any holes in the metal with putty.",
      "content": "Repair any holes in the metal with putty. Removing rust can sometimes leave holes in the metal. Fill up the holes with a putty that is designed for cars or metal. Squeeze the putty directly out of the tube into the hole until it completely covered. Smooth the surface and remove any excess putty using a flat-edged putty knife . [2] X Research source Allow the putty to dry for 1 hour before rubbing it over with 1200-grit sand paper. Car putty can be purchased online or from a hardware store."
    },
    {
      "title": "Clean the surface of the car using a dry cloth.",
      "content": "Clean the surface of the car using a dry cloth. Remove any dust or dirt from the area using an old dry cloth. If there is any wax or stubborn dirt, try wiping it off using cellulose thinner. This will help to dissolve the wax and baked on dirt. Wipe the cellulose thinner over the area using an old cloth. You will only need a small amount as it is extremely potent. Cellulose thinner can be purchased from a hardware store. Always use cellulose thinner in a well-ventilated area as the fumes can be toxic. You can also wipe down the metal with a quick-drying liquid, like paint thinner or denatured alcohol."
    },
    {
      "title": "Cover any areas not being painted using painters tape and paper.",
      "content": "Cover any areas not being painted using painters tape and paper. Rip off pieces of painters tape and use them to cover any exposed surfaces that you don't want paint on. If you are trying to cover a large surface, such as a window, tape pieces of paper over the surface to protect it from the spray paint. Don't forget to cover any areas that aren’t metal, such as car bumpers, wheel rims, side mirrors, and window frames. [3] X Research source Painters tape can be purchased from a hardware store. Lay paper under your car if you don’t want paint on the ground surface."
    },
    {
      "title": "Choose a sheltered and well-ventilated location to use the spray cans.",
      "content": "Choose a sheltered and well-ventilated location to use the spray cans. Aerosols work best in warm, dry and sheltered conditions. Work inside a well-ventilated garage if it is cold and damp outside. Avoid humidity if possible as this makes it harder for the paint to dry. Make sure that your car away from anything that you don’t want paint on. Wear safety goggles and a dust mask to protect yourself from the paint fumes and dust."
    },
    {
      "title": "Apply 3 coats of primer, waiting 15 minutes between each coat.",
      "content": "Apply 3 coats of primer, waiting 15 minutes between each coat. Apply the primer to the car from 25 centimetres (9.8 in) away. Spray primer over the entire surface that you will be painting. Gently push down the spray button and move the can across the area using even, back and forth strokes. Move at a consistent pace to achieve an even coat. Wait 15 minutes before applying the next coat of primer. You will need at least 3 coats in order to get an even covering. It is best to apply multiple light layers of primer instead of a few thick coats as applying thick coats can cause the paint to drip. Allow the area to dry for at least 24 hours after the last primer coat."
    },
    {
      "title": "Sand the area with 1200-grit wet and dry paper until it is smooth.",
      "content": "Sand the area with 1200-grit wet and dry paper until it is smooth. Wet the sandpaper and rub it back and forth over the area until the primer coat is smooth and even. If you are sanding a large area you may need multiple pieces of sandpaper to achieve a smooth finish."
    },
    {
      "title": "Clean the area with warm, soapy water.",
      "content": "Clean the area with warm, soapy water. Remove the dust from the car using warm, soapy water on a cloth. Rinse the car to remove the soap suds and then dry the area with a towel (or wait for it to air dry)."
    },
    {
      "title": "Shake the paint can for at least 3 minutes.",
      "content": "Shake the paint can for at least 3 minutes. The pigments in the paint separate over time so you will need to shake the can vigorously to re-combine them. If you have already shaken and used the can within the last 12 hours you will only need to shake the can for 1 minute."
    },
    {
      "title": "Test the paint on a spare piece of cardboard.",
      "content": "Test the paint on a spare piece of cardboard. Hold the can about 25 centimetres (9.8 in) away from the card and spray the paint. Check the card to make sure that the paint has sprayed evenly. If it is patchy, shake the can for a few more minutes. A test spray will give you the chance to experiment with how much pressure you need to put on the spray button."
    },
    {
      "title": "Spray the paint onto the car, using horizontal strokes.",
      "content": "Spray the paint onto the car, using horizontal strokes. [4] X Research source Hold the can so that is parallel to the car’s surface and about 25 centimetres (9.8 in) away from the car. Push down the spray button and spray the paint over the car using even, back and forth strokes. Take care to keep the can parallel to the car as you move your arm across the area. Continue spraying until the area has a light even coat. Try to move the can at a consistent speed. Move your arm across the area at a consistent speed to achieve an even coat. Always keep your hand moving as you apply the spray paint so you aren't concentrating it in a specific location."
    },
    {
      "title": "Apply at least 2 coats of paint, with a 10-minute break between coats.",
      "content": "Apply at least 2 coats of paint, with a 10-minute break between coats. Applying multiple coats of paints will give an even surface to the car. Wait 10 minutes before applying the next coat. The paint should still be slightly sticky, this helps the next coat to stick and blend into the previous coat. If the surface still looks patchy after 2 coats, apply another coat after 10 minutes. Wait 30 minutes for the paint to dry before applying the clear paint."
    },
    {
      "title": "Spray a coat of clear paint over the area using a horizontal motion.",
      "content": "Spray a coat of clear paint over the area using a horizontal motion. Push the spray button and move the can along the area in a smooth motion over the surface you have already painted. This will help to protect the paint from the UV rays in the sun. Leave this coat to dry for 24 hours before using the car. [5] X Research source"
    }
  ]
}