{
  "url": "https://www.wikihow.com/Not-Get-Caught-Playing-Computer-Games",
  "title": "How to Not Get Caught Playing Computer Games",
  "steps": [
    {
      "title": "Turn the sound off on your computer speakers.",
      "content": "Turn the sound off on your computer speakers. While a computer game’s sound is often an important part of the playing experience, you’ll want to turn the sound off completely if you want to avoid getting caught playing a game. The sounds of your game will tip off anyone in earshot, and you won’t be able to hear anyone approaching from other parts of the house or office. While it’s a little riskier, you can always choose to play with headphones on and just leave one of the earbuds or headphones in. Try to avoid playing games that require sound if you’re trying to play a game undetected."
    },
    {
      "title": "Switch your game from fullscreen to windowed mode.",
      "content": "Switch your game from fullscreen to windowed mode. A game in fullscreen mode will take up the entire monitor. Windowed mode will make your game show up on a portion of your screen, and you’ll see the border around the game with the three buttons at the top of the window. You want quick access to those buttons, since they allow you to minimize and exit the game immediately. [1] X Research source Borderless is not the same as windowed mode. Borderless means that you can move your mouse off of the game when it’s in fullscreen mode and on to a second monitor if you have one. [2] X Research source"
    },
    {
      "title": "Open a page or screen that you want people to see if they interrupt your game.",
      "content": "Open a page or screen that you want people to see if they interrupt your game. A screen with homework, email, or a spreadsheet open are all good options depending on whether you’re at work, school, or somewhere else. Open a decoy page that you’d be comfortable with people seeing and then open your game and begin playing."
    },
    {
      "title": "Switch between screens quickly if someone walks in while you're playing.",
      "content": "Switch between screens quickly if someone walks in while you're playing. If you're using a Windows computer, press the alt and tab buttons at the same time. Then, with your finger still on alt, press the tab button again to switch to the next window. [3] X Research source If you're using a Mac computer, press the command button and W key at the same time to open all the tabs on your computer. Choose your decoy tab to quickly switch screens. [4] X Research source"
    },
    {
      "title": "Delete your browser history",
      "content": "Delete your browser history and recent downloads when you're done playing. That way, your parents or boss won't come across the games you've been playing if they use your computer. You can clear browsing data and your download history in the settings or history tabs in most browsers. If your parent or boss is particularly tech-savvy, you’ll want to clear your cookies too. This is usually an option in your browser’s history tab as well."
    },
    {
      "title": "Play your games when others aren’t around.",
      "content": "Play your games when others aren’t around. It sounds simple, but playing when nobody is around is a simple way to avoid getting caught. You can’t be accused of not getting your work done or staying off of the computer if there’s nobody around to see you!"
    },
    {
      "title": "Use your laptop in bed so you can act like you’re asleep if someone comes in.",
      "content": "Use your laptop in bed so you can act like you’re asleep if someone comes in. If you have your games on a laptop, play them in bed so that you can quickly close your computer and roll over to play like you’re asleep. You can always slide your bed sheet over the top of your screen as well so that your computer is fully hidden under your bed when you close it. If it's late at night, play your computer games on your laptop under the covers so you're even more hidden if someone comes in."
    },
    {
      "title": "Play your games at night time to avoid others.",
      "content": "Play your games at night time to avoid others. If everyone else in the house is asleep, you’ll have a much easier time sneaking in some gaming. Other people in the house will be unlikely to walk into your room late at night, and you’ll have an easier time hearing people moving around since your home will be quiet. Just make sure that you still get enough sleep!"
    },
    {
      "title": "Avoid games that can’t be paused.",
      "content": "Avoid games that can’t be paused. If you’re hoping to sneak in some time playing Fortnite or League of Legends, be aware that these games can’t be paused. If you have to switch screens or close the game quickly, you’ll be unable to protect yourself in the game. Try to stick to single-player games that have pause menus like Minecraft or others."
    },
    {
      "title": "Choose games that don’t require your undivided attention.",
      "content": "Choose games that don’t require your undivided attention. If you are one of those hardcore gamers that gets totally focused whenever you play an intense game, try playing something simpler and calmer. It is essential that you keep an eye and ear out for anyone that may be making their way towards your room if you want to avoid detection. Puzzle and base-building games tend to be good choices. They don’t have intense timers and can easily be ignored for a few minutes if you’re interrupted."
    },
    {
      "title": "Lock your door to avoid unwanted interruptions.",
      "content": "Lock your door to avoid unwanted interruptions. If your door is locked, you won’t be caught in the act while playing your game. You’ll have a second to switch screens before you have to get up and unlock the door. Be careful though, this will raise suspicions if you aren’t supposed to lock your door during work or homework time."
    },
    {
      "title": "Arrange your room so that your screen isn’t facing the door.",
      "content": "Arrange your room so that your screen isn’t facing the door. If someone walks into the room and can see your screen over your shoulder, you won’t have any time to minimize your game or switch windows. Position your desk in a way where you’re facing the door so that you buy enough time to change screens if someone wants to see what you’re doing. Set the brightness to low on your computer game if your desk is facing the door so that bright lights and colors don’t reflect all over the walls or windows behind you."
    },
    {
      "title": "Close doors in other parts of the house if you’re playing at home.",
      "content": "Close doors in other parts of the house if you’re playing at home. Even if they don’t lock, close the doors in your house so that you can hear when someone turns the knob to open them. This will let you know when an unwanted visitor may be heading your way and give you plenty of time to switch to a different screen."
    },
    {
      "title": "Buy a screen guard to hide what’s on your screen.",
      "content": "Buy a screen guard to hide what’s on your screen. A screen guard is a thin sheet of plastic that creates a glare for anyone that looks at your screen at an angle. This will prevent people from seeing what’s on your screen unless they’re looking directly at it from your chair. Buy a screen guard that fits your specific screen size, and slide it over the top of your monitor to set it in place."
    }
  ]
}