{
  "url": "https://www.wikihow.com/Manage-Your-Digital-Footprint",
  "title": "How to Manage Your Digital Footprint",
  "steps": [
    {
      "title": "You have to know exactly what your digital footprint is to manage it well.",
      "content": "You have to know exactly what your digital footprint is to manage it well. Search for yourself on a few different search engines to see the results that come up. Make a list of anything questionable or unprofessional that you’d like to get rid of or improve. [2] X Research source Check beyond the first page of Google or Yahoo. Go a few pages in to really uncover the results that show up. To really stay on top of your online presence, set a Google alert for your own name. That way, you’ll get a notification if anything mentioning you appears online. [3] X Research source"
    },
    {
      "title": "You might find some unprofessional posts when you search for yourself.",
      "content": "You might find some unprofessional posts when you search for yourself. This means that anyone can potentially see them, which could hurt you in your personal and professional life. Delete all of this as soon as possible. This way, people like bosses or potential employers won’t see them. Generally, questionable content includes profanity, risqué photos, drinking, or rude comments. Delete these if they show up, and resist posting more in the future. [4] X Research source You can’t always control what shows up online by yourself. For more help, contact the search engine that the results show up on and ask them to delete it. For example, Google allows you to report personal or private information showing up on their search engine by visiting https://support.google.com/legal/answer/3110420?visit_id=637400173194920762-1498842875&rd=1 . You can follow a similar process for Yahoo by visiting https://help.yahoo.com/kb/SLN4530.html . Remember that removing something from a search engine doesn't remove it from the internet entirely. It will still show up on the site that published it, so you'll have to contact the site administrator to get rid of that."
    },
    {
      "title": "\"Think before you post\" is the best guideline.",
      "content": "\"Think before you post\" is the best guideline. Think about all the implications of the posts you made, and only share things that show you in a positive, professional light. This way, you won’t have to be embarrassed if your family or potential employers see your posts. [5] X Research source Try to avoid posting something if you’re feeling emotional or angry. You might not be thinking about the bigger implications of what you say. If you aren’t sure whether or not something is appropriate to post online, ask a few people for their opinions first. If they say it’s not professional, then it’s best to avoid posting it."
    },
    {
      "title": "There’s no point in keeping accounts that you don’t use.",
      "content": "There’s no point in keeping accounts that you don’t use. Having all these accounts open just increases the amount of information about you online. This clutters your online presence, so close or delete any accounts that you don’t use anymore. [6] X Research source Usually, deleting an account doesn’t get rid of images or posts that have been shared on other platforms. If you want to get rid of something, you might have to contact the platform that it was shared on. [7] X Research source"
    },
    {
      "title": "Part of a good digital footprint is presenting a professional image.",
      "content": "Part of a good digital footprint is presenting a professional image. This means that the accounts and profiles you do use should be accurate and up to date. Go through your accounts and update any old details so potential employers or colleagues see accurate information. On your LinkedIn profile, for example, make sure you list your current job and contact information. Otherwise, potential employers might not be able to find you. This isn’t always necessary, especially for non-professional accounts. For instance, your Twitter followers don’t necessarily have to know where you work."
    },
    {
      "title": "This is a great way to keep your online presence professional.",
      "content": "This is a great way to keep your online presence professional. If you’ve had any professional or personal achievements, published articles, attended conferences, or improved yourself, share that on social media. You’ll quickly cultivate a positive online presence. [8] X Research source This is especially important for professional sites like LinkedIn. Visitors want to see the positive things you’ve done. Potential employers tend to like seeing volunteer work and membership in professional organizations, so be sure to share any of these activities on your pages. [9] X Research source"
    },
    {
      "title": "Most social media platforms have privacy settings, so use them.",
      "content": "Most social media platforms have privacy settings, so use them. Adjust the settings on all of your platforms to control and limit who can see your posts. Keeping your accounts private like this could help you avoid any embarrassment from someone seeing posts that you didn’t want them to see. [10] X Research source There are usually a few levels of privacy settings. You could limit posts to only your friends or followers seeing them, prevent commenting or interaction on some posts, and even select specifically who can and can’t see your posts. Remember that using privacy settings is not a substitute for being careful about what you post. Still avoid making inappropriate posts, even if your accounts are locked down."
    },
    {
      "title": "Managing your digital footprint is about protecting your identity too.",
      "content": "Managing your digital footprint is about protecting your identity too. If you’re sloppy with your passwords, accounts, and information online, hackers and thieves could steal your identity. To protect yourself, set strong, unique usernames and passwords for all of your online accounts. This decreases the risk of hackers accessing your accounts. [11] X Research source Using an online password manager can help you remember your passwords. Programs like OneLogin, Dashlane, and 1Password store your passwords and can automatically generate new, strong ones. If you have trouble keeping track of your passwords, write down a list in a notebook or planner and keep it in a safe spot. You could also keep a list saved on your desktop, but hackers could find that information if they gain access to your computer. Also avoid sharing this information on your social media or public accounts. Hackers could also get your information if you post it anywhere."
    },
    {
      "title": "Every time you search for something online, that information is stored.",
      "content": "Every time you search for something online, that information is stored. Private or incognito browsers keep you anonymous and prevent the browser from storing your search information. This prevents web browsers from building a profile for you based on your search data. Using private web browsers is a good way to avoid getting flooded with advertisements when you search, since the browser hasn’t compiled a search history for you. Incognito windows are also good for protecting your financial information. Shopping sites could store your credit card information without you realizing it, for example, which won’t happen on a private browser."
    },
    {
      "title": "Cookies are used to track your search data for specific sites.",
      "content": "Cookies are used to track your search data for specific sites. This is supposed to make your web experience more convenient because sites will remember you, but it could also store your personal information. To avoid this, make a habit of clearing the cookies on your web browser every few months to get rid of anything that could be tracking your activity. [12] X Research source When you delete all cookies, you’ll usually have to sign back into any accounts you had open, and you’ll lose some of your search history. Cookies are sometimes convenient for sites that you use frequently. For example, a cookie from your bank can remember your device and you won’t have to re-authenticate your computer every time you log on. You could select the cookies you want to keep if you want to have these options."
    },
    {
      "title": "Making different shopping accounts puts a ton of information online.",
      "content": "Making different shopping accounts puts a ton of information online. Luckily, many sites are now offering “Checkout as a Guest” options. This means you won’t have to make an account and save your personal information to shop. If you do have a lot of online shopping accounts, you can always close or delete them to get your information off the website."
    }
  ]
}