{
  "url": "https://www.wikihow.com/Quit-Pornography-and-Masturbation-Gradually",
  "title": "How to Wean Yourself Off Masturbating to Porn (+ Signs of Porn Addiction)",
  "steps": [
    {
      "title": "Put porn blockers on all of your electronic devices.",
      "content": "Put porn blockers on all of your electronic devices. Use a service such as Adguard to block pornography and other adult-oriented content on browsers. Apps such as BlockerX help keep your mobile devices porn-free. [1] X Research source Activate your browser’s safe search filters to make it more difficult for you to search and find adult-oriented content."
    },
    {
      "title": "Create obstacles that make it difficult to masturbate.",
      "content": "Create obstacles that make it difficult to masturbate. If you normally use sex toys when you masturbate, lock them up or put them in an extremely inconvenient place. Wear an extra layer of clothing to make it more difficult for you to touch yourself. [2] X Research source Remove any pornographic or suggestive posters or material from your home as well—they can potentially trigger the urge to masturbate and watch pornography. Whenever you get the urge to masturbate and watch pornography, create a journal entry describing the circumstances that triggered that urge. This will help you identify triggers so you can deal with them more easily."
    },
    {
      "title": "Practice meditation and mindfulness.",
      "content": "Practice meditation and mindfulness. Meditation can help you feel relaxed and present, which might help reduce any stress or restlessness. Mindfulness also helps prevent intrusive thoughts, like a fixation on porn sites or suggestive videos. [3] X Research source \"The first step to change anything is awareness,\" notes certified recovery coach Rachel Kove. [4] X Expert Source Rachel Kove Certified Recovery Coach Expert Interview. 27 April 2022. Meditation can help with that. When you meditate , you also become more conscious of your emotions , so you’re less likely to turn to addictive habits, such as pornography and masturbation, to avoid them. For a simple meditation, sit or stand in a comfortable position. Then, focus your attention on your breath. When your thoughts wander, simply acknowledge them and calmly bring your focus back to your breath. Do this for at least 5 minutes. Listen to guided meditations on YouTube or try mindfulness apps like Headspace , Insight Timer , or Calm ."
    },
    {
      "title": "Repeat positive affirmations when urges arise.",
      "content": "Repeat positive affirmations when urges arise. Using positive affirmations can help you rewrite the script in your head that causes you to seek out pornography. When you start thinking thoughts that trigger the urge to watch porn and masturbate, replace them with a positive affirmation. That urge isn't permanent—it will subside if you're able to ride it out. [5] X Research source While there's no single magic affirmation that works for everyone, here are some you might try: I am committed to overcoming my addiction and leading a healthier life.\" I am not defined by my past mistakes but by my future successes.\" I am proud of the progress I've made and excited for the progress yet to come.\" \"I am stronger than any urge or craving.\" \"I deserve to live a happy and healthy life.\""
    },
    {
      "title": "Let off steam with physical exercise.",
      "content": "Let off steam with physical exercise. If you watch porn and masturbate to unwind and relax, then exercising for 30 minutes a day is a great lifestyle swap. To help you release excess energy, add cardio to your workout . Choose activities that you enjoy—you might end up having so much fun that it becomes your favorite way to spend your free time. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For example, you might go for a jog in a scenic park, swim at a local pool, or take a dance class. Yoga is another great way to get physical exercise that can also help you reduce stress and live more mindfully. Going to a gym or joining a community sports team also allows you to connect to others."
    },
    {
      "title": "Spend more time with your friends.",
      "content": "Spend more time with your friends. Many people use masturbation and pornography as a way to cope with loneliness or boredom. Schedule your day so that you're spending as much time as possible out doing things. Try to avoid spending too much time alone, which can trigger those feelings of loneliness and also give you the opportunity to watch pornography and masturbate. [7] X Research source For example, if you normally watch porn and masturbate when you come home from work, you might meet friends for dinner after work rather than going home. Reader Poll: We asked 269 wikiHow readers and 58% of them agreed that being social helps them to manage their stress. [Take Poll] So, spending time with a social group like your friends may help you to manage your stress around porn and masturbation."
    },
    {
      "title": "Pick up a new hobby.",
      "content": "Pick up a new hobby. Studies show hobbies can reduce your stress, improve your mood, decrease your anxiety, enhance your focus, and even lower your heart rate and blood pressure. [8] X Research source If you find something that captivates your interest, you'll get a lot more enjoyment out of life and pornography's draw will become less difficult for you to resist. For example, you might pick up something creative, such as taking a painting or pottery class. Kove emphasizes that \"if you're trying to change any old habit, you have to fill that space with a new habit because your brain is going to crave that dopamine that you were getting from the pornography.\" [9] X Expert Source Rachel Kove Certified Recovery Coach Expert Interview. 27 April 2022. \"You need to literally replace that with something new immediately,\" she explains, \"and know that there's also going to be like a detox while you go through that.\" [10] X Expert Source Rachel Kove Certified Recovery Coach Expert Interview. 27 April 2022. \"It's good to have your brain focused on something new,\" Kove concludes. \"As it's letting go of the old behavior, it can focus on something new.\" [11] X Expert Source Rachel Kove Certified Recovery Coach Expert Interview. 27 April 2022."
    },
    {
      "title": "Treat yourself to other things that bring you pleasure.",
      "content": "Treat yourself to other things that bring you pleasure. Viewing porn can trigger the release of dopamine, which makes you feel good. This is also part of what makes it addictive. [12] X Research source Indulging in other things that release short bursts of dopamine can help you cope with quitting pornography and find better ways to get your dopamine boost. [13] X Research source Go for a variety of activities, large and small, that you find pleasure in. It could be something as simple as eating your favorite candy, going to an arcade, or listening to your favorite band. Avoid alcohol or drug use. While they might give you pleasure in the moment, they contribute to the cycle of dependence and can have a negative effect on your overall mental and physical wellbeing."
    },
    {
      "title": "Make a list of reasons you want to quit.",
      "content": "Make a list of reasons you want to quit. Write down all the ways you think your life will be improved. Then, place a copy of the list somewhere you can see it often, such as on your bedside table or next to your bathroom mirror. It will serve as a constant reminder of the reasons you want to quit. [14] X Research source For example, you might write down reasons such as \"stay on task at work\" or \"connect with my romantic partner on a deeper level.\" You might also make a list of the negative consequences you experience when you use pornography, if you believe you would be more motivated to avoid the negatives."
    },
    {
      "title": "Set a deadline to cut back to the level you want or quit entirely.",
      "content": "Set a deadline to cut back to the level you want or quit entirely. Get out a calendar and pick a day 2 to 3 months in the future. Then, work backwards from that date to set your schedule for cutting back on pornography and masturbation gradually. [15] X Research source Cut back incrementally each week until you're no longer using porn and masturbating at all. For example, you might start by only allowing yourself to watch porn for 30 minutes a day. After one week, you might cut that to 15 minutes a day. After 2 weeks, you might cut it to every other day. Fill the time you previously spent masturbating and watching pornography with other activities that give you pleasure and make you feel good about yourself."
    },
    {
      "title": "Keep a visual reminder of your progress.",
      "content": "Keep a visual reminder of your progress. Use a calendar to mark each day you're able to maintain your cut-down plan. It doesn't have to be anything obvious—you can just \"X\" off the date or use a smiley face sticker. But seeing those marks add up day after day can help motivate you to keep going. [16] X Research source If digital reminders help you more, try an app, such as Quit Porn , which gives you options to track your progress, journal, and create new habits."
    },
    {
      "title": "Talk to your partner if you have one.",
      "content": "Talk to your partner if you have one. Even though it can be awkward or embarrassing, it's important to level with your romantic partner (if you have one) about this issue. Pornography addiction can seriously impact your ability to form deeper emotional bonds with your partner. [17] X Research source Licensed clinical psychologist Jessica Behr acknowledges that \"this can be a sensitive topic, it can be embarrassing, it could bring up shame, it can bring up anger. So we do want to be cautious and sensitive.\" [18] X Expert Source Jessica January Behr, PsyD Licensed Clinical Psychologist Expert Interview. Thursday, August 12, 2021. Tell your partner that you've realized that this habit is problematic and is harming your relationship. Let them know that you want to return your focus to your connection with them. For example, you might say, \"I've gotten into a bad habit of masturbating to porn. I thought it was no big deal, but lately I feel like it's gotten out of control. I want to quit and focus on our relationship, and I could definitely use your help.\" Behr notes that it's important to focus on setting expectations and discussing your values and what you find necessary for your relationship so that you're \"able to meet each other's needs.\" [19] X Expert Source Jessica January Behr, PsyD Licensed Clinical Psychologist Expert Interview. Thursday, August 12, 2021."
    },
    {
      "title": "Join a support group.",
      "content": "Join a support group. A support group is a judgment-free zone where you can find support from other people who are dealing with the same thing. [20] X Research source \"Sex Love Addicts Anonymous is a great organization for somebody who struggles with pornography,\" advises psychotherapist Kelli Miller. [21] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 21 July 2020. \"You have to recognize that you're not alone,\" Miller continues, \"even though it's such an isolating feeling, you feel like you're the only one, this is more common than people think.\" [22] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 21 July 2020. Try not to worry about your secret getting out. These groups are extremely serious about confidentiality—you might even have to interview with a member or with the facilitator before you're allowed to attend a meeting. [23] X Research source There are also online groups and forums, including the NoFap subreddit , where you can seek support and guidance. [24] X Research source"
    },
    {
      "title": "Talk to a therapist.",
      "content": "Talk to a therapist. If you're struggling to quit using pornography on your own, a therapist can help you identify better strategies. Use an online directory to find someone near you who specializes in sex addiction or sexual health and dysfunction. [25] X Research source \"One of the healthiest things you could do,\" advises Kove, \"is to talk about it with a trusted professional… a counselor or therapist or life coach.\" [26] X Expert Source Rachel Kove Certified Recovery Coach Expert Interview. 27 April 2022. Kove notes that \"it's really like any drug addiction, honestly. It does the same thing in the brain.\" [27] X Expert Source Rachel Kove Certified Recovery Coach Expert Interview. 27 April 2022. For these reasons, Kove encourages you to \"become curious about how this behavior is trying to help you\" rather than condemning yourself or judging yourself. [28] X Expert Source Rachel Kove Certified Recovery Coach Expert Interview. 27 April 2022."
    },
    {
      "title": "Treat yourself with love and compassion.",
      "content": "Treat yourself with love and compassion. No matter how hard you try, you're not going to shame yourself into quitting pornography and masturbation. Instead, accept yourself for who you are and have patience with the process. [29] X Research source Real progress isn't linear and it's unrealistic to imagine that yours will be, so don't beat yourself up for any lapses. Remember that masturbation and sexual gratification are natural human urges—don't punish yourself for being human."
    },
    {
      "title": "You've tried to stop before and found that you couldn't.",
      "content": "You've tried to stop before and found that you couldn't. This might be the first sign that your habit has gotten out of control. You start to notice that using pornography is hurting your life in some way, so you decide to quit. Things go great for a few hours or even a few days, then you feel overcome with the urge to use pornography again. [30] X Research source Miller advises that \"typically we go toward an addiction when something's not working in our life.\" [31] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 21 July 2020. \"This is just a sign you're in pain,\" Miller continues. \"It doesn't mean you're a bad person.\" [32] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 21 July 2020. There's nothing wrong with admitting you need help to quit. \"You're taking the first step, which is very courageous, and there's a lot of bravery in that.\" [33] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 21 July 2020."
    },
    {
      "title": "You go out of your way to hide the behavior from other people.",
      "content": "You go out of your way to hide the behavior from other people. Masturbation is a solitary activity, but it's also a natural one. If you're going to great ends to hide it (for example, by carefully deleting all cookies and browser history or hiding photos you save), though, you might have a problem. [34] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You might also lie about your masturbation and pornography use to friends or family, especially if they've previously criticized you for it."
    },
    {
      "title": "You plan your day around when you can watch porn.",
      "content": "You plan your day around when you can watch porn. You might start the day by figuring out everything you have to do and getting it all out of the way so you can clear the afternoon. You might also cancel plans to free up time to watch porn. [35] X Research source For example, you might agree to meet your friends at a café in the afternoon, then back out later, saying that you're feeling sick, when really you just want to watch pornography. You might also schedule appointments or meetings around times when you normally watch pornography."
    },
    {
      "title": "You watch porn in public or in places where you shouldn't.",
      "content": "You watch porn in public or in places where you shouldn't. A strong sign of addiction is taking increasingly greater risks to get your fix. You might find yourself needing to scratch that itch in places where you could get in personal or legal trouble if you were discovered. [36] X Research source You might even feel a rush from the risk that makes the whole scenario more pleasurable for you. Unfortunately, this can also lead you to take even greater risks in pursuit of that same feeling."
    },
    {
      "title": "You decline social invitations because you want to watch porn.",
      "content": "You decline social invitations because you want to watch porn. When friends invite you to events, you might tell them that you don't feel well or that you already have plans. Really, you just want to stay at home by yourself to watch pornography and masturbate. [37] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This is especially problematic if you feel like you're missing out on really fun outings with your friends, or if you believe that your relationships with people you care about are suffering."
    },
    {
      "title": "You compulsively watch porn even when you don't want to.",
      "content": "You compulsively watch porn even when you don't want to. If you feel like it's a compulsion, Kove suggests \"taking a break and understanding your relationship to the pornography.\" [38] X Expert Source Rachel Kove Certified Recovery Coach Expert Interview. 27 April 2022. This is especially true if you find yourself watching porn even when you're not feeling particularly aroused, or if you feel like it's necessary for you to function in some other capacity. [39] X Research source For example, you might feel as though you can't shower or bathe unless you masturbate and watch pornography first. That belief could lead you to feeling as though you have to do it even if you're not really in the mood. Over time, you might find that you need to watch more intense pornography or watch for longer to achieve the same release."
    },
    {
      "title": "Your thoughts are preoccupied with porn.",
      "content": "Your thoughts are preoccupied with porn. Miller notes that a really important part of recovery is to first ask yourself \"Is this making my life unmanageable where I'm consistently thinking about this addiction?\" [40] X Expert Source Kelli Miller, LCSW, MSW Psychotherapist Expert Interview. 21 July 2020. If you find that you're always thinking about porn, even at times when it's completely inappropriate, that's a sign of an unhealthy fixation on it."
    },
    {
      "title": "Porn and masturbation interfere with your life and relationships.",
      "content": "Porn and masturbation interfere with your life and relationships. If you spend most of your time watching pornography and masturbating, you might find that you have little to talk about with the people in your life. If someone asks what you've been up to lately, you might not know how to respond. [41] X Research source Excessive masturbation and use of pornography can also affect your libido and make you less interested in pursuing romantic or sexual connections with other people. If you have a committed romantic or sexual partner, it's possible that they've mentioned your pornography use or expressed discomfort about it."
    },
    {
      "title": "You feel irritable if you can't watch porn or get interrupted.",
      "content": "You feel irritable if you can't watch porn or get interrupted. You think you have the house to yourself, then hear a key in the door and you're overcome with frustration and irritation. You might also find yourself getting way more frustrated than you usually would if a meeting runs late or you get stuck in traffic because you're trying to get home to watch pornography. [42] X Research source Studies have shown that people experiencing pornography addiction may have withdrawal symptoms, including irritability, when they decrease or stop using pornography. [43] X Research source"
    },
    {
      "title": "Skin irritation and other physical issues",
      "content": "Skin irritation and other physical issues Skin irritation is likely if you masturbate by rubbing yourself and you do this for extended periods during the day. This can even get to the point that masturbation becomes painful. [44] X Research source Depending on how you view porn, you might experience other physical issues, such as wrist, hand, back, or neck pain."
    },
    {
      "title": "Inability to connect with romantic partners intimately",
      "content": "Inability to connect with romantic partners intimately Research shows that overall sexual activity is significantly reduced among couples when one or both of them are addicted to pornography. In men over 40 in particular, excess pornography use is linked to increased rates of erectile dysfunction and decreased sexual desire. [45] X Research source This might also be related to the types of pornography you're watching. For example, you might be watching pornography that includes sexual activities your partner isn't interested in participating in. When you need progressively more extreme pornography to achieve release, you might also find it difficult to achieve release when you're engaged in more tame sexual activity with a real person."
    },
    {
      "title": "Lower self-esteem",
      "content": "Lower self-esteem Watching a lot of pornography can have a disastrous effect on your self-esteem, especially if you've internalized any social or religious beliefs that masturbation is dirty or wrong. Guilt and shame can also lead you to feel you have less value as a person or that you're not worthy of anyone's interest or respect. [46] X Research source"
    },
    {
      "title": "Depression, anxiety, and other mental health issues",
      "content": "Depression, anxiety, and other mental health issues Mental health issues are highly correlated with pornography addiction. Sometimes, addicts initially turn to pornography and masturbation as a relief from the anxiety and depression they're feeling. [47] X Research source Over time, pornography use and your mental health issues can become so intertwined that it's impossible to determine which came first. Isolating yourself from others so that you have time to masturbate and watch pornography also has a negative impact on your mental health."
    },
    {
      "title": "Feelings of guilt and shame",
      "content": "Feelings of guilt and shame In many cultures and religious traditions, masturbation is considered bad or sinful. If you were raised with that belief, you'll likely feel ashamed every time you use pornography. [48] X Research source That feeling can get stronger the more you use pornography, especially if you find yourself using it more often or using it in riskier circumstances."
    },
    {
      "title": "Potential social and legal consequences",
      "content": "Potential social and legal consequences The consequences can be pretty severe if you're caught masturbating, watching pornography, or exposing yourself in a public place. You could even end up having to register as a sex offender, which would impact your ability to find a place to live and a place to work for the rest of your life. [49] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source While it's true that you can get lots of pornographic content online for free, you might also find that you're spending a lot of money on porn or on other sex-related products and services."
    },
    {
      "title": "Quitting porn can help you build a healthier relationship with masturbation.",
      "content": "Quitting porn can help you build a healthier relationship with masturbation. Masturbation is totally normal and even beneficial. But pornography use can develop into compulsive behavior. If you find that you need to masturbate to pornography frequently and it is negatively impacting your life, interrupt the cycle by cutting back. Limit yourself to masturbation and pornography only at specified times of the day. Gradually decrease those times. Use porn blockers, browser filters, and apps to block adult content from your electronic devices. Connect with friends and your community. Spend time out with real people doing things that you care about instead of sitting home alone. Work with a counselor or therapist to unpack the needs pornography and masturbation fulfill for you so you can find healthier ways to meet those needs."
    }
  ]
}