{
  "url": "https://www.wikihow.com/Sew-in-Hair-Extensions",
  "title": "How to Sew in Hair Extensions",
  "steps": [
    {
      "title": "Decide if you want human hair or not.",
      "content": "Decide if you want human hair or not. There are two kinds of extensions: human hair and synthetic hair. Human hair is the most popular type for extensions; it's easy to look after (treat it the way you would your own hair) and essentially undetectable when properly put in place. Human hair extensions can be washed and styled like your natural hair. You can use straightening irons and curling irons or tongs on human hair and even dye it if you'd like. Human hair extensions need to be treated delicately. Human hair is more expensive than synthetic hair and cost can run in the hundreds of dollars. Cost does not always indicate quality; however, so be sure to look and feel carefully. Virgin hair extensions contain hair that has not been treated with chemicals or dye. They have the cuticle intact. They appear very natural. They are very expensive, however. The ethnicity of the donor can affect the texture, volume, curl, and ability the style. For example, European hair tends to be thinner, but you can find virgin hair in natural red or blonde tones. Indian hair is much thicker, and it is great if you want a silky straight style. [1] X Research source"
    },
    {
      "title": "Consider synthetic hair instead.",
      "content": "Consider synthetic hair instead. If you're looking to add thickness, synthetic is a great way to go because it creates more volume. Synthetic hair may come already styled. Synthetic hair is also cheaper than natural human hair. That said, most synthetic hair cannot be washed, colored, or permed. You cannot straighten or curl synthetic hair with most hot tools without ruining the hair. [2] X Research source"
    },
    {
      "title": "Choose a color.",
      "content": "Choose a color. Unless you intentionally want extensions in a fun color such as pink, blue or purple, choose a color that most closely matches your own hair color. If you can't decide between two shades, go with the lighter one. It can be difficult to find an exact match to your color, so if you're buying human hair, think about bringing it to your stylist to have it dyed to match your own hair color. In some cases, it may be best to choose 2 colors and sandwich them to achieve a natural look or to give the appearance of highlights. Alternatively, if you have hair that is lighter one end, and darker the other, you may find ombre extensions meet your needs the best."
    },
    {
      "title": "Calculate how much hair you need.",
      "content": "Calculate how much hair you need. The amount of hair you'll need depends on the thickness of your own hair and how much length and/or fullness you want to add. If adding fullness only and your own hair is similar to the length of the extensions, purchase two to four ounces of hair. If your own hair is much shorter than the length of the extensions you want, you'll need about six to eight ounces of hair to get a full, natural look. As a general guideline, the longer the length of the extension, the more hair you'll need for a full look."
    },
    {
      "title": "Consider how you'll wear your hair.",
      "content": "Consider how you'll wear your hair. Think about hairstyles and decide how you want your hair to fall after you have the extensions in place. This is important, as the way the hair is parted and how the extensions are placed dictates how the hairstyle will fall when it is finished."
    },
    {
      "title": "Wash and condition the hair.",
      "content": "Wash and condition the hair. Dry your hair completely with a blow dryer and comb through it to ensure there are no knots or snarls. The extensions work best with clean hair, and won't attach properly if the hair is greasy."
    },
    {
      "title": "Create a part for the extension.",
      "content": "Create a part for the extension. Part your hair at the point(s) on the head where you want to add the extension. For example, if you're sewing in an extension to add length, create a part that goes from temple to temple and/ or one that goes from the top of the left ear and across the head to the top of the right ear. Use a mirror to help you see as you work. Since this can be extremely difficult to do on your own, you may want to ask a friend or stylist for help. Try to get the line as even as you can. Once you do, comb up the hair above the part line and clip it into place. Part the hair again just a tiny bit underneath your first part. You want to create a very thin \"line\" of hair that you'll use to make your cornrow. Take the hair below your cornrow part and secure it with a ponytail holder. The cornrow braid will serve as the \"anchor\" on which the extension will be sewn."
    },
    {
      "title": "Start at one side of the head.",
      "content": "Start at one side of the head. Do not start all the way at the end if the person plans to wear her hair up or in a ponytail; otherwise, the extensions will show. Begin about 1 ⁄ 2 inch (1.3 cm) in."
    },
    {
      "title": "Grab three small, fairly equal size amounts of hair from the thin section of hair you've reserved for the cornrow.",
      "content": "Grab three small, fairly equal size amounts of hair from the thin section of hair you've reserved for the cornrow. Hold one in your right hand, one in your left and hold the center strand of hair in whatever hand feels comfortable. Do not start with too much hair. Keep the strand sections small so that the finished braid isn't bulky and doesn't create a \"bump\" under the extensions. If the cornrow is too thick, the hair could have trouble drying completely when you wash it and could become moldy."
    },
    {
      "title": "Begin by crossing the hair in your right hand underneath the hair in your center section.",
      "content": "Begin by crossing the hair in your right hand underneath the hair in your center section. Then cross the hair in your left hand underneath the hair that's now in the center. Repeat this criss-cross pattern along the part line of the hair. As you move, pick up additional hair from the head and add it to the center section so that you're creating one, continuous cornrow braid. You can either add hair to the center section or to the left- and right-hand sections as you braid. Just be consistent. Make your cornrow as tight as you can without causing pain."
    },
    {
      "title": "Secure the ends.",
      "content": "Secure the ends. When you've reached the end of your part and you've used all the sectioned hair to create your cornrow, secure the end of the cornrow braid with a hair elastic or rubber band. While braiding your hair, work towards the center of the head, beginning at the opposite side of the hairline and meeting in the middle. If you do this, the tail braid will fall down the center of the head instead of sticking out on one side."
    },
    {
      "title": "Thread your needle.",
      "content": "Thread your needle. Cut a piece of extension thread about 48 inches (121.9 cm) long and thread one end through the eye of a curved needle. Pull the thread through until there is an equal amount on both sides. You're going to be working with a double thread. Tie the two loose ends together with a secure knot."
    },
    {
      "title": "Secure the weft together.",
      "content": "Secure the weft together. A single hair extension is also known as a weft. If you want to create extra fullness, simply fold your weft in half. Take your needle and insert it through the unfolded edge of the weft so that it's held together along the unfolded size. You may need to trim the weft to the correct width. It should match the length of the braid. If you are folding it over, it needs to be double the length of the braid."
    },
    {
      "title": "Make the first stitch.",
      "content": "Make the first stitch. With the weft now attached to your needle and thread, insert your needle underneath the cornrow and bring it up. The curved needle should make this easy, and the point of the needle should now be pointing back at you."
    },
    {
      "title": "Attach the extension.",
      "content": "Attach the extension. Take the needle (the point is facing you) and insert it into the front of the extension right below the seam, which is called the track. If you're working with a folded weft, be sure your needle goes under both tracks. Hold the hair extension up and try to cover the cornrow with it. Insert the needle back under the cornrow and pull the thread gently, leaving a loop. If your cornrow extended beyond your part, simply fold it back onto the head as you attach the extension."
    },
    {
      "title": "Make a knot.",
      "content": "Make a knot. Once you bring your needle and thread up from behind your cornrow, insert the needle through the loop you left at the end of your last stitch and pull the thread through. Pull firmly to attach the extension in place securely."
    },
    {
      "title": "Continue sewing.",
      "content": "Continue sewing. Insert the needle back underneath the track of your extension about a 1 ⁄ 2 inch (1.3 cm) away from your last stitch. Slide the needle under the cornrow, leave a loop and bring the needle and thread through the loop to secure your extension. Continue sewing your extension along the part line keeping your stitches neat and a uniform 1/2-inch distance apart."
    },
    {
      "title": "End the row.",
      "content": "End the row. When you're one stitch away from the end of your extension, insert the needle through the front of the extension and tack the two folded ends to one another. Do not go under the cornrow again. Make two or three stitches to fold the folded end onto itself. Then insert your needle through one of the stitches, pull through to create a loop and insert your needle through the loop to make a knot. Knot the end two or three times for extra security. Trim the edges of the leftover thread on both ends of the extension."
    },
    {
      "title": "Cut if necessary.",
      "content": "Cut if necessary. Depending on how you wear your hair, you may need to get a hair cut to create a new style or to help your extensions blend even more seamlessly into your own hair."
    },
    {
      "title": "Wash with some care.",
      "content": "Wash with some care. You can absolutely wash your hair extensions, but it pays to take a little extra care. Be sure to wash and condition from top to bottom rather than washing your hair upside down or piling it up on top of your head. Put shampoo/conditioner in your hands and run hair through your palms. Avoid washing hair upside down in the sink or scrunching on top of your head. Choose hydrating or moisture-replenishing shampoos and conditioners. A leave-in spray conditioner is great, especially on ends. Be extremely careful when combing or brushing hair. Work from the ends slowly toward the scalp, gently removing tangles. Do not yank, scrub, or rub the hair."
    },
    {
      "title": "Be smart with styling products.",
      "content": "Be smart with styling products. You can use mousse, gel and hairspray on your extensions as long as those products are alcohol-free. It's best to stay away from shines, sheens or oils."
    },
    {
      "title": "Sleep smart.",
      "content": "Sleep smart. At bedtime, braid hair into two side braids or secure in a loose ponytail to prevent tangling. If you've curled your hair, try sleeping on a satin pillow to help keep your curls in place."
    },
    {
      "title": "Protect your hair when swimming.",
      "content": "Protect your hair when swimming. Saltwater and chlorinated water are very drying to hair and can cause major color fading or discoloration. If you're going into the water, put on a swim cap first. Braiding your hair before swimming can help prevent tangling."
    }
  ]
}