{
  "url": "https://www.wikihow.com/Remove-Unnecessary-Audio-with-Audacity",
  "title": "How to Remove Unnecessary Audio with Audacity",
  "steps": [
    {
      "title": "Select a background noise section of the track.",
      "content": "Select a background noise section of the track. Click and drag your mouse across a section of the track that contains only background noise if possible. If there isn't enough free track to do this, select the section with the most noticeable background noise."
    },
    {
      "title": "Click Effect.",
      "content": "Click Effect . This tab is at the top of the Audacity window (Windows) or the top of the screen (Mac). Doing so prompts a drop-down menu."
    },
    {
      "title": "Click Noise Reduction….",
      "content": "Click Noise Reduction… . It's near the middle of the Effect drop-down menu."
    },
    {
      "title": "Click Get Noise Profile.",
      "content": "Click Get Noise Profile . This button is at the top of the window. This will help Audacity determine what is background noise and what isn't."
    },
    {
      "title": "Select the section of the track that you want to clean up.",
      "content": "Select the section of the track that you want to clean up. You can also click the track and then press either Ctrl + A (Windows) or ⌘ Command + A (Mac) to select the whole track, which is ideal if you're working with a song."
    },
    {
      "title": "Click Effect, then click Repeat Noise Reduction.",
      "content": "Click Effect , then click Repeat Noise Reduction . It's at the top of the drop-down menu. This will apply the suggested noise reduction to the track."
    },
    {
      "title": "Reduce the noise again if necessary.",
      "content": "Reduce the noise again if necessary. Repeat the noise removal process if there's still a noticeable amount of background noise. You may have to do this several times. You can raise the amount of background noise removed by clicking Noise Reduction... in the drop-down menu and then sliding the \"Noise reduction\" slider to the right."
    },
    {
      "title": "Select a section of your project.",
      "content": "Select a section of your project. Find a section you want to remove, then click and drag your mouse across it to highlight it."
    },
    {
      "title": "Press Delete.",
      "content": "Press Delete . This will immediately remove the section from Audacity. You can also click Edit and then click Delete in the drop-down menu."
    },
    {
      "title": "Select the whole track.",
      "content": "Select the whole track. Click the audio track, then press either Ctrl + A (Windows) or ⌘ Command + A (Mac). This wikiHow guide can help you learn more about recording a full song in Audacity."
    },
    {
      "title": "Click Effect.",
      "content": "Click Effect . It's a tab at the top of the window (Windows) or screen (Mac)."
    },
    {
      "title": "Scroll all the way down and select Vocal Remover….",
      "content": "Scroll all the way down and select Vocal Remover… . You may have to click a downward-facing arrow at the bottom of the drop-down menu to find this option. Selecting it prompts a pop-out menu."
    },
    {
      "title": "Click a vocal remover plugin.",
      "content": "Click a vocal remover plugin. Click a link in the pop-out menu to the right of the drop-down menu. This will open the vocal remover window."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . Doing so will remove some of the vocals from the track. While this isn't 100 percent reliable, you'll notice a significant difference in the result. You can perform this step multiple times to increase the percentage of vocals removed, though doing so may harm the recording's fidelity."
    }
  ]
}