{
  "url": "https://www.wikihow.com/Play-The-Sims-4",
  "title": "How to Play The Sims 4",
  "steps": [
    {
      "title": "Download Origin.",
      "content": "Download Origin. You can purchase The Sims 4 right from your Mac or PC computer through Origin. The best way to get The Sims 4 is to download Origin to your computer. Navigate to www.origin.com in your web browser. In the upper right-hand corner of the navigation bar, you will see an option to Download Origin. Click the download button. Once on the download page, you will see a yellow button that says “Download Origin for…”. Depending on your computer, it will say “Mac” or “PC”. [1] X Research source On PC click the download button and click to save the Origin Setup file. Once it’s downloaded, look for the Origin icon on your desktop and double-click. This will launch the installer, follow the instructions to install Origin. On Mac, Click the download button. The Origin.dmg file will begin to download to your Downloads folder. Once the download is complete, locate the Origin.dmg file and click to open it. Drag the Origin icon into your Applications folder."
    },
    {
      "title": "Create an Origin account if you don’t have one.",
      "content": "Create an Origin account if you don’t have one. Once you start up Origin you will see a box to login into your Origin account or create a new one. If you don’t already have an account you can quickly create one by clicking the Create an account button. Fill in your date of birth and country, then click “continue”. Next, you will have to fill in the required information like email address, username, and password. Once you have completed the form, click Create Account."
    },
    {
      "title": "Purchase and download The Sims 4.",
      "content": "Purchase and download The Sims 4. Once you login to your Origin client on your computer you can begin to browse and purchase games, such as The Sims 4. Search for The Sims 4 in the search bar toward the top of the screen. You may see several Sims 4 options. The Sims 4 has several expansion packs that you can download separately. Make sure that you download either The Sims 4 or The Sims 4 Deluxe Edition. The Deluxe Edition adds extra content to your game like clothing and items. Click Add to Cart. Once you’ve added the game to your cart, you will see a “1” in your cart icon at the top right of the navigation bar, next to the search bar. Click your cart icon. Click Checkout to proceed to checkout. Follow the steps and fill out your payment methods. Once you’ve filled out all the information you can complete your order. Your game will begin to download. During the installation process you must have an internet connection. When you are playing the game, no internet connection is needed."
    },
    {
      "title": "Open The Sims 4.",
      "content": "Open The Sims 4. Once the game has finished downloading, you can click the My Games tab at the top of your Origin application. This will bring you to a page with all your downloaded games. Click on The Sims 4 icon and you’ll see a popup that has the option to Play. Click Play and your game will launch. It may take anywhere from a few seconds to a few minutes for The Sims 4 application to launch, so be patient. Your game will begin to load. If this is the first time opening the game, it may take several minutes while everything loads."
    },
    {
      "title": "Start a new family.",
      "content": "Start a new family. Once you’ve launched the game, you can start a new family and begin your Sims 4 journey. Click the New World button in the top left of the screen to start a new family. Clicking the New World button will bring you to Create-A-Sim, where you can begin building your new Sim family."
    },
    {
      "title": "Create a new Sim.",
      "content": "Create a new Sim. Create-A-Sim has been revamped completely in the Sims 4. You now have more control over your Sim’s physique and personality. Instead of the sliders present in the Sims 3, now your sims' appearances can be controlled and adjusted with your mouse. There are also options for Pre-made faces and body types. You can create one Sim or many. Upon entering the Create-A-Sim part of the game, you’ll see a randomly generated Sim which you can make change to your own preferences. [2] X Research source In the upper left portion of your screen you’ll see “Hello, My Name Is…” Click this area to name your Sim. Below you’ll see a panel for gender, age, walking style and voice. You can make your Sim male or female, a toddler, child, teen, young adult, adult, and elder. Beneath the age and gender panel you’ll see several hexagons, the number varies based on age. These are areas where you can add personality traits to your Sim. You can give each Sim a set of inspirations like love or wealth, and characteristics to go along. Characteristics give your Sims a bit of personality making each one unique. Adults can have a maximum of three traits, along with an extra that comes with an aspiration, teens can have 2 traits, and children can have a single trait. Click on different parts of your Sim’s body to edit how your Sim looks. The Sims 4 is full of both preset options and the ability to adjust small details like how far apart your Sim’s eyes are, or how much muscle tone your Sim has. You can give your Sim different hairstyles and clothes for different occasions. Play with presets or build your Sim from scratch. Add more Sims to your family by clicking the Add a Sim option in the lower left-hand corner of your screen. Once you’ve made your Sims to your satisfaction, click the checkmark icon in the lower right portion of your screen. You will then have the option to save your family and play. You can choose to add new Sims to your family with a new genetics feature. This will give you a Sim that looks like one you previously created. You can still make adjustments to how this Sim looks."
    },
    {
      "title": "Pick a neighborhood.",
      "content": "Pick a neighborhood. You can now place your Sims into a neighborhood. You have three neighborhood options for your Sims. You can live in Willow Creek, Oasis Springs, and Newcrest. If you add more expansion packs, you will see more neighborhoods.Click one of the neighborhood circles to be taken to that neighborhood. Once in a neighborhood, you have the option to move into a house or buy a vacant lot. Each family starts with 20,000-34,000 simoleons depending on how big your family is. If you choose to buy a home you can immediately start playing in a furnished home. Beware if you buy these, because the furniture is not very good, and sometimes there is just not enough of it. You also have the option to buy a vacant lot and begin building your own home."
    },
    {
      "title": "Build your home.",
      "content": "Build your home. Once your Sims are at your new lot, you can edit the home you’ve purchased, or build a new one from scratch. Enter Build Mode by clicking the tool icon in the top right corner of your screen on your control panel. [3] X Research source The Build Mode is identified by the hammer and wrench icon on the left of your toolbar. Since you don’t have a lot of money right now to build your home, you can use a cheat code to get some extra money. Enter Ctrl + Shift + C to enable the cheat bar. Type in “motherlode” into the bar to get $50,000. [4] X Research source Once you enter Build Mode you’ll see plenty of options for building your perfect home. On the bottom of your screen is a large toolbar that has a house to the left and a panel with several options to the right. Clicking parts of the house will bring up items to build based on what you click. For example, if you click on the wall of the house, you’ll get several options for building walls. Clicking on the living room icon will bring up a list of pre-made rooms sorted by room type. You can either click to drag a pre-made room onto your lot, or pick individual items. If it’s your first time building, a handy tutorial will pop up walking you through the steps. You can also rotate and expand rooms by clicking on a room with your pointer. You will then have the option to drag walls and rotate entire rooms. Pressing ESC on your keyboard will deselect whichever tool you were previously using. This allows you to use your pointer again without accidentally building anything. You can also take individual elements from styled rooms if you don’t want to add the whole room to your house. The Sims 4 also has a handy eyedropper tool which lets you click on an existing item and copy it to another location. If you wish for more pre-made houses or sims, you can use the Gallery. This is a collection of sims, rooms, and buildings that other Sims players have created, which you can download within the game. The gallery can be opened at any time during the game by pressing f4 on your keyboard."
    },
    {
      "title": "Get a feel for your Sims.",
      "content": "Get a feel for your Sims. Once you’ve placed your Sims in a home, you can click the play icon to let your Sims roam around. You will see small icons on the bottom of your screen which give you information about your Sim. You will also a small square box with your Sim’s faces in it. Clicking on one of these boxes will let you switch control between your Sims. When on a sim, you will see a small image of your Sim in the lower left-hand corner of your screen. Next to it will be your Sim’s mood. Above your Sim are thought bubbles. These bubbles will tell you what your Sim wants to accomplish. You can engage in activities with other Sims and objects to accomplish these wants for points, which you can spend on rewards. If you want to save these for later, hover your mouse over them and click the little pin. On the bottom right of your control panel you will see seven icons. You can click on each icon to pull up different information and statistics about your Sim. The icon to the left will have your Sim’s overall aspirations. Completing tasks will help you to achieve your Sim’s ultimate goals. Other icons give you information about your Sim’s work or school schedule, relationships, mood, etc."
    },
    {
      "title": "Talk and interact with other Sims.",
      "content": "Talk and interact with other Sims. To interact with another Sim, click on the Sim you want to engage with. You will see several bubbles pop up. Clicking on these bubbles will give your Sim a task to complete. Some bubbles lead to more options. You will have options to be friendly, mean, mischievous, and romantic. Different interactions with other Sims can affect your Sim’s emotions. Emotions in the Sims 4 include confident, bored, happy, energized, flirty, and many more. Emotions can influence the way that your Sim interacts with other Sims. You can also take action to increase or decrease a Sim’s emotion. For example, you can stab a voodoo doll which resembles another Sim to stop your Sim from being angry. Or, you can take a thoughtful shower to make your Sim inspired. Sims now can multi-task in The Sims 4. This allows Sims to have group conversations and also prevents the annoying situation of your Sim leaving a half-eaten meal on the floor to socialize with another Sim."
    },
    {
      "title": "Explore your Sim’s career opportunities and the world.",
      "content": "Explore your Sim’s career opportunities and the world. The options menu on the cell phone, located next to your Sim’s small face icon, includes options for finding a job and traveling. Your Sim will need money, known as Simoleans, to purchase anything. To get more money, you can get your Sim a job by calling job employers on your Sim's phone or by using your Sims' computer and searching for a job. Unless you get the “Get to Work” expansion, Jobs are unfortunately not playable. This means that you will fast forward time until the end of your shift unless you have more than one controllable Sim. Alternatively, you can make money through hobbies and skills, such as selling paintings or writing books. You can also zoom out on your map to travel to other locations and find more activities and Sims. Zoom out until you see the magnifying glass. Clicking it will let you travel to parks, bars, and the gym where you can meet new Sims."
    }
  ]
}