{
  "url": "https://www.wikihow.com/Multiclass-Bg3",
  "title": "How to Multiclass in BG3 + Multiclass Synergies",
  "steps": [
    {
      "title": "What is multiclassing?",
      "content": "What is multiclassing? Multiclassing is taking levels in a different class than your starting class. For example, if you started the game as a Bard but decided to take a few levels of Sorcerer, that would be considered multiclassing. One thing to note, however, is that for each level you take away from your main class, there are spells and abilities you won't be able to use. When multiclassing, you'll only be able to use a class's abilities up to the level you have in it. So, if you're level 5 but took 3 levels in Bard and 2 in Sorcerer, you'll only be able to do the actions that a level 3 Bard or a level 2 Sorcerer can do. Unlike Dungeons & Dragons , there are no stat requirements to multiclass in BG3. [1] X Research source"
    },
    {
      "title": "Why would I want to multiclass?",
      "content": "Why would I want to multiclass? There are a few reasons you might want to multiclass: To be more versatile. If you build your character right, a multiclassed character can have access to a lot of spells and abilities they might not normally have. To make a crazy build. Many BG3 players have fun making silly character builds to push the limits of what the game allows. To get an achievement. To get the \"Jack of All Trades\" achievement, you must multiclass into 12 different classes without respecing your character."
    },
    {
      "title": "What should I know before multiclassing?",
      "content": "What should I know before multiclassing? While there are no rules on how you have to multiclass, it's best if you have a pretty good handle on how each D&D/BG3 class works. This will help you understand how different classes synergize together and what spells or abilities are the best to take. You can multiclass however you want, of course, but it might get costly to keep respecing with Withers at camp. Here are a few other tips to know before you start multiclassing: To get Heavy Armor Proficiency without expending a feat, you must start as a class that has it (such as a Life Domain Cleric). This is why you'll see some builds listed as \"Cleric 1/Sorcerer 11\" for example. Fighters get Action Surge at level 2, which allows you to take another action during your turn once per short/long rest. Fighters, Rangers, Paladins, Pact of the Blade Warlocks get an extra attack at level 5. However, these extra attacks don't stack. For example, if you multiclass into Fighter 5 and Ranger 5, you won't get two additional attacks. It's a good idea to take ability score compatibility into account when creating a multiclass character. For example, Bard and Sorcerer both use Charisma as their spellcasting modifier, so multiclassing in both of these classes means you can focus your stats on Charisma without messing up the spellcasting stat of one of your classes."
    },
    {
      "title": "Go to the level up screen.",
      "content": "Go to the level up screen. You'll have to wait until you level up to multiclass. You can also respec your character at camp by talking to Withers, but it costs 100 gold per respec."
    },
    {
      "title": "Click the Add Class button.",
      "content": "Click the Add Class button. It's the small button with crossed weapons and a plus sign in the upper-right corner of the \"Level Up\" panel."
    },
    {
      "title": "Choose a new class.",
      "content": "Choose a new class. You can preview the class's actions and class features by hovering over the icons in the left-hand panel. Click Details for more information on the class's proficiencies."
    },
    {
      "title": "Choose your class spells, features, and abilities.",
      "content": "Choose your class spells, features, and abilities. If the class you choose allows you to pick spells or features, click on the tabs on the left-hand side of the screen to set them. For example, if you decide to multiclass into Ranger, you can pick an option for Favored Enemy and Natural Explorer at level 1."
    },
    {
      "title": "Click Accept to accept the change.",
      "content": "Click Accept to accept the change. Your character will immediately level up and will now be multiclassed. When leveling up again, you can choose which class gets that level, or you can even multiclass into an entirely different class."
    },
    {
      "title": "There are a number of multiclass synergies out there.",
      "content": "There are a number of multiclass synergies out there. Some of these synergies are old-school multiclass builds that come right out of the tabletop version of D&D , and others are brand new combinations made specifically for BG3. For full builds of the below synergies and even more builds to try, check out /r/BG3Builds/ . Barbarian & Champion Fighter This build is best played as a half-orc, thanks to the extra damage die you can roll when you crit. Moon Druid & Barbarian Take the Totem of the Bear to expand your damage resistance to all damage types except psychic. Fighter & Wizard You can replace Wizard with a Lore Bard, Warlock, or Sorcerer if you prefer. Cleric & Wizard While you can take Life Domain Cleric for Heavy Armor Proficiency, you might also want to take Knowledge Cleric for the expertise in two intelligence-based skills. Paladin & Sorcerer/Bard/Warlock This combination is your quintessential spellsword/hexblade, which is sometimes called a \"gish\" in D&D. Any of the three casters will work; it just depends on what you like to play and what type of abilities you want. Warlock & Bard By adding a few levels of Warlock to a Bard build, you can give your Bard some great damage-dealing moves that also scale off of Charisma. Assassin Rogue & Gloomstalker Ranger & Fighter Combining Assassin Rogue and Gloomstalker Ranger makes your character's first turn very deadly. Throw some Fighter in the mix to get Action Surge so you can pull off 3 attacks in your first turn. Life Cleric & Druid/Ranger By combining a Life Cleric with the Goodberry spell, you can do even more healing without needing to expend extra spell slots. Barbarian & Rogue By giving yourself a few levels in Barbarian, you can get Reckless Attack to give yourself advantage on an attack roll, which will then proc Rogue's Sneak Attack for lots of damage. Eldritch Knight Fighter & Abjuration Wizard By adding a Wizard into the mix with Eldritch Knight, you greatly expand the magic capabilities of your character. Warlock & Sorcerer While Warlock/Sorcerer is less objectively broken in BG3 than the D&D tabletop game, it's still a good multiclass build to give Sorcerer even more damage spells by way of Eldritch Blast and Agonizing Blast."
    }
  ]
}