{
  "url": "https://www.wikihow.com/Polish-Petoskey-Stones",
  "title": "How to Polish Petoskey Stones",
  "steps": [
    {
      "title": "Use a stone file to get rid of uneven areas.",
      "content": "Use a stone file to get rid of uneven areas. The objective is to remove any relatively small bumps and create an even shape. File around the entirety of your stones until satisfied. [2] X Research source Don't worry about getting rid of the scratches."
    },
    {
      "title": "Transition to sanding with 220 grit paper.",
      "content": "Transition to sanding with 220 grit paper. Dampen your stones with water beforehand. Hold each stone firmly in one hand, and rub the soon-to-be polished area with a steady, circular motion. Be careful not to over-sand. [3] X Research source"
    },
    {
      "title": "Rinse each stone and dry them with a towel.",
      "content": "Rinse each stone and dry them with a towel. If you're using a bowl of water, replace it with clean water often. The scrapings will accumulate and cloud the water if you don't. Carefully examine them for scratch marks."
    },
    {
      "title": "Repeat the aforementioned process using 400 grit paper.",
      "content": "Repeat the aforementioned process using 400 grit paper. This step should remove scratches from the coarser paper along with any white spots. Rinse, dry, and check your stone. [4] X Research source"
    },
    {
      "title": "Conclude the sanding with 600 grit paper.",
      "content": "Conclude the sanding with 600 grit paper. When you think all sanding marks have been removed, sand each stone for another 5 to 10 minutes. Your stones may already look smooth and beautiful, but this paper will ensure no scratches are missed. [5] X Research source"
    },
    {
      "title": "Choose a polishing base.",
      "content": "Choose a polishing base. Using one specifically made for rock polishing is ideal. Car-finish rubbing compounds work well, too."
    },
    {
      "title": "Apply the polishing base to your stones.",
      "content": "Apply the polishing base to your stones. Make sure it's a small amount (size of a quarter). Ensure the corduroy or velvet piece is lightly dampened beforehand. [6] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source"
    },
    {
      "title": "Polish your stones in the manner you used for sanding.",
      "content": "Polish your stones in the manner you used for sanding. Aim for a short, circular motion. Work your way from the top to the bottom. [7] X Research source See any scratches? Return to the 400 grit paper, and repeat the sanding process. Then, continue polishing until satisfied."
    },
    {
      "title": "Wipe them off with a cloth.",
      "content": "Wipe them off with a cloth. Make sure the cloth is clean and dry. Using a cotton cloth is fine."
    }
  ]
}