{
  "url": "https://www.wikihow.com/Save-a-Dying-Rose-Bush",
  "title": "Easy & Effective Ways to Revive a Dying Rose Plant",
  "steps": [
    {
      "title": "Yes, it can, as long as the branches still have green inside them.",
      "content": "Yes, it can, as long as the branches still have green inside them. Use clean cutting shears or a knife to carefully scrape off the bark from the tip of a branch. If there is green under the bark, that means that your rose bush is still alive and you'll be able to revive it . If the branch under the bark is brown, it means your rose bush is dead and you'll have to get a new one. [1] X Research source Snap a few branches off of your rose bush. If it snaps easily, it is likely that the bush is dead. If the branches are still flexible, it could still be alive. Alternatively, cut the tip of the branch off at the node. If the inside is green or white, the branch is still alive. If it is brown, it is dead. Note : Roses go dormant starting around fall and into winter. It’s natural for your rose bush to lose its flowers and leaves and experience slow growth, all of which can make it look like it’s dead. [2] X Research source"
    },
    {
      "title": "Clear the area around your rose bush of dead flowers and leaves.",
      "content": "Clear the area around your rose bush of dead flowers and leaves. Dead flowers and fallen leaves can cause your rose bush to develop diseases. Simply pick up any dead petals or leaves around the bush by hand and discard or compost them . [3] X Research source Don’t compost diseased plants, as the disease can potentially spread to other plants. Dead flowers and leaves are most likely to appear in the fall."
    },
    {
      "title": "Pull any weeds around your rose bush.",
      "content": "Pull any weeds around your rose bush. Weeds and other plants growing around your rose bush may be sucking up all the nutrients in the soil, weakening your rose bush. Pull and remove any weeds that you find in your garden by hand or dig them up with a garden spade. [4] X Research source You may also want to consider applying mulch to prevent new weeds from forming in your garden or yard. [5] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Make sure you pull up all of the weeds’ roots. If you leave any bits in the ground, they can start growing again."
    },
    {
      "title": "Pluck dead or diseased leaves and flowers off your rose bush.",
      "content": "Pluck dead or diseased leaves and flowers off your rose bush. If the rose bush’s flowers and leaves develop spots or splotches of discoloration, it's likely a sign that they are diseased or dying. Simply pluck off any dead or diseased flowers and leaves with your hands or shears. Neglecting to remove dead or diseased flowers and leaves can spread disease to the rest of the plant. [6] X Research source Common rose bush diseases include black spot, powdery mildew, and brown canker."
    },
    {
      "title": "Prune your rose bush after the last frost in the spring.",
      "content": "Prune your rose bush after the last frost in the spring. Wait to prune your rose bush until the risk of frost passes and the weather starts to warm up. During this time, you’ll notice the buds starting to swell. Waiting until the threat of frost passes helps prevent your rose bush from getting damaged by the cold. [7] X Research source Determine your area’s last expected frost date by consulting this map of average spring frost dates . Check the rose bush for signs of new leaf and bud growth; at this point, the rose buds should start to grow red. Landscaping specialist Gus Briones says rose bushes “need to be cut back” to ”encourage new growth” and keep them healthy."
    },
    {
      "title": "Use sharp, sterilized pruning shears and cut at a 45° angle.",
      "content": "Use sharp, sterilized pruning shears and cut at a 45° angle. Rub the shears with ethanol or isopropyl alcohol to sterilize them before you start pruning. This helps prevent your rose bush from getting diseased. [8] X Research source Then, make your cuts right above an outward-facing bud or thorn at a 45° angle. This helps the cane (branch) heal quicker and prevents water from pooling on the cut. [9] X Research source Make sure your shears are sharp, as dull blades can damage the bush."
    },
    {
      "title": "Cut off dead and diseased branches.",
      "content": "Cut off dead and diseased branches. Look for any canes on your rose bush that are dried, brittle, broken, rotting, or have spots of disease. Simply cut any dead or diseased branches down to the crown (base) of the bush. Some dead-looking branches might not be dead all the way through. Simply trim these branches back to the live portion of the branch, which looks green or white in the center. [10] X Research source"
    },
    {
      "title": "Prune crossing and outward growing canes.",
      "content": "Prune crossing and outward growing canes. Prune any branches that are crossing over each other or touching down to the crown. Then, snip off branches that are growing outward. This helps open up the center of the plant to allow better airflow and sun exposure, which reduces the risk of disease. [11] X Research source A healthy, fully grown rose bush typically has 4 to 7 healthy, vertically growing canes."
    },
    {
      "title": "Prune the top of the bush so that it’s 18 inches (46 cm) high.",
      "content": "Prune the top of the bush so that it’s 18 inches (46 cm) high. Cut off the top portion of growth during the early spring. This helps your rose bush grow and bloom new flowers during the new blooming season. Simply prune back all the branches towards the top of the bush so that the bush itself is only 18 inches (46 cm) high. [12] X Research source"
    },
    {
      "title": "Get a balanced granular or liquid 10-10-10 fertilizer.",
      "content": "Get a balanced granular or liquid 10-10-10 fertilizer . Rose bushes need regular fertilizing to grow big and healthy and look their best. Simply get a balanced granular or liquid 10-10-10 fertilizer. A balanced fertilizer incorporates all the nutrients the bush needs. [13] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Alternatively, use a rose-specific fertilizer . They provide the exact minerals and nutrients that your roses need. You can also create your own nutrient powder by mixing together 1 cup (240 ml) of bone meal or superphosphate , 1 cup (240 ml) of cottonseed meal , 1 ⁄ 2 cup (120 ml) of blood meal , 1 ⁄ 2 cup (120 ml) of fish meal , and 1 ⁄ 2 cup (120 ml) of Epsom salt (magnesium sulfate)."
    },
    {
      "title": "Start fertilizing in the spring or when you notice new growth.",
      "content": "Start fertilizing in the spring or when you notice new growth. Rose bushes need fertilizing during the growing season, or the beginning of spring. However, if you notice new growth in your rose bush, start giving it fertilizer even if it's a bit early. Your rose bush requires more nutrition when it is growing and budding. [14] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source During the peak growing season, fertilize your rose bush every 4 to 6 weeks. Stop fertilizing your rose bush in the late summer or early fall (July-August) to allow the new growth to harden off for the winter; new growth is especially vulnerable to cold temperatures."
    },
    {
      "title": "Add fertilizer to the base of the plant, following the label instructions.",
      "content": "Add fertilizer to the base of the plant, following the label instructions. Lay the fertilizer down evenly around the bush and up to the perimeter of your growing area. Then, lightly work it into the soil. Just keep the fertilizer at the base of the plant so it doesn’t touch the main stalks. [15] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source If the fertilizer comes into contact with your plant’s stalks or leaves, it can burn them and cause them to wilt."
    },
    {
      "title": "Water the soil before and after laying down the fertilizer.",
      "content": "Water the soil before and after laying down the fertilizer. Use a garden hose to water the soil thoroughly before spreading the fertilizer to help prevent the fertilizer from burning your plant. Then, water around the rose bush again to incorporate the fertilizer into the soil and further protect your plant from burns. [16] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source"
    },
    {
      "title": "Apply horticultural oil or insecticidal soap to get rid of pests.",
      "content": "Apply horticultural oil or insecticidal soap to get rid of pests. Rose bushes are susceptible to some pests, like aphids, mites, thrips, and scales. If you notice discolored, speckled, or moldy leaves and branches, spray them with a horticultural oil like neem oil or an insecticidal soap. [17] X Research source Pests can also cause buds and flowers to drop."
    },
    {
      "title": "Cut off diseased leaves and branches when you see them.",
      "content": "Cut off diseased leaves and branches when you see them. Rose bushes are prone to some diseases like black spot, powdery mildew , and rose rosette disease. If you see spotted or discolored leaves, splotchy branches, fungus, or white mildew on the bush, remove the affected areas with sterilized shears. [18] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Diseases can cause your rose bush to drop its leaves and buds. They can also prevent your brush from growing healthily or even cause it to die."
    },
    {
      "title": "Water your rose bush when the soil is dry, or about 2 times per week.",
      "content": "Water your rose bush when the soil is dry, or about 2 times per week. Rose bushes need a lot of water to grow big and strong . If you don’t have weekly rainfall or your rose bush is a potted indoor plant, give your roses a deep, thorough soak about twice per week. Just make sure the soil is dry before you water your plant again. Simply poke your finger 2–3 inches (5.1–7.6 cm) into the soil to see if it’s still moist or dry. [19] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Apply the water slowly around the base of the plant to ensure it gets a deep, thorough soaking. Roses will wilt and dry out when they aren’t watered enough. Plant specialist Andi Xoch says another sign that your plant is under-watered is that “your leaves are going to start drying up” and “get[ting] crispy tips…eventually they're just gonna fall off.” Overwatering can also hurt your rose bush. Xoch says “yellow leaves are going to be your number one sign that you've been over-watering” your plant.”"
    },
    {
      "title": "Water your rose bush before sunrise or after sunset.",
      "content": "Water your rose bush before sunrise or after sunset. If you water your roses in the middle of the day when the sun is out, they can get water spots. In addition, the water evaporates more quickly and won’t have a chance to penetrate the soil. [20] X Research source"
    },
    {
      "title": "Ensure your rose bush gets at least 6 hours of direct sun.",
      "content": "Ensure your rose bush gets at least 6 hours of direct sun. Plant specialist Tyler Radford says “most roses do like a lot of sunlight,” so they need about 6 to 8 hours of full sun each day. [24] X Research source v161650_b01. Tuesday, October 6,2020. If your rose bush is in a spot that gets too little or too much sun, it might grow poorly or start to die. Simply transplant the bush to a more ideal spot in your garden, or move the container if it’s growing in a pot. [22] X Research source"
    },
    {
      "title": "Provide your rose bush with well-draining soil.",
      "content": "Provide your rose bush with well-draining soil. Rose bushes don’t do well when they’re left sitting in soggy, water-logged soil. If possible, move your rose bush to a spot in your garden that is well-draining and doesn’t pool water. [23] X Research source Or, improve the current soil’s drainage by adding a 2 to 4-inch (5-10 cm) layer of manure or compost onto the ground. Then, work it 6 to 12 inches (15-30 cm) deep into the soil. [24] X Research source Test your soil’s drainage first by digging a 12-inch (30 cm) hole in the soil. Fill the hole with water and wait for it to drain. Then, fill the hole with water again and measure the drop in water after 15 minutes. Multiply the number by 4 to tell how fast the water drains in 1 hour. In general, water that drains less than 1 inch (2.5 cm) per hour is poor draining."
    },
    {
      "title": "Cover the area around your bush with 1–2 inches (2.5–5.1 cm) of mulch.",
      "content": "Cover the area around your bush with 1–2 inches (2.5–5.1 cm) of mulch. Purchase an organic or an inorganic mulch online or at a home and gardening store. Then, sprinkle the mulch around the rose bush in an even layer. Just leave 1 inch (2.5 cm) of clearance around the base of the bush. [25] X Research source Organic mulch includes wood chips , straw , grass clippings, and leaves. Inorganic mulch includes gravel , stones , and glass . Do not pile the mulch up around the crown of the bush. Adding mulch helps the soil retain more moisture for the roots and discourages weed growth. Replace or add more organic mulch once a year at the beginning of the summer."
    },
    {
      "title": "Lay down a cardboard mulch if you have weed problems.",
      "content": "Lay down a cardboard mulch if you have weed problems. Laying down cardboard mulch can solve extreme weed problems. Simply place the mulch over the entire area. This prevents any weed seeds from being exposed to the sun and keeps them from sprouting. [26] X Research source"
    }
  ]
}