{
  "url": "https://www.wikihow.com/Restring-a-Necklace",
  "title": "How to Restring a Necklace",
  "steps": [
    {
      "title": "If necessary, clean your beads.",
      "content": "If necessary, clean your beads. If the necklace you're restringing has been through some wear and tear (which is likely why it broke), it's likely that the beads could use some love. Oils from your body or cosmetics (or even just time) can dull any bead and make it look less than glamorous. Buy a jewelry cleaner and use a child's toothbrush to start – the gentler, the better. You never know which beads aren't going to take to cleaning, so it's best to play it safe in the beginning. Glass and crystal should do fine, but simulated pearls and plastics could be another story. Always do one single bead before you go cleaning the entire lot to make sure the method you're using is safe."
    },
    {
      "title": "Get all your supplies together.",
      "content": "Get all your supplies together. It's best to do this in one afternoon so the beads don't end up magically rolling away from you. Here's everything you'll need: Stringing material and clasp. Nylon coated cable beading strands are best for most any project. They're widely available at craft stores and come on spools in different weights, strengths and colors. Don't be tempted to use thread – it'll likely fray and break, leading you back to this article in the future. Chainnose pliers and cutters . If you don't already have a suitable pair of pliers, it's wise to obtain a jewelry repair kit. They'll also come with a crimping tool, which is doubly helpful for sealing off your strands. Bead tips. These are the beads that are used on the end that attach to a clasp on either end. They have a \"clam shell\" or \"cup\" on the sides. Crimp beads. These are soft metal beads with large holes. They can be mashed against the stringing material to hold it in place. Glass seed beads . These can be used as spaces if you need a longer necklace. They come in so many varieties you should be able to match your other beads. A beading board, mat, or towel for a work surface. A beading board has a whole bunch of groves to keep your beads in place. If you don't have one of these, a towel can also be useful to keep the beads from running off. Avoid working on wood or tile at all costs."
    },
    {
      "title": "Take apart your necklace.",
      "content": "Take apart your necklace. Don't bother trying to keep the beads on their original string. There likely won't be space enough for both strings and it'll be harder to work with, so just take them off. Set them on your surface and slide out the string so they stay in order. You probably have bead tips on the ends of your necklace – the ones that are attached to your clasps. You can take your pliers and open up the loop on those beads to get them off the clasp and get every piece free. If you have multiple strands you're dealing with, just work on one strand at a time. If you unstring all your strands, that's just creating a recipe for disaster."
    },
    {
      "title": "String the beads, working off the spool.",
      "content": "String the beads, working off the spool. For strong bead cord, you don't need a needle. It'll slide through the bead holes on its own. Simply slide the beads on the cord one by one, still working off the spool. That way if you need more length, it's hardly a problem. Just be careful not to put any tension on the string; even though it's brand new, it could still warp. When you're finished putting the beads back on, take a look at it. Are all the beads in their pattern correct? Is it long or short enough? If for some reason you can't work off the spool, get a length of bead cord that's about six inches (15 cm) longer than you think you need. Tie a knot at one end and secure it with craft glue. Then you can go about stringing on your beads (just remember to start with a bead tip). [1] X Research source"
    },
    {
      "title": "Attach the clasp.",
      "content": "Attach the clasp. Once all your beads are on, string on a crimp bead, a bead tip, and a seed bead. Here's where it starts to take know-how: [2] X Research source Pass your cord back through the hole in the bead tip, leaving the seed bead to catch on the inside, and pass back through the crimp bead. Place the seed bead snugly inside the bead tip and place the crimp bead up against the bead tip. Mash the crimp bead against the stringing material with your pliers. To make sure it all stays in place, use a drop of craft glue or nail polish inside the bead tip before closing it over the seed bead. Then, slide a bead over the free tail of your bead cord, then clip the string close to the bead so the tail is tucked inside."
    },
    {
      "title": "Alternatively, try a knotting method.",
      "content": "Alternatively, try a knotting method. If that all sounded like gobbledegook, you can try simply tying a knot in the end of your cord, as close to the bead tip as you can. Then, secure this with craft glue. Cut off the extra cord so the knot can hide in your bead tip. Then, you can slide your clasp onto the bead tip hook. Use your pliers to close the hook so the clasp can't slide off."
    },
    {
      "title": "Finish the other end of your necklace.",
      "content": "Finish the other end of your necklace. If you're working from a spool, cut the cord free, leaving about two extra inches (5 cm). Hold each end in your hands so the beads settle and the cord lays naturally. Repeat the same method on this end as you did with the first clasp. If you're using clam-shell type bead tips, make sure to close them over the seed beads and to use your pliers to close the hook."
    },
    {
      "title": "Work on a non-rolling surface.",
      "content": "Work on a non-rolling surface. If you have a bead tray, great – if you don't, work on a towel, large piece of felt, or even foam. Keeping the order of beads is pretty important, and you don't want them rolling all over the place."
    },
    {
      "title": "Get your materials together.",
      "content": "Get your materials together. Here's everything you'll need: Your beads Clasp A beading needle (a fine needle with a large eye) Thread, either silk or synthetic A match or lighter (for burning off loose ends of synthetic thread) Super glue and toothpick (if using silk thread) Scissors or clippers"
    },
    {
      "title": "Thread your needle.",
      "content": "Thread your needle. This isn't your normal \"thread the needle\" step. You're actually threading it to thread it. It'll all be clear in a second. Here's how it's done: Take about 10\" (25 cm) of your thread and separate it into finer strands. Take one of the fine strands and thread that through the needle. Tie a knot so the strand makes a loop that goes through the eye of the needle (this loop holds the thread that will be the string of your necklace. It enlarges the eye of the needle, making it much easier) Cut off a strand of thread about 3x the length of your desired necklace. Double it over and put the loose ends through the loop you've already made. Don't knot this string; just leave it be. Make sure it's pulled far enough to avoid the string slipping out, however. Now your needle is officially, albeit strangely, threaded."
    },
    {
      "title": "Attach the clasp.",
      "content": "Attach the clasp. Take the clasp from your original necklace (or a new one) and loop the thread through it. To do this, just put the needle through the ring on the clasp and then back through the end loop in the thread. You may want to tie a knot close to the clasp at this point. It will keep the loop from slipping up onto the ring incorrectly."
    },
    {
      "title": "Start stringing on your beads.",
      "content": "Start stringing on your beads. Simply thread the beads onto the string with the needle, pushing the beads to the edge of the clasp. Go slowly so you get the pattern correct – you don't want all the beads on only to realize that you messed it up once halfway through."
    },
    {
      "title": "Once all the beads are on, remove the needle.",
      "content": "Once all the beads are on, remove the needle. Tie a double knot at the end where there are two loose ends on your string (opposite the clasp). Then, push the beads to this newly knotted end."
    },
    {
      "title": "Tie a knot after each bead.",
      "content": "Tie a knot after each bead. Take one bead and then slide it over to the clasp. On the side of the bead opposite the clasp, tie a tiny knot to keep it in place. It'll be helpful if you hold the loop down on the bead and then tighten. Keep this tension as you pull the knot shut. After each knot, separate the threads and pull them apart to move the knot closer to the pearl. You don't want the knot to be visible. You could also put a needle through the knot and use it to guide the knot against the pearls."
    },
    {
      "title": "Keep on knotting between each bead.",
      "content": "Keep on knotting between each bead. Grab the next bead and bring it next to the knot you just made. Tie another knot, keeping a finger over it as it's being pulled to keep it snug. Keep doing this until all your beads have been moved over and knotted to the side with the clasp. This is a skill and you will get better with practice. It may take a few necklaces to get it right. They will get tighter as you go."
    },
    {
      "title": "Cut off the extra thread on the other side to finish off.",
      "content": "Cut off the extra thread on the other side to finish off. After you've knotted each bead, cut off the end thread knot you made a while ago. Then, put those ends through the other side of the same clasp. Pull the thread tightly up the last knotted pearl and tie a good, sturdy double knot."
    },
    {
      "title": "Seal it with either super glue or a small, brief flame.",
      "content": "Seal it with either super glue or a small, brief flame. If you're using silk thread, you can apply a tiny dot of super glue onto the end with a toothpick. Then, cut the thread close to the knot after the glue is dry. If you're using synthetic thread, cut within 1/4\" (.8cm) and melt the short, loose ends with the flick of a small flame. Note: be careful. It's possible you could melt your necklace. [3] X Research source Be very, very, very brief with this."
    }
  ]
}