{
  "url": "https://www.wikihow.com/Pass-a-Test",
  "title": "How to Pass a Test",
  "steps": [
    {
      "title": "Give yourself enough time to study for the test.",
      "content": "Give yourself enough time to study for the test. Know when the test will be given so it doesn't surprise you. Come up with a schedule so you can have adequate time to study for the test. If the material is easier, you may not need as long as you will if the material is more difficult. Allowing yourself adequate time to study will help you do better. [1] X Research source"
    },
    {
      "title": "Study before the test.",
      "content": "Study before the test. One of the best ways to pass a test is to study the information every day. Cramming for the test at the last minute is not a good practice and can lead to failure. Instead, spend 30-60 minutes every day studying the material you went over in class that day. If you don't want to study every day, spend the week or two before the exam studying every day. [2] X Expert Source Jake Adams Academic Tutor & Test Prep Specialist Expert Interview. 20 May 2020. This gives you time to revisit concepts you don't quite understand and allows you time to absorb the information. If you don't understand something, studying beforehand gives you enough time to ask the teacher about it in class. You could make up pop quizzes to test your knowledge on some of the materials that might be on the test. [3] X Expert Source Ted Coopersmith, MBA Academic Tutor Expert Interview. 12 May 2021."
    },
    {
      "title": "Analyze previous tests.",
      "content": "Analyze previous tests. Look at previous tests you have taken in the class. What things did the teacher mark wrong? What kind of things is she/he looking for in answers? Figuring this out can help you study better and improve your answers. Also look at the types of questions your teacher asks. Do they focus mostly on broad concepts or specific examples? This can help you study more effectively. [4] X Research source Ask your teacher for sample tests. [5] X Expert Source Jake Adams Academic Tutor & Test Prep Specialist Expert Interview. 20 May 2020. Some teachers and professors will provide sample tests for students. If you are taking a standardized test, it is extremely important to take sample tests to get an idea of how the test will be structured. Look at previous homework assignments, too. Many times, teachers will use homework questions on the test, or write questions in a similar way."
    },
    {
      "title": "Mix up your studying techniques.",
      "content": "Mix up your studying techniques. Instead of studying the same way every night, change how you study. Spend one night reading the textbook, one night learning terms and definitions, one night studying with flashcards, and one night taking practice tests."
    },
    {
      "title": "Find the most important concepts.",
      "content": "Find the most important concepts. [6] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. While studying, go through your textbook and your class notes. Look for the most important concepts. This may include things that are brought up again and again, concepts that are explained in detail, or things your teacher told you was important. Listen closely to your teacher when they lecture. They could give hints about what material will show up on the test. Make a note of this in your notes in case you forget."
    },
    {
      "title": "Get tutored.",
      "content": "Get tutored. If you are struggling with the material, go to a tutoring session. This might be from your teacher or professor, or maybe the school tutoring services. You may also ask a classmate who understands the material to help you."
    },
    {
      "title": "Make a review sheet.",
      "content": "Make a review sheet. Though you will be reviewing all of your notes and the chapters, you should also make yourself a review sheet. This sheet includes all the major terms, concepts, and ideas that will be on the test. Think of it like the highlights of the material. Having it on this separate sheet makes it easily reviewable and might help you remember it better. [7] X Research source"
    },
    {
      "title": "Complete the study guide.",
      "content": "Complete the study guide. If the teacher gives you a study guide, make sure that you complete it. This is a great way to review the material. Many times, teachers will pull questions directly from the study guide or reword questions from the study guide. Study guides also help you focus your studying so you study the correct material."
    },
    {
      "title": "Form study groups.",
      "content": "Form study groups. Gather a few classmates from your class to study together. Quiz each other, come up with possible test questions, and use each other's notes to fill in gaps in your own notes. You also can help explain concepts to each other that you might be confused about."
    },
    {
      "title": "Talk to your professor or teacher.",
      "content": "Talk to your professor or teacher. Before the day of the test, talk to your professor or teacher about the format of the exam. Many teachers will tell you whether the test will be multiple choice, true/false, fill-in-the-blank, or essay. Knowing the format can help you figure out how to study the information. Ask your teacher for a study guide. If they won't give you one, ask them for any tips or suggestions for studying so you can prepare. Ask your teacher which chapters the test will cover, or ask them to help you review what you should study. Ask the professor or teacher for suggestions on how to study for their test."
    },
    {
      "title": "Get a good night's sleep.",
      "content": "Get a good night's sleep. The night before the test, make sure you get a restful night's sleep. Don't stay up late cramming. Being sleepy can cause you to forget things or be unfocused. Show up refreshed and ready to take the test."
    },
    {
      "title": "Eat a healthy breakfast.",
      "content": "Eat a healthy breakfast. Don't skip breakfast the morning of the test. Make sure to eat a breakfast with protein and fiber instead of sugary foods. This helps keep you sustained, focused, and strong instead of crashing. [8] X Research source Eat eggs, yogurt, and granola instead of a sugary cereal or donuts. [9] X Research source"
    },
    {
      "title": "Arrive to the test early.",
      "content": "Arrive to the test early. Gather what you need for the test the night before. [10] X Research source Leave for class so you will arrive 10-15 minutes early; if you are in middle or high school, don't hang around the halls with your friends. Make sure to bring any materials you need, like pens, pencils, blue books, paper, or calculators. Take a few minutes to relax before the test. Take a few deep breaths, think positive thoughts, and get comfortable and relaxed. Go to the restroom before the test. This will ensure that you are not distracted during the test and focused on needing to use the restroom."
    },
    {
      "title": "Understand how the test will be graded.",
      "content": "Understand how the test will be graded. Knowing the way the teacher will grade the test can help you approach questions. Will you lose points for incorrect answers? Will you not lose points if it's left blank, or should you guess? [11] X Research source Does the teacher give partial credit? These things help you decide how to answer questions you are unsure about."
    },
    {
      "title": "Read the directions carefully.",
      "content": "Read the directions carefully. Before you start answering questions, take a few seconds to read the directions. This will help you eliminate errors. Sometimes there are multiple parts of an answer or a special task you're asked to do. Read the directions to make sure you don't make any unnecessary mistakes. For example, some answers may have more than one answer you have to provide. If you have essay tests, you might have to choose 3 or 4 questions to answer."
    },
    {
      "title": "Stay positive.",
      "content": "Stay positive. [12] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. Keep a positive attitude while taking the test. Feel confident in yourself. [13] X Research source Don't think negative thoughts, even if you are struggling. If you start to get too anxious, pause for a moment. Relax and tell yourself that you can do this. [14] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. Don't pay attention to your classmates. If they are working faster or finish before you, that doesn't mean anything. Everyone works at their own pace. Fast work doesn't mean they know everything; they could know nothing and just put something down."
    },
    {
      "title": "Do deep breathing to calm your nerves.",
      "content": "Do deep breathing to calm your nerves. Breathe in for 4 counts, then out for 8 counts. Do this for 2-3 cycles or until you feel calm again. Exhaling for twice the amount of time you're inhaling will reset your nervous system and help you feel better. [15] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020."
    },
    {
      "title": "Plan your time.",
      "content": "Plan your time. Look at the entire test. Decide how you will approach the questions. Think about how many minutes you will need for each section. Set a pace for yourself that gives you enough time to complete the questions, but that also ensures you will finish the test. [16] X Expert Source Jake Adams Academic Tutor & Test Prep Specialist Expert Interview. 20 May 2020. Start with the easiest sections. Not only will these be completed faster, but breezing through these can help build your confidence. Answer the questions with the highest point values next. You want to make sure you give yourself enough time to finish those."
    },
    {
      "title": "Eliminate incorrect answers.",
      "content": "Eliminate incorrect answers. For multiple choice questions, eliminate answers that are obviously wrong, and spend some time figuring out which others cannot be the correct answer. [17] X Research source Then look for clues in the answers that make one of the remaining answers incorrect. If the question only needs one right answer, something about one of the choices will be wrong. Don't be thrown by questions that include never, not, least, none, or except. These words can give you important insights into the answer, or help you eliminate wrong answers [18] X Research source . If you're completely stumped and have to guess a 'true or false' answer, questions that have highly opinionated words such as \"always\" and \"never\" are usually false. You may want to formulate your own answer after reading the question but before you look at the choices. This can help prevent the answers from swaying you the wrong way."
    },
    {
      "title": "Plan out essay answers.",
      "content": "Plan out essay answers. Essays require you to demonstrate your knowledge. Read the question carefully and underline key words, especially words like define, compare, or explain. Make an outline of the ideas you want to include in your answer. This way you won't forget anything as soon as you start writing. An outline also gives you a map to follow. [19] X Research source Answer the question directly by mentioning key words or the topic of the question. Give examples along with general information about the topic. Use any terms you have learned in the class. Write legibly. Your teacher can't mark something they can't read. If you have trouble writing neatly, try to improve your handwriting as much as you can before you take the test."
    },
    {
      "title": "Skip questions you don't know.",
      "content": "Skip questions you don't know. Instead of wasting time stressing about questions you don't know how to answer, move ahead on the test. Circle the question and come back to it if you have time. Answer all the questions you know before you spend too much time trying to figure out answers to questions. [20] X Research source Look through the rest of the test for clues that might help you answer questions you don't know. Ask your teacher for clarification if you don't understand what a question is asking."
    },
    {
      "title": "Review your answers.",
      "content": "Review your answers. When you finish your test, go back and review your answers. Reread and spend a few more moments on questions you were unsure about. Double check that you didn't skip any answers or misread questions. [21] X Research source Trust your first instinct. Many times, your first instinct is the correct answer. But make sure you have made a reasoned decision for the answer, not just relied on your gut."
    }
  ]
}