{
  "url": "https://www.wikihow.com/Pronounce-Difficult-Arabic-Letters",
  "title": "How to Pronounce Difficult Arabic Letters",
  "steps": [
    {
      "title": "Before you start on anything, you have to memorize how each and every letter looks.",
      "content": "Before you start on anything, you have to memorize how each and every letter looks. It's important to have good basic information about the letters before you learning to pronounce them. It will be helpful to master the skill of writing Arabic letters, including their various forms at the beginning, middle, and end of words. Arabic belongs to the Semitic language family, and its unique script differs from the Latin alphabet. This challenging yet rewarding journey will expand your understanding of how letters can look and sound. Try pronouncing each letter out loud several times. Take your time, and do this slowly. After getting familiar with the appearance of the letters and their sounds, write down a list of all the ones you find difficult to say. Usually, letters with rough, throaty sounds are most difficult for westerners. For a fun activity, you can explore the beautiful world of Arabic calligraphy, where letters and writing turn into a historical art form."
    },
    {
      "title": "Let's start off with the all of the letters, then single out the difficult ones.",
      "content": "Let's start off with the all of the letters, then single out the difficult ones. أ - alif ب - baa' ت - taa' ث - thaa' (similar to the 'th' in 'theory') ج - jeem ح - haa' خ - khaa' د - dal ذ - thal (similar to the 'th' in 'then') ر - raa' ز - zain س - seen ش - sheen ص - Ssaad (as in s- sword) ض - ddad (as in d- odd) ط - tt- uh ظ - tha-a' ع - 'eain غ - ghain ف - faa' ق - qaaf (this letter sounds like the word \"cough\") ك - kaaf (sounds like \"calf\" in an American accent) ل - llam م - meem ن - noon ه - haa' و - waw ي - yaa'"
    },
    {
      "title": "Okay, so the most difficult ones are really tricky.",
      "content": "Okay, so the most difficult ones are really tricky. You have to practice them correctly or they will stick with the wrong sound in your head. One challenge is that while Arabic letters can be represented using Roman characters, the pronunciation of these Romanized letters may not perfectly match the original Arabic sounds. For example, the Arabic letter \"ع\" (Eain) doesn't have a direct equivalent in English. Try to make your tongue light, your control of air pressure in your mouth precise and your throat and teeth more obedient in order to say them correctly. [1] X Research source"
    },
    {
      "title": "Read the explanation of the letter's sounds, and try to produce the sounds with accuracy.",
      "content": "Read the explanation of the letter's sounds, and try to produce the sounds with accuracy. Take your time! It's okay to taste the letters before saying them. Seeing your mouth's movements in the mirror helps. The difficult letters will be split into two parts [2] X Research source ح - haa' is the sound you make when you clear your throat, only keep your mouth open when you do. Usually when we clear our throats, we start by holding air then letting it out forcefully. With ح , you end the letter with suddenly cutting the air. خ - It's similar to clearing phlegm from your throat. While it may sound unappealing, producing the sound for 'khaa' requires less effort than you might think. Finish it like ح, with a quick release of air. Avoid applying too much pressure; a gentle blockage of air is all that's needed. ص - this one is a bit tricky. Start by saying S normally then pull the middle of your tongue to the base of your mouth, leaving the tip close to your teeth. Now try to make this sound and follow it with a, ending with D. Something like SSaad should be the result. ص is like a magnified version of س ض - also like ص, this is a magnified version of د, made by saying D, only pulling the middle of your tongue down. While د is gentle and easy to make, ض or Daad is more of a heavy and deep sound. After pronouncing the sound, open your mouth to add an 'aa' sound and end with normal D. Arabic is often called the \"Language of the Daad\" because of the unique sound represented by the letter \"ض\" (Ḍaad), that not found in many other languages."
    },
    {
      "title": "Take a break!",
      "content": "Take a break! Try to whisper or say the ones above out loud for some time. Don't cram everything at once. You can practice those while doing anything, like working around the house, studying or gardening."
    },
    {
      "title": "Now for the rest of the letters.",
      "content": "Now for the rest of the letters. [3] X Research source ط - is forceful sound. Put the tip of your tongue between your teeth, and pull the middle section down. Apply air pressure against your teeth and let it out forcefully. To help, try imagining ط like a pressuring T. ظ - This sound requires the tip of your tongue to touch the upper front of your teeth, while the middle part of your tongue is slightly lowered. It ends with a soft 'aah' sound, similar to the English 'th' sound in \"there\", but with a more forceful articulation. ع - is pronounced with a deep, guttural sound originating from the back of the throat, similar to a slightly constricted clearing of the throat while producing a breathy \"ah\" sound. غ - made with literally gargling on air. You probably do this everyday when brushing your teeth and kids do it when they drink to make bubbles in their mouths. End it with 'ain'. ق - while ك is made with pushing your tongue to the roof of your mouth while blocking the air in your throat, this one is made with pulling your tongue down while blocking air. Let the air out from the upper behind of your throat. This sound is made in cartoons when a character gulps down a drink."
    },
    {
      "title": "Don't just say the letters on their own.",
      "content": "Don't just say the letters on their own. Try to find words with those letter in them. See how they turn out in different positions in the words, beginning, middle or end."
    },
    {
      "title": "Listening to the pronunciation of those letters helps a lot.",
      "content": "Listening to the pronunciation of those letters helps a lot. But remember not to trust your inner ear for the accuracy of these sounds. It's better to record your voice while saying these words and comparing them later to actual pronunciation."
    },
    {
      "title": "Be gentle on your throat!",
      "content": "Be gentle on your throat! Repeating those letter alone all the time might leave you with a sore throat since you're not used to it. Take your time and proceed slowly."
    },
    {
      "title": "Lastly, read!",
      "content": "Lastly, read! Learning how to speak by reading gets you used to these letters faster and gives you much less stress than when saying them alone."
    }
  ]
}