{
  "url": "https://www.wikihow.com/Recognize-Bias-in-a-Newspaper-Article",
  "title": "How to Recognize Bias in a Newspaper Article",
  "steps": [
    {
      "title": "Read the whole article carefully.",
      "content": "Read the whole article carefully. Reading every single word in a newspaper article can be super time consuming, but it's worth it when you're trying to find bias in the reporting. Biases can be really subtle and hard to catch, so pay careful attention to the entire article. [1] X Research source Set aside time each day to tackle one article at a time. This will help you practice the kind of skills you need to recognize bias, and you'll go faster each time. Start by giving yourself about a half hour for an article that's a few pages long."
    },
    {
      "title": "Look at the headline.",
      "content": "Look at the headline. Some people only read headlines, so they're designed to communicate a clear point as quickly as possible. This means that using just a few words, most headlines make an argument. Evaluate each word to check whether they describe something positively or negatively. Ask yourself why the headline might not be totally neutral. [2] X Research source For example, the headline \"Hundreds Attend Peaceful Protest\" tells a different story than \"Angry Riot Confronts Police.\""
    },
    {
      "title": "Ask yourself if the article helps or hurts anyone.",
      "content": "Ask yourself if the article helps or hurts anyone. Look at the words used to describe the people, political issues, and events mentioned in the article. If the language makes them sound good or bad, rather than just neutral, the reporter may be trying to influence you to favor one side over another. [3] X Research source After you're finished reading, take a minute to think about how you feel about the issue the article covered. Do you suddenly want to support a particular politician or fall on one side of political debate? If so, you'll need to think about whether the article convinced you with facts or slanted language."
    },
    {
      "title": "Figure out who's reading the article.",
      "content": "Figure out who's reading the article. Think about who typically reads this kind of article. Reporters might want to write stories that their readers will appreciate, which could lead to biased reporting. Try running a Google search to look for descriptions of the typical age, gender, racial background, income, and political leanings for the audiences of several newspapers and media outlets. [4] X Research source Enter something like “demographics of New York Times readers” into the Google search bar. You may find information that's a few years out of date, but your search should still give you a broad idea of who reads the paper. Understanding newspapers' usual demographics can help you think about what various groups of people care about. Younger readers might have strong feelings about education, since they're still students. Older readers might want content about taxes and retirement."
    },
    {
      "title": "Look for exaggerated or colorful language.",
      "content": "Look for exaggerated or colorful language. Consider whether the words the reporter uses in the article are informational or emotional. Watch out any time that a word or description makes you feel a strong emotion. If overly descriptive words are used to represent a particular group of people or side of a debate, this could be an especially big red flag. [5] X Research source For example, an informational description of a politician could look like this: “Senator Smith is originally from Connecticut and is thirty years old.” Check out how this description makes the same content emotional: “Senator Smith comes from a rich town in Connecticut and is just barely out of her twenties.” Look for words that reveal the reporter's double standards. For example, one person might be described as \"passionate and inspired\" while another might be described as \"stubborn and rash,\" even if both people are showing dedication to a particular cause."
    },
    {
      "title": "Identify the reporter's tone to see how they feel about the topic.",
      "content": "Identify the reporter's tone to see how they feel about the topic. Take note of any language that gives you a positive or negative feeling about information. If this emotion is coming from the way the reporter is writing the story, ask yourself why the reporter feels this way. They may be sad or happy about a particular event, or angry at someone. [6] X Research source Focus on how the tone of the article changes the way you read the information rather than associating the intent directly to the reporter. The best way to monitor your own emotions is to think about whether it's the topic that's making you feel something, or the way the article is written. Maybe the article is about a new amusement park opening in your town. This could be great news, and you may just be pumped about it. But if the article is about something you wouldn't normally feel strongly about, and you do, ask yourself why."
    },
    {
      "title": "Check out the images to look for bias.",
      "content": "Check out the images to look for bias. Photographs, cartoons, and other images tell stories just like words. Look for the main subject in the image and think about how this person or thing looks. Take note of any shadows or colors that make the subject appear scary or triumphant. Consider how the picture makes you feel, especially if you're suddenly feeling sympathetic toward a particular group of people or side of a political debate. [7] X Research source"
    },
    {
      "title": "Make a list of the sources in the article.",
      "content": "Make a list of the sources in the article. Determine how the reporter made their point. Look at every person who's quoted, and check which company or organization they represent. Consider whether one type of organization gets more coverage in the article than others. [8] X Research source Maybe the article is about a military conflict in a different country. Did the reporter quote from a balanced list of all the different people involved in the conflict? This list would probably include military officers and leaders, diplomats, politicians, and, most importantly, people from the actual country where the conflict is located. If the article only quotes, say, military personnel, read carefully to try and understand why that is."
    },
    {
      "title": "Examine the statistics and studies cited in the article.",
      "content": "Examine the statistics and studies cited in the article. It's hard to argue with numbers, which is why they're included in so much reporting. Don't let statistics intimidate you, even if you're not a math person. You can still evaluate how the reporter used these numbers. Determine the connection between the stats and the author's main point, and check to see if the stats make sense. [9] X Research source Is the data cited in the article, or only the conclusions of the study? Did the author give you access to the full study? Did the author skim over the statistics without much detail and then make a strongly worded conclusion based on evidence they didn't really give you? If the article is only citing a small amount of information or data, ask yourself why that is. There may be other information in the study that the reporter decided to leave out."
    },
    {
      "title": "Research the newspaper to find out their reputation.",
      "content": "Research the newspaper to find out their reputation. Some newspapers and media outlets have a reputation for giving a particular slant on the news. Take note of the newspaper's typical audience and the issues they usually support. However, don't allow this research to keep you from reading each article critically. If we assume that something's biased, we'll believe that it is before we even read it! [10] X Research source Check out websites such as Wikipedia and Snopes to see if the newspaper is known to have a particular bias. Evaluate the sources you use to check the credibility of the newspaper. Many initial Google searches will pull up websites that insist on a bias."
    },
    {
      "title": "Look at the URL if you're online.",
      "content": "Look at the URL if you're online. Sometimes, the website itself can give you a clue about whether your article is biased or even made up. A weirdly named outlet that you've never heard of may not be reliable. If the URL ends in .co, this could be a sign that you've found an illegitimate outlet posing as a real source of news. [11] X Research source You should also be suspicious of weird language and typing in either the URL or the article. Anything that has lots of typos, all CAPS, or exclamation points needs a super close read. It could easily be biased or made up."
    },
    {
      "title": "Read the “About Us” section for online media sources.",
      "content": "Read the “About Us” section for online media sources. Reputable news outlets will give you this kind of information. It should let you know who supports or owns the website or newspaper. If you can't find this section, it could be a sign that the news outlet is trying to hide a sketchy source of income or information. [12] X Research source"
    },
    {
      "title": "Observe the placement of stories online or in a paper.",
      "content": "Observe the placement of stories online or in a paper. Placement of stories tell you what the newspaper thinks matters and doesn't matter in the world today. In a paper newspaper, the front page contains the big-deal stories, while the ones in the back are considered less important. In a digital newspaper, the articles the editors think are most important will be near the top of the front page or on a sidebar. [13] X Research source What topics are covered in the most important and least important stories, based on placement? What does this coverage tell you about the newspaper's priorities?"
    },
    {
      "title": "Spend some time looking at the ads.",
      "content": "Spend some time looking at the ads. Newspapers and news outlets need money to keep them running. Ads provide that money. Check where the majority of ads are coming from, and determine the category of the organization or company represented in the ads. This will let you know who the newspaper doesn't want to make angry through their reporting. [14] X Research source If one company or industry comes up in lots of ads, this could be a problem. It'll be difficult for a newspaper to provide unbiased coverage if they're trying to keep someone happy and out of the news."
    },
    {
      "title": "Keep a record of the articles you read and biases you find.",
      "content": "Keep a record of the articles you read and biases you find. The more you read, the more you'll discover about individual newspapers and the types of articles they write. Keep a journal of the articles you read, the newspapers they come from, and any biases you find. Be sure to note what the bias was in favor of or against."
    },
    {
      "title": "Read more than one article about the same topic.",
      "content": "Read more than one article about the same topic. Find articles from different newspapers or media outlets covering the same topic. Read critically to look for the different newspapers' biases and compare them to one another. Use these comparisons to find facts that appear in both pieces. You can then make your own judgment about a debate, person, or event. [15] X Research source"
    },
    {
      "title": "Consider what or who the reporter didn't talk about.",
      "content": "Consider what or who the reporter didn't talk about. This is especially important if the reporter is covering a hot-button debate. Both sides should be represented in unbiased articles. If the article is about a particular group of people, and the reporter didn't quote any of those people, this could be a warning sign for bias. [16] X Research source For example, if you're reading a story about an environmental issue, and the article only cites politicians, think about why they didn't quote any scientists. Is it because the topic was only related to politicians, or is the reporter ignoring one side of a debate?"
    },
    {
      "title": "Look for articles written by people from different groups.",
      "content": "Look for articles written by people from different groups. Most articles could be written entirely differently by a person with a different perspective. Look for articles written by people from different age groups, genders, regions of the country, political parties, and racial backgrounds. Think about how multiple perspectives add to your understanding of one, single topic. This may mean that you read one newspaper article and one blog post. It's okay to read different kinds of sources to check on the bias of newspaper articles. Just be sure to read critically and carefully no matter where you find your information. As you read more articles or sources, you'll find that people, events, and debates are always super complicated. This means that there won't be one simple explanation for any issue. Don't get stressed out by this. Just try to learn as much as you can by reading widely. The more you know, the more prepared you'll be to deal with complex problems."
    },
    {
      "title": "Go online or look on social media to see if the article got feedback.",
      "content": "Go online or look on social media to see if the article got feedback. Sometimes, newspapers articles make people angry, frustrated, or (less often) excited. You can run a Google search to check if your article generated this kind of response. You might also want to check out Twitter if your article was published recently. Controversies over biased coverage can quickly go viral. [17] X Trustworthy Source Pew Research Center Nonpartisan thinktank conducting research and providing information on public opinion, demographic trends, and social trends Go to source Looking for this feedback can tell you a lot about who supports the content in the article and who doesn't. While this won't necessarily tell you if the article itself is biased, it's a great way to discover who appreciates the reporting. This will help you figure out who the article helps and who it hurts."
    }
  ]
}