{
  "url": "https://www.wikihow.com/Reboot-Windows-7",
  "title": "How to Restart Your Windows 7 Computer",
  "steps": [
    {
      "title": "Click the Start.",
      "content": "Click the Start . This is in the lower left corner of the screen. You can also hit the Windows key to open this menu without a mouse."
    },
    {
      "title": "Click the > to the right of \"Shut Down.\"",
      "content": "Click the > to the right of \"Shut Down.\" You can also open this menu without a mouse by hitting the → Right Arrow key twice, then ↵ Enter ."
    },
    {
      "title": "Click Restart.",
      "content": "Click Restart . Your computer will reboot normally. [1] X Research source You can hit R while the menu is open to select this option without a mouse. If there are processes running that are preventing Windows for rebooting, click Restart Anyway ."
    },
    {
      "title": "Remove any optical media from your computer.",
      "content": "Remove any optical media from your computer. This includes floppy discs, CDs, DVDs. This may also include external hard drives or thumb drives if your computer is set to boot from them."
    },
    {
      "title": "Power off your computer.",
      "content": "Power off your computer. You can also Restart the computer . Hold the power button down manually for about 10 seconds to start the hard reboot. [2] X Expert Source Scott St Gelais IT Consultant Expert Interview. 27 July 2021."
    },
    {
      "title": "Power on your computer.",
      "content": "Power on your computer. This step can be skipped if you are rebooting."
    },
    {
      "title": "Press and hold F8 while the computer starts.",
      "content": "Press and hold F8 while the computer starts. This will take you to the “Advanced Boot Options” screen."
    },
    {
      "title": "Select a boot option using the arrow keys.",
      "content": "Select a boot option using the arrow keys. You may see some combination of the following options: [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Safe Mode with Networking. Safe mode is a diagnostic mode that disallows all software except necessary drivers and core software (including basic network software in this case) to run the operating system. Safe Mode with Command Prompt. This gives you a command prompt window in safe mode instead of a graphical user interface. This mode is typically for advanced users. Enable Boot Logging. This option creates a file, ntbtlog.txt, that can be used to help troubleshoot issues while booting the computer. This is also designed for advanced users. Enable low-resolution video (640×480): This starts Windows using your video driver and with low resolution and refresh rate settings. This can help you troubleshoot issues with your display settings or graphics hardware. Last Known Good Configuration (advanced). If you are having trouble booting into your OS or keeping the environment stable, this will start Windows with the last registry and driver configuration that booted successfully. Debugging Mode. This starts Windows in a troubleshooting mode with advanced diagnostics and logging intended for IT professionals. Disable automatic restart on system failure. This prevents Windows from automatically restarting if an error causes Windows to fail (for example, a Blue Screen error). You can use this if Windows is stuck in a loop where the OS fails, restarts, then fails again repeatedly. Disable Driver Signature Enforcement. This will Allow drivers containing improper signatures to be installed when using Windows. Only use this if you trust the source of the third party drivers you are using. Start Windows Normally. This will start Windows without any special modifications."
    },
    {
      "title": "Hit ↵ Enter.",
      "content": "Hit ↵ Enter . The computer will boot into Windows 7 with the selected modifications."
    }
  ]
}