{
  "url": "https://www.wikihow.com/Rotate-in-Volleyball",
  "title": "How to Rotate in Volleyball",
  "steps": [
    {
      "title": "Know the six court positions.",
      "content": "Know the six court positions. Each team's side of the volleyball court will be filled with two rows of three players each, making for a total of six spots. Though players rotate clockwise, the positions are labeled counter-clockwise. Here they are: [1] X Research source Position 1: The right back, where the serving player is. Position 2: The right front, just in front of the right back. Position 3: The middle front, to the left of the front right. Position 4: The left front, which is to the left of the middle front. Position 5: The left-back, behind the left front. Position 6: The middle back, behind the middle front."
    },
    {
      "title": "Know your position on the team.",
      "content": "Know your position on the team. Your court position is where you are standing on the court, which changes with every rotation; your position on the team is your set role and does not change. Here are the six positions and what they do: [2] X Research source The setter: The setter's job is to set up the hitters so that they could hit the ball. Ideally, the setter will get possession of the ball second to set it up for the hitters; if he/she can't get to it, then he/she has to yell \"help,\" and have someone else do it. If he/she accidentally gets it first, then he has to yell \"setter out\" so someone else can set it. The outside-hitter : This player hits the ball from the strong corner (front left for right-handed players; front right for left-handed players). The middle-blocker : This is usually a tall, strong person on the team, who is mostly in the middle front and blocks every hit. This player also moves to form a double block with either of the outside hitters. DS : This player plays in the back row and does a lot of rolling and digging so that they keep the ball in play. If they want to come in the game, they have to make a substitution with the refs. The libero : The libero, (a position created in 1998) only plays in the back row but can join the game as often as needed. They also wear a different jersey than the rest of the team. The libero is a good passer, a good digger, and has good ball-handling skills. This player often takes the place of the middle blocker when he or she rotates to the back row. Each position has a court position that is best for it. For example, middle blockers are best when they are playing in the middle front. Setters are best at right front, outside hitters are best at left front, and DS and libero can be anywhere in the back row, although libero is often best at middle back."
    },
    {
      "title": "Know when to rotate.",
      "content": "Know when to rotate. You rotate when you side out. A side-out is when the other team has the serve, but your team wins the point . In volleyball, you rotate clockwise. If your team wins the point when the other team is serving, then the person in the front right moves to the right back, becoming the new server. If your team is serving and you win a point, you do not rotate, but stay in the same position. [3] X Research source After serving from position 1, a player will rotate to position 6 (middle back), then to position 5 (left back), then to position 4 (left front), then to position three (middle front), then to position two (right front), before returning to position 1, the serving position. Just remember that each player only rotates one time after the team gains possession of the serve; the next time each player rotates will be after the other team wins possession of the ball and loses the point."
    },
    {
      "title": "Know when to sub out.",
      "content": "Know when to sub out. Depending on your level of play and position, you may either stay in the game or be subbed out with another player when you reach a certain rotation. [4] X Research source If you are a front row player (setter, outside hitter, or middle blocker), you may substitute with a back row player (DS or libero) when you get to right back, or you might be allowed to serve and then sub out. Back row players will sub with front row players when they reach the left front."
    },
    {
      "title": "Know where to move during your rotations.",
      "content": "Know where to move during your rotations. You can move after the server makes contact with the ball to optimize your position. [5] X Research source For example, if you're a setter who is in the left front, you can move to the right front after the server makes contact so you can be in the best location for your position. This is the same for other positions too. Middle blockers will always try to run to middle front, outside hitters will try to run to left front, and so on. Just remember that you cannot move until the ball is served. Players can move positions, but backcourt players can't move to the net to block or spike and must make all attacking actions behind the attack line. This rule is in play so skilled spikers can't dominate in all six of their court rotations. The setter can sometimes look like he's \"hiding\" behind the other players before a point; this is because he has to be in the correct rotation order before he can move to the net."
    }
  ]
}