{
  "url": "https://www.wikihow.com/Put-Streaks-in-Your-Hair-at-Home",
  "title": "How to Put Streaks in Your Hair at Home",
  "steps": [
    {
      "title": "Get bleaching and streaking supplies.",
      "content": "Get bleaching and streaking supplies. The supplies you get will be partially determined by the natural color of your hair. If you have light hair and are planning to streak it with a darker color, you do not need to bleach your hair first. If you have dark or medium hair and want a light or unnatural color, you'll definitely need to bleach before streaking to make sure the color comes out looking bright and beautiful. You can buy your supplies at a beauty supply shop, like Sally’s Beauty Supply. The supplies you will need are: [1] X Research source Bleach powder, which comes in either packets or tubs. If you're doing just a few streaks, you won't need much. Crème developer, which makes the bleach work. A 20 volume developer is a good starting point. Never get a volume higher than 40, or you'll damage your hair. Red Gold Corrector is added to the bleach powder to increase its effectiveness, so you don't have to bleach twice. You will need this if your hair is on the darker side. \"Purple shampoo,\" which is a special shampoo designed to reduce yellow tones in bleached or lightened hair. A tint brush, a bowl, rubber gloves, and aluminum foil."
    },
    {
      "title": "Pick out a hair color.",
      "content": "Pick out a hair color. First, you will need to decide on a color for your streaks. If it’s your first time, it’s usually better to go with a color that is only slightly lighter or darker than your own hair color. But, the color you desire is ultimately your choice. You may want blonde streaks, or pink or purple streaks. If you're unsure what will look good in your hair, start small by streaking one piece of hair with your favorite color. If you love it, you can always add more. [2] X Research source Some people choose to have one pretty pink or purple streak running down the side. This adds a subtle beauty to your style. For a punk look, add a lot of streaks extending from the crown of your head down to the tips. Choose blue, green, or platinum blonde. If you want to go blonde or up to two shades lighter, you may not need a hair dye. You can get away with using bleach. For vivid colors, pick a color that lives at the same level of however high your hair is bleached. so, if your hair only gets to a red-orange shade, stick with a purple color. If it's more of a yellow-orange, go for green or blue. If it's pale yellow, go for pink or purple."
    },
    {
      "title": "Decide how many streaks you’d like.",
      "content": "Decide how many streaks you’d like. Consider how many streaks you would like to put in your hair. You may want a few streaks for a subtle effect, or a head full of streaks to dramatically change your hair color. It’s important to plan what your desired outcomes is before beginning the dyeing process. [3] X Research source If you aren’t confident about dyeing your hair on your own, it’s better to start with only a few streaks."
    },
    {
      "title": "Start with unprocessed hair.",
      "content": "Start with unprocessed hair. Bleaching and dying hair can really dry it out, so you'll want to give your hair a good head start. In the days leading up to streaking it, don't shampoo it or use hairspray and other hair products. Let your hair's natural oils protect it from the chemicals you'll be applying. When you're ready to streak it, start with hair that is completely dry. [4] X Research source Your package of bleach may specify that you start with clean hair. Check the instructions before use."
    },
    {
      "title": "Pull out the sections of hair you're streaking.",
      "content": "Pull out the sections of hair you're streaking. You need to separate the hair that will be bleached and colored from the rest before you can begin the process. You can do this with a highlighting cap, or by using hair clips and aluminum foil. [5] X Research source Beauty supply stores sell caps used to highlight your hair. You place the cap on your head and use a hook to pull strands of hair through tiny holes. Use this if you want all-over streaks. Hair clips and aluminum foil is the better technique to use if you want just a few large, bold streaks. Pull back the hair you don't intend to streak and clip it away from your head. Now take a long strip of aluminum foil and place it underneath the section of hair you want to streak. Pinch it around the roots to keep it in place."
    },
    {
      "title": "Mix the products.",
      "content": "Mix the products. Put the bleach, developer, and red gold corrector in a bowl. Read the instructions that came with the bleach powder and developer to figure out how much to mix together. The amount you use depends on the size of the bottle you bought, and the brand of product you’re using. [6] X Research source If you're only streaking a few sections of hair, you can half the recipe, since you won't need enough to bleach your entire head . The finished mixture will look bluish white."
    },
    {
      "title": "Apply the bleach.",
      "content": "Apply the bleach. Use the tint brush to apply bleach from the tips to the roots of the sections of hair. Use only enough bleach needed to cover and saturate the hair. Continue applying bleach until the hair is completely covered. [7] X Research source It is important to wear gloves when applying bleach. The chemicals used in bleach are strong and can stain your hands and burn your skin. Do not get bleach anywhere near your eyes. If you're using the highlighting cap method, cover your head with a large piece of plastic wrap while the bleach sets in. If you're using the aluminum foil method, fold the foil over the section of hair to cover it and protect it from drying out."
    },
    {
      "title": "Check your hair after fifteen minutes.",
      "content": "Check your hair after fifteen minutes. Use a towel to wipe off a little bleach. If your hair is blonde, the bleaching process is finished. If it still looks dark, apply more bleach to the area you wiped off, replace the plastic wrap or aluminum foil, and give it more time. Keep checking every 10 to 15 minutes until it is finished. Don't leave the bleach in for more than 45 minutes, even if your hair still looks dark. Your hair can get damaged if you leave the bleach in longer. You may have to wait a day and bleach it again to achieve the desired effect (this is common for people with very dark brown or black hair)."
    },
    {
      "title": "Wash out the bleach.",
      "content": "Wash out the bleach. Carefully rinse the bleach from the strands of hair that you treated. Keep the rest of your hair separate so that it doesn't get bleach on it. Rinse until the water runs clear. [8] X Research source"
    },
    {
      "title": "Use a purple shampoo.",
      "content": "Use a purple shampoo. A purple shampoo will effectively tone your hair and take the yellow out of it. Wash your hair with purple shampoo as soon as you are done rinsing the bleach from your hair. Allow it to sit on your hair for about five minutes. Then, rinse it out thoroughly, and pat your hair dry with a towel. [9] X Research source You can find several brands of purple shampoo at a beauty supply shop. If your hair has a brassy orange tone, use a blue shampoo instead."
    },
    {
      "title": "Prepare your hair and hair dye.",
      "content": "Prepare your hair and hair dye. Re-section your hair according to the strands that have been bleached. The way you prepare the hair dye depends on the product you’re using. Sometimes you will mix the dye with a developer in a bowl. Or, you will squeeze the hair dye directly into a bowl. If you’re worried about getting the dye on other parts of your hair, you can use a streaking cap and pull your hair through the designated holes."
    },
    {
      "title": "Use a brush to apply the hair dye.",
      "content": "Use a brush to apply the hair dye. Completely cover the strands of bleached hair with the dye from root to tip. You shouldn’t see any of the bleached hair color when all of the dye is applied to the strand. Repeat this process until all of the bleached strands have been covered in color. Make sure that you haven’t missed any hair before letting the color set. If you're using the aluminum foil method for separating large pieces of hair, replace the aluminum foil you used to bleach your hair with a fresh piece for dying it. Follow any specific application directions that came on the dye."
    },
    {
      "title": "Let the color set.",
      "content": "Let the color set. The amount of time you wait before washing the color out depends on the product you’re using. In most cases, you'll need to let the dye work for about 30 minutes to make sure the color sets. Look your hair after ten or fifteen minutes to check the progress, though."
    },
    {
      "title": "Rinse out the dye.",
      "content": "Rinse out the dye. If you’re using aluminum foil, remove it from your hair. If not, you can begin rinsing your hair out. Submerge your hair fully under water until all of the dye has been washed out. You can stop rinsing when the water runs clear. [10] X Research source"
    },
    {
      "title": "Condition your hair.",
      "content": "Condition your hair. The dyeing process can leave your hair dry, so make sure to condition your hair when you have rinsed the dye out of it. Any type of color-safe conditioner will work, but it is best to use a deep conditioner made for color-treated hair. Allow the deep conditioner to sit for five to ten minutes. Use the deep conditioner once a week to keep your hair soft. [11] X Research source"
    },
    {
      "title": "Maintain your streaks.",
      "content": "Maintain your streaks. Once your hair is dry, the streaks should be very noticeable. Keep them looking bright by using shampoo designed to keep dyed hair fresh. If you want to keep the streaks for a long time, you'll need to bleach and dye the roots from time to time as your hair grows out. [12] X Research source Most beauty supply stores and supermarkets will have shampoo and conditioner specifically for dyed hair. If you’re not sure what kind to buy, ask for the advice of an employee at the beauty supply shop."
    }
  ]
}