{
  "url": "https://www.wikihow.com/Prevent-Breaststroke-Swimmer%27s-Knee",
  "title": "How to Prevent Breaststroke Swimmer's Knee",
  "steps": [
    {
      "title": "Recognize your kind of kick.",
      "content": "Recognize your kind of kick. The width between the knees when doing the kick varies based on the kind of competitive distance you are specialized in. Usually, sprinters tend to do their kick with their knees closer than mid-distance or IMers. This makes the angle of the knees with the ankles more sharp, which at the end makes sprinters more likely to get knee injuries. The most important thing is to make sure every kick is not out of the boundaries of the knee rotation, especially during the out sweep of the kick. Most injuries happen when swimmers do not pay close attention to their kick technique and end up making the wrong movements while doing the kick."
    },
    {
      "title": "This is the key factor in avoiding knee injuries.",
      "content": "This is the key factor in avoiding knee injuries. Before getting in the water, do some joint movements. It’s always a good idea to start from your ankles up to your neck so you do not miss any part of your body. Dedicate some time to move your knees around. There are two basic movements: Stand up with your feet shoulder-width apart and put your hands on your knees. Bend them forward and return to the initial position. Stand up with your feet shoulder-width apart and put your hands on your knees. Bend them forward, then bring them a little to the outside, almost in a circular way, and then return to the initial position. Repeat the exercise, bringing your knees to the opposite sense of the circular movement. It is also good for your body to do around 10 minutes of aerobic exercise, such as light rowing, jogging, or jumping rope."
    },
    {
      "title": "Do some laps in slow breaststroke.",
      "content": "Do some laps in slow breaststroke. This allows your knees to get used to that movement. In your warm-up, make sure you do some kicking; start slow, but as the warm-up goes on, you can accelerate your kick. A short kicking set during warm-up is also a good idea."
    },
    {
      "title": "Performing drills makes it easier to execute the proper kick.",
      "content": "Performing drills makes it easier to execute the proper kick. This will also help prevent injuries. Some of the most well-known drills are: 2-kicks-1-stroke: Make one complete breaststroke cycle, and during the gliding part, introduce a second kick and start again. [1] 1-kick-2-strokes: Make one complete breaststroke cycle and, taking advantage of the momentum generated from the stroke, make another stroke without the kick and repeat. Kicking on your back: Lie on your back in a streamline position and do a breaststroke kick, trying to keep your knees from coming out of the water too much. Additionally, try to make sure the width between your knees does not exceed the usual width. This drill is especially good for swimmers that make the mistake of bringing their legs toward their chest when they kick. Kicking with your hands and your back: Lying on your belly, start with your body completely flat in the water with your hands by the side of your legs. Execute a breaststroke kick, allowing your body to follow the undulation movement it produces. After the glide, keep the kicks coming."
    },
    {
      "title": "Follow your coach’s advice.",
      "content": "Follow your coach’s advice. As an athlete, you may perceive your swimming differently than the way you look from afar. Outside the water, the coach might be able to correct different aspects of your stroke. Rely on your coach’s perspective and follow their guidance during practice."
    },
    {
      "title": "Stop if you feel pain.",
      "content": "Stop if you feel pain. During long aerobic sets, you may not feel intense pain because your knees are warmed-up. However, if you start feeling any kind of pain, know when to stop. Sometimes pushing through the pain is not the best answer. The breaststroke is a high-impact stroke, and it’s common—even for professional swimmers—to do their long high-aerobic sets in a different stroke, commonly freestyle."
    },
    {
      "title": "Cooling down your muscles plays a huge role in preventing injuries.",
      "content": "Cooling down your muscles plays a huge role in preventing injuries. Doing some cool down stretches is almost as important as warming up. It also helps bring your heart rate down and allows your body’s temperature to go back to normal. Not cooling down after doing a tiring set can bring serious problems to your body, as it needs to remove all the lactic acid that your muscles developed while doing the practice set."
    },
    {
      "title": "Stretch the largest muscles in your body.",
      "content": "Stretch the largest muscles in your body. Stretching your legs after swim practice is one of the best ways to ensure an optimal and full recovery from the exercise done. Make sure you stretch the largest body muscles, such as your quads, gluteus, hamstrings, and calves. There are several ways to stretch but here are some examples: To stretch your quads, stand up with your feet shoulder-width apart next to a wall or another support. Bring one foot back to your gluteus and hold it with your hand. Leave your knees close to each other. For a more general stretch, simply stand with your feet together and incline your back towards the floor. Try to touch your feet with your hands and your knees with your head."
    },
    {
      "title": "Pay attention to the activities you do outside of practice.",
      "content": "Pay attention to the activities you do outside of practice. Pay attention to the way you run and walk, and make sure it is not affecting your knees. Try to always keep your knees slightly bent. Follow a routine that suits your needs, as well. Once you start getting used to protecting your knees daily, it should start feeling like an unconscious act. Use proper shoes. They can be for running, training, or even just for walking; wear shoes that balance your feet and help your knees to stay in the right posture."
    },
    {
      "title": "This decreases the chance of injury.",
      "content": "This decreases the chance of injury. There are plenty of exercises you can do to strengthen your leg muscles. Even though swimmers do most of their workout in the water, they also need to develop certain strength doing gym workouts or dry lands."
    },
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. While doing intense workouts, the muscles need to be at optimal conditions in order to work properly and prevent injuries. Your body requires the right kind of hydration so it does not start cramping up in the middle of your practice. It’s important that you fuel your body after all the nutrients you lose in a high-intensity workout. Many people underestimate the amount of effort involved with swimming, so remember, just because you do not see sweat doesn’t mean it’s not there."
    },
    {
      "title": "Maintain a healthy lifestyle.",
      "content": "Maintain a healthy lifestyle. The risk of a knee injury decreases with people that are constantly active and have healthy eating habits. If you have a healthy weight, there’s less weight that your knees have to handle during your everyday activities. Find the balance in your routine in order to achieve a stable weight and lifestyle."
    }
  ]
}