{
  "url": "https://www.wikihow.com/Remove-Windshield-Streaking",
  "title": "How to Remove Windshield Streaking",
  "steps": [
    {
      "title": "Choose a glass cleaner.",
      "content": "Choose a glass cleaner. If you have a larger budget, consider purchasing an automotive glass cleaner. These cleaners are more expensive but will generally give you better results. Standard glass cleaners such as Windex or a foaming glass cleaner such as ZEP will also work well. Finally, some people create their own cleaners by using a water and vinegar mixture or simply rubbing pure ammonia on their windshield. Ammonia is an excellent glass cleaner. However, it can easily damage the paint, upholstery, and carpet in your car. Be careful of drips when using it as a cleaner. [1] X Research source To make your own water-vinegar cleaner, mix one part hot water with one part vinegar in a spray bottle. Shake well."
    },
    {
      "title": "Wash your windshield.",
      "content": "Wash your windshield. First, mist a thin layer of the cleaner onto the windshield. If you can’t reach your entire windshield at once just clean half of it at a time. Using a new, clean microfiber towel, wipe the windshield clean in a horizontal back and forth motion. Gently lift the windshield wipers out from the car to clean the glass underneath them. [2] X Expert Source Angel Ricardo Auto Technician Expert Interview. 1 October 2019. If you’re using ammonia to clean your windows, pour a small amount of ammonia on the microfiber cloth before wiping the windshield. Remember to wear gloves when handling ammonia. If you don’t have microfiber cloths, newspaper can be used instead."
    },
    {
      "title": "Wash your windshield with a squeegee.",
      "content": "Wash your windshield with a squeegee. If you don’t have microfiber towels consider using a squeegee instead. Mist a thin layer of your cleaner on your windshield. Use the spongy side of the squeegee to scrub the dirt and grease off your windshield. Once the entire window is soapy, turn the squeegee over. Run the rubbery part of the squeegee across the glass in sections, pressing gently to remove all of the soapy liquid. When using a squeegee, you can skip the cleaner and fill a bucket with dish soap and warm water. Dip the squeegee in the bucket and clean the windows. Keep a paper towel on hand to dry the rubber side of the squeegee in between strokes."
    },
    {
      "title": "Dry the windshield.",
      "content": "Dry the windshield. Use a fresh, clean microfiber cloth. If you use a dirty or washed cloth you risk scratching the glass of your windshield. Dry the glass using smooth, circular motions. Press gently into the glass as you wipe to remove any stubborn dirt particles on the glass. Work in small sections but work quickly; if the cleaning fluid dries on its own it can leave fresh streaks. If you don’t have microfiber cloths, consider buffing the windshield dry with newspaper. The newsprint won’t leave lint marks and the ink polishes the windows to a shine. [3] X Research source Don’t let the windshield dry on this own. This is how those pesky streaks are created in the first place."
    },
    {
      "title": "Clean the inside of the windshield.",
      "content": "Clean the inside of the windshield. Move to the inside of the car and repeat the cleaning process on the inside of the car. First, lightly mist the glass with cleaner and gently clean the surface with a fresh microfiber towel. Next, dry the glass with a circular motion and inspect the surface for streaks. Repeat the process if necessary. [4] X Expert Source Angel Ricardo Auto Technician Expert Interview. 1 October 2019. Keep all the doors open to ventilate your workspace, especially if you’re using ammonia. Breathing in chemical fumes can be harmful to your health. Don’t use a squeegee on the inside of your car."
    },
    {
      "title": "Use wiper fluid when driving.",
      "content": "Use wiper fluid when driving. Windshield wipers alone can’t wipe away muddy debris from your windshield. This debris can dangerously limit your vision while you drive. Make sure you read your car manufacturers manual and know how to spray wiper fluid onto your windshield while driving. [5] X Research source Most cars have a lever near the steering wheel that operates the windshield wipers. To spray windshield wiper fluid, simply pull the lever towards you. Check your car periodically to make sure your wiper fluid is at the right level. Never substitute with water."
    },
    {
      "title": "Wash the wiper blades.",
      "content": "Wash the wiper blades. If your windshield is clean but your wiper blades are dirty, you will still get streaks on your windshield. Gently pull your windshield wipers away from their resting position and towards the front of the car. Fill a small bucket with warm water and dish soap. Dip a clean wash cloth in the soapy water and wring it out until it’s damp. Next, use the cloth to clean the windshield wipers with smooth, gentle motions. The windshield wipers should move from their resting position into their “cleaning” position easily. If you feel too much resistance when moving them, stop and refer to your car manual. Don’t get soapy water on your clean windshield or you may undo all of your hard work!"
    },
    {
      "title": "Dry the edge of the wipers.",
      "content": "Dry the edge of the wipers. The rubber ridge on the edge of the wipers is the most important part of the windshield wiper. If this part of the windshield wiper isn’t dry and flexible it won’t connect with the windshield properly. Using a clean microfiber cloth, gently dry the rubber ridge of the wipers with a smooth pulling motion. Next, dampen a small section of a clean microfiber cloth with rubbing alcohol. Wipe the rubbing alcohol along the rubber ridge to speed drying and condition the rubber. [6] X Research source Pinch the edge of the wipers with the cloth when drying them. This will help maintain the sharp edge of the rubber. Wipe in the same direction when using a cloth on windshield wipers. Start from the part closest to the car and move out towards the edge."
    },
    {
      "title": "Replace your windshield wipers yearly.",
      "content": "Replace your windshield wipers yearly. It can be easy to forget to do this, especially if you live in a dry climate. However, even sunlight can damage the delicate rubber ridge on your windshield wiper. A damaged rubber ridge will lead to streaking and limited visibility while you drive. Besides, it’s better to be safe than sorry! If you are handy with cars, you can replace them yourself. However, make sure you use the correct windshield wiper for your car. Most people prefer to change their windshield wipers at the end of winter just before the spring rains start."
    },
    {
      "title": "Use a water-repellant treatment.",
      "content": "Use a water-repellant treatment. There are a variety of water-repellant treatments such as Rain-X that can be used to help keep water and dirt off of your windshield. To apply a water-repellant windshield treatment, spray a fine mist of the fluid onto a clean, dry windshield. If the fluid doesn’t come in a spray bottle, apply a small amount to a clean microfiber cloth. Wipe it onto the windshield in small sections in a circular motion. Let the treatment dry for 5-10 minutes. [7] X Research source Depending on the manufacturer, you may need to reapply the water-repellant treatment up to once a week. If you see a filmy residue on your windshield after the treatment dries, buff the surface with a clean microfiber cloth using circular motions."
    },
    {
      "title": "Use a high quality wiper fluid.",
      "content": "Use a high quality wiper fluid. Wiper fluid is sprayed from a nozzle just below your wipers onto your windshield. This fluid helps remove dirt and debris that you encounter on your windshield while driving. Ask your car mechanic what brand they recommend for your car. Be prepared to pay a little more than you’re used to for wiper fluid. However, it will be worth it in the long run! [8] X Research source Don’t opt out of wiper fluid. It’s dangerous to drive without it. If you get mud on your windshield, your wipers won’t be able to remove it and your visibility will be dangerously limited. If you run out of wiper fluid and don’t know how to refill it , ask your mechanic to do it for you."
    },
    {
      "title": "Maintain your windshield wipers.",
      "content": "Maintain your windshield wipers. Regularly inspect your windshield wipers for issues such as corrosion and tearing. The rubber edge should be firmly attached to the blade and free of cracks or holes that can cause streaking. Gently tug the wiper blade to make sure it’s securely installed into the wiper arm. If you see any issues, talk to your mechanic about replacing your windshield wipers."
    }
  ]
}