{
  "url": "https://www.wikihow.com/Sew-Wrap-Pants",
  "title": "How to Sew Wrap Pants",
  "steps": [
    {
      "title": "Purchase 2 yards (1.8 m) of stretchy or non-stretchy fabric.",
      "content": "Purchase 2 yards (1.8 m) of stretchy or non-stretchy fabric. Stretchy fabric is ideal for making wrap pants because it will conform to your curves and have a nice flowing look. You can also eliminate the need to hem your pants if you use a stretchy fabric, such as jersey, modal, or rayon (also known as viscose). [1] X Research source However, you can also use a non-stretchy fabric if you prefer, such as a lightweight cotton or linen. Stretchy fabric wrap pants will cover your legs entirely because the fabric will stretch to wrap around your curves, but non-stretchy fabrics may result in an open area on the sides of your legs. [2] X Research source"
    },
    {
      "title": "Get a pair of shoelaces or 2 yards (1.8 m) of ribbon.",
      "content": "Get a pair of shoelaces or 2 yards (1.8 m) of ribbon. You will secure the wrap pants by tying them around your waist in the front and the back with shoelaces or ribbon pieces. You will need a pair of shoelaces or enough ribbon to create 4 0.5 yd (0.46 m) pieces. [3] X Research source Choose a strong ribbon that matches the colors in your fabric, such as pink ribbon for a fabric that includes pink in the print."
    },
    {
      "title": "Find a pair of leggings or stretch pants that fit you well.",
      "content": "Find a pair of leggings or stretch pants that fit you well. You do not need a pattern to make wrap pants since they are so easy to create. Use a pair of leggings that fit you well. You can fold them in half and place them over your fabric to shape the crotch and waist. This is the easiest way to get a good fit. [4] X Research source"
    },
    {
      "title": "Fold the fabric in half with the right (print) sides facing each other.",
      "content": "Fold the fabric in half with the right (print) sides facing each other. Lay your fabric out on a large, clean, flat surface, such as a table or the floor. Then, fold the fabric so that the shortest edges match up. Line up all the edges and make sure the fabric is flat on the work surface. [5] X Research source If you are working with a silk or slippery fabric, place paper weights or other heavy objects on the corners of the folded fabric. This will help to keep the fabric in place while you work."
    },
    {
      "title": "Cut through the fold.",
      "content": "Cut through the fold. There should only be 1 fold in the fabric at this point. Cut along the fold to divide the single piece of fabric into 2 equal-sized pieces. [6] X Research source Cut the edges cleanly, especially if you are not hemming them. Do not use dull scissors to cut along the fold."
    },
    {
      "title": "Fold the fabric in half again.",
      "content": "Fold the fabric in half again. Next, fold the 2 pieces of fabric in half. Match up the longest edges of the fabric. Hold the 2 pieces together as you do this. [7] X Research source Folding the fabric this way allows you to create the crotch area of the pants."
    },
    {
      "title": "Line up the crotch of the leggings with the top corner of the folded fabric.",
      "content": "Line up the crotch of the leggings with the top corner of the folded fabric. With the leggings unfolded, turn them so 1 side of the waistband is on the fabric and the crotch matches up with the top edge of the fabric. Line up the bottom of the crotch of the leggings with the top corner of the folded fabric. [8] X Research source"
    },
    {
      "title": "Cut around the edges of the leggings.",
      "content": "Cut around the edges of the leggings. Check to make sure that only the waistband area of the leggings down to the crotch is on your fabric. Cut around the edges of the waistband leaving about 0.5 inches (1.3 cm) of fabric around all of the edges. [9] X Research source Use a sharp pair of scissors and make clean cuts to avoid jagged edges."
    },
    {
      "title": "Unfold the fabric.",
      "content": "Unfold the fabric. After you finish cutting along the outside of the leggings, unfold the fabric and open it up. There should be a U-shaped cut through the 2 layers of fabric. Align the edges of the fabric after you undo the fold in the fabric. Check the raw edges of both layers of fabric to ensure that they are flush with each other. [10] X Research source"
    },
    {
      "title": "Insert pins through both layers of fabric along the edges of the U-shaped area.",
      "content": "Insert pins through both layers of fabric along the edges of the U-shaped area. To hold the 2 pieces of fabric together while you sew, insert pins through the 2 layers of fabric along the U-shape. [11] X Research source Space out the pins by about 2 to 3 inches (5.1 to 7.6 cm). Insert the pins into the fabric going from the outer edges of the fabric to the inner edges. This will make it easier to remove them as you sew. [12] X Research source Make sure that the print sides of your fabric pieces are still facing each other. This will ensure that the raw edges of the seam will be hidden."
    },
    {
      "title": "Sew a straight stitch",
      "content": "Sew a straight stitch 0.5 inches (1.3 cm) from the raw edges. Start sewing at the corner of the U-shape and then move all the way around the curve. Place the 2 layers of fabric under the presser foot of your sewing machine and lower it. Then, press gently on the pedal to start the machine. Hold the fabric taut, but avoid stretching it too much. [13] X Research source Check your sewing machine’s instruction manual if you are not sure how to set it to the straight stitch setting. This is the default setting or setting number 1 on most sewing machines. If desired, you can hand sew the straight stitch. However, keep in mind that this will extend the time it takes to make the wrap pants. Thread a needle with 24 inches (61 cm) strand of thread, tug the end of the thread until it is even with the other end, and tie a knot in the end of the strands. To hand sew the stitches , insert the threaded needle in and out of the 2 layers of fabric along the edge of the U-shape. Make sure to keep the stitches about 0.5 in (1.3 cm) from the raw edges of the fabric. The stitches should be close together—about 0.25 in (0.64 cm) or less—for best results. Try using a running stitch to sew a straight line. Insert the needle into the fabric on 1 side and out about 0.25 in (0.64 cm) from this stitch on the opposite side. Then, repeat the stitch starting from the opposite side of the fabric. Continue all the way across the U-shape."
    },
    {
      "title": "Hem",
      "content": "Hem the flat edges of the fabric if you are using a non-stretchy fabric. Open up the fabric so that the print side is facing down toward your work surface. Then, fold over the edges of the fabric on all sides by 0.5 in (1.3 cm). Insert pins through the folded fabric to hold it in place. Then, sew a straight stitch about 0.25 in (0.64 cm) from the raw edges of the folded fabric to secure the hem. [14] X Research source Some types of non-stretchy fabric will fray if you do not hem them. If you are using a non-stretchy fabric and you want to create a hem around the edges, then make sure that you do it before you attach the ribbon or shoelaces."
    },
    {
      "title": "Cut the shoelaces or ribbon into 4 equal-sized pieces.",
      "content": "Cut the shoelaces or ribbon into 4 equal-sized pieces. These pieces will allow you to secure the wrap pants on your body. Line up the ends of your shoelaces or ribbon and then make a cut in the center to divide them in half. If you are using shoelaces, you can cut both pieces at once. If you are using ribbon, line up the ends of the 2 pieces and make another cut in the middle of these pieces to get 4 equal-sized pieces. Each piece should be about 0.5 yd (0.46 m) long. [15] X Research source Make sure to use a sharp pair of scissors to make these cuts. This will help to ensure that you don’t end up with frayed ends."
    },
    {
      "title": "Pin the shoelaces or ribbon to the 4 outer corners of the fabric.",
      "content": "Pin the shoelaces or ribbon to the 4 outer corners of the fabric. Pin 1 end of each of the shoelaces or ribbon to 1 corner of the fabric outside of the U-shaped area. Place the end of the ribbon or shoelace so that it is about 0.5 in (1.3 cm) inside of the edges of the fabric on both sides. This will help to ensure that the end will be secured when you sew it. [16] X Research source Repeat this for the other 3 pieces of shoelace or ribbon."
    },
    {
      "title": "Sew the shoelaces or ribbon pieces to the fabric.",
      "content": "Sew the shoelaces or ribbon pieces to the fabric. Use a sewing machine or threaded needle to sew back and forth across the shoelace or ribbon end to secure it. You can sew in a diagonal line across the corner where the shoelace or ribbon end is overlapping your fabric, and then sew across the in the opposite direction to create an X stitch. This will hold the shoelace or ribbon securely in place. [17] X Research source Repeat this for the other 3 corners as well. Make sure that you do not sew across the pin or you may damage your machine. Sew a couple of stitches to tack down the ribbon or shoelace, and then pull out the pin before sewing the rest of the way."
    },
    {
      "title": "Try on the pants!",
      "content": "Try on the pants! To put the pants on, grasp 2 of the ribbons or shoelaces that are attached to the same piece of fabric. Then, tie the fabric around your waist like an apron. Make sure that the print side of the fabric is facing out. Then, bring the rest of the fabric between your legs and up over your backside and hips. Use the other 2 pieces of ribbon or shoelace to tie this piece around your waist going from back to front. This will secure the pants in place. [18] X Research source"
    }
  ]
}