{
  "url": "https://www.wikihow.com/Set-Up-Email-in-Outlook",
  "title": "How to Set Up Email in Outlook: Easy Guide + Troubleshooting",
  "steps": [
    {
      "title": "Click the File menu and select + Add account.",
      "content": "Click the File menu and select + Add account . If you're using Outlook Classic, you'll find the \"File\" menu in the upper-left corner of the app. If you don't see a File menu, you're using New Outlook. Jump down to the New Outlook method instead. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Some email providers may require you to enable certain settings before you can add your account to Outlook, including iCloud and Gmail. If you tried setting up one of these types of accounts in Outlook but ran into password problems, jump down to Troubleshooting ."
    },
    {
      "title": "Enter your email address and click Connect.",
      "content": "Enter your email address and click Connect . Outlook will attempt to locate your mail server settings automatically. If you're adding a web-based email account like Gmail, Yahoo Mail, or Outlook.com, you'll be prompted to sign in. Once you sign in, just follow the on-screen instructions to finish Outlook setup. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If Outlook can't automatically add your email account, you'll be taken to the \"Advanced setup\" screen."
    },
    {
      "title": "Select the type of email account you want to add.",
      "content": "Select the type of email account you want to add. If you're adding a Microsoft.com , Outlook.com , or Exchange account, select the appropriate option. If your company or school uses Google Workspace, select Google . If you were given some information to enter by your email provider, such as your outgoing and incoming mail server names and port numbers, you will need to select either IMAP or POP . If you're unsure which to choose, ask your email provider or check out our helpful guide to finding your mail server information . It also explains the differences between POP and IMAP."
    },
    {
      "title": "Enter your mail server information.",
      "content": "Enter your mail server information. If you're using POP or IMAP, enter the server addresses and port numbers provided to you by your email service provider."
    },
    {
      "title": "Click Next and then Done.",
      "content": "Click Next and then Done . In most cases, you will be prompted to enter your username and password for the mail server. Once authenticated, your email will be set up in Outlook."
    },
    {
      "title": "Click the View tab in New Outlook.",
      "content": "Click the View tab in New Outlook. If you're using New Outlook for Windows 10 or Windows 11, you can set up your email here. If you're using New Outlook, you'll see a \"New Outlook\" toggle switch at the upper-right corner of Outlook."
    },
    {
      "title": "Click the View Settings button.",
      "content": "Click the View Settings button. It's at the top-left corner. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click the Accounts tab.",
      "content": "Click the Accounts tab. It's on the left panel."
    },
    {
      "title": "Click Add account.",
      "content": "Click Add account . This option appears under \"Email accounts\" in the right panel."
    },
    {
      "title": "Enter your email address and click Continue.",
      "content": "Enter your email address and click Continue . Outlook will try to obtain your mail server information automatically. If your mail server information was found, you'll be prompted to enter your username and password to sign in. Once authenticated, follow the on-screen instructions to set up your email account in Outlook. If Outlook can't automatically add your email account, you'll be taken to the \"Select your email provider\" screen."
    },
    {
      "title": "Select the type of email account you want to add.",
      "content": "Select the type of email account you want to add. If you're adding a Microsoft.com , Outlook.com , or Exchange account, select the appropriate option. If your company or school uses Google Workspace, select Google . If you were given some information to enter by your email provider, such as your outgoing and incoming mail serve r names and port numbers, you will need to select either IMAP or POP . If you're unsure which to choose, ask your email provider or check out our helpful guide to finding your mail server information . It also explains the differences between POP and IMAP."
    },
    {
      "title": "Enter your mail server information.",
      "content": "Enter your mail server information. If you're using POP or IMAP, enter the server addresses and port numbers provided to you by your email service provider."
    },
    {
      "title": "Click Select provider and follow the on-screen instructions.",
      "content": "Click Select provider and follow the on-screen instructions. If you want to add additional accounts to Outlook, you'll be prompted to do so."
    },
    {
      "title": "I can't add my iCloud account to Outlook.",
      "content": "I can't add my iCloud account to Outlook. If you're getting account errors when adding your iCloud.com email address to Outlook, it's due to iCloud's two-factor authentication requirements. To fix the problem, you'll need to generate an app password for Outlook. Here's how: [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Sign in to the Apple ID account page using your Apple username and password. Select Sign-In and Security . Select App-Specific passwords . [5] X Research source Click Generate an app-specific password . Enter a name for the app-specific password, like Outlook , and click Create . Copy the password and click Done. Return to Outlook and enter the app-specific password. You can now use your iCloud email in Outlook."
    },
    {
      "title": "I can't add my Gmail account to Outlook.",
      "content": "I can't add my Gmail account to Outlook. If you're trying to manually add your Gmail or Google Workspace email account, you may need to enable POP or IMAP access in your Gmail settings. Here's how: Log in to your Gmail account in a web browser. Click the gear icon at the top-right and select See all settings . Click the Forwarding and POP/IMAP tab. If you're using POP, select Enable POP for all mail . If using IMAP, select Enable IMAP . Try again."
    },
    {
      "title": "I don't know my password.",
      "content": "I don't know my password. If you forgot your password, you can usually reset it through your email provider. If you're using Outlook.com, Live.com, or Hotmail.com, you will need to reset your Microsoft account password at accounts.microsoft.com . Just try logging in, then select Forgotten your password? when your password is denied."
    }
  ]
}