{
  "url": "https://www.wikihow.com/Measure-Personal-Growth",
  "title": "How to Measure Personal Growth",
  "steps": [
    {
      "title": "Make a list of your personal values.",
      "content": "Make a list of your personal values . Before you work on measuring your growth or even set goals for yourself, reflect on what’s most important to you. This will help you determine the specific areas in which you’d like to grow. Write down whatever it is you feel is important to you as an individual. [1] X Research source For example, your list might include things like building a family, pursuing your dream career, or helping people in need. To help you identify your values, try looking at a list of core values and thinking about which ones apply to you the most. Write short, simple, clear definitions for those top 5 values and decide what that value really means to you and why it's important. Then, think about how you can consistently cultivate each value. [2] X Expert Source Michael Stern Life Coach Expert Interview. 1 July 2020. You can also think about people you admire and identify which of their qualities are most important to you. For example, maybe you value your mother’s bravery and want to develop that quality in yourself."
    },
    {
      "title": "Determine what you want to change.",
      "content": "Determine what you want to change. Once you’ve figured out what is important to you in life, think about areas where you’d like to see improvement. Take time to honestly reflect on how you are doing and what feels unsatisfactory to you. [3] X Research source For example, if one of your major values is improving the environment, think about what you’ve been doing to make a difference. Do you recycle? Are you involved in any environmentally focused community service programs? What more do you think you could be doing? As you think of things you’d like to change or improve, write them down."
    },
    {
      "title": "Identify anything that’s preventing you from changing.",
      "content": "Identify anything that’s preventing you from changing. After identifying areas where you want to grow and change, try to determine what’s been preventing that growth. Sometimes there are unavoidable circumstances that make it hard for you to work toward your goals, but in other cases there may be changes you can make for yourself in order to make growth easier. [4] X Research source For example, maybe you want to improve your painting skills, but you’ve been too busy. Look at your schedule and consider whether there are other obligations or activities you can drop or put on the back burner for now. Sometimes all you need to do is adjust your thinking. For example, maybe you haven’t worked toward your goal of writing a book because you don’t think you can do it. Ask yourself, “Is this realistic? Is there any reason I can’t write a book?”"
    },
    {
      "title": "Set some SMART goals for yourself.",
      "content": "Set some SMART goals for yourself. When you’ve decided on some areas of personal growth to focus on, it’s time to set a few goals. To keep yourself from getting overwhelmed, stick to setting goals that are Specific, Measurable, Attainable, Relevant, and Time-bound (SMART). Choose 1-2 specific areas of your life that you’d like to improve on at a time. [5] X Research source For example, if you have a major life goal of becoming an archaeologist, you might start by setting a SMART goal of applying to 5 universities that offer strong archaeology programs in the next year. Your goals don’t all have to be huge or dramatic. You can also set small, simple goals, like getting into the habit of walking for 15 minutes a day."
    },
    {
      "title": "Prioritize",
      "content": "Prioritize your goals to help keep yourself on track. When you’re setting goals for personal growth, you can start to feel overwhelmed if you try to tackle too many at once. Take some time to think about which goals are most important to you, so that you can dedicate the most time and energy to those. For example, if moving your career forward is your main priority right now, focus on goals that will help with that, like updating your resume or submitting job applications. Once you’ve met some of those goals, you can focus on goals in other areas, like creativity or fitness. Consider which goals are most urgent, as well. If you struggle with managing your money and that’s preventing you from meeting other goals, like seeing the world or starting your own business, start by working on your financial skills."
    },
    {
      "title": "Break your goals up into manageable steps.",
      "content": "Break your goals up into manageable steps. Even a SMART goal can feel big and unattainable if you try to take it on all at once. Look at each goal you’re trying to achieve and think about how you can break it down into bite-sized pieces. [6] X Research source For example, if you’ve set a goal of being able to run 1 mile (1.6 km) in 10 minutes by the end of the summer, you might start by taking a 30-minute run 2 times a week to build up endurance. Next, you can start gradually increasing your speed with each run. If you have a goal of writing a novel, you could start by setting a mini-goal of completing an outline. Once you’ve done that, set a goal of writing for a certain amount of time (e.g., 1 hour) each day."
    },
    {
      "title": "Keep a journal of your progress.",
      "content": "Keep a journal of your progress. Keeping track of your progress is ultimately the best way to measure your growth. As you work on each goal, write down every step you complete, no matter how small. This will help you visualize the progress you’re making as it happens. [7] X Research source Keep a “to-do” list as well as a “done” list to help keep yourself on track. Use your journal to write about how you’re feeling as you work toward your goals. Record your hopes, fears, and emotions relating to your growth. This can help you work through your frustrations and clarify your feelings about your personal growth journey. You can use a traditional journal or find a journal specially designed to help you track your goals. If you don’t want to journal on paper, download a journaling app, like Day One, Moodnotes, or Daylio."
    },
    {
      "title": "Try an app to keep yourself on track.",
      "content": "Try an app to keep yourself on track. Goal setting and tracking apps can deliver reminders and help you measure your progress. Look for an app that allows you to create a clear schedule for completing your goals. In addition to helping you manage your time, you can also use many of these apps to record any progress you’ve made. Some apps, like Habitify, have a game-like structure with built in rewards and incentives to help you stay on target. Popular goal setting and tracking apps include HabitBull, Time Planner, and Coach.me. [8] X Research source"
    },
    {
      "title": "Reward yourself for your accomplishments.",
      "content": "Reward yourself for your accomplishments. Celebrating your successes will help you recognize your progress as well as giving you an incentive to continue working on your personal growth goals. Congratulate yourself even on making small steps, and reward yourself with something special when you make major strides. [9] X Research source For example, if you’re working on improving your study habits, you could reward yourself for doing 30 minutes of studying by watching a funny video. If you ace a big exam, you could go out to dinner with some friends to celebrate."
    },
    {
      "title": "Be prepared for setbacks.",
      "content": "Be prepared for setbacks. When you are working on growth in any area, setbacks and slip-ups are bound to happen. When they do, don’t be too hard on yourself—remember that this is a normal and unavoidable part of progress. When you do slip up, take a little time to rest and reflect if you need to, then try again. [10] X Research source If you get discouraged, you might find it helpful to review your overall progress. For example, if you’re working on a fitness goal, look over your health journal to see how far you’ve come since you started."
    },
    {
      "title": "Review your list of goals and values periodically.",
      "content": "Review your list of goals and values periodically. As you’re working on personal growth, take time occasionally to look at your goals and see if they still align with your personal values. You may find that with time, your needs and priorities change. If you’re not happy with the current goals you’re working toward, consider revising them. [11] X Research source Think of all the important categories in your life and what is working well. Keep building on what is already working and get clear about how you can continue taking action on the things you want to change. [12] X Expert Source Michael Stern Life Coach Expert Interview. 1 July 2020. For example, maybe you started with a goal of starting a family, but now you feel more focused on building your career. Remind yourself that it’s okay to change your mind and adjust your priorities. If you’re unhappy with the direction you’ve taken, it’s all right to try something new."
    },
    {
      "title": "Check the progress you’ve made on specific goals.",
      "content": "Check the progress you’ve made on specific goals. As you work toward your individual goals, periodically review how much you’ve accomplished. Think about whether you’re satisfied with how far you’ve come, and assess whether you’re where you wanted or expected to be at this point in the process. [13] X Research source If you’re not satisfied with where you are with a particular goal, ask yourself why. Is there something you could be doing differently? Do you need to adjust your goal to make it more specific or realistic? Don’t just focus on your most recent progress or setbacks. Try to look at the big picture when evaluating your work on a goal."
    },
    {
      "title": "Use metrics to measure your growth if you can.",
      "content": "Use metrics to measure your growth if you can. Not all types of personal growth can be measured in numbers. However, if you are able to keep statistics on your progress, this is a great way to evaluate how you’re doing. Choose 1 or 2 clear and simple metrics that can help you easily visualize your growth over time. [14] X Research source For example, if you’re working on being more physically active, use a pedometer every day. Write down how many steps you take each day and make a graph or chart showing how your activity levels change over time. If you’re trying to become more financially stable, you can track your growth by keeping a record of your income versus expenses over time."
    },
    {
      "title": "Make a list of areas where you still need to improve.",
      "content": "Make a list of areas where you still need to improve. After you’ve been working on your personal growth for a while, re-evaluate the areas where you still see the need for change or growth. Keep in mind that some of these may have changed since you first started on your growth journey. If necessary, set some new goals for yourself or adjust your approach to your current goals. For example, maybe you’ve made major strides toward becoming financially independent, but you feel like you’re still not taking great care of your health. This might mean it’s a good time to set some new self-care goals."
    },
    {
      "title": "Get an outside perspective if possible.",
      "content": "Get an outside perspective if possible. Some kinds of personal growth are easier than others to measure objectively. If you have a hard time identifying your own strengths, weaknesses, and any progress you’ve made, talk to a trusted friend or loved one. They may be able to provide insights into your growth process that you’re unable to see for yourself. If you can, get someone you trust involved in your personal growth journey early on. Let them know what you are trying to accomplish and ask if they can support you and help hold you accountable. Offer to do the same for them. [15] X Research source"
    }
  ]
}