{
  "url": "https://www.wikihow.com/Paint-over-Varnish",
  "title": "How to Paint over Varnish",
  "steps": [
    {
      "title": "Wipe down the area you want to paint with a household cleaner.",
      "content": "Wipe down the area you want to paint with a household cleaner. Spray any basic household cleaner over top of your surface, and wipe it in circular motions using a clean rag. If there is any stubborn dirt or residue, spray a bit of cleaner over the spot, and use a scouring pad to scrub it away. [1] X Research source Cleaning the surface gets rid of anything that may stop the paint from sticking. To ensure it’s safe to use your particular cleaner on your surface, read over the instructions."
    },
    {
      "title": "Fill in any cracks or imperfections with a wood putty and a scraper.",
      "content": "Fill in any cracks or imperfections with a wood putty and a scraper. Wood putty is a creamy paste that easily covers any uneven spots in wooden surfaces. To use it, scoop up a quarter-size amount with a putty knife, and spread it with consistent pressure over the crack or divot. Then, use a scraper that’s larger than the imperfection to spread the putty evenly across the surface. Do this for any and all imperfection you see. [2] X Research source Evening out your surface with wood putty ensures the paint applies evenly and smoothly."
    },
    {
      "title": "Wait about 30-90 minutes for the putty to dry completely.",
      "content": "Wait about 30-90 minutes for the putty to dry completely. Read the instructions on your particular type of putty to determine drying time. You can touch the surface of the putty to determine whether or not it is dry. If you sand the wooden surface before the putty is completely dry, your surface may be uneven."
    },
    {
      "title": "Sand the area thoroughly with fine-grit sandpaper to even the surface.",
      "content": "Sand the area thoroughly with fine-grit sandpaper to even the surface. Fine-grit sandpaper ranges from 120- to 220-grit. [3] X Research source Use a sander for an effortless sanding option, or sand the surface by hand if there are intricate spots or details. Continue sanding in small, circular motions until the surface of your table is smooth and level. Doing this etches the surface, making it easier for the paint to stick. [4] X Research source Cover your mouth and nose with a facemask to avoid breathing in the dust and debris as you do this. For an extra-smooth finish, sand the surface with medium-grit (60- to 80-grit) sandpaper after you finish with the fine-grit sandpaper. This is helpful if your wooden surface is very damaged or uneven."
    },
    {
      "title": "Wipe down the surface completely to remove any dust.",
      "content": "Wipe down the surface completely to remove any dust. Once you finish sanding your surface, wet a clean rag under your faucet, and run it over your surface to wipe away any dust or debris. This way, none of the particles get trapped under the paint. If there is dust trapped under the paint, your item may look uneven. [5] X Research source"
    },
    {
      "title": "Use a paint roller if covering large, flat areas.",
      "content": "Use a paint roller if covering large, flat areas. When applying paint to wooden surfaces and items, the easiest method is using a small or medium-sized paint roller. This works well because you can apply the paint quickly and thoroughly without overworking the paint. [6] X Research source To use the paint roller, dip the roller into the paint and move your hand back and forth to saturate the roller."
    },
    {
      "title": "Apply the primer and paint with a medium-sized brush to cover small or intricate surfaces.",
      "content": "Apply the primer and paint with a medium-sized brush to cover small or intricate surfaces. If you are painting over a dresser with fine corners or the edge of a table, for instance, it may be easier to apply the paint with a smaller brush. Use a 1–2 in (2.5–5.1 cm) brush instead of or in addition to a paint roller. [7] X Research source"
    },
    {
      "title": "Apply a coat of water-based primer so your paint sticks thoroughly.",
      "content": "Apply a coat of water-based primer so your paint sticks thoroughly. Stir up a white, water-based primer with a paint stick, and pour some into a paint tray. Dip your roller or brush into the primer and apply a solid, even coat of paint in wide strokes. Ensure your surface is completely covered. This helps the top coat of paint stick to your surface or item, and it also seals the undersurface. [8] X Research source"
    },
    {
      "title": "Wait about 30-60 minutes for the primer to dry.",
      "content": "Wait about 30-60 minutes for the primer to dry. Before you add more paint to the surface, ensure the primer is completely dry. Drying time may vary based on your particular type or brand of primer. Touch the surface of the object with your fingertip to make sure it isn't tacky before moving on. [9] X Research source Apply a second coat of primer after the first dries if you are covering very dark stain or varnish. [10] X Research source"
    },
    {
      "title": "Cover the surface with an even coat of water-based paint.",
      "content": "Cover the surface with an even coat of water-based paint. Once the primer is dry, you’re ready to paint the wooden surface. Use water-based paint for a quick-drying, slightly shiny option. Pour some paint into a paint tray, and dip in a fresh roller or clean paintbrush. Apply the paint to your item in wide, solid strokes. Cover the entirety of the surface, and double-check to make sure you don’t miss a spot. [11] X Research source Oil-based paints are not recommended when painting over varnish. The paint may not absorb into the wood properly. [12] X Research source"
    },
    {
      "title": "Let each coat of paint dry for around 30-60 minutes.",
      "content": "Let each coat of paint dry for around 30-60 minutes. On average, it takes about 1 hour for a coat of water-based paint to dry. It may dry faster, based on your surface, application, and paint type. [13] X Research source If you don’t wait for the paint to dry, it may dry unevenly and look odd."
    },
    {
      "title": "Apply another 1-2 coats to cover the surface based on the desired look.",
      "content": "Apply another 1-2 coats to cover the surface based on the desired look. Adding more coats of paint ensures the color is evenly applied and none of the stain or primer shows through. Wait for each coat to dry for best results. [14] X Research source If you like the way your wooden surface looks after 1 coat of paint, you don’t have to apply additional layers."
    },
    {
      "title": "Add a coat of water-based varnish for a shiny, durable finish.",
      "content": "Add a coat of water-based varnish for a shiny, durable finish. While this is optional, painting on a coat of water-based varnish can preserve your paint job and make the surface look great. Ensure the paint is completely dry, then apply a solid, even coat of varnish using a roller or paintbrush. [15] X Research source The varnish will dry in about 1-2 hours, and you can use the wooden object or surface."
    }
  ]
}