{
  "url": "https://www.wikihow.com/Make-the-Day-Go-by-Faster",
  "title": "21+ Tips to Make Your Day Go Quicker",
  "steps": [
    {
      "title": "Sleep in.",
      "content": "Sleep in. Everyone loves to sleep in in the mornings from time to time. If for whatever reason you're trying to make a day disappear faster, you can shave off some time from it by hitting the snooze button and sleeping in a bit. Sleeping is by far the most effective way of making time speed up. If you're already in bed and want the morning to disappear, sometimes the best thing to do is nothing at all. [1] X Research source"
    },
    {
      "title": "Have a long shower.",
      "content": "Have a long shower. A shower is one of the most physically pleasant stages of your day. Most people try to get in and out of the shower in record time, but if you have some time to kill, taking things more slowly can be great. Let the water rush over you; appreciate the warmth and temporary peace.You can enjoy the shower and it will make time go by faster."
    },
    {
      "title": "Read the morning paper.",
      "content": "Read the morning paper. Sitting down with a cup of coffee and enjoying yourself at the kitchen table sounds sort of like a cliche, at a point where everyone seems to rush from place to place, but slowing down to enjoy yourself strangely makes time feel that much faster."
    },
    {
      "title": "Leave for work or school early.",
      "content": "Leave for work or school early. There is probably a regular time you like to leave to go to work, school, or wherever else you typically need to be. If this is the case, consider leaving ten or fifteen minutes earlier than usual. Your brain tends to chunk memories into chapters, and leaving early will streamline that particular stage of your day. Unless you're leaving early, you may actually enjoy the extra time you have to prepare at the start of your day. [2] X Research source"
    },
    {
      "title": "Catch up on work you've been putting off.",
      "content": "Catch up on work you've been putting off. Although the amount of work will depend on where you work as well as your position, there are probably a ton of things you could be catching up on that will help you forget about the time. Do something you've been putting off, whether it's an unfinished project or emails you need to respond to. Your goals are already laid out for you, and you'll feel less stressed after you attend to them. [3] X Research source Being busy is your greatest potential ally when it comes to speeding up time. With that in mind, you should be doing everything you can to immerse yourself in the tasks at hand. Work may not be fun per se, but keeping yourself focused will make the day go by faster."
    },
    {
      "title": "Start a new project.",
      "content": "Start a new project. New projects are always on the go, and the slowest periods of work are perfect to latch onto something new. New projects can actually be a lot of fun at first to organize. Look around yourself at work; there's got to be something that could be done to improve your work environment. Teaming up with someone can add a pleasant social aspect to the experience, if you're extroverted and enjoy interacting with co-workers. If you can't start something on your own accord, ask your superior for something new to do. Being kept busy will make the hours fly past, and you'll also be thought of as a hard worker who shows initiative without being asked."
    },
    {
      "title": "Listen to music.",
      "content": "Listen to music. Listening to music is a perfect way to benefit just about any work situation. Listening to music will keep you at least slightly entertained while you work, saving you from total boredom while you work. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Take frequent breaks.",
      "content": "Take frequent breaks. If work is painfully slow and you're having a really hard time making the time pass, going for frequent breaks will give you ample time to relax and let your perception of time regulate itself. Go have a coffee. Go to the bathroom and relieve yourself. While these activities are unproductive and relying on them too heavily will have the opposite effect you're looking for. [5] X Research source Frequent breaks make a distraction from work, but when it comes to passing time, the biggest benefit will be the relaxation it brings you. Of course, this won't have such a great effect if you're worried about falling behind in work."
    },
    {
      "title": "Check social media.",
      "content": "Check social media. People willingly lose hours of their life checking up on the lives of others, and most of the time, they're not even trying to burn time. Social media is a great tool to speed up time while you're at work. You don't want to make an overly frequent habit of it however, as it may compromise your work situation. As a rule, relying too heavily on distractions at work can make the day feel slower. Ultimately, the best way to get through work as seemingly fast as possible is to immerse yourself in tasks."
    },
    {
      "title": "Have a nap.",
      "content": "Have a nap. Naps are good ways to kill some time if you're bored and could use the shuteye. If you really have nothing better to do, sleep will give your body some precious time to heal itself and patch up. Going to sleep in the middle of the day may be harder than at night or if you're already in bed in the morning, but it is the fastest way you can go about speeding up time if your body will allow you. Not to mention, when you wake up, you may feel more motivated to be productive and let the day come to you as it will."
    },
    {
      "title": "Read a good book.",
      "content": "Read a good book. Getting lost in leisurely activities is a brilliant way to speed up time, as we're never really considering how long we've been doing something when we're having a lot of fun. Reading one of your favourite books will take your mind off the passage of time, possibly even to the point where you'll wish there had been more hours in the day to fit in more reading. [6] X Research source The choice of book is very important in this case. A boring or poorly written book will actually have the opposite effect you're looking for."
    },
    {
      "title": "Binge watch a show.",
      "content": "Binge watch a show. So-called 'binge watching' takes up an exorbitant amount of time, and shows like Game of Thrones or Breaking Bad are all too eager to eat up whatever time you'll allot to them. If you have a spare day you want to see over quickly, put on a show and let yourself relax. If it's a show you really like, you'll probably lose track of how much time has really gone by."
    },
    {
      "title": "Write a new wikiHow article",
      "content": "Write a new wikiHow article . If you've got expertise in something, you may be a candidate to write a wikiHow article! Writing a step-by-step guide on a subject you're fascinated by can be a lot of fun, and like any writing project, you'll find the time slips away like nothing once you get into the thick of planning and realizing your article. [7] X Research source If you're not the writing type, you could find a how-to article on any random subject that interests you and learn a new skill. Learning is a great way to pass time, as your mind will become too occupied to worry about what time it is."
    },
    {
      "title": "Watch a movie.",
      "content": "Watch a movie. There's nothing like curling up to watch a movie at the end of an overly long day. Unless a movie is dreadfully boring or their bladders are tempting them elsewhere, people aren't usually thinking of the time while they're watching a movie. Instead, they're immersed in what's on the screen. Watching one of your favourite movies during or after dinner can be an incredibly rewarding experience. Curling up somewhere comfortable like a bed or sofa is a must in this case. If your body's relaxed, you'll have an easier time letting the time slip you by."
    },
    {
      "title": "Make a new recipe for dinner.",
      "content": "Make a new recipe for dinner. When you're learning something new, time seems to speed up. This is because the mind is too occupied with the fresh tasks to be as concerned with the passage of time. Your stomach will thank you for the new experience, and if you like the recipe enough, you can use it again on future occasions. On the other hand, some studies have actually found that time speeds up when you're doing things that you're already very familiar with. This would include recipes. The bottom line is that you want to be engaging with something . [8] X Research source"
    },
    {
      "title": "Go to bed early.",
      "content": "Go to bed early. Sleep is the best way to accelerate time. No one is keeping track of the passage of time when they're dozing away. Getting a head start on your sleep will give you a big boost for the coming day, which may be a good thing if your current day hasn't been great. [9] X Research source Going to bed 2-3 hours earlier than normal will help you wake up early in the morning and feel productive. It also rests your mind and calms your body down. So, not only is it a good way to pass the time, it's also a good way to rest your body, which is a win-win. Read before bed. If you aren't feeling the whole 'early' idea, read a book in your pajamas, in your bed, with your teeth brushed, all ready to sleep. You might doze off while you're reading or just get tired and want to sleep. Stop whenever you need to and sleep."
    },
    {
      "title": "Consider why you want time to speed up.",
      "content": "Consider why you want time to speed up. People who are looking to make their days go by faster typically fall into one of two categories. The first group wants time to go by in anticipation of some upcoming event. The second are merely bored and cannot decide on how to effectively use their time. If you're trying to speed up the day due to a legitimate stressor, it is understandable and possibly worth doing. If you're bored, you're probably wanting time to speed up only because you're not engaged by anything at the moment. If you end up finding something that interests you (possibly even from the suggestions in this article!) you'll probably stop caring about wanting the day to speed up."
    },
    {
      "title": "Stick to a routine.",
      "content": "Stick to a routine. Psychologists who offer guidance on how to slow down time will typically suggest you go outside your comfort zone and try new things. In contrast, if you're trying to do something you're very familiar with will have the opposite effect. Routine is your friend. Your mind will speed up time and run on autopilot if you're regaling yourself with the familiar."
    },
    {
      "title": "Stay busy.",
      "content": "Stay busy. Speeding up your perception of time can only be approached indirectly. It ultimately doesn't matter whether you're doing something new or familiar, or even who you're doing it with; the passage of time ultimately depends on how busy you are. If you are occupied with something, no matter how trivial it may seem, you won't be thinking of the time. [10] X Research source"
    },
    {
      "title": "Relax.",
      "content": "Relax. [11] X Research source Studies have shown consistently that the part of the brain in charge of recognizing the passage of time becomes agitated in times of stress. To combat this, just make sure you're relaxed and feeling relatively decent. This will make it easier to focus on activities as well. This includes seeing to things like solving headaches or migraines. A migraine can make even an enjoyable experience feel like a test of endurance."
    },
    {
      "title": "Keep yourself from looking at the clock.",
      "content": "Keep yourself from looking at the clock. Ultimately, the way you can speed up the impression of time in your head is to ignore the passage of time. Looking at a clock will remind you exactly how much time has passed, making you more aware of it generally. If you are dead set on speeding up your day as much as possible, you should make a point of avoiding any clocks. Don't even think about how much time has passed."
    }
  ]
}