{
  "url": "https://www.wikihow.com/Not-Pick-a-Scab",
  "title": "How to Not Pick a Scab",
  "steps": [
    {
      "title": "Cover it.",
      "content": "Cover it. Bandage it well. Let the skin heal naturally. Pulling off a scab can lead to scarring, infection and later problems with the wound healing. If you keep it covered, chances are you won’t have the temptation to try and pull off the scab. [1] X Research source"
    },
    {
      "title": "Distract yourself.",
      "content": "Distract yourself. Keep your hands busy so they aren’t picking at your scab. If you’re doing something else, it’s harder to pick your scab, and you might just forget it’s there if you do a good job distracting yourself. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Cook Knit Clean something Ride a bike Go rock climbing Do yoga Read Listen to music"
    },
    {
      "title": "Remind yourself not to pick at it.",
      "content": "Remind yourself not to pick at it. Put something on your hand to remind yourself — a stamp, a bracelet, a weird ring. Paint the nails on the hand you would use to pick the scab. Hopefully you will remember when you see your nails that you shouldn’t be near the scab. Even better, paint your nails black or green — something that really stands out — and don’t paint the fingernails on your other hand. [3] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Making sure that you change the dressing daily may also help to remind you not to pick at the scab."
    },
    {
      "title": "Reward yourself for not picking your scab.",
      "content": "Reward yourself for not picking your scab. Make a deal with yourself — if I go a day without picking my scab, I get X . Or if that’s too much time, make a deal where you reward yourself after half a day."
    },
    {
      "title": "Make sure you don’t have skin picking disease.",
      "content": "Make sure you don’t have skin picking disease. People who suffer from it compulsively pick at their skin and can’t help themselves. If you think it might apply to you, please consult a medical professional. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Wash the wound with soap and water.",
      "content": "Wash the wound with soap and water. It’s important to properly bandage it so that you can’t get at it to pick at it. Cuts and scrapes are common, and most of these will create a scab during the healing process. Try using glycerin soap rather than an antibacterial soap on your wound. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Glycerin soap is better for hydrating and moisturizing your skin. Be gentle when washing the scab -- you don’t want to tear it. Pat the scab dry. [6] X Research source"
    },
    {
      "title": "Apply an antibiotic.",
      "content": "Apply an antibiotic. Choose an antibiotic cream or ointment, available at any pharmacy. Keeping the scab covered in cream or ointment will speed up the healing and kill any germs that might remain in the wound. It might sting, but it’s going to help the wound heal better than it would without antibiotics. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Cover your wound as it’s scabbing.",
      "content": "Cover your wound as it’s scabbing. Even though many of us have learned that you shouldn’t cover a wound, new research shows that it’s actually better to cover it. It will probably take at least four to five days for the scab to fully form and the wound to heal. Keep it covered for that period. [8] X Research source"
    },
    {
      "title": "Know why you shouldn’t remove your scab.",
      "content": "Know why you shouldn’t remove your scab. When you scrape or break your skin, special blood cells called platelets begin to stick together and form a clot where you hurt yourself. These clots function like a protective bandage that keep the wound from continuing to bleed and to shield your body from the outside germs. Scabs serve an important purpose, and you need to let your body heal itself by forming a scab. [9] X Research source"
    },
    {
      "title": "Change the dressing on your scab daily.",
      "content": "Change the dressing on your scab daily. You will need to change the bandage any time it gets wet (which might be more than once a day). If it doesn’t get wet, choose a time daily to switch the bandage. Wash the scab gently and reapply the dressing. [10] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source"
    },
    {
      "title": "Inspect your scab for signs of infection daily.",
      "content": "Inspect your scab for signs of infection daily. Is the scab changing color, getting puffy or oozing at all? Is the skin around the scab tender, red, or warm to the touch? These are signs of an infection that needs to be dealt with by a medical professional. [11] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Wait some time.",
      "content": "Wait some time. Eventually, a scab falls off and reveals new skin underneath. Hopefully it will fall off by itself without you picking at it. This usually happens by itself after a week or two. [12] X Research source If you are still having trouble getting your wound to heal, it is a good idea to check with your medical professional. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}