{
  "url": "https://www.wikihow.com/Remove-Stains-from-Paper",
  "title": "How to Effectively Clean and Get Stains Out of Paper",
  "steps": [
    {
      "title": "Soak up the mess quickly if the stain is new.",
      "content": "Soak up the mess quickly if the stain is new. Stains left alone for a long time begin to \"set,\" becoming harder to remove. [1] X Research source If something has just spilled on a book or piece of paper, use a cloth or paper towel to soak up the mess so the stain doesn’t seep deeper into the page."
    },
    {
      "title": "Assess the damage caused by the stain.",
      "content": "Assess the damage caused by the stain. Stain removal is typically reserved for relatively small areas of discoloration. [2] X Research source You can clean a splash of tea, but there might be no way to salvage a paperback book soaked by a whole pot. If the paper is in a book, flip through the rest of the pages to determine what else has been stained. If a large stain has dried on a valuable or irreplaceable item, it’s still possible to clean it. To avoid further damage, however, it may be best to consult a professional archivist for help."
    },
    {
      "title": "Determine what kind of stain you have if it’s dried.",
      "content": "Determine what kind of stain you have if it’s dried. Before you do anything, identify the type of substance on the paper—this determines your method of cleanup. If you’re not sure what type of stain it is, gently rub a document cleaning pad or vulcanized rubber dirt eraser on the stain. [3] X Research source If the stain remains, follow the steps for oil-based stains. Water-based stains: This group is probably the most likely and includes beverages like coffee, tea, and soda. These liquids can act as a dye, leaving a light-colored stain behind. Oil or grease stains: If the spot is small and slightly translucent, it may be an oil stain from grease or cooking oil. [4] X Research source Blood stains: If the spot is thick and brown or slightly red, it may be a blood stain. [5] X Research source While blood is technically water-based, special considerations must be made to prevent a permanent yellow stain. [6] X Research source You can potentially set an oil stain more if you apply water first. [7] X Research source If you’re not sure if the stain is oil-based or not, follow the steps for oil-based stains first."
    },
    {
      "title": "Mop up as much of the staining liquid as you can with a damp cloth.",
      "content": "Mop up as much of the staining liquid as you can with a damp cloth. To remove most of a stain, cleaning expert Nat Ismaeil says to “get a clean cloth, wet it [slightly] with lukewarm water, and blot the stain.” If the spot transfers to the cloth, “fold the towels, use the clean side and start again by pressing and blotting on the stain.” Dabbing will minimize the size of the stain by not spreading the liquid around. You can also use a dry or slightly damp folded paper towel to mop up the stain."
    },
    {
      "title": "Dry a waterproof surface and place the page onto it.",
      "content": "Dry a waterproof surface and place the page onto it. Be absolutely sure your work area is clean or you will have a second stain to remove! Hold the paper down at two or more corners with clean, waterproof objects. This step minimizes the possibility of wrinkling the page."
    },
    {
      "title": "Moisten a clean cloth or paper towel and carefully dab the stain.",
      "content": "Moisten a clean cloth or paper towel and carefully dab the stain. Repeat this with fresh paper towels until you stop seeing color come off on the towel. [8] X Research source With water-based stains that haven’t been left to dry, most pigment will be removed using just this method. If your stain persists, move on to the next step."
    },
    {
      "title": "Dilute one part white distilled vinegar with one part water.",
      "content": "Dilute one part white distilled vinegar with one part water. In a bowl, mix 1 ⁄ 2 c (120 mL) of white vinegar with 1 ⁄ 2 c (120 mL) of water. Most other types of vinegar can stain paper, so be sure the vinegar you use is completely clear. [9] X Research source White vinegar can remove other pigmented stains like ink, grass, or mustard. [10] X Research source It’s also a natural mold and mildew cleaner. [11] X Research source Complete this step away from the paper to avoid spills and further damage."
    },
    {
      "title": "Moisten a cotton ball with the solution and dab a word on the page.",
      "content": "Moisten a cotton ball with the solution and dab a word on the page. Check to see if any ink has come off onto the cotton ball. Some printing methods produce ink that will not run, but others will. In case it does, be sure to select the smallest, least conspicuous part of the paper to test. If ink has come off of the document, further attempts at removing the stain may ruin your paper. However, you may be able to dab the solution around the words with a cotton swab. If the cotton ball is clear, proceed to the next step."
    },
    {
      "title": "Dab the cotton ball on the stain until the area is damp.",
      "content": "Dab the cotton ball on the stain until the area is damp. Any remaining pigment will be dissolved by the vinegar and lifted from the page. If the stain is large or dark, you may have to repeat this step with a fresh soaked cotton ball as the first becomes dirty. Using fresh cotton balls ensures you don't inadvertently spread the stain across the page."
    },
    {
      "title": "Dab the area where the stain once was with a dry paper towel.",
      "content": "Dab the area where the stain once was with a dry paper towel. Allow the paper to air dry. If the item you just cleaned was the page of a book, leave the book open to that page. [12] X Research source Use weights to hold down paper towels on the pages on either side of the freshly cleaned page. To dry water on multiple pages inside of a book, place it near an open window out of direct sunlight. Turn on a fan about 5 to 10 ft (1.5 to 3.0 m) away and flip the pages regularly. When the pages inside of a book are dry, place several other heavy books on top so the pages flatten again."
    },
    {
      "title": "Soak up any excess oil with a paper towel.",
      "content": "Soak up any excess oil with a paper towel. As with water-based stains, do this as quickly as possible. Oil stains generally don't set in the same way that water-based stains do, but they can still spread quickly. Wash your hands before moving to the next step to make sure they are free of oil."
    },
    {
      "title": "Fold a paper towel that’s wider than the stain in half.",
      "content": "Fold a paper towel that’s wider than the stain in half. Place the towel on a clean, hard surface. Pick a surface that won't be damaged by the oil just in case it soaks through the paper. The best places for this are the kitchen counter, a glass table, or a metal workbench. Try to avoid unfinished wood or wood floors treated with water-based polyurethane. If the stain is on the pages of a book, place a folded paper towel between each greasy page. [13] X Research source"
    },
    {
      "title": "Place the paper on top of the paper towel.",
      "content": "Place the paper on top of the paper towel. Make sure that the stain is over the paper towel. [14] X Research source It is best to center the stain so that there is roughly an inch of paper towel also covering the clean part of the page on all sides. The extra space is there in case the stain spreads a little over time."
    },
    {
      "title": "Fold a second paper towel and place it over the stain.",
      "content": "Fold a second paper towel and place it over the stain. As with the first paper towel, make sure it is at least two sheets thick. Make sure the paper towel is around one inch wider than the stain on all sides. This is especially important to avoid getting oil on the object in the next step. [15] X Research source"
    },
    {
      "title": "Put a heavy book on top of the second paper towel.",
      "content": "Put a heavy book on top of the second paper towel. The best books to use are hardcover textbooks and dictionaries. Any flat, heavy object may be used instead of a book. If the stain was inside of a book, close the book with the paper towels inside and place a second book on top. [16] X Research source"
    },
    {
      "title": "Remove the book after a few days.",
      "content": "Remove the book after a few days. The stain may be completely removed at this point. If the stain is still visible, replace the paper towels and put the book back on the paper for another night. [17] X Research source If any oil remains and the stain is still fresh, proceed to the next step. [18] X Research source Alternatively, place a paper towel over the grease mark and place a warm iron over the spot to warm up and absorb the oil. [19] X Research source"
    },
    {
      "title": "Cover the paper with baking soda the stain and leave it overnight.",
      "content": "Cover the paper with baking soda the stain and leave it overnight. Baking soda can absorb light oil spots on porous and non-porous surfaces. [20] X Research source Add a tall pile of baking soda to the stain—if you can still see the paper through the baking soda, add more! Other non-staining absorbent powders like cornstarch or talcum powder will also work for this step. [21] X Research source Baking soda can also remove any odors left on the paper. [22] X Research source"
    },
    {
      "title": "Remove the baking soda and check the stain.",
      "content": "Remove the baking soda and check the stain. Repeat Steps 7-8 with fresh baking soda, talcum powder, or cornstarch until the stain is gone. [23] X Research source If the stain is still visible, you may need to take your paper to a professional restorer. Alternatively, immerse the stained area in mineral spirits for an hour and a half. Remove the paper and place a paper towel and a heavy book on top. Allow it to air dry completely. [24] X Research source"
    },
    {
      "title": "Soak up excess blood with a cotton ball or paper towel.",
      "content": "Soak up excess blood with a cotton ball or paper towel. Blood is best removed when it’s still wet. [25] X Research source If the stain is not your own blood, exercise caution and wear gloves. Some bloodborne pathogens can remain infectious for weeks outside the body. [26] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Dispose of all soiled cleaning supplies with care."
    },
    {
      "title": "Moisten a cotton ball with cold water and dab at the stain.",
      "content": "Moisten a cotton ball with cold water and dab at the stain. Dab the stain just enough to moisten and dilute it. If possible, chill the water in a bowl with ice cubes. Try to avoid using warm or hot water to clean blood. If you do, the heat may set the stain and make it permanent. [27] X Research source"
    },
    {
      "title": "Mop up the moistened stain with a dry cotton ball.",
      "content": "Mop up the moistened stain with a dry cotton ball. Carefully dab the area until dry. Tamp gently up and down. Try not to let the area get too wet, or the paper could distort. [28] X Research source"
    },
    {
      "title": "Repeat the last two steps until no blood appears on the cotton ball.",
      "content": "Repeat the last two steps until no blood appears on the cotton ball. This will likely need to be done a few times. If the stain was fresh, this may be all that's necessary to remove the stain. [29] X Research source If the stain persists, go on to the next step."
    },
    {
      "title": "Apply a 3% hydrogen peroxide solution with a cotton ball.",
      "content": "Apply a 3% hydrogen peroxide solution with a cotton ball. Repeat steps 2-3 using hydrogen peroxide instead of water. Repeat as necessary. [30] X Research source Try to avoid using bleach to clean a blood stain. Bleach can break down the proteins found in blood, leaving behind an unsightly yellow mark. [31] X Research source Hydrogen peroxide may have a bleaching effect on some textiles. Test the corner of the paper with the cleaner before applying it to the stain."
    }
  ]
}