{
  "url": "https://www.wikihow.com/Make-a-Yo-Yo",
  "title": "How to Make a Yo Yo",
  "steps": [
    {
      "title": "Make holes in the centers of 2 bottle caps.",
      "content": "Make holes in the centers of 2 bottle caps. Place a thick, folded towel or a piece of scrap wood on a tabletop. Set a bottle cap flat-side-down on the towel or wood, then place a 1 1 ⁄ 2 in (3.8 cm) #4 (3 mm) pointed screw in the center of the cap. Hold the cap tightly, and turn the screw clockwise with a screwdriver to drill it through the plastic. [1] X Research source After drilling the hole, turn the screw counterclockwise to remove it from the first bottle cap. Then repeat the steps on the second cap. The towel or wood will keep the screw from scratching your tabletop."
    },
    {
      "title": "Drive the screw through one of the bottle caps.",
      "content": "Drive the screw through one of the bottle caps. After drilling the holes, insert the screw into the hollow end of the cap that twists onto a bottle. Turn the screw clockwise to drive it through the hole in the bottle cap. [3] X Research source The screw’s point should be coming out of the flat top of the bottle cap."
    },
    {
      "title": "Slide a 1⁄4 in (0.64 cm) #4 nylon spacer over the screw to make a bearing.",
      "content": "Slide a 1 ⁄ 4 in (0.64 cm) #4 nylon spacer over the screw to make a bearing. Place an unthreaded spacer onto the pointy end of the screw on the flat side of the bottle cap. You can find nylon spacers at hardware or home improvement stores. Go with a #4 spacer to fit your screw's gauge. [4] X Research source Note that your screw needs to be long enough to hold the spacer with at least 1 in (2.5 cm) of length leftover to secure the bottle caps. A 1 1 ⁄ 2 in (3.8 cm) screw should do the trick. A bearing makes it easier for the yo-yo to spin, but you can skip this step if you don’t have a spacer that fits your screw."
    },
    {
      "title": "Tie cotton yarn or a store-bought yo-yo string to the bearing.",
      "content": "Tie cotton yarn or a store-bought yo-yo string to the bearing. If you go with a store-bought yo-yo string, simply slide its looped end onto the spacer. Alternatively, loosely tie an end of a cotton string to the spacer. Make a slip knot on the other end of the string to fit around your finger. [5] X Research source If you’re making your own string, cut it so it’s about the length between your belly button and the floor. Tie the string right onto the screw if you’re not using a spacer."
    },
    {
      "title": "Connect the bottle caps so their tops face each other.",
      "content": "Connect the bottle caps so their tops face each other. Line up the pointy end of the screw with the hole in the center of the second bottle cap. Position the cap so its flat side faces the screw. Then turn the screw clockwise to drive it into the bottle cap. [6] X Research source Drive the screw through the caps tightly enough to hold them in place, but make sure the spacer can still rotate. Once you’ve finished making the yo-yo’s main structure, it’s time to personalize it with unique decorations."
    },
    {
      "title": "Fill in the bottle caps with hot glue.",
      "content": "Fill in the bottle caps with hot glue . Add glue to the empty end of one bottle cap, let it cool for 2 or 3 minutes, then fill in the other side. Do your best to keep the glue level with the rims of the bottle caps. To keep the weight even, try to squeeze equal amounts of glue into each bottle cap. [7] X Research source Running a metal putty knife over the surface can help you level the glue with the caps' rims. To remove glue from the knife, allow it dry completely, peel it off, then wipe away residue with rubbing alcohol. The extra weight of the glue will help the yo-yo work better."
    },
    {
      "title": "Trace the side of the yo-yo onto colorful paper to make cutouts.",
      "content": "Trace the side of the yo-yo onto colorful paper to make cutouts. After letting the glue cool for a few minutes, place the yo-yo on its side over a piece of paper with a cool design. You could use construction paper, a magazine, a drawing, or an image printed off of the internet. Trace the side of the yo-yo (the bottle caps’ circumference) onto the paper, then cut out the circle you’ve traced. [8] X Research source Repeat the steps to trace and cut out another circle. You’ll use the 2 circles to decorate the sides of the yo-yo."
    },
    {
      "title": "Stick the cutouts to clear plastic with double-sided tape.",
      "content": "Stick the cutouts to clear plastic with double-sided tape. Place the cutouts design-side-down on strips of transparent tape. Then cut around the circles to get rid of excess tape. Peel off the tape’s backing to expose the sticky surface, then place the cutouts on pieces of sturdy clear plastic. [9] X Research source You could use clear plastic lids or thick plastic freezer bags. Trim excess plastic after you’ve stuck the circles to the pieces. The plastic backings will help protect the cutouts from wear and tear."
    },
    {
      "title": "Attach the circles to the sides of the yo-yo.",
      "content": "Attach the circles to the sides of the yo-yo. Stick the circles design-side-up to strips of double-sided tape, then trim off excess. Finally, peel off the tape’s backing, and stick a circle on each side of the yo-yo to add flair. [10] X Research source That’s all there is to it! Enjoy your new yo-yo!"
    },
    {
      "title": "Cut a pair of 2 1⁄2 in (6.4 cm) wide plywood discs using a hole saw.",
      "content": "Cut a pair of 2 1 ⁄ 2 in (6.4 cm) wide plywood discs using a hole saw. Use 3 ⁄ 4 in (1.9 cm) plywood to make your yo-yo. Cut out the 2 discs with a drill fitted with a hole saw with a 1 ⁄ 4 in (0.64 cm) pilot bit. If possible, avoid cutting out areas of wood with knots. [11] X Research source If you don’t have a hole saw bit, trace 2 1 ⁄ 2 in (6.4 cm) circles on the plywood, then use a jigsaw to cut them out. Picture each disc as a clock, and draw lines from 12 o’clock to 6 o’clock and from 9 o’clock to 3 o’clock. Then, for each disc, drill a 1 ⁄ 4 in (0.64 cm) hole at the center, or the point where the lines intersect. Wear protective goggles and use caution when working with saws and other power tools. If necessary, ask an adult to help you cut the discs."
    },
    {
      "title": "Sand",
      "content": "Sand the discs until their edges are round and smooth. Use a belt sander fitted with a coarse belt (such as 60-grit) to shape the discs. Compare the discs carefully, and do your best to make them the same size and shape. After shaping them with the coarse belt, sand the discs with a fine, 220-grit belt until their surfaces are nice and smooth. [12] X Research source You could also shape the discs by hand with sandpaper, but it'll require a little more elbow grease."
    },
    {
      "title": "Push a bolt through the first disc’s pilot hole.",
      "content": "Push a bolt through the first disc’s pilot hole. Get a 1 ⁄ 4 by 2 in (0.64 by 5.08 cm) bolt and washers at a hardware or home improvement store. Slide a 1 ⁄ 4 in (0.64 cm) washer down the bolt’s shaft, then push the bolt though the disc’s hole. [13] X Research source The washer should be between the head of the bolt and the disc."
    },
    {
      "title": "Slide a 1⁄4 in (0.64 cm) nylon spacer onto the bolt.",
      "content": "Slide a 1 ⁄ 4 in (0.64 cm) nylon spacer onto the bolt. Use a 1 ⁄ 4 by 1 ⁄ 4 by 1 ⁄ 2 in (0.64 by 0.64 by 1.27 cm) spacer as your yo-yo’s bearing. Slide it onto the bolt until it sits flush against the first disc. [14] X Research source A 1 ⁄ 4 by 1 ⁄ 4 by 1 ⁄ 2 in (0.64 by 0.64 by 1.27 cm) spacer is 1 ⁄ 4 in (0.64 cm) deep with a hole diameter of 1 ⁄ 4 in (0.64 cm) and a total diameter of 1 ⁄ 2 in (1.3 cm)."
    },
    {
      "title": "Attach cotton yarn or a store-bought yo-yo string to the spacer.",
      "content": "Attach cotton yarn or a store-bought yo-yo string to the spacer. A store-bought yo-yo string has a loop at one end; slide that end onto the spacer. If you’re making your own string, cut a strand of cotton yarn equal to the length between your belly button and the floor. Then tie one end loosely to the spacer, and make a slip knot at the other end. [15] X Research source"
    },
    {
      "title": "Secure the second disc with a locking nut.",
      "content": "Secure the second disc with a locking nut. After tying the string to the spacer, slide the second disc onto the bolt. Add a 1 ⁄ 4 in (0.64 cm) washer, then twist a locking nut clockwise onto the bolt shaft to hold the yoyo together. [16] X Research source Take care not to over-tighten the locking nut. Practice throwing the yo-yo, and adjust the tightness until it feels comfortable, spins nicely, and returns to your hand reliably."
    },
    {
      "title": "Decorate your yo-yo, if desired.",
      "content": "Decorate your yo-yo, if desired. If you’d like, make designs on the sides of your yo-yo with felt-tip pens or paint . For instance, try making spirals or concentric circles in various colors. Alternatively, if you stained or oiled the surface, you could just leave the finish as is. You could also decorate the sides with cutouts as you would with a bottle cap yo-yo. However, you’d need to punch a hole in the cutouts and include them under the bolt head and locking nut. Unscrew the nut and take the yo-yo apart, stick a cutout over the outside of each disc with double-sided tape, then put the yo-yo back together."
    }
  ]
}