{
  "url": "https://www.wikihow.com/Sew-a-Blazer",
  "title": "How to Sew a Blazer",
  "steps": [
    {
      "title": "Download a pattern or buy a printed pattern from a craft store.",
      "content": "Download a pattern or buy a printed pattern from a craft store. Most patterns tell you the difficulty level for the project, so choose a blazer pattern based on your skill level. Keep in mind that beginner blazer patterns have simpler silhouettes so they're easier to assemble. [1] X Research source Skim over the pattern to see if you're comfortable with the details. For example, if you've never sewed clothes before, skip a pattern that calls for making notched collars or lapels."
    },
    {
      "title": "Choose fabric for your blazer.",
      "content": "Choose fabric for your blazer. Check the yardage section of your pattern to see if the manufacturers recommend a specific type. They may suggest linen, worsted wool, or tweed, for instance. [2] X Research source Pick a lightweight fabric, such as linen, if you'll be wearing the blazer in warmer temperatures or use a medium-weight fabric, such as tweed, for cooler temperatures. Wool is very comfortable—just keep in mind that it has a lot of moisture-wicking properties."
    },
    {
      "title": "Buy as much fabric as your pattern calls for.",
      "content": "Buy as much fabric as your pattern calls for. Look for the yardage on the pattern and see how much fabric you need for the specific size you're sewing. For example, if you're making a size 16 blazer, you might need 2 3 ⁄ 8 yards (2.2 m) of fabric. [3] X Research source If you're just starting out with sewing, don't choose a fabric that has a pattern, stripes, or plaid. These can be tricky to match up when you assemble the blazer."
    },
    {
      "title": "Cut the paper pattern pieces.",
      "content": "Cut the paper pattern pieces. Unfold your paper pattern and cut out the pieces based on the size blazer you're using. You'll probably have about 4 pieces for the front, 2 to 4 pieces for the back, and 2 pieces for the sleeves. Each piece should be labeled, but if it isn't, label each piece so you can keep track of how to assemble the blazer."
    },
    {
      "title": "Cut out the fabric pieces for your blazer.",
      "content": "Cut out the fabric pieces for your blazer. Lay each pattern piece on your fabric and cut the fabric using the paper as a template. Your pattern piece should have a line printed on it that you'll line up with the grain of your fabric. This ensures that your blazer will hang properly when you wear it. [4] X Research source"
    },
    {
      "title": "Lay the lapel piece on the front panel piece and pin the edges in place.",
      "content": "Lay the lapel piece on the front panel piece and pin the edges in place. Place both of your front panel pieces flat so the pattern faces up. Then, take the 2 lapel fabric pieces and lay them right side up on the panel pieces. Line up the straight edge of the lapels with the inner edge of the panel pieces. Then, insert sewing pins so they're parallel with the inner edge of the pieces. [5] X Research source Your pattern may specify which lapel goes on which panel piece. Align the pieces at the shoulders, too, so the shoulder line is even."
    },
    {
      "title": "Straight stitch along each inner panel to attach the lapels.",
      "content": "Straight stitch along each inner panel to attach the lapels. Take the fabric to your sewing machine and use thread that matches your fabric to begin sewing the lapel piece. Keep sewing straight along the inner edge and leave a 1 ⁄ 4 inch (0.64 cm) seam allowance. Then, set the fabric aside while you work on the back. [6] X Research source Since you won't be folding the fabric, you're essentially topstitching the lapels to the panels."
    },
    {
      "title": "Lay the back pieces face to face and pin them along the center edge.",
      "content": "Lay the back pieces face to face and pin them along the center edge. Take the 2 large back pieces and stack them so the right sides of the fabric are facing each other. Line up the edges so the shoulders, sides, and bottom are aligned. Then, pin the inner side from the neckline to the hemline. [7] X Research source If your pattern has 2 additional narrow pieces for the back, sew them along the outer edges using a straight stitch."
    },
    {
      "title": "Straight stitch down the inner side of the back pieces.",
      "content": "Straight stitch down the inner side of the back pieces. To make 1 large back panel, take your pinned fabric to the sewing machine. Sew straight stitches from the neckline down to the hemline. Leave a 1 ⁄ 4 inch (0.64 cm) seam allowance as you sew. [8] X Research source Don't sew the outer sides of the back pieces right now. You'll actually be sewing the front panels onto the outer edges."
    },
    {
      "title": "Arrange the front pieces on the back piece with right sides facing down.",
      "content": "Arrange the front pieces on the back piece with right sides facing down. Spread out the back piece that you just finished sewing so the pattern is facing down. Then, lay both of the front panel pieces on top with the wrong sides facing up. Line up the outer edges of the panel pieces with the outer edges of the back piece. [9] X Research source It's important to line up the edges along the shoulder, sides, and bottom so the sides of the blazer are straight."
    },
    {
      "title": "Pin the edges of the front pieces to the back piece.",
      "content": "Pin the edges of the front pieces to the back piece. Get out sewing pins and push them through the fabric about every 2 inches (5.1 cm). Insert the pins so they're parallel with the edges of the blazer pieces. Don't pin the curve around each of the armholes since you won't be sewing them. [10] X Research source Remember to pin both of the front pieces to the back piece."
    },
    {
      "title": "Straight stitch along the shoulders and outer sides of the blazer.",
      "content": "Straight stitch along the shoulders and outer sides of the blazer. Leave a 1 ⁄ 4 inch (0.64 cm) seam allowance as you sew across the shoulder line. Then, straight stitch from the bottom of the armhole down to the bottom of the blazer. Repeat this for the other side. [11] X Research source You should have a complete body for the blazer."
    },
    {
      "title": "Lay the under sleeve piece on the upper sleeve and pin them.",
      "content": "Lay the under sleeve piece on the upper sleeve and pin them. Arrange the 2 sleeve pieces so the patterned sides are face to face. Stretch the side of the under sleeve piece so you can pin it to the side of the upper piece. Then, pin the other side of the under sleeve piece. [12] X Research source You'll have to stretch the under sleeve piece a little since the upper sleeve piece is longer. Line up the cuffs for both pieces so they're even."
    },
    {
      "title": "Sew both sides of the under sleeve piece to the upper sleeve piece.",
      "content": "Sew both sides of the under sleeve piece to the upper sleeve piece. Take your fabric to the sewing machine and straight stitch from the cuff of 1 side up to the end of the under sleeve piece. Leave a 1 ⁄ 4 to 1 ⁄ 2 inch (0.64 to 1.27 cm) seam allowance, depending on your pattern. Then, sew the other side seam. [13] X Research source This creates a simple tube that forms the basis for your sleeve."
    },
    {
      "title": "Unfold the seams and iron them flat.",
      "content": "Unfold the seams and iron them flat. Move the sleeve to an ironing board and hold 1 of the side seams open. Then, press your iron across the seam so it lays flat on its own. Repeat this for the other side seam. [14] X Research source Remember to set your iron to the right temperature for the fabric you're working with."
    },
    {
      "title": "Flip the sleeve right side out and insert the wide end into the blazer's armhole.",
      "content": "Flip the sleeve right side out and insert the wide end into the blazer's armhole. Reach through the sleeve and turn it so the pattern is facing out. Then, keep the body of the blazer inside out and push the wide end of the sleeve into the armhole. [15] X Research source"
    },
    {
      "title": "Pin the end of the sleeve to the armhole of the blazer.",
      "content": "Pin the end of the sleeve to the armhole of the blazer. Insert sewing pins on the inside of the sleeve, putting them about every 1 inch (2.5 cm) around the sleeve. Keep the pins on the wrong side of the fabric since this is where you'll be sewing. [16] X Research source Line up the center of the upper sleeve so it's aligned with the shoulder line."
    },
    {
      "title": "Straight stitch around the sleeve.",
      "content": "Straight stitch around the sleeve. Sew along the sleeve to connect it to the armhole and remember to sew the wrong side of the fabric. Leave about a 1 ⁄ 2 inch (1.3 cm) seam allowance as you sew. Then, repeat all the steps to attach the other sleeve to your blazer. [17] X Research source"
    },
    {
      "title": "Iron the cuffs, lapels, and hemline.",
      "content": "Iron the cuffs, lapels, and hemline. Fold the bottom hemline in toward the wrong side of the fabric by about 1 ⁄ 2 inch (1.3 cm). Then, press the fold in place with your iron. Repeat this for each of the cuffs and lapels so the fabric lays flat. This creates a crease so it's easier to fold and stitch the hemline. [18] X Research source If you're in a hurry, you could skip this step and just pin the fabric instead. Read the care instructions for the fabric you're using so you know what setting to turn your iron to. For example, you can iron a linen blazer with a hot iron."
    },
    {
      "title": "Hem the cuffs, lapels, and bottom of the blazer using a topstitch.",
      "content": "Hem the cuffs, lapels, and bottom of the blazer using a topstitch. To hem, fold the fabric by 1 ⁄ 4 inch (0.64 cm). Fold it over 1 more time to reach the crease you ironed. Then, topstitch along near the folded edge. Repeat this for each cuff, both lapels and the bottom edge of the blazer. [19] X Research source"
    },
    {
      "title": "Attach buttons or snaps if you want to include embellishments.",
      "content": "Attach buttons or snaps if you want to include embellishments. Most blazers are pretty simple, but you can easily add a little style. Put on the blazer and use tailor's chalk to mark where you'd like to attach a button or snap. Remember to mark the opposite side of the blazer if you're attaching a snap. [20] X Research source If you stitch on a button , decide if you'd like it to be simply decorative or if you want to cut and sew a hole on the opposite side of the blazer. Always use a button thread or some thicker type of thread when stitching buttons to a blazer. Feel free to skip embellishments and just enjoy your open blazer."
    }
  ]
}