{
  "url": "https://www.wikihow.com/Respond-to-%22%C2%BFC%C3%B3mo-est%C3%A1s%3F%22",
  "title": "How to Respond to \"¿Cómo estás?\"",
  "steps": [
    {
      "title": "This is the standard response, and translates to “Very well, thanks.",
      "content": "This is the standard response, and translates to “Very well, thanks. How about you?” You can never go wrong with this expression, which is why you’ll hear it all the time. It’s common to thank people after being asked how you are in Spanish, so adding a “gracias” to your responses is always appreciated. [1] X Research source You can also slightly tone down the enthusiasm of your response, by trading “muy bien” (“very well”) for “bien” (“well”). Keep in mind that Spanish distinguishes between the informal “tú,” which you’ll want to use with people your age or younger as well as friends, and the formal “usted,” to be used to older strangers and authority figures."
    },
    {
      "title": "“Everything’s good” is a slightly more casual way to respond.",
      "content": "“Everything’s good” is a slightly more casual way to respond. “Todo bien” and “muy bien” are both ways of saying that you’re doing well, so feel free to use either. Follow this up by saying “gracias para preguntar” (“thanks for asking”) before asking the same question in response. [2] X Research source “¿Todo bien?” can also be used as a question when you want to ask if everything is alright. You might hear this phrase from a waiter in a restaurant, for example."
    },
    {
      "title": "If you’re feeling particularly great, try one of these expressions.",
      "content": "If you’re feeling particularly great, try one of these expressions. “Super” translates to (no surprise!) “super,” “excellente” translates to “excellent,” and “buenísimo”/“buenísima” translate to “fantastic.” [3] X Research source Spanish is a gendered language, which means certain adjectives, like “buenísimo”/“buenísima,” have different endings depending on the gender of the noun they describe. Since you’re describing yourself, use “buenísimo” if you’re a man and “buenísima” if you’re a woman."
    },
    {
      "title": "Use this expression if you have good news to share.",
      "content": "Use this expression if you have good news to share. It translates to “very happy!” and can be used to start a story about something good that happened to you. For example, a conversation might go something like: “¿Cómo estás?” “¡Muy feliz! Estoy comenzando un nuevo trabajo hoy.” (“Very happy! I’m starting a new job today.”)."
    },
    {
      "title": "“Más o menos” roughly translates to “so-so.”",
      "content": "“Más o menos” roughly translates to “so-so.” This is a common expression for when you’re just doing alright, but there are some other standard responses available as well. Try one of these expressions instead to vary up your language: “Regular”/“Normal” (“I’m doing okay”) or “Igual que siempre” (“Same as always”). [4] X Research source"
    },
    {
      "title": "“Very busy” is another typical response to “¿Cómo estás?”",
      "content": "“Very busy” is another typical response to “¿Cómo estás?” Try this expression out if you’re busy with work or other responsibilities. You can also say something like “Tengo mucho trabajo” (“I have a lot of work”) to get at the same meaning, or just to switch things up. [5] X Research source"
    },
    {
      "title": "“A little tired” is another handy response to have in your back pocket.",
      "content": "“A little tired” is another handy response to have in your back pocket. If you didn’t get enough sleep, try out this expression. Remember to use the adjective that corresponds to your gender, meaning men should say “cansado,” and women “cansada.” If you’re feeling a bit more confident with your Spanish skills, add some more detail to your response. For example, say something like, “Un poco cansado. No dormí mucho anoche.” (“A little tired. I didn’t sleep much last night.”"
    },
    {
      "title": "If you’ve caught a cold or other minor illness, use this expression.",
      "content": "If you’ve caught a cold or other minor illness, use this expression. It translates to “A little sick,” and is common when you’re dealing with a virus or other bug. Men should use the masculine form, “enfermo,” and women should say “enferma.” If someone knows that you’ve been sick, they might ask you “¿Cómo estás?” to inquire about how you’ve been feeling since you last spoke to them. In that case, you can say “Un poco mejor” (“A bit better”) or “Estoy igual de enfermo” (“I’m still sick”)."
    },
    {
      "title": "Like in English, “bad” is another standard response to “¿Cómo estás?”",
      "content": "Like in English, “bad” is another standard response to “¿Cómo estás?” If you tell someone that you’re not doing well, be ready to explain why—you might say something like “Mal. Estoy un poco enfermo.” (“Bad. I’m a little sick”) Some other words you can use to express this idea are “horrible” (“horrible”) or “fatal” (“awful”). [6] X Research source"
    },
    {
      "title": "If you have sad news to share, use this expression.",
      "content": "If you have sad news to share, use this expression. It means “A little sad” and can be used to introduce a story about some unfortunate news. For example, you might say something like “Un poco triste. Mi novio me dejó ayer” (“A little sad. My boyfriend dumped me yesterday). [7] X Research source"
    },
    {
      "title": "Saying “I’m feeling more calm now” is useful after a shocking event.",
      "content": "Saying “I’m feeling more calm now” is useful after a shocking event. Someone might ask you “¿Cómo estás?” to see how you’re feeling after something surprising or shocking happened to you, like if you’ve had an accident. If that happens, using this expression can let them know that you’re feeling a bit better. [8] X Research source"
    }
  ]
}