{
  "url": "https://www.wikihow.com/Sandman-Game",
  "title": "Sandman Game Rules + Example Scary Stories",
  "steps": [
    {
      "title": "Pick a Sleeper and a Storyteller.",
      "content": "Pick a Sleeper and a Storyteller. [1] X Research source One person will lay on the ground while the other tells a story. If you can’t pick, play a quick game to decide the characters, like rock, paper, scissors."
    },
    {
      "title": "Dim the lights.",
      "content": "Dim the lights. Prepare the room by blocking any windows and closing the curtains. Play the game in a dark, quiet room to amp up the scare factor! [2] X Research source If you don’t want to play in complete darkness, light a few candles around the perimeter of the room for a spooky glow. Turn on some scary music to give everyone the chills!"
    },
    {
      "title": "Lie on the floor if you’re the Sleeper.",
      "content": "Lie on the floor if you’re the Sleeper. Center yourself in the middle of the room with a pillow under your head. Keep your limbs flat on the floor, and don’t cross your arms or legs. [3] X Research source If more people are playing, have them create a wide circle around the Sleeper and remain silent throughout the game."
    },
    {
      "title": "Tell a scary story if you’re the Storyteller.",
      "content": "Tell a scary story if you’re the Storyteller. Create a story about how the Sleeper died. The details are up to you, but revolve the story around the Sleeper being sliced open, filled with sand, and stitched back up. [4] X Research source If you’re the Storyteller, run your fingers along the Sleeper when you mention slicing them open (to mimic a knife). Lightly tap on the Sleeper when you mention filling their body with sand. [5] X Research source If you're the Sleeper, just listen to the story."
    },
    {
      "title": "Tell the Sleeper to rise.",
      "content": "Tell the Sleeper to rise. If you’re the Storyteller, instruct the Sleeper to open their eyes and stand up at the end of your story. If they don't get up fast enough, they risk being possessed by the Sandman! [6] X Research source The Sleeper may have a hard time standing up at first—from either laying on the ground or feeling like their body was filled with sand. [7] X Research source"
    },
    {
      "title": "Example Story 1",
      "content": "Example Story 1 “A man chased you in the woods. Boom! You tripped over a rock and broke your ankle. The man caught up to you and pulled out a knife. He ran it across your ankles and then sliced them open (run your fingers across them) . He filled them with sand (lightly pat) . He ran his knife across your arms and sliced them open (run your fingers) . He filled them with sand (lightly pat) . You tried to escape but your body was too heavy. Finally, he slit your throat (run your fingers) so you couldn’t scream and stitched you back up.\" [8] X Research source"
    },
    {
      "title": "Example Story 2",
      "content": "Example Story 2 “You were walking down the street when someone ran up behind you and knocked you out. When you woke up, you couldn’t identify your surroundings, but you heard footsteps walking toward you. It was a man with a knife. He came closer, sliced your shoulders (run your fingers across them) , and filled them with sand (lightly pat) . He slid his knife across your legs and sliced them open (run your fingers across them) . He filled them with sand (lightly pat) . He finally ran the blade across your neck and sliced your throat (run your fingers) . He filled it with sand (lightly pat) and stitched you up.” [9] X Research source"
    },
    {
      "title": "Example Story 3",
      "content": "Example Story 3 “There once was a woman who lived in a quiet neighborhood – she had no idea she was being watched from afar. The Sandman followed her every move, waiting for the opportunity to strike. One day, the woman forgot to lock her front door, so the Sandman snuck into her apartment with a knife. He sliced her legs open (run your fingers across them) and filled them with sand (lightly pat) . She began to scream so he taped her mouth shut. He sliced her arms (run your fingers) and filled them with sand (lightly pat) . He finally slid his knife across her face and sliced her throat (run your fingers) . He filled it with sand (lightly pat) .” [10] X Research source"
    }
  ]
}