{
  "url": "https://www.wikihow.com/Sell-Your-Pok%C3%A9mon-Cards",
  "title": "The Best Places to Sell Pokémon Cards Online or In-Person",
  "steps": [
    {
      "title": "Separate your cards by their set symbols.",
      "content": "Separate your cards by their set symbols. Each set of Pokémon cards that is released is identified by a small symbol. Look in either the bottom right-hand corner of the Pokémon illustration or on the bottom right-hand corner of the card for the set symbol. Organize the cards into piles that have the same symbols to know which sets you have in your collection. [1] X Research source Check this list of symbols to find out what sets you have in your collection. The original base set of cards don’t have a symbol printed anywhere on the cards."
    },
    {
      "title": "Organize the cards in each set in numerical order.",
      "content": "Organize the cards in each set in numerical order. Look at the bottom left or right corner of the card for 2 numbers separated by a backslash. The first number represents the card’s number in the set. The second number represents how many total cards are in the set. Sort all of your Pokémon cards in ascending numerical order so they’re easy to find. [2] X Research source Example: A Charizard with the set number “5/102” is the 5th card in the set out of a total of 102 cards. Cards that were released as promos only have one number denoting what number the card is. For example, Ivy Pikachu is number 1 out of the first released series of Black Star Promos . If a card’s first number is higher than the second number, like if it read “112/105,” then it’s a more valuable Secret Rare card."
    },
    {
      "title": "Put all of your cards in protective sleeves and top loaders.",
      "content": "Put all of your cards in protective sleeves and top loaders . Slide each individual card into its own sleeve to protect it from dust, scratches, or UV light. After you've put your cards into sleeves, slide them into hard top loader cases to prevent them from bending. [3] X Research source Alternatively, put your cards into a binder with sleeve pages to easily organize and display all your cards."
    },
    {
      "title": "Check the selling prices for your cards online.",
      "content": "Check the selling prices for your cards online. Visit eBay and look up the name of the card you’re selling, the set it’s from, and the condition it’s in. Under the “Show Only” tab on the left, check the “Sold Items” to see how much people have recently spent on similar copies of the card. After you check the value of a card , write it down so you don’t forget them. [4] X Research source Selling prices can fluctuate, so make it a habit to check on card values every few weeks to see if any of your cards have gained value."
    },
    {
      "title": "eBay",
      "content": "eBay Selling on eBay is one of the easiest ways to list your individual Pokémon cards since it’s one of the largest marketplaces online. When you make your eBay listing, put the name of the card and the set that it’s from in the title of your post. Upload a few clear photos of your Pokémon card. Then, list the asking price for the card based on what the same card has sold for in the past. [5] X Research source To sell your cards the fastest on eBay, make sure you set the price competitively with other people and provide a thorough description of the card."
    },
    {
      "title": "Trading card sites",
      "content": "Trading card sites Sites made specifically for buying and selling trading cards are the main hubs for buyers, so they’re great starting points for your cards. Some sites let you sell your cards directly to a buyer using their listing tools, while other sites have buylists of cards they’ll purchase directly from you. Some of the best places to sell your Pokémon cards are: TCGplayer lets you individually list your cards for sale, or lets you set up a bulk lot if you want to make money off of your entire collection. [6] X Research source Cardmarket is based out of Germany and offers a place to sell cards directly to buyers and only takes a 5% commission on any sales you have. [7] X Research source CCG Castle has a buylist of cards they’re looking for. If you have any of the in-demand cards, you’re able to sell them for store credit. [8] X Research source Card Cavern has a set buylist. If you have any of the listed cards in good condition, pack them up and send them to get cash or store credit. [9] X Research source Troll and Toad accepts bulk collections and single cards as long as they’re listed on the site’s buylist. [10] X Research source"
    },
    {
      "title": "Facebook Marketplace",
      "content": "Facebook Marketplace If you want to try selling your Pokémon cards locally, either list individual cards or post your whole collection for sale on the Facebook Marketplace . Be sure to include specific details about the names of the cards, the sets they’re from, and their condition. Post a couple of clear pictures of the cards. If a user reaches out wanting the card, use a secure payment like Paypal or Venmo to complete the sale. [11] X Research source Be wary of buyers that want to pay in cash, check, or other un-secure methods since there’s a chance they could try to scam you."
    },
    {
      "title": "Trading card stores",
      "content": "Trading card stores Call your local comic shops and hobby stores to see if they’ll buy any of the cards in your collection. If they’re willing to buy your collection, take your cards into the store so the employees can inspect them. Because these stores resell your cards again for a profit, they may not offer as much money as other collectors, but you’ll still make money for any rare cards you have. [12] X Research source Some trading card stores will buy common cards in bulk if you have a lot of extra low-valued cards that you want to get rid of. Stores may offer cash payments or store credit, so always ask about the payment options available."
    },
    {
      "title": "Card conventions",
      "content": "Card conventions If there’s a card-collecting convention coming to a nearby town, many collectors will show up looking for rare cards to add to their collection. If you have a large card collection that you want to sell, check if there are any vendor slots that let you run a booth so buyers come to you. If you only have a few cards to sell, bring them with you to the convention and look for any booths that are willing to buy them. [13] X Research source Keep a list of all cards your along with their values that you’re able to easily reference. That way, you don’t accidentally sell them for lower than what they’re worth."
    },
    {
      "title": "First Edition base set",
      "content": "First Edition base set The base set is the first batch of 102 Pokémon cards to come out, and the first editions are the original print runs from 1999. Because the manufacturers made some graphical changes soon after the first edition prints, these cards are really rare and usually bring in the most amount of money when you try to sell them. To check if your cards are first edition , look for a stamp on the left side of the card that says “1st edition\"—1st edition cards will always have this. Another sign that your card is a first edition is the year “99” being listed in the copyright info on the bottom. [14] X Research source A lack of shadow on the card doesn't mean that it's 1st edition—it just means it was printed during the first wave of Pokémon cards. These cards are called \"Shadowless.\" First edition cards can sell anywhere from $10 USD for less common cards, or over $500 USD for rare cards like Charizard or Blastoise."
    },
    {
      "title": "Shadowless base set",
      "content": "Shadowless base set Shadowless base set cards look very similar to their first edition counterparts, but they do not have the first edition stamp on the left side. If there isn’t a black drop shadow on the right side of the card’s art and you don’t see the stamp, then your cards are shadowless and could be valuable. [15] X Research source Shadow cards have bold text on them, while Shadowless cards do not. Some shadowless cards, such as Charmander or Squirtle, are worth around $5 USD, but less common cards like Venusaur and Mewtwo could be worth $100 USD or more. [16] X Research source"
    },
    {
      "title": "Unlimited base set",
      "content": "Unlimited base set After the first edition and shadowless, Pokémon updated the aesthetics of the cards to add a drop shadow to the right side of the art. Because these cards are the last versions of the base set, they’re not as valuable as the earlier releases but they still could be worth a bit of money to collectors. [17] X Research source Other signs that your cards are unlimited include thicker text for the HP listed in the top-right corner and the date “99” missing from the copyright years. Unlimited cards from the base set could be worth around $40 USD a piece, but it may vary depending on the Pokémon."
    },
    {
      "title": "Holographic cards",
      "content": "Holographic cards Sometimes called “holos,” these special cards have shiny foil prints either on the art or on the entire card to show that they’re rare. While the actual resale value of your cards depends on the Pokémon and how sought-after they are, holos will still usually bring in more cash than common cards with matte finishes. [18] X Research source Standard holographic cards only have foil on the art image. Reverse holos have foil on the entire card except for the image. Full art holos have shiny foil covering the card and the image so the thing is shiny. If you have any of the 16 holographic cards from the base set of cards released, such as Mewtwo or Alakazam, they’re the most valuable since they’re the rarest."
    },
    {
      "title": "Full-art cards",
      "content": "Full-art cards While standard cards have a box showing an image of the Pokémon, full-art cards have a larger illustration that takes up most of the card’s face. Since these full-art cards are less common and typically contain rare or powerful Pokémon, collectors are willing to spend a little extra money on them. [19] X Research source Some full-art cards are rarer alternate versions of a different card in the set, so they’re more valuable to collectors. [20] X Research source Cards like Charizard V, Umbreon V, and Lugia V are some recent full-art cards that could be anywhere from $20–30 USD per card. [21] X Research source"
    },
    {
      "title": "Condition",
      "content": "Condition After you open a pack of Pokémon cards, normal wear and tear will make rare cards drop in value. When you’re looking through your cards, check them for scratches on the card art, wear or scuffs on the edges of the cards, damage to the corners, or creases. If you don’t notice any of these signs, then your card is still in good condition and valuable to collectors. [22] X Research source If your card has a rip or water damage, then it may not be valuable to collectors due to the condition."
    },
    {
      "title": "Rarity",
      "content": "Rarity Look at the bottom left or right corner of the card for a small shape symbol. If you see a circle symbol, then the card is considered “common” and isn’t worth a lot of money. Cards that are “uncommon” are slightly rarer and have a diamond symbol instead. Rare cards have a star symbol to show that they’re some of the least common to show up in packs, so so they’re usually worth more money than the others. [23] X Research source Rare cards with a star symbol may not all be the same value. Some rare cards are holographic or have special GX or EX powers that make them more desirable to collectors. [24] X Research source Pokémon that are really popular with fans, such as Pikachu, Charizard, Blastoise, and Mewtwo, may also be more valuable even if they’re common cards since more people are actively looking for them. Sometimes, rare Pokémon cards that have a 1/100 chance of being in a booster pack are referred to as “chase cards” since they’re chased by collectors. [25] X Research source"
    },
    {
      "title": "Printing defects",
      "content": "Printing defects Pokémon cards are printed and cut out from large sheets, so sometimes small errors or misprints get into packs. When you look at one of your Pokémon cards, check if the border is the same thickness all the way around the card. If you notice that one edge is thinner than the others, this slight error could lower the value of a card compared to if they’re perfect. [26] X Research source If there’s a large misprint, like if the art is somehow printed at an angle or cut off by the edges, then the card may actually be more valuable since these errors are usually caught during manufacturing."
    },
    {
      "title": "Authentication",
      "content": "Authentication When you get Pokémon cards authenticated , a grading service inspects the card and gives it a score based on the condition. Once they grade the card, they seal it in a plastic case so it stays in the same condition. Because buyers want to know the quality of the cards they’re buying, you’ll usually get a bit more money when your cards have a high grade from a reputable service. [27] X Research source Some reputable grading services for Pokémon cards include PSA , Beckett , CGC Cards , and Ace Grading . Grading companies charge depending on the card's expected price after grading. So, only send in cards in your collection that are valuable to ensure you turn a profit."
    }
  ]
}