{
  "url": "https://www.wikihow.com/Shoot-a-Soccer-Ball",
  "title": "How to Shoot a Soccer Ball",
  "steps": [
    {
      "title": "Look up before kicking the ball.",
      "content": "Look up before kicking the ball. Before shooting, glance up at the field in front of you. Focus as much as possible on where you want the ball to go. Note where the other players are, including the defenders, goalie, and your teammates. Use this information to adjust your shot or pass when a teammate has a better shot opportunity. [1] X Research source You may notice some professional players shooting without looking up. Through in-game experience, they develop a sense of their positioning on the field. This most often happens close to the goal, since looking up delays the shot a little."
    },
    {
      "title": "Keep your eye on the ball.",
      "content": "Keep your eye on the ball. Look back down at the ball and keep looking at it until you kick it. Doing this leads to stronger, more accurate shots. [2] X Research source"
    },
    {
      "title": "Run towards the ball with even strides.",
      "content": "Run towards the ball with even strides. Keep the strides you take the same length they would be while running. Avoid stretching forward too far or taking a series of short steps, since this throws off your balance. When kicking a still ball, stand only far enough back that you can reach the ball in 3 or 4 steps."
    },
    {
      "title": "Plant your non-kicking foot next to the ball.",
      "content": "Plant your non-kicking foot next to the ball. Where you place this foot determines where the ball will travel. Place it beside the ball, about shoulder width away from your other foot. A good, medium distance should feel comfortable to you. Keep your toes pointed straight ahead to the goal. [3] X Research source Placing your foot further away from the ball helps when you need to lift the ball more, such as when kicking over a wall of defenders."
    },
    {
      "title": "Bring your kicking leg back as far as possible.",
      "content": "Bring your kicking leg back as far as possible. The further you can bring your leg back, the more power you’ll generate. Bend your leg at the knee and keep your toes pointed downwards. In the perfect kicking position, your leg looks like it’s in the shape of a “V.” [4] X Research source Stretch your legs often to increase your flexibility."
    },
    {
      "title": "Hold your ankle in place.",
      "content": "Hold your ankle in place. This is also called locking your ankle. Your foot should still be pointed downwards, straight and firm. Your ankle shouldn’t wiggle at all as you kick the ball. Any movement weakens your shot. [5] X Research source"
    },
    {
      "title": "Stand straight as you kick.",
      "content": "Stand straight as you kick. Staying in a neutral position gives you maximum control over the ball’s flight. Leaning a little, if it feels natural to you, it's fine, but don’t try to lean more. Instead, focus on turning to face the goal. If the ball often flies over the net, you may be leaning back too much. If it stays lower than you’d like, you may be leaning forward too much."
    },
    {
      "title": "Target the middle of the ball.",
      "content": "Target the middle of the ball. Pick out the spot where your foot will strike the ball. Most of the time, this is the part of the ball closest to you. Kicking it in the center gives you control over your shot while also generating lots of power. [6] X Research source To raise your shot in the air more, kick the ball a little lower than center. To bend the ball, kick left or right of center. Kicking on the left causes the ball to curve to the right. Kicking on the right side causes it to arc to the left. [7] X Research source"
    },
    {
      "title": "Strike the ball with the laces of your shoe for a more powerful shot.",
      "content": "Strike the ball with the laces of your shoe for a more powerful shot. Bring your foot forward. Hit the ball with the top part of your foot to generate powerful but accurate shots. This is the kind of shot you’ll need on most occasions. To bend your shot more, strike the ball with the side of your toes. [8] X Research source"
    },
    {
      "title": "Kick the ball with the side of your foot for a more accurate shot.",
      "content": "Kick the ball with the side of your foot for a more accurate shot. As you approach the ball, turn your foot to the side. Hit the ball with the inside edge of your foot. Your shot won’t be as strong, but the increase in accuracy is good for shots near the goal or when the defense doesn’t give you a lot of space."
    },
    {
      "title": "Follow through with your kicking leg.",
      "content": "Follow through with your kicking leg. After striking the ball, don’t stop moving. Bring your kicking leg through at a medium height. Step through and plant your leg on the ground. A bad follow-through causes your shot to fall short of the target or fly wildly off-course. To make the ball go higher, lift your leg into the air more during the follow-through."
    },
    {
      "title": "Push the ball ahead of you.",
      "content": "Push the ball ahead of you. To get a good shot, the ball can’t be close to your body. Tap the ball a step or two ahead of your kicking foot. Push it directly ahead of you to set up a normal, straight kick. Move it slightly to the side when you need to bend your kick or change your angle. [9] X Research source Take moderate strides towards the ball. The best shot happens when you don’t slow down or change your stride much when approaching the ball. [10] X Research source To practice this, start by approaching the ball with slow, even strides. Increase the speed once this feels comfortable."
    },
    {
      "title": "Plant your foot ahead of the ball.",
      "content": "Plant your foot ahead of the ball. Planting your foot is the same as a normal kick, except the ball is rolling. If you plant your non-kicking foot next to the ball, the ball will roll past it. When done perfectly, the ball will be even with your foot when you kick it. [11] X Research source Remember to point your toes on the foot that is planted towards the goal!"
    },
    {
      "title": "Kick the ball as you normally would.",
      "content": "Kick the ball as you normally would. Use the same approach that you learned before when kicking the ball. Draw back your foot, lock your ankle, and follow through with your shot. Soon, the shots you take while running will be as perfect as the ones you take while standing still!"
    },
    {
      "title": "Take shots at distances comfortable to you.",
      "content": "Take shots at distances comfortable to you. Glance up at the field to see where you are in relation to the ball. Recall how well you shoot during practice. If you don't have a lot of power, shooting from distance won't do you any good. You'd score more goals by being closer to the ball to get a better shot. Practice taking shots at all sorts of ranges and angles to prepare for any situation that arises during a game."
    },
    {
      "title": "Pay attention to the goalkeeper’s positioning.",
      "content": "Pay attention to the goalkeeper’s positioning. The goalie (or keeper) may stand to the side, exposing one side of the goal. They may also cheat to one side, leaning over or beginning to run before you shoot. Surprise them by shooting in the opposite direction! [12] X Research source"
    },
    {
      "title": "Shoot across the goalie.",
      "content": "Shoot across the goalie. Normally your best bet is to shoot towards the opposite side of the net. If you’re on the right side, shoot towards the left part of the goal. The goalie usually will be closer to you and will have to move farther to reach the ball This isn’t always your best option. If you’re very close to one side of the goal, someone’s blocking the other side, or a defender is approaching, you may not be able to aim at the other side."
    },
    {
      "title": "Aim towards the corners or side netting of the goal.",
      "content": "Aim towards the corners or side netting of the goal. Normally, the goalie stands in the middle of the goal, leaving the sides open. Force the goalie to dive to make the save, if possible. Make use of the side netting, since it's a big target when you're shooting from the sides of the field. Although players enjoy aiming for the upper corners, more goals are scored in the lower corners! [13] X Research source"
    },
    {
      "title": "Shoot above or below the keeper.",
      "content": "Shoot above or below the keeper. Shooting the ball to the side means the goalie has to stretch to make the save. A goalie can easily move from side to side, but it’s more difficult to stretch upwards or downwards. Even the best goalies can’t always reach the corners of the goal. Where you aim depends on the situation, but avoid shooting at a medium height as much as possible. Shooting low is also great when there’s lots of defenders in front of you. It can lead to goals on deflections or rebounds."
    },
    {
      "title": "Kick the ball in the air when defenders are in front of you.",
      "content": "Kick the ball in the air when defenders are in front of you. If you can’t push the ball past them to get a better angle, you can still take a shot. Strike the ball slightly below center. This lifts the ball in the air more, putting it over defenders or chipping a goalie that runs forward."
    }
  ]
}