{
  "url": "https://www.wikihow.com/Remove-a-Stripped-Screw",
  "title": "10 Different Ways to Get a Stripped Screw Out",
  "steps": [
    {
      "title": "A different size or style of screwdriver can get a better grip.",
      "content": "A different size or style of screwdriver can get a better grip. If you’re trying to get a stripped Phillips-head screw out, pick a screwdriver with a slightly larger bit. Apply firm pressure so the screwdriver catches on the stripped head and try loosening it like normal. If that doesn’t work, then switch to a flathead screwdriver since it can fit into the slots better. [1] X Research source If a different screwdriver doesn’t catch, then stop trying to use it so you don’t damage the screw even more. If you’re using a screwdriver bit in a drill, then try unscrewing with the next largest bit size to try getting a better grip. Check out what other wikiHow DIYers are doing to remove stripped screws in our \"How can I unscrew a stripped screw?\" forum ."
    },
    {
      "title": "The rubber band fills the gap so your screwdriver catches.",
      "content": "The rubber band fills the gap so your screwdriver catches. Lay a thick rubber band over the top of the screw head. [2] X Expert Source Gino Colucci Home Improvement Specialist Expert Interview. 7 January 2021. Press your screwdriver down firmly and try turning it as normal to loosen the screw. [3] X Research source If the screw still doesn’t budge, try using a screwdriver with a slightly larger head so it catches better. Rubber bands also provide a non-slip surface so your screwdriver doesn’t move around on the stripped screw."
    },
    {
      "title": "A layer of duct tape can give you extra friction to turn the screw.",
      "content": "A layer of duct tape can give you extra friction to turn the screw. Cut off a piece of duct tape and place it directly over the screw that’s stuck. Put your screwdriver into the screw and try turning it counterclockwise until it loosens up. [4] X Research source The tape fills in some of the gap between the screw and your screwdriver so it has a better grip. Alternatively, try placing steel wool over the screw head and firmly pressing your screwdriver into the slot to get better traction."
    },
    {
      "title": "Pinching the sides of the screw will make it easier to turn.",
      "content": "Pinching the sides of the screw will make it easier to turn. Open your pliers and grip the sides firmly. Make sure your pliers don’t slip off of the screw as you turn it counterclockwise. Keep turning the screw until you can remove it completely. [5] X Research source Try filing the sides of the screw so they’re a little flatter so your pliers don’t slip off as easily."
    },
    {
      "title": "Hitting the screwdriver makes a new slot in a soft screw.",
      "content": "Hitting the screwdriver makes a new slot in a soft screw. Place the tip of a flathead screwdriver on the top of the stripped screw. [6] X Expert Source Gino Colucci Home Improvement Specialist Expert Interview. 7 January 2021. Lightly tap the end of the screwdriver’s handle 2–3 times with your hammer so it can dig into the screw head. Without lifting your screwdriver up, try to turn the screw to see if you can loosen it. If you’re trying to remove a rusty screw that’s stripped, try spraying a rust penetrant before tapping the screwdriver to help break apart the corrosion. [7] X Research source"
    },
    {
      "title": "Friction drops",
      "content": "Friction drops add an abrasive so your screwdriver can catch easier. Put 1–2 drops into the middle of the stripped screw and immediately put your screwdriver into the slot. Since the drops fill the gap between your tool and the metal, just turn the screwdriver counterclockwise to loosen and remove the screw. [8] X Research source You could also try using an abrasive powder like salt or sand to prevent your screwdriver from slipping."
    },
    {
      "title": "Running a left-handed bit in reverse digs into the screw for a good grip.",
      "content": "Running a left-handed bit in reverse digs into the screw for a good grip. Install a bit that’s just smaller than the screw’s diameter on your drill. Lightly press the end of the drill bit into the middle of your screw. Set your drill to reverse and slowly squeeze the trigger. The tip will catch on the damaged screw and continue to loosen it. [9] X Research source Avoid using a right-handed drill bit since it won’t properly catch on the screw head."
    },
    {
      "title": "A screw extractor cuts into your screw so you can pull it out.",
      "content": "A screw extractor cuts into your screw so you can pull it out. Screw extractors are specialty drill bits with one end that cuts and one end that bites into the metal. To use the extractor , install the cutting bit on your drill and run it in reverse to bore into the middle of the screw. Then, flip the extractor to the pointed side and drill into the screw to loosen it. [10] X Research source Screw extractors are reusable, so keep one in your toolbox in case you run into another stripped screw. [11] X Expert Source Gino Colucci Home Improvement Specialist Expert Interview. 7 January 2021."
    },
    {
      "title": "Cutting a new slot makes a flathead screwdriver get a better grip.",
      "content": "Cutting a new slot makes a flathead screwdriver get a better grip. Load a cutting disc onto a rotary tool that’s made for cutting into metal. Position the disc vertically and turn on the tool so it starts spinning. Lightly press the tool into the screw head to make a straight line across the surface. After you cut a line in the screw, fit the end of a flathead screwdriver into the slot and turn it counterclockwise. [12] X Research source Rotary tools create sparks, so wear safety glasses and avoid working near anything flammable."
    },
    {
      "title": "Attaching a nut lets you hold the screw with a wrench.",
      "content": "Attaching a nut lets you hold the screw with a wrench. Use a nut that’s about the same size as the screw head’s diameter. Hold the nut against the top of the screw head, and start welding the bottom of the nut to attach it. After you have the nut secured, just grip it with a wrench and turn it counterclockwise to remove it completely. [13] X Research source Be sure to wear proper welding gear, like a welding mask , gloves , and an apron . This works best for screws attached to metal since welders can leave burn marks on wood."
    }
  ]
}