{
  "url": "https://www.wikihow.com/Signs-Your-Case-Will-Be-Dismissed",
  "title": "11 Telling Signs Your Case May Be Dismissed (With or Without Prejudice)",
  "steps": [
    {
      "title": "There is little to no evidence.",
      "content": "There is little to no evidence. In a criminal case, the prosecutor has to prove that the defendant is guilty beyond a reasonable doubt. If there's not a lot of evidence that the defendant did the crime, the prosecutor is likely to drop the case. [1] X Research source This applies to evidence that might have constitutional problems as well. For example, if the police took evidence during an illegal search and seizure, it can't be used as evidence against you. If that's the only evidence the prosecutor has, they'd be likely to dismiss the case. The prosecutor also has to be able to show that the evidence wasn't tampered with or fabricated. If the evidence wasn't secured or was found at the scene of the crime days after the crime took place, the prosecutor might not be able to show that."
    },
    {
      "title": "There is exonerating evidence.",
      "content": "There is exonerating evidence. Likewise, suppose evidence comes to light that would make it reasonable to doubt that you committed the crime, such as DNA evidence that doesn't match yours. In that case, the prosecutor is likely to drop the case. Typically, a prosecutor has no interest in putting someone on trial for a crime it's doubtful they committed. [2] X Research source In this situation, if the evidence truly exonerates you, talk to the prosecutor. Make sure that if they drop the charges, nothing will appear on your record that could continue to haunt you in the future."
    },
    {
      "title": "No witnesses will come forward.",
      "content": "No witnesses will come forward. When a case involves other people rather than things, if the prosecutor can't find anyone who saw what happened, they're likely to drop the charges. This situation is especially probable if the evidence in the case looks like it's not going to be much more than one person's word against another's. [3] X Research source Since it's the state, not the victim, that prosecutes crimes, a case won't necessarily be dismissed solely because the victim refuses to come forward. [4] X Research source"
    },
    {
      "title": "Officers on the scene made mistakes.",
      "content": "Officers on the scene made mistakes. People have constitutional rights when they're being arrested, detained, or questioned by the police. If police officers do anything to potentially violate any of those rights, it can result in the entire case against that person being dismissed. [5] X Research source In some situations, a prosecutor will decline to prosecute a case if there's any kind of questionable conduct on the part of officers that might raise constitutional issues."
    },
    {
      "title": "The prosecutors made mistakes.",
      "content": "The prosecutors made mistakes. The constitution also gives you rights during the criminal process. If anyone in the prosecutor's office does anything that could potentially violate those rights, either the prosecutor or the judge might drop the case. [6] X Research source The prosecutor might simply drop the case and decline to prosecute before the judge finds out about the potential constitutional violation."
    },
    {
      "title": "Other circumstances make your case difficult to prosecute.",
      "content": "Other circumstances make your case difficult to prosecute. A prosecutor has broad discretion in choosing which cases they want to prosecute. They typically don't have to justify their decision not to prosecute a case either, meaning that they can pretty much drop charges for any reason if it makes sense to the office to do so. [7] X Research source Prosecutors may decline to prosecute cases if prosecution would be extremely politically unpopular. For example, prosecutors in states where cannabis is illegal might decline to prosecute marijuana cases. The victim can ask for the case to be dismissed. Neither the prosecution nor the judge have to comply with this request, but they often do. This situation applies both when the victim is an individual (such as in assault cases) and when the victim is a business (such as in shoplifting cases). [8] X Research source"
    },
    {
      "title": "The court doesn't have jurisdiction.",
      "content": "The court doesn't have jurisdiction. If a judge is going to hear a civil case, the court needs jurisdiction over both whatever the case is about and the people involved in the lawsuit (the person who's suing and the person or people they're suing). The court gets jurisdiction through state and federal court rules as well as state and federal laws. [9] X Research source For example, if someone sued you in California and you lived in Texas, you might argue that the case should be dismissed because the California courts don't have jurisdiction over you. The court might also not have jurisdiction over whatever event triggered the lawsuit. For example, suppose someone tried to sue you in Texas over a car wreck that happened in Florida. In that case, you might argue that the case should be dismissed because Texas courts don't have jurisdiction over a car wreck that happened in Florida. The courts also need legal jurisdiction for special types of cases. For example, the federal courts are given exclusive jurisdiction to hear cases that involve litigants from two separate states."
    },
    {
      "title": "The person who filed the lawsuit lacks standing to sue.",
      "content": "The person who filed the lawsuit lacks standing to sue. To file a lawsuit, a person has to show that they suffered some injury or loss as a result of what happened and that the courts can redress that injury or loss. It might be that they can't prove any specific injury that was caused by your alleged actions. [10] X Trustworthy Source United States Courts Official website for the U.S. court system Go to source For example, if you own a café and a customer sues you because they slipped and fell, you might argue they lack standing if they weren't injured at all as a result of the fall."
    },
    {
      "title": "The person being sued wasn't properly served.",
      "content": "The person being sued wasn't properly served. Court rules require that the person suing someone (the plaintiff) tell the person being sued (the defendant) that they are filing a lawsuit in a very particular way. These rules are there to ensure that the person being sued has enough time to respond to the allegations against them and hire a lawyer if they want. If someone sued you and didn't follow these rules, you could potentially get the case dismissed on those grounds. [11] X Research source Getting a case against you dismissed because of failure of service is difficult. If you don't know that you're being sued, it's pretty hard to argue that the case should be dismissed. If you're going to argue that you weren't properly served, you typically have to do this immediately before you respond to the case in any other way."
    },
    {
      "title": "The statute of limitations has passed.",
      "content": "The statute of limitations has passed. If someone has a reason to sue, they only have a limited amount of time to do that. After that time, it wouldn't be fair because memories have faded, and evidence has likely disappeared. Each state sets statutes of limitations for different types of civil claims. [12] X Research source Statutes of limitations start at different times depending on the type of claim. For example, the statute of limitations for a personal injury lawsuit might start on the date the person was injured. Sometimes, a statute of limitations doesn't give a hard and fast deadline. Different situations can pause (or even restart!) the clock on the statute. If you think your case has statute of limitations issues, talk to a local attorney."
    },
    {
      "title": "The person suing fails to state a claim.",
      "content": "The person suing fails to state a claim. Laws give people the right to sue, and each law lays out the specific elements that a person must meet if they want to state a claim under that law. If they fail to cover every one of those elements, you could argue that their lawsuit should be dismissed for failure to state a claim. [13] X Research source For example, in a slip-and-fall case, the plaintiff has to show that you have some duty of care towards them. If they were trespassing in your yard when they slipped and fell, you could argue that you have no duty of care towards trespassers, and therefore, they fail to state a claim."
    },
    {
      "title": "You have a civil case if you were sued by a private party, while criminal cases are handled by the government.",
      "content": "You have a civil case if you were sued by a private party, while criminal cases are handled by the government. A civil case essentially asks a judge (and sometimes a jury) to resolve a dispute between two people, or between a person and a company, or two companies. With a criminal case, on the other hand, charges are brought on behalf of the state or federal government by prosecutors, who are government attorneys. [14] X Research source If you are found guilty in a criminal case, you could face jail time. You might also be ordered to pay fines or restitution. Fines and restitution are different from the damages you'd have to pay if a court found you liable in a civil case. That money is intended to make the person who sued you whole. Laws spell out what people can sue over and what things they have to prove. In civil court, they only have to prove their case is more likely than not. Criminal prosecutors, on the other hand, have to prove their case beyond a reasonable doubt."
    },
    {
      "title": "No, if it was dismissed with prejudice.",
      "content": "No, if it was dismissed with prejudice. When a court dismisses a case \"with prejudice,\" that means that the prosecution or plaintiff can't file that case again. Typically, this is done in situations where whatever is wrong with the case is something that can't be corrected. [15] X Research source For example, a judge might dismiss your case with prejudice because police officers violated your constitutional rights when they arrested you. Since that's not something that can be changed, the case can't be refiled."
    },
    {
      "title": "Yes, if it was dismissed without prejudice.",
      "content": "Yes, if it was dismissed without prejudice. When a case is dismissed \"without prejudice,\" what this typically means is that it's merely postponed until the other party can fix whatever was wrong with the case the first time. While it doesn't get the case entirely off your back, it does buy you some time. And in a civil case, it's going to cost your opponent money to file their case again. [16] X Research source If your case was dismissed due to lack of personal jurisdiction, the judge usually dismisses it without prejudice so it can be filed in the proper court. The same is true for cases where you weren't properly served. Typically, the judge just tells the other party to refile and correct the problem. Criminal cases dismissed for lack of evidence will often be dismissed without prejudice so that the prosecutor can refile if new evidence arises (as long as the statute of limitations hasn't run)."
    },
    {
      "title": "Your record might still show the charges or the arrest, depending on state laws.",
      "content": "Your record might still show the charges or the arrest, depending on state laws. A dismissal is different from being found not guilty. If the case was dismissed without prejudice, meaning it might be re-opened, it will probably stay on your record. But even if it was dismissed with prejudice, the charge might still appear on your criminal record, depending on your state's laws. [17] X Research source Having a dismissed case on your record isn't necessarily a bad thing, since it shows the prosecution was unable to convict you of the crime. At the same time, anybody conducting a background check might ask you about it. It's also possible that the arrest will show up on your record, which can potentially be more damaging. In that situation, you might be able to get it expunged or get your record sealed, depending on the laws in your state. If a prosecutor declines to prosecute your criminal case, that's a little different from the case being dismissed. There typically wouldn't be anything on your record (other than possibly the arrest, if there was one) in that situation."
    }
  ]
}