{
  "url": "https://www.wikihow.com/Season-a-Wok",
  "title": "How to Season a Wok",
  "steps": [
    {
      "title": "Wash and dry the wok.",
      "content": "Wash and dry the wok. Use a sponge or cloth and wash the wok in hot, soapy water to remove machine oil, dirt, dust, and other grime. Rinse the wok under hot water. Pat it dry with a towel, and set it aside to air dry while you prepare your ingredients. Before you season the wok, it’s a good idea to ventilate your space. You'll be heating the wok to a high temperature, and it may let off smoke and fumes. Open a couple windows, and turn on your range fan or a standing fan. [1] X Research source"
    },
    {
      "title": "Preheat the wok.",
      "content": "Preheat the wok. Turn the heat on your stove burner to high and place the wok on the heat. Wait for 30 seconds, and then start dripping small amounts of water into the wok. When the wok is ready, the water will evaporate almost immediately on contact. [2] X Research source Some newer woks don’t allow the water to evaporate. If that’s the case with your wok, just preheat the wok for one minute."
    },
    {
      "title": "Add the oil.",
      "content": "Add the oil. Remove the wok from the heat and pour in the oil. Use the handles to hold the wok, and swirl the wok gently to distribute the oil evenly over its inside surface. Return the wok to the heat. The best types of oils or fats for wok seasoning include peanut, canola, grapeseed, palm, and lard. [3] X Research source"
    },
    {
      "title": "Cook the vegetables on a lower heat.",
      "content": "Cook the vegetables on a lower heat. Add the ginger and scallions to the wok and turn the heat down to medium. Cook the vegetables for 15 to 20 minutes, stirring regularly. As the scallions and ginger cook, use the back of a spoon to mash them against the sides of the wok so they release their flavors. [4] X Research source You can add another tablespoon (15 ml) of oil if the vegetables start to dry out during cooking."
    },
    {
      "title": "Remove the wok from the heat when the color changes.",
      "content": "Remove the wok from the heat when the color changes. As the wok heats up, the metal may start to become light brownish-yellow, possibly with some shades of blue and black. When this happens, remove the wok from the heat. If your wok doesn’t change color at all during the cooking process, remove it from the heat after 20 minutes. Not all woks will change color. [5] X Research source"
    },
    {
      "title": "Cool, rinse, and dry the wok.",
      "content": "Cool, rinse, and dry the wok. Remove the scallion and ginger from the wok and set it aside to cool. You can either discard the vegetables, or throw them into a soup or other savory dish. When the wok is cool enough to touch, rinse it under hot water and clean it with a sponge or cloth. Do not use soap, as this will remove the seasoning layer you just applied. [6] X Research source Dry the wok as best you can with a towel, and then place it on the stove over low heat. Allow the wok to warm up for about two minutes, until all the water has evaporated. This will ensure rust doesn’t form."
    },
    {
      "title": "Repeat as necessary.",
      "content": "Repeat as necessary. The more fatty foods and oil you cook in your wok, the better and more established the seasoning layer will become. You can re-season your wok anytime you like, especially if you feel it isn't as non-stick and flavorful as you'd like. Over time, your wok will develop a black patina, and this is an indication that it’s fully seasoned. [7] X Research source When your wok is still new, avoid cooking acidic foods in it until the seasoning layer is fully established. A carbon steel wok is the best because it conveys the most heat to the food. A cast iron pan would be a good substitute because it holds a lot of heat. It does not get hot and cool quickly. The same that you would want a carbon steel wok to do."
    },
    {
      "title": "Soak the wok.",
      "content": "Soak the wok. After cooking in your wok, set it aside to cool for a few minutes. When the wok is no longer hot to the touch, soak it in clean, hot water. You may only need to soak it for a few seconds, but for tough, baked on food, soak it for up to 30 minutes. [8] X Research source Use only clean and fresh water on your wok. Don’t use soaps, detergents, or other cleansers, as these can damage the seasoning. Don’t put a seasoned carbon steel wok in the dishwasher. Always wash it by hand."
    },
    {
      "title": "Scrub and rinse.",
      "content": "Scrub and rinse. When the wok has had time to soak, rub it with a clean, wet sponge to remove food particles. If necessary, give it a gentle scrub with the green side of a kitchen sponge or a scratch-free scrubber. Once you’ve removed all the food debris from the wok, rinse it under clean, hot water to remove any leftover particles. Don’t use scouring pads or abrasive scrubbers on a seasoned wok, as they will damage the seasoning."
    },
    {
      "title": "Dry the wok.",
      "content": "Dry the wok. Pat the wok dry with a clean kitchen towel. Transfer the wok to the stove and warm it over medium-low heat for a few minutes. When all the water has evaporated, remove the wok from the heat and set it aside to cool. [9] X Research source Drying the wok with heat is more reliable than with a towel, and will help prevent rust."
    },
    {
      "title": "Apply a layer of oil before storing.",
      "content": "Apply a layer of oil before storing. If you don’t use your wok every day, you can help protect the seasoning in between uses with a layer of oil. With a clean cloth or paper towel, coat the surface of the wok with a thin layer of cooking oil or shortening. [10] X Research source Wipe away excess oil with the cloth before storing the wok."
    },
    {
      "title": "Remove rust.",
      "content": "Remove rust. Pour some liquid dish soap onto the rusted area and scrub it with steel wool until the rust is gone. Rinse the wok under hot water to remove the soap and rust particles. Dry the wok with a towel, then heat it over medium-low heat until it’s completely dry. To re-season the wok, add some cooking oil or shortening to the warm wok. Swirl the oil around, then remove the wok from the heat. Use a cloth to rub the oil into the surface of the wok, and wipe away the excess before storing. Avoid using steel wool on your wok unless it’s to remove rust, because this removes the seasoning layer as well."
    },
    {
      "title": "Organize all your tools and supplies.",
      "content": "Organize all your tools and supplies. Cooking in a wok is done quickly and at high heat. This means you must have all your ingredients ready to go before you even turn on the heat, because you won’t have time for preparation once you start cooking. What you'll need to cook a basic stir fry in a wok are: [11] X Research source Cooking oil, such as peanut, canola, or grapeseed Aromatics, such as diced onion, garlic, and chilies Protein, such as meat, seafood, or tofu, cut into bite-sized pieces Vegetables, cut into bite-sized pieces Sauces and liquids, such as wine, rice wine vinegar, soy sauce, broth, or coconut oil Garnish, such as green onions, toasted spices, or nuts A spatula, serving plates or bowls, and eating utensils"
    },
    {
      "title": "Preheat the wok.",
      "content": "Preheat the wok. Place a dry wok on the stove over high heat. After 30 seconds, sprinkle some water into the wok and see if it evaporates immediately. When the water evaporates within a second or two, the wok is ready for oil. If the water doesn’t evaporate at all, preheat the wok for a minute before adding oil."
    },
    {
      "title": "Add oil and aromatics.",
      "content": "Add oil and aromatics. Pour the oil into the hot wok by drizzling it down the sides. Use the handles to pick up the wok, and swirl it around to distribute the oil. Add in your aromatics, such as minced garlic and diced onions. Once the ingredients have been added, stir to coat the aromatics in the oil. Cook for 30 seconds to a minute to let the flavors permeate the wok."
    },
    {
      "title": "Add your protein.",
      "content": "Add your protein. Add up to one pound (454 g) of meat, seafood, or tofu to the wok at a time. This will ensure the protein browns evenly. If you have more protein than one pound, cook it in batches. [12] X Research source When the protein is about three-quarters cooked, transfer it to a plate, leaving the wok on the heat."
    },
    {
      "title": "Cook the vegetables.",
      "content": "Cook the vegetables. Add the vegetables to the wok and start stirring immediately. Slide your spatula underneath the veggies and use the spatula to lift the vegetables and tumble them on top of themselves. To prevent burning, continue flipping the vegetables in this way continuously. To ensure your vegetables don’t get under or overcooked, add longer cooking vegetables, such as broccoli and carrots, to the wok first. As they start to cook through, add vegetables that require less time, like peppers and mushrooms."
    },
    {
      "title": "Combine all the ingredients and deglaze the wok.",
      "content": "Combine all the ingredients and deglaze the wok. Return the protein to the wok to complete the cooking process. Then, add your liquid to help remove flavors and stuck-on food from the wok, and to add balancing flavors to the dish. Add enough liquid to coat the food, but not enough to drown it."
    },
    {
      "title": "Garnish and serve.",
      "content": "Garnish and serve. When the proteins and vegetables are fully cooked and the liquid is heated through, remove the wok from the heat and immediately portion out the food to individual bowls or plates. Top with garnish and serve."
    }
  ]
}