{
  "url": "https://www.wikihow.com/Pipette",
  "title": "How to Pipette",
  "steps": [
    {
      "title": "Use pipettes to accurately measure small volumes of liquid.",
      "content": "Use pipettes to accurately measure small volumes of liquid. Pipettes function as tiny straws that suck up a liquid into the vacuum of its internal holding space. If you wish to extract a very precise, yet small, volume of liquid, a pipette is the tool you’ll likely use. [1] X Research source Make sure to always draw up solutions out of a clean beaker, rather than the stock supply. This prevents any possibilities for contamination."
    },
    {
      "title": "Keep the pipette tip away from the bottom of the vessel.",
      "content": "Keep the pipette tip away from the bottom of the vessel. When you want to draw up a volume of liquid into the pipette, make sure you keep the tip of the pipette elevated away from the bottom. Otherwise, you might cause a seal to occur, which can create air bubbles. [2] X Research source Air bubbles can cause your measurement readings to become less accurate."
    },
    {
      "title": "Draw up liquid with the reverse pipetting technique.",
      "content": "Draw up liquid with the reverse pipetting technique. This method is only possible with air displacement pipettes. They draw up the liquid and disperse with any air bubbles or other forms of aspiration and is especially effective for drawing up and dispersing foamy or viscous liquid samples. [3] X Research source First, depress the plunger button to the first stop position. Next, immerse the tip of the pipette into the desired liquid and release the plunger button in a smooth motion. This will draw up the liquid into the pipette’s receiving vessel. Pushing the plunger only to the first stop will ensure you are drawing up the amount of liquid displayed on the pipette."
    },
    {
      "title": "Release liquid with the reverse pipetting technique.",
      "content": "Release liquid with the reverse pipetting technique. Once you’ve drawn up the liquid, you’ll need to depress the plunger to the first stop and then continue through to the second stop. This will ensure that all the liquid in the pipette tip is expelled. [4] X Research source This will force the liquid out of the pipette while retaining any air bubbles that could impact the measurement."
    },
    {
      "title": "Disperse volumes of liquid with pipettes.",
      "content": "Disperse volumes of liquid with pipettes. Pipettes are often used in labs—such as chemistry, biology, or medical labs—to transport precise quantities of liquids or other soluble materials. There are various types of pipettes, both manual and mechanical, that can measure out a volume of some liquid and transport it to another location for distribution. Typically, these transported volumes are added to other liquids during experiments, production, or medical tests."
    },
    {
      "title": "Measure volumes accurately.",
      "content": "Measure volumes accurately. Since pipettes are intended for use with smaller volumes, they are typically very accurate when it comes to measuring these small amounts of liquid. Both manual and mechanical pipettes are known for their accuracy when it comes to measurements. [5] X Research source Accuracy is crucial in most laboratory settings, so pipettes are a good choice for scientists and researchers to use."
    },
    {
      "title": "Use the forward pipetting technique.",
      "content": "Use the forward pipetting technique. This technique is most commonly used to expel an exact volume of liquid from the pipette. Mastering the technique means that you will be able to repeat the procedure with exactly replicated results each time. First, depress the pipette plunger and immerse the tip into the desired liquid. Be sure to keep the pipette in a vertical position, then release the plunger."
    },
    {
      "title": "Disperse the liquid with the forward pipetting technique.",
      "content": "Disperse the liquid with the forward pipetting technique. Depress the pipette plunger to the first stop so that liquid is drawn up into the receiving vessel. Then you’ll need to depress the pipette button a second time to the second full stop in order to expel the desired amount of liquid from the pipette tip. [6] X Research source Following these instructions will give you an exact measurement of the liquid you’re trying to move."
    },
    {
      "title": "Clean the outside with mild soap.",
      "content": "Clean the outside with mild soap. Rinse off the exterior of the pipette with water and apply some mild soap or detergent. Rinse the soap off with running water, then use a clean cloth or paper towel to wipe off any remaining residue. You may also wipe down the exterior of the pipette with rubbing alcohol."
    },
    {
      "title": "Clean the interior with distilled water and alcohol.",
      "content": "Clean the interior with distilled water and alcohol. If possible (depending on the type of pipette being used), disassemble the pipette and clean the interior. Rinse all the disassembled parts in distilled water, then soak each part in 10% isopropyl alcohol. This will help remove any contaminants that may be contained inside. [7] X Research source Follow all instructions for disassembly from the pipette manufacturer."
    },
    {
      "title": "Use a strong detergent to rinse off radioactive substances.",
      "content": "Use a strong detergent to rinse off radioactive substances. For any radioactive substances, you should rinse the pipette with a strong detergent like Deconex. After, try rinsing the pipette again several times with distilled water. Make sure that you allow the pipette to fully air dry before you begin using it again."
    },
    {
      "title": "Boil pipette pieces and rinse them with water to remove nucleic acids.",
      "content": "Boil pipette pieces and rinse them with water to remove nucleic acids. For nucleic acids, you should boil the pipette pieces in glycine/HCl buffer for ten minutes. Then rinse the pipette pieces with distilled water, rather than using alcohol to clean them. You should be able to purchase some glycine/HCl buffer online from a medical supply store. [8] X Research source"
    },
    {
      "title": "Use a strong detergent solution to rinse off protein particles.",
      "content": "Use a strong detergent solution to rinse off protein particles. For proteins, you should rinse the contaminated pieces with a strong detergent solution, not alcohol. Then rinse the pipette pieces with distilled water. [9] X Research source Using alcohol to cleanse protein particles will set the proteins and make them impossible to remove later. This could also end up affecting your measuring accuracy and contaminating future liquids."
    },
    {
      "title": "Allow to fully air dry before reusing.",
      "content": "Allow to fully air dry before reusing. Once you have finished cleaning your pipette, you should let it completely air dry before reassembling and using it again. If you don’t, your volume measurements could be off, even if just minutely, from the leftover liquid inside. [10] X Research source It may take several hours for a pipette to air dry completely."
    }
  ]
}