{
  "url": "https://www.wikihow.com/Run-up-a-Wall-and-Flip",
  "title": "How to Run up a Wall and Flip",
  "steps": [
    {
      "title": "Conquer prerequisite aerobatic moves.",
      "content": "Conquer prerequisite aerobatic moves. Before you try doing a wall flip, it’s important to know some basic flip moves in order to have a foundational knowledge and comfort in the movements your body needs to do to execute a wall flip. [1] X Research source Some of these foundational prerequisite moves include a standing back tuck, a back handspring, a front flip, and even a side flip. [2] X Research source While you begin learning how to do a wall flip, it’s a good idea to practice with soft landing tumbling mats or grass, and have a qualified spotter there to help you with your flip. [3] X Research source"
    },
    {
      "title": "Run toward the wall.",
      "content": "Run toward the wall. Run or jog toward the wall you plan to flip from. Your chosen wall should have a relatively rough surface so your shoes can grip onto the wall. [4] X Research source A common misconception is that you need to sprint toward the wall to get enough power to do your flip. However, too much momentum going forward, toward the wall, will make it harder to transition your power into the upward movement needed to complete the flip. [5] X Research source When you run toward the wall, you want your non-dominant foot to remain on the ground when your dominant foot pulls up to plant on the wall. Your non-dominant foot should be about 12”- 24” away from the base of the wall. Practice running toward the wall a few times in order to gauge how far back you need to start, how quickly you need run, and where you need to position yourself to have your feet land where they need to be. It may help to initially begin practicing walls flip on an obtuse angled wall, angled away from you. [6] X Research source The angle of the wall will help your foot grip and plant on the wall, making your back flip a little bit easier."
    },
    {
      "title": "Incorporate your arm swing.",
      "content": "Incorporate your arm swing. As you go to take the last step of your run up toward the wall, swing your arms back behind you. [7] X Research source The next sequence would be to plant your dominant foot on the wall, but before you get there, you should know the general movement of your arms so you can do the movements all together in the correct order. When you plant your dominant foot on the wall, swing your arms forward toward the wall. When your arms come across the sides of your body, bend your elbows to swing your arms in a double upper cut formation. [8] X Research source Your arms should look like you are doing a chin up on an invisible bar. If you try to do a full arm swing with your arms completely extended out in front of you, you run the risk of punching the wall as you plant your foot on the wall. [9] X Research source Also, if your arms are extended, it will slow down your spin as you try to flip off the wall."
    },
    {
      "title": "Plant your dominant foot on the wall.",
      "content": "Plant your dominant foot on the wall. Jump off your non-dominant leg on the ground, and plant the ball of your dominant foot on the wall at about the height of your hip. [10] X Research source [11] X Research source When you bring your foot up to the wall, keep your shin straight and vertical. [12] X Research source This will ensure that when you push off your planted foot, you jump vertically up the wall rather than horizontally off the wall. If you lean in too much when you plant your foot, and your shin is slanted toward the wall, you will lose your gripping on the wall and your foot will slide down. [13] X Research source"
    },
    {
      "title": "Push off the wall.",
      "content": "Push off the wall. Push and jump up with your dominant foot that’s already planted on the wall. Along with jumping from your non-dominant foot, this will give you two sources of vertical momentum. [14] X Research source As you push up on the wall with your dominant foot, your body will rise vertically, but also move away from the wall horizontally and diagonally. [15] X Research source Your planted dominant foot should propel you upward as if you are climbing up the wall. This will give you the needed height to properly perform the wall flip. From this point in midair, you will then begin to transition into rotating backward."
    },
    {
      "title": "Drive your knee to start rotating backward.",
      "content": "Drive your knee to start rotating backward. Once you are up in the air and start to move back away from the wall, swing and drive your non-dominant leg’s knee up to your body to begin the rotation in your flip. [16] X Research source The momentum from you swinging your knee will initiate the backward rotation. Keep your head, arms, and legs tucked tight into your body, like a ball. [17] X Research source Keeping your body tucked tight will help you complete a full rotation in your flip. Don’t throw your head back to initiation your flip rotation. This will open up and extend your body, which will slow down your flip and cause you to land incorrectly. [18] X Research source To help keep your head tucked in, try pick a spot on the wall and hold your gaze there for as long as you can before you start to flip."
    },
    {
      "title": "Tuck your knees.",
      "content": "Tuck your knees. As you drive your non-dominant leg’s knee up to your body, your dominant foot that was planted on the wall is going to release from the wall. The knee you are driving up will begin to spin your body. As you start to rotate, pull both of your knees into your body to create a tight ball. [19] X Research source At this point, you can even use your hands to hold onto your knees as you spin. [20] X Research source Again, tight body posture will help make a clean, controlled flip. If you keep your body open and arch your back (by throwing back your head) you’re going to flip a lot slower, and you might land at an awkward and dangerous angle. Tucking your knees will help ensure that when you complete your flip, you will land evenly on both of your feet."
    },
    {
      "title": "Land your flip.",
      "content": "Land your flip. As you flip and see the ground underneath you, open up your body. [21] X Research source Bring your arms out from the center of your body and push your knees down toward the ground. [22] X Research source You want to try and land on the balls of your feet. If you extend your legs out straight, you will end up landing on your heels and lose balance, causing you to fall on your buttocks. [23] X Research source"
    },
    {
      "title": "Conquer prerequisite aerobatic moves.",
      "content": "Conquer prerequisite aerobatic moves. Just like the one-legged wall flip, it will be a lot easier to execute a two-step wall flip if you already know some basic acrobatic and gymnastic flips. A back handspring, a back tuck, and even a front tuck will all help you recognize the leg and arm movements needed to safely execute a wall flip. [24] X Research source As always, when first practicing a wall flip, use some soft tumbling mats and a trained and qualified spotter to help keep you from injuring yourself as you flip. [25] X Research source"
    },
    {
      "title": "Run toward the wall.",
      "content": "Run toward the wall. Run up to the wall a bit faster than you did for the one-legged wall flip. [26] X Research source With a two-step wall flip, deciding which foot to start your steps with lies more with personal preference rather than a clear cut right or left step. [27] X Research source For example, if you are a righty, your right foot will be your dominant foot. You may want to take your first step using your right foot so you can get a lot of height in your first jump up the wall. [28] X Research source However, you may want to take your first step with your left foot, so your dominant foot can push off the wall and provide better control in your flip. [29] X Research source It all depends on what’s more comfortable for you. As you run to the wall, you should pump your arms like you’re sprinting, rather than swinging your arms from behind and up as you did in the one-legged wall flip. [30] X Research source In order to figure out what will be most comfortable for you, practice running at the wall and using both your right and left foot as your first step."
    },
    {
      "title": "Plant your first step foot on the wall.",
      "content": "Plant your first step foot on the wall. With the one-legged wall flip, incorporating your arm swing was a lot more important, since you needed that extra momentum for the quick flip off the wall. With the two step wall flip, your first step is going to give you the vertical height to perform your flip a bit slower, where you don’t need as much added height momentum from your arms. Jump off of your ground foot, and plant your other foot on the wall at about hip height. [31] X Research source As you push up and off of your planted foot, fully extend your leg and keep your chest straight and vertical. [32] X Research source Extending your leg is going to give you maximum height for your flip. Be sure to keep your upper body straight and as close to the wall as possible, until you can plant your other foot."
    },
    {
      "title": "Plant your second foot.",
      "content": "Plant your second foot. Once your first planted foot is fully extended, reach up and plant your other foot onto the wall. [33] X Research source Your second planted foot will be higher up on the wall because of your first step jump up and onto the wall. At this point, no longer try to keep your upper body vertical, allow the extension and push of your second foot to push you away from the wall. [34] X Research source"
    },
    {
      "title": "Initiate the back flip.",
      "content": "Initiate the back flip. As you push off the wall with your second planted foot, begin to lean backward, and push off and away from the wall with your foot. [35] X Research source Then, drive and swing your first step knee up, toward your chest to initiate the rotation to your flip. Bring your other leg’s knee up, to follow your swung first step knee and throw yourself further into the flip."
    },
    {
      "title": "Landing the flip.",
      "content": "Landing the flip. Because you have the added height, you don’t need to completely tuck your knees and keep your body in a tight ball. If fact, if you rotate too quickly (by tucking your knees in tightly), you may over rotate and end up landing on your back. [36] X Research source If you already have your basic back flips down, you can rely on those landing techniques to land this wall flip. [37] X Research source Experiment with the speed that you open up and lay out in order to get a clean landing."
    }
  ]
}