{
  "url": "https://www.wikihow.com/Scat",
  "title": "How to Scat",
  "steps": [
    {
      "title": "Use improvised syllables and sounds to scat over instrumental tracks.",
      "content": "Use improvised syllables and sounds to scat over instrumental tracks. Scatting is the act of turning your voice into improvisation instrument, removing real words and just focusing on noise, melody, sound, and tone. As such, everyone can scat immediately, even if it feels weird or uncomfortable. Just start making noises that sound great over the song your hearing. Listen to some classic scat singers for early inspiration. \"Perdido\" by Sarah Vaughan, \"Them There Eyes\" by Ella Fitzgerald, and Louis Armstrong's \"Heebie Jeebies\" are all incredible early examples. Scatting is generally a jazz skill, but artists like Scatman and Bobby McFerrin have expanded it to other genres in modern times."
    },
    {
      "title": "Practice \"call and responses\" with scat singers and instrumental lines.",
      "content": "Practice \"call and responses\" with scat singers and instrumental lines. You need to get used to your voice not as a speaking mechanism but as an instrument. As you first start, limit yourself to copying your favorite singers. Play a couple bars of scat singing, then try to repeat it back verbatim to start learning sounds, tricks, and melody construction. The blues, with simple chords and built-in call and response, is a great place for beginners to begin. Try out \"Centerpiece\" by Lambert, Hendricks & Ross. Try mimicking actual sung lyrics, but don't use the words. Practice capturing the singer's melody with random syllables instead of words to get used to scat. As you improve, start copying guitar, horn, and other lines with your mouth, using whatever syllables come to mind to replicate the sound. There is no noise, when scatting, that is off limits!"
    },
    {
      "title": "Start with simple, rhythmic syllables, focusing on melody instead of new sounds.",
      "content": "Start with simple, rhythmic syllables, focusing on melody instead of new sounds. As you begin improvising your own scatted lines, start with a couple of \"accepted\" scat words and syllables. Simple, percussive noises are the easiest way to start, using sounds like \"bob,\" \"beep,\" \"ski,\" \"do,\" etc. Remember that you're not trying to say anything. You're playing with musical notes, not words. [1] X Research source The musical scale made famous in \"The Sound of Music\" is a great place to start: do, rey, mi, fah, soh, la, ti, do!"
    },
    {
      "title": "Accent, modulate, and have fun with your syllables.",
      "content": "Accent, modulate, and have fun with your syllables. Scatting is about using your whole body to make noises and sounds, improvising more than just syllables. As you improve and get more and more used to scatting, start playing with the following variables to expand your musical vocabulary as you sing. Volume -- draw the audience in by going quieter, then build back up to a louder crescendo with bigger, louder syllables. Tone -- how do you sound with you chin tucked in? You chest puffed out? How does the shape of your mouth change the sound of your singing? Pitch -- perhaps the most important, pitch is how high or low your notes go. As you get used to making up syllables on the spot, start working on varying pitch with each word. Songs get boring when they stay in the same pitch for too long -- give some melodic variety."
    },
    {
      "title": "Practice with a metronome or an instrumental track to ensure you stay on time.",
      "content": "Practice with a metronome or an instrumental track to ensure you stay on time. Scatting is an intensely rhythmic art form -- you voice is both percussive (like a drum) and melodic (like a trumpet, piano, etc.). As such, you must be able to stay in time while you improvise, holding to the beat like any other instrument. While good singers should already feel comfortable with this, newbies must practice with a metronome or backing track to get used to staying on time at all times. Always start at a speed you can keep up with comfortably. While you can set any rhythm you want, most scat is over a 3/4 \"swing feel\" of jazz. That said, practicing improvising syllables on the spot without music or metronome is still a valuable skill. You just need to train your ear so that you can snap to a backing band when the chance arises. [2] X Research source"
    },
    {
      "title": "Introduce a little rhythmic variety with duplets and triplets.",
      "content": "Introduce a little rhythmic variety with duplets and triplets. Once you feel comfortable with straightforward rhythms, it is time to start playing with shorter, but more complex, phrases. Duplets are simply two sounds thrown quickly together (\"da-DA!\"), and triplets are three sounds (\"BEEP-da-BOP\"). Instead of using straight quarter notes, where you have one sound per beat (1, 2, 3, 4), start stringing together these other phrases, leaving spaces in between them for a bouncy, swinging feel. Hold some notes for three beats, cram 10 notes into two beats, and then leave some silence before launching back in. Rhythmic variety is about playing with the beat to create tension and surprise. Alternating different types of rhythms is a great way to craft a complex, enjoyable scat solo without crazy notes or vocal range. Check out both Louis Armstrong and Ella Fitzgerald, for example, on \"Stomping at the Savoy\" for a master class in rhythmic variation."
    },
    {
      "title": "Get a little swing behind your scatting.",
      "content": "Get a little swing behind your scatting. An extension of rhythmic variation, this is when you transcend the \"written\" rhythm and get into the song with improvisational fervor. Most scatting is over a swing feel, where the 2nd and 4th beats are emphasized. Think of counting out your \"1 and, 2 and , 3 and, 4 and \" with a little extra emphasis on these two beats. If you're going to hit a high note, or pause and come back in, make it on the swinging beats. [3] X Research source"
    },
    {
      "title": "Learn the chord progressions to improvise like a jazz singer.",
      "content": "Learn the chord progressions to improvise like a jazz singer. Great scat singers, like any great soloist or musician, are locked into the underlying chords and melody of the song they sing over. They know when chord changes are coming, and adjust their melody right in time with the rest of the band. Listen to the song several times until the chords' feel natural, and you know exactly what your band is doing behind you. If you're hoping to play professionally, there are a few progressions you should know: 12-Bar Blues -- the most common progression in Western Music. No matter what the key, the chords will always change in the same order, meaning you can quickly scat to any 12-bar blues once you know the form. I Got Rhythm -- known as the most covered chord progression in jazz, these changes are found in hundreds of songs, including popular music. Listen to versions from Duke Ellington to Django Reinhardt [4] X Research source"
    },
    {
      "title": "Scat through your vocal solos to bridge classical singing and scatting.",
      "content": "Scat through your vocal solos to bridge classical singing and scatting. If you are classically trained, there is no reason to abandon your skills just to start scatting. Run through your exercises, scales, and warm-ups with improvised syllables and sounds, and start putting your vocal scales to music. As a warm up, read music but ignore the lyrics, trying to sound out just the notes of vocal, brass, and woodwind sheet music."
    },
    {
      "title": "Get a little weird with tone, voice, and coloring.",
      "content": "Get a little weird with tone, voice, and coloring. Listen to Ella Fitzgerald closing out \"Tenderly,\" a dear, calm, and loving song, with a deep and almost monstrous scat sound. And yet, it fits, complementing her smooth tone with an unexpected burst of passion and power. Scatting isn't about sounding \"human.\" So, the further you can modulate and adjust your voice to sound more instrumental the better scat singer you'll become."
    }
  ]
}