{
  "url": "https://www.wikihow.com/Sing-Falsetto",
  "title": "How to Sing Falsetto",
  "steps": [
    {
      "title": "Do sirens from the top of your register.",
      "content": "Do sirens from the top of your register. The falsetto \"register\" (though it's more of a muscle placement than a register) lies at the top of your range. It's a different type of voice that can be found by experimenting with high-pitched sirens – that's when you mimic a siren on an \"ooh\" sound just like a fire engine or a police car. Do them from the top of your register; not to the top of your register. Start as high as can – that should be your falsetto. It doesn't matter if it sounds good, it just has to be a legitimate note."
    },
    {
      "title": "Go into your little boy voice.",
      "content": "Go into your little boy voice. Many voice teachers tell their male students to start talking in their \"little boy\" voice. Talk like you're three or four years old – can you hear the difference? Can you feel the difference? It should feel more up and back, in the sinuses (or mask) of your face. If that doesn't work, try imitating a woman's voice. You'll likely take on a breathy, airy tone, vaguely reminiscent of Marilyn Monroe. This is likely your falsetto. It's possible you're going into head voice, which is different. That voice will sound a little stronger and a little more like Minnie Mouse. If this sounds accurate, try finding a register that you can't feel in your throat – many singers speak of feeling a \"muscle relief\" with falsetto."
    },
    {
      "title": "Keep it quiet.",
      "content": "Keep it quiet. Unless you're the next Pavarotti, you probably won't be able to produce much sound with falsetto anyway. So when you go to find it, don't push yourself (and definitely don't use your throat). Keep it quiet. You're Marilyn Monroe talking in a hushed voice, not Miley Cyrus screaming at the top of her lungs. [2] X Research source You may find that if you try to sing louder, you'll fall into head voice. Does the resonance of your voice change? Do you start to feel it in your body? Then you're not singing in falsetto anymore."
    },
    {
      "title": "Sing on \"eee\" or \"oooh.\"",
      "content": "Sing on \"eee\" or \"oooh.\" Because of the way the throat and vocal folds are constructed, \"aaa\" and \"aayyy\" do not work well for finding falsetto. \"Eee\" and \"oooh\" are much more conducive to getting the sound up and into your mask and letting your vocal folds go. On this vowel, slide around from top to bottom. Do you hear how the timbre of your voice changes? When it gets really light towards the top and you feel fewer vibrations internally, that's your falsetto."
    },
    {
      "title": "Feel the placement in your sinuses and forehead.",
      "content": "Feel the placement in your sinuses and forehead. Think of the tone you're producing as an elevator within your body. When you produce a low note, it's deep within you, resonating in your core. When you produce a high note, as you do with falsetto, it's up in your forehead, coming out the top of your body. It's also a forward. If it's placed in the back of your mouth and subsequently in the back of your head, you'll have a very dark, muffled sound, which is no good for falsetto. Keep your tongue forward on the tip of your teeth and make sure it stays flat – if it's spatulated, it'll cover your sound."
    },
    {
      "title": "Open up your head.",
      "content": "Open up your head. If you've ever taken singing lessons, you're well aware that a lot of coaching is abstract metaphors that somehow make sense and improve your sound. One of them is to \"open up your head.\" It means just what it sounds like, and it likely works because it gets you focusing on producing sound up and forward, like in the above step. [3] X Research source Generally, you want to keep everything open. Singing should be a relaxing endeavor that involves no tension. To produce a good sound falsetto or otherwise, your centre should be open, your lungs need to be open, and your mouth needs to be open, too."
    },
    {
      "title": "Pull your falsetto down.",
      "content": "Pull your falsetto down. Once you find this \"register,\" experiment with pulling it down, or sliding down to lower notes. It's the type of voice that's mandatory at the top of your range, but optional toward the bottom. What kind of low notes can you produce that are a little more airy and feminine sounding? This will differ from person to person, singer to singer. If you've been relying on your \"chest voice\" or \"real voice\" for as long as you can remember, doing this will be difficult for your vocal folds – they're just not used to that kind of free vibration. But don't worry – if you keep practising regardless of how it sounds, it will get better. [4] X Research source"
    },
    {
      "title": "Don't concern yourself with your vibrato for right now.",
      "content": "Don't concern yourself with your vibrato for right now. For most untrained, no-professional singers, it's difficult to produce vibrato within the falsetto voice. This is because the vocal folds are barely touching, making it difficult to control the airflow going through your throat. If you can only sing on a straight tone in this voice, relax. That's normal. Once you get the hang of it, you can try using your vibrato with this voice, though be prepared for it to be difficult. You'll likely want to gravitate to your head voice – which is very similar, but different."
    },
    {
      "title": "Understand the physicality of using your falsetto.",
      "content": "Understand the physicality of using your falsetto. As mentioned previously, using your falsetto means your vocal folds are just barely touching. The air is passing through at an unimpeded rate, giving your voice that airy tone. At the top of your range, the folds are stretched to become longer by the action of the cricothyroid muscles while the thyro-arytenoid muscle remains still and motionless. Didn't know you were in for an anatomy lesson today, huh? [5] X Research source Walk up to the person who knows nothing about singing and they'll tell you it's something some people can do and something some people just can't. Walk up to someone who does it for a living, and they'll tell you that it's a conscious effort of placement and focus to get the sound just right – it's by no means something you can do correctly off the bat. Good singing is generally learnt. Everyone can do it, but somehow not everyone knows how."
    },
    {
      "title": "Remember to breathe and let go.",
      "content": "Remember to breathe and let go. When we breathe moment to moment, we don't think about it. But when we start singing, we start realizing that we have to ration it to get through the measures and sometimes we end up inadvertently holding it at certain pitches. Don't do this. Breathe fully and deeply into the bottom of your lungs and keep the air flowing. If you stop it, you either won't make a noise or you won't be in falsetto [6] X Research source . Always, always, always let go. Of everything. Loosen up, shake it out, and relax. Being tense and listening to your voice as it comes out of your mouth will only result in you holding your breath and not producing the best sound you're capable of. A lot of singing is actually in the mind – you are your only obstacle."
    },
    {
      "title": "Don't be concerned if it sounds weak or airy.",
      "content": "Don't be concerned if it sounds weak or airy. Plenty of people avoid their falsetto (or even head voice at times) because it sounds weak. It doesn't have that oomph that the chest voice does. This is normal. This can be a very good sound – you just have to get used to hearing it. Take a look at Broadway in the recent decades as compared to in the earlier parts of the 20th century and you'll see a huge movement toward belting, using chest voice. No voice is better than the other – but they do go in and out of style."
    },
    {
      "title": "Know that cracking is normal.",
      "content": "Know that cracking is normal. Every singer has a break (the passaggio), if not more than one. In futzing around with your different types of \"voices,\" you'll likely crack. Until you get super comfortable with the way your vocal folds are stretching and vibrating together, this is going to happen. Relax. Singing over your break is something that takes practice and diligence for many. With time and usage you can strengthen weaker areas of your vocal folds and correct old habits that have you jumping from one voice to the other and never bridging the two."
    },
    {
      "title": "Keep your larynx low.",
      "content": "Keep your larynx low. You know that little bit of your throat that moves up and down when you swallow? You can actually control that. Try it right now – take a look in the mirror and get your Adam's apple area to move downward. Can you keep it there while you sing? This opens up your throat, allowing air to flow through unobstructed. It also pulls your tongue flat and down, working to the same end. A high larynx (go on, try it) feels tight and taut, and sound is much harder to produce in this position. But don’t forcefully depress your tongue, as that is also strained. If your larynx is rising persistently and problematically, try a note that’s challenging for you during a genuine yawn. The yawn will overpower the swallowing reflex and allow you to feel unstrained. Keep holding the note out even after the yawn is over and try to get the resulting feeling of openness into your muscle memory."
    },
    {
      "title": "Keep practicing.",
      "content": "Keep practicing. Singing is a skill. Sure, lots of people have natural talent, but it's essentially body control – it all starts out involuntary until you train yourself to recognize it and make it do what you want. So keep practicing – you'll be in tune with your habits in time. It's a good idea to join a choir or get a vocal coach. If for some reason neither of those are available, even just watching videos on YouTube is a good start. What's more, plenty of voice teachers do online lessons if that works out better for your schedule."
    }
  ]
}