{
  "url": "https://www.wikihow.com/Read-Pants-Size",
  "title": "How to Read Pants Size",
  "steps": [
    {
      "title": "Locate the label on the waistband of the pants.",
      "content": "Locate the label on the waistband of the pants. Find the tag on the inside of the pants, which is usually located in the center of the waistband. If the tag isn’t on the waistband, check near the front button or look for a label woven into the waistband. [1] X Research source Some pants may have their information stitched into the waistband instead of printed on a label."
    },
    {
      "title": "Find the 2 sizing numbers listed on the tag.",
      "content": "Find the 2 sizing numbers listed on the tag. Scan the information on the tag and look for 2 numbers separated by an “x.” For example, you may find sizing numbers such as, “34x32” on the tag. If there multiple tags, look through each of them until you find the sizing numbers. [2] X Research source The numbers may be separated by a slash instead of an “x.” For instance, the sizing numbers could appear as “34/32.”"
    },
    {
      "title": "Use the first number to identify the waist size.",
      "content": "Use the first number to identify the waist size. Find the total circumference of the waist of the pants using the first of the sizing numbers. For example, if the first number is 34, then the waist size, or the circumference of the pants is 34 inches (86 cm). [3] X Research source Measure your pants size with a tape measure to find your measurements."
    },
    {
      "title": "Identify the length of the pants with the second number.",
      "content": "Identify the length of the pants with the second number. Take the second number in the series to find the length of the inseam, which is the length of the pants from the crotch down to the bottom of the leg. Use the length measurement to match the pants to the length of your leg. [4] X Research source"
    },
    {
      "title": "Consult a sizing chart if there aren’t measurements listed on the label.",
      "content": "Consult a sizing chart if there aren’t measurements listed on the label. Look at the label of the pants to see if there’s a size listing such as “Small” or “Large.” The sizes may also be abbreviated to read something like “S” for small or “M” for medium. There may also be a description of the length of the pants such as “Extra Short” or “Long.” Use a sizing chart to match the pants size to the measurements of the pants. [5] X Research source Men’s pants sizes can vary from country to country as well. For example, a US size “XS” is a size “28” in the UK."
    },
    {
      "title": "Look for a fit type on the tag to find out how the pants are cut.",
      "content": "Look for a fit type on the tag to find out how the pants are cut. Read the tag and look for descriptions such as “classic,” “skinny,” or “relaxed.” Use these descriptions to identify the fit type of the pants, which is the way they’ll fit onto you when you wear them. [6] X Research source For example, “skinny” pants will fit tightly around your legs, while “relaxed” pants will be looser. Additional examples of fit types include low rise, boot cut, casual, wide, and straight fit."
    },
    {
      "title": "Find the label on the waistline of the pants.",
      "content": "Find the label on the waistline of the pants. Check the center of the waistline for a tag with a description of the pants. The label may also be woven into the waistline or the information may be stitched into the fabric of the waistline. [7] X Research source Some women’s pants may have a label near the ankle or the button on the waistband."
    },
    {
      "title": "Identify the waist size and leg length using the sizing numbers.",
      "content": "Identify the waist size and leg length using the sizing numbers. Use the first number to find the waist size, or the circumference of the waist of the pants. Take the second number to identify the length of the pants from the inseam , or the top of the crotch area, to the bottom of the pants leg. For instance, if the label has a pants size of “26x32,” then the pants have a waist circumference of 26 inches (66 cm) and a leg length of 32 inches (81 cm). [8] X Research source The 2 sizing numbers may be separated by a slash (/) or even a plus sign (+) depending on the brand. It’s common for women’s pants to only include the waist size and not the length. For example, if you see a pair of pants that only includes a size such as “28,” then it’s referring to the waist size."
    },
    {
      "title": "Compare measurements to a size guide if the label doesn’t list them.",
      "content": "Compare measurements to a size guide if the label doesn’t list them. If the label of the pants doesn’t list the waist and length measurements, use a size guide to convert the measurements into the sizing system that the pants use. Women’s pants often have sizes that are unrelated to the actual measurements, such as 0, 2, 6, or 12. For instance, in the US, a waist size of 27 inches (69 cm) is a size “6.” Look online for a size guide you can reference or ask the store if they have one you can use. [9] X Research source Some pants may be sized using descriptors like Small or S, or Large or L. Use a size guide to find the size that corresponds to your measurements. Different countries use different size systems for their clothing. For example, a US size “6” is a size “10” in the UK and a size “38” in France."
    },
    {
      "title": "Read the cut description to see how the pants will fit when they’re worn.",
      "content": "Read the cut description to see how the pants will fit when they’re worn. Check the label for information about how the pants are cut to fit. Look for descriptions such as “Skinny fit” or “Boot cut” to see how the pants will fit when you wear them. Check for details about the waist fit as well, such as high-waisted or regular rise, which describes how the pants will fit on your waist. [10] X Research source Read the cut description in addition to the sizing information."
    }
  ]
}