{
  "url": "https://www.wikihow.com/Say-Boyfriend-in-French",
  "title": "French Phrases to Call Your Boyfriend",
  "steps": [
    {
      "title": "Use \"copain\" to talk about your boyfriend.",
      "content": "Use \" copain \" to talk about your boyfriend. The most modern word for a boyfriend, someone who you are romantically involved with, is \"copain.\" It is pronounced \"co-pahn,\" where the \"n\" is almost silent. [1] X Research source It sounds like the famous classical composer Frédéric Chopin. You can put the word \"petit\" (\"peh-teet\") before copain to make it slightly more endearing."
    },
    {
      "title": "Use \"petit ami\" to refer to your boyfriend in a slightly cutesier way..",
      "content": "Use \" petit ami \" to refer to your boyfriend in a slightly cutesier way.. While this translates literally as \"little friend,\" it is commonly used to refer to your boyfriend in French. It is pronounced \"peh-teet ah-me.\" If it helps, remember that \"petit\" rhymes with the English \"repeat\" and \"ami\" rhymes (though only slightly) with the English name \"Tommy.\" [2] X Research source The words are often said closely together so that they sound like one word. You do pronounce the \"t\" at the end of \"petit,\" because the next word starts with a vowel."
    },
    {
      "title": "Use \"cheri\" to refer to your \"darling\" or boyfriend in an extra affectionate light.",
      "content": "Use \" cheri \" to refer to your \"darling\" or boyfriend in an extra affectionate light. In general, the phrase \"mon cheri\" is a very affectionate, usually private term used for your boyfriend. It is pronounced \"sherr-EE,\" much like the English drink \"sherry.\" Note how your voice, however, should rise slightly on the last \"ee\" syllable. [3] X Research source"
    },
    {
      "title": "Mix and match a variety of slang terms to talk endearingly about your boyfriend.",
      "content": "Mix and match a variety of slang terms to talk endearingly about your boyfriend. There are several other terms for your man that can be swapped around in informal context. Most of the following are not so familiar that they would gross out your friends, but not so loose that you should be using them all the time and in public: Mec : Pronounced \"meck,\" this translates best to \"guy\" or \"bloke.\" \"Mon mec\" is used for boyfriends, as in \"my guy.\" Jules : Pronounced \"jool.\" Another slang term for a guy or boyfriend. Flirt : Pronounced similarly to English. While it means \"flirting\" directly, it can also be used colloquially for a boyfriend. Amoureux : Pronounced \"am-or-euh.\" Used in a variety of contexts, all generally colloquial. When used as an adjective, it means \"loving\" or \"romantic.\" [4] X Research source"
    },
    {
      "title": "Use the slang \"un chum\" to talk about a boyfriend in Quebec.",
      "content": "Use the slang \" un chum \" to talk about a boyfriend in Quebec. Quebecois French has evolved over the years in North America. While the other expressions will still make sense, you can use the slang \"un chum,\" pronounced \"tch-UH-m\" when in eastern Canada. The slang term for a girlfriend is not, \"une chume,\" but rather \"une blonde.\""
    },
    {
      "title": "Tell someone \"he is my boyfriend\" with \"il est mon copain.",
      "content": "Tell someone \"he is my boyfriend\" with \" il est mon copain. \" The translation is nearly perfect, word for word. You can, of course, substitute in any word or slang for \"copain\" that you want. It is pronounced, \"eel eht mon co-pahn.\""
    },
    {
      "title": "Ask guys to be your boyfriend with \"Veux-tu être mon petit-ami?",
      "content": "Ask guys to be your boyfriend with \" Veux-tu être mon petit-ami? \" You can also substitute any of the other words, like \"copain\" for petit-ami. This translates literally as \"Do you want to be my boyfriend?\" It is pronounced \"Vuh-too eht-ra mon peh-teet ah-me.\" [5] X Research source You can also use the simple, \"will you go out with me, or \" Veux-tu sortir avec moi? \" The second half is pronounced \"sor-teer a-veck moi.\""
    },
    {
      "title": "Ask if someone is single with \"Tu as un [petit] copain?",
      "content": "Ask if someone is single with \" Tu as un [petit] copain? \" This is simply asking if they have a boyfriend. You could also ask \"Est-tu libre?\" which literally translates as \"are you free?\" \"Libre\" is pronounced \"lee-bre.\" [6] X Research source"
    },
    {
      "title": "Tell your boyfriend you love him with \"Je t'aime.",
      "content": "Tell your boyfriend you love him with \" Je t'aime. \" This simple phrase simply means \"I love you,\" though it could technically also translate into \"I like you.\" [7] X Research source It is pronounced \"Juh t-ehm,\" with the final syllable sounding somewhat like the letter \"M.\""
    },
    {
      "title": "Ask for marriage with \"Veux-tu m'épouser?",
      "content": "Ask for marriage with \" Veux-tu m'épouser? \" \"Epouser\" is pronounced \"eh-poos-eh.\" Switch to \"fiancé\" once you get engaged. Fiancé is actually a French word already, so no translation is needed [8] X Research source"
    }
  ]
}