{
  "url": "https://www.wikihow.com/Plan-a-Presentation",
  "title": "How to Plan a Presentation",
  "steps": [
    {
      "title": "Think about the goal of your presentation.",
      "content": "Think about the goal of your presentation. You should always begin with the end in mind when it comes to planning a presentation. Think about what you're trying to convey, and the best means to do so in the time you have. Write down your most important points. See if you notice a key point emerging. If your audience were to take away one thing from this presentation, what would it be? Don't just bombard your audience with facts. Think about what these facts do for your audience. What's the point you're trying to make with the information?"
    },
    {
      "title": "Know your audience's background to help you structure your presentation.",
      "content": "Know your audience's background to help you structure your presentation. If your topic isn't common knowledge, then you'll need to include that information in your presentation and ensure that you have enough time for it. You should also consider what your audience expects from the presentation. For example: [1] X Research source Are you trying to sell them a product, introduce them to a new idea, alter their way of thinking? Think about the kind of people in your audience. Do you have a tougher crowd, or do you have a group of enthusiastic people excited about what you're going to say?"
    },
    {
      "title": "Select your main points based on the length of your presentation.",
      "content": "Select your main points based on the length of your presentation. Ask yourself what statements, facts, and points best illustrate the theme of your presentation. A 10-minute presentation, for example, should include no more than 3 points. You should also consider the way the points relate to one another, and be prepared to discuss them in a logical, cohesive fashion. Not all points will relate to one another. [2] X Research source For example, if you're talking to a company about recycling program, you might discuss how corporate pollution contributes to global warming and how recycling can help the company save money. You wouldn't discuss the melting ice caps as a key point. Melting ice caps are a valid concern, but they are a fact or a supporting point."
    },
    {
      "title": "Find your best-supporting information.",
      "content": "Find your best-supporting information. Comb through the research you are presenting. Look for your most solid supporting information. This should be the information that will really get the audience thinking, and can inspire change. Supporting information should do three things: [3] X Research source Add clarity to your argument by explaining anything the audience may not understand. For example: a brief overview of pollution's effect on climate change. Add authority by making connections with existing research, studies, and information. For example, you could mention the consensus in the scientific community that global warming is manmade and cite a few studies. Add color to your argument through visuals, like pictures and videos. For instance, you could show a chart of the amount of waste an average corporation produces in one month."
    },
    {
      "title": "Start your presentation with a solid introduction.",
      "content": "Start your presentation with a solid introduction. Once you've assembled your information, you can get started on outlining your presentation. A presentation must start with a solid introduction that grabs the audience's attention. [4] X Research source Include the basics of introducing yourself. You can say something like, \"I'm Clara Thompson from Clean Water Action, and I would like to address your company today.\" Get your audience's attention with a question or a fact. For example, you could ask: \"Have you ever passed a body of water covered in green sludge and wondered how this happened? The answer may surprise you.\" You don’t have to write your presentation in chronological order. If you want to work on your main points first and save the introduction for last, you can."
    },
    {
      "title": "Present your research and work in the body of the presentation.",
      "content": "Present your research and work in the body of the presentation. Your body should make up about 60 to 70% of your presentation, so put all your best points here. Think of your body as the path to your point. Therefore, you want to find a way to present the information in a logical fashion. Start with the problem, talk about the consequences, and offer a solution. For example, you're trying to get the corporation to alter their recycling program. Start by overviewing the vast amount of corporate pollution in the world. Explain the consequences of this. Show how pollution contributes to climate change, then show what the corporation can do through changes in their policies."
    },
    {
      "title": "Use linking statements to make your points clear.",
      "content": "Use linking statements to make your points clear. Linking statements are transitional statements that help bridge the gap between ideas. This signals to your audience you're going to switch topics, so your presentation doesn't get confusing. [5] X Research source Common linking statements include things like, \"Another important issue...,\" \"Based on this data, you can now see...\" and, \"This brings me to my main point...\" For example, \"Now that I've shown you the effects of corporate pollution, this brings me to my main point. What can you do to stop it?\""
    },
    {
      "title": "Make use of visuals and graphics on your slides.",
      "content": "Make use of visuals and graphics on your slides. Your audience may get bored with data and lecturing. It's a good idea to add graphics to your slides to shake things up. A short video may also help. If you have any graphs or diagrams that will help illustrate your point, use them. Physically seeing information can help make your point more clear. You should also see if there are any videos you can include. A brief video of someone succinctly explaining an issue can shake things up a bit. Pictures are also nice. Each slide should have a picture related to the topic at hand. Make sure not to overuse graphics or visuals. Too many could be overwhelming or distracting for your audience."
    },
    {
      "title": "Conclude your presentation.",
      "content": "Conclude your presentation. A conclusion should relate back to your introduction and summarize your points, and leave your audience considering the topic you presented. The conclusion should only take up 5 to 10% of your presentation, so keep it brief. [6] X Research source You only need one slide. Recap what your point was. Begin with something like, \"As you can see...\" and then briefly repeat your main point. A visual can help as well. Try adding one last visual aid that sums up your point. A graph or diagram would work well here."
    },
    {
      "title": "Strive for 1 to 2 minutes of talking per slide.",
      "content": "Strive for 1 to 2 minutes of talking per slide. Time yourself as you practice. Going over 1 to 2 minutes per slide can bore your audience. If you're taking longer, cut some information out. You do not want to talk fast to include all information, as this can make you difficult to understand. For accuracy, talk in your regular voice. Do not speak too fast or too slow. You want to make sure you can fit in all information talking at a normal rate."
    },
    {
      "title": "Keep your information relevant to the theme.",
      "content": "Keep your information relevant to the theme. As you read through your presentation, be on the lookout for irrelevant information. There may be some facts that are interesting, but do they really illustrate the point? When looking for areas to trim down, cut information that does not speak to your theme. Are any facts extraneous? It's great to illustrate the effects of global warming, but do you really need five examples of environmental decay? Try to cut it down to two or three."
    },
    {
      "title": "Listen to yourself presenting.",
      "content": "Listen to yourself presenting. It's a good idea to record yourself and then play the recording back. Listen to yourself talk to see what you need to work on. [7] X Research source You should sound enthusiastic when presenting. Talk without hesitance, and don't use filler words, like \"um\" or \"uh.\" Don't jump between topics. Use your linking sentences, and say things like, \"And this brings me to the following...\" Watch the time. Make sure your presentation isn't going on for too long. Watch yourself give the presentation in a mirror so you can correct any distracting movements or gestures."
    },
    {
      "title": "Practice until you have little need for your notes.",
      "content": "Practice until you have little need for your notes. It can be distracting if someone is reading from a script during a presentation. While a small index card with key points jotted down can help, you want to minimize your need for notes. Keep practicing until you can deliver your presentation smoothly without fumbling with your notes. [8] X Research source Don’t read the information off of your visuals since it could affect your engagement between yourself and the audience."
    }
  ]
}