{
  "url": "https://www.wikihow.com/Show-Rabbits",
  "title": "How to Show Rabbits",
  "steps": [
    {
      "title": "Find a rabbit show held by ARBA, 4-H, or FFA.",
      "content": "Find a rabbit show held by ARBA, 4-H, or FFA. Rabbit shows sanctioned by 4-H or FFA typically take place at state or district fairs. ARBA organizes shows all over the U.S. You can search “rabbit shows near me” online to see if there is a show nearby you can enter. [1] X Research source The ARBA site has a full list of shows on their site that they update weekly."
    },
    {
      "title": "Request a show catalog from the show secretary.",
      "content": "Request a show catalog from the show secretary. A show catalog will tell you how and when to enter your rabbit, whether it’s before the show or on the day of the show. When you find a show you’d like to enter, you’ll see the secretary’s name, email address, or phone number listed so you can request a catalog. [2] X Research source The show secretary will either email you the catalog or send it to you in the mail. Make sure your entry is filled out completely and sent it on time, whether it’s a pre-entry show or entry on day-of-show."
    },
    {
      "title": "Enter your rabbit in the appropriate class for age, weight, or breed.",
      "content": "Enter your rabbit in the appropriate class for age, weight, or breed. Classes might vary based on which organization is running the show, but rabbits are often judged based on breed (Angoras, Lops, and so on), pattern or color, sex, or age (junior or senior). Be sure to enter your rabbit into the right class. [3] X Research source Many shows are also divided into youth shows or all ages shows, so check that you register for the right one. [4] X Research source You’ll pay entry fees either before the show or on the day of the show."
    },
    {
      "title": "Review the show's judging procedures.",
      "content": "Review the show's judging procedures. How your rabbit will be judged depends on its breed and the show you chose. In general, shows will judge each rabbit’s weight, quality of fur, its tail and ears, eye color, signs of sickness, and more. Judges may also want certain breeds posed on the table in a specific way."
    },
    {
      "title": "Check your rabbit for diseases to make sure it’s healthy.",
      "content": "Check your rabbit for diseases to make sure it’s healthy. Before starting a conditioner or grooming your rabbit, make sure it’s healthy first. Symptoms of diseases include pinworms, loose stools, a runny nose, or mites. If you spot any of these symptoms, take your rabbit to your veterinarian for care. [5] X Research source If your rabbit is sick, you want it to get healthy before bringing it to a public space. Bringing a sick rabbit to a show can make other rabbits sick, too."
    },
    {
      "title": "Start a supplemental conditioner 90 days before the show.",
      "content": "Start a supplemental conditioner 90 days before the show. A conditioner will make your rabbit’s fur and body look its best. Buy a commercial conditioner, or make your own out of oatmeal or barley. Or, you can sprinkle a pinch of salt or molasses on top of your rabbit’s normal food. If you buy a commercial conditioner, follow the instructions for how much to feed your rabbit, how often, and when to start using it."
    },
    {
      "title": "Give your rabbit plenty of fresh, clean water.",
      "content": "Give your rabbit plenty of fresh, clean water. Having a constant supply of clean and fresh water will keep your rabbit’s digestive system hydrated and working well. Your rabbit will look well-nourished and healthy at a show if you give it enough water. [6] X Research source Whether you use a water bowl or a bottle tube waterer, make sure you keep your rabbit’s dispenser clean and full every day. [7] X Research source"
    },
    {
      "title": "Continue feeding your rabbit hay, pellets and vegetables regularly.",
      "content": "Continue feeding your rabbit hay, pellets and vegetables regularly. A diet of fresh hay, greens and pellets will keep your rabbit healthy. Timothy hay or oxbow hay are good choices. Rabbits love celery, carrot tops, and collard greens. For pellets, feed your rabbit about 1 oz (28 g) per 1 lb (0.45 kg) of their weight. [8] X Research source Make sure your rabbit has fresh hay at all times. The fiber in hay helps their digestive system, and chewing on the hay keeps your rabbit’s teeth filed down."
    },
    {
      "title": "Get your rabbit accustomed to being handled by other people.",
      "content": "Get your rabbit accustomed to being handled by other people. To get your rabbit comfortable with handling, cradle it in one arm. Gently touch its ears, feet, and around its eyes. After your rabbit is comfortable with you, have a friend do the same. This will help prepare your rabbit for a judge's inspection."
    },
    {
      "title": "Practice posing your rabbit to prepare for judging.",
      "content": "Practice posing your rabbit to prepare for judging. Judges may want your rabbit to hold a pose during judging. If you cannot find posing information for your rabbit’s breed, use this common pose: align the tip of its front feet with its eyes. Align the tip of its hind feet with its hip bones. Make sure its tail is showing. Train your rabbit to stay still. When it does, give it a treat as a reward. Practice this method before the show."
    },
    {
      "title": "Trim your rabbit’s toenails at home with pet nail clippers.",
      "content": "Trim your rabbit’s toenails at home with pet nail clippers. While holding your rabbit on its back in one arm, gently clip the tip of its nails on each foot. Only trim the white part of the nails, and be sure not to cut too close to the pink part. The pink part is called the quick, and cutting into the quick will make them bleed. [9] X Research source If you’re nervous about clipping your rabbit’s toenails, ask a friend to help you hold your rabbit. If your rabbit’s nails aren’t clipped for the show, they may snag and fall out, or accidentally cut a judge on their hand or arm. Clip its nails the night before or the morning of your show. [10] X Research source"
    },
    {
      "title": "Clean any discharge or buildup with a moistened cloth or towel.",
      "content": "Clean any discharge or buildup with a moistened cloth or towel. Gently clean any light discharge or hay dust around your rabbit’s eyes with a damp cloth. If your rabbit has any urine stains or fecal build up around their rear end, clean it with a different moistened cloth or towel. [11] X Research source"
    },
    {
      "title": "Brush your rabbit before the show to keep its fur neat.",
      "content": "Brush your rabbit before the show to keep its fur neat. If your rabbit has long hair, it should be brushed every day or two. Short-haired rabbits can be brushed once a week. After brushing, gently rub your rabbit’s fur with a damp cloth to remove dead fur. [12] X Research source Certain breeds with rex fur, like castor rabbits, should never be brushed. Brushing can damage their fur. [13] X Research source"
    },
    {
      "title": "Keep your rabbit cool and comfortable while transporting it.",
      "content": "Keep your rabbit cool and comfortable while transporting it. Traveling in its carrier can cause stress, so add a little hay and a bottle tube waterer to make your rabbit comfortable. Rabbits are very sensitive to heat, so keep the air in your car cool to prevent overheating. Signs of overheating include hot ears, fast and shallow breathing, wetness around the nose, and rapid breathing from an open mouth. If your rabbit is overheating, bring it to a cooler place, and dampen its ears with cool water to help get its temperature down."
    },
    {
      "title": "Bring a grooming kit, show coop, and your belongings to the show.",
      "content": "Bring a grooming kit, show coop, and your belongings to the show. Don’t forget to bring grooming supplies, like a brush, scissors, and wet wipes, to give your rabbit a quick groom before it is judged. A show coop looks like a wire cage, and lets judges handle your rabbit more easily. Don’t forget your personal items like a phone, wallet, snacks, water, and any paperwork you might need."
    },
    {
      "title": "Be present when your rabbit is judged so you can hear feedback.",
      "content": "Be present when your rabbit is judged so you can hear feedback. A show’s rules and procedures may vary, but typically, you’ll place your rabbit in a show coop when your class is being judged. A judge will evaluate every rabbit and make comments about each one. It’s good show etiquette not to reveal which rabbit is yours to other people or the judge. Judges will identify rabbits based on their ear numbers."
    },
    {
      "title": "Remove your rabbit promptly when the judge is finished.",
      "content": "Remove your rabbit promptly when the judge is finished. Rabbits that don’t place in the class are removed. Leaving your rabbit on the table too long can be confusing, and can slow the judging process. Double check that you remove your rabbit and not another owner’s rabbit, too. [14] X Research source Judging usually begins with all rabbits in a class, then narrows down to the top 5 remaining rabbits. A judge will call out ear numbers of rabbits that must be removed from the table. [15] X Research source"
    },
    {
      "title": "Put your rabbit back in its carrier after it has been judged.",
      "content": "Put your rabbit back in its carrier after it has been judged. Being around strangers and other rabbits can cause stress, even if your rabbit is well-trained to handle other people. Keep your rabbit comfortable and relaxed by putting it back in its carrier immediately. When you leave the show, check to make sure you have all of your belongings, including your rabbit!"
    }
  ]
}