{
  "url": "https://www.wikihow.com/Plant-Avocado-Seed-in-Soil",
  "title": "Plant and Grow an Avocado Seed in Soil: A Step-by-Step Guide",
  "steps": [
    {
      "title": "Remove the fresh pit and wash it off.",
      "content": "Remove the fresh pit and wash it off. Cut a ripe avocado in half lengthwise and scoop out the pit, or seed. Run it under cool water and use your fingers to gently brush off and remove any residue from the surface. [1] X Research source You can tell if an avocado is ripe by gently squeezing it. If it gives and feels slightly squishy, then it’s good to go. If it’s really hard, wait another day or so and check it again. You can also pull the stem part of the avocado. If it comes out easily, it is probably ready. Check out this Wikihow article for more info: https://www.wikihow.com/Tell-if-an-Avocado-Is-Ripe . While you can grow an avocado tree from any pit, you have to live in a frost-free climate in order for the tree to produce fruit. [2] X Trustworthy Source Missouri Botanical Garden Oldest botanical garden in the U.S. and center for botanical research and science education Go to source"
    },
    {
      "title": "Fill a large jar or tumbler with water.",
      "content": "Fill a large jar or tumbler with water. Take a clear jar, glass, or tumbler and rinse it out well so it’s nice and clean. Fill it up about ¾ of the way full with room-temperature water. [3] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source A clear container allows you to see the root system forming, which can help tell you when the seed is ready to plant into soil."
    },
    {
      "title": "Poke 3 toothpicks into the seed and suspend it above the water.",
      "content": "Poke 3 toothpicks into the seed and suspend it above the water. An avocado seed has a flattened, broad end and a slightly narrower, rounded end. Hold the seed and push 3 toothpicks into the center between the two ends. Space the toothpicks out evenly in the pit. Then, gently rest the toothpicks on the rim of the glass with the broad end submerged just beneath the surface of the water. [4] X Research source You don’t want the entire seed soaking in the water or it could rot. You may need to add more water so the end of the avocado seed reaches it."
    },
    {
      "title": "Place the glass in a warm location away from direct sunlight.",
      "content": "Place the glass in a warm location away from direct sunlight. Try to keep the seed between 60–85 °F (16–29 °C). If the water gets too hot or too cold, it won’t germinate. Put the glass somewhere like the top of a shelf or on a kitchen cabinet so it gets indirect light but the water won’t heat up too much. [5] X Research source"
    },
    {
      "title": "Change the water every 2-3 days.",
      "content": "Change the water every 2-3 days. Check the water in the glass often. If it gets so low that the end of the seed isn’t submerged just below the surface, top it off so the seed stays in contact with the water. Every couple of days, empty out the water and fill it back up again so it stays clean. [6] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source If you ever see any slime or gunk in the water, swap it out immediately."
    },
    {
      "title": "Trim the stem to about 3 inches (7.6 cm) once it’s 6–7 inches (15–18 cm) tall.",
      "content": "Trim the stem to about 3 inches (7.6 cm) once it’s 6–7 inches (15–18 cm) tall. After about 6-8 weeks, the avocado seed will split open and you’ll see a shoot form at the top and roots start to come out of the bottom. Wait until the top stem gets at least 6–7 inches (15–18 cm) and then use a pair of scissors to trim the stem back. Trimming the stem encourages new growth."
    },
    {
      "title": "Wait until the roots are thick and the stem has leaves to plant the seed.",
      "content": "Wait until the roots are thick and the stem has leaves to plant the seed. After you trim the stem back, allow it to grow back and develop leaves. Once the leaves grow and the root system is nice and thick, which can take up to 6 weeks, you can plant the seed whenever you’re ready. [7] X Research source"
    },
    {
      "title": "Fill a 10.5 in (27 cm) diameter pot with potting soil.",
      "content": "Fill a 10.5 in (27 cm) diameter pot with potting soil. Go with a plastic or ceramic pot with holes at the bottom to allow for good drainage. Fill it up with potting soil designed for growing fruits and vegetables to just before the rim. Gently pat it down so the surface is nice and even. [8] X Trustworthy Source Missouri Botanical Garden Oldest botanical garden in the U.S. and center for botanical research and science education Go to source Potting soil will help with drainage and give your avocado plant the nutrients it needs to thrive. You can find potting soil at your local garden supply store, home improvement store, and department store."
    },
    {
      "title": "Plant the seed so it sits vertically and is halfway exposed.",
      "content": "Plant the seed so it sits vertically and is halfway exposed. Use your fingers to create a divot and gently place the seed root-side down into it. Push the seed into the soil until it’s halfway buried. [9] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Don’t completely cover the seed with the soil or it could smother and kill it."
    },
    {
      "title": "Place the pot in a sunny window.",
      "content": "Place the pot in a sunny window. Avocado trees love being in temperatures between 60–85 °F (16–29 °C). [10] X Research source Make sure your plant gets plenty of sunlight but isn’t directly exposed, which could dry it out or fry it. Find a sunny windowsill and place it on top or place it on a shelf near a window. [11] X Trustworthy Source Missouri Botanical Garden Oldest botanical garden in the U.S. and center for botanical research and science education Go to source You can also place the pot outside. Just choose a location where it isn’t constantly exposed to direct sunlight. If you notice your plant isn’t doing well in one location, try moving it to another to see if that helps."
    },
    {
      "title": "Water the plant whenever the soil is dry.",
      "content": "Water the plant whenever the soil is dry. Check the water level by sticking your finger into the soil to see if it’s moist. If it’s dry, add enough water to saturate the top 1 inch (2.5 cm) so your avocado plant has plenty of moisture but won’t get waterlogged. [12] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    }
  ]
}