{
  "url": "https://www.wikihow.com/Show-Your-Boyfriend-That-You-Love-Him-and-Only-Him",
  "title": "How to Show Your Boyfriend That You Love Him and Only Him",
  "steps": [
    {
      "title": "Have deep conversations with him",
      "content": "Have deep conversations with him . They don’t have to be things like the meaning of life or about politics. Rather, ask open-ended questions about his day, interests, or family. You can also ask about things he's said in the past to show you remember what he says. Try saying things like: [1] X Research source \"How are your family? How is your mother's health?\" \"I haven't heard you talk about gardening lately. How are your vegetables doing?\" \"I saw a commercial for a tropical vacation. It made me think about you and how you want to have your big adventure vacation.\""
    },
    {
      "title": "Listen",
      "content": "Listen to him. One great way to show your boyfriend that you love him is to listen to him. Sometimes, he will need your undivided attention as he talks about random things. These things may not mean anything to you or seem pointless, but they mean something to him. Listening to him can help you both feel connected and shows him how much you care for him. [2] X Research source When you talk to him, make sure to make eye contact and watch him. Really listen to what he says. You may want to repeat things, ask questions, or add ideas to what he says. Put away electronic devices so that your attention is completely focused on him."
    },
    {
      "title": "Praise him.",
      "content": "Praise him. Guys often want to feel appreciated and masculine, which helps their self-esteem. You can help show him your love by complimenting him and praising him. Make sure your praise is genuine and not fake, which can backfire and cause problems in the relationship. [3] X Research source Compliment and praise his manliness, such as commenting on something he did around the house. Pay attention to the little things he does as well, such as opening doors for you. Tell him how much you appreciate it and how it makes you feel special. Point out the good things he does for other people. For example, you might say something like, \"I admire you for the way you protect your younger siblings.\""
    },
    {
      "title": "Be honest with him.",
      "content": "Be honest with him. Focus on building an honest, open relationship with your boyfriend. Keeping secrets and hiding things can come between you. If you’re hiding something, he might eventually find out and lose trust in you. Always be open and honest with him. [4] X Research source Even if he doesn’t find out what you’re keeping from him, your guilty conscience could eat away at you and make you feel miserable."
    },
    {
      "title": "Avoid picking fights with him.",
      "content": "Avoid picking fights with him. Arguments are part of a healthy relationship, but picking fights with him for no apparent reason doesn’t encourage a good relationship or show that you love him. As far as he knows, a fight could give you an excuse to leave him and meet someone else. Unfaithful partners also pick fights as a result of guilt. If you love only him, don't give him a reason to think otherwise. [5] X Research source Let him know right away if something bothers you, and be direct about it. Letting things fester will only make matters worse, and he won't know you're upset unless you say something. Speak calmly without raising your voice. Attack the issue on hand and not him. Give him a chance to speak and listen to what he has to say. [6] X Research source For example, instead of saying \"You always ignore me and never want to be with me!\" you could say \"The way you treated me in that situation really hurt my feelings.\""
    },
    {
      "title": "Admit when you’re wrong.",
      "content": "Admit when you’re wrong. This is a strong sign of honesty and loyalty. Everyone slips up, and you’re no exception. If you know you've hurt him, admit it and apologize. Afterward, don’t dwell on it or constantly revisit the subject with him. [7] X Research source Don't completely abandon the issue, however; try to learn from your mistake so that you don't repeat it in the future."
    },
    {
      "title": "Use \"I\" statements instead of \"you\" statements.",
      "content": "Use \"I\" statements instead of \"you\" statements. Speak in the first-person (I, me) to show that you're honest with your feelings and thoughts. When you use “I” words, you show that you're not ashamed to associate yourself with the topic. Keeping the focus on yourself also shows him that you're not trying to blame him for anything. Try saying: [8] X Research source \"I was hurt by your actions last night.\" \"I did not appreciate the way you spoke to me in front of your friends.\" \"I feel like I have been treated unfairly by you.\""
    },
    {
      "title": "Learn to compromise.",
      "content": "Learn to compromise . Compromise is an important part of any serious relationship. It’s a way you can show him you love him. When there are things he wants to do but you aren’t interested in, you can compromise and go anyway. He’ll know you don’t really want to do it, but he’ll know you love him because of your willingness to do things for him. [9] X Research source When you agree to do something, don’t talk about how you don’t want to be there the whole time. Instead, enjoy being with him, even if the event or activity isn’t your thing. Make sure he compromises and does things for you, too. Compromising for each other is part of a healthy relationship."
    },
    {
      "title": "Support his dreams.",
      "content": "Support his dreams. Just as you have your dreams, your boyfriend has dreams. Some of these dreams may never be achievable, but everyone needs things to think about and hope for. Don’t shoot down his dreams, but encourage him. Dream with him, and maybe the two of your can come up with your own dreams together. [10] X Research source For example, if he dreams to hike up an exotic mountain, don’t tell him he can’t do it or that he won’t have the time or money. Instead, say something like, “That would be so much fun!” or “You should try to save up for that adventure one day.”"
    },
    {
      "title": "Do small thoughtful things for your boyfriend.",
      "content": "Do small thoughtful things for your boyfriend. Sometimes, it is the little things that count the most. Think about what sorts of things your boyfriend likes, or how his day is going, and try to incorporate that into your actions. For example: [11] X Research source Bring him a cup of coffee or his favorite beverage in the mornings, or buy his favorite snack for lunch. Do something nice for him when he’s having a bad day, such as cooking his favorite meal. Wear his favorite outfit of yours, or surprise him with a Saturday trip to his favorite place."
    },
    {
      "title": "Be physically affectionate with your boyfriend.",
      "content": "Be physically affectionate with your boyfriend. Kissing and hugging are two ways couples nonverbally show their feelings for each other. You can also hold hands, cuddle, or touch each other as you talk. [12] X Research source It's perfectly normal for things to cool down after you've been together for a few years, but don't stop the affection, or he might think you're losing interest in him. Even if you've been together for a while, don’t stop hugging or kissing him before you go home after a date. Continue to cuddle on the couch as you watch TV."
    },
    {
      "title": "Keep your affection at a reasonable level.",
      "content": "Keep your affection at a reasonable level. You should be affectionate and buy your boyfriend cute things on special occasions. However, you should avoid acting extremely lovey-dovey or buying him things for no reason. Showing him that he's the only one doesn't mean smothering him. Going overboard with affection may make him think that you are making up for something you feel guilty about. There is a time and place for everything. Some people are comfortable with public displays of affection while others aren't. Be mindful and respectful of others."
    },
    {
      "title": "Be confident",
      "content": "Be confident . If your guy is like most modern guys, he appreciates a smart and confident partner. When you let your confidence shine, you remind him of why he fell in love with you in the first place. You also show that you have the self-esteem that many unfaithful partners lack. [13] X Research source Express your confidence by speaking up for yourself (calmly) when he’s hurt you. Being a doormat is not part of true love and loyalty. [14] X Research source"
    },
    {
      "title": "Keep your promises.",
      "content": "Keep your promises. Unforeseen circumstances are one thing. If you had to break tonight's date because you developed a migraine after lunch, that’s understandable. On the other hand, if you repeatedly break dates because “something came up,” you'll only show him that he can't count on you. [15] X Research source If making plans just doesn't work with you, try being spontaneous and going with the flow instead. This means more last-minute dates and fewer planned-in-advance dates. If you decide to go with the flow, let him know that your schedule changes often, so making plans ahead of time doesn't always work. Communication is key."
    },
    {
      "title": "Trust him",
      "content": "Trust him . It’s okay to feel a tinge of jealousy if he looks at a potential rival. However, if he’s not flirting with others, ignoring you, or receiving suspicious texts, you shouldn’t have anything to worry about. If you don't trust him, then he might feel hurt and stop trusting you as well. [16] X Research source Cheaters often accuse their partners of being unfaithful when they have no evidence. Don’t give him a reason to think you might be messing around."
    },
    {
      "title": "Show him he is important to you.",
      "content": "Show him he is important to you. Never forget his importance in your life. Let him know you’re happy to be with him. Compliment him, do nice things for him, and tell him you love him. These small gestures can make him feel loved. [17] X Research source Avoid talking too much about cute celebrities or your ex. Even if he knows you’ll never meet or run into them again, this could make him feel neglected. You can also stand up for your boyfriend in front of other people if the opportunity arises. Make sure to pay him compliments in front of people who are important to you, such as your parents and friends."
    },
    {
      "title": "Show him you’re thinking of him.",
      "content": "Show him you’re thinking of him. Send him an occasional text or email professing your love. Leave sweet love notes for him from time to time. This will reassure him that you’re thinking of him and no one else while you’re apart. [18] X Research source For instance, send him “Good morning” and “Good night” texts. Reader Poll: We asked 405 wikiHow readers how often they text their significant other goodnight, and 61% of them agreed that they text every night, no matter what . [Take Poll]"
    },
    {
      "title": "Dress up for him.",
      "content": "Dress up for him. Looking extra special when you go out can remind your boyfriend just how much you love him. It doesn’t matter how long you have been together. Putting effort into how you look occasionally helps remind him about one of the reasons why he fell for you and that you love him enough to put work into your appearance for him. [19] X Research source For example, put on clothes you know he thinks are sexy, groom yourself, put on his favorite scent, and do something with your hair. It’s easy to get comfortable when you’ve been together, but dressing up can spice things up for both of you."
    },
    {
      "title": "Take an interest in a hobby of his.",
      "content": "Take an interest in a hobby of his. If your boyfriend has a hobby that he is passionate about, taking an interest in it and allowing him to teach you about it will show him how much he means to you. For example, if your boyfriend plays soccer and you don’t know much about it, ask him about the sport or if he could take you out sometime to learn the basics. Or, if your boyfriend is really into video games, ask him to teach you how to play one of his favorite games. Ask for tips and tricks that he has learned about the game."
    },
    {
      "title": "Encourage him to spend time with his friends.",
      "content": "Encourage him to spend time with his friends. Being together is not the only way you can show that you love him. Your boyfriend needs his friends and to enjoy things outside of you and the relationship. By encouraging him to go out with his friends, you are showing him that you love him and trust him. Plus, when he returns, you can remind him that you love him and only him by telling him how much you missed him. [20] X Research source Don’t get upset or angry if he wants to go watch a game with his friends. Time apart is good for you both, as is spending time with your friends. Make sure the time he spends with his friends is realistic. He shouldn’t expect you to never see your friends while he sees his. If you are living together, leave one another with all the housework while you hang out with your friends. That would be unfair to him or to you."
    },
    {
      "title": "Focus on him instead of social media.",
      "content": "Focus on him instead of social media. It’s okay to spend an hour or so tweeting about the issues of the day, but there’s also a time to call it quits. If you spend time on social media while he's right there with you, you'll make him feel unloved. Rather than checking your phone throughout your date, focus on him. Social media will still be there tomorrow. [21] X Research source Stay present in the moment when you go on dates, eat dinner, or watch television. Enjoy the activity and talk to one another. If social media is too tempting, then consider turning your phone off. Encourage him to do the same so that both of you could focus on each other."
    },
    {
      "title": "Treat his friends with respect.",
      "content": "Treat his friends with respect. Be friendly and respectful to his friends. It is important that you form good relationships with his friends because they are important to your boyfriend. However, you shouldn’t flirt with them. If you really love your boyfriend, you will be friendly with his friends but nothing more. Instead, focus your affection on your boyfriend while you are with his friends to remind him he's the only one for you. [22] X Research source It’s okay to offer a friendly hug after you’ve gotten to know them, but softly grazing their arms or standing too close are red flags for flirting. Behavior like this will make your guy think twice about your loyalty."
    },
    {
      "title": "Say nice things about him when he is not around.",
      "content": "Say nice things about him when he is not around. Talking positively about your boyfriend to other people even when he’s not around is a great way to show your loyalty to him. Friends and family may even repeat some of the nice things you say about your boyfriend back to him when they see him. Don’t vent about your relationship frustrations to friends and family when he is not around."
    },
    {
      "title": "Don’t cheat.",
      "content": "Don’t cheat. This should go without saying. If you truly love your guy and only him, you won’t go behind his back with someone else. Remain faithful to show him he’s the only one in your heart."
    }
  ]
}