{
  "url": "https://www.wikihow.com/React-if-a-Mean-Dog-Chases-You",
  "title": "How to React if a Mean Dog Chases You",
  "steps": [
    {
      "title": "Resist the urge to run.",
      "content": "Resist the urge to run. Running may seem like the most reasonable reaction, but it's actually the most dangerous. Most dogs that charge at a person don't intend to bite them, even when the dog is mean or aggressive. [2] X Research source However, if you start to run, the dog's predatory instincts will kick in and it will most likely chase you. If you're running or jogging when the dog begins to chase you, stop immediately. Even if you're a fast runner, the dog will probably have enough energy and excitement to catch up with you."
    },
    {
      "title": "Stand your ground.",
      "content": "Stand your ground. Running towards you while barking and/or growling is simply the dog's way of trying to scare you away. Refuse to react and instead stand still with your arms by your sides and \"be a tree.\" If you do this long enough, the dog will eventually calm down and lose interest in you. Face the dog. Don't turn away until you're a safe enough distance away that the animal has lost interest in you. Consider making yourself big by raising your arms up in the air. [3] X Research source Some experts recommend shouting while doing this, but be aware that yelling may further excite some dogs. [4] X Research source"
    },
    {
      "title": "Back away slowly.",
      "content": "Back away slowly. Because most dogs only chase people to scare them away, if you stand still and back away calmly the dog will eventually back away from you. [5] X Research source The key is to back away in a calm and nonchalant manner that won't further excite the dog. Do not turn your back on the dog, as this may trigger its predatory instincts if it is still excited. If at all possible, try to put a physical barrier between you and the dog. You can do this by backing away behind a parked car or by crossing the road away from the animal. [6] X Research source Only turn away from the dog and continue on your way when you've put some distance between you and the dog. If the dog begins to look distracted or disinterested, you're probably far enough away."
    },
    {
      "title": "Stay calm.",
      "content": "Stay calm. Staying calm is essential in any encounter with an aggressive animal. Resist the urge to scream and continue to stand tall while asserting your presence. You can use a stern voice, but yelling loudly may further excite the dog. [7] X Research source"
    },
    {
      "title": "Avoid eye contact.",
      "content": "Avoid eye contact. While you may think of eye contact as a good way to show you're engaging with someone, it means something else entirely to a dog. An aggressive dog will see eye contact as a challenge or threat to its dominance. This could cause the dog to attack you, even if it did not previously seem like it would. [8] X Research source Don't make eye contact, but keep paying attention to what the dog is doing. You need to be able to react if the dog lunges towards you."
    },
    {
      "title": "Give verbal commands.",
      "content": "Give verbal commands. If the dog recognizes basic verbal commands, it should respond to your orders. Even if the dog is excited, a strong verbal command should break the dog's attack. [9] X Research source However, some dogs won't recognize commands at all. In this case, verbal commands will not be effective. Use a firm, commanding voice to tell the dog to \"sit,\" \"lie down,\" or \"go home.\" Be confident when you give verbal commands. Dogs can sense fear or uncertainty, so make sure you let the dog know who's in charge with the tone of your voice."
    },
    {
      "title": "Distract the dog.",
      "content": "Distract the dog. Distracting an aggressive dog will give you time to sneak away. [10] X Research source If nothing else, a distraction may help calm an excited dog down and break its desire to chase you. Any object can be used as a distraction if you catch the dog's attention with it. If you have any dog treats, dog toys, or any type of food on your person, throw them on the ground in front of the dog. If you don't have any food or toys, try to find a stick to throw. This might distract the dog or make it transition into a more playful mood."
    },
    {
      "title": "Enter a defensive stance.",
      "content": "Enter a defensive stance. If the dog cannot be deterred, you may have to defend yourself. Make sure you enact a strong defensive stance and prepare yourself to fight. [11] X Research source Keep one arm down and use it as a blocker against the dog. If the dog is going to bite you, it's best to receive the bite on your arm so you can still control the dog. Put your other arm behind your back. This will signal the dog to get down and behave."
    },
    {
      "title": "Use chemical repellent if you have it.",
      "content": "Use chemical repellent if you have it. Mace/pepper spray will stop an attacking animal in its tracks, but you may not have tools like this on hand. If you have any liquids at all that can be sprayed or splashed at the dog, it might be worth trying. [12] X Research source Citronella spray is an effective animal deterrent. Mace/pepper spray can also be useful at repelling aggressive dogs. In a pinch, spraying water from a water bottle may stop a dog from attacking."
    },
    {
      "title": "Shove an object at the dog.",
      "content": "Shove an object at the dog. Shoving something towards the dog will act as a shield. The dog will bite your object instead of biting you. Anything you have on hand can be used as a shield: a purse or backpack, a sweatshirt, or even a shoe. [13] X Research source"
    },
    {
      "title": "Fight the dog.",
      "content": "Fight the dog. If you need to fight, make sure you stay on your feet. Getting pinned on the ground will make it much easier for the dog to hurt you. If you need to strike the dog, try to kick it instead of punching it, as your shoes will provide some protection to your feet. [14] X Research source If you fall or get knocked down, protect yourself. Cover your face, chest, throat, and neck. Curl into a ball to protect your vital organs. Keep your hands in fists. If you have loose fingers sticking out the dog could latch onto them and do serious damage."
    }
  ]
}