{
  "url": "https://www.wikihow.com/Restart-Windows-10",
  "title": "How to Restart Windows 10 & 11: Five Easy Step-by-Step Methods",
  "steps": [
    {
      "title": "Navigate to the desktop.",
      "content": "Navigate to the desktop. Press ⊞ Win + D simultaneously. There are other different ways of doing this: Close all open apps . Close each app individually by clicking the ✕ button in the upper-right corner of each window. Clicking the very bottom-right of the screen, on the taskbar."
    },
    {
      "title": "Open the \"Shut Down Windows\" dialog box.",
      "content": "Open the \"Shut Down Windows\" dialog box. Press Alt + F4 together. Using this shortcut while an app is open will only close that app window. To restart Windows with this shortcut, you must be on the desktop without open apps."
    },
    {
      "title": "Click the dropdown menu and choose the Restart option.",
      "content": "Click the dropdown menu and choose the Restart option. This dropdown is below the text that says \"What do you want to do?\" If your mouse doesn't work, you can press the Tab ↹ key until the menu is selected, press ↵ Enter to expand it, then use the arrow keys to select the Restart option."
    },
    {
      "title": "Confirm the restart.",
      "content": "Confirm the restart. Press OK or hit ↵ Enter to reboot your Windows computer."
    },
    {
      "title": "Press the Ctrl+Alt+Del keys together.",
      "content": "Press the Ctrl + Alt + Del keys together. This shortcut will open a blue screen containing many different links and icons. From here, you will be able to restart Windows."
    },
    {
      "title": "Click the power icon.",
      "content": "Click the power icon. A context menu that provides multiple different power options will appear. The icon is at the bottom right. It appears as a circle with a vertical line towards the top of it. If your mouse isn't working, use the Tab ↹ key to select the Power icon, then press ↵ Enter to expand the menu."
    },
    {
      "title": "Click Restart.",
      "content": "Click Restart . Your device will turn off and power back on. [1] X Research source If you aren't using a mouse, use the arrow keys to select the Restart option, then press ↵ Enter to confirm."
    },
    {
      "title": "Launch the Start menu.",
      "content": "Launch the Start menu . Click the Start button located at the bottom-left corner of the screen. Alternatively, press the ⊞ Win keyboard key."
    },
    {
      "title": "Click the power icon.",
      "content": "Click the power icon. A context menu that provides multiple different power options will appear. The icon is right above the Start button. On Windows 11, it's across from your name. It has a circle with a vertical line towards the top of it."
    },
    {
      "title": "Click Restart.",
      "content": "Click Restart . Your device will turn off and power back on. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Launch the Power User menu.",
      "content": "Launch the Power User menu. Press the ⊞ Win + X keys together. Alternatively, right-click the Start button. Touchscreen device users can hold down and release."
    },
    {
      "title": "Hover over/select Shut down or sign out.",
      "content": "Hover over/select Shut down or sign out . This option is located second from the bottom. Choosing this will prompt a submenu to appear to the right of the main context menu. You can also press the U keyboard key."
    },
    {
      "title": "Click Restart.",
      "content": "Click Restart . Pressing the R keyboard key will perform the same action as clicking Restart ."
    },
    {
      "title": "Open the Command Prompt.",
      "content": "Open the Command Prompt. Press ⊞ Win + X and choose Command Prompt or Terminal (Windows 11). You can also press ⊞ Win + R , type cmd , and hit ↵ Enter or click OK ."
    },
    {
      "title": "Enter shutdown /r.",
      "content": "Enter shutdown /r . Your computer will restart in about a minute. If you want your computer to restart immediately, type shutdown /r /t 0 . Abort the shutdown by using shutdown /a ."
    },
    {
      "title": "Hit the ↵ Enter key.",
      "content": "Hit the ↵ Enter key. This will submit the command."
    },
    {
      "title": "Dismiss the notification.",
      "content": "Dismiss the notification. You'll get a notification telling you that you'll be signed out in less than a minute, unless you did the immediate restart command."
    }
  ]
}