{
  "url": "https://www.wikihow.com/Mustache-Styles",
  "title": "The Top 18 Mustache Styles for Men (Plus How to Get Them!)",
  "steps": [
    {
      "title": "Chevron",
      "content": "Chevron Named after the chevron pattern, the chevron mustache follows the shape of your upper lip to create a natural style with a slight upside-down V shape. The chevron is wider than the mouth, extending past the corners of your lips, and partially covers the upper lip. It is a timeless look that requires minimal styling. [1] X Research source Natural mustache styles are generally the easiest and quickest to grow, as they don’t require styling aids like mustache wax. Growing Steps: Let your mustache grow naturally, allowing 2-3 months to get the thickness and length needed. Some people grow their chevron alongside a beard and then shave the beard to achieve their desired look. Styling Steps: Chevron mustaches don’t require much grooming. If the hair grows too long and starts to get in your mouth, use a pair of beard-trimming scissors to trim it up. Make sure the ends of your mustache don’t extend lower than the corners of your mouth. Works Best For: Works well for many face shapes, but especially oval, triangle, and square Less Flattering For: Could potentially be too overpowering for round or heart shapes, but generally works well for all face shapes Famous Examples: Henry Cavill, Tom Selleck, Freddie Mercury, Nick Offerman, Burt Reynolds"
    },
    {
      "title": "Lampshade",
      "content": "Lampshade The lampshade is a trapezoid-shaped mustache that resembles a lampshade. Lampshade mustaches are neatly groomed and no wider than the mouth, with the hair kept off the upper lip. This style is sometimes called a “cop ‘stache” because it fits the strict grooming requirements for servicemen. [2] X Research source Growing Steps: Let your mustache grow naturally for 1-2 months, keeping it groomed so it doesn’t touch your upper lip or extend past the corners of your mouth. Styling Steps: Imagine a vertical line that extends upward from the edge of your mouth and a horizontal line that extends from the bottom of your nose; your mustache must be kept within this imaginary box. Use a razor or electric trimmer to remove any hair outside of these lines, and trim your ‘stache so the hair doesn’t touch your upper lip. Works Best For: Square (if your mustache is thick), oval, heart, and diamond Less Flattering For: Oblong Famous Examples: Miles Teller, Eddie Murphy, Sgt. Slaughter"
    },
    {
      "title": "Walrus",
      "content": "Walrus The walrus mustache resembles a walrus’s whiskers. This thick mustache style completely covers the top lip and may even extend to the bottom lip. It is combed straight down, creating a bold, but practical look. [3] X Research source Growing Steps: Let your mustache grow naturally for a minimum of 6 months without trimming. Because these mustaches are so thick, they sometimes take up to a year to grow, and some people aren’t capable of growing them. Styling Steps: Keep your walrus mustache tangle-free by combing it with a beard comb . This will also help keep the hair out of your mouth while you eat. Use beard-trimming scissors to keep your ‘stache at your preferred length. Works Best For: Oval, square, and rectangle Less Flattering For: Round and heart-shaped Famous Examples: Teddy Roosevelt, Sam Elliott, Friedrich Nietzsche, Andy Reid, David Crosby"
    },
    {
      "title": "Painter’s brush",
      "content": "Painter’s brush The painter’s brush mustache is similar to the chevron and the lampshade. It has the thickness of the chevron without the downward angle, and like the lampshade, it is groomed so it doesn’t extend wider than the mouth. The style looks like someone brushed a strip of paint under the nose. [4] X Research source Growing Steps: Let your mustache grow for 2-3 months, keeping it trimmed along the top lip so it forms a horizontal line. Round off the edges at the corners of your mouth. Styling Steps: Use beard-trimming scissors to trim the hair into a straight-across style, making sure the mustache doesn’t extend past the corners of your mouth. Works Best For: Diamond and heart-shaped Less Flattering For: Oblong or rectangle Famous Examples: Ron Burgundy, Ron Swanson, Groucho Marx"
    },
    {
      "title": "Toothbrush",
      "content": "Toothbrush The toothbrush mustache is a small, stubby mustache shaved on both sides so that it’s about the width of your nose. While this style is sometimes associated with Charlie Chaplin, it is infamously associated with Hitler, so it probably isn’t the best style to wear (unless you’re dressing up as Charlie Chaplin for Halloween). [5] X Research source Growing Steps: Because of its negative connotations, we don’t recommend growing a toothbrush mustache. Famous Examples: Charlie Chaplin, Adolf Hitler"
    },
    {
      "title": "Pyramid",
      "content": "Pyramid The pyramid mustache has a broad base that tapers to a point under the nose, resembling the shape of a pyramid. This style is similar to the lampshade mustache but extends farther down past the lips. [6] X Research source Growing Steps: Allow your mustache to grow for 1-2 months so that the length extends past the lips. Trim the ‘stache so it’s straight across your lip and shave the upper part so that the shape resembles a pyramid. Styling Steps: Keep your mustache trimmed so that it keeps its pyramid shape. The width and density are up to your personal preferences. Works Best For: Diamond, heart, oval, round, and triangle Less Flattering For: Oblong or rectangle Famous Examples: Donald Sutherland, Eddie Murphy, Burt Reynolds, Milo Ventimiglia"
    },
    {
      "title": "Pencil",
      "content": "Pencil The pencil mustache is a thin style popularized by actors in the 1930s and 1940s. [7] X Research source This style rests just above the top lip and is about the same width as your mouth. Because of how short and thin it is, this style usually works best for people with darker hair. Thin mustache styles don’t fill the entire space between your upper lip and nose. These often work well for people who can’t grow thicker facial hair. Growing Steps: Allow your mustache to grow for 2-4 weeks, keeping the length short so that it doesn’t cover your top lip. Trim the bottom of the ‘stache to follow the curve of your mouth. Styling Steps: Pencil mustaches generally require a lot of grooming. Shave the upper line a few times a week (or daily), and keep the length on the shorter side so it’s easier to maintain the bottom line. Works Best For: Oval, heart, round, and diamond (if the mustache is thicker) Less Flattering For: Triangle, square, oblong Famous Examples: John Waters, Clark Gable, Little Richard, Errol Flynn, Sammy Davis, Jr."
    },
    {
      "title": "Parted pencil",
      "content": "Parted pencil The parted pencil mustache is the same as a pencil mustache. The only difference is that, as the name suggested, the parted pencil is parted down the middle. The part is achieved by shaving a hard vertical line down the philtrum (the indent above your upper lip). [8] X Research source Growing Steps: Grow a parted pencil mustache the same way you would a regular pencil mustache. Then, use an electric trimmer to part your mustache at the middle of your lip. Styling Steps: Groom a parted pencil mustache the same way you would a regular pencil mustache. Works Best For: Oval, heart, round, and diamond (for thicker mustaches) Less Flattering For: Triangle, square, oblong Famous Examples: Errol Flynn, Clark Gable, Vincent Price, Gomez Addams"
    },
    {
      "title": "Handlebar",
      "content": "Handlebar The handlebar is a thick mustache style in which the ends of the mustache are grown out to resemble the handlebars of a bicycle. The “handles” are then styled with mustache wax to curl out over the cheeks and back toward the center of the face, with the tips waxed to a point. [9] X Research source Handlebar mustaches require mustache wax to shape the mustache into the desired style. Because of this, they are more high-maintenance than natural styles. Growing Steps: Grow your mustache for at least 6 months to achieve the necessary length. The handles for the mustache are grown at the edges of the mustache. Because this style is so thick, not everyone is able to grow it. Styling Steps: Keep the center of your mustache neat and shave the hair beneath the handles at the edges of your mustache. Apply mustache wax to curl the handles upward and create the desired shape. Works Best For: Oblong, square, diamond, and triangle Less Flattering For: Round and heart-shaped Famous Examples: Greg Berzinsky, Rollie Fingers, William Howard Taft, Daniel Day-Lewis"
    },
    {
      "title": "Petite handlebar",
      "content": "Petite handlebar The petite handlebar is a smaller version of the standard handlebar mustache. It is shorter in length, and the handlebars do not extend past the corners of the mouth. Petite handlebars are often parted along the philtrum, and they’re a good option for those who cannot grow enough length for a full handlebar. Growing Steps: Because they aren’t as large as the standard handlebar, petite handlebars usually only need 2-3 months to grow. Grow them the same way you would a regular handlebar, but keep everything shorter and more compact. Styling Steps: Grooming is typically the same as a standard handlebar, though it needs to be done much more frequently to keep the petite handlebar compact. Keep the center of the mustache trimmed above the top lip to maintain a clean appearance. Works Best For: Works well for most face shapes, but especially oval or diamond Less Flattering For: Rectangle or other large face shapes Famous Examples: N/A"
    },
    {
      "title": "English",
      "content": "English The English mustache is a distinguished and aristocratic style, similar to the handlebar mustache. The main difference is that the ends of the English mustache are waxed horizontally and shaped to a point rather than made to curl upward. English mustaches are also on the thinner side. [10] X Research source Growing Steps: Grow your mustache for 4-5 months so the ends are long enough to style into horizontal points. Keep the center trimmed neatly so that the hair does not cover the upper lip. If you want, trim a hard part at the philtrum. Styling Steps: Keep the center of the mustache trimmed above your lip to create a clean, defined look. Shave the hair beneath the “handles” at the edges of your mouth, and use mustache wax to shape the handles into horizontal points. Works Best For: Oblong, square, triangle Less Flattering For: Round and heart-shaped Famous Examples: Hercule Poirot, Jimmy Edwards (comedian)"
    },
    {
      "title": "Hungarian",
      "content": "Hungarian The Hungarian mustache is the biggest type of handlebar mustache, with influences from the walrus mustache. Because of its size, the Hungarian sits lower on the cheeks than a standard handlebar and is more naturally curled. [11] X Research source Growing Steps: Grow your mustache for at least 4 months or until you achieve 1.5 to 2 inches of growth. Like a walrus mustache, do not trim your Hungarian as it grows. It may take up to a year to grow fully, and some people may not be capable of it. Styling Steps: The Hungarian requires a little less grooming than a standard handlebar. Use a beard comb to remove tangles and keep it clean, then shave the hair beneath the handles. Use your thumb and finger to train the handles to curl upward , then apply mustache wax or another high-hold product to keep it in place. Works Best For: Oblong Less Flattering For: Round and heart-shaped Famous Examples: Franz Ferdinand, Greg Berzinsky, Eric Bandholz, Wyatt Earp, the Monopoly guy"
    },
    {
      "title": "Dalí",
      "content": "Dalí Made famous by the painter Salvador Dalí, the Dalí is an elaborate, eccentric take on the traditional handlebar mustache. [12] X Research source It is a pencil mustache with long handles that are waxed thin and styled straight up toward the edges of the eyes. The result is a look that resembles the horns of a Texas Longhorn. Growing Steps: Grow your mustache for at least 6 months to achieve the required length for the handlebars. Grow a standard handlebar or Hungarian, then shave a gap between the top of your mustache and your nose. Trim any hairs that hang over your top lip to achieve the desired pencil shape. Styling Steps: Shave your ‘stache daily to get rid of stray hairs and keep the pencil shape tidy. Apply a heavy-hold wax to the handles of your mustache and style it in any whimsical shape you desire. Works Best For: Oval, heart-shaped, rectangular Less Flattering For: Triangle, square, oblong Famous Examples: Salvador Dalí"
    },
    {
      "title": "Fu Manchu",
      "content": "Fu Manchu Made famous by the character Dr. Fu Manchu, this mustache is similar to a Dalí. The difference is that a wide gap is shaved at the philtrum, and the handles are styled to hang straight down. The Fu Manchu is only connected to the face at the top corners of the mouth. [13] X Research source Growing Steps: Grow your mustache the same way you would for a standard Dalí. Add a wide gap at the philtrum to separate the handles so that the hair only grows at the top corners of your mouth. Styling Steps: Shave your Fu Manchu daily to keep its shape. Use a medium-hold wax to shape the handles into points, then allow them to hang down naturally. Works Best For: Rectangle, oval, heart-shaped Less Flattering For: Triangle, square, oblong Famous Examples: Dr. Fu Manchu"
    },
    {
      "title": "Horseshoe",
      "content": "Horseshoe Sometimes mistaken for a Fu Manchu, the horseshoe mustache is shaped like an upside-down U and extends down to your chin, using cheek growth. Unlike a Fu Manchu, which is only attached to your face at two points above your lip, the horseshoe is grown above your lip and down two vertical lines on either side of your face. [14] X Research source Yanchun says the horseshoe mustache is becoming popular and that he’s “starting to see it a lot more.” Hybrid mustaches are part beard, part mustache, meaning the styles utilize beard hair, as well. Growing Steps: Grow a full beard or a circle beard , which usually takes 3-6 months. Once you’ve achieved your desired length, shave off the goatee, soul patch, and mutton chops. Keep a vertical line of hair on both of your cheeks, about the same width as your mustache. Styling Steps: Shave any hair that isn’t a part of your desired shape. Use beard-trimming scissors to keep hair out of your mouth or allow the hair to grow longer for a bushier look. Works Best For: Round Less Flattering For: Diamond and oblong Famous Examples: Hulk Hogan, Jared Allen, Aaron Rodgers, Sam Elliott, Danny Espinosa, John Lennon"
    },
    {
      "title": "Zappa",
      "content": "Zappa Made famous by Frank Zappa, the Zappa is a shortened version of the horseshoe, with the edges extending about halfway between the bottom of your mouth and the tip of your chin. Zappas also include a soul patch. [15] X Research source Growing Steps: Grow a Zappa the same way you would a standard horseshoe mustache. Shave off the goatee and mutton chops, and leave a vertical line of hair on both of your cheeks, as well as a soul patch under your bottom lip. Styling Steps: Groom your Zappa as you would a horseshoe mustache, but keep the ends of your ‘stache shorter so that they don’t extend all the way to your chin. Trim and maintain your soul patch, as well. Works Best For: Round Less Flattering For: Diamond and oblong Famous Examples: Frank Zappa"
    },
    {
      "title": "Imperial",
      "content": "Imperial Similar to the handlebar or Hungarian mustache, the Imperial mustache incorporates upper cheek hair to create a thicker handle. The mustache connects with the cheek hair at the edges of the mouth and curls straight up. Unlike the handlebar, the ends of the Imperial mustache are not shaped to a point; instead, they have a more natural, fuller shape. [16] X Research source Growing Steps: Grow out a full mustache and beard, which typically takes 4-6 months to achieve the desired thickness. When you have enough length for the handles, shave the rest of the beard, leaving a small amount of cheek hair at the edges of your mouth so you can incorporate it into the base of your handlebars. Styling Steps: Trim your mustache daily to keep it clean and neat, and comb the handlebars upward each day to train them to curve properly. Apply a mustache wax to hold the style in place, leaving the ends of the handles full. Works Best For: Triangle, oval, oblong, square Less Flattering For: Round and heart-shaped Famous Examples: Kaiser Wilhelm II"
    },
    {
      "title": "Beardstache",
      "content": "Beardstache The beardstache is a combination of a full mustache with a bit of stubble, and it can be worn with any mustache style to achieve your desired look. The stubble gives your cheeks more definition while allowing your mustache to be the star of the show. Some popular mustache styles to use include the chevron, lampshade, walrus, and English. [17] X Research source Growing Steps: Grow your preferred mustache according to its instructions and trim your beard so that it’s stubbly rather than a full beard. Styling Steps: Groom your mustache according to your style’s instructions. Shave your beard every few days to a few weeks to maintain your stubble . Works Best For: Depends on the mustache style you choose Less Flattering For: Depends on the mustache style you choose Famous Examples: N/A"
    },
    {
      "title": "Determine your face shape.",
      "content": "Determine your face shape. While you can rock any mustache you want, some styles look better on certain face shapes. The style and thickness of your mustache can complement your face proportions and features, so determine your face shape to decide which styles would work best for you. [18] X Research source Round faces are roughly as wide as they are long, with soft features and a rounded jawline. Heart-shaped faces are wider at the forehead and cheekbones and taper down to a narrow chin. The cheekbones are usually the widest part of the face. Oval faces are longer than they are wide, with a rounded jawline and forehead. Rectangular faces are longer than they are wide, with a prominent jawline and high forehead. There is generally equal width across the forehead, cheekbones, and jawline. Square faces are characterized by a strong jawline that is roughly the same width as the forehead and cheekbones. Triangle faces have cheeks and a forehead that are slightly wider than the chin, creating an upside-down triangle shape. Diamond faces are wide at the cheekbones and narrow at the forehead and jawline and are longer than they are wide. Oblong faces are significantly longer than they are wide, with the forehead, cheekbones, and jawline roughly the same width."
    },
    {
      "title": "Consider your facial features.",
      "content": "Consider your facial features. In addition to complementing your face shape, certain mustache styles can also bring attention to or even out certain facial features. For example, if you have thin lips, you may prefer a bold, thick mustache to create balance. If you have soft features, you may prefer a mustache with sharp edges. Choose a style that brings out your best features. When it comes to choosing your mustache, Rivas says, “It really depends on the style you’re going for, the shape of your face, and if you’re wearing a beard. In my case, I wear a goatee, but if I take off the goatee, then I have to make my mustache a certain shape so it fits my face better.”"
    },
    {
      "title": "Decide how much maintenance you’re willing to do.",
      "content": "Decide how much maintenance you’re willing to do. While all facial hair requires a bit of upkeep, some mustaches are much more high-maintenance than others. If you don’t want to constantly style your mustache , consider choosing a natural style, like a chevron. If you’re fine with spending extra time on your ‘stache, go for something more elaborate, like a handlebar."
    },
    {
      "title": "Pay attention to your hair growth.",
      "content": "Pay attention to your hair growth. Some people simply aren’t able to grow large, thick mustaches, and that’s okay! [19] X Research source However, it is important to keep your growth patterns in mind when choosing a mustache style. If you easily grow thick facial hair, a walrus or handlebar could be perfect for you. If your facial hair is thin and wispy, however, a pencil mustache may be easier."
    },
    {
      "title": "Having unrealistic expectations",
      "content": "Having unrealistic expectations Mustaches don’t grow overnight, so it’s important to have patience. Don’t expect to have a long, thick mustache in a week or two. On average, facial hair grows half an inch per month, so growing a prominent mustache usually takes at least 2-3 months. [20] X Research source Longer mustaches, like the walrus, often take 6 months or longer. Don’t get frustrated if you don’t see results as quickly as you’d like."
    },
    {
      "title": "Trimming incorrectly",
      "content": "Trimming incorrectly When you first start growing a mustache, there may be a lot of trial and error when it comes to proper trimming. A full mustache consists of different lengths of hairs, so how you trim your mustache depends on where you are in the growing process. In the early growth stages, use beard-trimming scissors to snip the hair closest to the lipline while letting the hair closest to your nose continue to grow. [21] X Research source Beard-trimming scissors generally work better than electric trimmers, as it’s easier to get into tight spaces. With electric trimmers, you risk cutting too much bulk out of your mustache. Before trimming your mustache, Yanchun says, “You should probably wash it. If you have a beard shampoo, that’s better, but if you have regular hair shampoo, that’s fine. Condition the mustache to soften the hairs, and then make sure you comb it really well.” Yanchun also says to be careful when using a beard trimmer: “The mirror can lie a lot, and sometimes things are closer or farther away [than they appear]. Everything’s backward in the mirror as well. So if you sneeze or have a shaky hand… you can take a chunk right out of [your hair].”"
    },
    {
      "title": "Not using products",
      "content": "Not using products While some mustaches require less maintenance than others, they all require at least some upkeep. If you don’t use products, your mustache and the skin underneath may become too dry and irritated. Use products like beard oils and balms to keep your mustache hydrated and nourished. [22] X Research source"
    },
    {
      "title": "Mustache wax",
      "content": "Mustache wax Mustache wax is highly important for any mustaches that require a lot of styling, like handlebars. Mustache waxes come in different strengths, so you can easily find one that works for the thickness of your facial hair. Use a lighter wax on more natural styles, like the Hungarian, or a stronger wax for elaborate styles like the handlebar, English, or Dalí. [23] X Research source Rivas says, “If you want a longer, fuller mustache, you could apply some mustache wax to shape it or a little bit of beard oil to give it a little bit of shimmer.”"
    },
    {
      "title": "Beard balm",
      "content": "Beard balm Beard balm contains natural oils and butters that help keep your facial hair and skin hydrated. Apply beard balm to your mustache to soften and moisturize it. The oils in the balm will also help reduce itchiness, dandruff, and dryness in the skin underneath. [24] X Research source"
    },
    {
      "title": "Beard-trimming scissors",
      "content": "Beard-trimming scissors While it’s possible to trim mustaches with electric trimmers, a good pair of beard-trimming scissors allows you to easily groom hard-to-reach areas without mishaps. Use these scissors to keep your facial hair as neat and precise as possible."
    },
    {
      "title": "Boar’s hair travel brush",
      "content": "Boar’s hair travel brush Boar’s hair bristles help keep your facial hair healthy by evenly distributing oils throughout the hair and by exfoliating the skin. Boar’s hair brushes are also great for training your mustache to curve a certain way, so they’re especially beneficial if you’re growing a thick, curled mustache like a Hungarian."
    },
    {
      "title": "Pocket comb",
      "content": "Pocket comb Pocket combs are great for keeping your mustache neat and clean while on the go. Comb out any food or debris and keep your ‘stache tangle-free. Because they’re so small, it’s easy to carry a pocket comb wherever you go. [25] X Research source"
    }
  ]
}