{
  "url": "https://www.wikihow.com/Prepare-for-Bird-Flu-Pandemic",
  "title": "A Bird Flu Pandemic Prep Guide",
  "steps": [
    {
      "title": "Gather and store enough supplies to last you about 6 weeks.",
      "content": "Gather and store enough supplies to last you about 6 weeks. Stock up on food (including non-perishable foods), medical and health supplies, and anything else you and your family may need to last through a potential lockdown. There’s no guaranteed length of time a potential government-mandated quarantine will last (as we learned during the Covid-19 pandemic), but experts recommend setting aside enough supplies to last about a month and a half. [1] X Research source Gather plenty of non-perishable foods—like canned foods and juices, rice, dried beans, granola bars, peanut butter, and dry cereal—as these will last a long time without going bad. Stock up on basic first aid kit items like bandages, PPE (including N95 masks), and nonprescription drugs, including cough and cold medicines, vitamins, stomach remedies, pain relievers, and fluids with electrolytes. Most people won’t be able to just buy all of the supplies they need all in one go. Instead, start collecting supplies in small amounts whenever you shop."
    },
    {
      "title": "Create an emergency plan with your loved ones.",
      "content": "Create an emergency plan with your loved ones. Talk with your loved ones—both the ones you live with and perhaps ones you don’t—about your plans should a pandemic occur. Specifically, discuss where you will stay and what you will do if anyone in your family should get sick. [2] X Research source For instance, you might designate a specific room in your house as a “sick room” should someone contract the illness. If you’re a co-parent, you might discuss with your partner who would take care of your child should they get sick. If you have small children, communicate with them about best practices they can implement to avoid getting sick themselves. Be aware of any important medical information relevant to your family, including any allergies, their blood types, current prescriptions and dosages, and current and past medical conditions."
    },
    {
      "title": "Protect pets from possible infection.",
      "content": "Protect pets from possible infection. Bird flu has been known to affect cats and dogs, and cats are especially susceptible to HPAI. [3] X Trustworthy Source State of Massachusetts Official website for the State of Massachusetts Go to source To keep your pets as safe as possible, keep them indoors when possible to prevent exposure to infected wildlife. Additionally, avoid feeding them unpasteurized milk or raw meat."
    },
    {
      "title": "Share your knowledge with your friends and neighbors.",
      "content": "Share your knowledge with your friends and neighbors. Have conversations with your friends and loved ones about your plans and ideas to stay safe during a potential pandemic. But don’t stop there: share what you’ve learned with your neighbors as well to help ensure everyone remains healthy and informed. [4] X Research source Want to really make a difference in your community (and the world)? Consider volunteering with local emergency preparedness groups, such as your local Red Cross branch. [5] X Research source"
    },
    {
      "title": "Avoid animals, people, and surfaces that have come in contact with bird flu.",
      "content": "Avoid animals, people, and surfaces that have come in contact with bird flu. Most people who get bird flu get it by coming into contact with infected animals. As much as you can, avoid contact with dead or sick wild birds, poultry, and other animals and only observe them from a distance. If you can’t avoid contact with dead or sick animals, be sure to wear PPE . [6] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Don’t touch surfaces that may have been contaminated with saliva, feces, or mucus from animals suspected of carrying bird flu. Avoid consuming raw milk or milk products. Instead, only consume pasteurized milk and foods made from pasteurized milk. Cook all poultry, eggs, and beef to a safe internal temperature prior to consuming it to ensure you kill any viruses and bacteria."
    },
    {
      "title": "Practice good hygiene.",
      "content": "Practice good hygiene. Be aware of germs and wash up often and thoroughly to ensure you minimize the spread of any viruses. [7] X Research source Wash your hands regularly throughout the day (and whenever you use the restroom) for about 20 seconds at a time with warm water and soap. This isn’t just a good tip during a pandemic—it’s a good tip all the time, to prevent illness of all sorts! Additionally, avoid handling wildlife, especially sick or dead birds and other animals. [8] X Trustworthy Source State of Massachusetts Official website for the State of Massachusetts Go to source"
    },
    {
      "title": "Bird flu is spread through direct or indirect contact with an infected bird.",
      "content": "Bird flu is spread through direct or indirect contact with an infected bird. Bird flu is transmitted from infected birds to other animals, and potentially to humans, in two possible ways: directly from infected birds or from avian influenza A virus-contaminated environments, or through an intermediate host (for instance, another animal who contracts the virus from a bird and spreads it). [9] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Contact your health care provider and local public health department ASAP.",
      "content": "Contact your health care provider and local public health department ASAP. As soon as you come into contact with an infected animal or suspect you may have bird flu, reach out to your doctor or public health department to be tested and, if necessary, prescribed flu antivirals (oseltamivir). Bird flu is usually treatable in people who seek treatment within 48 hours. [10] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you suspect your chickens have bird flu , quarantine the sick birds for at least 2 weeks. If you suspect your pet has bird flu, quarantine them and reach out to your veterinarian immediately for treatment. Symptoms of bird flu in humans include eye redness, mild fever, cough, sore throat, runny nose, body aches, headaches, and fatigue, according to the CDC. [11] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Symptoms of bird flu in birds include sudden death, low energy, loss of appetite, body swelling, lower egg production, soft-shelled/misshapen eggs, nasal discharge, runny nose, sneezing, lack of coordination, and diarrhea. [12] X Research source Symptoms of bird flu in cats and dogs include fever, lethargy, low appetite, reddened or inflamed eyes, discharge from the eyes and nose, difficulty breathing, neurologic signs, like tremors, seizures, incoordination, or blindness. [13] X Research source"
    },
    {
      "title": "What exactly is bird flu?",
      "content": "What exactly is bird flu? Bird flu (aka avian flu) is a highly contagious influenza virus that spreads among wild birds. The current strain circulating is Highly Pathogenic Avian Influenza (HPAI) H5N1, named for two proteins on its surface. Avian flu typically spreads first among wild water birds (like geese, ducks, gulls, and shore birds). The virus is carried in the birds’ intestines and respiratory tract, and then shed in its saliva, feces, and mucus. [14] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Though the virus typically starts in wild birds, it’s easily spread to domestic poultry , like chickens, ducks, and turkeys, as well as cats, dogs, and cows."
    },
    {
      "title": "Can humans get it?",
      "content": "Can humans get it? Yes, humans can get bird flu , but it’s not common. When a virus mutates, it may be able to move from its initial host (i.e., birds) to humans or other animals, but as of now, the current strain of bird flu isn’t easily transmitted to people. People who have direct contact with animals infected with bird flu are most at risk of becoming infected themselves. [15] X Trustworthy Source State of Massachusetts Official website for the State of Massachusetts Go to source"
    },
    {
      "title": "Is bird flu treatable?",
      "content": "Is bird flu treatable? Bird flu isn’t treatable in animals, but it is treatable in humans who seek medical attention as soon as possible—ideally, within 48 hours of noticing symptoms or being exposed to the virus. Reach out to your health care provider and your local public health department to be tested as soon as you suspect you may be infected. People showing signs of bird flu will be treated with flu antivirals (oseltamivir). [16] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source There isn’t currently a vaccine for bird flu."
    },
    {
      "title": "What is the bird flu mortality rate for people and animals?",
      "content": "What is the bird flu mortality rate for people and animals? The mortality rate for birds infected with HPAI bird flu is almost 100%, according to the CDC. [17] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source For people, the mortality rate is closer to 50%. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Do N95 masks protect against bird flu?",
      "content": "Do N95 masks protect against bird flu? Yes, N95 masks can be very effective at protecting against bird flu, because the \"pores\" in the mask are small enough that the virus cannot pass through. [19] X Research source However, to be safest, continue to practice good hygiene and avoid infected people and animals when possible."
    },
    {
      "title": "What qualifies as a flu pandemic?",
      "content": "What qualifies as a flu pandemic? A pandemic is a virus that spans multiple continents and affects a great number of people. [20] X Research source When a pandemic happens, it can restrict travel and cause medical and government services to become overloaded. [21] X Research source An epidemic, on the other hand, refers to a disease that rapidly spreads among a contained area, such as a specific country. [22] X Trustworthy Source American Lung Association Nonprofit health organization dedicated to improving lung health through education, advocacy, and research Go to source"
    },
    {
      "title": "Is there likely to be a bird flu pandemic?",
      "content": "Is there likely to be a bird flu pandemic? The current risk of a bird flu pandemic is still low, but it’s not impossible. People rarely contract bird flu; however, as of January 2025, 68 people in the United States have contracted bird flu, and one has died. Staying informed by checking the news or the Center for Disease Control’s website is one of the best ways to keep updated as the bird flu situation develops. [23] X Research source"
    }
  ]
}