{
  "url": "https://www.wikihow.com/Run-a-Marathon",
  "title": "How to Run a Marathon",
  "steps": [
    {
      "title": "Begin training at least 16-24 weeks before the marathon.",
      "content": "Begin training at least 16-24 weeks before the marathon. Register for the marathon and start training at least 6 months before race day. Even for experienced athletes, running a marathon requires lots of preparation, and proper training is a key part of injury prevention. [1] X Research source Keep in mind you should already have experience with long-distance running before attempting a marathon. Marathon training plans generally assume you already run 3 times per week and can run for around 10 miles (16 km) at a time. Specific requirements vary by race. In general, you need to be able to run a total of 15 to 25 miles (24 to 40 km) per week and have previously run 5K and 10K races. Some races also have minimum qualifying times. [2] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source If don’t regularly run long distances, check with your doctor before starting a new exercise routine."
    },
    {
      "title": "Run 3 training sessions per week with alternating difficulties.",
      "content": "Run 3 training sessions per week with alternating difficulties. There are a variety of marathon training plans, but they share a few basic elements. To increase your stamina gradually and avoid injury, run 3 times per week with a rest day between each session. Do a long distance run just once a week, and focus on speed and pacing on the other days. For instance: [3] X Research source Tuesday: Run a total of 8 alternating 200 m to 400 m intervals at jogging and sprint speeds. Your target intensity for speed day is 80 to 100% of your max heart rate. Thursday: Run at a brisk, mid-tempo pace, starting at 3 miles (4.8 km) in the first week of training. Your target intensity is about 70% of your max heart rate. Saturday: Run a slow-tempo pace, starting at 10 miles (16 km) in the first week of training. For long run day, your target intensity is about 60% of your max heart rate. To calculate your max heart rate, subtract your age from 220. Wear a fitness monitor to keep track of your heart rate as you run. [4] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Try to build up your stamina by no more than 10% per week,in time or in miles. [5] X Expert Source Francisco Gomez Fitness Coach Expert Interview. 24 October 2019."
    },
    {
      "title": "Warm up",
      "content": "Warm up and cool down before and after your runs. Walk briskly or jog lightly for 5 to 10 minutes to get your body ready for exercise. After a run, walk or jog for another 5 to 10 minutes to ease your body back to a resting state. [6] X Research source Warming up and cooling down can help prevent injury and leg cramps. Stretching your legs after a run can also help your muscles recover. [7] X Expert Source Francisco Gomez Fitness Coach Expert Interview. 24 October 2019."
    },
    {
      "title": "Increase your distances by 10% to 20% per week for about 10 weeks.",
      "content": "Increase your distances by 10% to 20% per week for about 10 weeks. [8] X Expert Source Francisco Gomez Fitness Coach Expert Interview. 24 October 2019. Increasing distances too quickly is a common mistake. Instead, run at each tempo for gradually longer distances. For instance, add 1 to 2 miles (1.6 to 3.2 km) to your long day until you can run for 20 to 22 miles (32 to 35 km). [9] X Research source If you miss a training session, don’t try to run on back-to-back days. If you miss a week, don’t try to double up your distances the next week. Every month or so, go easy on yourself and run the distances you ran in week 1. Your body will need extra recovery time as you increase the time you spend on your legs."
    },
    {
      "title": "Enter 5K, 10K, and half-marathon races during training.",
      "content": "Enter 5K, 10K, and half-marathon races during training. Running shorter races can help you learn what to expect on an actual race day. Look online for races and incorporate them as long run days in your training program. Don’t run more than 3 half-marathons in a 6-month period and don’t run any races within 3 weeks of the marathon. Incorporating shorter events in your program will help you know what to expect on race day. From check-in logistics to adrenaline rushes, races involve variables that you can’t plan for simply by running on your own."
    },
    {
      "title": "Decrease your distances by 25% to 50% per week in the last 3 weeks.",
      "content": "Decrease your distances by 25% to 50% per week in the last 3 weeks. Taper your training sessions toward the end of the program so you’ll be fully recovered and ready for the big day. Marathon training plans are usually at least 16 weeks; your longest run should take place around week 13. Scale down weeks 14 and 15, then do 1 to 2 light 15 to 30-minute runs during week 16. [10] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source For example, if you got to a peak long day run of 22 miles (35 km) in week 13, run 15 miles (24 km) on long day in week 14, and 10 miles (16 km) in week 15. Don’t run the day before the race. Remember to keep your runs light during week 16."
    },
    {
      "title": "Refuel with a healthy snack or meal within 15 minutes after a run.",
      "content": "Refuel with a healthy snack or meal within 15 minutes after a run. To promote muscle recovery, eat right after you’ve finished running. That goes for training sessions and the big race. Go for high-carb or high-protein items, such as fruit, yogurt, whole grain bread, brown rice, legumes, poultry, and fish. Never go more than 90 minutes after a run without eating. Your muscles refuel most efficiently soon after strenuous activity."
    },
    {
      "title": "Maintain a diet packed with complex carbohydrates during training.",
      "content": "Maintain a diet packed with complex carbohydrates during training. Healthy, high-carb foods should comprise about 60 to 70% of your diet. For a 2500 calorie diet, that means you should consume 1500 to 1750 calories, or about 375 to 440 grams of carbs per day. Good sources of complex carbs include fruits, veggies, beans, brown rice, and whole grain bread and pasta. High-carb options could include a whole grain bagel with egg and cheese for breakfast, a whole grain pasta salad for lunch, pieces of fruit and nuts for snacks, and sides of brown rice and steamed veggies at dinner. Complex carbs supply your muscles with glycogen, which is a substance your body uses to store energy and deliver it to muscles."
    },
    {
      "title": "Eat at least 4 to 6 ounces (110 to 170 g) of protein per day.",
      "content": "Eat at least 4 to 6 ounces (110 to 170 g) of protein per day. Go for lean protein sources, such as poultry, fish, and legumes. As a rule of thumb, runners require about 1.5 grams of protein per kilogram of body weight (about 0.7 grams per pound). [11] X Research source For example, a runner who weighs 170 pounds (77 kg) would need about 4 ounces (119 grams) of protein per day. A 6 ounce (170 g) serving of chicken breast, a 5 ounce (140 g) salmon fillet, 1 cup (172 g) of steamed soybeans, and 2 large eggs would meet that daily need. Overlooking protein requirements is a common mistake among runners. Protein is needed for muscle strength and durability. Many protein-rich foods also contain iron, and consuming too little iron leads to muscle fatigue."
    },
    {
      "title": "Monitor your urine to make sure you’re staying hydrated.",
      "content": "Monitor your urine to make sure you’re staying hydrated. As a rule of thumb, try to drink about at least 8 cups (1,900 mL) of fluids per day. The exact amount you need to drink depends on a variety of factors, and your urine is the best way to gauge your hydration level. You’re hydrated if it’s light in color, and you’re dehydrated if it’s darker. [12] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source During a run, aim to drink about 1 cup (240 mL) every 15 to 20 minutes. Never wait until you’re thirsty to drink; if you’re thirsty, you’re already dehydrated."
    },
    {
      "title": "Consume a healthy meal and 2 cups (470 mL) of fluids before the race.",
      "content": "Consume a healthy meal and 2 cups (470 mL) of fluids before the race. To hydrate your body on race day, drink 2 cups (470 mL) of water or a sports drink 2 hours before the race's start time. An hour before the race, eat a 300-calorie, high-carb, low fat meal to boost your energy reserves. [14] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source For example, have a whole grain bagel with peanut butter and a banana or pasta with chicken and zucchini. Be sure to avoid items that might upset your stomach. If, for instance, dairy products give you trouble, steer clear of yogurt, milk, or cheese on race day."
    },
    {
      "title": "Get plenty of sleep during the week of the marathon.",
      "content": "Get plenty of sleep during the week of the marathon. Do your best to sleep for at least 7 to 9 hours of sleep each night leading up to the race. You might be anxious or excited the night before the race and find it hard to sleep. If you get plenty of rest in the days prior, a restless night before the race will have less of an impact. Set aside 1 to 2 hours before bed to do a relaxing activity, like reading or listening to soothing music. Do your best to keep your mind off of the race, day-to-day responsibilities, and any other sources of anxiety. Keep your room quiet and dark and, if possible, set the temperature to around 68 °F (20 °C). Don’t drink caffeine in the evening, and avoid eating a heavy meal within 3 to 4 hours of going to bed. Before bedtime, have a healthy snack packed with complex carbs, like cheese and whole grain crackers, whole grain cereal, or a banana."
    },
    {
      "title": "Check the weather forecast and dress appropriately.",
      "content": "Check the weather forecast and dress appropriately. If it'll be cold, dress in layers that you can remove as necessary. In hot weather, wear breathable, lightweight, and light-colored clothing. Go for moisture-wicking fabrics, especially if it's chilly. Avoid fabrics that trap moisture, such as cotton. Trapped moisture in cool weather can give you the chills. If you need to shed layers on the run, wear clothing that you're okay with losing or leaving by the side of the road. It's a good idea to ask loved ones to stand at designated spots in case you need a quick change of clothes or socks."
    },
    {
      "title": "Pack a runner's belt and bag with your essentials.",
      "content": "Pack a runner's belt and bag with your essentials. Assemble energy bars or gels, water, sunscreen, your fitness monitor (if you use one), sunglasses, a change of clothes, and any other necessities the night before so you’re not scrambling on race day. Pack items that you'll need on you during the race, such as the fitness monitor and energy packets, in the belt. Store supplies you'll need before and after the marathon in a bag or backpack. If necessary, make arrangements with a friend or relative to hold onto your stuff while you run. Check the marathon website beforehand and make sure bags are allowed. You may only be allowed to store items in a clear plastic bag."
    },
    {
      "title": "Arrive at the race early and check in as directed.",
      "content": "Arrive at the race early and check in as directed. To keep your nerves in control, wake up early and give yourself plenty of time to eat, get to the check-in area, and mentally prepare yourself for the race. Give yourself at least 15 to 30 minutes extra time to account for traffic, trouble parking, or other variables. When you arrive, head to the designated check-in area to register and receive your number. [15] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source"
    },
    {
      "title": "Pace yourself, especially during the first 10 miles (16 km).",
      "content": "Pace yourself, especially during the first 10 miles (16 km). [16] X Expert Source Francisco Gomez Fitness Coach Expert Interview. 24 October 2019. Your adrenaline levels will spike on race day, and that rush can cause you to push too hard at the start. Use your excitement to stay motivated, but keep it under control. Remain conscious of your pacing, check your heart rate, and hold back in the first half of the race to conserve energy. [17] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source During training, you’ll get a feel for the length of time you can stay on your legs and the pace you need to keep in order to stay in the race. [18] X Expert Source Francisco Gomez Fitness Coach Expert Interview. 24 October 2019. Track your minutes per mile or kilometer closely to stay on target. For the average runner with a goal to finish in 4 hours, the target pace in the first half of a marathon is 8 minutes and 30 seconds (5:16 per km)."
    },
    {
      "title": "Slow your pace toward the end of the race to avoid overexertion.",
      "content": "Slow your pace toward the end of the race to avoid overexertion. Try to maintain your pace or slow it a bit up to mile 20 (32 km). Then slow down 30 seconds to a minute to push through the last leg. If, for instance, you're aiming for a 4-hour time, try to run at 9 minutes 30 seconds per mile (5:54 per km) from mile 20 (32 km) until the finish line. [19] X Trustworthy Source University of California San Francisco Health Center Research hospital associated with UCSF, a leading medical university, providing innovative patient care and public health resources Go to source Additionally, make sure you've fueled up with energy bars or gels by the race's midpoint. If you don't eat something until mile 18 (29 km), you'll crash by mile 20 (32 km)."
    },
    {
      "title": "Use positive visualizations to stay motivated.",
      "content": "Use positive visualizations to stay motivated. Keep your goal in mind, picture yourself crossing the finish line, and imagine the joy and pride you’ll feel. Channel energy from spectators and use their cheering to push forward. If you feel like you're hitting a wall, stay positive and visualize yourself blasting through it. [20] X Research source Above all, have fun. Enjoy the challenge, and take pride in the fact that you’re pushing yourself to your limits!"
    }
  ]
}