{
  "url": "https://www.wikihow.com/Popcorn-Your-Ceiling",
  "title": "How to Popcorn Your Ceiling",
  "steps": [
    {
      "title": "Remove the furniture from the room.",
      "content": "Remove the furniture from the room. Before you apply a popcorn ceiling, you should remove all of the furniture from the room. The paint mixture may drip while you are putting it on the ceiling and you don’t want it to ruin your furniture. If you have a few pieces of furniture that are too heavy to move, you can cover them with a drop cloth for protection. Tape the cloths to the floor."
    },
    {
      "title": "Cover your floors with a drop cloth.",
      "content": "Cover your floors with a drop cloth. You may also want to protect your floors from potential drips. Lay a drop cloth down on the floors and tape them in place. This way, any drips will land on the cloth instead of your finished floors. [1] X Research source"
    },
    {
      "title": "Clean the ceiling with soap and water.",
      "content": "Clean the ceiling with soap and water. Fill a bucket with warm soapy water and use a sponge to wipe your ceilings. This will remove any dust, dirt, or grime that may be stuck on your ceiling. You will likely need to stand on a step ladder to reach the ceiling. Be careful. Have someone keep the ladder steady, if necessary. [2] X Research source If you’re removing old popcorn, use a pump sprayer to spray it with water. Let the water sit for 4 minutes, then scrape off the popcorn."
    },
    {
      "title": "Apply painter’s tape and newspaper to the top edge of the wall.",
      "content": "Apply painter’s tape and newspaper to the top edge of the wall. You can protect the walls by applying newspaper secured with painter’s tape to the edges. This way, if the top of the wall is accidentally sprayed with the popcorn mixture it will not stick to the wall. [3] X Research source You may also want to hang a drop cloth from the tape for full protection for your walls."
    },
    {
      "title": "Prime your ceiling.",
      "content": "Prime your ceiling. Purchase a drywall primer from your local hardware store and apply a coat of primer before you begin to popcorn your ceiling. The primer will help the popcorn mixture adhere to the ceiling, making the application process easier. [4] X Research source Wait 24 hours for the primer to dry before beginning the next part of the process."
    },
    {
      "title": "Open the windows for ventilation.",
      "content": "Open the windows for ventilation. Is is always a good idea to work with your windows open. This will give the room some airflow and will help with ventilation while you are working with the popcorn mixture. If possible, place a fan in the window so it blows outward to eliminate some of the dust."
    },
    {
      "title": "Purchase popcorn ceiling spray.",
      "content": "Purchase popcorn ceiling spray. This is typically called \"textured ceiling spray.\" You can buy this type of product at any home improvement store, such as Home Depot. You might also find it at your local hardware store, or online. Make sure that you purchase an asbestos-free product. If you can't tell from the label, ask a salesperson. A light application of this product will typically cover about 250 square feet."
    },
    {
      "title": "Mix together the popcorn ceiling spray with water.",
      "content": "Mix together the popcorn ceiling spray with water. In a large bucket combine the texture ceiling mix with water. Follow the directions provided on the textured mix to get the appropriate water to mixture ratio. [5] X Research source"
    },
    {
      "title": "Stir the mixture.",
      "content": "Stir the mixture. Use a drill with a paddle bit to stir the mixture. You want it to be fairly thick with small lumps, almost like the consistency of cottage cheese or porridge. [6] X Research source Make sure to follow the manufacturer's instructions for using the drill. You don't want to accidentally hurt yourself, so use caution. If you don't have a drill, you can rent one from the hardware store."
    },
    {
      "title": "Adjust to get the right consistency.",
      "content": "Adjust to get the right consistency. If the mixture is too runny, it will not adhere to the ceiling and will crack. You want it to be thick, but still easy to stir. Add a bit more of the textured ceiling mixture until you reach the desired consistency. [7] X Research source Alternatively, if it is too thick, you can add a bit more water."
    },
    {
      "title": "Fill the texturing gun with the ceiling spray.",
      "content": "Fill the texturing gun with the ceiling spray. Fill the texture gun about half way with the ceiling mixture."
    },
    {
      "title": "Test the spray on a piece of cardboard.",
      "content": "Test the spray on a piece of cardboard. Before you begin spraying the ceiling, you can test the spray pattern on a piece of cardboard or drywall. This will give you a feel for the spray gun and you can try making a few even strokes. [8] X Research source"
    },
    {
      "title": "Spray the ceiling evenly in a back and forth motion.",
      "content": "Spray the ceiling evenly in a back and forth motion. To apply the spray to the ceiling, hold the gun approximately 18 inches (46 cm) from the ceiling. Slowly move the gun back and forth in an even manner. This way you will apply the textured ceiling evenly. [9] X Research source Start in one corner and then work your way across the room."
    },
    {
      "title": "Use a trowel to reach the corners and edges.",
      "content": "Use a trowel to reach the corners and edges. If you are having difficulty reaching the corners with the spray, you can use a trowel to push the textured mixture into the corners. Similarly, you can do this along the edges to make sure the popcorn texture covers the entire ceiling."
    },
    {
      "title": "Apply a second coat if desired.",
      "content": "Apply a second coat if desired. Once you have completed the first coat, wait 15 minutes. Then you can apply a second thin coat. You can continue applying additional coats until you reach your desired texture. [10] X Research source Allow the texture to dry for 24 hours before removing the drop cloths."
    }
  ]
}