{
  "url": "https://www.wikihow.com/Make-a-Video-a-Live-Photo",
  "title": "Simple Steps to Convert a Video into a Live Photo",
  "steps": [
    {
      "title": "Open the intoLive app.",
      "content": "Open the intoLive app. This free app makes it easy to turn a video file into a Live Photo. Search the App Store for \"intoLive,\" or go to https://apps.apple.com/us/app/intolive-live-wallpapers/id1061859052 to download it. The built-in features of your iPhone or iPad allow you to save Live Photos as videos, but you'll need a third-party app to do the opposite. Once you download the app, open it, then tap Allow to let the app access your library. If you accidentally tapped Deny , you can edit the permissions in \"Settings.\""
    },
    {
      "title": "Choose the video you want to convert.",
      "content": "Choose the video you want to convert. Tap the video that you want to make a Live Photo. If you need to, tap through the different formats to find your video under the Video tab. [1] X Research source The free version can make Live Photos up to 5 seconds long, but you can pay for an upgrade to make up to 30-second long Live Photos."
    },
    {
      "title": "Tap Make.",
      "content": "Tap Make . You can use this screen to make some light edits to your video before you turn it into a Live Photo if you want to. [2] X Research source Some icons have a symbol to mark them as Pro features (you'd pay to use them)."
    },
    {
      "title": "Select if you want your Live Photo to repeat.",
      "content": "Select if you want your Live Photo to repeat. \"No repeat\" is selected by default, but you can choose a different number. [3] X Research source intoLive will begin making the Live Photo. If you have a longer video, this may take longer than a short video conversion."
    },
    {
      "title": "Tap Save Live Photo.",
      "content": "Tap Save Live Photo . Find the Live Photo in the Photos app on your iPhone or iPad. Set it as your wallpaper , and it'll begin playing when you touch and hold it. [4] X Research source"
    }
  ]
}