{
  "url": "https://www.wikihow.com/Remove-Tea-Stains-from-Carpet",
  "title": "How to Remove Tea Stains from Carpet",
  "steps": [
    {
      "title": "Mix together 1⁄2 cup (120 mL) of cold water with 1⁄2 cup (120 mL) of distilled white vinegar.",
      "content": "Mix together 1 ⁄ 2 cup (120 mL) of cold water with 1 ⁄ 2 cup (120 mL) of distilled white vinegar. Place the mixture in a cup or jar and stir it to combine the ingredients. If the stain is very large, double or triple the recipe to fit your needs. Just be sure to use a ratio of 1 part vinegar to 1 part water. [1] X Research source"
    },
    {
      "title": "Make a creamy paste with 3 parts baking soda to 1 part vinegar.",
      "content": "Make a creamy paste with 3 parts baking soda to 1 part vinegar. Add your baking soda to a small glass or plastic bowl. Next, add in your distilled white vinegar, stirring as you pour. For a small to medium area, try 3 tbsp (43 g) of baking soda mixed with 1 US tbsp (15 mL) of vinegar. Mix the ingredients into a paste. [2] X Research source Aim for a paste that is not so thick that you can’t spread it into the carpet, but not so runny that it just sinks right in. The 3:1 ratio of baking soda to vinegar is a good place to start, but you may need to modify it slightly to get the perfect consistency."
    },
    {
      "title": "Spread the paste onto the stain with a spoon.",
      "content": "Spread the paste onto the stain with a spoon. Avoid rubbing or grinding the paste into the carpet. Instead, imagine you're spreading peanut butter over bread. Once you’ve covered the stain with a layer of your cleaning paste, let it sit for 1-2 minutes. [3] X Research source"
    },
    {
      "title": "Press the paste into the carpet with a damp cloth or sponge.",
      "content": "Press the paste into the carpet with a damp cloth or sponge. Simply dab the carpet with firm but gentle pressure. Don't scrub it in, as this could push the tea stain deeper into the fibers. [4] X Research source"
    },
    {
      "title": "Use a dry towel to remove excess paste.",
      "content": "Use a dry towel to remove excess paste. Once you feel satisfied that the stained area has been saturated, you can lift away the remaining cleaning paste. Scrape the paste toward the center of the stain. Pinch it up with the towel and discard it as you go. [5] X Research source"
    },
    {
      "title": "Pour your vinegar and water mixture onto the stain.",
      "content": "Pour your vinegar and water mixture onto the stain. Add your mixture, a little at a time, to the stain. Use enough to get a fizzing response as the vinegar mixture reacts with the baking soda on the carpet. [6] X Research source"
    },
    {
      "title": "Blot up the excess liquid.",
      "content": "Blot up the excess liquid. As the vinegar fizzes, use a clean cloth to dab the stain and soak up the vinegar and tea. If necessary, add more vinegar and water and keep blotting until the stain is gone and your cloth comes away clean. [7] X Research source You can add more paste if you are no longer getting a fizzy reaction."
    },
    {
      "title": "Flush the carpet with cold water, then dry the area.",
      "content": "Flush the carpet with cold water, then dry the area. Pour a little bit of cold water over the carpet. Dab the area with a clean cloth to remove any remaining baking soda residue. Keep pressing a clean, dry cloth into the carpet to soak up as much water as you can. [8] X Research source Once the carpet has air-dried, vacuum it thoroughly."
    },
    {
      "title": "Make your cleaning solution out of dish detergent, vinegar, and water.",
      "content": "Make your cleaning solution out of dish detergent, vinegar, and water. Combine 1 US tbsp (15 mL) of dish detergent, 1 US tbsp (15 mL) of distilled white vinegar, and 2 cups (470 mL) of cold water. Add your ingredients to a plastic or glass container and mix them thoroughly. [9] X Research source Stir the mixture until all the elements are fully incorporated."
    },
    {
      "title": "Dip a dry, clean cloth into your mixture and dab it onto your stain.",
      "content": "Dip a dry, clean cloth into your mixture and dab it onto your stain. Dip a corner of the cloth into the cleaning solution. Lightly press the cloth into the carpet to saturate the stained area. Make sure all parts of the stain are covered, including any errant drips. [10] X Research source"
    },
    {
      "title": "Use the dry part of your cloth to remove excess moisture from the spot.",
      "content": "Use the dry part of your cloth to remove excess moisture from the spot. Blot the stain to soak up the cleaning solution and the tea. Change to a new, dry cloth as necessary to prevent the stain from spreading. [11] X Research source Repeat the process until the stain is gone."
    },
    {
      "title": "Rinse the carpet with cold water, then let it dry.",
      "content": "Rinse the carpet with cold water, then let it dry. Spritz cold water onto the area, then soak it up with a clean cloth. This ensures that all the soap and vinegar get removed from the carpet, leaving it looking brand new. Allow the carpet to air-dry completely, then vacuum the spot."
    },
    {
      "title": "Spray the spot with cold water.",
      "content": "Spray the spot with cold water. Wet the area with the stain until the carpet is damp but not saturated. Press a damp, clean cloth into the carpet if you don’t have a spray bottle. [12] X Research source Remember that it’s important to use cold water because warm or hot water can worsen the stain."
    },
    {
      "title": "Sprinkle the stain with Borax powder.",
      "content": "Sprinkle the stain with Borax powder. Use a spoon to sprinkle Borax over the surface of the stain. Use enough to thoroughly dust the entire area of the stain, hiding it from view. [13] X Research source Borax is found in grocery stores where it is sold in the laundry and household cleaner sections."
    },
    {
      "title": "Place a wet cloth on top of the Borax.",
      "content": "Place a wet cloth on top of the Borax. Wet a fresh cloth in cold water and then wring out the excess so that it is damp but no longer dripping. Place it on top of the stain so that the entire area is covered. [14] X Research source"
    },
    {
      "title": "Push the curved side of a spoon into the wet cloth.",
      "content": "Push the curved side of a spoon into the wet cloth. Use your spoon to apply pressure on the wet cloth, pushing it into the stained carpet. Work methodically starting in the middle of the cloth and moving outwards in all directions until you've covered the entire stained area. [15] X Research source"
    },
    {
      "title": "Remove the wet cloth, then rinse and dry the area.",
      "content": "Remove the wet cloth, then rinse and dry the area. Blot the area with a clean cloth to soak up the Borax and tea. Then, use a wet cloth or spray bottle to lightly saturate the carpet in cold water. Dab the spot with a dry cloth until most of the moisture and Borax are gone. [16] X Research source Vacuum the carpet once it's completely dry."
    }
  ]
}