{
  "url": "https://www.wikihow.com/Persuade-Your-Parents-to-Let-You-Get-Braces",
  "title": "How to Persuade Your Parents to Let You Get Braces",
  "steps": [
    {
      "title": "Identify reasons you might need braces.",
      "content": "Identify reasons you might need braces. If you want to make the argument to your parents that you should get braces, you ought to be sure about the benefits of braces as well as the indicators that you need them. The signs that can demonstrate you need braces include crowded or crooked teeth, gaps between your teeth, an overbite or underbite, and a crossbite. Keep in mind that in many cases these symptoms will be easily apparent, but not always. In some cases they will not be evident until an orthodontic evaluation has taken place."
    },
    {
      "title": "Understand the potential benefits.",
      "content": "Understand the potential benefits. Once you have identified the signs that indicate braces may be necessary you need to understand what the result of wearing braces would be. Successful orthodontic treatment helps you get the best from your teeth. You will be able to eat and speak more comfortably, bite correctly, and care for your teeth and gums more easily. Having straighter teeth will also improve your smile and can make you feel happier and more confident. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Write down why you want braces.",
      "content": "Write down why you want braces. After you have determined the medical benefits of braces, you should think about why you really want them. If you feel embarrassed or awkward about your crooked teeth be honest with yourself. Remember that most people have teeth that are somewhat crooked, but if your smile is getting you down be sure to include this in the list of reasons why you want braces. The best time to get braces is thought to be when you are around 12 or 13 years old. If you are around this age explain that the time is right. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source When you draw up your list include both objective medical information as well as your own personal feelings about it."
    },
    {
      "title": "Ask your dentist about braces.",
      "content": "Ask your dentist about braces. It's a very good idea to talk to your dentist or orthodontist about your teeth and the benefits of braces. Each person is different so you should talk to an expert in order to get a full understanding of how your teeth will develop over time. If your orthodontist doesn't think you should get braces, it is highly unlikely that your parents will pursue it. Having a dental expert helping you make the argument to your parents will make it much more convincing and harder to ignore. If your dentist agrees that braces would be beneficial for you they will most likely raise this with your parents anyway. If your dentist tells you you really don't need braces you should reconsider."
    },
    {
      "title": "Practice what you want to say.",
      "content": "Practice what you want to say. If you are going to approach your parents to try to convince them that you need to get braces, it's a good idea to take some time to rehearse the sort of things you want to say. You need to be able to express yourself as clearly and articulately as possible, so preparation helps. Go through your list of reasons why you want braces and break it into medical reasons and personal reasons. Demonstrating that you have thought long and hard about it, and put in work to research it, will show your parents that you are serious about it. Be prepared to say things such as \"I have done some research and I think getting braces would really straighten my teeth\", and \"I think having straighter teeth will help me speak more clearly\". You could say \"I understand that wearing braces can be irritating and they are expensive, but I think the long-term benefits justify it\". If you are self-conscious about an underbite or overbite, be honest about it and say something like \"my overbite makes me feel self-conscious and I think getting braces would help\"."
    },
    {
      "title": "Be ready to answer questions.",
      "content": "Be ready to answer questions. If your parents have shown some skepticism in the past about you getting braces, you should be prepared to deal with some questions from them about whether you need braces. They might ask you things such as \"are braces really necessary\", or suggest that you shouldn't be worried about having slightly crooked teeth. It's important that you state your case clearly without being impatient and rude. You could answer by saying something like \"they might seem only slightly crooked to you, but my teeth stop me from smiling\". You could point out that over time they may become more crooked and cause more serious problems that might even require surgery. [3] X Research source You could encourage them to speak to your dentist about it to get a real expert opinion."
    },
    {
      "title": "Pick a good time to talk.",
      "content": "Pick a good time to talk. Once you are well-prepared you should feel confident to go and speak to your parents about braces. Don't jump in before you feel like you have enough information to support your argument and pick a moment when your parents will not be stressed or distracted. Say \"have you got a minute for a chat?\" or \"are you free to talk?\". If you are struggling to find a good time, ask your parents when they will be free to talk to you. Say something like \"I know you're busy, but I could do with a chat. When's a good time?\" [4] X Research source"
    },
    {
      "title": "Adopt the right tone.",
      "content": "Adopt the right tone. When you do get to talk to your parents try to be as confident and clear as you can about why you think you should get braces. Be direct about how you are feeling and encourage your parents to try see the situation from your point of view. Give details on why you are asking them so they can try to better understand your situation and your reasoning. Don't whine or be impatient when you talk to them, be sincere and honest about how you feel. Being friendly and respectful towards your parents will help them to sympathise with your situation. If you act like an adult and are mature and respectful they are more likely to respond to you in that way and take your appeals more seriously. [5] X Research source"
    },
    {
      "title": "Understand that your parents may see things differently.",
      "content": "Understand that your parents may see things differently. You should understand that your parents won't focus on minor crooked teeth in your smile in the same way you do, so they might not understand how it is impacting on you. You can acknowledge this by saying \"I know you think it's not a big deal, but it makes me feel uncomfortable and I find it hard to relax\". [6] X Research source Showing maturity and self-awareness without overstating the influence a brace would have on your happiness and well-being is important. Try to understand your parents' point of view and be sympathetic to it, while maintaining your argument."
    }
  ]
}