{
  "url": "https://www.wikihow.com/Play-on-a-Game-Boy-Advance-SP",
  "title": "How to Play on a Game Boy Advance SP",
  "steps": [
    {
      "title": "Find the charging port.",
      "content": "Find the charging port. You'll find this along the top edge of the SP while the screen is closed. It is rectangular and is located towards the right side."
    },
    {
      "title": "Connect the charging cable to the port.",
      "content": "Connect the charging cable to the port. The charging cable can only be inserted in one direction. Make sure not to force it in."
    },
    {
      "title": "Plug the charger into an outlet.",
      "content": "Plug the charger into an outlet. Make sure that the prongs are fully extended."
    },
    {
      "title": "Wait until the charging light turns off.",
      "content": "Wait until the charging light turns off. The charging light on the side of the Game Boy will stay lit while the device is charging. It will turn off once it is fully charged. You can play while the Game Boy is charging, but it will charge much slower."
    },
    {
      "title": "Close the screen.",
      "content": "Close the screen. It's good practice to close the screen when manipulating the Game Boy to increase stability."
    },
    {
      "title": "Flip the Game Boy so that you're looking at the back.",
      "content": "Flip the Game Boy so that you're looking at the back. The labels should be facing up so that you can read them."
    },
    {
      "title": "Find the cartridge slot.",
      "content": "Find the cartridge slot. You'll find this slot on the back of the Game Boy, along the bottom edge. When you're holding the system as if to play it, the cartridge is upside down on the back."
    },
    {
      "title": "Insert the cartridge with the label facing out.",
      "content": "Insert the cartridge with the label facing out. The label should be facing away from the Game Boy system. You can play Game Boy Advance, Game Boy Color, and Game Boy games. Game Boy and Game Boy Color cartridges will stick out further than Game Boy Advance cartridges, which are flush when inserted."
    },
    {
      "title": "Press firmly until the cartridge clicks into place.",
      "content": "Press firmly until the cartridge clicks into place. Don't force the cartridge in, you should just need some firm pressure to lock it into place."
    },
    {
      "title": "Open the screen.",
      "content": "Open the screen."
    },
    {
      "title": "Push the Power switch towards the screen.",
      "content": "Push the Power switch towards the screen. This will turn the Game Boy Advance SP on. The Power switch can be found along the right edge."
    },
    {
      "title": "Refer to the game's manual for game-specific instructions.",
      "content": "Refer to the game's manual for game-specific instructions. Each game controls differently, but there are only a few buttons so you can likely figure out the controls if you don't have access to the manual. Besides the A and B buttons on the face, you also have the L and R shoulder buttons. Most games use the Start and Select buttons for pausing and menus, but won't use them as controls during gameplay."
    },
    {
      "title": "Press the Backlight button to adjust the brightness.",
      "content": "Press the Backlight button to adjust the brightness. This small button is directly below the screen. Pressing it will turn the backlight on or off. The backlight is useful in low-light conditions to help you see the screen, but will reduce battery life."
    },
    {
      "title": "Connect headphones using a special adapter.",
      "content": "Connect headphones using a special adapter. In order to use headphones on the Game Boy Advance SP, you'll need to connect the headphone adapter to the EXT2 port along the top edge. This is the same port as the charging cable. After connecting the adapter, you can plug headphones into the 3.5mm jack on the other end."
    },
    {
      "title": "Slide the power switch off after you're finished playing.",
      "content": "Slide the power switch off after you're finished playing. Slide the switch back towards you to turn the system off. The Game Boy Advance SP will not turn off automatically when the screen is closed."
    },
    {
      "title": "Slide the game cartridge out of the slot.",
      "content": "Slide the game cartridge out of the slot. You may have to apply a little pressure while sliding to pop it out. Never remove a cartridge while the system is turned on."
    },
    {
      "title": "Close the screen to store or travel.",
      "content": "Close the screen to store or travel. Keeping the screen closed will help prevent damage to the Game Boy when being stored or during travel. Remember, the system does not turn off automatically when the screen is closed."
    }
  ]
}