{
  "url": "https://www.wikihow.com/Rekindle-a-Relationship",
  "title": "How to Rekindle a Relationship",
  "steps": [
    {
      "title": "Laugh together.",
      "content": "Laugh together. Laughter is most definitely contagious, and can help people feel more at ease and relaxed. [1] X Research source Laughing and having a sense of humor can take the pressure off of your relationship and help you cope with the inevitable ups and downs of sharing a life together. Find things that you know your partner will like and find funny. Remember things from your day that made you laugh to share with your partner when you get home. Find a TV show that makes both of you laugh and have a standing date to watch it together."
    },
    {
      "title": "Let your partner know you’re there.",
      "content": "Let your partner know you’re there. Even if it’s not a long conversation, checking in with one another is vital. Remind the other person how you feel and that you are there when he or she needs you. Sending messages to show your level of engagement in the relationship can also help build intimacy. [2] X Research source Don’t forget to say: “I love you.” “I admire you.” “I miss you.” “I’m sorry things are going badly today. Is there any way I can help?” “I can’t wait to see you.” “I hate to see you like this. Can I do anything?”"
    },
    {
      "title": "Come up with new date ideas.",
      "content": "Come up with new date ideas. Move away from dating clichés like dinner and a movie. In a long-term relationship, it’s important to try new things to keep the magic alive. If you do go out to dinner, make an effort to try new restaurants and get dressed up from time to time. Try out the following ideas: [3] X Research source Go out dancing. Host a party. Hit the beach. Go ice skating. Visit hot springs. Do karaoke. Take a cooking class together."
    },
    {
      "title": "Do the ‘little things’.",
      "content": "Do the ‘little things’. Little things can include writing notes to show your affection, taking the trash out, or cooking dinner when your partner is exhausted. These small gestures show that you are attentive to your partner. The ‘little things’ are often couple specific, meaning no two couples will enjoy the same things. The important thing is to be sincere in your gestures and come from the heart. [4] X Research source If you and your partner appreciate movies, plan a special movie night for the two of you, with your favorite snack foods. Surprise your partner with a small gift, such as flowers or a hobby-related item."
    },
    {
      "title": "Have genuine conversations.",
      "content": "Have genuine conversations. While it might have been hard to pull away from each other early in the relationship when you could talk all night long, intimate, engaging conversations may tend to dwindle over time, turning to finances, kids, and to-do lists. Make time to connect and discuss topics that you both are passionate about. Find things that you genuinely connect on, and discuss them. Start a book club for just the two of you. Learn something new about each other by asking “how” and “what” questions. [5] X Research source For instance, “What was middle school like for you?” or “How was it for you when you moved?” Use open-ended questions that allow easy, natural conversation. Then, truly listen and connect to your mate's feelings once again. Don’t criticize your partner for not talking to you. Instead, do something positive like inviting your partner to tell you about his or her day over dinner, a cup of coffee, or a glass of wine. Try saying something like, “I’d really like to know about your day. Let’s sit down and you can tell me all about it.” [6] X Research source"
    },
    {
      "title": "Compliment your partner.",
      "content": "Compliment your partner. Being in a long-term relationship may cause you and your partner to take each other for granted and forget to do or say the sweet things that you used to in the beginning of the relationship. Complimenting your partner will show that you care. [7] X Research source Be specific. Instead of saying “You look nice,” say something like, “I love the way that dress shows off your curves” or “I love the way you look in that shirt.” Rather than saying, “You are so smart”, say, “I admire how intellectual you are and the way you discuss issues so genuinely.”"
    },
    {
      "title": "Focus on what you and your partner have together.",
      "content": "Focus on what you and your partner have together. While it may be easier to focus on the negatives in your relationship, highlighting the positives will help your relationship thrive. It is especially important to focus on why you and your partner fell in love. [8] X Research source For example, you and your partner might have bonded over a shared interest in running, a common faith, or a shared desire to help others. Make a list of all of the things that made you fall in love with your partner and ask your partner to do the same. Then, you can sit down and share lists and reconnect by reliving the beginning of your relationship."
    },
    {
      "title": "Give physical contact every single day.",
      "content": "Give physical contact every single day. Skin-on-skin contact releases a hormone called oxytocin, which increases feelings of intimacy. [9] X Research source Don’t just physically touch as a prelude to sex. Instead, kiss each other goodbye in the morning, embrace when you meet again, and give each other massages as you unwind from a long or trying day. Engage in hand holding and feel free to embrace for long periods of time, especially if either needs to destress."
    },
    {
      "title": "Make small changes to spice up your sex life and reclaim your bedroom.",
      "content": "Make small changes to spice up your sex life and reclaim your bedroom. If you live together, remove some of the clutter from your bedroom: this includes kids' toys, paperwork, and clothes strewn on the floor. Get some candles, buy new sheets, and do anything else it takes to transform your bedroom into an intimate environment. [10] X Research source If you fall asleep to TV, consider taking the TV, laptop, and other electronics out of the bedroom. Create a sense of intimacy by agreeing to disengage with technology while together in the bedroom. If you and your partner are struggling to rekindle your intimate relationship, talk to each other about your individual needs and find ways to bring each other pleasure again. Reader Poll: We asked 286 wikiHow readers about how they’d handle a lack of sex in their relationship, and 59% of them agreed that they’d openly communicate about their needs and find a compromise . [Take Poll]"
    },
    {
      "title": "Send a naughty text.",
      "content": "Send a naughty text. Tell your partner how excited you are to see him or her and reminisce on the last time you spent a night together. Or send a racy picture of yourself. Messages like these can really get your partner revved up! Remember to only send texts that you are comfortable with; never feel pressured to send anything, even to your partner."
    },
    {
      "title": "Build your confidence.",
      "content": "Build your confidence. Having low self-esteem can manifest as feeling like you don’t deserve to be treated well or that things will take a turn for the worst. These thoughts can sabotage the relationship and will eventually become a reality. [11] X Research source Instead of sabotaging your relationship, work on building your confidence and your confidence in your partner. If you’ve been hurt in the past, heal those wounds and validate your worth, knowing that you are deserving of giving and receiving love. Instead of avoiding sexual intimacy because you’re self-conscious about your body, learn to accept yourself as you are. If you choose to make changes to your body (such as losing weight), recognize that being your ideal weight may not change your insecurity and that it’s up to you to feel comfortable in your own skin."
    },
    {
      "title": "Practice forgiveness.",
      "content": "Practice forgiveness. Nothing kills a relationship like holding onto a grudge. If you and your partner have an unresolved issue that is putting a strain on your relationship, then it’s time to forgive each other and move on. Talk to each other openly about it and try to move past it. If you haven’t had success in letting it go before this, it might be time to see a couples’ counselor to help you get your relationship back on track. [12] X Research source There’s nothing wrong with going to counseling, and it can be immensely helpful in finding ways to relate to each other and grow closer emotionally."
    },
    {
      "title": "Spend some time apart.",
      "content": "Spend some time apart. Just because you are committed to one another, doesn't mean you have to spend every waking second together. In fact, spending some time apart will usually improve your relationship by allowing you to blow off some steam, reconnect with friends, and relax. Agree with your partner about how much time you want to spend together versus apart, such as having one night each week of time apart, or one weekend each month. [13] X Research source This choice show be arrived at by mutual agreement. Take a girls' or guys' night out every once in a while, or take a spa weekend away to unwind. Being apart temporarily often sparks up the relationship, raising the anticipation and excitement of being reunited. Don’t drop your activities and hobbies when you’re in a relationship. Continue to paint, dance, draw, or go to the gym, even if your partner doesn’t participate."
    },
    {
      "title": "Go somewhere together.",
      "content": "Go somewhere together. Experiencing a trip together can bring couples closer, especially when the focus is on each other and the relationship. A trip allows you to shift your focus from everyday stressors to each other. You can try for a dream trip, or just a nice weekend out of town. List out places you both have always wanted to see, and choose one that excites both of you. Every day, take steps to get closer to you both getting there. Finally, aim to create new memories, snapping photos and taking videos so you can re-live the memories later. You can go backpacking or camping to enjoy the great outdoors or plan a ritzy vacation away at a high class resort. International travel can be an exciting experience for the two of you! If you have kids, try to at least take one kid-free vacation every year."
    },
    {
      "title": "Be a good listener.",
      "content": "Be a good listener. Take the time and talk to your partner, and more importantly, listen. Engage your partner by asking open-ended questions, then leisurely reflect upon what he or she says. Be open with sharing your feelings, and allow your partner to do the same. [14] X Research source You can practice reflective listening by saying, “I hear you saying that things are difficult between you and your parents” or, “It sounds like you’re feeling really stressed about work.”"
    },
    {
      "title": "Manage stress.",
      "content": "Manage stress. With jobs, families, and other issues that require your time, sometimes the relationship is the part that suffers the most from time taken away. Stress is a normal part of life, but chronic stress causes a spike in cortisol, a hormone that can reduce the desire for physical intimacy. [15] X Research source Needless to say, this can cause damage to your relationship in the long run. Eliminate stressful elements from your life if possible, and combat stress by exercising regularly, doing yoga, or meditating. Encourage your partner to do the same, especially if he or she struggles with stress. Manage your time to avoid the stress caused by rushing to meet a deadline. Take care of tasks as they come up rather than letting them pile up, and use a planner to keep track of obligations. Spend more time doing things that you enjoy. Life can’t be all work and no play, so make it a point to devote at least one day each week to doing what you love."
    },
    {
      "title": "Do a long-term project together.",
      "content": "Do a long-term project together. Find something that will interest both of you and work toward it. Having a long-term goal assures that you will spend time together during your week and can lift you out of the work-family life rut. Some possible projects might be: Train for a sporting event together such as a triathlon. Learn a new language together, then visit a country where it’s spoken. Build something like a boat, a shed, or a garden."
    },
    {
      "title": "Try something new.",
      "content": "Try something new. Trying something novel can increase intimacy. [16] X Research source Choose an activity that neither of you has done before, and maybe even one that’s a little scary. Sharing the experience of having trepidatious misgivings and then going through with an activity anyway will probably bring you closer in ways you never imagined. Plus, the experience will provide a great conversation topic among your friends. Try rock climbing, skydiving or paragliding. Go on a backpacking trip. Take a wild and native foods cooking class."
    },
    {
      "title": "Find ways to focus on the big picture.",
      "content": "Find ways to focus on the big picture. Being in a long-term relationship can lead to focusing only on yourself and your partner. To rekindle your relationship, it may be necessary for you and your partner to get out of this mindset. You may need to find a way to expand your horizons and connect through this experience. Try to engage in a spiritual practice together. If you and your partner share a spiritual belief, then you could attend services together. If not, then perhaps you can explore spiritual beliefs together. Engaging in a spiritual practice may help to reignite the spark between you and your partner. [17] X Research source Consider volunteer work. Volunteering with your partner may also help you to get out of yourselves and bond over the experience of helping others. Try volunteering at a local food bank or animal shelter. Work together to raise money for charity. You and your partner might also be able to change your focus by working towards a charity’s financial goals. Consider helping out with a telethon or run a charity 5K with your partner."
    }
  ]
}