{
  "url": "https://www.wikihow.com/Repair-Hail-Damage",
  "title": "How to Repair Hail Damage",
  "steps": [
    {
      "title": "Park your vehicle in a sunny area.",
      "content": "Park your vehicle in a sunny area. This is a popular technique with car enthusiasts. Heat will cause the metal to expand. As the metal expands, the small dents will pop out. Using nature’s oven will take a long time if you aren’t in a very warm place. The longer your vehicle is exposed to warm sunlight, the more likely this technique will work."
    },
    {
      "title": "Apply hot air to the dents.",
      "content": "Apply hot air to the dents. If you're unable to expose your vehicle to the heat of the sun, you can use a hair dryer. Hold the hair dryer 5 to 7 inches away from the dents for two minute intervals. Carefull not to touch the dryer directly on the car. If the vehicle's paint begins to discolor, stop applying heat immediately. Use wax or a rubbing compound to restore the paint’s color."
    },
    {
      "title": "Apply dry ice to the dents.",
      "content": "Apply dry ice to the dents. The drastic change in temperature should cause the dents to pop out. Dry ice can damage your skin, so wear gloves when handling dry ice. Move the ice around the dented area to rapidly cool the area. This technique can be a great solution, but sometimes there'll still be remnants of the dents after popping. Additional repairs may be required."
    },
    {
      "title": "Consider buying a kit.",
      "content": "Consider buying a kit. Dent repair kits can be reused depending on the kit. Consider the average amount of hail your area gets. If you frequently find dents after a hailstorm, consider buying a kit. Dent removal kits can typically be found at your local auto supply store."
    },
    {
      "title": "Buy a dent puller.",
      "content": "Buy a dent puller. These are simple and cheap tools that use suction to remove dents. They are one of the more common kits for users not as experienced with self repairs."
    },
    {
      "title": "Use other kits.",
      "content": "Use other kits. There are other types of kits that use suction and a glue gun to remove the dents. These kits sometimes require more patience and steps, but can potentially have better results. They use an arched bridge system combined with a safe adhesive."
    },
    {
      "title": "Take the vehicle to a body shop.",
      "content": "Take the vehicle to a body shop. If you have insurance that covers hail damage, contact your insurance company to file a claim. Dent repairs are a cheap fix, and you're guaranteed the cleanest job. Consider asking the body shop personnel to use used parts, if needed. This will reduce your expenses."
    },
    {
      "title": "Look at the weather.",
      "content": "Look at the weather. If you were out and unaware of a hail storm, check your past weather forecast. This can be a simple confirmation of whether your property was subject to hail. Hail can damage the roof of a house just as dramatically as your vehicle."
    },
    {
      "title": "Examine asphalt shingles.",
      "content": "Examine asphalt shingles. Hail will have a different effect to the different types of roofs. For asphalt shingles you'll notice random damage with no succinct pattern. The hail impressions will probably be black in color. You might also notice a loss of granules and the asphalt will appear shiny."
    },
    {
      "title": "Examine wood shingles.",
      "content": "Examine wood shingles. Again like the asphalt shingles, hail causes random damage without a clear pattern. Look for a split in the shingle that is a brown/orange color. Also look for splits that have sharp corners or splits that have little to no deterioration around the edges."
    },
    {
      "title": "Inspect clay tiled roofs.",
      "content": "Inspect clay tiled roofs. Clay tiles, also known as terra cotta roofs, commonly feature multiple fractures centered around a common impact point. The most sensitive sections of the roof are the corners and the overlays along the edges of the tiles. Clay tiles are easy to spot because they usually have a clear break."
    },
    {
      "title": "Inspect metal roofs.",
      "content": "Inspect metal roofs. Metal paneled roofs will rarely be punctured by hail. This style of roof is one of the sturdiest made. They seldom become dented because of the material and its proximity to the surface below. You’ll experience functional damage if the seams or edges of the panels become damaged. This will allow moisture to seep through. [1] X Research source Metal shingles damage much like asphalt shingles, and are much less resilient than metal panels."
    },
    {
      "title": "Confirm the damage was hail.",
      "content": "Confirm the damage was hail. Once you notice that your roof has been damaged, you'll need to make sure that the cause was hail. If you experience a serious storm, suspect that it hailed and potentially damaged your roof. Inspect your roof after a storm. Look for other indicators around your property for signs of hail. [2] X Research source If you’re renting, contact your landlord if you suspect hail damage."
    },
    {
      "title": "Document what you can.",
      "content": "Document what you can. You don't need to get a ladder and photograph your roof up close. Take pictures of your house and roof after a storm. Document the hail itself if it's available on the ground."
    },
    {
      "title": "Schedule an inspection.",
      "content": "Schedule an inspection. Use a reputable roofing company to inspect your roof for a quote. Be careful choosing a roofing contractor. There are many unauthorized companies that can lead to fraud. Only deal with a \"factory-certified\" roofing contractor. [3] X Research source"
    },
    {
      "title": "Be home when they inspect.",
      "content": "Be home when they inspect. Make sure you are around so you can tell them that no repairs are to be done. Reinforce that they are only there for an inspection. Request the contractor to outline with chalk any damaged areas. [4] X Research source Listen for any noises of the roofer trying imitate hail damage onto your roof. Don’t sign anything."
    },
    {
      "title": "File your claim.",
      "content": "File your claim. Locate your homeowner's insurance policy. Organize all the facts and documents gathered about the specifics of the damage. You'll be assigned a claim number by your insurance company. Each insurance company handles the aftermath differently. Be sure your insurance will cover all damages before hiring a contractor."
    }
  ]
}