{
  "url": "https://www.wikihow.com/Separate-Salt-from-Water",
  "title": "How to Separate Salt from Water",
  "steps": [
    {
      "title": "Heat water and add salt to make saltwater.",
      "content": "Heat water and add salt to make saltwater. It's easy to see the principles of evaporation in action by performing this simple experiment. To start, all you'll need is a little ordinary table salt, some tap water, a saucepan, a little black construction paper, and a stove. Add a few cups of water to the pan and place it on a hot burner. Wait for the water to heat — it doesn't necessarily need to boil, but the hotter it gets, the more quickly it will dissolve the salt. The reason hot water is best for dissolving salt (and other chemicals) has to do with the motion of the molecules making up the water. When the water gets hot, the molecular motion increases, running into more salt molecules and making the bonds easier to pull apart. [1] X Research source"
    },
    {
      "title": "Add salt until it no longer dissolves.",
      "content": "Add salt until it no longer dissolves. Continue adding small spoonfuls of salt and stirring to dissolve them. Eventually, you'll reach a point at which the salt won't dissolve anymore, no matter how hot the water is. This is called the water's saturation point. Turn the stove off and let the water cool slightly. When water reaches its saturation point, it no longer has any ability to dissolve salt at a molecular level — so much salt has dissolved that there is no longer any chemical potential for the water to pull apart new salt crystals. [2] X Research source"
    },
    {
      "title": "Spoon the water onto dark construction paper.",
      "content": "Spoon the water onto dark construction paper. Using a spoon or ladle, pour a little of your saltwater over a dark-colored piece of construction paper. Place this paper on a dish to avoid having it soak through to the countertop or work surface below. Now, all you need to do is wait for the water to evaporate. This process will be slightly faster if you leave the paper somewhere the sun's light can hit it. Don't waste your leftover salt water — there are tons of things you can use it for. For instance, you can use it to poach an egg, boil potatoes, preserve spinach, and even help you peel nuts! [3] X Research source"
    },
    {
      "title": "Wait for salt to form.",
      "content": "Wait for salt to form. As the water evaporates, it should leave behind miniature salt crystals. These should look like small, shiny, white or clear flakes on the surface of the paper. Congratulations! You've just separated salt from water. Feel free to scrape a little bit of salt from your paper to season your food — it should be perfectly safe to eat. Be careful not to get any paper shavings in your food, though!"
    },
    {
      "title": "Start boiling a pot of salt water.",
      "content": "Start boiling a pot of salt water. The simple experiment above showed how to get the salt from water, but what if you want to keep the salt-less water, too? Distillation is the answer. Distillation is the process of heating substances with different boiling points to separate them, then collecting the condensation, which should be relatively \"pure\". In this case, we'll start by making a few cups of saltwater (see above for directions) and heating it to a boil on the stove."
    },
    {
      "title": "Set a lid on the pot offset.",
      "content": "Set a lid on the pot offset. Next, find a lid for your pot (it doesn't necessarily have to fit perfectly). Balance the lid on the pot so that part of it is hanging over the rim. Try to arrange the lid so that the portion hanging off of the edge is the lowest point on the lid. Watch as condensation forms on the bottom of the lid and starts to trickle down it. As the saltwater boils, the water (minus the salt) will turn into steam and rise out of the pot. As it hits the lid, it will cool slightly and form liquid condensation (water) on the underside of the lid. This water doesn't contain salt, so all we need to do is gather it to have salt-free water."
    },
    {
      "title": "Let the water collect in a bowl.",
      "content": "Let the water collect in a bowl. Since water runs downhill, the condensation on the underside of the lid will naturally gather at the lowest point of the lid. Once enough condensation gathers here, it will start to form drops and fall. Place a bowl under this spot to catch the drops of distilled water as they fall. If you like, you can also run a long, skinny metal or glass object (like a stirring rod or thermometer) from the bowl up to the lowest point on the lid — the water should run down this object into the bowl."
    },
    {
      "title": "If necessary, repeat.",
      "content": "If necessary, repeat. As the salt water in the pot boils, more and more distilled water should gather in your bowl. This water will have most of its salt removed. However, in some situations, a small amount of salt can remain. In this case, you may want to perform a double distillation — boiling the distilled water you gathered in the same way as you boiled the salt water to remove any lingering salt. Technically, this water should be safe to drink. However, unless you're sure that both the lid for your pot and the bowl you collected the water in (and the skinny metal or glass rod, if you used one) are clean, you may not want to do this."
    },
    {
      "title": "Use reverse osmosis.",
      "content": "Use reverse osmosis. The methods above aren't the only ways to separate salt from water, they're just the most convenient for most people working at home. It's also possible to separate salt from water with other methods requiring specialized materials. For instance, a technique called reverse osmosis can remove salt from salt water by forcing the water through a permeable membrane. This membrane acts as a filter, permitting only water molecules to pass through and keeping dissolved contaminants (like salt) out. [4] X Research source Reverse osmosis pumps are sometimes sold for residential use but are also often used for recreational purposes like camping. Pumps can be somewhat expensive, usually running several hundred dollars. [5] X Research source"
    },
    {
      "title": "Add decanoic acid.",
      "content": "Add decanoic acid. Another way to separate salt and water is via chemical reaction. For instance, research has shown that treating salt water with a chemical called decanoic acid is a reliable way to remove the salt. After adding the acid and heating slightly, then cooling, the salt and other impurities precipitate (that is, solidify and sink to the bottom). When the reaction is complete, the water and salt sit in two completely separate layers, making it easy to remove the water. Decanoic acid is available from chemical supply stores — usually around $30-$40 per bottle."
    },
    {
      "title": "Use electro-dialysis.",
      "content": "Use electro-dialysis. Using the power of electricity, it's possible to remove particles like salt from water. This is done by submerging a negatively charged cathode and a positively charged anode in water and separating them with a porous membrane. The electrical charge of the anode and cathode essentially \"pull\" dissolved ions (like those that make up salt) toward them like magnets, leaving relatively pure water. [6] X Research source Note that this process does not necessarily remove bacteria or other contaminants from the water, so further treatment may be needed to get drinkable water from this method in the wild. Recent research has been promising, however, suggesting new techniques that do kill bacteria as part of the process."
    }
  ]
}