{
  "url": "https://www.wikihow.com/Organize-Your-Backpack",
  "title": "How to Organize Your Backpack",
  "steps": [
    {
      "title": "Empty your backpack.",
      "content": "Empty your backpack. Take everything out of your backpack first, including any smaller compartments. Next, tip it over a trashcan and shake it to get those last few scraps, crumbs, and bits of lint out. If you’re starting with a brand-new and empty backpack, you’re way ahead of the game. If your backpack is stuffed full of papers, books, and other stuff from your previous semester, empty it completely."
    },
    {
      "title": "Sort everything you’ve taken out into 3 piles.",
      "content": "Sort everything you’ve taken out into 3 piles. In your first pile, place all of your school textbooks, folders, binders, and notebooks. In your second pile, place your school supplies, such as pens, pencils, erasers, glue, etc. In your last pile, put the other items that you use on a daily or seasonal basis, such as your lunch box, scarf, mittens, etc. If you take your laptop to school, you should put it in the first pile too. Discard or put away anything that doesn’t fit in any of these 3 piles, such as trash, candy, toys, extra phone chargers, etc."
    },
    {
      "title": "Put your school supplies into the compartments in your backpack.",
      "content": "Put your school supplies into the compartments in your backpack. Backpacks typically have 1 large compartment and at least 1 small compartment. Open up the small compartment, and start putting your school supplies away into it. Some backpacks even have slots for pens, pencils, and cellphones. Use these for those items. If your backpack doesn’t have a smaller compartment, get a pencil bag. Put your supplies into the bag, then put it into your backpack. [1] X Research source"
    },
    {
      "title": "Sort your school textbooks, notebooks, folders, and binders by subject.",
      "content": "Sort your school textbooks, notebooks, folders, and binders by subject. For example, put all of your English books, notebooks, and binders into 1 pile, and all of your Science stuff into another pile. If you have any loose papers, put them away into the right folder or binder first. If you need to buy new binders, folders, and notebooks, consider color-coding them. Use a different color for different subjects, like red for English and blue for Science. You can use stickers, markers, or even white Out to color-code them. Stack binders with their spines facing away from each other. This will create a straight stack rather than a sloped one. It will take up less space."
    },
    {
      "title": "Pack only the notebooks, folders, and books you need.",
      "content": "Pack only the notebooks, folders, and books you need. Unless you want to lag around a heavy backpack that is almost as big as you are, there is no need to pack everything. Each morning or evening before school, go through your backpack and take out anything that you don't need for the next day. Put everything that you do need back into your backpack. [2] X Research source Leave the stuff that you don't need at home or in your locker . This also goes for school supplies. If you take art class once per week, there is no need to carry around your art supplies every day."
    },
    {
      "title": "Add an extra folder for parent-teacher communications.",
      "content": "Add an extra folder for parent-teacher communications. While not absolutely necessary, this can come in handy, especially if you are in middle school or junior high. If you get a permission slip or report card that your parents need to sign, you’ll need a safe place to put it. Use a separate folder for this purpose. Place this folder behind or in front of the other books and folders."
    },
    {
      "title": "Change out your extra items with the season.",
      "content": "Change out your extra items with the season. Things like lotion, hand sanitizer, and lip balm may come in handy every day, so you can leave those in your backpack for the entire school year. Other items, such as scarves, mittens, umbrellas, and sunglasses, will only come in handy during certain seasons. You should leave these items out until the weather calls for it. Instead of using full-sized lotion and hand sanitizer bottles, go for the mini travel-sized ones. You'll need to replace them more often, but you'll also save space. If you live in an unpredictable climate, then having a warm hat or an umbrella might be a good idea."
    },
    {
      "title": "Take everything out of your hiking pack.",
      "content": "Take everything out of your hiking pack. For good measure, tip your pack upside down over a bin and shake it to get any bits of trash out. Only when your pack is empty will you have an adequate sense of what it can accommodate. If you’ve organized your pack in the same way for a long while, emptying it out completely can help you imagine new ways to organize it more efficiently."
    },
    {
      "title": "Be picky when deciding which heavy items to include.",
      "content": "Be picky when deciding which heavy items to include. Even if your backpack feels light when you first pack it, it will start to feel heavy after a few hours of hiking. Go through the items you plan on putting into your pack, and find the heaviest ones. Decide whether or not you really need them for the trip. [3] X Research source For instance, if you have a cooking pan you really like but rarely use, it might be a good idea to leave it at home. Consider replacing it with a lighter pan instead. How much your backpack weighs in the end depends on what you can personally carry and endure. Different people can carry different amounts of weight."
    },
    {
      "title": "Place lighter items towards the bottom if you have an internal frame backpack.",
      "content": "Place lighter items towards the bottom if you have an internal frame backpack. When organizing an internal frame backpack, the area at the bottom should be reserved for light material, while the medium-weight stuff should be packed on top of it. The heaviest things should be packed in the middle of the forward-most area of the backpack. [4] X Research source In other words, the heaviest items should be against the area that actually touches your back."
    },
    {
      "title": "Stack items from lightest to heaviest in an external frame backpack.",
      "content": "Stack items from lightest to heaviest in an external frame backpack. Similar to an internal frame backpack, you want to start with the lightest items first. After that, you want to add the medium-weight items, and finally, the heaviest. Tuck them as tightly as possible against the forward-most area of the pack. [5] X Research source The goal in both modes of organization is to center the weight on your hips so that you can more easily maintain balance."
    },
    {
      "title": "Place useful items in accessible locations.",
      "content": "Place useful items in accessible locations. Items that you might use or need at any time – insect repellents, snacks, rain ponchos, and so on – should be placed in outer pockets. That way, you can grab and use them easily without having to stop, unpack, find the items, and repack. If your backpack doesn't have many outer pockets, keep the more useful items towards the top. Leave the items you seldom use towards the bottom."
    },
    {
      "title": "Tuck items inside each other to save space.",
      "content": "Tuck items inside each other to save space. Here is where you can think outside the box and get a little creative. Many items, such as cooking pots and bear canisters, take up a lot of space, but they are hallow in the inside. Why let all that hallow space go to waste? You can take advantage of it by filling it with useful items. For example: You can place shirts or rolled-up socks inside cooking pots. Rolls of duct tape can slide over hiking poles. Bear canisters are perfect for cramming with snacks and other scented items."
    },
    {
      "title": "Use your backpack’s compartments as intended.",
      "content": "Use your backpack’s compartments as intended. Many hiking and camping backpacks have special compartments that have been designed for particular purposes. For instance, many backpacks have space for a water bladder (typically located directly behind and at the top of the pack). Other packs have slots specifically designed for sleeping bags. Consult your backpack owner’s guide to identify how the manufacturer intended the backpack to be used."
    }
  ]
}