{
  "url": "https://www.wikihow.com/Prune-a-Butterfly-Bush",
  "title": "When & How to Prune Butterfly Bushes: The Ultimate Care Guide",
  "steps": [
    {
      "title": "Wait for the right time of year to prune.",
      "content": "Wait for the right time of year to prune. There are two types of butterfly bushes: Buddleia davidii and Buddleia alternifolia. Buddleia davidii is a deciduous shrub with dark purple flowers that blooms June through September. This butterfly bush is classified as an invasive plant is some parts of the United States. You can check if it's an invasive species in your state by visiting https://plants.usda.gov/java/noxious . Prune your Buddleia davidii in early spring or late winter. Pruning is best done before new growth starts in the spring. In climates with cold winters, the plant will most likely die back completely. Buddleia alternifolia (Alternate leaf butterfly bush) is a deciduous shrub with light purple flowers in the spring. Buddleia alternifolia should be pruned in mid to late summer, right after it has bloomed. This kind of butterfly bush blooms on stems from the previous year, so cutting it to the ground each year is not an option."
    },
    {
      "title": "Look for any dieback.",
      "content": "Look for any dieback. Dieback is caused by harsh winters or disease. In this case, a particularly cold winter could cause dieback in your butterfly bush. When a plant dies back, the tips of the leaves or roots begin to die, slowly leading to a reverse death that ends in the death of the whole plant. Dieback is common in butterfly bushes in colder climates--butterfly bushes often dieback all the way to their roots in very cold winters. However, this does not mean that they cannot be saved--that’s what pruning is for. Butterfly bushes are late to break dormancy, meaning that you don’t need to check for any winter damage as the plant may still just be dormant."
    },
    {
      "title": "Prune your butterfly bush.",
      "content": "Prune your butterfly bush. How you prune your butterfly bush will depend on which type of bush you're growing. If you have a Buddleia davidii, prune it with a hard cut. Because they do often dieback in the winter, this type of butterfly bush can handle intense pruning--and often requires it. Even if your butterfly bush doesn’t dieback during winter, prune 6”-12” above the ground in late winter to ensure proper growth the following spring. If you have a Buddleia alternifolia, prune your bush back hard to about ⅓ of its size immediately after it flowers in the early summer. Follow the shape of the shrub when pruning. If your butterfly bush is in the back of a garden up against a fence and you want it to grow tall, cut it back to about two feet so that the plant will produce higher growing (and thus flowering) stems. You will then be able to plant lower growing plants near the butterfly bush while still being able to see the flowers of the butterfly bush."
    },
    {
      "title": "Dead-head the spent blooms while the plant is flowering.",
      "content": "Dead-head the spent blooms while the plant is flowering. This means that you should pick or cut the flowers that have died while the bush continues to bloom. Spent blooms will start to turn brown and will look very wilted. Cut the dead blooms back to where they attach to the stem. Doing this will ensure that your bush produce new flower buds longer into the blooming season than they would if the bush was left unattended."
    },
    {
      "title": "Remove spent blooms at the end of the season.",
      "content": "Remove spent blooms at the end of the season. At the end of the season, you should dead-head all of the now finished blooms. This will help the plant along when creating buds for the next year. It will also limit the butterfly bush’s chances of self-seeding and thus taking over your entire garden."
    }
  ]
}