{
  "url": "https://www.wikihow.com/Nyc-Slang",
  "title": "90 Iconic New York City Slang Words",
  "steps": [
    {
      "title": "Yooz",
      "content": "Yooz This is “you” with a New York accent . It often stands in for “ya’ll,” as well. NYC Example: “Yooz ever heard of the Brooklyn Zoo? … No, not the actual zoo. The Wu-Tang Clan song.” Potential Origin: It’s just an evolution of “you” with a fun accent."
    },
    {
      "title": "Dead*ss",
      "content": "Dead*ss This iconic phrase means “I’m serious” or “I’m not kidding.” It’s a modern update of “for real.” Dead*ss can also be used to simply emphasize your statement. NYC Example: “I dead*ss love you, B.” Potential Origin: This phrase dates back to the early 1990s. It comes from hip hop. [1] X Research source"
    },
    {
      "title": "Pie",
      "content": "Pie This is a whole New York-style pizza! NYC Example: “The best pie in The City is on Carmine Street. Joe’s can’t be beat.” Potential Origin: Pizza is actually pie. It has a crust on the bottom, so “pizza pie” is the technically correct description."
    },
    {
      "title": "Fuhgeddaboudit",
      "content": "Fuhgeddaboudit This phrase might be on the way out due to its high meme-ability, but you’ll still hear it from time to time in certain corners of NYC. It’s just “forget about it” mushed together in a pseudo-Italian accent. [2] X Research source NYC Example: “My Uncle Tone is so old school he still unironically says, ‘fugheddaboudit.’” Potential Origin: This is called an “eye dialect.” It’s when you combine words to look the way they sound when a speaker of a specific dialect uses them."
    },
    {
      "title": "Schmear",
      "content": "Schmear This is cream cheese! If you didn’t know it, New York has some great bagels. New Yorkers enjoy those bagels, sometimes with baconeggandcheese and sometimes with a little schmear! NYC Example: “Let me get a bagel with some schmear.” Potential Origin: This is a fun one. It was first used in Germany—it meant to lubricate a machine with oil or grease. As Germans emigrated to New York City in the early 1900s, they used the word to describe how bagel eaters would cover their bagels with cream cheese. The word was loaned out and the rest is history!"
    },
    {
      "title": "Stoop",
      "content": "Stoop The “stoop” is the front porch—including the steps leading up to it. New Yorkers often don’t have yards, so you might kick it on the stoop if you want to catch some sun and enjoy the weather. NYC Example: “It’s finally nice out. Grab some beers out of the fridge and let’s go hit the stoop.” Potential Origin: This is another European loanword. In Dutch, “stoop” means a small porch. Dutch settlers popularized the word among New Yorkers. [3] X Research source"
    },
    {
      "title": "Dumb",
      "content": "Dumb “Dumb” means “very.” Notably, people (not necessarily in NYC) will use “mad” the exact same way. NYC Example: “I would hire Jim as my real estate agent, but he’s dumb young and I don’t know if he has the experience I need.” Potential Origin: This one probably comes from hip hop songs of the early 90s."
    },
    {
      "title": "Grill",
      "content": "Grill “To grill” means to stare at someone in a judgey or angry way or ask them a lot of intense, investigatory questions. NYC Example: “I was on the 7 and this old head was grillin’ me the whole way home.” Potential Origin: We’re not sure. It’s hard to trace this one given that there are two other popular slang terms associated with “grill”—a gold or diamond bit of jewelry for your teeth, and “to interrogate.”"
    },
    {
      "title": "B",
      "content": "B “B” just means, “bro,” “friend,” or “dude.” It’s a catchall term that you use to address someone in a friendly, informal way. NYC Example: “How’s it going, B?” Potential Origin: This is probably just a natural shorthand of “bro” but we’re not entirely sure."
    },
    {
      "title": "Tims/Timbs",
      "content": "Tims/Timbs These are Timberland boots—a popular footwear option among the men and women who live in New York. NYC Example: “Where’d you cop those Timbs?” Potential Origin: This shorthand first appeared in hip hop music from the 90s. It’s just a naturally smoother word to say than “Timberland.”"
    },
    {
      "title": "One",
      "content": "One “One” is sort of like, “goodbye, dear friend” or “peace out.” It’s a sign-off used to express love and appreciation. This is a bit of an older term that you don’t hear as much among NYC youths these days, but it’s still relatively common. NYC Example: “Okay, I’ll see you later. One.” Potential Origin: This probably comes from “one love” —a common Jamaican way to say “goodbye.” NYC has historically been a popular destination for Jamaican immigrants."
    },
    {
      "title": "Brolic",
      "content": "Brolic A “brolic” refers to someone who is extremely ripped and muscular. Notably, New Yorkers will occasionally use “brolic” to refer to anything that’s buff or overloaded. A stout pitbull or a hot dog loaded up with too much sauerkraut might be called a “brolic,” for example. NYC Example: “On God, every brolic in Brooklyn going to be after me if I wear a NY Giants jersey on the train.” Potential Origin: It’s unknown, but this might come from the Dragon Ball Z character Broly for reasons that might be obvious if you take a gander at the guy ."
    },
    {
      "title": "Regular coffee",
      "content": "Regular coffee This is a standard drip coffee with milk and two sugars. If a New Yorker wants to order coffee without cream or sugar, they always specify “black coffee” or “plain coffee.” [4] X Research source NYC Example: “I don’t like their regular coffee. I prefer black at this bodega.” Potential Origin: We don’t know, but this is a fun little quirk of NYC lingo. There is an implication among New Yorkers that “regular coffee” is explicitly cheap, so it might come from bodegas listing it as “regular coffee” on their deli menus."
    },
    {
      "title": "Jakes",
      "content": "Jakes The “jakes” are the police (aka, the po-po, 5-0, fuzz, heat, etc.). [5] X Research source NYC Example: “That lady upstairs threatened to call the Jakes. She doesn’t know this is Bed-Stuy—they don’t come out for noise complaints.” Potential Origin: We cannot confirm this with 100% accuracy, but it’s a fun story so we’re going to share it anyway. Apparently, when fire alarms were first invented, old New York buildings were all retrofitted to have fire alarms by the fire department. The only way to turn the fire alarm off was to use a J-shaped key. Anyone carrying these J-shaped keys became known as a “Jake.” The term likely rose to prominence with the film Chinatown (1974) where a character repeatedly refers to police as Jakes."
    },
    {
      "title": "Baconeggandcheese",
      "content": "Baconeggandcheese Pronounced as one word (make it as mumbly as you can for authenticity), this is a bagel with bacon, egg, and cheese on it. These are a staple of any NYC morning commuter. Just pop into any bodega or stop by any halal cart and ask for a baconeggandcheese. NYC Example: “Look, you gotta get a baconeggandcheese from Nino’s over on 17th.” Potential Origin: It’s just a description of the bagel."
    },
    {
      "title": "Bugging",
      "content": "Bugging Normally pronounced buggin’, this just means someone is overreacting or behaving ridiculously. NYC Example: “Why are you bugging out? It’s just little spider!” Potential Origin: There are a few potential theories. One is that it comes from “computer bug” (i.e., something acting incorrectly). It’s also possible that it comes from “bug” meaning “to annoy.”"
    },
    {
      "title": "Schlep",
      "content": "Schlep To “schlep” something is to carry it. Often, the word implies that you’re carrying or dragging something really oversized and obnoxious in a way that’s incredibly inefficient. As a noun, a “schlep” is something annoying to carry or cross, although this usage of the word is much less common. NYC Example: “I just moved a block so I didn’t bother hiring movers, but I totally should have. Schelpping all this furniture across Avenue J is such a pain in the butt.” Potential Origin: This comes from the Yiddish word “shlepn,” which means “to pull.” [6] X Research source"
    },
    {
      "title": "Ock/Ocky",
      "content": "Ock/Ocky An “Ock” refers to the person who makes sandwiches at their local bodega. Some New Yorkers will argue the person must be of Middle Eastern or Arabic descent to qualify as an “Ock” (as a Latin bodega worker is often lovingly referred to as a “papi”). NYC Example: “All ockies are not created equal. The guy over on 75th can’t dress a bagel for nothing.” Potential Origin: A lot of people believe that it’s a reference to Rahim Mohamed, a famous NYC deli worker who makes sandwiches “the ocky way.” [7] X Research source In reality, it’s an anglicization of the Arabic word “akhi,” which means “brother.”"
    },
    {
      "title": "The City",
      "content": "The City For a New Yorker, this means Manhattan. People outside of NYC (but still on the East Coast) will use “The City” to mean New York City as a whole. NYC Example: “I want to go into The City to shop for Christmas gifts this weekend.” Potential Origin: Manhattan was developed and built out much earlier than the other four boroughs, so Queens, Staten Island, Brooklyn, and The Bronx all felt less urban than Manhattan back in the day."
    },
    {
      "title": "Bodega",
      "content": "Bodega This is a corner store. There is still some dispute over this, but most New Yorkers will require a corner store to have a deli and be independently owned to qualify as a bodega (so a 7-11 or CVS wouldn’t count). NYC Example: “I need to stop at the bodega and pick up some toilet paper.” Potential Origin: It’s the Spanish word for “storeroom” or “wine cellar.” Since NYC has a high Dominican and Puerto Rican population, it makes sense that New Yorkers would pick up this loanword. Fun fact, the word has been used in NYC since at least 1902. [8] X Research source"
    },
    {
      "title": "New Yorkers are fairly up to date on all the latest slang and trends.",
      "content": "New Yorkers are fairly up to date on all the latest slang and trends. Slang is always evolving, and New York City is no exception. Here are some of the more popular slang terms that are newer to the Big Apple: Dayroom — Someone who is so quiet and vague that they’re confusing. Say less — To understand what someone said. Heard — To understand what someone said. Yes, it’s the same thing as “say less.” Old head — An older person, typically one who is a fixture in the neighborhood or community. (This is actually more of a Philly thing, but it seems to have migrated to NYC, which is only an hour away.) No cap — I’m serious. Bev — Beverage. Muddy — When you look gruff and unkept. Link — To meet up. Yerr — Basically, “yo” or “how are you.” Bet — Short for “you bet.” It’s basically a confirmation that you agree or understand. Frontin’ — Pretending or lying. Lit — Feeling drunk, high, or overly excited. Whip — A car. Pull up — Arrive or go somewhere. Son — Friend, dude, or person. Cabbie — A cab driver. Cuz — Short for “cousin,” but used to mean a friend or close acquaintance. Snack — An attractive person. Chillin’ — Relaxing. Straphanger — An old term for a person who takes the train. Schtup — To have sex or hook up. Hero — A submarine sandwich (or “hoagie” if you’re from Philadelphia). Good looks — “Thank you” or “I appreciate you.” Ratchet — Someone who is dislikable, sloppy, or dramatic. Shook — Emotionally unstable or upset. Book it — Run quickly and suddenly. Schvitz — To sweat a lot. Or, to get a steam bath. No doubt — I agree. L — A marijuana joint. Drid — Annoyed. Mack — To flirt. Flip — To cancel plans at the last minute."
    },
    {
      "title": "Manhattan slang",
      "content": "Manhattan slang The Village — Greenwich Village, a popular subculture hub with a lot of history. The Bowery — A famous street and neighborhood near Chinatown. FIDI — Shorthand for “financial district.” The Met — The Metropolitan Museum of Art. Museum Mile — The strip along Fifth Avenue where all of the major museums in NYC are located."
    },
    {
      "title": "Brooklyn slang",
      "content": "Brooklyn slang Brooklynite — A resident of Brooklyn. There’s a connotation with this term that a “Brooklynite” is kind of hoity-toity. The Beast — A famous Coney Island roller coaster. The Boardwalk — Brighton Beach Boardwalk on Coney Island. Bed-Stuy — Shorthand for Bedford-Stuyvesant, a famous neighborhood with a lot of cultural history. Slime — A friend. This one is interchangeable with “dude.” Johnny Pump — An old term for a fire hydrant. Schmeboygah — A slob. Tourist — An insulting term used to imply someone isn’t from Brooklyn."
    },
    {
      "title": "The Bronx slang",
      "content": "The Bronx slang BX — Short for “The Bronx.” Boogie Down Bronx — Another term for The Bronx. This one is based on KRS-One and his famous Boogie Down Productions outfit. They would regularly reference the “Boogie Down Bronx.” The Concourse — Grand Concourse, a major street in The Bronx. Brick — Extremely cold. Flat Leaver — Someone who leaves events randomly or in the middle of the action. Butter — Smooth or enjoyable."
    },
    {
      "title": "Queens slang",
      "content": "Queens slang QNS — Shorthand for “Queens.” The Rock — Rockaway Beach. The Bridge — Queensboro Bridge (affectionally called Queen’s Bridge). The Iron Triangle — The Willet’s Point neighborhood, a popular street art destination. Dindarinth — A goofball or loser. The Sutphin Strip — A popular commercial district along Sutphin Boulevard."
    },
    {
      "title": "Staten Island slang",
      "content": "Staten Island slang The Rock — A nickname for Staten Island as a whole, which is very rocky. Shaolin — Another nickname for Staten Island as a whole, based on the Wu-Tang Clan’s music (the Shaolin Temple is the birthplace of Chinese Buddhism, and the Wu-Tang Clan loves Chinese history). The Forgotten Borough — Yet another nickname for Staten Island. It’s a reference to the fact that New Yorkers tend to overlook Staten Island. The Boat — The Staten Island Ferry. Doozie Pats — Crazy. Scheeve — Anything disgusting. Stoonad — Someone who isn’t very smart. Mint/Mink — Something in good condition. She thinks who she is — A woman who is way too invested in herself, despite her un-remarkability. Literally — Figuratively. Banging — Really enjoyable."
    },
    {
      "title": "New York City is a global city known by many nicknames around the world.",
      "content": "New York City is a global city known by many nicknames around the world. Here are some others way you can refer to America’s largest city besides the classic abbreviation “NYC”: [9] X Research source The Big Apple — A reference to how NYC is the most prominent city in the US. The Concrete Jungle — A description of the super developed cityscape with huge skyscrapers and busy streets and sidewalks. The City that Never Sleeps — There’s always something to do in New York, 24/7. The Empire City — A nod to NYC’s historical, cultural, and economic influence in the US and abroad. Gotham — A comparison to the fictional city in the Batman comics, often portrayed as dark and seedy. The Capital of the World — A reference to New York’s global status and influence as a major cosmopolitan hub for multiple industries. The Melting Pot — A description of NYC’s diverse population and its history as a port of entry for immigrants. “The city so nice, they named it twice” — “New York, New York” is the full name of the city and state."
    }
  ]
}