{
  "url": "https://www.wikihow.com/Shift-Realities-While-Sleeping",
  "title": "How to Shift Realities While Sleeping",
  "steps": [
    {
      "title": "Lie down in the starfish position so you can shift and \"fly\" away.",
      "content": "Lie down in the starfish position so you can shift and \"fly\" away. To use the Raven Method and shift reality , write a script that describes your ideal world. Then, meditate on details about this Desired Reality for 10-15 minutes. For example, visualize that you’re a witch in a magical bakery kneading enchanted dough. Turn on some subliminals —like some that tell you how powerful your imagination is—relax in bed, and spread out your arms and legs. Count from 1 to 100. Between each number, say an affirmation like, “I am entering my Desired Reality.” When you sleep, you'll soar off to your ideal world."
    },
    {
      "title": "Picture you’re falling down a rabbit hole to access a fun fairytale.",
      "content": "Picture you’re falling down a rabbit hole to access a fun fairytale. Lie down on your back and meditate for 10-15 minutes. Picture that you’re leaning against a giant tree and that someone from your DR—maybe Draco Malfoy—runs past you, just like the White Rabbit from Alice in Wonderland. Chase after them until you fall into a rabbit hole that sends you to your favorite realm, whether that’s Hogwarts or Hobbiton. [1] X Research source"
    },
    {
      "title": "Write down a wish and slip it under your pillow to make it come true.",
      "content": "Write down a wish and slip it under your pillow to make it come true. Create your script to map out your fantasy environment. Then, put an intention down on a slip of paper—for instance, scribble, \"I will defeat an evil brigade of bandits that's attacking my village and earn a ton of gold from the King.\" Turn on some binural beats —sounds that can hypnotize you—hide the note under your pillow, and drift off to sleep. Once you doze off, you'll be spirited away to your dream adventure. [2] X Research source"
    },
    {
      "title": "Imagine an ideal SO's heartbeat to star in your own fantasy romance.",
      "content": "Imagine an ideal SO's heartbeat to star in your own fantasy romance. Put on some headphones, play a YouTube video with the sound effect of a heartbeat, and get cozy in bed. Meditate for 5-10 minutes and visualize resting your head on the chest of a lover—maybe they’re a gruff Viking or a sweet royal. Picture them getting up with you and taking you by the hand. Walk away with them until they bring you to a door and open it. Go through it to access your fairy tale life. [3] X Research source"
    },
    {
      "title": "Think about riding a train that’s headed toward your Desired Reality.",
      "content": "Think about riding a train that’s headed toward your Desired Reality. Get into a relaxed state—you might take a nice bubble bath or read a chapter from your favorite book. Then, lie down on your bed. Say an uplifting shifting affirmation like, “I am destined to enter my dream world.” Close your eyes and visualize that you’re on a train that will take you to your DR—it could be a steam train that takes you to the Victorian era or a high-tech bullet train that’ll shoot over to a sci-fi city. [4] X Research source"
    },
    {
      "title": "Climb up a tall spiral staircase to make it up to your DR.",
      "content": "Climb up a tall spiral staircase to make it up to your DR. Lie down in bed, close your eyes, and take some deep breaths. Visualize that you’re at the bottom of a very large spiral staircase. Go up one step at a time—as you walk up each one, say a different affirmation. For example, announce, “I will enter an alternate universe,” followed by, “In this new realm, I’ll have amazing powers.” Once you get to the top, imagine a bright light and walk through it to step into your favorite reality. [5] X Research source"
    },
    {
      "title": "Walk up and down two staircases to enter another world.",
      "content": "Walk up and down two staircases to enter another world. Before you go to sleep, visualize that you’re looking up at a long staircase. As you walk up each step, picture a new detail about your DR—for example, imagine a dragon soaring above you, then think about a whole crowd singing about your bravery. Once you get to the top of the staircase, fantasize about a full-length mirror that shows your DR self. Turn around and imagine a door with a golden knob. Open it, go down yet another flight of stairs, and walk into your dreamland. [6] X Research source"
    },
    {
      "title": "Visualize you’re in an elevator that brings you to magical realms.",
      "content": "Visualize you’re in an elevator that brings you to magical realms. Lie down in bed, get comfortable, and concentrate on raising your vibration —you might tell yourself, “I feel only pure love right now.” Close your eyes and imagine you're in an elevator. Fantasize that it runs on the power of your energy and that each level is an alternate universe—one might bring you to the MCU while another may take you to Westeros. When it reaches the DR you’re in the mood for, picture the elevator’s doors opening and walk out to experience a fun reality."
    },
    {
      "title": "Cover your eyes with a scarf and go to sleep to drift into a DR.",
      "content": "Cover your eyes with a scarf and go to sleep to drift into a DR. To use the power of your mind like El from Stranger Things , put on some white noise and relax in bed. Tie a scarf or a bandana around your head to block out your vision. Then, repeat an intention like, “I will escape from this world and enter a new one.” Visualize your DR self—maybe you’re a renowned fire-bender—and picture transforming into this person. When you fall asleep, you'll shift into your alter-ego. [7] X Research source"
    },
    {
      "title": "See yourself as a celebrity pianist to enter a world where you’re a star.",
      "content": "See yourself as a celebrity pianist to enter a world where you’re a star. Turn on some piano music , lie down in bed, and close your eyes. Imagine you’re in a fancy concert hall with a stage. When you look at the stage, visualize a grand piano. Fantasize that you’re your DR self—who happens to be in an amazing outfit—and walk up to it. Sit down, perform for an adoring audience, and wait for everyone to applaud. Imagine a gorgeous fan coming up to the stage, taking you by the hand, and whisking you off into your favorite fantasy world. [8] X Research source"
    },
    {
      "title": "Say a clear intention before bed to enter an ideal reality.",
      "content": "Say a clear intention before bed to enter an ideal reality. Lie down and meditate for 5-10 minutes. Replace any negative beliefs—like how you couldn’t possibly shift—with positive affirmations like, “I am capable of anything my heart wants.” Then, state an intention that exactly captures what you want from your DR. For example, say, “I intend to travel through space and time to meet my soulmate.” When you feel yourself getting sleepy, recite a final affirmation like, “I’m just about to run into the love of my life.” Once you drift off, you’ll be transported to your perfect scenario. [9] X Research source"
    },
    {
      "title": "Imagine taking tea with your DR self to chat with an alter-ego.",
      "content": "Imagine taking tea with your DR self to chat with an alter-ego. Relax in bed and concentrate on attending a tea party with your DR self. For example, if you’re an assassin in an alternate reality, maybe you see yourself in a dark cloak quietly sipping a magical brew that enhances speed and reflexes. Ask your DR self questions, like why they got into such a shady business. Get up, hug them, and thank them for their honesty. Imagine the two of you merging so you become one person. Once you fall asleep, you'll see your DR through your alter-ego’s eyes. [10] X Research source"
    },
    {
      "title": "Visualize climbing a rope up into an amazing new dimension.",
      "content": "Visualize climbing a rope up into an amazing new dimension. Lie on your back and close your eyes. Imagine a bright light surrounding you. Then, picture your ideal reality—you might want to visit a peace-loving alien civilization. Recite an affirmation like, \"I'm about to be beamed up to a new world.\" Picture a glowing rope falling down, then grab onto it. Climb up to find yourself in a realm where anything's possible. [11] X Research source"
    },
    {
      "title": "Think about giving someone an embrace to meet an ally from a DR.",
      "content": "Think about giving someone an embrace to meet an ally from a DR. Cozy up in bed, close your eyes, and visualize you’re sleeping in your DR. For example, picture the texture of your sheets and the sound of songbirds outside. Imagine getting out of bed and walking into a character from your alternate reality. Wrap your arms around them and enjoy the warm, fuzzy feeling—it’s a “symptom,” or sign, that you’ll be pulled into your dream world. [12] X Research source"
    },
    {
      "title": "Repeat a motto that starts with \"I am\" to become your desired self.",
      "content": "Repeat a motto that starts with \"I am\" to become your desired self. Turn on some music with “ theta waves ,” special sound effects that promote focus. Then, lie down and slowly count from 1 to 100. After each number, repeat a phrase that begins with, “I am.” For example, say, “I am a powerful sorceress,” followed by, “I am known far and wide.” As you recite your affirmations, visualize your DR. When you doze off, you’ll shift into your awesome alter-ego. [13] X Research source"
    },
    {
      "title": "Play \"Truth or Dare\" with the Universe to wake up in a random reality.",
      "content": "Play \"Truth or Dare\" with the Universe to wake up in a random reality. Sit cross-legged on bed and pull out a coin. To play a game with the Universe, flip the coin—heads means “truth” and tails means “dare.” If you get “truth,” ask, “How long will it take for me to shift?” The first number that you think of is the Universe’s answer—maybe that’s 2 minutes. If you get “dare,” the Universe will send you to an alternate world of its choice when you go to sleep. Lie down, close your eyes, count to 100, and get ready for your trip! [14] X Research source"
    },
    {
      "title": "Listen to 8D audio designed to help your focus and channel a DR.",
      "content": "Listen to 8D audio designed to help your focus and channel a DR. Look on YouTube and find your favorite audio songs . Put on some headphones and lie down in bed. Sync your breathing to the rhythm of the music. Then, repeat an affirmation like, “I can access a new reality effortlessly.” Close your eyes and imagine vivid details of your DR, like ivy creeping up an ancient castle. When you fall asleep, you’ll discover yourself in a world of your own creation. [15] X Research source"
    },
    {
      "title": "Open a door and find a vortex that goes to an alternate reality.",
      "content": "Open a door and find a vortex that goes to an alternate reality. Get comfy in bed, close your eyes, and imagine you’re in a room filled with light. Focus on a color that matches your mood and picture the shade of the light changing—maybe you’re feeling passionate, so the light becomes bright red. Then, picture a door suddenly appearing in front of you. Walk to the door and say an affirmation like, “This door will take me exactly where I want to go.” Open it and look down—imagine a dark space below you. Jump down to fall into your dream DR. [16] X Research source"
    },
    {
      "title": "Focus on every sensory detail of your DR to transport yourself to it.",
      "content": "Focus on every sensory detail of your DR to transport yourself to it. Put your pillow at the foot of your bed and lie down. Once you’ve switched up your regular sleeping position, say an affirmation like, “I am already in a world completely different from my Current Reality.” Close your eyes and picture vivid details of your DR. For example, focus on the sweat on your crush’s forehead as they swing a sword. Continue to concentrate on these inspiring images until you fall asleep and enter your DR. [17] X Research source"
    },
    {
      "title": "Imagine your DR's room is under your CR's room to fall into it.",
      "content": "Imagine your DR's room is under your CR's room to fall into it. Put on some theta waves designed to get you in a dream-like state. Go to your bed, lie down on your back, and close your eyes. Visualize a DR bedroom that’s right below your own—maybe it has a four-poster canopy bed and gold furniture because you’re an esteemed royal. Count from 1-100 and repeat an affirmation like, “My favorite world is right beneath me.” When you fall asleep, you’ll find yourself in your fairy tale. [18] X Research source"
    },
    {
      "title": "Fantasize that you're dancing with a dream lover to waltz into a DR.",
      "content": "Fantasize that you're dancing with a dream lover to waltz into a DR. Turn on your favorite romantic music, put on some headphones, and lie down in bed. Close your eyes and put your hand on your chest. Imagine you’re in a beautiful ballroom and a character from your DR asks you to dance. Let them take you by the hand. While you two dance, visualize a bright light that’s around both of you. Then, picture them telling you, “It’s time to go home,” and escorting you to an open door. Step into it to enter a heartwarming fantasy. [19] X Research source"
    },
    {
      "title": "Picture yourself in front of a magical mirror and step into a new realm.",
      "content": "Picture yourself in front of a magical mirror and step into a new realm. Lie down in bed, close your eyes, and meditate for 5-10 minutes. Imagine that you’re in a large, empty room with just a full-length mirror. Stand in front of it and place your hand onto it. Visualize the glass rippling, then look at your ideal self and situation. For example, you might be a professor in front of a class of witches and warlocks. Step into the mirror to become your DR self. [20] X Research source"
    }
  ]
}