{
  "url": "https://www.wikihow.com/Paint-Leaves",
  "title": "How to Paint Leaves",
  "steps": [
    {
      "title": "Find some dry leaves on the ground for longer-lasting painted leaves.",
      "content": "Find some dry leaves on the ground for longer-lasting painted leaves. Try to find an assortment of large leaves, so that you will have more room to paint on them. Look on the ground around the bases of trees for recently-fallen leaves. You can put dry leaves underneath a heavy book or other heavy flat object overnight to flatten them out before you paint them."
    },
    {
      "title": "Pick fresh leaves if you can’t find any on the ground.",
      "content": "Pick fresh leaves if you can’t find any on the ground. Keep in mind that fresh leaves will begin to wilt and dry after a few days. Look for big leaves such as maple leaves. Get permission if you want to pick leaves from someone else’s property."
    },
    {
      "title": "Lay out the leaves face-up on some newspaper on a flat work surface.",
      "content": "Lay out the leaves face-up on some newspaper on a flat work surface. Put down old newspapers or other scrap paper to protect your work surface. Select a few of the leaves that you want to start painting and place them in front of you on the protected surface. Make sure to leave space between the leaves and the edges of the newspapers, so that you avoid getting paint outside of the protected area."
    },
    {
      "title": "Paint the leaves with acrylic paint to make designs with solid colors.",
      "content": "Paint the leaves with acrylic paint to make designs with solid colors. Squeeze out small amounts of the acrylic paint colors that you want to use on a paper plate. Use a small paintbrush to paint any designs you would like on the leaves. Try mixing different colors to create interesting color patterns on your leaves. Acrylic paint will usually air dry in 20-30 minutes."
    },
    {
      "title": "Use chalk crayons if you prefer drawing to painting with a brush.",
      "content": "Use chalk crayons if you prefer drawing to painting with a brush. Try either regular chalk crayons or liquid chalk markers. Draw any patterns and designs that you think look nice on the leaves. Draw repeating patterns to create intricate designs on your leaves."
    },
    {
      "title": "Spray paint leaves if you only want to use one color.",
      "content": "Spray paint leaves if you only want to use one color. Lay your leaves out on some newspaper outside or in a well ventilated area. Hold the spray paint can about 6 in (15 cm) away from the leaf you want to paint and press down on the cap to spray the paint on. [1] X Research source You can even spray paint small branches with the leaves still attached to create unique decorations. Try using gold or silver spray paint and then place the branches in a vase when the paint is dry. Spray paint should be dry to touch within 1-2 hours."
    },
    {
      "title": "Pick some fresh leaves of different shapes and sizes.",
      "content": "Pick some fresh leaves of different shapes and sizes. Fresh leaves work best for prints because they won’t break as easily as dry leaves when you press on them. Make sure it’s ok to pick the leaves from the trees or plants where you find them. [2] X Research source Big leaves like maple leaves work really well to make prints. If you aren’t sure what a plant is and you want to pick leaves from it, try looking for pictures of it on your phone to identify it and make sure it is safe to touch."
    },
    {
      "title": "Lay newspapers on a flat work surface and get your leaves and paints ready.",
      "content": "Lay newspapers on a flat work surface and get your leaves and paints ready. Squeeze out some different colors of acrylic paint on a paper plate. Lay out your leaves with the backs facing up. [3] X Research source Leave space between the edges of the newspapers and the leaves so you don’t get paint on the unprotected parts of your work surface."
    },
    {
      "title": "Cover the back of a leaf with acrylic paint.",
      "content": "Cover the back of a leaf with acrylic paint. Paint over the entire backside of the leaf with a generous amount of acrylic paint. Make sure to get paint in all the creases and wrinkles of the leaf so that it makes a detailed print. [4] X Research source The backside of the leaf will make the best print because that is where the veins and details of the leaf are most pronounced. Experiment with different colors on one leaf to create multi-colored patterns."
    },
    {
      "title": "Flip the leaf over onto a piece of paper and carefully press it down.",
      "content": "Flip the leaf over onto a piece of paper and carefully press it down. Apply even pressure on all parts of the leaf. Gently rub every part of the leaf while you press it down so that all parts make an even impression on your paper. [5] X Research source You can use any kind of paper you want. Things like sketch paper, construction paper, and cardstock work well."
    },
    {
      "title": "Use watercolor paints for a different kind of printing effect.",
      "content": "Use watercolor paints for a different kind of printing effect. Cover the back of a leaf with watercolor paint and press it down on a piece of paper. This will give you interesting partial prints instead of the more solid prints that acrylic paint makes. [6] X Research source Don’t make the watercolor paint on your brush too watery, or it won’t transfer well to the leaf. Use just enough water so that the paint sticks to your brush. Press the leaf against your paper very firmly so that the veins make a good impression on the paper."
    },
    {
      "title": "Paint around leaves on paper to create outlines instead of prints.",
      "content": "Paint around leaves on paper to create outlines instead of prints. Put double-sided tape on the back of several leaves and stick them to a piece of paper. Use watercolors or acrylic paints to paint in all the white spaces and around the edges of the leaves. [7] X Research source Try blending a bunch of different watercolors to create a unique looking print with a variety of leaf silhouettes. You can even try adding glitter around the edges of leaves or in the blank spaces on top of the paint to create additional effects."
    }
  ]
}