{
  "url": "https://www.wikihow.com/See-Last-Active-on-Instagram",
  "title": "How to See Last Active on Instagram",
  "steps": [
    {
      "title": "Open Instagram.",
      "content": "Open Instagram. This app icon looks like a camera icon over a rainbow background that you can find on your Home screen, in the app drawer, or by searching. Since you can't access your Direct Messages on a computer natively, you'll have to use the mobile app. You can only view the Last Active status of someone who has not disabled \"Show Activity Status\" in their Instagram profiles. You also must have had at least one Direct Message exchange in which both parties sent at least one message."
    },
    {
      "title": "Tap the airplane icon.",
      "content": "Tap the airplane icon. You'll see this icon in the top right corner, and you'll be redirected to your Direct Messages inbox."
    },
    {
      "title": "Scroll through your messages.",
      "content": "Scroll through your messages. Next to each person's profile picture, you'll see when that person was last active. For example, if Steve Smith was last week, you'll see Active a week ago next to his profile picture. [1] X Research source If someone you follow also follows you, you'll see a green dot in their profile icon around Instagram when they are active. This applies if you haven't messaged them."
    },
    {
      "title": "Open Instagram.",
      "content": "Open Instagram. This app icon looks like a camera icon over a rainbow background that you can find on your Home screen, in the app drawer, or by searching."
    },
    {
      "title": "Tap the profile icon in the bottom right corner of your screen.",
      "content": "Tap the profile icon in the bottom right corner of your screen. This will take you to your profile page."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . You'll see this in the top right corner of your screen. [2] X Research source"
    },
    {
      "title": "Click or tap the gear icon for settings .",
      "content": "Click or tap the gear icon for settings . You'll find this at the bottom of the slide-out menu."
    },
    {
      "title": "Tap Privacy.",
      "content": "Tap Privacy . This is usually the fourth listing in the menu next to the lock icon. [3] X Research source"
    },
    {
      "title": "Tap Activity Status.",
      "content": "Tap Activity Status . This is usually the fourth listing in the menu next to a person and checkmark icon."
    },
    {
      "title": "Tap the switch to enable or disable the feature to show your activity status.",
      "content": "Tap the switch to enable or disable the feature to show your activity status. If you turn this off, you won't be able to see the activity status of anyone else."
    },
    {
      "title": "Go to https://instagram.com.",
      "content": "Go to https://instagram.com . You can use a phone, tablet, or computer to access this site. Log in if prompted."
    },
    {
      "title": "Click the profile icon in the top right corner of the page.",
      "content": "Click the profile icon in the top right corner of the page."
    },
    {
      "title": "Click the gear icon for the Settings menu .",
      "content": "Click the gear icon for the Settings menu . You'll find the gear icon in the middle of the page next to your username."
    },
    {
      "title": "Click Privacy and Security.",
      "content": "Click Privacy and Security . You'll find this in the middle of the pop-up menu between \"Notifications\" and \"Login Activity.\""
    },
    {
      "title": "Click to check or uncheck the box next to \"Show Activity Status.",
      "content": "Click to check or uncheck the box next to \"Show Activity Status. \" If you turn this off, you won't be able to see the activity status of anyone else. [4] X Research source"
    }
  ]
}