{
  "url": "https://www.wikihow.com/Pray-Taraweeh-at-Home",
  "title": "How to Perform the Taraweeh Prayer for Ramadan",
  "steps": [
    {
      "title": "Decide how many rak’at you are going to pray.",
      "content": "Decide how many rak’at you are going to pray. A rak’ah (plural: rak’at) is a unit of prayer that consists of standing and reciting the Qur’an, bowing, standing again, and prostrating. Like every voluntary prayer, Taraweeh is prayed in sets of 2 rak’at at a time, with the ability to rest after every 4 rak’at. [1] X Research source Some narrations state that a complete Taraweeh is 8 rak’at, while others say it is 12 or 20. Decide how many you are going to pray; as long as you pray two by two and conclude with the Witr prayer, you are following the Sunnah. It was narrated by one of the companions of the Prophet (peace be upon him) that “He performed the night prayer in pairs (i.e., rak’ah) and made it an odd number by observing one rak’ah (as Witr).” If you are attending Taraweeh at a masjid, the Imam will usually pray the full 20 rak’at, as all four schools of thought support these narrations."
    },
    {
      "title": "Ensure the area is clean and free of impurities.",
      "content": "Ensure the area is clean and free of impurities. This includes your body, clothes, and the place of prayer itself. If you have urinated, defecated, passed gas, bled excessively, or fallen asleep while leaning against something since your last prayer, perform wudu so that you are ritually pure. [2] X Research source If you are praying in a masjid (mosque), which is highly encouraged for men, enter quietly—other fellow Muslims might still be praying, and you don’t want to disturb them. Stand in a free space away from the entrance/exit. If you are unsure of the cleanliness of your area, spread a mat or cloth on the floor for good measure. This mat (or prayer rug) is very important to Islamic culture."
    },
    {
      "title": "Perform ghusl (full shower) if needed.",
      "content": "Perform ghusl (full shower) if needed. Certain circumstances will require that you perform ghusl instead of wudu to be cleansed after removing najas (impurities) and before praying. If you wish to pray after having sexual intercourse, ending your menstruation period or postpartum bleeding, giving birth, or ejaculating, you need to perform ghusl. [3] X Research source To perform ghusl, wash your entire body and hair with water. It is recommended that you wash 3 times. Be aware that when you perform wudu or ghusl, anything that prevents water from touching the obligatory areas of the body must be removed. This includes things like nail polish, accessories, and waterproof mascara. [4] X Research source"
    },
    {
      "title": "Perform tayammum (dry purification) if needed.",
      "content": "Perform tayammum (dry purification) if needed. If you are unable to use water, you may choose to perform tayammum instead of wudu or ghusl. This rite involves using clean soil or dirt that has not been used before to purify yourself. [5] X Research source"
    },
    {
      "title": "Face the Qibla.",
      "content": "Face the Qibla. This is the direction all Muslims face when praying towards the Holy Ka’bah. The Holy Mosque in Mecca is the most revered place of worship for Muslims around the entire world. All Muslims are required to face the Ka’bah five times every day when offering their prayers. [6] X Research source If you have trouble finding the Qibla , there are many apps that can help you face the right direction."
    },
    {
      "title": "Cover all the required areas of your body.",
      "content": "Cover all the required areas of your body. Men and women must both cover their skin throughout the prayer. Women must cover everything but their faces and hands, while men must cover the area between their navel and knees. [7] X Research source The material you use must cover the body during prayer movements. For example, if bending causes a piece of material to slip and expose skin on a woman’s neck, she would need to tuck her clothing in properly or put more clothing on before she can complete her prayer."
    },
    {
      "title": "Make the intention of Taraweeh.",
      "content": "Make the intention of Taraweeh. Begin performing Taraweeh by making your intention for the Salah. This can be done silently or verbally and in Arabic or your own language. Say something like, “I intend to pray two rak’at for Taraweeh for Allah facing the Ka’bah.” [8] X Research source"
    },
    {
      "title": "Raise your hands and say “Allahu Akbar.”",
      "content": "Raise your hands and say “Allahu Akbar.” Men should raise their hands up to their earlobes, while women should raise theirs to their shoulders. As you raise your hands, say “Allahu Akbar,” which translates to “Allah is the greatest.” When you do so, you enter a state of ihram , which means that all worldly things are forbidden to you, such as talking, laughing, eating, drinking, or thinking about anything that will distract you. [9] X Research source This is usually performed standing, but if you cannot stand for medical reasons, you are allowed to sit down."
    },
    {
      "title": "Place your right hand over your left and recite the Du’a al Istiftah.",
      "content": "Place your right hand over your left and recite the Du’a al Istiftah. Men should place their hands just below the navel, while women should place their hands over their chest. Recite the opening du’a by saying, “Subhanakal-lahumma, wabihamdika watabarakas-muka wataala, judduka wala ilaha ghayruk.” Then say, “A’auodu billaahi minash-shaytaanir rajeem, bis-millaahir rahmaanir raheem.” [10] X Research source The first part of this prayer translates to “O Allah, glory and praise are for You, and blessed is Your Name, and exalted is Your Majesty and there is no god but You.” The second part translates to “I seek protection in Allah from the rejected Satan. In the name of Allah, the Most Gracious, the Most Merciful.” As you have commenced the prayer, you must stay focused. It’s recommended to fix your eyes on the place of prostration so that you don’t look around. It’s greatly disliked to look up when praying. The Prophet (peace be upon him) said, “People must stop raising their eyes to the heavens… during prayer. Otherwise, their sight will be taken away.” [11] X Research source"
    },
    {
      "title": "Recite Surah al Fātiḥah.",
      "content": "Recite Surah al Fātiḥah. This is a key component of the prayer that must be recited in each of the two rak’at of Taraweeh. Say “Alhamdu lillahi rabbi ‘aalameen; Ar-rahmanir raheem; Maaliki yawmid deen; Iyyaka na'budu wa-iyyaaka nasta'eeen; Ihdinas siraatal mustaqeem; Siraatal latheena an'aamta 'alayhim; Ghayril maghdoobi 'alayhim walad dhaalleen.” End by saying “Amin,” which means “let it be so.” [12] X Research source If you are leading the prayer, remember to recite all Surahs out loud."
    },
    {
      "title": "Recite any other Surah.",
      "content": "Recite any other Surah. The minimum recitation is three verses or one long verse that is equal in length to three short verses. It is better, however, to recite a complete Surah. If you have memorized the Qur’an, it’s encouraged to make each rak’ah lengthy by reciting a long Surah. However, if you do not know that many Surahs, it’s okay to recite the ones you know, as long as you recite them in the correct order. [13] X Research source"
    },
    {
      "title": "Bow down and say “Allahu Akbar.”",
      "content": "Bow down and say “Allahu Akbar.” This is the ruku’ position, which allows you to rest. [14] X Research source Bow down and say “Allahu Akbar,” meaning “Allah is the Greatest.” Place your hands on your knees and keep your back as straight as possible. While bowing, say, “Subhanna Rabbiyal Adheem” three times. This means “Glorious is my Lord, the most great.” Some schools of jurisprudence say that you should raise your hands and then go into ruku’, while others do not. Both are valid opinions."
    },
    {
      "title": "Rise from ruku’.",
      "content": "Rise from ruku’. The act of standing from ruku’ is called Qiyam. [15] X Research source While standing up straight, recite “Sami-allah Huliman Hamidah,” which means “Allah hears those who praise him.” Then, say “Rabana Walakal Hamd,” which means “Our Lord, all praise is for you.” You may also add “Hamdan Katheeran Tayyiban Mubaarakan Feeh,” which means “Praise which is abundant, excellent, and blessed.” Some schools of jurisprudence say that you should raise your hands after you have stood back up, while others do not. Both are valid opinions."
    },
    {
      "title": "Say “Allahu Akbar” and go into prostration.",
      "content": "Say “Allahu Akbar” and go into prostration. This is the sajdah position. [16] X Research source Place your forehead, nose, palms, knees, and toes on the floor. When you are in the correct position, say “Subhanna Rabbiyal A’laa” three times. This translates to “Glorious is my Lord, the most High.” Make sure your forearms are not on the floor. Some schools of jurisprudence say that you should go into sajdah with your knees first, while others say you should go into sajdah with your hands first. Both are valid opinions."
    },
    {
      "title": "Sit up while saying “Allahu Akbar,” then return to sajdah.",
      "content": "Sit up while saying “Allahu Akbar,” then return to sajdah. Rest the palms of your hands on your knees and sit on the flat of your left foot, keeping the toes of your right foot planted and pointing forward. This sitting posture is called qa’dah. [17] X Research source After a few moments, return to sajdah while again saying “Allahu Akbar.” Repeat “Subhanna Rabbiyal a’laa” another three times. While sitting, you may choose to recite “Allaahumma-ghfir lee warhamnee wajburnee, warfa’nee, wa ‘aafinee war’zuqnee,” which translates to “O Allah, forgive me, have mercy on me, strengthen me, raise me in status, pardon me, and grant me provision.”"
    },
    {
      "title": "Say “Allahu Akbar,” stand up, then complete another rak’ah.",
      "content": "Say “Allahu Akbar,” stand up, then complete another rak’ah. When you stand up, you will have completed one rak’ah. Taraweeh is prayed in sets of two, so you must now complete another rak’ah in the exact same way. [18] X Research source"
    },
    {
      "title": "Stay seated after the second sajdah in the second rak’ah.",
      "content": "Stay seated after the second sajdah in the second rak’ah. At this point, you must recite certain du’as from your seated position. Recite the du’as as follows: Tashahhud: At-tahiyyaatu Lillaahi wa-salaawaatu wa-tayyibaat. As-salaamu ‘alayka ayyuha-Nabiyyu wa rahmatullaahi wa barakaatuhu. As-salaamu ‘alayna wa ‘ala ‘ibaad-illaah-is-saaliheen. Ash-hadu al-aa ilaaha ill-Allaah wa ash-hadu anna Muhammadan ‘abduhu wa rasooluhu. [19] X Research source \"All compliments, prayers, and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous slaves of Allah. I bear witness that there is no god except Allah and I bear witness that Muhammad is His slave and Messenger.\" Durood: Allaahumma salli ‘ala Muhammad, wa ‘ala aali Muhammad, kama salayta ‘ala Ibraaheem, wa ‘ala aali Ibraaheem, innaka hameedun majeed. Allaahumma baarik ‘ala Muhammad, wa ‘ala aali Muhammad, kama baarakta ‘ala Ibraaheem, wa ‘ala aali Ibraaheem, innak hameedun majeed [20] X Research source \"O Allah, send prayers upon Muhammad and upon the family of Muhammad, as You sent prayers upon Ibraaheem and the family of Ibraaheem, You are indeed Worthy of Praise, Full of Glory. O Allah, bless Muhammad and the family of Muhammad as You blessed Ibraaheem and the family of Ibraaheem, You are indeed Worthy of Praise, Full of Glory.\""
    },
    {
      "title": "Finish the prayer with tasleem.",
      "content": "Finish the prayer with tasleem. Turn your head over your right shoulder while saying “As-salamu alaykum wa Rahmatullah,” which translates to “May peace, the Mercy of Allah, and His blessings be upon you.” Then, turn your head to the left and do the same. [21] X Research source"
    },
    {
      "title": "Conclude the Taraweeh with the Witr prayer.",
      "content": "Conclude the Taraweeh with the Witr prayer. When you’ve prayed your chosen amount of two-by-two rak’at, round it all off by praying an odd number of Witr rak’at . Most commonly, people pray one or three rak’at Witr. For example, pray 12 rak’at of Taraweeh, then one rak’ah of Witr to make it 13 rak’at in total. [22] X Research source"
    },
    {
      "title": "Taraweeh is a voluntary night prayer performed during Ramadan.",
      "content": "Taraweeh is a voluntary night prayer performed during Ramadan. Taraweeh (or Tarawih) translates to “rest” or “relaxation.” It is a voluntary prayer performed after the evening prayer, Isha , every night during Ramadan. It is a highly recommended Sunnah , and mosques around the world hold congregational Taraweeh prayers every night of the month of Ramadan. [23] X Research source"
    },
    {
      "title": "Many believe those who pray Taraweeh will have their sins forgiven.",
      "content": "Many believe those who pray Taraweeh will have their sins forgiven. According to Bukhari, the Prophet (peace be upon him) said, “He who observes optional prayer (Tarawih prayers) throughout Ramadan, out of sincerity of Faith and in the hope of earning reward will have his past sins pardoned.” Praying Taraweeh also carries the reward of following the Sunnah, and because it is performed during Ramadan, it is believed that your rewards will be multiplied. [24] X Research source"
    },
    {
      "title": "How many rak’at are in Taraweeh?",
      "content": "How many rak’at are in Taraweeh? The amount of rak’at you perform during Taraweeh varies depending on the narration you follow. Like any voluntary prayer, Taraweeh is prayed in sets of two rak’at. [25] X Research source Some narrations state that a complete Taraweeh is 8 rak’at, while others state that it’s 12 or 20. It is up to you to decide how many rak’at you will perform when praying Taraweeh at home."
    },
    {
      "title": "When is Taraweeh performed?",
      "content": "When is Taraweeh performed? Taraweeh is performed every night of the month of Ramadan, following the evening prayer, Isha. You must perform Taraweeh before Fajr begins, and you should not pray Taraweeh after you have performed the Witr prayer, as the Witr is the last prayer of the night. [26] X Research source"
    },
    {
      "title": "Can Taraweeh be performed at home?",
      "content": "Can Taraweeh be performed at home? Yes, Taraweeh can be performed at home in congregation with your family or alone. While Taraweeh is also performed in mosques, the Prophet Muhammad (peace be upon him) performed most of his Taraweeh prayers at home, as Taraweeh was never a nightly congregational prayer in his lifetime. [27] X Research source"
    },
    {
      "title": "Can I hold a Qur'an while praying?",
      "content": "Can I hold a Qur'an while praying? According to the Hanbali, Maliki, and Shafi’i schools of thought, it is permissible to hold a copy of the Qur'an during any voluntary prayer, even if you are the one leading the prayer. [28] X Research source However, there is a difference of opinion within the Hanafi school of thought; some Hanafi scholars believe it is impermissible to hold the Qur'an while praying, while others say that it is permissible but disliked. The Shafi’i school of thought states that, while holding the Qur'an, you must ensure that you don’t move so much that your prayer is invalidated."
    },
    {
      "title": "Is there a special du’a to recite for Taraweeh?",
      "content": "Is there a special du’a to recite for Taraweeh? There is no special du’a to recite during or after Taraweeh. Make any du’a you choose after every four rak’at or after the entire Taraweeh has been completed. This includes du’as from the Qur'an and Sunnah as well as personal du’as."
    },
    {
      "title": "Can women lead the Taraweeh prayer at home?",
      "content": "Can women lead the Taraweeh prayer at home? Women can lead other women in congregational prayer. The woman who is leading the prayer will stand in the same row as other women and recite “Allahu Akbar” and all the Surrahs out loud. They will also say the final “Assalamu alaikum wa rahmatullah.”"
    },
    {
      "title": "Do I have to recite the entire Qur'an during Taraweeh?",
      "content": "Do I have to recite the entire Qur'an during Taraweeh? It is not compulsory to recite the entire Qur'an during Taraweeh. The sincerity of your prayer is the most important thing, so don’t worry if you don’t have many Surahs memorized. Most mosques typically recite the whole Qur'an throughout Ramadan, completing one Juz per night of Taraweeh. [29] X Research source"
    }
  ]
}