{
  "url": "https://www.wikihow.com/Say-Hello-in-Italian",
  "title": "How to Say Hello in Italian",
  "steps": [
    {
      "title": "Say buongiorno to greet people during the day.",
      "content": "Say buongiorno to greet people during the day. When greeting strangers, as well as older relatives, friends, and acquaintances, buongiorno (BWON JOOR-noh) is the most common daytime greeting. It essentially translates to \"good day.\" [2] X Research source As with most Italian greetings, you can use buongiorno both as a \"hello\" when you initially meet someone and as a \"goodbye\" when you take your leave."
    },
    {
      "title": "Transition to buona sera later in the evening.",
      "content": "Transition to buona sera later in the evening. After 4:00 p.m. or so, buongiorno is no longer considered appropriate. If you're out for dinner or greeting people at night, use buona sera (BWO-nah SEH-rah) to say \"good evening\" to people you meet. [3] X Research source Italians typically take a nap (a riposo ) in the afternoon between 2:00 and 4:00 p.m. Anytime after the riposo has passed is generally considered evening. Italian r s are trilled. A trilled r is a slightly shorter, more clipped sound than a rolled r , but it is not the same sound as an English r . For a close approximation, say Italian r s as a d , with the tip of your tongue clipping the top of the back of your front teeth."
    },
    {
      "title": "Ask after the person's well-being.",
      "content": "Ask after the person's well-being. A greeting normally doesn't stop with a simple \"hello.\" To ask \"How are you?\" say come sta (KOH-meh stah) if speaking to a stranger, especially if they are older than you or in a position of authority. If you're speaking to someone your age or younger, or to a friend or acquaintance, use come stai (KOH-meh STAH-yee), the more informal form. [4] X Research source The standard response to come sta is bene grazie (BEH-neh GRAHT-see-eh), which essentially means, \"I'm well, thank you.\" If the other person has beaten you to the punch and asked you how you are first, you might respond bene grazie, e tu? (if they are your age or younger) or bene grazie, e lei? (if you are speaking formally). In formal settings, such as at a business meeting, asking come sta may be considered too direct and personal. If the person has traveled to meet you, it's appropriate to ask them about their trip. You might also compliment them on an accomplishment or let them know that you admire them as a leader or expert in their field."
    },
    {
      "title": "Extend your hand when meeting someone for the first time.",
      "content": "Extend your hand when meeting someone for the first time. Italians have a warm and friendly culture and make physical contact a lot more than you may be used to. When greeting someone, even casually on the street, it's common to shake hands with the person. [5] X Research source If you present as a woman, in many parts of Italy it is customary for you to extend your hand first when greeting someone who is presenting as a male. While shaking someone's hand, make direct eye contact and smile. Italians normally don't place their other hand over the top of your hand, but may grasp your elbow or upper arm. Italians typically greet friends and family with air kisses, one on the left cheek and one on the right, regardless of gender. However, in Southern Italy, men usually reserve kisses for family members only. If you're unsure of the custom, follow the other person's lead."
    },
    {
      "title": "Use pronto to greet people over the phone.",
      "content": "Use pronto to greet people over the phone. If you answer the phone in English, you'll typically say \"hello.\" In Italian, the custom is to say pronto (PROHN-toh), which technically means \"ready.\" [6] X Research source Pronto is only used as a greeting over the phone. If you use it in any other context, you'll likely get some strange looks."
    },
    {
      "title": "Use ciao to greet friends.",
      "content": "Use ciao to greet friends. Despite the fact that ciao (chow) is perhaps one of the most universally known Italian greetings, it is used exclusively with friends and family who you know very well. Ciao is never used with strangers. You should also never use it with people who are older than you or in a position of authority – you'll be seen as rude. [7] X Research source You may also be familiar with the phrase ciao bella (chow BEHL-lah), which means \"hello beautiful.\" This phrase is typically used flirtatiously, although it may also be used among friends. Be careful using it with acquaintances, however – they might get the wrong idea. Ciao can be used both when you arrive and when you depart, as a \"hello\" or a \"goodbye.\""
    },
    {
      "title": "Greet a group of friends by saying ciao a tutti.",
      "content": "Greet a group of friends by saying ciao a tutti . In all but the most informal settings, you're typically expected to greet each person individually. Even with a group of friends, you should still greet people individually if you don't know them very well. [8] X Research source"
    },
    {
      "title": "Switch to salve if you're unsure about the context.",
      "content": "Switch to salve if you're unsure about the context. Salve (SAHL-veh) means \"hi,\" and is generally appropriate in any situation. While many words and phrases in Italian are considered either polite and formal or casual and informal, salve is used in both contexts. [9] X Research source If you've known someone for a long time and are very close to them, they will likely consider salve too formal. In that situation, you'd be better off using ciao ."
    },
    {
      "title": "Say bella when greeting younger people.",
      "content": "Say bella when greeting younger people. Bella technically means \"beautiful,\" or even \"nice,\" but young people in Italy also use it as a generic greeting, similar to ciao . This is relatively youthful slang, however, so avoid using it with people over 30, or if you are over 30 yourself. You'll sound immature. [10] X Research source Bella is often followed by an Italian word that means \"guys\" or \"dudes,\" such as bella lì or bella zio . [11] X Research source"
    },
    {
      "title": "Add come butta to ask the person \"what's up\" in Italian.",
      "content": "Add come butta to ask the person \"what's up\" in Italian. No one's going to look at you strangely if you simply say come sta . But if you want to sound a little cooler and blend in more with Italian friends your age, you might try come butta (KOH-meh BOOT-tah), which is a bit more casual. [12] X Research source Avoid this type of slang in public settings, such as if you're greeting a server at a restaurant, even if they seem to be around your age or younger. In that setting, this phrase can be considered too direct and the person might take it as rude or even condescending."
    },
    {
      "title": "Tell the person your name after your initial greeting.",
      "content": "Tell the person your name after your initial greeting. When you're meeting someone for the first time, you typically want to follow up a greeting by telling them your name. To do this in Italian, say mi chiamo (mee kee-AH-moh) followed by your name. [13] X Research source If you want to ask the other person their name, you might say come ti chiami (informal) or come si chiama (formal). If you've initially said your name first, you can also use e tu (informal) or e lei (formal), both of which mean \"and you.\""
    },
    {
      "title": "Let the person know you're pleased to meet them.",
      "content": "Let the person know you're pleased to meet them. After you've learned someone's name, it's polite to say piacere (pee-ah-SHEHR-reh), which means \"pleased to meet you.\" You can also say piacere di consoscerti (informal) or piacere di consocerla (formal). [14] X Research source If you're meeting someone around your age and speaking informally, you might say incantato (or incantata if you present as female) instead. It's similar to the English word \"enchanted,\" and is typically intended to be flirtatious. Italians are a bit more formal than most English-speakers. If you're talking to an older person, address them by their title and their last name unless and until they tell you otherwise."
    },
    {
      "title": "Explain where you are from.",
      "content": "Explain where you are from. Especially if you're a tourist traveling in Italy, the person you've just met will likely want to know where you're traveling from. To tell someone where you're from, you can say vengo da (VEEN-goh dah) or sono di (SOH-noh dee), followed by the name of your country (or even the city, if your hometown is well-known). [15] X Research source To ask where someone is from, you can say di dove sei (informal) or di dov'è (formal). Italians may also tell you that they are someone from a particular city. Just as in English you might say \"I'm a New Yorker,\" Italians may say sono Milanese or sono Romano ."
    },
    {
      "title": "Discuss your proficiency in Italian.",
      "content": "Discuss your proficiency in Italian. At this point in a conversation, if you only know a few words in Italian, you should let the person you're talking to know that. Then, you can find out if they speak English or another language in which you are fluent. On the other hand, if you want to practice your Italian, you can ask them to continue speaking Italian to you. Some phrases you might use include: [16] X Research source \"Parli inglese?\" (informal) or \"Parla inglese?\" (formal): \"Do you speak English? \"Può parlare più lentamente?\": \"Please speak more slowly.\" \"Parli un'altra lingua oltre l'italiano?\": \"Do you speak a language other than Italian?\" \"Parla italiano con me\": \"Speak to me in Italian.\" Accent marks over letters merely indicate which syllable of the word should be stressed. They don't change the sound of the letter."
    }
  ]
}