{
  "url": "https://www.wikihow.com/Play-Office-April-Fool%27s-Day-Pranks",
  "title": "How to Play Office April Fool's Day Pranks",
  "steps": [
    {
      "title": "Check your employee handbook for rules on pranks.",
      "content": "Check your employee handbook for rules on pranks. Before you pull any pranks, it's a good idea to make sure that your office doesn't strictly prohibit or restrict pranks in the workplace. Then double-check the rules to make sure that your prank wouldn't constitute any kind of dismissible or reprimandable offense. [1] X Research source Make sure your pranks would not be considered harassment (including sexual harassment). If you're unclear on the rules or unsure about whether a prank would be allowed in the workplace, it's best to talk to your supervisor to get permission first. Describe the types of pranks you're planning and see what he or she says."
    },
    {
      "title": "Keep your pranks reasonable.",
      "content": "Keep your pranks reasonable. When you devise a prank to play on a coworker, it's important to choose pranks that you wouldn't mind receiving. Think of it as treating others the way you want to be treated since your coworkers will most likely retaliate. [2] X Research source If you're going to dish out pranks, you'll need to anticipate pranks in return. A good gauge is to ask yourself, \"Would I be upset at all if someone did this to me?\" (And someone almost certainly will.) Think about any possible repercussions that might arise from your prank. [3] X Research source Avoid any pranks involving race, religion, or sex. You should also generally avoid any pranks that might make someone uncomfortable."
    },
    {
      "title": "Select the right targets.",
      "content": "Select the right targets. It's always important to make sure you pull pranks on the right people - someone you know well, someone whose sense of humor you know well, or a regular office prankster. In really serious cases, a prank could even get you in trouble, so it's important to be aware of whom you play pranks on and how intense they get. [4] X Research source Do not play a prank on anyone you've had tension or feuds with in the past, as a prank may set that individual off. Avoid pranking your boss unless you know him or her extraordinarily well and can pull off a prank that won't challenge his/her authority. Without some type of close, personal relationship with your boss, your pranks could land you in hot water. [5] X Research source Don't prank anyone who is considered vulnerable or easily upset. This could create a very negative situation at your office and may result in you being reprimanded."
    },
    {
      "title": "Choose the right time, place, and situation.",
      "content": "Choose the right time, place, and situation. Most people will find pranks to be in good fun. If you pull a prank at the wrong place/time or in the wrong situation, though, you could end up getting into serious trouble (and possibly even losing your job). [6] X Research source If your pranks disrupt work productivity in any way, or if they unfold in front of an important person (like the CEO or a prospective business partner), your prank may get you fired. Remember that your pranks are not being played on your friends at home. Your office friends may have a different sense of humor and different boundaries, so be respectful of where and when you pull off a prank. [7] X Research source"
    },
    {
      "title": "Render a coworker's mouse temporarily inoperable.",
      "content": "Render a coworker's mouse temporarily inoperable. This simple prank is easy to pull off and will leave your coworker scratching his or her head. You may want to write \"April Fools\" on the paper you attach to the bottom so your coworker recognizes it was a prank once he or she notices the paper. [8] X Research source Put a Post-It note on the underside of a coworker's computer mouse. Trim the sides so that the paper isn't sticking out. The goal is for your coworker to not realize that the mouse's laser track is just covered up. Watch as your coworker tries and fails to get his or her mouse to work."
    },
    {
      "title": "Reset someone's computer desktop and screensaver.",
      "content": "Reset someone's computer desktop and screensaver. This prank works best with a coworker you know fairly well. It will also have to be someone who doesn't use a password to lock his/her computer, but make sure you don't mess with any computers that contain office-sensitive material. It's best to stay clear of going onto someone's computer in HR or accounting, for example. [9] X Research source You can make the desktop background a photo of the wall behind that computer. You can also use a photo of your face, or of something that will get a laugh (like your coworker's face edited into a ridiculous photo). [10] X Research source Make sure the photograph(s) you use won't upset anyone. Don't use anything sexually suggestive or racially/ethnically offensive."
    },
    {
      "title": "Prank call a coworker.",
      "content": "Prank call a coworker. Prank calls are a classic way to mess with someone. Just make sure that any prank calls you make or arrange for someone else to make are work-appropriate. Don't be offensive or threatening in the prank call, just say weird things that don't make any sense and try to (playfully) frustrate your coworker. [11] X Research source You can make your prank calls even more convincing by using an unrecognizable voice and phone number. Have a friend (whose voice won't be recognized) make the call for you from a blocked phone number. You can also try using a service like Prank Me or similar services. Prank Me charges 99 cents (USD) for a blocked phone number and your choice of pre-recorded responses. [12] X Research source Have the person prank-calling your coworker complain about something work-related. You might even have the person tell your coworker that your supervisor wants to see him/her. However, make sure your supervisor is in on the fun; otherwise, you might end up getting in trouble for wasting everyone's time."
    },
    {
      "title": "Sabotage a coworker's office.",
      "content": "Sabotage a coworker's office. Sabotaging someone's office is a great prank. As long as the sabotage doesn't require a lengthy or difficult cleanup, it will probably be a big hit around the office. You can fill an office with packing peanuts, since many offices have these on hand. [13] X Research source You can also fill an office with balloons. Just make sure you bring an air pump so you don't have to blow them all up by mouth. [14] X Research source Try wrapping a coworker's office (both furniture and equipment) in tin foil or newspaper, or covering the office in Post-It notes. They're easy to remove but will still get a laugh. [15] X Research source"
    },
    {
      "title": "Tape up someone's phone.",
      "content": "Tape up someone's phone. The point of this prank is to make someone unable to speak into his or her office phone without realizing the reason why. This is a harmless prank, though some coworkers may find it mildly annoying. Be sure that the person you choose to play this prank on knows you well and gets your sense of humor. [16] X Research source Take a picture of the phone's receiver so you know the exact color to look for. Go to an office supply store and find a roll of tape that matches the phone's color perfectly. When your coworker is out of the office (either in the morning or during a lunch break), carefully apply pieces of the tape to the part of the receiver where your coworker speaks into the phone. Make sure the tape doesn't extend past that part of the receiver. If your coworker grabs the phone and feels tape extending all the way around, he or she will realize what happened. You may want to try to replicate the pattern of holes in that part of the receiver so that your coworker won't notice the tape. Use a black marker and try to recreate the pattern as closely as possible."
    },
    {
      "title": "Set up a whoopee cushion.",
      "content": "Set up a whoopee cushion. Whoopee cushions have been a staple of pranks for many years, and their use in offices is nothing new. [17] X Research source When properly executed, a whoopee cushion prank will leave your coworker who sits on it feeling shocked and embarrassed as the rest of the office looks up in horror. Inflate the whoopee cushion. You'll need to blow it up by mouth, but make sure it's not so full that the cushion is bulging and noticeable. It will be fairly obvious that there is a whoopee cushion there if it's left sitting plainly on the chair. Look for a coworker who uses a seat cushion or leaves his/her sweater hanging off the back of the chair. Place the whoopee cushion either under the seat cushion or against the back of the chair. If using the back of the chair, drape your coworker's sweater over it so that the whoopee cushion will remain hidden. Make sure the coworker you choose has a good sense of humor. Many people would be embarrassed or even mildly angry to be the victim of this prank, so choose carefully."
    },
    {
      "title": "Have a fake newspaper printed up and leave it in the office.",
      "content": "Have a fake newspaper printed up and leave it in the office. Fake newspapers are a classic way to trick others into believing your lies. You can have a fake newspaper printed up by searching online for websites that offer these services. It might cost you a few dollars in printing/editing or labor fees, but if it works, it'll be well worth it. [18] X Research source Make sure the fake newspaper isn't offensive or inappropriate for work. You can also upload photos to your computer and put together a fake office newsletter to email to your coworkers. Make it look like a local paper, and have a headline somewhere on the front page about the office filing for bankruptcy or laying off most of its staff. Be sure the joke doesn't go on for too long, as this could start false rumors that could get you in trouble."
    },
    {
      "title": "Leave a doughnut box full of vegetables in the break room.",
      "content": "Leave a doughnut box full of vegetables in the break room. Nothing gets people excited in the break room like coffee and doughnuts. Imagine your coworkers' surprise when they reach for a glazed doughnut only to find broccoli, carrots, and cucumber slices. [19] X Research source Get a doughnut box. You can either buy a dozen doughnuts and eat them all at home, or just ask an employee at a doughnut shop for an empty box. Fill the box with fresh veggies. Make sure they're not damp so that the packaging doesn't get wet; otherwise, you might give your prank away. Leave the box in the break room or kitchen area with a note that reads, \"Free doughnuts today - take one!\""
    },
    {
      "title": "Mess with the office printer and/or copy machine.",
      "content": "Mess with the office printer and/or copy machine. Office equipment is something that can allow your prank to reach any of your coworkers equally. These pranks are harmless enough that they'll get laughs without causing any actual damage to the office equipment. Just make sure your coworkers would find these pranks funny before you pull them off. Print out an official-looking memo that says the office equipment has been upgraded to have voice-activated technology. Then watch as coworkers try to talk (and eventually yell) at the printer or copy machine. [20] X Research source You can also tape a funny photograph under the cover of a scanner or copy machine. When your coworkers open the lid to use the equipment, they'll be in for a humorous surprise. [21] X Research source You can also run a job that uses all the paper in the printer, but that may get you in trouble."
    }
  ]
}