{
  "url": "https://www.wikihow.com/Remove-Polyurethane",
  "title": "How to Strip Polyurethane Without Damaging the Wood Underneath",
  "steps": [
    {
      "title": "Chemical solvents",
      "content": "Chemical solvents Generally, chemical solvents are the fastest and easiest way to strip polyurethane finishes. They’re also relatively inexpensive and available at most hardware or home improvement stores. However, they are considered hazardous materials—the vapors can irritate your eyes, and inhalation can lead to dizziness, headaches, nausea, or even unconsciousness in severe concentrations. [1] X Research source The best chemical solvents for polyurethane include: Paint- or varnish-stripper [2] X Research source Isopropyl alcohol Xylene [3] X Research source Acetone [4] X Research source Mineral spirits"
    },
    {
      "title": "Natural removers",
      "content": "Natural removers Natural varnish-strippers and bio-based solvents are less harsh and dangerous than chemical solvents and are good options for people who want to avoid harsh fumes (especially if you’re working indoors). However, they’re not as strong as chemical solvents and take much longer to eat away at polyurethane. If you want to go the natural route, try a: Citrus solvent Water-based solvent [5] X Research source Soy-based paint remover [6] X Research source Some DIYers have reported mixed success with homemade varnish removers using ingredients like baking soda and vinegar. However, these have the potential to stain or discolor the wood underneath (especially baking soda, which can scratch wood or leave stains when it reacts with the tannins in the wood). [7] X Research source"
    },
    {
      "title": "Put on protective gear and open up your windows for ventilation.",
      "content": "Put on protective gear and open up your windows for ventilation. To avoid inhaling chemical fumes, open all doors and windows in your work room and set up a fan to create cross-ventilation (or, if possible, work outside). To protect yourself, wear rubber gloves, goggles to protect your eyes, and a respirator mask to avoid inhaling fumes. [8] X Research source To avoid splashes and irritation on your skin, wear closed-toed shoes, long sleeves, and pants. If you're working on a piece of furniture inside, put a plastic tarp or other protective layer down to cover the floor."
    },
    {
      "title": "Dust and mop the floor or surface.",
      "content": "Dust and mop the floor or surface. Sweep up loose debris into a dustpan and then mop the floor with water and mild detergent (or use a rag to clean furniture pieces or smaller areas). A quick cleaning allows your stripper or solvent to remove and react with the polyurethane faster and more easily. [9] X Research source"
    },
    {
      "title": "Paint a coating of your solvent on the area and let it sit for 20 minutes.",
      "content": "Paint a coating of your solvent on the area and let it sit for 20 minutes. Completely coat the polyurethane with a generous layer of your solvent. Use an old paintbrush or even a paint roller, making sure to get into any nooks and crannies. Once the polyurethane is coated, wait 10-20 minutes. You'll know it’s ready when the polyurethane starts wrinkling or bubbling. [10] X Research source The type of paint brush isn't important, but you may want to get one you'd be willing to throw away afterward. If you're using a water-based stripper or eco-friendly solvent, it will take much longer to work (maybe even 6 to 24 hours). Check the back of the can to find out how long it should take. If you need to leave the project for longer than it says on the back of the can, cover the project with a tarp or plastic sheet to keep the paint stripper wet."
    },
    {
      "title": "Use a plastic scraper, putty knife, or steel wool to peel off the polyurethane.",
      "content": "Use a plastic scraper, putty knife, or steel wool to peel off the polyurethane. If the solvent has had enough time to work, the polyurethane should peel off fairly easily. Work in small sections, sliding the scraper or knife under the bubbling polyurethane to lift it. If you’re working on furniture, use a fine-grit steel wool pad or wire brush to clear up the edges, corners, and small nooks or crannies. [11] X Research source Scrape in the direction of the wood grain. Scrubbing against the grain can damage the surface of the floors or furniture. Plus, if you add any scratches, it will look like the grain of the wood."
    },
    {
      "title": "Rub the polyurethane residue down with afterwash or mineral spirits.",
      "content": "Rub the polyurethane residue down with afterwash or mineral spirits. Afterwash is a solvent you use after paint- or varnish-stripper. Its purpose is to clean up the remaining polyurethane and remove the paint stripper you used. Just use a paper towel to rub it in. You don't have to leave it on for any time—simply wipe it on until the rest of the polyurethane comes up. [12] X Research source Popular afterwashes include Klean Strip After Wash and CitriStrip Paint & Varnish Stripping Gel . Follow the instructions on the bottle for the best results. Low-odor mineral spirits are a common DIY afterwash, too. If there’s still polyurethane left, go through the process again. Apply another layer of paint stripper to the area, then scrape it down again, checking to see if that completes the process."
    },
    {
      "title": "Sand away the last of the polyurethane residue with fine steel wool or sandpaper.",
      "content": "Sand away the last of the polyurethane residue with fine steel wool or sandpaper. The afterwash should have taken off nearly all of the polyurethane, which is why you probably won’t need heavy-duty sandpaper. Just go over the wood with a fine-grit steel wool pad or around 150-grit sandpaper to give the wood a smooth finish. Remember to rub with the grain to avoid visible scratches. [13] X Research source If you want to re-stain the wood a new color: Professional carpenter Sam Hubbard advises to “Sand [the floor or furniture] down to bare wood using 120-grit sandpaper. Follow that up with 150-grit. Then, work your way up to 180-grit. Wipe it with a tack cloth. Now you're ready to begin with the new stain color.” If you want to re-apply a polyurethane coating : “Start by sanding the surface with 180-grit sandpaper,” Hubbard explains. “Wipe down the surface with a tack cloth to remove dust. Then, apply 3 coats of polyurethane with a brush. Lightly sand between coats with #00 steel wool, followed by a wipe down with a tack cloth. After the final coat, use a piece of cardboard instead of sandpaper to buff the surface. That will give you the nicest polyurethane finish you've ever seen and felt.”"
    },
    {
      "title": "Yes, but it’s not the best approach in all scenarios.",
      "content": "Yes, but it’s not the best approach in all scenarios. Sanding is best for thick or uneven layers of polyurethane because chemical solvents may not be as effective. Depending on the thickness, you may also have to go through a lot of sandpaper as the polyurethane will gum up the grit pretty quickly. If you want to try sanding, here’s how: [14] X Research source Start sanding with very coarse sandpaper first (around 60-80 grit). You can use regular sandpaper or a sanding block for small surfaces, or a floor sander or orbital sander for floors and large surfaces. Continue sanding with the grain of the wood until the majority of the polyurethane is removed. Then, switch to a medium-grit sandpaper (around 120 grit). Sand to remove any remaining residue and to smooth the surface of the wood. Finish with fine-grit sandpaper (around 180-220 grit) to make the wood look finished."
    },
    {
      "title": "How do you strip polyurethane from plastic?",
      "content": "How do you strip polyurethane from plastic? You can remove polyurethane from plastic the same way you’d remove it from wood—coat it with a solvent, scrape it up, and wipe or lightly sand the residue away. However, some solvents may damage certain kinds of plastic. Test a few drops of solvent in an inconspicuous area (or on a different piece of the same type of plastic) to make sure it won’t ruin it. Some DIYers have found that soaking the plastic in a degreaser or all-purpose cleaner concentrate is effective and doesn’t damage the plastic."
    },
    {
      "title": "How do you dispose of polyurethane safely?",
      "content": "How do you dispose of polyurethane safely? Soak your discarded rags and steel wool in water to avoid fires, as polyurethane is flammable. [15] X Research source Take the water and rags to a hazardous waste disposal unit near you, along with any leftover stripper (unless you plan to use more later). Do not throw rags and chemicals directly into the trash or sewer. Contact your city to find your local waste disposal center."
    },
    {
      "title": "How do you remove polyurethane from your hands?",
      "content": "How do you remove polyurethane from your hands? Since most polyurethanes used to coat wood are oil-based (as opposed to less durable water-based polyurethane), oily household products like vegetable oil, grease-fighting dish soap, or even peanut butter can remove it from your skin while it’s still wet. Just wash and rub your hands with whichever substance you have on hand to remove accidental polyurethane spills. [16] X Research source Mineral spirits or denatured alcohol can also remove polyurethane from your skin but can cause irritation since they’re strong solvents. Quickly wipe the polyurethane away, then immediately wash your hands and moisturize to prevent irritation. If you notice a small spot of dried polyurethane on your hands, wait a day for it to dry and crack. Then, you can easily scratch or peel it off."
    }
  ]
}