{
  "url": "https://www.wikihow.com/Make-a-Wedding-Dress",
  "title": "How to Make a Wedding Dress",
  "steps": [
    {
      "title": "Determine the basic shape of your dress.",
      "content": "Determine the basic shape of your dress. There are many wedding dress shapes. You may have pictured one that doesn’t work for your body. The best way to find that out is to go try on some wedding dresses. [1] X Expert Source Kpoene Kofi-Bruce Couture Bridal Designer Expert Interview. 28 January 2021. Tell them that you wish to try on every shape in order to decide on just one. [2] X Research source Apple body: empire waistlines, A-line silhouettes Pear body: ball gown, A-line silhouettes Rectangle body: mermaid, empire waist Hourglass body: natural waistline, added waistline accents"
    },
    {
      "title": "Consider other factors.",
      "content": "Consider other factors. Flattering your body is the most important part of choosing the right shape for you. Other aspects go into your decision. They can help lead you toward the right fabric for your dress as well. Location of the wedding is important. If you’re on the beach, you want a soft, light, and flowy shape and fabric. If you’re having a wedding in a grand cathedral, consider the season along with how much you want to stand out on your day in order to choose the shape and fabric. Determine your skill set. Some shapes and fabrics are more difficult to sew. If you’re new to sewing, choose a more basic shape and a fabric that allows for mistakes."
    },
    {
      "title": "Choose your fabric.",
      "content": "Choose your fabric. Find a material that you love and that you can work with. You may like the feel of a fabric but not the way it flows. The only way to be sure of this is to try dresses on in multiple fabrics, just like you did in multiple shapes. Of course, you can choose any fabric that you’d like, but there are popular fabrics for wedding dresses. [3] X Research source Chiffon: Delicate, sheer, and often layered Jersey: Elastic knit fabric, lengthwise and crosswise ribbing Moire: Heavy, silk taffeta, wavy design Organza: Crisp, sheer, stiffer texture Satin: Heavy, smooth, and high sheen Silk: Expensive, comes in multiple textures Taffeta: Crisp, smooth, slight ribbing Tulle: Netting made of silk, nylon, or rayon; used mostly for skirts and veils."
    },
    {
      "title": "Choose a color.",
      "content": "Choose a color. Although standard wedding dresses are often labeled as “white,” there are multiple shades of white commonly used. Ivory, crème, off-white, pure white, stark white, and silk white are just a few. Find one that compliments your complexion."
    },
    {
      "title": "Sketch your dress.",
      "content": "Sketch your dress. Now that you have a good idea of the shape you want and the fabric you’re going to use, draw out what you want your dress to look like. Sketch front and back, and sketch any details in a closer portion if needed."
    },
    {
      "title": "Ask a friend.",
      "content": "Ask a friend. Have someone else take your measurements. It is more accurate for someone else to do it rather than yourself. After sketching the shape that you want, be sure to label it with your measurements."
    },
    {
      "title": "Measure your bust.",
      "content": "Measure your bust. Measure at the fullest part of your chest. Be sure to wear the bra that you’ll wear on your wedding day when taking measurements. You should be wearing nothing on top of the bra."
    },
    {
      "title": "Measure your hips.",
      "content": "Measure your hips. Stand naturally with your heels together in a relaxed position. Measure the fullest part of your hip, being sure to go full circle."
    },
    {
      "title": "Measure your waist.",
      "content": "Measure your waist. This measurement should be at the natural curve of your waist. The smallest waist area is approximately 1” above your belly button. Don’t pull in your stomach unnaturally or pull the tape too tight."
    },
    {
      "title": "Measure hollow to hem.",
      "content": "Measure hollow to hem. This is taken from right above the collarbone to where you want the bottom hem. Make sure to account for the shoes you’ll be wearing on your wedding day."
    },
    {
      "title": "Make your own sewing pattern.",
      "content": "Make your own sewing pattern. If you’re seasoned in making sewing patterns, you can make your own. Use your measurements to make your pattern, adding 1.5” for seam allowance. If you’ve never made your own pattern, a wedding dress is a very difficult pattern to begin with."
    },
    {
      "title": "Buy a sewing pattern.",
      "content": "Buy a sewing pattern. Once you have your fabric and style picked out, you can go to fabric stores and look through pattern books or you can order online. Each will be rated by level of difficulty. [4] X Research source Make sure that a key/glossary, layout, and step-by-step instructions are included. When you order your pattern, it is easy to combine multiple sizes to get the pattern as close to your measurements as possible. It's a good idea to get a few different sewing patterns so you can experiment with the fit you like best. [5] X Expert Source Kpoene Kofi-Bruce Couture Bridal Designer Expert Interview. 28 January 2021."
    },
    {
      "title": "Use the right material.",
      "content": "Use the right material. Patterns can be printed on a variety of materials. For example, it can be printed on large pieces of tissue paper, or stiffer white paper. The stiffer paper is better if you’ll be using it a lot. If you decide on tissue paper, make an extra pattern, just in case something happens to the original."
    },
    {
      "title": "Buy your fabric.",
      "content": "Buy your fabric. Now that you have your patterns, you’ll have the exact measurements that you’ll need to construct your dress. Go to the fabric store and pick up your fabric. If you’re going to use lace, you’ll want a base fabric. You’ll attach the lace overlay over this base layer. Some fabrics will be on special order. As soon as you decide on your fabric, make sure to ask if you need to special order it or if it will be available the day of. Consider buying an inexpensive fabric that you can practice on before you cut into your wedding dress fabric. [6] X Expert Source Kpoene Kofi-Bruce Couture Bridal Designer Expert Interview. 28 January 2021."
    },
    {
      "title": "Cut your fabric.",
      "content": "Cut your fabric. Lay the pieces of your pattern onto your fabric and pin it down with straight pins. Follow along the side of the pattern to cut out your fabric pieces into the right size and shape for your dress. Do this with the inside of your fabric facing up. If you plan on adding pleats to your dress, make sure to cut extra fabric."
    },
    {
      "title": "Pin the fabric together.",
      "content": "Pin the fabric together. Once all of your fabric pieces have been cut, pin them together (inside out). Keep your pins along the 1.5” of seam allowance from your pattern. Use a sewing model form to help you visualize the fit of the dress as you put it together. Opt for an adjustable dress form so you can set it to your basic measurements. [7] X Expert Source Kpoene Kofi-Bruce Couture Bridal Designer Expert Interview. 28 January 2021."
    },
    {
      "title": "Add texture to your dress.",
      "content": "Add texture to your dress. Fabric is flat. Once your fabric is pinned together, fold, bend, and gather it to accommodate for the curves of your body. If you plan on pleating the skirt, pin it to hold the pleats and sew over the pins. You can pull the pins out later."
    },
    {
      "title": "Follow the pattern.",
      "content": "Follow the pattern. Sew the seams by following the shape that you cut out according to your pattern. Use vertical princess seams. These seams go from the top to the bottom. It is impossible to make a one piece dress without vertical princess seams. The fabric cut should reflect that, if not, you may want to pick another pattern to follow."
    },
    {
      "title": "Sew all the way to the hem.",
      "content": "Sew all the way to the hem. Even if you have extra fabric on the bottom or sides of your dress, follow the pattern strictly. It was designed in your size and your dress can be taken in much more easily than taken out once it’s been sewn."
    },
    {
      "title": "Try the dress on.",
      "content": "Try the dress on. Once again, you’ll want help. Once you’ve sewed all of your seams, gathers, and darts, try your dress on. Make any adjustments you need to in order to get the proper fit. Have your friend pin these adjustments for you."
    },
    {
      "title": "Sew your adjustments.",
      "content": "Sew your adjustments. Take the dress off and sew over the pins to make the necessary adjustments to your dress. Now is also the time to add embellishments. If you have a jeweled belt, lace applique, or any other embellishments, add them to your dress as the finishing touch. [8] X Research source"
    },
    {
      "title": "Finish it off.",
      "content": "Finish it off. Cut any loose strings, make one more round of adjustments, or sew something blue into the inside of your dress if you need to. After this, it’s ready for your big day. Follow care instructions provided with the fabric."
    }
  ]
}