{
  "url": "https://www.wikihow.com/Recognize-Chlamydia-Symptoms-(for-Women)",
  "title": "Chlamydia Symptoms, Diagnosis & Treatment for Women",
  "steps": [
    {
      "title": "Vaginal discharge",
      "content": "Vaginal discharge Occasional vaginal discharge is perfectly normal, as long as its clear, opaque, or off-white and not giving off a weird smell. [2] X Research source If your vaginal discharge smells distinctly bad and has an obvious yellow, gray, or white tint, it could be a sign of chlamydia. [3] X Research source Bloody discharge/spotting when it’s not your period could also be a sign of chlamydia. [4] X Research source You may notice this bleeding specifically happening after sex. [5] X Research source"
    },
    {
      "title": "Pain during urination and/or sex",
      "content": "Pain during urination and/or sex Women fighting a chlamydia infection sometimes experience a burning feeling while they pee. They may also feel a lot of pain and discomfort while they’re being sexually intimate with their partners. [6] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If you feel pain or discomfort during sex, put things on pause until you can get tested and checked out by a doctor."
    },
    {
      "title": "Rectal pain, bleeding, or discharge",
      "content": "Rectal pain, bleeding, or discharge Uncomfortable bowel movements, mucus-rich stool, redness, and discharge are all signs of a rectum-based chlamydia infection. [7] X Research source The discharge itself may resemble mucus. [8] X Research source"
    },
    {
      "title": "Lower back and lower abdominal pain",
      "content": "Lower back and lower abdominal pain If the chlamydia infection reaches the fallopian tubes (the tubes that connect the uterus and ovaries), you might experience pain in your lower back and lower abdomen. A fever or nausea can also accompany these symptoms. [9] X Research source Keep in mind that back pain, abdominal pain, nausea, and fever are associated with a lot of different illness, so they aren’t undeniable proof of chlamydia. For instance, colds, the flu, mononucleosis, bronchitis, and UTIs are just a few common fever causes. [10] X Research source Headaches, dizziness, allergies, anxiety, and many, many other issues can cause nausea. [11] X Research source"
    },
    {
      "title": "Sore throat",
      "content": "Sore throat Chlamydia infections can flare up in the throat if you’ve recently had oral sex. However, most people don’t detect any symptoms with throat-based chlamydia infections. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Even if you do have a sore throat, it doesn’t necessarily mean you have chlamydia—the cold, the flu, allergies, and many other factors can cause it. [13] X Research source"
    },
    {
      "title": "Pink eye",
      "content": "Pink eye If infected semen or vaginal fluid gets in your eye, it can lead to conjunctivitis (pink eye). [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Redness, itchiness, and crusty discharge are all routine symptoms of pink eye, but it’s best to get an official diagnosis from your doctor before you start treatment. [15] X Research source In addition to bacteria (like chlamydia), viruses can also lead to pink eye."
    },
    {
      "title": "You might be at risk for chlamydia if you’ve had unprotected sex.",
      "content": "You might be at risk for chlamydia if you’ve had unprotected sex. Chlamydia only spreads through semen and vaginal fluids. So, if you’ve recently had any type of unprotected sex (regular intercourse, anal sex, oral sex, etc.), you could be at risk for infection. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Sex toys can spread chlamydia if an infected individual uses them. Chlamydia is only spread through sex. You can’t get infected via kisses, sneezes, coughs, or sweat. You also won’t catch chlamydia by using a public restroom or by sharing a beverage or meal with someone who has chlamydia."
    },
    {
      "title": "Get tested for chlamydia",
      "content": "Get tested for chlamydia to get an official diagnosis. Many people don’t notice any physical symptoms after getting infected with chlamydia. [17] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Because of this, it’s important to get tested if you (or your partner) recently had sex without protection, if your condom broke during sex, or if you just want to be on the safe side. [18] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source To get started, stop by your doctor’s office or a local health clinic—the testing process typically involves a urine sample and/or a swab of your genitals. [19] X Research source Give the doctor a brief run-down about your sex life so they know where to test. If you engage in anal and oral sex as well as intercourse, they might want to swab your throat and rectum as well as your genitals. Always get tested for STIs (including chlamydia) before you start getting intimate with a new partner. [20] X Research source"
    },
    {
      "title": "Take antibiotics to treat the chlamydia.",
      "content": "Take antibiotics to treat the chlamydia . Chlamydia is a bacterial infection, which means it can be easily cleared away with a round of antibiotics. [21] X Research source After testing, a doctor will give you a prescription for antibiotics—this might be azithromycin, which is taken just once, or doxycycline, which is taken for a full week. Follow the dosage instructions carefully to make sure the infection completely goes away. [22] X Research source Once you’ve completed your antibiotic treatment, wait at least 1 week before getting sexually intimate again. [23] X Research source"
    },
    {
      "title": "Prevent future chlamydia infections by practicing safe sex.",
      "content": "Prevent future chlamydia infections by practicing safe sex . Abstinence is the best, most foolproof way to avoid getting chlamydia in the future, but it’s not your only option. Make sure that your or your partner uses a condom whenever you have sex—this greatly lowers your risk of catching or spreading STIs like chlamydia. [24] X Research source Stay safe during oral sex by using a dental dam ."
    }
  ]
}