{
  "url": "https://www.wikihow.com/Save-MP4-Files-on-an-iPhone",
  "title": "An Easy Guide on How to Download and Save MP4 Files on an iPhone",
  "steps": [
    {
      "title": "Depending on where you downloaded the file, you'll find it in different areas, like your Downloads folder or in a browser download folder.",
      "content": "Depending on where you downloaded the file, you'll find it in different areas, like your Downloads folder or in a browser download folder. [1] X Research source Services like Google Drive and Dropbox often let you pick where to save the downloaded file."
    },
    {
      "title": "The easiest and most direct way to find your downloaded file is to use Spotlight.",
      "content": "The easiest and most direct way to find your downloaded file is to use Spotlight. To find your downloaded file using Spotlight, swipe down from the center of your screen and type the name of the file that you downloaded. [2] X Research source Tap it to open it."
    },
    {
      "title": "Open the file in iMovie.",
      "content": "Open the file in iMovie. Once you use Spotlight to open the file, it will automatically open in iMovie. The point of this section is to save the file in iMovie so it will show up in your Photos app."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . You'll see this in the upper right side of your screen. If you want to make any edits , make them before tapping Done ."
    },
    {
      "title": "Tap .",
      "content": "Tap . The Share icon looks like a rectangle with an arrow pointing up and out of it. You'll see it centered at the bottom of your screen."
    },
    {
      "title": "Tap Save Video.",
      "content": "Tap Save Video . This is next to a Download icon, which looks like a rectangle with an arrow pointing down and inside of it. Doing this will save the video to your Photos app."
    },
    {
      "title": "Open Finder on your computer.",
      "content": "Open Finder on your computer. This two-faced icon is usually on your Dock. You're using your Mac to do all these steps, but with iCloud Photos or My Photo Stream , you should see the MP4 in the Photos app on your iPhone without having to physically connect the two or confirm a download."
    },
    {
      "title": "Navigate to your MP4 file.",
      "content": "Navigate to your MP4 file. Once you have Finder open, you'll be able to find your file ."
    },
    {
      "title": "Drag and drop the MP4 from Finder to your Photos app on your Mac.",
      "content": "Drag and drop the MP4 from Finder to your Photos app on your Mac. If your Mac is signed into the same Apple ID as your iPhone, you should be able to see the file from the Photos app on your phone. On your iPhone, you may need to tap My Photo Stream in your Photos app to find the MP4. If you're using iCloud instead of My Photo Stream, make sure it's enabled (in Settings > Apple ID > iCloud > Photos > iCloud Photo Library ) . You should find the MP4 file in your Photos app as soon as your phone is able to sync online over a Wi-Fi or data connection."
    },
    {
      "title": "Open the iCloud Photos folder in File Explorer.",
      "content": "Open the iCloud Photos folder in File Explorer. If you don't see that folder, you need to download iCloud for Windows ."
    },
    {
      "title": "Drag and drop the MP4 file to the iCloud Photos folder.",
      "content": "Drag and drop the MP4 file to the iCloud Photos folder. Log in with your Apple ID on your computer if prompted. After you log in with the same Apple ID on your computer and iPhone, you'll see the MP4 in your Photos app."
    }
  ]
}