{
  "url": "https://www.wikihow.com/Put-Symbols-on-Facebook",
  "title": "How to Put Symbols on Facebook",
  "steps": [
    {
      "title": "Look for a symbol you want to place into your status or chat message.",
      "content": "Look for a symbol you want to place into your status or chat message. A good place to look is through the web. There are a number of sites that have lists of symbols you can copy and then paste into your Facebook message. Let us use this site as an example: http://fsymbols.com/all/ ."
    },
    {
      "title": "Copy your chosen symbol.",
      "content": "Copy your chosen symbol. Scroll through the available symbols and see which one you like. Highlight it with your mouse, right-click it, then click “Copy.”"
    },
    {
      "title": "Head to your Facebook profile.",
      "content": "Head to your Facebook profile. Right-click either on a chat field or on the Status Update field, which is located at the top of your News Feed upon entering facebook."
    },
    {
      "title": "Paste the symbol.",
      "content": "Paste the symbol. Right-click on the chat or Status Update field and select “Paste” from the context menu. You should see the symbol on the text field. Now, all you have to do is write a status or chat message and hit “Post” or “Send.”"
    },
    {
      "title": "Find a website with a list of emoji or emoticon codes.",
      "content": "Find a website with a list of emoji or emoticon codes. Let us use this website for example: http://www.symbols-n-emoticons.com/p/facebook-emoticons-list.html . Here you will find a list of emoticons and emojis that you can use."
    },
    {
      "title": "Find one you like.",
      "content": "Find one you like. Note the code under the emoticon. Standard Facebook emoticons will have symbols you can type on your keyboard. Non-standard emojis usually have a box below, which when you copy, a unique code will be copied onto your clipboard. This is the code unique to the emoji, and though it looks the same for all emojis on the surface, the selected emoji will still pop out in the chat you send."
    },
    {
      "title": "Copy the symbols under the selected emoticon or emoji.",
      "content": "Copy the symbols under the selected emoticon or emoji. Do this by highlighting it with your mouse, right-clicking, and selecting “Copy.”"
    },
    {
      "title": "Paste the emoticon or emoji on to a text field on Facebook.",
      "content": "Paste the emoticon or emoji on to a text field on Facebook. When you hit “Send” or “Post,” the selected emoji or emoticon will appear."
    },
    {
      "title": "Open a chat window.",
      "content": "Open a chat window. Do this by heading to the lower right of your Facebook page. If it says “Chat disconnected,” click on it to enable chat. Here you will see a list of your friends you can chat with."
    },
    {
      "title": "Click on a friend's name to open a chat window for him/her.",
      "content": "Click on a friend's name to open a chat window for him/her."
    },
    {
      "title": "Click the smiley icon at the lower right of the chat window.",
      "content": "Click the smiley icon at the lower right of the chat window. Here you will find smiley options, along with stickers."
    },
    {
      "title": "Choose the default installed sticker set called Pusheen, which is the cute fat cat.",
      "content": "Choose the default installed sticker set called Pusheen, which is the cute fat cat. You can also download new sticker sets by clicking the shopping basket icon at the upper right."
    },
    {
      "title": "Select a sticker you'd like to send.",
      "content": "Select a sticker you'd like to send. It will automatically send to the friend you are chatting with and animate itself automatically, as well."
    }
  ]
}