{
  "url": "https://www.wikihow.com/Prevent-Rusting-of-Iron",
  "title": "How to Prevent Rusting of Iron",
  "steps": [
    {
      "title": "Wash dirt or mud off of items made of iron as soon as possible.",
      "content": "Wash dirt or mud off of items made of iron as soon as possible. The longer that dirt, mud, and other contaminants sit on iron items, the more likely that item is to rust. So, if you drive your car on muddy roads or drop silverware in the dirt on a camping trip, wash the items as soon as you can. [1] X Research source If mud has dried on the item, use dish soap and a kitchen scouring pad to get it off, then rinse it thoroughly."
    },
    {
      "title": "Wipe off wet iron immediately.",
      "content": "Wipe off wet iron immediately. When exposed to water and oxygen, iron will rust and degrade. [2] X Expert Source James Sears House Cleaning Professional Expert Interview. 28 August 2019. For that reason, keep some towels or microfiber cloths on hand so you can dry any iron item as soon as it gets wet. Wiping off the water prevents rust and will keep your iron in good condition. For example, if you ride your bicycle in the rain, dry off the frame once you return home. Be sure to dry off any tools (e.g., a saw, hammer, or screwdriver) and metal furniture that get wet to prevent them from rusting."
    },
    {
      "title": "Install a dehumidifier in humid rooms where metal items are stored.",
      "content": "Install a dehumidifier in humid rooms where metal items are stored. If you have a humid basement or garage, the moisture in the air could be enough to cause iron items in the room to rust. To prevent this, set up a dehumidifier in the room to pull moisture from the air. This will dry out the air and prevent rust on items like bikes, tools, cars, and metal furniture. [3] X Research source Purchase a dehumidifier at a local hardware store or home-improvement store. Remember to drain the dehumidifier when it fills up with water!"
    },
    {
      "title": "Remove rust",
      "content": "Remove rust quickly to prevent it from spreading. If an item made of iron or steel has already begun to rust, it’s important to remove the rust right away to avoid further damage and corrosion. You can soak the rusted iron in an acidic solution, like vinegar or cola, grind away the rust using power tools, or sand or scour it off by hand. [4] X Research source If the rust patch is small and the metal hasn’t begun to flake, scour it off using fine steel wool rated 000 or 0000."
    },
    {
      "title": "Paint metal",
      "content": "Paint metal items to keep rust from forming. Before you paint, thoroughly clean the item and remove any existing rust. Then, apply zinc chromate or red oxide primer. Once the primer is dry, apply oil-based paint designed for use on metal. The paint creates a barrier between the water and oxygen and the metal itself, preventing rust. [5] X Research source"
    },
    {
      "title": "Use a commercial rust-preventing spray for an easy solution.",
      "content": "Use a commercial rust-preventing spray for an easy solution. If you’d rather not cover up the color of the metal—or if you’re in a rush and want a quicker anti-rust coating—your best bet is to apply an aerosol spray. To use the spray, shake the can vigorously for 10–20 seconds. Remove the cap, point the spray nozzle towards the iron object, and depress the spray button. Apply a generous, even coating to the surface of the metal. [6] X Research source Purchase a rust-preventing spray from any hardware store or home-improvement store. Make sure to use the spray outdoors or in a well-ventilated space. Aerosol sprays also work well for large vehicles or other sizeable iron objects that it would be tedious to paint by hand."
    },
    {
      "title": "Coat iron with grease or oil to form a barrier against rust.",
      "content": "Coat iron with grease or oil to form a barrier against rust. For kitchen items like cast-iron skillets, a simple oil coating can keep rust at bay. Dip a clean cloth or paper towel in cooking oil and thoroughly coat the inside and outside of the item in a thin layer of oil. Avoid coating the handle as this could make it slippery and cause you to drop the skillet. [7] X Research source Alternatively, use grease to coat iron items on vehicles and bicycles, like bearings, nuts, bolts, and chains, to prevent rust. Be sure to reapply the oil or grease once it wears off."
    },
    {
      "title": "Apply an anti-rust resin for a long-lasting finish.",
      "content": "Apply an anti-rust resin for a long-lasting finish. Resin is a popular type of anti-corrosive coating that works well to prevent iron or steel items from rusting. Apply resin as you would paint: pour some out into a flat pan and dip in the top 1 inch (2.5 cm) of a paintbrush. Spread a thin, even layer of resin across the metal. Resin takes quite a while to dry, so don’t move or use the iron object for 72 hours after you’ve applied the resin. [8] X Research source While resin will protect iron from rust for longer than paint will, it’s also much more expensive. Look for anti-rust resin at larger hardware stores or auto body shops (since it’s often used on vehicles)."
    },
    {
      "title": "Take iron items to a metal professional to get them powder coated.",
      "content": "Take iron items to a metal professional to get them powder coated. Much like a liquid coating, powder coatings are mechanically applied to iron to block rust from reaching the surface. Most people don’t have the industrial-grade equipment needed to powder coat iron at home. Take the iron or steel item that you’d like to have powder-coated to an auto body or metalworking shop for best results. [9] X Research source Powder coatings come in a variety of types, including epoxy, acrylic, nylon, and vinyl. Ask the metal professional applying the powder which option would work best for you. Powder coating is the best option for items that will be exposed to high heat, like car parts and bbq grills or smokers."
    },
    {
      "title": "Galvanize iron to keep it from oxidizing.",
      "content": "Galvanize iron to keep it from oxidizing. Visit a metalworking shop to get your iron galvanized by professionals for best results. They’ll clean the item and then either dip it in molten zinc or an electrolyte solution of cyanide or zinc sulfate. [10] X Trustworthy Source U.S. General Services Administration Independent U.S. government agency designed to support the basic functioning of the U.S. federal government. Go to source Avoid trying to galvanize items at home. Leave this project to a professional with the right equipment and knowledge so your item is thoroughly protected and ends up with a clean finish."
    }
  ]
}