{
  "url": "https://www.wikihow.com/Oil-Your-Hair",
  "title": "How to Use Oil in Your Hair",
  "steps": [
    {
      "title": "Decide how many oils to use.",
      "content": "Decide how many oils to use. You can use just one oil on your hair, or two to three oils. It all depends on how much money you want to spend and how intensive you want your oil treatment to be. The two basic types of oils are carrier oils and essential oils. Carrier oils are used as a base into which the more concentrated essential oils are mixed. Many people choose to use carrier oil alone on their hair. You don’t need to use essential oil if you don’t want to. Essential oils are more highly concentrated. After diluting them with a carrier oil, you apply them to the scalp and roots only."
    },
    {
      "title": "Choose a carrier/base oil.",
      "content": "Choose a carrier/base oil. Whether or not you decide to dilute an essential oil into a base oil, you will need a base oil. There are a wide variety of options to choose from, each offering different benefits and drawbacks. Almond oil: Almond oil is rich in vitamin E and healthy fats that does wonders to the hair. It's particularly effective at treating dry flaky scalp and dandruff. Argan oil [2] X Research source : Argan oil is a Moroccan product rich in antioxidants. Although users swear it produces dramatic improvements to both hair and skin, it can be pricey. Any inexpensive Argan oil you find on the market is likely inauthentic and not worth the money. Avocado oil [3] X Research source : Avocado hair is a favorite among African Americans who wear their hair naturally. It’s loved for its super-moisturizing power, and it’s inexpensive to boot! Castor oil: Castor oil is thought to stimulate hair growth and decrease hair loss, treat dry scalps, prevent split ends, and increase shine. However, it’s a thick, gloopy oil that many don’t like the feeling of. If you use it, you should dilute it with a thinner oil, like grapeseed oil. Coconut oil [4] X Research source : In addition to adding moisture to hair and scalp, coconut oil is also rich in protein. This can help heal damaged hair, which is composed largely of protein itself. One drawback is that coconut oil can turn solid in cooler temperatures. To melt it, you can warm it in your hand before use or place it in the microwave for 2-3 seconds. Extra virgin olive oil [5] X Research source : EVOO is thought to prevent hair loss, treat dry scalp, and improve moisture and shine. It also has antibacterial and antifungal qualities that protect the scalp from problems like dandruff. However, it may be too heavy for thin hair. Grapeseed oil: Grapeseed oil is a lighter oil that might most useful for people who don’t need a big boost of moisture. If you have otherwise healthy hair, use it as a balancing moisturizer."
    },
    {
      "title": "Choose an essential oil.",
      "content": "Choose an essential oil. You might think of essential oils as scented oils, but they do much more than that! Each different oil brings their own benefits and can help improve the health of your hair. With the right essential oil for you, you can have luscious, sweet smelling locks. Rosemary essential oil: Rosemary oil has a wide variety of uses, but it’s known to stimulate blood flow. Applying it to the scalp improves follicle and root health. Rosemary is also a known source of compounds that are frequently found in Minoxidil, it can be useful in treating and preventing hair loss. A tingling sensation is normal when applied to the scalp. Rosemary oil is also one of the few natural oil that actually provide a real moisturizing effect on your hair. [6] X Expert Source Courtney Foster Professional Hair Stylist Expert Interview. 9 December 2019. Grapefruit essential oil: This fragrant essential oil is used to stimulate hair growth and balance out oily hair. Rose essential oil: Rose essential is used to strengthen hair roots and prevent hair loss. Plus, it smells wonderful! [7] X Expert Source Courtney Foster Professional Hair Stylist Expert Interview. 9 December 2019. Carrot seed oil. Carrot seed oil is filled with vitamins and can actually stimulate hair growth by encouraging new cell turnover. Lavender oil. Lavender can sooth your scalp and reduce dryness, itchiness, and dandruff. Additionally, the scent is very calming. Lavender and tea tree blend. A blend of these two oils can help break up left over product that may be weighing down your hair. Additionally, it's a soothing formula that lowers your inflammatory response while still keeping your hair moist. Chamomile oil. Chamomile can soothe and nourish your hair, and it has a calming scent. Eucalyptus oil. Eucalyptus can also encourage hair growth, but it also cleanses your hair. It's best used as an occasional oil rinse, especially if you experience oil scalp or dandruff. In addition to the other benefits, it can add shine. Cedarwood oil. Cedarwood oil is an excellent option for nourishing dry hair, and it can encourage hair growth. [8] X Research source"
    },
    {
      "title": "Prepare your hair.",
      "content": "Prepare your hair. The only general rule to oiling your hair is that you should comb through it to prevent tangling and messy oil application. Beyond that, there's debate over whether hair should be clean when oiled. Some swear that oiling works better when the hair is already a little bit oily and dirty — say two or three days after your last shampooing. Others insist that oiling works best soon after you've shampooed your hair — when it’s clean and bare. Try it both ways to decide what you prefer."
    },
    {
      "title": "Protect the area from oil splatter.",
      "content": "Protect the area from oil splatter. Especially if you’re new to oiling your hair, there’s a good chance you’re going to make a mess. Spread old towels or paper towels around the area where you’re going to work. This includes table surfaces and floors. Have an extra hand rag available for spot-cleaning drippy messes. If you’re going to sleep with oil in your hair, protect your pillows with plastic pillowcase coverings."
    },
    {
      "title": "Treat the roots and scalp.",
      "content": "Treat the roots and scalp. Pour one teaspoon of oil into the palm of your hand. Rub your hands together to spread the oil. You’ll be applying the oil mainly with your fingertips, so focus on spreading it there. Using your fingertips, work the oils into your scalp. Use a massaging motion to both work the oil in and stimulate the scalp. (Plus, it feels great!) Make sure you cover the entire scalp area, including the back of your head, just above the neck, and behind your ears."
    },
    {
      "title": "Section your hair into 2 parts.",
      "content": "Section your hair into 2 parts. Split it right down the middle of your scalp, and pull 1 section over your left shoulder and the other over your right shoulder. This will make it easier to apply the base oil to the shafts of your hair. You might tie 1 section into a piggy tail to keep it out of the way while you’re working on the other section. If your hair is thick or curly, it may be easier to divide your hair into 4 quadrants to make it easier to evenly distribute the product. Divide it once down the middle and once from ear-to-ear."
    },
    {
      "title": "Treat the length of your hair.",
      "content": "Treat the length of your hair. If you have long hair, you might be tempted to pour a large amount of oil into your hands. This will always result in a dripping mess, though. No matter how much hair you’re working with, pour one teaspoon of oil into your palm at a time, adding more oil when you need it. Run your hands through the length of your hair, starting at your scalp and ending at the ends. If your ends feel dry, add more oil until they look shiny. Don’t neglect the hair on the back of your head."
    },
    {
      "title": "Prepare your hair and work area.",
      "content": "Prepare your hair and work area. Just as you would for a straightforward base oil application, comb through dry hair to work out any tangles. You hair can be just-washed or on its second or third day out from your last shampooing. Spread old towels or paper towels around to protect against oil splatter."
    },
    {
      "title": "Mix your carrier and essential oil.",
      "content": "Mix your carrier and essential oil. Essential oils are too strong to apply in large amounts directly to the scalp. Even with this diluted delivery system, you may feel a strange tingling sensation in your scalp. Don’t worry — it’s perfectly normal. It just means the essential oil is doing its work! Pour a teaspoon of your chosen carrier oil into the palm of your hand. Add 2-3 drops of your chosen essential oil. Rub your hands together to mix the oils and spread them over your palms and fingertips. If you want to make a larger batch, mix 1 tablespoon (15 mL) of essential oil into .25 cups (59 mL) of carrier oil."
    },
    {
      "title": "Rub the mixture into your roots and scalp.",
      "content": "Rub the mixture into your roots and scalp. The essential oils won’t be useful on the shaft and ends of your hair. You should target your scalp, follicles, and hair roots with them. Using your fingertips, massage the oils into your scalp. Remember to treat the entire scalp, not just the top of your head."
    },
    {
      "title": "Comb through your hair again and section it into two parts.",
      "content": "Comb through your hair again and section it into two parts. Using a wide-tooth comb, comb through your hair to both detangle it. This will also spread the oil through any hairs that didn’t get treated by your fingers. Split your hand down the middle so you can work with your hair in two sections, rather than tackling it all at once."
    },
    {
      "title": "Apply the base/carrier oil to the length of your hair.",
      "content": "Apply the base/carrier oil to the length of your hair. Pour a teaspoon of your base/carrier oil into the palm of your hand. Rub your hands together again to spread it out over your palms and fingertips. If you are using castor oil, mix ½ teaspoon of castor oil with ½ teaspoon of a thinner, lighter oil (like grapeseed oil). Castor oil is thick and gloopy on its own. Run your fingers and palms through your hair to transfer the oil. Begin where the essential and carrier oil treatment ends, closer to your scalp. Run your hands down to the ends of your hair. Work your way all the way through one section of hair, remembering to pay attention to the hair on the back of your head. Give the second section of hair the same treatment."
    },
    {
      "title": "Oil your hair lightly for daily treatment.",
      "content": "Oil your hair lightly for daily treatment. If you have particularly dry hair, you may need daily oiling. For example, many African Americans with natural hair find daily oiling beneficial. It increases the hair's moisture and shine. Don’t apply oil to the scalp every day. The scalp produces its own oils, so the hair closest to it is usually fairly healthy. Applying extra oil on a daily basis might hurt more than it helps by causing oily hair at the roots. Apply a thin layer of oil to the shafts of your hair, focusing on the tips. The oil from your scalp works its way from the root down to the tip of your hair. It's a longer trip for people with long hair, though, so the ends are often dry and brittle. Curly hair also tends to dry out at the bottom because the curls and kinks stop oil from working down the strands. Don’t over-oil your hair if you’re applying it on a daily basis. You hair should not be completely saturated, as this may look flat or greasy. [9] X Expert Source Courtney Foster Professional Hair Stylist Expert Interview. 9 December 2019."
    },
    {
      "title": "Spray oil onto your hair as a daily leave-in treatment.",
      "content": "Spray oil onto your hair as a daily leave-in treatment. Buy a small spray bottle that will allow you to diffuse the oil over a wide area of hair. This will give you a fine mist instead of the thick coat from your fingers. Dilute the oil with water so it won’t clog up the spray nozzle. Spritz the oil and water mixture throughout your hair immediately after your daily shower. Your hair should still be damp. Spray the oil only on your ends, avoiding your roots. Comb through your hair to work out tangles and spread the oil throughout the strands. Let your hair air-dry, and go about your day."
    },
    {
      "title": "Use the oil as a leave-in conditioner.",
      "content": "Use the oil as a leave-in conditioner. Once a week or once every two weeks, you should do a deep-conditioning mask treatment with your oil. Saturate your hair with the oil. For daily oiling, you might just use a light coating of oil, but for a leave-in treatment, you want your hair thick with it. Tie your hair up into a bun. This will protect the shoulders and back of your clothing from the oil. Cover your hair with a shower cap if you’d like. This is especially useful if you don’t have a plastic cover for your pillowcase. If you don’t use a shower cap, cover your pillow with either a vinyl case or with two layers of old towels to protect it from oil stains. Leave the oil in for at least eight hours, or until you take a shower the next day."
    },
    {
      "title": "Oil particularly brittle hair when it’s damp.",
      "content": "Oil particularly brittle hair when it’s damp. Many find that dry, brittle hair benefits most from oiling when the oil is applied to damp hair. Apply a base oil in place of your normal conditioner twice a week, immediately after you’ve rinsed the shampoo from your hair. Shampoo strips the hair of its natural oils, leaving it dry. This is a good time for a moisture boost. Shampoo and apply the oil as soon as you begin your shower. Let the oil soak into your hair for the rest of your shower, as you go on with the rest of your shower routine. Try to leave the oil in from 5-10 minutes. Placing a shower cap over your hair to protect it from the water will help prevent washing it out before you’re ready. Be careful applying oil in the shower. When you rinse it out of your hair, the tub can get very slippery."
    }
  ]
}