{
  "url": "https://www.wikihow.com/Save-GIFs-from-Twitter",
  "title": "How to Save GIFs from Twitter",
  "steps": [
    {
      "title": "Install GIFwrapped on your iPhone or iPad.",
      "content": "Install GIFwrapped on your iPhone or iPad. This is a popular free app that converts your GIFs from Twitter into a downloadable format. Here's how to get the app: Open the App Store . Tap Search at the bottom-right corner. Type gifwrapped into the search bar and tap Search . Tap GET next to \"Gifwrapped.\" The app has a black icon with a white and green gift box inside. Follow the on-screen instructions to download the app."
    },
    {
      "title": "Open the X app.",
      "content": "Open the X app. It's the black icon with the letter X. You'll usually find it on the home screen or in a folder."
    },
    {
      "title": "Scroll to the GIF you want to download.",
      "content": "Scroll to the GIF you want to download. GIFs appear as video thumbnails, but with the word \"GIF\" at the bottom-left corner."
    },
    {
      "title": "Tap the GIF to open it.",
      "content": "Tap the GIF to open it. A row of icons will appear just beneath it."
    },
    {
      "title": "Tap the Sharing icon.",
      "content": "Tap the Sharing icon. It looks like a bracket ( [ ) on its side with an arrow pointing upward, and it's below the GIF's bottom-right corner. A menu will expand."
    },
    {
      "title": "Tap Share Tweet via….",
      "content": "Tap Share Tweet via… . It's at the bottom of the menu. This opens the Sharing menu."
    },
    {
      "title": "Tap Copy Link.",
      "content": "Tap Copy Link . It's the second option in the bottom row of Sharing tools. You'll see a message that says \"Copied.\""
    },
    {
      "title": "Return to the home screen and open GIFwrapped.",
      "content": "Return to the home screen and open GIFwrapped. It's the black icon with a white and green gift box inside. It was added to your home screen after installing, so it's probably at the end of the icon list."
    },
    {
      "title": "Tap Search.",
      "content": "Tap Search . It's the second icon at the bottom of GIFwrapped."
    },
    {
      "title": "Tap Use the Clipboard.",
      "content": "Tap Use the Clipboard . It's near the top of the screen. In a second or two, you'll see a preview of the GIF."
    },
    {
      "title": "Tap the GIF.",
      "content": "Tap the GIF. This displays a larger version."
    },
    {
      "title": "Tap the Sharing icon.",
      "content": "Tap the Sharing icon. It's at the top-right corner of the screen. A menu with sharing options will appear."
    },
    {
      "title": "Tap Save to Library.",
      "content": "Tap Save to Library . It's at the bottom of the menu. This saves the GIF to your camera roll."
    },
    {
      "title": "Install Tweet2gif on your Android phone or tablet.",
      "content": "Install Tweet2gif on your Android phone or tablet. This is a free, highly-rated app that converts your GIFs from Twitter into a downloadable format. Here's how to get it: Open the Play Store . Type tweet2gif into the Search bar. Tap Tweet2gif (the blue icon with white wings) in the search results. Tap INSTALL . An icon for the app will be added to your app drawer."
    },
    {
      "title": "Return to the home screen and open X.",
      "content": "Return to the home screen and open X. It's the black and white X icon typically found in the app drawer."
    },
    {
      "title": "Scroll to the GIF you want to download.",
      "content": "Scroll to the GIF you want to download. GIFs appear as video thumbnails, but with the word \"GIF\" at the bottom-left corner."
    },
    {
      "title": "Tap the GIF.",
      "content": "Tap the GIF. A larger version will appear with several icons beneath it."
    },
    {
      "title": "Tap the Sharing icon.",
      "content": "Tap the Sharing icon. It's below the GIF's bottom-right corner. A list of sharing options will appear."
    },
    {
      "title": "Tap Tweet2gif.",
      "content": "Tap Tweet2gif . It's the blue icon with white wings inside. This opens a Tweet2gif window containing the full URL to the GIF."
    },
    {
      "title": "Tap Download GIF.",
      "content": "Tap Download GIF . It's below the URL's bottom-right corner. This downloads the GIF to your Android's gallery. You may have to tap ALLOW to save the file."
    },
    {
      "title": "Go to https://www.twitter.com in a web browser.",
      "content": "Go to https://www.twitter.com in a web browser. You can use any web browser on your computer, such as Chrome or Safari, to download a GIF."
    },
    {
      "title": "Scroll to the GIF you want to download.",
      "content": "Scroll to the GIF you want to download. GIFs appear as video thumbnails, but with the word \"GIF\" at the bottom-left corner."
    },
    {
      "title": "Click the Play button.",
      "content": "Click the Play button. It's the blue circle with a white sideways triangle inside. The GIF will begin to play."
    },
    {
      "title": "Right-click the GIF.",
      "content": "Right-click the GIF. A menu will appear."
    },
    {
      "title": "Click Copy Video Address.",
      "content": "Click Copy Video Address . A direct link to the video version of the GIF is now copied to your keyboard."
    },
    {
      "title": "Navigate to https://ezgif.com/video-to-gif.",
      "content": "Navigate to https://ezgif.com/video-to-gif . This takes you to the website of EZGif, a popular free video-to-GIF converter."
    },
    {
      "title": "Right-click the blank under \"OR paste video url.\"",
      "content": "Right-click the blank under \"OR paste video url.\" It's in the \"Upload video file\" part of the page. A menu will appear."
    },
    {
      "title": "Click Paste.",
      "content": "Click Paste . The URL for the video now appears in the blank."
    },
    {
      "title": "Click Upload video.",
      "content": "Click Upload video . It's the blue button below the URL. This uploads the video to EZGif's server."
    },
    {
      "title": "Edit the video (optional).",
      "content": "Edit the video (optional). If you want the video to convert to a GIF exactly as it is, skip this step. Otherwise, you can adjust the size, start time, stop time, and encoding method if desired. Click the Play button at the center of the video to test your changes."
    },
    {
      "title": "Click Convert to GIF.",
      "content": "Click Convert to GIF . Once the GIF is ready, it will appear near the bottom of the page under \"Output GIF.\""
    },
    {
      "title": "Edit the GIF.",
      "content": "Edit the GIF. Now that the file is a GIF, you have some different tools to work with. Here are some common edits: Click Crop to crop out parts of the image, and/or Resize to adjust the dimensions. If you'd like to add text, click Write . To make the animation speed faster or slower, click Speed ."
    },
    {
      "title": "Click Save to download the GIF.",
      "content": "Click Save to download the GIF. It's the disk icon at the end of the icon row below the GIF. This saves the GIF to your computer, though you may have to click Save to begin the download."
    }
  ]
}