{
  "url": "https://www.wikihow.com/Samsung-Dishwasher-Lc-Code",
  "title": "How to Fix the LC Error Code on Your Samsung Dishwasher",
  "steps": [
    {
      "title": "The LC code means your dishwasher senses moisture or a leak.",
      "content": "The LC code means your dishwasher senses moisture or a leak. Your dishwasher has a moisture sensor under the tub to check for water leaks. When the sensor detects moisture, it will show the LC or LE code on the display. Even if there is no leak, your dishwasher will turn on so it can try draining the residual water. Your dishwasher will stay on and continue trying to drain until it doesn’t sense any more moisture. If you have a Waterwall Samsung dishwasher, then the LC or LE code means that the water reflector that moves back and forth at the bottom of the tub is blocked."
    },
    {
      "title": "Tighten or replace loose connections in the supply hoses.",
      "content": "Tighten or replace loose connections in the supply hoses . Your dishwasher has multiple hose connections that could all leak if they’re loose or damaged. Open the cabinets next to your dishwasher and check the hose running from your dishwasher to your water supply. [1] X Research source If the hose connection feels loose, tighten a hose clamp around the connection to seal it. If you notice any damage at the end or along the length of the hose, then completely replace it. Turn off your water supply , disconnect the hose, and replace it with a new one. Some hoses connect to the back of your dishwasher, and they’re a little trickier to access. Unscrew the screws along the side, and have a friend help you slide the dishwasher out."
    },
    {
      "title": "Wipe or replace the door gasket if it’s dirty.",
      "content": "Wipe or replace the door gasket if it’s dirty. The door gasket is the rubber seal around the edge of the dishwasher door, and damage or debris can cause water to leak out. Open your dishwasher and inspect the gasket. Wipe away any debris or residue with a damp cloth. If it looks cracked, torn, or damaged, then replace the gasket . [2] X Research source Appliance repair expert Gevorg Grigorian says dishwashers “tend to leak from the left or right side of the door, or even simultaneously on both sides. That's usually a worn out gasket around the door.”"
    },
    {
      "title": "Clean out the dishwasher filter if it’s clogged.",
      "content": "Clean out the dishwasher filter if it’s clogged. Grigorian says that dishwasher filters can fill up with food residue or broken dishes, which could prevent water from draining and cause a leak error. To clean the filter , he says to remove the lower rack, twist the filter to pull it out, and then rinse it out in your sink. Dishwasher filters are usually at the bottom of the tub near the front of the appliance."
    },
    {
      "title": "Loosen screws on the side of the tub if the walls are bowed.",
      "content": "Loosen screws on the side of the tub if the walls are bowed. Open your dishwasher and check if the sides of the tub are perfectly vertical. If you notice the walls bowing in, slightly loosen the screws securing the dishwasher to your cabinets until the walls aren’t distorted. [3] X Research source Grigorian says over time, hot water can warp plastic tubs which could lead to leaks."
    },
    {
      "title": "Level the dishwasher legs if they’re uneven.",
      "content": "Level the dishwasher legs if they’re uneven. Remove the toe kick panel at the bottom of your dishwasher to access the adjustment legs. Twist the screws or nuts on the legs to level out your dishwasher so it doesn’t wobble or tilt. Use a bubble level inside the tub to check that the sides of the dishwasher are level. [4] X Research source If the back legs of the dishwasher are wobbly, then turn off the power and water supply to your dishwasher, and carefully slide the appliance out to access them. Use your level to check that the front of the dishwasher is level with the back. If the front is lower, then it could cause leaks from the bottom of the door and trigger the LC code again."
    },
    {
      "title": "Clear the water nozzles on the spray arm.",
      "content": "Clear the water nozzles on the spray arm. The spray arms rotate and spray water, but debris caught inside them can cause water to spray where it’s not supposed to. Open your dishwasher and unscrew the nuts holding the spray arms in place. Rinse the spray arms out with clean water, and use a toothpick to pry debris out from the nozzle holes. [5] X Research source"
    },
    {
      "title": "Reset your dishwasher.",
      "content": "Reset your dishwasher. If you can’t find a leak, then the sensor may be malfunctioning. Each dishwasher model is different, so appliance repair specialist Homer Flores says to “locate the technical spec sheet located behind the toe kick plate” for specific manufacturer instructions. Once you reset your dishwasher, the error code will disappear. Typically, all you have to do to reset your dishwasher is unplug it or turn it off at the breaker, wait about 5 minutes, and then plug it back in. Some models may have you press buttons on the appliance."
    },
    {
      "title": "Wait for your dishwasher to air-dry.",
      "content": "Wait for your dishwasher to air-dry. If there isn’t a visible leak on your dishwasher, there’s a chance residual water is near the moisture sensor. Give your dishwasher some time to dry out completely and the code will go away on its own. The dishwasher stays on and continues draining while the error code is active, which can get a little annoying after a while. Either unplug your dishwasher while it dries or get out of the house for a few hours to avoid the noise."
    },
    {
      "title": "Request a service repair.",
      "content": "Request a service repair. If you’re unable to make the code go away and can’t figure out the cause, then use the Samsung Repair Services site to find a local support center. Explain your problem and what you’ve tried, and an experienced technician will come repair the problems for you. Repair costs can vary depending on what parts need fixing and if your dishwasher is still covered under warranty."
    },
    {
      "title": "Your dishwasher is leaking.",
      "content": "Your dishwasher is leaking. The primary function of the moisture sensor is detecting leaks underneath your dishwasher. If enough water leaks out to trigger the sensor, then the LC error code displays on your dishwasher screen and the appliance will try draining out the moisture to prevent damage. Dishwasher leaks are usually pretty noticeable from pooling water underneath the appliance, but leaks can also occur under your sink by the supply hose or along the drain hose."
    },
    {
      "title": "The moisture sensor is wet or detects water nearby.",
      "content": "The moisture sensor is wet or detects water nearby. If there isn’t a visible leak, then water may have splashed onto the moisture sensor if you recently moved it. As long as the sensor detects water, the LC or LE error will stay active. Extreme temperatures or humidity can also make the moisture sensor detect water and trigger the error code."
    },
    {
      "title": "There was too much detergent.",
      "content": "There was too much detergent. Using too much detergent in your dishwasher creates a lot of suds that could get near the moisture sensor. Because detergent takes longer to dry and evaporate than water, it can trigger an error and display the LC code. [6] X Research source"
    },
    {
      "title": "The moisture sensor is faulty.",
      "content": "The moisture sensor is faulty. If the moisture sensor is damaged or if there was recently a power outage, it may not work properly and could trigger an LC error when there’s no leak. If resetting your dishwasher doesn’t work, then it needs professional servicing."
    },
    {
      "title": "The water reflector is blocked or improperly installed.",
      "content": "The water reflector is blocked or improperly installed. On some Waterwall models of Samsung dishwashers, the water reflector moves along the bottom of the tub to spray water. If there’s something preventing it from moving or if it’s improperly seated, then the error message will appear."
    },
    {
      "title": "The dishwasher display shows a code whenever it senses an issue.",
      "content": "The dishwasher display shows a code whenever it senses an issue. Normally, the display shows you information about the current cycle or lists the time. If something goes wrong, the code will appear and stay lit on your dishwasher until you resolve the issue. Common codes you may run into include: [7] X Research source 1E or IE: The dishwasher filter is clogged 3C: The dishwasher pump failed 3E: The water temperature is too hot 4C or 4E: The water supply pressure or temperature is too low 5C, 5E. SC, or SE: The dishwasher has issues draining water 7E: The reflector in Samsung Waterwall dishwashers is blocked 9E: The water level in your dishwasher is too low AP: The dishwasher is in Access Point mode to connect to a mobile device bE or 6E: A button is stuck CE: The control panel has a communication error HC: The temperature is too high in your dishwasher HE: The dishwasher is detecting temperature incorrectly OC, 0C, or oE: The dishwasher has too much water PC: The Zone Wash feature has a malfunction PE: The Half load function is not working correctly tE: The dishwasher is taking inaccurate temperature readings"
    }
  ]
}