{
  "url": "https://www.wikihow.com/Reset-Camshaft-Position-Sensor",
  "title": "Resetting a Camshaft Position Sensor: Everything You Need to Know",
  "steps": [
    {
      "title": "No—a faulty sensor needs to be replaced.",
      "content": "No—a faulty sensor needs to be replaced. When you hear or read about resetting (or “relearning”) a camshaft position sensor, that refers to recalibrating a new sensor after it has been installed. An installed sensor that isn’t working properly cannot be fixed by resetting it—it has to be replaced in nearly every case. There may be some cases in which a faulty sensor can be repaired instead of replaced, and then reset/relearned in the same way as you would a new sensor. But it’s almost always easier to simply replace the sensor with a new one. It’s true that there are ways to at least temporarily turn off the dashboard warning light that indicates a camshaft position sensor issue. But turning off the light does not solve the problem —and the sensor is too important to the functioning of your vehicle to ignore."
    },
    {
      "title": "Use your owner’s manual to find the sensor.",
      "content": "Use your owner’s manual to find the sensor. The location of the camshaft position sensor, which is a small tube- or disc-shaped part with bolt and wire connections, varies by vehicle type. So your best option is always to consult your owner’s manual (or look up the manual online). You’ll usually find the sensor in one of the following areas under the hood: [2] X Research source To the left of the engine, near where you add oil. Attached to the left side of the engine. Mounted to the rear of the cylinder head. Mounted to the front of the cylinder head, below the cover for the timing belt."
    },
    {
      "title": "Loosen the bolts on the sensor with a 10 mm socket wrench.",
      "content": "Loosen the bolts on the sensor with a 10 mm socket wrench. The disc-shaped sensor is secured in place with two bolts—grab a socket wrench to loosen these bolts and pull free the sensor. (It will still be connected to the engine by wires.) Use a 10 mm wrench (or either a 3/8” or 13/32” wrench) to get the best fit in most instances. [3] X Research source If there are any tubes or other obstructions in your way, carefully remove these temporarily, taking note of how they need to go back in place—take pictures if needed."
    },
    {
      "title": "Unclip the wire connector and remove it from the sensor.",
      "content": "Unclip the wire connector and remove it from the sensor. First, pop out the red tab on the side of the sensor with a small screwdriver or similar tool. Then, squeeze the base of the wire connector (where you see the wires going in) and pull on it to unclip it from the sensor. Set the wire connector aside in the engine bay. [4] X Research source If you see any damage to the wires or the connector clip, replacing the sensor alone won’t solve your problem. Unless you have fairly advanced auto repair skills, take your vehicle to a professional to handle the issue."
    },
    {
      "title": "Replace the sensor with an exact match.",
      "content": "Replace the sensor with an exact match. The best way to get a matching camshaft position sensor (or any other part) is to take it with you to an auto parts store. However, you should not (and may not be able to) drive your vehicle without an installed sensor. So here are a few options to consider: [5] X Research source Ask a friend to give you a ride to the auto parts store. Drive to the auto parts store and remove the sensor in its parking lot. Remove the sensor, take photos of it, reinstall it, and shop at the auto parts store (or online) for the replacement based on your make, model, and year of vehicle. Use the photos to visually confirm it’s a match."
    },
    {
      "title": "Install the new sensor.",
      "content": "Install the new sensor. It’s essentially just the process you just did to remove the old sensor, but in reverse. First, slide the wiring connector clip into the new sensor until it clicks into place. Then, use a 10 mm socket wrench to secure the sensor in place with the two bolts. Stop tightening when you feel mild resistance, or you may crack the sensor’s plastic disc. [6] X Research source While the new sensor is now installed, and you may get lucky and have it function perfectly right from the start, it’s highly recommended to “relearn” the sensor at this point in order to calibrate the entire system properly."
    },
    {
      "title": "Run a CASE relearn with an advanced OBD-II scanner.",
      "content": "Run a CASE relearn with an advanced OBD-II scanner. When connected to your vehicle, any OBD-II scanner will retrieve error codes that you can use to diagnose problems. Advanced scanners —typically the more expensive models that look like tablet computers—can also complete functions like a CASE (Crank Angle Sensor Error) relearn, which recalibrates the positioning between the camshaft and crankshaft sensors. The process varies by scanner model, but here’s a general rundown: [7] X Research source Attach the OBD-II scanner to your vehicle—the pin connector is usually below and to the driver’s door side of the steering wheel. Following your product instructions and device’s menu, find and select the option to run a CASE relearn. Follow the screen prompts. When the relearn is complete, disconnect the scanner and operate the vehicle as normal. NOTE: If you don’t own an advanced OBD-II scanner, you may be able to borrow or rent one from an auto parts retailer."
    },
    {
      "title": "Drive in a specific procedure to do a no-scanner CASE relearn.",
      "content": "Drive in a specific procedure to do a no-scanner CASE relearn. This technique isn’t guaranteed to work with every make and model of vehicle, but may do the trick if you don’t have access to an advanced OBD-II scanner. (If the “check engine” light goes out afterward, it worked!) Try the following: [8] X Research source Turn off all of the accessories (radio, A/C, etc.). With the air temperature sensor and coolant temperature within 9 degrees Fahrenheit (5 Celsius) of each other, start the engine and let it idle in Park or Neutral for two minutes. Accelerate to 55 mph (90 kmh) at part throttle. Cruise at 55 mph (90 kmh) for 8-10 minutes to let the engine reach its operating temperature. Continue cruising at 55 mph (90 kmh) for another 5-6 minutes. Decelerate to 45 mph (72 kmh) without using the brakes, and maintain that speed for 1 minute. Complete 4 deceleration cycles, without using the brakes, for 25 seconds each—no specific deceleration speed is necessary. Return to 45 mph (72 kmh) for 15 seconds in between deceleration cycles. Accelerate to 55 mph (90 kmh) and cruise for 2 minutes. Stop the vehicle and idle for 2 minutes with the brake applied and the transmission in Drive or Neutral (with the clutch depressed)."
    },
    {
      "title": "“Check engine” light",
      "content": "“Check engine” light If you’re having a camshaft position sensor issue, you can be sure to see this warning light on your dashboard. Since this is a general “check engine” warning, however, you’ll need to use an OBD-II scanner (or get a professional inspection) to get a specific diagnosis. [9] X Research source"
    },
    {
      "title": "Difficulty starting the vehicle",
      "content": "Difficulty starting the vehicle Since the camshaft position sensor controls fuel injection timing, a faulty sensor often makes it a challenge to start up the vehicle. If the sensor continues to deteriorate, the problem will worsen to the point where you may not even be able to start your vehicle."
    },
    {
      "title": "Sputtering while driving",
      "content": "Sputtering while driving Just like when starting up your vehicle, fuel injection timing is crucial to your engine’s smooth operation while driving. As the sensor gets worse, you can expect to experience more sputtering, acceleration delays, and stalls. [10] X Research source"
    },
    {
      "title": "Poor fuel efficiency",
      "content": "Poor fuel efficiency Bad fuel injection timing equals wasted fuel, and wasted fuel results in reduced fuel economy. While many issues can cause a drop in your miles per gallon (or kilometers per liter), a faulty camshaft position sensor is a definite possibility."
    },
    {
      "title": "Transmission problems",
      "content": "Transmission problems The camshaft position sensor sends data to the powertrain control module (PCM), which in turn affects the shifting process in the transmission. Your vehicle may shift inconsistently and eventually lock up and be unable to shift at all. [11] X Research source"
    }
  ]
}