{
  "url": "https://www.wikihow.com/Signal-and-Position-Yourself-As-an-Assistant-Referee-in-Soccer",
  "title": "How to Signal and Position Yourself As an Assistant Referee in Soccer",
  "steps": [
    {
      "title": "Before the game, nearly everything is under the sole jurisdiction of the center referee.",
      "content": "Before the game, nearly everything is under the sole jurisdiction of the center referee. Unless directed by the referee to do otherwise, simply remain silent and accompany the referee during any pre-match procedures."
    },
    {
      "title": "Be sure to have a thorough pre-match conference away from participating teams.",
      "content": "Be sure to have a thorough pre-match conference away from participating teams. The referee team should review basic mechanics and pertinent deviations from the Laws of the Game authorized by the rules of competition that apply to the game being played (e.g., age group modifications or league-specific rules). The center referee should also advise assistant referees as to any preferences he or she has for the amount of assistance ARs should offer or for the methods of communication between the referee team."
    },
    {
      "title": "Stay together.",
      "content": "Stay together. After the coin toss, the members of the referee team should walk together to the center circle, with the assistant referees to the sides of the referee holding their flags furled in the outside hand. If there is a fourth official, he or she should be to the left of the referee. The team should do a quick handshake and wish each other luck at the center mark."
    },
    {
      "title": "Perform the last-minute needs.",
      "content": "Perform the last-minute needs. After making sure the team is on the same page, both assistant referees should sprint to the goals in their respective halves and do a quick last-minute ceremonial check of the nets. Once satisfied, they should then run to their respective touchline and position themselves facing the field, even with the second-to-last defender. After counting the players in their halves, they should make eye contact with the referee and unfurl their flags."
    },
    {
      "title": "Stay in position.",
      "content": "Stay in position. During active play, assistant referees should strive to maintain a position even with either the second-to-last defender or the ball—whichever is closer to the goal line. The assistant referee should stay about one or two feet outside of the touchline in order to maintain a wide-angle view of play close to the touchline and to avoid causing the ball to remain in play if it were to strike the assistant referee."
    },
    {
      "title": "Position yourself accurately.",
      "content": "Position yourself accurately. In practice—and especially when there is the potential for an imminent offside or goal/no goal decision—assistant referees should move in a side-to-side shuffle facing the field. In the event that the second-to-last defender or the ball is moving too fast to maintain position while shuffling, assistant referees should instead turn and run normally. Being in the right position at the right time is of paramount importance."
    },
    {
      "title": "Know how to use the flags properly.",
      "content": "Know how to use the flags properly. While the ball is in play, assistant referees should always keep their flags in the hand closest to the referee. Ninety five percent of the time that will be the left hand, unless the assistant is following play upfield. When moving—and especially when running—assistant referees should keep the arm that the flag is in still and not pump it while running. This may sound trivial, but when at full sprint, pumping the flag arm can look sloppy, and the motion of the flag can distract the referee and cause him or her to stop play, thinking you signalled for something."
    },
    {
      "title": "Position yourself accurately.",
      "content": "Position yourself accurately. When a penalty kick is awarded, the assistant referee should position himself or herself at the intersection of the goal line and the penalty area line to allow him or her to more accurately watch for the ball crossing the goal line or for violations by the goalkeeper."
    },
    {
      "title": "Know the basic guidelines that apply to all assistant referee signals.",
      "content": "Know the basic guidelines that apply to all assistant referee signals. These are as follows: Always make eye contact with the referee before signaling. Come to a complete stop and face the field before signaling. In all signals, the flag is an extension of your arm. You should be able to trace a line from your shoulder down your arm to the tip of the flag. Signal with your arm held completely straight. If the signal is composed of multiple parts, start the first signal in the arm that will be used to make the next signal. If you must change hands, do it below your waist. Do not signal in an overly hasty manner, but do signal crisply, quickly, and authoritatively. It is sometimes helpful to signal in a manner in which the fabric makes a loud snap as you signal. Hold your signal until the referee acknowledges it, either by stopping play or by waving it off. Then drop your flag and move to the proper position."
    },
    {
      "title": "Know how to signal a throw-in.",
      "content": "Know how to signal a throw-in. When the ball completely crosses the touch line for a throw in, signal by raising your flag at a 45° angle in the direction in which the team entitled to the throw-in is attacking."
    },
    {
      "title": "Know how to signal a goal kick.",
      "content": "Know how to signal a goal kick. When the ball completely crosses the goal line for a goal kick, signal by pointing your flag straight across the field toward the goal area. Use your right hand to avoid impeding your view of the players and the referee."
    },
    {
      "title": "Know how to signal a corner kick.",
      "content": "Know how to signal a corner kick. When the ball completely crosses the goal line for a corner kick, signal by pointing the flag at a 45° angle downwards toward the corner flag on your side of the field—even if the corner will be taken across the field. If you are standing directly on the goal line, take a few steps upfield so that your flag is not crossing the plane of the corner flag and pointing to a spot off the field."
    },
    {
      "title": "Know how to signal offside.",
      "content": "Know how to signal offside. When you detect an offside violation by the attacking team, raise your flag straight in the air. If the referee acknowledges the signal by stopping play, drop the flag to a position indicating where the offense occurred: 45° upward for an offense occurring on the far side of the field, straight across the field for an offense in the middle of the field, and 45° downward for an offense on the near side of the field."
    },
    {
      "title": "Know how to signal a foul.",
      "content": "Know how to signal a foul. If you detect a foul and are certain that the referee did not see it and would not have applied advantage had he or she seen it, raise your flag straight up in the air. Make eye contact with the referee, and give the flag a slight wave. If the referee stops play, signal with the flag 45° upwards in the direction in which the free kick should be awarded."
    },
    {
      "title": "Know how to signal a penalty kick.",
      "content": "Know how to signal a penalty kick. In the event that the foul you detect in the above scenario is committed by a player in his or her own penalty area, raise your flag and give it a slight wave, but instead of signaling a direction, hold your flag horizontally across your waist to indicate that the offense warrants a penalty kick. If the referee awards the PK, move to penalty kick positioning."
    },
    {
      "title": "Know how to signal a goal.",
      "content": "Know how to signal a goal. When the ball crosses the goal line between the goal posts, you will do one of three things: If there is no occurrence that would bring the validity of the goal into question, make eye contact with the referee and sprint a short distance up the touchline towards the center line. Then record the goal. If there was an offside violation by the team that scored the goal, signal the offside violation. If there was a foul by the team that scored the goal that you believe the referee did not see or any other problem that might invalidate the goal, stand at attention and do not move until the referee consults you about the situation."
    },
    {
      "title": "Know how to signal a substitution.",
      "content": "Know how to signal a substitution. If, during a valid substitution opportunity, one of the teams wishes to make a substitution and the substitute(s) is/are ready and standing at the center line, raise your flag horizontally over your head (your hands should resemble the American football \"touchdown\" signal with the flag held between them). Then conduct the substitution as directed by the rules of competition."
    },
    {
      "title": "Know how to suggest a card.",
      "content": "Know how to suggest a card. (This is another USA-specific procedure.) In the event that, based on your view of a situation, you believe a caution or send-off is warranted by the laws of the game, you may discreetly advise the referee by placing your hand over your badge to suggest a caution and yellow card, or patting your back pocket to suggest a send-off and red card. (Note: your referee may ask you to follow an alternate procedure in his or her pre-game conference; since the \"back pocket\" is nowadays quite synonymous with a send-off and somewhat well known by players and coaches, such an overt gesture may tie the referee's hands, so to speak, and fuel any disagreement in the event that he or she does not issue the send-off.)"
    },
    {
      "title": "Know how to use the flags at endpoints of the game.",
      "content": "Know how to use the flags at endpoints of the game. After the final whistle for the half or for the match has been blown, assistant referees should furl their flags and rush to meet the referee at the center circle. The referee team should then leave the field together."
    }
  ]
}