{
  "url": "https://www.wikihow.com/Pursue-Your-Passion",
  "title": "How to Pursue Your Passion",
  "steps": [
    {
      "title": "Find your passion by imagining that money was no object or concern in life.",
      "content": "Find your passion by imagining that money was no object or concern in life. For the moment, forget about the money. What would you do? What dreams or projects would you chase? Think about the things you'd do if given complete freedom, whether it is helping others with a cause dear to you to traveling the world. Remember the things you wanted to do or be as a kid or college student, before adult life or worries got in the way. You'll be surprised how many of those passions are still viable. Ask some friends and family for feedback if you're not sure what you want to do for life -- they may have ideas and fields you hadn't considered. Don't feel pressured to pick or find a passion -- sometimes what you really want to do takes time to develop. Thinking about what you want to do will lead to uncovering your passions, so just be patient for now. [1] X Research source Reader Poll: We asked 391 wikiHow readers who've pursued new passions, and only 16% of them said they chose creative outlets like drawing or singing. [Take Poll] So don’t be afraid to think outside the box and try something unique!"
    },
    {
      "title": "Research what it takes to reach your passions, and consider a career counselor.",
      "content": "Research what it takes to reach your passions, and consider a career counselor. Head online or to your local career center (either on your college campus or through many city business departments) and lay out your goals. You may know where you want to go, but getting there is going to be the hard part. Sites like Wikihow, with broad but detailed advice from 1,000s of different people and careers, is a good start. But don't discount the unique, personal advice that a career advisor can give you -- they can help navigate your unique resume and skills for success. Career advisors can be found online. Don't have one in your city? Look for an online or remote career advisory service. While googling \"How to be X\" is a good start, it is not the only step you need to take. If you're really considering a career change, the more research, the better. If your passion involves starting a business, your local Small Business Association or Small Business Defense Council are taxpayer-funded resources to help you get going with loans, paperwork, and legal advice. Look online for classes and seminars in your area, which are low-cost ways to get started and meet other people with similar goals. [2] X Research source"
    },
    {
      "title": "Look towards your professional heroes for guidance.",
      "content": "Look towards your professional heroes for guidance. If you want to be a successful musician, it can't hurt to read into the lives of some of your musical heroes. While you won't, of course, perfectly replicate their path to success, there is a lot to be learned from those who have stumbled over the same path. At the very least, these stories often show you how important perseverance is when pursuing your passion: there will be setbacks and tough times, but pushing through them is possible. What common training or education do your heroes have? What moments are similar in many people's stories, and how can you replicate those stepping stones? What hurdles or issues did your heroes go through that you hope to avoid? For example, a young entrepreneur reading about Steve Jobs and Steve Wozniak might learn the extreme importance of detailed contracts and openness between business partners, avoiding financial questions and struggles later on. [3] X Research source"
    },
    {
      "title": "Network with others pursuing similar passions.",
      "content": "Network with others pursuing similar passions. The truth is that if you stay alone, you will spend years figuring out how to assemble a project that could have taken just a week while in a group. Everyone is struggling together, but that doesn't mean you all need to make the same mistakes as each other. And, if one person finds some success, the doors usually start opening up for everyone. Email or call anyone you know that follows your passion, and ask if you can talk about their daily life. Everyone starts somewhere, and most people will be happy to help out someone who shares their passion. Find online groups or forums that offer advice, stories, and contacts for your field. Reddit, in particular, has groups for almost any passion on the planet."
    },
    {
      "title": "Take a hard look at all of the issues and problems pursuing your passion entails, and plan to overcome them.",
      "content": "Take a hard look at all of the issues and problems pursuing your passion entails, and plan to overcome them. Don't shy away from anything, even the tough parts. Recognizing the difficulties of pursuing your passions is a big part of overcoming them, and make no mistake -- pursuing your passion is difficult. It's why most people don't do it. Honestly appraising the following elements will let you know if you really are passionate. If you're still not fazed, it is clearly something worth pursuing. [4] X Research source General Salary: Did you know that most Etsy craftspeople make under the average household income? While doctors make a lot of money, med students rack up a lot of debt through school, debt they still have to pay if they decide not to be a doctor after all. Know the financial constraints before plunging. Education and Training Time: Becoming a college professor may be your passion, but you need to know it will be several years of schooling before you can stand in front of a classroom. Very few passions can be slipped into instantly. Daily Challenges and Struggles: Most jobs are not as glamorous as they seem from the outside. That's okay, but you don't want to be surprised the first day out. Ask other people who work that career what a normal day is like, what parts of the job they love, and what parts they really dislike. [5] X Research source"
    },
    {
      "title": "Know that your dream job might not pay enough to live as you get started.",
      "content": "Know that your dream job might not pay enough to live as you get started. This is a hard fact, but one you need to come to terms with in order to prepare for any hard times. Whether you're switching careers or embarking on your first job, chances are good that you won't get your dream job right out the gate. Use your research to determine good entry points, but have a financial backup plan ready: If you're changing jobs, save up at least 6 months of living expenses. Consider working part-time, even if you dislike the job, to help ease your transition. Look into temporary or freelance work, such as babysitting, TaskRabbit, or driving for a service like Uber, to pay the bills but maintain flexibility to pursue your passion"
    },
    {
      "title": "Start freelancing to help step into a full-time job.",
      "content": "Start freelancing to help step into a full-time job. Whether you're new to the job market or making a mid-career move, everyone wants to see someone who is \"experienced.\" But, of course, you need that first job to get the experience required to get the first job! This trap will never stop being maddening, but the best you can do is take things into your own hands. Your skills are more marketable than you think, and there are a variety of ways to \"self-employ\" yourself to build the experience necessary to move on: Volunteering for organizations related to / needing your skills Offering mentoring or tutoring for your chosen field Blogging on current events and trends in your field. Selling early runs of artwork or products online. Applying to temporary work or part-time internships Working for free (in the early days). [6] X Research source"
    },
    {
      "title": "Advertise yourself and your skills.",
      "content": "Advertise yourself and your skills. Unfortunately, very few people get noticed out of nowhere and plucked up, and those that do are generally well-established already. You need to be your own biggest salesman, showing off your skills and expertise before anyone else will. While how you market yourself depends on your actual passion and skills, there are some common ideas: Be in the epicenter of your passion: If you want to be a pro-athlete, you have to play on the best teams you can try out for. If you want to be a movie star, it's time to get to LA. Build an online portfolio: Sites like Wix, Adobe, WordPress, and more have hundreds of pre-made templates to show off your best work and your contact information. Be active in forums and discussions: Help out other newbies, keep up on news in your field, and get to know others pursuing similar passions Start at least one daily social media account: Which one depends on your field -- visual fields tend to Instagram and Vine, writers like Twitter and blogs, businesses love Pinterest, etc. Whatever you choose, post at least once a day to build a following. [7] X Research source"
    },
    {
      "title": "Inject your passions into your current life and work.",
      "content": "Inject your passions into your current life and work. Maybe you want to be a famous author or switch into a journalism job. Instead of waiting to roll the dice, start volunteering for more writing jobs and tasks at your company. Write for a student newspaper or become an after-school writing tutor, and check if blogs you enjoy take guest submissions. Find ways to incorporate your passion into your current job and it will be much easier to apply for the types of jobs you're really passionate about. Brainstorm ways you can do more of what you love every week, from taking on new tasks at work to doing some volunteer work at a local charity. [8] X Research source"
    },
    {
      "title": "Have a backup plan in case things don't work out.",
      "content": "Have a backup plan in case things don't work out. What happens if your passion burns out, is harder to pursue than you imagined, or other issues (health, accidents, etc.) sidetrack your plans midway through? If you're going to take a leap and pursue your passions, you should still keep a safety net in place. Make yourself think through all of the worst case scenarios, even unlikely ones, and know when you need to pull out and try something new. At least six months of savings are the minimum recommended to take the plunge, allowing you to be unemployed without a paycheck for half a year. Keep your eyes open for other jobs that fit your work history or major, even if they aren't for your passion. They may be necessary stepping stones towards the \"dream job.\" [9] X Research source"
    },
    {
      "title": "Turn your passion into a \"side-project\" to gain experience with less risk.",
      "content": "Turn your passion into a \"side-project\" to gain experience with less risk. You can even do this while still at your current job, allowing you to flex your muscles a bit without losing your financial safety net. Pursuing your passion is not an all or nothing game, as real life is far more complicated than a black and white decision. If you can only work on your invention after work, have to get up 2 hours early to work out and train, or spend all your downtime at work scribbling poetry, that is okay -- innovators from Einstein to T.S. Elliot share similarly humble beginnings. Don't believe you must quit everything to jump into your project -- just start working on it. \"When is the best time to plant a tree? Yesterday. When is the second best time? Today.\" This little saying, though joking, points to how important is to just start pursuing your passion instead of waiting for the perfect moment. [10] X Research source"
    },
    {
      "title": "Take steps to pursue your passion every single day, whether it is research, practice, or work.",
      "content": "Take steps to pursue your passion every single day, whether it is research, practice, or work. Make a habit of putting your passion first each day, even if it is only for 15-20 minutes. You may study up on some new cooking technique, look into the education requirements to change careers, or run through your scales on the piano -- what matters most is making your passion your daily priority. If you can't squeeze in some time each day to work on your passions, it's going to be a lot harder to dedicate your life to them. Make your passion a habit, turning practice into an automatic behavior. Set aside the same time each day to work on your dreams, or set daily goals to hit. Really focus on this practice time, trying your best to get a little better each day. Daily practice in small bursts is proven to be more effective than one large chunk each week. [11] X Research source"
    },
    {
      "title": "Find a support network of collaborators and friends to help through the tough times.",
      "content": "Find a support network of collaborators and friends to help through the tough times. If you're a struggling musician, you'll realize quickly that you aren't the only one. Most passions are difficult to pursue, and even though it feels like everyone is ahead of you sometimes, remember that everyone is in this together. Don't be competitive or stand-offish or you'll just make your struggle a little more lonely and a lot harder. Help a fellow artist as they move into the studio, collaborate on a skit with fellow writers and actors, and cross-promote with the other new start-up down the hall. You will need help and support from your community, no matter what it is, at some point in your career. Don't forsake them when they're in trouble and they won't leave you when you need them. [12] X Research source Pass your obsession on to those who need a push. If you see a spark in someone else who seems to lack the courage to take if further, help them out by giving them the nudge and support they most probably need."
    },
    {
      "title": "Stay informed and up-to-date, keeping on the cutting edge of your field.",
      "content": "Stay informed and up-to-date, keeping on the cutting edge of your field. Breakthroughs often come through the darkest times, when the old methods and ideas don't work anymore. Even when you're struggling, push yourself to keep learning and growing. These moments are those that separate the successful from those that fall short. Information is what fuels your brain to think bigger, so get to reading, seeing more, and listening more. Be open to new ideas and suggestions and you will not only get better, you'll find deeper enjoyment and happiness in your passion.#Judge success by your happiness and enjoyment, not external rewards like money. If you're out pursuing your passion, then the material concerns aren't going to mean as much. At the end of the day, you pursue a passion because it is what you want to do, and remembering this simple fact will help you keep pushing even if times get tough. Following your passion is not easy -- there is no way around that -- but that doesn't mean it isn't rewarding. Don't judge your success on money, houses, and cars -- judge it on whether or not you are happy. [13] X Research source How do you judge between a low-paying job that you love and a high-paying job you don't? Everyone's choice will be different, but remember how many hours a day you sink into your job. If you're miserable, is the higher pay really worth it. [14] X Research source"
    }
  ]
}