{
  "url": "https://www.wikihow.com/Screenshot-on-iPhone-12-Pro-Max",
  "title": "How to Screenshot on iPhone 12 Pro Max",
  "steps": [
    {
      "title": "Navigate back to the screen you want to capture.",
      "content": "Navigate back to the screen you want to capture. This can be a notification on your Home screen, inside an app, or anywhere else. Note that apps like WhatsApp and Facebook Messenger will notify the other people in the chat if you screenshot a message."
    },
    {
      "title": "Press and briefly hold the Power and Volume Up buttons simultaneously.",
      "content": "Press and briefly hold the Power and Volume Up buttons simultaneously. They are on either side of your phone. You want to quickly press them at the same time, then release them."
    },
    {
      "title": "Tap or ignore the thumbnail that appears at the bottom of your screen.",
      "content": "Tap or ignore the thumbnail that appears at the bottom of your screen. If you want to edit or share the screenshot, you should tap the thumbnail before it disappears. You'll be able to edit, crop, draw, erase, add arrows, and otherwise mark it up. Tap the Share icon and you can send the screenshot to your contacts. If you ignore the thumbnail for now, you can find your screenshot in your Photos app in Albums > Screenshots . [1] X Research source"
    },
    {
      "title": "Open Settings.",
      "content": "Open Settings. This app icon features gears on a light grey background."
    },
    {
      "title": "Tap Accessibility.",
      "content": "Tap Accessibility . You may need to scroll down the menu to see this option next to an icon of a person inside a circle."
    },
    {
      "title": "Tap Touch.",
      "content": "Tap Touch . It's under the \"Physical And Motor\" header next to an icon of a finger."
    },
    {
      "title": "Tap Back Tap.",
      "content": "Tap Back Tap . You'll see this at the very bottom of the page."
    },
    {
      "title": "Tap Double Tap and select \"Screenshot.",
      "content": "Tap Double Tap and select \"Screenshot. \" A checkmark will show that it is selected. [2] X Research source"
    },
    {
      "title": "Navigate back to the screen you want to capture.",
      "content": "Navigate back to the screen you want to capture. Since you selected Screenshot in the previous step, now your phone will capture the image that's on the screen when you double-tap the back of your phone."
    },
    {
      "title": "Double-tap the back of your phone.",
      "content": "Double-tap the back of your phone. It will take a screenshot of the current screen and display a thumbnail of the screenshot in the lower-left corner of the screen. Tap or ignore the thumbnail that appears at the bottom of your screen. If you want to edit or share the screenshot, you should tap the thumbnail before it disappears. You'll be able to edit, crop, draw, erase, add arrows, and otherwise mark it up. Tap the Share icon and you can send the screenshot to your contacts. If you ignore the thumbnail for now, you can find your screenshot in your Photos app in Albums > Screenshots . [3] X Research source"
    },
    {
      "title": "Navigate to the page you want to capture in Safari.",
      "content": "Navigate to the page you want to capture in Safari. Since this method will not work in any other browsers, you'll want to continue using Safari."
    },
    {
      "title": "Take a screenshot.",
      "content": "Take a screenshot. You can either press buttons or double-tap your phone to capture the screen."
    },
    {
      "title": "Tap the thumbnail that appears.",
      "content": "Tap the thumbnail that appears. It'll show up in the lower-left corner after you successfully take a screenshot."
    },
    {
      "title": "Tap Full Page.",
      "content": "Tap Full Page . You'll see this near the top of your screen next to Screen . Tapping this will change the screenshot to include the full page in Safari instead of what's displayed on your screen."
    },
    {
      "title": "Drag the slider to capture the entire page then tap Done.",
      "content": "Drag the slider to capture the entire page then tap Done . If you don't want to capture the entire page, you can drag the slider to where you want the capture to end. When you're finished, tap Done in the top left corner. Any full-page captures will be saved as PDFs in files instead of your Photo Gallery. [4] X Research source"
    }
  ]
}