{
  "url": "https://www.wikihow.com/Moral-Dilemma-Questions",
  "title": "18 Moral Questions & Ethical Dilemmas to Break Your Brain",
  "steps": [
    {
      "title": "A trolley has lost its brakes and is now hurtling down the track.",
      "content": "A trolley has lost its brakes and is now hurtling down the track. The driver has lost all control of the trolley. You’re standing beside the tracks a little farther ahead and you can see the trolley coming your way. Even farther down the track from where you are, you see 5 workmen on the tracks, and you realize that the trolley is going to hit them in a matter of seconds if it is not diverted. You notice there’s a lever beside you that you can pull to divert the trolley from the track it’s on to another track, which would save all 5 workmen. However, on this second track, there is one man working, who would die when the trolley hits him. [1] X Research source"
    },
    {
      "title": "A trolley has lost its brakes and is hurtling down the tracks.",
      "content": "A trolley has lost its brakes and is hurtling down the tracks. The driver has lost control of the trolley, and unless it is stopped, the trolley will hit 5 people working on the tracks in a matter of seconds. You are standing on a footbridge over the tracks, just before the spot where the 5 people are working. There is also a very, very large man standing on the footbridge with you. If you can push him onto the tracks, the trolley will be stopped, sparing the 5 workmen but killing the large man. [2] X Research source"
    },
    {
      "title": "A trolley’s brakes have been sabotaged by a very large man.",
      "content": "A trolley’s brakes have been sabotaged by a very large man. The trolley is hurtling down the tracks. Unless it is stopped, the trolley will hit 5 people working on the tracks in a matter of seconds. You are standing on a footbridge over the tracks, just before the spot where the 5 people are working.You turn and realize the very large man who sabotaged the trolley is standing on the footbridge with you. If you can push him onto the tracks, the trolley will be stopped, sparing the 5 workmen but killing the large man. [3] X Research source"
    },
    {
      "title": "A woman is fatally ill, and the only cure is a rare and expensive drug.",
      "content": "A woman is fatally ill, and the only cure is a rare and expensive drug. Her husband, Heinz, cannot afford the drug, but he pleads with the druggist to give it to him anyway, promising to pay him back later. The druggist refuses, arguing that he deserves payment for this rare drug and can’t just give it to anyone who asks: “If I gave it to you, soon everyone in a similar situation will come begging for it too.” Heinz tries to collect money from his friends and family, but he can’t raise enough. In desperation, he considers breaking into the pharmacy to steal the medication once the druggist leaves for the day. [4] X Research source"
    },
    {
      "title": "A homeless person enters a hospital emergency room.",
      "content": "A homeless person enters a hospital emergency room. After a quick checkup, they’re determined to be healthy. At the same time, 5 patients elsewhere in the hospital are in desperate need of organ transplants: two need a kidney each, two need a lung each, and one needs a heart. Imagine the homeless person is a perfect candidate for organ donation for each of these patients, and that without their donation, each patient would die. [5] X Research source"
    },
    {
      "title": "A madman has threatened to set off several bombs in a crowded area.",
      "content": "A madman has threatened to set off several bombs in a crowded area. He is apprehended by authorities, but unfortunately, he has already planted the bombs and they will go off soon unless they are found and diffused. If the bombs go off, they may kill hundreds of people. But the madman refuses to say anything about where the bombs are and how to diffuse them. One official suggests torturing the madman to get him to confess, which is illegal, but the situation is a desperate one."
    },
    {
      "title": "A madman has threatened to set off several bombs in a crowded area.",
      "content": "A madman has threatened to set off several bombs in a crowded area. This would surely kill hundreds of people. He is apprehended by authorities, but he has already planted the bombs, and they will go off soon unless they are found and diffused. The madman won’t say where the bombs are or how to diffuse them, and in desperation, one official suggests torturing the madman’s innocent wife in order to get the madman to confess."
    },
    {
      "title": "Jane hates her husband and wants him dead.",
      "content": "Jane hates her husband and wants him dead. One day, she puts poison in his coffee to kill him. Debbie also hates her husband and wants him dead, but has no immediate plans to kill him. One day, Debbie’s husband accidentally puts poison in his own coffee, thinking it’s cream. Debbie has the antidote and could save his life, but she decides not to give it to him, and lets him die. [6] X Research source"
    },
    {
      "title": "Marcel is in his mid-thirties and lives a happy life with his wife and children.",
      "content": "Marcel is in his mid-thirties and lives a happy life with his wife and children. He has been a patient of Dr. Cooper, a therapist, for years. One day, he confesses to Dr. Cooper that when he was in college, he got into an argument with his neighbor, Olivia, lost his temper, and shoved her. She fell down and broke her neck, dying instantly. Marcel never meant to kill Olivia, but he buries her body and it is never found. Dr. Cooper is the only person who knows what happened to Olivia, and though she has a professional duty to report his crime, she believes Marcel when he says it was a terrible accident. She feels Marcel is a generally good person and not a danger to anyone. He begs Dr. Cooper not to tell anybody what happened to Olivia. [7] X Research source"
    },
    {
      "title": "You’re gifted a very large sum of money to use as you wish.",
      "content": "You’re gifted a very large sum of money to use as you wish. You can either donate the money to a charity that will help save the lives of hundreds of people, or you can use the money to pay for an expensive operation that would save your life (but would not benefit anybody else)."
    },
    {
      "title": "Your best friend is going to be married to the love of her life in a couple hours.",
      "content": "Your best friend is going to be married to the love of her life in a couple hours. She’s been preparing for this day for months and months. The guests are all on their way to the venue by now. Your best friend has never seemed happier or looked more stunning. Suddenly, the groom confesses to you that he cheated on your friend once over a year ago, but that it was a one-time thing and a horrible mistake. He never told her, and you do believe he’s sincerely sorry about it. If you tell your friend, the wedding will be ruined—and it’s possible they would patch things up, anyway. But if you don’t tell her before they tie the knot, you worry you’d be betraying your friend."
    },
    {
      "title": "One of your closest friends confesses to you that she’s committed a crime.",
      "content": "One of your closest friends confesses to you that she’s committed a crime. She swears you to secrecy. Later, you discover that an innocent person has been accused of the crime. You beg your friend to turn herself in, but she refuses and reminds you you’ve promised not to tell anyone either."
    },
    {
      "title": "Arthur and Harriet have a teen with leukemia who needs a bone marrow donor.",
      "content": "Arthur and Harriet have a teen with leukemia who needs a bone marrow donor. Donating bone marrow is generally a safe procedure, but Arthur and Harriet can’t find a suitable match. They decide to conceive a second child in the hopes that this child is a match, but there is about a 25% chance the new child will be a suitable donor. Arthur and Harriet are no longer young and don’t really want another child, so they plan to let their neighbor adopt the baby, who will take care of them and try to give them a good life. When the child is old enough, the neighbor will allow Harriet and Arthur to use the child as a bone marrow donor, if they’re a match. [8] X Research source"
    },
    {
      "title": "A ship is sinking, and there is only one usable lifeboat.",
      "content": "A ship is sinking, and there is only one usable lifeboat. The lifeboat can only carry 6 people, but there are 10 on board: a woman who believes she’s 6 weeks pregnant, a lifeguard, two young adults who are recently married, an elderly person with 15 grandchildren back home, an elementary school teacher, a pair of 13-year-old twins, a nurse, and the captain of the ship. You and the rest of the passengers must quickly decide who deserves to remain on the ship and who should be allowed on the lifeboat. [9] X Research source"
    },
    {
      "title": "You and your son have both been abducted by aliens.",
      "content": "You and your son have both been abducted by aliens. Your son tries to flee in an escape pod; the guards stop him, and a particularly cruel guard intends to kill your son to teach the other prisoners a lesson. The guard demands that you yourself shoot your son, or else the guard will kill both your son and another prisoner. [10] X Research source"
    },
    {
      "title": "A very large man is guiding a group of people out of a cave by the coast.",
      "content": "A very large man is guiding a group of people out of a cave by the coast. As the man leads them through the cave’s exit, he becomes stuck. The tide is coming in and will drown the man and everyone in the cave unless they can remove him from the cave. The people in the cave have tried their best to push or pull the large man through the exit, but to no avail. Someone in the cave has a stick of dynamite with them."
    },
    {
      "title": "Jerry, George, Elaine, and Kramer have a layover in a small New England town.",
      "content": "Jerry, George, Elaine, and Kramer have a layover in a small New England town. They witness a robbery in which a man is held up by someone claiming to have a gun (though there is no visible gun). The foursome not only does nothing to help, they make fun of the man being robbed. When a police officer shows up, he arrests them for not intervening, claiming they have violated the town’s new “Good Samaritan” law, which they knew nothing about. Because Jerry, George, Elaine, and Kramer did not aid the man, and because they mercilessly mocked him, they are convicted of a crime. This scenario is pulled from the series finale of Seinfeld ."
    },
    {
      "title": "The city of Omelas is a beautiful, vibrant utopia.",
      "content": "The city of Omelas is a beautiful, vibrant utopia. Everyone thrives and is happy. Nobody is starving. Nobody wants for anything. There is no war, no disease, no crime, no evil. Everyone is at peace in Omelas—except for a young child, who is locked away in a basement beneath the city to live in total isolation and filth. Everyone in the city knows this child is here, and they know that—somehow—the success of the utopia depends entirely on the child’s continued misery. The child cannot and will not be released. Some citizens continue to live their lives as usual, since they can do nothing about the child’s conditions and, even if they could, they believe the success of the city is worth one individual’s sacrifice; other citizens choose to leave Omelas entirely in the hopes of finding a city that doesn’t depend on the suffering of any of its citizens. This moral dilemma is taken from the short story “The Ones Who Walk Away from Omelas” by Ursula Le Guin."
    }
  ]
}