{
  "url": "https://www.wikihow.com/Slow-Burn-Romance-Meaning",
  "title": "What Is a Slow Burn Romance? How to Know If a Story Has It",
  "steps": [
    {
      "title": "A slow burn romance is when the lovers take a long time to fall in love.",
      "content": "A slow burn romance is when the lovers take a long time to fall in love. In a story with a slow burn romance, the main characters often start out as friends or enemies, or they may not know each other at all. As the plot continues, the characters gradually find common ground and recognize a mutual attraction. Near or at the end of the story, they admit (sometimes just to themselves) that they're in love. [1] X Research source A slow burn romance can also be a story where two people are already in love at the beginning, but they don't (or can't) do anything about it until the end. Many people who read or watch slow burn romances appreciate that the characters grow to love one another over time, not immediately like in a fairytale. They like that the slow burn prioritizes the characters getting to know one another before falling in love over becoming instantly smitten, which aligns more with real life."
    },
    {
      "title": "Strong, well-rounded characters.",
      "content": "Strong, well-rounded characters. The characters who are going to become lovers should have strengths and weaknesses, as well as unique problems they need to try to solve in the story (which may or may not be related to their romantic interest). These are particularly essential elements for slow burn romance characters because the reader or viewer has to be invested in them for the entire story. [2] X Research source Elizabeth Bennet and Mr. Darcy from Pride and Prejudice are great examples of slow burn romance characters with rich interior lives. Throughout the story, Elizabeth experiences many highs and lows between worrying about her sisters' relationships and figuring out her own feelings – first for Mr. Wickham and then for Mr. Darcy. Meanwhile, Mr. Darcy is concerned about his friend's welfare and tries to help him, all while attempting to squash his feelings for Elizabeth because she's from a lower class."
    },
    {
      "title": "Chemistry between the main characters (or the potential for it).",
      "content": "Chemistry between the main characters (or the potential for it). There must be a certain undeniable spark between two slow burn lovers, even if they dislike each other. That spark often manifests as witty banter or the trading of clever insults. It can also be apparent in how well they work together on a task or how their personalities complement one another. [3] X Research source In When Harry Met Sally , the chemistry between Harry and Sally is obvious in their banter and through their candid conversations about dating and sex. Yet they don't actually acknowledge they're in love with each other until the last scene in the film."
    },
    {
      "title": "Slow build-up of their romantic relationship.",
      "content": "Slow build-up of their romantic relationship. The main characters shouldn't just fall head over heels in love with one another in the first chapter or scene of a slow burn romance. Instead, while they may feel a small attraction at first, the story should build their relationship into a romantic one slowly across several chapters, small scenes, and plot escalations. [4] X Research source In the NBC sitcom The Office (2005-2013), Jim Halpert and Pam Beesly are attracted to one another in the first season, but they don't become a couple until season 3. In the interim, they remain good friends and date other people, but over time, their yearning for one another increases. It finally hits a crescendo in the third season when Pam declares her feelings for Jim, and he breaks up with his girlfriend to ask her on a date."
    },
    {
      "title": "The romantic climax.",
      "content": "The romantic climax. This is the scene in the slow burn romance that gets readers and viewers hooping and hollering with joy. Finally, after pages or hours of arguing, flirting, yearning, and sidelong glances (and sometimes lovemaking), the main characters finally confess their love for one another. The cherry on top is usually a passionate kiss. [5] X Research source In the 2005 movie version of Pride & Prejudice , the romantic climax occurs when Elizabeth and Mr. Darcy meet in a field at dawn. Elizabeth has just had a nasty confrontation with Darcy's aunt, and Darcy has come to apologize. Their vulnerability in this moment encourages Darcy to declare his love for her once more. Instead of rejecting his advances as she did earlier in the story, Elizabeth accepts his hand as she will later accept it in marriage."
    },
    {
      "title": "Enemies to Lovers",
      "content": "Enemies to Lovers Perhaps the most popular slow burn romance trope is when the main characters start out as enemies and end up as lovers. In these types of relationships, there's lots of unadulterated loathing to go around – that is, until the characters realize the other person isn't so bad and maybe even a little hot. [6] X Research source The Enemies to Lovers trope has been with us for centuries. You can find great examples of it in the classic novel Pride & Prejudice by Jane Austen, The Hating Game by Sally Thorne, and The Proposal (2009) starring Sandra Bullock and Ryan Reynolds."
    },
    {
      "title": "Friends to Lovers",
      "content": "Friends to Lovers In this trope, the main characters start out as friends and by the end of the book or film, they realize they're in love with each other. At that point (usually after a conflict that temporarily pushes them apart), they start a romantic relationship. [7] X Research source Friends to Lovers is a staple trope in popular romantic comedies like When Harry Met Sally (1989) and 13 Going on 30 (2004), as well as steamy books like The Crush Next Door by Jenna Fiore."
    },
    {
      "title": "Fake Dating",
      "content": "Fake Dating In the Fake Dating trope, the two main characters often decide to start a fake relationship for a variety of reasons: pacify their families so they'll stop asking if they're seeing someone yet, get revenge on their exes, or even to avoid getting deported (as in The Proposal ). While the relationship is purely for convenience in the beginning, they're head over heels for one another by the closing scene. [8] X Research source Examples of Fake Dating tropes in books and movies include To All the Boys I've Loved Before (the young adult book by Jenny Han and the Netflix movie ), How to Lose a Guy in 10 Days (2003), and The Love Hypothesis by Ali Hazelwood."
    },
    {
      "title": "Forbidden Romance",
      "content": "Forbidden Romance A Forbidden Romance is when the two main characters aren't supposed to be together, usually because they're from different races, ethnicities, countries, or class. Yet, as they're thrown together time after time throughout the story, they admit their feelings and decide to pursue their relationship, despite opposition. [9] X Research source Classic Forbidden Romances in media are The Shape of Water (2017), Belle (2013), and the Twilight Saga by Stephenie Meyer."
    },
    {
      "title": "Opposites Attract",
      "content": "Opposites Attract In this trope, the main characters are complete opposites in some ways (i.e., race, class, personality, goals), yet it's precisely those differences – and where they find common ground – that bring them together. They may not realize how much they have in common or how much they need each other for a long time, which is where the slow burn romance comes in. [10] X Research source Examples of the Opposites Attract slow burn romance in film and TV are Wall-E and Eve in Wall-e (2008), Cher and Josh in Clueless (1995), and Niles and Daphne in the hit sitcom Frasier (1993-2004)."
    },
    {
      "title": "Choose the slow burn romance trope you want to write.",
      "content": "Choose the slow burn romance trope you want to write. When making this decision, consider which slow burn movies and books you love. For example, if you're a fan of When Harry Met Sally and 13 Going on 30 , the Friends to Lovers trope may be right up your alley."
    },
    {
      "title": "Develop deep, multi-faceted characters to be the lovers.",
      "content": "Develop deep, multi-faceted characters to be the lovers. Give them strengths, weaknesses, interests, and conflicts – both internal and external – to push the plot forward and help the characters change. Avoid creating characters that are flat and devoid of personality, to the point that it's obvious they only exist to complement their romantic partner. [11] X Research source"
    },
    {
      "title": "Craft an interesting plot with multiple acts and story beats.",
      "content": "Craft an interesting plot with multiple acts and story beats. Most stories follow a classic 3-act structure: setting up the world and the conflict, confronting the conflict, and resolving the problem (often in a way the main characters don't expect). Following a framework like this will make it easier to create a compelling story to ground your romance. [12] X Research source"
    },
    {
      "title": "Write secondary characters to support (or try to ruin) the romance.",
      "content": "Write secondary characters to support (or try to ruin) the romance. Having a supporting cast of interesting characters in your slow burn romance will not only make the story more colorful and alive, but will also add more tension and depth to the story. Secondary characters can either help the main characters or serve as obstacles that push them apart, so play with both types to see how they make the romance more interesting. [13] X Research source"
    },
    {
      "title": "Develop the characters' romantic feelings through plot progression.",
      "content": "Develop the characters' romantic feelings through plot progression. For example, your characters can bond through a dramatic event or while performing a task that's integral to the main story. This is more effective than creating scenes for the sole purpose of bringing your characters together, as those tend to feel flat and cheesy."
    },
    {
      "title": "Leave subtle hints for readers that your characters are falling in love.",
      "content": "Leave subtle hints for readers that your characters are falling in love. Include a longing glance here and an accidental brushing of the hands in a corridor there. And don't forget the pining – i.e., thinking about each other and longing for one another's company or touch. Little moments like these are like candy to slow burn romance fans and will help raise the romantic tension in your story. [14] X Research source"
    },
    {
      "title": "Raise the tension by giving your lovers obstacles.",
      "content": "Raise the tension by giving your lovers obstacles. This is part of creating a \"will they, won't they\" aspect to your slow burn romance. The audience wants the main characters to be together and will be in agony each time something gets in the way, like an annoying family member or an ex-partner. It adds tension as well as a level of uncertainty that will keep your audience hooked to the end. [15] X Research source In Sense and Sensibility (both the novel by Jane Austen and the 1995 film adaptation ), the main character, Elinor Dashwood, is thwarted in her romance with Edward Ferrars by the revelation that he's been secretly engaged for many years. The hasty engagement Edward made in his youth is a direct threat to his feelings for Elinor and leaves the audience desperate to know if or how the lovers will ever get together. Near the end of the story, however, Elinor finds out that Edward's fiance has broken off their engagement to marry his brother. This leaves Edward and Elinor free to marry and enjoy a happy ending. Avoid creating conflict between your main characters for the sake of having a dramatic or shocking moment. Instead, tie it back into the plot and make it seem like a natural step in the main story's progression."
    },
    {
      "title": "Craft a satisfying romantic climax.",
      "content": "Craft a satisfying romantic climax. Have the characters express their love for one another and share a kiss or some other type of physical affection (or perhaps more longing glances). If your story is on the spicy side, now might be a good time for them to consummate their love."
    },
    {
      "title": "Bring the main plot and the characters' arcs to a smooth conclusion.",
      "content": "Bring the main plot and the characters' arcs to a smooth conclusion. At this point, all the threads in your story should come together and end, leaving your audience feeling like they've experienced a complete story. It doesn't have to end happily (although that is traditional for many slow burn romances) as long as the place your characters end up feels natural and wraps up their conflicts. If you're writing a slow burn romance series, build up the slow burn across multiple installments instead of having a moment of realization or a romantic climax in the beginning."
    },
    {
      "title": "Some of the greatest films of all time are slow burn romances.",
      "content": "Some of the greatest films of all time are slow burn romances. In them, you'll find all kinds of classic tropes, from Friends to Lovers and Friends to Enemies to Fake Dating and Opposites Attract. They're also the perfect films to watch while curled up on the couch with a glass of wine and a big bowl of popcorn. Here's a list of some of the most popular ones to queue up on your television. When Harry Met Sally Pride and Prejudice (1995 & 2005 versions) Portrait of a Lady on Fire 13 Going on 30 You've Got Mail Sleepless in Seattle While You Were Sleeping The Proposal To All the Boys I've Loved Before How to Lose a Guy in 10 Days"
    },
    {
      "title": "Slow burn contemporary romance books are more popular than ever.",
      "content": "Slow burn contemporary romance books are more popular than ever. Authors like Ali Hazelwood, Sally Thorne, and Emily Henry have perfected the slow, juicy buildup to passionate romance in a modern setting that readers can easily relate to. Check with your local bookstore, library, or e-reader app to add these titles to your TBR. The Love Hypothesis by Ali Hazelwood The Hating Game by Sally Thorne Twice Shy by Sarah Hogle The Kiss Quotient by Helen Hoang People We Meet on Vacation by Emily Henry The Roommate by Rosie Danan Hana Khan Carries On by Uzma Jalaluddin The Marriage Game by Sara Desai The Wall of Winnipeg and Me by Mariana Zapata The Spanish Love Deception by Elena Armas"
    }
  ]
}