{
  "url": "https://www.wikihow.com/Make-a-YouTube-Short",
  "title": "How to Make a YouTube Short",
  "steps": [
    {
      "title": "Open YouTube on your smartphone or tablet.",
      "content": "Open YouTube on your smartphone or tablet. The YouTube app has an icon that resembles a red video screen with a white 'play' triangle in the middle. Tap the YouTube icon on your Home screen or Apps menu to open YouTube. In order to make sure you have access to YouTube Shorts, make sure you have the latest version of YouTube. You can update your YouTube app in the Google Play Store on Android, or the App Store on iPhone or iPad."
    },
    {
      "title": "Tap .",
      "content": "Tap . It's the icon with the plus sign (+) at the bottom-center of the screen. This displays a pop-up menu that gives you the option to upload a video, create a short, or live stream."
    },
    {
      "title": "Tap Create a Short.",
      "content": "Tap Create a Short . It's the second option in the \"Create\" menu at the bottom of the screen."
    },
    {
      "title": "Tap Flip to switch cameras.",
      "content": "Tap Flip to switch cameras. You can use your front-facing camera or your rear-facing camera. Tap the icon with two arching arrows in the upper-right corner to switch cameras. Use your front-facing camera to shoot videos of yourself. Use your rear-facing camera to shoot videos of a scene. If you would rather upload a short clip you already made, tap the thumbnail icon in the lower-left corner. Select a video you want to upload from your Gallery or Camera Roll and tap Next in the upper-right corner."
    },
    {
      "title": "Select a video speed.",
      "content": "Select a video speed. You can slow down or speed up the video when you film. This will make your video appears as if it was shot in slow-motion or timelapse. To select a video speed, tap the icon that resembles a speedometer and select a speed. Your speed options are as follows: 0.3X: This slows down your video to about ⅓ the normal speed. 0.5X: This slows down your video to ½ the normal speed. 1X: This is normal speed. This is the default setting. 2X: This doubles the speed of your video. 3X: This triples the speed of your video."
    },
    {
      "title": "Select how long of a video you want to shoot.",
      "content": "Select how long of a video you want to shoot. You can shoot a short 15-second video or a 60-second video. Tap the 15 or 60 above the red \"record\" button at the bottom of the screen to toggle between 15 and 60 seconds."
    },
    {
      "title": "Add music to your video (optional).",
      "content": "Add music to your video (optional). YouTube has a vast library of music you can use in your video short. However, if you add music to a clip, you can only shoot 15 seconds of video. Use the following steps to add music to your video: Tap Add Music at the top of the screen. Type the name of a song or artist in the search bar at the top. Tap a song you want to use. Tap the blue arrow icon to the left."
    },
    {
      "title": "Adjust where the music starts (optional).",
      "content": "Adjust where the music starts (optional). Since you can shoot no more than 15 seconds of video when you add music, you may need to adjust where the music starts. You can start the song from the beginning or you can use a specific verse or chorus of a song. Use the following steps to adjust the music: Tap Adjust to the left. Tap and drag the audio clip at the bottom of the screen to where you want it to start. Tap Done ."
    },
    {
      "title": "Set a timer to start filming.",
      "content": "Set a timer to start filming. In some cases, you may need to get in position before you start filming. The countdown timer not only gives you a set time before it starts filming, but it also lets you set how long you want to film. Use the following steps to set a countdown timer. Tap the icon that resembles a clock in the sidebar to the right. Tap 3s , 10s , or 20s to set how long you want the countdown to be. Tap and drag the blue line to however many seconds you want to be able to film. Tap Start ."
    },
    {
      "title": "Tap the red \"record\" button to start filming.",
      "content": "Tap the red \"record\" button to start filming. Tap the large red button at the bottom of the screen to start filming. Tap the red square \"stop\" button to stop filming. Alternatively, you can tap and hold the red \"record\" button to start filming and release it when you want to stop filming. The red line at the top of the screen indicates how much of the time you have used. If the line isn't completely full, you can add more clips to what you have already recorded. If you are not happy with the last clip you have recorded, tap the reverse arrow pointing to the left next to the record button to undo the previously recorded clip. You can zoom by tapping and dragging the red record button upwards, or by placing your fingers on the screen and spreading them apart."
    },
    {
      "title": "Tap .",
      "content": "Tap . When you are finished recording all the clips you want to record, tap the white icon with a checkmark to proceed to the editing process. It's in the lower-left corner."
    },
    {
      "title": "Add Music.",
      "content": "Add Music. In addition to adding music during the filming process, you can also add music after you finish recording. You can only use 15 seconds of a song. Also be aware that the audio from the music will replace the audio from your video short. Use the following steps to add music to your clip: Tap Music at the bottom-left corner of the screen. Type the name of a song or artist in the search bar at the top. Tap a song you want to use. Tap the blue arrow icon to the left."
    },
    {
      "title": "Adjust where the music starts.",
      "content": "Adjust where the music starts. Since you can only use 15 seconds of music in your video, you may need to adjust where the music starts. You can start the music from the beginning or use a specific verse or chorus. Use the following steps to adjust the music: Tap Adjust at the bottom of the screen. Tap and drag the audio clip at the bottom to where you want it to start. Tap Done ."
    },
    {
      "title": "Add text to your clip.",
      "content": "Add text to your clip. You can add text captions to your video to make them more fun. Use the following steps to add text to your clip: Tap Text at the bottom of the screen or tap the center of the screen. Type your text using the on-screen keyboard. Tap one of the colored circles at the bottom to select the text color. Tap and drag the slider dot to the left to adjust the size of the text. Tap the box with the \"A\" in the upper-left corner to select a text box style. Tap the icon with four lines in the upper-left corner to select the text alignment (i.g. left, right, or center). Tap the box at the top-center of the screen to select the text font. Tap Done . Tap and drag the text to where you want it to appear."
    },
    {
      "title": "Adjust the duration of the text.",
      "content": "Adjust the duration of the text. You can adjust when the text appears and disappears in the video short. Use the following steps to adjust the duration of the text: Tap Timeline at the bottom of the screen. Tap and drag the grey bar on the right side of a text bar at the bottom to indicate where you want the text box to begin in the video. Tap and drag the grey bar on the left side of a text bar at the bottom to indicate where you want the text box to stop in the video. Tap the 'Play' triangle to preview the video. Tap Done ."
    },
    {
      "title": "Tap Next.",
      "content": "Tap Next . When you are finished adding text and music, tap Next in the upper-right corner to proceed to the upload process."
    },
    {
      "title": "Type a title for the short.",
      "content": "Type a title for the short. Use the bar below \"Title\" to create a title for the video."
    },
    {
      "title": "Select a visibility setting.",
      "content": "Select a visibility setting. To select a visibility setting, tap the box below the title and then tap one of the three privacy settings. The privacy settings are \"Public,\" \"Private,\" and \"Unlisted.\" You can also schedule a time to upload it. To schedule a time to upload the video, tap Schedule at the bottom and tap the box with the date and time. Use the calendar to schedule a date and time for the video to be published. Scheduled videos can only be published as \"Public.\""
    },
    {
      "title": "Select if the video is made for kids or not.",
      "content": "Select if the video is made for kids or not. Tap the box that has an icon with two people. Then tap Yes, it's made for kids if the video is made for kids. Tap No, it's not made for kids to indicate that the video is not made for kids. Additionally, you can set an age restriction. To do so, tap \" Age restriction (advanced) \" at the bottom and then tap \" Yes, restrict my video to viewers over 18 \" or tap \" No, don't restrict my video to viewers over 18 \". It is recommended that you read more about YouTube's policies about content made for children to learn how to comply with Children's Online Privacy Protection Act."
    },
    {
      "title": "Tap Upload.",
      "content": "Tap Upload . It's the blue button in the upper-right corner. This uploads your video to YouTube."
    }
  ]
}