{
  "url": "https://www.wikihow.com/Sign-Up-for-PlayStation-Network",
  "title": "Creating a PSN Account: A Step-by-Step Guide",
  "steps": [
    {
      "title": "Click “Add User” on the PS5 home screen and hit “Get Started.”",
      "content": "Click “Add User” on the PS5 home screen and hit “Get Started.” If you’re already logged into another user profile, log out and click “Add User.” After clicking “Get Started,” read the user agreement and click “I agree” and “Confirm” to continue setting up your account. [1] X Research source If you already have a PSN account on your PS4, you don’t have to create a new account. Simply log in with the same email and password as you would on your other console."
    },
    {
      "title": "Select “Create an Account” and fill out the required information.",
      "content": "Select “Create an Account” and fill out the required information. Over the next few pages, input the required personal information to create your account. This includes information like your country/region, language preferences, and date of birth. Follow the on-screen prompts to complete these steps, hitting “Next” after each screen. [2] X Research source You must be at least 18 years old to create a PlayStation Network account. Note that you cannot change your country/region later. PlayStation may use your birthday for security purposes, so make sure you input it correctly."
    },
    {
      "title": "Enter your email, password, name, and location.",
      "content": "Enter your email, password, name, and location. Enter a valid email address that is not already being used for a PlayStation Network account. Create and confirm a password, then click “Next.” Enter your first and last name, then your postal code, city, and state or province. [3] X Research source Note that your password must be at least 8 characters long with at least 2 letters, 2 numbers, and 2 special characters. Your name and location will not be visible to other players, though your name will be shown beneath your avatar on the PS5 console. When you input your name, it will also ask if you’d like to receive notifications from Sony and PlayStation, so make your selections before moving to the next screen."
    },
    {
      "title": "Choose an avatar and Online ID.",
      "content": "Choose an avatar and Online ID. Your avatar will be visible to other players on the PlayStation Network and on the home screen on your console. Your Online ID is the username that is visible to other players. Make up your own or choose one of the suggestions on screen. It’s advised not to include personal information, like your real name. [4] X Research source"
    },
    {
      "title": "Adjust your privacy settings and data usage.",
      "content": "Adjust your privacy settings and data usage. The following screen allows you to choose a privacy profile with preselected privacy settings, or select “Customize Settings” to choose your own. These settings allow you to choose what information other PSN players can see about your profile and how they can interact with you. Then, choose what data Sony is allowed to collect and whether you want to receive personal ads and recommendations based on your data. [5] X Research source For example, your privacy settings include things like who can see your real name and avatar within games, in search results, etc. Sony retains certain usage data to fix bugs and improve services. Select “Confirm and Continue” to allow them to collect different types of data, or choose “Limited Data Only” to allow them to only collect necessary data. Sony states that your data will always be protected. [6] X Research source PlayStation gives you the option of seeing personalized ads and purchase recommendations based on your data. Select either “Disable and Continue” or “Enable and Continue” based on your preferences for both options. [7] X Research source"
    },
    {
      "title": "Agree to the Terms of Service and Privacy Policy.",
      "content": "Agree to the Terms of Service and Privacy Policy. On the next page, read through the Terms of Service and User Agreement, Privacy Policy, and Software Product License Agreement. If you agree to the terms and want to continue, check the “I Agree” box, then hit “Confirm.” [8] X Research source"
    },
    {
      "title": "Verify your email address.",
      "content": "Verify your email address. Sony will then send a confirmation email to the email address you provided earlier. Follow the instructions provided in the email to confirm your account. Once PlayStation detects that the email has been verified, it will automatically proceed to the next step. [9] X Research source If your PS5 doesn’t move on to the next screen after you verify your email, select “My Email is Verified” to continue."
    },
    {
      "title": "Choose security settings for your account.",
      "content": "Choose security settings for your account. The next screen will ask if you want to require a passcode to log into your account from the PlayStation 5, as well as if you’d like to require a password at checkout on the PlayStation Store. Make your decisions, then click “OK.” You’ll then be asked if you want to set up 2-Step Verifcation or add a phone number. Once you make your selections, your account is ready to use! If you want an extra layer of security for your PSN account, set up 2-Step Verification with text messages or an authenticator app, then follow the provided instructions. If you don’t want to add 2-Step Verification, hit “Do This Later.” [10] X Research source If you choose to add your mobile number, it will only be used for security purposes. Type your phone number and click “Add,” or hit “Do This Later” if you’re not interested."
    },
    {
      "title": "Click “New User” and “Create a User” on the PS4 home screen.",
      "content": "Click “New User” and “Create a User” on the PS4 home screen. Activate the console and controller and select “New User.” Even if you already have a profile, this is the easiest way to create a PlayStation Network account. Then select “Create a User,” hit “Accept” on the User Agreement screen, and click “Next” to pull up the PlayStation Network screen. [11] X Research source If the console is already signed into an account, sign out by holding the PS button on the controller and choosing Log out on the “Power” tab."
    },
    {
      "title": "Click “New to PlayStation Network?",
      "content": "Click “New to PlayStation Network? Create an Account.” After clicking this button, follow the on-screen instructions to provide your location information, email address, and a unique password. Move through each step of the process by clicking “Next.” [12] X Research source"
    },
    {
      "title": "Choose an avatar and an Online ID.",
      "content": "Choose an avatar and an Online ID. Your Online ID is the username other users will see when interacting with you online. Since this is public, it’s best not to include any identifying information, like your real name. This page is also where you provide your real name for identification reasons, though you can choose whether or not to share this information publicly. [13] X Research source If you can’t think of an Online ID, PlayStation typically offers several randomized suggestions to choose from. PlayStation offers a wide range of avatars to choose from, so select one from your favorite video game or whatever best suits your personality."
    },
    {
      "title": "Adjust your privacy settings.",
      "content": "Adjust your privacy settings. The next few screens allow you to change your privacy settings for various options, like who can see your real name or send you messages. Read through these carefully and select from “Anyone,” “Friends of Friends,” “Friends Only,” or “No One” for each activity. [14] X Research source"
    },
    {
      "title": "Agree to the Terms of Service and verify your email.",
      "content": "Agree to the Terms of Service and verify your email. Read through the Terms of Service and User Agreement and hit “Accept” to create your account. Sony will then send you an email address to confirm the account. Follow the instructions to verify, and your PSN account is ready to use. [15] X Research source After verifying your email, you may be prompted to set up 2-Step Verification, join PlayStation Plus, and/or activate the system as your primary PS4. Fill these pages out or skip them based on your preferences. Note that in order to make purchases on the PlayStation store , a payment method must be linked to your PSN account."
    },
    {
      "title": "Visit PlayStation’s website and click “Create PSN Account.”",
      "content": "Visit PlayStation’s website and click “Create PSN Account.” Navigate to the PlayStation Network page on the PlayStation website. Scroll down slightly to find the “Create PSN Account” button. You’ll then be taken to a screen that says “Create Account,” where you’ll click another button that says “Create.” [16] X Research source"
    },
    {
      "title": "Fill out your location information and birth date.",
      "content": "Fill out your location information and birth date. Once you click “Create,” you’ll be asked to select your country/region, state or province, and language. PlayStation uses your location to verify your identity when you contact them, and it is not visible to other users. Click “Next” when you’re done, then enter your date of birth. Double check that you enter the correct birthdate, as it may be used for security purposes later on. [17] X Research source Note that to make a PlayStation Network account, you must be at least 18 years old."
    },
    {
      "title": "Input your email address and create a password.",
      "content": "Input your email address and create a password. Type in the email address you want to use for the account, and make sure it isn’t already used for another PSN account. Choose a secure password, preferably one that you haven’t used on other websites. [18] X Research source"
    },
    {
      "title": "Confirm your settings on the Personalized Content page.",
      "content": "Confirm your settings on the Personalized Content page. The Personalized Content page will explain how PlayStation wants to use your data to provide personalized ads and purchase recommendations. Opt in or out of these settings and hit “confirm.” [19] X Research source"
    },
    {
      "title": "Agree to the Terms of Service and Privacy Policy.",
      "content": "Agree to the Terms of Service and Privacy Policy. After choosing your content settings, the website will ask if you’d like to receive promotional content from PlayStation and Sony and provide links to the Terms of Service and User Agreement, Privacy Policy, Community Code of Conduct, and Software Product License Agreement. Read through these, then click “Agree and Create Account.” [20] X Research source"
    },
    {
      "title": "Verify your email address.",
      "content": "Verify your email address. Once you agree to the terms, Sony will send a confirmation email to the email address you provided. Click the link provided in the email to verify your PlayStation Network account. The page should refresh so you can continue setting up your account. [21] X Research source"
    },
    {
      "title": "Choose your Online ID and input your name.",
      "content": "Choose your Online ID and input your name. Your Online ID is the username other PSN users will see when interacting with you online. It’s recommended not to use your real name or identifying information. Choose your own ID or select one from the suggestions. Then, provide your real first and last name. This is for identification purposes and will not be seen by other users. [22] X Research source At this point, your account has successfully been created. Feel free to explore your profile and fill out additional information, like a payment method. A linked payment method is necessary to purchase items from the PS Store."
    },
    {
      "title": "Can I make a PlayStation Network account on PS3?",
      "content": "Can I make a PlayStation Network account on PS3? No, as of 2021, users are no longer able to create a new PlayStation Network account on the PlayStation 3. If you’d like to create an account to use on your PS3, you must create it on a web browser, then log in on your console. [23] X Research source"
    },
    {
      "title": "What if it says my email is already in use?",
      "content": "What if it says my email is already in use? If you think you’ve already created a PSN account with that email, try resetting your password to see if you can access it. Otherwise, contact PlayStation so they can verify the email account. If you have another email address, it may be easier to create a new account with it. [24] X Research source"
    },
    {
      "title": "What if I’m not old enough to make an account?",
      "content": "What if I’m not old enough to make an account? If you’re not yet 18, an adult will have to create an account following one of the methods above, then add a child account. To do this on the website, go to “Account Management”, select “Family Management”, click “Set Up Now” and “Add a Child.” Follow the on-screen prompts to complete the process. [25] X Research source To add a child user on the PS5, click “Add User” to create an account like you normally would, enter the child’s birthdate, then follow the on-screen instructions to set up parental controls. On the PS4, sign into the adult’s account, then go to Settings > Parental Controls/Family Management > Family Management. Choose “Set Up Now,” then “Create User.” Follow the on-screen prompts to complete the child’s profile."
    },
    {
      "title": "How do I delete my PlayStation Network account?",
      "content": "How do I delete my PlayStation Network account? To delete your PSN account, contact Sony directly through PlayStation customer support . Provide your account ID and associated email. Note that once your account is deleted, you won’t be able to reuse the account name, and you’ll lose access to any associated purchases, subscriptions, and leftover funds in your wallet. [26] X Research source"
    },
    {
      "title": "How do I change the email address on my PSN account?",
      "content": "How do I change the email address on my PSN account? On PS5, go to Settings > User and Accounts > Account > Sign-in ID, then enter your new email and hit save. On PS4, go to Settings > Account Management > Account Information > Sign-in ID, then enter your password, input your new email, and hit confirm. On PlayStation’s website, go to Account Management > Security > Edit, then set your new email and hit save. [27] X Research source"
    },
    {
      "title": "Do I have to have a PlayStation Network account?",
      "content": "Do I have to have a PlayStation Network account? No, if you have physical copies of your PlayStation games, you don’t technically need a PlayStation Network account. However, an account is required to access PlayStation’s online services, so if you don’t create one, you’ll have limited access to features. [28] X Research source"
    }
  ]
}