{
  "url": "https://www.wikihow.com/Sign-a-Sympathy-Card",
  "title": "What to Write In a Sympathy Card: For Friends, Family, Coworkers, & More",
  "steps": [
    {
      "title": "Sign off your sympathy card with something simple like “love” or “sincerely.”",
      "content": "Sign off your sympathy card with something simple like “love” or “sincerely.” Your sign-off should offer comfort and support while also speaking to your relationship with the recipient. Signing your sympathy card with “love,” for example, may not be appropriate if you don’t have a close relationship. Here are some examples of how to close a sympathy card: [1] X Research source Wishing you peace, You’re in our thoughts, Thinking of you, I’m here for you, Our sincere sympathy, With caring thoughts, With loving memories, With love, With deepest sympathy, With heartfelt condolences, With heartfelt sympathy and love, With warmest regards and deepest condolences, With sincere thoughts and prayers, With comforting wishes and unwavering support,"
    },
    {
      "title": "Express condolences to a colleague with a professional yet caring message.",
      "content": "Express condolences to a colleague with a professional yet caring message. Unless you and your coworker are close friends outside of work, you should write a sympathy card that’s empathetic but somewhat formal in tone. For example: [2] X Research source Wishing you peace and strength as you cope with this loss. Our team is here to support you during this challenging time. We are holding you close in our thoughts and extend our heartfelt sympathy to you and your family. Sending you strength and solace during this difficult time. Please know that your colleagues are here to support you with unwavering compassion and understanding. With care and sympathy from your colleagues—may beloved memories bring you peace and comfort during this difficult time. Our team’s hearts go out to you during this time of loss. We are sending you comforting wishes during this time of sorrow."
    },
    {
      "title": "Write a message that offers community support to your neighbor.",
      "content": "Write a message that offers community support to your neighbor. You may know your neighbors very well or not at all—either way, your sympathy message to them should express how the community of your neighborhood is there to help in the aftermath of their loss. For example: [3] X Research source Holding you close in our thoughts and sending gentle wishes of comfort and consolation from across the street. Your loss is deeply felt by the neighborhood, and we want to extend our heartfelt sympathy and support during this time of grief. Your loss is deeply felt by the neighborhood, and we want to extend our heartfelt sympathy and support during this time of grief. May cherished memories bring you warmth and moments of comfort during this time of sorrow. With care and unwavering sympathy from your neighbors. We share in your sorrow and offer comforting wishes from down the street. Wishing you peace and gentle moments of solace."
    },
    {
      "title": "Send loving and personal condolences to a close friend.",
      "content": "Send loving and personal condolences to a close friend. If someone near and dear to you has lost a loved one, reassure them of your unwavering friendship and pledge to be there for them whenever they need you. For example: [4] X Research source I am here with open arms whenever you need a friend. Sending love and comforting thoughts as you grieve your dear [deceased’s name]. May cherished memories bring you warmth and comfort during this difficult time. You are not alone, and I am here to provide comfort and support. In this time of sorrow, know that you are not alone. I am here with open arms and unwavering support whenever you need a friend. With caring thoughts and heartfelt sympathy, I am here to provide comfort and solace whenever you need. You are in my thoughts and not alone. You are cherished and supported, and I offer unwavering compassion and warmth during this profoundly challenging time. Sending love and understanding from your friend."
    },
    {
      "title": "Loss of a parent",
      "content": "Loss of a parent Losing a mother, father, or other parental figure is an extremely affecting experience that no one ever feels prepared for. Write a sympathy card that expresses your sincere condolences and mention some specific traits of that individual. For example: [5] X Research source Your mother was one of the kindest people I’ve ever met, and I know that she was a terrific mom to you. You have my deepest sympathies and warmest wishes during this time. When I think of your father, I think of a strong, intelligent man who would’ve done anything to protect his children and ensure their happiness. It takes a special person to be a mom, but it takes the very best of moms to bring up an amazing person like you. Clearly, your mom was one of the best. Sending you all the love. Sending my deepest sympathies to you for the passing of your father. He was a wonderful man, and there will never be another one quite like him. I was so sorry to learn of your step-parent’s passing. They were a wonderful individual who will be truly missed by so many—myself included."
    },
    {
      "title": "Loss of a grandparent",
      "content": "Loss of a grandparent Losing a grandparent is often the first time that a person faces loss and grief in their lifetime. To help your loved one or colleague navigate this difficult time, lend your support through a sympathy card that empathizes with the shock and pain they are surely feeling. For example: [6] X Research source I was so saddened to hear about your grandfather’s passing. He was a beautiful man with a generous soul; he also made me belly laugh like no one else. My thoughts are with you. I’m thinking of you during this difficult time. Your grandma was an incredible woman, and I feel honored to have known her during her long and beautiful life. I’m sending you love as you grieve the loss of your grandpa. I’ll never forget [deceased’s name] and his passionate spirit — he was a force of nature and a true inspiration. I am so sorry to hear about the passing of your beloved granny. I know that this will be an incredibly difficult time for you—please know that our family is here to help you with anything you need. Sending all my love after the passing of your grandparent. Their spirit will live on in your family’s memories, and I know that you will continue to honor their beautiful soul in the coming days, weeks, and years."
    },
    {
      "title": "Loss of a spouse",
      "content": "Loss of a spouse If someone in your life has lost the person they swore to spend the rest of their life with, they probably need all the support they can get during this time of immense heartbreak. While their grieving process will likely last for years, writing a tasteful and empathetic sympathy card will show them that you’ll be there for them throughout that time. For example: [7] X Research source I’m so sorry to hear of your husband’s passing. I know what a beautiful love story the two of you had, and I can’t even begin to understand how difficult this must be for you. I’m so sorry for your loss. Your husband was much more than just a coworker; he was a true friend and a magnificent person, and I will miss him dearly. You are in my thoughts at this terrible time. Your wife was a wonderful woman, and her impact on the world will never be forgotten. The world was a better place with your wife in it, and I will never forget her zest for life and exuberant laughter. My heart goes out to you and your family on the loss of your dear partner. [Deceased’s name] was one of the most giving and compassionate souls I have ever met, and I’ll never forget them."
    },
    {
      "title": "Loss of a sibling",
      "content": "Loss of a sibling Siblings share childhoods, memories, and an unbreakable bond. The passing of a sister or brother can leave the surviving sibling in a world of heartbreak. They need your support and empathy during this time, and you can offer them your love and condolences through writing a well-crafted sympathy letter . For example: [8] X Research source Your brother was the strongest person I ever met, in every possible way. I will miss him every day, and I am sending my deepest condolences to you and your family. She was your sister, and she was my ‘sister from another mister.’ My heart is broken at the loss of [deceased’s name]; sending my most sincere thoughts and prayers to your family at this time. I know you and your brother were close, and you are in my thoughts at this challenging time. He was a wonderful man with a heart of gold, and there will never be another quite like him. Only those who are lucky enough to have a sister can understand the bond between them and the pain of losing them. My heart is broken for your loss, and I wish I could carry some of the pain on your behalf. [Deceased’s name] was never one to talk about their emotions, but I know that they loved you more than anything, and I hope that can bring you some sliver of comfort during this devastating time."
    },
    {
      "title": "Loss of a child",
      "content": "Loss of a child Losing a child or a baby—whether before or after birth—is one of the most tragic losses that any person can experience. No one expects their child to pass before them, and when they do, it can seem impossible to know what to say. Here are a few ideas: [9] X Research source The example set by his parents certainly allowed him to shine brightly in his world. He was so fortunate to have lived a life experiencing the love and support of two wonderful caregivers. I am truly sorry for your loss. The loss of a child is absolutely heartbreaking, and my heart aches for you and your family. [Deceased’s name] was an exceptionally lovely child, and she will be terribly missed by so many. Words can’t begin to express the amount of sorrow and pain I feel for the loss of your son. [Deceased’s name] will be greatly missed and I’m sending you all the love I have during this devastating time. My heart breaks for you as you grieve for the baby you never got to meet. I know how excited you both were to meet [deceased’s name], and I’m so, so sorry for your loss. You and your baby are in my thoughts as you process this loss. Please know that each new life, no matter how brief, forever changes the world. I hope you find comfort in that thought."
    },
    {
      "title": "Write a message expressing the heartbreak that stems from the loss of a friend.",
      "content": "Write a message expressing the heartbreak that stems from the loss of a friend. Friends are just like family members for many people, and their loss can be just as devastating. Express your condolences in a message that empathizes with the sorrow felt by the recipient after the loss of their dear friend. For example: I’m sharing in your grief as you fondly remember [deceased’s name]. I know [deceased’s name] was your favorite person, and I can’t imagine what you are going through right now as you grieve their passing. I’m so sorry for your loss. I cannot imagine how much you will miss [deceased’s name]; I know how close you were and all that you meant to each other. You have all my love and support during this time. My heart goes out to you for the loss of your dear friend, [deceased’s name]. I can remember the two of you swapping jokes on the school bus like it was yesterday, and I hope the memories of your happy times together will carry you through your grief. I don’t need to tell you how wonderful [deceased’s name] was, but know that their beauty and compassion were felt by all. Please accept my deepest condolences on the loss of your friend."
    },
    {
      "title": "Write a heartfelt message to acknowledge the death of a pet.",
      "content": "Write a heartfelt message to acknowledge the death of a pet. The same sincere sentiments should be expressed when you're writing a sympathy card to someone whose dog, cat, or other cherished animal companion has died. Try to include a few specific details about the furry friend when writing a sympathy card for a pet. For example: [10] X Research source It is so hard to say goodbye to such a special companion. My thoughts are with you. Some pets are friends. Many are family. [Deceased’s name] was definitely family, and they were also a loyal and friendly dog. Please know that you are in my thoughts and prayers. Pets never really leave us – they live on in our hearts and our fond memories. Pets leave pawprints on our hearts, and your family member will be deeply missed. You are in our thoughts as you mourn the loss of your beloved pet. You are in my thoughts following the sad passing of [deceased’s name]. Please know that she touched many lives with her warm nature and sweet meow. She will be fur-ever missed."
    },
    {
      "title": "Send a group condolences message from your business or a group of families.",
      "content": "Send a group condolences message from your business or a group of families. A group message may be appropriate if you own a business and one of your clients has lost a loved one. Or, you may team up with other families to send a sympathy card if a shared community member—such as a teacher or postal worker—is grieving. Here are some examples of such messages: From all of us at the office, we extend our deepest condolences and unwavering support to you and your family during this time of loss. With care and unwavering sympathy from your clients and friends, may cherished memories bring you warmth and comfort during this time of grief. In this time of sorrow, our company is here to support you and your loved ones. You have our deepest well wishes, and we are here to help you in any way we can. Our families are joined in grief and stand by you during this difficult time. May beloved memories bring you moments of comfort and peace. Offering unwavering strength and comfort during this profoundly challenging time as our families share in your sorrow. You are not alone, and our community is here to provide solace and understanding whenever you need it."
    },
    {
      "title": "Start with an appropriate salutation.",
      "content": "Start with an appropriate salutation. The most common way to begin a sympathy card note is to start with the word \"Dear.\" You could also write \"Dearest\" or simply start with the person's name. Avoid starting with \"Hi\" or another casual salutation - err on the side of being a little formal. [11] X Research source Address the person to whom you're writing as you'd normally address that person. If you're writing to a teacher you normally call \"Ms. Frankel,\" address her that way in the card. If you're writing to someone you know well, using the person's first name is appropriate. If the card is meant to express sympathy to an entire family and not just one person, write each person's name out. If you don't know the names of everyone in the family, you could write \"Sarah and family.\""
    },
    {
      "title": "Express your sincere condolences about the person’s passing.",
      "content": "Express your sincere condolences about the person’s passing. Say how sorry you are to hear that the deceased has passed away, and if you knew the person, mention their name. If you didn't know the person, you can refer to them as \"your mother\" or \"your grandfather,\" and so on. For example: I am so sorry that Miles has passed away after his long battle with cancer. I am deeply grieved to hear of Margaret's passing. Words can't express how sorry I am that June is gone."
    },
    {
      "title": "Personalize your sympathy message.",
      "content": "Personalize your sympathy message. Cater your message to the preferences and personality of the recipient to powerfully connect with them and help them feel your support during this time of grief. While you can start with a generic note, add in personal details as much as possible to give a more reassuring and meaningful message. [12] X Research source"
    },
    {
      "title": "Share specific memories you have of the deceased.",
      "content": "Share specific memories you have of the deceased. If you knew the person who passed away, write how much you will miss them, and share a few things you remember. Demonstrating a shared grief will make the recipient of the card feel less lonely during their time of loss. Briefly mention something special about the person or how much that person meant to you. [13] X Research source"
    },
    {
      "title": "Share a meaningful quote that’s relevant to the situation.",
      "content": "Share a meaningful quote that’s relevant to the situation. Especially if you’re unsure what to write, find a quote that resonates with who the deceased was or how the recipient of your card may be feeling. For example: [14] X Research source “What we have once enjoyed we can never lose. All that we love deeply becomes a part of us.” – Helen Keller “A great soul serves everyone all the time. A great soul never dies. It brings us together again and again.” – Maya Angelou “As a well-spent day brings happy sleep, so a life well spent brings happy death.” – Leonardo da Vinci “Sorrow is so easy to express and yet so hard to tell.” – Joni Mitchell “There is no pain so great as the memory of joy in present grief.” – Aeschylus"
    },
    {
      "title": "Offer specific support or assistance to the recipient of your card.",
      "content": "Offer specific support or assistance to the recipient of your card. Writing a few words that invite the person to call you or reach out to you if you are needed will probably be welcome. Be sure you're ready to follow up on it if the person indeed reaches out for help. [15] X Research source"
    },
    {
      "title": "If you don't know the person well, consider keeping it brief.",
      "content": "If you don't know the person well, consider keeping it brief. Ending your note after briefly expressing sympathy is perfectly acceptable for a note you're sending to someone you don't know very well. Include a phrase that is conventional and has no chance of being misconstrued. Examples of brief condolence messages include: Thinking of you in sympathy. Please accept my condolences. You are in my thoughts. Our thoughts and prayers are with you. We are thinking of you. I'm praying for you during this difficult time. We will honor the memory of [deceased] during this time of sorrow. [Deceased’s name] will always be in our thoughts."
    },
    {
      "title": "Loss of a brother",
      "content": "Loss of a brother Dear Victor, I was very sad to hear the news about your brother Hector. I know how close the two of you were. If there's anything I can do to help, please don't hesitate to call. Warmest condolences, Alicia"
    },
    {
      "title": "Loss of a father",
      "content": "Loss of a father Dear Molly, I am so sorry to hear that your father passed away. Though I never got the chance to meet him, I know how much everyone at St. Paul's admired his volunteer work. How wonderful that you were able to spend so much time with him in his final days. Please call me if you need anything or just want to talk. I'm thinking of you. With sympathy, Jim"
    },
    {
      "title": "Loss of a daughter",
      "content": "Loss of a daughter Dear Mary Ann and Juan, It's impossible to express how sorry we are that your beautiful daughter has passed away after her struggle. What a brave, joyful child she was. We will miss her every day. Our thoughts and prayers are with you and your two sons. If there is anything we can do, please call us. With love, Hayden and Dwayne"
    },
    {
      "title": "Loss of a wife",
      "content": "Loss of a wife Dear Steve, We were incredibly sorry to hear that Joan passed away. She was a kind, caring friend who always made time for other people, and we loved her. Her students will remember her as a devoted teacher and wonderful role model. If you need help running errands, keeping the house in order, or anything at all, please don't hesitate to call us. We love you and are thinking of you. With deepest sympathy, Marcia and Luke."
    },
    {
      "title": "Loss of a dog",
      "content": "Loss of a dog Dear Lucia, I'm very sorry that Shadow has passed away. I remember when you first adopted him 13 years ago. What a wonderful companion he was. Our walks won't be the same without him trotting by your side. With love and hugs, Jules"
    },
    {
      "title": "Why should you send a sympathy card?",
      "content": "Why should you send a sympathy card? You should always send a sympathy card when someone passes—not an email, a text message, or a direct message over social media. A quick message doesn’t show that you’ve taken the time to pick out a card, write a thoughtful message, and post it to its recipient. Plus, sympathy cards can be displayed in the home for weeks and re-read over time for a continued physical reminder of the sender’s love and support. If you do express your condolences quickly through text or email for the sake of speed, send a physical card as well."
    },
    {
      "title": "When should you send your condolences?",
      "content": "When should you send your condolences? Send the sympathy card as soon as you hear about the loss. You may have the opportunity to speak with the person face to face, but sending a card to let them know they are in your thoughts is thoughtful and respectful. [16] X Research source If some time has passed and you just found out about the death, it’s still better to send your card later rather than never."
    },
    {
      "title": "What should you not include in a sympathy card?",
      "content": "What should you not include in a sympathy card? Avoid mentioning anything related to how the person died. Don’t offer any advice or tell the recipient any sort of timeline for when they will feel better. Stay away from any clichéd and empty phrases, such as: [17] X Research source “I know how you feel” “This happened for a reason” “They’re no longer suffering” “Time heals all wounds” “He was too young” “They’re in a better place now” “You’ll meet someone else” “At least they lived a long life” “It could be worse” “It will get easier in time” “It’s time for you to move on”"
    },
    {
      "title": "Are sympathy cards appropriate in any religious faith?",
      "content": "Are sympathy cards appropriate in any religious faith? Some religious faiths may appreciate a topical prayer or religious verse in your sympathy card message. If the card recipient is Christian, for example, you might include a Bible verse like “Blessed are those who mourn, for they shall be comforted.” – Matthew 5:4. [18] X Research source Similarly, a note of condolence to someone who practices Islam could include a blessing like “May Allah give him/her an easy and pleasant journey to eternal peace.” If you send a sympathy message to a Jehovah’s Witness, be careful not to choose a card that includes Christian imagery or messaging—such as a cross or Bible verse. [19] X Research source Avoid overly religious content unless the person shares your beliefs or you are knowledgeable about their religion and what they’d consider appropriate. [20] X Research source The person receiving the card may not have the same beliefs, and you don't want to push yours on them at such a delicate time. If you’re unsure, stick to universally accepted expressions of love and sympathy rather than those specific to your religion. [21] X Research source"
    }
  ]
}