{
  "url": "https://www.wikihow.com/Peel-an-Onion",
  "title": "How to Peel an Onion",
  "steps": [
    {
      "title": "Optionally, wash the onion.",
      "content": "Optionally, wash the onion. This is a good idea if you notice dirt or anything else unappealing on the outside of the onion. You'll be removing the peel, so it isn't absolutely necessary, but it won't hurt anything."
    },
    {
      "title": "Trim off the root section.",
      "content": "Trim off the root section. Every onion will have a small clump of dirty-looking roots at the bottom. Hold the onion sideways on a clean cutting board and press a sharp knife down to carefully shave off the \"button\" of roots. Try to cut only the roots. Cutting into the \"meat\" of the onion will release more of the chemicals that cause tears. [1] X Trustworthy Source Library of Congress Official library of the U.S. and main research institution for Congress and the American public Go to source Since the layers of the onion are held together at the bottom, this will also make it harder keep a grip on them later."
    },
    {
      "title": "Cut the onion into two halves.",
      "content": "Cut the onion into two halves. Place your knife at the top (uncut) end of the onion. Slice the onion in two with a single clean rocking motion. You'll be left with two even-sized halves. Immediately turn these onions cut side-down. This prevents tear-causing chemicals from being released into the air."
    },
    {
      "title": "Trim the tops off of each half.",
      "content": "Trim the tops off of each half. With their cut sides facing down, drag the knife across the tips of each onion half. You'll now have two onion halves trimmed at either end."
    },
    {
      "title": "Peel the skin off.",
      "content": "Peel the skin off. Lift the skin at the top end of the onion (the end you just trimmed) and carefully peel it down towards the bottom (root) end. If it breaks or tears, discard the torn-off piece of peel, grab another section, and start peeling again. Repeat for both halves. You can use the tip of your knife to get the peel started if you're having trouble."
    },
    {
      "title": "Chop, dice, or julienne your onion as needed.",
      "content": "Chop, dice, or julienne your onion as needed. At this point, your onion is peeled and ready to use. Leave both halves laying cut side-down until you start working with them to prevent tear-causing chemicals from being released into the air. An onion can still make you cry after you've peeled it, so consult the section below if you'd like to learn a few helpful strategies for reducing your tears both during and after the peeling process."
    },
    {
      "title": "Soak the onion in water right after peeling.",
      "content": "Soak the onion in water right after peeling. This is an especially-convenient way to prevent tears — every kitchen has a sink. As soon as you remove the peel from both onion halves, transfer them to a bowl of water. Let them soak briefly. 15 minutes is generally plenty of time. [2] X Research source Note that this can make your onion taste a little more mild. This works because the water draws out the sulfur-containing compounds that cause the stinging effect in your eyes. [3] X Research source"
    },
    {
      "title": "Freeze the onion.",
      "content": "Freeze the onion. Believe it or not, simply getting your onion cold can be enough to greatly reduce your tears. Before you peel the onion, stick it in the freezer for about 15 minutes. After waiting, pull it out, peel it, and chop it immediately (you may want to set an alarm so you don't forget about it). Any tears should minor. This is thought to work because chemical reactions generally proceed much more slowly at low temperatures. Cooling the onion slows the rate at which the tear-causing compounds are released once it's cut open."
    },
    {
      "title": "Peel and cut the onion under a vent.",
      "content": "Peel and cut the onion under a vent. If your kitchen has an oven vent, simply turn it on, move your cutting board over an unlit burner, and start peeling the onion here. The fan in the vent will pull the tear-causing chemicals away from your eyes and safely outside. Higher fan settings tend to reduce tears the most."
    },
    {
      "title": "Slice the onion next to an open flame.",
      "content": "Slice the onion next to an open flame. Even small flames (like the ones on candles) can help, but a large stove burner is generally best. [4] X Research source The closer you can get the onion to the flame while you're peeling and cutting, the better. However, be sure to stay at least an inch or two from it to avoid burning the onion (or yourself). This trick works because the flame pulls in air as fuel while it burns. If it's next to your onion, some of this air will be the air that contains the tear-causing chemicals. [5] X Research source"
    },
    {
      "title": "Peel and cut the onion under running water.",
      "content": "Peel and cut the onion under running water. This works the same way as the \"bowl of water\" trick did above. Be careful when working with a knife here — it's easy to lose your grip on a wet, slippery onion, so cuts are a concern. Setting a non-slip cutting board in the sink can help somewhat."
    },
    {
      "title": "Wear goggles while you work.",
      "content": "Wear goggles while you work. An easy way to keep yourself from crying while peeling and chopping onions is to simply put a barrier between your eyes and the tear-causing chemicals. Basically any airtight pair of goggles will work — goggles meant for swimming will work fine, as will (clean) chemistry lab goggles."
    },
    {
      "title": "Practice peeling and chopping quickly.",
      "content": "Practice peeling and chopping quickly. The more time a cut onion is allowed to sit out, the more tear-causing chemicals it will be able to release into the air. Expert chefs can often prevent tears while working with onions by simply finishing before the chemicals have a chance to make it to their eyes. If you can get quick enough, you can use this method to avoid tears even when none of the others are available. This is a matter of long-term practice. Your speed will gradually increase over time as you continue to work with onions. Don't push yourself to rush, especially when you're working with a sharp knife — mistakes can be painful."
    }
  ]
}