{
  "url": "https://www.wikihow.com/Sign-over-Your-Rights-As-a-Father",
  "title": "How to Sign over Your Rights As a Father",
  "steps": [
    {
      "title": "Research your state's law.",
      "content": "Research your state's law. Not all states allow voluntary termination of parental rights, but those that do have legal standards you must meet for the judge to grant your petition. Typically the request for termination must be for good cause, and the court must find that termination of your parental rights would be in the best interests of the child. Both of these standards allow for a lot of judicial discretion in making the final determination. [2] X Research source In some states such as Kentucky, you cannot voluntarily relinquish your parental rights. The only way to sign over your rights as a father in these states would be by consenting to the adoption of the child by another person such as a step-parent. States such as Missouri may only approve a voluntary termination of parental rights if at least one of the factors is present that is evaluated in cases of involuntary terminations. These factors include the child's emotional ties to you, the extent to which you've maintained regular contact and visitation with the child, and how committed or interested you are in the child's upbringing and welfare."
    },
    {
      "title": "Talk to your child's mother.",
      "content": "Talk to your child's mother. In many states you cannot voluntarily terminate your parental rights without the other parent's consent. [3] X Research source Keep in mind that even if both parents agree that termination of your parental rights would be in the child's best interests, this doesn't guarantee that the court will terminate your rights. The judge also must find that there is good cause for the termination. [4] X Research source"
    },
    {
      "title": "Consider hiring an attorney.",
      "content": "Consider hiring an attorney. Because court approvals of voluntary termination of parental rights is rare, you may find an attorney is best able to protect your interests and achieve your desired result. Given that much of the court's decision hinges on judicial discretion, an attorney familiar with the local judges and your area's court procedures can give you an advantage in pursuing your goal of signing over your rights as a father."
    },
    {
      "title": "Gather your evidence.",
      "content": "Gather your evidence. If you have any documentation or other evidence supporting your case, you should make copies so you will have it available when you draft your petition to the court. The court needs evidence that you have good cause to have your parental rights terminated. A desire to end your child support or financial obligation to the child or to have your ex-spouse out of your life typically are not considered good cause by any court. [5] X Research source Courts are reluctant to terminate parental rights if that will leave the child with only one parent. However, if another adult such as a step-parent wants to adopt the child and assume responsibility, this generally is considered a good cause for you to relinquish your parental rights – particularly if you have not played a substantial role in the child's life. [6] X Research source"
    },
    {
      "title": "Find the appropriate forms.",
      "content": "Find the appropriate forms. Some states have forms you can print and fill out if you want to petition the court to relinquish your parental rights. [7] X Research source Depending on the jurisdiction, the form may be referred to as a \"petition\" or as a \"consent form.\" The difference is merely one of your position relative to the court: If you file a petition, you are asking the court to do something (in this case, terminate your parental rights), whereas if you file a consent form you are consenting to the court's termination of your parental rights, typically for an independent reason such as the presence of another person who wants to adopt the child. The form you have to fill out may depend on how old the child is and the circumstances under which you're relinquishing your parental rights. For example, California has a separate form you can fill out to relinquish your parental rights if you are served with notice of an action to determine paternity that names you as a possible father of the child. [8] X Research source"
    },
    {
      "title": "Fill out your forms.",
      "content": "Fill out your forms. You must include information about yourself, your child, your relationship with your child, and the reason you want to sign over your rights as a father. If your court does not have approved forms, you will have to create your own petition following the state and local rules of court. You may be able to find a previous petition for termination of parental rights filed in the same court that you can use as a guide to ensure your formatting is correct. After you complete the form, you typically have to sign it in the presence of a notary public. [9] X Research source Make sure you make at least two copies of your signed forms before you file them – one copy for your own records and one for the child's mother – since the court will keep the originals when you file them."
    },
    {
      "title": "File your form in the correct court.",
      "content": "File your form in the correct court. Typically the court that decided your divorce or child custody case is the court that would have jurisdiction over your case. In some states such as Missouri, termination of parental rights is handled by the juvenile court in the same jurisdiction. The clerk of your local court will be able to tell you which court you should use. When you file your paperwork, the clerk will assign a case number, stamp your documents \"filed\" with the date, and typically also will set a date for your hearing. [10] X Research source Keep in mind that if you are currently paying child support, you remain obligated to pay that child support even after you've filed your paperwork requesting termination of your parental rights. You may stop paying child support only if the judge grants your request after a hearing. [11] X Research source When you file your paperwork, you probably will have to pay a filing fee. Although the fees vary among jurisdictions, you can generally expect to pay between $200 and $500. [12] X Research source In some jurisdictions, there's no filing fee for termination of parental rights if your petition is filed in conjunction with an adoption. If you are charged fees and cannot afford them, you may be eligible for a fee waiver. Ask the clerk for an application and answer the questions about your income and assets. If the judge grants your application, you won't have to pay any court fees."
    },
    {
      "title": "Have the other parent served.",
      "content": "Have the other parent served. Before your case can proceed, the other parent must have notice that you are asking the court to terminate your parental rights. Keep in mind that you can't serve the papers yourself. For a small fee, you can get a sheriff's deputy or a private process serving company to serve the papers by hand. You also may be able to use certified mail. You may have to file proof with the court that the other parent has been served. Ask the clerk if you need to file your proof beforehand, or if you can simply bring it with you to your hearing."
    },
    {
      "title": "Appear on your court date.",
      "content": "Appear on your court date. If you don't show up on your court date, the judge will dismiss your petition. Keep in mind that there may be more than one court hearing, particularly if the judge decides an attorney needs to be appointed to represent the child and prepare a report detailing the child's best interests. Organize your documents ahead of time, and prepare a short statement about your case that you can read to the judge. If you plan to call any witnesses, check with the clerk to find out if you need to let the court know about these witnesses in advance. Dress in clean, conservative clothing. Although you don't need to wear a suit, you should dress as if you're going to a job interview or other significant event. Try to arrive early so you have time to go through courthouse security and find your courtroom."
    },
    {
      "title": "Present your case.",
      "content": "Present your case. You must explain to the court that you want to sign over your rights as a father, and explain why you want this to occur. As part of your case, you must not only demonstrate that you have good cause for seeking termination, but also that termination of your parental rights would be in the best interests of the child. [13] X Research source Speak clearly and loudly when it's your turn to speak, but don't talk over or interrupt anyone else when they are speaking."
    },
    {
      "title": "Answer any questions.",
      "content": "Answer any questions. Once you've presented your case, the judge may have additional questions for you about yourself or your relationship with your child. In particular, the judge may want to ensure that your judgment is not impaired, and that you made the decision to have your parental rights terminated of your own volition, rather than being pushed into it by someone else. [14] X Research source"
    },
    {
      "title": "Receive the judge's order.",
      "content": "Receive the judge's order. If the judge grants your petition and terminates your parental rights, your parent-child relationship will end along with all of your parental rights and responsibilities toward your child. [15] X Research source Signing over your rights as a father also means you will lose any custody or visitation rights you have over the child, as well as the right to provide any input regarding the child's religion, education, or medical care. [16] X Research source Once your parental rights are terminated, you also have no say over who adopts the child in the future. [17] X Research source"
    }
  ]
}