{
  "url": "https://www.wikihow.com/Paint-a-Bathroom",
  "title": "How to Paint a Bathroom",
  "steps": [
    {
      "title": "Choose a mildew-resistant, satin or semi-gloss paint.",
      "content": "Choose a mildew-resistant, satin or semi-gloss paint. Bathroom paint faces a lot of wear and tear, so go with a water-repellent, easy-to-maintain product. Since they're more durable and easier to clean than matte or flat options, go with a satin or semi-gloss paint for your bathroom. [1] X Expert Source Patrick Coye Painting Specialist Expert Interview. 22 July 2020. The only downside is they highlight imperfections, so it's important to prep surfaces before you paint. [2] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source As for color, look for a shade that complements the hallway or room next to the bathroom. Lighter shades are usually good choices for smaller spaces. Paint manufacturer websites often allow you to upload a photo of your room to play with wall colors. It's also wise to purchase samples and test shades in the actual space. Keep in mind glossier finishes reflect more light, which makes colors appear brighter."
    },
    {
      "title": "Remove wall hangings, bath products, and electrical covers.",
      "content": "Remove wall hangings, bath products, and electrical covers. Clear out any wall art, shelves, window treatments, and towel racks that could get in the way of your paint job. Unscrew electrical outlet and wall switch covers, then replace the screws so you don’t misplace them. [3] X Research source If you’re also painting a sink vanity or cabinet, remove the knobs and other hardware."
    },
    {
      "title": "Take out the toilet",
      "content": "Take out the toilet if you can't fit a roller or paint tool behind it. If there’s a little space between the toilet and the wall, you can simply purchase a thin sponge stick that’s specially designed to paint and clean behind a toilet. Find one online or at a home improvement store. Otherwise, turn off the water supply, flush the toilet to drain it, then begin removing it. [4] X Research source If the tank is removable, loosen the nuts that secure its mounting bolts to the bowl. If the bowl still blocks the wall, unscrew the floor bolts at the base, then lift the bowl out of place."
    },
    {
      "title": "Clean the walls and trim so your paint job lasts longer.",
      "content": "Clean the walls and trim so your paint job lasts longer. Paint can’t adhere to surfaces covered with dust, grime, or mildew, so clean the walls with a mix of 1 part bleach and 3 parts warm water. Soak a sponge or mildly abrasive pad in the solution, wring it out, and scrub all surfaces you plan on painting. It might seem like a lot of work, but you wouldn’t want your new paint to start peeling in only a matter of months. [5] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Alternatively, dilute concentrated TSP (trisodium phosphate) cleaner with water as directed. TSP is a stronger cleaner, so you won't have to scrub as hard. Wear rubber gloves when using TSP or a bleach solution. If your bathroom has a window, open it; if not, turn on the exhaust fan."
    },
    {
      "title": "Place drop cloths on the floor and over bath fixtures.",
      "content": "Place drop cloths on the floor and over bath fixtures. Tuck or tape the edges of the drop cloths against the baseboard to protect the floor. Canvas drop cloths are best for the floor, but you can tape sheets of plastic over the sink, tub, and other fixtures. [6] X Research source Canvas is heavier and less slippery than plastic. It also absorbs paint, which makes it less likely that you’ll step in a spill and accidentally make tracks around your house. If you left any fixtures on the wall, like toilet paper holders or towel, put painter's tape around them to protect them from paint splatters. [7] X Expert Source Patrick Coye Painting Specialist Expert Interview. 22 July 2020."
    },
    {
      "title": "Patch any holes or cracks with filler or a drywall compound.",
      "content": "Patch any holes or cracks with filler or a drywall compound. Shine a bright light over the walls and trim to spot areas that need patching. Use a putty knife to patch problem areas, then scrape off excess compound to create a smooth surface. [8] X Research source Use wood filler to repair any holes or nicks in the baseboard, chair rails, or trim around windows and doors. Allow the filler or drywall compound to dry for 6 to 24 hours (check the instructions for specific drying times). Then sand the surface with fine, 320-grit sandpaper until it’s smooth and level with the surrounding surface. [9] X Research source You may also want to recaulk around your tub or base trim before you paint the bathroom. [10] X Expert Source Patrick Coye Painting Specialist Expert Interview. 22 July 2020."
    },
    {
      "title": "Start with the ceiling, if you're painting it.",
      "content": "Start with the ceiling, if you're painting it. If you’re painting the ceiling, use a brush to cut in around the edges where it meets the walls. Finish the job by using a roller on the end of an extension pole. For best results, use a quality, plush roller cover, which will allow you to get as much paint onto the ceiling in the shortest amount of time. [11] X Research source Dip the roller into the paint tray's well, then roll up the tray to remove excess. Start in a corner, and roll in a continuous stroke. Try to keep the roller wet, and overlap the painted edges and your previous strokes by about 3 in (7.6 cm). If you’re using a latex paint, you should be able to apply a second coat after 4 hours. For even coverage, apply the first coat in one direction, or north to south, and the second in the other direction, or east to west. Cutting in is basically coloring within the lines; it's when you hug a tight edge with the brush."
    },
    {
      "title": "Paint the trim with a brush before painting the walls.",
      "content": "Paint the trim with a brush before painting the walls. Use an angled brush to paint baseboards and other trim. Paint them first so you don’t have to tape off the walls, which is more difficult than taping off trim. Depending on the type of paint you’re using, apply a second coat after 4 to 24 hours. [13] X Research source Semi-gloss is a good finish for bathroom trim. Baseboards, chair rails, and window and door trim collect dust and grime, and semi-gloss is more durable and easier to clean than flat finishes. [14] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source White is conventional for trim, but you could experiment with color, especially if your walls are white. Grays, blues, and black are trendy choices if you want your trim to make a statement. [15] X Research source"
    },
    {
      "title": "Tape off",
      "content": "Tape off the trim if you’re not confident about cutting in along edges. If you have a steady, practiced hand, you don’t need to tape around every edge. However, if you want to stay on the safe side, allow the trim to dry for 24 hours, then lay down painter’s tape at the edges where it meets walls. Additionally, tape around your bath fixtures and wall tile. Even if you have a steady hand, you should still tape horizontal trim, such as baseboards, chair rails, and horizontal runs of tile. Paint will inevitably spatter on horizontal trim, but vertical trim, such as window and door trim, is less vulnerable."
    },
    {
      "title": "Prime the walls if you're making a major color change or patching holes.",
      "content": "Prime the walls if you're making a major color change or patching holes. If your current paint is in good shape, you made no repairs, and you’re not making a drastic color change, you can skip priming or use a self-priming paint. However, if your bathroom is currently dark and your new color is light, it’s wise to prime. Use the same techniques for primer as you would for the top coats: cut the edges with a brush first, then use a roller to paint broader areas. [16] X Research source You should also spot-prime any areas you patched. Drywall compound is porous and will absorb paint, resulting in noticeable dull spots. Priming your repairs will help keep them inconspicuous. [17] X Research source"
    },
    {
      "title": "Use an angled brush to paint the edges around a wall.",
      "content": "Use an angled brush to paint the edges around a wall. Dip the brush in paint, tap off excess, and cut in about 1 ⁄ 2 in (1.3 cm) from the edge of the wall. Then turn back and bring the tip of the brush to the trim, taking care not to paint beyond the edge of the wall. To prevent unsightly lines, paint along the edges of 1 wall, then finish the rest of the wall with a roller before moving on to the next one. Complete 1 wall at a time so you're always painting over wet paint. Painting over dried or tacky paint leads to noticeable lap lines. If you paint the trim all around the room, it’ll dry by the time you pass the roller over the rest of the wall. Go with a satin or semigloss finish for bathroom wall paint. These finishes strike a balance between disguising imperfections and durability. [18] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Cover large areas with a paint roller.",
      "content": "Cover large areas with a paint roller. Fill the well of a paint tray, dip the roller, and roll it over the tray to get rid of excess paint. Start at a corner, and run the roller over the wall in a vertical stroke along the full height of the wall. With each pass, overlap both the previous stroke you made with the roller and the paint along the wall’s edges. When you’ve finished the first wall, proceed to the next. Paint the edges with a brush, and use a roller for the larger areas. Dip the roller in paint frequently and avoid letting the roller dry out. You don’t want it dripping with paint, but keeping it wet helps prevent lap lines."
    },
    {
      "title": "Let the first coat dry for at least 4 hours, or as directed.",
      "content": "Let the first coat dry for at least 4 hours, or as directed. Allow the recommended drying time before applying another coat. For latex paint, you should be able to apply a second in 4 hours; oil-based paints may require 24 hours. [19] X Research source Check your product's instructions if you're not sure about the recommended drying time."
    },
    {
      "title": "Apply a second coat for best results.",
      "content": "Apply a second coat for best results. Use the same techniques to apply the second coat of paint. Paint around the edges of a wall with a brush, then use a paint roller to finish the wall. [20] X Research source Remember to paint 1 wall at a time to avoid painting over dried paint."
    },
    {
      "title": "Wait 24 hours to replace wall hangings, curtains, and socket covers.",
      "content": "Wait 24 hours to replace wall hangings, curtains, and socket covers. After the paint has dried completely, cut along the edge of the taped trim with a utility knife, then pull back the tape. Fold up and store the drop cloths, remove the coverings from the bath fixtures, and replace any wall art, curtains, electrical covers, and towel racks. [21] X Research source If necessary, replace the toilet and turn on the water supply. If you pull up the tape without cutting it, you might peel off dried paint from the wall that’s bonded with the tape."
    }
  ]
}