{
  "url": "https://www.wikihow.com/Serve-a-Full-Course-Meal",
  "title": "How to Serve a Full Course Meal",
  "steps": [
    {
      "title": "Plan your menu in advance.",
      "content": "Plan your menu in advance. Multiple course dinners take a lot of time to cook. If you plan ahead, you will leave yourself plenty of time to cook every course. When creating your menu, choose one or two items that will be prepared fresh and cook the others in advance. Soups, pasta sauces, gravies, and bread can be cooked and stored the day before the meal. Choose recipes that use different cooking equipment. For example, if all of your recipes are made in the oven, you may run out of time to cook everything."
    },
    {
      "title": "Set the table",
      "content": "Set the table before you start cooking. This will give you lots of time to prepare the food without feeling rushed when your guests arrive. The way you set your table will depend on how many courses you planned. For example: Set down a placemat and a charger plate at every chair. The charger plate will stay in place until the dessert course is served. Place the dessert utensils horizontally above the charger plate. Set the utensils in the order they will be used. Silverware that will be used first goes on the outside, and those that will be used last are next to the plate. Goblets and wine glasses are set near the top-right corner of the placemat. Desserts plates and coffee cups are usually brought in after the other courses are finished. [1] X Research source"
    },
    {
      "title": "Keep prepared food at the right temperature.",
      "content": "Keep prepared food at the right temperature. Cold dishes such as salads or gazpachos can be covered in plastic wrap and stored in your refrigerator. Warm dishes can be covered with foil and placed in the oven to stay warm. Make sure your oven is set to the lowest temperature. Most ovens have a “warm” setting. This setting will keep your food warm without burning it."
    },
    {
      "title": "Consider hiring help.",
      "content": "Consider hiring help. Catering a full meal can be expensive. However, if you hire someone else to cook, clean, and serve the meal, you will be able to enjoy your evening with your guests instead of slaving in the kitchen. [2] X Research source If you can’t afford to hire full service catering, ask local catering companies if they have service-only packages. You will cook the food but waiters will come to your house and serve the meal."
    },
    {
      "title": "Decide how many courses you want to serve.",
      "content": "Decide how many courses you want to serve. A full course meal can have anywhere from three to twenty courses. However, most modern hosts and hostesses limit themselves to six courses. [3] X Research source If you do too many, you might not have time to prepare everything properly or spend time with your guests. Remember that each course will require its own plate or bowl and silverware. Make sure you have enough of each to serve your courses. A three-course meal usually has an appetizer, a main course, and a dessert. A four course meal might include a soup, an appetizer, a main course, and dessert. A five course meal can include a soup, an appetizer, a salad, a main course, and a dessert. A six course meal usually includes an amuse-bouche, a soup, an appetizer, a salad, a main course, and a dessert. A seven course meal includes an amuse-bouche, a soup, an appetizer, a salad, a main course, a dessert, and a mignardise with coffee or tea."
    },
    {
      "title": "Serve an amuse-bouche.",
      "content": "Serve an amuse-bouche. This course is usually presented before the soup or appetizer and is served on small appetizer plates. These dishes consist of one or two savory bites of food that can give a hint of flavors to come. [4] X Research source Popular amuse-bouche dishes include: Creamy deviled eggs Herb-infused cream cheese spread onto a slice of toasted crostini Slices of roasted peaches on small wedges of creamy brie"
    },
    {
      "title": "Present the soup course.",
      "content": "Present the soup course. This course is usually served before the appetizer or in place of an appetizer. This dish is served in a small soup bowl and eaten with a rounded soup spoon. Your soup choice may vary by season. For example: In the summer, consider serving a cold gazpacho soup. In the winter, serve a warm, creamy lobster bisque."
    },
    {
      "title": "Distribute the appetizer.",
      "content": "Distribute the appetizer. This course is referred to as the entrée in many parts of Europe as it introduces the main courses in a meal. These dishes are usually served on small appetizer plates and feature small cuts of meat, seasonal vegetables, starches, and sauces. [5] X Research source For example: Serve a few pieces of fried ravioli with a side of marinara sauce. Bake button mushrooms stuffed with breadcrumbs and seasoning. Give your guests a few miniature crab cakes with tartar sauce. [6] X Research source"
    },
    {
      "title": "Serve the salad course.",
      "content": "Serve the salad course. In some parts of Europe, the salad course is served after the main course. However, it is becoming more and more common to serve the salad first. [7] X Research source Salad courses usually feature seasonal vegetables with a flavorful dressing. Common choices include: Fresh, simple garden salads with lettuce, tomatoes, onions, and a tart vinaigrette Tangy Greek salads with olives, lettuce, red onions, and feta cheese A sweet and sour Southeast Asian papaya salad"
    },
    {
      "title": "Present the main course.",
      "content": "Present the main course. The main course is served on a dinner plate. This course is usually a combination of baked, fried, or roasted protein with a seasonal vegetable side dish and bread. [8] X Research source If you serve bread, make sure to provide a bread dish and butter knife in the top-left corner of the placemat. Main courses include: Hearty pasta dishes topped with chicken, fish, or veal cutlets A thick slice of tender roast with potatoes, carrots, and onions Grilled pork tenderloin medallions with a side of creamed spinach"
    },
    {
      "title": "Serve the dessert.",
      "content": "Serve the dessert. The dessert course is served on a small appetizer plate with a dedicated dessert spoon or fork. This course usually consists of a slice of cake, pie, or other sweet dish and a glass of dessert wine. However, some people prefer to serve cheese and crackers instead of dessert. [9] X Research source For example: Make a cheese board with a variety of soft and hard cheeses, such as brie, gouda, and blue cheese. Serve the cheese board with warm, toasted crackers. [10] X Research source Serve a small slice of velvety chocolate cake and a glass of sweet port wine. Give your guests a tart, sweet lemon bar and a glass of dry white wine."
    },
    {
      "title": "Serve some mignardises.",
      "content": "Serve some mignardises. A mignardise is a tiny, bite-sized dessert that is served with tea or coffee. [11] X Research source This course signifies the end of the meal. Common mignardises include: Small decorated squares of cake, called Petit Fours Miniature buttery madeleine biscuits Bite-sized French macarons"
    },
    {
      "title": "Clear each plate away before serving another.",
      "content": "Clear each plate away before serving another. Once all of the guests are finished eating, gather up the dirty dishes, leaving the charger and any unused silverware. [12] X Research source Serve the next course immediately by placing the prepared dish directly onto the charger. Plan for a little bit of prep time in the kitchen between courses to arrange the food on the plates. The charger stays on the table until dessert is served."
    },
    {
      "title": "Consider how drinks will be served.",
      "content": "Consider how drinks will be served. When serving a full course meal, most hosts or hostesses provide goblets of water and a glass of wine. If you have room, consider serving drinks family-style by placing pitchers of water and bottles of wine on the table, allowing the guests to serve themselves. This will save you time and let you relax during each course. If you don’t want pitchers or wine bottles on the table, you will need to refill guests’ glasses yourself. If you have hired wait staff, they will refill the guests’ drinks for you."
    },
    {
      "title": "Clear all of the dishes before dessert.",
      "content": "Clear all of the dishes before dessert. Once the dessert course is ready, clear away any bread plates, main course plates, silverware, and the charger. Leave the dessert silverware at the top of the placemat on the table. [13] X Research source This will give your guests room to stretch out while they enjoy dessert and digest their meal. Some people also like to offer dessert wine, port, brandy, or scotch during this course."
    }
  ]
}