{
  "url": "https://www.wikihow.com/Prune-Japanese-Maple-Trees",
  "title": "How to Prune Japanese Maple Trees",
  "steps": [
    {
      "title": "Prune your Japanese maple in winter, if possible.",
      "content": "Prune your Japanese maple in winter, if possible. [2] X Expert Source Monique Capanelli Plant Specialist Expert Interview. 22 September 2020. Although you can prune your tree almost any time of the year, the best time to prune is during the last frost of the year. [3] X Expert Source Monique Capanelli Plant Specialist Expert Interview. 22 September 2020. Avoid pruning the tree in weather hotter than 80 °F (27 °C), especially if the tree is located in full sun. Removing too much foliage can make the tree vulnerable to sun scald. [4] X Research source Light pruning can be done at any point in the year except spring. The spring is when the maple has the most sap. Try pruning your maple about twice a year—once in winter and once in summer, preferably. [5] X Research source"
    },
    {
      "title": "Avoid low-energy times, like early spring and late fall.",
      "content": "Avoid low-energy times, like early spring and late fall. Your maple is weakest when its leaves just emerge in the spring and as they drop in the fall. Try not to prune the tree during these times, as this is when it's most prone to damage. [6] X Research source Both low-energy times last about 2 weeks. Spring as a whole is the least-preferred time to prune your tree, but you can prune it safely so long as the leaves are finished growing in. [7] X Research source"
    },
    {
      "title": "Make minimal cuts if your tree is ill.",
      "content": "Make minimal cuts if your tree is ill. If your tree has a disease or damage, wait for it to heal before pruning it extensively. Limit yourself to small cuts or deadwood removal, as even light pruning exerts some of your tree's energy. [8] X Research source Use your best judgment about your tree's health. If it seems severely ill or weak, nurture the plant to better health before pruning. If you’re pruning a diseased tree, sanitize your cutting tools so you don’t spread the contamination."
    },
    {
      "title": "Avoid pruning plants younger than 15 years, if possible.",
      "content": "Avoid pruning plants younger than 15 years, if possible. Although you can prune young Japanese maples, cutting back branches can give them an awkward, skinny shape. Beyond cutting back dead or diseased branches, try not to prune your tree until it is at least 15 years old. [9] X Research source"
    },
    {
      "title": "Never remove more than 1/3 of the tree's foliage.",
      "content": "Never remove more than 1/3 of the tree's foliage. Removing any more can significantly wound the tree and make it prone to disease. Limit yourself to around 1/3 of the foliage at a time. You can always remove more after the tree's had time to heal. Start by pruning less than you think you'll need to cut to prevent over pruning. Cut back more if you see the need."
    },
    {
      "title": "Use pruning shears and loppers to shape your tree.",
      "content": "Use pruning shears and loppers to shape your tree. Household scissors tend to make blunt cuts that take longer to heal. Prune your tree with gardening shears for small branches and loppers for larger branches to make precise, clean cuts. You can purchase pruning tools at most garden centers or plant nurseries. For especially thick or hard-to-reach branches, you can also use pruning saws or long-reach pruners."
    },
    {
      "title": "Clean and sharpen your tools before pruning.",
      "content": "Clean and sharpen your tools before pruning. Blunt, dirty pruning tools can injure your plant and potentially spread diseases. Disinfect and sharpen your tools regularly to keep them in good condition."
    },
    {
      "title": "Put on protective eyewear and gardening gloves to prevent injuries.",
      "content": "Put on protective eyewear and gardening gloves to prevent injuries. Cutting back foliage can leave your eyes and skin prone to injuries. Wear safety glasses or goggles to prevent scratches or serious accidents while you prune. [10] X Research source Wearing long-sleeved shirts and pants can also protect your skin from scratches. Pruning can take up to several hours. Put on sunscreen to protect your skin against the sun's UV rays."
    },
    {
      "title": "Work from the bottom up and inside out.",
      "content": "Work from the bottom up and inside out. Begin pruning at the very bottom of the maple near the center, then make your way to the outside of the tree. Slowly work from the bottom to the top, starting from the center and outwards each time. [11] X Research source"
    },
    {
      "title": "Cut away any deadwood or jutting branches.",
      "content": "Cut away any deadwood or jutting branches. Inspect your tree for dead or unhealthy branches, as well as branches that jut out and ruin your plant's shape. Clip away these branches with pruning shears or loppers, depending on the branch size. Choose pruning shears for smaller branches and loppers for larger ones. Deadwood branches are leafless in warm seasons and, throughout the year, grey with a brittle texture. [12] X Research source"
    },
    {
      "title": "Thin the tree of excess branches.",
      "content": "Thin the tree of excess branches. Your tree's branches will grow best if they have space to grow. To reduce the tree's bulk, use your shears or loppers to remove any overlapping branches. Thin the tree as evenly as possible to give it a balanced look. [13] X Research source Overlapping branches can rub against each other, which chips their bark and leaves them prone to diseases or pests."
    },
    {
      "title": "Direct any new areas of growth at the bud.",
      "content": "Direct any new areas of growth at the bud. Tree buds often become dominant branches later on. If you notice any buds, press them between your fingers and point them in the direction you want them to grow. You can also rub away any buds with your fingernails if they are in an awkward area or may contribute to overgrowth later on. [14] X Research source Maple leaf buds are small and red, and they jut out from the tree branches."
    },
    {
      "title": "Replant the maple",
      "content": "Replant the maple if it gets too big. If the Japanese maple gets too large for its area, do not cut down the top or excessively prune the sides. Instead, hire a landscaper to transplant your tree somewhere it will have room to grow. [15] X Research source Do not transplant trees with a trunk diameter larger than 2 inches (5.1 cm) by yourself. Unless your maple tree is young, you will need to hire a landscaper. [16] X Research source"
    },
    {
      "title": "Prune laceleaf Japanese maples in the same way as upright maples first.",
      "content": "Prune laceleaf Japanese maples in the same way as upright maples first. Although laceleaf maples need some additional care, the beginning steps are the same as upright maples. Prune away deadwood and overlapping branches while directing any buds you see in the right direction."
    },
    {
      "title": "Separate the branch layers.",
      "content": "Separate the branch layers. Laceleaf maples have complex, twisting branches. Separate the different layers by cutting away any branches that have grown above or below their main branch and have twisted into other main branches. [17] X Research source You can also remove any branches that curve at awkward angles to improve the tree's cosmetic look."
    },
    {
      "title": "Create a veiled top.",
      "content": "Create a veiled top. The top layer of the laceleaf maple should form a protective top that resembles a shell. Avoid cutting the maple tree's top—focus instead on the center and sides to retain the tree's natural shape."
    },
    {
      "title": "Replant the maple",
      "content": "Replant the maple if it gets too big. If the laceleaf Japanese maple gets too large for its area, do not cut down the top or excessively prune the sides. Instead, hire a landscaper to transplant your tree somewhere it will have room to grow. [18] X Research source Do not transplant trees with a trunk diameter larger than 2 inches (5.1 cm) by yourself. Unless your maple tree is young, you will need to hire a landscaper. [19] X Research source"
    },
    {
      "title": "Prune bonsai Japanese maples year-round, but sparingly.",
      "content": "Prune bonsai Japanese maples year-round, but sparingly. Bonsai Japanese maples can be cut anytime during the year, but they take longer to heal after cuts. Unless you need to cut back dead or dying branches, limit your pruning to once a season. [20] X Research source The best time to prune bonsai Japanese maples is winter, its dormant season. [21] X Research source"
    },
    {
      "title": "Pinch back excessive branch growth.",
      "content": "Pinch back excessive branch growth. Inspect your bonsai's main branches for new growth, and limit each tree to 1-2 leaf pairs. Pinch away any additional growths to keep the branches healthy and balanced. [22] X Research source Because bonsai Japanese maples are small, you can pinch away leaves instead of pruning without damaging the tree."
    },
    {
      "title": "Spread cut paste over pruned areas.",
      "content": "Spread cut paste over pruned areas. Bonsai Japanese maples are especially prone to diseases after pruning. Apply tree cut paste over any areas that you trim or prune. This will help the bonsai heal faster and protect its wounds from diseases and parasites. [23] X Research source You can buy cut paste from many garden centers or plant nurseries."
    }
  ]
}