{
  "url": "https://www.wikihow.com/Plan-an-Escape-Room",
  "title": "How to Plan an Escape Room",
  "steps": [
    {
      "title": "Choose a room in your home in which to hold the game.",
      "content": "Choose a room in your home in which to hold the game. Pick a room that is large enough for the players to move around comfortably while they are looking for clues and working together. Also, make sure your props and clues will be able to fit. To make your game longer and more difficult, use two or more rooms that are next to each other and have guests \"unlock\" the doors between them as they progress through the game."
    },
    {
      "title": "Choose an interesting setting for the room to add to the story.",
      "content": "Choose an interesting setting for the room to add to the story. Choosing an interesting setting will help you come up with themed challenges. It will also make it easier for the escape room to feel like a complete experience. You could choose to place the room in Italy during the Renaissance or in New York during the roaring 1920s. If you want to have even more control over the setting, choose a time in the future where the possibilities are limitless!"
    },
    {
      "title": "Pick a theme that fits the setting.",
      "content": "Pick a theme that fits the setting. Think of a theme your guests would be interested and intrigued by. For instance try to pick a theme that resembles a book or movie the group already likes. Make sure you will able to purchase and find props and decorations that fit the theme you choose. For example, if the setting is based in England during the late 1800s, use a Sherlock Holmes theme. If your guests like horror movies and Halloween, choose a zombie or haunted house theme. You could also create a prison escape theme in almost any time-period you like!"
    },
    {
      "title": "Set a 30 minute time limit if this is your first escape room.",
      "content": "Set a 30 minute time limit if this is your first escape room. Aiming for 30 minutes will help keep you from being too overwhelmed or having to come up with too many challenges. This way, you can focus on making high-quality puzzles and keep your guests entertained throughout. If you have made several escape rooms, and your guests have completed a few in the past, lengthening the time past 30 minutes with more or harder puzzles will give your guests the challenge they need to stay interested."
    },
    {
      "title": "Create a storyline that fits the theme and setting.",
      "content": "Create a storyline that fits the theme and setting. A storyline will help ensure there's a purpose to the escape room. Maybe your players have to get out of the room in order to deliver top secret intel - or they might have to break into a room in order to successfully \"diffuse a bomb.\" Whatever the storyline, make sure it's easily digestible to the guests. It's important to note that some players don't really care for the story and just want to solve the puzzles. Try to choose broad themes so you don't limit the enjoyment of players that might like to play your puzzles but would be put off by the theme."
    },
    {
      "title": "Break the storyline up into digestible pieces.",
      "content": "Break the storyline up into digestible pieces. Whether your main storyline is simple or complex, you want to make sure each piece will be doable. Try writing one sentence for each part of the storyline to ensure it doesn't get too complicated. For example, for the beginning of a story you could write, \"The players wake up in a room. They see a big poster in front of them with letters and numbers. They solve the puzzle and find out they are in the year 3015.\""
    },
    {
      "title": "Make a flowchart of the storyline.",
      "content": "Make a flowchart of the storyline. Use sticky notes and a poster or a powerpoint presentation to outline what the players will be doing at each step of the story. Write your one-sentence descriptions on separate post-its, and organize them somewhere you can see. For example, if the players have to unlock a door in order to escape one room, decide how many clues and puzzles they have to solve along the way and how long they will take. If the players are supposed to find a key, you could require them to gather clues from around the room to spell out the key's location. If you're planning an exceptionally large escape room, or will have many guests, you could have a flowchart that forks at one point -- as long as everything comes together nicely at the end."
    },
    {
      "title": "Double check that each part of the story flows into the next one.",
      "content": "Double check that each part of the story flows into the next one. After the players solve each puzzle, make sure there are instructions or another clue left that leads them to the next piece of the story. If the players successfully unlock a box, place clues and information inside the box that will lead them to the next challenge and puzzle. Keep in mind the plot of the story, tying together the beginning, middle, climax, and resolution."
    },
    {
      "title": "Think of challenges the guests will encounter throughout the story.",
      "content": "Think of challenges the guests will encounter throughout the story. Challenges are parts of the story guests figure out along the way. If your guests are new to escape rooms, stick to only easier challenges. If you think they would like a more difficult escape room, think of harder more challenges. The number of challenges is usually irrelevant when compared to the difficulty. Make sure to create solvable puzzles. They shouldn't be too easy or too hard. Challenges for a zombie escape room could be to figure out who the first person was to become infected, what the cure for the zombies is, and finding the location of the cure. For a futuristic theme, you could require the players to determine what year they are in, how they got there, and how to get back to the present."
    },
    {
      "title": "Set up more or simultaneous challenges if you have a large group.",
      "content": "Set up more or simultaneous challenges if you have a large group. If you're creating an escape room for more than 6 people, consider breaking them into two teams, or setting up challenges that can be solved simultaneously. That way, everyone who is participating will be entertained. If you're designing an escape room for groups of kids, try to focus on easier challenges that flow into one another, with little to no downtime, or the little ones might get bored or zone out."
    },
    {
      "title": "Create a puzzle for each challenge in the storyline.",
      "content": "Create a puzzle for each challenge in the storyline. Make sure each challenge is solvable in the amount of time you're giving the players. Once they solve the challenge or puzzle, it should then lead them on to answer or unlock something. For example, if the challenge is to unlock a door, you could choose to have the players decrypt messages, open a combination lock, or search for items in odd places in order to find the key. If the players have to decode a message sent by the villain, they may need to find written clues in books, newspapers, and pictures."
    },
    {
      "title": "Use locks to guard information.",
      "content": "Use locks to guard information. Purchase padlocks, bike locks, or a small safe. Create a puzzle where the answer is the combination to open the lock. Once the lock is opened, make sure you provide the next clue. For example, you could hide the combination of the lock under a book. For a tricky challenge, put the key to the lock in a separate box they have to unlock first."
    },
    {
      "title": "Put items in plain sight that have hidden information.",
      "content": "Put items in plain sight that have hidden information. Write a code on the bottom of objects in the room that help players opening a lock or provide more information. You could place several dice through the room with numbers missing. The players would then try piecing together the missing numbers to open a lock. Open a newspaper and underline certain words to make a sentence the players must piece together."
    },
    {
      "title": "Create a cipher by providing players with something to unscramble.",
      "content": "Create a cipher by providing players with something to unscramble. Give players a list or sentence of words to have them match to a pattern. You could make an acrostic where the first letter of each word creates a sentence or name. Color code the words and match the colors to a pattern somewhere else in the room. Display a sentence where the number of letters in each word correspond to the numbers of a lock or safe."
    },
    {
      "title": "Choose props to make your escape room more authentic (optional).",
      "content": "Choose props to make your escape room more authentic (optional). Visit a crafts or thrift store to find decorations and costumes that fit your theme. Use candles to add to a historical or spooky theme. For a safer option, use electric or battery operated candles instead of real candles. Put glow sticks in clear containers around the room to create a futuristic vibe. Branches, rocks, and dirt can create the feeling of a forest or cave."
    },
    {
      "title": "Set the mood with music.",
      "content": "Set the mood with music. Look up playlists online that fit the setting of the room. Set out speakers or your cell phone so the players can hear the music. Keep the volume at an audible level but soft enough so the players can hear each other."
    },
    {
      "title": "Pick out costumes to help the players feel like part of the story (optional).",
      "content": "Pick out costumes to help the players feel like part of the story (optional). Help immerse your players in the story by giving them costumes that fit the theme. Keep in mind that even one or two pieces of a costume can go a long way! For a cheap option, get costumes from a thrift store or ask if you can borrow clothing items from friends."
    },
    {
      "title": "Set up the room with your props and decorations.",
      "content": "Set up the room with your props and decorations. Make sure your clues are set and ready for the players to find. Double check that your locks are locked, your keys are hidden, and your props are set for clues (where applicable). If you are using candles, make sure they are out of reach and won't get knocked over when the players are moving around."
    },
    {
      "title": "Do a run through of the game to make sure it works.",
      "content": "Do a run through of the game to make sure it works. Set up the room just like the players will see it and go through the challenges and puzzles. Check to see all of the clues and puzzles make sense and that they will lead the players through the story. You could also have someone else or two people run through the game to test how long it takes. After all, you already know the answers to all of the puzzles!"
    },
    {
      "title": "Explain the rules to the players.",
      "content": "Explain the rules to the players. Give a short speech at the beginning explaining the story and what they players are and are not allowed to do. You might also try printing the rules down on a sheet of paper so they have them with them for the duration of the game. For example, explain that the players are not allowed to use their phones for help. While you can't force anyone not to use their phones, it's best to set a ground rule that it would be cheating if they used it to help them solve a puzzle. Explain and point out pieces of furniture and other objects they should not lift or try to move."
    },
    {
      "title": "Choose how many hints the players are allowed to get.",
      "content": "Choose how many hints the players are allowed to get. Sometimes groups get stumped by a challenge or puzzle. Allow them 3 or more hints to help them along through the game. Be prepared to provide hints at any point in the game. Tell the players before they start how many hints they can use. Make your hints helpful but don't give the answer away. [1] X Research source If some or all of the players are children, allow them to have more than 3, or even unlimited, hints so that they don't get discouraged."
    },
    {
      "title": "Pick out a prize to give to the players if they complete the escape room.",
      "content": "Pick out a prize to give to the players if they complete the escape room. Choose a prize that will motivate the players to finish the escape room. Let them know before they start the escape room what they will get if they finish! For a cheap option, you could take a team photo with props and costumes and send the team digital or physical prints. If the players are adults, you could give them a cash prize or gift card."
    }
  ]
}