{
  "url": "https://www.wikihow.com/Peak-and-Tune-a-CB-Radio",
  "title": "How to Peak and Tune a CB Radio",
  "steps": [
    {
      "title": "Purchase the basic supplies.",
      "content": "Purchase the basic supplies. [1] X Research source Although CB radios are no longer in fashion, you can purchase one at most electronics hardware stores and truck stops. While a radio will be the most important part of your shopping trip, there are some other thing you'll want to look into picking up as well. The radio itself. Most CB radios are 4 Watts and under by default. A microphone should come with the radio package. [2] X Research source An antenna. The antenna is the most important part of your radio's setup. [3] X Research source Fibreglass antennae are often preferable because they are tunable. A SWR meter. A SWR meter will help you measure the radio's output. This is a vital part of tuning your antenna to the radio. Coaxial cables. A coaxial cable is needed to connect the antenna to the radio. Another cable may be needed if you're hooking it up to an SWR meter. Batteries. Many CB radios are battery powered (hand-held). When you purchase a CB radio, check what type of batteries it uses and purchase a supply of them."
    },
    {
      "title": "Hook up your SWR reader.",
      "content": "Hook up your SWR reader. A SWR (Standing Wave Radio) reader can be hooked up like an adaptor between the antenna and the radio itself. [4] X Research source Throughout your tunings, you'll want to check this meter periodically. Generally speaking, you'll want the SWR to read as low as possible. High ratings will seriously limit your radio's performance, and possibly risk even damaging it. Generally speaking, a SWR reading of 2.0:1 (or lower) across all channels is acceptable. [5] X Research source"
    },
    {
      "title": "Set up an antenna.",
      "content": "Set up an antenna. Antennae are typically very easy to mount on a car. You'll maximize your range if you put it up on the highest place possible. Most antennae are magnetically-based, which makes them a case of sticking it where you want. Once you mount the antenna, link the antenna to your radio with a coaxial cable. You can add a quick-release mount to attach the antenna onto the car with. This makes it a lot easier to attach and remove the antenna at will. [6] X Research source"
    },
    {
      "title": "Alter your antenna as needed.",
      "content": "Alter your antenna as needed. Tuning a CB radio means fixing the antenna. Sometimes, the antenna will need to be adjusted to get the optimal signal. Most fibreglass antennae have detachable segments at the top to allow for extensions, so antennae can be lengthened that way. Antennae can also be shorted by sawing the antenna down as needed. [7] X Research source If Channel 1 on your SWR is greater than Channel 40, it means your antenna is too short. Conversely, if Channel 40 is greater than 1, it means it's too long. When setting up the antenna, you'll want your SWR levels below 2.0. You'll also want Channels 1 and 40 to read identical to one another. [8] X Research source (Edit: Using an amplifier with a CB is HIGHLY ILLEGAL.)"
    },
    {
      "title": "Test your radio on a live Channel.",
      "content": "Test your radio on a live Channel. [9] X Research source First, check your SWR radio to ensure your Channels have equal output. From there, you can ensure your frequencies are accurate by giving a Channel a test-run."
    },
    {
      "title": "Refer to the manual.",
      "content": "Refer to the manual. Because models differ, the owner’s manual will help you identify parts for adjustments. Some suggestions to peak your radio are below, but only try them if you’re electronically adept and you have an older CB. If you're trying anything advanced with the CB radio, you should first make sure you know all of the basics. If your CB radio has been manufactured within the last few years, you won’t need to peak it. Newer models don’t have the drift and adjustment problems of older CBs. Any modification to newer models, such as producing higher wattage, usually puts the CB into illegal territory where the FCC is concerned."
    },
    {
      "title": "Find an open area.",
      "content": "Find an open area. [10] X Research source Drive your vehicle to a large open area, away from buildings and trees, to test your CB radio. Properly testing and tuning a radio should have as little signal noise around it as possible. Open areas also give CB radio the best possible range. Everyone must remain inside with the doors closed while you take readings. On the other hand, if you have a base CB unit, test it in place."
    },
    {
      "title": "Link up your SWR meter.",
      "content": "Link up your SWR meter. [11] X Research source A SWR meter is necessary to check the output of your radio. It can be linked up via coaxial cable via the antenna input."
    },
    {
      "title": "Maximize the modulation without distorting the voice.",
      "content": "Maximize the modulation without distorting the voice. The modulation should be adjustable via the body of the CB radio. Tweaking the modulation is a good way of maximizing power but you'll only want to up it to a certain degree. Make sure the sound of the radio isn't being distorted by the extent of your modulation."
    },
    {
      "title": "Adjust the squelch range.",
      "content": "Adjust the squelch range. Squelch refers to a background noise-cancelling function of a CB radio. Squelch can be adjusted via a knob on CB radios with the function included. Adjust the squelch to a point where the noise is minimized but the rest of your sound is relatively untouched. RF gain is a more modern alternative to squelch radio, and it serves roughly the same purpose. [12] X Research source"
    },
    {
      "title": "Take your radio to a shop for peaking.",
      "content": "Take your radio to a shop for peaking. Peaking the particulars of your CB radio are only really recommended if you have a lot of experience with radio equipment. Otherwise, it can save a lot of trouble to take it to a store. From there, a specialist can work out the kinks and get it up to its peak efficiency. Check the web for reviews of the store before giving them your radio. It has been reported that some radio stores will fall short when it comes to handling CB radios. [13] X Research source"
    },
    {
      "title": "Test your radio with another CB radio.",
      "content": "Test your radio with another CB radio. If you know someone else with a CB radio, you should enlist their help. Tune into the same channel as your friend, and try to have a conversation. From the other's person's responses, you should get a reasonable idea what your transmissions are like. From there, experiment with different ranges and channels. Ironically, having someone on the other line via cellphone and communicating that way can be helpful if you're still in the midst of troubleshooting your radio setup."
    },
    {
      "title": "Learn the CB codes and lingo.",
      "content": "Learn the CB codes and lingo. Once you get the hang of using your radio, you should \"peak\" your behaviour on the air. Even though CB is only used by a select group of people at this point, there's still a dynamic culture, complete with its own jargon and inside jokes. Be aware of CB \"trolls\" that occupy radio channels. They use the anonymity of radio to lash offensive slurs and rile people up for amusement. [14] X Research source Channel 9 is declared by the FCC as the official channel for emergencies. If you want to contact with anyone on an official basis, you should read up on some of the codes. They are sometimes specific to a certain region, so it may take specific researching on your part."
    },
    {
      "title": "Consider an alternative to upgrading your CB radio.",
      "content": "Consider an alternative to upgrading your CB radio. [15] X Research source Some modern radios are much stronger by default than CB. Internet radio is also available, and potentially transmits much further. It should also be mentioned that CB radio lost its popularity with the advent of cellphones. If you're needing to communicate for largely practical reasons, you should rely on a phone or the internet."
    }
  ]
}