{
  "url": "https://www.wikihow.com/Reset-a-Gateway-Laptop",
  "title": "Easy Ways to Reset a Gateway Laptop to Factory Settings: With & Without Password",
  "steps": [
    {
      "title": "Open Settings.",
      "content": "Open Settings. This is the most recommended method since you don't have to back up your files."
    },
    {
      "title": "Find \"System Recovery.\"",
      "content": "Find \"System Recovery.\" It's in different places based on your Windows version: Windows 11 - Go to Settings > System > Recovery > Reset this PC . Windows 10 and lower - You'll find this in Settings > Update & security > Recovery > Reset this PC ."
    },
    {
      "title": "Select Keep my files.",
      "content": "Select Keep my files . This is the best option if you have a lot of personal files and no backup. However, if you have a backup and want to start your Gateway fresh, select Remove everything ."
    },
    {
      "title": "Select to reset using the cloud or a local install.",
      "content": "Select to reset using the cloud or a local install. The option you choose will also change how your Gateway is updated. Cloud - Reinstalls Windows OS over the internet. This does not include tools, apps, and settings that came with the manufacturer. Local - Uses the files on the computer to restore Windows OS. You can also download the tools, apps, and settings from the manufacturer."
    },
    {
      "title": "Continue through the \"Reset this PC\" wizard.",
      "content": "Continue through the \"Reset this PC\" wizard. The page immediately after you select \"Cloud\" or \"Local\" is called the \"Additional settings\" page, where you can see what the reset will do. This includes a list of what's being deleted (if you selected \"Remove everything\") and a \"Change settings\" option. Click Next to continue."
    },
    {
      "title": "Click Reset.",
      "content": "Click Reset . You can read the items that will be removed from your laptop before continuing. You can stop by clicking Cancel at any time to create a backup . [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Start with your Gateway off and plugged into power.",
      "content": "Start with your Gateway off and plugged into power. If the laptop is on, shut it down. It also needs to be plugged in so it will stay on for the duration of the reset process."
    },
    {
      "title": "Turn on your Gateway and press Alt + F10 as soon as the logo appears.",
      "content": "Turn on your Gateway and press Alt + F10 as soon as the logo appears. You may need to press the keys a couple of times for them to register. This will load the Recovery Manager. If prompted by the Windows Boot menu, press Enter."
    },
    {
      "title": "Select Completely Restore Operating System to Factory Defaults.",
      "content": "Select Completely Restore Operating System to Factory Defaults . You will be asked several times to confirm that you want to proceed. Starting the restore will erase all the data on the disk and then reinstall Windows and the programs that came with your laptop. The restore process can take up to an hour to complete."
    },
    {
      "title": "Create your account and start using your computer.",
      "content": "Create your account and start using your computer. Once the restore process is complete, the laptop will act as if it has been turned on for the first time after you purchased it. You will be prompted to create a Windows account and configure your personal settings."
    },
    {
      "title": "Restart your laptop while holding ⇧ Shift.",
      "content": "Restart your laptop while holding ⇧ Shift . Even if you don't know the password, you can use this method instead of this one . From the login screen or from the desktop, if you can log in, click \"Power\" to open the Power menu, then press the Shift key on your keyboard as you click Restart in the Power menu."
    },
    {
      "title": "Select Troubleshoot.",
      "content": "Select Troubleshoot . It's next to an icon of some tools."
    },
    {
      "title": "Select Reset this PC.",
      "content": "Select Reset this PC . It's usually the first option."
    },
    {
      "title": "Select Keep my files.",
      "content": "Select Keep my files . This is the best option if you have a lot of personal files and no backup. However, if you have a backup and want to start your Gateway fresh, select Remove everything . Select Remove everything if you don't remember the password and can't access your laptop. This option will allow you to create a new account and start fresh."
    },
    {
      "title": "Select to reset using the cloud or a local install.",
      "content": "Select to reset using the cloud or a local install. The one you choose will also change how your Gateway is updated. Cloud —This reinstalls Windows using the cloud, so you need internet access. It does not include the tools, apps, and settings that came with the manufacturer. ' Local —This option restores Windows using files already on the computer. It will also install the manufacturer's tools, apps, and settings."
    },
    {
      "title": "Continue through the \"Reset this PC\" wizard.",
      "content": "Continue through the \"Reset this PC\" wizard. The page immediately after you select \"Cloud\" or \"Local\" is called the \"Additional settings\" page, where you can see what the reset will do. This includes a list of what's being deleted (if you selected \"Remove everything\") and a \"Change settings\" option. Click Next to continue."
    },
    {
      "title": "Click Reset.",
      "content": "Click Reset . You can read the items that will be removed from your laptop before continuing. You can stop by clicking Cancel at any time to create a backup . [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you've completely wiped the laptop and reinstalled Windows using the factory reset process and the problem still isn't gone, the cause is likely a hardware component. Computer repair specialist Matt Ham suggests that installing a new hard drive or installing new RAM are both fairly straightforward processes and may be able to fix your problem. [3] X Expert Source Matt Ham Computer Repair Specialist Expert Interview. 14 May 2021. You may need to contact Gateway for factory service if these don't help."
    }
  ]
}