{
  "url": "https://www.wikihow.com/Play-Wink-Murder",
  "title": "How to Play Wink Murder",
  "steps": [
    {
      "title": "Grab a group of people.",
      "content": "Grab a group of people. Wink murder is a fun game to play with friends, family, and even strangers as an icebreaker. It works best if you have at least ten people, but no more than thirty, as the game may take too long. [1] X Research source"
    },
    {
      "title": "Find a location.",
      "content": "Find a location. Wink murder is convenient because it can be played indoors or outdoors. That means you can play in your living room, on your deck, in the park, anywhere you can imagine. Just pick the location that works best for everyone playing. Everyone will be walking around, so when picking a location the only thing you might want to consider is space. Make sure everyone has room to mingle and sit or stand comfortably."
    },
    {
      "title": "Pick your moderator.",
      "content": "Pick your moderator. Pick one person to be the moderator. The moderator will stand out of the game to pick the “wink murderer” and facilitate. Everybody can take turns being the moderator. That way, every person gets the chance to play."
    },
    {
      "title": "Pick your wink murderer.",
      "content": "Pick your wink murderer. Everyone sits or stands with their eyes closed while the moderator walks around and picks a “wink murderer.” No peeking! The moderator can tap a person’s shoulder to signify they’ve been chosen as the wink murderer. This method keeps it a secret to everybody else playing."
    },
    {
      "title": "Wander around the room.",
      "content": "Wander around the room. Once the wink murderer is chosen, everybody stands up and wanders around the room. You can make casual conversation. Chat about the weather or what you ate that day. To get into the game even more, everybody can pretend to be detectives and speak like they’re on a crime show. Your conversations can be about clues and predictions."
    },
    {
      "title": "Make eye contact.",
      "content": "Make eye contact. The key to the game is that everybody must make eye contact with each other. While most people are just chatting and looking at each other, the wink murderer is trying to make eye contact and wink at you without others noticing. This is how he “kills you.”"
    },
    {
      "title": "”Die” if you’ve been winked at.",
      "content": "”Die” if you’ve been winked at. If you make eye contact with the wink murderer and he winks at you, you have been “killed.” Wait a few seconds after the wink murderer kills you and then pretend to die. Once you have died, sit off to the side and observe the game until it’s over. Dying dramatically makes the game even more entertaining. Clutch your heart or gasp with loud noises and fall to the ground. See how creative and dramatic you can be. [2] X Research source Make sure you wait a few seconds after the wink murderer kills you. If you die right away, you’ll give the mystery away too easily."
    },
    {
      "title": "Solve the crime.",
      "content": "Solve the crime. While you’re chatting with everyone, pay attention to your surroundings and try to figure out who the wink murderer is. Just be careful you don’t make eye contact with the wink murderer."
    },
    {
      "title": "Say “I accuse!”",
      "content": "Say “I accuse!” If you think you know who the wink murderer is, you raise your hand and say “I accuse!” A second person must “second” the accusation. If there is a second, you yell the name of the person you suspect and the person who seconded you yells the name of the person they suspect. The accused must say “yes” (they are the murderer) or “no” (they are innocent). [3] X Research source The seconder may guess a different person. In this instance, the seconder is only penalized if the first person guessed incorrectly too. If the person who originally shouted “I accuse” guesses the murderer correctly, the seconder isn’t penalized because the game is over. You can say “I accuse” at any point in the game. Just make sure you have a strong idea of who the murderer is because if you’re wrong, you’re out of the game. If nobody seconds you, you cannot guess. Wait a minute and then try to guess again. If you were incorrect, you must leave the game as penalty and the game continues until the killer is identified. The seconder must also leave if they are incorrect. If you were wrong but the seconder was correct, they win the game. If you were right, the murderer has been successfully caught which means you win and everybody can start a new round."
    },
    {
      "title": "Gather a large group of people.",
      "content": "Gather a large group of people. You will want a minimum of 15 people because there are three murderers. If you tried to play with just a few people, the game would be over within seconds."
    },
    {
      "title": "Sit in a circle.",
      "content": "Sit in a circle. Whether you’re sitting on the floor or in chairs, arrange yourselves in a circle. You want to be able to see everybody’s faces. This version of the game is a seated version so you don’t have to walk around. Make sure you’re comfortable. You’ll be in this position for quite a while, especially if you play multiple rounds, so grab a pillow and get comfy."
    },
    {
      "title": "Pick three murderers.",
      "content": "Pick three murderers. Use a deck of cards and pick three cards (like the Joker, the red Queen of Hearts, and the black Queen of Hearts) to represent who the murderers are. Everybody draws a card and whoever draws the “murderer cards” are the murderers. One murderer will wink at you to kill you. The second murderer will look at you and twitch to kill you. The third murderer will look at you and pout to kill you. [4] X Research source Make sure the deck of cards you pick from is the same amount of people playing. If you have 15 people playing and an entire deck of cards, it could take a couple times before the three murderer cards are drawn. You could also use scraps of paper with three of them marked “twitch”, “wink”, and “pout” if you don’t have cards. Everybody picks three pieces of paper so with this version, one person could potentially be all three murderers! [5] X Research source"
    },
    {
      "title": "Make conversation.",
      "content": "Make conversation. While everybody is sitting in a circle, make light conversation. The entire group can be engaged in one conversation or you can talk amongst the people around you. Just remember to watch everybody’s faces while you chit chat. Your conversations can be about anything. Chat about your plans for the week, where you’d like to go on vacation, or what you did that day. You can use even use fake accents to get everybody laughing."
    },
    {
      "title": "Make eye contact and pay attention.",
      "content": "Make eye contact and pay attention. Everybody must make eye contact with each other and pay attention to each others faces. The murderers are trying to kill you by winking, twitching, and pouting so you have to pay attention to what everyone is doing with their face to try and catch them."
    },
    {
      "title": "Don’t die!",
      "content": "Don’t die! It takes three murders to be killed in this game. You must be killed by twitching, winking, and pouting so if you’ve already been murdered twice, be very careful not to get hit a third time. Raise your right hand. If the wink murderer kills you, die by raising your right arm. Keep your arm raised for the rest of the game or until you’re out. [6] X Research source Raise your left hand. If the twitch murderer kills you, die by raising your left arm. Keep your arm raised for the rest of the game or until you’re out. [7] X Research source Cross your legs. If the pouting murderer kills you, die by crossing your legs. Keep your legs crossed for the rest of the game or until you’re out. [8] X Research source"
    },
    {
      "title": "Say “I accuse!”",
      "content": "Say “I accuse!” If you’ve been paying close attention and you think you know who the murderer is (or murderers are), you raise your hand and say “I accuse!” A second person must “second” the accusation. If there is a second, you yell the name of the person (or persons) you suspect and the person who seconded you yells the name of the person (or persons) they suspect. The accused must say “yes” (they are the murderer) or “no” (they are innocent). [9] X Research source The seconder may guess a different person. In this instance, if you are guessing the first or second murderer, the seconder would be penalized if they guessed incorrectly. If you were guessing the last murderer, the seconder wouldn't be penalized because the game would be over. If you guessed incorrectly but the seconder guesses correctly, you are out and the seconder stays in the game. If nobody seconds you, you cannot guess. Wait a minute and try again until someone seconds you. You can guess one murderer at a time or if you think you know them all, you can guess them all at once. Be careful though because if you guess two or three murderers and are incorrect about even one of them, you're out of the game. If you were incorrect, you must leave the game as penalty and the game continues until the killers are identified. The seconder must also leave the game if they are incorrect. If you were right about one murderer, that murderer leaves the game and everybody continues playing until all of the murderers have been caught. If you guessed them all correctly you can play another round!"
    }
  ]
}