{
  "url": "https://www.wikihow.com/Prevent-the-Spread-of-Fungal-Infections",
  "title": "How to Prevent the Spread of Fungal Infections",
  "steps": [
    {
      "title": "Wash your hands often.",
      "content": "Wash your hands often. Frequent hand washing is one of the best ways to stop the spread of fungal infections. Make sure that you wash your hands any time that you may have touched your fungal infection or after touching objects and surfaces that may be infected. For example, if you use equipment at the gym, then wash your hands right after you finish. [1] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Stay away from public places.",
      "content": "Stay away from public places. If you have a fungal infection, then you should stay away from places where you may be more likely to spread the infection. For example, you may be more likely to spread a fungal infection if you visit the gym or go swimming in a public pool. Fungal infections of any kind are spread through contact. If you currently have a fungal infection, avoid going to any public place that might make it possible for your infection to spread to others. Do not visit any gyms, public pools, or public bathing areas until your infection is cured."
    },
    {
      "title": "Wear shoes wherever you go.",
      "content": "Wear shoes wherever you go. You can pick up a fungal infection by walking around barefoot, so wearing shoes is a good way to protect yourself. If you have a fungal infection on your feet, then walking around barefoot will also increase the chance that you will spread it. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Make sure that you are always wearing some kind of footwear when you are out in public, especially in places like locker rooms where more people tend to go barefoot."
    },
    {
      "title": "Tell your supervisor if you have a fungal infection.",
      "content": "Tell your supervisor if you have a fungal infection. Some jobs require a lot of physical contact with people, which may put others at risk if you have a fungal infection. If your job requires a lot of direct contact with others, such as a nursing position, then you should tell your supervisor if you have a fungal infection. [3] X Research source"
    },
    {
      "title": "Use your own personal items.",
      "content": "Use your own personal items. Don't share any personal items with others, whether you have a fungal infection or not. Since fungal infections spread through contact, sharing personal items with another person increases the risk of spreading the fungal spores. Although it may seem kind to share something with someone, avoid doing so to decrease your risk of spreading or contracting a fungal infection. [4] X Research source Do not share any personal items such as clothing, towels, shoes, socks, makeup, deodorant, or anything else that you use or wear on your body."
    },
    {
      "title": "Cover up any existing fungal infections.",
      "content": "Cover up any existing fungal infections. If you currently have a fungal infection, you should cover it up before going out to a public place. Touching the infected area to another person or object by accident can cause the fungal infection to spread. Keep the area covered when you are in public until it has been treated. [5] X Research source You won't need to keep your children home from school if they have a fungal infection. However, you will have to cover the area and inform the school. Don't cover the area too tightly. It is important to keep the area cool and dry as you treat the fungal infection."
    },
    {
      "title": "Use only your own towels, shoes, and socks.",
      "content": "Use only your own towels, shoes, and socks. Sharing towels, shoes, and socks can increase your chance of spreading athlete's foot to others or of getting it yourself. Make sure that you only use your own towel and wear your own socks and shoes. Do not borrow or lend these items to people. [6] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Change your sheets and socks every day.",
      "content": "Change your sheets and socks every day. Athlete's foot can get onto your sheets and socks, which may cause it to breed and spread. To prevent athlete's foot from spreading from one foot to the other or from becoming worse, change your sheets every day until your athlete's foot is gone and change your socks every day as well. [7] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source You should also change your socks if they get sweaty because this will increase the chance that athlete's foot will spread."
    },
    {
      "title": "Keep your feet dry.",
      "content": "Keep your feet dry. Athlete's foot thrives in damp or wet environments. By keeping your feet dry you can make it more difficult for the bacteria that causes athlete's foot to infect you. Take some of the following steps to help keep your feet dry and prevent athlete's foot: If you are at home, and no one you live with has athlete's foot or any other fungal infection, you can go barefoot to keep your feet cool and dry. If your socks are sweaty or wet you should change them as soon as possible. If you find yourself away from home, keep a few clean and dry pairs of socks with you to prevent the chance of you having to go any period of time with sweaty or damp socks on your feet. Always dry your feet off completely after washing them. When getting out of the shower or after washing them off, make sure to rub dry in between your toes especially with a clean towel before you get dressed or put on socks and/or shoes."
    },
    {
      "title": "Wear the right shoes.",
      "content": "Wear the right shoes. Your shoes can play an important role in preventing athlete's foot. By selecting shoes that can help keep your feet dry and clean, you can reduce the chances of contracting and/or spreading athlete's foot. Keep some of these tips in mind when shopping for shoes: [8] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Try wearing a different pair of shoes each day to allow the shoes some time to dry in between uses. You can also sprinkle talcum powder in your shoes to help deal with moisture. If you're unable to have or can't afford to have several different pairs of shoes, try to at the very least have up to two pairs so that you're able to switch off to one or the other every new day. If you already have contracted athletes foot, then it helps to have or add into your variety a pair of sandals or open ventilated shoes to give your feet that extra bit of time not confined solely to shoes that must require the need for socks (note that you should also never wear shoes without socks such as tennis shoes, sneakers, etc. for that enables the perfect humid and sweaty conditions that athlete's foot bacteria lives in and grows progressively). Find shoes that allow air to reach your feet. This will help keep your feet dry and reduce your risk of developing athlete's foot. Don't share shoes with other people. Sharing shoes increases your risk of developing or spreading athlete’s foot. Avoid shoes that are too tight, as this can increase how much feet sweat and leaves little to none ventilation for your feet."
    },
    {
      "title": "Leave footwear on in public places.",
      "content": "Leave footwear on in public places. If you find yourself out in a public place, you will want to wear proper footwear. Going barefoot in public will increase your chances of contracting athlete's foot and possibly other diseases. If you're using a public shower, always wear sandals or flip-flops. You should always wear some kind of footwear in a fitness center. Wear some water shoes if you visit a public pool. You can go barefoot at home, as long as no one else in your house has athlete's foot."
    },
    {
      "title": "Take care of your feet.",
      "content": "Take care of your feet. Part of preventing athlete's foot involves keeping your feet dry, cool, and clean. To help you do this, you can apply different types of powder to your feet, keeping them dry and preventing athlete's foot from ever setting in. If you have a high risk of athlete’s foot, try using an antifungal powder daily can help your feet stay cool and dry. Talcum powder can be applied to help prevent perspiration, keeping feet dry."
    },
    {
      "title": "Protect yourself from nail fungus",
      "content": "Protect yourself from nail fungus when visiting a salon. Reputable salons use good sanitation practices to protect their clients and employees from skin infections, but it is still possible to get an infection from a reputable salon. There are some things you should keep in mind whenever you go for a manicure or pedicure. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Make sure that any salon that you visit is licensed by the state health department. Ask how the nail tools are sanitized between uses. The tools should be heat-sanitized with an autoclave to kill all of the germs and bacteria. Other methods are not as effective. Never get a manicure or pedicure if you know that you have nail fungus. You may spread it to the nail technician. Tell the nail technician not to push back or trim your cuticles. This increases your risk of infection. Wash your hands before a manicure and request that the nail technician does the same. The nail technician should also wear gloves. Request a liner for the whirlpool bath or bring your own if you know that the salon does not provide them."
    },
    {
      "title": "Practice good hygiene.",
      "content": "Practice good hygiene. By practicing good hygiene you may be able to avoid contracting nail fungus. Keeping your hands and feet clean and dry is a simple way to prevent nail fungus from infecting your nails. [10] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Keep your nails trimmed short and keep them dry. Wash your hands and feet regularly. Remember to use soap. If you have nail fungus, avoid touching anything after touching your nails, as this can spread the fungus."
    },
    {
      "title": "Take good care of your feet.",
      "content": "Take good care of your feet. Feet are often subjected to conditions that carry a higher risk of contracting nail fungus. Shoes and socks create warm and moist environments, which is what nail fungus needs to grow. Take some of the following steps to prevent toenail fungus. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Wear shoes that allow for airflow. Don't wear socks that cause your feet to sweat. Look for bamboo or polypropylene socks and avoid cotton. Change your socks often. Don't share shoes or socks with anyone. Alternate which pair of shoes you wear from day to day. Wash your socks in warm or hot water with detergent."
    },
    {
      "title": "Care for your nails.",
      "content": "Care for your nails. Damaged nails and nail beds can be an opening for nail fungus to take root in. By caring for your nails, and protecting any injured areas near them, you help keep any potential infections out. [12] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Don't pick or chew your fingernails. Take care of any cuts or injuries near your nails."
    },
    {
      "title": "Cut back on the use of nail polish.",
      "content": "Cut back on the use of nail polish. By applying nail polish or artificial nails, you may increase the risk of causing a fungal infection. Painting the nails can trap moisture and fungal spores underneath the nail, causing an infection. Try to reduce the amount you use nail polish to lower this risk. [13] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you already have nail fungus, do not try to cover it with nail polish. This will only worsen the infection."
    },
    {
      "title": "Use protection during oral sex.",
      "content": "Use protection during oral sex. Although vaginal intercourse does not seem to spread yeast infections from one partner to another, oral sex can lead to a yeast infection. Women may develop yeast infections after receiving oral sex due to the yeast in saliva. [14] X Research source To reduce this risk, use plastic wrap or a dental dam during oral sex. [15] X Research source"
    },
    {
      "title": "Wear loose-fitting underwear and pants made with natural fibers.",
      "content": "Wear loose-fitting underwear and pants made with natural fibers. Tight-fitting, synthetic fiber underwear and pants can increase your chances of getting a yeast infection. To reduce this risk, wear only loose-fitting, natural fiber underwear and pants. For example, choose a comfortable-fitting pair of soft cotton underwear over a tight pair of synthetic material panties. [16] X Research source It is important to wash underwear in warm water and soap — cold water washing in the sink does not remove or diminish yeast Do not wear pantyhose. Pantyhose also increases your risk of developing a yeast infection."
    },
    {
      "title": "Change out of wet panties and pants.",
      "content": "Change out of wet panties and pants. Wetness increases the risk that you will get a yeast infection, so make sure that you keep your vaginal area dry. If your clothes get wet, such as after a workout or a swim, change out of them right away. Put on clean dry underwear and clothes. [17] X Research source"
    },
    {
      "title": "Wipe from front to back.",
      "content": "Wipe from front to back. Women who are concerned with preventing yeast infections should wipe from front to back. Wiping from front to back helps to reduce the chance of spreading bacteria from your anus to your vagina, which may cause a yeast infection. [18] X Research source Don’t use any scented sprays or products since it can cause more yeast infections. Avoid douching since it can eliminate natural bacteria and increase your risk of infection."
    },
    {
      "title": "Manage stress",
      "content": "Manage stress . Stress can increase your chances of developing a yeast infection, so make sure that you find ways to reduce your stress levels. Regular exercise, getting enough sleep, and using relaxation techniques can all help you to manage your stress levels. [19] X Trustworthy Source National Alliance on Mental Illness Grassroots mental health-focused organization providing resources, support, and education for those affected by mental illness Go to source Some good stress relief techniques include yoga, deep breathing, and meditation."
    },
    {
      "title": "Identify risk factors.",
      "content": "Identify risk factors. Ringworm is not very common, and the biggest risk is being around people or animals that are infected — ringworm can infect both humans and animals. Since ringworm is spread by contact, if you touch a person or animal that has it, you stand a chance of contracting ringworm yourself. Ringworm is most common in school-age children, as schools or daycares are where outbreaks usually occur. [20] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Only pick up pets you know and occasionally check them for ringworm. Do not handle wild or stray animals as they may carry many diseases, including ringworm. Check your pets for ringworm. Ringworm can look like a small hairless patch, with red skin. Sometimes your pet may not have any symptoms, so always wash your hands after handling them. Ask your veterinarian to check your pets for ringworm if you suspect they may have it."
    },
    {
      "title": "Shampoo your hair regularly.",
      "content": "Shampoo your hair regularly. You can get ringworm on your scalp, which usually appears as an inflamed, scaly patch with hair loss. A simple technique that you can use to prevent ringworm on the scalp is to shampoo regularly, about every other day. By keeping your scalp clean, you can lower the chances of getting ringworm. [21] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Wash your hair well by massaging shampoo into your scalp. Avoid sharing any hats or hair care items with other people. Use anti-dandruff shampoo if you are prone to dandruff. While some people can tolerate daily shampooing, for many people this dries out the scalp and can actually increase the risk of infection. You may think it is best to shampoo every day, but pay attention if your scalp seems dry."
    },
    {
      "title": "Wash your body often and keep clean.",
      "content": "Wash your body often and keep clean. Ringworm is spread through contact and is highly contagious. Washing your body with soap and water will help to remove any fungal spores from your body if you have come into contact with them. By staying clean, you can help reduce your chances of contracting ringworm. [22] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Shower regularly and wash thoroughly. Wash your hands throughout the day to keep them clean. Always fully dry off whenever you wash."
    },
    {
      "title": "Keep your hands away from the infected area.",
      "content": "Keep your hands away from the infected area. Don't scratch or touch the infected area. Although it may be tempting to scratch the affected area, you should avoid doing so. Scratching the area can lead to spreading it to other parts of your body or even other people. Limit the infection by not scratching. Avoid giving any personal items, such as clothing or a hairbrush, to other people. Always wash your hands after touching any infected areas. Touching the area and then touching another person can spread the infection."
    }
  ]
}