{
  "url": "https://www.wikihow.com/Phrogging-Meaning",
  "title": "Phrogging: How to Tell If Someone Is Living In Your Home",
  "steps": [
    {
      "title": "\"Phrogging\" means secretly living in someone’s home without consent.",
      "content": "\"Phrogging\" means secretly living in someone’s home without consent. Phroggers are typically individuals suffering from mental illness, homelessness, or serious financial distress. They seek temporary shelter in less frequented areas of a house or property like basements, attics, and crawlspaces before moving on to a new location. Phrogging is illegal and phroggers can be charged with a number of crimes like trespassing, vandalism, and burglary, depending on the specific incident. [1] X Research source The term “phrogging” likely comes from the behavior of leapfrogs, since phroggers, or phrogs, tend to “jump” from one occupied home to the next in order to avoid detection."
    },
    {
      "title": "Film and TV make phrogging seem more common than it really is.",
      "content": "Film and TV make phrogging seem more common than it really is. The term likely originated in 2006, when a documentary series titled Living with Strangers was released on YouTube. It was filmed from the perspective of two young women who “phrogged” at a stranger’s house for almost a week. The whole thing was later revealed to be a hoax, but the series instilled a new fear in viewers' minds. Since then, a few noteworthy cases of real-life phrogging have inspired films and TV shows, making phrogging seem like a more common and likely crime than it actually is. The award-winning film Parasite features phrogging as a main plot line. The 2022 Lifetime show Phrogging: Hider in My House chronicles phrogging stories from the perspective of home owners. Record high homelessness after the COVID-19 pandemic, along with rising inflation and cost of living expenses, has deepened the public’s fears about potential phrogging in their homes, although the crime remains quite rare. [2] X Research source"
    },
    {
      "title": "You hear noises you can’t explain.",
      "content": "You hear noises you can’t explain. Unless you live in very creaky old house, most small noises should be explained. If you keep hearing bumps, steps, tinkering, or even a muffled voice— someone could be living in your house rent-free. Be on the lookout, especially if the sounds you’re hearing are new and frequent and occur during the daytime as much as they do at night. [3] X Research source"
    },
    {
      "title": "Things continue to go missing or are misplaced.",
      "content": "Things continue to go missing or are misplaced. Phroggers need supplies and may steal in order to survive, so beware if personal items or food continues to go missing. Most phroggers aim to eat and use as little of your things as possible to evade detection, so keep an eye out for mildly misplaced or used up things. For example, a phrogger wouldn't finish off a box of cereal since the empty box would be a big hint that someone may be lurking in your home. However, they might take a small bit at a time to avoid being found out."
    },
    {
      "title": "Your pets are acting strange.",
      "content": "Your pets are acting strange. Whether you have cats or dogs or both, it’s undeniable that animals can pick up on things that humans can’t. If you notice your pets getting antsy, stressed, or agitated more than usual, there might be a phrogger afoot. Monitor how your pets react and what they seem to be reacting to. If you notice them continuously barking at the door to the basement, it could mean that they’ve sensed something—or someone—that doesn’t belong there."
    },
    {
      "title": "You have the eerie feeling that you’re being watched.",
      "content": "You have the eerie feeling that you’re being watched. Although this may be more of a gut feeling than anything else, you should still listen to your intuition. It’s normal to look over your shoulder once in a while, unsure if you’re alone or not, but if this feeling persists and you can pinpoint where and when in the house, it could point to an intruder. In some more distressing cases, however, the phrogger may have a bird’s eye view of you if they’re hiding in the attic or the air vents, so be sure to stay alert if you suspect phrogging. [4] X Research source"
    },
    {
      "title": "Check the less frequently used spaces in your home.",
      "content": "Check the less frequently used spaces in your home. These include but are not limited to places like basements, crawlspaces, and attics. Doing weekly rounds of these largely unused parts of your house could help prevent phroggers from sneaking in and catch the ones that already set up shop. Sweep these areas carefully if you suspect that you have an unwanted guest, but don’t investigate too closely on your own as phroggers can become violent. [5] X Research source"
    },
    {
      "title": "Set up security cameras.",
      "content": "Set up security cameras. Many people already have a Ring camera for security purposes, safely allowing them to asses who’s at the door before engaging. If you suspect that there may be a phrogger in your midst, setting up cameras at every possible entry point to your house could dissuade potential phroggers from trying to enter. Even if they do, you’ll be notified right away and the phrogger will have no choice but to just phrog off somewhere else."
    },
    {
      "title": "Take note of any food or belongings that get moved or lost.",
      "content": "Take note of any food or belongings that get moved or lost. Closely monitor your surroundings in order to detect a phrogger. If things start to go missing, this could be a big clue that a phrogger may be phrogging nearby, as in, inside your house. Phroggers tend to steal things like food and clothing, so if you notice that leftovers continue to disappear in the fridge and clean clothes mysteriously begin vanishing from the dryer, it’s could be the work of a sneaky and mischievous visitor. [6] X Research source"
    },
    {
      "title": "Contact the police.",
      "content": "Contact the police. If you are truly concerned that there’s a phrogger in your house, do not investigate any further on your own. Contact the police, explain the situation, and allow them to do their job. However, in some cases, local law officials may not be able to take immediate action if they deem it to be a civil issue. If this happens, you may have to take the phrogger to court. [7] X Research source"
    },
    {
      "title": "Stay somewhere else if you feel unsafe.",
      "content": "Stay somewhere else if you feel unsafe. In the event that you have a suspected—or confirmed—phrogger in your house and immediate legal action is not possible, temporarily leaving your house could be a good way to keep you safe and sane. Stay with a friend or family member, or invest in a short-term rental while the phrogging situation is resolved by police or the court. No matter what, your safety comes first!"
    },
    {
      "title": "Open windows or doors",
      "content": "Open windows or doors An open door is a clear sign that someone has tried to enter—or has entered—your house. Call the police as the person might still be inside. Check other entry points, like backdoors or windows, and note if they were left unlocked, ajar, or wide open. Signs of forced entry include broken glass, damage to locks, and shrubbery that’s been stomped over. [8] X Research source"
    },
    {
      "title": "Lights that have been turned on or off",
      "content": "Lights that have been turned on or off If you return home to find that the lights you swore you turned off are suddenly on again, there could be a phrogger to blame. This is a dead giveaway that somebody has been or still is inside your house, which would make anyone’s alarm bells go off. To ensure your safety, call the police and leave it up the professionals to find your culprit."
    },
    {
      "title": "Theft",
      "content": "Theft Phroggers aren’t often violent offenders, but they are often thieves. Since phroggers typically rely on stealing in order to survive, snatching a few belongings when checking out your house with the intention to phrog is not uncommon. Account for all your valuables, such as jewelry and electronics. If you notice anything missing for certain, it might be time to consider filing a police report."
    },
    {
      "title": "Phroggers live in occupied houses while squatters live in abandoned ones.",
      "content": "Phroggers live in occupied houses while squatters live in abandoned ones. The intention behind phrogging is different from squatting as it is significantly shorter-term. Phroggers choose homes that they know they can quietly occupy for a few weeks or so before they have to be on the move again, while squatters take over empty properties with the hopes of eventually acquiring legal rights to staying there. [9] X Research source Another main difference is that phroggers may target specific people’s homes, potentially leading to additional charges like stalking and harassment. In general, squatting is a property crime while phrogging may underscore a more dangerous situation to the people who live in the home, including theft, trespassing, and assault."
    },
    {
      "title": "Does phrogging really happen?",
      "content": "Does phrogging really happen? Phrogging is rare, but there have been few noteworthy phrogging cases over the years. One such case is the 1986 case of Daniel LaPlante, who stalked an ex by living in her family’s crawlspace for weeks prior to being caught. He went on to hide in another house, ultimately murdering the family who lived there. In 2019, a college student found a 30-year old homeless man living in her closet. In that same year, a man in Knoxville, TN got the scare of his life when he heard a loud bang and found that it was a phrogger living in the crawlspace of his house. [10] X Research source Although the number of phrogging cases is hard to pin down since it's assumed many phroggers never get caught, this is definitely a real and punishable crime."
    },
    {
      "title": "Where is phrogging most common?",
      "content": "Where is phrogging most common? Large houses, with plenty of options for hiding spots, are more likely to attract phroggers. In big houses, phroggers can sometimes hide for years without being noticed. Phrogging can also happen in commercial buildings, as there is tons of available, accessible, yet often unused space. [11] X Research source"
    }
  ]
}