{
  "url": "https://www.wikihow.com/Smell-Good",
  "title": "How to Smell Good",
  "steps": [
    {
      "title": "Shower",
      "content": "Shower or bathe every day or every other day. To ensure you smell the best you can, you shouldn't shower every day. Showering every day can dry out your skin but if you have more oilier or sweatier skin, showering everyday is fine. Only shower every other day with a gentle soap for dry skin. This will get rid of any odors that have built up on your skin or hair over the last 24 to 48 hours. Use warm, rather than hot, water, and try and keep your shower under 15 minutes in order to conserve water. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Reader Poll: We asked 847 wikiHow readers how often they shower, and 52% said that they shower once every day . [Take Poll]"
    },
    {
      "title": "Scrub your entire body in the shower.",
      "content": "Scrub your entire body in the shower. Wash your entire body with soap and a washcloth. Pay special attention to the area behind your ears, the back of your neck, your feet, and sweaty spots such as your armpits and your inner thighs. Don’t forget to wash your chest, genitals, and backside as well. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have sensitive skin, avoid soaps with heavy perfumes or antibacterial ingredients. Don’t use a loofah—they breed bacteria! Use a washcloth or even your hands, instead."
    },
    {
      "title": "Wash your hair",
      "content": "Wash your hair regularly. It’s important to wash your hair regularly as it absorbs scents from the atmosphere around you. Massage shampoo into your scalp to remove unpleasant smells and dust. Thoroughly rinse your hair with clean water. If desired, apply a conditioner to your hair and let it sit for a few minutes before rinsing it out with cool water. [3] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you have dry hair, don’t wash it more than every other day. Don't wash your hair too often, or else the oils in your hair will be removed. Twice a week is enough."
    },
    {
      "title": "Brush your teeth",
      "content": "Brush your teeth twice a day. To keep your breath smelling fresh, brush your teeth in the morning and at night every single day. Put a small amount of toothpaste on the toothbrush and brush your teeth with short vertical or circular motions. Be sure to clean every side of each tooth as well as your gums and tongue. Spend at least 2 minutes brushing each time. [4] X Research source Replace your toothbrush every 3 to 4 months to keep bacteria from building up and to prevent damage to your gums from worn bristles. Don’t forget to floss your teeth every day as well!"
    },
    {
      "title": "Apply deodorant and/or antiperspirant at night.",
      "content": "Apply deodorant and/or antiperspirant at night. Though it may seem counterintuitive, you should actually apply your deodorant or antiperspirant at night, rather than in the morning. This gives the ingredients time to soak into the skin and prevent your glands from producing foul-smelling odors and sweat. [5] X Research source You can even shower in the morning without worrying about the effectiveness of your deodorant—it’s already been absorbed!"
    },
    {
      "title": "Put on clean clothes every day.",
      "content": "Put on clean clothes every day. Change all your clothes, including your shirt and shorts or pants, all your undergarments (like your underwear, bra, and socks), as well as any clothing items that touch your skin (such as a tank, camisole, or slip). Fresh clothes will keep you smelling great all day long. [6] X Research source You may want to change your socks several times per day if you have especially stinky or sweaty feet."
    },
    {
      "title": "Wash your clothes after each use.",
      "content": "Wash your clothes after each use. It’s a good idea to launder clothing items each time you wear them to remove odors. Your detergent doesn't have to be expensive, and it doesn't have to be loaded with strong fragrances. However, it does need to get rid of hidden odors within your clothes and leave you with fresh garments. [7] X Research source You can add 1 ⁄ 2 cup (120 ml) of white vinegar to your washing machine during the rinse cycle to help eliminate odors and remove sweat. [8] X Research source"
    },
    {
      "title": "Clean your shoes regularly.",
      "content": "Clean your shoes regularly. Shoes can easily become smelly if they aren’t cleaned often due to the accumulation of sweat and bacteria. When they get especially dirty or stinky, wash them in your washing machine and allow them to dry in direct sunlight. In between washings, stuff your shoes with newspaper overnight to remove odors. You can also put dryer sheets in your shoes to improve their scent. If your shoes cannot be washed, use a cotton ball dipped in alcohol to wipe out the interior and kill bacteria. Alternate between several pairs of shoes if possible. Wear one pair one day and another pair the next day to give your other shoes time to air out and dry out."
    },
    {
      "title": "Avoid eating spices, onion, and garlic.",
      "content": "Avoid eating spices, onion, and garlic. Though these foods are good for you, the odors come out through your pores and stink up your breath. Alcohol and red meat also change your body odor, so try to cut down on consumption of those items as well. Opt for fresh fruits and vegetables, instead. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Stay well hydrated.",
      "content": "Stay well hydrated. Staying hydrated keeps your skin moisturized, which actually allows pleasant scents from lotions or fragrances to adhere to your skin better. [10] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Men should drink 15.5 cups (3.7 L) of water per day, while women should drink 11.5 cups (2.7 L) of water per day. [11] X Trustworthy Source HealthyChildren.org Health information from the American Academy of Pediatrics. Go to source"
    },
    {
      "title": "Use a moisturizer with a pleasant scent.",
      "content": "Use a moisturizer with a pleasant scent. After bathing, you can apply a scented lotion to your skin. If you plan to use perfume or cologne too, make sure the scents are compatible or similar so they don’t compete with one another or becoming overpowering. Reapply as needed, like after washing your hands. [12] X Research source"
    },
    {
      "title": "Spray on your favorite scent.",
      "content": "Spray on your favorite scent. Target pulse points on your body when using perfume or cologne, such as your wrists, behind your ears, the back of your knees, and the insides of your elbows. This will allow the scent to linger as it is warmed up by your body and released throughout the day. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Avoid wearing too much perfume or cologne as it can be overpowering. If you desire a lighter scent, simply spritz the perfume or cologne in the air and walk beneath it. Don’t rub the scent into your skin, such as by rubbing your wrists together, or it won’t last as long."
    },
    {
      "title": "Keep a kit full of items you may need.",
      "content": "Keep a kit full of items you may need. Gum, mints, mouthwash, wet wipes (to clean your armpits or other areas of your body), deodorant, cologne or perfume, foot spray, scented lotion, and an extra shirt or socks are good items to keep on hand. Simply toss your items in a small bag and store it in your desk drawer, backpack, or car. [14] X Research source When the need arises, simply grab your kit and excuse yourself to use the restroom and freshen up."
    },
    {
      "title": "Change your shirt or socks, if necessary.",
      "content": "Change your shirt or socks, if necessary. This is a simple and effective way to ensure you smell good all day long! If your shirt or socks are sweaty or stinky, swap them out for fresh ones. Store the dirty items in a plastic bag with a zipper to ensure the odors don’t escape. Make sure you bring the dirty clothes home and wash them promptly."
    },
    {
      "title": "Use gum, mints, or mouthwash to freshen your breath.",
      "content": "Use gum, mints, or mouthwash to freshen your breath. If you decide to go with mouthwash, pick a kind that’s alcohol-free. Alcohol dries out your mouth, and a dry mouth is actually what causes bad breath. Gum or mints that you can chew or suck on will help restore saliva and, if you choose a minty flavor, will make your breath smell great. [15] X Research source"
    },
    {
      "title": "Reapply deodorant if necessary.",
      "content": "Reapply deodorant if necessary. If you have exercised, sweat a lot, or simply smell bad, you can reapply deodorant throughout the day. Use a wet wipe or a damp washcloth to clean your armpits first. Pat them dry with a soft paper towel, then reapply your deodorant. [16] X Research source"
    },
    {
      "title": "Spritz on perfume or cologne.",
      "content": "Spritz on perfume or cologne. If your scent tends to fade throughout the day, take some time to spray it on again. Simply spray your ankles or wrists and let your body heat diffuse the scent. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Just apply a little bit so the scent isn't overpowering. You can also apply fragrances to your hair accessories before using them. Spritz your hairbrush, barrettes, or headbands with your favorite scent before putting them in your hair. Try layering your scents by using body wash, lotion, and perfume that all have similar scents. This will help balance the overall smell and improve the longevity of the aroma."
    }
  ]
}