{
  "url": "https://www.wikihow.com/Remove-Blonde-Hair-Dye",
  "title": "How to Remove Blonde Hair Dye",
  "steps": [
    {
      "title": "Try a clarifying shampoo.",
      "content": "Try a clarifying shampoo. If you dyed your hair blonde but you don't like the exact shade, try using a clarifying shampoo to remove some of the toner from your hair. Just wash your hair with the clarifying shampoo like you would your normal shampoo. [1] X Expert Source April Ferri Professional Hair Stylist Expert Interview. 8 December 2020."
    },
    {
      "title": "Go for a color remover.",
      "content": "Go for a color remover. You can buy hair color remover at most drug stores and beauty supply stores. You can follow the directions on the bottle to figure out to use it to remove color from your hair. Usually, you apply remover to your hair and let it sit for a specific timeframe before rinsing it out. Make sure to get the right color remover for your hair type. Color removers are sold for permanent dye as well as temporary dye. Color removers are aggressive, so this might be a good option if you have a very gold or purple tone to your blonde hair. [2] X Expert Source April Ferri Professional Hair Stylist Expert Interview. 8 December 2020. If a color remover does not work right away, try it again. Very strong colors may take a couple rounds to remove. Some hair color removers are safe to use more than once, such as the Pravana Artificial Hair Color Extractor."
    },
    {
      "title": "Try anti-dandruff shampoos.",
      "content": "Try anti-dandruff shampoos. Some people find that anti-dandruff shampoo actually helps remove color. It is usually far less costly than color removal products. Simply wash your hair with anti-dandruff shampoo and see if any color is removed. This tends to work better if you act fast. If the color has time to set in, it will be harder to remove."
    },
    {
      "title": "Use vitamin C tablets.",
      "content": "Use vitamin C tablets. You can pick up vitamin C tablets at any drugstore. You should crush two tablets and mix them into your current shampoo or an anti-dandruff shampoo. Then, wash your hair as you normally would. You may notice some of the color fading. This does not work with all types of dye and hair colors. You may have to try another method if vitamin C does not work for you."
    },
    {
      "title": "Invest in Epsom salt.",
      "content": "Invest in Epsom salt. You can use this method in the bath. Sprinkle a generous amount of Epsom salt into the water and add some baking soda. Then, take a bath and soak your hair until you notice color fading. [3] X Research source This only works with semi-permanent hair colors. If you colored your hair using permanent dye, you will have to try another method."
    },
    {
      "title": "Try baking soda.",
      "content": "Try baking soda. Baking soda may be able to naturally remove your hair color, saving you from using a lot of chemicals. Mix equal parts baking soda and shampoo. Wash your hair with this mixture each day until the color fades. Usually, a one-to-one mixture works fine. However, if you have very thick hair, try adding slightly more baking soda than shampoo."
    },
    {
      "title": "Treat your hair with vinegar.",
      "content": "Treat your hair with vinegar. Vinegar can strip color from hair. To use vinegar, opt for plain white vinegar. Use a one to one ratio of warm water and vinegar. Soak your hair in the mixture and then wrap your hair with a shower cap or plastic bag. Let the mixture sit in your hair for 15 to 20 minutes. Then, rinse your hair. The color should be reduced. You may have to repeat this method several times to completely remove unwanted hair dye. Vinegar has a strong smell, so you may want to shampoo and condition your hair after this treatment."
    },
    {
      "title": "Apply dishwashing soap.",
      "content": "Apply dishwashing soap. Try washing your hair with any brand of dish soap instead of your regular shampoo. The dish soap may work to strip your hair of dye. You may have to wash your hair with dish soap for a few days before you see the results you want. [4] X Research source"
    },
    {
      "title": "Get your hair bleached.",
      "content": "Get your hair bleached. Bleaching is a very powerful method of removing hair color. However, because bleach is harsh on hair, only bleach if you've tried other methods. You should also get bleaching done at a salon by a professional. Usually, you will have to add hair dye over the bleach to return to your natural hair color. Another less harsh option is to do a bleach wash , which is when you mix shampoo with bleach."
    },
    {
      "title": "Get a hot oil treatment.",
      "content": "Get a hot oil treatment. Some methods of hair removal can be harsh on your hair, leaving it dry. If you've removed the dye yourself, but your hair feels brittle, get a hot oil treatment at your local salon. This can help revitalize your hair. [5] X Research source If hey don't offer hot oil treatments at your salon, then ask for a deep conditioning treatment."
    },
    {
      "title": "Have your hair re-dyed.",
      "content": "Have your hair re-dyed. If all else fails, see a stylist. They can remove the hair dye in a professional setting and re-dye it brown or red if you want. However, this is often costly. It makes sense to attempt to remove the dye yourself first before going to a salon for help. Typically when you dye your hair blonde, you're actually removing the pigment. That means you can't just remove the blonde dye to get back to your natural color. Dyeing your hair back to its original color might be your only option. [6] X Expert Source April Ferri Professional Hair Stylist Expert Interview. 8 December 2020."
    }
  ]
}