{
  "url": "https://www.wikihow.com/Rotate-Text-in-Microsoft-Word",
  "title": "2 Quick Ways to Rotate or Adjust Text in Microsoft Word",
  "steps": [
    {
      "title": "Open a document in Microsoft Word.",
      "content": "Open a document in Microsoft Word. You can use this method to rotate text in Microsoft Word on any Windows PC or Mac . [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You must have a subscription to Office 365 to use the latest version of Microsoft Word."
    },
    {
      "title": "Create a text box.",
      "content": "Create a text box. To do this, click the Insert tab in the top toolbar, then click the Text Box icon in the Text section. You can select Simple Text Box from the presets."
    },
    {
      "title": "Insert your text.",
      "content": "Insert your text. Input the text you want to edit. You can copy and paste from another program into Microsoft Word. Make sure the text box is still selected, otherwise, your text may end up outside of it."
    },
    {
      "title": "Click Shape Format.",
      "content": "Click Shape Format . You can find this at the top toolbar, next to Help . Alternatively, double-click the edge of the text box to be quickly redirected."
    },
    {
      "title": "Click Text Direction.",
      "content": "Click Text Direction . This will be in the Text section. A drop-down menu will open."
    },
    {
      "title": "Select Rotate all text 90°.",
      "content": "Select Rotate all text 90° . You can also select Rotate all text 270° if you want the top of the words to face the left side. Your text will be rotated. You can continue to edit your text in the text box. The words will type in the direction set. Be sure to save your document if you need to return to it later."
    },
    {
      "title": "Manually rotate the text (optional).",
      "content": "Manually rotate the text (optional). If you want to adjust the text to a specific angle, you can manually rotate the text. Do the following: [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Click the text box. Icons should appear around it. Click and hold the curved arrow icon. Drag your mouse clockwise or counter-clockwise to adjust the position. Release the mouse to save the position."
    },
    {
      "title": "Open a document in the Microsoft Word app.",
      "content": "Open a document in the Microsoft Word app. This looks like a blue notebook next to a W . Microsoft Word is available for iOS in the App Store and for Android in the Google Play Store . Tap Blank document to open a new document or tap a file to open an existing document."
    },
    {
      "title": "Create a text box.",
      "content": "Create a text box. To do this, tap the Edit icon at the top. On iPhone/iPad, this button looks like a white \" A \" and a pencil icon on the blue toolbar. On Android, you may find the same icon or just a white pencil. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Tap Home and select Insert . Tap Text Box . Enter the text in the text box."
    },
    {
      "title": "Tap the \"Edit\" icon again.",
      "content": "Tap the \"Edit\" icon again. This will open the formatting menu. If you aren't already on the Shape tab, tap Home and then Shape ."
    },
    {
      "title": "Tap Text.",
      "content": "Tap Text . You can find this below WordArt Styles ."
    },
    {
      "title": "Tap Text Direction.",
      "content": "Tap Text Direction . This will be underneath Align Text ."
    },
    {
      "title": "Tap Rotate all text 90°.",
      "content": "Tap Rotate all text 90° . You can also select Rotate all text 270° if you want the top of the words to face the left side. Your text will be rotated. You can continue to edit your text in the text box. The words will type in the direction set."
    },
    {
      "title": "Manually rotate the text (optional).",
      "content": "Manually rotate the text (optional). If you want to adjust the text to a specific angle, you can manually rotate the text. Do the following: Tap the text box. Icons should appear around it. Tap and hold the curved arrow icon. Drag your finger clockwise or counter-clockwise to adjust the position. Release your finger to save the position."
    }
  ]
}