{
  "url": "https://www.wikihow.com/Remove-Marker-from-Wood",
  "title": "How to Remove Marker from Wood",
  "steps": [
    {
      "title": "Squeeze a generous amount of regular toothpaste onto the surface of the wood.",
      "content": "Squeeze a generous amount of regular toothpaste onto the surface of the wood. You want basic white toothpaste. Not gel, whitening paste, or anything with abrasive crystals in it. The traditional white paste will do the trick without damaging the wood. [1] X Research source Make sure your marker stain is covered with a thick layer of toothpaste. You can apply more later if you don’t have enough. [2] X Research source Sometimes rubbing alcohol or peanut butter can be used in place of toothpaste to remove marker stains, but toothpaste is usually more effective. [3] X Research source"
    },
    {
      "title": "Dampen a washcloth.",
      "content": "Dampen a washcloth. Grab a clean washcloth and hold it under running water. Any temperature that’s comfortable to you is fine. Once the washcloth is soaked, squeeze any excess water so that it’s damp and not dripping wet."
    },
    {
      "title": "Rub the toothpaste in.",
      "content": "Rub the toothpaste in. Using a circular motion, rub the toothpaste into the marker spot for three to five minutes or until most of the toothpaste disappears. [4] X Research source Apply enough pressure that your toothpaste can penetrate the marker, but not so much pressure that you’re going to damage the finish on your wood. Add more toothpaste if the washcloth doesn’t move freely over the entire surface of the marker stain."
    },
    {
      "title": "Wipe away any remaining toothpaste.",
      "content": "Wipe away any remaining toothpaste. Using your damp washcloth, wipe off any toothpaste that’s still left on the wood. Make sure you wipe in the direction of the wood grain, not against it. The wood will dry and any toothpaste should be gone. [5] X Research source"
    },
    {
      "title": "Clean up your work area.",
      "content": "Clean up your work area. Your marker stain should be removed. All you have to do now is clean up your area. Put away your toothpaste, dispose of your washcloth to be cleaned, and replace your wooden object if it’s movable."
    },
    {
      "title": "Add baking soda if any marker stain remains.",
      "content": "Add baking soda if any marker stain remains. Repeat the previous steps, but add an equal amount of baking soda (for the amount of toothpaste) to your stain. This will add abrasion so use caution when you’re rubbing the mixture into the wood. If the baking soda doesn't work, follow the same steps using rubbing alcohol or peanut butter. Be sure to wipe away the alcohol or peanut butter with a damp washcloth, then let the wood dry before cleaning up."
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. Removing the marker stain will be easier if you have all your materials ready and accessible before you start. You’re going to need: A mild abrasive cleaner or enzyme cleaner. You can get these at any big box store and most supermarkets. Rubbing alcohol, also available at most supermarkets, drugstores, and big box stores. A damp washcloth. Hold a clean washcloth under running water and squeeze out the excess water."
    },
    {
      "title": "Turn the piece of wood so that the marked surface is accessible.",
      "content": "Turn the piece of wood so that the marked surface is accessible. You want to make sure the spot you’re cleaning is facing up so that the cleaner doesn’t run down the surface of the wood."
    },
    {
      "title": "Spray the abrasive or enzyme cleaner onto the surface of the wood.",
      "content": "Spray the abrasive or enzyme cleaner onto the surface of the wood. Make sure you cover the entire area of the marker stain. [6] X Research source Let the cleaner sit for 2-3 minutes."
    },
    {
      "title": "Wipe off the marker stain with a damp washcloth.",
      "content": "Wipe off the marker stain with a damp washcloth. Wipe in a circular motion until you remove the stain. This may take a few minutes. Rinse any remaining cleaner from the wood using a clean corner of your damp washcloth. [7] X Research source"
    },
    {
      "title": "Remove remaining marker with a washcloth soaked in rubbing alcohol.",
      "content": "Remove remaining marker with a washcloth soaked in rubbing alcohol. If the stain is still there after using cleaner, soak your washcloth in rubbing alcohol. Wipe the alcohol-soaked washcloth over the stained area a few times, then rinse. [8] X Research source"
    },
    {
      "title": "Wipe the marker stain away using a baby wipe.",
      "content": "Wipe the marker stain away using a baby wipe. First, try to rub a baby wipe on the area where the marker has stained the wood. Make sure to rub with the grain, not against it. The alcohol in the baby wipe may remove most of the marker stain."
    },
    {
      "title": "Sand the area with 80-grit sandpaper.",
      "content": "Sand the area with 80-grit sandpaper. You’ll first sand the marked area with 80-grit sandpaper. This should remove most of the stain, but will leave some abrasive pattern behind on your wood. Make sure to sand with the grain of the wood, not against it."
    },
    {
      "title": "Sand the area with 100-grit sandpaper.",
      "content": "Sand the area with 100-grit sandpaper. Go over the same spot with 100-grit sandpaper until the entire stain is gone. Again, sand with the grain of the wood, not against it. This should smooth out the area and blend it with the rest of the wood. [9] X Research source"
    },
    {
      "title": "Stain or treat the wood with finish.",
      "content": "Stain or treat the wood with finish. Staining or finishing the wood will protect it from future marker damage. You can get wood stain at any home improvement or big box store."
    }
  ]
}