{
  "url": "https://www.wikihow.com/Reconcile-With-an-Ex-Lover",
  "title": "How to Reconcile With an Ex Lover",
  "steps": [
    {
      "title": "Take an honest look at the past.",
      "content": "Take an honest look at the past. All relationships end for definite reasons, and you should think hard before taking any action. Why did your relationship end? More than that, why do you want to go back to your ex? Some honest reflection will protect you from falling into the same traps and getting hurt again. [1] X Research source Ask yourself: if you blame your ex for the breakup, why do you want to get back together? Has she changed the behavior that led to problems? Why would another go-round work when the first did not? If you blame yourself, have you changed? Consider your contributions to the breakup. Be very careful that you are not crafting a rosy narrative of your role, one that overlooks very real faults in your behavior."
    },
    {
      "title": "Assess your motives.",
      "content": "Assess your motives. There are good reasons and bad reasons to pursue a reunion with an ex—lover. Look into your motives and evaluate them. Are they good or bad? Would you still want to get back together with her if your life was ideal, for example? If not, the wrong reasons may lie behind your desire. [2] X Research source Do you really still love her? Do you see a stable future together? Was your break up rash, due to a rough patch in a usually happy relationship? Or was it due to youth and you think you’ve now matured? These might be legitimate reasons. [3] X Research source Is she putting pressure on you? Or perhaps you are worried about money, loneliness, or dating again? These are NOT good reasons to pursue a reunion. Be very careful if you have children together. Children need stability. A clean break or stable relationship is best if you want to make things work for your kids. Casually dating your ex – their mother or father – is confusing and cruel. [4] X Research source"
    },
    {
      "title": "Be sure that you can overcome the problems.",
      "content": "Be sure that you can overcome the problems. Were the issues in your relationship chronic or trivial? How many chances have you given your ex? Behaviors are deep and hard to change, and that includes how we interact as couples. Don’t expect to be able to change your behavior or that your ex will easily change her own. [5] X Research source Was substance abuse involved? Drug and alcohol abuse are serious mental health issues. You shouldn’t think about reuniting with an ex unless you have had several years of treatment and sobriety. The danger is that your old patterns of behavior will reemerge, and lead you back down the path of addiction. [6] X Research source Was cheating part of the problem? If so, you and your ex need to come to terms with your past in counseling. Otherwise, the issue may arise again."
    },
    {
      "title": "Give yourself – and her – space.",
      "content": "Give yourself – and her – space. For a few weeks after a breakup, you will be feeling a lot of emotions, some of them conflicting. Give yourself time and let these emotions settle. Do the same for her. Don’t call or contact her. Don’t respond if she contacts you. [7] X Research source Use this time to rest, recuperate, and, if need be, mourn the relationship. Get away from the stress and unhappiness of the event and take time to focus on your personal wellbeing. Try to keep your spirits up. Go out with friends and vent. At the same time, don’t be tempted to mask your feelings with alcohol."
    },
    {
      "title": "Reassess yourself – and clean up your act.",
      "content": "Reassess yourself – and clean up your act. Now is the time to act on your personal reassessment. If the breakup was your fault (or even if not), take stock of your traits and decide what you need to change. Did you smother your ex, for example? Or perhaps you were overly insecure about the fact that she had some close male friends? If these were issues, confront them head on. It might be helpful to talk to a counselor. You will learn more about your wants and needs in a relationship and how to respond to others. Even if you don’t end up back with your ex, it will be a chance to talk and grow."
    },
    {
      "title": "Keep busy.",
      "content": "Keep busy. Keep busy and happy while working on your personal growth. Breakups are emotionally difficult, and the activity will be good for your mental health and mood. Do the things that you love to do; be independent and pursue your interests. Connect with friends. Good friends are a support network. Meet them for coffee or lunch, they will make you feel better and encourage you. Renew a hobby. Paint, write, or go dancing. Don’t let the breakup stop you from doing the things that you love. Exercise. Working out will boost your mood and make you feel better about yourself, emotionally and physically."
    },
    {
      "title": "Revamp your image.",
      "content": "Revamp your image. You don’t need to change your appearance to make an ex jealous or to entice her back. However, a new wardrobe or makeover may well boost your self-esteem. There is nothing sexier than self-confidence – and consider it a bonus if she or others notice. Try a new hairstyle. Update your wardrobe. Get a stylish new pair of glasses. Grow that beard that you always wanted. The changes will put you in a fresh frame of mind. Live healthier. Eat a better diet, work out regularly, or join a gym. If you feel better about your body, you will become more self-confident in your interactions with others."
    },
    {
      "title": "Reach out to him.",
      "content": "Reach out to him. At some point, you will have to make contact with your ex. It might be easier to start with an email or text, especially if you have been out of contact for a while. Unlike the phone, both of these methods give you time to plan your response. [8] X Research source Your first tries should be brief. Send a simple message, e.g., “I was out to eat last night at (Name of your favorite restaurant) and thought of you...” or “I saw the movie X last night and remembered how much you liked it!” If you get a positive reply, wait a while before renewing contact. Be confident. Do not expect anything, and don’t pester your ex with messages. This will just seem needy and desperate. Don’t ask to meet. The aim here is just to clear the air. A meeting, if it happens, will come later. Reader Poll: We asked 1567 wikiHow readers and only 9% of them would reach out to an ex by calling and sharing their feelings. [Take Poll] A casual text or email may be the best way to reach out to your ex-lover."
    },
    {
      "title": "Ask to meet up.",
      "content": "Ask to meet up. After re-establishing contact, you will at some point have to take a risk and ask your ex to meet. You might try framing this as “catching up” rather than as a date. For example, ask whether he’d like to get coffee sometime, maybe next week, to catch up with each other. That will make the situation less stressful. Be prepared for a refusal. Try not to get angry or beg if he turns you down. Accept the refusal gracefully and wish him well. Ending the conversation on good terms will leave the door open for future contact. [9] X Research source"
    },
    {
      "title": "Have a heart-to-heart talk.",
      "content": "Have a heart-to-heart talk. You’re finally catching up with you ex over coffee. You’ve told him about all the things that you’ve done since the breakup – how you took an art class and have been singing in a choir. You’re showing your confidence and independence. Now is the time, but only if he seems open to it, to bring up your relationship and what went wrong. Pick your spot. Try to read his body language. If he becomes defensive or makes it clear that he doesn’t want to talk about the past, accept it and change topics. Tell him how you feel. Say that you’ve missed him and regret how the relationship ended. Be honest, be sincere, and say that you miss him. Maintain eye contact. Don’t look evasive or distracted. Acknowledge your mistakes and apologize. Be specific and sincere. An effective apology takes complete responsibility – no “buts” or excuses."
    },
    {
      "title": "Move forward slowly..",
      "content": "Move forward slowly.. .or move on. Your heart-to-heart talk may get the answer you’ve longed to hear. In that case, move forward slowly. Try a casual date. Be communicative and remember what issues caused the relationship to fail the first time. Be wary of falling back into old bad habits. Accept a refusal gracefully and try to move on with life. Don’t grovel or beg. At the very least, you will have closure and know that you tried as best you could to salvage the relationship."
    }
  ]
}