{
  "url": "https://www.wikihow.com/Plant-an-Avocado-Tree",
  "title": "How to Grow and Care for an Avocado Tree",
  "steps": [
    {
      "title": "Remove the pit.",
      "content": "Remove the pit. Cut into the avocado carefully, so as not to injure the pit, which is in the fruit's center. You can do this by scoring the skin/fruit about ½ an inch (1.3 cm) deep all the way around the outside, and then twisting the two halves in opposite directions to open it. Carefully remove the pit and set it aside. So that you don’t waste the fruit, use the avocado meat to create the tasty dip/topping known as guacamole ."
    },
    {
      "title": "Clean the pit.",
      "content": "Clean the pit. Wash the avocado pit gently to remove all the flesh. Use warm water and your hands, and avoid using soap. Be careful not to remove the seed cover which is light brown, as this may destroy the pit and make it less likely to grow."
    },
    {
      "title": "Insert toothpicks into the pit.",
      "content": "Insert toothpicks into the pit. Holding the pit \"narrow\" (pointed) side up, stick four toothpicks into the middle section at even intervals, just enough to give a firm hold. This will allow you to balance the pit on the inside of a cup, without completely inserting it into the cup. The pit should sit in about 1 inch of water, so keep this in mind when inserting your toothpicks."
    },
    {
      "title": "Fill a cup/jar with water.",
      "content": "Fill a cup/jar with water. Add some water to a small, slender container (preferably glass) until it reaches the top rim. Your container's opening should be wide enough to accommodate the full width of the avocado pit easily; however, make sure that it is not too wide, otherwise the toothpicks will not be able to reach and the pit will fall in."
    },
    {
      "title": "Set your avocado pit (with inserted toothpicks) on the top rim of the container.",
      "content": "Set your avocado pit (with inserted toothpicks) on the top rim of the container. The toothpicks should sit on the rim of the container, leaving 1 inch of the pit only submerged in the water. Make sure the pointed end is up and the rounded end is in the water, otherwise your avocado will not grow."
    },
    {
      "title": "Wait for the pit to sprout.",
      "content": "Wait for the pit to sprout. Set the avocado-topped container in a temperate, undisturbed place — near a window or any other well-lit area to begin rooting and the growth process."
    },
    {
      "title": "Change the water every one to two days.",
      "content": "Change the water every one to two days. Do this to ensure that contaminants (i.e. mold, bacteria, fermentation, etc.) do not hinder the avocado's sprouting process. Ensure the base of the avocado always remains moist and submerged in water."
    },
    {
      "title": "Wait patiently for the pit to sprout roots.",
      "content": "Wait patiently for the pit to sprout roots. Over the next two to three weeks, the avocado's brown outer layer will begin to dry out and wrinkle, eventually sloughing off. Soon after, the pit should begin to split open at the top and bottom. After three to four weeks, a taproot should begin to emerge at the base of the pit. [1] X Research source"
    },
    {
      "title": "Continue to water the plant accordingly.",
      "content": "Continue to water the plant accordingly. Take care not to disturb or injure the taproot. Continue to allow the avocado pit time to establish its roots. Soon, the avocado will sprout at the top, releasing an unfolding leaf-bud that will open and begin to grow a shoot bearing leaves."
    },
    {
      "title": "Select a location.",
      "content": "Select a location. Avocado trees are very particular in terms of their ideal climate and growing conditions. Most of the time, avocado trees should be planted in a pot, and moved around to meet the changing weather. Avocado trees prefer a temperature of 60 – 85°F (15.6 – 29.4°C), and established trees can handle temps as low as 28°F (-2.2°C)."
    },
    {
      "title": "Prepare the soil.",
      "content": "Prepare the soil. Avocado trees can grow in soil at almost any pH level, but it must be low in saline and have plenty of drainage. The soil does not need to be heavily fertilized until after the tree is about 1 year old. At that point, you should conduct a soil test to find out what nutrients are available/lacking in your soil. You can then get fertility recommendations based on the nutrients found in your soil. You may want to use a 10-10-10 fertilizer twice a year to help the tree out. In general, you can use regular potting soil and add some rocks to the bottom of the pot to aid in draining excess water. [2] X Research source"
    },
    {
      "title": "Prepare your plot.",
      "content": "Prepare your plot. Use a 20 – 25 cm (7.8 – 9.8 inches) terracotta pot filled with enriched soil to 2 cm (.8 inches) below the top. A 50/50 blend of topsoil and coir (coconut fibre) usually works best, but make sure you check the soil where you're planting to ensure this is the right blend. Smooth and slightly pack the soil, adding more soil as needed. Once the soil is prepared, dig a narrow hole deep enough to accommodate your avocado's roots and pit."
    },
    {
      "title": "Get the seed ready.",
      "content": "Get the seed ready. When the tree reaches 6-7 inches in height, prune it back to 3 inches. When leaves have re-grown, you are ready to plant. Remove the sprouted pit from the water container, and gently remove each of the toothpicks."
    },
    {
      "title": "Plant the avocado seed.",
      "content": "Plant the avocado seed. Carefully bury the avocado pit in the soil such the top-half of pit shows above the surface of the soil. This ensures the base of the seedling trunk doesn't rot under the soil. Pack the soil lightly around the pit."
    },
    {
      "title": "Keep the tree hydrated.",
      "content": "Keep the tree hydrated. Water your plant daily or enough to keep the soil moist. Avoid over-watering to the point the soil becomes muddy. If the leaves turn brown at the tips, the tree needs more water, while if the leaves turn yellow, the tree is getting too much water and needs to be permitted to dry out for a day or two."
    },
    {
      "title": "Maintain your avocado tree.",
      "content": "Maintain your avocado tree. Continue to tend to your avocado plant regularly, and in a few years you will have an attractive and low-maintenance tree. Your family and friends will be impressed to know that you cultivated and grew your own tree from an avocado pit salvaged from your guacamole recipe ."
    },
    {
      "title": "Obtain a good quality avocado fruit.",
      "content": "Obtain a good quality avocado fruit. Cut the fruit flesh away from the seed. It is easiest to cut it the long way around."
    },
    {
      "title": "Twist the seed to remove it.",
      "content": "Twist the seed to remove it. Whack it with a knife, then twist, and the seed will come out."
    },
    {
      "title": "Find the pointed end of the seed.",
      "content": "Find the pointed end of the seed. this is the top of the seed."
    },
    {
      "title": "Choose a planting locale.",
      "content": "Choose a planting locale. See the above method for plant positioning suggestions. Clear the sod or whatever else is there, in readiness for planting. If possible, plant two trees, as these plants like company."
    },
    {
      "title": "Place the flat end down in the soil.",
      "content": "Place the flat end down in the soil. Use your hands to mound up the loose soil around the seed. Do not stomp the dirt down with your foot as you may damage the seed this way."
    },
    {
      "title": "Follow the growing suggestions above.",
      "content": "Follow the growing suggestions above. Fertilize after you see the plant above the ground. Do not do so sooner or the root system will fail to form properly. In about three to four years, expect fruit."
    },
    {
      "title": "Harvest fruit when the avocados look big and fat.",
      "content": "Harvest fruit when the avocados look big and fat. They will not ripen on the tree. Remove and place inside a brown bag to ripen. They're ready to eat when soft."
    }
  ]
}