{
  "url": "https://www.wikihow.com/Put-a-Futon-Together",
  "title": "How to Put a Futon Together",
  "steps": [
    {
      "title": "Check to make sure you have all the parts you need.",
      "content": "Check to make sure you have all the parts you need. If you have the assembly guide for your specific model, it should tell you all the different parts you’ll need. Usually, there will be 2 stretchers, a seat deck, a back deck, and arms. Additionally, there will be some variation of screws, dowels, clevis pins, barrel nuts, cotter pins, brackets, sliders, and an allen wrench."
    },
    {
      "title": "Connect the stretchers to the arms to assemble the frame.",
      "content": "Connect the stretchers to the arms to assemble the frame. Insert a screw through a hole in the arm, and then line the screw up with the corresponding hole in the stretcher. Tighten the screw with your finger, but leave the connection a little loose for now. Now that you’re arms and stretchers are attached, this part of the futon is called the frame. [1] X Research source Continue inserting screws until there is one in every hole on the arms and the stretchers are fully connected."
    },
    {
      "title": "Connect the front and back decks.",
      "content": "Connect the front and back decks. Lay the decks on the ground and line them up along their hinge points. Different models use different connection methods, but clevis pins and cotter pins are very commonly used. Insert the pins into the hinge points so that the decks are held together. [2] X Research source"
    },
    {
      "title": "Attach your slide rollers to the back deck if necessary.",
      "content": "Attach your slide rollers to the back deck if necessary. Some futon models come with the rollers attached to the back deck already. Check to see if yours has rollers. They are small and round plastic parts that are usually black or white. If yours doesn’t have rollers already, fit them into the holes on the side of the back deck. Secure them with a clevis pin and a cotter pin, or using the connection method of your specific model."
    },
    {
      "title": "Place the assembled deck into the frame.",
      "content": "Place the assembled deck into the frame. Lower the deck into the frame, placing the rollers into the grooves that run along the arms."
    },
    {
      "title": "Tighten all the screws for the stretchers with a screwdriver.",
      "content": "Tighten all the screws for the stretchers with a screwdriver. Earlier, you left the screws attaching the arms and stretchers a little loose. Now that the deck is in place, tighten them. Turn them with a screwdriver until you can’t tighten them anymore."
    },
    {
      "title": "Check to make sure the futon can convert.",
      "content": "Check to make sure the futon can convert. By gently lifting the deck of the futon, it should convert from a bed into a couch. If it is not moving easily, your rollers may not be in place. Check to see that the rollers are in the grooves of the arms. If they aren’t, loosen the screws, fit the rollers into the grooves, and then tighten the screws again."
    },
    {
      "title": "Lay the mattress in place.",
      "content": "Lay the mattress in place. Make sure the futon is lying flat. Then pick up the mattress and lay it onto the flat deck of the futon."
    },
    {
      "title": "Make sure you have all the parts you need.",
      "content": "Make sure you have all the parts you need. If you have the assembly guide for your specific model, it will give you information on what parts you need to successfully assemble your tri-fold futon. In most cases, you will need 2 stretchers, 2 arms, a slat rack with 3 sections, screws, barrel nuts, sliders, clevis pins, cotter pins, and an allen wrench."
    },
    {
      "title": "Assemble the frame by connecting the stretchers to the arms.",
      "content": "Assemble the frame by connecting the stretchers to the arms. Place a screw through a hole in the arm. Then line up the screw with the corresponding hole in the stretcher. Tighten the screw with your finger, but don’t use a screwdriver yet. It will be easier to fit the slats in if the connection is a little loose. Repeat this process until the screws are connecting both stretchers to both arms through each hole. The stretchers connected to the arms makes up the frame of the futon."
    },
    {
      "title": "Attach the slide rollers to the slats if they aren’t already attached.",
      "content": "Attach the slide rollers to the slats if they aren’t already attached. Some tri-fold futons will come with the slide rollers attached to the slats. Slide rollers are small and circular, and they are usually either white or black. If the rollers are not already place, simply push them into the holes in the side of the slats. Then attach them with a clevis pin and a cotter pin."
    },
    {
      "title": "Lay the slats onto the frame and set the rollers in place.",
      "content": "Lay the slats onto the frame and set the rollers in place. Guide the slide rollers into the grooves in the arms of the frame. Since the screws are not tightened, it should be easy to pull the arms back slightly to help guide the second set of rollers into place. Once all the rollers are in their grooves. The slats should rest easily over the stretchers."
    },
    {
      "title": "Tighten all the screws connecting the arms and stretchers.",
      "content": "Tighten all the screws connecting the arms and stretchers. Using a screwdriver, turn all the screws until you cannot tighten them any further."
    },
    {
      "title": "Check to make sure the futon can change positions.",
      "content": "Check to make sure the futon can change positions. Pick up the front of the slats and gently push it towards the back of the futon. The slats should fold easily, turning the frame into a couch. Lift the front end again and pull it out to turn the futon back into a bed. If your futon isn’t changing positions easily, the rollers may not be in place. Check to make sure your rollers are all in their grooves. If the rollers aren’t in their grooves, loosen the screws, guide the rollers into the grooves, and then tighten the screws again."
    },
    {
      "title": "Place the mattress onto the slats.",
      "content": "Place the mattress onto the slats. Make sure the slats of your futon are lying flat. Lift up your mattress and lay it against the flat slats."
    },
    {
      "title": "Check to make sure you have all necessary parts.",
      "content": "Check to make sure you have all necessary parts. If you have the assembly guide for your model, it should tell what parts you need. Typically, you will need 6 base boards, 3 slat racks that are strapped together, wood screws, clevis pins, and cotter pins."
    },
    {
      "title": "Attach the base boards together.",
      "content": "Attach the base boards together. Find the hinge points of your base boards. These will holes that run through the boards. Place 1 base board on top of another and align the 2 at the hinge points. Then connect the 2 with a clevis pin and a cotter pin, or whatever connection method your model uses. Connect a second base board to the other end of one of these boards. Make sure that the 2 base boards connected to the center board are on the same side of the center board, so that the center board look like it is behind or in front of the other 2. Repeat this process with the other set of 3 boards."
    },
    {
      "title": "Attach the slat racks to the base boards with wood screws.",
      "content": "Attach the slat racks to the base boards with wood screws. Lay the slat racks against your connected base boards. Line up the holes in the slat racks with the holes in the base boards. Place a wood screw through these holes and tighten them with a screw driver. Repeat until the slats are connected to the boards through each hole. The amount of screws you’ll need varies, but there are often 12."
    },
    {
      "title": "Check to make sure the futon works.",
      "content": "Check to make sure the futon works. Lift up the front end and gently slide it forwards until the futon converts into a couch. If it does not work, check to make sure all the hinge points of the base boards are joined together with the connections you need, usually clevis pins and cotter pins."
    },
    {
      "title": "Lay the mattress down on the futon.",
      "content": "Lay the mattress down on the futon. Pull the futon out so that the slats are lying flat. Then lift the mattress and set it down on top of the slats. Now you should be able to enjoy your futon as either a bed or a couch!"
    }
  ]
}