{
  "url": "https://www.wikihow.com/Pay-Verizon-Residential-Phone-Bill",
  "title": "How to Pay Verizon Residential Phone Bill",
  "steps": [
    {
      "title": "Visit the Verizon website provided in the Sources section of this article.",
      "content": "Visit the Verizon website provided in the Sources section of this article."
    },
    {
      "title": "Click on \"Paying Your Verizon Bill in Person\" and select the \"online\" link.",
      "content": "Click on \"Paying Your Verizon Bill in Person\" and select the \"online\" link. This process will take you to a page that allows you to find the nearest Verizon payment location. If you do not have Internet access, call Verizon's customer service at 1-800-922-0204 between the hours of 6 a.m. and 11 p.m. daily to find the nearest payment center."
    },
    {
      "title": "Bring payment for your bill and a page from your residential phone bill that displays your Verizon account number.",
      "content": "Bring payment for your bill and a page from your residential phone bill that displays your Verizon account number. You can bring payment in the form of cash, checks, or money orders. Some Verizon payment centers may charge convenience fees for making a payment in person. Your bill payment will be posted to your Verizon account within 3 business days."
    },
    {
      "title": "Obtain a check or money order for the bill payment amount.",
      "content": "Obtain a check or money order for the bill payment amount."
    },
    {
      "title": "Write your Verizon account number at the top of your check or money order.",
      "content": "Write your Verizon account number at the top of your check or money order."
    },
    {
      "title": "Send your payment and the remittance bill stub to:",
      "content": "Send your payment and the remittance bill stub to: Verizon Remittance Processing Center, P.O. Box 9688, Mission Hills, California 91346-9688. Your payment will be posted to your account as soon as Verizon receives your check in the mail."
    },
    {
      "title": "Go to the Verizon website listed in the Sources section of this article.",
      "content": "Go to the Verizon website listed in the Sources section of this article."
    },
    {
      "title": "Click on \"Pay Your Bill Online\" to access your My Verizon online account.",
      "content": "Click on \"Pay Your Bill Online\" to access your My Verizon online account."
    },
    {
      "title": "Log in with your User ID and password in the fields provided.",
      "content": "Log in with your User ID and password in the fields provided. If you have not set up a My Verizon account, click on \"Register Now\" and follow the prompts to set up an online profile."
    },
    {
      "title": "Click on the link for \"Account\" and select \"Payment.\"",
      "content": "Click on the link for \"Account\" and select \"Payment.\""
    },
    {
      "title": "Enter your checking account or credit card information in the fields provided.",
      "content": "Enter your checking account or credit card information in the fields provided. If you want to enroll for Verizon Auto Pay and have the bill due amount taken from your checking account or credit card monthly, click on \"Auto Pay\" under \"Account Services\" on the right, then select \"Enroll.\" You will then be prompted to enter the details of your payment method. If you cannot pay the full bill amount by the due date, Verizon will allow you to set up a payment arrangement online. In the \"Payment\" section, select \"Payment Arrangements\" and either re-schedule your due date for the current bill or select 2 different days on which you need to split up bill payments."
    }
  ]
}