{
  "url": "https://www.wikihow.com/Put-Prices-on-Instagram",
  "title": "How to Put Prices on Instagram",
  "steps": [
    {
      "title": "Launch the Instagram app on your phone or tablet.",
      "content": "Launch the Instagram app on your phone or tablet. Look for the icon that has a white camera over a multicolor background on your home screen or app menu. Make sure you meet the requirements to enable Instagram Shopping. You must have a business profile and a product catalog. [1] X Research source Follow the steps in the linked wikiHow to add a catalog and turn on Instagram Shopping."
    },
    {
      "title": "Tap the plus sign + to create a new post.",
      "content": "Tap the plus sign + to create a new post. This is at the bottom of the screen."
    },
    {
      "title": "Add a photo or video.",
      "content": "Add a photo or video. Tap Gallery to find saved one to your phone or tablet, or tap Photo or Video to capture one. Tap the photo or video to add it. Select multiple to add more."
    },
    {
      "title": "Edit the photo or video and tap Next.",
      "content": "Edit the photo or video and tap Next . Tap the options at the bottom to add filters and adjust the photo or video."
    },
    {
      "title": "Tap Tag Products.",
      "content": "Tap Tag Products . This is near the top, right below Tag people ."
    },
    {
      "title": "Tap on the photo.",
      "content": "Tap on the photo. All of the products from your Facebook store will appear."
    },
    {
      "title": "Tap a product to select it.",
      "content": "Tap a product to select it. You can select multiple products (up to 5 for a single-image post). Use the search bar at the top to find products by name."
    },
    {
      "title": "Move the tag or tags to the correct spot in the image.",
      "content": "Move the tag or tags to the correct spot in the image. Tap and drag to move a tag."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . This is in the top right corner."
    },
    {
      "title": "Finish the post and tap Share.",
      "content": "Finish the post and tap Share . Add a caption or a location if you wish."
    },
    {
      "title": "Tap Share.",
      "content": "Tap Share . Your product tag will need to be reviewed and accepted by Instagram before it will appear on your posts."
    },
    {
      "title": "Launch the Instagram app on your phone or tablet.",
      "content": "Launch the Instagram app on your phone or tablet. Look for the icon that has a white camera over a multicolor background on your home screen or app menu. Make sure you meet the requirements to enable Instagram Shopping. You must have a business profile and a product catalog. Follow the steps in the linked wikiHow to add a catalog and turn on Instagram Shopping."
    },
    {
      "title": "Launch the Instagram app on your phone or tablet.",
      "content": "Launch the Instagram app on your phone or tablet. Look for the icon that has a white camera over a multicolor background on your home screen or app menu."
    },
    {
      "title": "Navigate to your profile .",
      "content": "Navigate to your profile . Tap the profile icon in the bottom right corner of the app."
    },
    {
      "title": "Find a post to edit.",
      "content": "Find a post to edit. Scroll through your posts, and tap on the photo or video that you wish to add a price to."
    },
    {
      "title": "Tap the 3 dots to edit the post.",
      "content": "Tap the 3 dots to edit the post. This is in the top-right corner of the post."
    },
    {
      "title": "Select Tag Products.",
      "content": "Select Tag Products . You will be taken to a window with all your products."
    },
    {
      "title": "Tap a product to select it.",
      "content": "Tap a product to select it. You can select multiple products (up to 5 for a single-image post). Use the search bar at the top to find products by name."
    },
    {
      "title": "Move the tag or tags to the correct spot in the image.",
      "content": "Move the tag or tags to the correct spot in the image. Tap and drag to move a tag."
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . This is in the top right corner."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . Your product tag will need to be reviewed and accepted by Instagram before it will appear on your posts."
    }
  ]
}