{
  "url": "https://www.wikihow.com/Sanpaku-Eyes-Death",
  "title": "All About the Sanpaku Eye Superstition",
  "steps": [
    {
      "title": "Sanpaku eyes are irises that are surrounded by white on 3 sides.",
      "content": "Sanpaku eyes are irises that are surrounded by white on 3 sides. The word (written as 三白 in Japanese) literally translates to “three” (san) and “white” (paku), referring to the white sclera that’s visible around 3 sides of a person’s iris. [1] X Research source According to superstition, this extra portion of white can appear either below or above a person’s iris. [2] X Research source In non-sanpaku eyes, the iris directly borders the upper and lower eyelids, and the white sclera are only visible on the left and right sides of the eyes."
    },
    {
      "title": "Sanpaku eyes are associated with tragedy and violence.",
      "content": "Sanpaku eyes are associated with tragedy and violence. People with sanpaku eyes typically fall into 1 of 2 categories: yin sanpaku and yang sanpaku. Individuals with yin sanpaku have sclera visible beneath their iris, and are supposedly more likely to develop an illness or die a tragic death. Those with yang sanpaku, or sclera that’s visible above the iris, are thought to be more violent towards others. [3] X Research source Celebrities like Princess Diana, JFK, Abraham Lincoln, Marilyn Monroe, Jim Morrison, Elvis Presley, and Audrey Hepburn are infamously known for having yin sanpaku eyes. Murderous cult leader Charles Manson is an infamous example of yang sanpaku eyes."
    },
    {
      "title": "The superstition was popularized by George Ohsawa in the 1960s.",
      "content": "The superstition was popularized by George Ohsawa in the 1960s. In his 1965 book titled You Are All Sanpaku (published under his pen name Sakurazawa Nyoiti), Ohsawa introduces sanpaku as “a condition of the human eye which presents three white sides or areas around the iris.” According to Ohsawa, the concept of sanpaku has existed in the realm of Eastern philosophy for millennia and is a sign of physical, spiritual, or physiological imbalance. In his book, Ohsawa advocates for the macrobiotic diet, which he claims can cure those who are sanpaku. [4] X Research source The macrobiotic diet, originally created by Ohsawa, is a combination of dietary suggestions (like making your diet 40-60% whole grains, 20-30% produce, and 10-25% bean products) and lifestyle practices (not using microwaves, staying away from caffeine and alcohol, and more). [5] X Research source Modern health experts warn that diets like this one aren’t always the healthiest, and can lead to nutrient deficiencies (like vitamins, iron, protein, and calcium). [6] X Trustworthy Source Cancer Research UK U.K.-based cancer research and advocacy charity Go to source"
    },
    {
      "title": "Yin Sanpaku (Below)",
      "content": "Yin Sanpaku (Below) According to superstition, people with yin sanpaku eyes (where white sclera can be seen beneath the iris) are more likely to run into some sort of danger, either at someone else’s hands or their own. People with this type of sanpaku are supposedly more likely to get involved with drugs or alcohol or otherwise face a tragic death. [7] X Research source In his book, Ohsawa calls this sanpaku “a sign from nature that one’s life is threatened by an early and tragic end.” He then cites examples of historical figures who had sanpaku and suffered an early, tragic death, like JFK, Marie Antoinette, Abraham Lincoln, and Archduke Ferdinand."
    },
    {
      "title": "Yang Sanpaku (Above)",
      "content": "Yang Sanpaku (Above) While people with yin sanpaku are most likely to be victims of tragedy and violence, people with yang sanpaku are more likely to be perpetrators of tragedy and violence. [8] X Research source As far as superstition goes, people with visible white above their eyes are often violent towards others. [9] X Research source Ohsawa doesn’t really discuss yang sanpaku specifically in his book, but it’s still widely considered part of sanpaku lore."
    },
    {
      "title": "Natural causes",
      "content": "Natural causes “Sanpaku eyes” isn’t actually an official medical term or condition (a more medically accepted term in the West is “scleral show”). Some people’s eyelids just develop to show more of the sclera—it doesn’t have anything to do with a person’s health, personality, or fate. [10] X Research source A scleral show can also happen naturally as you age, depending on your eye size and cheek structure. You can also “give” yourself sanpaku by widening your eyes and/or tilting your head a certain way."
    },
    {
      "title": "Physical trauma",
      "content": "Physical trauma If you’ve broken any of your facial bones in the past, the healing and scarring process might have caused your lower eyelid to cover a bit less of your sclera. [11] X Research source"
    },
    {
      "title": "Ectropion",
      "content": "Ectropion Ectropion causes a person’s lower eyelid to rotate outward, which makes more of the lower sclera visible. Depending on the severity of the condition, a doctor might recommend certain ointments, artificial tears, or even surgery, which is the most effective way to fix the eyelid. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source A lot of different factors can lead to ectropion, including muscular weakness, facial paralysis, or genetic disorders."
    },
    {
      "title": "Lower blepharoplasty complications",
      "content": "Lower blepharoplasty complications After a blepharoplasty (eyelid surgery), some patients experience a scleral show and ectropion around their eyelids. [13] X Research source If you’re experiencing this after your procedure, talk with your surgeon and see what your options are. Keep in mind that it takes weeks and even months to completely heal from a blepharoplasty. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Sanpaku eyes don’t signify an early death or violent future.",
      "content": "Sanpaku eyes don’t signify an early death or violent future. All of those TikTok conspiracy theory videos can seem really convincing, especially when they show tons of celebrities who are apparent “victims” of the sanpaku curse. Truthfully, the deaths of these people are all just sad coincidences—plenty of famous people without sanpaku eyes have died in tragic ways (or perpetuated violence against others). At the end of the day, superstitions are only as powerful as you allow them to be. Once you recognize the control and independence you have within your own life, the sanpaku “curse” doesn’t seem so scary."
    },
    {
      "title": "The sanpaku belief was popularized to promote a specific diet.",
      "content": "The sanpaku belief was popularized to promote a specific diet. While the sanpaku superstition existed long before the 1960s, it was George Ohsawa’s discussion and explanation of the belief that really made it popular in Western society. In his book You Are All Sanpaku , Ohsawa claims that “nearly every American he has seen is more or less sanpaku,” and uses this “fact” to promote the macrobiotic diet (a diet he is historically credited for creating). [15] X Research source In many ways, you could argue that this popularized superstition originated as a marketing scheme—not as a true predictor of someone’s fate."
    }
  ]
}