{
  "url": "https://www.wikihow.com/Rat-Tail-Hair",
  "title": "How to Get a Rat Tail (Plus Variations & Style Tips)",
  "steps": [
    {
      "title": "A rat tail is a long section of hair at the nape of your neck.",
      "content": "A rat tail is a long section of hair at the nape of your neck. Rat tails, like mullets, are short in front and long in back. However, unlike the mullet, the rat tail is usually a very small section, maybe a square inch (2 square centimeters) at the base of the hairline, and the rest of the hair is usually cut pretty short. When preparing to grow or cut your own rat tail, you can make the section as large or small as you like."
    },
    {
      "title": "Grow your hair at least two inches (5 cm).",
      "content": "Grow your hair at least two inches (5 cm). Technically, you can start a rat tail at any length, but if you want a flowing strand of hair right off the bat, wait until your hair is a couple of inches (around 5 cm) down your neck."
    },
    {
      "title": "Section a small amount of hair at the back of your neck.",
      "content": "Section a small amount of hair at the back of your neck. The traditional rat tail sits at the very bottom of your hairline, but you can choose any area you’d like. Usually, rat tails are very small, only a square inch or so (2 sq cm), but some styles (like the several-strand rat tail) require a larger strip of hair. [1] X Research source You can make the section in any shape you’d like, but you may find it easier to braid, loc, or twist your hair if it’s in a square."
    },
    {
      "title": "Cut the rest of your hair short, leaving the rat tail long.",
      "content": "Cut the rest of your hair short, leaving the rat tail long. Tie the section off with an elastic, then cut the rest of your hair shorter. You don’t have to cut everything off, though, as long as your rat tail is visibly longer. If you want to experiment even further with your hair, try out another rat tail style! As you grow out your rat tail, you can have even longer hair around it. Try adding a rat tail the next time you get a bob, lob, or even a trim. Just ask your hairstylist not to cut the strand you want to grow out."
    },
    {
      "title": "Classic",
      "content": "Classic This is the rat tail’s rat tail. It can be long or short, skinny or fat, braided, tied back, or left free-flowing. Just tie off a section of hair at the base of your hairline, then cut everything around it short. For a more polished look, consider going to a hairstylist and asking them to blend the rat tail into the back of your hair. If you’re cutting your hair very short, you may want to use the pointed end of a rat tail comb (no pun intended) to give your section straight lines."
    },
    {
      "title": "Skull rat",
      "content": "Skull rat The skull rat is a more punk/countercultural hairstyle. To get it, shave your entire head, minus the rat tail in the back. [2] X Research source You can also add sideburns or bangs if you’re feeling funky. Just tie off the sections of hair you don’t want to shave."
    },
    {
      "title": "Micro-rat",
      "content": "Micro-rat Get a micro-mini rat tail by grabbing a small section of hair, the width of about 4 pieces of spaghetti. Cut the rest of your hair around it to create the tail. If you’d like a bolder look, try cutting a fade above it. [3] X Research source"
    },
    {
      "title": "Undercut",
      "content": "Undercut For this haircut, you can either move the rat tail up the back of your head, or you can separate it from the rest of your hair. Give yourself an undercut by shaving roughly the bottom third of your hair, then tie off a small section at your new hairline and cut the surrounding hair short. [4] X Research source Alternatively, you can section off a piece at the nape of your neck, then shave above it."
    },
    {
      "title": "Padawan braid",
      "content": "Padawan braid One of the most prevalent rat tails in popular culture is the Padawan braid from Star Wars . Unlike the regular rat tail, the Padawan braid begins on the side of the head. Section off a small section behind your ear at the hairline, braid it, and then cut the rest of your hair short. [5] X Research source You can also use embroidery floss to wrap the braid. In Star Wars , Padawan braids are always on the right side of the head. [6] X Research source"
    },
    {
      "title": "Dreadlock",
      "content": "Dreadlock Section off a small square of hair at the back of your neck, then start the loc by backcombing the tip until the hair sticks together. Make a split in the section above the tip, then bring the tip through the split and pull down. Make a new split 120º away from the first one, then wrap the tip through again. Keep splitting and wrapping until you reach your scalp. [7] X Research source You may have to use a crochet tool as you get near your scalp. Loosen the loc by running a crochet tool into it back and forth at a 90º angle."
    },
    {
      "title": "Several strands",
      "content": "Several strands For this look, section off a large strip of hair at the nape of your neck. Cut your hair short around it, then break the section into several strands. Braid, tie off, loc, or twist the strands to give yourself many rat tails."
    },
    {
      "title": "Frosted tips",
      "content": "Frosted tips You can either frost the tip of your rat tail, or you can just rock frosted tips on top. Bleach the very ends of your hair, then wait for about 10 minutes—just long enough for it to dry. Apply bleach again, this time going a little further up the strand. [8] X Research source Wait another ten minutes, then wash the bleach out."
    },
    {
      "title": "Dyed rat tail",
      "content": "Dyed rat tail For this easy style, just bleach your rat tail (if you have dark hair) and then dye it."
    },
    {
      "title": "The original rat tail hairstyle may have been the Polynesian “horsetail.”",
      "content": "The original rat tail hairstyle may have been the Polynesian “horsetail.” There is a chance that the “horsetail,” a Samoan hairstyle, was the original inspiration for the rat tail. Some people believe that the horsetail comes from the pakoti rouru hair-cutting ceremony, where boys have plaits of hair cut off their heads. [9] X Research source However, all the strands are removed, which makes it unlikely that this is the origin of the horsetail."
    },
    {
      "title": "The rat tail has been confused with the queue hairstyle.",
      "content": "The rat tail has been confused with the queue hairstyle. The queue is an ancient Chinese hairstyle where the front section of the head is shaved and the back is long (and often braided). While this hairstyle has also been a symbol of revolution and social dissent, it’s likely not related to the rat tail. [10] X Research source"
    },
    {
      "title": "Rat tails may have come to America and Australia during the Vietnam War.",
      "content": "Rat tails may have come to America and Australia during the Vietnam War. The devastation of the Indochina wars forced Vietnamese, Laotian, and Cambodian people to flee the colonial powers in their countries. [11] X Research source Young people may have brought something like the rat tail into the Western communities they joined."
    },
    {
      "title": "Rat tails became popular in Western punk communities in the 80s.",
      "content": "Rat tails became popular in Western punk communities in the 80s. The punk movement of the 70s and 80s was a radical countercultural movement that primarily focused on social inequalities that affect the working class. [12] X Research source Punks used their hair, in part, to show that they dissented from the cultural norms around them. And one style was…the rat tail! Since the rat rail may have been pioneered by young refugees, it makes sense that it would pop up in countercultural movements, as people fleeing American and French violence in their home countries would likely not conform to those countries’ cultures. The rat tail may have gained popularity due to the overwhelming amount of mullets present in the punk community at the time."
    },
    {
      "title": "They fell out of style due to classist stereotypes.",
      "content": "They fell out of style due to classist stereotypes. Since rat tails are so visible and were so closely linked to working-class counterculture movements, they began to be associated with classist stereotypes. [13] X Research source Rat tails became associated with unemployment, low IQs, and juvenile delinquency. Rat tails were then banished to the realm of young boys’ haircuts."
    },
    {
      "title": "Rat tails are making a comeback in the queer community.",
      "content": "Rat tails are making a comeback in the queer community. Since the mullet became so popular in the queer and countercultural spheres of the last few years, the rat tail has come to take its place in the supersaturation of business in front, party in back. Queer collectives like PONYBOY have brought rat tails onto the runway, as well."
    },
    {
      "title": "Many celebrities have rocked the rat tail.",
      "content": "Many celebrities have rocked the rat tail. Throughout its history, the rat tail has persisted on the heads of some celebrities and game developers, who have championed the style into a new era. Some big-name rat tail rockers are: The Weeknd’s character in The Idol . Jordan Knight, member of New Kids On The Block. Shia LaBeouf, actor. Evan Mock, male model. David Bowe, performer. Miley Cyrus, performer. Richard Garriott, game developer."
    }
  ]
}