{
  "url": "https://www.wikihow.com/Make-a-Vodka-Watermelon",
  "title": "How to Make Watermelon Vodka in a Watermelon",
  "steps": [
    {
      "title": "Trace a circle onto the watermelon rind using your vodka bottle’s cap.",
      "content": "Trace a circle onto the watermelon rind using your vodka bottle’s cap. A day or 2 before your party, pick up a whole, seedless watermelon and a bottle of vodka with a slender neck. Set the watermelon on a serving tray or in a bowl so that it sits completely still. Open the bottle and use the cap to trace a circle onto the top side of the watermelon using a pen. It’s important to make sure your watermelon sits still without rolling over. If it’s not stable, you’ll end up with a sloshy, pink mess in your refrigerator! Cut a thin slice from the rind at the base of the watermelon, if necessary, so that it doesn’t rock back and forth or spin around. But just don’t cut deep into the edible flesh or else the watermelon might leak. [1] X Research source It may take between 12 and 24 hours to fully infuse the watermelon, so be sure to plan ahead. [2] X Research source"
    },
    {
      "title": "Cut out the circle to create a hole in the watermelon.",
      "content": "Cut out the circle to create a hole in the watermelon. Use a narrow kitchen knife or a pumpkin carving tool to cut out the hole you just traced. Pierce through the rind and cut down through the greenish-white layer until you reach the pink part. Keep the cut-out piece of watermelon to use as a plug if you intend to transport the watermelon, or feel free to discard it. [3] X Research source"
    },
    {
      "title": "Poke holes into the pink watermelon flesh using a skewer.",
      "content": "Poke holes into the pink watermelon flesh using a skewer. Extend the pointed end of a barbeque skewer into the round hole you just cut. Press it into the watermelon, puncturing the pink fleshy part as if you’re aerating it. Repeat this a few dozen times until you’ve created plenty of spots for the alcohol to seep into. [4] X Research source Avoid pushing the skewer through the other side of the rind as the vodka might seep out. This step is essential in creating a successful vodka watermelon. If you skip it, the alcohol won’t really seep into the fruit at all."
    },
    {
      "title": "Pour vodka into the watermelon through a funnel.",
      "content": "Pour vodka into the watermelon through a funnel. It takes a while for the vodka to soak into the watermelon, so don’t just shove the bottle into the hole and expect it to work. Instead, set a funnel into the round hole at the top of the watermelon. Pour vodka into the funnel until it fills up, then leave the watermelon in the refrigerator while the liquid seeps in. [5] X Research source Try adding about 0.5 to 1 c (120 to 240 mL) of vodka during each pour. [6] X Research source Press the base of the funnel gently into the pink flesh to help stabilize it. If you have a 10 lb (4.5 kg) watermelon, it’ll absorb around 3 c (710 mL) of vodka total. This could take between 3 to 6 pours, depending on the size of your funnel. [7] X Research source"
    },
    {
      "title": "Wait until the vodka seeps into the watermelon before refilling the funnel.",
      "content": "Wait until the vodka seeps into the watermelon before refilling the funnel. Once the vodka from your first pour has soaked into the holes in your watermelon, you can refill it once again. Repeat this process a few times until the watermelon is totally saturated. If the vodka from your first pour doesn’t seep in after 3 or 4 hours, try poking more holes into the flesh using a skewer, or use a spoon to break up and scoop out some of the flesh to create more space. You’ll know the watermelon is full when it stops absorbing more vodka and your funnel doesn’t drain out. Once the watermelon has been totally infused with vodka, you’ll see a sloshy pink liquid inside instead of the firm melon flesh."
    },
    {
      "title": "Refrigerate your vodka watermelon overnight before the party.",
      "content": "Refrigerate your vodka watermelon overnight before the party. Cover the hole with some plastic wrap and chill down your novelty drink in the fridge for about 8 hours. Keep it totally upright so the insides don’t spill out. [8] X Research source"
    },
    {
      "title": "Serve the vodka watermelon drink immediately after removing it from the fridge.",
      "content": "Serve the vodka watermelon drink immediately after removing it from the fridge. This novelty drink is best served chilled, so don’t let it sit out for very long. Have someone hold a cup over the hole in the watermelon rind. Then tip the whole watermelon over to pour out the drink. Do this carefully, but have fun making a spectacle of your novelty cocktail and its dispenser! If you'd like, pop the overturned vodka bottle into the hole for a fun display. Just keep the cap on so you don’t overfill the watermelon and make a mess. [9] X Research source You won’t be able to slice and serve watermelon chunks; the result of this process will be a boozy fruit juice. Avoid putting a tap into the hole; fruit chunks will clog it up. [10] X Research source"
    },
    {
      "title": "Slice off the bottom and top off of the watermelon.",
      "content": "Slice off the bottom and top off of the watermelon. Use a large kitchen knife to cut off a sliver on the base of the watermelon rind. Don’t go through the pink flesh; just cut away a thin part of the rind so that the watermelon will be stable sitting on a serving tray. Then chop off a thicker sliver from the top of the watermelon to expose the pink flesh. [11] X Research source The less you cut off of the top of the watermelon, the deeper your punch bowl will be. Try shaving off a piece that’s about 0.5 to 1 in (1.3 to 2.5 cm) thick from the bottom of the watermelon, and another about 2 to 3 in (5.1 to 7.6 cm) thick from the top."
    },
    {
      "title": "Scoop out the pink watermelon flesh using a melon baller.",
      "content": "Scoop out the pink watermelon flesh using a melon baller. Scrape a melon baller into the pink flesh, like you would when scooping ice cream, to create round watermelon balls. Set these aside in a large bowl. Continue scooping out the watermelon until nearly all of the pink flesh has been removed. Leave a thick layer of greenish-white rind around the base of the hollowed-out watermelon. [12] X Research source If you don’t have a melon baller, try an ice cream scoop, a spoon, or a cookie dough scoop instead. Focus on making neat, circular watermelon balls if you plan to serve them whole. But if you’re going to blend up the fruit, feel free to remove the flesh in chunks."
    },
    {
      "title": "Soak the watermelon balls in vodka for a few hours to prepare a fruit-filled cocktail.",
      "content": "Soak the watermelon balls in vodka for a few hours to prepare a fruit-filled cocktail. Pour about 3 c (710 mL) of vodka into the bowl containing the watermelon balls. Cover the bowl with plastic wrap and chill the vodka and balled fruit in the refrigerator for around 3 to 4 hours. [13] X Research source With this method, you’ll be able to fill your guests’ glasses with pink watermelon-infused vodka and floating fruit bits. Place the rind in the freezer while the alcohol and fruit chill in the fridge. This way, your watermelon punch bowl will keep the drink cool during the party."
    },
    {
      "title": "Marinate the watermelon balls in vodka briefly to serve them as a snack.",
      "content": "Marinate the watermelon balls in vodka briefly to serve them as a snack. Prepare these by pouring about 1 to 2 c (240 to 470 mL) of vodka over the watermelon balls. Allow them to soak in the refrigerator for 30 minutes, then drain out the liquid. Freeze the watermelon balls for 4 hours before serving them on a tray or inside the hollowed-out watermelon rind. [14] X Research source Try serving the whole watermelon balls whole if you’d prefer a refreshing, boozy, bite-sized snack to a beverage. After draining the watermelon balls, save and refrigerate the remaining watermelon-infused vodka for future cocktails. If you soak the balled fruit for any longer, it will become mushy and would be better served in a drink."
    },
    {
      "title": "Blend and strain the watermelon flesh if you prefer a boozy fruit juice.",
      "content": "Blend and strain the watermelon flesh if you prefer a boozy fruit juice. Use a blender or food processor to liquefy the watermelon chunks. Do this in batches, as you’ll have lots of fruit to blend. Once you’re done blending, pour the liquid through a mesh sieve to strain out the little chunks and seeds. [15] X Research source Add about 3 c (710 mL) of vodka and chill your drink in a large bowl for about 3 hours before serving it in the watermelon punch bowl. Keep the watermelon rind in the freezer while the drink chills down. This way, it’ll keep your drink cool when you’re ready to serve it."
    },
    {
      "title": "Serve the boozy fruit in the hollowed-out watermelon bowl.",
      "content": "Serve the boozy fruit in the hollowed-out watermelon bowl. If you’ve made a boozy blended watermelon beverage or a fruit-filled vodka drink, carefully pour the liquid into the hollowed-out watermelon rind. Use a punch ladle to fill up your guests’ glasses. Alternatively, if you’ve soaked some watermelon balls to serve whole, arrange these in the watermelon bowl and serve them with toothpicks or a serving spoon. [16] X Research source For a communal cocktail experience set the watermelon punch bowl in the center of the table and grab a bunch of straws. This way, your friends can slurp down your boozy concoction together. [17] X Research source"
    }
  ]
}