{
  "url": "https://www.wikihow.com/Plant-Rye-Grass",
  "title": "How to Plant Rye Grass",
  "steps": [
    {
      "title": "Choose the right time of year.",
      "content": "Choose the right time of year. It’s crucial that you plant your ryegrass during the correct season so that it germinates properly. The air temperature should reach between 60 and 75 degrees Fahrenheit (16 to 24 degrees Celsius) during the day. It’s best to plant rye seed when the temperatures reach that point but may begin to fall in a few weeks (planting rye seed before it starts getting hotter can cause the rye to die). [1] X Research source"
    },
    {
      "title": "Choose the type of rye seed.",
      "content": "Choose the type of rye seed. Rye seed comes in two versions – annual and perennial. The annual seed does not germinate as well as the perennial, which means you’ll need to use more of the annual variety to get the same lush look you could achieve with the perennial. You also have the option of using sod, which is pre-grown patches of rye that you purchase from a nursery and then lay over your prepared planting area. [2] X Research source"
    },
    {
      "title": "Fill in your soil as needed.",
      "content": "Fill in your soil as needed. Whether you are seeding or sodding ryegrass, you’ll need to fill in the existing soil so that it reaches the correct depth for your ryegrass - about 4 to 6 inches (9 to 12 cm). You can use topsoil to fill in low areas, but the composition should have less than 20% clay, and it should not contain any herbicides."
    },
    {
      "title": "Add fertilizer to the soil.",
      "content": "Add fertilizer to the soil. This will give the soil the nutrients necessary for your ryegrass to grow well. Phosphorous and potassium fertilizer are your best options for use with ryegrass."
    },
    {
      "title": "Till the soil for new growth.",
      "content": "Till the soil for new growth. If you’re planting rye seed on new soil, it needs to be tilled. This allows oxygen to get into the soil. It also breaks up clumps of soil, allowing the rye seed to germinate. Evenly till the soil to ensure even growth of your rye seed."
    },
    {
      "title": "Mow the existing lawn if necessary.",
      "content": "Mow the existing lawn if necessary. This is crucial if you’re growing ryegrass in an area that is a permanent lawn - that has other grasses or plant growth during other times of the year. Mowing the existing lawn as short as possible will give the rye seed more room to take to the ground."
    },
    {
      "title": "Use more annual seed.",
      "content": "Use more annual seed. If you’re using the annual variety of ryegrass seed, you’ll need to spread more than you would with the perennial variety. You generally need 15 to 20 lbs (7 to 9 kgs) per 1000 square feet (9.5 square km) when you’re using annual seed. Perennial seed should be spread at 10 lbs (5 kgs) per 1000 square feet. These amounts apply equally to overseeding an existing lawn and seeding new soil."
    },
    {
      "title": "Divide the seed in half.",
      "content": "Divide the seed in half. You should divide the amount of seed that you need to use in half. Spread one half of it in one direction, and then spread the second half of the seed perpendicular to your first planting direction. This will help ensure an even spread of your seed. Depending on the size of your lawn, you may want to use either a push spreader or a hand spreader to spread the rye seed. Hand spreaders are typically used for small lawns that have large amounts of detail, while push spreaders may be best for larger lawns or new soil with larger open areas."
    },
    {
      "title": "Rake the seed into the soil.",
      "content": "Rake the seed into the soil. Using a metal rake, rake the seed into the soil to ensure most of it gets into the soil (rather than lying on top). Rake gently - you don't want to move the seed around too much, and you don't want to damage the soil. [3] X Research source If you're overseeding an existing lawn, it might be hard to rake the seed into the soil. If you can't rake an existing lawn, that's fine. The existing growth - even if it's short - should ensure the rye seed isn't disturbed."
    },
    {
      "title": "Water the seeded area immediately.",
      "content": "Water the seeded area immediately. Once you've spread the seed, water the seeded area until it's moist. This will soften up the soil and make it easier for the rye seed to take root. It will also help the rye seed sink into the soil. [4] X Research source"
    },
    {
      "title": "Purchase fresh sod.",
      "content": "Purchase fresh sod. The sod you use for planting ryegrass should be cut no more than 24 hours before you plan to plant it. If you can’t plant the sod right away, store in a cool, dark place so that it doesn’t dry out."
    },
    {
      "title": "Moisten the soil.",
      "content": "Moisten the soil. The soil you lay the ryegrass sod on top of should be slightly moist. This will help the sod begin to take root. It also ensures that your ryegrass sod doesn’t dry out."
    },
    {
      "title": "Stagger the sod pieces.",
      "content": "Stagger the sod pieces. The sod will root best if it’s laid in a staggered placement. This means that the seams of the sod pieces should not line up exactly. Lay one row, then stagger the second row so that the seams from the first row touch the middle of each piece in the second row. You may have to cut down the sod to ensure it fits into smaller spaces or staggers properly. Use garden shears to gently cut the sod pieces down to size. The sizing doesn't need to be exact since you can fill the spaces in with soil, but it should be pretty close."
    },
    {
      "title": "Stake sod on a slope.",
      "content": "Stake sod on a slope. If you’re sodding a new ryegrass lawn on a slope, lay the soil out as you would on a flat surface. Then stake it with garden stakes so that the sod stays in place until it takes root."
    },
    {
      "title": "Fill in cracks between sod with fresh soil.",
      "content": "Fill in cracks between sod with fresh soil. This prevents the edges of the sod from drying out. It also helps the sod take root in a uniform manner, without space in between, giving your lawn a smooth look."
    },
    {
      "title": "Use a roller to water the sod.",
      "content": "Use a roller to water the sod. Once you’ve laid the sod and filled in any cracks, water it with a garden roller that is about one third full. This also helps smooth out the sod and soil and will contribute to a smooth lawn."
    },
    {
      "title": "Water your lawn frequently.",
      "content": "Water your lawn frequently. Until the ryegrass takes root – about three days for sodded ryegrass and two weeks for seeded ryegrass – water your lawn two to three times a week. Your grass should be moist but not saturated. When puddles begin to appear after you water, you can cease watering regularly and proceed only as needed. [5] X Research source"
    },
    {
      "title": "Apply a high nitrogen fertilizer.",
      "content": "Apply a high nitrogen fertilizer. Applying a fertilizer high in nitrogen helps the ryegrass grow. It’s also great if you’ve overseeded an existing lawn and will be using it later to grow vegetables. [6] X Research source"
    },
    {
      "title": "Mow your grass frequently.",
      "content": "Mow your grass frequently. Ryegrass grows very quickly, which means you’ll need to mow your lawn a few times a week. You should set your mower blade to a high setting. [7] X Research source"
    }
  ]
}