{
  "url": "https://www.wikihow.com/Plant-Angel-Trumpet-Seeds",
  "title": "How to Plant Angel Trumpet Seeds",
  "steps": [
    {
      "title": "Acquire Angel Trumpet seeds.",
      "content": "Acquire Angel Trumpet seeds. If you have access to an adult Angel Trumpet plant, harvest 1 of its seed pods after the pod turns brown or yellow. Then, carefully peel off the pod’s skin using your fingers, exposing lots of small seeds. If you don’t have access to an adult plant, purchase a pack of Angel Trumpet seeds from a gardening supply store."
    },
    {
      "title": "Soak the seeds in warm water for 24 hours.",
      "content": "Soak the seeds in warm water for 24 hours. When you’re ready to plant your seeds, fill a small bowl with warm water and place the seeds inside. Let the seeds soak for about 24 hours, then dry them off with a clean towel. [1] X Research source Soaking your seeds will remove the thin layer of pulp surrounding them. If you leave this layer on, they may not germinate properly."
    },
    {
      "title": "Wrap the seeds in a moist paper towel.",
      "content": "Wrap the seeds in a moist paper towel. Grab a small paper towel sheet and dampen it with warm water. Then, spread your seeds out evenly on the paper towel and fold the sheet up into a tight package. Try to use sheets that are about 4 in (10 cm) long. If you have a lot of seeds, you may need to use multiple sheets."
    },
    {
      "title": "Seal the seeds in a plastic bag.",
      "content": "Seal the seeds in a plastic bag. Grab your moistened paper towel package and slip it into a resealable plastic bag. Then, seal the bag. You do not need to press out any excess air before closing the bag. [2] X Research source If you have multiple paper towel packages, make sure you use a different plastic bag for each of them."
    },
    {
      "title": "Store your seeds in a warm place until they germinate.",
      "content": "Store your seeds in a warm place until they germinate. To make sure your seeds germinate properly, place them in an area that has a constant temperature between 60 and 70 °F (16 and 21 °C). Remove your seeds from the bag once they develop small, white stem strands, an indication that they’ve successfully germinated. [3] X Research source In most cases, your seeds should take between 3 and 4 weeks to fully germinate. You can remove your seeds as soon as you see their stem strands. You don’t have to wait for them to grow to a specific length."
    },
    {
      "title": "Replace the paper towel every other day.",
      "content": "Replace the paper towel every other day. When left unchecked, your germinating seeds can develop mold or become fungal. To prevent this, replace the damp paper towel once every other day. [4] X Research source"
    },
    {
      "title": "Purchase a soilless seed starting mix.",
      "content": "Purchase a soilless seed starting mix. You can find these at most gardening supply stores, as well as many big-box stores with gardening departments. If you’d prefer, you can create your own starting mix by combining: [5] X Research source .5 US gal (1,900 ml) of milled peat .5 US gal (1,900 ml) of perlite or vermiculite 1 cup (240 ml) of clave sand .5 US gal (1,900 ml) of rotted compost or humus 3 US tbsp (44 ml) of slow release fertilizer"
    },
    {
      "title": "Soak your starting mix in water.",
      "content": "Soak your starting mix in water. Using a spray bottle, moisten your seed starting mix with clean water. Then, knead the soil with your hands until it starts to clump together. Be careful not to drench the soil so you don’t overwater the seeds. [6] X Research source For the best results, moisten your soil with bottled spring water or rain water."
    },
    {
      "title": "Pour your starting mix into a seed starting tray.",
      "content": "Pour your starting mix into a seed starting tray. Purchase a plastic seed starting tray from a gardening supply store. Then, pour your soil mix into the tray, making sure to leave between .5 and 1 in (1.3 and 2.5 cm) of space at the top of the container. [7] X Research source If you’d like, purchase a starting tray with cell inserts so you can plant each of your seeds in an individual cell."
    },
    {
      "title": "Plant your seeds .25 in (0.64 cm) deep in the starting tray.",
      "content": "Plant your seeds .25 in (0.64 cm) deep in the starting tray. Grab your germinated Angel Trumpet seeds and arrange them on the tray so that they are about 6 in (15 cm) apart. Then, either cover the tray with another .25 in (0.64 cm) of starter mix or press the seeds .25 in (0.64 cm) into the mix that’s already there. [8] X Research source Angel Trumpet seeds need lots of sunlight to grow, so make sure they stay close to the surface of the tray."
    },
    {
      "title": "Cover your seed tray with plastic wrap.",
      "content": "Cover your seed tray with plastic wrap. Grab a roll of clear plastic wrap and stretch it out over the starting tray. Then, secure the wrap to the tray using tape or a large rubber band. The plastic wrap will trap in heat and moisture, helping the seeds grow. [9] X Research source"
    },
    {
      "title": "Store your tray in a sunny area until the seeds sprout.",
      "content": "Store your tray in a sunny area until the seeds sprout. Move your seeds to an area where they’ll have access to lots of sunlight. For the best results possible, try to find a spot that has an average temperature between 60 and 75 °F (16 and 24 °C). Keep your seeds in this spot until they start to sprout. [10] X Research source Growing time will vary. Your seeds may sprout after just 2 or 3 weeks, or they make take months to grow."
    },
    {
      "title": "Check the seeds every day and make sure the soil stays moist.",
      "content": "Check the seeds every day and make sure the soil stays moist. Once every day, peel back the plastic wrap and check to see how your seeds are doing. If the starting mix is dry, spray it with water until it becomes damp again."
    },
    {
      "title": "Remove the plastic wrap and move your seedlings to a shaded area.",
      "content": "Remove the plastic wrap and move your seedlings to a shaded area. Once your seeds sprout, take off the plastic wrap and relocate the tray to a warm but slightly shaded area, such as a windowsill with thin curtains in front of it. Continue watering the seedlings regularly to make sure the seed mix stays damp. [11] X Research source If your Angel Trumpets become fungal, dust the starting mix with an organic fungicide like Actinovate. Try to give your Angel Trumpets access to as much sunlight as possible without keeping them in areas of extreme heat."
    },
    {
      "title": "Give your seedlings fertilizer after 1 month (optional).",
      "content": "Give your seedlings fertilizer after 1 month (optional). To keep your seedlings as healthy as possible, put a thin layer of nutrient-rich, 15-15-15 fertilizer on top of the starting soil after 1 month. If your plants react well to it, you can add another layer every month after. [12] X Research source"
    },
    {
      "title": "Transplant your seedlings into bigger pots to raise them indoors.",
      "content": "Transplant your seedlings into bigger pots to raise them indoors. Once your seedlings grow too large for your starting tray, carefully remove them from the starting mix and relocate them to full-sized planting containers. Make sure you fill the containers with rich soil and keep them in an area with ample heat and sunlight. To make sure they have enough space, use a separate container for each Angel Trumpet plant."
    },
    {
      "title": "Move your seedlings outdoors if you live in a warm area.",
      "content": "Move your seedlings outdoors if you live in a warm area. If you want to plant your Angel Trumpets outside, make sure you live in a place that has an average annual extreme minimum temperature of 25 °F (−4 °C) or higher. In the United States, these places are known as USDA zones 9-12. If you live in a colder area, planting your Angel Trumpets outside could kill them. [13] X Research source"
    },
    {
      "title": "Water and prune your plants regularly to ensure they stay healthy.",
      "content": "Water and prune your plants regularly to ensure they stay healthy. After planting your Angel Trumpets, water them every 2 to 4 days or whenever their soil dries out. To keep your plants from growing excessively large, snip off the top of their stems when they gets too tall for your liking and cut off any side branches that develop. If your plants start to discolor, apply neem oil to their leaves and stems. This will help eradicate any bug infestations."
    }
  ]
}