{
  "url": "https://www.wikihow.com/Plug-a-Guitar-Into-a-Laptop",
  "title": "How to Plug a Guitar Into a Laptop",
  "steps": [
    {
      "title": "Locate your computer’s audio-in port.",
      "content": "Locate your computer’s audio-in port. It is possible to connect your guitar directly to your laptop through the device’s audio-in port. This port is typically located on the side of laptops, near the headphone-out port. You may see one of the following icons next to it: a microphone or a circle with two triangles. [1] X Research source"
    },
    {
      "title": "Purchase the correct cable or adapter.",
      "content": "Purchase the correct cable or adapter. While the average guitar cable has a ¼” phone jack on each end, the audio-in port requires a ⅛” stereo plug. You may purchase a guitar cable with a ¼” phone jack on one end and a ⅛” stereo plug on the other end OR you may purchase an ⅛” stereo plug adapter to use with your standard guitar cable. Your laptop’s audio-in port may require a stereo plug with a TS (Tip/Sleeve) connection or a TRS (Tip/Ring/Sleeve) connection. If you are unsure which tip your computer requires, consult your laptop’s manual. [2] X Research source If your laptop does not have an audio-in port, you will need to purchase an interface or a special cable that plugs into your audio-out port, also known as a headphone jack. These products allow you to use your audio-out port as an audio-in port. These products are sold at a variety of price points and vary in quality. You may also use these devices with your phone and tablet. If your laptop does not have a headphone jack, you can purchase an adaptor that plugs into your USB port. [3] X Research source"
    },
    {
      "title": "Plug your guitar into your computer.",
      "content": "Plug your guitar into your computer. Insert the ¼” phone jack into your guitar. If you are using a ⅛” stereo adapter, place it over the remaining ¼” phone jack. Insert the ⅛” stereo plug into your laptop’s audio-in port. [4] X Research source"
    },
    {
      "title": "Test the signal.",
      "content": "Test the signal. You can listen to your guitar through your computer’s speakers, a set of external speakers, or a pair of headphones. If you are using external speakers or headphones, insert the speaker cable or headphones into your laptop’s audio-out port. Strum your guitar to test the signal. If you are using your laptop’s internal speakers or a pair of headphones, you may notice that the signal is relatively weak. This is due to the fact that the laptop’s audio-in port are not capable of amplifying the signal. A set of external speakers, however, will act as an amplifier. [5] X Research source You may also experience a significant delay, or a gap between when a sound is inputted into the computer and when you hear that sound. [6] X Research source Before you can hear your instrument, you may need to download and/or open recording software. If you can not hear your guitar, open your computer’s sound settings. Make sure your sound is not muted. Make sure the correct port or device is selected (audio-in, audio-out, headphone, microphone, etc.). For specific instructions, consult your computer or device’s manual. [7] X Research source"
    },
    {
      "title": "Purchase or find a device with a pre-amp.",
      "content": "Purchase or find a device with a pre-amp. If you are unsatisfied with the strength of your guitar’s signal, enhance it with a pre-amp. Pre-amplification is the first stage of amplification. These devices boost your guitar’s signal. You can purchase a pre-amp specifically designed for guitars. However, if you are looking to save money, several guitar accessories come equipped with pre-amps. These include, amp-modelers, pedals, drum machines, and direct boxes. [8] X Research source The best pre-amps use tubes."
    },
    {
      "title": "Connect your guitar and pre-amp to your laptop.",
      "content": "Connect your guitar and pre-amp to your laptop. Insert your standard guitar cable into your guitar. Plug the other end of the guitar cable into the input port of your pre-amp. Insert a ⅛” stereo in cable into your pre-amp’s PA Out or Line-Out port. Put the opposite end of this cable into your laptop’s audio-in port. [9] X Research source If your laptop does not have an audio-in port, you will need to purchase an interface or a special cable that transforms your audio-out port, also known as a headphone jack, into an audio-in port. These products also work with phones and tablets. There are also adapters that plug into USB ports. [10] X Research source"
    },
    {
      "title": "Test the signal.",
      "content": "Test the signal. If your guitar is connected properly to your laptop, you can hear the instrument through your computer’s speakers, a set of external speakers, or a pair of headphones. If you are not using your’ computer’s speakers, insert the external speaker cable or headphones into your laptop’s audio-out port. Strum your guitar to test the signal. [11] X Research source While the pre-amp will improve the strength of the signal, it may not decrease any delay you are experiencing. Delay, or audio latency, is the gap that exists between when a sound is inputted into the computer and when that sound is actually heard. [12] X Research source In order to hear your guitar, you may need to download and/or open recording software first. If you are experiencing sound problems, open your computer’s sound settings. Check to see if your sound is muted and that the correct port or device is selected (audio-in, audio-out, headphone, microphone, etc.). For specific instructions, consult your computer or device’s manual. [13] X Research source"
    },
    {
      "title": "Purchase or find a pre-amp device with a USB or Firewire out port.",
      "content": "Purchase or find a pre-amp device with a USB or Firewire out port. For the best results, bypass the analog connection entirely and connect your guitar digitally to your computer. You can connect your guitar digitally to your computer through a pre-amp with a USB or Firewire outport. Before you purchase a pre-amp with one of these out ports, check to see if the guitar accessories you already own will work. These accessories may include amp-modelers, pedals, drum machines, and direct boxes. [14] X Research source"
    },
    {
      "title": "Connect your guitar and pre-amp to your laptop.",
      "content": "Connect your guitar and pre-amp to your laptop. Place your standard guitar cable into your guitar. Plug the opposite end of the guitar cable into the pre-amp’s input port. Insert a USB, Firewire, or Optical cable into your pre-amp’s USB or Firewire out port. Plug the other end of this cable into your laptop’s USB or Firewire in port. [15] X Research source"
    },
    {
      "title": "Test the signal.",
      "content": "Test the signal. When your guitar is properly connected, you will be able to assess the strength and quality of your guitar’s signal. Listen to the instrument through your computer’s speakers, a set of external speakers, or a pair of headphones. If you’re using external speakers or headphones, insert their respective cables into your laptop’s audio-out port. Play a few chords on your guitar to test the signal. [16] X Research source This method will produce the crispest and clearest recordings. [17] X Research source You may need to download and/or open recording software in order to hear your instrument. If your guitar’s sound is not coming through, make sure the instrument’s volume is turned all the way up. Open your computer’s sound settings and double check that your volume is not muted and that the correct port or device is selected (audio-in, audio-out, headphone, microphone, etc.). For specific instructions, consult your computer or device’s manual. [18] X Research source"
    }
  ]
}