{
  "url": "https://www.wikihow.com/Myths-About-Mental-Health",
  "title": "The Truth About Mental Health: Separating Myth from Fact",
  "steps": [
    {
      "title": "Fact:",
      "content": "Fact: 1 in 4 people in the world suffer from mental health issues. The most common mental health issue is depression, and more and more people experience it every year. Mental health issues really aren’t that uncommon—if you took a poll of your friends and family members, there’s a big chance that someone you know has dealt with them in the past. [1] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Generalized anxiety disorder affects 3 in 100 people every year."
    },
    {
      "title": "Fact:",
      "content": "Fact: Mental illnesses are real health problems that can be treated. You wouldn’t tell someone with a cast on their arm to “just get over it,” and the same is true for mental health issues. They are real and can be debilitating, but it also means that they can be treated. [2] X Research source The stigma surrounding mental health is getting better, but this is one myth that is especially prevalent."
    },
    {
      "title": "Fact:",
      "content": "Fact: Mental health has nothing to do with strength or weakness. Your genes, your life experience, and your family history are the factors that determine your mental health throughout your life. You could be the strongest person in the world, and you still might suffer from a mental health issue. [3] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source High stress and trauma can also increase your likelihood of having a mental health issue."
    },
    {
      "title": "Fact:",
      "content": "Fact: Mental health issues may fluctuate throughout your life. Mental health issues are very rarely a constant factor. With treatment and therapy, you can often lessen your mental health issues or find a way to decrease them over time. [4] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Some serious mental health issues, like schizophrenia or bipolar disorder, will never go away completely. However, they can be managed to lessen their severity."
    },
    {
      "title": "Fact:",
      "content": "Fact: Young children can show signs of mental health issues. In fact, 50% of all mental health issues start before you turn 14 years old. Diagnosing someone early can help them get the treatment they need before their symptoms get too severe. [5] X Research source 3/4 of all mental health issues present before you turn 24 years old."
    },
    {
      "title": "Fact:",
      "content": "Fact: They’re no more likely to be violent than anyone else. In fact, people with mental health issues are actually more likely to be the victims of violent crimes and assaults. Many people with mental health issues are active members of society who can function perfectly well. [6] X Research source This myth stems from the overemphasis of violent people with mental health issues in the media. While it’s true that you can have a mental health issue and be violent, the two are very rarely correlated."
    },
    {
      "title": "Fact:",
      "content": "Fact: Many people with mental health issues have steady jobs. While it is true that severe or untreated mental illnesses can stop you from working, the large majority of people with mental health issues are in the workforce. In fact, a study shows that almost 70% of people with a mild mental illness in the United States were fully employed. [7] X Research source Over 50% of people with severe mental illnesses in the United States are currently employed."
    },
    {
      "title": "Fact:",
      "content": "Fact: For a lot of people, medication helps them function. For people with moderate to severe mental health issues, medication is their ticket for survival. As with most health-related issues, it’s up to you whether or not you’d like to take medication for a mental health issue. [8] X Trustworthy Source National Alliance on Mental Illness Grassroots mental health-focused organization providing resources, support, and education for those affected by mental illness Go to source Some people also believe that psychiatric medication is a “cure-all,” but that isn’t the case either. It often takes a while to find the right medication at the right dosage for a specific mental health issue."
    },
    {
      "title": "Fact:",
      "content": "Fact: You can always support someone in your life who is struggling. If you know that they’re having issues, be willing to lend an ear and listen to what they have to say. If they don’t want to talk about it, offer distractions or keep them company. Having your support can really make a difference in someone’s life, even if you don’t see it right away. [9] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source If someone in your life is having a tough time, you can recommend that they see a mental health professional. It’s not up to you to fix them, but you can point them in the right direction."
    }
  ]
}