{
  "url": "https://www.wikihow.com/Recognize-a-Bad-Pastor",
  "title": "How to Recognize a Bad Pastor and How to Take Action",
  "steps": [
    {
      "title": "Aggressive or passive-aggressive sermons",
      "content": "Aggressive or passive-aggressive sermons Do you feel like your pastor targets certain people with their sermons? Or, maybe they call out specific members of the congregation. An aggressive pastor doesn’t inspire confidence, and they can alienate members of the church very quickly. [1] X Research source"
    },
    {
      "title": "Gossiping",
      "content": "Gossiping Talking badly about others only serves to break apart the community in your church. Plus, when people talk to their pastor, they assume that their conversation is confidential, not that it will be spread around to everyone. A leader who gossips isn’t being kind or respectful to their congregation. [2] X Research source Plus, the Christian Bible recognizes gossip as a sin."
    },
    {
      "title": "Manipulative",
      "content": "Manipulative Do you feel like your pastor has an ulterior motive? Maybe they’re targeting their sermons to mesh with their political career, or maybe they’re only in it for the money. If you feel like your pastor is manipulating the congregation or other leaders in the church, that’s a huge sign that they’re in the wrong line of work. [3] X Research source"
    },
    {
      "title": "Drinking or taking drugs",
      "content": "Drinking or taking drugs Drinking excessively or doing drugs sets a bad example for the rest of the church. While the Bible doesn’t explicitly tell people not to do drugs, it does warn about doing anything in excess. [4] X Research source"
    },
    {
      "title": "Micromanaging the church",
      "content": "Micromanaging the church A bad pastor may try to control the church from behind the scenes. In a well-run church, there are multiple people in leadership roles who make decisions collaboratively. You might notice that a bad pastor tries to run everything, and takes the stance of “my way or the highway.” Good pastors will remember that it’s not them who is in charge: it’s the higher power that guides the church and its congregation."
    },
    {
      "title": "Flaunting wealth",
      "content": "Flaunting wealth Pastors are not supposed to be preoccupied with money or how much the church makes. A bad pastor may be overly-focused on tithes or trying to get donations from the congregation. They may also make large, extravagant purchases for themselves and then show them off to other people. [5] X Research source"
    },
    {
      "title": "Being a poor role model",
      "content": "Being a poor role model You may notice that a bad pastor doesn’t behave biblically. Think about the role models you’d like to show to your children: is your pastor one of them? If not, they are probably not doing their job well. [6] X Research source The pastor is a key influence within the church, and often, they’re the guiding light that tells people what’s acceptable and what isn’t. If your pastor can’t be trusted to be a role model for the church, it means they’ve failed at their job."
    },
    {
      "title": "Lack of passion",
      "content": "Lack of passion Do you feel like your pastor is only going through the motions of their job? A good pastor will always believe in their sermons and pour their heart and soul into their work. A pastor who is burnt out or fed up with the church might say the right things, but they lack the passion and devotion that’s necessary in a church leader. [7] X Research source"
    },
    {
      "title": "Relying on praise from others",
      "content": "Relying on praise from others It’s easy to fall into the trap of getting satisfaction when other people are happy with you. However, a good pastor will remember that the only person they need approval from is God. They shouldn’t be striving to make other people happy; instead, they should be focusing on the word of God, even if it’s not what others want to hear. [8] X Research source"
    },
    {
      "title": "Arrogant or inflexible",
      "content": "Arrogant or inflexible Good pastors listen to others and take into account what other people are thinking. If your pastor isn’t that great, they might think their ideas are better than anyone else’s. They might also think very highly of themselves, leading them to be inflexible about the way things work inside the church. [9] X Research source"
    },
    {
      "title": "Lacks compassion or empathy",
      "content": "Lacks compassion or empathy An important aspect of being a pastor is listening to other people with compassion and respect. If your pastor can’t (or won’t) relate to the people in your congregation, they’re probably not a good pastor. It’s also important that your pastor forgives people and doesn’t hold a grudge. If you find that your pastor wants to blame others or hold their actions against them, they are not a good pastor."
    },
    {
      "title": "Distant or unavailable",
      "content": "Distant or unavailable Is your pastor only around during church services? When you want to speak to them privately, are they constantly busy? Someone who’s only available in the public eye is probably doing their job for the wrong reasons. It means they want to put on appearances, but they don’t actually want to do any extra work that comes with their job. [10] X Research source"
    },
    {
      "title": "Takes advantage of the congregation",
      "content": "Takes advantage of the congregation A bad pastor will see members of the church as means to an end. They might expect members to do a ton of volunteering, or ask them to give more time and money than they’re able to. A good pastor will work with the congregation; a bad pastor will make the congregation work for them. [11] X Research source On the flip side, you may notice that a bad pastor doesn’t rely on the congregation enough. Instead, they might lean heavily on the church staff and church leaders while ignoring any help offered from the congregation."
    },
    {
      "title": "Refusing to reflect upon their own actions",
      "content": "Refusing to reflect upon their own actions A good pastor will always preach the gospel to themselves as well as to other people. A bad pastor may never see their own wrongdoings, choosing to point fingers at other people instead. If your pastor thinks they can do no wrong, they are not taking the gospel seriously. [12] X Research source"
    },
    {
      "title": "Exclusive toward specific communities",
      "content": "Exclusive toward specific communities Does your pastor welcome members of the LGBT+ community? Do they respect women and youth as members of the congregation? If not, they are being intentionally exclusive, which goes directly against all teachings in the Bible. [13] X Research source Excluding people from a certain community pushes people away from the church, and even religion as a whole. A good pastor will welcome everyone with open arms. However, note that the Bible condemns certain sins, most notably in this case being homosexuality. Because homosexuality is such an identity-centric sin, it's not easy to preach against it, but it is important to take note how your pastor speaks about these groups; does he condemn them without loving them first, or preach toleration and acceptance without acknowledging what God thinks about it?"
    },
    {
      "title": "Is the pastor’s behavior affecting you or the church?",
      "content": "Is the pastor’s behavior affecting you or the church? Rest assured that if you think your pastor isn’t the best, that’s probably the case. If you’re struggling to decide whether or not to take action, first think about whether or not the pastor is making your life or your congregation’s lives worse. If so, you should probably speak up."
    },
    {
      "title": "Have you given the pastor the benefit of the doubt?",
      "content": "Have you given the pastor the benefit of the doubt? It’s possible that your pastor isn’t intentionally being bad; rather, they may just be making mistakes. Remember, pastors are humans too, and they don’t always get it right. [14] X Research source On the flip side, there are only so many “mistakes” one person can make. Eventually, it becomes an intentional pattern."
    },
    {
      "title": "Have you consulted the Holy Spirit?",
      "content": "Have you consulted the Holy Spirit? If you can’t decide whether or not you should speak up, take a moment to talk to God and pray about it. Chances are, you’ll find clarity within your spirituality, and it can be a guiding force going forward."
    },
    {
      "title": "Talk to the pastor directly.",
      "content": "Talk to the pastor directly. Ask to speak to the pastor alone, then lay out your concerns. If they’re a new pastor, there’s a chance that they didn’t realize their actions were being received so poorly. [15] X Research source “Could I speak with you privately? I wanted to share some concerns that I had about the recent use of church funds. I’m not sure they’re being used appropriately.”"
    },
    {
      "title": "Involve other members of the congregation.",
      "content": "Involve other members of the congregation. Talk to other people within the church to see if they’ve noticed your pastor’s behavior, too. If so, bring them with you when you talk to the pastor. Your words may have more of an influence if they come from multiple people. [16] X Research source Try to avoid gossiping about the pastor or talking about them behind their back. Instead, involve others by saying something like, “Have any of you noticed some odd behaviors from the pastor lately? I wonder if we should talk to him as a group.”"
    },
    {
      "title": "Provide solutions to the pastor.",
      "content": "Provide solutions to the pastor. You might ask that the pastor and the church leaders make a business plan or strategy to help with transparency. Or, you could suggest that the pastor stops leaning on the congregation to do church duties. Try to phrase your suggestions as helpful pointers rather than commands to avoid making your pastor defensive. [17] X Research source “I think it would be helpful if you and the other leaders shared the business plan for the church. That way, we could all see how the money is being spent, so there’s no more confusion.” It’s a good idea to get other church leaders on your side here. The more others agree with you, the more power your suggestions will have."
    },
    {
      "title": "Inform higher authorities if you need to.",
      "content": "Inform higher authorities if you need to. If your pastor’s behavior is illegal, it’s time to involve the authorities. Call the police and explain what your pastor has been doing. If you have any proof, hand that over as well to support your case. [18] X Research source It’s important to contact actual authorities for illegal activities rather than relying on church leaders."
    },
    {
      "title": "Leave the church as a last resort.",
      "content": "Leave the church as a last resort. It’s not ideal, but if your pastor won’t change and church leaders won’t do anything, you may be better off finding a new church . Look for one where you feel safe and respected so you don’t have to deal with a bad pastor anymore. [19] X Research source"
    }
  ]
}