{
  "url": "https://www.wikihow.com/Reactivate-Doordash-Account",
  "title": "How To Reactivate a DoorDash Account",
  "steps": [
    {
      "title": "Look for appeal instructions in the deactivation notification.",
      "content": "Look for appeal instructions in the deactivation notification. When DoorDash deactivates your account, you'll receive a notification in the app and via email. If you are given the option to appeal, you will receive instructions in the email notification. If you don't see the notification, you can fill out the appeal form by visiting https://help.doordash.com/dashers/s/article/How-to-appeal-the-deactivation-of-a-Dasher-account and clicking the link that says this form . [1] X Research source"
    },
    {
      "title": "Fill out the form as soon as possible while the details about the incident are fresh in your head.",
      "content": "Fill out the form as soon as possible while the details about the incident are fresh in your head. Answer all questions to the best of your ability, and include any photos, video, or audio that support your case. Avoid sharing too many details about the case. Instead, stick to the most relevant details. If you were deactivated for having a low consumer rating or low completion rate, you will not be given the option to appeal your deactivation. You can only appeal when you're accused of violating the Independent Contractor Agreement, committing fraud, abuse, or safety violations. [2] X Research source It can take up to 2 weeks to process an appeal. DoorDash may also reach out to you during the appeals process. If you do not hear from DoorDash, your appeal was most likely unsuccessful. Allow enough time for the appeals process to take place before contacting DoorDash."
    },
    {
      "title": "Contact DoorDash.",
      "content": "Contact DoorDash. In addition to filling out the appeals form, you can also contact DoorDash directly . [3] X Research source While you have the option to call or email customer service, you may have better luck visiting a local DoorDash office in person. [4] X Research source When talking to a representative from DoorDash, always make sure you are being polite and respectful. DoorDash representatives may deactivate your account just for being rude and belligerent with them. Know what your consumer rating, acceptance rate, and completion rate. If you have high ratings, this is more of a reason for them to keep you onboard. If you were not given a reason why you were deactivated, ask them to give you a reason. They have to be able to give you a reason why you are let go. If they cannot give you a good reason why you were deactivated, this could be a way for you to get back in. Be polite but firm. Ask to be reinstated, not if you can be reinstated."
    },
    {
      "title": "Having a low consumer rating.",
      "content": "Having a low consumer rating. As a DoorDash driver, customers give you a rating from 1 to 5 stars. If your consumer rating drops below 4.2 stars, you may be deactivated. [5] X Research source You may receive a low rating if your orders are not dropped off on time, you are rude and have an unpleasant attitude, or there are missing items in the order. You should receive a notification if you are in danger or being deactivated due to a low consumer rating."
    },
    {
      "title": "Having a low completion rate.",
      "content": "Having a low completion rate. DoorDash allows you to decline any delivery you are offered. When you accept a delivery, you are expected to complete it. Not completing a delivery negatively affects your completion rating. If your completion rating drops below 80%, you can be deactivated. Avoid accepting deliveries that you cannot complete. [6] X Research source Check the information about a delivery before accepting it. You should be given the address, customer name, and the pay. Make sure you can complete the delivery in a timely manner before accepting it."
    },
    {
      "title": "Engaging in dangerous or illegal activity.",
      "content": "Engaging in dangerous or illegal activity. This can include the following activities: [7] X Research source Use of violence or abusive language towards customers, merchants, or other dashers. Use of drugs or alcohol while on the job. Discrimination or harassment. Unsafe driving, scooting, or biking. Failure to follow the law or use of the platform for illegal activity. Failure to pass a background check. Disclosing personal information without authorization."
    },
    {
      "title": "Fraud or abuse of the platform.",
      "content": "Fraud or abuse of the platform. This includes the following activities: [8] X Research source Gaming or manipulating referral systems or promotions. Purchasing more red cards than what is needed for an authorized delivery. Providing false information during the sign-up process or to the DoorDash support team. Creating multiple accounts for more than one person or using the same phone number for more than one account. Opening, consuming, or tampering with an order or customer delivery. Failing to use the insulated hot bag during delivery. Taking any action that damages, disrupts, overburdens, or impairs the functionality of the DoorDash platform or servers. Using bots or automated software to retrieve data or content from the DoorDash platform or servers. Gaining or attempting to gain unauthorized access to any portion of the DoorDash platform or servers. Infringing on copyright, trademarks, trade secrets, or the privacy or publicity of third parties."
    },
    {
      "title": "Violating your Independent Contractor Agreement.",
      "content": "Violating your Independent Contractor Agreement. This includes the following activities: [9] X Research source Marking deliveries complete that weren't completed. Not making deliveries in a safe and timely manner. Not making a reasonable attempt to contact the customer if they are not available. Not waiting a reasonable amount of time if the customer is not available. Taking any goods or food that belongs to a customer."
    },
    {
      "title": "Sign up for a different ride-share service.",
      "content": "Sign up for a different ride-share service. If your account was deactivated and you are unable to reinstate your account, your best bet is to sign up for another ride-share service. Other ride-share services include; Uber , UberEATS , Grubhub, and Lyft."
    },
    {
      "title": "It is against DoorDash's policy to have more than one account.",
      "content": "It is against DoorDash's policy to have more than one account. DoorDash's deactivation policy states that your account can be deactivated if you have more than one account. [10] X Research source If you want to try to create a new DoorDash account, you'll need a different email address , different phone number, and a different home address. You may also want to delete your old account and come up with a backup plan in case your new account is deactivated."
    }
  ]
}