{
  "url": "https://www.wikihow.com/Quit-Smoking",
  "title": "How to Quit Smoking",
  "steps": [
    {
      "title": "Think about if you want to quit smoking.",
      "content": "Think about if you want to quit smoking. Nicotine is incredibly addictive and it will take determination to quit. Ask yourself if a life without smoking is more appealing than continuing your life as a smoker. [1] X Research source West, R. (2013). Theory of Addiction. [electronic resource]. Hoboken, New Jersey : Wiley-Blackwell 2013. If the answer is yes, have a clear reason for wanting to quit. This way, when abstaining becomes difficult you can be clear about your very important reason to quit. Consider how smoking affects these areas of your life: your health, your appearance, your lifestyle, and your loved ones. [2] X Research source Ask yourself if these areas would benefit from you quitting."
    },
    {
      "title": "Determine why you want to quit.",
      "content": "Determine why you want to quit. Make a list of all the reasons why you want to quit. This will help you become clear about your decision to quit. You'll want to refer to this list later, if you're tempted to smoke. For example, your list might say something like: I want to quit smoking so I can run and keep up with my son during football practice, have more energy, be alive to see my youngest grandchild get married, or save money."
    },
    {
      "title": "Be prepared for nicotine-withdrawal symptoms.",
      "content": "Be prepared for nicotine-withdrawal symptoms. Cigarettes are highly effective at delivering nicotine throughout your body. [3] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source When you stop smoking, you might experience increased cravings, anxiety, depression, headaches, feeling tense or restless, increased appetite and weight gain, and problems concentrating. [4] X Research source Realize that it may take more than one attempt to stop smoking. About 45 million Americans use some form of nicotine, and only 5 percent of users are able to quit during their first attempt."
    },
    {
      "title": "Choose a date for when your plan will start.",
      "content": "Choose a date for when your plan will start. Committing to a start date adds structure to your plan. For example you might choose an important day such as a birthday or holiday, or just pick a date you like. Pick a date within the next 2 weeks. This gives you time to prepare and start on a day that isn't stressful, important, would otherwise lead you to smoke. [5] X Research source"
    },
    {
      "title": "Pick a method.",
      "content": "Pick a method. Decide which method you would want to use, like quitting cold turkey, or slowing/reducing your use. [6] X Research source American Cancer, S. (2010). Kicking Butts : Quit Smoking and Take Charge of Your Health. Atlanta, Ga: Independent Publishers Group Quitting cold turkey means that you completely stop smoking without looking back. Reducing your use means smoking less and less until you've stopped. If you pick reducing your means, be specific about when and by how much you will reduce your use. For example, it might be simple like saying, \"I will reduce my use by one cigarette every two days.\" You'll have a better chance of success if you combine counseling and medication with stopping, regardless of which method you choose. [7] X Research source"
    },
    {
      "title": "Prepare for cravings.",
      "content": "Prepare for cravings. Have a plan in advance for when cravings strike. You might try hand-to-mouth. This describes the action of moving your hand to your mouth for smoking. Have a replacement to fulfill this need. Try snacking on low-calorie snacks, like raisins, popcorn, or pretzels, when this urge comes up. [8] X Research source American Cancer, S. (2010). Kicking Butts : Quit Smoking and Take Charge of Your Health. Atlanta, Ga: Independent Publishers Group You might try exercising to combat cravings. Go for a walk, clean the kitchen, or do some yoga. You might also try to control your impulses by squeezing a stress ball or chewing gum when cravings hit."
    },
    {
      "title": "Prepare the night before quitting.",
      "content": "Prepare the night before quitting. Wash your bedding and clothes to get rid of cigarette smells. You should also get rid of any ashtrays, cigarettes, and lighters from your house. Make sure to get plenty of sleep, since this will help lower your stress. [9] X Research source American Cancer, S. (2010). Kicking Butts : Quit Smoking and Take Charge of Your Health. Atlanta, Ga: Independent Publishers Group Remind yourself of your plan and carry a written version with you, or keep it on your phone. You may also want to re-read the list of reasons why you want to quit."
    },
    {
      "title": "Ask for support.",
      "content": "Ask for support. Your family and friends can be extra support in your cessation journey. Let them know your goal and ask them to help you by not smoking around you or offering you a cigarette. You can also ask for their encouragement and to remind you of your specific goals when temptation is difficult. [10] X Research source American Cancer, S. (2010). Kicking Butts : Quit Smoking and Take Charge of Your Health. Atlanta, Ga: Independent Publishers Group Remember to take quitting one day at a time. Remind yourself that this is a process and not an event."
    },
    {
      "title": "Know your triggers.",
      "content": "Know your triggers. Many people find that certain situations trigger the desire to smoke. You might want a cigarette with your cup of coffee, for instance, or you might want to smoke when you're trying to solve a problem at work. Identify places where it may be difficult not to smoke and have a plan of what you'll do in those specific places. For example, you should have an automatic response for a cigarette offer: “No thank you, but I will have another tea” or “ No - I am trying to quit.” [11] X Research source American Cancer, S. (2010). Kicking Butts : Quit Smoking and Take Charge of Your Health. Atlanta, Ga: Independent Publishers Group Control stress. Stress can be a pitfall when trying to quit smoking. Use techniques such as deep breathing, exercise, and down time to help thwart stress."
    },
    {
      "title": "Be committed to not smoking.",
      "content": "Be committed to not smoking. Continue your plan even if you have bumps in the road. If you have a relapse and smoke for an entire day, be sure to be gentle and forgiving with yourself. Accept that the day was tough, remind yourself that quitting is a long, hard journey, and get back on your plan the next day. Try to avoid relapsing as much as possible. But if you do, recommit as soon as you can to quitting smoking. Learn from your experience and try to cope better in the future."
    },
    {
      "title": "Consider using e-cigarettes or nicotine filters.",
      "content": "Consider using e-cigarettes or nicotine filters. Recent studies have suggested that using e-cigarettes while you quit smoking can help you reduce or quit smoking. [12] X Research source Other studies recommend caution when using e-cigarettes since the amount of nicotine varies, the same chemicals as those in cigarettes are still being delivered, and they may re-activate the habit of smoking. [13] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Get professional help.",
      "content": "Get professional help. Behavioral therapy combined with medication therapy can improve your chances of successfully quitting. [14] X Research source West, R., &amp; Shiffman, S. (2007). Smoking Cessation. Abingdon: HEALTH Press. If you've tried quitting on your own and are still struggling, think about getting professional help. Your doctor can talk to you about medication therapy. Therapists can also help you through the process of quitting. Cognitive Behavioral Therapy can help change your thoughts and attitudes about smoking. Therapists can also teach coping skills or new ways to think about quitting. [15] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Take Bupropion.",
      "content": "Take Bupropion. This medication doesn't actually have nicotine, but it does help reduce the symptoms of nicotine withdrawal. Bupropion could increase your chances of cessation by 69 percent. [16] X Research source Aubin, Henri-Jean, Luquiens, Amandine, &amp; Berline, Ivan (2014). Pharmacotherapy for smoking cessation: pharmacological principles and clinical practice. British Journal of Clinical Pharmacology 77 (2) 324-336. Usually, you'll want to start taking bupropion 1 to 2 weeks before you stop smoking. It's normally prescribed in one or two 150mg tablets per day. Side effects include: dry mouth, difficulty sleeping, agitation, irritability, tiredness, indigestion and headaches as side effects."
    },
    {
      "title": "Use Chantix.",
      "content": "Use Chantix. This medication curbs nicotine receptors in the brain, which makes smoking less pleasurable. It also reduces withdrawal symptoms. You should start taking Chantix one week before quitting. Be sure to take it with meals. Take Chantix for 12 weeks. Side effects include: headaches, nausea, vomiting, trouble sleeping, unusual dreams, gas, and changes in taste. But it could double your chances of quitting. [17] X Research source Aubin, Henri-Jean, Luquiens, Amandine, &amp; Berline, Ivan (2014). Pharmacotherapy for smoking cessation: pharmacological principles and clinical practice. British Journal of Clinical Pharmacology 77 (2) 324-336. Your doctor will have you increase your dose over time. For example, you'll take one 0.5mg pill for days 1-3. Then you'll take one 0.5mg pill twice a day for days 4-7. You'll take one 1 mg pill twice per day after that."
    },
    {
      "title": "Try nicotine replacement therapy (NRT).",
      "content": "Try nicotine replacement therapy (NRT). NRT includes all types of patches, gums, lozenges, nasal sprays, inhalers or sublingual tablets that have and deliver nicotine into the body. You don't need a prescription for NRT and it can reduce cravings and withdrawal symptoms. NRT could increase your chances of quitting by 60 percent. [18] X Research source Aubin, Henri-Jean, Luquiens, Amandine, &amp; Berline, Ivan (2014). Pharmacotherapy for smoking cessation: pharmacological principles and clinical practice. British Journal of Clinical Pharmacology 77 (2) 324-336. Side effects of NRT include: nightmares, insomnia, and skin irritation for patches; mouth soreness, difficulty breathing, hiccups, and jaw pain for gum; mouth and throat irritation and coughing for nicotine inhalers; throat irritation and hiccups for nicotine lozenge; and throat and nasal irritation as well as runny nose if the nasal spray is used."
    }
  ]
}