{
  "url": "https://www.wikihow.com/Reduce-Emergency-Room-Bills",
  "title": "How to Reduce Emergency Room Bills",
  "steps": [
    {
      "title": "Ask the hospital's billing department for an itemized statement.",
      "content": "Ask the hospital's billing department for an itemized statement. Speak to the billing person in the doctor's office or the hospital's manager of patient accounts and ask for an itemized statement that details all of your medical costs individually. Go through each item and compare it to the explanation of benefits (EOB) from your insurance company to check for any medical billing errors. [1] X Research source Call your insurance provider for an explanation of benefits (EOB). If you're not confident with your communication skills, you can hire a professional advocate. Search for billing advocates in your local area. Use the following site if you're having trouble: http://www.patientadvocate.org/ ."
    },
    {
      "title": "Check your itemized statement for common mistakes.",
      "content": "Check your itemized statement for common mistakes. First, check that your identifiers (medical insurer address, policy number, and group number) are correct. Afterwards, check that you received all items listed on the bill. Finally, keep an eye out for duplicates are other suspicious activity, such as: [2] X Research source Billing for a private room when you used a shared room. Charging for a higher level of service than you received. Overcharges in operating rooms (such as longer anesthesia times than you used). Being charged for a group of services under one code, and again for the same service under a different code."
    },
    {
      "title": "Call your insurance provider and report any mistakes.",
      "content": "Call your insurance provider and report any mistakes. Notify your insurance company of any charges from your medical bill that aren't on your EOB. Your insurance company might be able to explain or rectify these mistakes with the hospital directly."
    },
    {
      "title": "Request an audit from the hospital's billing department to address mistakes.",
      "content": "Request an audit from the hospital's billing department to address mistakes. If you find any mistakes on your bill that can't be solved by a call to your insurer, prepare a list of all of the charges you want to dispute. Send it to the hospital's billing department along with a written request for a hospital audit. They have a legal obligation to respond to your request."
    },
    {
      "title": "Hire a patient advocate for support (optional).",
      "content": "Hire a patient advocate for support (optional). Although this is optional, patient advocates provide you with arbitration, mediation, and negotiation support to help you settle your healthcare issues. Find the right advocate for your needs here: http://www.patientadvocate.org/ . Patient advocate costs vary depending on the services you need, your location in relation to them, their experience and education, and the amount of time you work together. [3] X Research source Ask potential advocates questions like: What kind of training and experience do you have? How long have you been a private, independent advocate? Are you a Board Certified Patient Advocate (BCPA)? [4] X Research source"
    },
    {
      "title": "Request a lower hospital bill from the billing department.",
      "content": "Request a lower hospital bill from the billing department. Locate your hospital's website and look for their billing/finance department. Call them and request a bill deduction. If the first call doesn't work, don't give up. Be patient and persistent, as it might take a few tries to get the right person. [5] X Research source A lack of insurance can sometimes lead to automatic bill reduction even if you have a high income. For example, if you make $100,000 a year, you can still qualify for aid if your bills are 50% of your salary. If you have low income, you might qualify for more significant reductions."
    },
    {
      "title": "Pay as much of your hospital bill as you can in cash for more leverage.",
      "content": "Pay as much of your hospital bill as you can in cash for more leverage. While you can try negotiating no matter the form of payment, hospital billing departments are much more likely to negotiate price if you pay a portion of your bill in cash up-front. It's not unheard of to reduce your bill by 5, 10, or even 20% by paying the balance (or even a portion of it) up-front in cash."
    },
    {
      "title": "Research local hospital prices and use this information as leverage.",
      "content": "Research local hospital prices and use this information as leverage. Research the prices at other hospitals in the area to determine the average cost of the care you received. If you find that your hospital is charging more, you can use it as leverage to negotiate a lower price. Healthcare Bluebook is a great site that offers a free search tool for finding expected healthcare prices in your area. Visit it here: https://www.healthcarebluebook.com/ . FAIR Health is another similar option. Visit it here: https://www.fairhealth.org/ ."
    },
    {
      "title": "Use confident, personal language during negotiations.",
      "content": "Use confident, personal language during negotiations. Don't skirt around the issue—get straight to the point. For example, if you were recently laid off, tell them right away and ask if they can lower the price to increase affordability. Try saying something like, \"I'm looking for a reduction to help me pay for my medical bills using my limited resources.\" You should also try: \"Given the average bills of other local hospitals, I think a deduction is more than fair, especially considering my recent loss of employment.\" You don't have to be too aggressive—just do your research and don't come across as naive."
    },
    {
      "title": "Express your emotional state to gain leverage.",
      "content": "Express your emotional state to gain leverage. Emergency bills can create a lot of stress, but don't give in to anger. Focus on communicating your emotional struggles as opposed to any hostility. Most hospital administrators and staff are receptive to this form of communication. [6] X Research source Say something like \"I’m trying to deal with my medical bills, but the stress of my ill spouse and work is making it difficult to focus.\" Appealing to doctor egos can also work. Suggest that you chose the hospital because you heard of the top-quality care it offers."
    },
    {
      "title": "Always keep records of your communications.",
      "content": "Always keep records of your communications. Keep records of conversations with both billing staff and insurance company service staff. Take down the name of the employee, their location, and the call reference number every time you speak to someone about medical bills. Maintaining communication records makes it easier to determine who to contact and what kind of information to provide when you follow up 2 to 3 weeks later. Keeping your own records also helps medical professionals recognize that you've done your research. [7] X Research source"
    },
    {
      "title": "Ask hospital billing departments about their assistance options.",
      "content": "Ask hospital billing departments about their assistance options. Many hospitals, especially non-profits, offer financial assistance programs for people struggling to pay for medical care. These options are designed for the uninsured as well as those people who are insured but owe a significant amount more than their plan covers. If you have insurance but it doesn't cover enough, you could quality for assistance. This is most likely with lower incomes with higher bills."
    },
    {
      "title": "Ask the hospital's billing department about 0% interest repayment.",
      "content": "Ask the hospital's billing department about 0% interest repayment. Most hospitals offer interest-free payment plans which, although it won't reduce your bill, will spread payments over time so that you don't take such a big financial hit all at once. Medical debt payment plans aren't as clear-cut as loans or credit cards. While this can work in your favor, it can also put you in more debt if you don't pay close attention to every detail. [8] X Research source Keep in mind that some of these plans may cost you more in the long run. Always read the fine print and, if you're confused, hire a patient advocate."
    },
    {
      "title": "Talk to your doctor and ask for bill reduction.",
      "content": "Talk to your doctor and ask for bill reduction. Bill reductions can sometimes reduce bills by significant amounts. For example, some doctors are part of hospital networks that offer discounts for certain payment options, such as payment by phone. Always ask your doctor about a reduction. There are usually options, but you typically have to ask to obtain them. Apply for bill reduction before asking for a repayment plan. If your bill is reduced, you can still apply for the repayment plan and, sometimes, you are eligible for both."
    },
    {
      "title": "Apply for a charity fund in your area.",
      "content": "Apply for a charity fund in your area. Most states have Charity Funds which are intended to help people who can't afford medical expenses. Ask your hospital to submit your bill to the State Charities Fund. If someone gives you trouble or has never heard of the State Charities Fund, call your State representative and ask them for guidance. State representative contact information is listed here: https://www.house.gov/representatives ."
    },
    {
      "title": "Prioritize urgent care centers for non-emergencies.",
      "content": "Prioritize urgent care centers for non-emergencies. For injuries like sprains, minor cuts, and fevers, use an urgent care center instead of an emergency room. These centers typically offer lower prices for all treatments—emergency or not. Between 2005 and 2006, the average price for emergency visits was just $156. For emergency rooms, the same visit cost $570. [9] X Research source"
    },
    {
      "title": "Ask your insurer to send current pricing documentation.",
      "content": "Ask your insurer to send current pricing documentation. Websites or handbooks that document insurance deductibles are sometimes out of date which is why you should personally request the most current versions. Determine how much you have to pay for emergency care, how long you have to stay for these fees to be waived, and which area hospitals accept your insurance. Communicate with the billing department at your hospital of choice and determine whether their emergency room doctors are covered by your insurance plan. When emergency situations do arise, you can use the aforementioned information to choose the cheapest hospital based on what your coverage provides. Clarify how your plan defines \"medically necessary ambulance rides.\" This will typically include situations when you are unconscious, severely bleeding, or in extreme pain."
    },
    {
      "title": "Never pay out-of-network bills right away.",
      "content": "Never pay out-of-network bills right away. Every time you receive emergency room care, you will likely receive separate bills from each provider outside of your insurance network. Always wait until you receive an explanation of benefits (EOB) statement from your insurer. Compare bills and EOBs to ensure that you received all noted services. You also need to confirm that each provider that sent you the bills are outside of your plan. Always ask your insurer if they are flexible on paying your outside bills. You can also ask doctors if they are willing to negotiate or ask your insurer to do so on your behalf."
    },
    {
      "title": "File an appeal if your providers aren't being flexible.",
      "content": "File an appeal if your providers aren't being flexible. If your insurers or healthcare providers aren't being working with you, you can file an appeal. Ask your primary care doctors for a letter confirming the necessity of your emergency room treatment. Use the Patient Advocate Foundation for guidance—they are free of charge. Visit them here: http://www.patientadvocate.org/ . Enlist the help of professional claims consultants if you're willing to pay a fee or part of the reimbursement."
    }
  ]
}