{
  "url": "https://www.wikihow.com/Prevent-Yourself-from-Being-Manipulated",
  "title": "How to Prevent Yourself from Being Manipulated",
  "steps": [
    {
      "title": "Tune into your feelings about the situation.",
      "content": "Tune into your feelings about the situation. Manipulation can be subtle, so it can be difficult to recognize when it is happening to you. However, there are some common things that manipulators tend to do, such as casting doubt, projecting insecurities, and making you doubt yourself. [1] X Research source By learning to tune into how you are feeling, you may be able to spot manipulation more easily. The next time you think you might be being manipulated, stop and ask yourself, \"Am I doing this because I want to or because I feel guilty, ashamed, embarrassed, afraid, obligated, responsible etc.?\" If you are doing something for one of the latter reasons, then it is possible that you are being manipulated."
    },
    {
      "title": "Watch for someone who threatens withdrawal.",
      "content": "Watch for someone who threatens withdrawal. People who make you feel like they will take something away from you if you don’t act the way they want are manipulating you. These threats may involve the withdrawal of many things – their company, their love, their money, their support, or any other thing they might threaten to withhold from you. [2] X Research source Many people are motivated by this kind of manipulation at work (working late because they fear they won’t get their next promotion if they don’t), but it can be more damaging in personal relationships between people because these interactions involve more intimate emotions. An example of a love withdrawal statement is, “Sure, you can do whatever you like, but don’t expect me to be here when you get home. I’m done with you.”"
    },
    {
      "title": "Look for someone who makes you feel guilty.",
      "content": "Look for someone who makes you feel guilty. A manipulative person will try to make you feel guilty for not doing what they want you to do. They might achieve this goal by acting like you are letting them down or by talking about how much of an inconvenience/hardship something is for them. Typically, we experience guilt when we feel like we have gone back on our end of a bargain. But in situations where you suspect you are being manipulated, try to consider whether you consciously agreed to the thing you feel guilty about or if the person is just making you feel guilty for no reason. A guilt statement might sound like, “I really thought you cared about me, but I guess this is more important to you. I see how little our relationship means to you, and I wonder if you even love me.”"
    },
    {
      "title": "Be wary of people who make their problems seem more urgent than yours.",
      "content": "Be wary of people who make their problems seem more urgent than yours. Manipulative people often manipulate others by making their own problems seem more important or more pressing than the problems of other people. If you feel obligated to help someone with something (and this seems to happen quite regularly), you are probably being manipulated. [3] X Research source When we decide what tasks are most important to complete in our own lives, urgency is one way we organize our tasks and decide which to complete first. But when other people get to determine a thing’s urgency, this is problematic and manipulative."
    },
    {
      "title": "Pay attention to an excessive use of facts and figures.",
      "content": "Pay attention to an excessive use of facts and figures. People who spout out lots of facts and figures may also be trying to manipulate you. The idea behind this tactic is to make you feel as though you do not know as much as the other person. Someone who does this is trying to convince you that he or she is intellectually superior to you. [4] X Research source"
    },
    {
      "title": "Note when someone refuses to speak.",
      "content": "Note when someone refuses to speak. Some people manipulate others by refusing to speak first or giving you the silent treatment. When someone does this, he or she may be probing for information that he or she can use against you. The person may wait for you to speak to find out what you think is happening and what your goals are. [5] X Research source"
    },
    {
      "title": "Listen to the volume of the person’s voice.",
      "content": "Listen to the volume of the person’s voice. Some people will shout or speak loudly to subdue other people. This person may drown out your voice with his or her own to get you to stop trying to defend yourself and give in to the other person’s demands. [6] X Research source If someone is yelling at you or speaking over you, then this is likely manipulation. He or she may also use other tactics to subdue you, such as blocking your path or standing over you."
    },
    {
      "title": "Think about times when the person has tried to catch you off-guard.",
      "content": "Think about times when the person has tried to catch you off-guard. Someone can also manipulate you by springing things on you and taking advantage of your lack of preparation. By catching you off-guard, the person is hoping that you will be more likely to give in to his or her request. [7] X Research source For example, someone who is trying to manipulate you might ask you an important question right when you walk through the door. Or, someone might try to get you to perform an important task with little to no notice."
    },
    {
      "title": "Pay attention to criticism.",
      "content": "Pay attention to criticism. Someone who is being manipulative may also use criticism to gain an advantage over you. He or she may even mask the criticism as humor or as coming from a place of love. [8] X Research source [9] X Research source However, if someone is criticizing you to get something that he or she wants, then this is manipulation. For example, someone who is trying to sell you a new phone might mask criticism with humor by saying something like, “Geez, is your phone from the stone age?” However, this person is clearly trying to make you feel insecure about your phone so that you will buy a new one. Someone may also mask criticism with expressions of love, such as by saying, “Even though you don’t put much effort into your appearance, I still love you.” This statement is mean to make the person feel insecure about his or her looks, but the speaker attempts to mask it with a tacked-on statement of love."
    },
    {
      "title": "Think about the individual(s) manipulating you.",
      "content": "Think about the individual(s) manipulating you. Is it a group of people, or just one person? If you are dealing with a group of people, it is best to confront either the leader of the group or the weakest person in the group. Tell them that you feel like they are pressuring you into doing something you don’t want to do."
    },
    {
      "title": "Ask the manipulator questions.",
      "content": "Ask the manipulator questions. When you feel you are being manipulated, try asking the person a series of probing questions. This may catch them off guard and allow you the time you need to analyze the situation and make a decision about how you want to handle it. [10] X Research source Some questions you could ask include: Do I have a say in this? Does this seem reasonable to you? Are you asking me or telling me? What do I get out of this? Does what you want from me sound fair?"
    },
    {
      "title": "Refuse the request.",
      "content": "Refuse the request. When this person(s) asks you to do something you do not want to do, simply refuse. This can be difficult at first, but you have to understand that no good will come out of it for either of you. Once you say no, the person will most likely be surprised. [11] X Research source Learning to firmly say no is an important part of not allowing yourself to be manipulated."
    },
    {
      "title": "Don’t give in to continued attempts.",
      "content": "Don’t give in to continued attempts. If you are continually pressured to do something unpleasant, say no and walk away. Do not allow the person(s) to coerce you by pressuring you over and over. If they don’t accept your refusal, simply exit the situation."
    },
    {
      "title": "Confront the person.",
      "content": "Confront the person. It is best to do this in a private place. Explain that you do not want to let yourself be controlled. However, you should also mention that you still want to continue the friendship, as long as this person is willing to change their behavior. Most of the time, this person will not want to continue the relationship. Do not be depressed about this. Recognize the fact that your life was not improved at all by this person."
    },
    {
      "title": "Don’t give in to flattery.",
      "content": "Don’t give in to flattery. One of the main methods of manipulation that people use is giving undue flattery. When someone praises you, especially when you really haven’t done anything to deserve it, this feels good and it’s easy to give in to it. But that is just a form of trickery by a manipulative person who knows exactly what they’re doing. [12] X Research source Try telling them that you appreciate the compliment, but you don’t feel like you’ve done enough to deserve such comments."
    },
    {
      "title": "Look inward for potential causes.",
      "content": "Look inward for potential causes. Ask yourself about the underlying causes of your own personal manipulation. Perhaps you have a tough time saying no, period. Or you feel sorry for a certain person. Either way, it is important to recognize the root of the issue (and the role you may play in your own manipulation) so that you can work on preventing it in the future. Recognizing the reasons you feel compelled to help, or are easily manipulated, will help you avoid similar situations in the future."
    },
    {
      "title": "Avoid manipulative people when possible.",
      "content": "Avoid manipulative people when possible. You don’t owe a manipulative person anything, despite how they may try to make you feel. You are free to choose how you spend your time and with whom. If you feel like you are being constantly manipulated by a particular person, choose to avoid them. This doesn’t mean that you have to end the friendship or relationship. Just be more in control of how often you see the person and under what circumstances."
    },
    {
      "title": "Use your experiences to aid you in the future.",
      "content": "Use your experiences to aid you in the future. Learn how to detect early signs of manipulative behavior. For example, a person like this will want to influence your appearance. They will constantly give you \"suggestions\" as to how you should change your looks and personality. Some examples of this are: \"Are you really gonna wear that dress to the party?\" \"You should stop laughing that loud.\" \"You shouldn't wear loose jeans. No one likes a girl that wears loose jeans.\""
    },
    {
      "title": "Ask a trusted friend for advice.",
      "content": "Ask a trusted friend for advice. Speak to family or friends who are present when you get taken advantage of. What are some behaviors that often occur between you are the other person(s)? You can try to observe the situation yourself, but getting opinions from others is usually more helpful because they can give you an objective viewpoint. An outside party will notice things that you miss because you are too involved in the situation."
    },
    {
      "title": "Go to counseling.",
      "content": "Go to counseling. Sometimes it’s helpful to get insight into our own behavior by discussing it with a trained professional in a counseling or therapy setting. Going to counseling can help you identify the reasons you allow yourself to be manipulated, the motivations other people might have for manipulating you, and what you can do to proactively change the situation."
    },
    {
      "title": "Take a break.",
      "content": "Take a break. If you’re feeling overwhelmed by a particularly manipulative person, take a break from them. Don’t feel obligated to continue relationships that stress you out. If you need a break from a person, take one. You are in charge of your own life. [13] X Research source You could even go on vacation for a while to get some peace and quiet away from everyone."
    }
  ]
}