{
  "url": "https://www.wikihow.com/Play-Chinese-Checkers",
  "title": "Chinese Checkers Rules: How to Play & Win",
  "steps": [
    {
      "title": "Split up the board depending on the number of players.",
      "content": "Split up the board depending on the number of players. A Chinese Checkers board resembles a 6-pointed star, with each point of the star featuring 10 “peg” (or marble) holes inside of it. The inner hexagon of the board is also filled with peg holes, and each side of the hexagon has 5 peg holes along it. The way you divide up the board ultimately depends on the number of people playing: 2 players: Use 1 pair of opposing triangles. 3 players: Use every other triangle on the board. 4 players: Use 2 pairs of opposing triangles. 6 players: Use all 6 triangles. Note: Chinese Checkers typically requires an even number of players, so there isn’t a way to fairly play with 5 players. Three players are only admissible since each player is working toward an empty triangle on the opposite side of the game board."
    },
    {
      "title": "Place your pegs in the peg holes.",
      "content": "Place your pegs in the peg holes. Stick the colored pegs in the matching triangle that you’ll be playing with. [1] X Research source Not all Chinese Checkers boards have color-coded triangles, however—in this case, you can choose any colored set of pegs you wish."
    },
    {
      "title": "Aim to get all 10 of your pegs in the opposite triangle.",
      "content": "Aim to get all 10 of your pegs in the opposite triangle. Unlike traditional checkers, Chinese Checkers doesn’t involve “capturing” your opponent’s pieces. Instead, it’s a race against your fellow players—the object of the game is to get all of your pieces across the board into the opposing triangle before any other player can do the same. [2] X Research source"
    },
    {
      "title": "Rotate gameplay clockwise, starting with the youngest player.",
      "content": "Rotate gameplay clockwise, starting with the youngest player. Alternatively, choose any player to go first or use a method like drawing straws or rock-paper-scissors. Just make sure to take turns moving in a clockwise direction. [3] X Research source"
    },
    {
      "title": "Take your turn by moving 1 peg to an adjacent space.",
      "content": "Take your turn by moving 1 peg to an adjacent space. In Chinese Checkers, your pegs can move in any direction along the board, as long as you’re going to an adjacent space. Only one peg can be moved per turn."
    },
    {
      "title": "Hop over a nearby peg if it’s blocking your path.",
      "content": "Hop over a nearby peg if it’s blocking your path. Feel free to jump over an opponent’s peg (or your own) if it’s in your way. Just make sure that you’re jumping in a straight line (rather than hopping at an angle), and that you’re only jumping over a single peg. Multiple hops are allowed in a single turn, as long as both of these requirements are met. It’s against the rules to jump over a “block” of 2 pegs. [4] X Research source You can hop into an opponent’s triangle (besides the triangle you’re angling to get your pieces into) if you hop out on the same turn."
    },
    {
      "title": "Win the game",
      "content": "Win the game by moving all of your pieces to the opposite triangle. Let’s say that you’re playing as the red pegs, which are on one side of the board, and your opponent is playing as the black pegs, which are on the opposite side of the board. Win the game by moving all of your red pegs into the black peg holes before they get their black pegs into the red peg holes. [5] X Research source You can't move your pegs back into play once they’ve entered the final triangle. Don’t remove your pegs from the board, either—unlike traditional checkers, all pieces stay on the board for the entirety of the game in Chinese Checkers. Special Exception: Does your opponent refuse to move one of their starting pegs while you have 9 out of your 10 pegs in their final spots? No worries. According to modern Chinese Checker rules, simply swap your final piece with the adjacent obstructing piece to win the game. This is an optional rule, though, and needs to be decided on before the game starts. [6] X Research source"
    },
    {
      "title": "Super Chinese Checkers",
      "content": "Super Chinese Checkers Not in the mood for a long game? In Super Chinese Checkers, there are no jumping restrictions for your pegs, so your pegs can jump in whatever direction you’d like. You’re also allowed to make “super” jumps—in other words, if there are 2 spaces both in front and behind a neighboring peg, you could jump 6 total spaces over that peg. [7] X Research source With super jumps, the only requirement is that there are the same number of spaces in front and behind a peg."
    },
    {
      "title": "Multiple Triangle Play",
      "content": "Multiple Triangle Play Want to spice up your 2- or 3-player game? Give each player multiple triangles and sets of pegs to control—just make sure that you’re playing on the opposite side of your opponent. The game continues until a player gets all of their peg sets into their destination triangles on the board. [8] X Research source"
    },
    {
      "title": "Online or mobile Chinese Checkers",
      "content": "Online or mobile Chinese Checkers Plenty of gaming websites and apps offer a digital means of playing Chinese Checkers. Most online and mobile games should operate under the same rules as traditional Chinese Checkers. Chinese Checkers (for Android) Chinese Checkers (for iOS)"
    }
  ]
}