{
  "url": "https://www.wikihow.com/Pay-the-Congestion-Charge",
  "title": "How to Pay the Congestion Charge",
  "steps": [
    {
      "title": "Create an online account with the Transport for London.",
      "content": "Create an online account with the Transport for London. The Transport for London (TFL) organization oversees all things related to the congestion charge. You can pay the charge online only if you’ve already created a personal or business account. To set up the account, provide the TFL with your name and address, phone number, and a 6-digit PIN. You’ll also need to submit bank account or credit card information for payments. [2] X Research source Create your account online at: https://tfl.gov.uk/modes/driving/account-create-account-29278 ."
    },
    {
      "title": "Set up autopay for convenience if you drive in London frequently.",
      "content": "Set up autopay for convenience if you drive in London frequently. If you often commute into central London, the easiest way to pay the congestion charge is through the autopay option on the TFL website. Autopay will automatically deduct the amount of the congestion charge from your bank account every time your vehicle enters the city center. [3] X Research source To set up the autopay, visit: https://tfl.gov.uk/modes/driving/autopay-apply-before-you-begin . Also provide the TFL website with the make, model, and license plate number of your vehicle as part of the autopay registration process. As a perk, each congestion charge payment is reduced by £1 when you pay through autopay. So, you’ll only pay £14 or £16.50. If you choose to pay the congestion charge online with autopay, you will be charged an annual amount of £10. [4] X Research source"
    },
    {
      "title": "Make individual payments online if you’re only visiting central London.",
      "content": "Make individual payments online if you’re only visiting central London. If you’re a tourist in the UK or if you don’t frequently visit London, there’s no reason to set up autopay online. You can simply navigate to the TFL’s website and make a 1-time payment using a credit card or bank account. The charge can be paid up to 90 days in advance, or before midnight on the day you drove into London. Enter your vehicle’s license plate number and the country in which it’s registered before making the payment. [5] X Research source Pay a 1-time congestion charge online at: https://tfl.gov.uk/modes/driving/pay-the-charge-select-vehicle-26283 . Be aware that if you don’t make the payment until the day following your drive to central London, an extra £2.50 will be added to the charge. If you don't make the payment by midnight on the third day after travel, you will receive a Penalty Charge Notice costing £80 to £240 [6] X Research source"
    },
    {
      "title": "Call the TFL hotline if you prefer to speak with a person.",
      "content": "Call the TFL hotline if you prefer to speak with a person. The TFL has a dedicated hotline that you can call to make your congestion-charge payments. If you’re calling from within the UK, the number for TFL payments is 0343 222 2222. If you’re calling internationally, dial +44 20 7649 9122. You can make a payment by giving the TFL clerk your credit card number or bank account information. The line is active on weekdays between 8:00 am and 8:00 pm. [7] X Research source Make sure to call and pay the charge before midnight on the day you drove into central London. Otherwise, a penalty charge of £2.50 will be added to the amount you owe."
    },
    {
      "title": "Take care of the charge through the TFL app if you have a smartphone.",
      "content": "Take care of the charge through the TFL app if you have a smartphone. If you have a device with internet connectivity (e.g., smartphone or tablet) visit the Google Play or Apple App stores and download the TFL app. The app is called “TFL Pay to Drive in London,” and the image thumbnail looks like a blue circle with a horizontal line running through it. Once you’ve downloaded the app, you can input your vehicle’s license and registration information and pay the congestion charge with a credit card or bank account. [8] X Research source The app itself is free and will work on any smart device."
    },
    {
      "title": "Save your vehicle details in the app if you frequently drive in London.",
      "content": "Save your vehicle details in the app if you frequently drive in London. The TFL “Pay to Drive in London” app allows you to save your vehicle’s information (including its license number and registration info) so you don’t have to enter them each time you drive into London’s city center. Doing this will save you time and effort. If you will be driving in London but aren’t sure if a certain postcode is in the congestion-charge zone or not, you can also check this on the app. [9] X Research source You can also review your payment history on the app to view previous payments you’ve made for both the congestion charge and the ULEZ fee."
    },
    {
      "title": "Apply for a discount if you live within the Congestion Charging Zone.",
      "content": "Apply for a discount if you live within the Congestion Charging Zone. The TFL offers a substantial 90% discount off of the congestion charge if you live within the zone. As proof of your address, the TFL requires you to show your driving license and either a bank or credit card statement with your address on it, vehicle registration (with your address on it), or a formal housing lease. [10] X Research source Note that as of May 2021, the residents' discount is temporarily closed to new applicants. You can continue checking the TFL site for news on when the discount opens again. Check for updates (and apply for the discount when available) online at: https://tfl.gov.uk/modes/driving/congestion-charge/discounts-and-exemptions You can also apply through the same website for a 100% discount if you drive a vehicle with more than 9 seats or a motorized tricycle."
    },
    {
      "title": "Expect to also pay the ULEZ fee if your vehicle doesn’t meet emission standards.",
      "content": "Expect to also pay the ULEZ fee if your vehicle doesn’t meet emission standards. While it’s not technically part of the congestion charge, the ultra low emission zone (ULEZ) fee is also overseen by the TFL and can be paid through the same online portal. If your vehicle doesn’t meet London’s strict emissions requirements, the TFL requires you to pay the ULEZ fee along with the congestion charge each time you enter the city center. This is an additional, separate fee that you’ll be charged each time you enter London’s city center. [11] X Research source Find out more and pay the ULEZ fee online at: https://tfl.gov.uk/modes/driving/ultra-low-emission-zone/ulez-where-and-when . The ULEZ fee comes to £12.50 for nearly all vehicle types that don’t meet the emission standards. For large trucks and busses, the fee comes to £100. To input your vehicle’s make, model, and other relevant information to find out if it meets the ULEZ standards, visit: https://tfl.gov.uk/modes/driving/check-your-vehicle-35896?intcmp=35896 ."
    },
    {
      "title": "Pay the penalty fee if you neglect to settle the charge within 2 days.",
      "content": "Pay the penalty fee if you neglect to settle the charge within 2 days. If you haven’t paid the London congestion charge by midnight of the day after you entered London, you’ll receive a Penalty Charge Notice (PCN) in the mail. The charge is typically for £160; however, if you pay it off within 14 days, the fee drops to £80. Pay the fee by calling the TFL hotline and following the payment procedure as outlined on your PCN. [12] X Research source If you leave a penalty charge unpaid for 28 days or longer, the fee increases to £240. To pay off a PCN online, visit: https://tfl.gov.uk/modes/driving/pay-a-pcn ."
    }
  ]
}