{
  "url": "https://www.wikihow.com/Pack-Picture-Frames-for-Shipping",
  "title": "How to Pack Picture Frames for Shipping",
  "steps": [
    {
      "title": "Grab a roll of artist tape.",
      "content": "Grab a roll of artist tape. To help protect your frame throughout the shipping process, you’ll cover it in a layer of artist or painters tape. That way, if it breaks during transit, the shattered shards will stick to the tape instead of falling onto the artwork. Do not use masking tape or similar high-tack adhesives since they are difficult to remove and can leave an annoying film on the frame. [1] X Research source Artist tape is available at most craft, home supply, and discount stores."
    },
    {
      "title": "Make a star pattern out of tape to protect small glass panels.",
      "content": "Make a star pattern out of tape to protect small glass panels. Lay down 2 strips of artist tape over the glass in an X formation, with each piece stretching diagonally from 1 corner to the other. Then, lay down 2 more strips in the form of a cross or plus sign, with the tape stretching from the midpoint of 1 side to the midpoint of the other. [2] X Research source"
    },
    {
      "title": "Create a grid pattern with tape to protect large glass panels.",
      "content": "Create a grid pattern with tape to protect large glass panels . Lay down strips of vertical and horizontal artist tape over the entire sheet of glass. You can apply the strips in any order, but by the end they should cover every section of glass. For extra protection, lay the tape down in an overlapping grid pattern. [3] X Research source"
    },
    {
      "title": "Do not place tape on the picture frame border.",
      "content": "Do not place tape on the picture frame border. Tape can be particularly difficult to remove from a border and, in many cases, will create unnecessary damage. If you have extra tape at the end of a strip, either cut the ends off with scissors or fold the ends back on themselves and secure them with more tape. [4] X Research source"
    },
    {
      "title": "Wrap brown paper around the frame.",
      "content": "Wrap brown paper around the frame. Place a sheet of brown paper on a flat surface. Smooth out the paper, then set your picture frame on top of it facing down. Grab the long edges of the paper and pull them over the picture frame, securing them with artist tape. Then, fold the small edges of the paper in, pull them over the picture frame, and hold them in place with more tape. [5] X Research source You can purchase brown shipping paper at most craft and shipping supply stores."
    },
    {
      "title": "Use cardboard covers to protect the frame corners.",
      "content": "Use cardboard covers to protect the frame corners. Buy 4 protective cardboard corners, typically available at a craft supply or shipping store. If they do not come pre-built, put them together by following the instructions included with the purchase or printed on the corners themselves. Then, place a cardboard protector on every corner of your picture frame, better shielding them from impact damage. [6] X Research source"
    },
    {
      "title": "Put a cardboard sheet on the top side of your picture frame.",
      "content": "Put a cardboard sheet on the top side of your picture frame. Grab a sheet of cardboard that is about the same size as your painting. Lay it over the top side of the picture frame so that the glass has an extra layer of defense. Though not necessary, you can secure it to the brown paper with artist tape if you wish. [7] X Research source"
    },
    {
      "title": "Cover your picture frame with bubble wrap.",
      "content": "Cover your picture frame with bubble wrap. Put down a piece of bubble wrap and set your picture frame on top of it. Grab the long ends of the protective material and wrap them tightly around your frame, securing them with masking tape. Then, fold the short ends up over the frame and tape them down. For picture frames containing particularly valuable works of art, add 1 to 2 additional layers of bubble wrap. [8] X Research source Look for bubble wrap at discount, craft, and shipping supply stores."
    },
    {
      "title": "Get a slim cardboard shipping box that is slightly larger than your frame.",
      "content": "Get a slim cardboard shipping box that is slightly larger than your frame. Go to a shipping supply or craft store and buy a slim cardboard packing container. The box should be thick enough to withstand general wear and tear. If possible, get a box that is slightly larger than your picture frame, that way you can pad it for extra safety. [9] X Expert Source Marty Stevens-Heebner, SMM-C, CPO® Professional Move Manager Expert Interview. 14 January 2020."
    },
    {
      "title": "Put your picture frame in the box.",
      "content": "Put your picture frame in the box. If you’re using a top opening box, put a layer of bubble wrap down, set your picture frame on it, and cover the frame with another layer of bubble wrap. If you’re using a side-opening box, place a small tube of bubble wrap inside, slide your art in, then place another tube of wrap on top. [10] X Research source"
    },
    {
      "title": "Fill any open space with bubble wrap.",
      "content": "Fill any open space with bubble wrap. To keep your picture frame from shifting during transit, fill any empty areas with bubble wrap or a similar thick packing material. Put in enough bubble wrap that if you shake the box while it’s closed you cannot feel the painting move. [11] X Expert Source Marty Stevens-Heebner, SMM-C, CPO® Professional Move Manager Expert Interview. 14 January 2020."
    },
    {
      "title": "Seal the box and reinforce the sides with tape.",
      "content": "Seal the box and reinforce the sides with tape. Close the lid of your box and secure the seam with masking tape. Then, wrap all 4 thin sides of the box with additional masking tape, making sure no area goes uncovered. The tape will help reinforce your box, making it less likely to bust open. [12] X Research source"
    }
  ]
}