{
  "url": "https://www.wikihow.com/Paint-Ombre-Walls",
  "title": "How to Paint Ombre Walls",
  "steps": [
    {
      "title": "Protect your flooring and furniture.",
      "content": "Protect your flooring and furniture. Move any furniture that might get dirty away from the walls. Unscrew any fixtures, including switch and outlet plates. Finally, lay down a drop cloth over the floor in front of the wall you will be painting. The drop cloth can be made from canvas or sturdy plastic sheeting."
    },
    {
      "title": "Clean your walls and let them dry.",
      "content": "Clean your walls and let them dry. Use a specially-made wall cleaner from the store or a mixture of soap and water. Allow the walls to air dry after you have finished cleaning them. Cleaning the walls will help remove any surface dirt or oils that may prevent the paint from sticking. If there are any holes and cracks in the wall, fill them. [1] X Expert Source Barry Zakar Handyman Expert Interview. 16 July 2020. Sand the uneven portions if necessary. [2] X Expert Source Barry Zakar Handyman Expert Interview. 16 July 2020. If the wall has wallpaper on it, be sure to remove that first. Make sure that there is no residue, then apply a primer or base coat."
    },
    {
      "title": "Tape off trims and joints between ceilings and walls.",
      "content": "Tape off trims and joints between ceilings and walls. Lay down painters tape along the trim on the base of your wall, making sure that the top edge of the tape is touching the wall. Next, lay down another strip of tape on the edge of the ceiling, right where the wall begins. Finally, lay down a strip of tape to either side of the first wall that you will be painting. Don't let the tape get wrinkled, otherwise the paint may seep under the wrinkles and get where you don't want it."
    },
    {
      "title": "Divide your wall into rows using a pencil, a ruler, and a level.",
      "content": "Divide your wall into rows using a pencil, a ruler, and a level. How many rows you do is up to you, but you need at least two. The rows do not have to be all the same thickness. If you’ll be blending with a sponge, use a strip of painter’s tape to divide the rows instead. [3] X Research source"
    },
    {
      "title": "Measure the length and height of each row.",
      "content": "Measure the length and height of each row. This will tell you how much paint you will need to buy. Most brands of paint are sold based on square footage, so you should take your measurements in feet/meters."
    },
    {
      "title": "Mix and pour the first two colors of paint.",
      "content": "Mix and pour the first two colors of paint. Open the can for your first color of paint on the bottom-most row. Give it a good stir with a wooden stir stick, then pour it out into a painting tray. Repeat this step for the second color of paint and the second row. Do not shake the can as this can introduce too many air bubbles. It is better to use good quality paint and primer in one, type of paint.. [4] X Expert Source Barry Zakar Handyman Expert Interview. 16 July 2020."
    },
    {
      "title": "Paint to the first two sections, leaving a gap between them.",
      "content": "Paint to the first two sections, leaving a gap between them. Use a paint roller to apply your first color of paint to the bottom-most row. Repeat the process with a clean roller for the second row and color. Leave a 6-inch (15-cm) gap between the two rows for blending. [5] X Research source If you are working on a very large wall, work on a 5-foot (1.5-m) wide area first. [6] X Research source If you used a strip of painter's tape to divide the rows, paint right up to the tape instead, then peel the tape off. [7] X Research source"
    },
    {
      "title": "Dip a 4-inch (10-cm) wide brush into your first two colors of paint.",
      "content": "Dip a 4-inch (10-cm) wide brush into your first two colors of paint. Pull the paint trays right next to each other. Dip the left side of the brush into the left pan, and the right side into the right pan. Make sure that the brush is centered. [8] X Research source If you prefer to use a sponge apply the first color to the left side of the sponge, and the second color to the right. Do not saturate the sponge with paint. [9] X Research source"
    },
    {
      "title": "Run the brush along the gap until the white space is covered.",
      "content": "Run the brush along the gap until the white space is covered. Orient the bristles vertically, with the first color on the bottom and the second color on top. Run the brush back and forth along the gap, making sure that you off-set it with each pass. This will blend the two colors together and cover up any unpainted areas. [10] X Research source If you are using a sponge, simply pat your way along the wall, reapplying the paint as needed. You can go back along the line to help further smooth things out. [11] X Research source Again, if you are working on a large wall, work on a 5-foot long strip instead."
    },
    {
      "title": "Work your way along the wall, then do the next set of colors.",
      "content": "Work your way along the wall, then do the next set of colors. Depending on the length of your wall, you may need to repeat the above process a few times. Remember, paint dries quickly, so it is best to work in 5-foot (1.5-m) long sections. Once you finish the first two rows, move onto the next two (if needed). [12] X Research source Your next two rows should consist of the second row and the third row."
    },
    {
      "title": "Remove the painter’s tape from the trim, ceiling, and adjacent walls.",
      "content": "Remove the painter’s tape from the trim, ceiling, and adjacent walls. If you wish to paint other walls, you can move onto them at this time. Remember to apply painter's tape to the trim, ceiling, and adjacent walls so that you get nice, clean lines."
    },
    {
      "title": "Touch up any mixed patches with a smaller brush and matching paint.",
      "content": "Touch up any mixed patches with a smaller brush and matching paint. Take a close look at the blending between your ombre. If you see any missed patches, touch them up using a smaller paintbrush and the right paint color for that section."
    },
    {
      "title": "Touch up any bleeds on the trim, ceiling, and adjacent walls.",
      "content": "Touch up any bleeds on the trim, ceiling, and adjacent walls. The painter's tape is meant to prevent this from happening, but there is still a chance that some paint got underneath the tape. Check the trim, ceiling, and adjacent walls for any bleeds. If you see any, cover them up with a clean brush and a matching paint color."
    },
    {
      "title": "Allow the paint to finish drying and curing.",
      "content": "Allow the paint to finish drying and curing. Just because something feels dry to the touch does not necessarily mean that it is completely dry and ready to use. Many types of paint require a few days in which to cure. Check your can of paint for more specific drying and curing times."
    },
    {
      "title": "Remove the drop cloth and replace any outlet or light switch covers.",
      "content": "Remove the drop cloth and replace any outlet or light switch covers. At this point, your room is ready to use! If you notice any lingering paint smell, leave a window open for a few days so that it can dissipate."
    }
  ]
}