{
  "url": "https://www.wikihow.com/Play-Games-Online",
  "title": "How to Play Games Online",
  "steps": [
    {
      "title": "Go to https://www.google.com/ in a web browser.",
      "content": "Go to https://www.google.com/ in a web browser. You can use any web browser of your choice. Some online games may require you to install Adobe Flash Player to play them in your web browser."
    },
    {
      "title": "Type free online games in the search bar and click Google Search.",
      "content": "Type free online games in the search bar and click Google Search . This displays a list of websites with free online games."
    },
    {
      "title": "Click on a website that has free online games.",
      "content": "Click on a website that has free online games. There are a variety of websites that have online games you can play for free. Some games, like Little Alchemy and MovieStarPlanet can be played on the developers web page. Some of the following are websites that include free games you can play online: https://www.arkadium.com/ https://www.agame.com/ https://games.usatoday.com/category/allgames/"
    },
    {
      "title": "Browse for a game to play.",
      "content": "Browse for a game to play. The main page of the website should have a lot of games for you to browse. Alternatively, you can click the category options on the website to browse games by type."
    },
    {
      "title": "Click a game.",
      "content": "Click a game. When you see a game you want to play, click it. In most cases, the game will load in your web browser. In some cases, it may take you to the official website for the game. In which case, follow the instructions on the website to start playing. It may require you to download the game."
    },
    {
      "title": "Create an online account.",
      "content": "Create an online account. Before you can play multiplayer games, you need to create an account with a digital distribution service. This generally involves filling out a form where you provide your name, email address, and choose a username and password. Your username will be the name that is visible to other users online. The digital distribution service you use depends on the platform you play on. Steam is a popular service for PC gamers. On PlayStation, you'll need to sign up for a PlayStation Network account . On Xbox, you'll need to sign up for Xbox Live."
    },
    {
      "title": "Download or purchase a game that supports online multiplayer.",
      "content": "Download or purchase a game that supports online multiplayer. You can purchase physical games from a store, or purchase them online using the Steam client , PlayStation Store , or The Xbox Store. Check the back of the game box or the games information page to see if it supports online multiplayer. Many games require a credit card to purchase. Other games are free to download and play. The following are some popular online games. [1] X Research source Fortnite (Free). Destiny 2 (Free). Dota (Free). Call of Duty (Paid). World of Warcraft (Paid). Grand Theft Auto Online (Paid). Minecraft (Paid)."
    },
    {
      "title": "Connect a headset and microphone (Optional).",
      "content": "Connect a headset and microphone (Optional). Many online games allow you to communicate with other players online using a headset and microphone. Connect the headset and microphone to your controller or PC to communicate with players online."
    },
    {
      "title": "Start the game.",
      "content": "Start the game. To open a game on your PC or Mac, click the game icon on your desktop, Start menu, Dock, or Applications folder. To start a game on PlayStation or Xbox, select the game from the Home Screen or Library."
    },
    {
      "title": "Select the multiplayer mode.",
      "content": "Select the multiplayer mode. When you get to the title screen of the game, select the multiplayer mode. This may say Multiplayer , Online , or something similar. Many multiplayer games on PlayStation or Xbox require a subscription to PlayStation Plus, or an Xbox Live Gold. This generally does not apply to free-to-play games."
    },
    {
      "title": "Select a game mode.",
      "content": "Select a game mode. Many online games have different game modes. For example, many first-person shooters include game modes for deathmatch, team deathmatch, capture and control, and other game types. Fortnite has game modes that allow you to play solo, in teams of 2 or 4, as well as a free-play/sandbox mode."
    },
    {
      "title": "Wait for the game to start.",
      "content": "Wait for the game to start. Once you select an online game, you will need to wait for the game to find other players for you to play with. Then you will need to wait for the game to start."
    },
    {
      "title": "Enjoy!",
      "content": "Enjoy! Playing games with people online can really enhance the experience. If you're not good, keep practicing. You'll get better."
    },
    {
      "title": "Open the Google Play Store on Android, or the App Store .",
      "content": "Open the Google Play Store on Android, or the App Store . This is where you browse, purchase, and download games for your mobile device. The Google Play Store for Android has an icon that resembles a colorful triangle. The App Store for iPhone and iPad has a blue icon with a capital \"A\". Tap the icon on your home screen to open the Google Play Store or App Store."
    },
    {
      "title": "Tap Games.",
      "content": "Tap Games . On iPhone and iPad, it's the icon that has a rocket ship at the bottom of the screen. On Android, it's the icon with a game controller at the bottom of the screen. [2] X Research source This is where you can browse for games to download. Some games are free to download, and others require a credit card purchase. Alternatively, if you know the name of the game you want to download, you can use the search bar to search for it. The search bar is at the top of the screen in the Google Play Store, and in the \"Search\" tab at the bottom of the screen in the App Store on iPhone and iPad."
    },
    {
      "title": "Tap a game you want to download.",
      "content": "Tap a game you want to download. When you see a game you want to download, tap its icon to view the information page. The following are popular games for smartphones and tablets that can be played online: [3] X Research source Fortnite Clash of Clans Asphalt Modern Combat Minecraft 8 Ball Pool"
    },
    {
      "title": "Tap Get or Install next to the game icon.",
      "content": "Tap Get or Install next to the game icon. This will download and install the game on your smartphone or tablet. Some games require a credit card purchase to download. If the game has a price tag, tap it and then enter your password to complete the purchase with the credit card you have saved to your account."
    },
    {
      "title": "Open the game.",
      "content": "Open the game. Once the game has finished downloading, tap the game icon on your home screen or apps menu to open the game."
    },
    {
      "title": "Create a new account.",
      "content": "Create a new account. Most online games will require you to create an account in order to play. Select the option to create a new account when you start the game. Then fill out the form. You will most likely be required to enter your name, email, and choose a username and password. Some games allow you to create an account using your Google, Facebook, Apple ID or other accounts."
    },
    {
      "title": "Go through the tutorial.",
      "content": "Go through the tutorial. Most games start with a tutorial mode to teach you how to play the game before you start playing online. Follow the instructions to learn how to play the game."
    },
    {
      "title": "Select the online mode.",
      "content": "Select the online mode. Some games can only be played online. Other games have an offline mode and an online mode. If there are multiple modes, select the online mode from the title screen."
    },
    {
      "title": "Wait for the game to connect.",
      "content": "Wait for the game to connect. Once you select the online mode, wait for the game to connect. Then you can start playing with other players online. Playing online games may use mobile data. If you don't want to use up your mobile data, make sure you are connected to the internet using a wireless connection."
    },
    {
      "title": "Sign up for a subscription to an online game streaming service.",
      "content": "Sign up for a subscription to an online game streaming service. Game streaming is a relatively new technology. Rather than requiring you to download and install a game on your game console, PC, or mobile device, game streaming processes and renders the game on a remote server and streams the game to your gaming device. Game streaming doesn't require the same PC hardware that gaming normally requires, but it does require a solid high-speed internet connection of at least 10 MBPS, with a recommended 25 MBPS or greater. Popular game streaming services include the following: [4] X Research source PlayStation Now: PlayStation Now has a variety of popular games for PlayStation 2, 3 and 4. It can stream to your PlayStation 4 or PC. A PlayStation Now subscription starts at about $17.99 a month. [5] X Research source Google Stadia: Google Stadia has just recently launched. Not all features are available yet. It requires a special wireless controller that must be purchased. Google Stadia has a variety of popular games that can be streamed to a TV using a Chromecast Ultra, and in a Google Chrome browser on PC and select Android smartphones, for now. It includes a subscription plan for $10 a month that includes a number of games. A free plan that allows you to purchase games and stream them will launch later in 2020. GeForce Now: GeForce Now is currently in beta testing. GeForce Now doesn't offer a subscription plan with games included. Instead, it allows you to stream games you've purchased from a third-party store like Steam. This allows you to play hardware intensive games on low-end PCs. Currently, GeForce Now is free to beta testers, and it has a waitlist for other users. [6] X Research source"
    },
    {
      "title": "Download the streaming client.",
      "content": "Download the streaming client. After you sign up for the service, you will need to download the client. You can download the PlayStation Now client from the PlayStation Store on PlayStation 4, or you can download the PC streaming client. You need to connect a Dualshock 4 controller to your PC to stream PlayStation Now on your PC. For Google Stadia, you'll need to purchase the controller and a Chromecast Ultra for your television. It does not require a PC client to stream games on PC."
    },
    {
      "title": "Open the streaming client.",
      "content": "Open the streaming client. PlayStation Now has an icon that resembles an icon with a blue triangle that has the PlayStation logo in the middle. Click it in the Windows Start menu or in the PlayStation 4 dynamic menu to open PlayStation Now. For Google Stadia, connect your Stadia controller to your PC using a USB cable and go to https://stadia.google.com/ in a Google Chrome browser and sign in."
    },
    {
      "title": "Select a game.",
      "content": "Select a game. Use the client to browse games. When you find a game you want to play, select it with the controller to start streaming the game. It may take a few minutes for the game to connect. Not all games on Google Stadia are included in the subscription price. Some require you to purchase them to stream."
    }
  ]
}