{
  "url": "https://www.wikihow.com/Prepare-for-a-Test",
  "title": "How to Prepare for a Test",
  "steps": [
    {
      "title": "Check the exam date and schedule your study sessions backward in time.",
      "content": "Check the exam date and schedule your study sessions backward in time. Plan on having 2-3 study sessions each week for at least a couple of weeks before the exam, if your schedule allows it. If your exams are too close together, shorten the period of time before the exam. For example, if you have a test on April 30, you might plan study sessions on the 29th, 28th, 25th, 22nd, 18th, and 15th. Notice that the dates are going backward from the exam date, so your first study session is on the 15th, 2 weeks before the exam. If you haven't yet covered all the material that will be on the exam by your first study session, don't worry about it! Just focus on what you have covered and add the other material in as you get to it."
    },
    {
      "title": "Stick with 20-30 minutes for each session.",
      "content": "Stick with 20-30 minutes for each session. If you try to sit and study for several hours right before a test, your brain won't retain as much of the information. [1] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. Instead, schedule sessions 20-30 minutes long for several weeks before the exam. If you need to have a couple of study sessions in a row, plan a break of at least 10-15 minutes in between. That allows your brain to rest and process what you've studied."
    },
    {
      "title": "List areas you want to cover along with performance goals.",
      "content": "List areas you want to cover along with performance goals. Having a specific goal for each study session keeps you focused. If you already know what you're going to do before you even sit down to study, you won't have to waste precious study time figuring out where to start or what to cover. [2] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. For example, if you planned 6 study sessions, you might take a practice test the first session, then spend the next 2 sessions on the material you had problems with in the practice test. Then, you could take another practice test and reassess your knowledge to plan the rest of your sessions. It may be helpful to start each study session with the topics that you struggle with the most—then move onto easier subjects that you feel more confident in. Reader Poll: We asked 492 wikiHow readers about how they organize their studying, and 47% of them said that they tackle the most difficult topics first, while they have the most energy . [Take Poll]"
    },
    {
      "title": "Set up a spot to study that's well-lit and has minimal distractions.",
      "content": "Set up a spot to study that's well-lit and has minimal distractions. Choose a place where you can concentrate the best. Keep all your study materials and the supplies you'll need (such as paper, index cards, and pens) handy. Create an environment that allows your brain to instantly go into \"study mode\" as soon as you sit down. If there's not a good place to study at home, you might study in the library instead. Many libraries have study carrels or rooms you can sign up to use. Take regular study breaks during each session and do something relaxing. This allows your brain to take a rest. [3] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020."
    },
    {
      "title": "Studies show that 20 minutes of cardio exercise improves your memory.",
      "content": "Studies show that 20 minutes of cardio exercise improves your memory. It doesn't have to be walking, although that's usually the easiest and most accessible thing you can do. If you enjoy another activity, such as swimming or biking, do that instead. [4] X Research source If you have a recording related to the material you're studying—perhaps you found a related podcast or recorded your teacher's lectures—you might listen to that while you're walking to further reinforce your knowledge."
    },
    {
      "title": "Mark your test carefully so you know your strengths and weaknesses.",
      "content": "Mark your test carefully so you know your strengths and weaknesses. If you take a practice test \"cold\" before you're really started studying, you'll have a better idea of what you need to focus on. Taking practice tests later helps you see your progress and figure out what you still need to work on. [5] X Research source Don't neglect areas you're strong in! You still need to review those areas—you just don't need to spend as much time on them. Try to take your test under simulated test conditions. For example, if you only have an hour to complete the test, set a timer for one hour before you begin. You might even get a friend or family member to \"proctor\" your practice test for you."
    },
    {
      "title": "Take flashcards wherever you go to maximize your study time.",
      "content": "Take flashcards wherever you go to maximize your study time. Flashcards work best for short things you have to memorize, such as vocabulary words, formulas, or history dates. Keep them on you so you can pull them out when you have a few minutes. This allows you to get in a little more studying beyond your planned sessions. For example, waiting in line is the perfect time to go through a few flashcards. You can also give your flashcards to a friend or family member so they can quiz you."
    },
    {
      "title": "Mind maps",
      "content": "Mind maps show connections between concepts you're studying. Start with a central idea or principle and write it in the middle of a piece of paper. Draw a circle around it, then draw lines from the circle that you'll connect to other ideas or principles. Work outward, connecting all the different things you'll be tested on. You might also look into computer apps that help you construct mind maps and other study tools. Many are available for free while others require a subscription. Just search online or ask your teacher if they know of any apps they might recommend."
    },
    {
      "title": "Reading out loud engages more of your senses.",
      "content": "Reading out loud engages more of your senses. Reading silently is a passive activity and for most people, it isn't the best way to learn and retain information. Reading aloud, on the other hand, is active and forces you to concentrate on every word. If you find that you stumble over something when you read aloud, it might be that you aren't that familiar with that concept yet. Go over it again until you understand it."
    },
    {
      "title": "Talk to a friend or family member about what you've learned.",
      "content": "Talk to a friend or family member about what you've learned. When you teach something to someone else, you have to master the material so you're prepared to answer any questions they might have. You might even find that they ask you about something that you'd never considered before. Younger children are great for this because you'll need to explain more advanced concepts to them using language they'll understand. Putting terminology into your own words like this can help you uncover things you might not completely understand about the material."
    },
    {
      "title": "Creating your own test questions helps you think critically.",
      "content": "Creating your own test questions helps you think critically. Think about the most important points first—the things you're guaranteed to be tested on. Try to come up with the trickiest questions you can to challenge your knowledge of the concepts you're studying. [6] X Research source For example, if you have a history test on the French Revolution, one of your questions might be \"What motivated the people who originally revolted against the French king?\" As another example, if you have a math test, you might create your own math problems to solve based on the formulas introduced in your class. If you have access to your teacher's old tests, use those to get an idea of the types of questions your teacher typically asks. That'll make it easier to come up with your own questions."
    },
    {
      "title": "Studying with classmates can help you retain the material better.",
      "content": "Studying with classmates can help you retain the material better. If you know other students preparing for the same test, get together to quiz each other and discuss any confusion you might have. Working through problematic areas together will help you all get a stronger grasp on the material. Don't forget to include a little time to socialize as well! For example, you might get some classmates together to study for 30 minutes, then watch the latest episode of a TV show you all enjoy."
    },
    {
      "title": "Review sessions give you a better idea of what will be on the test.",
      "content": "Review sessions give you a better idea of what will be on the test. Questions from other students might also help highlight areas you don't understand as well as you should. Sometimes other students can bring up things you never thought about. [7] X Research source Most teachers offer review sessions within a week of the test or after all the material to be tested has been covered in class. Sometimes these are regular class sessions, but they might also be offered at a different time."
    },
    {
      "title": "Being well-rested keeps your brain healthy and focused.",
      "content": "Being well-rested keeps your brain healthy and focused. [8] X Expert Source Jai Flicker Academic Tutor Expert Interview. 20 May 2020. On the day of the test, you want to be on top of your game. The best way to do this is to make sure you have plenty of sleep the night before. Stressing over the exam or trying to get in one last cram session is more likely to hurt than help your performance. [9] X Research source It's a good idea to try to go to bed a little earlier than you normally do the night before the test. Do something relaxing before bed, such as taking a bath. You might find it hard to fall asleep, especially if you're nervous about the test—and that's normal! But avoid taking a sleeping pill, which could make you groggy the next day."
    },
    {
      "title": "High-carb foods that digest slowly, such as oatmeal, are best.",
      "content": "High-carb foods that digest slowly, such as oatmeal, are best. These types of food will fill you up and keep you feeling full for longer, so you don't have to worry about hunger pangs in the middle of the test. Fruits and vegetables also improve your attention and thinking speed. [10] X Research source If you normally have a cup of coffee in the morning, don't skip it before the test—you don't want caffeine withdrawal to hamper your performance. At the same time, don't over-indulge. Too much caffeine can make you jittery and unfocused, so limit yourself to a single cup."
    },
    {
      "title": "Worrying about being late adds unnecessary stress.",
      "content": "Worrying about being late adds unnecessary stress. Get there early so you have plenty of time to get to the test-taking room, find a seat, and get settled before the test begins. You might even have time to give yourself a little pep talk in the restroom. [11] X Research source If you've never been to the testing location before, you might want to do a dry run so you're more familiar with the area and know how to get there."
    },
    {
      "title": "Deep breathing helps you relax so you can focus better.",
      "content": "Deep breathing helps you relax so you can focus better. Sit on the edge of a chair with your feet flat on the floor. Roll your shoulders back so that your shoulder blades tuck in along either side of your spine, then place one hand on your abdomen and the other on your chest. Inhale slowly and deeply through your nose, allowing your abdomen to expand as your lungs fill. Pause, then exhale through your mouth at the same rate you inhaled, deflating your abdomen. Continue breathing this way for 3 to 5 minutes, keeping your focus solely on your breath. If you find that your mind wanders or you start worrying about the test, gently pull your mind back to your breath."
    }
  ]
}