{
  "url": "https://www.wikihow.com/Remove-Iron-Stains",
  "title": "How to Remove Iron Stains",
  "steps": [
    {
      "title": "Rub half a lemon on the rust stain.",
      "content": "Rub half a lemon on the rust stain. Cut a fresh lemon in half or use a lemon wedge if you have them on hand. Thoroughly coat the stain with the lemon. The acidic juice helps dissolve the rust particles. [1] X Research source If you don’t have a fresh citrus on hand, try soaking the stain in lemon or lime juice. Limes are also acidic and work well on rust stains. lemon juice works best on white clothing. To treat colored or delicate fabric, try diluting the lemon juice in an equal amount of water to reduce the acidity."
    },
    {
      "title": "Sprinkle salt over the stain.",
      "content": "Sprinkle salt over the stain. Cover the stain in an even layer of table salt. You can’t add too much salt, so make sure the salt spreads over the entire area you wish to treat. The salt will draw up the iron particles as the lemon juice dissolves them. [2] X Research source"
    },
    {
      "title": "Rub the salt into the stain with a microfiber cloth.",
      "content": "Rub the salt into the stain with a microfiber cloth. Choose a clean, soft cloth. Rub it against the clothing in a circular motion to work the salt and lemon juice into the fibers. Continue doing this until the stain is well-soaked. [3] X Research source For more scrubbing power, use a soft-bristled brush such as an old toothbrush."
    },
    {
      "title": "Lay the clothing out in direct sunlight for 2 to 3 hours.",
      "content": "Lay the clothing out in direct sunlight for 2 to 3 hours. Set the clothing up so the sunlight hits the stain. A good place to put the clothing is on a table or countertop. Keep the stained side face up so the lemon juice dries up as it treats the rust. [4] X Research source Dark-colored clothing is prone to damage from color bleeding and fading in direct light and high heat. Check the clothing every 30 minutes and consider taking it out of the sunlight prematurely. Alternatively, if you can’t keep the clothing in direct sunlight or wish to avoid potential damage, leave it out in open air for at least 1 hour. Wash the clothing afterwards."
    },
    {
      "title": "Machine wash the clothing to remove any remaining salt and juice.",
      "content": "Machine wash the clothing to remove any remaining salt and juice. Wash the clothing as you normally would. The easiest way to do this is to machine wash it. Launder it on a cold water setting to clean delicate fabrics without putting additional stress on their fibers. [5] X Research source To avoid ruining very delicate items prone to mechanical damage, wash them in cold water in the sink."
    },
    {
      "title": "Turn off the water flow and drain away any standing water.",
      "content": "Turn off the water flow and drain away any standing water. Locate the water shutoff valve and turn it counterclockwise. For toilets, the valve is on the metal line running from the wall to the back of the toilet. Test it out by flushing the toilet or attempting to turn on the water supply. Make sure fresh water can’t get in and wash away stain treatment products prematurely. [6] X Research source For tubs and sinks, simply turn off the tap to prevent water from flowing."
    },
    {
      "title": "Mix cream of tartar with hydrogen peroxide to form a paste.",
      "content": "Mix cream of tartar with hydrogen peroxide to form a paste. In a small bowl, combine 3 tablespoons (30.39 g) of cream of tartar with 3 US tbsp (44 mL) of hydrogen peroxide. Stir them together. They form a paste with the consistency of cake frosting when mixed appropriately. [7] X Research source Both items are available at most general stores and grocery stores. For cream of tartar, look near the kitchen spices."
    },
    {
      "title": "Cover the iron stains for 10 minutes.",
      "content": "Cover the iron stains for 10 minutes. Spread the paste over the stains using a nylon scrub brush, a sponge, or a cloth. Make sure the stains are well-covered. The paste will loosen the iron particles as it soaks into the stained surface. [8] X Research source"
    },
    {
      "title": "Scrub the stain with a sponge or brush to remove it.",
      "content": "Scrub the stain with a sponge or brush to remove it. The easiest way to scrub the stained surface without damaging it is by using the rough side of a basic sponge. Nylon scrub brushes are fine too, including toilet scrub brushes. Buff the area by scrubbing through the paste. Harsher scrubbers scratch up porcelain or walls, so avoid using items like steel wool."
    },
    {
      "title": "Rinse the surface with clean water to remove the paste.",
      "content": "Rinse the surface with clean water to remove the paste. Turn on the water shutoff valve if you deactivated it earlier. Wash away all of the paste with clean water, such as by turning on the tap or flushing the toilet a few times. Most or all of the stain will wash away with it. [9] X Research source You may need to treat tough stains a few times to clear them. Cleaning the stained surface at least once a month helps prevent these tougher stains from forming. Other treatments, such as commercial rust removers or lemon and baking soda pastes, are also effective and worth a try if hydrogen peroxide isn’t strong enough."
    },
    {
      "title": "Saturate a clean cloth in white vinegar.",
      "content": "Saturate a clean cloth in white vinegar. Dampen the cloth in vinegar, then wring it out to remove excess moisture. Before you place it on the carpet, make sure it isn’t dripping. [10] X Research source Vinegar is also effective on other surfaces, from clothing to metal. It is worth a try as a natural solution or if other treatments fail. If you have a small object, you can submerge inside white vinegar. After a couple of minutes remove it from the vinegar and brush off the rust with an old toothbrush."
    },
    {
      "title": "Sprinkle table salt over the rust stain.",
      "content": "Sprinkle table salt over the rust stain. Apply the salt directly to the carpet. Cover the stain in an even layer of the salt. [11] X Research source"
    },
    {
      "title": "Leave the cloth over the stain for 30 minutes.",
      "content": "Leave the cloth over the stain for 30 minutes. Position the cloth so it covers the stain. The salt draws the rust up out of the carpet fibers, while the vinegar dissolves it. [12] X Research source The vinegar also neutralizes any unpleasant odors in the treated area."
    },
    {
      "title": "Resoak the cloth and replace it if the rust stain isn’t gone.",
      "content": "Resoak the cloth and replace it if the rust stain isn’t gone. Add more vinegar to the cloth to saturate it. Wring it out again to prevent it from dripping vinegar everywhere. Then, lay it over the stain and wait another 30 minutes. [13] X Research source You may need to do this a few times to remove tough stains. Older and deeper stains take repeated treatments."
    },
    {
      "title": "Let the vinegar dry before vacuuming the carpet.",
      "content": "Let the vinegar dry before vacuuming the carpet. After the stain vanishes, wait for the carpet to dry completely to the touch. Then, vacuum the area to remove any salt left in the carpet fibers. Vacuuming will also perk up the carpet’s fibers, making them look fresh and fluffy again. [14] X Research source"
    },
    {
      "title": "Mix baking soda and water together into a paste.",
      "content": "Mix baking soda and water together into a paste. Combine about 1 tablespoon (14.40 g) of baking soda with 2 cups (470 mL) of lukewarm water. Stir the ingredients together until they have the consistency of an ordinary toothpaste. [15] X Research source Scale up the quantity of ingredients you use to make more paste as needed, but keep the ratio of baking soda and water the same. For a commercial option, look for a cleaner with oxalic acid as an ingredient. Oxalic acid reacts with rust, making it easy to wash away with water."
    },
    {
      "title": "Use a microfiber cloth to rub the paste into the iron stain.",
      "content": "Use a microfiber cloth to rub the paste into the iron stain. Scoop up the paste with a clean cloth and apply it over the stain. Always scrub along any noticeable grain in the piece of wood or metal you are treating. Look closely at the item to see which directions the grain lines run in. [16] X Research source The grain lines run either horizontally or vertically. Following these lines reduces the likelihood of damage to the wood or metal."
    },
    {
      "title": "Wipe away the paste with a wet paper towel.",
      "content": "Wipe away the paste with a wet paper towel. Dampen a paper towel in lukewarm water and squeeze it to prevent it from dripping. Then, move the paper towel along the surface’s grain to pick up the paste. After removing all of the paste, check for any leftover rust. [17] X Research source If the iron stain is very large, expect to need to repeat the treatment a few times. The better option is to sprinkle baking soda directly onto the stain and scrub it first."
    },
    {
      "title": "Cover the stain with baking soda for 30 minutes if it is still there.",
      "content": "Cover the stain with baking soda for 30 minutes if it is still there. Distribute the baking soda across the iron stain. Cover it completely. The baking soda will not damage the wood or metal surface, so you can’t use too much of it. [18] X Research source For large, deep iron stains, you will need to sprinkle lots of a baking soda. Follow up the treatment with a baking soda and water paste as needed."
    },
    {
      "title": "Scrub the stain with a soft-bristled brush.",
      "content": "Scrub the stain with a soft-bristled brush. Choose your brush carefully, since harsher brushes leave permanent scratches in wood and metal. A nylon kitchen brush works well, or try using an old toothbrush or a specialty brush designed for soft metals like brass. Go back and forth along the grain a few times to bring any remaining brown spots to the surface. [19] X Research source Never use metal brushes like steel wool or wire brushes. These will leave nasty scratches on most surfaces, leaving damage far more permanent than iron stains."
    },
    {
      "title": "Wipe up the remaining rust and dry the surface with paper towels.",
      "content": "Wipe up the remaining rust and dry the surface with paper towels. Dampen another paper towel in lukewarm water. After wringing out the excess moisture, use it to clean off the iron you loosened with the brush. Then, go back over the surface with a clean paper towel to make your wood or metal item look as good as new. [20] X Research source"
    },
    {
      "title": "Wear rubber gloves and protective glasses when handling rust remover.",
      "content": "Wear rubber gloves and protective glasses when handling rust remover. Rust removal products are generally pretty abrasive. They have to be to get tough stains out of hard surfaces like concrete. Always cover your hands and eyes before attempting to work with a rust remover or degreaser. [21] X Research source Also, consider wearing long-sleeved clothing when working with large amounts of chemical products to prevent them from getting on your skin."
    },
    {
      "title": "Mix trisodium phosphate or another rust removal product in water.",
      "content": "Mix trisodium phosphate or another rust removal product in water. Follow the manufacturer’s instructions on your chosen product. For trisodium phosphate, combine it in a ratio of approximately 1 ⁄ 2 cup (120 mL) of trisodium phosphate per 8 cups (1,900 mL) of hot water. Stir the cleaner into the water to dissolve it. [22] X Research source Purchase rust removal or degreasing products from home improvement stores. Most of these products are effective on metal and porcelain as well as concrete."
    },
    {
      "title": "Cover the stain with the solution for 20 minutes.",
      "content": "Cover the stain with the solution for 20 minutes. Pour the diluted trisodium phosphate out carefully. Make sure the stain is completely covered. If you need to adjust the liquid, use a broom to guide it back onto the stain. [23] X Research source Rinse the broom off under clean water when you’re done using it."
    },
    {
      "title": "Scrub the stain with a stiff-bristled push broom.",
      "content": "Scrub the stain with a stiff-bristled push broom. A push broom has its handle attached at an angle, allowing you to push the trisodium phosphate forward with ease. It has to have stiff bristles in order to lift the iron particles out of the concrete. Move the brush back and forth a few times until the stain is gone. [24] X Research source Push brooms are available at most home improvement stores. Most regular brooms are not strong enough to dig the rust out of a solid surface like concrete, so a push broom is worth the cost. As an alternative, scrub the stain with a wire brush such as a grill scraper."
    },
    {
      "title": "Rinse the cleaning solution off with water from a pressure washer.",
      "content": "Rinse the cleaning solution off with water from a pressure washer. Connect the pressure washer to a garden hose and water spigot, then point and shoot. Spray water to dilute the cleaner and move it off the stained area. Keep spraying until the area is clean and cleaner-free. [25] X Research source Some home improvement stores rent out power washers. Check with them if you don’t own one."
    }
  ]
}