{
  "url": "https://www.wikihow.com/Photograph-Clothing-Laying-Flat",
  "title": "How to Photograph Clothing Laying Flat",
  "steps": [
    {
      "title": "Find a large, flat work surface and choose your backdrop.",
      "content": "Find a large, flat work surface and choose your backdrop. When you're setting up a flat lay, you'll need to find an area that's big enough to spread out your garments, like a table top or a floor. However, since the background of the flat lay is a big part of the picture, you may want to create your own backdrop by laying down a sheet of paper, fabric, poster board, or another similar item. Just make sure that any backdrop you use will extend all the way to the edge of the photo, or else it could mess up the flat lay effect. [1] X Research source Try to match the backdrop to your style. For instance, if you're shooting a casual, feminine outfit, you might use a washed-out barn door as your backdrop. Linens and rugs can also make great backgrounds for a flat lay. If you'll be doing a lot of flat lay photography, it's a good idea to use the same or similar backdrops in most of your pictures. That way, they'll be more easily recognizable when your followers come across them."
    },
    {
      "title": "Shoot in natural lighting if you can.",
      "content": "Shoot in natural lighting if you can. Lighting is always important in photography, but shadows in a flat lay shoot can throw off the whole effect. To avoid that, try shooting near a large, open window, or set up your work station in a shady spot outdoors. [2] X Research source Avoid setting up directly in the sunlight, since that will create harsh shadows."
    },
    {
      "title": "Use 1 or 2 external lights if natural light isn't available.",
      "content": "Use 1 or 2 external lights if natural light isn't available. If you don't have good natural lighting in your work area, the best option is to set up a controlled light source. If you only have 1 light, place it to the side of your flay lay setup, tilted at a 45° angle. If you're using 2 lights, place them on either side or at opposing corners, facing each other and tilted at the same 45° angle. If you want to deliberately add shadows to the shot, move the light a little further from your product. If you're using 2 lights, only move 1 of the lights. Try experimenting with different lighting options , including flash diffusers to soften your flash, reflectors to help redirect light and reduce shadows, and softboxes to create a new light source. [3] X Research source Photography equipment can be expensive, but not all lighting solutions require a large investment. For instance, you can help diffuse shadows in your photo by holding up a large piece of white posterboard to reflect light down into the shot. [4] X Research source"
    },
    {
      "title": "Use a low ISO, fast shutter speed, and high f-stop.",
      "content": "Use a low ISO , fast shutter speed, and high f-stop. When you're shooting product photos, use an ISO of 200 or lower to get the clearest picture. Also, you'll get a sharper photo if you use a fast shutter speed and a higher F-stop, which will give you a smaller aperture opening. Set the white balance based on your light source. [5] X Research source Go through the settings in your camera and adjust the white balance to match the type of lighting you're using, such as fluorescent, incandescent, tungsten, or natural. Use a standard camera lens for most flat-lay photography. Don't use a wide-angle lens, as it can distort the image."
    },
    {
      "title": "Take the photo from straight above.",
      "content": "Take the photo from straight above. When you're shooting a flat lay, it's important to take the picture straight on, rather than at an angle, in order to achieve the right effect. However, you may need to stand on a step ladder or a stool so you can get high enough above the frame to shoot head-on. [6] X Research source [7] X Expert Source Annie Tao Professional Photographer Expert Interview. 3 March 2021. If you do have to climb, be careful, especially if you're carrying heavy camera equipment! It may be a good idea to have someone else nearby to hand you your camera once you get in place."
    },
    {
      "title": "Make small adjustments until you're happy with the shot.",
      "content": "Make small adjustments until you're happy with the shot. Once you get your flay lay set up, take a couple of shots, then look at them carefully. If there are any shadows that interfere with your shot, or if you aren't happy with the product placement, make any necessary changes, then shoot again until you get the perfect picture. [8] X Expert Source Annie Tao Professional Photographer Expert Interview. 3 March 2021. Once you're finished, upload your photo to your blog or social media accounts to show it off!"
    },
    {
      "title": "Lay shirts and dresses flat on the backdrop.",
      "content": "Lay shirts and dresses flat on the backdrop. Spread your garment flat on your work surface, taking a few minutes to arrange it neatly. For instance, if you're displaying a shirt, you might fasten any buttons, smooth out the collar, and arrange the arms. [9] X Research source [10] X Expert Source Annie Tao Professional Photographer Expert Interview. 3 March 2021. In general, it's best if the garment is symmetrical in the photo. However, when you're arranging long sleeves, you might place them at slightly different angles so they look more natural. It's a good idea to iron the garments before you shoot them, since wrinkles will look unattractive in the picture."
    },
    {
      "title": "Fold pants in half longways, then again at the knees.",
      "content": "Fold pants in half longways, then again at the knees. It can be difficult to fit an entire pair of adult-size pants in a frame, so try folding them in half with the legs together first, then fold them again at the knees. You can then either lay the pants flat or display them in a V-shape to show the entire length of the legs. Also, try to arrange the folded pants to show off any cool details, like pocket stitching or distressing. [11] X Research source Try cuffing jeans to give them a little more personality! If you're shooting baby clothes, you may prefer to leave the pants unfolded."
    },
    {
      "title": "Tuck in the hems to give the clothing a more natural look.",
      "content": "Tuck in the hems to give the clothing a more natural look. If you're laying out a top or a dress, roll the side hems slightly underneath the garment rather than pressing them out flat. This will give the piece a little more movement, and it will look more like it does when it's hanging naturally on a person's body. [12] X Research source Since the back of a garment is often a little longer than the front, you may need to tuck the back bottom hem under the piece, as well. If you're styling a woman's garment, tuck in the sides a little more just beneath the arms to give the clothing a gentle curve. For men's and children's clothing, keep the line straight."
    },
    {
      "title": "Place tissue paper inside the garment if you want to add dimension.",
      "content": "Place tissue paper inside the garment if you want to add dimension. If you find that your garment looks lifeless, try adding a little lift by sliding a few stacked sheets of tissue paper into the inside of the piece. You can even roll up stacks of tissue paper to put inside the arms and legs of the clothing for more movement. [13] X Research source For instance, you might put tissue paper inside the body of a T-shirt or in the torso of a dress."
    },
    {
      "title": "Arrange clothing in outfits to create inspiration shots.",
      "content": "Arrange clothing in outfits to create inspiration shots. Shooting a single piece can be a good way to showcase it, but flat lay photography is commonly used as a way to group different items together in fun outfits. For each shot, challenge yourself to mix and match different pieces to show off your own unique style. [14] X Research source In general, it's best to try to arrange outfits similar to the way you'd actually wear them. For instance, you might place a dress in the center of the frame, shoes near the bottom, and a hat and sunglasses near the top or off to the side. Similarly, you might put a blouse closer to the top of a shot, with pants either below the top or down and to the side."
    },
    {
      "title": "Add accessories to create a more complete look.",
      "content": "Add accessories to create a more complete look. As you're styling your outfit, think about what you might actually wear with those garments. Something as simple as a chic pair of shoes or a cool hat can help take your flat lay photography to the next level. [15] X Research source For instance, if you're shooting a swimsuit, you might include accessories like a floppy hat, beach tote, coverup, sandals, and sunglasses. Think about how you'd display these items if you were planning an outfit you wanted to wear. For example, you might drape a necklace across a T-shirt, or you might put a belt around the waist of a dress. Shoes can go near the bottom of the shot or off to the side, depending on what looks best."
    },
    {
      "title": "Include details that help sell your outfit story.",
      "content": "Include details that help sell your outfit story. To make your flat lay more dynamic, try to include special touches that will help tell a story. Think about where someone might go if they were wearing that outfit, and add details that help sell that idea. [16] X Research source [17] X Expert Source Annie Tao Professional Photographer Expert Interview. 3 March 2021. In your swimsuit picture, for example, you might also include 1 or 2 items you might bring to the pool, like a book, sunscreen, or cool water bottle. Even a simple tee-and-jeans combo can be dressed up as a perfect vacation outfit by adding interesting details like a pretty tube of lipstick, a flower, a hotel room key, or a plate with a delicious-looking pastry."
    }
  ]
}