{
  "url": "https://www.wikihow.com/Shower-Together",
  "title": "The Intimate Benefits for Couples That Shower Together",
  "steps": [
    {
      "title": "Better sensual and physical intimacy",
      "content": "Better sensual and physical intimacy According to sex and intimacy coach Shelby Devlin, MA, “Just being naked together in general—taking a bath together, taking a shower together, giving each other massages—those are all ways we can intimately connect and focus on calming the body, connecting with another’s body, and connecting with your own body…It’s a great way to connect with your partner and take the pressure off of sexual interaction, but it’s still something deeply intimate and sensual.” Sensual or physical intimacy doesn’t have to include sex (but it certainly can). It also encompasses all non-sexual physical touch like cuddling, hugging, massaging, and kissing. [1] X Research source"
    },
    {
      "title": "Increased sexual intimacy",
      "content": "Increased sexual intimacy Of course, showering together can also lead to new and exciting sexual experiences too. You’ll feel a lot of arousing or pleasurable sensations like hot water pouring over you, steam in the air, and slippery skin-to-skin contact (and that’s just he accidental touching). Plus, seeing your partner covered in soapy suds is both a visual turn-on, and sensually washing them is a great way to initiate foreplay. [2] X Research source The shower is also a great place to experiment with toys, since the cramped quarters might make some of your usual positions uncomfortable or near impossible. Just make sure those toys are waterproof! All in all, shower sex is a unique way to be intimate and vulnerable with each other, deepening your sexual connection."
    },
    {
      "title": "More emotional intimacy and trust",
      "content": "More emotional intimacy and trust The heat of a warm shower triggers the release of oxytocin, or the brain’s “love” hormone. [3] X Research source This is the same hormone that get released during cuddling, sex, or touching and is what makes partners feel excited or like they’re falling in love. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source So, by showering together and washing each other, you’re not just getting closer physically—you’re also building deeper feelings of trust and security with your partner and growing closer emotionally."
    },
    {
      "title": "Stress relief and relaxation",
      "content": "Stress relief and relaxation Assuming you’re comfortable sharing a shower, a warm rinse together can do wonders for your physical and mental stress and help you unwind in your partner’s company. For starters, warm showers are proven to reduce stress and anxiety levels, improve muscle tension and stiffness, relax and open your nasal passages, and clear your pores of oil and dirt. [5] X Research source Second, the act of bathing or cleaning yourself is a way to reduce stress and anxiety during stressful moments. [6] X Research source So, a quick jump in the shower with your partner can be a great way to wind down after a tough day!"
    },
    {
      "title": "Exploring and learning new things",
      "content": "Exploring and learning new things If showering together is a new experience for you, then it may open up your childlike instinct to play, explore, and observe sights and sensations you haven’t felt before (plus, it’s a great way to spice up your relationship whether the shower turns sexual or not). It takes some creativity and imagination to navigate tight quarters together when you’re wet and slippery, plus the feeling of trying something new with your partner can strengthen your connection. [7] X Research source Some new things you might discover could include: New, pleasurable physical sensations and feelings (whether things turn sexual or not), like sliding around each other or having someone else shampoo your hair. Small habits or quirks your partner has that you’ve never seen before. Physical features on your partner you’ve never seen before, like scars or birthmarks. How to communicate and work together as a couple in potentially inconvenient or restricted circumstances."
    },
    {
      "title": "Saving time and water",
      "content": "Saving time and water Of course, there are some practical benefits to showering together too It’ll save you time during your morning or evening routine, especially if you’re tired of waiting for your partner to finish showering so you can hop in (and all the hot water won’t be gone!). Plus, it may help save water. An average 8-minute shower with a standard shower head uses about 20 gallons (76 liters). [8] X Research source Rather than doubling that amount by taking separate showers, a joint rinse could lower your overall household water usage."
    },
    {
      "title": "Use a non-slip mat on your shower floor.",
      "content": "Use a non-slip mat on your shower floor. You’re gonna have lots of water, soap suds, and wet skin moving around in a slippery tub or shower, so safety first! Lay down a rubber or non-slip bath mat with suction cups to provide firm footing and prevent falls. [9] X Research source Even if you’re 100% able-bodied and have never slipped in the shower before, adding an extra person in a tight space makes things riskier."
    },
    {
      "title": "Alternate who gets to stand in the warm water.",
      "content": "Alternate who gets to stand in the warm water. Odds are one of you may get cold if you’re out of the water for too long. To combat this, let the hot water steam up the bathroom for a moment before you both hop in the shower. Then, angle the shower head higher so the stream projects farther and stand close together so you both get some water. Someone will probably still be cold at some point, so alternate who gets to stand in front so no one’s left out for too long. [10] X Research source Detachable shower heads can be useful for spraying down your partner or yourself anywhere in the shower to keep warm and rinse off difficult areas."
    },
    {
      "title": "Wash each other’s backs and other areas (to be helpful or for pleasure).",
      "content": "Wash each other’s backs and other areas (to be helpful or for pleasure). One of the perks of sharing a shower is getting a helpful hand for hard-to-reach spots like your back. This can be a fun, relaxing, and soothing activity even if it doesn’t lead to sex. A soapy back massage or shoulder rub, washing each other’s hair, or any other sensual washing can be a great way to wind down at night or feel ready for the day in the morning (it’s also a super enjoyable way to get clean!)."
    },
    {
      "title": "Make it part of your routine, or shower together after dirty activities.",
      "content": "Make it part of your routine, or shower together after dirty activities. Couples who shower together non-sexually often end up in a routine—maybe it started after the kids left the house and you have more time to spend on each other, or it’s just a faster way for the two of you to get out the door in the morning. Either way, a regular duo shower can be a great way to add some quality time together into your schedule. You can also plan to shower together after something like gardening, playing sports, or sex. Cleaning up together is a way to continue the fun and make whatever activity you were doing earlier into a bigger, more memorable (and more fun) experience."
    },
    {
      "title": "Use a non-slip shower mat and leg stand to position yourself safely.",
      "content": "Use a non-slip shower mat and leg stand to position yourself safely. When the passion is high and you’re getting down to business, the last thing you want to think about is slipping in the tub or holding yourself up uncomfortably. A non-slip mat and an in-shower leg stand can help you stay surefooted in a variety of positions. Some couples even add wall handles with suction cups for more stability and grip. [11] X Research source"
    },
    {
      "title": "Declutter your shower and set the mood with music and candles.",
      "content": "Declutter your shower and set the mood with music and candles. Most bathrooms don’t scream “sexy,” so take some time to create a more enticing atmosphere. First, remove any bottles, products, or kids toys from the shower that you won’t be needing to eliminate clutter and distractions. Then, make a playlist or put on some music to make a sensual ambiance. Add some candles and flowers or dim the lights to make the experience perfect. [12] X Research source Once the room steams up, you could also write a flirty or sexy note for your partner to find on the bathroom mirror or sliding glass shower doors."
    },
    {
      "title": "Choose a special scented soap to make the occasion more memorable.",
      "content": "Choose a special scented soap to make the occasion more memorable. Pick a soap, shower gel, or body wash with a scent that you both enjoy and use just for shower sex. The fragrance adds an extra sensory element to your rendezvous, introduces some novelty to the experience, and helps form a “sense memory”—whenever you get a whiff of that scent, you’ll be transported back to the steamy shower with your partner. [13] X Research source"
    },
    {
      "title": "Remember that soapy water does not make good lube.",
      "content": "Remember that soapy water does not make good lube. Water makes the tub slippery, but not much else. Go for a silicone-based lube (preferably one that’s waterproof) and use it generously. Just make sure not to spill some on the floor of the shower (again ,safety first!). [14] X Research source While we’re talking about where soapy water should and shouldn’t go, do your best not to get any suds inside of…well, you. Soap can be irritating or feel like burning if it gets in your urethra, vagina, anus, or other places. Make sure all fingers, toys, and appendages are rinsed off before going inside."
    },
    {
      "title": "Explore new, shower-friendly positions.",
      "content": "Explore new, shower-friendly positions. Chances are that your regular positions may not be as comfortable (or work at all) when you’re vertical in a tight shower or tub. Here are some easy positions to experiment with while you’re getting used to getting it on in the shower: [15] X Research source Back massage with oral: Kneel down in the tub with the shower head spraying your back, then have your partner stand in front of you (facing the shower head). You can give them oral while reaching up and rubbing or massaging their back. If you’re the one standing, you might prop one leg up for easier access. The “bend and splash”: If you’re the partner getting penetrated, turn away from the shower head and bend over, bracing yourself by placing both hands on the wall in front of you or to the sides. Have your partner stand behind you and penetrate from behind (the shower water will be spraying their back). This is a flexible position where you both have feet firmly planted on the ground. Seated position: Have the penetrating partner sit on the floor with their back against the shower wall. Then, their partner can straddle them facing either direction—facing each other allows for more kissing and face-to-face communication, while facing the other direction lets the water massage your back. Standing position: If you’re the one getting penetrated, stand with your back against the wall with the water spraying behind you. Have your partner stand facing you, then raise one leg (use a leg stand or have your partner hold your leg up around their waist)."
    },
    {
      "title": "Use the shower for foreplay, cleanup, or the main event.",
      "content": "Use the shower for foreplay, cleanup, or the main event. How you use the shower is totally up to you. Maybe the shower is what facilitates foreplay and gets you excited to move things to the bedroom. Or, the shower could be the site where it all goes down. There’s no wrong way to use the shower for intimacy! Even if your sexual encounter happens outside the shower, cleaning up together afterward is a great way to continue the fun and keep bonding (plus, no one has to wait for their turn to rinse off afterward)."
    },
    {
      "title": "Yes—surveys show half of Americans shower with their partner.",
      "content": "Yes—surveys show half of Americans shower with their partner. In a survey by the plumbing products company Hansgrohe, 49% of Americans enjoy showering with another person, and 56% of couples have used the shower for romantic or sexual purposes. Showering together is even more common among young people and couples who live together. [16] X Research source However, every person and couple is different! The same survey shows men are more likely to prefer solitude in the shower, and about a third of couples who live together view the bathroom as a space for personal privacy and relaxation. So, don’t worry too much about whether it’s “normal.” Lots of people shower together, but it’s not for everyone. Focus on what feels right for you and your partner, whether that includes the occasional duo shower or not."
    },
    {
      "title": "No—lots of couples shower together for fun, efficiency, or quality time.",
      "content": "No—lots of couples shower together for fun, efficiency, or quality time. Whether you want to make the shower extra steamy is totally up to you and your partner. Some couples take non-sexual showers just to enjoy each other’s company or unwind together after a long day. Others say that it’s a distraction-free time to check in with each other, talk about what’s happening in each other’s lives, or enjoy a moment of privacy with your partner. Basically, whatever your motivation is for showering together is correct! Joint showers don’t always have to start or turn sexual. As long as you and your partner are enjoying yourselves and getting clean, you’re doing it right."
    }
  ]
}