{
  "url": "https://www.wikihow.com/Salt-Nuts",
  "title": "How to Salt Nuts",
  "steps": [
    {
      "title": "Put about 4 cups (907 g) of raw nuts in a glass bowl.",
      "content": "Put about 4 cups (907 g) of raw nuts in a glass bowl. Cover the nuts with filtered water. Stir in 1 tablespoon (14.78 mL) of sea salt until the salt is mostly dissolved. Let the nuts soak in the water. The soaking time depends on the types of nuts you use. [1] X Research source"
    },
    {
      "title": "Soak different types of nuts for different lengths of time.",
      "content": "Soak different types of nuts for different lengths of time. Leave pecans, walnuts, and peanuts to soak for 12 hours. Soak almonds and macadamias for 7 hours, and soak cashews or brazil nuts for between 4 and 6 hours. Don’t combine the types of nuts when you soak them, especially if they require different soaking times. Combining them could make them moldy."
    },
    {
      "title": "Prep the nuts for the oven.",
      "content": "Prep the nuts for the oven. Preheat the oven to 150℉ (66℃). Drain the water from the nuts. Spread the nuts in a single layer on a baking sheet. Put the baking sheet in the oven to dry the nuts."
    },
    {
      "title": "Check the nuts every 15 minutes for doneness.",
      "content": "Check the nuts every 15 minutes for doneness. Feel the nuts to see if they are dry. Cut one in half when you think they are done. If the inside is dry to the touch, remove your nuts from the oven. Let them cool before eating or storing them."
    },
    {
      "title": "Try a shorter soaking method.",
      "content": "Try a shorter soaking method. Combine 1 cup (240 mL) of water with 4 tablespoons (59.14 mL) of salt in a saucepan. Boil the water, stirring to dissolve the salt. Turn off the heat and add 1 cup (226.79 g) of peanuts, walnuts, cashews, almonds, or pecans to the saucepan. Let the nuts soak for 20 minutes. Drain the water and spread the nuts on a baking sheet lined with parchment paper or silicone. Sprinkle the nuts with extra salt to taste and bake them for 20 minutes in a 300℉ (150℃) oven. [2] X Research source Take the nuts from the oven and cool them on the baking sheet."
    },
    {
      "title": "Gather your ingredients.",
      "content": "Gather your ingredients. Put 4.5 cups (1.13 kg) of raw, whole almonds in a large metal or glassware bowl. Measure out 1.5 tablespoons (22.18 mL) of hot water and put that in a small bowl. You’ll also need 2 tablespoons (29.57 mL) of olive oil and 1.5 teaspoons (7.39 mL) of sea salt plus more to taste. [3] X Research source Also preheat your oven to 375℉ (190.55℃)."
    },
    {
      "title": "Dissolve the salt in the hot water.",
      "content": "Dissolve the salt in the hot water. Don’t worry if it doesn’t dissolve completely. Pour the hot, salted water over the nuts in the large bowl. Stir until all of the nuts are coated with the salt water."
    },
    {
      "title": "Line a big baking sheet with parchment paper.",
      "content": "Line a big baking sheet with parchment paper. You can also line it with silicone or spray it with oil. Spread the nuts over the baking sheet in a single layer. Bake the nuts for about eight minutes. Pull out the baking sheet, stir the nuts, rearrange them in a single layer, and bake them for another six or seven minutes. They should be brown on the inside. Cut one open to check for browning on the inside. Watch them carefully so they don’t burn."
    },
    {
      "title": "Return the roasted nuts to the large bowl.",
      "content": "Return the roasted nuts to the large bowl. Pour the olive oil over them. Stir to coat them in the oil. Shake additional salt over them as you mix them with the oil. Remember they will already be a bit salty from the salt water."
    },
    {
      "title": "Leave the nuts in the bowl to cool.",
      "content": "Leave the nuts in the bowl to cool. To speed up the cooling process, spread them out on the baking pan. Don’t worry about the olive oil -- it will soak into the nuts as they cool. Once they are dry, you can store them in an airtight container at room temperature."
    },
    {
      "title": "Roast the nuts with a different approach.",
      "content": "Roast the nuts with a different approach. With this method, you combine the nuts with the oil and salt before roasting. Mix 2 cups (453.5 g) peanuts, walnuts, cashews, almonds, or pecans with 1-2 tablespoons (14.78-29.57 mL) of olive oil or another oil you enjoy. Salt the nuts to taste. Bake the nuts in a single layer on a lined baking sheet in a 350℉ (176.66℃) oven for 15 minutes. [4] X Research source Stir the baking nuts every five minutes. Spread them out in a single layer after you stir them. Check for doneness after 15 minutes. Don’t bake them for more than 20 minutes. Let them cool on the baking sheet, then store in an airtight container at room temperature."
    },
    {
      "title": "Preheat your oven to 350℉ (176.66℃).",
      "content": "Preheat your oven to 350℉ (176.66℃). Line a baking sheet with parchment paper or silicone. Spray the baking sheet with oil if you don’t have a liner. Spread 1 cup (226.79 g) of nuts on the baking sheet in a single layer. Bake the nuts for 15 minutes."
    },
    {
      "title": "Measure your other ingredients while the nuts roast.",
      "content": "Measure your other ingredients while the nuts roast. Pull out a metal or glassware bowl that is big enough to hold the nuts. Combine 1-2 tablespoons (14.78-29.57 mL) of butter and 1 teaspoon (4.92 mL) of sea salt in your bowl. You can also add 1 teaspoon (4.92 mL) of smoked paprika, garlic powder, or other spices to the bowl."
    },
    {
      "title": "Remove the hot nuts from the oven.",
      "content": "Remove the hot nuts from the oven. Put them in the bowl with your other ingredients. Stir well to coat the nuts with the salt and butter. Return the nuts to the baking sheet, spread them in a single layer, and bake them for another two minutes to dry the salt on the nuts. [5] X Research source"
    },
    {
      "title": "Rinse raw peanuts in fresh water.",
      "content": "Rinse raw peanuts in fresh water. Use 1 pound (453.59 g) of peanuts still in their shells. Drain the peanuts. Next, put them in a large stockpot. Add 4 cups (.96 L) of fresh water and 4 tablespoons (59.14 mL) of kosher salt to the stockpot. [6] X Research source You can also add 2 tablespoons (29.57 mL) of smoked paprika, Old Bay Seasoning, shrimp boil mix, or star anise to the water with the salt."
    },
    {
      "title": "Bring the water, salt, and peanuts to a boil.",
      "content": "Bring the water, salt, and peanuts to a boil. Reduce the heat to a very low boil, and cover the stockpot. Boil the peanuts until they are soft. The longer you boil them, the saltier and softer they will become. Try boiling them for as few as 2 hours for firmer, less salty nuts or up to 12 hours for a very soft and salty nut."
    },
    {
      "title": "Take the stockpot off the heat.",
      "content": "Take the stockpot off the heat. Drain the nuts, but do not rinse them. Store the boiled peanuts in an airtight container. Eat or serve all the peanuts within 2 or 3 days after preparing them. They will dry out and become inedible after that."
    }
  ]
}