{
  "url": "https://www.wikihow.com/Plan-a-Pool-Party",
  "title": "How to Plan a Pool Party",
  "steps": [
    {
      "title": "Decide on a date.",
      "content": "Decide on a date. Pool parties usually take place in the summer and are located outside, to enjoy the nice weather. When picking a date for your pool party you will want to consider the weather. You want a warm day, with no rain in the forecast. It is also best to host your pool party on the weekend, so more people are able to attend. [1] X Research source In case you have to cancel due to poor weather, you may want to schedule a rain date. This is especially important if you live in a rainy area and are hosting outside. If you are planning your pool party to celebrate an event, such as a birthday, you may want to pick a date close to the event."
    },
    {
      "title": "Find a pool.",
      "content": "Find a pool. The most important component of a pool party is having a pool for you and your guests to use. There are a variety of options for finding a pool for your party. Using your own pool or a friend or family members' pool: If you have a pool, hosting at your own house is convenient and provides a private location for your party. Many communities have pools that are open for use by the public. There is often a small fee to use community pools, but they are very reasonably priced. Some hotels with pools and swim attractions will allow you to purchase day passes to use the facilities without staying at the hotel. There are indoor and outdoor options of both hotel pools and water parks."
    },
    {
      "title": "Compare venues.",
      "content": "Compare venues. If you don’t have your own pool to use, you will want to compare your options to find the best fit for your party. When picking your location you will want to consider a few different factors, such as, price, size of pool, location, rules and regulations, availability, and other amenities. Pick a pool that fits your budget. For example, going to a hotel or water park will be a more expensive option. Some hotels and water parks have party packages that include extra services to help cater to your party."
    },
    {
      "title": "Set the guest list.",
      "content": "Set the guest list. When deciding on your guest list keep in mind the size of the party space and pool. You want to have a manageable number of guests that will fit the space. [2] X Research source If you are planning a kids pool party, you should also take into account parents that may want to attend with their child."
    },
    {
      "title": "Choose a type of invitation.",
      "content": "Choose a type of invitation. You should first decide on the type of invitation you want to send. There are a few options to consider: evites , mailed invites, or handout invites. You could also invite guests via social media outlets, such as a facebook event page . [3] X Research source"
    },
    {
      "title": "Determine what to include in your invitations.",
      "content": "Determine what to include in your invitations. Make sure your invitations include the important party details. You want your invitations to be informative and clear. They should include: The date and time of the party. The location of the party. A list of items guests should bring to the party, such as, a bathing suit, a towel, sunscreen, change of clothes, sandals/footwear, lawn-chair, and if they are required to bring any food or beverages. The theme of your party. RSVP and contact information, so your guests can confirm their attendance. A scheduled rain date and information on how party cancellation will be communicated."
    },
    {
      "title": "Send the invitations.",
      "content": "Send the invitations. Send out your invitations two to three weeks in advance of your party. This will ensure that more people will be available to attend, as it is less likely that they are already busy that date. It also gives guests more time to respond and plan to attend. [4] X Research source"
    },
    {
      "title": "Finalize attendance.",
      "content": "Finalize attendance. Once you have heard back from all of your invited guests, you should tally how many people will be attending. This is important for organizing other aspects of your party, such as, food, drinks, games, seating, supervision, and safety."
    },
    {
      "title": "Decide on snacks and drinks.",
      "content": "Decide on snacks and drinks. It is a good idea to provide some snacks and drinks at a pool party because guest will get hungry from swimming and playing in the water. Setting out light snacks and finger foods is easy and will keep party goers happy. You could serve some of the following snacks and drinks: [5] X Research source A fruit and vegetable tray. Chips and dip or corn chips and salsa. Popsicles. Crackers and cheese. Water, lemonade, iced tea, pop, juice, punch, etc. Alcoholic beverages for adults."
    },
    {
      "title": "Consider providing a meal.",
      "content": "Consider providing a meal. Pool parties often last close to a full day or afternoon, so it may be necessary to provide more food than just snacks. Options for meals can include: Having a potluck: You can have each guest bring a dish to share with everyone at the party. Grilling or barbecuing: If you are hosting in a backyard and/or have access to a barbecue you could cook hamburgers, hotdogs, grilled veggies, etc. [6] X Research source Ordering food: If you don’t want to cook, or you have a large number of guests, you may want to order food, such as, pizza or other takeout food."
    },
    {
      "title": "Organize supplies.",
      "content": "Organize supplies. When serving food or drinks at your party, you will need supplies such as, serving trays, bowls, cups, cutlery, plates, napkins, ice, coolers, etc. Make sure you have enough supplies for the number of guests that you are serving. [7] X Research source Also, it is a good idea to serve food on paper or plastic plates, so you don’t have breakable dishes near the pool area."
    },
    {
      "title": "Consider games and activities for the party.",
      "content": "Consider games and activities for the party. Depending on the type of party and location, you may want to have some games, toys, or activities available to entertain your guests. Some games include: Marco polo, treasure hunt, sharks and minnows, octopus, volleyball, etc. You could also provide water toys, such as beach balls, pool noodles, floating devices, rings and retrieval objects, water balloons, squirt guns, etc. [8] X Research source"
    },
    {
      "title": "Prepare music to play.",
      "content": "Prepare music to play. Music will help create a great party atmosphere. You can create your own playlist or find one on a music streaming site, such as Spotify. When preparing music also consider, a portable and waterproof speaker to play your music at the pool area. [9] X Research source If your party has a theme, you can have your music match. For example, play Caribbean music at a tropical themed party."
    },
    {
      "title": "Add decorations.",
      "content": "Add decorations. Some popular pool party decorations include, tiki torches, lanterns, flowers, balloons, signs for food and drink stations, colourful tablecloths, etc. [10] X Research source If you are throwing a birthday pool party, you might want to have birthday decorations, such as balloons, streamers, and banners. Alternatively, if your pool party has a specific theme, you will want your decorations to match the theme. If you are hosting your party at a public pool or hotel, you may have to check with them to see if you are allowed to bring decorations."
    }
  ]
}