{
  "url": "https://www.wikihow.com/Read-an-MRI",
  "title": "How to Read an MRI",
  "steps": [
    {
      "title": "Insert your MRI disc into your computer.",
      "content": "Insert your MRI disc into your computer. Today, you will usually be given a disc with your images on it after your MRI. The main purpose of this is so that you can give the disc to your doctor, but there's nothing wrong with reading your MRI at home. Start by putting the disc into your computer's DVD drive . Note: Some MRI centers may have different policies for giving patients copies of their MRI. For instance, instead of a disc, you may be given a USB drive. It's even possible to host and send MRI files online. The important thing in any case is to get the MRI files onto your computer. [1] X Research source"
    },
    {
      "title": "If the program loads automatically, follow the on-screen prompts.",
      "content": "If the program loads automatically, follow the on-screen prompts. If you're lucky, the program will automatically load when you put the disc into your computer. In this case, simply follow the instructions on screen to install and access the program. Usually, you'll want to use the default option (or \"Yes,\" \"OK,\" etc.) or every prompt you are given. [2] X Research source However, MRI viewing software is notoriously unreliable — it's something that even doctors have a hard time with. You may need to take extra action (see below)."
    },
    {
      "title": "If necessary, install the viewing software.",
      "content": "If necessary, install the viewing software. If the software doesn't load automatically, most MRI discs will come with some way to install it on the disc. In general, you'll need to open the disc to explore the files, find this installation program, and run it. The exact steps you need to take will vary depending on how your MRI center has packaged your images on the disc. If you're not having any luck or you can't find an included installer program, try downloading a free MRI viewer from the internet. This site has many links to programs that can view medical images in the standard DICOM format. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Load the study.",
      "content": "Load the study. Again, the exact steps you'll need to take here can vary slightly depending on the exact program you have packaged with your images. Generally, most MRI viewers will have some sort of option to load or import images that you can select from the menu bar at the top of the screen. In this case, select this option, then pick the image file on your disc that you'd like to look at. Note that most medical imaging software refers to collections of images as \" studies \". You may not see an \"import image\" option, but you'll probably see something to the effect of \"import study.\" Another option you may encounter is that, as soon as the program loads, it will present you with a \"table of contents\" of all the MRIs on the disc. In this case, simply select the study you want to view first to proceed."
    },
    {
      "title": "View the images.",
      "content": "View the images. Most MRI programs start with a large black space on one side of the screen and a smaller toolbar on the other side. If you see small preview pictures of your MRI images in the toolbar, double click on the image you want to view. It should load a large version of the image into the black area. Be patient while you wait for your images to load. Though the viewing programs don't usually look like much, a single MRI image contains a large amount of information, so it may take your computer a moment or two to finish the job of loading it up."
    },
    {
      "title": "Familiarize yourself with the different MRI viewing schemes.",
      "content": "Familiarize yourself with the different MRI viewing schemes. When your MRI first loads up, if you're lucky, it will be immediately obvious what you're looking at. However, in many cases, the image you see may be a completely unintelligible mix of black, white, and grey. Knowing how MRIs are shot can help you make sense of your images. The three main ways MRIs are displayed are: [4] X Research source Sagittal: Often the easiest for non-doctors to interpret. Sagittal MRIs are basically side or profile views of your body. The image is as if you've been sliced in half vertically, from your head to your pelvis. Coronal: These images are basically a \"head on\" view of your body. You're looking at your features vertically from the front — as if you were standing facing the camera. Cross-sectional: Often the hardest for non-doctors to interpret. Here, you're basically viewing thin slices of your body from the top down — as if you've been cut into many thin horizontal slices from your head to your toes like a salami."
    },
    {
      "title": "Look for contrast to identify different body features.",
      "content": "Look for contrast to identify different body features. MRIs are in black and white, which can sometimes make it hard to tell parts of the body apart. Because there's no color, contrast is your best friend. Luckily, different types of tissue show up as different shades on an MRI, so it's easy to see contrast where differing tissues meet. [5] X Research source The exact shade that each type of tissue will be depends on the MRI's contrast settings. The two main contrast settings are called T1 and T2. Though the differences between these settings are minor, they can help doctors find problems more efficiently. For instance, T2 is usually used for diseases (as opposed to injuries) because diseased tissues tend to show up better on this setting."
    },
    {
      "title": "Pick an appealing series layout.",
      "content": "Pick an appealing series layout. MRI programs almost always have the ability to display more than one image at once. This makes it convenient for doctors to compare different views of the same area or even MRIs taken at different times. For most non-doctors, it's easiest to simply choose a one-image-at-a-time layout and cycle through the images individually. However, there should be onscreen instructions to show two, four, or many more images at once, so feel free to play around with this feature."
    },
    {
      "title": "Use the section-cut line to see where cross-sections are located.",
      "content": "Use the section-cut line to see where cross-sections are located. If you display a cross-sectional image along with a sagittal or coronal image, you may see a section-cut line on the second image. This will be a straight line running through the image, but it may not be present on all MRIs. If your image does have one, this shows where on the second image the cross section is located. You should be able to move the section cut line toward the center, right or left of the image. This will change the larger layout image to show the body from the new direction of the scan. The section-cut line on the layout picture also shows the direction that the image was taken from. For example, if your MRI were a picture of an everyday object, like a tree, the section cut line might show you if the picture was taken from above in a plane, from a second-story window, or from the ground."
    },
    {
      "title": "Drag the section-cut line to view new parts of the study.",
      "content": "Drag the section-cut line to view new parts of the study. Dragging the section-cut line to a different part of the image allows you to \"move around\" your MRI images. The image should change your view to the new area automatically. For example, if you're viewing a sagittal image of your spine along with a cross section of one of your vertebrae, moving the section-cut line may allow you to cycle up and down through the various vertebrae above and below it. This can be useful for locating problems like herniated discs."
    },
    {
      "title": "Look for non-symmetrical patches.",
      "content": "Look for non-symmetrical patches. By and large, the body is very symmetrical. If, in your MRI, you notice a patch of lightness or darkness on one side of your body that does not match what's on the other side, this can be cause for concern. Similarly, for parts of the body that have many similar features repeated multiple times, a difference in one of the features can be a sign that something is amiss. A good example of the second case is for spinal disc herniations. [6] X Research source The spine is made up of many different bone vertebrae stacked on top of each other. Between every two vertebrae is a fluid-filled disc. When you get a herniated disc , one of these discs breaks and the fluid leaks out, causing pain as it presses against the nerves in your spine. You'll be able to see this on a spinal MRI — there will be a long line of \"normal\" vertebrae and discs, with one noticeably bulging out."
    },
    {
      "title": "Examine the structure of the vertebrae for spinal MRIs.",
      "content": "Examine the structure of the vertebrae for spinal MRIs. MRIs of the spine are typically some of the easiest for non-doctors to read (especially in sagittal view). Look for noticeable misalignments in the vertebrae or fluid discs. Having just one of either be out of alignment (as in the example above) can be the source of serious pain. Behind the spinal vertebrae, in sagittal view, you'll see a white, rope-like structure. This is the spinal cord, the structure connected to all the body's nerves. Look for spots where the vertebrae or discs seem to \"pinch\" or press into the spinal cord — because the nerves are so sensitive, just a little pressure can lead to pain."
    },
    {
      "title": "Use cross-sectional views to spot abnormalities in brain MRIs.",
      "content": "Use cross-sectional views to spot abnormalities in brain MRIs. MRIs of the brain tissue are often used to check for brain tumors, abscesses, and other serious problems that can affect the brain. The easiest way to see these things is usually to choose the cross-sectional view, then descend slowly from the top of the head downward. You're looking for anything that's not symmetrical — a dark or light patch that's on one side but not the other is cause for concern. [7] X Research source Brain tumors often take the form of round, golf ball-like growths in the brain which will usually show up as either bright white or dull grey surrounded by a ring of white. However, other brain problems (like multiple scleroses) can also have a whitish appearance, so this alone may not be a sign of a brain tumor."
    },
    {
      "title": "For knee MRIs, look for inconsistencies between the two knees.",
      "content": "For knee MRIs, look for inconsistencies between the two knees. Comparing coronal views of an injured knee with those of a healthy knee can make it easy to spot problems. A few of the issues you may want to look out for include: [8] X Research source Osteoarthritis: Decreased joint space in the affected knee. Formation of osteophytes (jagged boney projections the form off the side of the affected knee). [9] X Research source Ligament tear: Increased joint space in the affected knee. Pocket may fill with fluid that shows up as white or light-colored. Separation of the ligament itself may be visible. [10] X Research source Meniscus tear : Abnormal joint spacing. Dark-colored features on either side of the joint space pointing inward. [11] X Research source"
    },
    {
      "title": "Never diagnose yourself from your MRI images.",
      "content": "Never diagnose yourself from your MRI images. This bears repeating: if you see something that you're not sure about on MRI, don't assume that you have a terrible illness without talking to your doctor. Conversely, if you don't notice anything out of the ordinary on your MRI, don't assume you're fine without talking to your doctor. Ordinary people don't have the knowledge and training to make accurate diagnoses, so, when in doubt, always get the advice of a medical professional."
    }
  ]
}