{
  "url": "https://www.wikihow.com/Measure-a-Screen-Spline",
  "title": "How to Measure a Screen Spline",
  "steps": [
    {
      "title": "Remove the screen frame from the window.",
      "content": "Remove the screen frame from the window. Check for clips holding your window screen in and, if you spot any, lift the clips up to unfasten the screen from the window. In most cases, your window screen frame should pop out easily. If your screen frame is secured by clips, they should be located along the left and right sides. After removing the frame, lay it down on a flat surface like a table."
    },
    {
      "title": "Use a flat-head screwdriver to pry the screen spline up.",
      "content": "Use a flat-head screwdriver to pry the screen spline up. Take the screwdriver and pry up 1 end of the screen spline. Lift it until you can grab the end of the screen spline with your hands. [1] X Research source You can pry the screen spline up from either end. If you don't have a flat-head screwdriver, you can use a butter knife as an alternative. The screen spline looks like a long cord made of rubber or foam. [2] X Expert Source Michael Fox Window Repair Specialist Expert Interview. 1 December 2020."
    },
    {
      "title": "Pull the screen spline up and out of the frame.",
      "content": "Pull the screen spline up and out of the frame. Once you have a strong grip, pull upward on the screen spline with light pressure. Continue lifting the spline until you remove it from the window frame completely. [3] X Research source"
    },
    {
      "title": "Try not to damage the screen spline as you remove it.",
      "content": "Try not to damage the screen spline as you remove it. You will get the best and most precise readings if you keep the screen spline as intact as possible. If the spline is already broken, remove it gently to keep it as intact as you can. [4] X Research source"
    },
    {
      "title": "Use the old spline as a guide for new spline measurements.",
      "content": "Use the old spline as a guide for new spline measurements. Do not throw away your screen spline if it was recently damaged. You can still use it to determine the size your new screen spline should be. [5] X Research source"
    },
    {
      "title": "Use a tape measure to find the diameter of your spline if it's intact.",
      "content": "Use a tape measure to find the diameter of your spline if it's intact. Lay the screen spline on a flat surface and position the tape measure across 1 end of the spline to find the diameter, or width, of the spline. [6] X Expert Source Michael Fox Window Repair Specialist Expert Interview. 1 December 2020. Measure from 1 side of the spline to the other, and write down the number. [7] X Research source The spline's measurements tend to be in inches or centimeters, depending on whether your country uses the imperial or metric measurement system."
    },
    {
      "title": "Measure the spline groove opening's diameter as an alternative.",
      "content": "Measure the spline groove opening's diameter as an alternative. If your screen spline is badly damaged or you no longer have it, you can use the screen frame to take the spline diameter. Place the tape measure inside the spline groove opening and take measurements from the bottom of the opening to the top to find the diameter. [8] X Research source The spline groove opening is the place in the screen frame where you insert the spline."
    },
    {
      "title": "Buy a new spline with the same measurement.",
      "content": "Buy a new spline with the same measurement. Try to find as precise a match as possible. [9] X Expert Source Michael Fox Window Repair Specialist Expert Interview. 1 December 2020. If your spline measurements are between 2 sizes, determine whether the width is nearer to the larger or smaller size and choose the closest match. If you old spline has a .125 in (0.32 cm) diameter, for example, you would look for a new spline with the same measurements on the package."
    },
    {
      "title": "Cut the new spline to size.",
      "content": "Cut the new spline to size. Measure all 4 interior sides of the screen with a tape measure and record the length. Use scissors or a sharp knife to cut your spline to the same length. [10] X Research source If your previous spline's length is still intact, use it as an additional guideline while cutting the spline to size."
    },
    {
      "title": "Press the spline into place.",
      "content": "Press the spline into place. Starting in 1 corner of the screen, use your hands to insert the spline into the frame groove. Use a spline roller to smooth over any raised areas to make sure it stays secure. [11] X Research source"
    },
    {
      "title": "Troubleshoot issues with lubricant or by stretching the spline.",
      "content": "Troubleshoot issues with lubricant or by stretching the spline. If the spline does not easily lay flat in the frame groove, try spraying it with a silicone lubricant, available at hardware stores. [12] X Research source If the spline is too large to insert into the screen, pull on 1 end to stretch it thinner as you insert it. The spline should return to its original shape and keep a firm hold in the frame."
    }
  ]
}