{
  "url": "https://www.wikihow.com/Questions-to-Ask-Your-Ex",
  "title": "80+ Questions to Ask Your Ex to Understand Your Relationship",
  "steps": [
    {
      "title": "Discuss why things didn’t work out to get closure from your relationship.",
      "content": "Discuss why things didn’t work out to get closure from your relationship . If you don’t understand what went wrong in your relationship, you might question it for the rest of your life. To answer all your what-ifs, ask your ex why they believe you’re no longer together—you may be surprised to find their perspective doesn’t match yours. [1] X Research source When did things change in our relationship? When did you realize it was over between us? Why do you think it didn’t work out? Do you remember the day we broke up? Do you think our breakup was mutual? How did you handle our breakup? Who do you think had a harder time with our breakup? If we were still together, do you think we’d be happy?"
    },
    {
      "title": "Determine what kind of partner you were to see what you can improve on.",
      "content": "Determine what kind of partner you were to see what you can improve on. One of the best ways to heal from your relationship is to reflect on what you did (or didn’t do) as a partner. Ask your ex about the ways you might have added stress or conflict to your relationship, and consider the changes you can make to become a better partner in the future. [2] X Research source What were my best and worst traits as a partner? Who do you think put more effort into our relationship? Do you think I was needy or independent? Did I clearly express my needs and feelings to you? Was I emotionally available to you? What’s your least favorite memory of me? Do you have any advice for me as I start dating again?"
    },
    {
      "title": "Ask them how they felt while dating you to acknowledge their perspective.",
      "content": "Ask them how they felt while dating you to acknowledge their perspective. Sometimes, you become super comfortable in a relationship to the point where you forget to check in on the other person. To understand your ex’s feelings toward you, ask them if they felt heard, respected, and needed during your relationship. [3] X Research source Did I make you feel wanted and appreciated? Did I ask too much of you? Or not enough? Do you feel like I was holding you back? Did you want to be the best version of yourself? Did you ever feel like you were walking on eggshells around me? Was I ever judgmental towards you?"
    },
    {
      "title": "Reflect on your relationship to see if your ex has changed.",
      "content": "Reflect on your relationship to see if your ex has changed. When you examine your relationship in retrospect, you can notice major issues you might have missed while you were dating. In order to gain closure, reflect on what you’ve learned from your relationship, and ask your ex if they’ve done any inner work since your breakup. What was the best part of our relationship? What’s the worst part of our relationship? What’s one thing we could have done differently in our relationship? What did you learn about women/men from our relationship? What’s the biggest lesson you learned from our breakup? If you could do it over again, would you change anything?"
    },
    {
      "title": "Question their intentions in your relationship to begin the healing process.",
      "content": "Question their intentions in your relationship to begin the healing process. While it’s totally normal to have lingering feelings for your ex, asking them deeper questions about your relationship can help you accept the breakup and move forward. By allowing yourself to be vulnerable, you can finally embrace your emotions and understand that it’s okay to feel heartbroken . Were you in love with me or the idea of me? What do you miss the most about our relationship? Is there a memory you want to erase of us? If you could erase every memory of me, would you? How long did you think our relationship would last? Did you ever see yourself marrying me?"
    },
    {
      "title": "Ask them how their loved ones felt about you to gauge your importance.",
      "content": "Ask them how their loved ones felt about you to gauge your importance. If you weren't sure where you stood with your ex during your relationship, now’s the chance to get all the details. Ask your ex about how their friends and family reacted to your breakup to see if you were just a fling or a serious partner to them. [4] X Research source What did you tell your friends when we broke up? How have your friends helped you get over our breakup? Did your friends or family influence our relationship? What did your family really think about me? Did your friends actually like me? What’s one thing your friends didn’t like about me? Who knows you better: me, your friends, or your family?"
    },
    {
      "title": "Check if your physical connection might have spurred the breakup.",
      "content": "Check if your physical connection might have spurred the breakup. Since one of the most common reasons for couples to break up is sexual incompatibility, ask your ex how they felt about your sex life. If they felt the sexual chemistry fizzled out over time, it might explain why your ex checked out emotionally before your breakup. [5] X Research source Do you think we had a similar sex drive? What do you think we lacked in our sex life? When did our sexual chemistry fade for you? Do you think we were sexually compatible? Were you more attracted to me or your ex? What part of my body do you miss? Out of all your partners, where do I rank?"
    },
    {
      "title": "Put your worries to rest by asking them if they ever betrayed you.",
      "content": "Put your worries to rest by asking them if they ever betrayed you. If your ex acted shady during your relationship, don’t be afraid to ask them specific questions about their behavior. Confronting your ex about any lies or cheating allows you to gain closure from your relationship so you can move forward (and live your best life). Did you ever think about cheating on me? Were you attracted to any of my friends during our relationship? Did you want to be with someone else during our relationship? Did you slide into anyone’s DMs during our relationship? Were you talking to anyone else during our relationship? Did you ever lie about meeting up with someone? What’s the biggest lie you told me while we were dating?"
    },
    {
      "title": "Grill them about their post-breakup behavior to see if you need to move on.",
      "content": "Grill them about their post-breakup behavior to see if you need to move on . Before getting back together with your ex, you might want to ask them about their motives since you two parted ways. Their behavior after your breakup might reveal a side to them that you’ve never seen, and if you’re not okay with their actions, let them know how you feel. Have you tried to hook up with anyone since our breakup? Who was the first person you kissed after our breakup? Have you tried to get with any of my friends since our breakup? Have any of my friends hit on you since our breakup?"
    },
    {
      "title": "Bring up positive memories to make them miss you.",
      "content": "Bring up positive memories to make them miss you. If you want to win your ex back , take a walk down memory lane to connect with them on an emotional level. Remind them of the good times to tug at their heartstrings (and see if they’re willing to give your relationship another chance). What’s your favorite memory of me? What initially attracted you to me? What do you think initially attracted me to you? Did you keep any of my stuff? Is there a song that makes you think of me? What do you miss the most about me? How often do you think of me?"
    },
    {
      "title": "Ask them if they’re still in love with you to see if you can make up.",
      "content": "Ask them if they’re still in love with you to see if you can make up. If you want to get your ex back , see what they’ve been up to since your breakup (aka find out if they’re single), and figure out if they’re in a place to commit to someone. Instead of trying to sway them, ask them if they want to explore the possibility of getting back together—and remember to respect their decision. [6] X Research source Are you seeing anyone? Have you fallen out of love with me? Do you want to get back together? Are you happier without me? What’s the likelihood of us getting back together? What would it take for us to get back together? Are you happy being single or do you want to be in a relationship again?"
    },
    {
      "title": "Talk about the future to see if they still have feelings for you.",
      "content": "Talk about the future to see if they still have feelings for you. If your ex isn’t one to admit their feelings, ask them indirect, vulnerable questions to see where you two stand. Even if you don’t get back together, they might be open to continuing a friendship with you. Do you think you’ll ever meet someone like me? Do you think I’ll be a good wife/husband? Where do you see us in 10 years?"
    }
  ]
}