{
  "url": "https://www.wikihow.com/Perform-Hypnosis",
  "title": "How to Perform Hypnosis",
  "steps": [
    {
      "title": "Have the person lie down on a bed or couch, or sit in a chair.",
      "content": "Have the person lie down on a bed or couch, or sit in a chair. Almost anyone can be hypnotized, but it requires the right frame of mind, a willingness to try it, and the right environment. Eliminate distracting noises; you may want to play some quiet, soothing music. If they're sitting up, whatever they're sitting in will be able to prevent them from falling over if they slump or lean. For the most part, the body will keep itself upright enough to prevent falling, but it's a good precaution to take. Make sure your subject is not thirsty or hungry and does not have to go to the bathroom. If there are other people around, ask them not to disturb you, and don't forget to make sure pets cannot come in the room and interrupt your session. When you're hypnotizing someone, you're trying to help them relax into that state between being awake and asleep. Let them know they don't have to turn off their thoughts—it's okay to acknowledge them and let them pass through. [1] X Expert Source Alexandra Janelli Certified Hypnotherapist & Anxiety and Stress Management Coach Expert Interview. 27 August 2020."
    },
    {
      "title": "Induction is the process of bringing someone into a hypnotic trance.",
      "content": "Induction is the process of bringing someone into a hypnotic trance. There are many types of induction, and it may take a little trial and error to figure out which one works best for you and your subject. Each subject may have a different preferred induction or one that works better for them, so it's best to learn a few different techniques to try out. You can look up many sample hypnosis scripts online by searching for \"sample hypnosis induction scripts\". [2] X Research source"
    },
    {
      "title": "Talk your subject through relaxing every part of their body.",
      "content": "Talk your subject through relaxing every part of their body. You can do this by outright instructing them to do so with each body part, by describing a flowing warmth creeping up or down their body, or by having them squeeze and relax each body part in turn. It is customary to start at the head and move down if the person is sitting up, or to start at the feet moving up if they're lying down. [3] X Expert Source Alexandra Janelli Certified Hypnotherapist & Anxiety and Stress Management Coach Expert Interview. 27 August 2020. Difficult subjects may require the body to be broken up into smaller parts such as toes, feet, heels, ankles and so on, whereas more easily relaxed subjects may be able to settle down with larger parts like feet, legs, etc. This can help the person go deeper into a relaxed, subconscious state where their mind becomes very focused. [4] X Expert Source Alexandra Janelli Certified Hypnotherapist & Anxiety and Stress Management Coach Expert Interview. 27 August 2020."
    },
    {
      "title": "The more difficult your subject, the longer you'll need to count for.",
      "content": "The more difficult your subject, the longer you'll need to count for. Slowly count up from 1, pausing between each number. You can inject calming phrases between each number such as \"1, you are becoming more relaxed. 2, you feel calmer and safer. 3, you are growing pleasantly warm.\" [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You can also have your subject repeat each number back to you; this can be a good way to gauge how relaxed or entranced your subject is becoming as their voice grows quieter and quieter or they respond more slowly - or not at all."
    },
    {
      "title": "Discuss what they're experiencing, how they're feeling, and things they're seeing.",
      "content": "Discuss what they're experiencing, how they're feeling, and things they're seeing. You can include suggestions in this, such as \"And are you noticing that your body is growing more still and beginning to feel warmer?\" Leading questions such as this can be very useful. [6] X Research source Ericksonian hypnosis is almost a thing all its own, so if you are going to use Ericksonian techniques it is a good idea to research them first. Soft suggestions, such as \"I see that you are becoming more relaxed\" or \"You can begin to notice that your eyes are tending to close\" can work well on difficult subjects who have a hard time relaxing on their own. Hard suggestions, such as \"You are feeling sleepy\" or \"Your body is relaxed and your eyelids are heavy\" can work on more easily hypnotized subjects, but can also cause the mind to want to rebel and fight against the suggestions, so use them with caution."
    },
    {
      "title": "Closing their eyes will increase the depth of the trance.",
      "content": "Closing their eyes will increase the depth of the trance. It is possible to enter a deep trance with the eyes open, but most people tend towards closing their eyes as they relax anyway, so calling attention to it can help them feel that they are becoming more entranced."
    },
    {
      "title": "A second induction technique can help them go deeper.",
      "content": "A second induction technique can help them go deeper. Slowing and deepening your voice can help impress upon them that things are slowing down and it is time to settle further into trance. [7] X Research source At this point, it is best not to use any induction techniques that would require them to answer questions or give any complex responses. Some people can remain in a deep trance while still speaking normally, but many people have a harder time speaking clearly or at length when in trance, so asking them a question that requires a thoughtful or lengthy response can cause them to 'wake up' a little in order to be able to answer. You can try other techniques to deepen their trance, such as asking them to lift a hand or finger and calling attention to how heavy their body is and how difficult the task is (or, if they have no problem lifting it, you can call attention to how their body feels light and floaty, so it's easy for them to lift a hand or finger, and suggest that perhaps it seems to lift itself without them having to think much about it). You can also just keep repeating phrases such as \"the deeper you go the deeper you go\" or \"down, down, down we go\". If you want a very, very deep trance, you can ask them to become so entranced or sleepy that they enter a place in their mind where they will not remember what you have talked about, or where they feel they are almost about to fall completely asleep. (These are only recommended for experienced subjects.)"
    },
    {
      "title": "Begin giving suggestions and accomplishing your subject's goals.",
      "content": "Begin giving suggestions and accomplishing your subject's goals. Please note that hypnosis is entirely a consensual act; subjects simply will not act on suggestions that they don't feel comfortable acting on. You cannot force your subject to do anything they aren't comfortable doing. Attempting to do so may cause them to wake up abruptly, which can be upsetting. If you are unsure if your subject would be willing to respond to your ideas, try framing them as light suggestions, using phrases such as \"Would you like to...?\" or \"Do you think you could...?\" or \"If it would feel good, ....\" Some subjects respond better to firm instructions, but nearly all subjects will be able to respond at least somewhat to light suggestions. Some examples of suggestions or ideas for your subject: [8] X Research source Implanting post-hypnotic triggers. These can be as simple as a quick induction trigger (\"Whenever I snap my fingers, if it is safe for you to do so, you will fall into a light trance.\") or more complex, such as a 'happy button' (\"Whenever you see a red light, you will instantly feel happy, warm and good.\") or even lifestyle-altering suggestions if that is what your subject wants (\"Whenever you start to smoke a cigarette, you will feel disgusted by the taste of the cigarette and immediately want to put it out.\"). In-trance emotional effects. Simply telling or suggesting to your subject that they will feel happy, warm, de-stressed, amused, loved, safe, or some other positive emotion can induce that feeling in them, sometimes very strongly. A good hypnotist never elicits negative emotions from their subject unless their subject has explicitly asked for that (and even then, only experienced hypnotists should attempt this). Therapeutic venting. If your subject is someone who can speak normally or audibly during trance, you can encourage them to talk about how they are feeling, things they are planning or dreaming about, what's going on in their life or any other helpful topic you'd like to hear about. Subjects who can speak in trance will often have lowered inhibitions and be willing to discuss things they would normally keep private, so make sure you respect their privacy and do not share what they have said unless they tell you - while awake and not in trance - that it is okay for you to do so. This technique can be very cathartic for your subject, but be prepared to deal with upset feelings if they talk about something that is hard for them. Guided imagery. A pleasant experience for a subject can include the hypnotist taking them on a fantastic, spiritual or otherwise meaningful adventure in their minds - or even just a pleasant scenario to try out. Make up a story and describe all the senses being experienced in great detail - how things look, how they sound, what they smell like, how they feel. You can also make room for your subject to fill in details themselves, such as by saying \"You come to a beautiful clearing, and someone or something wonderful is there to greet you. Picture in your mind what they look like, how they sound, how they smell. If you were to touch them, what would they feel like? You don't need to answer me out loud unless you want to, just simply experience this meeting and allow it to happen however it wants to happen.\" Make sure you keep your imagery positive and pleasant, as your subject's mind will be much more willing to fully experience the guided journey than it would be while they were awake, and introducing frightening, sad, or upsetting ideas can be devastating for the subject's hypnotic experience, and may even cause them to suddenly awaken, which can also be harmful to their emotions and experience."
    },
    {
      "title": "The most common way to wake a hypnotized subject by counting.",
      "content": "The most common way to wake a hypnotized subject by counting. Simply count down from 10 to 1 (or 20 to 1, or however long you think your subject will need), saying soothing, encouraging words between each number as you speak them slowly, explaining to your subject that they are becoming more and more awake and alert, that they can begin to move their body again, that they can begin to open their eyes, and so on. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You can also use guided imagery here, such as by describing swimming up from the bottom of the ocean, with each number drawing them closer to the surface, then finally breaking through into the air and sunlight at the end of the countdown. It can also be helpful to have your subject repeat each number back to you, as with the counting induction. It is common to finish the counting with a 'Wake up!' spoken firmly but not aggressively, to help the subject really come up all the way. A finger snap is sometimes also used at the same time. Be sure to bring your subject up slowly and comfortably - it is a good idea to suggest that they will continue to feel warm, relaxed and good when they wake up, but simply more alert and aware of the world around them. You want every aspect of the experience to be pleasant for them."
    }
  ]
}