{
  "url": "https://www.wikihow.com/Smoke-Shatter",
  "title": "How to Smoke Shatter Properly",
  "steps": [
    {
      "title": "Set up the rig.",
      "content": "Set up the rig. If you don’t have one already, buy a dab rig designed specifically for concentrates like shatter. Connect the nail, which is the stem that holds the concentrate, to the body of the rig (there should be no wobbling, so insert it further if it won’t hold steady). If your rig has a water chamber (most rigs do), fill it with room-temperature water up to the hash mark. [1] X Research source Using a traditional rig (also known as a “dab rig”) is widely considered to be the most effective way to consume shatter in terms of THC extraction and flavor."
    },
    {
      "title": "Heat the nail for 30 seconds, then let it cool for 60 seconds.",
      "content": "Heat the nail for 30 seconds, then let it cool for 60 seconds. Use a butane torch to heat the nail. Move the torch back and forth underneath the nail’s platform or tip to make it exceptionally hot. After 30 seconds or so, shut the torch off and wait about a minute for the heat to dissipate and spread out evenly along the nail. If you end up getting super into concentrates, there are electronic dab rigs you can buy that don’t need a torch! They’re kind of pricey for a beginner though, so start small to confirm dabbing is right for you, first."
    },
    {
      "title": "Apply the shatter to the nail using the dabber.",
      "content": "Apply the shatter to the nail using the dabber. The dabber is the small shovel-like item that came with your rig. Put a piece of shatter on it and then scrape the shatter onto the nail. Drop the shatter inside and it will immediately begin to vaporize."
    },
    {
      "title": "Cover the nail with the carb cab.",
      "content": "Cover the nail with the carb cab. The carb cap is the little fixture that sits on top of the nail. As soon as the shatter begins to heat, put the carb cap on top of the nail to prevent any fumes from escaping. This also makes it possible to actually smoke the shatter—without the carb cab on you’ll be sucking too much air through."
    },
    {
      "title": "Hit your rig to “take the dab” but exhale immediately.",
      "content": "Hit your rig to “take the dab” but exhale immediately. Inhale the smoke into your lungs and then let it go. Don’t hold it in for more than three seconds. Dabs are not like smoking flower where holding the hit in creates a stronger high. In fact, if you hold the smoke in your lungs for more than three seconds, the lack of oxygen combined with the dab high will make you extremely lightheaded and you could pass out. [2] X Research source How many hits should I take? Start with just one. Concentrates are much stronger than traditional flower. Don’t try to show off by doing too much and don’t try to ghost the hit or anything. Just see how you feel after a single hit; it’s likely that hit contains as much THC as a full joint."
    },
    {
      "title": "Use a cotton swab to clean out the nail (optional).",
      "content": "Use a cotton swab to clean out the nail (optional). If you wait for the rig to cool all the way, the shatter residue from your dab will harden in the nail. This isn’t a big deal—you can heat it again to smoke it—but it may not be as flavorful and enjoyable as the shatter was when it was fresh. To prevent this, use a cotton swab to rub up any shatter residue in the nail before it dries. [3] X Research source Keeping your rig clean: If you ever want to completely clean the nail, let it cool and then soak the nail in rubbing alcohol. Scrub it with a paper towel or cloth, then rinse it off under water. Always use totally fresh water, too! Don’t leave the used water in the water chamber. It can grow bacteria and get kind of gnarly over time."
    },
    {
      "title": "Vape pens and vape rigs",
      "content": "Vape pens and vape rigs Also known as dab pens, there are plenty of pre-assembled vape pens that contain shatter available on the market today. If you want an easy, straightforward way to vaporize shatter, vapes are a great way to go. You can also vaporize shatter using an e-rig designed for concentrates. You just turn the vaporizer on and set the shatter in the vape chamber. [4] X Research source Safety Warning: If you do not live in a state where vape pens are sold legally at smoke shops, do not mess around with vape pens. There are a lot of unregulated THC vape devices linked to popcorn lung and other health issues out there. [5] X Research source How well does this work? 10/10. This is a great option if you don’t want to mess around with water chambers and butane torches."
    },
    {
      "title": "Joint or blunt",
      "content": "Joint or blunt You can easily work shatter into your rolled flower and smoke it that way! Start by warming the shatter up to make it pliable. Hold the shatter in your hands—your body temperature should change the texture and make the shatter resemble clay. Rub the shatter into the shape of a thin snake and lay it in your joint or blunt. Put the flower on top and roll the joint or blunt like normal. [6] X Research source How well does this work? This is a good way to increase THC content of a joint or blunt, but you aren’t going to get all of the flavors from the shatter the same way you would if you heated it at a higher temperature. Still, it’ll work!"
    },
    {
      "title": "Pipe or bowl",
      "content": "Pipe or bowl If you’re smoking out of a pipe or bowl, simply put a little shatter on top of the flower. When you light the flower, the shatter will heat up and leak some of its terpenes into the flower. You won’t get all of the same flavors as you would smoking shatter on your own, but it’ll certainly increase your high. [7] X Research source You can try smoking shatter alone in a pipe or bowl without any flower, but it’s not going taste very good or be a super rewarding high. The shatter needs the burning flower to heat up consistently as you smoke. How well does this work? If you’re looking to elevate your bowl a bit, this is a great option. It’s not a particularly great way to consume a lot of shatter though, since the lighter won’t be hitting the shatter long enough to fully melt it."
    },
    {
      "title": "Cigarette",
      "content": "Cigarette If you’re a fan of spliffs and you want to smoke a cigarette, go ahead and light up as normal. Once the ember of the cigarette is smoking steady, take a small piece of shatter and carefully place it on the ember. Let it melt for a sec and continue to enjoy your cigarette. [8] X Research source You can only do this with a really small piece of shatter, just FYI. Luckily, it doesn’t take much to get the THC, though. How well does this work? It’s okay. It’s not the best shatter experience, but if you were going to smoke a cigarette anyway, this is a fun option!"
    },
    {
      "title": "Hot knives",
      "content": "Hot knives This is kind of a wonky option but if you’re desperate, this can work. Heat up the tips of two knives. Once they’re running hot, carefully set a piece of shatter on one of the tips. Put the second knife tip on top and squeeze the shatter. As it melts, it’ll release vapor. Inhale that vapor as it escapes. [9] X Research source How well does this work? It’s not glorious, but you’ll catch a buzz. Just be careful handling the knives—this can be kind of awkward to do."
    },
    {
      "title": "Shatter is a powerful type of marijuana concentrate.",
      "content": "Shatter is a powerful type of marijuana concentrate. Marijuana concentrates are extremely potent forms of marijuana made by pulling the THC (the psychoactive part of marijuana plants) out of the plant and compressing it into an oil, rocky substance, or paste. Shatter is a particular type of concentrate known for its extreme potency, longer shelf life, and difficulty of use (it’s just not as forgiving as something like THC wax). [10] X Research source Shatter is typically smoked the same way as other concentrates—as “dabs” where you use a butane torch to heat the material on a coil or in a glass chamber. The name “shatter” comes from the texture of the concentrate. It’s brittle and breaks kind of like glass when it’s at room temperature. How is shatter made? Shatter is made by soaking marijuana plants in butane (or other solvents) to extract the THC. That THC-soaked solvent mixture is then heated rapidly to burn off the gas and other chemicals. The remaining mixture is cooled until it forms a rock-like material and voila! You’ve got highly potent shatter."
    },
    {
      "title": "Shatter is basically the strongest type of marijuana available.",
      "content": "Shatter is basically the strongest type of marijuana available. Every type of concentrate can be made to be more or less equally strong, so shatter isn’t completely unique in this regard. Still, it’s extremely strong stuff. A lot of shatter can be produced to be 90% pure THC. [11] X Research source For contrast, traditional THC flower is usually 15-25% THC! [12] X Research source Shatter is probably not the most popular concentrate out there. Live resin/rosin and full melt probably take that prize. Those two don’t use butane in the distillation process, and many smokers find this improves the flavors."
    },
    {
      "title": "Is shatter stronger than wax?",
      "content": "Is shatter stronger than wax? Both shatter and wax can be made to be 70-90% THC. In this regard, they’re equally strong. The main difference between wax and shatter is the texture. Wax is…well…waxy. It has a soft, Play-Doh texture that makes it a lot easier to work with."
    },
    {
      "title": "Can you eat shatter?",
      "content": "Can you eat shatter? Eating shatter won’t do anything—the shatter has to be heated to release the THC it contains. However, you can absolutely bake with it. You just have to use a low enough heat to release the THC in the baking process without burning it away. It’s tricky, but you can do it if you’re motivated. [13] X Research source Turning shatter into edibles kind of defeats the purpose, according to a lot of marijuana enthusiasts. The point of shatter is to get a lot of THC quickly, and edibles are sort of the opposite of that."
    },
    {
      "title": "Is shatter the same thing as dabs?",
      "content": "Is shatter the same thing as dabs? Kind of, yeah. A “dab” refers to basically any concentrate—including shatter. The act of “dabbing” is when you smoke a concentrate in a rig. So, yes, smoking shatter would be the same thing as “doing a dab.” This would apply to any concentrate, though. You know how a square is a type of rectangle but a rectangle isn’t a square? Shatter is a type of dab but not all dabs are shatter. A “dab” could refer to wax, butter, etc."
    },
    {
      "title": "Can you make shatter at home?",
      "content": "Can you make shatter at home? No, concentrate production of any kind requires dangerous chemicals you can’t even buy without the proper commercial licenses. Beyond that, the process for creating shatter is extremely complicated, so it’s not something you can do at home on your own."
    }
  ]
}