{
  "url": "https://www.wikihow.com/Save-a-Dying-Goldfish",
  "title": "How to Save a Dying Goldfish",
  "steps": [
    {
      "title": "Separate your sick goldfish.",
      "content": "Separate your sick goldfish. If you have a sick goldfish, it’s important to separate him from any other goldfish so that he doesn’t transmit any potential diseases. If you only have one goldfish, leave him in his tank. If you move a sick goldfish to a “hospital” tank, transport him in plastic bag that is inside of a paper bag so that your goldfish doesn’t get stressed. You may want to fill the water in the new tank with water from the old tank, though if the water is causing your fish to die, this may exacerbate the problem. [2] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If you place the fish in new water, simply put the plastic bag into the water for 15-20 minutes to help the temperature adjust and not shock your fish. [3] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Check the water quality.",
      "content": "Check the water quality. Most dying fish can be easily revived with changes to the water. Maintaining water quality is essential to keeping your fish happy and healthy—and alive. [4] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source You can buy a fish tank water testing kit at most pet stores. [5] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source These tests can help you identify any problems with the water, such as high ammonia. Test the temperature to make sure it is between 50 and 78 degrees Fahrenheit. [6] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Test the water for acidity. Most fish thrive at a neutral pH level of approximately 7. [7] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If the water is too acidic, you can buy a chemical neutralizer at most pet stores. [8] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Test for oxygenation to help ensure that the saturation exceeds 70%. [9] X Research source"
    },
    {
      "title": "Clean the tank and change the water.",
      "content": "Clean the tank and change the water. Goldfish produce a lot of waste and the tank water can quickly become dirty and filled with ammonia or bacteria and algae. Simply cleaning the tank and changing the water may help immediately save your fish. Put your goldfish in a separate tank while cleaning and replacing the water. You should clean the tank once a week to keep it from forming bacteria. Remove 15% of the water, all of the gravel, and any algae you find. Don’t use any chemicals in the water. Simply cleaning off gravel and any chemicals that have evaporated on the sides of the tank is sufficient. [10] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Small amounts of chemicals or soap can kill fish. Fill the tank with fresh, clean, and cold tap water. Add a dechlorinator to the new water to remove excess chlorine."
    },
    {
      "title": "Check your goldfish.",
      "content": "Check your goldfish. After you’ve cleaned the tank and changed the water, observe your goldfish for a few days to see if this measure revives him. This may help you pinpoint what was or is ailing your goldfish. [11] X Expert Source Doug Ludemann Professional Aquarist Expert Interview. 27 August 2019. You may see immediate results, such as if the tank didn’t have enough oxygen, or it may take a couple of days for your goldfish to adjust to the new tank and water. Wait a day or two before trying other treatments to help ensure that you don’t treat your goldfish for an illness it doesn’t have, possibly causing it harm."
    },
    {
      "title": "Identify symptoms of a dying goldfish.",
      "content": "Identify symptoms of a dying goldfish. There are many different symptoms of illness in goldfish. Identifying the symptoms properly and early can help you save your goldfish from dying. The best time to check for signs of disease or death is before feeding. Breathing disorders: look for symptoms such as gasping for air, rapid breathing, skimming the surface of the tank water, or lying at the bottom of the tank, which may indicate disease or poor quality water. Internal parasites: goldfish are naturally very hungry and if you notice that your fish isn’t eating or is losing weight, it might indicate internal parasites. Swim bladder disease: see if your fish is swimming erratically, upside down, or rubbing up against surfaces it may indicate everything from bladder disease to improper feeding. Fungal disease: if your goldfish exhibits symptoms such as folded or torn fins, discolored spots, lumps or bumps, protruding eyes, pale gills, or is bloated, these can be signs of fungal disease. Fin rot: this is one of the most common fungal diseases in fish and presents with symptoms such as milky white areas on the fins or tail and a ragged appearance of the fins."
    },
    {
      "title": "Look for symptoms in other fish.",
      "content": "Look for symptoms in other fish. Once you’ve identified symptoms of a dying goldfish, see if any other fish in the tank are suffering from similar signs. This may help you identify what the underlying cause of your goldfish’s illness is."
    },
    {
      "title": "Remove the filter and treat the water.",
      "content": "Remove the filter and treat the water. You can treat diseases such as fungal infections and tail rot by removing the tank filter properly and treating the water. This may help save your fish from dying. Remove the active carbon filters in the tank and use commercial treatments such as Maracyn-Two for fin rot or methylene blue for fungal infections. If you aren’t sure whether your fish has a fungal infection or tail rot, don’t use this treatment. Using chemicals to address a problem that doesn’t exist can seriously harm your goldfish."
    },
    {
      "title": "Treat the water with a heat and salt method.",
      "content": "Treat the water with a heat and salt method. If you notice that you fish have white spots on their bodies, they likely have a disease caused by ich parasites or they may also have anchor worms or lice. Using a heat and salt method can help treat the disease and save your goldfish. [12] X Research source Slowly raise the temperature of your aquarium to 86 degrees Fahrenheit (30 degrees Celsius) over a 48 hour period to stop the ich parasites from reproducing. [13] X Research source Keep the tank at this temperature for 10 days. [14] X Research source Add one tablespoon of aquarium salt for every 5 gallons (18.9 L) of water. [15] X Research source Change the tank water every couple of days. [16] X Research source Reduce the water temperature gradually back to 65 degrees Fahrenheit (18 degrees Celsius). [17] X Research source You may use the heat and salt method if there are healthy fish in the tank. This may also help remove single parasites that have infected healthy fish. [18] X Research source"
    },
    {
      "title": "Feed your fish veggies and low protein foods.",
      "content": "Feed your fish veggies and low protein foods. Some fish may have swim bladder disease that is not helped by changing the tank water. Feeding your fish veggies, such as frozen peas, and low protein food may help alleviate a swim bladder disease. Frozen peas are a good choice because they’re rich in fiber and they sink to the tank and your goldfish won’t have to search for it at the surface. Don’t overfeed your sick fish. Only give them new food when they’ve finished their last feeding. Not following this could cause an ammonia problem in the tank and make the fish even sicker."
    },
    {
      "title": "Excise parasites with tweezers.",
      "content": "Excise parasites with tweezers. If you notice your goldfish has parasites such as anchor worms, you may be able to excise the parasites with tweezers. Be sure to do this gently so that you don’t harm or kill your goldfish. Some parasites burrow deeply into fish. You may want to combine excision with killing off parasites with a commercial treatment. Make sure to grip the parasite as closely to the wound on your fish as possible to help ensure you remove the entire parasite. Place your goldfish in the water every minute or so he can catch his breath. It may take a few weeks for parasites to disappear from your tank. Only use this method if you’re sure your goldfish has worms or parasites and if you can handle them gently enough to not kill the fish."
    },
    {
      "title": "Use a commercial fish medication.",
      "content": "Use a commercial fish medication. If you’re not sure what is ailing your fish, try using a commercial fish medication to treat any illness. This may save your fish from any diseases or parasites. [19] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source You can get commercial fish medication at most pet stores and even some larger retail stores. Be aware that commercial fish medications are not regulated by government agencies, which means the treatments may be useless or could harm your fish. The best treatment is always being sure of the disease for which you’re treating. [20] X Research source"
    },
    {
      "title": "Take your fish to the vet.",
      "content": "Take your fish to the vet. You might find that home treatments don’t cure your fish. If this is the case, take the fish to the vet. He may be able to identify why your goldfish is showing the symptoms of dying and develop a treatment plan. Make sure to transport your fish in a plastic bag that is covered by a paper bag so that she doesn’t get stressed. Be aware that a vet might not be able to help your fish and that it might die even with vet care."
    },
    {
      "title": "Understand that prevention is the best medicine.",
      "content": "Understand that prevention is the best medicine. Preventing disease in your goldfish is the best way to save it from dying. From cleaning the tank regularly to feeding your goldfish a varied diet, taking proper care of your goldfish can help minimize the risk of death. [21] X Expert Source Doug Ludemann Professional Aquarist Expert Interview. 27 August 2019."
    },
    {
      "title": "Maintain water quality.",
      "content": "Maintain water quality. Keeping the water your goldfishes swim in clean is essential to keeping him alive. You need to not only make sure the water is the optimal temperature, but also that there is sufficient oxygen in the tank. [22] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Goldfish thrive in water temperatures between 50 and 78 degrees Fahrenheit. [23] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source The cooler the water is, the higher its oxygen content. Goldfish produce a lot of waste, which causes the level of ammonia to increase in the tank, which in turn increases the risk for disease or death. [24] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Test water every week to help ensure that the water quality is high. [25] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Clean the tank regularly.",
      "content": "Clean the tank regularly. If you clean your tank regularly, it will not only maintain the water quality, but will also remove any bacteria or algae that could endanger your goldfish’s life. [26] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Weekly cleanings can go a long way to preventing disease in fish. [27] X Expert Source Doug Ludemann Professional Aquarist Expert Interview. 27 August 2019. Change out several gallons of water every week to remove excess chemicals. [28] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Clean gravel and the sides of the tank from any algae or slime that may have developed. [29] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Prune any plants that have overgrown. [30] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Clean or replace the charcoal filter once a month. [31] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Make sure to not use any chemical or soaps to clean the tank, as these can kill your fish."
    },
    {
      "title": "Feed goldfish a varied diet.",
      "content": "Feed goldfish a varied diet. One of the best ways to prevent death in your goldfish is to feed him a balanced and varied diet. It’s equally important to not overfeed your goldfish, which can not only make the fish sick, but also affect the water quality. [32] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source You can feed your fish commercial fish foods, which come in dry flake form. These provide a balanced diet. [33] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Give your goldfish variety with foods such as peas, brine shrimp, bloodworms, and tubifex worms. [34] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source You can give your fish algae from the tank as a snack by allowing it to grow on one corner so the goldfish can nibble on it. [35] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Don’t overfeed your goldfish. They only need feeding once per day and any excess food will fall to the bottom of the tank and can spoil the water. [36] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source"
    },
    {
      "title": "Separate infected goldfish from healthy ones.",
      "content": "Separate infected goldfish from healthy ones. If only one or some of your goldfish are sick or on the brink of death, separate infected goldfish from the healthy ones. This can help prevent healthy fish from developing diseases or dying. It’s a good idea to have a so-called “hospital tank” for sick fish. Only return fish to a tank once they’re healthy."
    }
  ]
}