{
  "url": "https://www.wikihow.com/Measure-Pants-Size",
  "title": "How to Measure Your Waist For Pants & Find the Perfect Fit",
  "steps": [
    {
      "title": "Measure around your natural waist.",
      "content": "Measure around your natural waist. Wrap a soft measuring tape around the smallest part of your waist, laying the tape flat against your skin and parallel to the floor. Make sure the tape is snug but not too tight, and avoid sucking in your stomach. If you’re buying low-cut or high-waisted pants, measure your waist where the pants are supposed to sit. [1] X Research source For a more comfortable fit, put a finger between your body and the measuring tape. You can buy measuring tape at fabric stores, convenience stores, or department stores. If your measurement is in between two sizes, round up. For example, if you measure 34.5 inches, round up to 35 inches. For sizes measured in centimeters, round up to the nearest even number. For example, if you measure 51 cm, round up to 52 cm."
    },
    {
      "title": "Measure from your groin to your lower ankle to get your inseam.",
      "content": "Measure from your groin to your lower ankle to get your inseam. According to costume designer and wardrobe specialist Chloée Ohayon-Crosby, “the inseam is extremely important because it’s the length of your pants.” [2] X Expert Source Chloée Ohayon-Crosby Costume Designer & Wardrobe Specialist Expert Interview. 24 July 2020. To measure the inseam , place the measuring tape at the very top of your inner thigh, then measure down the inner leg seam until you reach the bottom of your ankle. [3] X Research source Be sure to take your shoes off and keep the measuring tape flat against your leg. If you’re having trouble, ask someone to help you, or lay a well-fitting pair of pants on a flat surface and measure from the crotch seam to the hemline."
    },
    {
      "title": "Convert your measurements to find your size.",
      "content": "Convert your measurements to find your size. Generally, your pants size will be your waist size followed by your inseam. [4] X Research source It will look something like “32 x 34,” which represents a waist measurement of 32” and an inseam measurement of 34”. Keep in mind that fabric can shrink after washing, especially with jeans and khakis. It's okay for pants to feel a little loose or look a little long when you first buy them."
    },
    {
      "title": "Try your pants on before you buy them.",
      "content": "Try your pants on before you buy them. Even if you think you have the right size, try your pants on in-store (if possible). They should feel snug, but not tight, around the waist and hit at the bottom of your ankle. [5] X Research source Reading the size on the label will usually get you close to the right pair, but sizes can vary slightly between brands and individual pairs. Trying them on is the most accurate way to determine if they fit. Finding the right size can take some trial and error. If the fit doesn't feel right, try sizing up or down."
    },
    {
      "title": "Measure your natural waist.",
      "content": "Measure your natural waist. Figure out the rise of your pants and where you want them to sit on your body. If you’re purchasing high-waisted pants, measure the narrowest part of your waist, underneath your rib cage and above your belly button. For low-rise pants, measure closer to your hips, right above your butt. [6] X Research source How tight the measuring tape corresponds to how your pants will fit. If you pull the tape tight, your pants will fit tight. For a more relaxed fit, put a finger between your body and the measuring tape."
    },
    {
      "title": "Take your inseam by measuring between your groin and ankle.",
      "content": "Take your inseam by measuring between your groin and ankle. The inseam refers to the length of the pants, and can change based on what kind of shoes you will wear. If you plan to wear flats , measure from the top of your inner thigh to just above where the shoe meets the ankle. If you’re wearing heels, put them on and measure from the top of your inner thigh to the middle of the heel shaft. [7] X Research source If you’re having trouble taking this measurement on yourself, lay a well-fitting pair of pants on a flat surface and measure from the crotch seam to the hemline."
    },
    {
      "title": "Convert your measurements into your size.",
      "content": "Convert your measurements into your size. Your size will vary depending on what country's size system you are shopping in and the clothing manufacturer. For example, a 26 inches (66 cm) waist is a standard US size 6, a UK size 10, or a French size 38. The best way to find your size in a particular brand is to compare your measurements to their size guide. Keep your measurements on hand in inches and centimeters, if you're not sure which system you'll need when shopping."
    },
    {
      "title": "Try on pants before you buy them.",
      "content": "Try on pants before you buy them. Sizes can vary, even when you're buying 2 pairs of pants from the same brand. It can take some trial and error to find the right fit. Don't be afraid to try a size up or down from your \"true\" size, and always refer to the brand’s specific measurement chart before buying pants online. [8] X Research source"
    }
  ]
}