{
  "url": "https://www.wikihow.com/Prove-Blackmail",
  "title": "How to Prove Blackmail",
  "steps": [
    {
      "title": "Check your state's law.",
      "content": "Check your state's law. While the basic elements of blackmail are generally the same nationwide, each state differs in how the crime is classified and the punishment for conviction. For example, some states such as Kansas treat blackmail as a crime against the person, similar to assault, while in others such as California blackmail is a type of theft. [2] X Research source Generally, a blackmailer attempts to coerce you into paying him money or doing something you wouldn't normally do by threatening to reveal harmful or damaging information that you've kept secret unless you comply with his demands. [3] X Research source A blackmailer also may threaten to harm you or someone you love unless you pay her money or do something for her. However, proving blackmail requires proof that the blackmailer's intent in threatening you was to get money or something else valuable that you otherwise would not give to him freely. [4] X Research source Some states recognize the threat itself as an independent crime, such that the blackmailer can be punished for threatening you, even if you have no proof that the purpose of the threat was to gain money or some other item of value from you. [5] X Research source Blackmail victims pay the money to avoid the threatened action. [6] X Research source However, keep in mind that paying a blackmailer off is no guarantee that he won't do whatever he was threatening to do anyway. Additionally, the blackmailer may come back in the future and ask for more money to continue to keep the information he has secret. [7] X Research source In some states the crime is called extortion if it involves the acts of a public official, while blackmail deals with private individuals. For example, if the mayor of a town in one of these states told you he would block your business's license unless you agreed to pay money to sponsor the city's baseball team, that would be extortion rather than blackmail. [8] X Research source [9] X Research source"
    },
    {
      "title": "Collect your information.",
      "content": "Collect your information. Before you file a police report, take a moment to compile the facts of your case and make copies of any correspondence or other recordings that might be used as evidence of the crime. You might consider writing a brief account of the events that took place or the facts involved in the blackmail. You can provide this statement to police. A single statement may come in handy particularly if you are contacting more than one law enforcement agency, because you can ensure that each agency has exactly the same information. Keep in mind that the prosecutor will have to prove the elements of the crime you've just researched. Any information that relates to one of those elements is potentially evidence that can be used against the person blackmailing you. [10] X Research source"
    },
    {
      "title": "Consider hiring an attorney.",
      "content": "Consider hiring an attorney. Especially if the information would be extremely damaging to you if revealed, you may need legal representation to protect your rights and interests. For example, if someone is threatening to turn you into police for a crime you didn't commit, you should consider hiring an attorney long before the person actually follows through with her threat. An experienced criminal defense attorney will be able to assess your case and advise you on the best way to proceed under the circumstances. He or she also can analyze the evidence you have and tell you whether it would be admissible in a court of law, as well as the probability of either arrest or conviction. [11] X Research source"
    },
    {
      "title": "Contact law enforcement.",
      "content": "Contact law enforcement. Although you can simply go to the police or sheriff's department nearest you, you may choose a different location depending on where the person blackmailing you lives. If interstate commerce is involved in the crime, it may be charged as a federal offense. In that case, you would want to contact the FBI. [12] X Research source For example, when hackers published a list of the registered users of a website for extra-marital affairs, blackmailers emailed them claiming they would send messages to the user's family and friends alerting them to the user's account unless the user paid them a certain sum in Bitcoins. [13] X Research source If someone is blackmailing you over the internet, you can file an internet crime complaint at https://www.ic3.gov/Home/ComplaintChoice/default.aspx . The Internet Crime Complaint Center will review your complaint and forward the information to the appropriate law enforcement agencies. [14] X Trustworthy Source Internet Crime Complaint Center Online reporting system for individuals to inform the FBI about Internet-related criminal activity Go to source"
    },
    {
      "title": "Provide information about the incident and the person who is blackmailing you.",
      "content": "Provide information about the incident and the person who is blackmailing you. Provide as much detail as possible along with copies of any correspondence you've received. To file criminal charges, the police must first have information sufficient to provide probable cause to arrest the person blackmailing you. [15] X Research source For this reason, it's important to include as many details as possible. Typically, you will need to provide information about yourself, including your name and address, as well as any similar information you know about your blackmailer. You also should relate all the details you can about the incident, including the blackmailer's statements or actions and your response. [16] X Trustworthy Source Internet Crime Complaint Center Online reporting system for individuals to inform the FBI about Internet-related criminal activity Go to source When the officer has finished taking your statement and completed the police report, make sure you get a copy for your records. Make note of the report or reference number in case you need to add or update information."
    },
    {
      "title": "Cooperate with any continuing investigation.",
      "content": "Cooperate with any continuing investigation. The investigating officer or prosecuting attorney may contact you if they have further questions, or if an arrest has been made. In some cases, criminal investigators may ask you to continue communication with the person blackmailing you or pretend to do what he wants so they have an opportunity to arrest the person. Keep in mind that even if the person is arrested, the prosecutor still has relatively broad discretion in deciding whether to file criminal charges. Typically prosecutors only file charges if they believe they can prove the suspect is guilty beyond a reasonable doubt. [17] X Research source"
    },
    {
      "title": "Consider getting a restraining order.",
      "content": "Consider getting a restraining order. If the person blackmailing you has physically harmed you or is threatening your safety, a restraining order can keep him or her away from you. Courts have forms available at the clerk's office that you can fill out to ask for a restraining order. You must include the name and location of the person as well as details about the threats he or she is making. [18] X Research source In many states you cannot get a restraining order unless you know or have a relationship with the person. However, a few states have a different order, typically called a civil harassment order, that you can request regardless of your relationship to the person. [19] X Research source When you go to the courthouse to fill out the forms to get a restraining order, you typically will be issued a temporary restraining order. That order will keep the person away from you and places you frequent such as your home or place of work until a hearing can be held for a permanent restraining order. [20] X Research source The person you want to have restrained must be served with the forms you filled out and filed with the court. Then there will be a hearing, when both you and the other person have the opportunity to present your cases. A judge will listen to both sides, consider the evidence, and decide whether to make your restraining order permanent. [21] X Research source"
    }
  ]
}