{
  "url": "https://www.wikihow.com/Put-Your-Legs-over-Your-Head",
  "title": "How to Put Your Legs over Your Head",
  "steps": [
    {
      "title": "Realize that it may take a long time to learn to put your legs above or over your head.",
      "content": "Realize that it may take a long time to learn to put your legs above or over your head. Some people may never be able to manage this due to a lack of flexibility, so a focus should begin with becoming more flexible . Also check with your doctor as to the suitability of trying to raise your legs above your head, especially if you have a heart condition, leg problems, blood pressure issues, etc."
    },
    {
      "title": "Warm up before doing these stretches.",
      "content": "Warm up before doing these stretches. A brisk walk around the house or some jumping jacks can be useful. Or, do a short dance, run on the spot or jump rope. [1] X Research source"
    },
    {
      "title": "Select a reasonably high item in your house that it is safe and okay to reach up to.",
      "content": "Select a reasonably high item in your house that it is safe and okay to reach up to. This might be a shelf, a chair/couch back, a window ledge, etc. Check that you can put your leg onto that with ease. This is not meant to be a hard height, it must be something that you can reach with ease for now. Place your foot onto the item and stretch the leg while doing so. Keep stretching while holding your leg on this height, keeping the stretch longer each time. Do this for each leg a few times a day for at least a week. This will improve your flexibility and increase your legs' strength."
    },
    {
      "title": "Switch it up.",
      "content": "Switch it up. When it doesn't hurt at all to this anymore, aim a little higher next. Find a slightly higher shelf or ledge and practice the same routine until it too becomes comfortable and easy. Then raise the level again until your legs are stretching really high with relative ease. Take care not to strain your legs. For now, keep resting them on a stable object of some kind. Even the wall is fine if you can't find anything higher to rest on."
    },
    {
      "title": "Allow yourself rest days if you feel you need it and if you aren't already quite flexible.",
      "content": "Allow yourself rest days if you feel you need it and if you aren't already quite flexible."
    },
    {
      "title": "Switch to lifting your legs without resting them on anything.",
      "content": "Switch to lifting your legs without resting them on anything. This is going to be harder as there is no longer a support, just your legs in the air. Work on lifting up one leg at a time, working on your balance when holding that leg in the air."
    },
    {
      "title": "Repeat the lifting without support as often as possible.",
      "content": "Repeat the lifting without support as often as possible. In time, it will become easier until you can do this without feeling as if you'll lose your balance or that it's too hard. Just be sure to give yourself a lot of time to achieve this, as it won't happen overnight for most people. It may take up to a year to be able to perfect this, so practice and patience are much needed to achieve success."
    },
    {
      "title": "Work on your flexibility.",
      "content": "Work on your flexibility. This exercise should only be tried when you are flexible. You may need to follow a regime of improving your flexibility first, otherwise you will find this exercise next to impossible."
    },
    {
      "title": "Place a mat on the floor where you intend to practice this exercise.",
      "content": "Place a mat on the floor where you intend to practice this exercise."
    },
    {
      "title": "Warm up your muscles first.",
      "content": "Warm up your muscles first. You can do this by jogging, doing jumping jacks or running on the spot for at least 10 minutes. [2] X Research source"
    },
    {
      "title": "Stand up and stretch for 15 seconds.",
      "content": "Stand up and stretch for 15 seconds."
    },
    {
      "title": "Sit down on the floor mat.",
      "content": "Sit down on the floor mat. Extend your right leg straight out in front of you. Gently stretch for 10 seconds. Switch over to do the same with your left leg. [3] X Trustworthy Source Arthritis Foundation Main organization devoted to arthritis support and education Go to source"
    },
    {
      "title": "Put both your legs straight out.",
      "content": "Put both your legs straight out. Stretch for 10 seconds."
    },
    {
      "title": "Put both of your hands on your toes and stretch for 15 seconds.",
      "content": "Put both of your hands on your toes and stretch for 15 seconds. At this point, you may find that it isn't happening as well as you'd like. That's fine––take all the time you need and keep working on this step until you get it."
    },
    {
      "title": "Separate both legs as widely as you can.",
      "content": "Separate both legs as widely as you can. Put both hands in the middle of your legs, and lean down. Stretch for 15 seconds."
    },
    {
      "title": "Bring both of your legs together.",
      "content": "Bring both of your legs together. Your legs should form a butterfly shape. [4] X Research source"
    },
    {
      "title": "Bounce both of your legs up and down for 20 seconds.",
      "content": "Bounce both of your legs up and down for 20 seconds. Do this gently."
    },
    {
      "title": "Bring both legs out straight.",
      "content": "Bring both legs out straight. Lean to the right for 20 seconds, then lean to the left for 20 seconds."
    },
    {
      "title": "Point your legs straight up in the air.",
      "content": "Point your legs straight up in the air. Have them above your head and keep them up for 30 seconds. You can choose to stop here if wished, as your legs are now over your head. Or, you can go one further with the next step."
    },
    {
      "title": "Try to bring your right leg back and over your head.",
      "content": "Try to bring your right leg back and over your head. When you have achieved this, then try to bring back your left leg as well. At this point, realize that this is exceptionally hard to do, so do not push it. It can take a very long time to do this successfully, perhaps even a year or two before it works for you. The second foot is harder to do than the first, because you have to get it beyond the first. Whichever leg is less flexible, do first."
    }
  ]
}