{
  "url": "https://www.wikihow.com/Pick-Your-Brain",
  "title": "What \"Pick Your Brain\" Means & Why Experts Say You Should Avoid It",
  "steps": [
    {
      "title": "“Pick your brain” means to ask someone for advice or insight.",
      "content": "“Pick your brain” means to ask someone for advice or insight. “Can I pick your brain?” is an idiomatic phrase that you use when you want to ask someone questions about something they’re very knowledgeable about. It signals to the person that you want to learn more about what they know, get advice about it, or ask for their opinions or ideas. [1] X Research source “Can I pick your brain about how to become a principal? I like teaching but I’m interested in pursuing this path, too.” “I’m thinking about selling my house. Can I pick your brain about how you decided to choose a realtor?” Note : You usually ask “Can I pick your brain?” in professional and academic settings to experts in a specific field (like marketing or writing). However, it’s also fine to use it in casual conversation."
    },
    {
      "title": "It is an overused phrase, so it can come off as vague, lazy, or rude.",
      "content": "It is an overused phrase, so it can come off as vague, lazy, or rude. While “Can I pick your brain?” is a common phrase in the professional world, many experts dislike being asked it because: [2] X Research source It is a generic and overused phrase, so it can seem thoughtless and impersonal, especially if there isn’t an existing relationship between the expert and the questioner. Experts often find the question too vague, as it’s unclear what the person is asking or wants from them. The expert doesn’t know if the questioner wants to interview them, get advice for their career, or learn about the expert’s job. It can seem lazy and as if the person hasn’t done any research on the topic. Instead, they’re asking the expert to do all the work for them. It can also come off as rude and self-serving. The questioner is asking for information or advice that only helps them without giving anything to the expert in return. So, it can seem dismissive of the expert’s time and seniority. The questioner might have ulterior motives. Instead of simply asking the expert questions and establishing a relationship, the questioner might secretly want a job referral."
    },
    {
      "title": "There are many professional alternatives to “pick your brain.”",
      "content": "There are many professional alternatives to “pick your brain.” Instead of using this canned response to ask for someone’s advice, insight, opinions, or ideas, use one of these alternative phrases: [3] X Research source “I’d love to get your advice. Can I ask you about…?” “I’d like to learn about your experience with... Are you available to speak with me about it?” “I could use your help in understanding... Specifically, I’d like to know about... Are you available to meet and chat about this?” “I have a few specific questions about... Do you have time to discuss them with me?” “Are you open to sharing more about…? I’m really interested in this topic and would love to know more about...” “Can I get your perspective on…? Specifically, I’m having trouble with… and I’d like your help.” “I’m interested in what you said about... Are you available to discuss it? I have a few questions about…” “I heard your idea about.... I’d love to meet to discuss it more if you’re free. I’m particularly curious about...” “Can I get your opinions on…? I have a few questions about… and your advice would be beneficial. Please let me know if you have time to discuss.” “I’m having trouble with... Your knowledge and experience would be helpful in understanding how to navigate this challenge. Would you be willing to help me come up with some solutions?”"
    },
    {
      "title": "Ask the person to clarify their questions if they’re unclear.",
      "content": "Ask the person to clarify their questions if they’re unclear. It can be hard to know how to help someone if they don’t make it clear what they want help with. If you’re not sure whether the questioner wants advice, insight, or feedback from you, simply reply back asking for clarification on what “picking your brain” entails. [4] X Research source Feel free to ask the questioner to send you back a list of specific questions they want to ask you. For example, in your reply you might say: Hello Brandon, Thank you for emailing me. I am happy to meet with you and talk about working in a history museum. So I can help you better, is there anything specific you want insight on or advice about?"
    },
    {
      "title": "Set boundaries on how much you’re willing to help and for how much.",
      "content": "Set boundaries on how much you’re willing to help and for how much. Life gets busy, so it’s perfectly okay to let the questioner know you only have a certain amount of time to spend on them. Your time is precious, so be upfront about when and how you’re available, as well as if you charge a fee for advising or consulting them. [5] X Research source For example, let the person know if you’re only available for 15 to 30-minute meetings and where you prefer to meet. Or, tell them that you only have time to chat over email. If your time is very limited but you still want to help, ask the questioner to send you their most pressing questions. Just be honest about how quickly you’ll be able to respond back. If you decide to charge a fee, be clear about how much you charge and whether it’s hourly or a flat fee. In your message, you might say something like: I am happy to meet with you and advise you about your marketing strategies. I currently charge a $30/hour fee. Please let me know if you’d like to set up a meeting."
    },
    {
      "title": "Offer to help in another way if you don’t have time to give advice.",
      "content": "Offer to help in another way if you don’t have time to give advice. For instance, send the questioner helpful resources, like websites, articles, or videos. Or, refer them to another colleague or expert in your field who you know has time to help. If you get “Can I pick your brain?” messages a lot, consider making a FAQ document to send out or offering monthly “office hours” over Zoom to answer quick questions from people. [6] X Research source For example, in your message you might say: Hello Laila, I appreciate you contacting me and your interest in my work. Unfortunately, my schedule is full until the end of the year, so I don’t have time to attend any more meanings. However, I have some resources that I hope can be helpful as you start your career in engineering—they are linked below. There is also an upcoming career panel that you might be interested in attending. I will be there and I’d love to connect. Best, Iris"
    },
    {
      "title": "Say, “No” if you don’t have time to help or don’t want to.",
      "content": "Say, “No” if you don’t have time to help or don’t want to. It’s perfectly acceptable to decline someone’s request to pick your brain, whether you’re too busy to help, don’t want to do it for free, or simply don’t have an interest. Just send a short, respectful, and polite message to let the person know that you’re saying “No.” [7] X Research source For example, in your message, you might say: Hello Lucas, Thank you for reaching out. I’m glad to hear you’re doing well and congratulations on starting grad school. I wish I could help, but unfortunately, my schedule is packed and I am unable to meet with you, or anyone else for that matter. Thank you again for thinking of me and I wish you the best of luck. Dr. Smith"
    },
    {
      "title": "Connect with the person before asking them for advice.",
      "content": "Connect with the person before asking them for advice. Asking a professional for advice is usually more well-received when you have an existing relationship with them. If you haven’t formally met the person you want advice from, ask a mutual connection to introduce you to them in person or over email. Or, network and introduce yourself to them. Just explain a little bit about what you do and ask about their line of work, too. [8] X Research source For instance, introduce yourself to the expert if they’re at a conference or job fair you’re attending. Or, send them an email or comment on a post they made on social media (like LinkedIn or X/Twitter)."
    },
    {
      "title": "Do research on what you want advice on.",
      "content": "Do research on what you want advice on. Before you ask for advice, learn more about the topic or subject you’re interested in. For instance, if you want advice on publishing a book, do research on the publishing process. [9] X Research source Also research the person you want to talk to. For instance, read articles they wrote or watch interviews they gave."
    },
    {
      "title": "Be specific and honest about what you want.",
      "content": "Be specific and honest about what you want. When you contact the expert for advice, be clear about what you want to learn from them. Do you want to conduct an informational interview and learn about their career path and how they got to their position? Or, do you want specific advice on how to navigate a challenge in your field? Being upfront and direct helps the expert help you better. [10] X Research source For example, you might write in your email: Hello Marie, I hope you are doing well. I am writing because I hope you can give me some insight about running a non-profit. I would love to set up an informational interview with you to learn about your experience as a director. Specifically, I’d like to know what skills and experiences you think are the most important in making you a successful non-profit director."
    },
    {
      "title": "Give the person the option to email you back.",
      "content": "Give the person the option to email you back. In your message, don’t assume that the expert has time to meet you in person, talk to you over Zoom, or take a phone call. Instead, let them know that they can email you back their answers if they don’t have room in their schedule. This lets them know that you’re aware their time is precious, which can make them more receptive to your email. [11] X Research source For example, you might write in your email: Please feel free to answer me back via email. I am also available to meet over Zoom or chat over the phone, if you prefer. Understand that professionals receive lots of messages asking for their advice, which doesn’t necessarily benefit their work. While it might seem polite to ask them to meet in person and offer to buy them a coffee, it can seem presumptuous that they’ll take time out of their busy schedule to meet with you."
    },
    {
      "title": "Be willing to pay or offer something in exchange for their help.",
      "content": "Be willing to pay or offer something in exchange for their help. Some professionals are happy to offer their advice for free, especially if you’re relatively close with them, while others might charge a fee for giving out their insight. Either way, it’s polite to give them something for their help. [12] X Research source For instance, if they don’t charge a fee, you might offer to help them with a task or provide your own expertise."
    },
    {
      "title": "Thank the person for their time and help.",
      "content": "Thank the person for their time and help. Express your appreciation for any advice the expert can give you in your initial message. If they decide to help you, respond back with gratitude for their advice and the time they spent helping you. Being thankful shows your respect for the expert and helps you build a stronger relationship. [13] X Research source Follow up with the expert to let them know how their insight helped you. They’ll appreciate knowing that you actually took their advice and used it to better your career. If the expert says they’re busy and don’t have time to help you, accept their response graciously. Simply thank them for considering your request and identify a new person to contact. If the expert is very busy, it’s possible that they won’t respond to your email. It’s okay to send a follow-up email after 1 to 2 weeks. Do not bother the expert for a response; instead look for another person to contact."
    }
  ]
}