{
  "url": "https://www.wikihow.com/Remove-a-Fluorescent-Light",
  "title": "How to Replace a Fluorescent Light Cover, Tube, or Fixture",
  "steps": [
    {
      "title": "Flip the light switch to turn off the power to the fluorescent light fixture.",
      "content": "Flip the light switch to turn off the power to the fluorescent light fixture. Wait a couple of minutes to let the light cover and tube cool down before attempting the handle either part. To provide maximum protection from electrocution, Lee recommends turning off the circuit to the light fixture as well as flipping the wall switch. [1] X Expert Source Allen Lee Home Improvement Specialist Expert Interview. 10 July 2020."
    },
    {
      "title": "Set up a fiberglass stepladder to help you reach the light fixture.",
      "content": "Set up a fiberglass stepladder to help you reach the light fixture. Avoid using a metal ladder, Lee cautions, as metal conducts electricity. A fiberglass ladder will help protect you from electrocution if anything goes wrong when you're working on the light fixture. [2] X Expert Source Allen Lee Home Improvement Specialist Expert Interview. 10 July 2020."
    },
    {
      "title": "Remove the light cover by unclipping or unscrewing it from its housing.",
      "content": "Remove the light cover by unclipping or unscrewing it from its housing. There are two main types for long, straight, fluorescent tubes: the wraparound and the drop ceiling panel. In most cases, you can easily remove each one without using any extra tools. A wraparound cover protrudes from the ceiling and encases the light tubes. To remove it, unhook the clips at either end (or, if it's secured with screws, use a screwdriver or drill to loosen and remove them). Next, gently push the cover away from you, and then pull the side nearest to you down. The other side should come loose easily. [3] X Research source A drop ceiling panel is held in place by clips on one side and swings down on a hinge. To unlock it, rotate the clips and then push upward gently on the unclipped side of the panel to loosen it. Let that side swing down and then lift the opposite side off its hinges to completely detach it. [4] X Research source"
    },
    {
      "title": "Twist the tube in any direction to loosen it from the fixture.",
      "content": "Twist the tube in any direction to loosen it from the fixture. Fluorescent tubes are secured by pairs of pins, which fit in slots in the light fixture. Rotating the tube will orient its pins vertically in the slots so you can remove it. [5] X Research source"
    },
    {
      "title": "Pull one end of the tube downward.",
      "content": "Pull one end of the tube downward. Lee recommends removing the tube by pulling one end down, after which the other end will slip free easily. Fluorescent tubes are long, so keeping a hold on them is tricky at times. Have a friend on hand to catch the tube once it is free. [6] X Expert Source Allen Lee Home Improvement Specialist Expert Interview. 10 July 2020."
    },
    {
      "title": "Install a new tube by aligning the pins in the fixture’s slots.",
      "content": "Install a new tube by aligning the pins in the fixture’s slots. Line the pins on the ends of the tube up with the slots in the fixture and slide them into place. Rotate the tube 90 degrees in either direction to lock it. [7] X Research source"
    },
    {
      "title": "Flip the circuit breaker to the room to shut the electricity off.",
      "content": "Flip the circuit breaker to the room to shut the electricity off. Locate the circuit breaker in your home and find the circuit for the room containing the light fixture. Then flip it into the \"off\" position. [8] X Research source"
    },
    {
      "title": "Remove the light cover and tubes.",
      "content": "Remove the light cover and tubes. The tubes and cover need to be out of the way so you can access the fixture’s internal components. Unclip and detach the cover and rotate the tubes until they slide out of their sockets. Then set them aside (or safely discard them if you're not going to use them again) [9] X Research source"
    },
    {
      "title": "Remove the cover holding the wires in place.",
      "content": "Remove the cover holding the wires in place. This cover sits between the tubes and the ballast (the fixture's ceiling mount) and is typically made of metal. To remove it, grab onto it and tug it down. If it doesn’t come loose right away, pry at different spots around the cover’s edge until it snaps off the fixture. [10] X Research source Some covers have a twistable wingnut holding them in place. Turn the wingnut counterclockwise until you're able to pull the cover down."
    },
    {
      "title": "Test the wires with a voltage detector before touching them.",
      "content": "Test the wires with a voltage detector before touching them. To use a voltage detector , touch the detector’s tip to the wire. It will light up if it detects an electrical current. Some detectors, similar to multimeters , have colored leads you press to the exposed metal ends of the wires to test the current. [11] X Research source If the detector indicates an active current, go back and check the circuit for that room in your home to make sure it's off. Someone in the household may have turned it back on or you may not have disengaged it. Testing the voltage may seem like an unnecessary step if you've already shut the breaker off, but Lee recommends it to ensure your safety. You can never be too careful around electricity! [12] X Expert Source Allen Lee Home Improvement Specialist Expert Interview. 10 July 2020."
    },
    {
      "title": "Unscrew the wire caps holding the wires together.",
      "content": "Unscrew the wire caps holding the wires together. Upon removing the cover, you will see a bundle of wires held together by plastic caps. Twist the caps counterclockwise. They come off the wires easily. Then, separate the wires connecting the light fixture from the wires attached to your home’s electrical circuit. [13] X Research source Screw the caps back onto the individual wires extending from the ceiling. This will prevent them from sparking when you turn the electricity back on."
    },
    {
      "title": "Remove the screw holding the ground wire in place.",
      "content": "Remove the screw holding the ground wire in place. Look for a plain metal screw securing a single wire to the fixture’s base. The wire is usually green or copper-colored. Turn the screw counterclockwise with a Phillips head screwdriver to remove it. [14] X Research source The ground wire distributes electricity in the circuit, preventing electrical shocks when you touch the wires."
    },
    {
      "title": "Unscrew the lag bolts holding the ballast to the ceiling.",
      "content": "Unscrew the lag bolts holding the ballast to the ceiling. Hold on to the ballast with one hand and use a screwdriver or a drill to turn the bolts counterclockwise. After loosening the screws, lower the ballast slightly and then gently pull the ceiling wires out of the holes on the top. Once this is done, the fluorescent light fixture will be completely detached. [15] X Research source Have someone else hold the fixture as you loosen the screws, if possible. That way, you have both hands free to work on the screws. If the fixture is stuck, you may need to cut into the drywall a little bit. Use a sharp utility knife to make small cuts until you can get the bolts out of the ceiling without ripping it out and causing more damage."
    },
    {
      "title": "Choose a ceiling box to hold the weight of your new light fixture.",
      "content": "Choose a ceiling box to hold the weight of your new light fixture. An \"old work\" ceiling box typically holds up to 6 lb (2.7 kg), so for heavier fixtures – like a ceiling fan – opt for a ceiling box attached to a steel extendable brace. [16] X Research source Most braces extend up to 24 in (61 cm) to span the distance between joists and provide a sturdy base for the new fixture to hang from."
    },
    {
      "title": "Widen the hole in the ceiling where the wires are to fit the ceiling box.",
      "content": "Widen the hole in the ceiling where the wires are to fit the ceiling box. To do that, hold the ceiling box you selected up to the hole and trace around it with a pencil. Then, cut out the circle you drew with a sharp utility knife. [17] X Research source"
    },
    {
      "title": "Install the ceiling box in the big hole you cut in the ceiling.",
      "content": "Install the ceiling box in the big hole you cut in the ceiling. To install an \"old work\" box, simply insert it in the hole and tighten the screws with a screwdriver or a drill to activate the swing clips that grip the drywall. [18] X Research source And you're done! If you need to install a ceiling box with a brace , follow these steps: After you remove the fluorescent light ballast, you'll see a hole in the ceiling with a bundle of wires dangling out of it. Buy a boroscope and feed it up into that hole and use its camera to locate the joists that frame the ceiling and hold up the drywall. Additionally, find out where the wires are stapled to the joists. [19] X Research source Look at the ceiling box. It should be attached to a bracket, which in turn attaches to the brace. Remove the screws and nuts holding the ceiling box to the bracket to separate them, then pull the bracket off the brace. [20] X Research source Punch 2 precut holes out of the bottom of the ceiling box with a mallet or small hammer and tug the cut-out metal off with a pair of pliers. The ceiling wires will dangle through these openings. [21] X Research source Slip the brace into the hole and rotate it to extend it until it meets resistance. When it's snug in place, stop rotating it. Use your boroscope to see whether the brace ends are piercing or pushing against the wires stapled to the joists. If they are, adjust the brace to sit above or behind those wires. [22] X Research source Push the bracket back onto the brace, then feed the wires through the holes you punched out in the ceiling box. Next, align the box with the screws on the bracket and twist the nuts onto the screws to secure the box and bracket back together. [23] X Research source"
    },
    {
      "title": "Install the new light fixture by following the steps in the manual.",
      "content": "Install the new light fixture by following the steps in the manual. With the appropriate ceiling box in place, you can install a new light fixture or a ceiling fan . Remember to keep the electricity turned off during the installation process and only restore power when the fixture is fully assembled."
    }
  ]
}