{
  "url": "https://www.wikihow.com/Replace-RV-Ceiling-Fabric",
  "title": "How to Replace RV Ceiling Fabric",
  "steps": [
    {
      "title": "Measure the interior ceiling of your RV to determine headliner size.",
      "content": "Measure the interior ceiling of your RV to determine headliner size. Always purchase headliner that is 2 to 3 inches (5.1 to 7.6 cm) bigger than the size of your ceiling. If the headliner your purchase is too big, you always have the option of cutting it down. [1] X Research source If you remove your old headliner intact, measure its length and width, and use these measurements as a guide while shopping."
    },
    {
      "title": "Purchase 1⁄4 inch (0.64 cm) headliner foam if you can afford it.",
      "content": "Purchase 1 ⁄ 4 inch (0.64 cm) headliner foam if you can afford it. This is the most durable headliner material and will last the longest. The other option is 1 ⁄ 8 inch (0.32 cm), which still works—it's just thinner and more susceptible to deterioration over time. Choose natural or lighter colors, such as beige. These won't fade over time as much as brighter colors."
    },
    {
      "title": "Remove all items that prevent fabric removal to make the process easier.",
      "content": "Remove all items that prevent fabric removal to make the process easier. Focus on things like 12-volt DC ceiling lights, headliner trim moldings, and the TV antenna crank. They can typically be removed using a screwdriver. [2] X Research source You can also remove the roof air-conditioner box and mounting plate. However, bigger items like this can be skipped if you cut a hole in your new fabric to accommodate them before applying the headliner."
    },
    {
      "title": "Locate appliances and accessories and measure their distance to the walls.",
      "content": "Locate appliances and accessories and measure their distance to the walls. Any accessories and appliances that you don't remove need special holes cut within the RV fabric to accommodate them. Take measurements from the sides of these appliances to the walls at opposing sides of the accessories so you can determine where to cut holes, and how big they should be. You can easily cut smaller appliance holes as you apply your headliner. Do whatever feels more comfortable for you—if you're a bit pickier when it comes to planning everything out, go with measurements. If you prefer to do things as you go, accommodate your fixtures as you apply the fabric."
    },
    {
      "title": "Insert a putty knife 1⁄2 inch (1.3 cm) into the seam.",
      "content": "Insert a putty knife 1 ⁄ 2 inch (1.3 cm) into the seam. Try to find a seam at the edge of your RV ceiling, or horizontally across the ceiling. Drag the putty knife along the seam to gently undo the fabric. If you can't find a seam, use a hobby knife to create a horizontal cut along the ceiling. [3] X Research source Most fabric is attached to foam backing, so you will need to cut deep enough to remove the foam from the ceiling. Never reuse old foam—this is next to impossible because the foam oxidizes over time, which turns it yellow and decreases its durability."
    },
    {
      "title": "Tear the fabric and foam from the ceiling using your hands and knife.",
      "content": "Tear the fabric and foam from the ceiling using your hands and knife. You can gently pull most of the fabric and its foam backing from the ceiling with your hands. If you're having trouble with tougher spots, use your putty or hobby knife to cut the backing free from the roof. Pry off any trim holding the headliner in place as you go."
    },
    {
      "title": "Scrape off any leftover foam stuck to the ceiling using a bristle brush.",
      "content": "Scrape off any leftover foam stuck to the ceiling using a bristle brush. Gently scrub the ceiling and try not to damage it. Denting the ceiling will make it harder for it to adhere to your new headliner. It also doesn't look visually appealing. You can also use coarse sandpaper (40- to 60-grit) instead of a bristle brush to remove foam and dried glue."
    },
    {
      "title": "Clean your RV's ceiling before gluing your new headliner in place.",
      "content": "Clean your RV's ceiling before gluing your new headliner in place. Apply general purpose adhesive cleaner to a dry cloth and wipe down the surface of your RV's ceiling. Wait 5 minutes for the cleaner to dry before applying any adhesive. [4] X Research source Use a separate dry cloth (without cleaner) to give the ceiling one last wipe before moving forward. General purpose adhesive cleaners can be purchased from big-box stores, hardware stores, and online marketplaces."
    },
    {
      "title": "Spray the ceiling horizontally with general trim adhesive on \"Heavy.",
      "content": "Spray the ceiling horizontally with general trim adhesive on \"Heavy. \" Turn the can's nozzle to \"Heavy.\" Start making horizontal spray lines across the entire surface of the ceiling. Start from the south end of the ceiling and alternate between making left and right horizontal sprays 2 to 3 feet (0.61 to 0.91 m) in length. [5] X Research source Adhesive spray cans have the letters \"L,\" \"M,\" and \"H\" on the tip of the can, which stand for \"Light,\" \"Medium,\" and \"Heavy,\" respectively. If the spray is applying too thick, try switching to \"M.\" Always purchase heat resistant glues when you can, especially if you travel often during hot weather."
    },
    {
      "title": "Spray the ceiling vertically with your general trim adhesive.",
      "content": "Spray the ceiling vertically with your general trim adhesive. Make your way back to the south end of the ceiling where you began applying vertical sprays. Keep the setting on \"Heavystart\" making horizontal sprays about about 2 to 3 feet (0.61 to 0.91 m) in length. Fill in smaller spots that you miss will small spurts of spray as you go."
    },
    {
      "title": "Lay your foam-backed headliner face down and spray adhesive onto it.",
      "content": "Lay your foam-backed headliner face down and spray adhesive onto it. Just like the ceiling glue application process, begin by making horizontal spray lines across the headliner and then move to vertical lines. Don't worry about spraying regions that are going to be removed during or after application. [6] X Research source Turn your spray can to \"M\" if the cleaner is applying to thick. Even \"L\" might be sufficient if you're using 1 ⁄ 8 inch (0.32 cm) headliner."
    },
    {
      "title": "Apply the headliner to one corner of your RV.",
      "content": "Apply the headliner to one corner of your RV. Use your palms or fists to apply pressure along the edge of the headliner closest to the corner and move vertically down the RV until you reach the opposing corner. Press it in place as you go and take care to smooth out wrinkles and folds. [7] X Research source If you have a friend that can help, have them hold the loose portion of the fabric as you install the first corner. This is a huge help and makes the process much easier. If you're not happy with any parts of the application process or notice bubbling, peel back the fabric as soon as possible and reapply it. This won't affect the foam or glue if it's done within 1 to 3 minutes of glue application."
    },
    {
      "title": "Apply the headliner horizontally across the ceiling.",
      "content": "Apply the headliner horizontally across the ceiling. Continue applying pressure as you apply the headliner to the other side of the RV's ceiling. If you have help, have your partner hold up the headliner that hasn't been applied yet—this makes it easier to avoid air bubbles and creases. If you make a mistake, tear the headliner back immediately and reapply. If you work fast enough, you don't have to worry about the headliner adhering to the ceiling right away."
    },
    {
      "title": "Cut openings for lighting wiring if you haven't done so.",
      "content": "Cut openings for lighting wiring if you haven't done so. The adhesive glue won't dry right away, giving you enough time cut openings for any wiring as you go. If you don't have enough time and are worried the glue has dried, you can always wait until the whole headliner is applied—it will just take a bit more effort. [8] X Research source"
    },
    {
      "title": "Trim your fabric to size by removing any excess parts.",
      "content": "Trim your fabric to size by removing any excess parts. Use your hobby knife to remove the excess headliner pieces hanging from the walls. Quick-change knives are ideal since you can easily change blades as needed—continuously cutting foam can quickly dull the blade. If you use scissors, make sure the outer edge is next to the surface that's to be flushed to the wall. [9] X Research source"
    },
    {
      "title": "Replace any accessories and appliances that you removed.",
      "content": "Replace any accessories and appliances that you removed. Now, you can replace anything that you removed prior to removing your headliner. Most of these appliances can be reinstalled using a screwdriver. [10] X Research source If you forgot to cut holes for any items, use your hobby knife and putty knife to cut openings in the new headliner and peel off a space for the accessory, respectively."
    }
  ]
}