{
  "url": "https://www.wikihow.com/Receive-a-Refund-on-Prepaid-Credit-Cards",
  "title": "How to Receive a Refund on Prepaid Credit Cards",
  "steps": [
    {
      "title": "Determine the refund policy set by the company that issued the card.",
      "content": "Determine the refund policy set by the company that issued the card. The company that issued the card can ultimately set the rules and stipulations concerning refunds. However, most prepaid credit cards—including those issued by Visa and MasterCard (meaning nearly all of them)—are treated just like regular credit cards. [2] X Research source This means that you can receive a refund by returning the item as you would when you paid with cash or a debit card. You can check the website of the company that issued the card, or you can also call their customer service line if you’d prefer to speak to someone in person. The card's policy for refunds may be in the information that came with the card as well (if you still have it)."
    },
    {
      "title": "Determine the refund policy for the establishment where you made the purchase.",
      "content": "Determine the refund policy for the establishment where you made the purchase. Much like the company that issued the credit card can determine its own refund policies, the store from which you bought the item or service can determine its own return/refund policies. For instance, if you purchased something “as is” or you’ve waited longer than the posted refund period for a service, the store can lawfully refuse your refund. Contact the store before going in to ensure that you can receive a refund for the item or service. Check your receipt. The return or refund period for the purchase (and other conditions for a refund) is often listed at the bottom of a receipt. If you’re outside of the refund window, you can often speak to a supervisor or manager to try to receive an exception. For tangible items, the manager may still have the authority to accept the return if it’s in good condition. For services, the manager may still issue a refund if you can demonstrate why you were dissatisfied. Take notes while talking to the manager if he or she has offered to make an exception in your case. Include the manager’s name, the date, etc. as documentation in case he or she isn’t there when you return for the actual refund."
    },
    {
      "title": "Collect everything you’ll need.",
      "content": "Collect everything you’ll need. After you verify that you can receive a refund, you’ll need to collect several things before returning to the business where you made the purchase. If applicable, place the item in its original packaging (if you opened it at all). You’ll also need to bring the prepaid credit card (so the store can run it for the refund), the receipt (so they know you actually made the purchase there), and a photo identification (so the store employee can confirm that the prepaid card is yours). [3] X Research source If you no longer have the receipt, you can also try requesting a report of the card’s activity from the issuing company to show the store manager that you did indeed make the purchase at the location on the specified date. Without any proof that you made a purchase at the respective store, they may refuse the refund, or they may only refund for store credit depending on their return policy. If you want a refund for a service, then bring any other supporting documentation to show why you were dissatisfied. If a lawn care provider poorly pruned a tree, then take pictures, for instance."
    },
    {
      "title": "Go to the store for the refund.",
      "content": "Go to the store for the refund. Take everything you need with you down to the store and ask for the refund. Most refunds for actual items are processed through a customer service desk near the store entrance rather than through one of the checkout stations. Provide everything to the customer service representative and ask for the refund. The employee may also ask for your phone number or a signature on a return receipt. Make sure to retain a copy of the original receipt if there are other purchases on it that you have not returned."
    },
    {
      "title": "Ask for an estimate on the refund date.",
      "content": "Ask for an estimate on the refund date. The refund can take several days to clear. The company that issued the prepaid credit card will have either a website or a phone number that you can use to verify the balance on the card. [4] X Research source Check the balance often to ensure that you receive the refund within seven business days. [5] X Research source"
    },
    {
      "title": "Contact the respective company after seven business days.",
      "content": "Contact the respective company after seven business days. If you don’t receive the refund within seven business days, call the customer service department for the company where you were supposed to receive the refund. This department can usually verify whether or not the refund has cleared. If it has, but you haven’t received the funds, then contact the company that issued the card. Keep a record of each of these interactions, including the names of the people to whom you spoke."
    },
    {
      "title": "Verify the return/refund policies associated with the purchase.",
      "content": "Verify the return/refund policies associated with the purchase. As with in-store purchases, you must first verify the refund policy set by the company that issued the prepaid credit card. For most prepaid credit cards, including all Visa and MasterCard prepaid credit cards, you can simply return the item as though you’d made the purchase with a regular credit card. [6] X Research source This also includes confirming that you can receive a refund based on the refund policy for the website where you purchased the item or service."
    },
    {
      "title": "Contact the company’s customer service department.",
      "content": "Contact the company’s customer service department. Either by phone or through the website, contact the company’s customer service department if you wish to receive a refund due to poor service, being overcharged for the service, or another refund that’s not related to an actual return. For example, say you purchased a basic tier of cloud storage and the company charged you for the expanded storage package. Since you don’t have an actual item to return, you’ll have to contact customer service (they may forward you to a billing department) to initiate the refund. Have any documentation ready—such as the email you received when you completed the purchase—to prove you were incorrectly charged. You may also have to contact the company’s customer service department relating to tangible items that you purchased if you have questions about returning the item outside the return window, for instance."
    },
    {
      "title": "Set up the return with the company if applicable.",
      "content": "Set up the return with the company if applicable. Many larger retailers have online return centers through which you can set up your return if you want a refund on an actual item. Login to the account from which you made the purchase, find the return option for the appropriate item, and process it as a return. The retailer may even include a printable return shipping label for the item. For smaller online retailers, you’ll likely have to call and speak to a customer service representative who can set up the return for you. In this case, you’ll likely need to have the card available to confirm the number on it. [7] X Research source The person may email you a printable return shipping label, or you may simply be given a return address to which you must send the item. It’s entirely up to the company whether or not they pay all (or even a portion) of the return shipping costs. You may or may not be responsible for these. If you are responsible, then the company will remove the amount from your refund before issuing it."
    },
    {
      "title": "Return the item if applicable.",
      "content": "Return the item if applicable. Once you have set up the return, repackaged the item (if necessary), and affixed the new shipping label, you can simply drop it off for return. Most major online retailers will provide return labels for UPS or FedEx. Ensure that you get the receipt when you drop off the package. It will include a tracking number for the return, so you can provide proof of the returned item. [8] X Research source [9] X Research source"
    },
    {
      "title": "Check for your refund.",
      "content": "Check for your refund. Most online companies will send you an email with the refunded amount once they receive the item (if applicable) or process the refund in their system. The company that issued your prepaid credit card will provide either a website or a phone number that you can use to check the balance on the card. [10] X Research source Check the balance on your card to make sure that you receive the refund within seven business days of the company confirming that they received the item. [11] X Research source"
    },
    {
      "title": "Contact the card issuer after more than seven business days.",
      "content": "Contact the card issuer after more than seven business days. If you haven’t received your refund within seven business days, contact the retailer to ensure that they have issued the refund. If they have refunded your purchase amount, then contact the company that issued the prepaid credit card to find out why the funds haven’t been dispersed. Take notes every time you speak to someone when looking into why the money hasn’t been refunded. Keep records of all the emails you received as well, including the email you can show the card issuer proving that the retailer received the return shipment and issued the refund."
    }
  ]
}