{
  "url": "https://www.wikihow.com/Run-an-EXE-File-From-Command-Prompt",
  "title": "How to Run an EXE File at the Windows Command Prompt",
  "steps": [
    {
      "title": "Find the file path",
      "content": "Find the file path of the folder containing your exe program. Open the folder containing your program in a File Explorer window, and copy or note the file path from the address bar at the top of the window."
    },
    {
      "title": "Open your computer's Start menu.",
      "content": "Open your computer's Start menu. Click the Start button in the lower-left corner of your desktop to open your Start menu. [1] X Research source"
    },
    {
      "title": "Type and search cmd on the Start menu.",
      "content": "Type and search cmd on the Start menu. Command Prompt should show up at the top of the search results."
    },
    {
      "title": "Click Command Prompt on the Start menu.",
      "content": "Click Command Prompt on the Start menu. This will open a new Command Prompt window. [2] X Research source For example, if you're trying to run Mozilla Firefox , the exe file you want to run may be located in a folder called Mozilla Firefox in Program Files on your C drive. In this case, your file path is C:\\Program Files\\Mozilla Firefox ."
    },
    {
      "title": "Type cd [filepath] in the command with your program's file path.",
      "content": "Type cd [filepath] in the command with your program's file path. Replace [filepath] with the actual path to folder that contains the EXE program you want to run. [3] X Research source For example, if you're trying to run Mozilla Firefox, your command here may look like cd C:\\Program Files\\Mozilla Firefox ."
    },
    {
      "title": "Hit ↵ Enter or ⏎ Return on your keyboard.",
      "content": "Hit ↵ Enter or ⏎ Return on your keyboard. This will navigate you into the selected file path in Command Prompt. [4] X Research source"
    },
    {
      "title": "Type start [filename.exe] into Command Prompt.",
      "content": "Type start [filename.exe] into Command Prompt. Replace [filename.exe] with your program's name. This should exactly match your exe program's file name in the folder. [5] X Research source For example, if you're running Mozilla Firefox, the program file should be named firefox.exe by default. In this case, your command will look like start firefox.exe ."
    },
    {
      "title": "Hit ↵ Enter or ⏎ Return on your keyboard.",
      "content": "Hit ↵ Enter or ⏎ Return on your keyboard. This will run the selected program on your computer."
    }
  ]
}