{
  "url": "https://www.wikihow.com/Program-a-Direct-TV-Remote-Control",
  "title": "How to Program a Direct TV Remote Control",
  "steps": [
    {
      "title": "Find your TV's model number.",
      "content": "Find your TV's model number. You'll usually find the model \"number\", which is actually a string of digits and letters, on the back of the TV."
    },
    {
      "title": "Open AT&T's DirecTV remote page.",
      "content": "Open AT&T's DirecTV remote page. Go to https://www.directv.com/support/article/000092856 in your browser. This will bring up a list of current DirecTV remote models. If you'd rather program your remote automatically, skip ahead to the third part. If you have a Genie remote (models RC-73, RC-72, RC-71B, and RC-71), skip ahead to programming a Genie remote instead."
    },
    {
      "title": "Check your remote's model.",
      "content": "Check your remote's model. You'll find your remote's model number listed in the top-left corner of the remote's surface. You only need to know the first two numbers that come after \"RC\" here. For example, your remote might say \"RC66XR\" here, but you only need to know that it's the RC66 model."
    },
    {
      "title": "Click your remote's model number.",
      "content": "Click your remote's model number. On the left side of AT&T's remote page, click the link that corresponds with your remote model."
    },
    {
      "title": "Select a component.",
      "content": "Select a component. Click Add New on the tab that names the item for which you want to program the DirecTV remote (in most cases, this will be the TV). For example, if you're programming your remote for a speaker system, you would click Add New on the \"Audio\" tab."
    },
    {
      "title": "Enter your TV's brand name.",
      "content": "Enter your TV's brand name. In the \"Brand\" text field, type in the manufacturer for your TV."
    },
    {
      "title": "Select the correct TV brand.",
      "content": "Select the correct TV brand. Below the text box, click the resulting TV brand that matches your TV's brand."
    },
    {
      "title": "Scroll down and click Enter my model number.",
      "content": "Scroll down and click Enter my model number . It's at the bottom of the page."
    },
    {
      "title": "Enter your TV's model number.",
      "content": "Enter your TV's model number. Type the model number of your TV into the text box at the top of the page, then press ↵ Enter ."
    },
    {
      "title": "Write down the codes that appear.",
      "content": "Write down the codes that appear. The DirecTV site will give you a series of codes that work for the specified manufacturer for most DirecTV users; write down the codes so that you can try them later. If no codes appears here, your remote cannot be connected to your searched TV or component. You may only see one code appear."
    },
    {
      "title": "Review more codes.",
      "content": "Review more codes. Click More at the bottom of the code list, then write down any further codes that appear. Once you've exhausted the number of codes that are available, you can proceed with programming your remote via the code. You can keep clicking More until AT&T alerts you that there are no more codes that will work for your manufacturer."
    },
    {
      "title": "Change your remote's switch to the \"TV\" position.",
      "content": "Change your remote's switch to the \"TV\" position. On most DirecTV remotes, you'll find a switch near the top; push this switch over so that it sits next to the \"TV\" label. If you want to program your remote for a component other than your TV, change the switch to one of the \"AV\" positions instead. If your remote is a Genie remote (models RC-73, RC-72, RC-71B, and RC-71), skip ahead to programming a Genie remote instead."
    },
    {
      "title": "Locate the SELECT and MUTE buttons.",
      "content": "Locate the SELECT and MUTE buttons. The SELECT button is usually in the middle of the remote, while the MUTE button is usually in the lower-left side of the remote."
    },
    {
      "title": "Press and hold SELECT and MUTE.",
      "content": "Press and hold SELECT and MUTE . Do so at the same time, and don't release them until prompted."
    },
    {
      "title": "Wait for the green light to flash twice.",
      "content": "Wait for the green light to flash twice. Once your remote is in program mode, you'll see a green light at the top of the remote flash twice in a row."
    },
    {
      "title": "Release the buttons.",
      "content": "Release the buttons. You can now program your remote."
    },
    {
      "title": "Enter your code.",
      "content": "Enter your code. Using the remote's number pad, type in the code that you wrote down earlier."
    },
    {
      "title": "Look for two green flashes.",
      "content": "Look for two green flashes. If you see the green light flash twice, your remote should be programmed for the TV."
    },
    {
      "title": "Try turning on your TV.",
      "content": "Try turning on your TV. Press the remote's \"Power\" button to see if the code that you used works with your TV. If your TV turns on, you have successfully programmed your DirecTV remote. If you programmed the remote for a component instead, manually turn on your TV and then test the component. If your TV or component doesn't respond to the remote, try programming the remote automatically instead."
    },
    {
      "title": "Make sure that your remote is a universal model.",
      "content": "Make sure that your remote is a universal model. Remote model numbers RC-66, RC-65, RC-64, RC-32 (or RC-32RF), RC-24, and RC-23 are all universal remotes. These are usually grey, rectangular remotes."
    },
    {
      "title": "Turn on your TV.",
      "content": "Turn on your TV. Press the TV's \"Power\" button, or use the TV's original remote to turn it on. If your DirecTV box isn't hooked up to the TV or a power source, make sure that it's plugged in as well."
    },
    {
      "title": "Change your remote's switch to the \"TV\" option.",
      "content": "Change your remote's switch to the \"TV\" option. On most DirecTV remotes, you'll find a switch near the top; push this switch over so that it sits next to the \"TV\" label. If you want to program your remote for a component other than your TV, change the switch to one of the \"AV\" positions instead."
    },
    {
      "title": "Press the MENU button.",
      "content": "Press the MENU button. For most remotes, you'll find this button near the top of the remote. You should see a menu pop up on your TV."
    },
    {
      "title": "Select Settings & Help.",
      "content": "Select Settings & Help . Use the arrows on the remote to highlight this option, then press SELECT in the middle of the remote to select it. [1] X Research source"
    },
    {
      "title": "Select Settings.",
      "content": "Select Settings . It should be in the middle of the screen. For an SD receiver or DVR, select System Setup here."
    },
    {
      "title": "Select Remote Control.",
      "content": "Select Remote Control . Doing so will open the Remote Control menu. Select Remote or Remote Control for an SD receiver or DVR."
    },
    {
      "title": "Select Program Remote.",
      "content": "Select Program Remote . This will open the programming menu, which should list each component (TV, audio, DVD, etc.) item that you have available for programming."
    },
    {
      "title": "Select an item.",
      "content": "Select an item. You'll usually select the TV option here, but if you want to set up your TV's audio component or a DVD player, select the appropriate option instead."
    },
    {
      "title": "Follow the on-screen instructions.",
      "content": "Follow the on-screen instructions. These instructions will vary depending on your available components. Once you've finished the on-screen setup, your remote should be programmed for your TV or component."
    },
    {
      "title": "Turn on your TV.",
      "content": "Turn on your TV. Press the TV's \"Power\" button, or use the TV's original remote to turn it on. If your DirecTV box isn't hooked up to the TV or a power source, make sure that it's plugged in as well."
    },
    {
      "title": "Point your Genie remote at its receiver.",
      "content": "Point your Genie remote at its receiver. This receiver should be either the Genie HD DVR, the Genie Mini, or the Wireless Genie Mini."
    },
    {
      "title": "Press and hold the MUTE and ENTER buttons.",
      "content": "Press and hold the MUTE and ENTER buttons. MUTE is usually in the lower-left side of the Genie remote's black section, while you'll find ENTER in the bottom-right corner of the remote. Don't release these until prompted."
    },
    {
      "title": "Wait for two green flashes.",
      "content": "Wait for two green flashes. The light at the top of the remote will blink twice, at which point you can release the buttons. Your TV will display the phrase \"Applying IR/RF setup\" at this point."
    },
    {
      "title": "Press the MENU button.",
      "content": "Press the MENU button. This will open the on-screen menu."
    },
    {
      "title": "Select Settings & Help.",
      "content": "Select Settings & Help . Use the arrows on the remote to highlight this option, then press SELECT in the middle of the remote to select it. [2] X Research source"
    },
    {
      "title": "Select Settings.",
      "content": "Select Settings . Doing so opens the Settings menu."
    },
    {
      "title": "Select Remote Control.",
      "content": "Select Remote Control . This will open your remote control's menu."
    },
    {
      "title": "Select Program Remote.",
      "content": "Select Program Remote . It's in the pop-up menu. You should see a menu with a list of the available components (TV, audio, DVD, etc.) that you have available for programming."
    },
    {
      "title": "Select an item.",
      "content": "Select an item. You'll usually select the TV option here, but if you want to set up your TV's audio component or a DVD player, select the appropriate option instead."
    },
    {
      "title": "Follow the on-screen instructions.",
      "content": "Follow the on-screen instructions. These instructions will vary depending on your available components. Once you've finished the on-screen setup, your remote should be programmed for your TV or component."
    }
  ]
}