{
  "url": "https://www.wikihow.com/Say-Adults-Only-on-a-Party-Invitation",
  "title": "How to Say Adults Only on a Party Invitation",
  "steps": [
    {
      "title": "Put your adult-only stipulation on the invitation, website, or both.",
      "content": "Put your adult-only stipulation on the invitation, website, or both. Traditionally, it is considered a faux-pas to mention not inviting children directly on the invitation. [1] X Research source However, it is no longer considered a serious violation of social norms to include the information on the invite. Consequently, you can make your no-child declaration a part of your invitation and include it as a small note on the bottom [2] X Expert Source Ivy Summer Certified Wedding & Event Planner Expert Interview. 9 February 2021. . You can also put it on the back of the invitation, if you’re including additional details on the back. [3] X Research source If you are worried about upsetting people by including the info on your invitation, feel free to mention that the event is adult-only on your party’s website instead. You can include the information on the invitation and the website if you want to really make things clear."
    },
    {
      "title": "Say “adults only” or “adult reception” instead of “no kids.”",
      "content": "Say “adults only” or “adult reception” instead of “no kids.” One of the easiest ways to say “no kids” without offending anyone is to not use the word “kids” at all. Stick with a simple wording that doesn’t leave room for interpretation while maintaining the formal tone of your invitation. The word “no” can feel kind of negative, so avoiding it altogether is a great way to keep the tone of your invitation positive. [4] X Research source For example, “Adults only,” “Adult ceremony,” and “Adult-only” are all perfectly adequate ways of wording your request. [5] X Expert Source Ivy Summer Certified Wedding & Event Planner Expert Interview. 9 February 2021."
    },
    {
      "title": "Write a formal and straightforward sentence if you want to be clear.",
      "content": "Write a formal and straightforward sentence if you want to be clear. To make sure that nobody misses your request, spell out the stipulation in a complete sentence. Maintain the formal tone of the invitation and keep your language concise and clear so that nobody misunderstands the information. [6] X Research source For example, you may say, “The bride and groom respectfully request that you find a babysitter for the evening,” or, “This is an adult-only party.”"
    },
    {
      "title": "Explain why you aren’t allowing kids if you want to provide context.",
      "content": "Explain why you aren’t allowing kids if you want to provide context. To give your guests a little bit of insight, feel free to include a note on why children aren’t allowed. If you’re writing a wedding invitation, mention the venue’s restrictions or the liquor-serving ordinances in your area. This is a great option if you’re worried about guests getting upset with a more straightforward approach. [7] X Research source For example, you could say, “Due to venue restrictions, the event staff are unable to accommodate children,” or, “Due to the high volume of guests, the kitchen will be unable to serve children.”"
    },
    {
      "title": "Apologize for not being able to accommodate children for a softer approach.",
      "content": "Apologize for not being able to accommodate children for a softer approach. Apologizing in advance is a good way to let guests know that you appreciate their children, but can’t accommodate them. This is a good way to go since it won’t seem too curt or aggressive. Start by saying “sorry” or “apologies,” and gently explain that children are not invited. [8] X Research source For example, you may write, “Sorry, but this is an adults-only event,” or “I apologize, but children are requested to stay home for the ceremony and reception.”"
    },
    {
      "title": "Be playful about not inviting kids to make it friendly.",
      "content": "Be playful about not inviting kids to make it friendly. If you aren’t worried about people taking it the wrong way, feel free to say “no kids” in a playful manner or with a joke [9] X Expert Source Ivy Summer Certified Wedding & Event Planner Expert Interview. 9 February 2021. . This is a great way to add a little character and personality to your invitation, which may have the added benefit of softening the information as well. [10] X Research source For example, you could say, “Please use this invitation as an excuse to hire a babysitter and get away for an evening!” or something similar. This is a great option if you know all of the guests well and don’t think anyone will take the request the wrong way."
    },
    {
      "title": "Imply that event won’t be kid-friendly to casually make the request.",
      "content": "Imply that event won’t be kid-friendly to casually make the request. If you’re serving alcohol at the event or it’s scheduled to run late into the night, use this as an excuse to not invite children. The parents will understand and this will also help you communicate the type of party that people can expect. For example, you may write, “Due to the high volume of alcohol that may be consumed, we respectfully request that you leave your children at home for the night of the event,” or “This is not a child-safe event. We will be reveling late into the night!”"
    },
    {
      "title": "Blame venue restrictions for an easy way out.",
      "content": "Blame venue restrictions for an easy way out. If you’re worried about your guests getting upset about their children not being invited and you’re comfortable with bending the truth, blame the venue. Liquor laws, maximum capacity, limited food, and security restrictions are all solid excuses for not inviting children. [11] X Research source For example, you may say, “Due to restricted seating, we don’t have any room for your little ones,” or “The venue cannot accommodate children. Please plan for a babysitter!”"
    },
    {
      "title": "Use the RSVP settings on your website to imply that children aren’t allowed.",
      "content": "Use the RSVP settings on your website to imply that children aren’t allowed. If you want to keep “no kids” off of the invitation but still make it clear that you aren’t allowing children, use the wording on the RSVP card or website. Instead of using the “yes/no” options on the RSVP page, write “___ number of adults attending.” The word “adults” implies that children are not allowed, which can save you from spelling it out for guests. [12] X Research source If you do this, some guests may ignore this information, since some guests may not read the website very carefully."
    },
    {
      "title": "Add names to each invitation to suggest that no guests are allowed.",
      "content": "Add names to each invitation to suggest that no guests are allowed. Before getting your invitations printed, compile your guest list. Get your invitations printed so that each invited guest’s name appears at the top of their invitation. For couples, print both of their names. This will let guests know that their children are not explicitly being invited. This is a great way to let guests know that kids aren’t invited, but they may reach out and explicitly ask you about bringing their children. Be prepared to let them politely know that their kids can’t come! For example, you could put “Julie and Max” on the invitation’s envelope, then put “Julie and Max,” at the top of the invitation inside."
    },
    {
      "title": "Send a personal note to families to soften your request.",
      "content": "Send a personal note to families to soften your request. If there are only a handful of families that have children, putting “no kids” directly on the invitation may make them feel like you’re talking about them specifically. If you’re worried about this, send each family a personal note with their invitation. This will soften the blow and let each family know you appreciate them. [13] X Research source For example, you could write, “You know I love Brian and Maisie, but Greg and I simply can’t afford the extra seats for all of the children, so please leave them home for the night. We hope you understand!” Handwrite each note to give it an extra personal touch."
    }
  ]
}