{
  "url": "https://www.wikihow.com/Recover-a-Yahoo-Account",
  "title": "2 Quick Ways to Get Back Into a Yahoo or Yahoo Mail Account",
  "steps": [
    {
      "title": "Go to the Recovery page in a web browser.",
      "content": "Go to the Recovery page in a web browser. This website will help you get back into your account. You'll just need one of the following: Sign-in email address or phone number Recovery phone number Recovery email address"
    },
    {
      "title": "Enter an email address or phone number and click Continue.",
      "content": "Enter an email address or phone number and click Continue . The email or number must be connected to the Yahoo account you want to recover. You'll be sent a verification code. You must have access to your recovery email address or phone number to restore your account. If there's no way for you to access those accounts, you can speak with someone from Yahoo's support team for a small fee. If you haven't signed into your account in over 12 months, your account may have been permanently deleted from Yahoo's server."
    },
    {
      "title": "Find the verification code in the message from Yahoo.",
      "content": "Find the verification code in the message from Yahoo. If you selected an email message for recovery, open that address's inbox, then open the message from Yahoo. If you entered a phone number, you'll receive a text message with the code . If you don't see a message from Yahoo in your email inbox, it may be in your Spam or Junk folder."
    },
    {
      "title": "Enter the verification code and click Next.",
      "content": "Enter the verification code and click Next . At this point, your account is recovered. Since you don't have access to your old password, you'll be given the opportunity to create a new one now. If you didn't receive a verification code, or if you don't have access to your email address or phone number, click Try signing in another way instead. You'll need to answer security questions to prove your identity."
    },
    {
      "title": "Type your new password.",
      "content": "Type your new password. Be sure to choose a secure password you can remember. Having trouble thinking of a password? Check out our guide to creating a memorable password . You may need to enter it twice."
    },
    {
      "title": "Click Continue.",
      "content": "Click Continue . You are now logged into your account with your new password. Once you sign back in, you'll have the option to edit your recovery options. You can add additional recovery accounts or remove ones you no longer have access to by following the on-screen instructions."
    },
    {
      "title": "Call (800) 745-0739 to contact Yahoo support.",
      "content": "Call (800) 745-0739 to contact Yahoo support. This is Yahoo's paid premium support line , Yahoo Plus Support. You'll be connected to a live agent, who can then help you gain access back into your account. This is only available in select countries. [1] X Research source You may be asked to provide additional security information, such as your date of birth. Unfortunately, there is no free Yahoo support line."
    },
    {
      "title": "Why am I getting \"Invalid ID or Password\"?",
      "content": "Why am I getting \"Invalid ID or Password\"? If you're getting the Invalid ID or Password error, this means that the Yahoo ID and password combination didn't match with what Yahoo has. To fix this, do the following: Make sure you're typing your password correctly. Check the caps lock and num lock keys to make sure they aren't on. Check your browser's autofill settings for old saved passwords. Try a different web browser."
    },
    {
      "title": "Why am I getting \"First time signing in here?\"",
      "content": "Why am I getting \"First time signing in here?\" If you see this error message, you may be signing in from a device that Yahoo doesn't recognize. New sign-in locations can be flagged by Yahoo. This may also pop up if you're using a VPN , which can change your IP address."
    },
    {
      "title": "Why is my Yahoo account locked?",
      "content": "Why is my Yahoo account locked? If you try to sign in too many times unsuccessfully, Yahoo may temporarily lock your account to prevent hackers from getting into your account. If your account is locked, it will automatically unlock after 12 hours. If you don't want to wait 12 hours, using the Sign-in Helper can help you regain access to your account immediately."
    },
    {
      "title": "How do I prevent getting hacked?",
      "content": "How do I prevent getting hacked? To make it harder for others to access your account, you can enable 2-Step Verification , which requires a secondary source to help you log into your account."
    }
  ]
}