{
  "url": "https://www.wikihow.com/Pray-the-Chaplet-of-the-Holy-Wounds",
  "title": "How to Pray the Chaplet of the Holy Wounds",
  "steps": [
    {
      "title": "Begin by praying:",
      "content": "Begin by praying: \"Holy suffering souls, who can obtain so many graces for us, remember me in the midst of your sufferings. I will work unceasingly to obtain for you the joys of Heaven, and I know you will plead for me. Amen.\""
    },
    {
      "title": "Make the Sign of the Cross",
      "content": "Make the Sign of the Cross : \"In the name of the Father, and of the Son, and of the Holy Spirit. Amen.\""
    },
    {
      "title": "On the Crucifix pray:",
      "content": "On the Crucifix pray: \"Jesus, Divine Redeemer, be merciful to us and to the whole world. Amen.\" [1] X Research source"
    },
    {
      "title": "On the first of three beads pray:",
      "content": "On the first of three beads pray: \"Strong God, Holy God, immortal God, have mercy on us and on the whole world. Amen.\" [2] X Research source"
    },
    {
      "title": "On the second bead pray:",
      "content": "On the second bead pray: \"Grace and mercy O my Jesus, during present dangers; cover us with thy Precious Blood. Amen.\""
    },
    {
      "title": "On the third bead pray:",
      "content": "On the third bead pray: \"Eternal Father, grant us mercy through the Blood of Jesus Christ, Thine only Son; grant us mercy, we beseech thee. Amen.\""
    },
    {
      "title": "Repeat the following for each large bead and the ten smaller beads that follow it:",
      "content": "Repeat the following for each large bead and the ten smaller beads that follow it: [3] X Research source On the large bead pray: \"Eternal Father, I offer Thee the wounds of our Lord Jesus Christ to heal those of our souls. Amen.\" On each of the 10 beads pray: \"My Jesus, pardon and mercy through the merits of Thy Holy Wounds. Amen.\""
    },
    {
      "title": "Offer a concluding prayer, Prayer for Purity, to Saint Joseph:",
      "content": "Offer a concluding prayer, Prayer for Purity, to Saint Joseph: \"O Guardian of Virgins and holy Father St. Joseph, into whose faithful keeping were entrusted Christ Jesus, Innocence itself, and Mary, Virgin of virgins, I pray and beseech thee by these dear pledges, Jesus and Mary, that, being preserved from all uncleanness, I may with spotless mind, pure heart and chaste body ever serve Jesus and Mary most chastely all the days of my life. Amen. [4] X Research source"
    }
  ]
}