{
  "url": "https://www.wikihow.com/Read-Piano-Tabs",
  "title": "How to Read Piano Tabs",
  "steps": [
    {
      "title": "Break the keyboard into octaves which correspond to lines on the tab.",
      "content": "Break the keyboard into octaves which correspond to lines on the tab. Piano tabs usually take the form of a series of horizontal lines, each labeled with a number at its far left, like this: 5|------------------------------ 4|------------------------------ 3|------------------------------ 2|------------------------------ Though this arrangement may at first seem to bear no resemblance to the black and white keys of a keyboard, piano tabs actually represent different regions on the keyboard through clever shorthand. The number at the left of each line represents the octave that the notes represented on the line are located in. Piano tabs define their octaves relative to the C scale - starting from the far left of the keyboard, the first C note on the piano begins the first octave, the second C note begins the second octave, and so on up to the highest C note. [1] X Research source For instance, in the sample tab lines provided above, the lines represent, starting from the top, the fifth, fourth, third, and second octaves from the farthest-left C, respectively. It's not necessary for piano tabs to include lines for every octave on the keyboard - just the octaves in which notes are played. [2] X Research source"
    },
    {
      "title": "Locate the notes in the tab based on the octave of the line they're on.",
      "content": "Locate the notes in the tab based on the octave of the line they're on. The letters A through G should be spread throughout the lines of the piano tab, like this: 5|-a-d-f------------------------ 4|-a-d-f------------------------ 3|-------c-D-e-f-G-------------- 2|-----------------f-e-d-c------ You may have already guessed that each letter corresponds to a note in the scale! Lowercase letters signify \"natural\" (not sharp or flat) notes, which are the white keys on the keyboard. Upper-case letters signify sharps, which are the black keys. For example, \"C\" is the black key to the right of \"c\", which is a white key. Notes on the lines of the tab are meant to be played in the octave that corresponds to the line . For instance, notes on line 4 in the sample tab above are played in the keyboard's fourth octave. For simplification of writing and to avoid confusion between the flat symbol, which resembles a lowercase \"b\", and the note \"b\", there are no flats in piano tabs. Instead, all flats are written as the equivalent sharp (eg: D-flat (\"Db\") is written as C-sharp (\"C\"))."
    },
    {
      "title": "Read tabs from left to right, paying attention to any measure breaks (marked with I's).",
      "content": "Read tabs from left to right, paying attention to any measure breaks (marked with I's). Like pieces of sheet music, tabs are read from left to right. The notes at the far left of the tab are played first, followed by the notes to the right. If the tab is longer than the screen or page, it can \"wrap around\" below each time it reaches the edge - just like sheet music. Often, but not always, piano tabs include vertical lines marking the barrier between each measure - usually, these are represented with capital letter \"I's\" or with vertical line characters, like this: 5|-a-d-f---------|--------------- 4|-a-d-f---------|--------------- 3|-------c-D-e-f-|G-------------- 2|---------------|--f-e-d-c------ If so, treat the space between each set of vertical lines as one measure. In other words, for songs in 4/4, there are four quarter notes between each set of lines, for songs in 6/8, there are six eighth notes, and so on."
    },
    {
      "title": "Play notes sequentially as you read from left to right.",
      "content": "Play notes sequentially as you read from left to right. Start reading a piano tab at its far left and play the notes in order from left to right as you encounter them. If two or more notes are directly above each other, play them at the same time as a chord. [3] X Research source In our example tab: 5|-a-d-f---------|--------------- 4|-a-d-f---------|--------------- 3|-------c-D-e-f-|G-------------- 2|---------------|--f-e-d-c------ ...we would first play the A in the fifth octave and the A in the fourth octave, then the D in the fifth octave and the D in the fourth octave, then the F in the fifth octave and the F in the fourth octave, then the notes C, D sharp, E, and F in sequence, and so on."
    },
    {
      "title": "Read repeating numbers above or below the tab as beats.",
      "content": "Read repeating numbers above or below the tab as beats. One weakness of tabs in general is that it is difficult to express rhythm via basic tablature notation. This can become problematic when dealing with sustains, rests, syncopated passages, etc. As a workaround, some tab writers actually count the beat of the song below or above the tab. Such a tab might look like this: 5|-a-d-f---------|--------------- 4|-a-d-f---------|--------------- 3|-------c-D-e-f-|G-------------- 2|---------------|--f-e-d-c------ ||1---2---3---4--|1---2---3---4-- In this case, the notes roughly above \"1\" are roughly on the first beat, the ones roughly about \"2\" are roughly on the second beat, and so on. This is hardly a perfect system, but it makes the most of the limitations of the tab format. [4] X Research source Some piano tabs include off-beat markings. Often, these take the form of an ampersand (\"&\") to mirror the common method of counting off-beats, as in \"one and two and three and four and...\" Such a tab might look like this: 5|-a-d-f---------|--------------- 4|-a-d-f---------|--------------- 3|-------c-D-e-f-|G-------------- 2|---------------|--f-e-d-c------ ||1-&-2-&-3-&-4-&|1-&-2-&-3-&-4-&"
    },
    {
      "title": "Learn how rests and sustains are expressed in tabs.",
      "content": "Learn how rests and sustains are expressed in tabs. Another weakness of the tab format is that it's difficult to express how long to hold a certain note or how long to rest between notes via tabs. Some tabs don't mark rests and sustains at all - after a held note, for instance, there will just be the series of dashes that make up the line. Other tabs will use a series of \">\" characters after notes to show that they should be held. See below: 5|-a-d-f---------|--------------- 4|-a-d-f---------|--------------- 3|-------c-D-e-f-|G-------------- 2|---------------|--f-e-d-c>>>>>> ||1-&-2-&-3-&-4-&|1-&-2-&-3-&-4-& In this case, we would hold the final C note from beat 3 to the end of the measure. [5] X Research source"
    },
    {
      "title": "Play notes marked with a period as staccato.",
      "content": "Play notes marked with a period as staccato. Staccato notes are the opposite of sustained notes - they are short, sharp, and truncated. Many piano tabs use periods to denote certain notes as staccato. See below: 5|-a.-d.-f.------|--------------- 4|-a.-d.-f.------|--------------- 3|--------c-D-e-f|G-------------- 2|---------------|--f-e-d-c>>>>>> ||1-&-2-&-3-&-4-&|1-&-2-&-3-&-4-& In this case, we play the first three octave chords as staccato. [6] X Research source"
    },
    {
      "title": "Look for \"R's\" and \"L's\" on the left of the tab as a guide for which hand to use.",
      "content": "Look for \"R's\" and \"L's\" on the left of the tab as a guide for which hand to use. Usually, but not always, the higher notes in a piece of piano music are played with the right hand, while the lower notes are played with the left hand, so it's usually safe to assume that the highest notes in a tab are played with the right hand and that the lowest notes are played with the left. However, some tabs specify exactly which notes should be played with each hand. In these cases, lines with an \"R\" at the far left of the tab are played with the right hand and lines with an \"L\" at the far left of the tab are played with the left hand. See below: R 5|-a.-d.-f.------|--------------- R 4|-a.-d.-f.------|--------------- L 3|--------c-D-e-f|G-------------- L 2|---------------|--f-e-d-c>>>>>> O ||1-&-2-&-3-&-4-&|1-&-2-&-3-&-4-& In this case, the fourth and fifth octaves are played with the right hand, while the second and third are played with the left. [7] X Research source Note that the \"O\" at the far left of the beat markings at the bottom of the tab was used simply to fill space and has no bearing on the tab itself."
    }
  ]
}