{
  "url": "https://www.wikihow.com/Open-WPS-Files",
  "title": "How to Open WPS Files",
  "steps": [
    {
      "title": "Double-click on the WPS file you want opened.",
      "content": "Double-click on the WPS file you want opened. Mac OS X will automatically open the file using a compatible viewer program installed on your computer. If the WPS file fails to open, proceed with the following steps to open the file using a third-party WPS viewer."
    },
    {
      "title": "Open the Applications folder and select “App Store.",
      "content": "Open the Applications folder and select “App Store. ” This will launch the Apple App Store window."
    },
    {
      "title": "Type “file viewer” into the search box at the top right corner of App Store.",
      "content": "Type “file viewer” into the search box at the top right corner of App Store. This will display a list of free and paid file viewer apps that can open WPS files. An example of free, high-rated WPS file viewer apps you can use is the File Viewer by Sharpened Productions at https://itunes.apple.com/us/app/file-viewer/id495987613?mt=12&ls=1"
    },
    {
      "title": "Click on the file viewer app of your choice, then click on “Install app.",
      "content": "Click on the file viewer app of your choice, then click on “Install app. ”"
    },
    {
      "title": "Follow the on-screen instructions to download and install the WPS viewer app on your computer.",
      "content": "Follow the on-screen instructions to download and install the WPS viewer app on your computer."
    },
    {
      "title": "Launch the WPS viewer app when installation is complete, then select the option to open the WPS file.",
      "content": "Launch the WPS viewer app when installation is complete, then select the option to open the WPS file."
    },
    {
      "title": "Launch your Internet browser and navigate to your favorite search engine.",
      "content": "Launch your Internet browser and navigate to your favorite search engine."
    },
    {
      "title": "Search for a website that hosts an online WPS file viewer or file converter.",
      "content": "Search for a website that hosts an online WPS file viewer or file converter. Examples of search terms you can use are “wps file converter” and “wps file viewer.”"
    },
    {
      "title": "Navigate to the file viewer website of your choice.",
      "content": "Navigate to the file viewer website of your choice. Examples of websites that offer online WPS file viewer or file conversion services are Zamzar, Online-Convert, File-Minx, and CloudConvert."
    },
    {
      "title": "Follow the instructions displayed on the website to open the WPS file.",
      "content": "Follow the instructions displayed on the website to open the WPS file. In most cases, you’ll be instructed to select the WPS file on your computer, as well as the format to which you want the file converted, such as DOC or PDF. Some online file viewer websites may have restrictions on file sizes. If the WPS file you want opened is too large, open the WPS file using Methods One or Two in this article to view the file in Windows or Mac OS X."
    }
  ]
}