{
  "url": "https://www.wikihow.com/Play-Dominion",
  "title": "How to Play Dominion",
  "steps": [
    {
      "title": "Set up the Victory cards.",
      "content": "Set up the Victory cards. If there are two players, place 8 \"Province\" cards, 8 \"Duchy\" cards and 8 \"Estate\" cards on the table in separate piles. If there are more than two players, use 12 of each of those cards instead. [1] X Research source"
    },
    {
      "title": "Set up the Treasure cards.",
      "content": "Set up the Treasure cards. There are large piles of \"Gold\", \"Silver\" and \"Copper\" cards. Place all of those piles on the table."
    },
    {
      "title": "Choose your Kingdom cards.",
      "content": "Choose your Kingdom cards. Kingdom cards (at least in the base set) are all the cards that you haven't already set up. There are a lot of Kingdom cards in the game, but you only need 10 differently named cards for each game.. You and your opponent can choose which cards to use in any way you like. The rule-book recommends a particular set of cards to use for a first game; \"Cellar\", \"Village\", \"Workshop\", \"Remodel\", \"Market\", \"Moat\", \"Woodcutter\", \"Militia\", \"Smithy\" and \"Mine\". You may want to use this set if you are playing for the first time. [2] X Research source"
    },
    {
      "title": "Set up the chosen Kingdom cards.",
      "content": "Set up the chosen Kingdom cards. You need 10 of each Kingdom card that you chose, except for cards with the \"Victory\" type, of which you need 12 (this is only \"Gardens\" in the first set). Put the cards in 10 piles, each card of the same name in the same pile."
    },
    {
      "title": "Build your starting decks.",
      "content": "Build your starting decks. Each player's starting deck is made up of 7 \"Copper\" cards from the pile you set up, and 3 \"Estate\" cards from outside the pile you set up."
    },
    {
      "title": "Shuffle your deck.",
      "content": "Shuffle your deck. Congratulations! You're finally ready to begin playing the game."
    },
    {
      "title": "Understand how to win the game.",
      "content": "Understand how to win the game. The (base) game ends when either the Province pile is empty or three different piles that aren't the Province pile are empty. When that happens, each player counts up the number of Victory points in their deck (the big number in the middle of Victory cards is usually the amount of points that card grants). Whoever has the most points wins. [3] X Research source"
    },
    {
      "title": "Understand the phases and structure of a turn.",
      "content": "Understand the phases and structure of a turn. A turn has three phases. These are the action, buy and discard phases. In your action phase, you may play up to one action(action cards say \"Action\" on the bottom) and put it in your discard pile. In their buy phase, a player may buy up to one card (the method for doing this is explained below). In their discard phase, the player discards their hand and draws 5 cards. If their deck has less than 5 cards in it, you draws you deck, shuffle your discard pile, makes the discard pile into your deck, than draw cards until you have 5 cards in hand. [4] X Research source"
    },
    {
      "title": "Play actions.",
      "content": "Play actions. Play actions in the turn's first phase, the action phase. To play an action, reveal it to all players, perform the effect it says for you to perform, then put it into the discard pile."
    },
    {
      "title": "Buy cards.",
      "content": "Buy cards. Buy cards during the buy phase, the second phase of the turn. Buy cards from the center piles you first set up. To buy a card, put a number of treasure (copper is worth 1 treasure, silver worth 2, and gold worth 3) into your discard pile that is greater or equal to the number in that card's bottom right corner. Then, put the card you just bought into your discard pile. You may buy only one card a turn."
    },
    {
      "title": "Understand odd terminology.",
      "content": "Understand odd terminology. +1 card means draw a card. +1 (if the 1 has a gold circle around it) means get one coin, like you would by playing a copper. +1 buy means that you can buy an additional thing this turn. +1 action means you can play another action this turn. Finally, a card with Reaction written in the bottom can be revealed at other times than your turn."
    },
    {
      "title": "Get expansions.",
      "content": "Get expansions. Currently there are 11 expansions and they all add new cards so you can play dominion longer. [5] X Research source Dominion: Intrigue adds cards with choices and victory cards that are also actions. Dominion: Seaside adds action cards that work this turn and the next. Dominion: Alchemy adds potion cards, but many people don't like them. Dominion: Prosperity adds Platinum, a treasure worth 5, and Colony, a victory card worth 10. Dominion: Cornucopia adds cards that reward variety."
    }
  ]
}