{
  "url": "https://www.wikihow.com/Relationships/Know-when-Your-Girlfriend-Doesn%27t-Love-You",
  "title": "How to Know when Your Girlfriend Doesn't Love You",
  "steps": [
    {
      "title": "Does she talk about doing things together in several months or years?",
      "content": "Does she talk about doing things together in several months or years? If she’s still invested in the relationship, she might mention future holidays and travel plans or even bring up things like getting married, buying a home, or having children. However, if her love has waned, she might not see a place for you in her future. [1] X Research source [2] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. She might also stop reminiscing about the past and bringing up all the good times you’ve had together. [3] X Research source Remind her of your best moments as a couple. If she thinks about why you two fell in love and how much fun you've had in the past, it could change her perspective."
    },
    {
      "title": "Does she cross boundaries you’ve agreed on?",
      "content": "Does she cross boundaries you’ve agreed on? If she’s flirting with one person or multiple people, she may have fallen out of love with you. It’s a major cause for concern if she’s flirting with someone specific on a regular basis. Signs that she’s interested in someone else include dressing differently when she’s going to see them, texting them frequently and talking about personal things, or liking and commenting on many of their social media posts. [4] X Research source Remember that it’s normal and healthy to have friendships with people outside of your relationship. Just because she talks to or spends time with someone else doesn’t automatically mean she’s flirting with or interested in them. [5] X Research source Be intentional about flirting with your girlfriend. If you add the spark back into your own relationship, she might be less inclined to seek it out elsewhere."
    },
    {
      "title": "Does she frequently blame you or point out your flaws?",
      "content": "Does she frequently blame you or point out your flaws? Your girlfriend may be more critical than she used to be if she’s focused on the negatives about you or your relationship. If everything seems to be your fault and every little thing you do annoys her, your relationship could be in trouble. When someone loses that respect and kindness for their partner, it’s a sign they’re not feeling the love like they used to. [6] X Research source If you’re the only one apologizing and she never takes responsibility for any issues that come up, you’re dealing with a one-sided relationship. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Point out the things you like about her or things she does well. When she sees you focusing on her positive qualities, it might remind her to do the same for you."
    },
    {
      "title": "Do you have a gut feeling that she just isn’t happy with the relationship?",
      "content": "Do you have a gut feeling that she just isn’t happy with the relationship? If you sense some distance between the two of you or feel that she’s drifting away, she might be falling out of love. [8] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. She may not be putting in much effort or giving you and your relationship the same attention she used to. [9] X Research source You might notice that your connection just doesn’t feel deep and meaningful. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try spicing things up! Surprise her with an adventure or create a romantic night at home ."
    },
    {
      "title": "Does she always seem to be busy with other things?",
      "content": "Does she always seem to be busy with other things? If she’s not investing time into your relationship anymore, she might be falling out of love. [11] X Research source This is especially true if she’s making lots of plans without you and spending more time with her friends than she used to. [12] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. Ask her to block off a couple of hours for a date night or see if she wants to spend the day with you at an aquarium, bowling alley, or nature preserve."
    },
    {
      "title": "Have you stopped being affectionate with each other?",
      "content": "Have you stopped being affectionate with each other? It’s normal to go through “dry spells” in a long-term relationship. But if she doesn’t seem interested in anything from holding hands to kissing to having sex, your relationship is in trouble. [13] X Research source Intimacy helps bring you together and sustain your connection, so its absence is a strong indicator that her feelings have changed. [14] X Expert Source John Keegan Dating Coach Expert Interview. 5 November 2019. Offer her a massage or ask her to snuggle up with you for a movie night. A little connection can go a long way. Remember that you should never pressure her to be intimate with you. If she doesn’t want to touch you or have you touch her, respect that. Try to have an open and non-judgemental conversation with your girlfriend about this issue. Mention that you’ve noticed the dip in intimacy and you’d love to hear her perspective on what’s happening in your relationship. Reader Poll: We asked 1055 wikiHow readers about what they’d do if they noticed a lack of physical intimacy in their relationship, and 50% of them agreed that they would initiate a conversation with their partner to address the issue . [Take Poll]"
    },
    {
      "title": "Have your communication style and patterns changed?",
      "content": "Have your communication style and patterns changed? If she doesn’t call to hear your voice or check in with a text like she used to, it could mean she doesn’t care about you like she used to. If that’s the case, she might seem closed off or withdrawn during conversations or avoid giving you her full attention. [15] X Research source She might stop showing interest in your life or even asking for your input on decisions she makes. [16] X Research source Send her sweet texts or leave little love notes where she'll find them to remind her how much you care ."
    },
    {
      "title": "Does she seem disinterested in you?",
      "content": "Does she seem disinterested in you? She might not prioritize you or take the time to listen to how you’re feeling. People in love want to share their ups and downs with their partner, and be there for their partner’s triumphs and trials. If she’s not connecting with and supporting you like she used to, her feelings about you might have changed. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Take the time to listen to her problems and feelings when she shares them. Seeing how thoughtful and empathetic you are might just remind her to be there for you in the same way."
    },
    {
      "title": "Have you heard that she’s criticizing you behind your back?",
      "content": "Have you heard that she’s criticizing you behind your back? A supportive partner will stick up for you, not trash-talk you. Whether you’ve overheard her venting to her friends or had a mutual acquaintance tell you something nasty she said, it’s a sign that she’s lost respect for you. [18] X Research source While it’s normal to vent about relationships to loved ones, if she’s only saying negative things, that’s a bad sign. Avoid the temptation to criticize her to your own friends and family. Remind yourself of her good qualities and remember that everyone has flaws."
    },
    {
      "title": "Has she betrayed your trust?",
      "content": "Has she betrayed your trust? Cheating is a major sign of relationship trouble. If you suspect or know that she’s had an emotional or physical affair with someone else, it’s time to have a serious talk about where things stand between you and what made your partner cheat. It is possible to repair your relationship and rebuild trust, but it will take a lot of effort on both of your parts. [19] X Research source It’s not your fault that your partner cheated, even if your relationship was rocky. [20] X Research source You deserve someone who will be loyal no matter what."
    },
    {
      "title": "Has she mentioned calling it quits?",
      "content": "Has she mentioned calling it quits? If she’s fallen out of love, she may decide that she doesn’t want to stay in the relationship. [21] X Research source Even though it’s hard, you’ll have to respect her decision. If she wants to take a break, give her space and focus on yourself and your own needs so she can do the same. Taking a break can actually strengthen your relationship. Make time to have fun and revisit hobbies that have fallen by the wayside. She might just remember what a great person you are and miss the time you spent together."
    },
    {
      "title": "You have two options here—try to fix things or move on.",
      "content": "You have two options here—try to fix things or move on . If you want to stay together , ask your girlfriend to sit down and have a conversation about your relationship. Tell her how you’re feeling and what you’ve noticed, then let her share what she’s feeling and thinking. [22] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Identify the problems you’re facing as a couple and work together to resolve them . It can take some time and effort, but if you’re both dedicated to fixing things, you can make it work. [23] X Research source If either of you doesn’t want to stay together, it’s time to end the relationship . We know this hurts, but we also know that things will get better in time. Make a clean break by moving out if you share a living space, blocking her on your phone and social media, and going no contact. Pour your energy into your job, spending time with people you care about, and doing things that make you happy. You’ll get through this and be better for it! [24] X Research source"
    }
  ]
}