{
  "url": "https://www.wikihow.com/Respond-to-Verbal-Abuse",
  "title": "How to Respond to Verbal Abuse",
  "steps": [
    {
      "title": "Refuse to emotionally engage.",
      "content": "Refuse to emotionally engage. When someone speaks to you in an abusive way, they are trying to control your behavior. They want you to react by getting upset. They are trying to force you to pay attention to them and to give them power. Your response may be to defend yourself and to try to control them, in turn. Don't. The best thing you can do is to turn your attention to yourself and keep control of your own behavior. [1] X Research source Don't let yourself be dragged into an argument or an ugly scene. Do not defend yourself against accusations and insults. That would be taking them seriously. Say, \"I'm sorry you feel that way.\" If you are talking to someone who likes to get a rise out of you and then say that you're too sensitive, don't expose your vulnerability by getting upset or appealing to their sympathy. If you are being bullied by a schoolmate, dismiss them. Show that you aren't interested in their opinion. You might smile and say, \"Yeah, I'm not here for that.\" When you are being insulted, mocked, yelled at, threatened, or otherwise verbally abused, take a deep breath. Speak in a calm, even voice. Do not yell or mutter. Remind yourself that nobody has the right to put you down, and that what is happening is not something you deserve."
    },
    {
      "title": "Set boundaries",
      "content": "Set boundaries . When you are being verbally abused, explain that you will not engage with the behavior, set consequences, and stick to them. Say \"I would be happy to talk to you about this issue, but I am not going to speak to you when you are yelling/insulting me/threatening me/putting me down/speaking in a sarcastic tone of voice.\" If they say they are just joking, say \"I don't like that joke, and I am not interested in talking to you when you talk to me like that.\" [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If they continue to harass you, set a consequence. Say, \"I will talk to you about this when we can both act calmly; however, I will not stay here and be abused. If you keep speaking to me in that tone, I will leave the house.\" Make sure to follow through on whatever consequence you set. If you said you will leave the house, leave the house."
    },
    {
      "title": "Walk away.",
      "content": "Walk away. If a boundary you set is crossed, or if you feel unsafe, leave. If you are home, you can go to another room or leave the house. If you are being verbally abused by someone you don't know or don't have any reason to talk to, walk away if you feel safe doing so. You don't have to put up with abuse. [3] X Research source Return only if it is safe. Leaving your house is a good strategy if you have a partner or other family member who gets angry and needs to calm down. In these cases, leave for an hour or two and come back when you feel ready. However, if the abuser is more inclined to stay angry, to escalate into violence, or to seek some sort of revenge, stay away. If there are children or other vulnerable people in the house, take them with you. If you are being randomly verbally abused by someone you don't know, either stay silent or say, \"I would appreciate that you not speak to me in that tone of voice,\" and move on to a place of safety as soon as you can."
    },
    {
      "title": "Get help.",
      "content": "Get help. If you are being verbally abused at work or at school, report your abuser to someone higher up. Enlist help from friends and colleagues as well. If you are being abused by a partner, take steps to remove yourself permanently from the situation. If your child or other dependent is verbally aggressive, set strict limits and seek help for them. [4] X Trustworthy Source US Office on Women's Health U.S. government agency providing resources for women's health Go to source Never stay silent about verbal abuse. Let others know what you are going through. Abuse can escalate, and verbal abuse can get in your head. Friends, family, and others can help. If you or someone you know has been experiencing verbal abuse for a prolonged period, find a good therapist as soon as possible."
    },
    {
      "title": "Recognize verbal abuse that may escalate to violence.",
      "content": "Recognize verbal abuse that may escalate to violence. There are times when you will be forced to engage with a person who is being verbally abusive. For instance, you may be alone and cornered by a mentally unstable person. You may be the teacher in a classroom where a student is insulting classmates, or the manager in a store where a patron is yelling. In these situations, it will be your job to de-escalate the abuse for reasons of safety. [5] X Research source Recognize the symptoms of agitation. The person may speak quickly, and may raise her or his voice or speak in a high pitch. Agitation brings on certain kinds of verbal abuse. These may include cursing, threatening, insulting, demanding, and making illogical statements. Aggressive posture, pacing, shaking, gesturing erratically or making fists are other signs of agitation."
    },
    {
      "title": "Use calm body language.",
      "content": "Use calm body language. Take a deep breath and exhale. Look as calm and as certain of yourself as you can. Look into the eyes of the person you are speaking to, but don't stare them down, as this can appear threatening. Get eye-level with the agitated person. If they are standing, stand, but make sure you give them space. [6] X Research source Move slowly and deliberately. [7] X Research source Relax your hands and do not cross your arms. Stand at an angle from the agitated person. Standing or approaching an agitated person at an angle is less likely to appear threatening. Do not turn your back or approach the agitated person from behind. Stand with more physical distance than you normally would. Getting close to someone who is agitated may cause them to panic and escalate into violence. If you notice someone showing signs of increased agitation, step to the side and continue talking to them."
    },
    {
      "title": "Speak in a calm, even voice.",
      "content": "Speak in a calm, even voice. Regulate your volume and tone. Speak evenly, slowly, and at an ordinary volume. Do not raise your voice to be heard over yelling. Instead, wait for the abuser to take a breath, and speak then. [8] X Research source Take a deep breath if you notice your voice wavering or if you are speaking too quickly or loudly. If you are afraid, you may speak too quietly. Take a deep breath and project your voice, speaking from your diaphragm."
    },
    {
      "title": "Speak respectfully.",
      "content": "Speak respectfully. Use an abundance of respectful language. Say \"Please,\" \"Thank you,\" \"I'm sorry,\" \"If you don't mind,\" \"Sir,\" \"Ma'am,\" \"Mr.\" \"Ms.\" and, if you can, the name of the person you are addressing. Avoid challenging, threatening, bossing, or shaming the agitated person. [9] X Research source Repeat what the person is saying to reassure them that you are listening. If they say \"I can't get any help and you're not helping! “say,” I hear that I haven't given you the help you need,\" then ask them how you can better help them.“ Affirm what they are saying with nods and brief verbal responses, like \"I hear you,\" \"Okay,\" \"I see.\""
    },
    {
      "title": "Engage the person's problem.",
      "content": "Engage the person's problem. Be honest with all your information if possible. If the information you have will upset the person further, explain that you will discuss it when you can speak together calmly. [10] X Research source Do not defend yourself or others from insults or accusations: they are meant to drag you into an argument, which will not help anyone. Answer real questions. If someone asks, \"Who the &*#@ are you,\" respond with your name and title. Ignore fake questions. To a comment like, \"Why are you such a &*#@?\" you might respond \"I'm sorry you feel that way.\" Ask open-ended questions to get more information and to encourage the agitated person to slow down and think rationally."
    },
    {
      "title": "Set firm limits.",
      "content": "Set firm limits. Explain that you cannot help the person when they are speaking abusively. Stay present with them, but explain that you are not negotiating with them during the outburst. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Offer options. Say, \"Would you like to step into the hallway and continue our discussion in a quieter tone of voice, or would you like to come back again tomorrow and discuss this then?\" Offer empathy for feelings, but not for abusive behavior. Say, \"I am very sorry that we failed to help you with this, and you have every right to feel angry. You do not have a right to make threatening remarks, however.\""
    },
    {
      "title": "Scan your relationships for kinds of verbal and emotional abuse.",
      "content": "Scan your relationships for kinds of verbal and emotional abuse. You can be emotionally abused by a partner, a parent, a friend, or anyone you are close to or who has power over you. Verbal abuse expert Patricia Evans defines the following 15 categories of abuse: [12] X Research source Withholding. If a loved one does not share feelings, thoughts, or any intimate information with you, especially when you solicit it, she is withholding. Blocking or diverting. This is a form of withholding in which the abuser chooses all the topics of conversation. They may tell you that you are talking too much or complaining too much. Countering. Countering is unnecessary argumentation. This is when someone tries to dismiss or \"disprove\" your feelings, thoughts, and opinions on a regular basis. Discounting. If you are told you are too sensitive, too dramatic, \"making a big deal out of nothing,\" too serious, or too immature, you are being discounted. Your judgment and self-preservation are being attacked. Abusive joking. If someone makes jokes that upset you or hurt your feelings, they are being abusive by joking. If you express your feelings and they say, \"It was just a joke,\" they are using a form of discounting. Blaming and accusing. If someone blames you for things that are not your fault, accuses you of doing things you did not do, this is an abusive behavior. Many abusers can't stand taking responsibility for their own failures, and will take their anger out on you. Judging and criticizing. If someone constantly puts you down by criticizing you or putting a negative spin on your actions, she is being abusive. These statements tend to start with \"You,\" as in, \"You're getting fat,\" or, \"The reason you don't have any friends is you have nothing to say in conversations.\" Trivializing. An abuser will attempt to diminish you by making light of your work, your pleasures, and your choices. If you are proud of something and someone responds with \"Isn't that pretty standard?\" they are trivializing. Undermining. If someone takes issue with everything you say, questions your authority constantly, and never takes your word, they are undermining you. Threatening. Threats of violence to you are abuse, even if they are never followed through on. Someone threatening to hurt themself \"because of you\" is a common form of abuse designed to control you. Threats without violence are also common, such as a someone saying that you will be broadly judged if you don't follow her advice. Name-calling. Someone who insults you by calling you names, expletives, and words that imply you are oversensitive is abusing you. Names like \"Idiot,\" \"Crazy,\" \"Ugly,\" or statements like \"You're acting like the victim,\" or, \"You think you're so special,\" are verbal abuse. Forgetting. If someone consistently forgets things that are important to you, this is a form of abuse, as they should have made the effort to remember. Giving orders. If someone tells you to do things, demands anything, or otherwise bosses you, this is verbal abuse. Denial. If your abuser denies their abuse and rationalizes it instead of listening to you and caring about the effect she has on you, she is engaging in denial. Anger. This kind of abuse involves yelling, screaming, getting suddenly agitated, or using physical force."
    },
    {
      "title": "See a therapist.",
      "content": "See a therapist. If you are in an abusive situation, or if you think you might be, speak to a professional. You will need the perspective of a licensed therapist or counselor to sort out your feelings. If you are worried about expense, look for a social worker or call your insurance to see what options you have. [13] X Research source If a potentially abusive family member is willing, go to therapy together. A family member who is willing to go to therapy with you may be able to break out of abusive patterns. If your partner offers to enroll in anger management, ask for therapy instead. Anger management does not help with abuse. [14] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Reach out to friends and family.",
      "content": "Reach out to friends and family. A common symptom of abuse is that you become isolated from your support network. Make regular dates with friends, and stay in touch with friends and family members you love. Be honest with your friends and family about your home situation. Maintain your own life: you shouldn't feel forced to share all friends and activities with your partner or other abusive loved one. [15] X Research source"
    },
    {
      "title": "Protect children from verbal abuse.",
      "content": "Protect children from verbal abuse. If your child or a child you know is being verbally abused, don't just stand by. Verbal abuse has devastating longterm effects on children, and often escalates to physical abuse. [16] X Research source If you think you know a child who is being verbally abused, you can call (800) 422-445 for advice. If you are certain a child is being verbally abused, report the abuser to your local Child Protective Services (CPS)."
    },
    {
      "title": "Leave.",
      "content": "Leave. If you realize you are living with an abuser, and your situation is not improving, leave. If you feel endangered, leave. If you have children, leave. If the abuse becomes physical, leave. If you are ready to leave, leave. If you think you might want to leave eventually, start saving money and alert some trusted friends. If you have nowhere to go, or if you just need help, call a local domestic abuse program. They might be able to locate a shelter for you where you can stay until you relocate away from the abuser. Call the domestic abuse hotline for advice on where to go and how to do it.(1−800−799−7233), or visit their website: https://www.thehotline.org/"
    }
  ]
}