{
  "url": "https://www.wikihow.com/Manage-Rejection-Sensitive-Dysphoria-with-ADHD",
  "title": "How to Manage Rejection Sensitive Dysphoria with ADHD",
  "steps": [
    {
      "title": "Identify intense emotional responses.",
      "content": "Identify intense emotional responses. These emotions may present as anxiety or other negative emotions before an anticipated rejection. Seeing anything other than a positive response (such as a neutral or vague response) as rejection and reacting emotionally as if it was is another sign of RSD. In addition, overreacting to these feelings of rejection, leading to behaviour that reflects negative emotions like anger, rage, extreme sadness, severe anxiety, etc is common in RSD."
    },
    {
      "title": "Reflect on patterns of avoidance.",
      "content": "Reflect on patterns of avoidance. Those with RSD often seek to avoid situations whereby the outcome or success is uncertain. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This can lead to avoiding job opportunities, forming friendships or romantic relationships and more. Individuals with RSD may avoid starting projects where there's a chance of failure. Those with RSD may stop trying entirely if they think that they aren't perfect at a task."
    },
    {
      "title": "Monitor your physical symptoms.",
      "content": "Monitor your physical symptoms. Rejection plays on the same pathways as pain does in the brain, [3] X Research source so it's no wonder that it can cause some physical symptoms, such as the ones listed below. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Chest pain Pain in the throat Sense of dread"
    },
    {
      "title": "Pause before reacting.",
      "content": "Pause before reacting. Pause and take a second to breathe before reacting to your negative emotions surrounding rejection. This may be hard, as there is often an increased risk of impulsivity in ADHD. [5] X Research source Try to focus on thinking your thoughts before you outwardly act on them."
    },
    {
      "title": "Challenge negative thoughts.",
      "content": "Challenge negative thoughts. Questioning any negative thoughts that may arise and attempting to reframe them more positively is a brilliant first step for this. Notice your negative thoughts, and take a moment to reflect on them. [6] X Research source Then, you can begin to question them thoroughly and seek alternative explanations. Is there a more positive, or neutral, stance you could take? For each negative thought you identify, try finding a more positive one not exactly to replace it with, but to think after the original. For example, \"I never do anything right\" can be reframed to \"I make mistakes sometimes, but I also have many successes\"."
    },
    {
      "title": "Practise self-compassion.",
      "content": "Practise self-compassion. Treat yourself with kindness. Remind yourself that mistakes are a normal part of living; therefore, they shouldn't be treated as failures or shortcomings. Training your inner dialogue to be more compassionate by allowing for reflection will help you begin to practise self-compassion. [7] X Research source Try starting a self-compassion journal to foster mindfulness. Write yourself some kind and understanding words of comfort. [8] X Research source"
    },
    {
      "title": "Seek positive validation.",
      "content": "Seek positive validation. Compliment others and you can almost always expect a compliment back. Try asking others what you did well on a task rather than asking for feedback, or criticism. Intentionally surround yourself with positive people who bring out your strengths rather than negative people who are harmful to your well-being. Positive validation from these sources can help to counter negative feelings brought on by RSD."
    },
    {
      "title": "Use mindfulness and relaxation techniques.",
      "content": "Use mindfulness and relaxation techniques. Try using deep breathing, meditation or grounding exercises to calm your nervous system during distressing moments. Mindfulness can increase your emotional awareness, allowing for better responses to rejection. [9] X Research source"
    },
    {
      "title": "Create a coping plan for triggering situations.",
      "content": "Create a coping plan for triggering situations. Anticipate situations that will trigger your RSD and create plans for what to do in those. Things like affirmations or pre-planned responses may help with the possibility of rejection. Build self-awareness. This can help you realise that the rejection doesn't define who you are as a person."
    },
    {
      "title": "Work with a therapist knowledgeable in ADHD and RSD.",
      "content": "Work with a therapist knowledgeable in ADHD and RSD. Find a therapist, if you don't already have one, who specialises in ADHD and is also knowledgable about RSD. You may benefit from a type of talk therapy known as CBT (Cognitive Behavioural Therapy); [10] X Research source This form of therapy is known to help people get awareness and insight into the emotional responses that you have."
    },
    {
      "title": "Consider talking to your doctor about medication.",
      "content": "Consider talking to your doctor about medication. There is no cure for ADHD or RSD, however there are some treatments that may help depending on the person. Consider talking with your doctor to see if medication may be an option for you. Some examples of medications that may be prescribed include: [11] X Research source Stimulant medications, such as dexamfetamine, Adderall or Ritalin. These drugs work on neuroreceptors such as dopamine, allowing for better communication skills. Alpha-2 receptor agonists. Drugs such as clonidine and guanfacine are formulated to activate brain receptors that can improve the ability of your brain to process and receive emotional signals. Monoamine oxidase inhibitors (MAOIs). These are often used to treat depression, but they may also help improve your sensitivity towards rejection. However, note that this medication cannot be taken with other ADHD medications that are commonly used, as well as specific foods such as aged meat and cheese."
    },
    {
      "title": "Connect with ADHD support groups.",
      "content": "Connect with ADHD support groups. Joining ADHD support groups, whether online or in person, can help you feel less isolated in your struggle. This is a very common issue, so you'll likely be able to find people who relate, especially on internet forums, with ease."
    }
  ]
}