{
  "url": "https://www.wikihow.com/Parkour",
  "title": "How to Parkour",
  "steps": [
    {
      "title": "Invest in a good pair of shoes.",
      "content": "Invest in a good pair of shoes. You want a pair that has decent grip and shock absorption (forefoot absorption, too!) -- no skating, soccer, or football shoes. The ones you'll be wearing need to be flexible and light; it's less about protection and more about morphing with your foot to the surface. It is also recommended by many top traceurs (those who practice parkour) to have a shoe that does not have hard plastic in the center of the arch as this will cause your ability to balance on things such as rails to decrease significantly as well as raising the chance for injury. A shoe with a good flat sole and as few pieces of rubber as possible is preferable as the little rubber nubs as seen on most running shoes will tear off with ease when training. Ideally the sole of your shoe should have one to two piece of solid rubber that way it will not tear free as easily and you will get more use from your shoe. You may want good toe bumpers to cushion your cat leaps. And, of course, regardless of the shoe, if it doesn't fit well, it won't work. The shoes must be snug or else you are increasing your risk of injury on landings. Don't concern yourself with brand names. If you are practicing as much as you should be, you will wear those suckers out in a few months. In addition, since you will be practicing outside, they are going to get dirty. Do not waste money on the looks of your feet."
    },
    {
      "title": "Get some comfortable clothes.",
      "content": "Get some comfortable clothes. As long as you can move quickly and your clothes are not restrictive, you are good to go. Just make sure they stay on and you will not find yourself messing with them as you move. [1] X Research source Climbing pants, since they allow you to move freely, and are durable, fit well, and don't get in your way. Gramicci, Prana stretch Zion pants (good), North Face, and Arborwear are recommended. Dickies are also durable and offer free-range of motion. Jeans are not recommended, as they are too stiff and do not allow enough freedom of movement. Again, if you have that favorite pair of sweats (that stays up!), go for it. Shirts do not have to be anything fancy, but it is good to have a sweat wicking type. REI and running shoe stores have these. Consider wearing long sleeves to prevent scrapes while first learning. You need to stay cool, so you'll probably want to don cotton."
    },
    {
      "title": "Consider wearing gloves as a beginner.",
      "content": "Consider wearing gloves as a beginner. Gloves are not a necessity, and many advanced practitioners skip gloves so they can get a better feel for the way a surface feels. That being said, when you're first starting out, wearing gloves can be a good way to avoid some serious scrapes and cuts that would prevent you from continuing for several weeks. [2] X Research source Even if you wear gloves as a beginner, you may eventually decide to ditch them. For the first few weeks afterward, you may come home seeking the ice pack. Soon enough, though, your hands will get used to the work you are putting them through."
    },
    {
      "title": "Find a friend.",
      "content": "Find a friend. Not only will your friend help keep you motivated, but they will show you things that did not even occur to you, forcing you to learn. Another choice is a Parkour coach. Someone who has been in the game for a while will be an invaluable resource in shortening your learning curve -- and they will help keep you from getting hurt. If your social network isn't pulsing with the energy of a thousand traceurs, start doing some research; there are Parkour groups worldwide that are always looking for new members."
    },
    {
      "title": "Find a few places to train.",
      "content": "Find a few places to train. Find some area of the concrete jungle that looks enough like a maze but poses less of a challenge (and danger) than the Great Wall of China. Once you have found one, find another. You will need various obstacles to keep your mind and skills fresh. Before you go darting from parking garage to parking garage, however, try mastering your way through a park first. Grass stains are a lot easier to take care of than broken femurs. Stay off private property. The police will not look at you and go, \"Sweet, man! How would you get your leaps to look like that? Can I take a look at the definition in your calf muscles?\" If trouble does find you, be polite and go on your merry way. Few will understand the purpose of what you are doing, and that is fine."
    },
    {
      "title": "Start slowly.",
      "content": "Start slowly. Do not tackle an obstacle you think you may be able to do, or you may injure yourself. Your nerves may get the better of you and get the better of your landing. Even if you think that you are not getting hurt, you may need to think of some of the long-term effects of the things you are doing to your body. You need to condition and make your body used to doing certain things without over-stretching or bruising it. [3] X Research source Start exploring what your body is comfortable with. How high and far can you jump? How quickly can you get into a roll? You will find the techniques to start with and what techniques need more work. It will also help you gain awareness of your body and body control."
    },
    {
      "title": "Master the landing.",
      "content": "Master the landing. There is a basic landing that you will be incorporating into all basic drops. The principles of this basic landing will be used for the advanced landing (the Parkour roll) as well. Therefore, it is important you learn and master this technique first. There are four main key points you always want to remember: [4] X Research source 1) When you land, your legs will be about shoulder width apart. 2) You must land on the balls of your feet. That way your body will act like a spring and distribute the landing. If you land on your heels, your body will act like a stiff board and will injure the rest of your joints and body. 3) You will not allow your legs to bend below 90 degrees. Bend below 90° and you put too much strain on your knee joints and you slow yourself down. 4) When you have forward momentum, or are taking a higher drop, lean slightly forward and allow your hands to absorb some of the force. This will keep your legs from bending below 90° on the drop and enable you to continue your run. Only use this basic landing for small drops."
    },
    {
      "title": "Learn the shoulder roll.",
      "content": "Learn the shoulder roll. This move is one of the most basic but useful tools in your Parkour toolbox. A shoulder roll is a forward roll diagonal across your back over the shoulder. Shoulder rolls are important because they reduce the impact of the landing, by converting the downward motion of a fall into forward motion, where you can easily begin to run again. [5] X Research source If you are a doing one on the right side you would bring your right arm close to your body and tuck your head and neck close to your chest. Then, roll over your right shoulder and come up onto your feet at the end. The reason you roll diagonally is to reduce the damage to your back and spine."
    },
    {
      "title": "Practice on vaults.",
      "content": "Practice on vaults. These help you clear obstacles easily and with speed. A vault should essentially keep your forward motion going while you are clearing an obstacle. Find a rail. When you run up to it, place both your hands on it and propel your legs to the right. When your knees come up over the rail, move your right arm out of the way, and swing your legs over. You should then be able to land with ease and balance. If balance is an issue, finding a rail of a different height may help. Once you have mastered this, practice doing it to the left."
    },
    {
      "title": "Start training jumps from about 3 feet (0.9 m).",
      "content": "Start training jumps from about 3 feet (0.9 m). You should never jump off anything higher than you yourself can jump. This is because if you repeatedly land on your legs from extensive heights you will damage your knees. Always practice precaution. Find a flight of steps. Start low and work your way up. Once you have done a step 10 times, kept relaxed, and always landed on your toes, move up. Repeat until you have done that step 10 times, relaxed, and always landed on your toes. If balance is an issue, don't move on until it's not."
    },
    {
      "title": "Practice the muscle up.",
      "content": "Practice the muscle up. How else are you going to be able to climb over walls? The muscles you use in doing pull ups are the same ones you will be employing in hanging off and getting over walls. Find a bar where the ceiling is still a ways away and get practicing. [6] X Research source Start pulling up a bit farther when you are doing your normal pull-up. Get to the point where your elbows are in line with the bar. Then, pull up farther -- bringing your chest over the bar. Get to the point where you can pull up and bring your arms straight over the bar, with it resting near your pelvis. Use your legs to propel upward from a hanging position. Get your intervals down to split seconds. Once you have mastered the basics, start timing yourself on the same courses. How much time can you knock off? This is when a friend comes in handy. Pick an area and find point A and B. Then, either time each other separately or as you both make your way through the course. What is the faster one doing the slower one is missing? A split second here and a split second there can add up and put the final changes on technique."
    },
    {
      "title": "Get in shape aerobically.",
      "content": "Get in shape aerobically. You are going to run, jump, and roll until the cows come home -- so getting your lungs into shape is priority number one. Hit the treadmill, the elliptical, and start swimming and boxing. Then when you hit the obstacle course, you won't be concerned with getting winded on top of everything else. Even activities like yoga and lacrosse (and other team sports) have their place in Parkour training. If it keeps you going for long periods, do it. Go until staying active for an hour at a time is a piece of cake."
    },
    {
      "title": "Get in shape with your body.",
      "content": "Get in shape with your body. Once you have gotten your lungs up to par, it is time to focus on your muscles. You won't need to be doing any serious weightlifting because, let's face it, moving a car out of the way is a lot slower than just jumping over it. However, you work with your own body weight and constantly lifting and propelling that. Start doing push ups , pull ups , squats, and leg lifts like it's your second job. It may seem like training as much as possible is ideal, but your body does need time to heal. Keep the muscle-building exercises to every other day (twice a day is okay if you do not work out too hard) to give your muscles time to heal themselves. They will be all the better for it in the long run."
    },
    {
      "title": "Amp it up.",
      "content": "Amp it up. If you have your 5k down and you are doing three sets of 15 reps, twice a day every day of those four exercises, good. Now do more. Do not let your body plateau. Aim for 10% more next week than you did this week. It will be good for your spirit and motivation to boot. Add extra exercises on or switch up your activity routine. Keeping your body guessing is key to developing all your different muscle groups. If you normally swim, go play rugby. Switch a day of squats and leg lifts for planks and sit-ups. Your ability to focus may heighten as well."
    }
  ]
}