{
  "url": "https://www.wikihow.com/Set-Up-an-Internet-Connection",
  "title": "How to Get Internet & Set Up Your Wi-Fi Network",
  "steps": [
    {
      "title": "Sign up for internet service that meets your needs.",
      "content": "Sign up for internet service that meets your needs. Connectivity options and service providers vary by area, but you'll usually find options for broadband cable, DSL, as well as satellite and fiber (FIOS). [1] X Research source It's best to contact the providers directly to find out about services available to your address. Companies that offer cable and satellite television services typically offer internet services as well. DSL services are often provided through telephone companies."
    },
    {
      "title": "Set up professional installation if necessary.",
      "content": "Set up professional installation if necessary. If your home isn't properly equipped for the type of internet service you're signing up for, the ISP will need to come prepare your home. [2] X Research source For example, if you don't have cable coaxial jacks but want broadband internet, you'll need a technician to come out and install a jack and prepare cable service. In many cases, the technician who comes out can also install all of the equipment necessary to get you online."
    },
    {
      "title": "Gather your equipment.",
      "content": "Gather your equipment. Most ISPs (internet providers) provide all of the hardware you'll need to set up your internet connection in your home, including a modem and any necessary cables. If you choose a professional installation from the provider, they'll bring the equipment to your home and set it up for you. If you want to do it yourself, the ISP will either mail you the equipment, or allow you to come pick it up. A modem is the device that connects to the jack in your wall and essentially connects your house to the internet. A router is a secondary device that allows multiple devices to connect to the internet through the router. It's very common to receive a device that's both a modem and a router (often called a \"wireless gateway,\" which makes setup especially easy. Some ISPs offer a modem for free (you'll need to return it if you cancel service) but offer a wireless router at a small rental fee. If you want to avoid renting hardware, you can always purchase your own router, but it'll always be easiest to set up (and get tech support) if you use the equipment from your ISP."
    },
    {
      "title": "Grab your ISP's setup instructions.",
      "content": "Grab your ISP's setup instructions. Setting up internet access is going to be a little different for everyone, as all ISPs, modems, and routers vary. Your provider will give you all of the information you'll need to get started, including any required usernames and passwords for your router, web addresses for setup, and even phone or tablet apps you can install for quick modem and router setup. Follow your ISP's instructions exactly for best results."
    },
    {
      "title": "Connect your modem to the wall jack.",
      "content": "Connect your modem to the wall jack. If you're using a DSL modem (or modem/router combo), you'll need to connect it to the telephone jack using the telephone cable that came with your modem. If you're using broadband or satellite, connect your modem (or modem/router combo) to the cable jack with a coaxial cable. If you already have a device connected to the jack, you can use a splitter, which will allow you to plug two different devices into a single jack. Many providers include a splitter in their self-installation kits."
    },
    {
      "title": "Plug the modem into a power source and turn it on.",
      "content": "Plug the modem into a power source and turn it on. The modem needs power to work, so make sure it's securely plugged in. As most modems don't have on/off switches, connecting the modem to an outlet will automatically power it on. [3] X Research source When the modem is turned on, it will go through a boot process that can take up to a minute. Several lights may flash during this process."
    },
    {
      "title": "Connect your wireless router to your modem and turn it on (if separate).",
      "content": "Connect your wireless router to your modem and turn it on (if separate). If you have a separate router that isn't combined with your modem into a single wireless gateway, you'll need to plug it into a power source and connect it to your modem using an Ethernet cable. Connect one end of the Ethernet cable into the available port on the back of the modem, and the other end into your router's \"INTERNET\" or \"WAN\" port. [4] X Research source"
    },
    {
      "title": "Follow your internet provider's instructions to connect.",
      "content": "Follow your internet provider's instructions to connect. Once your modem and/or router is up and running, the remaining steps will vary depending on your internet provider and equipment. Many major providers now offer easy setup using mobile apps you can install on your Android, iPhone, or iPad. If no mobile app is available, you'll need to connect your computer to the router or modem with an Ethernet cable, and then follow your provider's instructions to configure your router through your web browser. During the setup process, you'll usually be able to create (or at least write down) your Wi-Fi access point name and password. To connect to Wi-Fi on your computer, phone, or tablet, you'll need to know which network and password to use."
    },
    {
      "title": "Click the Network icon on the Windows taskbar.",
      "content": "Click the Network icon on the Windows taskbar. This icon changes depending on whether you're connected to the internet or not. When you're not connected to the internet, the icon will usually be a globe. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you don't see the network icon, click the up-arrow to the left of the icons near the clock and date on your desktop—it'll be in that overflow section."
    },
    {
      "title": "Select a wireless network.",
      "content": "Select a wireless network. If you're using Windows 10, click the name of the Wi-Fi network you want to join. If you're using Windows 11, click the right-arrow next to the Wi-Fi tile, and then choose a Wi-Fi network. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If your PC doesn't have Wi-Fi support or you don't have a Wi-Fi router, you can connect your computer to your gateway with an ethernet cable. Just plug one end of an ethernet cable into the ethernet port on your computer, and the other end into any of the LAN or numbered ports on the router or modem. This is usually all you'll need to do to get online. If you're not able to browse the web, there's usually an easy fix ."
    },
    {
      "title": "Enter the Wi-Fi network password.",
      "content": "Enter the Wi-Fi network password. If you're not sure of the Wi-Fi password , check the back of your wireless router or your documentation. [7] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Next.",
      "content": "Click Next . As long as the password is correct, the network icon should change to a Wi-Fi symbol (several curved lines in a cone) to indicate that you're connected. [8] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you're having trouble connecting to Wi-Fi, we can help!"
    },
    {
      "title": "Click the Wi-Fi network icon in the menu bar.",
      "content": "Click the Wi-Fi network icon in the menu bar. You should see an icon that looks like three curved lines near the top-right corner of your Mac's screen, usually with an X or ! when not connected. [9] X Research source If you don't see the icon, click the Apple menu, select System Preferences , choose Wi-Fi , and then click Show Wi-Fi status in menu bar . If you don't have a Wi-Fi router, you can connect your Mac to the internet with an ethernet cable. If your Mac doesn't have an ethernet port, you can use an ethernet to USB-C or Ethernet to Thunderbolt adapter. Once you connect the adapter to the Mac, connect an ethernet cable to the adapter, and plug the other end into one of your router or gateway's LAN or numbered ports. Your Mac should instantly detect the connection. [10] X Research source"
    },
    {
      "title": "Click the network you want to join.",
      "content": "Click the network you want to join. If a password is required, you'll be asked to enter it now. [11] X Research source If you don't see the Wi-Fi network you want to join, click Other Networks to show additional access points. [12] X Research source If the network you want join is hidden, select Other Networks , click Other , and type the network name into the field. Then, click the Security menu to choose the security type and enter the password."
    },
    {
      "title": "Enter the Wi-Fi password.",
      "content": "Enter the Wi-Fi password. If you're not sure of the Wi-Fi password , check the back of your wireless router or your documentation. [13] X Research source"
    },
    {
      "title": "Click Join.",
      "content": "Click Join . You should now be able to browse the internet. [14] X Research source"
    },
    {
      "title": "Open your Android's Settings .",
      "content": "Open your Android's Settings . You can do so by tapping Settings in your app list or by swiping down from the top of the Home screen and tapping the gear icon. [15] X Research source Because your Android doesn't have an ethernet port, you'll need to connect to wireless access point instead of using an ethernet cable."
    },
    {
      "title": "Tap Network & internet or Connections.",
      "content": "Tap Network & internet or Connections . The option you see will vary by Android. [16] X Research source"
    },
    {
      "title": "Tap Wi-Fi.",
      "content": "Tap Wi-Fi . If the \"Wi-Fi\" slider is not enabled, you can tap the slider to turn it on now."
    },
    {
      "title": "Tap the network you want to connect to.",
      "content": "Tap the network you want to connect to. You'll be asked to enter a password (if required)."
    },
    {
      "title": "Enter the password and tap Connect.",
      "content": "Enter the password and tap Connect . If you're not sure of the Wi-Fi password , check the back of your wireless router or your documentation. Once you're connected, your Android will automatically connect to this network any time it's in range. [17] X Research source"
    },
    {
      "title": "Open your iPhone's Settings .",
      "content": "Open your iPhone's Settings . This is the gear icon in your app list. [18] X Research source Because your phone or tablet doesn't have an ethernet port, you'll need to connect to wireless access point instead of using an ethernet cable."
    },
    {
      "title": "Tap Wi-Fi.",
      "content": "Tap Wi-Fi . It's near the top of the menu. If the Wi-Fi switch is not turned on, tap it to turn it on now. [19] X Research source"
    },
    {
      "title": "Tap the Wi-Fi network you want to join.",
      "content": "Tap the Wi-Fi network you want to join. If required, you'll be prompted to enter a password. [20] X Research source"
    },
    {
      "title": "Enter the password and tap Join.",
      "content": "Enter the password and tap Join . If you're not sure of the Wi-Fi password , check the back of your wireless router or your documentation. Once you're connected, you'll see the Wi-Fi icon at the top-left corner of your screen—it looks like a cone made of curved lines."
    }
  ]
}