{
  "url": "https://www.wikihow.com/Set-Up-a-Christmas-Tree",
  "title": "How to Set Up a Christmas Tree",
  "steps": [
    {
      "title": "Know which kind of tree you want.",
      "content": "Know which kind of tree you want. The greener, the better -- though make sure it hasn't been painted (yes, that's a thing some places actually do). A visit to your local Christmas tree farm can give you all the info, but here's the general rundown: Fraser, Douglas, and Balsam Firs are all good choices. They have shorter needles, so look to the ground to see how many have fallen. The needles should snap crisply if the tree is still fresh. Scotch and Virginia Pine are also ideal Christmas trees. The needles are longer, so the dead ones often get stuck in the branches. Run your hand loosely down a branch -- how many needles fall? A Spruce (blue or Colorado) is a beautiful tree, but the needles are so pointy they aren't good for homes with small children. A Cypress is a beautiful addition to any Christmas, but the branches aren't very sturdy and won't keep large ornaments up. [1] X Research source Consider this tree if you're only working with lights and ribbon. [2] X Research source"
    },
    {
      "title": "Buy your tree, stand and watering system.",
      "content": "Buy your tree, stand and watering system. Knowing the dimensions of the room you're going to put it in (you do know them, right?) is important for setting up your tree successfully. Which tree speaks to you? You'll need one that's the right height and the right width. Make sure you don't pick one that fits in the doorway but takes up half the room! [3] X Research source It's best to buy them early. They're freshest and you get the pick of the lot. Also, a lot of places pre-cut their trees and then leave them to fend for themselves. The tree you pick is probably better off under your care for a week or two than it is at the farm. [4] X Research source For your stand, the tree farm can help you with this if you don't already have one. You want one that is adjustable to pretty much any size and isn't a small circle that will only accommodate certain trees. And it should hold at least a gallon of water. Christmas tree watering systems really expand the water capacity or your stand, have a visual indication when your stand needs water and are easy to fill with water. NO crawling under the tree. NO spilling water on the floor."
    },
    {
      "title": "If you have it baled, identify the best side first.",
      "content": "If you have it baled, identify the best side first. When the tree is all netted up, it's going to be hard to tell which side is the side you want displayed. Before the netting goes on, tab the center of the nicest side. That way when you put it up, you won't have to do any needless rotating and manhandling to get it how you want it."
    },
    {
      "title": "If you'd like, store it in a cool, dark place.",
      "content": "If you'd like, store it in a cool, dark place. [5] X Research source Since it's best to get your tree early and you want to give Thanksgiving its proper due, store your tree in the garage or a similar place until you wish to put it up. Put 'er in a bucket, give 'er some water, and make routine checks every day or two. If you leave your tree out on the porch and it gets sunlight, it may start drying out (the last thing you want to happen). You want as humid, yet cool, as possible, too. [6] X Research source If you do store your tree (any more than 8 hours, actually), you'll need to cut 1 ⁄ 2 inch (1.3 cm) off the base prior to set up. This revitalizes it and allows it to take in more water, just like you would flowers in a vase."
    },
    {
      "title": "Give your tree a shake prior to set up.",
      "content": "Give your tree a shake prior to set up. Regardless of your type of tree, you don't want the bathwater coming in with the baby, if you will. Get rid of the dead needles by shaking it (outside!) before you set it up. No use starting off with a needle-y floor before the decorations even go up."
    },
    {
      "title": "Decide where to put your tree.",
      "content": "Decide where to put your tree. Apart from needing the ceiling height and the necessary width, you want your tree to be away from heat sources. Simply being on a heat vent can dry out your tree much faster than it would otherwise. Those are the two main things to consider. However, you may also want to consider how pets and children might get at it, how it might fall over (or what it might fall onto), and if it proves an obstacle. But heat access should come first! Did we mention not putting it too close to the fireplace? Definitely not the most wonderful time of year when your house burns down because of poorly thought-out Christmas spirit."
    },
    {
      "title": "Place it in your stand nice side out.",
      "content": "Place it in your stand nice side out. This part all depends on your stand. You'll probably be tightening screws and maybe slightly leaning your tree to make it appear upright. However you do it, make sure it's sturdy! The screws don't need to screw into the tree, but they do need to be unmoving. If you are using a Christmas tree watering system, set it up following the manufacturer's instructions."
    },
    {
      "title": "Immediately add at least a gallon of water.",
      "content": "Immediately add at least a gallon of water. If you use a Christmas tree watering system it is easy to add water, you do not have to crawl under the tree. That cut you just made (or the guy at the farm, whichever) is going to cause some serious thirst. It'll slow down soon. You bought a stand that holds a lot of water, right? If you did not, a Christmas tree watering system increases the water capacity of your stand. Always make sure there's water touching the base of the tree. If there's not, a layer of sap will form. If that happens, you'll need to make another cut, as the tree can't drink through it."
    },
    {
      "title": "Surround the stand with a tree bag.",
      "content": "Surround the stand with a tree bag. Pro tip, for sure. Place a tree bag around the base of your tree. This not only catches the needles and makes for super easy clean up when you're done with it, but you can just remove all the pretty doodads and then grab the bag, give her a tug, and your tree is bagged and ready to go. Tada!"
    },
    {
      "title": "Cover the tree bag with a skirt.",
      "content": "Cover the tree bag with a skirt. As much as the tree bag is convenient, it's not very Christmas-y, so cover the tree bag with a tree skirt (that's one of those decorative wraps that goes around the base, under your presents). Your Christmas tree watering system will be off the side."
    },
    {
      "title": "String your lights.",
      "content": "String your lights. Your first step in decorating should be stringing the lights. For artificial and real trees, the key here is (might not be the way dad did it) to string along the branches. Not across the branches like Christmas neophytes do. First, mentally divide your tree into tall sections -- the same number as the amount of lights you have. Ideally you'll have at least 5 strings of lights. Another tip? LEDs are better for the environment and will keep your fuses from blowing. [7] X Research source With your first strand, string it up the top, wrap it along the topmost branch and work your way down, going up each branch and back down it. This minimizes exposed cords. Repeat for each strand of lights. When you're done, step back and squint. Do you see any dark holes? If so, adjust as necessary. [8] X Research source"
    },
    {
      "title": "Add your ornaments.",
      "content": "Add your ornaments. This can be a family free-for-all or can be a highly coordinated, themed look. Heck, you can just have lights if you want, or lights and ribbon, or the whole shebang. Just make sure to take a step back every few minutes to make sure the ornaments and decorations are spread out evenly. If you want to add heavy ornaments , you can hang them on the lower branches for extra support, or higher on the tree by putting them close to the trunk."
    },
    {
      "title": "Keep it watered.",
      "content": "Keep it watered. For the first week or so, a 7-foot tree could go through about 2 quarts of water a day. And like discussed before, make sure it doesn't run out of water! A Christmas tree watering system really increases the water capacity of your stand. If you take good care of it it could last over a month. A happy, healthy, hydrated Christmas tee never has a dry stand. Don't worry about those fancy additives people try to sell you. Plain ol' water is all your tree needs. Just make sure there's enough of it. And if Fluffy likes to drink out of the base, be extra diligent!"
    }
  ]
}