{
  "url": "https://www.wikihow.com/Prevent-Ingrown-Hairs-on-Your-Legs",
  "title": "How to Prevent Ingrown Hairs on Your Legs",
  "steps": [
    {
      "title": "Make sure your razor is clean and sharp.",
      "content": "Make sure your razor is clean and sharp. A dirty razor can cause irritation and increases your risk of infection if you nick your skin. If your razor is dull, it increases your risk of nicking or cutting your skin. [1] X Research source Change your razor or blade often to ensure you get a good, safe shave."
    },
    {
      "title": "Use steam to soften your skin before shaving.",
      "content": "Use steam to soften your skin before shaving. Tight, dry skin facilitates ingrown hair growth, so we’ll want to take steps when possible to loosen and soften it. Shave after (or during) a shower to take advantage of the steam’s effect on your skin and leg hair. Exfoliating might help your cause (because it sloughs off irritating, dead skin cells) or it might hurt your cause (because it’s a great deal of rubbing, scrubbing and scraping on the skin in a short period of time). See which works best for you."
    },
    {
      "title": "Apply a shaving cream, gel, or lather to minimize irritation.",
      "content": "Apply a shaving cream, gel, or lather to minimize irritation. Rub the shaving cream, gel, or lather onto your legs before you shave. It will soften your skin and make it easier for the razor to glide over your legs. [2] X Research source If you always use shaving cream, gel, or lather, your skin will be less irritated after you shave."
    },
    {
      "title": "Don’t shave too closely.",
      "content": "Don’t shave too closely. Exert less pressure and refrain from pulling your skin taut; this will leave your leg hair slightly longer, reducing the likelihood of short, sharp hairs breaking back through your skin in either direction. [3] X Research source Leaving the hair on your legs slightly longer is far less noticeable than red, bumpy ingrown hairs, if visibility is of concern to you. Try an electric razor if you’re having difficulty leaving your hair longer with a manual razor. There’s no consensus on the merits of single-blade versus multi-blade razors in combating ingrown hairs, but you should always ensure your razor is clean and sharp."
    },
    {
      "title": "Shave with the grain.",
      "content": "Shave with the grain. Leg hair often grows downward, toward the foot, though most people will have stray hairs that defy convention. When you shave against the grain, it can cause the remnant of the hair to bend and curl, in turn increasing the chance that it'll curve inward. Shaving in the same direction that your hair grows lessens the chance for irritation. If this method doesn’t help, try shaving against the grain. It’s less commonly effective, but it works for some. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Rinse between every stroke.",
      "content": "Rinse between every stroke. As overly fastidious as it might feel, a clean razor won't drag dirt, dead skin, or any other microscopic debris into (or under) your skin. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Tap disposable razors firmly on the side of the tub or sink to knock the accumulated hair out from between their blades. With an electric razor, cleaning after every stroke is probably excessive. Just be sure to remove the guard and clean it thoroughly after each shave."
    },
    {
      "title": "Lay a cool washcloth on your leg afterward.",
      "content": "Lay a cool washcloth on your leg afterward. [6] X Research source Cool, light pressure will reduce inflammation, and contract your pores. Don’t rub the washcloth: just press it firmly on your skin."
    },
    {
      "title": "Wait longer between shaves.",
      "content": "Wait longer between shaves. Longer leg hair is the surest way to avoid ingrowns. If you don’t want to stop shaving altogether, give your hair and skin some time between shaves to recuperate. Repeated shaves is close succession will only agitate the irritated sites."
    },
    {
      "title": "Wear looser clothing.",
      "content": "Wear looser clothing. Calf socks are a common culprit of ingrown leg hair with men who don't shave, as tight clothing will prevent hair from growing away from the body. [7] X Research source Skinny jeans will exacerbate the problem on the thigh and calf both. Consider ankle socks, or slim-cut jeans as opposed to skintight styles. If you're having trouble with ingrown hairs on other parts of your body, try looser clothing there as well. Briefs can cause particular issues with pubic hair , as it's naturally coarser and curlier. Try boxers if you continue to have trouble here. Friction is also a factor with ingrown hairs. Dress appropriately when you'll be moving around, in loose-fitting clothing that allows your legs to breathe. Instead of tights, try exercising in shorts, sweatpants, or athletic pants."
    },
    {
      "title": "Stop tweezing and waxing.",
      "content": "Stop tweezing and waxing. When the hair is pulled entirely out at the follicle, its tip has to break back through the skin as it grows.This can easily lead to ingrown hairs when the tip fails to break through, or curls back around into the skin. Those with coarse or curly hair are at particular risk. While tweezing and waxing aren’t problematic for everyone, they’re the hair removal methods that are most likely to cause ingrown hairs."
    },
    {
      "title": "Avoid skin products with alcohol.",
      "content": "Avoid skin products with alcohol. Alcohol can cause your skin to tighten and dry out, worsening irritation. This in turn will exacerbate ingrown hairs."
    },
    {
      "title": "Assuage the pain with cortisone cream or aloe vera.",
      "content": "Assuage the pain with cortisone cream or aloe vera. Apply either of these liberally to soothe red, irritated skin. Don’t attempt shaving, waxing, or any other general hair removal for a few days."
    },
    {
      "title": "Try depilatory creams instead of shaving.",
      "content": "Try depilatory creams instead of shaving. Depilatory creams work to dissolve hair beneath the surface of the skin. [8] X Research source Whereas shaving leaves the hair with a sharp edge, these creams do not, potentially mitigating a major irritant for you. The hair still regrows from the root, however, meaning these creams are far from a sure thing."
    },
    {
      "title": "Lay a warm, clean washcloth over the area to soften the skin.",
      "content": "Lay a warm, clean washcloth over the area to soften the skin. The warmth from the washcloth will also help draw out any pus surrounding the hair. This will make it easier for you to remove the hair and clean out the pus, reducing your risk of developing an infection."
    },
    {
      "title": "Tweeze ingrown hairs out from under the skin.",
      "content": "Tweeze ingrown hairs out from under the skin. Dip your tweezers in rubbing alcohol to disinfect them, then dig the tip of the ingrown hair out of your skin. Don’t pull the entire hair out of your leg—just the tip. The redness and irritation should reduce. Don’t dig too deep into your skin if you have trouble grasping the hair. Let it grow for a few days, and try again once it’s longer."
    },
    {
      "title": "Treat them with active ingredients.",
      "content": "Treat them with active ingredients. Products with salicylic acid or glycolic acid work against ingrown hairs with exfoliating ingredients. These acids are often found in acne medications. It’s not uncommon for such medications to have an overall drying effect on your skin, though, so take care to moisturize thoroughly to offset this. Expect results after 3-4 days of use. Some of these chemicals can make you sensitive to sunlight, so read their instructions carefully and apply sunscreen if so."
    },
    {
      "title": "Laser your leg hair.",
      "content": "Laser your leg hair. The ultimate solution, laser hair removal is an option for those who have chronic issues with ingrown hairs. Treatment inhibits regrowth entirely, so pursue this only if you’re looking to give up leg hair entirely. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Although advances have been made, laser treatment is still most effective on individuals with fair skin and dark hair. Those with blonde hair or dark skin tones will find less success down this route. Even with fair skin (the skin tone most amenable to laser treatment) the total cost of the multiple sessions you’ll endure for laser treatment can run about $2,000."
    }
  ]
}