{
  "url": "https://www.wikihow.com/Shade-Drawings",
  "title": "Easy Tricks for Shading in Your Pencil Drawings",
  "steps": [
    {
      "title": "Shade in a value scale from light to dark on a piece of paper.",
      "content": "Shade in a value scale from light to dark on a piece of paper. Draw a long rectangle and sketch in lines to separate it into 7–10 equally-shaped blocks. Shade the block on one side of the rectangle as dark as you can to use for the deepest shadows. Then, color in the next block so it has a value, or shade, that’s slightly lighter than the first. Make each block progressively lighter until you reach the other end of the rectangle. Leave the last block empty to use as the brightest highlights in your drawing. [1] X Research source Making a value scale before you start shading your drawing helps you visualize the range of tones you’re able to add to your art. When you’re first putting in the darkest tone, apply the most pressure with your pencil or drawing tool. As you work to lighter shades, gradually reduce the amount of pressure you apply so you’re not pressing so hard against the paper. That way, your transitions between shades will be smoother and more consistent."
    },
    {
      "title": "Mark the direction of the light source on your paper.",
      "content": "Mark the direction of the light source on your paper. The position of the light source determines where the darkest shadows and the brightest highlights appear on the object you’re shading. Draw an arrow or a small sun where the light source appears in your drawing. The side of the object closest to the light source will be brighter and have highlights, while the furthest side will have darker shadows. [2] X Research source Try working from real life or a photograph to visualize how light affects the shading of the object you’re drawing. If you set up a still life, move lights around to see how the areas of light and shadow change. If you’re drawing from your imagination, choose a focal point in your drawing for the highlights. People looking at your drawing are typically drawn to the lightest areas."
    },
    {
      "title": "Apply light pressure with your pencil to create a base layer of shading.",
      "content": "Apply light pressure with your pencil to create a base layer of shading. If you’re shading with graphite, start with a soft 4B pencil to create a middle shade. [3] X Expert Source Kelly Medford Professional Artist Expert Interview. 10 March 2021 Hold the pencil on its side, and move your elbow or shoulder rather than your wrist to lay down the shading in long strokes with a smooth transition. [4] X Research source Avoid pressing too hard with the tip of your pencil because it will make your marks more difficult if you want to adjust the values later on. Rest your drawing hand on a separate piece of paper while you’re shading to prevent any accidental smudges on your drawing. If you’re using ink or a permanent medium, then avoid shading in the areas closest to the light source for now."
    },
    {
      "title": "Shade in the object’s core shadow with the darkest value.",
      "content": "Shade in the object’s core shadow with the darkest value. Draw dotted lines coming from your light source to the edges of the object you’re shading. The core shadow is the darkest shade, and it forms a darker band where the light source intersects the edges. Press slightly harder with your pencil to add in the darkest value, following the contours of the object so it looks three-dimensional. [5] X Research source Rounded shapes like spheres have reflected shadows on the side furthest from the light source. Leave a thin strip of slightly lighter shadows along the opposite edge of the object."
    },
    {
      "title": "Lighten areas closest to the light source with an eraser.",
      "content": "Lighten areas closest to the light source with an eraser. Work gently with your eraser to lighten the areas in layers to develop a smooth transition from light to dark. Apply light pressure to transition smoothly from the mid-tone shade to a lighter tone. Where the highlights are most intense closest to the light source, erase all your pencil marks to reveal the paper underneath for the brightest value. [6] X Research source To really make your highlights pop, use a white pencil or pastel to make solid areas of white. If you’re drawing objects with a metallic finish, make the highlight brighter than if you were drawing something with a matte finish. Use a clickable eraser to erase small detailed areas for highlighting things like wrinkles or creases in clothing."
    },
    {
      "title": "Add a drop shadow under the object to give the drawing more depth.",
      "content": "Add a drop shadow under the object to give the drawing more depth. Continue the dotted lines from your light source past the edges of the object until they intersect the surface below it to find the edges of your drop shadow. Sketch in the rough shape of your shadow with the side of your pencil and shade it in. Use the darkest values just below the object, and smoothly transition to lighter shade toward the edges. [7] X Research source The hardness of the drop shadow’s outline depends on the strength of your light source. Brighter lights create a harder edge while dim lights make the edges look softer. Look at a reference photograph or a still-life to see how the light angle affects the drop shadow."
    },
    {
      "title": "Get a smooth finish by blending your marks with a smudge stick.",
      "content": "Get a smooth finish by blending your marks with a smudge stick . Mix your values together, working from the lightest part of your drawing to the darkest. Rub your shading with the side of the smudge stick to create smooth transitions between the different values. If you need to blend tight, detailed spaces, then use the tip of the smudge stick. [8] X Research source If you don’t have a smudge stick, then try blending with a paintbrush or with a paper towel. Avoid using your fingers to blend your drawings. Your finger isn’t as precise as a smudge stick and the oils from your skin could leave marks on your drawing over time."
    },
    {
      "title": "Hatching",
      "content": "Hatching Hatching is a series of horizontal, vertical, or angled parallel lines meant to simulate shadows in your drawing. [9] X Expert Source Kelly Medford Professional Artist Expert Interview. 10 March 2021 Keep the lines spaced closer together to make darker shadows or place them further apart to make that part of the drawing look brighter. Try to pull hatching lines in one long stroke to keep them uniform. Follow the contours of objects with your lines to help simulate a three-dimensional form. For example, shade a round object with curved lines rather than straight lines."
    },
    {
      "title": "Cross-hatching",
      "content": "Cross-hatching Cross-hatching builds onto hatch marks by adding a second layer of lines going in an perpendicular direction. [10] X Expert Source Kelly Medford Professional Artist Expert Interview. 10 March 2021 First, make parallel horizontal lines and then layer vertical lines on top of them to darken the value. Keep the lines spaced out to lighten the shade or densely pack them together for the darkest shadows. Leave some of your initial hatch marks without a second layer of cross-hatching to accentuate areas with lighter shadows."
    },
    {
      "title": "Stippling",
      "content": "Stippling Stippling is a stylized shading technique where you tap your pencil on your paper to create a series of dots for your shadows. Darken the shadows of your drawing by placing the dots close to one another, and space them further apart when you want to transition toward a lighter value. [11] X Research source Stippling works especially great when you’re drawing with pens or markers. Alternatively, try making short lines that overlap instead of dots to shade your art in a more Impressionist style."
    },
    {
      "title": "Blending",
      "content": "Blending While the other shading techniques leave small marks on your drawing, blending your drawing gives a smooth appearance to your light and dark values. Use the side of a soft graphite pencil and a smudge stick to blend the values. Increase the amount of pressure you apply to the paper to transition to darker shades. [12] X Expert Source Kelly Medford Professional Artist Expert Interview. 10 March 2021 [13] X Research source Art pencils have varying degrees of hardness. Soft graphite is labeled with the letter B and gets softer with a higher number. Hard graphite is labeled with the letter H and is more difficult to smooth out if the number is higher. Standard number 2 pencils have an HB hardness, which is a medium between hard and soft graphite."
    },
    {
      "title": "Scumbling",
      "content": "Scumbling Scumbling is using short scribbled lines to add values to your shading. If you want to darken a shadow, make small, tight scribbles and overlap them so the paper isn’t showing through the mark-making. When you want to have lighter shadows, make looser scribbles with more space in between them so the highlights can show through. For a more stylized look, try making the values with one continuous line rather than picking up your pencil. Scrumbling works great for quickly sketching in values with pens and markers."
    },
    {
      "title": "Circling",
      "content": "Circling Keep your pencil on the paper and make small overlapping circles across the shaded area of your drawing. Apply more pressure and make tighter overlaps when you want to make shadows appear darker, and lighten up when you reach the highlighted areas of your drawing. [14] X Research source Circling works great if you’re shading with colored pencils . Circling also hides the individual marks from your pencil, so it’s great for creating smooth transitions between light and dark."
    }
  ]
}