{
  "url": "https://www.wikihow.com/Search-Tweets-by-Date-on-App",
  "title": "How to Search Tweets by Date on the X (Twitter) App",
  "steps": [
    {
      "title": "Log in using your mobile web browser.",
      "content": "Log in using your mobile web browser. The option to search tweets by date is no longer possible in the X mobile app, but you can still do it using Chrome , Safari, or any other browser at https://x.com/ . It's easy! Once the Twitter login page appears in your browser, follow the on-screen instructions to log in. If you're not logged in to your X account , you won't be able to search tweets."
    },
    {
      "title": "Go to https://x.com/search-advanced in your browser.",
      "content": "Go to https://x.com/search-advanced in your browser. Now that you're logged in, you won't have trouble loading the advanced search page."
    },
    {
      "title": "Enter the words you want to search for or omit (optional).",
      "content": "Enter the words you want to search for or omit (optional). If you want to search tweets that contain specific words and phrases, enter those phrases into the boxes in the \"Words\" section. For example, to search tweets by date containing \"Lauryn Hill,\" enter Lauryn Hill into the \"This exact phrase\" field. This ensures you'll only see tweets containing those two words in order. You can also specify words you don't want to include. For example, if you don't want to include \"Fugees,\" type Fugees into \"None of these words.\""
    },
    {
      "title": "Enter the user(s) you want to search.",
      "content": "Enter the user(s) you want to search. If you want to search tweets by date from a particular user or group of users, scroll down and enter the user(s) into the \"Accounts\" section. [1] X Research source For example, to search tweets by the user @wikiHow, type wikiHow into \"From these accounts.\""
    },
    {
      "title": "Select filters.",
      "content": "Select filters. In the \"Filters\" section, you can search tweets by date that include both replies and original posts, or stick to just the replies. You can also search tweets based on engagement, such as number of replies or likes. [2] X Research source"
    },
    {
      "title": "Enter the dates.",
      "content": "Enter the dates. The final section of the advanced search form lets you enter the start and end dates you want to search. If you only want to see tweets from one particular day , enter the same date into both fields. [3] X Research source"
    },
    {
      "title": "Tap Search to search tweets by date.",
      "content": "Tap Search to search tweets by date. You will now see all tweets that match your criteria from the date range you entered. [4] X Research source"
    },
    {
      "title": "Tap the Search icon in the X app.",
      "content": "Tap the Search icon in the X app. While you can't search by date in the mobile app, you can sort the results of your search in order from newest to oldest."
    },
    {
      "title": "Enter your search.",
      "content": "Enter your search. Tap the search bar at the top of the screen, type in keywords for the tweets you want to search, and tap Search or Enter . For example, if you want to see tweets of inspirational quotes, you might type in “inspirational words” or “quote of the day.”"
    },
    {
      "title": "Tap Latest to sort the tweets in order.",
      "content": "Tap Latest to sort the tweets in order. This displays tweets that match your search terms. The most recent tweet appears at the top of the list."
    }
  ]
}