{
  "url": "https://www.wikihow.com/Make-an-International-Wire-Transfer",
  "title": "How to Make an International Wire Transfer",
  "steps": [
    {
      "title": "Log into your online banking profile.",
      "content": "Log into your online banking profile. Before you can do an international wire transfer, you will need to have online banking services set up through your bank. Use your username and password to log into your online banking profile and complete a wire transfer from the comfort of your home."
    },
    {
      "title": "Look for a wire transfer option.",
      "content": "Look for a wire transfer option. Most major banks have an online wire transfer option. Do a search for international wire transfer options on your bank’s website, or look for the wire transfers section on the top toolbar of your bank’s website. [1] X Research source If you cannot locate the online wire transfer page, call your bank for more information. They can direct you to the right page."
    },
    {
      "title": "Activate your wire transfer limit.",
      "content": "Activate your wire transfer limit. Some banks require you to specify a limit for international wire transfers, as transfers over a certain amount (usually $5,000) require you to call your bank to authorize a large transfer. [2] X Research source You may then need to confirm your identity by agreeing to have your bank send an access code to your cell phone. You will use this access code to activate your wire transfer limit. You can then start making international wire transfers online."
    },
    {
      "title": "Enter in the recipient's banking information.",
      "content": "Enter in the recipient's banking information. To complete an international wire transfer, you will need specific information from the recipient of the transfer, including: [3] X Research source The full name and address of the recipient’s bank. The recipient’s name, address, and account name (savings, checkings, money mart, etc.). The recipient’s account number, or International Bank Account Number (IBAN). Your recipient should be able to get this information from their bank, or from their banking statement. The recipient’s account number will depend on where their bank is located in the world. For example, an account number at a Canadian bank will appear differently than an account number at an Australian bank. The recipient’s bank’s SWIFT/BIC code. Your bank will require the recipient’s bank’s SWIFT/BIC code in order to identify which bank they are transferring your money to. The recipient should be able to get their bank’s SWIFT/BIC code by asking their bank for this information. Your bank may also be able to locate the recipient’s SWIFT/BIC code based on the recipient’s account information. Keep in mind that the SWIFT code will be different if the currency is anything other than US dollars."
    },
    {
      "title": "Specify the currency and amount of the transfer.",
      "content": "Specify the currency and amount of the transfer. The recipient’s country’s currency should appear automatically once you enter in the recipient’s information. But if you want to change the currency to a specific one, use the dropdown menu to adjust it. You can then choose the account you are transferring the money from, and enter in the amount of money you would like to wire transfer. Most banks encourage you to transfer money in the currency of the recipient’s country. If you are not sure what the recipient’s currency is, you can send the amount in U.S. or Canadian dollars. [4] X Research source"
    },
    {
      "title": "Pay your bank’s fee for processing an international wire transfer.",
      "content": "Pay your bank’s fee for processing an international wire transfer. Most banks charge an international wire transfer fee ranging from $40-$50 per transfer. A list of fees for the top 10 U.S. banks can be found here . The receiving bank may also charge a small fee to process the wire transfer, ranging from $10-$20. The recipient of the transfer can ask their bank about the exact fee for receiving and processing a wire transfer. The recipient would then pay the processing fee for their bank to process the transfer. Keep in mind that there are several online options for wire transfers, such as PayPal or OFX. These services charge reasonable fees for international wire transfers. They can wire the money directly from your bank or you can set up an ACH direct debit."
    },
    {
      "title": "Check how long it will take for the wire transfer to go through.",
      "content": "Check how long it will take for the wire transfer to go through. Most banks estimate between one and two days for wire transfers to go through. However, your bank should specify how long the transfer will take at the end of your online session. You can check the status of the wire transfer by logging into your online bank account and looking up the wire transfer. There should be a note when the transfer has gone through successfully."
    },
    {
      "title": "Call your bank to confirm they do wire transfers in-person.",
      "content": "Call your bank to confirm they do wire transfers in-person. Most major banks are able to process wire transfers in-person at a branch location. However, you should confirm with your bank that they do this in-person service."
    },
    {
      "title": "Bring in the recipient’s banking information.",
      "content": "Bring in the recipient’s banking information. To process the international wire transfer, you will need to show the banking attendant the following information: [5] X Research source The full name and address of the recipient’s bank. The recipient’s name, address, and account name (savings, checkings, money mart, etc.). The recipient’s account number, or International Bank Account Number (IBAN). Your recipient should be able to get this information from their bank, or from their banking statement. The recipient’s account number will depend on where their bank is located in the world. For example, an account number at a Canadian bank will appear differently than an account number at an Australian bank. The recipient’s bank’s SWIFT/BIC code. Your bank will require the recipient’s bank’s SWIFT/BIC code in order to identify which bank they are transferring your money to. The recipient should be able to get their bank’s SWIFT/BIC code by asking their bank for this information. Your bank may also be able to locate the recipient’s SWIFT/BIC code based on the recipient’s account information."
    },
    {
      "title": "Ask the bank teller to walk you through the wire transfer process.",
      "content": "Ask the bank teller to walk you through the wire transfer process. The teller should take the recipient’s information from you and ask you a series of questions to complete the wire transfer. You will need to confirm: [6] X Research source The currency in which you are sending the funds to the recipient. The account from which you are sending the funds to the recipient. The amount of funds you are transferring to the recipient. Most banks encourage you to transfer money in the currency of the recipient’s country. However, if you are not sure where the recipient is located or what currency the recipient would like the funds in, you can send the amount in U.S. or Canadian dollars. [7] X Research source"
    },
    {
      "title": "Pay the international wire transfer fee.",
      "content": "Pay the international wire transfer fee. Most banks charge an international wire transfer fee ranging from $40-$50 per transfer. A list of fees for the top 10 U.S. banks can be found here . Ask your teller to confirm the fee amount before you complete the transfer. The receiving bank may also charge a small fee to process the wire transfer, ranging from $10-$20. The recipient of the transfer can ask their bank about the exact fee for receiving and processing a wire transfer. The recipient would then pay the processing fee for their bank to process the transfer."
    },
    {
      "title": "Check how long it will take for the wire transfer to go through.",
      "content": "Check how long it will take for the wire transfer to go through. Once the teller completes the wire transfer process, she should let you know how long it will take for the bank to process the wire transfer and for the recipient to receive the funds. Most banks estimate between one and two days for international wire transfers to go through."
    },
    {
      "title": "Consider an international wire transfer through outside services.",
      "content": "Consider an international wire transfer through outside services. If you are concerned about your bank’s fee for international wire transfers, you can go through another wiring service like Western Union. The fees from Western Union are usually less than the fees charged by your bank, around $10-$15 per transfer. But the transfer may take more time if you use an outside service like Western Union instead of your bank. [8] X Research source"
    }
  ]
}