{
  "url": "https://www.wikihow.com/Memorize-How-Many-Days-Are-in-Each-Month",
  "title": "How Many Days Are in Each Month? Easy Ways to Remember",
  "steps": [
    {
      "title": "Remember the first half of the poem.",
      "content": "Remember the first half of the poem. There is a nursery rhyme used to teach children the days in the months. The first line reminds you how many months contain 30 days. [1] X Research source The first line goes, \"30 days have September, April, June, and November.\" You can remember, based off this line, that September, April, June, and November each have 30 days. You may have to repeat it a few times to commit it to memory."
    },
    {
      "title": "Commit the second half to memory.",
      "content": "Commit the second half to memory. The second half of the poem reminds you that February is a short month, and which months have 31 days. The line goes, \"When short February's done, all the rest have 31.\" Excluding September, April, June, November, and February, all the months have 31 days. [2] X Research source You may have to repeat this line a few times to remember it, as with the first line. Try repeating the whole poem a few times, after memorizing the first and second line. This can help you commit the whole poem to memory."
    },
    {
      "title": "Remember a single word for each line.",
      "content": "Remember a single word for each line. If you're struggling to remember, a simple trick can help. Try to remember a key word from each line of the poem, and find a way to associate that word with the line. [3] X Research source Imagine something to do with said month that reminds you of the rest of the line. For example, most schools start in September. You can picture a student multiplying 10 by 3 to get 30. This may help you remember, \"30 days has September.\" Consider giving each month a symbol in the 30 set a symbol. For example, September could have a book and April could have an umbrella. June could have a sun and November could have a turkey. Continue using tricks like this throughout the rest of the lines of the poem. This can help you better remember it."
    },
    {
      "title": "Listen to recordings of the poem.",
      "content": "Listen to recordings of the poem. Simple repetition is a great means to memorize poetry. Find recordings of the poem online. A site like YouTube may have recordings of the poem. Play these recordings to yourself over and over again, and try to recite the lines along with the recordings. This can help you memorize the poem. If you can't find a recording online, record yourself saying the poem with your phone or computer. Play the recording back to yourself while you recite the poem along with it."
    },
    {
      "title": "Add a small alteration to remember leap years.",
      "content": "Add a small alteration to remember leap years. Some people do not struggle to remember the days in February, as it's only one month. However, if you frequently forget the days in February, you can try memorizing an alteration of the poem instead. This alteration goes, \"30 days has September, April, June, and November. All the rest have 31. Save February, with 28 days clear, and 29 each leap year.\" [4] X Research source You can memorize this version of the poem using the same tricks you used to remember the first version."
    },
    {
      "title": "Ball your hands into fists and place them together.",
      "content": "Ball your hands into fists and place them together. You can also use your knuckles to remember the number of days in each month. To start, ball both your hands into fists. Then, hold both your fists in front of your face. Push your two balled fists together, so your two thumbs and two index fingers touch. [5] X Research source"
    },
    {
      "title": "Count the months working with your knuckles and grooves.",
      "content": "Count the months working with your knuckles and grooves. You should start with January at the leftmost knuckle. You will count the months by moving across your fists, counting each knuckle and groove as a month. [6] X Research source Start with the outermost knuckle on your left hand. This is the knuckle made by your left pinky. This is January. Move to the groove just to the right of your leftmost knuckle. This is the groove between the knuckles made by your left pinky and ring finger. This is February. Keep moving across your two hands, naming each knuckle and groove the name of a different month."
    },
    {
      "title": "Do not count the knuckles on your thumbs.",
      "content": "Do not count the knuckles on your thumbs. When you reach the knuckle made by your left index finger, move immediately to the knuckle made by your right index finger. Do not count your thumb knuckles, or the gap between your hands. [7] X Research source The knuckle made by your left index finger should be July. The knuckle made by your right index finger should be August."
    },
    {
      "title": "Remember that months that land on a knuckle have 31 days.",
      "content": "Remember that months that land on a knuckle have 31 days. The months that land on your knuckles are January, March, May, July, August, October, and December. All these months have 31 days. [8] X Research source"
    },
    {
      "title": "Understand months that land on a groove have 30 days, excluding February.",
      "content": "Understand months that land on a groove have 30 days, excluding February. The months that land on the grooves of your knuckles should be February, April, June, September, and November. These months all have 30 days. [9] X Research source If you don't end up with these months landing on your grooves, you might have skipped a knuckle or groove, or counted the gap between your hands. Start over and go slower."
    },
    {
      "title": "Try an acronym.",
      "content": "Try an acronym. An acronym can help you remember the names of the months. An acronym is a memory device in which you make up a word or sentence using the first letter in a group of terms you must memorize. This can easily be used to help you remember the days in each month. [10] X Research source The first letter of September, April, June, and November are S, A, J, and N. You could make a sentence like, \"Sarah And June Nap.\" January, March, May, July, August, October, and December all have 31 days. The first letters (D, J, M, M, O, J, and A) can make: \"Justin Must Make Diced Apricot Orange Jam.\""
    },
    {
      "title": "Use a mnemonic device.",
      "content": "Use a mnemonic device. Mnemonic devices help you remember complicated information by associating an image with information. For example, if you want to remember that February has 28 days most years, picture hearts forming the numbers 2 and 8. Hearts are related to February because of Valentine's Day"
    },
    {
      "title": "Find ways to connect months.",
      "content": "Find ways to connect months. If you can find ways to make connections between which months have which number of days, it can be easier to remember. Facts are easier to remember if you can make some connection. For example, September, April, June, and November all have 30 days and beginnings. School begins in September; spring starts in April and summer starts in June. The day after Thanksgiving in November is the beginning of the Christmas season. You may not be able to link all the months with 31 days, since there are so many, but you can still find small connections between small groups of months. For example, January is harsh and cold, while March is dreary and rainy. October contains Halloween, a frightening holiday. All these months have certain qualities that are scary, fierce, or harsh."
    }
  ]
}