{
  "url": "https://www.wikihow.com/Run-Up-and-Over-a-Wall",
  "title": "How to Run Up and Over a Wall",
  "steps": [
    {
      "title": "Set up a safe practice area.",
      "content": "Set up a safe practice area. Running up and over a wall is a moderately difficult move that is relatively safe when practiced slowly in a controlled environment. Walls that are very high or surrounded by hard ground, like cement, will be much more dangerous than moderate to small walls surrounded by soft dirt or grass. Once you have mastered the wall run, you can apply this skill to nearly any wall you choose. However, when getting started, smaller walls approximately 6 to 7 feet (1.8 to 2.1 m) (1.8 to 2.1 m) will be safest. Sneakers or athletic shoes that fit snugly, aren't constricting, and have good grip on the bottom sole will help you run up and over walls more safely and easily. If safety is a major concern for you, the safest way to learn this move will be with a professional instructor, like a parkour trainer. [1] X Research source"
    },
    {
      "title": "Warm up",
      "content": "Warm up . To perform this move you'll mostly be using your legs and core, so these areas should be given extra attention when warming up. You'll also have to approach the wall at a moderate to fast speed when going up and over, so you might want to take a quick jog or run, too. Warm up your joints to improve performance and prevent injury. Start from your head and work your way down your body, rotating each joint back and forth. Make your rotations as wide ranging as possible. Perform some dynamic stretches doing things like lunges , bending and touching your toes, and pulling your knee to your chest."
    },
    {
      "title": "Familiarize yourself with the approach.",
      "content": "Familiarize yourself with the approach. Run at a wall at a slow to moderate pace. You'll want to be moving slow enough that you can easily gauge which foot will come in contact with the wall first. As you become more familiar with the motions of the approach, you should increase your speed. Run at the wall several times in this fashion. You may want to keep your hands raised in front of you as a brace or guide, especially with smooth walls, where slipping is a concern. Avoid favoring a foot in your approach. Even if you find it most natural to end on your right foot before your left comes in contact with the wall, or vice versa, alternate between feet in your approach. This way, you'll be able to adapt to new environments more easily. [2] X Research source"
    },
    {
      "title": "Jump at the wall from about a pace away.",
      "content": "Jump at the wall from about a pace away. When you are about a step away from the wall, raise your leg to prepare your foot for contact with the wall. Your wall-foot should be raised to roughly the max height of a normal step, or slightly higher. It should be positioned so that only the front third of the foot, not the entire foot, comes in contact with the wall. Keep your head up at this point in your wall run. It'll be a natural reflex to watch your feet hit the wall, but this could result in you missing the top edge or dangerous hazards, like branches from trees or loose stones."
    },
    {
      "title": "Meet the wall with your foot and drive downward.",
      "content": "Meet the wall with your foot and drive downward. For the best vertical distance, you'll want your foot to come in contact with the wall from the ball of your foot to your toes. In this instant, grip the wall with your foot and drive downwards. This will change your forward momentum upward, helping you to run up the wall. [3] X Research source If your foot strikes the wall loudly when you come in contact with it, this is likely a sign that you are driving into and away from the wall, not downward and up the wall. If less of your foot is in contact with the wall, the force of your push might be directed outward away from the wall instead of upward, or you may not have enough grip to change direction. Since the shift in your momentum from forward to upward comes from driving downward with your wall-foot, try not to connect with the wall too high. High contact points will make it difficult to generate enough force to run up the wall."
    },
    {
      "title": "Scurry up the wall.",
      "content": "Scurry up the wall. You might only be able to run a single step up the wall, especially when you're first learning. Depending on your reflexes, strength, and skill, you may be able to take another step or two up the wall. If you can, do so in the same fashion as your leading foot. [4] X Research source In some situations, you may come into your wall run with too much speed. Having your hands in front of you at this point can save you from accidentally slamming into it and injuring yourself. Be ready to grab onto the top of the wall. Things will be moving very quickly. Being prepared will prevent you from missing your chance to grab hold. Although some experts can get several steps in when running up and over a wall, allowing them to go even higher, you should only attempt a single step at first. As you become more comfortable with the motion, you can add more steps."
    },
    {
      "title": "Pull yourself up the wall and dismount.",
      "content": "Pull yourself up the wall and dismount. If you've connected with the wall correctly, much of your momentum will now be redirected upwards. Even so, you'll have to use your arms to assist your upward momentum to pull yourself to the top of the wall. Then, carefully jump down or lower yourself to the other side. Failing to assist your upward momentum can cause your jump to \"stall,\" which is another way of saying your momentum has run out. It can be difficult pulling yourself up from a stalled position. [5] X Research source Treat jumping from high places seriously. Falling or jumping incorrectly from as few as 10 feet, a reasonable height for a medium sized wall, can cause injury. [6] X Research source"
    },
    {
      "title": "Allow yourself time to acclimate to the motion.",
      "content": "Allow yourself time to acclimate to the motion. Humans rarely naturally experience the rapid shift in momentum necessary to run up and over walls. Due to this, the motion will likely feel foreign to you for some time. Focus on clean, smooth, and consistent technique, until the motions become second nature. You may find that your early attempts end in you kicking off and away from the wall instead of running up and over it. This is completely natural, and will still help you become familiar with this move's mechanics."
    },
    {
      "title": "Set and achieve wall run goals.",
      "content": "Set and achieve wall run goals. This kind of practice works well with tall walls. Using tape and a ladder, mark off several heights at regular intervals along the face of the wall. These will be your targets while practicing. As you reach a new target, move on to the next target until you're reached the top of the wall or your vertical limit. As you practice this move, you should notice your technique improve and your body strengthen. These advances should also lead to a higher maximum height. For some, it might take days, weeks, or months of practice before maximum height can be achieved. The height of the wall will not change your wall run technique. Walls that are especially high will only require more steps up the wall for you to achieve increased vertical distance."
    },
    {
      "title": "Attempt running up and over different kinds of walls.",
      "content": "Attempt running up and over different kinds of walls. Walls can be made from many different kinds of material, and some of these will be more slippery than others. You may also find that some pairs of shoes don't grip well and should be avoided. To be able to execute this move whenever necessary, you'll need to be comfortable running up and over most surfaces. Always take it slow when running up a new or unfamiliar wall. If the wall is unexpectedly slippery, you could get hurt or injured. Trying out different kinds of walls will also familiarize you with the kinds you should avoid. Some walls may be too smooth to run up without special tools or assistance. [7] X Research source"
    },
    {
      "title": "Train yourself physically.",
      "content": "Train yourself physically. This kind of maneuver requires quick reflexes and strength. By training these along with functional movement and cardio, you can improve your wall run a great deal. Some exercises that might help include: Running Doing bodyweight squats and jump squats Doing push ups Doing leg lifts Doing leg presses Doing calf raises Doing pullups [8] X Research source Grip exercises are also a great idea, so do some wrist curls to strengthen your forearm extensors. You're going to need your leg muscles the most. Whenever you're climbing a wall, don't rely on your arms and your grip strength because that'll wear out quickly."
    },
    {
      "title": "Join a parkour group.",
      "content": "Join a parkour group. Parkour is a discipline where people train their reflexes and physical ability through obstacle course exercises. The wall run is a common parkour move, and you might be able to get some pointers on how to do it at a local meetup. Facebook can be a valuable resource for finding local parkour groups that practice near you. These events frequently take place at playgrounds, parks, and universities. [9] X Research source"
    }
  ]
}