{
  "url": "https://www.wikihow.com/Say-Seal-in-French",
  "title": "How Do You Say \"Seal\" in French? (And More French Vocab)",
  "steps": [
    {
      "title": "The French word for seal is “phoque” (pronounced as “fok”).",
      "content": "The French word for seal is “phoque” (pronounced as “fok”). Yup, the viral TikTok is totally on the money—the French word for the adorable sea mammal is, in fact, “phoque.” [1] X Research source The word “phoque” (fok) sounds extremely similar to a popular English expletive word, but with an “oh” vowel sound instead of an “uh.” [2] X Research source This is a masculine word in French, so you’d use masculine articles like “le” and “un” to say “the” and “a,” respectively. Example Sentence: Le phoque est très mignon (leh fok eh treh mi-nyon): the seal is very cute."
    },
    {
      "title": "A “bébé phoque” is a baby seal.",
      "content": "A “bébé phoque” is a baby seal. The viral TikTok is right about this, too. A baby seal is called a “bébé phoque,” which is pronounced as “beh-beh fok.” [3] X Research source"
    },
    {
      "title": "A “maman phoque” is a mother seal.",
      "content": "A “maman phoque” is a mother seal. In the TikTok, the user makes a joke that a mother seal is a “mother phoque-er.” Obviously, this isn’t the correct translation—you’d actually say “maman phoque” (mah-mahn fok), which translates to “mother seal.” For example, “maman phoque et bébé phoque” (mah-mahn fok eh beh-beh fok) translates to “mother seal and baby seal.” [4] X Research source To say \"father seal,\" use \"papa phoque\" (pah-pah fok)."
    },
    {
      "title": "\"Joint\" is the word for a seal on an opening.",
      "content": "\"Joint\" is the word for a seal on an opening. You know the rubber seal that goes around your refrigerator door, or the seal along the bottom of your door? In French, you’d call either of these a “joint” (jwin)."
    },
    {
      "title": "\"Sceau\" refers to a physical stamp or seal.",
      "content": "\"Sceau\" refers to a physical stamp or seal. Have you ever seen those fancy symbols or icons that are sometimes used on fancy documents? In French, this is often called a “sceau” (so). A famous example of this is the “The Grand Seal of France,” also known as “Le Grand Sceau de France” (leh ɡran so duh frans). [5] X Research source “Cachet” (ka-shè) is another word for seal or stamp in French. [6] X Research source"
    },
    {
      "title": "\"Sceller\" (sé-lé) is the French verb for “to seal something shut.”",
      "content": "\"Sceller\" (sé-lé) is the French verb for “to seal something shut.” You’d use this verb to describe physically sealing something, like a door or a window. [7] X Research source When conjugated, the root of the verb is pronounced like “sell.” Example: “Je scelle la porte” (je sell la pawrt) translates to “I seal the door.” The verb “colmater” (kol-ma-té) also means “to fill in.” [8] X Research source The verb “fermer hermétiquement” (férmé ér-mé-tik-man) can also mean “to tightly seal.”"
    },
    {
      "title": "\"Cacheter\" means “to seal up.”",
      "content": "\"Cacheter\" means “to seal up.” The verb “cacheter” (ka-she-té) also means “to seal.” Similarly, the verb “décacheter” (dé-ka-she-té) means “to unseal.” [9] X Research source Example: “Je cachette l’enveloppe” (je ka-shèt l’an-ve-lop) means “I seal the envelope.”"
    },
    {
      "title": "\"Régler\" means “to settle” something, like a decision.",
      "content": "\"Régler\" means “to settle” something, like a decision. In a story, the author might say that a character “seals” their fate after making an important decision. This type of “sealing” translates to “régler” (ré-glé), the French verb for settling on a choice. [10] X Research source Example: “Elle règle son destin” (èl règl soh dés-tin) translates to “She decides her destiny.” You can also use the verb “conclure” (kon-klur) to talk about finalizing or “sealing” an agreement with someone, like an author signing off on a book deal. As an example, “Je conclus l'accord” (je kon-kloo l’a-kor) translates to “I make the deal.”"
    }
  ]
}