{
  "url": "https://www.wikihow.com/Respond-to-Date-Cancel-over-Text",
  "title": "11 Messages to Send When a Date Cancels over Text",
  "steps": [
    {
      "title": "First things first, send a polite acknowledgment.",
      "content": "First things first, send a polite acknowledgment. You might be feeling a lot of things right now, including frustration, insecurity, and anxiety. That’s understandable—being bailed on hurts! But keep in mind that your date may be feeling anxious too—especially if you wait too long to reply. They may worry they’ve upset you, or that you didn’t receive the text and are waiting for them to show. [1] X Research source Remember, you don’t have to say everything at once: you can acknowledge their text so they know you got it, and then respond more fully later when you have collected your thoughts and emotions. [2] X Research source The most important thing is to not tailspin/jump to conclusions. Dating makes us all vulnerable, and the feeling of rejection—whether we are actually being rejected or not—can cause us to react rashly. [3] X Research source Also consider: “I appreciate the heads up.”"
    },
    {
      "title": "Respond to your date’s cancellation with grace.",
      "content": "Respond to your date’s cancellation with grace. Regardless of whether they go into detail in their text, try to keep an open mind, and don’t take their bailing too personally. [4] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source A gracious response will also put your date at ease: by reassuring them that it’s OK to cancel, you’re signaling that the lines of communication are still open and that you’re up for trying again. Keep things in perspective: remember everyone feels rejection or disappointment at some point—you may have even canceled on a date before yourself! [5] X Research source This strategy will help you in the long run, too: studies show people who give others the benefit of the doubt tend to be happier in their relationships than people who assume the worst! [6] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source But if you are struggling with disappointment, don’t pretend you aren’t. If you want to try again with them, do it without holding a grudge. [7] X Research source Also consider: “No worries,” “That’s cool,” or “We’ve all been there.” The last text in particular will show them not only that you are sympathetic, but that you can relate to their position."
    },
    {
      "title": "Be supportive",
      "content": "Be supportive , but don’t pry. If your date hasn't given you a specific reason for canceling, a supportive response may encourage them to open up to you. But keep in mind that if you don’t know one another well, your date may not feel comfortable telling you if a personal emergency has occurred, and that’s perfectly fine. Depending on the reason for their cancellation, also consider: “Let me know if I can do anything” or, even more direct, “What can I do to help?”"
    },
    {
      "title": "Signal your interest without putting pressure on the situation.",
      "content": "Signal your interest without putting pressure on the situation. They will be relieved to know you are still interested in dating and that you aren’t too upset that they’ve bailed. And if the situation that caused them to cancel is too overwhelming, they may not be able to reschedule right away, and they will appreciate your putting the ball in their court. If you aren’t able to pin them down for a date at some point within the next two weeks, it might be a sign to move on. [8] X Research source Also consider: “I look forward to trying again in the future.”"
    },
    {
      "title": "Get right to the point, while still being low-pressure.",
      "content": "Get right to the point, while still being low-pressure. The ball is still in their court, but by asking a direct question, you can figure out if they are serious about seeing you, or if they aren’t interested in trying again. “What’s next week like for you?”"
    },
    {
      "title": "Take the initiative.",
      "content": "Take the initiative. Making concrete plans will show them you’re serious about getting together. [9] X Research source While putting the ball in their court is one way of taking some pressure off the situation, the opposite can also give your date some relief: by taking the reins yourself, you’re not only showing them you’re still interested in dating, you’re lifting the burden to salvage the plans off their shoulders. If your plans were for something that can’t be rescheduled, like a concert, try reconfiguring your plans: “Maybe we can listen to the new album together over dinner tomorrow instead.”"
    },
    {
      "title": "Kindly let them know how it made you feel.",
      "content": "Kindly let them know how it made you feel. Being bailed on hurts! You have every right to feel upset or even rejected—and it can be healthy to open up about your disappointment . [10] X Research source Not only will it help you to be up front with your emotions, but it may reveal to your date how much you care. But make sure to show understanding, as well. Assuring them you understand will alleviate any guilt they may feel over canceling your date. “I’m sorry we couldn’t make tonight work.”"
    },
    {
      "title": "Make other plans.",
      "content": "Make other plans. You don’t need to lose out on a fun night just because your date was canceled. Text a friend and see if they want to meet for dinner, or go check out that bar you’ve been wanting to try. There’s no reason you can’t still have a great night. Your date will be relieved to know that your night has been salvaged. Making other plans will also show your date that you are independent and lead a full life, which may make them all the more interested in you."
    },
    {
      "title": "There’s nothing wrong with asking for more info.",
      "content": "There’s nothing wrong with asking for more info. If bailing is a common theme with this person, or if their reasons for canceling are ambiguous, respectfully prod them for more information . They may not realize they need to provide more context, or they may be struggling with something that keeps them from sticking to plans. [11] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Their reaction to your confrontation will also tell you something about them: if they are apologetic and receptive to discussing the issue with you, it may be an indicator they are worth another shot. “I thought everything was going well. Is anything wrong?” “It hurts when you cancel last-minute. Can we talk about it?”"
    },
    {
      "title": "Their canceling might be a sign to let go.",
      "content": "Their canceling might be a sign to let go. If they’re a chronic bailer, or if their text was off-putting or unkind, or if for whatever reason you don’t feel like giving them another chance, break things off . Be gentle but clear. [12] X Research source You can be vague—“Unfortunately, I don’t think we should see each other anymore”—or specific—“I don’t feel like a priority, so this isn’t going to work for me.”"
    },
    {
      "title": "Not responding may feel rude, but some situations warrant it.",
      "content": "Not responding may feel rude, but some situations warrant it. If you haven’t met your date in person before, or if you’ve only met once or twice, in the age of app dating, ghosting is a common way to indicate you’re no longer interested . It’s important to listen when your gut says not to engage with someone: it might feel callous, but your safety and comfort come before politesse. [13] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source"
    }
  ]
}