{
  "url": "https://www.wikihow.com/Run-Away-from-Home-and-Live-in-the-Woods",
  "title": "How to Run Away from Home and Live in the Woods",
  "steps": [
    {
      "title": "Think it through.",
      "content": "Think it through. Running away from home should be a last-ditch resort, and never a first choice. Similarly, trying to live in the woods on your own should never be your first choice. Make sure you have no other options (like calling the police if you live in an abusive situation or going to a homeless shelter instead of the wilderness) before you try to run away and live in the woods. [1] X Research source Living in the woods is dangerous, draining, and scary. You will likely go hungry and thirsty at times, go without sleep at times, and may even die, or develop a constant sense of paranoia. Only run away into the woods if you have no other options."
    },
    {
      "title": "Plan your escape.",
      "content": "Plan your escape. You need to think through how and when you'll run away from home, what you'll bring with you, and how you'll get to your destination without being stopped by authorities. Plan an escape route. Especially if you live a few floors up from the ground or in a heavily populated area, you'll need a detailed but flexible plan for getting to the place you intend to stay."
    },
    {
      "title": "Start packing.",
      "content": "Start packing. Get a bag or backpack for your items; make sure to take something that is easy for you to carry and can hold everything you'll need. You will need a few bottles of water--a human typically needs at least gallon of water for drinking, cooking, and washing each day, so bring a lot. Then, pack a knife for cutting rope or food, matches or other firestarters, water purification tablets, canned and nonperishable food including Meals Ready to Eat (MREs), rope, wire, fishing hooks, extra clothing, a good wilderness survival book (such as the U.S. Army Survival Handbook or the SAS Survival Guide, which is available in a convenient pocket size), supplies for personal hygiene (such as soap, shampoo, and toothpaste), a few flame-safe pots or dishes for cooking, good walking shoes and extra socks, heat packs, a basic first aid kit (with bandages, antiseptic, basic pain relievers and allergy medication, and a first aid guidebook at the very least), a poncho for when it rains, and a map and compass, at the bare minimum. If you want, you can take your cell phone (just keep in mind that it can be tracked unless you specifically disable it). Remember that the battery will run down quickly and you won't be able to recharge it without returning to civilization or bringing along a solar phone charger. If you bring your phone, you can call for help once you are away from the family members that made you run away."
    },
    {
      "title": "Find shelter.",
      "content": "Find shelter. Once you have decided to run away, your top priority is shelter. The most important part of shelter isn't a roof over your head, though--it's something to put between you and the ground when you sleep. A sleeping bag is ideal, but if you don't have the chance to take one with you, use whatever you can--piles of leaves, old newspapers, or a layer of spare clothes spread on the ground--to keep your body as removed from the ground as possible while you sleep. The last thing you need is for the ground to leech your body heat in the middle of the night. Do whatever it takes to ensure you don't sleep on bare ground. Once you have something between you and the ground, go about finding something for shelter from the rain and sun. If you can carry or find a plastic tarp, you can stretch it between two trees and weigh the sides down with rocks. You can also use other materials in your new camp site and make it stronger. Roots can be used as rope and leaves can add to waterproofing. If you're in a cold climate, use piles of leaves against the walls of your shelter or heaped over yourself as insulation. [2] X Research source You may want to check out this article on making a survival shelter: https://www.wikihow.com/Build-a-Survival-Shelter . If you are surrounded by snow in the winter, build an igloo type of shelter. You can dig down into the snow and build up the walls around you. Make certain to leave holes for ventilation that won't be blocked by any falling snow, so you won't suffocate. You really don't need to be on your own when it is snowing, and a homeless or youth shelter or 24-hour public place is always a better choice, but in an emergency this can be a good shelter."
    },
    {
      "title": "Practice good fire safety.",
      "content": "Practice good fire safety. When you're camping out, it can get bitterly cold outside. Always make sure to practice good fire safety, like making sure to keep the fire away from anything flammable and keep smoke out of your shelter. [3] X Research source"
    },
    {
      "title": "Find and maintain a water supply.",
      "content": "Find and maintain a water supply. The most important thing after shelter is water. A human will die without water for three days, so set about finding a reliable way of obtaining some as soon as possible. NEVER drink water that has not been purified. There are several ways of purifying your water--you can boil and filter it, use a solar-powered distiller, or use store-bought water purification methods like a portable water filter or purification tablets. Always follow instructions for store-bought purifiers closely, and if you doubt the safety of the water, don't drink it. Never drink water from sources with a number of dead animals or skeletons around it--the water may be poisonous. Never drink cloudy water without filtering out particulates, but never assume that clear water is safe to drink, either. [4] X Research source Don't ration your water supply while searching for a new one--your body can't ration water, and hikers have been known to die with drinkable water left in their canteens. Better that you stay fully hydrated and functional for as long as you can, and are able to return to society if you can't find a water source."
    },
    {
      "title": "Once you have shelter and water taken care of, it's time to think about food.",
      "content": "Once you have shelter and water taken care of, it's time to think about food. A lot of plants and animals can make you sick or even kill you if you eat them, so be sure that whatever you put in your mouth is safe. The most basic rules to remember are to avoid mushrooms and avoid anything that's already dead when you find it (unless it's dead because it's been caught in your trap). Always test foods using the Universal Edibility Test ( https://www.wikihow.com/Test-if-a-Plant-Is-Edible ) prior to consuming them unless you are 110% certain that you know what plant you're eating and that it's safe. Always properly clean and cook animals you trap prior to eating them. Don't discount bugs as a source of food and nutrition, but do make sure to prepare them properly. [5] X Research source"
    },
    {
      "title": "Tell someone where you're going.",
      "content": "Tell someone where you're going. If you do decide to give the woods a try, always tell a trusted friend or family member who won't tell the people you're running away from about the area you will go. You don't have to give exact coordinates but the general area is good in case you are hurt or bad weather is likely to endanger you. [6] X Research source"
    },
    {
      "title": "Trust your instincts.",
      "content": "Trust your instincts. One way to avoid a potential attack or disaster before it happens is to trust your instincts. Your intuition, combined with your common sense, can help get you out of trouble. For example, if you're running alone and you suddenly feel like you're being watched, or pick up some berries and get a bad feeling in your stomach, that could be your intuition telling you something. Your common sense would then tell you that it's a good idea to get back to where there are more people around, or drop the berries. If you feel like you are being followed, tell someone that will be able to help. Officers and teachers are best but if you are not near school, a store clerk can be just as helpful."
    }
  ]
}