{
  "url": "https://www.wikihow.com/Set-up-Email-on-an-iPad",
  "title": "2 Simple Ways to Add an Email Account to Your iPad",
  "steps": [
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. This is the grey cog icon. Be sure to update your iPad . This method will work for major email providers such as iCloud , Microsoft Exchange, Google , Yahoo!, AOL, and Outlook . If you have a less common provider or want to set up your work or school email on your iPad, you'll need to manually add your account ."
    },
    {
      "title": "Tap Apps.",
      "content": "Tap Apps . If you have iPadOS 17 or older, skip this step."
    },
    {
      "title": "Tap Mail.",
      "content": "Tap Mail . Your Mail settings will open."
    },
    {
      "title": "Tap Accounts.",
      "content": "Tap Accounts . This is towards the center of the page."
    },
    {
      "title": "Tap Add Account.",
      "content": "Tap Add Account . You'll see this below the Accounts header."
    },
    {
      "title": "Tap a provider.",
      "content": "Tap a provider. You'll see the logo for major providers here. Each will have their own sign-in page. [1] X Research source If you're using Gmail, you can also access your mail in the Gmail app. If you don't see your provider, use the next section to manually add your account."
    },
    {
      "title": "Enter your login details and tap Next.",
      "content": "Enter your login details and tap Next . Type your email address and password. This will look different depending on your provider. If you have two-factor authentication on, you may need to verify the connection via code or email."
    },
    {
      "title": "Select the services that you want to sync.",
      "content": "Select the services that you want to sync. In addition to mail, you can choose to sync the email account's Contacts, Calendars, Reminders, and Notes. If you don't want to sync this information, toggle the switch to the off (grey) position for each extra option. Just be sure the switch for Mail remains green."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . This is in the top-right corner. The email will be added to your Mail app."
    },
    {
      "title": "Verify your email address with Apple.",
      "content": "Verify your email address with Apple. If you're using a less common domain, or need to add your work or school email to your iPad, you'll need to use Apple's mail settings lookup tool to find the information you need, such as the incoming and outgoing server. Do the following: Go to https://support.apple.com/mail in a web browser. [2] X Research source Enter your email address in the field. Click Verify . Leave the webpage open or take a screenshot to reference later."
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. This is the grey cog icon."
    },
    {
      "title": "Tap Apps.",
      "content": "Tap Apps . If you have iPadOS 17 or older, skip this step."
    },
    {
      "title": "Tap Mail.",
      "content": "Tap Mail . Your Mail settings will open."
    },
    {
      "title": "Tap Accounts.",
      "content": "Tap Accounts . This is towards the center of the page."
    },
    {
      "title": "Tap Add Account.",
      "content": "Tap Add Account . You'll see this below the Accounts header."
    },
    {
      "title": "Tap Other.",
      "content": "Tap Other . This is the last option."
    },
    {
      "title": "Enter your name, email, and password, and tap Next.",
      "content": "Enter your name, email, and password, and tap Next . If desired, you can add a description of your account."
    },
    {
      "title": "Enter the incoming and outgoing server information.",
      "content": "Enter the incoming and outgoing server information. You can find this information on the same page where you verified your email account. If you aren't prompted to enter this information, skip this step."
    },
    {
      "title": "Select the services that you want to sync.",
      "content": "Select the services that you want to sync. In addition to mail, you can choose to sync the email account's Contacts, Calendars, Reminders, and Notes. If you don't want to sync this information, toggle the switch to the off (grey) position for each extra option. Just be sure the switch for Mail remains green."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . This is in the top-right corner. The email will be added to your Mail app."
    },
    {
      "title": "Check Fetch and Notification settings.",
      "content": "Check Fetch and Notification settings. If you aren't receiving any emails (or any new ones), you may need to change how the Mail app fetches data. [3] X Research source Do the following: Open Settings . Tap Apps . Tap Mail . Tap Mail Accounts . Tap Fetch New Data . Select Automatically ."
    },
    {
      "title": "Remove the email and add it again.",
      "content": "Remove the email and add it again. If you're still having issues with syncing your email account, remove it completely from the Mail app and add it again. To remove an account, do the following: Open Settings . Tap Apps . Tap Mail . Tap Accounts . Tap the account. Tap Delete Account twice."
    }
  ]
}