{
  "url": "https://www.wikihow.com/Remove-Deep-Stains-from-Dishes",
  "title": "How to Remove Deep Stains from Dishes",
  "steps": [
    {
      "title": "Wash dishes thoroughly to ensure that no food remains on their surfaces.",
      "content": "Wash dishes thoroughly to ensure that no food remains on their surfaces. If washing in a dish washer, make sure the dishes are placed on the uppermost dishwasher rack to avoid exposing the plastic to high temperatures. [1] X Research source Rinse and dry before continuing."
    },
    {
      "title": "Set the dishes in strong sunlight for at least two hours.",
      "content": "Set the dishes in strong sunlight for at least two hours. Sunlight has a bleaching effect on plastic, and a few hours of exposure can remove stains, and will help deodorize your plastic dishes. Leave your dishes stain side up in front of an open window, or in a suitable outdoor location where sunlight is plentiful. After a few hours, check to see if the stains have lifted. [2] X Research source"
    },
    {
      "title": "Try applying a solution of baking soda and vinegar.",
      "content": "Try applying a solution of baking soda and vinegar. Baking soda and vinegar are convenient options, and are effective at dissolving many common varieties of food stains. Either soak your plastic dishes in a solution of baking soda, vinegar and warm water (roughly 1 tbsp each of baking soda and vinegar for every cup of water) for 1-2 hours, or scrub the dish using a baking soda paste. According to house cleaning professional Raymond Chiu, \"You can make your own baking soda paste by combining a small amount of baking soda with just enough warm water\" to make it sticky. Alternately, you can use salt and lemon juice, instead of baking soda and vinegar, to create a scrubbing paste. Another common household alternative to baking soda and vinegar is rubbing alcohol, which can be applied via soaking, or simply by scrubbing the alcohol into the affected area of the plastic dish."
    },
    {
      "title": "Try using an oxygenating agent, like denture cleaner or a fizzing antacid tablet.",
      "content": "Try using an oxygenating agent, like denture cleaner or a fizzing antacid tablet. These products can be surprisingly effective at lifting stains out of plastic dishes, especially cups and bowls. Simply fill the cup or bowl with water and drop two denture cleaner or antacid tablets inside, and soak overnight before washing and rinsing. [3] X Research source"
    },
    {
      "title": "Soak the dishes in a solution of chlorine bleach.",
      "content": "Soak the dishes in a solution of chlorine bleach. Bleach is potent and somewhat hazardous, but is a good last-resort when other approaches have failed to remove stains. Carefully combine bleach and water at a ratio of roughly one part bleach per two parts water, then allow the plastic dishes to soak in the solution for 30 minutes, then thoroughly rinse the dishes. [4] X Research source Bleach is a very caustic substance, and you should be sure to wear rubber gloves to protect your hands from contact with it. Also make sure the space you are working in is well ventilated, so that the fumes produced by the bleach are safely dissipated."
    },
    {
      "title": "Spot-clean stained dishes using a baking soda paste.",
      "content": "Spot-clean stained dishes using a baking soda paste. House cleaning professional Raymond Chiu explains that \"baking soda is an excellent cleaner and odor neutralizer that's nonabrasive as well as nontoxic.\" To remove deep stains from your dishes, you'll need to introduce a solvent to dissolve the stain so that it can be washed away. Start with a tablespoon of baking soda, and add just enough water or white vinegar to make a sticky paste. Using a clean dish rag or scouring pad, scrub the stains vigorously with the solvent paste, then rinse. Lemon juice is another common household product which can function as a mild solvent, and is a good substitute for white vinegar."
    },
    {
      "title": "Use a soaking solution of baking soda and vinegar to remove deeper stains.",
      "content": "Use a soaking solution of baking soda and vinegar to remove deeper stains. If a baking soda paste has proven ineffective, you may need to allow the solvents more time to deeply penetrate any stains. In enough hot water to completely submerge your dish, dissolve roughly 1 tablespoon (15 ml) of baking soda and 1 tbsp of white vinegar per cup of water, then allow the stained dishes to soak in the solution for 1-2 hours. [5] X Expert Source Raymond Chiu House Cleaning Professional Expert Interview. 8 May 2020."
    },
    {
      "title": "Rinse the dishes, and evaluate any remaining stains.",
      "content": "Rinse the dishes, and evaluate any remaining stains. If the stains have faded somewhat, but not completely, you may repeat the baking soda and vinegar soak. If the soak has not been effective at removing the stains, you'll need to consider more heavy-duty solvent options."
    },
    {
      "title": "Try a more powerful solvent.",
      "content": "Try a more powerful solvent. If common household solvents have proven ineffective, you may need a more potent solvent to remove the stains on your dishes. Many brands and varieties are available. Whenever working with chemicals, be sure to follow any instructions on the product's package closely. Work in a well-ventilated area, and avoid exposure to any caustic chemicals by wearing rubber gloves. Rinse your dishes thoroughly after applying the solvent to ensure that none of it remains on the dish. Not all commercially available heavy-duty dish cleaners are appropriate for all types of dish. Read the packaging carefully, and familiarize yourself with your options before purchasing."
    },
    {
      "title": "Use care when bleaching ceramics.",
      "content": "Use care when bleaching ceramics. Chlorine bleach , or any product containing it, should not be used on ceramics or glazed china, as it may interact with, and ruin, the glaze. Oxygen bleach (usually used for laundry) can be used instead. Mix oxygen bleach powder in hot water, allow it to cool to room temperature, and allow your dishes to soak. This will remove most stains, even the crack-like \"crazing lines\" which may begin appearing as ceramics age. [6] X Research source A common alternative for removing stains on china is 20% hydrogen peroxide solution, which is available in most pharmacies. Simply apply the solution to the affected area of the dish, then wash and rinse thoroughly."
    },
    {
      "title": "Avoid scratching or chipping your dishes.",
      "content": "Avoid scratching or chipping your dishes. Breaks in the surface of a glass, china or ceramic dish will allow food and drink to enter, leading to deeper, more difficult-to-clean stains."
    },
    {
      "title": "Warm ceramic dishes before serving hot food.",
      "content": "Warm ceramic dishes before serving hot food. Sudden changes in heat can cause tiny fractures in the surface of ceramic dishes or china. You should avoid causing this by warming the dishes (for instance, by placing them near or on a warm oven) before serving hot food on them. [7] X Research source"
    },
    {
      "title": "Wash dishes promptly with warm water.",
      "content": "Wash dishes promptly with warm water. [8] X Expert Source Raymond Chiu House Cleaning Professional Expert Interview. 8 May 2020. This will prevent any food or drink remaining on the surface of the dish from setting in. Coffee and tea cups are especially important to clean immediately, since stains from these beverages tend to set in more quickly, and be much harder to remove. If you intend to store leftovers for a while, put the food into a container or dish you don't mind staining before putting it in the fridge. [9] X Research source"
    },
    {
      "title": "Wash dishes properly, using hot water.",
      "content": "Wash dishes properly, using hot water. Washing and rinsing dishes in water that is too cold makes it more difficult to remove grease, or food particles from a dish during washing, potentially leading to staining. [10] X Research source"
    },
    {
      "title": "Avoid water marks on glass dishes by using the correct amount of detergent.",
      "content": "Avoid water marks on glass dishes by using the correct amount of detergent. Using too much detergent in your automatic dishwasher can result in water marks. If your glasses frequently become water marked after washing, consider reducing the amount of detergent. If this doesn't work, consider trying a new detergent. [11] X Research source"
    }
  ]
}