{
  "url": "https://www.wikihow.com/Profile-People",
  "title": "How to Profile People",
  "steps": [
    {
      "title": "Know that profiling is a way of studying someone and not a guessing game.",
      "content": "Know that profiling is a way of studying someone and not a guessing game. Don’t mistake profiling as some psychic trick where you guess random facts about a person. Instead, remember that profiling is a sociological study tool typically used by law enforcement officials to better understand a person’s thoughts and feelings. Note that profiling is not an exact science, and that it takes time, focus, and patience to do properly. [1] X Research source Profiling is used in dramatic scenes throughout crime films and TV shows. While this skill can be used for intense, crime-solving purposes, you’ll probably use it to tune into the thoughts and feelings of your acquaintances and loved ones. Don’t verbally profile a person unless you have their permission."
    },
    {
      "title": "Use profiling to understand how people think.",
      "content": "Use profiling to understand how people think. Explore aspects of the social penetration theory, which states that a person’s thoughts, desires, and feelings are multilayered, like an onion. Use this theory to think about the basic information that people convey about themselves, versus the deeper thoughts and feelings that relate to their private life. Remember—when you profile a person, you’re trying to dig beneath that outer layer and gain new insight into the way they think and feel. Try to understand what separates that outer layer from a person’s innermost thoughts and feelings. According to social penetration theory, the outermost layer is a person’s “public image,” or how they portray themselves to other people. A person’s “middle layers” relate more to how they see the world. Social and political opinions can be categorized here. The “inner layers” include a person’s phobias, dreams, hopes, and religious beliefs. These are pieces of information that you can’t get from a basic conversation. The “core personality” is considered the central layer, and it includes very private information about a person."
    },
    {
      "title": "Profile someone to get a sense of their thoughts and feelings.",
      "content": "Profile someone to get a sense of their thoughts and feelings. Use profiling to get a vague sense of a person’s mood, thought process, and motivations. While this skill doesn’t give you mind-reading capabilities, you can use a person’s speech patterns, gestures, and behaviors to get a rough idea of how comfortable or uneasy a person feels in any given moment. Always use profiling as a way to understand someone better, instead of viewing the skill as some kind of magic trick. [2] X Research source Chances are, you won’t be using your profiling skills for any law enforcement purpose. Instead, use profiling as a way to understand how a person is feeling so you can interact with them in a more polite and productive way."
    },
    {
      "title": "Identify possible prejudices that can interfere with your profiling.",
      "content": "Identify possible prejudices that can interfere with your profiling. Take note of racial, gender, and other common stereotypes and prejudices that can have a negative impact on the way that you profile a person’s behaviors and speech patterns. Before you draw any conclusions, ask yourself if your profile is in any way influenced by the person’s physical appearance and social status. If the answer to this question is “yes,” then try redoing your profile without these stereotypes and prejudices. [3] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Try to identify any internalized prejudice right off the bat. If you automatically view someone differently because of their gender or race, take time to backtrack so you can view them from an unbiased perspective. If you’re having trouble connecting with other groups of people, try befriending someone from a different cultural background. This might help increase your understanding and open-mindedness in the profiling process."
    },
    {
      "title": "Establish someone's baseline behaviors before you start profiling them.",
      "content": "Establish someone's baseline behaviors before you start profiling them. While profiling in and of itself involves a lot of observation, you first need to study a person’s typical behavior to see how they act on a normal basis. Before establishing a profile, take a few days or weeks to observe someone’s posture, body language, facial expressions, gestures, and mannerisms. When you take time to establish a person’s baseline behaviors, you can be more aware of different mood and behavioral changes when you profile this individual later. [4] X Research source Profiling and establishing baseline behaviors both involve a lot of observation. Baseline behaviors set the standard, while profiling explores deviations in the way a person presents themselves. The baseline is related to the normal and abnormal cues that are presented through verbal and nonverbal communications."
    },
    {
      "title": "Examine a person’s standard posture as they go about their day.",
      "content": "Examine a person’s standard posture as they go about their day. Take note of how a person chooses to stand and carry themselves as they move from place to place. Do they stand confidently, or do they tend to cower and back away from conversation? You can draw different conclusions from people who move with authority and self-assurance versus people who stand and move with slouched posture. [5] X Research source You can get a lot of insight into a person’s ego level by watching their posture. Someone who walks with swagger has a lot more self-confidence than someone walking with hunched shoulders."
    },
    {
      "title": "Search for common patterns in body language.",
      "content": "Search for common patterns in body language. Look at the different ways people lean forward and backward, and what they do with their hands, arms, and legs. If a person is leaning away throughout a conversation, note that they might be trying to create distance. Similarly, remember that crossed legs and arms display an attitude of defensiveness. If a person doesn’t display these closed-off behaviors, you can safely profile that they feel relatively comfortable. [6] X Research source You can also tell a lot about a person’s nerves given how they act in a conversation. For instance, cuticle picking and lip biting are common nervous habits for different individuals. If a person hides their hands throughout a conversation, you can safely assume that they aren’t being completely upfront with you."
    },
    {
      "title": "Watch the usual way a person’s facial expressions change as they talk.",
      "content": "Watch the usual way a person’s facial expressions change as they talk. Try to detect any physical tics in a person’s facial expression that indicate how they’re feeling. Note that frown lines can point to a worried or negative attitude, while crow’s feet can indicate happiness or pleasure. Additionally, look for a clenched jaw or other tight muscles in the face, as these indicate tension. [7] X Research source While a clenched jaw doesn’t necessarily mean that a person is angry, it generally means that they’re tense and uncomfortable. Use the context of the conversation to figure out these behaviors. For instance, if you ask a friend for money while you’re eating dinner together, see if their facial expression or jaw tenses in any way. If you detect some kind of tense expression, you can assume that your friend isn’t happy with your request."
    },
    {
      "title": "Watch for aggressive language and behavior.",
      "content": "Watch for aggressive language and behavior. Try establishing a general baseline for what aggressive and angry behavior looks like in other people. Is a person overreacting to a small incident, or verbally berating an acquaintance? Pay attention to different scenarios to get an understanding of what aggressive behavior looks like on different occasions. [8] X Research source For instance, if a customer in a store is verbally harassing a sales associate, then the customer is exhibiting aggressive behavior. While aggressive behavior can be obviously detected through physical violence, you can also witness it through toxic, bullying behavior."
    },
    {
      "title": "Identify when a person lacks compassion and empathy.",
      "content": "Identify when a person lacks compassion and empathy. In different situations, take note of how different people react to sad and unsettling news. While people express grief, sadness, and discomfort in different ways, see if a person feels unaffected or unmoved by the suffering of others. If a person lacks empathy or compassion for other people, keep them on your radar, as they could be dangerous to spend time with. [9] X Research source People who are unable to display empathy and compassion tend to fall in the “psychopath” category."
    },
    {
      "title": "Pay attention to a person’s typical dress code.",
      "content": "Pay attention to a person’s typical dress code. Whether you’re at home or at work, take note of a person’s wardrobe choice for the day. Are they selecting a power suit and fancy shoes, or a pair of sweatpants and an oversized shirt? You can learn a lot about a person by noticing their preferences for formal and casual clothing, as well as the accessories they choose for their outfits. [10] X Research source For instance, a person wearing a suit and fancy shoes probably takes themselves more seriously than a person wearing casual, comfortable clothes. Pay attention to the accessories, tattoos, and other memorabilia a person has, and see if these items indicate any spiritual values or preferences."
    },
    {
      "title": "Compare someone's words and gestures to their baseline behaviors.",
      "content": "Compare someone's words and gestures to their baseline behaviors. Pick a specific day to profile a person. Observe their speech patterns and hand motions throughout the day. Does this behavior match up with how the person usually acts? If so, you can profile that the individual is in a normal mood, and not behaving any differently than they normally would. [11] X Research source For instance, if an expressive person starts hiding their hands in a conversation, you can profile that they aren’t being completely honest or open. Try to identify large changes in a person’s speech. If they start speaking casually to someone they usually use formal language with, you can assume that the person is in a friendly mood, or that they are becoming friends with the other individual."
    },
    {
      "title": "Examine their physical movement and posture for deviations.",
      "content": "Examine their physical movement and posture for deviations. Watch how the person carries themselves throughout the day. Observe your profiling target when they’re moving as well as when they’re standing still. If their posture seems sloppy or closed off, you can profile the person as upset or uncomfortable, depending on the circumstance. If the person seems confident and relaxed, you can profile that the individual in question feels comfortable. [12] X Research source Posture can also be situational in different conversations. If a person is speaking with someone that they don’t like, their posture will reflect that. For instance, a person will lean away from someone that they’re not close or friendly with."
    },
    {
      "title": "See if the person is willing to make eye contact.",
      "content": "See if the person is willing to make eye contact. Watch your profiling target as you speak with them, or as they speak with others. Pay attention to their eye movement as the conversation continues. Is the person able to maintain firm and comfortable eye contact, or is their gaze fleeting and downcast? If an individual isn’t willing to make eye contact, you can profile that they’re nervous and uncomfortable in the conversation. [13] X Research source If a person can’t make consistent eye contact, it might mean that they’re hiding something."
    },
    {
      "title": "Listen for any differences in their tone of voice.",
      "content": "Listen for any differences in their tone of voice. Speak with the person that you’re profiling, and take note of their intonation as they reply. Does the person speak in a normal, relaxed tone of voice? Note if your profiling target is mumbling, or if their speech seems more stiff and irritated than usual. Then, try drawing conclusions based on these different vocal cues. [14] X Research source For instance, if a person’s voice sounds rigid, they might be irritated or uncomfortable with some aspect of the conversation."
    }
  ]
}