{
  "url": "https://www.wikihow.com/Order-a-Martini",
  "title": "How to Order a Martini",
  "steps": [
    {
      "title": "Know your martini basics.",
      "content": "Know your martini basics. A standard, classic martini is made from gin and vermouth and garnished with an olive. [1] X Research source If you do not specify a different concentration of either gin or vermouth, the martini will be prepared with one part dry vermouth and four to five parts gin. Gin is an alcoholic spirit made from distilled grain or malt. The spirit is also flavored with juniper berries. Vermouth is a liquor made with wine, also known as a fortified wine, that is flavored with an infusion of herbs, flowers, spices, and other botanical ingredients."
    },
    {
      "title": "Ask for vodka instead of gin.",
      "content": "Ask for vodka instead of gin. Even though a classic martini is made with gin, a fairly recent trend is to opt for vodka, instead. You can specify this change at the start of your order, and it should be the first change you make if you decide to make it. Vodka refers to an alcoholic spirit made from distilled rye, wheat, or potatoes. On occasion, it is also made from fermented fruits and sugar, but these types of vodka are not often used in martinis. Older bars will almost always use gin by default, but in some newer bars, the bartender might use vodka as the default, instead. To be on the safe side, specify which one you want whenever you order a martini."
    },
    {
      "title": "Choose your liquor brand.",
      "content": "Choose your liquor brand. By default, you will be given the cheapest brand of gin or vodka available at the bar. If you are particular about your liquor brands, you should specifically state the brand you want in your martini. The cheapest, default brand is referred to as the \"well.\" If you do not have a preferred brand and are not familiar with the brands that are out there, ask the bartender about the different brands available at the bar. You can either pick one at random if you want to maintain appearances and pretend to know what you're talking about, or ask the bartender for his or her recommendation. If you decide to specify the brand of alcohol, you only need to state the name of the brand and not the name of the alcohol. For example, you would order \"Beefeater,\" not \"Gin Beefeater\" or \"Beefeater Gin.\" Similarly, you would order \"Vox,\" not \"Vodka Vox\" or \"Vox Vodka.\""
    },
    {
      "title": "Change the content, preparation, and presentation.",
      "content": "Change the content, preparation, and presentation. Among the various ways you can personalize your martini, you can change the ration of gin to vermouth, the way the cocktail is mixed, and the garnish the martini will be served with. It is not enough to merely know what your options are; learn the lingo to make your martini ordering experience go smoothly and to order your drink with class. If you only order a “martini,” some bartenders will ask you questions about how you want it prepared using the lingo. As a result, even if you want the drink in its most basic, generic form, you should still know what the related terms are."
    },
    {
      "title": "Order your martini wet, dry, or extra dry.",
      "content": "Order your martini wet, dry, or extra dry. These terms refer to the ratio of gin or vodka to vermouth. If you do not specify what you want, you will be served a martini with a standard ratio. A wet martini is a martini with extra vermouth. A dry martini refers to a martini with less vermouth in it. Ordering your martini very dry would mean that it only contains trace amounts of vermouth, if that. The bartender may roll the vermouth in the glass to coat it with a film without leaving any of the liquor itself in the glass upon serving the drink."
    },
    {
      "title": "Make it dirty.",
      "content": "Make it dirty. A \"dirty\" martini refers to a martini with olive juice or olive brine mixed in. The olive taste tends to be fairly potent, and the drink itself will usually become cloudy as a result of the addition."
    },
    {
      "title": "Try your martini with a twist or ask for a Gibson.",
      "content": "Try your martini with a twist or ask for a Gibson. By default, a martini is served with an olive. You can change the garnish using these terms, though. Order your martini with a twist if you want it served with a twist of lemon peel instead of an olive. If you decide to order your martini with a cocktail onion garnish, the name of the drink changes completely from martini to Gibson . In other words, you would ask for a Gibson, not a martini with a Gibson or a martini with an onion."
    },
    {
      "title": "Opt for a clean martini.",
      "content": "Opt for a clean martini. A clean martini refers to a martini served without a garnish. On the other hand, if you want an extra garnish—an extra olive, for instance—you can ask for that, as well. Note that asking for extra olive or extra garnish in general does not have any special terminology."
    },
    {
      "title": "Get it on the rocks, neat, or straight up.",
      "content": "Get it on the rocks, neat, or straight up. The option you choose will determine whether or not you get ice in your martini. In bar lingo, ordering a drink on the rocks means ordering it served over ice. The drink will stay cooler but may get diluted over time. If you ask for a neat martini, you are asking for the alcohol to be poured straight from the bottle and into the glass without any ice. As a result, the drink will be room temperature and will not be diluted at all. Asking for your martini up or straight up means asking for the gin or vodka to be chilled with ice, usually by shaking or stirring, and strained into the martini glass with no ice in the glass itself. This offers the most balance, since the alcohol is chilled but will not be diluted as the ice melts."
    },
    {
      "title": "Make it sweet or make it perfect.",
      "content": "Make it sweet or make it perfect. Dry vermouth is the standard type used, but if you would prefer something with a sweeter touch, these are the two options you should be familiar with. Ask to make your martini sweet if you want the bartender to use sweet vermouth instead of dry vermouth. Similarly, a perfect martini will use equal parts dry and sweet vermouth, creating a balanced flavor."
    },
    {
      "title": "Have the martini naked, shaken, or stirred.",
      "content": "Have the martini naked, shaken, or stirred. The choice you make will determine how the gin or vodka is mixed with the vermouth in your drink. A stirred martini is the most traditional way to mix a martini, and at most high-class bars, this is the default preparation method. [2] X Research source The alcohol is mixed in the glass with a special stirring rod. This produces a clear martini and, as many purists will claim, the most silky texture since stirring does not break up the oils in the gin. A shaken martini is mixed in a special cocktail shaker, in which it is literally shaken back and forth. This is fairly common for dirty martinis, but the downside is that shaking the alcohol tends to \"bruise\" or cause the oils to separate in the gin, leading to a cloudier drink. A naked martini refers to a martini in which all of the ingredients have been chilled in a freezer. The alcohol will then be poured straight into a chilled cocktail glass and served without mixing."
    },
    {
      "title": "Know what you want before you approach the bar.",
      "content": "Know what you want before you approach the bar. In a packed bar, good etiquette means knowing what you want before you approach the bartender. A good bar will not rush you along, but nonetheless, you should know as much about what you want as possible before talking with the bartender. A possible exception, however, would be if you are inquiring about the brands of gin or vodka available. Also note that if the bar is not particularly crowded, you might be able to take a bit more time ordering, especially if you can tell that no one else is waiting to place a drink order."
    },
    {
      "title": "Get the bartender's attention.",
      "content": "Get the bartender's attention. Have a firm presence but be polite. The most appropriate way to get a bartender's attention is to stand at the bar in a spot where you can be seen. Establish eye contact and offer a smile. These actions alone should be enough to tell a good bartender to walk over once he becomes available. When ordering for someone else, make sure you know what that person wants before getting up to the bar. Do not call back and ask for his or her order after you have already caught the attention of the bartender. Moreover, if you are ordering for more than just yourself, you should have enough money in your hand to suggest as much. Do not wave the money around, though, as this is considered a sign of rudeness. Never try to get the bartender's attention by waving your money, snapping your fingers, or yelling."
    },
    {
      "title": "Put it all together.",
      "content": "Put it all together. Once you have the bartender's attention, it is time to tell him what you want. Use the lingo you learned to order your martini. Call your base first, specify your preferred concentration of vermouth, indicate if you want ice, ask for your garnish, and finish off with how you want the bartender to mix it together. For example, order a martini with Beefeater, extra dry and with a twist, straight up if you want a martini made with Beefeater brand gin and very little vermouth. It will have a lemon twist, and the gin will be chilled with ice before being strained into the cocktail glass. As another example, order a dirty martini with vodka, wet and shaken if you want a martini made with the cheapest vodka at the bar, extra vermouth, and olive brine. It will have the standard olive garnish, and it will be mixed with ice in a cocktail shaker."
    }
  ]
}