{
  "url": "https://www.wikihow.com/Sew-a-Hole-in-Jeans",
  "title": "How to Mend a Hole in Jeans by Hand",
  "steps": [
    {
      "title": "Trim the frayed edges with fabric scissors.",
      "content": "Trim the frayed edges with fabric scissors. Before sewing over the hole, trim excess thread around the edges of the hole with fabric scissors . This will make it easier to sew the hole closed and reduce the visibility of the seam. [1] X Research source"
    },
    {
      "title": "Thread a heavy-duty needle and tie a knot for security.",
      "content": "Thread a heavy-duty needle and tie a knot for security. Use all-purpose polyester thread that matches the color of your denim. [2] X Research source Slip the thread through the eye of a heavy-duty needle until about 18 inches (46 cm) extends from either side of the needle's eye. Then, cut the ends and tie a knot to secure. Use a 90/14 needle for light- and medium-weight denim or a 100/16 needle for heavyweight denim. [3] X Research source"
    },
    {
      "title": "Turn the jeans inside out and insert the needle below the hole.",
      "content": "Turn the jeans inside out and insert the needle below the hole. Weave your needle from the inside of your jeans 0.5 inches (1.3 cm) from the hole. This anchors the thread at the strongest point in the denim, allowing you to fully cover the hole. [4] X Research source If the denim isn’t strong enough on the edges, insert the needle 1 inch (2.5 cm) from the edge of the hole instead."
    },
    {
      "title": "Weave vertical straight stitches across the back of the hole.",
      "content": "Weave vertical straight stitches across the back of the hole. With your needle inserted, pull the thread through. Grab one edge of the hole with the needle and straight stitch across the hole to the other edge. Move the needle below the new stitch to create another vertical stitch. Repeat this process, working from side to side until the length of the hole is stitched. [5] X Research source Tug on the thread after every few stitches to close the hole. [6] X Research source A straight stitch allows you to move in and out of the fabric in a straight line to mend fabrics. [7] X Research source Use a sewing machine's straight stitch or running stitch setting. Cut a small piece of fabric to act as a patch—don’t worry, the stitches will cover it! Move the fabric back and forth as you press on the machine’s peddle until the hole is secured. [8] X Research source"
    },
    {
      "title": "Tie off the thread inside your jeans.",
      "content": "Tie off the thread inside your jeans. After sewing the hole shut, add 0.5 inches (1.3 cm) worth of stitches to ensure the hole won’t rip again. Then, tie off the thread inside the jeans to secure the stitches.. [9] X Research source"
    },
    {
      "title": "Trim the hole's frayed edges and cut a piece of matching fabric.",
      "content": "Trim the hole's frayed edges and cut a piece of matching fabric. For a clean look, trim away the frayed edges of the hole with fabric scissors. Purchase a denim patch or use matching denim fabric. Measure the width and length of the hole and add 0.5 inches (1.3 cm) on all sides. [10] X Research source For example, for a hole that’s 3 inches (7.6 cm) by 4 inches (10 cm), make a 3.5 inches (8.9 cm) by 4.5 inches (11 cm) patch. If the fabric is weak on the edges of the hole, add more length to your measurements to ensure you're sewing into strong areas of the denim fabric. Professional Tailor David Pew recommends finishing the patch's edges with a serger or pinking shears so the patch doesn't fray. [11] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021. Alternatively, opt for patterned fabrics to upcycle your jeans and give them a brand-new look."
    },
    {
      "title": "Apply fabric glue along the outside edges of the patch.",
      "content": "Apply fabric glue along the outside edges of the patch. Put a thin line of bonding web —or iron-on fabric glue —along the edges of the patch. Make sure you don't put the glue further in than 0.5 in (1.3 cm) inside the edges, or it will show inside the hole. [12] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021. Alternatively, pin the patch in place, but remember to remove each pin as you sew."
    },
    {
      "title": "Flip the garment inside out or slip the patch under the hole.",
      "content": "Flip the garment inside out or slip the patch under the hole. It’s easiest to turn the garment inside out to attach the patch. However, you can also carefully slide the patch inside the leg of the jeans for the most subtle fix. Pew advises pressing the edges of the hole onto the glue on the patch's edges. [13] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021. If you prefer, you can put the glue on the top of the patch."
    },
    {
      "title": "Use a zigzag stitch to secure the patch's edges and fasten with a knot.",
      "content": "Use a zigzag stitch to secure the patch's edges and fasten with a knot. Pew recommends a heavy-duty needle to sew tiny zigzag stitches so that they won't be visible. [14] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021. Poke the threaded needle through the front of the fabric and stitch a vertical line. Return to the starting point and move the stitch diagonally across. Bring the needle back through the front with a vertical stitch, make another diagonal stitch, and repeat for the length of the hole. When you’re done, fasten with a knot. [15] X Research source A sewing machine works best for sewing a patch into place. Set your sewing machine to the zigzag setting, and sew around the outer edges of the patch to secure it. Be careful not to sew across the pins because this may damage your machine."
    }
  ]
}