{
  "url": "https://www.wikihow.com/Reset-a-Water-Filter-Light-on-a-Whirlpool-Refrigerator",
  "title": "How to Reset the Water Filter Light & Change the Filter on Whirlpool Fridges",
  "steps": [
    {
      "title": "Locate your refrigerator’s control panel.",
      "content": "Locate your refrigerator’s control panel. Your French door refrigerator’s control panel displays the water filter status (as well as other controls) and is what you use to reset the light. The panel is typically on the exterior of one of the doors or on the ceiling inside the fridge. [1] X Research source On some models, like bottom mounts, the panel is on the very top of the fridge when you open both doors. [2] X Research source The control panel usually has physical buttons or uses a touch screen. If you can’t find your refrigerator’s control panel, consult your fridge’s user’s manual."
    },
    {
      "title": "Option 1: Hold the “RESET FILTER” button for 3 seconds.",
      "content": "Option 1: Hold the “RESET FILTER” button for 3 seconds. If your refrigerator’s control panel has this button, press and hold it for 3 seconds. When the filter is reset, the light changes to blue and “REPLACE FILTER” disappears from the screen. [3] X Research source On some models, the button is labeled “FILTER RESET.”"
    },
    {
      "title": "Option 2: Press “OPTIONS,” “LOCK,” and “MEASURED FILL.”",
      "content": "Option 2: Press “OPTIONS,” “LOCK,” and “MEASURED FILL.” Use this method if your control panel has an “OPTIONS” button. When the filter light is reset, “Order” and “Replace” disappear from the screen. [4] X Research source"
    },
    {
      "title": "Option 3: Hold the “LIGHT” and “ICE TYPE” buttons for 3 seconds.",
      "content": "Option 3: Hold the “LIGHT” and “ICE TYPE” buttons for 3 seconds. Use this filter light reset method if your fridge’s control panel has these buttons. When the filter resets, the light turns off."
    },
    {
      "title": "Option 4: Hold “FAST COOL” and “ENERGY SAVER” for 3 seconds.",
      "content": "Option 4: Hold “FAST COOL” and “ENERGY SAVER” for 3 seconds. Use this method for bottom-mount fridges with a control panel on the top of the fridge. The panel counts down to 0 and makes a beep when the filter is reset. [5] X Research source If your fridge doesn’t beep, wipe the touchpad with a clean cloth and press the buttons again."
    },
    {
      "title": "Find your refrigerator’s control panel.",
      "content": "Find your refrigerator’s control panel. On most side-by-side refrigerators, look for the panel on the exterior of the freezer door. The control panel shows your refrigerator water filter status, resets the light, and controls other settings. [6] X Research source Most control panels either have physical buttons or a touch screen. Consult your fridge’s user’s manual if you can’t find the control panel."
    },
    {
      "title": "Option 1: Hold the “FILTER” button for 3 seconds.",
      "content": "Option 1: Hold the “FILTER” button for 3 seconds. When the filter resets, the “ORDER” and “REPLACE” icons disappear from the display. [7] X Research source Or, the display might count down to 0 and play a chime. [8] X Research source On some models, the light changes from orange to blue when the filter resets. The button might be labeled “WATER FILTER” on some models. If the filter light isn’t resetting, check that you are holding down the button rather than the lit-up icon."
    },
    {
      "title": "Option 2: Press “OPTIONS,” “LOCK,” and “MEASURED FILL.”",
      "content": "Option 2: Press “OPTIONS,” “LOCK,” and “MEASURED FILL.” If your control panel has an “Options” button, press it and then “LOCK” to enter into filter reset mode. Then, press “MEASURED FILL” to confirm the reset. When the filter resets, “Order” and “Replace” get removed from the display."
    },
    {
      "title": "Option 3: Press “MAX COOL” and “MAX ICE” for 3 seconds.",
      "content": "Option 3: Press “MAX COOL” and “MAX ICE” for 3 seconds. Use this method on touchpad control panels with these buttons. When the filter resets, the display counts down to 0, a chime plays, and the reset filter icon flashes. [9] X Research source"
    },
    {
      "title": "Option 4: Hold the “ICE” and “LIGHT TYPE” buttons for 3 seconds.",
      "content": "Option 4: Hold the “ICE” and “LIGHT TYPE” buttons for 3 seconds. If your refrigerator’s control panel has these buttons, hold them down at the same time until the reset filter icon disappears."
    },
    {
      "title": "Option 5: Press and hold the “TEMP SETTING” button.",
      "content": "Option 5: Press and hold the “TEMP SETTING” button. Use this method if your control panel has the “TEMP SETTING” button. When the filter resets, the water filter light turns off."
    },
    {
      "title": "Option 6: Press the refrigerator light switch 5 times.",
      "content": "Option 6: Press the refrigerator light switch 5 times. If your side-by-side fridge is an older model, open the refrigerator door and look for the light switch on the right side. [10] X Research source Then, press the switch 5 times within 10 seconds. [11] X Research source When the water filter resets, the light changes from red to green."
    },
    {
      "title": "Find your refrigerator’s water filter holder.",
      "content": "Find your refrigerator’s water filter holder. Depending on the style and model of your refrigerator, the water filter is either located inside your fridge or on the exterior. New side-by-side fridges : Open the refrigerator door and look for the water filter case in the top right corner. [12] X Research source Old side-by-side fridges : Look for the grill at the bottom of the fridge. Then, find the circular filter indentation on the freezer side. [13] X Research source French door fridges : The water filter case is either on the top right corner of the ceiling or on the bottom left corner. [14] X Research source"
    },
    {
      "title": "Open the water filter holder and remove the old filter.",
      "content": "Open the water filter holder and remove the old filter. New side-by-side fridges : Lift the water filter cover. Then, pull the old filter straight out. Old side-by-side fridges : Press the button next to the circular filter indentation to release the filter. Then, pull out the filter. [15] X Research source French door fridges with top right filter : Pull down the water filter cover. Then, twist the filter 90° to the left (counterclockwise) and pull it out. [16] X Research source French door fridges with bottom left filter : Press the water filter cover door. Then, twist the filter 90° to the left (counterclockwise) and pull it out. [17] X Research source"
    },
    {
      "title": "Insert the new water filter.",
      "content": "Insert the new water filter . Remove the colored cap on the top of the new filter. Then, simply insert it inside the water filter housing. New side-by-side fridges : Align the filter so the arrows on the bottom point up. Then, slide it into the housing and close the cover door. [18] X Research source Old side-by-side fridges : Twist the cap off the bottom of the old filter. Then, twist it onto the bottom of the new filter. Simply push the new filter into the housing until the button clicks into place. [19] X Research source French door fridges with top right filter : Insert the new filter into the housing and twist it 90° to the right (clockwise). Then, close the cover door. French door fridges with bottom left filter : Twist off the cap on the bottom of the old filter and put it on the new one. Then, insert it into the housing, twist it 90° to the right (clockwise), and close the cover door. [20] X Research source Order new water filters on Whirlpool’s website ."
    },
    {
      "title": "Run 4 gal (15 l) of water through the dispenser to activate the filter.",
      "content": "Run 4 gal (15 l) of water through the dispenser to activate the filter. This flushes out any water in your fridge that’s left behind from the old filter and ensures the new filter is working. [21] X Research source It’s normal for the water dispenser to pause and sputter as you flush out the system. If your water dispenser isn’t running water, you might have installed the water filter the wrong way. Just open the water filter cover again and realign the filter."
    },
    {
      "title": "Change the water filter every 6 months.",
      "content": "Change the water filter every 6 months. This helps ensure that your water is properly filtered and free from unwanted chemicals and minerals. It also helps reduce the chance of your filter getting clogged or damaged. [22] X Research source Or, wait to install a new water filter when the water filter light turns on on the control panel. Write the date on the bottom of the water filter when you install it. This helps you keep track of how old it is."
    },
    {
      "title": "Use Whirlpool-approved water filters.",
      "content": "Use Whirlpool-approved water filters . Whirlpool makes water filters for every refrigerator model that are designed to fit perfectly into your fridge. [23] X Research source Using the correct filter ensures that your fridge’s warranty is valid if your fridge breaks down."
    },
    {
      "title": "Take your fridge to a Whirlpool technician if it is faulty.",
      "content": "Take your fridge to a Whirlpool technician if it is faulty. If your filter or fridge breaks down, visit Whirlpool’s website to schedule an appointment with a technician. They have the expertise to diagnose and fix the problem. [24] X Research source Or, search online for a registered Whirlpool technician in your area."
    }
  ]
}