{
  "url": "https://www.wikihow.com/Measure-Arm-Length",
  "title": "How to Measure Arm Length",
  "steps": [
    {
      "title": "Stand up straight with your arms relaxed and at your sides.",
      "content": "Stand up straight with your arms relaxed and at your sides. Although you can measure your arm length on your own, you will get a better measurement if you have a partner who can take it for you. Avoid hunching forward or leaning as much as possible, as either may skew your measurement. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Keep your arms slightly bent, with your fingers in your pockets."
    },
    {
      "title": "Place one end of a measuring tape at the base of your neck.",
      "content": "Place one end of a measuring tape at the base of your neck. Position the measuring tape exactly in the center of your neck to get the most accurate measurement. [2] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021. Taking your measurements over the shoulder and down the hand will give you a precise reading, particularly if you are measuring your arm length for clothing. [3] X Research source"
    },
    {
      "title": "Measure your arm over the shoulder and down your arm.",
      "content": "Measure your arm over the shoulder and down your arm. Do not go measure down your back, as you will want to get the fullest arm length possible. Instead, go across your shoulder and down your arms. If you're not sure how to take this measurement, think about what a long-sleeved shirt seam will look like—this is approximately the length you will measure."
    },
    {
      "title": "Take your measurements to the area just past your wrist bone for clothing.",
      "content": "Take your measurements to the area just past your wrist bone for clothing. If you're taking sleeve measurements, finish measuring where you would like the sleeve or shirt cuff to sit. This should be around or just past your wrist bone, depending on how long you prefer your sleeve length to be. [4] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021. Consider adding just a little extra to this length for shirt sleeves. That way, when you reach forward, your sleeves won't ride up on your arms. [5] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021. If you're measuring for a coat, measure to the point where your wrist starts to widen into your thumb, and do not add any extra. [6] X Expert Source David Pew Professional Tailor Expert Interview. 5 January 2021."
    },
    {
      "title": "Continue measuring to your fingertips if measuring your full arm length.",
      "content": "Continue measuring to your fingertips if measuring your full arm length. If you're measuring arm length for fitness-related reasons, you may need to measure past your wrist. Measure all the way to your fingertips, stretching out your fingers as far as possible. [7] X Research source"
    },
    {
      "title": "Get a partner to measure your arm span.",
      "content": "Get a partner to measure your arm span. While you can measure your arm length on your own, you cannot measure your arm span by yourself. Ask a partner to hold the measuring tape while you position yourself to get a precise arm span."
    },
    {
      "title": "Stand upright with your back to a wall.",
      "content": "Stand upright with your back to a wall. Standing at your fullest height will allow your partner to take the best reading possible, as slouching can inhibit your arm span. If you cannot turn your back to a wall, stand up as straight as possible and avoid hunching your shoulders. [8] X Research source"
    },
    {
      "title": "Stretch your arms out as far as they will go.",
      "content": "Stretch your arms out as far as they will go. Avoid bending your arms or your fingers. Try to keep your arms level and even, as raising or lowering your arms can also decrease your full arm span. [9] X Research source"
    },
    {
      "title": "Measure between both of your middle fingers.",
      "content": "Measure between both of your middle fingers. Traditionally, arm span is measured between the middle finger of one hand to middle finger of your other hand. Have your partner take a measuring tape and measure from the tip of your middle finger on your left hand to the middle finger on your right hand. [10] X Research source Ask your partner to keep the tape measurer even to keep the measurement accurate."
    },
    {
      "title": "Compare your arm span to your height.",
      "content": "Compare your arm span to your height. Most people's heights are about equal to their arm spans, within a few inches or centimeters. Measure your height by yourself or with a partner to compare the two measurements. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}