{
  "url": "https://www.wikihow.com/Refinish-Brass",
  "title": "How to Refinish Brass",
  "steps": [
    {
      "title": "Use a magnet to determine if the item is solid brass.",
      "content": "Use a magnet to determine if the item is solid brass. Before you clean and refinish an item, you will need to make sure it is made of solid brass. Place a small magnet on the item you wish to refinish. If the item is made of solid brass, the magnet will not stick. If the magnet does stick, your item is likely brass-plated steel or iron. Do not attempt to remove old finish from a brass-plated item. Instead, simply wash the item with hot, soapy water."
    },
    {
      "title": "Put on protective gear.",
      "content": "Put on protective gear. You will be using paint stripper to remove the old finish from the brass. Protect yourself by wearing a mask, rubber gloves, and safety glasses. It is also a good idea to wear a long sleeved shirt and long pants to further prevent the paint stripper from coming into contact with your skin. [1] X Research source"
    },
    {
      "title": "Use a well-ventilated space.",
      "content": "Use a well-ventilated space. You do not want to inhale fumes from paint stripper. To avoid inhaling toxic fumes, work in a well-ventilated area. If possible, choose an outdoor area for your workspace. If working indoors, open as many windows as possible. [2] X Research source You should also wear a respiratory mask to protect yourself from potentially harmful fumes."
    },
    {
      "title": "Apply paint stripper to the object with a paintbrush.",
      "content": "Apply paint stripper to the object with a paintbrush. Pour a small amount of paint stripper into a disposable metal or glass can, like an old coffee can. Then use a paintbrush to apply the paint stripper to the entire area of the brass object. Allow the paint stripper to penetrate the old finish for as long as the product instructions suggest. [3] X Research source"
    },
    {
      "title": "Use a nylon brush to scrub the brass object.",
      "content": "Use a nylon brush to scrub the brass object. Once you allow the paint stripper to penetrate the old finish, use a nylon brush to scrub the old finish from the object's surface. You can also use steel wool, but this may scratch the surface of the brass object. Scrub the brass object until all of the old finish is removed. [4] X Research source"
    },
    {
      "title": "Clean the brass with hot, soapy water.",
      "content": "Clean the brass with hot, soapy water. Once you successfully remove the old finish from the brass, fill a sink with hot water and mild dish soap. Use a cotton or microfiber cloth to remove any remaining paint stripper. Rinse with clean water and repeat until the stripper is completely removed from the object. Dry with a soft cloth."
    },
    {
      "title": "Try lemon and salt.",
      "content": "Try lemon and salt. Once you successfully remove the old finish and wash and dry the brass item, you will need to polish the object. Cut a lemon in half and remove the seeds. Then sprinkle salt on the flesh of the lemon. Rub the lemon directly on the brass object and polish with a soft cloth until shiny. Once the object is shiny, wash with hot soapy water, rinse with cool water, and dry with a soft cloth. [5] X Research source"
    },
    {
      "title": "Make a polish with lemon and cream of tartar.",
      "content": "Make a polish with lemon and cream of tartar. Combine one part lemon juice with two parts cream of tartar. Mix the ingredients together with a spoon until they form a paste. Apply the paste to the brass object and let sit for 30 minutes. After half an hour, rinse with warm water. Then wash the item with hot, soapy water, rinse in cool water, and buff dry with a soft cloth. [6] X Research source"
    },
    {
      "title": "Use white vinegar and salt to polish brass.",
      "content": "Use white vinegar and salt to polish brass. Try pouring white vinegar directly on the brass object. Then sprinkle the surface of the object with table salt. Allow the salt and vinegar to sit on the object for about 5 minutes. Then use a wet cloth to wipe down the brass. Finally, wash the brass with hot, soapy water, rinse, and dry with a soft cloth. For stubborn stains, try soaking the brass object in white vinegar and gently wiping it with a microfiber cloth."
    },
    {
      "title": "Re-lacquer the brass.",
      "content": "Re-lacquer the brass. After you polish the brass, you will want to protect it by applying a protective coating to the surface. Try using a high-gloss urethane or UV-resistant clear lacquer to the brass object. Apply 3 or 4 coats of lacquer to the item, allowing the lacquer to dry completely between coats."
    },
    {
      "title": "Protect brass with olive oil or lemon oil.",
      "content": "Protect brass with olive oil or lemon oil. If you do not want to re-lacquer the brass, you can protect it with a coat of oil. Apply lemon oil or olive oil to a soft, dry cloth. Then use the cloth to apply a thin layer of oil to the brass object. Make sure you apply a very thin coat over the entire surface."
    },
    {
      "title": "Refresh the protective coating once a year.",
      "content": "Refresh the protective coating once a year. It is important that you rejuvenate the brass object's protective coating at least once each year. If the object has not tarnished, simply apply new layers or lacquer or oil. If you notice tarnish, remove the old coating, polish the brass, and apply a new protective coating to the object."
    }
  ]
}