{
  "url": "https://www.wikihow.com/Mouth-Breather-Face",
  "title": "What Is Mouth Breathing Face? Symptoms, Causes & Treatments",
  "steps": [
    {
      "title": "“Mouth breather face” is a facial structure caused by regular mouth breathing.",
      "content": "“Mouth breather face” is a facial structure caused by regular mouth breathing. Although it’s normal to breathe through your mouth occasionally (while exercising, if you’re congested, etc.), it’s actually not normal to breathe through your mouth at all times. [1] X Research source Chronic mouth breathing in childhood can affect the way your face develops, leading to distinctive features including: [2] X Research source A long, narrow face. Receding chin or receding jawline. Thin upper lip. Prominent upper teeth. Malocclusion (upper and lower teeth don’t align). Flatter facial features in general. Earlier signs of facial aging. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Facial changes may be due to poor tongue position and weak muscles.",
      "content": "Facial changes may be due to poor tongue position and weak muscles. Those who breathe through their nose usually have the ideal tongue posture (mouth closed, teeth almost touching, and tongue touching the roof of the mouth), which is linked to a sharper jawline. On the other hand, the act of mouth breathing causes the tongue to drop, and over time, the muscles that typically hold the tongue in the right posture become weaker and drag downward, which can lead to some of the facial differences mouth breathers experience. [4] X Research source"
    },
    {
      "title": "Consider cosmetic procedures.",
      "content": "Consider cosmetic procedures. If you’re already an adult and your face has finished developing, you won’t be able to reverse the effects of mouth breathing through lifestyle changes or facial exercises. [5] X Research source However, there are some cosmetic procedures available to address features you might be insecure about. These include: Dermal fillers to the jawline to create a more defined look. Kybella treatments, which melt fat beneath the chin to create a sharper jawline. Jawline enhancement surgery using part of the patient’s bone or an implant. Jawline surgery to align the upper and lower teeth. Chin implant surgery. [6] X Research source"
    },
    {
      "title": "Visit your doctor to address any breathing problems.",
      "content": "Visit your doctor to address any breathing problems. Since mouth breathing can cause health issues like poor sleep, it’s a good idea to check in with your doctor to see if there are any treatments available to get to the root of the problem. For example, your doctor may recommend surgery to address a deviated septum, allergy medication to address chronic congestion, or treatments to address sleep apnea. [7] X Research source"
    },
    {
      "title": "Try using makeup to define your jawline.",
      "content": "Try using makeup to define your jawline. First of all, it’s important to note that there is nothing wrong with having a “mouth breather face.” There are all kinds of facial structures and face shapes out there, and they’re all beautiful—you don’t need to change a thing if you don’t want to! However, if you do feel a little bit insecure about the softer jawline that may come with mouth breathing, you can always try contouring it with makeup to create a sharper look. Here’s how: “To make your jaw look more defined, softly sweep a contour shade along the edge of your jaw bone, softly blending toward your neck. This will create the illusion of a shadow and a sharper jawline,” explains makeup and beauty specialist Miranda Mendelson."
    },
    {
      "title": "Consider surgery to address enlarged adenoids or a deviated septum.",
      "content": "Consider surgery to address enlarged adenoids or a deviated septum. If your child is showing symptoms of mouth breathing (chronic runny nose or congestion, restless sleep, snoring, bad breath, etc.), talk to their pediatrician. If the cause of the mouth breathing is enlarged adenoids or a deviated septum, they may recommend surgery to address these issues and prevent further complications from mouth breathing. [8] X Research source"
    },
    {
      "title": "Mouth breathing can also have effects on your overall health.",
      "content": "Mouth breathing can also have effects on your overall health. Aside from its cosmetic effects, those who regularly mouth breath may experience certain issues with their physical and mental health. These include: Dry mouth and bad breath: Taking air in through your mouth dries up your saliva, and since saliva keeps your mouth clean, this can also lead to chronic bad breath. Snoring and sleep apnea: Chronic mouth breathers usually have some sort of condition or structural issue that makes it harder for them to breathe through their noses, leading to issues like snoring and sleep apnea. [9] X Research source Dental issues: Mouth breathing can cause malocclusion (misalignment of upper and lower teeth), which may need to be fixed through orthodontics. It can also increase the risk of cavities and gum disease. [10] X Research source Behavioral problems: Chronic mouth breathing has been linked to behavioral issues and sleep disturbances in children, similar to the issues children with ADHD experience. [11] X Research source"
    },
    {
      "title": "One major cause of mouth breathing is enlarged adenoids.",
      "content": "One major cause of mouth breathing is enlarged adenoids. “In little kids, there’s something called enlarged adenoids. Adenoids are lymphatic tissue in the back of your nose, which can cause a blocked nose,” explains Dr. Kieu. Since these enlarged adenoids make it harder for the child to breathe through their nose, they end up breathing through their mouth instead, which can lead to the development of “mouth breather face” and other symptoms."
    },
    {
      "title": "Any condition that blocks the nose can also cause mouth breathing.",
      "content": "Any condition that blocks the nose can also cause mouth breathing. For example, Dr. Kieu lists frequent allergies, congestion, or sinus infections as possible reasons for mouth breathing. The actual shape or structure of your nose may also be the culprit. A deviated septum (when the cartilage/bone dividing your two nostrils is off-center), polyps (benign growths inside the nose), and large turbinates (structures in the nose that filter air) can all lead to mouth breathing, says Dr. Kieu."
    },
    {
      "title": "Mouth breathing is linked to poor sleep.",
      "content": "Mouth breathing is linked to poor sleep. When it comes to sleep, medical experts agree that it’s better to be a nose breather than a mouth breather. If someone is breathing through their mouth at night due to a deviated septum or nasal blockage, they might spend a lot of time tossing and turning, which can cause them to wake up feeling not well-rested, explains Dr. Kayem. Mouth breathing is also linked to sleep apnea and snoring. [12] X Research source According to Dr. Kayem, addressing these issues can make a real difference when it comes to people’s sleep quality, and his patients have reported serious benefits. “They’ve gotten used to sleeping with their mouth open and they're tossing and turning, and then eventually they have it fixed and say, ‘Oh my god, I never realized that life could be this good,’” Dr. Kayem says."
    },
    {
      "title": "Nose breathing is more natural than mouth breathing, according to Dr. Kieu.",
      "content": "Nose breathing is more natural than mouth breathing, according to Dr. Kieu. When you breathe in through your mouth, you take air directly into your lungs without any filtering process. On the other hand, when you breathe through your nose, “It filters out small particles and pollen, moisturizes the air that you breathe, and warms the air that you breathe. Breathing from the nose is much more preferred than breathing through the mouth,” explains Dr. Kieu."
    }
  ]
}