{
  "url": "https://www.wikihow.com/Scan-on-a-Mac",
  "title": "How to Scan on Your Mac Using the Preview App, Image Capture, & More",
  "steps": [
    {
      "title": "Make sure you have the latest software for your scanner.",
      "content": "Make sure you have the latest software for your scanner. If your scanner requires special software, check that you have it installed and up to date. You may need to visit the scanner manufacturer’s website to download the most recent updates. [1] X Research source Most modern scanners and printer/scanner combos are compatible with macOS and will connect automatically with Mac’s built-in AirPrint software. [2] X Research source However, if you’re not sure, check the documentation that came with your scanner or visit the manufacturer’s website for more information."
    },
    {
      "title": "Plug in your scanner or multifunction printer.",
      "content": "Plug in your scanner or multifunction printer. In most cases, you'll connect it to your Mac with a USB cable that attaches from the scanner's (or printer's) port to the back or side of your Mac. If the scanner doesn’t have a USB-C connector, you’ll need to use an adapter for newer Macs. Alternatively, you can use a wireless-enabled printer or scanner through your local Wi-Fi connection. If you prefer to communicate with the scanner wirelessly, go through the setup procedure on your scanner. Make sure it is connected to the same strong wireless network as your Mac."
    },
    {
      "title": "Open the Apple menu and select System Settings.",
      "content": "Open the Apple menu and select System Settings . If you’re using an older version of macOS, this will be called System Preferences instead."
    },
    {
      "title": "Select Printers & Scanners.",
      "content": "Select Printers & Scanners . This option will appear in the menu pane on the left side of the System Settings window. You might have to scroll down to find it. In older macOS versions, it will be in the main System Preferences window."
    },
    {
      "title": "Click Add Printer, Scanner, or Fax….",
      "content": "Click Add Printer, Scanner, or Fax… . If you already see your scanner in the list, you can skip this step. If not, click the button at the bottom of the main Printers & Scanners window to add your scanner."
    },
    {
      "title": "Select your scanner from the list and click Add.",
      "content": "Select your scanner from the list and click Add . You should see a list of available scanners. Find yours and click it, then click the Add button at the bottom of the popup window. If you don’t see your scanner, make sure it’s connected to your computer correctly. If it’s connected wirelessly, double-check that the scanner and computer are on the same Wi-Fi network. The user manual that came with your scanner might have helpful information if you still aren’t able to find your scanner on the list."
    },
    {
      "title": "Place your document in your scanner.",
      "content": "Place your document in your scanner. The right way to do this depends on the type of scanner. For a flatbed scanner, the paper should go face-down in the scanner's tray. If you have a document-feeding scanner, put the pages you want to scan in the document feeder. [3] X Research source Different scanners might require you to feed the pages in either face-up or face-down."
    },
    {
      "title": "Open Preview.",
      "content": "Open Preview. If this app isn’t already in the Dock, you can find it by searching with Spotlight or checking in your Launchpad."
    },
    {
      "title": "Select File > Import from Scanner.",
      "content": "Select File > Import from Scanner . Click File in the menu bar at the top of the screen, then click or hover over Import from Scanner… . A pop-out menu will appear. If this option is greyed out in the menu, make sure your scanner is connected and set up correctly. If it’s connected wirelessly, make sure your Mac and scanner are both on the same network. You might also see Import from [your scanner’s name] in the main File menu."
    },
    {
      "title": "Select your scanner.",
      "content": "Select your scanner. You should see your scanner in the list of options that appear in the pop-out menu. Click on it to select it."
    },
    {
      "title": "Set your scanning options.",
      "content": "Set your scanning options. Next, a window will pop up where you can choose some settings for your scanning job. Depending on your scanner, you might also be able to see a preview of your document in this window. You can see additional options by clicking Show Details at the bottom of the window. For example, from this menu you can: Choose your document type under Kind . For instance, here is where you’d select from Text (if you’re scanning text or a high-contrast black and white image), Black & White (for scanning greyscale images), or Color (for color images). Use the Format menu to choose what type of file your scanned documents save as (e.g., JPEG, PDF, or PNG). Pick the correct size for your document under Size , or adjust the image quality with the Resolution settings. Use the Image Correction controls to adjust the color or exposure of the scanned document. Under Scan To , select a destination for your scanned documents. You can also do this after you’ve already completed the scan."
    },
    {
      "title": "Click Scan.",
      "content": "Click Scan . Once your scanner is finished, the scanned page(s) will appear in the main Preview window, where you can edit, rename, or save your scan."
    },
    {
      "title": "Launch the Image Capture app.",
      "content": "Launch the Image Capture app. This is a built-in app that comes with macOS. Look for it in your Launchpad or find it with Spotlight Search . Click on the magnifying glass icon in the right side of the menu bar at the top of your screen to search for it. [4] X Research source The Image Capture icon looks like a camera over a grid of pictures."
    },
    {
      "title": "Select your scanner from the Devices list.",
      "content": "Select your scanner from the Devices list. In the left menu bar of the Image Capture window, you should see a list of scanners and other devices that are linked to your Mac. Click on your scanner. If you don’t see your scanner in the list, make sure it’s turned on, set up properly, and connected to the same Wi-Fi network as your Mac (if it’s connected wirelessly). Your scanner might also appear under the Shared header in the left sidebar menu."
    },
    {
      "title": "Make any desired adjustments to your settings.",
      "content": "Make any desired adjustments to your settings. Once you’ve loaded a document into the scanner, check the settings in the Image Capture app to make sure they’re correct. For instance, use the dropdown menus under the scanner window to choose a destination for your scan and select the size of your document. For more advanced settings, click Show Details . Use the settings in the menu at right to adjust things like the type of document you’re scanning (color photo vs. grayscale or text only), the resolution of the scan, and the file type of the scanned image."
    },
    {
      "title": "Click Scan.",
      "content": "Click Scan . When you’re ready, click the Scan button in the lower right corner of the window. The scanned image will appear in the destination you selected on your Mac (e.g., your Pictures folder)."
    },
    {
      "title": "Go to System Settings > Printers & Scanners.",
      "content": "Go to System Settings > Printers & Scanners . If you like, you can open your scanner directly from System Settings to make a scan. To do so, navigate to the Apple menu in the top left corner of your screen, then select System Settings > Printers & Scanners . [5] X Research source You may need to scroll down in the sidebar on the left to find the Printers & Scanners option."
    },
    {
      "title": "Select your scanner.",
      "content": "Select your scanner. Your scanner or printer/scanner combo should appear in the main Printers & Scanners window. Click on it to open a new window. If you don’t see your scanner, make sure it’s turned on and connected properly. If it’s wireless, make sure it’s on the same Wi-Fi network as your Mac."
    },
    {
      "title": "Click Open Scanner….",
      "content": "Click Open Scanner… . You’ll see this button near the top of the window. Clicking it will launch a scanner window in the Image Capture app."
    },
    {
      "title": "Load your document and click Scan.",
      "content": "Load your document and click Scan . If you haven’t already loaded your document into the scanner, do so now. Check the scanner settings, then click Scan in the bottom-right corner of the Image Capture window. You can select the destination for your scanned image and the size of the document using the drop-down menus on the bottom of the Image Capture window. For more settings, click the Show Details button. The scanned image will appear in the destination folder you selected on your Mac."
    },
    {
      "title": "Use Continuity Camera to scan with an iPhone or iPad.",
      "content": "Use Continuity Camera to scan with an iPhone or iPad. The Continuity Camera app allows you to take a photo or scan a document with your iPhone or iPad and insert it directly into a document on your Mac. [6] X Research source For this feature to work, you’ll need to have Bluetooth enabled on your Mac and iPhone or iPad. You’ll also need to be connected to Wi-Fi on both devices. This is a great option if you don’t have a scanner."
    },
    {
      "title": "Position your cursor where you want to insert the scan.",
      "content": "Position your cursor where you want to insert the scan. Open a document on your computer and place your cursor where you want the scanned image to appear. Not all apps support Continuity Camera, but many native apps on Mac, like Pages, Notes, and Safari, will allow you to use this feature."
    },
    {
      "title": "Hold your iPhone or iPad over the document.",
      "content": "Hold your iPhone or iPad over the document. Unlock your iPhone or iPad and hold it with the camera facing the document you want to scan. Make sure you’re on the Home Screen with all apps minimized or closed."
    },
    {
      "title": "Find “Insert from iPhone or iPad” in the app menu on your Mac.",
      "content": "Find “Insert from iPhone or iPad” in the app menu on your Mac. Depending on the app you’re using, you might find this option in the File , Edit , or Insert menu. If you can’t find it anywhere, it’s possible that the app you’re using doesn’t support Continuity Camera. You can also Ctrl-click the desktop or a Finder window and select Insert from iPhone or iPad from the context menu that pops up. The scan will be saved as a PDF to your desktop or the folder you selected."
    },
    {
      "title": "Click Scan Documents.",
      "content": "Click Scan Documents . When you move your cursor over the Insert from iPhone or iPad option, a submenu will pop up with several options. Select Scan Documents . At this point, the Camera app should open on your iPhone or iPad and automatically scan the document. [7] X Research source If your phone doesn’t automatically detect the edges of the document, you can manually capture the scan by tapping the Shutter button (it looks like a white circle at the bottom of the screen) or one of the Volume buttons . You can capture several scans if you want to. Tap Save when you’re done, and the scan should appear in the selected location on your Mac."
    },
    {
      "title": "Make sure your scanner is turned on and correctly connected.",
      "content": "Make sure your scanner is turned on and correctly connected. If you can’t see your scanner in your scanning app’s menu or system settings, check that your scanner is plugged in and turned on. Make sure all the cables are securely connected. If your scanner is wireless, ensure that it’s on the same network as your computer. [8] X Research source"
    },
    {
      "title": "Try deleting and re-adding your scanner.",
      "content": "Try deleting and re-adding your scanner. If the scanner was visible in your scanning app at some point but now you can’t access it, go back into Apple menu > System Settings > Printers & Scanners . If you see the scanner there, select it and click Remove Scanner (or Remove Printer ). When you’re done, add it again using the Add Printer, Scanner, or Fax button."
    },
    {
      "title": "Use an app to scan instead of the controls on your scanner.",
      "content": "Use an app to scan instead of the controls on your scanner. While many scanners let you scan by pressing a button on the scanner itself, this option doesn’t always work very well. Instead, try scanning with an app like Preview, Image Capture, or a third-party option that’s compatible with your scanner."
    },
    {
      "title": "Connect the scanner directly to your Mac instead of a router.",
      "content": "Connect the scanner directly to your Mac instead of a router. If you have an AirPort base station to manage your wireless network, you might have plugged your scanner into it. Instead, connect the scanner to a USB port on your Mac (you might need to use an adapter if your scanner doesn’t have a USB-C cable)."
    },
    {
      "title": "Log out all users and log back in.",
      "content": "Log out all users and log back in. If multiple users are logged into your Mac, this can sometimes cause problems when trying to connect to a scanner. Try logging out of all user accounts on your Mac, then logging back in with the one you want to use. Then, try using your scanner again."
    }
  ]
}