{
  "url": "https://www.wikihow.com/Reboot-a-Cable-Box",
  "title": "How to Reboot a Cable Box",
  "steps": [
    {
      "title": "Open the menu on the cable box using your remote.",
      "content": "Open the menu on the cable box using your remote. Make sure your TV and cable box are both on so you can see the image on the screen. Look on the remote that controls your cable and locate a button that says Menu, which is usually at the top or in the middle of the remote. Once you click the button, a pop-up menu should show up on your TV screen. [1] X Research source The button on your remote may also have a picture of a gear on it, or it may have an icon with 2-3 horizontal lines. If you aren’t sure where the Menu button is, look for its user manual to find the button configuration. There may also be a Menu button on the front panel of your cable box if you don’t have your remote. If the image on your TV is frozen, you may not be able to access the menus."
    },
    {
      "title": "Navigate to the Settings option in the cable menu.",
      "content": "Navigate to the Settings option in the cable menu. Use the arrow buttons on your remote to scroll through the menu options on screen. Look for an option that says Settings or Support before clicking the OK or Enter button. A different menu will appear on screen with new options for adjusting the settings on your cable box. [2] X Research source Some cable boxes also have arrow buttons on them so you can navigate through the menus without your remote."
    },
    {
      "title": "Check for a Reset or Restart option in the Settings.",
      "content": "Check for a Reset or Restart option in the Settings. Scroll through the options in the Settings menu and search for one that says Reset or Restart. Press the OK or Enter button once you highlight the Restart option to start the process. If there’s a pop-up confirmation asking if you want to Restart, click on the Yes option. [3] X Research source If you have multiple cable boxes in your home, they may not work while you’re restarting the main box."
    },
    {
      "title": "Wait until your cable box reboots completely to see if it worked.",
      "content": "Wait until your cable box reboots completely to see if it worked. It may take a few minutes for your cable box to boot up again, so wait patiently while it’s restarting. The image on your TV may flash on and off while the cable box reboots or it may have a loading bar. Once the system boots back up, check if you’re still having the same problems as before. [4] X Research source If you’re still having problems with your cable box, you can try restarting it again or you can contact your cable provider’s customer support."
    },
    {
      "title": "Locate the Reset button on the front or back of your cable box.",
      "content": "Locate the Reset button on the front or back of your cable box. Check along the front side of your cable box for a small circular button labeled Reset. If you don’t see the button on the front side of your cable box, then check on the back panel near the power cords. [5] X Research source If you can’t find a Reset button on your cable box, then it may reset by holding down the Power button instead. Check the user manual if you have one to find out the proper way to reset the box."
    },
    {
      "title": "Hold the button down until the box’s display or lights turn off.",
      "content": "Hold the button down until the box’s display or lights turn off. Press down on the Reset button and hold it for about 10 seconds. You should see any lights or displays go black and the fan inside will stop running. As soon as you see the lights go off, let go of the Reset button."
    },
    {
      "title": "Allow the cable box 5-10 minutes to fully reset.",
      "content": "Allow the cable box 5-10 minutes to fully reset. As your cable box restarts, the lights on the display will blink or it will say “Boot.” You may also see a loading bar or icon on your TV screen while the box restarts. Leave the cable box alone and don’t touch any buttons on the remote until it’s finished loading. If your cable box gets stuck while it’s loading or you don’t see an image on your TV after 10-15 minutes, contact your cable provider so they can help."
    },
    {
      "title": "Unplug the power cable from the outlet.",
      "content": "Unplug the power cable from the outlet. Locate the cable that runs from the back of your cable box to the wall outlet. While your cable box is still on, pull the plug out of the wall to disconnect it from power. Check the front of your cable box to make sure the display turned off. [6] X Research source Grab the plug by its base rather than pulling on the cord since you could damage it."
    },
    {
      "title": "Plug the cable back into the wall after at least 1 minute passes.",
      "content": "Plug the cable back into the wall after at least 1 minute passes. Wait at least 1 minute before plugging your cable box back into the outlet. Make sure the plug is securely in the outlet and doesn’t feel loose since it could cause connection issues. Leave your cable box powered off but plugged in for another minute. [7] X Research source Avoid plugging your cable box into an outlet that’s controlled by a lightswitch since it could cause connectivity issues or loss of power."
    },
    {
      "title": "Press the Power button on the cable box so it can boot back up.",
      "content": "Press the Power button on the cable box so it can boot back up. Once you plug the cable box back in, press the main Power button on the front of the machine or on your remote. The lights on the box’s display should turn on or say “Boot” as it starts back up. Wait 5-10 minutes while the system restarts before trying to use it again to see if the reboot worked. Contact your cable company if the cable box still doesn’t work."
    }
  ]
}