{
  "url": "https://www.wikihow.com/Save-Tumblr-Gifs-on-PC-or-Mac",
  "title": "9 Easy Steps to Save GIFs from Tumblr on a Computer",
  "steps": [
    {
      "title": "Go to https://www.tumblr.com/ in a web browser.",
      "content": "Go to https://www.tumblr.com/ in a web browser. While you can save GIFs without an account, you'll be able to use the search feature and navigate the website more easily if you're logged in. If you don't have an account already, you can create one. [1] X Research source"
    },
    {
      "title": "Find a GIF you want to save.",
      "content": "Find a GIF you want to save. A GIF is an animated picture that plays on a loop. You can click the magnifying glass in the top-right corner to search specific topics or browse your dashboard for posts from people you follow ."
    },
    {
      "title": "Right-click the GIF.",
      "content": "Right-click the GIF. If you're using a Mac, you'll need to control-click . This will open a menu."
    },
    {
      "title": "Click Open image in a new tab.",
      "content": "Click Open image in a new tab . This should be the first option. If you aren't redirected to the new tab, click it to go there now."
    },
    {
      "title": "Click the address bar.",
      "content": "Click the address bar. This is at the top of the browser. You should see a long media.tumblr.com URL that ends in .gifv ."
    },
    {
      "title": "Replace .gifv with .gif.",
      "content": "Replace .gifv with .gif . This is at the end of the webpage's URL. The end of the URL should now end in .gif ."
    },
    {
      "title": "Press ↵ Enter.",
      "content": "Press ↵ Enter . This will load the edited URL."
    },
    {
      "title": "Right-click the image and click Save image as….",
      "content": "Right-click the image and click Save image as… . This is in the pop-up menu. A new window will open. The GIF can now be saved as a GIF Image file."
    },
    {
      "title": "Select a save location and click Save.",
      "content": "Select a save location and click Save . You can save directly to your desktop or specify a location . To rename the GIF, delete the existing name in the File name field and enter a new one. Your GIF will be downloaded."
    }
  ]
}