{
  "url": "https://www.wikihow.com/Remove-Permanent-Hair-Dye-from-Carpets",
  "title": "How to Remove Permanent Hair Dye from Carpets",
  "steps": [
    {
      "title": "Soak up as much liquid as possible with a clean cloth.",
      "content": "Soak up as much liquid as possible with a clean cloth. Before you start cleaning the spill, press on it with a cloth to dry it out as much as possible. [1] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 27 September 2021. Fold the cloth over and press again until there is no visible liquid on the carpet. [2] X Research source Don't rub on the dye or scrub it — you'll cause it to spread and become more deeply absorbed in the carpet, which will make it harder to get out. You also risk damaging the carpet fibers."
    },
    {
      "title": "Mix dishwashing liquid, white vinegar, and water in a shallow bowl.",
      "content": "Mix dishwashing liquid, white vinegar, and water in a shallow bowl. [3] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 27 September 2021. Use the formula of 1 US tbsp (15 mL) of dishwashing liquid and 1 US tbsp (15 mL) of white vinegar to 2 c (470 mL) of water to make your cleaning solution. Just stir the ingredients around a little to mix it together. [4] X Research source The basic formula should provide enough cleaning solution for you to clean the spot. If you have a larger spill, though, you might want to mix more."
    },
    {
      "title": "Dip a clean, white cloth in the solution and dab it repeatedly on the spot.",
      "content": "Dip a clean, white cloth in the solution and dab it repeatedly on the spot. [5] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 27 September 2021. Get your cloth damp, then press it on the dye spot. Lift, then press again. Continue dipping your cloth into the solution and pressing it back onto the spot, watching the dye come up from the carpet onto the cloth. [6] X Research source Using a white cloth means you don't have to worry about any color from the cloth transferring to your carpet. It also makes it easier to see the dye you're pulling up. Be careful not to pour or rub the mixture into the carpet — you can damage the carpet fibers or cause the dye to become more deeply embedded in the carpet, which will make it more difficult to remove. [7] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 27 September 2021."
    },
    {
      "title": "Rinse the affected area with cool water.",
      "content": "Rinse the affected area with cool water. When you can't see any more dye in the carpet, pour a little water over the spot to rinse out the solution. Then, continue blotting with your cloth or with a dry sponge. You might need to pour more water to rinse again — this is up to you. If you still smell vinegar in the carpet, it's a good idea to rinse it again."
    },
    {
      "title": "Dry the carpet with cool air or a sponge.",
      "content": "Dry the carpet with cool air or a sponge. Blot up the excess water. From there, you can usually just let the carpet air dry — it shouldn't take very long. If the spot was in a high-traffic area and you want it to dry faster, you might press it with a dry sponge to soak up more of the moisture. [8] X Research source You can also set up a fan to blow on the damp carpet."
    },
    {
      "title": "Soak the stain in a dishwashing detergent and vinegar solution.",
      "content": "Soak the stain in a dishwashing detergent and vinegar solution. [9] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 27 September 2021. In a shallow bowl, mix 1 US tbsp (15 mL) of dishwashing liquid and 1 US tbsp (15 mL) of white vinegar with 2 c (470 mL) of water. Soak a cloth or sponge in the solution and squeeze it over the stain to soak the carpet. You could also pour the solution over the stain slowly to flood the area. This might work better if the stain is larger."
    },
    {
      "title": "Dab at the stain with a clean, white cloth every 5 minutes for a half-hour.",
      "content": "Dab at the stain with a clean, white cloth every 5 minutes for a half-hour. Set a timer for 30 minutes. Every 5 minutes, take your white cloth and dab at the stain. If the area seems to be drying out, you might want to squeeze on a little more cleaning solution. Dabbing at the stain helps the cleaning solution soak more deeply into the carpet fibers. Don't scrub, though — you could damage your carpet."
    },
    {
      "title": "Rinse the stain with cool water.",
      "content": "Rinse the stain with cool water. After your 30 minutes is up, pour cold water on the stain to rinse off the cleaning solution. Use a sponge or clean cloth to soak up the excess water. You might still be able to see the stain, but it should be less noticeable, at least. [10] X Research source If you can't tell much difference, you might want to do another 30 minutes with the cleaning solution, just to get more of the dye out of the surface."
    },
    {
      "title": "Blot remnants of the stain with rubbing alcohol.",
      "content": "Blot remnants of the stain with rubbing alcohol. Use a clean, white cloth or a cotton swab (depending on the size of the stain that's left) to blot rubbing alcohol directly on the stain. Dab at the stain gently until it disappears. [11] X Research source A deeper-set stain might take a little more work to get rid of, so expect to dab it more than once. If it seems like the rubbing alcohol isn't affecting the stain at all, though, you might have to try another solution to get rid of it."
    },
    {
      "title": "Rinse the area with cold water to get rid of the rubbing alcohol.",
      "content": "Rinse the area with cold water to get rid of the rubbing alcohol. Pour a little water on the area to rinse the rubbing alcohol away. Soak up the excess moisture with a clean, dry cloth or sponge. [12] X Research source If you were only treating a small area with alcohol on a cotton swab, you might not need to pour water on the area to rinse it. Just squeeze water out of a sponge or cloth."
    },
    {
      "title": "Sponge or blot excess moisture from the carpet.",
      "content": "Sponge or blot excess moisture from the carpet. Use a dry sponge or dry, white cloth to soak up the excess moisture in the carpet. While the carpet will still be damp after you do this, you can usually just let it air dry. Put an electric fan on the floor so that it's blowing on the spot if you want it to dry out faster."
    },
    {
      "title": "Make an ammonia and dishwashing liquid solution in a shallow bowl.",
      "content": "Make an ammonia and dishwashing liquid solution in a shallow bowl. Mix 1 tsp (4.9 mL) of dishwashing liquid and 1 US tbsp (15 mL) of ammonia in 2 cups (470 mL) of warm water. You might want to wear a face covering if ammonia fumes bother you. Mix this solution in a well-ventilated area to cut down on the fumes. Don't mix any other chemicals in this solution, especially bleach — the fumes are toxic."
    },
    {
      "title": "Apply the solution to a small area to test if it damages your carpet.",
      "content": "Apply the solution to a small area to test if it damages your carpet. Find a small, obscure area of your carpet where no one would notice if it was damaged. Dip a cotton swab in your ammonia solution and apply it to that area. If it singes or destroys the carpet fibers, don't use this solution to try to clean the stain. [13] X Research source Ammonia is effective at getting out hair dye, but it damages wool. Since you probably don't know if your carpet has any wool in it, use this test to make sure the solution won't damage your carpet. Better safe than sorry!"
    },
    {
      "title": "Dab the solution all over the stained area.",
      "content": "Dab the solution all over the stained area. Dip a clean, white cloth in the solution, then dab it over the stubborn stain. Repeat until the stained portion of the carpet is completely covered in the solution. Don't pour the solution on the spot — too much ammonia could ruin your carpet. It's a good idea to wear plastic gloves to protect your hands from the ammonia."
    },
    {
      "title": "Blot the solution every 5 minutes for at least half an hour.",
      "content": "Blot the solution every 5 minutes for at least half an hour. Set a timer and come back every 5 minutes. Dip your cloth in the solution and re-apply it, dabbing at the stain. You should notice the stain start to come up from the carpet. If the stain isn't completely gone after a half an hour, you can keep doing it for longer if it appears to be working. Each time you come back to blot the solution, look at the condition of the carpet. If the carpet fibers in the spot look damaged compared to the surrounding carpet, rinse the ammonia out before it gets worse."
    },
    {
      "title": "Rinse the carpet with cold water.",
      "content": "Rinse the carpet with cold water. Pour cold water on the carpet to rinse the ammonia out, immediately soaking it up with a clean, dry cloth. You'll probably need to rinse it several times. It can be hard to tell, but keep rinsing until you can't smell any ammonia fumes coming from the carpet."
    },
    {
      "title": "Dry the carpet with a fan or dry cloth.",
      "content": "Dry the carpet with a fan or dry cloth. Use a dry cloth or a dry sponge to help soak up the excess moisture on the carpet. Even after doing this, leave a fan blowing on the spot for at least an hour, or until the carpet feels completely dry. [14] X Research source Once the carpet is dry, check its condition. If the stain is gone, congratulations! If the carpet looks bleached-out, you might want to use a fabric pen to fill it back in so it's not as noticeable."
    },
    {
      "title": "Use a cotton swab soaked with hydrogen peroxide as a last resort.",
      "content": "Use a cotton swab soaked with hydrogen peroxide as a last resort. If you still have some dye on your carpet that won't come out and is pretty obvious, hydrogen peroxide will take care of it. Dip a cotton swab in hydrogen peroxide, then press it into the spot. You might need to do this several times so that the spot is completely saturated. [15] X Research source Hydrogen peroxide might also take the color out of your carpet, but if you have a white or light beige carpet, that might not be as noticeable as the hair dye stain."
    },
    {
      "title": "Rinse hydrogen peroxide out of the carpet after a day.",
      "content": "Rinse hydrogen peroxide out of the carpet after a day. You might have to leave the hydrogen peroxide on the stain for up to 24 hours to make sure you've gotten rid of the stain. When you can no longer see the stain, rinse the area with cool water to get any remaining hydrogen peroxide out of the carpet. [16] X Research source Since you didn't use a lot of hydrogen peroxide, you likely won't need a lot of water to rinse. Use a dry sponge or cloth to soak up the water after you've rinsed."
    }
  ]
}