{
  "url": "https://www.wikihow.com/Roast-Pine-Nuts",
  "title": "How to Roast Pine Nuts",
  "steps": [
    {
      "title": "Preheat the oven to 375 °F (191 °C) and spread the nuts on a sheet.",
      "content": "Preheat the oven to 375 °F (191 °C) and spread the nuts on a sheet. Use a rimmed baking sheet so the pine nuts won't slide off. Spread as many pine nuts as you want to toast on the sheet and set them aside while the oven heats. [1] X Research source Ensure that the pine nuts are in a single layer so they toast evenly."
    },
    {
      "title": "Roast the pine nuts for 5 to 10 minutes.",
      "content": "Roast the pine nuts for 5 to 10 minutes. Put the baking sheet in the preheated oven and cook them until they smell fragrant. Stir the pine nuts after they've been in the oven for 5 minutes. This will help them roast evenly. [2] X Research source"
    },
    {
      "title": "Remove the pine nuts once they're golden brown.",
      "content": "Remove the pine nuts once they're golden brown. Pay close attention to the color of the pine nuts and take them out of the oven as soon as they're brown and they smell nutty. [3] X Research source Keep in mind that the pine nuts will continue to cook even after you take them out of the oven."
    },
    {
      "title": "Cool the pine nuts on a cold baking sheet.",
      "content": "Cool the pine nuts on a cold baking sheet. To prevent the pine nuts from burning, transfer the toasted pine nuts to a clean, rimmed baking sheet that's cold. This will stop the pine nuts from overcooking. [4] X Research source"
    },
    {
      "title": "Store the pine nuts in an airtight container for up to 1 week.",
      "content": "Store the pine nuts in an airtight container for up to 1 week. Once the pine nuts are completely cool, put them into an airtight container. Then place them in the pantry out of direct sunlight. For the best flavor, use the pine nuts within 1 week. [5] X Research source To store the pine nuts for longer, refrigerate or freeze the toasted nuts in an airtight container for up to 3 to 6 months."
    },
    {
      "title": "Place the pine nuts in a dry skillet.",
      "content": "Place the pine nuts in a dry skillet. Set the skillet on the stove and put as many shelled pine nuts as you want to toast into the skillet. Spread them so they're in a single layer. If you want to toast a lot of pine nuts, you may need to make them in batches. [6] X Research source Toasting the pine nuts in a skillet is one of the fastest ways to toast a small number of pine nuts."
    },
    {
      "title": "Turn the burner to medium-low and heat the pine nuts for 3 minutes.",
      "content": "Turn the burner to medium-low and heat the pine nuts for 3 minutes. You'll need to stir them frequently so they don't burn. If you prefer, swirl the skillet carefully so the pine nuts slide around. [7] X Research source"
    },
    {
      "title": "Remove the pine nuts once they're golden brown.",
      "content": "Remove the pine nuts once they're golden brown. Because the pine nuts will continue to cook even once you turn off the burner, transfer the golden brown pine nuts to a plate or baking sheet. This will allow them to cool quickly. [8] X Research source"
    },
    {
      "title": "Store the pine nuts for up to 1 week in an airtight container.",
      "content": "Store the pine nuts for up to 1 week in an airtight container. Put the cooled pine nuts into an airtight storage container and keep them at room temperature. Put them somewhere out of direct sunlight so they don't turn rancid. [9] X Research source For longer storage, refrigerate or freeze the toasted pine nuts for up to 3 to 6 months in an airtight storage container."
    },
    {
      "title": "Preheat the oven to 350 °F (177 °C) and rinse the unshelled pine nuts.",
      "content": "Preheat the oven to 350 °F (177 °C) and rinse the unshelled pine nuts. Put as many unshelled pine nuts as you want to roast into a colander or fine mesh strainer. Rinse them with cold water and then discard any that are discolored or cracked. [10] X Research source You can purchase unshelled pine nuts at local health food stores, grocery stores, or online."
    },
    {
      "title": "Soak the pine nuts in a salt solution for 30 minutes to add flavor.",
      "content": "Soak the pine nuts in a salt solution for 30 minutes to add flavor. If you'd like to make slightly salted pine nuts, similar to salted sunflower seeds, stir 1/4 cup (60 g) of sea salt into 2 cups (470 ml) of water until the salt dissolves. Stir the pine nuts into the bowl with the solution and let them soak while the oven preheats. [11] X Research source If you don't want salty pine nuts, you can skip this step."
    },
    {
      "title": "Line a sheet with parchment and arrange the pine nuts on it.",
      "content": "Line a sheet with parchment and arrange the pine nuts on it. Tear a sheet of parchment paper and lay it on a rimmed baking sheet. If you soaked the pine nuts, drain them. Then spread your pine nuts on the baking sheet so they're in a single layer. [12] X Research source If you don't have parchment paper, you can roast the pine nuts directly on the baking sheet."
    },
    {
      "title": "Roast the pine nuts for 10 to 20 minutes.",
      "content": "Roast the pine nuts for 10 to 20 minutes. Put the baking sheet in the oven and roast the pine nuts until they begin to pop. Stir the pine nuts after 10 minutes and leave them to cook for another 10 minutes if they haven't popped. [13] X Research source If you soaked the pine nuts in a salt solution, it may take closer to 30 minutes of total roasting time before the pine nuts are done."
    },
    {
      "title": "Cool the pine nuts for 20 minutes.",
      "content": "Cool the pine nuts for 20 minutes. Turn off the oven and remove the pine nuts. Transfer the pine nuts to a cold baking sheet or lift up the sheet of parchment paper and set it on a wire rack. Leave the pine nuts to cool completely. [14] X Research source Keep the pine nuts in a single layer as they cool."
    },
    {
      "title": "Use a rolling pin to shell the pine nuts.",
      "content": "Use a rolling pin to shell the pine nuts. Spread the cooled pine nuts onto a clean dish towel and fold the towel over so the pine nuts are covered. Press down on the pine nuts with a rolling pin. You should hear the shells cracking. Then fold back the towel and pick the toasted pine nuts out of the shells. [15] X Research source Enjoy the toasted pine nuts right away or put them in an airtight container. Store them at room temperature for up to 1 week or refrigerate them for up to 6 months."
    },
    {
      "title": "Rinse the unshelled pine nuts and put them in a microwave safe bowl.",
      "content": "Rinse the unshelled pine nuts and put them in a microwave safe bowl. Place as many unshelled pine nuts as you'd like to toast into a fine mesh strainer or colander. Run cold water over the pine nuts. Then transfer them to a microwave safe bowl. [16] X Research source Throw away any pine nuts that are discolored, feel soft, or are cracked. Don't dry the pine nuts. The moisture will help the pine nuts steam as they cook in the microwave."
    },
    {
      "title": "Microwave the pine nuts for 6 minutes.",
      "content": "Microwave the pine nuts for 6 minutes. Put the bowl in the microwave and leave it uncovered. Heat the pine nuts for 4 minutes so they become hot and start to cook. Then carefully stir the pine nuts and microwave them for 2 minutes. [17] X Research source Wear oven mitts when you handle the hot bowl."
    },
    {
      "title": "Heat the pine nuts in 1-minute intervals.",
      "content": "Heat the pine nuts in 1-minute intervals. Continue to microwave the pine nuts until you smell a nutty, toasted aroma. Remove 1 of the pine nuts and crack open the shell to check the color of the pine nut. The pine nuts are done once they're slightly browned. [18] X Research source If the pine nuts are still white or creamy colored, they need to heat longer in the microwave."
    },
    {
      "title": "Remove the pine nuts and cool them on a plate or sheet.",
      "content": "Remove the pine nuts and cool them on a plate or sheet. Wear oven mitts to take the hot bowl out of the microwave and spread the hot pine nuts on a plate. Arrange the pine nuts so they're in a single layer. This will help the pine nuts cool faster. [19] X Research source If you leave the pine nuts in the bowl, they'll take longer to cool and they may become soft."
    },
    {
      "title": "Crack the shells with a rolling pin.",
      "content": "Crack the shells with a rolling pin. Lay a clean kitchen cloth on the counter and place the cooled pine nuts on it. Fold the towel over and press a rolling pin across the pine nuts. The shells will crack so you can easily pick out the pine nuts. [20] X Research source Eat the toasted pine nuts or store them in an airtight container at room temperature for up to 1 week. For longer storage, refrigerate the pine nuts for up to 6 months."
    }
  ]
}