{
  "url": "https://www.wikihow.com/Replace-an-Interior-Doorknob",
  "title": "How to Replace an Interior Doorknob",
  "steps": [
    {
      "title": "Remove the screws in the faceplate of the doorknob if they're visible.",
      "content": "Remove the screws in the faceplate of the doorknob if they're visible. Traditional doorknobs will have two screws in the faceplate. Use a Phillips head screwdriver and turn the screws counterclockwise to loosen them. As the screws become loose, the knob should also become loose. Use a shorter screwdriver, so it doesn’t slip out and strip the screws."
    },
    {
      "title": "Insert a sharp object into the latch hole if there aren't visible screws.",
      "content": "Insert a sharp object into the latch hole if there aren't visible screws. You should feel a small indentation or hole on the stem that’s attached to the knob. If the hole is round, push a paperclip or nail into the hole. If the hole is flat and thin, you can use a flathead screwdriver. Press on the hole to disengage the knob."
    },
    {
      "title": "Pull the interior knob away from the door.",
      "content": "Pull the interior knob away from the door. Hold the door with one hand while you pull the knob away from the door. Continue to pull the knob until it detaches from the door. You may have to wiggle it back and forth if it’s stuck on the doorknob stem. [1] X Research source"
    },
    {
      "title": "Pry off and unscrew the faceplate if it has one.",
      "content": "Pry off and unscrew the faceplate if it has one. Insert a flathead screwdriver into the indentation on the side of the faceplate and pry the faceplate from the door. This should reveal another set of screws. Turn the screws counterclockwise with a Phillips head screwdriver to remove them. Removing these screws will detach the exterior knob from the door. [2] X Research source If there is no indentation in your faceplate, use a thinner tool like a knife to carefully pry the faceplate away from the door. Otherwise, grip the top and bottom of the faceplate and try to turn it counterclockwise. It should release and pull off immediately."
    },
    {
      "title": "Remove the knob on the outside of the door.",
      "content": "Remove the knob on the outside of the door. Sometimes you can just pull the exterior doorknob out of the door and other times you’ll have to pry the faceplate from the door with a flathead screwdriver. Once loose, pull on the knob to remove it. [3] X Research source If the latch plate is covered in paint, remove it with a knife before trying again with your screwdriver."
    },
    {
      "title": "Unscrew the latch.",
      "content": "Unscrew the latch. There should be two screws near the bottom and top of the latch. Use a Phillips head screwdriver to remove the screws. [4] X Research source"
    },
    {
      "title": "Pull the latch out from the hole in the door.",
      "content": "Pull the latch out from the hole in the door. Use a flathead screwdriver to pry the latch plate from the side of the door, then pull out the entire latch. If done successfully, you should have totally removed the doorknob and all its components from the door. If the latch doesn’t have any screws, it may be a “knock-in” latch that’s just tightly secured in the door. Try to just pry it out with a knife or flathead screwdriver."
    },
    {
      "title": "Push the latch into the hole in the door.",
      "content": "Push the latch into the hole in the door. The latch bolt is the piece of the latch that goes into the door frame to close the door. One side of the latch bolt will be beveled while the other side will be flat. Insert the latch so that the flat side of the latch bolt is facing towards the inside of the room. This will ensure that you can lock the door from the inside. [5] X Research source Don’t force the latch into the hole. Make the hole larger until the latch fits inside easily."
    },
    {
      "title": "Line up the latch faceplate with the screw holes.",
      "content": "Line up the latch faceplate with the screw holes. Line up the holes in the door with the holes in the latch faceplate so that you can screw it in. If there is a latch indentation in your door, push the latch so that it fits into it. [6] X Research source"
    },
    {
      "title": "Screw in the latch.",
      "content": "Screw in the latch. Secure the latch plate to the door by tightening the screws above and below the latch. Use any existing screw holes to house your new screws. [7] X Research source"
    },
    {
      "title": "Push the bars on the external knob through the holes in the latch.",
      "content": "Push the bars on the external knob through the holes in the latch. Your exterior doorknob should have three bars connected to the knob. These bars need to line up with the holes on the inside part of your latch. Line up the holes on the interior of the latch with the bars connected to your knob and push the knob through the holes. [8] X Research source The center bar will usually be square while the bars on each side of it will be round."
    },
    {
      "title": "Attach the faceplate to the other side of the door, if applicable.",
      "content": "Attach the faceplate to the other side of the door, if applicable. The faceplate is the part of the doorknob that runs flush against the door and connects the knob to the door. Line up the faceplate so that the holes in the plate are aligned with the holes in the exterior knob. Tighten the screws with a Phillips head screwdriver. Then, put the outer plate over the interior plate and tighten it to hide your screws. [9] X Research source Sometimes the faceplate is attached to the knob itself. Hold the faceplate as far back as you can so you can see where to start the screws."
    },
    {
      "title": "Connect the interior doorknob to the door if you don't have a faceplate.",
      "content": "Connect the interior doorknob to the door if you don't have a faceplate. The bars from your exterior knob should poke out onto the other side of your door. Take your interior knob and align the holes in the knob with the bars on the exterior knob. Once you line them up, press the interior knob onto the bars until the knob runs flush with the door. [10] X Research source"
    },
    {
      "title": "Screw the knob into the door.",
      "content": "Screw the knob into the door. Thread the screws through the holes on the interior doorknob. Turn the screws clockwise with a screwdriver to drive them in. [11] X Research source"
    },
    {
      "title": "Slide the new knob onto the stem if you have a faceplate.",
      "content": "Slide the new knob onto the stem if you have a faceplate. Your exterior knob should have a bar or stem that sticks out of the other side of the door. Align the hole in the interior knob and the stem on the exterior doorknob. Press on the knob to push the stem into the hole. You may have to rotate the knob left and right until it finally slides all the way down the stem and is locked into place. [12] X Research source"
    }
  ]
}