{
  "url": "https://www.wikihow.com/Print-to-PDF",
  "title": "4 Easy Ways to Print to PDF: Save Web Pages, Files, & More",
  "steps": [
    {
      "title": "Navigate to the content, file, or web page you want to save.",
      "content": "Navigate to the content, file, or web page you want to save. You can convert just about any type of document to the PDF format by \"printing\" the file to a virtual printer. This also works to save a copy of a website if you need to reference it without Internet access. This is different from printing documents with your printer, though you can still print a physical copy of the PDF later if needed."
    },
    {
      "title": "Press Ctrl+P.",
      "content": "Press Ctrl + P . This will open the Print menu."
    },
    {
      "title": "Click the \"Destination\" drop-down menu.",
      "content": "Click the \"Destination\" drop-down menu. You'll see a list of available printers and other destinations."
    },
    {
      "title": "Click Microsoft Print to PDF.",
      "content": "Click Microsoft Print to PDF . This will be listed in the drop-down menu. If you don't see this option, do the following to enable it: Open the Start menu. Type \"turn windows features on or off\". Click the first option. Check the box next to Microsoft Print to PDF . Click OK . On certain browsers, you can also select Save as PDF or similar; this functions the same way."
    },
    {
      "title": "Click Print.",
      "content": "Click Print . This is the button at the bottom of the screen. A new window will open."
    },
    {
      "title": "Select a save location and click Save.",
      "content": "Select a save location and click Save . The content, file, or web page will be saved to the designated location as a PDF file."
    },
    {
      "title": "Navigate to the content, file, or web page you want to save.",
      "content": "Navigate to the content, file, or web page you want to save. This could be a Google Sheets file, a recipe on a website, or content in another program. [1] X Research source"
    },
    {
      "title": "Press ⌘ Command+P.",
      "content": "Press ⌘ Command + P . This will open the Print menu."
    },
    {
      "title": "Click the down arrow next to \"PDF\".",
      "content": "Click the down arrow next to \"PDF\". You'll see a list of options."
    },
    {
      "title": "Select Save as PDF.",
      "content": "Select Save as PDF . This will change the content into PDF format."
    },
    {
      "title": "Click Print.",
      "content": "Click Print . This is the button at the bottom of the screen. A new window will open."
    },
    {
      "title": "Select a save location and click Save.",
      "content": "Select a save location and click Save . The content, file, or web page will be saved to the designated location as a PDF file. You can also enter information such as the Title, Subject, and Keywords to make the file easier to find later."
    },
    {
      "title": "Open a webpage in Safari.",
      "content": "Open a webpage in Safari. You can turn web pages into a PDF file and save it to the Files app . You can also email it or share it in another app."
    },
    {
      "title": "Tap the \"Share\" icon.",
      "content": "Tap the \"Share\" icon. This is at the bottom of the screen. A pop-up menu will open."
    },
    {
      "title": "Tap Options.",
      "content": "Tap Options . You can find this towards the top of the pop-up menu, underneath the website name."
    },
    {
      "title": "Select PDF and tap Done.",
      "content": "Select PDF and tap Done . The webpage will be converted into a PDF file and can now be shared or saved."
    },
    {
      "title": "Tap Save to Files.",
      "content": "Tap Save to Files . Alternatively, you can select an app on the list to share via Messages , Mail , or another app."
    },
    {
      "title": "Select a save location and tap Save.",
      "content": "Select a save location and tap Save . The PDF will be saved to the Files app. If you selected an app, select the location or recipient, and then send it."
    },
    {
      "title": "Open a webpage in the Google Chrome app.",
      "content": "Open a webpage in the Google Chrome app. This browser app allows you to save any webpage as a PDF file."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . You can find this in the top-right corner."
    },
    {
      "title": "Select Save as PDF.",
      "content": "Select Save as PDF . On some devices, you may need to tap the Share icon first."
    },
    {
      "title": "Select a save location and tap Save.",
      "content": "Select a save location and tap Save . The PDF will be saved to your Android. In most cases, you can find PDF files in the Documents folder."
    }
  ]
}