{
  "url": "https://www.wikihow.com/Scan-a-Poem",
  "title": "How to Perform Scansion in Poetry",
  "steps": [
    {
      "title": "Double space the poem.",
      "content": "Double space the poem. To scan a poem, you will need to use scanning symbols above each word in the poem. Make sure there is at least one line of space between each line of the poem so you can scan it properly. Keep in mind scanning symbols are always placed above each word, never below. This will make it easy for you to keep track of your scan of each line."
    },
    {
      "title": "Have a physical copy of the poem.",
      "content": "Have a physical copy of the poem. You will need to write directly above the words in the poem to do the scan properly. Print out the poem, double spaced, and use a pen or pencil to scan it directly on the page. [1] X Research source If you are using a poem in a book, you may need to type it up double spaced and print it out or write it down on a piece of paper."
    },
    {
      "title": "Find a quiet space to scan the poem.",
      "content": "Find a quiet space to scan the poem. Scanning a poem requires you to listen to each syllable in every word of the poem out loud. To do this successfully, you will need to be in a space that is very quiet and has no surrounding noise or distractions. Go to a quiet area like a study room or your bedroom. [2] X Research source You may also tell others around you that you are not to be disturbed while you scan the poem so you can concentrate."
    },
    {
      "title": "Read the poem out loud line by line.",
      "content": "Read the poem out loud line by line. Start by reading each line of the poem aloud to yourself. Listen to each word and how each word flows into another. Pay attention to where the words sound the most stressed and the least stressed. Often, you will open your mouth wider for stressed sounds and make your mouth smaller for less stressed sounds. [3] X Research source You can also try putting your hand under your chin while you read the poem. Notice when your chin drops into your hand and when it does not touch your hand. Stressed sounds usually cause your chin to drop into your hand."
    },
    {
      "title": "Mark stronger syllables with a “wand.”",
      "content": "Mark stronger syllables with a “wand.” A wand symbol looks like this: /. It is used when part of a word or an entire word contains stronger syllables. You should notice that the word or part of the word sounds louder when you read it aloud. Use your ear and listen carefully to find the stronger syllables in each word. [4] X Research source For example, in the line, “My girlfriend hit me in the head,” you would use a “/” over “girl,” “hit,” and “head.” These are the stronger syllables in the line. Keep in mind one word can have a stronger syllable and a weaker syllable. For example, “girlfriend,” has a stronger syllable in “girl” and a weaker syllable in '“friend.”"
    },
    {
      "title": "Identify weaker syllables with a “cup.”",
      "content": "Identify weaker syllables with a “cup.” A cup symbol looks like this: u. Place “u” over any syllables that are not as loud as others when you say them aloud. They will be the less stressed or weaker syllables in the words of the poem. [5] X Research source Usually any words that are not marked stronger syllables can be marked weaker syllables. For example, in the line, “This sunlight shames November where he grieves,” you would place a “u” over “This,” the “light” in “sunlight,” the “No” and “ber” in “November,” and “he.” These are the weaker syllables in the line. Remember that you can have a stronger syllable and a weaker syllable in the same word. For example, “November” has a stronger syllable in “vem” and weaker syllables in “No” and “ber.”"
    },
    {
      "title": "Use a “reversed wand” for syllables that are only partly stressed.",
      "content": "Use a “reversed wand” for syllables that are only partly stressed. The reverse wand symbol looks like this: \\. It is used rarely when scanning a poem for syllables that are hard to identify and appear only partly stressed. It is often used when there is a disagreement as to whether a word is stressed or not. [6] X Research source For example, you may have a hard-to-scan line like, “Full of passionate intensity, grappling and free.” A word like “grappling” may be difficult for you to scan as it has three syllables that may sound only partly stressed."
    },
    {
      "title": "Mark each foot with a “foot boundary.”",
      "content": "Mark each foot with a “foot boundary.” A foot boundary symbol looks like this: |. Do the foot boundaries last. Go through the poem and place a foot boundary at the end of a repeating pattern of the same wands and cups, known as a “foot.” In poetry, a “foot” is a group of syllables that make the same pattern in the poem. [7] X Research source An easy way to do this is to count the wands, or “u” symbols in a line. For example, the line “This sunlight shames November where he grieves” has five “u” symbols (over “This,” “light,” “No,” “ber,” and “he”). You would place the foot boundary after “he” to note the foot boundary is five feet in the poem."
    },
    {
      "title": "Count the feet in the poem.",
      "content": "Count the feet in the poem. Count the wands, or “/” symbols, in each line of the poem to determine the foot. The end of each foot should have a foot boundary. This will tell you the line length of the poem. [8] X Research source For example, for the line “This sunlight shames November where he grieves,” there are five “/” symbols (over “sun,\" \"shames,\" \"vem,\" \"where,\" and \"grieves\"). This means it has five feet per each line, or ten feet for every two lines. You can determine the meter based on the feet length in the poem. For example, a poem with a ten foot length is called a pentameter. A poem with a two foot length is called a dimeter."
    },
    {
      "title": "Note how the foot is accented.",
      "content": "Note how the foot is accented. Doing this will help you determine the pattern of syllables in the poem. Count all the stronger syllables in each foot of the poem. Notice if there is a pattern where there is a less stressed syllable and then a strongly stressed syllable in the poem. [9] X Research source For example, a common meter in poetry is iambic pentameter. This means there are five stronger syllables, or wands, per a line and the syllable count is 10/10/10. The pattern is one less stressed syllable, followed by a strongly stressed syllable. Each line has a five syllable length, following a 10 syllable count for every two lines."
    }
  ]
}