{
  "url": "https://www.wikihow.com/Remove-Chewing-Gum-from-a-Car-Seat",
  "title": "How to Remove Chewing Gum from a Car Seat",
  "steps": [
    {
      "title": "Put ice in a plastic bag.",
      "content": "Put ice in a plastic bag. Put 3 to 4 pieces of ice in a plastic bag and seal it. If you don’t have ice on hand, use a freezer pack instead. The bag helps contain the water from the melting ice cube. If you are concerned about the water leaking, double bag the ice. As an alternative to using ice, you can spray the area with compressed air to harden the chewing gum."
    },
    {
      "title": "Freeze the gum.",
      "content": "Freeze the gum. Set the bag of ice directly on top of the gum. Let the ice sit on the gum for 5 minutes or until the gum becomes stiff and brittle. Ice will freeze, or harden, the gum. When gum is hard and not sticky, it is easier to remove. You can also hold the bag of ice against the gum. Prevent your hand from getting cold by placing a towel between the bag of ice and your palm."
    },
    {
      "title": "Remove the hardened gum.",
      "content": "Remove the hardened gum. Use a dull putty knife, butter knife or blade to separate the frozen gum from the fabric of your car seat. The blade should remove all or most of the gum. Keep the blade flat to avoid poking holes in the fabric. Be patient. It may take awhile to separate the gum from the seat. Go slowly to avoid puncturing the fabric."
    },
    {
      "title": "Remove gum from cloth or vinyl car seats with white vinegar.",
      "content": "Remove gum from cloth or vinyl car seats with white vinegar. Soak a small cloth in warm, white vinegar. Rub the saturated cloth on the gum. Allow the vinegar to soak into the gum for a few minutes. The vinegar will loosen the gum, causing it to ball up. Remove the softened, vinegar-soaked ball of gum with your fingers or a pair of tweezers. [1] X Research source Use this method to remove chewing gum from cloth or vinyl, but not leather. To quicken the process, warm up the vinegar first before applying it to the gum."
    },
    {
      "title": "Brush and wash away residue.",
      "content": "Brush and wash away residue. Combine 1 tablespoon liquid dish soap, 1 tablespoon white vinegar, and 2 cups warm water in a medium sized bowl. Mix the solution together until soap suds form. Dip a tooth brush, nail brush, or clean cloth into the solution and gently scrub away the gummy residue. Repeat as needed. Blot the area with a clean, damp cloth to soak up the homemade solution. Allow the spot to air dry or dab it dry with a clean towel. [2] X Research source"
    },
    {
      "title": "Remove bits of gum with scotch tape.",
      "content": "Remove bits of gum with scotch tape. Rip off a piece of tape and adhere it to the gum residue. Pull the tape off, taking the gum residue with it. Repeat as needed. [3] X Research source This method is safe to use on leather upholstery. If there is still remaining gum on the car seat after the \"Freezing Method,\" use this method to completely remove all the chewing gum."
    },
    {
      "title": "Clean the area with a commercial degreaser.",
      "content": "Clean the area with a commercial degreaser. Remove any remaining gum residue with a commercial degreaser. Spay or squirt the product onto a clean, damp cloth. With the cloth, rub away the gummy residue. Grab a new cloth, dampen it with cold water, and wipe away any traces of gum or commercial degreaser from the seat. [4] X Research source Always read the instructions that accompanying the degreaser! Make sure the product is safe to use on your cloth, vinyl, or leather seats before using it."
    },
    {
      "title": "Clean the seat.",
      "content": "Clean the seat. After removing the gum, clean and or condition the affected area. Use the appropriate product for your cloth or leather car seat. Clean your cloth car seats with an upholstery cleaner . This product will remove any set in stains from the gum. Protect your leather car seats by applying a leather conditioner to the affected area. The conditioner will prevent your seats from cracking."
    }
  ]
}