{
  "url": "https://www.wikihow.com/Sleep-on-a-Plane",
  "title": "How to Sleep on a Plane",
  "steps": [
    {
      "title": "Choose your seat wisely.",
      "content": "Choose your seat wisely. Unless you can afford to book a lie-flat seat, which is often only available in first class on most planes, you will end up in an upright seat. It can be difficult to get a good rest, even when you recline your seat, so choosing which side of the plane your seat is on and if you are in the aisle seat or the window seat are essential. Determine if you sleep on the left side or the right side of your bed at home. If you sleep on your right side, you should choose a seat that is on the right side of the plane, and vice versa if you are a left side sleeper. This will mimic your natural sleep position and help you get to sleep on the plane. [1] X Research source Avoid a seat in the bulkhead area of the plane or in the exit rows. Some exit row seats do not recline and some bulkhead seats have armrests that cannot be raised. This could seriously cramp your style and leave you feeling stiff and tired at the end of your flight. You should also avoid seats in the last row of the plane, by the lavatories. The smell from the bathrooms could keep you up and many of these seats do not recline. As well, if you are taking a flight at night, go for the window seat. In general, a window seat is ideal as you will have more space to sleep and you will retain control of the window shade."
    },
    {
      "title": "Pack light.",
      "content": "Pack light. Try to fit all your items into one bag and keep a few small necessities near the top of your bag, like a book or magazine, a bottle of water, or a snack. Most airline only allow one carry-on per passenger and reducing your luggage means you will not crowd the legroom underneath the seat in front of you with extra bags."
    },
    {
      "title": "Bring a neck pillow, a sleep mask, earplugs, and compression socks.",
      "content": "Bring a neck pillow, a sleep mask, earplugs, and compression socks. Create a sleep kit for the plane that includes all of these items. The neck pillow will help support your neck, even in turbulence as you try to slumber in your seat, the sleep mask will block out any light that could keep you awake and the earplugs will reduce any noises around you. Earphones can also work to block out any surrounding noise on the plane and help you focus on sleep. Compression socks are also very useful for flying, as they reduce your risk of travel-related deep vein thrombosis (DVT), a condition that can lead to blood clots. If you are at risk of developing DVT, you should purchase compression socks at your local pharmacy, usually referred to as “flight socks”. Look for graduated compression stockings that you can wear up to your knees with class 1 compression. The slight pressure from the stockings helps to prevent blood from pooling in your calves. [2] X Research source"
    },
    {
      "title": "Wear warm clothing and shoes you can slip on and off.",
      "content": "Wear warm clothing and shoes you can slip on and off. Dress for the plane in comfortable layers and be sure to always carry or wear a sweater as you may get cold on the flight due to inactivity and constant air circulation. You should also wear comfortable shoes you can take on and off easily. Taking your shoes off during the flight will improve your circulation and can help you fall asleep. If your feet tend to get cold on the plane, you should wear socks with your shoes or bring an extra pair of socks in your carry on."
    },
    {
      "title": "Avoid alcohol and caffeine.",
      "content": "Avoid alcohol and caffeine. Alcohol and food or drink that contain caffeine, like coffee, tea or soda, can keep you awake during the flight and make it more difficult to get some rest. [3] X Expert Source Marc Kayem, MD Otolaryngologist Expert Interview. 24 October 2019. Resist the temptation to have a quick coffee before you board and stick to water or juice when the beverage cart comes around during your flight."
    },
    {
      "title": "Have a light meal before your flight.",
      "content": "Have a light meal before your flight. Don't get stuck paying too much for a bland sandwich or a bag of chips during your flight. Airline food isn't only expensive, it can cause indigestion and gas, which will make it more difficult to get some sleep. Instead, go for a light snack or meal before your flight that consists of easy to digest items like yogurt, nuts like raw almonds, and fruits like oranges, which are a good source of vitamin C and liquids. [4] X Research source A smoothie made with fruits and vegetables is also a good way to fill up your stomach, without causing indigestion or dehydration. If you are craving a hot beverage, go for herbal tea with no caffeine. As well, you should always drink lots of water before and during your flight to stay hydrated. Avoid having large meals before you try to sleep since it may keep you awake. [5] X Expert Source Marc Kayem, MD Otolaryngologist Expert Interview. 24 October 2019."
    },
    {
      "title": "Be careful with sleeping pills!",
      "content": "Be careful with sleeping pills! Many people take sleeping pills or sleep aids, such as the hormone supplement melatonin. But use sleeping pills with caution, as taking them and then flying at high altitudes may increase the risk of blood clots and DVT. If you do feel you need to take sleeping pills, ask your doctor which type is right for you before you use any pills for flying. [6] X Research source Always talk to your doctor about any risks or complications due to taking sleeping pills. Several prescription sleeping pills you might take are Ambien, Silenor, and Lunesta. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can also take Benadryl, an over the counter antihistamine that causes drowsiness and may help you get to sleep. Taking a melatonin supplement is another option. Speak to your doctor before you take any over the counter sleeping medications to help you sleep. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source It's important to time when you take the sleeping pills to avoid waking up feeling groggy and tired. If you are flying from London to New York, for example, take the pills at your bed time in New York, using the time zone in New York. If you are flying from London to Beijing, take the pills at your normal bed time in Beijing, while you are on board the flight. [9] X Research source While it's important that you sleep during your flight, you should also try to get up and walk around at some point to avoid blood pooling in your legs and to lower your risk of blood clots."
    },
    {
      "title": "Recline your seat.",
      "content": "Recline your seat. You are used to sleeping flat on a bed, so try to mimic this as much as possible during your flight by reclining your seat . Before you do so, give the person behind you a heads up, as they may have a beverage on their tray. Most people will recline their seats during a night flight, as they are all after sleep like you."
    },
    {
      "title": "Take your shoes off.",
      "content": "Take your shoes off. Get comfortable by slipping off your shoes and placing them under the seat in front of you. Put on your socks, if necessary, and wrap your sweater or your jacket around you so you stay warm while you sleep. [10] X Research source"
    },
    {
      "title": "Use your neck pillow, your sleep mask, and your earplugs.",
      "content": "Use your neck pillow, your sleep mask, and your earplugs. Before your flight, pull out these important items and place them in the front pocket of your seat. When you're ready for a snooze, take these items out to prepare for sleep. If you are using earphones and are going to listen to music to help you sleep, ensure the volume is not set too high so you don't disturb those around you. There are several apps available via your smart phone that provides calming sleep sounds to help you drift off, such as SleepStream. [11] X Research source"
    },
    {
      "title": "Put on the compression socks to improve your blood circulation.",
      "content": "Put on the compression socks to improve your blood circulation. Prevent tingling or uncomfortable leg pains, as well as more serious conditions like blood clots, with a pair of compression socks. This preventative measure is especially important if you plan to sleep for several hours on your flight and are not going to be moving around very much. [12] X Research source It's important for your blood circulation to try to stand up and walk down the aisle for five to ten minutes every few hours on a long flight, though this may interrupt your deep sleep."
    },
    {
      "title": "Avoid looking at bright screens, like your laptop or a television screen.",
      "content": "Avoid looking at bright screens, like your laptop or a television screen. The bright light from a laptop or a television screen can linger even when you close your eyes and make it difficult to shut your brain off for sleep. Prepare for sleep by putting away your laptop, dimming the light on the screen in the seat in front of you, and lowering the brightness of your phone. Remember that though you may feel you can be productive on a long flight by answering emails and watching the latest release, sleep is never a waste of time. Arriving at your destination well-rested will be worth it."
    },
    {
      "title": "Ask the flight staff not to disturb you.",
      "content": "Ask the flight staff not to disturb you. Before taking off, pull a flight attendant aside and politely ask not to be disturbed if you fall asleep during the flight. Most attendants will let you sleep during a flight and will follow the do not disturb protocol, but give the staff a gentle reminder so you are left in peace."
    },
    {
      "title": "Set an alarm 30 minutes before your flight lands.",
      "content": "Set an alarm 30 minutes before your flight lands. Once you get to sleep on your flight, you may not want to ever wake up. Rather than be jolted awake by bright lights or a captain's announcement, set an alarm on your phone so you have time to wake up and get organized before the plane lands. Waking up 30 minutes before landing will give you time to go the restroom, gather your sleep items, put on your shoes, and get ready to disembark, feeling well rested."
    }
  ]
}