{
  "url": "https://www.wikihow.com/Slowly-Drift-Away-from-a-Person",
  "title": "How to Gradually Drift Away from a Friend",
  "steps": [
    {
      "title": "Stop making plans with them.",
      "content": "Stop making plans with them. Friendships require mutual effort, and if one or both of you isn’t putting in that effort, the friendship will gradually fade. [1] X Research source It doesn’t require much from you; simply stop inviting the other person to events and hangouts, and avoid spending time with them in general. After a while, they’ll most likely stop trying to initiate time together If they do invite you somewhere, politely decline . Say something brief, vague, and polite, like, “Sorry, but I’m busy that day.” No need to get into specifics. Keep busy with other friends, work or schoolwork, or family obligations, so that you have an easier and more legitimate excuse to turn them down. This also helps keep your mind off the friendship."
    },
    {
      "title": "Don’t initiate conversations, and keep it formal.",
      "content": "Don’t initiate conversations, and keep it formal. You might still nod and say, “Hello,” if you feel comfortable, but if you’re trying to end a friendship, avoid striking up conversations . Limiting contact and feelings of familiarity is key to cutting ties. If you’re in a situation where conversation is unavoidable, like a group project, keep it formal, and avoid talking about your personal life. Focus on your assignments, work, or just make small talk instead. Conversations aren’t just in person—texting and social media count, too. If you’re really trying to end a friendship, mute them on social media (since unfollowing might cause drama) to get them out of your mind while you’re online. If your former friend starts a conversation with you, try to end it quickly. Don’t ask a lot of questions, and excuse yourself with a simple, “Sorry, I have things to do.”"
    },
    {
      "title": "Stay polite to make it easier on both of you.",
      "content": "Stay polite to make it easier on both of you. You may not be BFFs any more, but that doesn’t mean that you have to totally ice this person. When you see them, be respectful and cordial, maintain eye contact, and provide help if they really need it (e.g. if they need to know what the French assignment was). You’re just trying to set boundaries and politely end the friendship , not hurt anyone’s feelings. [2] X Research source"
    },
    {
      "title": "Give a straightforward answer to explain yourself.",
      "content": "Give a straightforward answer to explain yourself. If your former friend wants to talk to you about why you’ve disappeared, try to defuse a fight before it starts. Assure them that they aren’t a bad person, focus your reasoning on yourself, and tell them you don’t have the energy or capacity to keep up the friendship right now. [3] X Research source You might say something like \"I'm sorry I’ve been hard to reach. I’m dealing with a lot right now and need to focus on myself.” This is best said in person, but don’t be afraid to say it in a text or social media message if saying it in person would be overwhelming. Emphasize the differences between you. Do you already spend a lot of time apart? Are your interests different than they used to be? Your values? Identifying these will help drive home the fact that you’re different people now. You might also say, “You’re a good friend, but I think I need some distance and time to think more about myself,” or, “Please don’t take this the wrong way, I’m just working on myself for a while.”"
    },
    {
      "title": "Anticipate when you’ll see them to avoid awkward conversations.",
      "content": "Anticipate when you’ll see them to avoid awkward conversations. You probably won’t be able to avoid them completely, especially if you go to school together or have the same friends. That said, until you feel comfortable that the friendship has ended, avoid parties or other events where you know they’ll show up, or attend with a different group of friends if possible. Hanging out with other people makes it easier to avoid confrontations or awkward, one-on-one conversations."
    },
    {
      "title": "Avoid talking bad about them to other people.",
      "content": "Avoid talking bad about them to other people. Even when you have solid reasons to cut someone off, it’s a good idea not to air out your dirty laundry. Spreading rumors or criticizing them in front of other people only perpetuates the conflict, and might start new drama. Instead, stay civil, especially if you have mutual friends. [4] X Research source Instead, remind yourself that every friend comes into your life for a reason, and many exit for a reason, too, and it’s as simple as that. Of course, confide in your other close friends and tell them what’s going on if you need someone to talk to, but keep it level-headed, and explain both sides of the situation as best you can. If someone asks why the friendship ended, offer a plain, straightforward answer, but avoid placing any blame if your ex-friend wasn’t downright abusive."
    },
    {
      "title": "Allow yourself to grieve for the friendship.",
      "content": "Allow yourself to grieve for the friendship. Even though the friendship had a slow fade, you might still feel hurt, sad, or overwhelmed. [5] X Expert Source Stefanie Barthmare, M.Ed., LPC Psychotherapist Expert Interview. 21 May 2021. That’s totally natural, so let yourself feel those feelings in order to move on from the friendship. Ask yourself what you learned from the friendship, and what you’re thankful for from it. Write down your feelings in a journal, or talk to another close friend or family member about how your feeling to get your emotions out. It may help to get rid of things that remind you of the friendship, like old photos or gifts. You don’t have to throw them out, but put them away in a separate album or a box, where you can get them out when you’re ready to look back. [6] X Research source"
    },
    {
      "title": "Make new friends, or put extra effort into your other friendships.",
      "content": "Make new friends, or put extra effort into your other friendships. Ask yourself what you learned from the end of your friendship, then apply those lessons to your other relationships. Do you wish you communicated more? Spent more time together? Learned more about each other? Take the chance to do those things with your current friends to strengthen the relationships you treasure. Stay in touch. Social media is a terrific glue, but so is in-person contact. Use a mix of both! Plan adventures. Shared time is incredibly important, so make the most of it by arranging activities that both you and your friend enjoy. Take responsibility and learn from your mistakes. This is the best way to ensure that your loss of a friendship didn’t happen in vain."
    },
    {
      "title": "You and your friend have grown apart as individuals.",
      "content": "You and your friend have grown apart as individuals. Like most important relationships, even the best of friendships can feel a little constricting or boring every once in a while. It can be tricky to know when to end a friendship , however, if you’re feeling like space has opened between you, or that you’re not sure who your friend is anymore, you might just let that distance widen. Ask yourself: [7] X Research source Do you feel like you have nothing to talk about anymore? Differences are awesome, but if you and your friend have nothing in common anymore, the friendship might be higher-maintenance than it’s worth. Does your friend consistently say or do things that make you uncomfortable or go against your own personal beliefs?"
    },
    {
      "title": "You put in more effort than your friend.",
      "content": "You put in more effort than your friend. Friendships are a team sport, and both parties need to give in order to get. If you find that you’re the only one sending invitations or initiating conversation, it could be a sign that your friend isn’t willing to put in the effort to maintain your friendship, and it’s time to let them go. It might not be anyone’s fault—their life may have just gotten busier, or they have more responsibilities—but it’s still draining for you. [8] X Research source Or, your friend might only get in touch if they need something from you, which doesn’t feel very good. It’s not much of a friendship if you feel like you’re being taken advantage of. ' Reader Poll: We asked 438 wikiHow readers to tell us what behavior most clearly shows that someone isn't a true friend, and 47% of them said: only calling me when they need something. [Take Poll] If your friend doesn't support you when you're down but always expects you to jump to their rescue, that's a strong indication that they're not a real friend."
    },
    {
      "title": "You don’t trust them.",
      "content": "You don’t trust them. Mutual trust is a big part of any healthy friendship. Your friend should be able to keep your secrets, and you should be able to confide in them about your feelings. But if your friend tends to spill the beans, then your friendship lacks trust, and may not be worth keeping. [9] X Research source Your friend might also tell you other people’s secrets, and if those secrets seem especially private, it could be a sign that they can’t keep your secrets, either. You might also not trust your friend because they participate in dangerous or illegal activities, like drugs or violence, in which case you might not feel safe around them."
    },
    {
      "title": "The friendship is toxic or abusive.",
      "content": "The friendship is toxic or abusive. Does your friend make you feel like less than your best? Do they make you say or do things that make you uncomfortable? Do they physically or verbally hurt you? If you have a friend who makes you feel negatively when you’re around them, don’t hesitate to end the friendship. [10] X Research source In general, if you are scared to be with your friend (whether it’s because of things they do or say), the friendship isn’t healthy. If someone scares you, there’s nothing wrong with suddenly ceasing to speak to them. If you’re comfortable, saying, “I don’t want to be friends with you. Please don’t talk to me,” is often the cleanest way to end an abusive friendship."
    },
    {
      "title": "You still feel like you want space, even after a break.",
      "content": "You still feel like you want space, even after a break. You may have plenty of reasons to end a friendship, but if there aren’t any urgent reasons, like safety or mental health concerns, consider sitting on the decision for a while. A slow drift is, by its nature, slow, and it’s not easy to bridge that gap once it’s created. There’s no reason to rush into it, so be certain. [11] X Research source Take a break from your friendship for a couple weeks. Tell your friend you need some space by saying, “I’m going through a hard time right now and need to be alone. Can we talk again in a couple weeks?” You may notice that you miss your friend or crave their company again. If so, hang out with them one more time. Do you have fun together, or do you feel the same problems are in place?"
    },
    {
      "title": "Reach out to your friend with a text or a letter.",
      "content": "Reach out to your friend with a text or a letter. If you’re wanting to rekindle a friendship that slipped away, it’s best to reach out with a message, rather than in-person. This lets them think about and decide for themselves what to do, rather than feeling pressured in the moment. Say something like, “I’ve been thinking about our friendship and I really miss you. Can we reconnect sometime?” [12] X Research source If your friend agrees, plan to meet somewhere neutral, like at a cafe or the park rather than someone’s home, so that you both feel comfortable."
    },
    {
      "title": "Communicate your own concerns about the friendship.",
      "content": "Communicate your own concerns about the friendship. If your friendship ended because of something specific, like a spilled secret or a broken promise, history might repeat itself if the issue isn’t addressed. Bring up your concerns to your friend using gentle language that doesn’t make accusations, but which focuses on your own feelings. Also, give your friend space to voice their concerns, as well, and take responsibility for your own mistakes . [13] X Research source For example, say, “I was hurt when my secret got out, and I felt betrayed. I think I acted too rashly, though, and I’m sorry for that. Can we agree to trust each other more?” Often, working through conflicts and differences helps make your friendship even stronger!"
    },
    {
      "title": "Make casual, less frequent plans.",
      "content": "Make casual, less frequent plans. Sometimes, friendships start to crack because you’re just seeing too much of each other, and you start to feel confined. When you’re reconnecting with a past friend, plan for more relaxed hangouts that don’t happen as often to give you both some space and comfort as you get to know each other again. [14] X Research source For example, grab dinner together once a week, or invite each other to group activities where you’re not relying on just each other for company. More frequent contact via text messages or other social media can help bring you closer while still giving each other space. Do what feels right! If you find yourself wanting to hang out more frequently, go for it—that’s a great sign that your relationship is getting stronger."
    }
  ]
}