{
  "url": "https://www.wikihow.com/Paint-Over-a-Chrome-Surface",
  "title": "How to Paint Over a Chrome Surface",
  "steps": [
    {
      "title": "Know that chrome can have a number of negative impacts on your health.",
      "content": "Know that chrome can have a number of negative impacts on your health. Depending on whether it is inhaled or absorbed through the skin, Chromium can cause irritation to the throat, nose, skin, and eyes, with the possibility of eye damage. It can create symptoms similar to influenza, asthma, and allergies, as well as the possibility of lung cancer with airborne contact. [1] X Research source In addition to chrome, any primer you use likely has the potential to cause not only the same issues above, but also have chronic negative effects on the liver, cardiovascular, reproductive, and urinary systems."
    },
    {
      "title": "Set up your work space in an adequately ventilated area.",
      "content": "Set up your work space in an adequately ventilated area. This will decrease the likelihood of any sickness via inhalation of hazardous materials. More often than not, repair work like this is performed on a garage. This allows fresh air to enter easily and replace any fumes, dusts, or vapors that could bring you harm. Keeping your paints and primers closed in their containers while not in use will help maintain a clean atmosphere and limit your exposure to hazardous chemicals."
    },
    {
      "title": "Wear long pants and long sleeves, in addition to an apron.",
      "content": "Wear long pants and long sleeves, in addition to an apron. This should protect your skin from any contact with the chromium and/or primer. Another option is coveralls. A favorite of those who work in metal shops and auto repair, these are the onesies of safety and provide ample coverage of your appendages and torso."
    },
    {
      "title": "Put on gloves and closed toed shoes to ensure the safety of your hands and feet.",
      "content": "Put on gloves and closed toed shoes to ensure the safety of your hands and feet. Since you will be working with corrosive substances, gloves made of thin plastic will not suffice. It is therefore recommended to use gloves made of P.V.C, rubber, or neoprene. As for footwear, there are a number of chemical resistant shoes available online. However, since you will not be handling any of the materials with your feet, it's really most important to just find something that completely covers your skin."
    },
    {
      "title": "Wear goggles, a shield or another protective device to prevent eye exposure.",
      "content": "Wear goggles, a shield or another protective device to prevent eye exposure. If you choose to use an electric sander, this will guard the soft tissue of your eye from any flying debris. It will also block any splashes of paint, primer, and fumes wafting from these substances. Although it is common to simply wear glasses that rest on the ears, it is advisable to use goggles while working with chemicals. This way you have a tight film around the entire eye, and gaseous particles cannot cause you any harm."
    },
    {
      "title": "Use a proper face mask to avoid all respiratory issues and internal tissue irritation.",
      "content": "Use a proper face mask to avoid all respiratory issues and internal tissue irritation. It is preferable to select a respirator that conforms to OSHA standards. [2] X Trustworthy Source US Occupational Safety and Health Administration U.S. government agency responsible for setting and enforcing workplace safety standards Go to source This will filter out any particles in your paint of primer that could lead to infections of the lungs. Particulate respirators like the N-95 - common to hospitals - are simple and widely available, but insufficient. It is necessary to get something that protects not just from particles but from chemicals, gases, and vapors. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Wash the chrome with soap and water until it is thoroughly cleaned.",
      "content": "Wash the chrome with soap and water until it is thoroughly cleaned. Wipe the surface with a dry, bleached cloth and then wait until it is fully dry. This is done before sanding to eliminate the possibility of impressing any foreign particles into the metal and contaminating your work. Using a bleached cloth maintains as close to a sterile environment as possible, which will lead to a better-finished product. You can also use bleach wipes for the same results!"
    },
    {
      "title": "Hammer out any unwanted bends or dents using a body hammer.",
      "content": "Hammer out any unwanted bends or dents using a body hammer. [4] X Research source This must be done before any paint is applied, as hammering later on would damage the coat of paint. If you are working with any metal that has an exterior and interior side, you will always hammer the interior side. So remove any parts that may be blocking access to the interior side. Place a hard material against the exterior surface and hammer out the dent, pressing against the hard material. Move slowly and work around the dent's perimeter towards the center. [5] X Research source Once the dent is hammered out, place your hard material on the interior side. Then lightly hammer the area surrounding your dent to remove any peaks in the metal."
    },
    {
      "title": "Use a media blaster to clean your parts.",
      "content": "Use a media blaster to clean your parts. A blasting gun uses pressurized air to send tiny particles (usually plastic beads, ground-up walnut shells, glass beads, and aluminum oxide) to strip paint from base material, as well as smoothing out very durable metals. [6] X Research source In order to contain the mess of media blasters, it is recommended to use a blasting cabinet. This will decrease the size of your work space, but also maintains cleanliness. In addition to the PPE (Personal Protective Equipment) already in use, it is safest to use some form of ear protection with media blasters as they create a loud noise and could cause hearing damage/problems."
    },
    {
      "title": "Sand the chrome exterior using sandpaper.",
      "content": "Sand the chrome exterior using sandpaper. Start with a grit less than 160 to remove a majority of the particles. Afterwards, use 320 grit sandpaper to remove any marks left by the first round, and give a smoother finish. Sandpaper is easier to acquire than a blasting gun, but depending on the size and makeup of the chrome surface, it can be the most difficult procedure. Note that with sanding it is important to be careful and use an equal amount of time and pressure over the entire surface to ensure an even result. This will create an ideal surface where the paint will stick more easily, and course texture won't show through the paint."
    },
    {
      "title": "Wipe down the chrome pieces to remove any dust and excess particles from the surface.",
      "content": "Wipe down the chrome pieces to remove any dust and excess particles from the surface. Spray down the parts with wax and grease remover. It is easiest to use an atomizer bottle to coat all surfaces. Use clean, bleached rags to wipe everything off."
    },
    {
      "title": "Guard your workspace from unintended painting.",
      "content": "Guard your workspace from unintended painting. Cover surfaces like trim, windows, and floors with drop cloth. The drop cloth is suitable for painting since it absorbs paint easily and allows for smooth painting. [7] X Research source At this point it is safest to clear the floor of any potential tripping hazard that could catch on the sprayer hose."
    },
    {
      "title": "Mix your primer and strain it to prevent any clogs in the spray gun's tip and internal filters.",
      "content": "Mix your primer and strain it to prevent any clogs in the spray gun's tip and internal filters. Wooden sticks are commonly provided with purchased paint and work well with mixing. To strain, use a scrap window screen or an old pair of panty hose. [8] X Research source This will remove any foreign particles or lumps and guarantee a smooth coat. Use a Two-Part Epoxy Primer as they are waterproof, resist corrosion, and offer the best level of adhesion for metal and industrial painting."
    },
    {
      "title": "Hang or position any pieces to be painted on a metal stand.",
      "content": "Hang or position any pieces to be painted on a metal stand. Hanging your pieces gives you closer to a 360ยบ access while painting. This will also work well for bottled spray paint. If however you do not have access to a stand, simply spray the pieces over an ample piece of drop cloth."
    },
    {
      "title": "Evenly coat the pieces with Two-Part Epoxy Primer using your spray gun.",
      "content": "Evenly coat the pieces with Two-Part Epoxy Primer using your spray gun . Allow them to dry, and add a second coat. [9] X Research source If using bottled spray paint, apply the primer as evenly as possible all around the metal part."
    },
    {
      "title": "Properly store any left over primer by pouring it from the spray gun's paint cup into its original container.",
      "content": "Properly store any left over primer by pouring it from the spray gun's paint cup into its original container. Store your primer in a cool, dry, and well-ventilated area. Also check to ensure the seal on your container is air-tight. Primer will not expire if properly stored, but it will evaporate if not securely sealed. Also keep in mind that primer is flammable and should be kept away from open flames, points of ignition, and temperatures over 100ยบF."
    },
    {
      "title": "Clean the spray gun",
      "content": "Clean the spray gun properly before adding your chosen paint. Make sure to remove your compressed air source and air regulator before you begin cleaning. It is important that a spray gun is thoroughly cleansed before you switch to a new substance, so follow the related wikiHow's instructions closely before moving on."
    },
    {
      "title": "Mix and strain any paint to be used with the spray gun.",
      "content": "Mix and strain any paint to be used with the spray gun. More often than not, paint stores will be glad to provide a wooden paddle for stirring. Be sure to ask for one with your purchase. As with the primer, using scratch window screen is an effective and simple way to filter out any lumps or foreign particles from your paint."
    },
    {
      "title": "Apply your chosen automotive paint.",
      "content": "Apply your chosen automotive paint. There are a few keys to keep in mind while painting. Maintain a distance of about 6 inches between the tip of the spray gun and the material surface. Using a sweeping motion that goes side to side while painting. If the spray gun is not in motion, then do not pull the trigger. This can lead to uneven, blotchy painting. [10] X Research source Allow the paint to dry completely; this often takes 20 minutes to an hour for each coat."
    },
    {
      "title": "Give the chrome a polished appearance by applying 3 coats of automotive clear-coat paint.",
      "content": "Give the chrome a polished appearance by applying 3 coats of automotive clear-coat paint. The clear-coat finish will also protect the chrome against rust and dust. Follow the same tips you did in the previous step."
    },
    {
      "title": "Wait a week until the automotive clear-coat paint has dried.",
      "content": "Wait a week until the automotive clear-coat paint has dried. You can then buff the chrome exterior using a buffing cloth and buffing compound to give it a glossy shine."
    }
  ]
}