{
  "url": "https://www.wikihow.com/Play-TriPeaks-Solitaire",
  "title": "How to Play TriPeaks Solitaire",
  "steps": [
    {
      "title": "Place three cards into separate piles.",
      "content": "Place three cards into separate piles. These will be the start of your “peaks” or mountain ranges, which will then interconnect at their bases. Keep in mind that you want to form the piles with cards from a standard deck of 52 playing cards. However, make sure to remove all Jokers from the pack before starting. Be sure to keep the cards turned over so you can’t see what they are. You should have 28 cards laid out by the end."
    },
    {
      "title": "Start to form your pyramids.",
      "content": "Start to form your pyramids. From the first card at the top, place two down (back side up), and then three more below them - forming a pyramid. You also want to make sure the cards touch the corners of the cards above them, though you can also layer over them. However, at the base, make sure the three pyramids do not touch each other."
    },
    {
      "title": "Set up the fourth row of cards.",
      "content": "Set up the fourth row of cards. This last level should interconnect the \"peaks\" or pyramids together. You will want to have four for each set, so 12 altogether. These are also the only cards you should turn over. Any remaining cards can be placed in a stockpile to the side, which will be used later."
    },
    {
      "title": "Turn one card in the stockpile over.",
      "content": "Turn one card in the stockpile over. Like in normal solitaire, this stock or \"waste\" pile determines which cards are next playable. However, rather than placing cards from the stockpile onto cards in pyramids, you will be taking cards from the pyramids and placing them onto the stockpile. The goal is to uncover and remove all the cards from the pyramids/peaks. [1] X Research source"
    },
    {
      "title": "Look at the card’s number.",
      "content": "Look at the card’s number. The only cards you can move to the waste pile are those that are one number above or one number below the card on the stockpile. For example, if the card on the waste pile is a King of Spades, then you can only move a Queen or Ace to that pile. [2] X Research source However, keep in mind that the Ace can be either a card above the King or a card below the 2, depending on how you’re playing."
    },
    {
      "title": "Don't worry too much about the suit and color.",
      "content": "Don't worry too much about the suit and color. When moving cards from the card peak to place on the waste pile, the suit or color don’t matter. Different from regular solitaire, you can place a red diamond on a black spade or vice versa. The only thing that matters is that the numbers are consistent."
    },
    {
      "title": "Turn over cards as they become available.",
      "content": "Turn over cards as they become available. When both of the cards that border a card have been moved, you can turn that card over. For example, if you remove every card in the fourth row of a pyramid, then you can turn over every one of the cards in the third row. Just keep in mind that if a card is still bordered or “pinned” by other cards, it can’t be moved."
    },
    {
      "title": "Turn over a card from the waste pile when needed.",
      "content": "Turn over a card from the waste pile when needed. If you have reached an impasse with no playable cards from the pyramid and stockpile, then you can turn over a new card. You can do this as many times as you need to move cards from the pyramids. However, if you run through the whole stockpile, then you will have to start repeating cards again."
    },
    {
      "title": "Play until you win or get stuck.",
      "content": "Play until you win or get stuck. Games are won when all the cards inside your peaks/pyramids have been placed into the waste pile. This means that all your playable cards have been completed. If the stockpile has been cleaned of cards while the pyramids still have cards, though, then the game has been lost."
    }
  ]
}