{
  "url": "https://www.wikihow.com/Share-Google-Calendar-on-Android",
  "title": "Share a Google Calendar or Event on Android",
  "steps": [
    {
      "title": "Open the Chrome browser on your Android.",
      "content": "Open the Chrome browser on your Android. While you can’t share a calendar from the mobile version of Google Calendar, there’s an easy workaround. To get started, open Chrome on your Android phone or tablet. You can also use a different browser if you prefer. You just need to be able to view the desktop version of the site."
    },
    {
      "title": "Go to the Google Calendar web app and sign in.",
      "content": "Go to the Google Calendar web app and sign in. When you first visit the site, you might be prompted to launch Google Calendar in the app instead. If so, tap Not interested to proceed to the website."
    },
    {
      "title": "Tap ⋮ at the top left corner of Chrome.",
      "content": "Tap ⋮ at the top left corner of Chrome. This will open a menu of options for the page."
    },
    {
      "title": "Select Desktop site.",
      "content": "Select Desktop site . The Google Calendar website will reload in the form you’d see in a desktop browser on your computer."
    },
    {
      "title": "Tap the calendar you want to share.",
      "content": "Tap the calendar you want to share. You’ll see your calendars in the menu on the left side of the page. Tap the one you want to share. [1] X Research source If you don’t see it, tap next to \"My calendars.\" This will expand the menu so you can see all your calendars. If the menu is already expanded, you'll see instead."
    },
    {
      "title": "Tap ⋮ next to your calendar.",
      "content": "Tap ⋮ next to your calendar. You'll see the three-dot menu appear when you select the calendar from the list."
    },
    {
      "title": "Select Settings and sharing.",
      "content": "Select Settings and sharing . A new page will load."
    },
    {
      "title": "Tap + Add people and groups.",
      "content": "Tap + Add people and groups . You'll see this under the \"Share with specific people or groups\" section header. You may need to scroll down. You can also tap Share with specific people or groups in the panel on the left to jump to this section."
    },
    {
      "title": "Add people or groups.",
      "content": "Add people or groups. Enter the names or emails of people that you want to share your calendar with or tap them from the drop-down of suggested contacts. Use the drop-down menu under \"Permissions\" to allow or deny permissions for those people. You can set them to only see when you're free or busy, see all event details, make changes to events, or make changes and manage sharing."
    },
    {
      "title": "Tap Send.",
      "content": "Tap Send . The person or people you're sharing the calendar with will receive an email with an invite to add the calendar to their list."
    },
    {
      "title": "Open the Google Calendar app.",
      "content": "Open the Google Calendar app. Do this by tapping on the calendar icon on the home screen or in the app drawer."
    },
    {
      "title": "Create an event.",
      "content": "Create an event. Tap the empty box corresponding to the exact date and time to create a new event. A window will appear covering the lower half of your screen so you can add details for the event. You can also share existing events using the same steps. Instead of tapping on a blank space, tap an existing event."
    },
    {
      "title": "Provide the event details.",
      "content": "Provide the event details. Swipe up to open the new event's information page. Enter the name of the event, location, and other details."
    },
    {
      "title": "Tap Add people.",
      "content": "Tap Add people . Enter the email addresses of the people you want to share your event with here."
    }
  ]
}