{
  "url": "https://www.wikihow.com/Play-Body-Body",
  "title": "How to Play Body Body",
  "steps": [
    {
      "title": "Gather a group of people together.",
      "content": "Gather a group of people together. Your group should be no smaller than 7 people, as it is too difficult to play after this point."
    },
    {
      "title": "Find a standard deck of 52 cards (it can include jokers).",
      "content": "Find a standard deck of 52 cards (it can include jokers)."
    },
    {
      "title": "Decide how many murderers you should have.",
      "content": "Decide how many murderers you should have. For a small group, you should only need one, for a group of twenty or so, you can go as high as two or three murderers."
    },
    {
      "title": "From the deck of cards, pick out one card for each person playing the game.",
      "content": "From the deck of cards, pick out one card for each person playing the game. There needs to be a special card for each murderer, such as an ace or a king."
    },
    {
      "title": "Take this pile of cards and place them face down in the center of the room in which you are playing.",
      "content": "Take this pile of cards and place them face down in the center of the room in which you are playing."
    },
    {
      "title": "Have everyone pick a card from the pile.",
      "content": "Have everyone pick a card from the pile. They cannot show or tell anyone what their card is. Have them place their cards back in the pile. The person (or people) with the special identification cards is (are) the murder(s)."
    },
    {
      "title": "Explain that those who are the murderers must indicate to a person that they are being murdered when a pair of hands are placed around their neck in a strangling motion.",
      "content": "Explain that those who are the murderers must indicate to a person that they are being murdered when a pair of hands are placed around their neck in a strangling motion."
    },
    {
      "title": "Have everyone gather in a circle, on their hands and knees.",
      "content": "Have everyone gather in a circle, on their hands and knees. Everyone must be quiet, and somebody must be near the door to turn off the lights."
    },
    {
      "title": "Turn off the lights and start crawling around.",
      "content": "Turn off the lights and start crawling around."
    },
    {
      "title": "The murderer(s) will also be crawling around, silently choking people when the lights are off.",
      "content": "The murderer(s) will also be crawling around, silently choking people when the lights are off."
    },
    {
      "title": "Now comes the fun part.",
      "content": "Now comes the fun part. If you come across someone lying on the ground, yell \"Body! Body!\", and have the person by the light switch flip the lights on."
    },
    {
      "title": "You must now vote on who you think is the murderer.",
      "content": "You must now vote on who you think is the murderer. Those people who are not dead vote between two people who they believe are the murderer. If you are the murderer, you say \"You got me!\". If you are not the murderer, you say \"It wasn't me!\" The people who were murdered and those who have been executed sit in a corner of the room silently."
    },
    {
      "title": "Keep playing.",
      "content": "Keep playing. The game continues until either everyone is dead or the murderer(s) is (are) caught."
    }
  ]
}