{
  "url": "https://www.wikihow.com/Pet-a-Chicken",
  "title": "How to Pet a Chicken",
  "steps": [
    {
      "title": "Be quiet.",
      "content": "Be quiet. When approaching a chicken to pet it, you need to try not to make loud noises. Any loud noise you make could startle the chicken and scare it away from you. [1] X Research source You don't need to be so sneaky that the chicken doesn't hear you, in fact you want it to know you are coming, but you should make only small amounts of noise. If you are helping a child to pet a chicken, remind them to be quiet before you start approaching the chicken."
    },
    {
      "title": "Approach the rear end of the chicken.",
      "content": "Approach the rear end of the chicken. Many chickens will squat down instead of fleeing when approached from behind. This is because this is how they react when a rooster approaches them to mate. [2] X Research source This does not happen in all circumstances but when it does it makes petting a chicken easier."
    },
    {
      "title": "Move slowly and calmly.",
      "content": "Move slowly and calmly. Any sudden movement you make may make the chicken run away from you. Fast movements will typically terrify it, as it will think you are a predator."
    },
    {
      "title": "Allow the chicken to know you are approaching.",
      "content": "Allow the chicken to know you are approaching. Make a small amount of noise as you approach. This will actually make the chicken less scared when you touch it. If the chicken didn't to see you approaching, you would startle it and it would run or fly away. [3] X Research source Usually your steps toward the chicken will create enough noise to let the chicken know you are approaching."
    },
    {
      "title": "Reach out and touch the chicken.",
      "content": "Reach out and touch the chicken. Move your hand slowly towards the chicken when you get close enough. Try petting the chicken's back first, as this is an easy area to access when you approach it. Once you make physical contact with the chicken, it may run away from you right away."
    },
    {
      "title": "Sit or crouch down in the chicken's area.",
      "content": "Sit or crouch down in the chicken's area. You'll want to be as close to the chicken's eye level as possible to avoid scaring it. It will be more willing to come to you if you're not towering over it. If the chicken isn't yours, ask the owner before entering the chicken's space and attempting to pet it."
    },
    {
      "title": "Lay some chicken food around you.",
      "content": "Lay some chicken food around you. Put some on the ground to encourage the chicken to come towards you. Wait until the chicken is looking in your direction so it sees that the food is being laid down. It's helpful if the chicken food you use isn't the animal's normal feed. The chicken will be more willing to come up to you if you use more interesting treats, such as mealworms or table scraps. [4] X Research source The amount of mealworms you give a chicken should be limited, as they aren't the healthiest of treats. However they are beneficial in training your flock."
    },
    {
      "title": "Feed the chicken out of your hand.",
      "content": "Feed the chicken out of your hand. Once the chicken knows that it can eat food that is near you without you being aggressive towards it, it will be more comfortable eating out of your hand. Put some feed or a treat in your hand and offer it to the chicken with your hand fully open. [5] X Research source Extend your as far away from your body as possible so that the chicken doesn't have to get too close to you."
    },
    {
      "title": "Reach out slowly and pet the chicken's back.",
      "content": "Reach out slowly and pet the chicken's back. Once the chicken is within arms length, reach out your hand with a smooth and non-threatening movement. Pet the back area with a soft touch. It may be that you are feeding it with one hand and petting it with the other. You must make sure the chicken sees your hand first so you don't catch it by surprise and cause it to run off. Tell children to be gentle with the chicken. Show them how to stroke the chicken. Make sure they don't hit or pull the bird."
    },
    {
      "title": "Build up a relationship with the chicken.",
      "content": "Build up a relationship with the chicken. If you are trying to pet a skittish chicken, it may take a few sessions of luring it towards you to get it close enough and comfortable enough for petting. Be patient and allow the chicken to decide when it wants to get close to you."
    },
    {
      "title": "Grab the chicken's body with both hands.",
      "content": "Grab the chicken's body with both hands. In one swift move, put your hands around both sides of the chicken's body, so that your fingers are under the chicken's belly and your hands are also holding down the wings. This will allow you to hold on to the bird even if it tries to get away. [6] X Research source Don't hold on to the bird too tight. You want to have a good enough hold that the chicken can't get away from you but not so tight that you hurt it at all. If a small child wants to pet the chicken, it's usually easiest to do if an adult holds the chicken while the child pets it."
    },
    {
      "title": "Do not grab a chicken by the wings or legs.",
      "content": "Do not grab a chicken by the wings or legs. In order to keep the chicken calm and content, you should hold it in a comfortable way. Grabbing it by its appendages will only make the animal struggle to get free, and possibly get injured, instead of making it comfortable enough to be petted. [7] X Research source"
    },
    {
      "title": "Move the chicken to under 1 arm.",
      "content": "Move the chicken to under 1 arm. Once you have a solid hold of the chicken and it has calmed down, you can move it so it's held in the crook of your arm. Wrap your arm around it so your arm is underneath the chicken's belly while its legs dangle freely. Keep your grip on it, as dropping it unexpectedly could injure the chicken."
    },
    {
      "title": "Pet the chicken with your free hand.",
      "content": "Pet the chicken with your free hand. Once the chicken is calm and held securely under 1 arm, you should be able use your other hand to pet its head, neck, back, or chest. [8] X Research source The chicken may try to peck at your hand if it doesn't want to be held or petted. It may take multiple attempts to get a chicken comfortable enough with being held to accept it and enjoy the petting session."
    }
  ]
}