{
  "url": "https://www.wikihow.com/Reject-Someone-Nicely",
  "title": "How to Reject Someone Nicely & Politely",
  "steps": [
    {
      "title": "Tell someone you know “no” promptly, privately, and in person.",
      "content": "Tell someone you know “no” promptly, privately, and in person. If it’s someone you’ve known for a while, Dating & Relationship Coach Julianne Cantarella says you really want to talk to them face to face and not over a text or a call. [1] X Expert Source Julianne Cantarella Dating & Relationship Coach Expert Interview. 6 August 2021. A face-to-face rejection shows the other person respect and allows you to see how they react to the news so you’re able to proceed in the kindest way possible. Additionally, try to let them down in a private (or semi-private) place. No one wants to be rejected in the middle of a crowd. This is especially true if you’re dealing with a friend and hope to keep the friendship. It’s natural to want to put off an awkward conversation, but waiting may give the other person hope, which makes the rejection more surprising and hurtful. Choose your moment wisely, but don’t wait for the right time. The only “right time” is when you know you don’t want to go out with them. If you’re already in a long-term relationship with someone, many of the tips expressed here will be helpful, but there are unique challenges as well. Take a look at How to Break Up or How to Break Up with a Guy Nicely for ideas."
    },
    {
      "title": "Be honest and direct but kind when you reject someone you know.",
      "content": "Be honest and direct but kind when you reject someone you know. Matchmaker & Certified Life Coach Christina Jay says, “Tell them they are a great person, but you are not interested in dating right now. They’ll take the hint. If not, you have to tell them directly that you are not interested in dating them.” [2] X Expert Source Christina Jay, NLP Dating & Relationship Coach Expert Interview. 11 February 2020. Don’t make up stories about meeting someone else, reconnecting with an old flame, or deciding to join the Peace Corps. They may be even more hurt if they know you’re lying or find out the truth later. Choose your words carefully to make sure you are getting your message across clearly but compassionately."
    },
    {
      "title": "Use “I” statements focusing on your needs, feelings, and perspectives.",
      "content": "Use “I” statements focusing on your needs, feelings, and perspectives. “It’s not you, it’s me,” might be cliché, but it’s much kinder than saying, “It’s you.” Think about your reasons and what you'll say beforehand if you sense an unwanted request for a date is coming. Don't just tell them a straight-out “no” or shift the blame onto them. Use “I” statements to get your point across without causing them to shut down. [3] X Research source Instead of “You’re a disorganized slob whose life is a mess,” try something like, “I’m just the type of person who needs a lot of order and structure in my life.\" If you’ve been on a date, talk about how you thought your [insert peculiarities here] would mesh with his/her [insert peculiarities here], and you’re glad you tried, but you don’t feel like it can work out."
    },
    {
      "title": "Listen to what they have to say without interrupting.",
      "content": "Listen to what they have to say without interrupting. If this person is a friend, don't just give your reasons and leave them hanging. Allow the person time to understand what you’ve said and respond. Practice active listening by making eye contact and hearing them out without interrupting. This shows them you respect them. Plus, it helps reduce conflict. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Taking a moment to allow them to process gives them the chance to get a handle on their emotions. If you don’t let them respond, they may feel like there’s still a chance you’ll change your mind if you just hear them out. Try to be sympathetic to their emotions. They may be sad, cry, or even vent some frustration. Just remember, you don’t have to deal with outright anger or verbal abuse."
    },
    {
      "title": "Stay strong and don't give in if they beg or try to talk you into anything.",
      "content": "Stay strong and don't give in if they beg or try to talk you into anything. The worst thing you can do is to retract your rejection because you feel sorry for the person or don't want to hurt them. Resist any attempts to point out flaws in your reasoning, promise change in exchange for reconsideration, or explain that you have him or her all wrong. Allowing them to make these arguments sends mixed messages and may give them false hope. [5] X Research source Avoid saying you’re not ready “yet.” The other person may think they’ll have another chance in the near future. Don’t apologize for not wanting to go out with someone. Instead, be firm and say something like, “I understand why you feel that way, but I just don’t think it will work out between us.”"
    },
    {
      "title": "If you reject a friend, stress how important their friendship is to you.",
      "content": "If you reject a friend, stress how important their friendship is to you. Jay recommends, “I would say that you don't want to ruin the friendship. ‘I'm really flattered that you asked me out, but I really respect our friendship, and I don't want to change what we currently are.’” [6] X Expert Source Christina Jay, NLP Dating & Relationship Coach Expert Interview. 11 February 2020. If you hope to remain friends with the person you’re rejecting, talk about how much you value your friendship, but don't use it as your only excuse. Just be aware that it might be an uncomfortable discussion, especially once you say “no.” If things get awkward, don't make them feel bad. Simply, thank them for being honest about their true feelings. Try talking about why your friendship wouldn't work as a romance. For instance, say something like, “I love how spontaneous and fun you are, but I need more structure and consistency in a romantic relationship.” Accept the friendship may end. The other person has already decided they don’t want things to continue as is, and there may be no going back. Try saying something like, “I really would love to remain friends, but I know you may need some time. We can talk about it again whenever you feel ready.\""
    },
    {
      "title": "Try to end the conversation on a positive note.",
      "content": "Try to end the conversation on a positive note. Cantarella recommends saying something like, “I think you're a really great person. I know you're going to meet someone special, but I just don't think that we're a match.” [7] X Expert Source Julianne Cantarella Dating & Relationship Coach Expert Interview. 6 August 2021. Jay adds, “ I would say, ‘Thank you for the gesture, but I'm not open to dating right now.’ That's a good way to decline a date.” [8] X Expert Source Christina Jay, NLP Dating & Relationship Coach Expert Interview. 11 February 2020."
    },
    {
      "title": "Consider rejecting them by text if they ask you out by text.",
      "content": "Consider rejecting them by text if they ask you out by text. It's usually a good idea to turn someone down face-to-face, but when someone asks you out by text, email, or phone, it’s acceptable to respond the same way. It’s more important to give them a prompt response than to put things off until you can talk in person. It’s also acceptable to break things off via text if you’ve only been on a few dates. Matchmaker & Dating Coach Judith Gottesman says it’s best to give the person your answer as soon as you know you aren’t interested. [9] X Expert Source Judith Gottesman, MSW Matchmaker & Dating Coach Expert Interview. 19 October 2021. It’s better to reject someone by text than ghost them. Ghosting is unnecessarily mean. You liked them enough to go out with them, so give them the courtesy of a text at the very least."
    },
    {
      "title": "Thank the person who asked you out.",
      "content": "Thank the person who asked you out. Jay recommends starting your refusal with a “thank you.” [10] X Expert Source Christina Jay, NLP Dating & Relationship Coach Expert Interview. 11 February 2020. Someone who asks you out is giving you a compliment, so a sincere “thanks” is always appropriate. It’s also a positive way to respond that helps let them down easy. Say something like, “Thank you! I’m flattered,” or “Thanks! It’s so nice of you to ask me out.”"
    },
    {
      "title": "Be honest, direct, and considerate.",
      "content": "Be honest, direct, and considerate. Jay recommends saying something like, “I'm just not open to dating right now. I'm working on myself. Thank you so much for the offer, but I can't entertain it.” [11] X Expert Source Christina Jay, NLP Dating & Relationship Coach Expert Interview. 11 February 2020. It may be tempting to make up an excuse to avoid going on a date, but why not just be honest? A little temporary awkwardness will probably leave both of you feeling better in the end. Saying something as simple as, “Thanks for the offer. It was nice talking to you, but I'd like to just leave it at that” might do the trick. Don’t try to come up with a long explanation. Just be clear, concise, and honest. Being direct isn’t the same as being mean, even though it might feel that way. You may be inclined to keep things light by making a joke, but the other person may not know you or your sense of humor and may not understand, so it's best to keep your rejection simple and honest."
    },
    {
      "title": "Treat the other person with dignity and respect.",
      "content": "Treat the other person with dignity and respect. Rejection isn’t fun for anyone. Try to be sensitive to what they’re feeling. Treat them how you would want to be treated if you were in the same situation. Showing respect for another person is a way for you to demonstrate you’re a good person. [12] X Research source Don’t wait until they walk away and gossip with your friends about them or laugh after rejecting them."
    },
    {
      "title": "Let go of any guilt you might feel for rejecting them.",
      "content": "Let go of any guilt you might feel for rejecting them. While it’s normal to feel bad that they might be hurt by your rejection, you haven’t done anything wrong. You can’t control their emotions or be responsible for them. [13] X Research source Consciously choose to let go of any guilt you might be feeling. Agreeing to a date so you don’t feel guilty will only hurt them more in the long run."
    },
    {
      "title": "Be honest and direct, but don’t worry as much about kindness.",
      "content": "Be honest and direct, but don’t worry as much about kindness. Some people simply need an absolutely clear, no-doubt, no-wiggle room, outright rejection to get the picture. [14] X Research source If you’re stuck trying to deal with someone who won’t take no for an answer or is just a creep who won’t leave you alone , you may not have the luxury of kindness. Just reject them quickly and as safely as possible. Don’t just ignore them, thinking they’ll lose interest. Ignoring them leaves the opening for them to think you didn’t get their message or didn’t hear them. Say something like, “I'm sorry, I'm not interested in pursuing this further, and that's all there is to say. Good luck and goodbye.”"
    },
    {
      "title": "Lie carefully if you feel unsafe being truthful.",
      "content": "Lie carefully if you feel unsafe being truthful. One of the most effective lies is “I have a boyfriend/girlfriend.” The message that you’re “taken” usually gets through to people even when saying no doesn’t. [15] X Research source Just remember to keep the lie as brief as possible. Coming up with a detailed lie may make the other person think you’re opening up to them and want to talk more. Stick with statements like “I just got out of a long-term relationship,” “I don’t date outside of my religion/culture,” or “I think you look too much like my brother/sister.” Then leave it at that. Trot out that fake phone number if you feel you need to."
    },
    {
      "title": "Walk away from a person who won’t take no for an answer.",
      "content": "Walk away from a person who won’t take no for an answer. If you’ve made your rejection clear and the other person still won’t leave you alone, remove yourself from the situation. If you’re alone with them, walk away as quickly as you can. If you’re in a crowd, loudly say something like, “I’m not interested in you. Stop talking to me. You’re making me uncomfortable,” as you walk away. Be loud enough that other people will hear you. Gee says when you’re a woman dealing with men, find a group of other women. “He's a little less likely to [bother you] if you're just surrounded by a pack of she-wolves because he can be called out on it. So he doesn't want that to happen.” [16] X Expert Source Collette Gee Dating Coach Expert Interview. 1 May 2020. Once you’ve made yourself clear, ignore their pleas, complaints, rants, etc. If you ever feel threatened or unsafe because of the other person, get help and/or contact the authorities. Reader Poll: We asked 488 wikiHow readers about how they’d handle someone continuing to pursue them after rejection, and 58% of them agreed that they would set clear boundaries and communicate their disinterest . [Take Poll]"
    },
    {
      "title": "Text or email your rejection to avoid seeing the person again.",
      "content": "Text or email your rejection to avoid seeing the person again. If the other person has your contact information and is not taking no for an answer, a face-to-face meeting may only encourage them. This is a situation when emailing or texting your rejection is appropriate. If the other person continues to contact you after you’ve told them you aren’t interested, it’s stalking behavior, making it even more important to clearly state you don’t want to talk to them. [17] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source If you’re concerned the person may lash out in anger at your rejection and harm you, DO NOT meet them in person. Contact the authorities. If you need help dealing with a stalker, contact The Rape, Abuse, & Incest National Network (RAINN) at their website or call 1-800-656-HOPE (4673)."
    },
    {
      "title": "Accept the other person’s decision and react calmly.",
      "content": "Accept the other person’s decision and react calmly. If you're on the receiving end of a rejection, you may feel hurt and maybe even a little angry, which is okay. Acknowledge those feelings, but don’t dwell on them. [18] X Research source When you’re dealing with a rejection , don’t let anger make you do or say something you’ll regret later. You can’t force someone to like you in that way. And they certainly aren’t going to like you more if you lash out or harass them to go out on a date."
    },
    {
      "title": "Respect the other person’s boundaries.",
      "content": "Respect the other person’s boundaries. When a person says “no” when you ask them out, they are setting a boundary that they don’t want that type of relationship with you. By respecting their boundary, you show them you’re safe and trustworthy. Breaking that boundary by trying to talk them into going out with you shows a lack of respect, which is a big red flag. [19] X Research source Respecting the other person’s boundaries means if they say they want to stay friends, you don’t push for something more later. If they ask you not to contact them again, don’t call, text, or follow them on social media."
    },
    {
      "title": "Be kind to yourself and try to stay positive.",
      "content": "Be kind to yourself and try to stay positive. Give yourself a little time and grace to handle the rejection and process your emotions. Try talking to a friend or family member about what happened and how you feel. Admit to them how sad and disappointed you feel, but don’t dwell on it. [20] X Research source Remember that you’re a good, kind, respectful person. Another person’s rejection can’t change that. Use this rejection as an opportunity to learn and grow. Give yourself a pat on the back! Asking someone out takes courage."
    }
  ]
}