{
  "url": "https://www.wikihow.com/Plan-a-Date",
  "title": "How to Plan a Date",
  "steps": [
    {
      "title": "Select a date activity.",
      "content": "Select a date activity. In general, the person who asks for a date also chooses the activities--however, it is perfectly appropriate (and advisable) to ask for the other person's input. If you do not know your date very well, (especially on a first date) you might want to choose an activity with broad appeal that most people enjoy. That way chances are high that the two of you will have a great time. Try one of these typical date night venues: Be tourists in your city. Go for a walk in the city's prettiest park, visit a museum you have been meaning to go to or take a ferry ride so you can appreciate the beautiful skyline. Get tickets to see a movie. In general, pick a broadly popular one. Generally, choose romantic comedies or action movies over serious dramas and gory war movies. Find a place to see a live music concert. This could be a restaurant, coffeehouse, or bar. But it could be a free outdoor concert. Catch a sporting event, such as baseball, football, hockey, basketball, or whatever is playing tonight. Go to a restaurant, ice cream parlor, coffeehouse, food truck, or bar (if appropriate). Go to an amusement park or state fair. Usually, there is a little something for everyone, including rides, games, food, shows, and so on. Reader Poll: We asked 549 wikiHow readers who've gone on successful dates, and 64% of them agreed that the best first date location is a coffee shop. [Take Poll]"
    },
    {
      "title": "Plan an adventure.",
      "content": "Plan an adventure. If you think he or she will appreciate something a little more adventurous, you have many options for planning a fantastic date. Doing something that may be a little scary and crazy together is a great way to have fun, bond, and get to know each other better. Just be sure it is relatively safe, and is not too \"out there\" for either of you to handle. Here are some ideas: Go to an amusement park and ride roller coasters together. Holding hands afterward on the Ferris wheel is also a plus. Go to a water park and take advantage of the water slides. Remember to tell your date to bring a bathing suit! Try an adventure sport together. Skiing, snowboarding, surfing, kayaking, snorkeling, rock climbing, rappelling, and caving are all great options. Look into skydiving and bungee jumping for real adrenaline junkies! Take or rent some bicycles and hit the bike path. Try something different that neither have you tried before: learn to play the didgeridoo, take a tango class, a theater improvisation workshop, make Mongolian cuisine, or take a lesson on curling. Not all adventures have to be highly physical dares; sometimes an artistic, intellectual, or musical adventure is just as thrilling or interesting!"
    },
    {
      "title": "Make it ultra romantic.",
      "content": "Make it ultra romantic. If your idea of the perfect date is sweet from start to finish, plan a day that gives you and your date plenty of alone time and chances to help those first feelings of love grow ever stronger. Choosing a beautiful setting is key, so find a spot in your area that's unquestionably pretty and an activity that does not require the two of you to get covered in dirt or sweat. Try one of these: Go for a walk on the shore of an ocean, lake, pond, or river. Any kind of water will provide the perfect setting for romance to happen. If there's a pretty stone bridge, stroll over it. If the area has boat rentals, rent a rowboat or paddle boat so you can spend some romantic time in the water without getting wet. Walk around the historical section of town, preferably a street lined with quaint cafes, ice cream shops, and cute boutiques where you can buy each other sweet gifts. Book tickets to a play. It helps if the play has a romantic element and a happy ending since a sad play could upset the night's mood. If you don't like plays, go to a planetarium or another place that will give you time to spend in the dark next to each other."
    },
    {
      "title": "Date safe.",
      "content": "Date safe. Especially for a first date, plan dates that do not put you or your date in a vulnerable position. In general, this means not being completely in private, and not dependent on the other person: Meet in a public place: movie theater, restaurant, state fair, nightclub, hockey rink, concert, comedy club. Be sure it is well-lit and has others about it. A moonlit beach might be romantic, but choose the brightly-lit boardwalk rather than a deserted portion. Have transportation independent of the other person. Even if she offers to drive, be sure to have a friend that can pick you up, or the bus schedule, or get a cab. Have your own money, even if you do not expect to have to pay. You may need cab fare, or to cover your bill or some other emergency. Be extremely careful with drinks, especially alcoholic ones. Unfortunately, some people have been known to use \"date rape drugs\" in beverages. Be sure drinks are not poured away from your view. Have the bartender serve your drinks. Stick to bottled beverages you know the taste of rather than cocktails. If you live or visit a dormitory, leave the door open. Young adults especially, may not create a living area more suitable for entertaining. Leaving the door open creates a situation in which the two of you are not isolated."
    },
    {
      "title": "Stay in for a cozy night.",
      "content": "Stay in for a cozy night. Inviting someone to your house is a rather intimate affair since the person will get to know a lot about you just by looking around your living room. But for people who prefer a quiet night to a night on the town, this can be perfect. If you are ready to take this step, plan your quiet night by doing the following: Make sure the house is very clean. If your date walks into a messy house, he or she will probably see that as a red flag. A dirty, disorganized, smelly living space is a turn-off. Cleaning up shows both you care for the other person, and you take some pride in yourself. Create a romantic ambiance. Make sure the lighting is soft and a little dim. Make sure the space feels welcoming. Maybe you can have some favorite music playing at a reasonable level. Be careful of coming on strong! Having dim mood lighting, Barry White playing, and incense burning might be too strongly suggestive for your girlfriend's first visit. It can come off as sleazy. Have some conversation starters. If you have objects that relate to you and your interests, it helps facilitate discussion. You probably already have many in your home! For instance: your paintings, your guitar, your photography portfolio, your dog, your trophy shelf, and so on. Be careful about the bedroom. Being too forward about inviting your date to your bedroom can send a strong message. There is nothing wrong with taking your date to your room, but if he or she looks uncomfortable, be sure to make it clear you can move somewhere else. Have an activity planned. Pick out a few movies or shows to watch, or a multi-player video game. If you are a good cook, that is a fun two-people activity, too. Reader Poll: We asked 540 wikiHow readers about their favorite date night activity, and 66% agreed that if you’re hanging out at home, the most romantic thing you can do together is cuddle and watch a movie. [Take Poll]"
    },
    {
      "title": "Choose an eatery.",
      "content": "Choose an eatery. You can have an amazing date at almost any type of restaurant, not just fancy and expensive ones. It can be a cantina with great margaritas, a French restaurant with luxurious entrees, or even a new ice cream place. You may want to choose a place you have been to before, or that someone you know has recommended. Nothing sours a date like ending up in a restaurant with prices that are shockingly high or food and service that's subpar. Check on the menu pricing. You can often get a sample menu online; many restaurant reviews will give an idea of what you can expect to pay. This helps avoid an uncomfortable situation: finding yourself short of money or at an unexpectedly extremely cheap or expensive eatery. Plan to pay for your date's meal if you are the one who's organizing the date."
    },
    {
      "title": "Match the tone of the date to the tone of the restaurant.",
      "content": "Match the tone of the date to the tone of the restaurant. If you spent the day kayaking in the ocean, consider having a casual meal. You could get lunch or dinner from a food truck, or buy sandwiches from a deli near the beach. If you are both sandy, sweaty, and wearing your beach gear, it might not be appropriate or practical to go to an expensive seafood restaurant. If you're going to be quite active all day, you could consider packing a picnic. Bring a bottle of champagne or wine to share to make it extra special. While casual dining is great for a date, avoid eating at a fast food place if at all possible. It's not the price of the food that matters, but the originality. Take your date somewhere special. When your date recounts details to her best friend, you don't want her description to include, “And then we went to McDonald's.”"
    },
    {
      "title": "Cook dinner at home.",
      "content": "Cook dinner at home. Nothing could be more romantic than planning and cooking an entire meal for your date. If you're planning to have a date night in, it's a way to make your date feel very special. Plus, having good cooking skills is impressive and sexy. Just be sure to cook something you have made before, so you know it'll turn out and taste delicious. You don't have to make a complicated six-course meal, but you also probably should not invite someone over for frozen pizza. If you are going to cook at home, make something quality. Or at least from a high-quality market. Sometimes making dinner together can be fun and romantic. Pasta dishes are easy to make and relatively inexpensive."
    },
    {
      "title": "Don't forget dessert.",
      "content": "Don't forget dessert. You could get dessert at the same restaurant where you eat, or go to a different place to wind down the night. No matter what type of date you had, it's nice to incorporate something sweet at the end. It is one last thoughtful touch that shows your date you put a lot of thought into planning the evening. Plus, it allows you to share a dessert, just like in the movies. Going out for ice cream is a nice way to end date during the summer. If you're cooking at home, consider serving something with chocolate. It tends to be a favorite. If your date does not have a sweet tooth, you could go to a bar to grab a nightcap instead. Of course, if you or your date do not drink or are underage, this is not a good idea. Sometimes an individual cannot have rich desserts, especially those with diabetes. Or the person may have allergies, food sensitivities, medical conditions, or whatnot. Just be flexible and understanding."
    },
    {
      "title": "End gracefully.",
      "content": "End gracefully. The end of a date can be a little awkward if you have not thought about it beforehand. Put some forethought into your plans. Are you going home separately after dinner? Do you plan to drop your date off after you're finished with dessert? Perhaps you may like to invite the person back to your house. Think about the logistics to avoid that awkward “what now” moment after an otherwise perfect date. Have your house ready in case you end up there. Have it clean and presentable. A kitchen with last night's dishes stacked in the sink and your dirty laundry in a pile on the floor will likely make a negative impression. End the date at a good time. Ending a date on the right note is tricky. In general, end it at a logical moment. For example, after the late movie ends, offer to drive her back to her place. It is generally better to end the date a little on the too-early side than too late. Kiss, hug, or more? At the end of a date, especially the first one, generally a gesture will effectively end the date. This is sometimes a very awkward moment. Generally in a heterosexual date, the girl should decide what she is comfortable with offering the guy as a gesture."
    },
    {
      "title": "Go with the flow.",
      "content": "Go with the flow. If something goes awry, remain calm and work towards having a good date anyway. An inflexible person, who stresses out and becomes irritable in the face of the unexpected will not be very successful with dates. Dealing with the unexpected in a creative, positive way can make a big impression."
    }
  ]
}