{
  "url": "https://www.wikihow.com/Sleep-After-Wisdom-Teeth-Removal",
  "title": "How to Sleep After Wisdom Teeth Removal",
  "steps": [
    {
      "title": "Remove any gauze in your mouth.",
      "content": "Remove any gauze in your mouth. If you leave gauze in your mouth before going to sleep, you may choke on it. Make sure you’ve carefully taken out all the gauze the dentist left in your mouth before you lay down to sleep. [1] X Research source As long as at least half an hour has passed since your wisdom teeth extraction, it is safe to remove the gauze from your mouth."
    },
    {
      "title": "Take pain medication as prescribed by your dentist.",
      "content": "Take pain medication as prescribed by your dentist. You will most likely be in a lot of pain after your surgery, especially on the first day. Pain medication is essential for dulling the pain long enough for you to fall asleep. [2] X Research source Follow all dosage instructions when taking pain medication. Take your pain medication before the anaesthetic has worn off (roughly 8 hours). This will make it easier for you to manage any discomfort caused by your surgery. Being under continuous pain medication will also help you to get more restful sleep."
    },
    {
      "title": "Drink cool fluids as comfort allows.",
      "content": "Drink cool fluids as comfort allows. It’s important to keep your mouth hydrated and prevent additional bleeding by drinking cool water. However, do not eat or drink anything that causes discomfort in your mouth; rather, wait until your discomfort has subsided and drinking is tolerable. [3] X Research source Avoid drinking with a straw for at least a week after your surgery. Don’t drink hot fluids or eat hot food during your recovery. [4] X Expert Source Alina Lane, DDS Board Certified Dentist Expert Interview. 21 April 2020. Only eat or drink soft, cool foods and fluids as tolerated. [5] X Research source"
    },
    {
      "title": "Put an ice pack on your face to decrease the swelling in your gums.",
      "content": "Put an ice pack on your face to decrease the swelling in your gums. Holding an ice pack to your cheek will dull the pain in your gums and make it easier for you to fall asleep. Ice your cheek near the extraction site for up to half an hour before going to bed. [6] X Research source Make sure you wrap the ice pack in a cloth before applying it to your face. If you’re planning to take a nap for half an hour or less, you can sleep with your ice pack on your cheek. However, avoid sleeping with the ice pack for longer periods, as it will leave your cheek feeling uncomfortably cold. Never apply heat to this area after your extraction surgery. [7] X Research source"
    },
    {
      "title": "Avoid brushing your teeth, rinsing your mouth, or touching the wound.",
      "content": "Avoid brushing your teeth, rinsing your mouth, or touching the wound. This may dislodge the blood clot formed in your wound and cause you to start bleeding again. The bleeding and pain will make it harder for you to fall asleep. [8] X Research source If your mouth begins bleeding and you apply gauze to the wound, be sure to not go to bed with this gauze still in your mouth. Wait until the bleeding has stopped (at least 30 minutes) before removing the gauze and going to sleep."
    },
    {
      "title": "Keep your head elevated to minimize swelling.",
      "content": "Keep your head elevated to minimize swelling. Use pillows to keep your upper body at a 45-degree angle and your head elevated. This will reduce swelling in your wounds and make them throb less, making it significantly easier for you to sleep. [9] X Research source Although this may not be your natural sleeping state, resting with your head upright is by far the best way to naturally reduce the pain in your mouth while sleeping. Consider investing in a wedge pillow to make sleeping in this position easier."
    },
    {
      "title": "Avoid sleeping on a slippery surface like leather.",
      "content": "Avoid sleeping on a slippery surface like leather. Sleeping upright makes it somewhat easier for your body to fall downwards while you’re asleep. Avoid sleeping on leather couches or other slippery surfaces to get a restful sleep and prevent hurting yourself. [10] X Research source This will be less of a concern if you sleep in a normal bed with your head propped up by pillows."
    },
    {
      "title": "Keep your room cool and dark to make it an ideal sleeping environment.",
      "content": "Keep your room cool and dark to make it an ideal sleeping environment. Turn off all the lights in your room, use heavy curtains on the windows, and lower the temperature in your room to maximize your room for optimal sleep. Keeping your room between 60 °F (16 °C) and 67 °F (19 °C) will help your body lower its temperature as it gets ready for sleep. If you keep your cellphone next to your bed, turn it over so that the screen faces down as you sleep. This will prevent it from adding unwanted light to your bedroom when new notifications pop up on the screen."
    },
    {
      "title": "Use aromatherapy to make it easier to fall asleep.",
      "content": "Use aromatherapy to make it easier to fall asleep. Some studies have shown that particular scents can alleviate stress and promote restful sleep. Consider using candles, oils, or sprays to make your room more aromatic and better for sleep. [11] X Research source The best scents for creating a better sleep environment are lavender and vanilla. You can also dip a cotton ball in a scented oil and leave that by your pillow for a quick and easy aromatic experience. Be very careful when lighting candles for maximizing your sleep environment. Do not fall asleep with a candle still burning."
    },
    {
      "title": "Play calming music to help you relax.",
      "content": "Play calming music to help you relax. It will be particularly hard to take your mind off the pain in your gums long enough to fall asleep. Play slow, calming music as you’re laying down to give your mind something else to focus on. [12] X Research source Slow music is generally the best music for falling asleep. Play music with a rhythm between 60 and 80 beats per minute for best results. [13] X Research source Some good genres of music to sleep to may include jazz, classical, and folk music."
    }
  ]
}