{
  "url": "https://www.wikihow.com/Prune-Arborvitae",
  "title": "How to Prune Arborvitae",
  "steps": [
    {
      "title": "Shear in early spring.",
      "content": "Shear in early spring. Early spring is a good time for heavy pruning because new growth hasn't started yet. When new growth does come in, it will hide the cuts you made in the tree. [1] X Research source To shear the plant, go over the whole plant with your pruning shears. Trim the tips off all of the branches to create a more even shape. Make sure to leave at least 1 shoot at the top of the tree for new growth. Pruning shears are scissor-like pruners that have 2 long blades that make them great for shaping your plant. If you need to remove entire branches, use loppers or a small saw. The earliest you should prune these trees is mid-March, though it does depend on how early spring comes to your area. [2] X Research source"
    },
    {
      "title": "Do light pruning from early spring to mid-summer.",
      "content": "Do light pruning from early spring to mid-summer. These trees continue to grow throughout the summer, so you may want to snip an errant branch here and there. It's fine to perform these cuts throughout the mid-summer. Anytime you prune a tree, you can encourage new growth. Therefore, it's best to wait until prime growing season for pruning these trees so you don't encourage it to start growing in winter. [3] X Research source"
    },
    {
      "title": "Prune troublesome branches anytime they need it.",
      "content": "Prune troublesome branches anytime they need it. When you see diseased, dead, or damaged branches, trim them right away. Trimming off these branches is better for the health of the plant, as diseases can spread and damaged branches can be a drain on the tree's resources. [4] X Research source"
    },
    {
      "title": "Avoid pruning very young arborvitae.",
      "content": "Avoid pruning very young arborvitae. When a tree is first getting established, it needs its foliage for growth. If you remove too much of its foliage, you could stunt its growth or even kill it. Prune sparingly on very young arborvitae in the first year or 2 of their life. [5] X Research source You can trim diseased, broken, or dead branches away if you need to, as well as any branches that rub on each other."
    },
    {
      "title": "Be more conservative when pruning trees that are over 2 years old.",
      "content": "Be more conservative when pruning trees that are over 2 years old. Arborvitae that are a couple of years old are more forgiving of cuts than an old tree. You can cut back into wood that is a year or 2 old, and the tree will likely grow it back. However, in older trees, it's less likely to grow back. [6] X Research source Arborvitae really don't need much pruning in general, so you should mostly prune to keep the tree's natural shape."
    },
    {
      "title": "Cut down to a lower branch crotch to reduce height.",
      "content": "Cut down to a lower branch crotch to reduce height. When you want to make your tree shorter, move down to the next place on the main stem where a large branch is growing off of it. Cut the stem or branch with a saw or shears at this point, but only do so if you're cutting into live wood. [7] X Research source Check to make sure the fronds are growing on the wood that you're leaving behind. If you cut into old wood that isn't growing fronds, the tree will not regrow from that point. [8] X Research source"
    },
    {
      "title": "Don't reduce a tree's height by more than 20 percent.",
      "content": "Don't reduce a tree's height by more than 20 percent. Reducing the plant by more than this amount is too much of a shock to the tree. Plus, you run the risk of cutting into old wood, which your tree won't recover from. [9] X Research source"
    },
    {
      "title": "Trim the tips of branches to shape the tree.",
      "content": "Trim the tips of branches to shape the tree. If you want to shape the tree, particularly if you've just trimmed the top, you can cut around the outer edges. Use pruning shears to snip off the outer edges of branches, creating a light shape. [10] X Research source When shaping the tree, follow its natural shape by snipping off pieces that are sticking out."
    },
    {
      "title": "Keep the base wider than the top.",
      "content": "Keep the base wider than the top. These evergreens naturally have a wider base. When you're shaping them, try to keep this feature. Doing so allows the bottom of the tree to receive sunlight, as it's not being blocked by the upper branches. [11] X Research source If you notice you've created a shape that's too straight top-to-bottom, trim a bit more off the top branches."
    },
    {
      "title": "Prune lightly as old wood will not regrow.",
      "content": "Prune lightly as old wood will not regrow. With arborvitae, the old wood doesn't bud. Therefore, what you cut won't always regrow. Use a light hand so you don't butcher the tree without it having a way to get its shape back. [12] X Research source When cutting shoots, never cut them all the way back to old wood."
    },
    {
      "title": "Use the 3-branch cut when removing a large limb.",
      "content": "Use the 3-branch cut when removing a large limb. This cut allows you to take out a branch without damaging the bark as much. If you don't use this cut, you could rip or tear the bark. Start by making a cut on the underside of the branch 6 to 12 inches (15 to 30 cm) away from the trunk. Cut 1/4 of the way into the branch. [13] X Research source Make another cut on top, 1 inch (2.5 cm) further out from the trunk than the first cut. The branch may fall off before you finish this cut. You should cut until the limb comes off. Cut the stub off at the trunk. Saw from top to bottom just beyond the swollen ring of bark at the trunk."
    },
    {
      "title": "Cut out dead branches to the stem.",
      "content": "Cut out dead branches to the stem. When you see brown foliage at the end of the branch, that's an indication it's died. In that case, cut the branch right at the stem with clippers or a saw and pull the branch out. [14] X Research source Lopping shears are a good choice for this purpose, as they have long handles that give you leverage. However, if the branches are larger than 1 inch (2.5 cm) in diameter, you can use a handsaw or a chainsaw instead. Another option is to make the cut at a healthy lateral branch instead of the trunk. A lateral branch is a main branch that grows off the trunk."
    },
    {
      "title": "Look for diseased branches to prune.",
      "content": "Look for diseased branches to prune. Diseased branches also need to be pruned so diseases don't spread to the rest of the tree. When you find a diseased branch, cut it all the way back to the stem or a lateral branch. [15] X Research source One common disease for this group of trees is needle blight, which results in yellowed or brown needle tips that progresses further down the foliage. They may also look dried out. On the branches, look for black fungal spots that may also curl out from the bark. [16] X Research source Make sure that you dispose of any diseased branches properly in your trash or curbside yard waste program. Then rake up the needles under the tree and dispose of these as well, as they may contain spores. This will prevent it from spreading. It's also best to avoid pruning diseased branches while they're wet because that's when fungal spores are most active."
    },
    {
      "title": "Prune away damaged branches when they break.",
      "content": "Prune away damaged branches when they break. If your tree is damaged by a storm or ice, cut away the branches that are damaged. Prune them back to the stem or a lateral branch within the tree. [17] X Research source Damaged branches drain the tree's resources and won't provide new growth."
    }
  ]
}