{
  "url": "https://www.wikihow.com/Raise-Your-Hand-in-Zoom",
  "title": "How to Raise Your Hand in Zoom on Desktop, Mobile and Web",
  "steps": [
    {
      "title": "Open Zoom and join a meeting.",
      "content": "Open Zoom and join a meeting . This application icon looks like a video camera inside a blue circle that you can find in your Start menu or in the Applications folder in Finder. You might have an invite to a meeting in your email or have a link or code that you can use to join an ongoing meeting. Refer to How to Join a Zoom Meeting on PC or Mac for more information."
    },
    {
      "title": "Click Participants.",
      "content": "Click Participants . It's with an icon that looks like two people centered at the bottom of your screen."
    },
    {
      "title": "Click Raise Hand.",
      "content": "Click Raise Hand . You'll see this on the right side of the pop-up window. Without notifying or disrupting the entire meeting, you'll notify the host that you have a question or comment. You can also use the keyboard shortcut, which is Alt + ' Y for Windows and Opt + Y for Mac. Click Lower Hand to signal that you don't have a question or comment. [1] X Research source"
    },
    {
      "title": "Open Zoom and join a meeting.",
      "content": "Open Zoom and join a meeting . This application icon looks like a video camera inside a blue circle that you can find on one of your Home screens, in the app drawer, or by searching. You might have an invite to a meeting in your email or have a link or code that you can use to join an ongoing meeting. Refer to How to Use the Zoom App for more information."
    },
    {
      "title": "Tap … .",
      "content": "Tap … . It's in the lower right corner of your screen. If you can't see it, tap your screen to show the meeting controls."
    },
    {
      "title": "Tap Raise Hand.",
      "content": "Tap Raise Hand . You'll see this as the middle option in the menu that slides up from the bottom of your screen. Without notifying or disrupting the entire meeting, you'll notify the host that you have a question or comment. Tap the button again to lower your hand."
    },
    {
      "title": "Go to https://zoom.us/ and join a meeting.",
      "content": "Go to https://zoom.us/ and join a meeting. If you don't have access to the desktop client or the mobile app, you can join a Zoom meeting using the web client in any web browser. You might have an invite to a meeting in your email or have a link or code that you can use to join an ongoing meeting. Refer to How to Join a Zoom Meeting on PC or Mac for more information."
    },
    {
      "title": "Click Participants.",
      "content": "Click Participants . It's with an icon that looks like two people centered at the bottom of your screen."
    },
    {
      "title": "Click Raise Hand.",
      "content": "Click Raise Hand . You'll see this in the lower right corner of the participants window. Without notifying or disrupting the entire meeting, you'll notify the host that you have a question or comment. Click the button again to lower your hand."
    }
  ]
}