{
  "url": "https://www.wikihow.com/Relieve-Dry-Socket",
  "title": "How to Relieve Dry Socket",
  "steps": [
    {
      "title": "Rinse your mouth with warm salt water.",
      "content": "Rinse your mouth with warm salt water. A salt water rinse will clean your dry socket and reduce bacteria. Mix 1/2 teaspoon (3 g) of salt into a glass of warm water, and gently swish the mixture in your mouth for 30 seconds before spitting it out. [2] X Research source Aggressive swishing can actually make your dry socket worse. Swish gently, or just let the salt water flood your mouth before spitting it out."
    },
    {
      "title": "Dress your dry socket with honey.",
      "content": "Dress your dry socket with honey. Studies show that applying honey to a dry socket can actually reduce inflammation and pain. Apply 1 ⁄ 4 teaspoon (1.2 mL) of honey to a piece of sterile gauze, then place the gauze on your dry socket. Replace the gauze and honey every 3 hours. [3] X Research source"
    },
    {
      "title": "Reduce swelling with an ice pack.",
      "content": "Reduce swelling with an ice pack. This can supplement the medications and reduce your pain. Cold packs are particularly effective in the first two days after the extraction. Apply the ice pack, wrapped in a thin towel, to the outside of your face. Do not put the ice directly on your skin as this may damage it. Apply the ice for approximately 10 minutes before giving your skin a chance to warm up. If you do not have an ice pack prepared, you can use a package of frozen peas or corn wrapped in a towel."
    },
    {
      "title": "Apply warmth after the first two days.",
      "content": "Apply warmth after the first two days. This will help increase the circulation and may reduce your pain. Ask your dentist what they recommend, but possibilities may include: Purchasing warming patches in your local drug store. They are available over-the-counter and are typically applied to the skin over the painful area. Read and follow the manufacturer’s instructions. Applying a hot water bottle that is wrapped in a towel. Do not apply the heat directly to your skin because this increases your risk of burning yourself."
    },
    {
      "title": "Stay hydrated.",
      "content": "Stay hydrated. Even if it hurts, it is still important that you drink enough water to prevent dehydration. Being properly hydrated will help you heal quickly and combat the nausea that may be a side effect of some pain medications. Just make sure fluids are room temperature — too hot or too cold can cause complications in the healing process. Monitor yourself for signs of dehydration such as: [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Thirst Headaches Nausea or vomiting Dry skin Dizziness Infrequent urination Passing cloudy or dark urine"
    },
    {
      "title": "Do not smoke or use tobacco.",
      "content": "Do not smoke or use tobacco. Tobacco may slow the healing process and make you more prone to an infection. In addition, the suction produced when you inhale while smoking can irritate the wound, allowing nicotine and other dangerous substances to reach directly into the extraction site. If you know that you will not be able to resist the craving, ask your doctor about trying a nicotine patch or nicotine replacement therapy. These treatments may also help you begin the process of quitting."
    },
    {
      "title": "Follow your dentist’s instructions for caring for the wound.",
      "content": "Follow your dentist’s instructions for caring for the wound. This may include rinsing your mouth and brushing carefully. [5] X Research source Be careful when brushing around the socket. Do not drink from a straw until it has healed. The suction may irritate the wound."
    },
    {
      "title": "Treat an infection with antibiotics.",
      "content": "Treat an infection with antibiotics. If your socket has become infected, you may receive a prescription for antibiotics. Always take the entire course of antibiotics, even after your symptoms are gone. This is important to prevent antibiotic resistant strains from evolving. Seek medical attention immediately if you develop any of the following signs of an infection: [6] X Research source Increasing pain or swelling Worsening breath or a bad taste in your mouth Fever"
    },
    {
      "title": "Learn to rinse the socket.",
      "content": "Learn to rinse the socket. The doctor will probably rinse the socket for you when you are in the office. This may help alleviate pain by removing pieces of food or debris that could be irritating it or causing an infection. The doctor will likely explain how to continue flushing it yourself at home: [7] X Expert Source Pradeep Adatrow, DDS, MS Board Certified Dentist & Oral Surgeon Expert Interview. 5 November 2020. You will probably receive a plastic syringe to use when rinsing the socket. Depending upon your situation, the doctor may tell you to use the syringe to flush the socket with water, salt water, or a special rinse. Continue rinsing the socket until it has healed enough that food and debris do not get stuck in it. Meanwhile, you should continue with good oral hygiene, brushing at least two times a day."
    },
    {
      "title": "Ask the doctor about medicated dressings.",
      "content": "Ask the doctor about medicated dressings. The doctor may put medicated dressings like padding into the wound. This may reduce your pain within a few hours. Depending upon your situation, your doctor may: [8] X Expert Source Pradeep Adatrow, DDS, MS Board Certified Dentist & Oral Surgeon Expert Interview. 5 November 2020. Ask you to schedule appointments to return for new dressings Teach you to change them yourself and give you a schedule of how often to do it"
    },
    {
      "title": "Discuss pain medications.",
      "content": "Discuss pain medications. The type of medication your doctor recommends will depend on how much pain you're in. They'll likely provide you with prescription strength medications, although they may recommend over-the-counter options. [9] X Expert Source Pradeep Adatrow, DDS, MS Board Certified Dentist & Oral Surgeon Expert Interview. 5 November 2020. Provide your doctor with a list of all other medications you take. This includes prescription medications, over-the-counter medications, herbal remedies and dietary supplements. It is important the dentist know what else you take so they can prescribe you something that won’t interact with anything else you are taking."
    },
    {
      "title": "Recognize the symptoms.",
      "content": "Recognize the symptoms. You may also be able to see that all or part of the blood clot in the socket is missing. You may even see bone below. Symptoms include: [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Pain that increases a few days after the tooth was removed. The pain may radiate from your socket to your ear, eye, temple or neck. Pain that does not respond to medication Bad breath A bad taste in your mouth Fever Swollen lymph nodes"
    },
    {
      "title": "Contact your dentist immediately if you think you have dry socket.",
      "content": "Contact your dentist immediately if you think you have dry socket. Chances are your dentist will ask you to come in so they can examine your wound. The dentist may: [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Check to see if the blood clot is absent. Look for exposed bone. Take an X-ray to exclude osteomyelitis, an infection of the bone, as the source of your pain."
    },
    {
      "title": "Discuss any risk factors that may have lead to your dry socket.",
      "content": "Discuss any risk factors that may have lead to your dry socket. There are several things that can make you more likely to wind up with dry socket after having a tooth removed. Be honest with your dentist if they ask about the following risk factors: [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source An infection around the extracted tooth. If the gums or the extracted tooth were infected when the extraction took place, your dentist was likely aware of it; however, if the infection was in the past and you were treated by another dentist, your doctor might not have been aware. Smoking or using a straw. Anything that requires a sucking action can loosen a blood clot. Tobacco may also make the wound heal more slowly. [13] X Expert Source Pradeep Adatrow, DDS, MS Board Certified Dentist & Oral Surgeon Expert Interview. 5 November 2020. Birth control pills. Birth control pills that cause you to have high estrogen levels can inhibit healing. Corticosteroids. In particular, prednisone may make you vulnerable to dry socket, as it creates a powerful anti-inflammatory effect which slows the healing."
    }
  ]
}