{
  "url": "https://www.wikihow.com/Send-MMS-on-Samsung-Galaxy",
  "title": "How to Send MMS on Samsung Galaxy",
  "steps": [
    {
      "title": "Open the Messages app.",
      "content": "Open the Messages app. It's the orange app with the white outline of a speech bubble. The Messages app icon may look different depending on the theme you are using on your Samsung Galaxy."
    },
    {
      "title": "Tap a conversation or create a new one.",
      "content": "Tap a conversation or create a new one. Tap a conversation from the list of all your recent conversations or create a new message by tapping the orange circle with a paper-and-pen icon at the bottom-right corner. If you create a new conversation, either select a contact from your contacts list or enter a person's phone number in the \"Recipient\" section."
    },
    {
      "title": "Tap .",
      "content": "Tap . It's the paperclip icon at the bottom-left corner of the screen. This will open a menu from the bottom of the screen."
    },
    {
      "title": "Select a media file.",
      "content": "Select a media file. Use the tabs at the bottom of the screen to browse and create media. Camera is the default tab selected at the bottom of the screen. This will allow you to take a new video or photo with your camera. Gallery is the second tab at the bottom of the screen. This will allow you to select an existing photo or video file from your gallery. Other is the third tab at the bottom of the screen. This will allow you to access other options like Video, Audio, Voice Recorder, Notes, Calendar, Location, or Contacts."
    },
    {
      "title": "Type a message (optional).",
      "content": "Type a message (optional). If you wish, you can type a message to include where it says \"Enter message\"."
    },
    {
      "title": "Tap Send.",
      "content": "Tap Send . It's the orange button next to the text box. This will send the MMS message."
    },
    {
      "title": "Open the Messages app.",
      "content": "Open the Messages app. It's the app that has an image of a speech bubble. The image may look different depending on what theme you are using on your Samsung Galaxy."
    },
    {
      "title": "Tap the Compose icon.",
      "content": "Tap the Compose icon. It's the orange icon with an image that resembles a pencil-and-paper in the lower-right corner."
    },
    {
      "title": "Select multiple contacts.",
      "content": "Select multiple contacts. When you tap a contact, you will see an orange checkmark icon next to their name. When you tap a contact that has multiple phone numbers or emails, you will be asked which number you want to send your message to. Select the proper mobile number and tap \"Select\". You can also tap the \"Groups\" tab at the top of the screen and select a group if you have saved groups in your phone's contacts."
    },
    {
      "title": "Tap Compose.",
      "content": "Tap Compose . It's in the upper-right corner of the Message app."
    },
    {
      "title": "Type a message.",
      "content": "Type a message. Tap the bar that says \"Enter message\" and type a message for your group conversation."
    },
    {
      "title": "Tap Send.",
      "content": "Tap Send . It's the orange button next to the message bar. This will send the message to the group."
    },
    {
      "title": "Open the Messages app.",
      "content": "Open the Messages app. It's the app that has an image of a speech bubble. The image may look different depending on what theme you are using on your Samsung Galaxy."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . It's in the upper-right corner of the app."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's the second to the last option from the \"⋮\" menu."
    },
    {
      "title": "Tap More Settings.",
      "content": "Tap More Settings . It's the second to the last option in the Messages Settings menu."
    },
    {
      "title": "Tap Multimedia messages.",
      "content": "Tap Multimedia messages . It's the second option in the \"More Settings\" menu."
    },
    {
      "title": "Customize the MMS settings.",
      "content": "Customize the MMS settings. You can enable or disable the following settings: Group Conversation: When enabled, a single message is sent to multiple recipients. When disabled, the message is sent as an SMS text to each recipient in individual conversations. Delivery reports: When enabled, you will be notified when an MMS is successfully delivered to the recipient's phone. They must have this option enabled as well. Read reports: When enabled, you will be notified when the recipient reads the message. They must have this option enabled as well on their phone. Auto retrieve: When enabled, MMS attachments will be downloaded automatically. When disabled, you'll have to first tap the message to download it. Roaming auto-retrieve: When enabled, this automatically downloads the MMS attachments when your phone is roaming. Disable this feature to block MMS auto-retrieve when your Samsung Galaxy is not on its home mobile network."
    },
    {
      "title": "Change the MMS restrictions.",
      "content": "Change the MMS restrictions. Tap Set restrictions to change the way texts are converted from SMS to MMS messages: Restricted : Prevents you from including content in multimedia messages that may not be supported by the network or the receiving device. Warning : Warns when content is included in MMS message that may not be supported. Free : No restrictions on content that can be included in MMS attachments."
    }
  ]
}