{
  "url": "https://www.wikihow.com/Relieve-Gas",
  "title": "How to Relieve Gas",
  "steps": [
    {
      "title": "Let it out.",
      "content": "Let it out. If you're experiencing extreme gas pain, trying to hold the gas inside your body for the sake of social decorum is only going to make the pain worse. Remember that the average person passes gas 10 times per day, and there's nothing abnormal about needing to do so, even if the timing seems inconvenient. It might help to find a restroom and stay there until the bout of gas pain has subsided. If possible, stay at home and allow yourself to completely recover before going about your day. When you're in a comfortable place, relax your muscles and change your positioning so the gas can exit your body more easily."
    },
    {
      "title": "Apply some heat.",
      "content": "Apply some heat. Gas leads to uncomfortable tightness in the abdominal region, and this pain can be eased by treating it with heat. Fill a hot water bottle, lie down on your bed or on the couch, and place the bottle over your stomach. The heat will help relieve the tightness. A hot bath also helps ease the pain of gas and constipation."
    },
    {
      "title": "Drink mint, chamomile, or ginger tea.",
      "content": "Drink mint , chamomile , or ginger tea. Mint, chamomile, and ginger have properties that settle the stomach and aid the digestion process. [1] X Expert Source Muhammad Khan, MD, MPH Board-Certified Gastroenterologist Expert Interview. 24 August 2021. Boil a few leaves of mint, some fresh or dried chamomile flowers, or some chopped ginger, strain the hot tea into a mug, and sip it slowly."
    },
    {
      "title": "Eat garlic soup.",
      "content": "Eat garlic soup. Garlic stimulates the gastric system and helps relieve gas quickly. [2] X Research source Chop some cloves of fresh garlic and sauté them in a little olive oil. Add chicken or vegetable broth, bring to a boil, then reduce to a simmer. Eat the soup hot. For other ideas on relieving gas, see what other wikiHow readers have tried on the wikiHow forum post, \"I'm so gassy. What are some home remedies to get rid of gas fast?\""
    },
    {
      "title": "Take activated charcoal tablets.",
      "content": "Take activated charcoal tablets. Activated charcoal can ease your symptoms by absorbing excess gas in your digestive system. For best results, take the tablets between meals. Wait a few hours after taking any other medications or supplements, since the charcoal may make it harder for your body to absorb them. Consult your doctor before taking activated charcoal if you are using other medications or supplements."
    },
    {
      "title": "Try Beano (alpha-galactosidase).",
      "content": "Try Beano (alpha-galactosidase). This dietary supplement can help your body digest carbohydrates more efficiently, reducing symptoms of gas and flatulence. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Beano and other supplements containing alpha-galactosidase are available in many pharmacies and health food stores. Beano can also help prevent the development of excess gas when taken with meals."
    },
    {
      "title": "Use over-the-counter gas relief medicine.",
      "content": "Use over-the-counter gas relief medicine. Drugstores offer a lot of options for indigestion medication. Since you're already experiencing gas pains, choose one that is meant to be taken after eating, not before. [4] X Research source"
    },
    {
      "title": "Try eliminating common allergens from your diet.",
      "content": "Try eliminating common allergens from your diet. Many common food allergies or sensitivities can cause gas. Cut some of the most common food allergy triggers from your diet for 3 to 6 weeks and see if your symptoms improve. Then, reincorporate the foods one by one and see if your symptoms return. Common problem foods include: Foods containing gluten, such as wheat, barley, and rye products. Dairy products. Corn. Soy. Sugar. Alcohol. Refined carbohydrates. High FODMAP foods (foods containing certain types of sugars). For more information about foods that are high or low in FODMAPS, take a look at this information sheet: https://patienteducation.osumc.edu/documents/lowfodmapdiet.pdf"
    },
    {
      "title": "Avoid foods that irritate your digestive system.",
      "content": "Avoid foods that irritate your digestive system. There are certain foods that are known to cause gas, and some people are more sensitive to them than others. If you experience gas problems regularly, consider avoiding or limiting these foods: [5] X Research source Legumes. Beans are difficult to digest because they contain a sugar called oligosaccharide that the body cannot break down because it doesn't produce the right enzyme to do so. The oligosaccharide molecules remain whole through most of the digestion process and produce gas in the small intestine. Foods high in fiber. Fiber has many health benefits, but eating a large amount of grains and fibrous fruits and vegetables can lead to gas. Don't stop eating these beneficial foods altogether, but you might want to avoid the ones that seem to give you the worst gas. [6] X Expert Source Muhammad Khan, MD, MPH Board-Certified Gastroenterologist Expert Interview. 24 August 2021. Dairy products containing lactose. Many people are slightly lactose intolerant; that glass of milk you have in the morning might be contributing to gas. Soda and other carbonated or fizzy beverages. Fried foods and other fatty foods. Artificial additives. Sweeteners like sorbitol and mannitol lead to gas and diarrhea. Chewing gum. [7] X Expert Source Muhammad Khan, MD, MPH Board-Certified Gastroenterologist Expert Interview. 24 August 2021. Alcohol. Vinegar. Caffeinated beverages. Spicy foods. Greasy, processed, and refined foods."
    },
    {
      "title": "Consider other indigestibles that might be causing gas.",
      "content": "Consider other indigestibles that might be causing gas. Taking fiber supplements, laxatives, or antibiotics can cause gas. These irritate the bowels and remove the bacteria needed for properly digesting food."
    },
    {
      "title": "Chew your food well.",
      "content": "Chew your food well. Taking the time to chew each piece helps to break down the food before it enters your stomach and intestines, creating less work for your digestive system. Chewing with your mouth closed can also help, since swallowing a lot of air can lead to gas."
    },
    {
      "title": "Eat protein first.",
      "content": "Eat protein first. Changing the order in which you eat food can prevent the production of gas. Eating protein with or before fiber and carbohydrates allows your digestive system to work properly. When you begin eating a meal, your stomach produces hydrochloric acid in anticipation of digesting protein. If salad or bread hits your stomach first, the acid gets used up before you ingest meat, fish, or another protein. The protein then ferments, leading to gas and bloating. Health food stores sell hydrochloric acid supplements that you can take to help you digest protein. These should be taken after the meal, so your stomach has the chance to produce as much acid as it can first."
    },
    {
      "title": "Eat fermented food.",
      "content": "Eat fermented food. In order to properly digest your food, your digestive tract needs a good supply of healthy bacteria. Fermented foods supply your body with the type of bacteria it needs to break other foods down. Try yogurt, kefir, and other cultured dairy foods. Make sure the label says that the product contains probiotics. Kimchi, sauerkraut, and other fermented vegetables also have good probiotic properties."
    },
    {
      "title": "Use probiotic supplements.",
      "content": "Use probiotic supplements. Probiotics may help promote the growth of beneficial bacteria in your gut, while minimizing the presence of harmful bacteria. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Having healthy gut flora can reduce symptoms of gas. Talk to your doctor before starting probiotic supplements, and ask them which type of supplement may be most beneficial to you. Always purchase supplements that have been certified by 3rd party verifiers, such as USP, NSF, or Consumer Lab."
    },
    {
      "title": "Consider your symptoms.",
      "content": "Consider your symptoms. If you have gas every day, or if your gas pains are accompanied by nausea, vomiting, dizziness, headaches, or other severe symptoms, you might have a chronic issue beyond what can be treated by dietary changes or supplements. Irritable bowel syndrome is a fairly common malady that causes chronic pain when certain foods are consumed. Crohn's disease and celiac disease are gastrointestinal disorders that are irritated by the consumption of certain foods. [9] X Research source"
    },
    {
      "title": "See your doctor.",
      "content": "See your doctor. If you feel it's a possibility that your symptoms go beyond the normal issues caused by eating beans and fiber, make an appointment with your doctor to get to the bottom of the problem. To prepare for your visit: Keep a journal of your meals. Record every component of the meals you eat for the few weeks before your visit. Make a note of in what order you consume your food. Be prepared to undergo some tests and answer questions from the doctor about your dietary and lifestyle habits. [10] X Research source"
    }
  ]
}