{
  "url": "https://www.wikihow.com/Slide-Into-Someone%27s-DMs",
  "title": "How to Slide Into Someone’s DMs: Expert Tips & Examples",
  "steps": [
    {
      "title": "Follow them before sliding into their DMs.",
      "content": "Follow them before sliding into their DMs. You’re more likely to get a response if you click the “follow” button . Better yet, try following them a few days (or even a few weeks) before you slide into their DMs. That way, you don’t seem like your only motivation was to ask them out. Plus, you might even get a follow back! [1] X Research source If you follow each other already, that’s a great sign. They’ll probably be much more open to responding to your messages."
    },
    {
      "title": "Reply to their story for an easy way to start a conversation.",
      "content": "Reply to their story for an easy way to start a conversation. If they post something on their story on Instagram, Twitter, or Facebook, reply and tell them how cool it is or how good of a picture that is. If you really want a reply, try asking a relevant question so they answer it. Don’t just say “hey” or use the story reactions or emojis, as that probably won’t get a response. [2] X Research source Example: If they post a pic of their lunch, you could say, “Yum! Where’d you get that?” Example: If they post a picture at the beach, you might ask, “Looks beautiful! Which beach is that?” Example: If they post a song they’re listening to, you could say, “I love this song. Have you heard their most recent album?” Reader Poll: We asked 319 wikiHow readers what the most effective way to slide into someone’s DMs is, and 56% of them agreed that the best way is by responding to their story with an emoji or quick reaction. [Take Poll]"
    },
    {
      "title": "Give them a compliment.",
      "content": "Give them a compliment. Most people love hearing nice things about themselves. Keep your comment civil, and don’t pick out one of their physical features (as that can be a little bit weird and off-putting). Instead, compliment their latest post, their sense of humor, or even their personality. After they say “thank you,” you can continue having a fun conversation with them. [3] X Research source Example: “LOL you’re so funny, your posts always make me laugh.” Example: “It’s awesome how much you volunteer! Everyone should give back to the community like you do.” Avoid overdoing the compliments. While you may think they’re gorgeous or amazing, saying that to them before you’ve built that rapport can overwhelm them. [4] X Research source"
    },
    {
      "title": "Ask a question about one of their recent posts.",
      "content": "Ask a question about one of their recent posts. This is a nice, friendly way to bring up something you like without overstepping your bounds. If they posted a cool photo or a funny Tweet, let them know! Or, ask them a question about the latest post they just shared. It doesn’t have to be the deepest question ever, just ask something to break the ice. [5] X Research source Example: “Those shoes you just posted are so pretty! Where’d you get them?” Example: “Just saw your post about the basketball game!! I can’t believe our team lost again.” Example: “You’re in New York right now, too? I’m here until Saturday!” When starting a conversation on dating apps, dating expert Kristina Mirgorodskaya says to mention attractive things, like dogs, cats, or traveling. Or start a conversation about the weather or recent events. [6] X Expert Source Kristina Mirgorodskaya Dating Expert Expert Interview. 31 May 2022."
    },
    {
      "title": "Mention mutual friends to start a natural convo.",
      "content": "Mention mutual friends to start a natural convo. Check their following list to see who they know that you also have a connection with. In your message, tell them who you know and ask how they know them. According to dating coach Mark Rosenfeld it’s a great way to show them that you’re a real person, not just some online persona. [7] X Expert Source Mark Rosenfeld Dating & Relationship Coach Expert Interview. 11 June 2021. Example: “Oh, you follow Vicky? I’ve known her since we were like 5 lol.” Example: “Whoa, small world! How do you know Jeremy?” Rosenfeld says that great opening messages are about relating, so mentioning mutual friends is a great way to break the ice. [8] X Expert Source Mark Rosenfeld Dating & Relationship Coach Expert Interview. 11 June 2021."
    },
    {
      "title": "Try a cheesy pickup line if you think they'd appreciate a little goofiness.",
      "content": "Try a cheesy pickup line if you think they'd appreciate a little goofiness. Use a cheesy, innocent pickup line that doesn't involve anything sexual (since that could come off a little creepy). A pickup line makes your intentions clear from the start, and it could get you off on the right foot! Keep in mind, though, that not everyone appreciates a pickup line, even if it is pretty silly. [9] X Research source Example: “Was your father an astronomer? Because I think he stole the stars from the sky and put them in your eyes.” Example: “Do you like raisins? How about a date?” Example: “I was going to offer to draw you, but you’re clearly already a work of art.”"
    },
    {
      "title": "Send a funny meme you know they’d like.",
      "content": "Send a funny meme you know they’d like. You can take a look at their profile to figure out what they’re interested in, like books, TV shows, or movies. If you’re on Instagram Reels, click the likes button in the upper right hand corner to get a chance at seeing the memes she likes. Then, search the web for a funny meme that might break the ice. You’ll get them laughing and (hopefully) spark a great conversation! [10] X Research source Can’t figure out what to send? Try searching for an ice breaker meme. You can find a silly picture with a cheesy pickup line on it to send to your potential boo. If you can’t find anything good, try searching “meme” on Instagram or Twitter. You should be able to find something totally random that makes you chuckle. Check out your Instagram explore page to find popular meme accounts. If you’re using the Reels method, you must be following them first."
    },
    {
      "title": "Give them time to respond before sending another message.",
      "content": "Give them time to respond before sending another message. Multiple DMs in a row can be a little overbearing. If you shoot your shot and don’t get a reply, chalk it up to bad luck and try again with someone else. Remember that there are plenty of fish in the sea, and social media has tons of users! (Plus, some people get so many DMs that they can’t even read them all, so don’t sweat it). [11] X Research source Dating coach Imad Jbara says that if someone doesn’t respond to you, move on. [12] X Expert Source Imad Jbara Dating Coach Expert Interview. 22 September 2021. If you two have a nice conversation but they never hit you up again, that’s also a clue that they might not be interested. That’s totally fine! There are other fish in the sea."
    },
    {
      "title": "Once you get a reply back, break the ice and make small talk.",
      "content": "Once you get a reply back, break the ice and make small talk. Ask them how they’re doing, what they’re up to, or something about their interests. The more you can develop a rapport with them, the more likely it is that you two will actually meet up in real life. Keep them talking by asking them questions and sharing a little bit about yourself, too. Try to keep the conversation light, though. Avoid risky, passionate topics like politics and religion. [13] X Research source Example: “I saw that you like to roller skate. How’s that going? I tried picking it up like a year ago, but I’m just not that good.” Example: “Did you just move to the area? I’ve lived here for a while, so I could totally show you around sometime.” Dating coach John Keegan says to make small talk and like a person’s pictures when you’re trying to slide into their DMs. Be bold and direct by telling them you think they’re attractive or cute. [14] X Expert Source John Keegan Dating Coach Expert Interview. 19 August 2021. Dating coach Kristina Mirgorodskaya says to keep texting light and playful to help build chemistry. Although most chemistry is built through in-person interactions, spacing out conversations can help build attraction, rather than constant texting. [15] X Expert Source Kristina Mirgorodskaya Dating Expert Expert Interview. 31 May 2022."
    },
    {
      "title": "Branch out and ask more personal questions about their life.",
      "content": "Branch out and ask more personal questions about their life. When it comes to keeping conversations going , dating coach Joshua Pompey says to avoid tons of small talk and everyday questions. Instead, talk about what’s going on in your life. Start with a funny story or anecdote, then let things develop naturally. Just remember to make space for the other person too! Instead of talking all about you, ask them questions to keep them involved in the conversation. [16] X Expert Source Joshua Pompey Relationship Expert Expert Interview. 27 November 2019. Example: Start the text with “Wow, you won’t believe what my coworker just did” to pique their curiosity and keep them interested. Example: Start a text with “Have you seen this new Netflix documentary? I’m watching it right now and it’s so crazy…” to put them onto a new show and have something exciting to talk about."
    },
    {
      "title": "Give them your number to take the convo to text or a phone call.",
      "content": "Give them your number to take the convo to text or a phone call. Jbara says after a fun, flirtatious conversation, ask for her number or give her yours. [17] X Expert Source Imad Jbara Dating Coach Expert Interview. 22 September 2021. Most people want to chat on the phone before meeting up. If that’s your goal, give them your digits so you two can text more before hanging out. Work the ask into the conversation so it doesn’t feel out of the blue, but keep it quick. Example: “I really liked talking to you. Here’s my number if you wanna chat again.” Example: “You’re really funny, and you seem super cool. I’d love to talk more; here’s my number.” According to Mirgorodskaya, longer drawn-out conversations lose momentum. [18] X Expert Source Kristina Mirgorodskaya Dating Expert Expert Interview. 31 May 2022. So, once the opportunity presents itself, ask for their number and continue building that connection over text."
    },
    {
      "title": "Move on if they stop messaging you back.",
      "content": "Move on if they stop messaging you back. The worst thing when sliding into DMs is to ignore the other person’s boundaries and constantly message them even when they don’t respond. When you don’t get a response, put it behind you and move on to the next person. If you continue to message the person even when they’ve expressed that they’re not interested, it can be considered harassment. [19] X Research source Harassing texts may result in the person taking legal action against you. [20] X Research source"
    },
    {
      "title": "Put your best foot forward and make the first move.",
      "content": "Put your best foot forward and make the first move. Even if you’re nervous, reach out anyway. When you’re sliding into DMs, it’s easy to get scared and feel like they’re going to brutally reject you. However, chances are they’re just as nervous as you. Imagine getting a message from a random person that you’ve barely talked to before. It may catch you off guard, but it’s not the end of the world. By ignoring your fear of rejection, you open the door for a new friendship or relationship. To boost your confidence before a big moment, like sliding into DMs, life coach Leah Morris suggests practicing affirmations . Look in the mirror and say “you got this” or “you’re gonna nail this.\" [21] X Expert Source Leah Morris Life Coach Expert Interview. 19 June 2020. Keegan says that if you don’t take risks and initiate things when making the first move, it may not work out. [22] X Expert Source John Keegan Dating Coach Expert Interview. 11 March 2021. If you don’t make that first move , the regret may be worse than the fear of actually doing it!"
    },
    {
      "title": "Make sure your profile is a reflection of you.",
      "content": "Make sure your profile is a reflection of you. When someone gets a message from you, they’ll likely check out your profile to see what you look like, what you’re into, and get a feel for the type of person you are. If you don’t have any photos of yourself on your profile, they may not be as inclined to respond, as they don’t really know who you are. Before you get ready to slide into those DMs, take your profile into consideration and make sure it looks good first. [23] X Research source Post a few selfies, travel pictures, or photos with friends to show off your personal life. Make a few story highlights with pictures of your favorite memories."
    },
    {
      "title": "Pick a good-looking profile picture.",
      "content": "Pick a good-looking profile picture. Your profile picture is usually the first thing someone sees when they visit your profile, so make sure you look good! Take a clear photo that is expressive, well-lit, and high-quality, and make it your profile picture. A good profile picture is like a good handshake, it can make or break the first impression. [24] X Research source If you don’t feel comfortable showing yourself in your profile picture, make sure there’s at least one photo of you on your profile so the person knows what you look like."
    },
    {
      "title": "Craft a bio that tells your followers about yourself.",
      "content": "Craft a bio that tells your followers about yourself. When you slide into someone’s DMs, they’ll likely want to learn a bit about you before they choose to respond. Let them and the rest of your followers know what you value or what you’re interested in by including those things in your bio . You don’t have to write a super thorough description, but something that gives insight into your personality and what you like can tip the scales into your favor when you’re sliding into DMs. [25] X Research source Example: If you’re enrolled in college or high school, put your school name and graduation year in the bio to let any followers who also attend your school know that you go there. Example: If you’re in a certain industry, include that in your bio to let people know what you do for work. Example: If you like to bake, put something like “Constantly baking” or “Catch me in the kitchen” to let your followers know!"
    },
    {
      "title": "Yes, it’s perfectly okay and most people don’t mind it at all.",
      "content": "Yes, it’s perfectly okay and most people don’t mind it at all. Sliding into DMs is only weird if you make it weird. Nowadays, most people socialize in the digital space, so sliding into DMs is considered normal behavior. But, it depends on how you slide into the DMs. If you casually start a conversation with politeness, it’s fine. But, if you slide into the DMs with overbearing compliments talking about how much you want to take someone out, it’ll likely be considered weird and won’t evoke a response. [26] X Research source When sliding into DMs, use context clues, be polite, and don’t take it personally if you get a “no thanks” or get left on read."
    }
  ]
}