{
  "url": "https://www.wikihow.com/Paint-an-Outdoor-Concrete-Patio",
  "title": "How to Paint an Outdoor Concrete Patio",
  "steps": [
    {
      "title": "Clear the surface.",
      "content": "Clear the surface. Remove all furniture, decorations, plants, pots, toys, and any other items you have on your patio. You need a clear surface to work with to ensure your patio is cleaned properly and painted evenly. Cover plants and landscaping near the patio with tarps to protect them from cleaning solutions and water run-off."
    },
    {
      "title": "Repair cracks in the concrete.",
      "content": "Repair cracks in the concrete. Clean out the crack(s) with a wire brush. Vacuum or blow out any dust and dirt, or use a broom to make sure the crack is clean. Fill the crack with masonry crack filler. Depending on the brand, either apply the filler with a scraper, or a caulking gun (if necessary). To fill deeper or wider cracks, fill them by a quarter-inch (six mm) at a time. Allow the product to dry between applications according to label instructions. [1] X Research source For best results, repair cracks in completely dry concrete. If the concrete is slightly damp, dry with a blow dryer or heat gun, then wait fifteen minutes. If more water has seeped into the crack, protect the concrete from water until it dries on its own. Sand down grout- or concrete-based fillers with fine sandpaper, then clean the area a second time. (Do not sand self-leveling or latex-based sealants)."
    },
    {
      "title": "Remove moss, roots, and vines.",
      "content": "Remove moss, roots, and vines. Pull out anything that has grown on the surface of the concrete, and spray the patio down with a pressure washer if you have one. [2] X Research source If you don’t have a pressure washer, remove what you can by hand, sweep the patio, and hose it down to remove any excess clumps, dirt, or debris. Borrow a power washer from a neighbor or rent one from a tool rental company or home and building store if you don’t have one of your own. A pressure washer will be very useful for cleaning and rinsing your concrete patio prior to painting. To clear a large amount of vegetation, spray a broad-spectrum herbicide such as glyphosate (Roundup) at least two weeks before cleaning."
    },
    {
      "title": "Clean the concrete surface.",
      "content": "Clean the concrete surface. Concrete can absorb and trap dirt and grease. To ensure it is completely clean and has a fresh surface for paint to adhere to, scrub the concrete with a product that will draw substances out, such as trisodium phosphate, [3] X Research source muriatic acid, [4] X Research source or phosphoric acid. [5] X Research source These products will also help remove old paint, which needs to come off before repainting.These products are not designed to remove old paint. Read all safety information before you begin. Many concrete cleaning products require everyone in the area to wear rubber gloves, eyewear, masks, rubber boots, and protective clothing. Rinse the concrete so the surface is wet. Apply your cleaning solution (acid, trisodium phosphate, or other cleaner) as per the manufacturer’s instructions. Scrub the concrete with a stiff brush. If you use muriatic or phosphoric acid, this process is called etching, and will ensure the concrete has a sandpaper-like texture that paint will stick to better. Etching should be done before painting new or bare concrete."
    },
    {
      "title": "Flush the surface.",
      "content": "Flush the surface. It is best to use a power washer, as this will wash away excess debris, old paint, and efflorescence, a whitish salt deposit that forms on surfaces like concrete and stucco. If there is still any old paint left on the concrete, scrub it with a wire brush and continue power washing until it’s gone. If you used an acid solution to etch the concrete, neutralize the pH on the surface by sprinkling baking soda over top before rinsing. [6] X Research source Especially after etching, be sure to rinse the concrete with water until no chalky powder comes off the surface when you touch it with your fingers."
    },
    {
      "title": "Test the concrete for moisture content.",
      "content": "Test the concrete for moisture content. Before painting your patio, make sure that paint will adhere in the first place. All concrete is porous and absorbs moisture, but if your concrete patio contains too much moisture, you won’t be able to paint it until you correct the moisture content. [7] X Research source Take an 18-inch by 18-inch square of aluminum foil or thick plastic and tape down all four sides, sealing the square to the concrete with tape. Wait 16 to 24 hours. After that time, carefully remove the square of foil or plastic and check the concrete and the underside of the square for condensation or moisture. If the concrete is still damp, wait until weather allows complete drying. Protect the area from sprinklers and garden runoff. Proceed once the concrete is completely dry."
    },
    {
      "title": "Select your paint.",
      "content": "Select your paint. Since you are painting concrete in an outdoor area, not just any paint will suffice. Regular exterior paint will likely crack on a concrete surface and peel off shortly after being applied. [8] X Research source There are several types of paint that will work for your outdoor concrete patio, and they include: Concrete paints that contain sealants or waterproofing features, so the paint is designed to resist water, salt, oil, and grease. This is a good choice for paint because it's specifically designed for outdoor concrete and resistance to various substances and elements. Latex, water-based, or oil-based exterior paints that are designed for floor, patios, or porches. [9] X Research source These paints are also a good choice, as they are designed for exterior use and are specific to withstand foot traffic. Masonry paints that contain added binders and epoxies. While it may bond well with the concrete, it won't necessarily protect your concrete from the elements. Garage floor coatings with colorful additives to protect and decorate at the same time."
    },
    {
      "title": "Choose a color.",
      "content": "Choose a color. To help you decide what color to paint your patio, consider what color the exterior of your house is, and what color your patio furniture is. Take color swatches with you to the paint store so you can compare your existing decor with your paint choices. Don't be afraid to ask the paint specialist for help and advice!"
    },
    {
      "title": "Consider using a primer.",
      "content": "Consider using a primer. A concrete or block primer will give you a nice, even surface to work with, instead of the uneven, porous surface of non-primed concrete. It will also reduce the number of coats required to properly cover your surface. Choose an exterior-grade primer if you’re going to use one, and make sure it’s designed for concrete. Concrete primers are often called concrete, masonry, or bonding primers. Primer has a lower viscosity than paint, so it absorbs into the concrete substrate a lot better. Once it's absorbed in, it creates a binder that the paint will stick to. If you don't use a primer and there's any moisture under your patio, the paint will peel right off. [10] X Expert Source Scott Johnson Landscape & Design Consultant Expert Interview. 22 April 2020."
    },
    {
      "title": "Determine how much paint you need.",
      "content": "Determine how much paint you need. Once you’ve decided what kind of paint you’re going to use, you will need to do some basic calculations to determine how many cans of paint you’ll need to cover the patio surface. Check the paint can or manufacturer's website regarding how much coverage one can provides, and compare that with the square footage of your patio. Square footage is determined by multiplying the length by the width of the area you are dealing with. Don't worry if your patio isn't perfectly square or rectangular: you just need a basic idea of the area you're going to cover. Don't forget to take into account whether you plan on applying multiple coats. A primer will reduce the likelihood of having to apply more than one or two coats of paint."
    },
    {
      "title": "Assemble your tools and equipment.",
      "content": "Assemble your tools and equipment. Before getting started, get together all the tools you’re going to need for painting. The best painting tools for this will be a masonry brush, a high-capacity roller, or a texture roller. [11] X Research source The equipment you’ll need may include: Primer (optional) and paint A paint roller frame and cover A paint tray Roller and brush extenders Masking or painter’s tape Thick and thin brushes Plastic or painter's tarps"
    },
    {
      "title": "Protect your surfaces.",
      "content": "Protect your surfaces. Use tape to line the surfaces touching your concrete patio, such as deck edges, exterior walls, doors or windows, and other areas that you don’t want to accidentally paint. Cover the ground nearby with tarps if necessary."
    },
    {
      "title": "Choose the right day.",
      "content": "Choose the right day. Ideally, begin painting on a dry day when there has been no rain in the previous 24 hours, and none is expected in the long-range forecast. The best temperature for outdoor painting is about 50 F (10 C). [12] X Research source"
    },
    {
      "title": "Apply your primer.",
      "content": "Apply your primer. Make sure your patio is completely dry before beginning to paint or prime. Pour your primer into a paint tray. Take one of your thinner brushes and dip it into the primer a few times. Wipe off the excess on the inside of the paint tray, and make sure the brush has an even coat of paint on it. Start by applying primer with the brush around any edges or places where the patio touches other buildings or parts of the house. Use a roller or thicker brush and extender to apply primer to the rest of the patio. Apply in two different directions for even coverage."
    },
    {
      "title": "Let your primer dry.",
      "content": "Let your primer dry. While it should be dry in about two hours, wait at least eight hours before you begin painting. However, don’t let more than 30 days elapse. [13] X Research source If you are reusing your brushes, rollers, and trays, make sure you clean them well and let them dry before reusing them."
    },
    {
      "title": "Pour your paint into the paint tray.",
      "content": "Pour your paint into the paint tray. The tray will make it easier to coat your brushes or rollers evenly with paint, and this will make it easier for you to apply even coats of paint to your patio."
    },
    {
      "title": "Paint around your patio edges.",
      "content": "Paint around your patio edges. Use a smaller paint brush to apply a coat of paint around any edges, joints, or other areas that are too awkward for the roller or larger brush. Be sure to use the smaller brush to apply paint to any part of the patio adjoining areas where you placed tape, to ensure you don’t get paint on other walls, decks, or windows."
    },
    {
      "title": "Apply your first coat of paint.",
      "content": "Apply your first coat of paint. Choose a starting point, such as an interior corner against the house, and work your way out from there. Don’t paint yourself into a corner or center where you won’t be able to get out again without walking over fresh paint. Use even brush or roller strokes to apply a thin, even layer of paint. Attach your roller or brush to your extender so you can remain standing while painting. This will help prevent injury to your back, knees, and wrists. If you're using a brush instead of a roller, ensure it's big enough to cover a large area so that your paint doesn't dry before you finish a section."
    },
    {
      "title": "Let your first coat dry.",
      "content": "Let your first coat dry. Concrete and exterior paints can take six or more hours to dry before they’re ready for additional coats, so be sure to check the manufacturer’s recommendations."
    },
    {
      "title": "Apply the necessary coats.",
      "content": "Apply the necessary coats. Follow the same steps as before. Use a smaller brush around delicate or awkward edges and a larger brush or roller to complete the coat. Apply a sufficient number of coats to achieve the desired depth of color you want for your patio. Two or three coats are usually required. Apply each new coat in a different direction than the last, to ensure even coverage."
    },
    {
      "title": "Allow the paint to dry and cure.",
      "content": "Allow the paint to dry and cure. While you will likely be able to walk on your patio after 24 hours, you should wait about seven days before replacing furniture."
    }
  ]
}