{
  "url": "https://www.wikihow.com/Open-Kikkoman-Soy-Sauce",
  "title": "Kikkoman Soy Sauce: How to Take Off the Cap & Use It the Right Way",
  "steps": [
    {
      "title": "Remove the outer plastic seal and twist the red cap counterclockwise.",
      "content": "Remove the outer plastic seal and twist the red cap counterclockwise. Hold the Kikkoman soy sauce bottle firmly in one hand and turn the cap with the other. Use a rubber gripper or a damp cloth to get a good grip on the cap if your hand keeps slipping or the cap is stubborn. Try not to squeeze the cap too hard while you twist since the spouts can push into your hand and leave small marks that might hurt a little bit."
    },
    {
      "title": "Run the red cap under hot water for about a minute if it’s stuck.",
      "content": "Run the red cap under hot water for about a minute if it’s stuck. Get your faucet running as hot as it will go and hold the cap under the flow for 1-2 minutes. If the water’s too hot, sit the bottle down in the sink in a spot where the water will hit it consistently. [1] X Research source The water dissolves salt crystals that form around the cap in storage. These crystals make the cap hard to twist open sometimes."
    },
    {
      "title": "Try twisting the cap off counterclockwise again.",
      "content": "Try twisting the cap off counterclockwise again. The bottle might be hot, so use a gripper or damp cloth to hold it while you twist the cap. If the cap stays stuck, tap it against a countertop or the edge of your sink to help dislodge it or run it under hot water again (you may need to do this several times). [2] X Research source"
    },
    {
      "title": "Pop the plastic insert out of the bottle once the cap is off.",
      "content": "Pop the plastic insert out of the bottle once the cap is off. Look inside the rim of the bottle’s opening for a clear plastic stopper. If it’s not there, look inside the red dispenser cap (sometimes it comes out with it). Use your fingers to pop it out of place and discard it. [3] X Research source"
    },
    {
      "title": "Twist the red cap back onto the bottle.",
      "content": "Twist the red cap back onto the bottle. Once the cap is back on, the bottle is ready for use. Pour away! [4] X Research source"
    },
    {
      "title": "Place a finger or thumb over one of the 2 spouts on the dispenser cap.",
      "content": "Place a finger or thumb over one of the 2 spouts on the dispenser cap. First, grab the bottle with your pouring hand and hold it upright. Then, using a finger or thumb in that same hand, press tightly over one of the spouts to form a seal. [5] X Research source While you hold the seal, no soy sauce will be able to flow out of the other spout."
    },
    {
      "title": "Tilt and lower the opposite spout to your food or soy sauce dish.",
      "content": "Tilt and lower the opposite spout to your food or soy sauce dish . Keep your finger or thumb over the other spout while you move the bottle. This will keep the sauce from accidentally dripping or pouring onto your table or food. [6] X Research source"
    },
    {
      "title": "Release your finger to let the soy sauce flow from the dispenser.",
      "content": "Release your finger to let the soy sauce flow from the dispenser. When the pouring spout is in position, take your finger off the spout to release the seal. Keep an eye on the sauce while you pour—soy sauce is fast-flowing and has a tendency to splash and stain! [7] X Research source Leave the second spout uncovered if you’re pouring a lot of sauce into a recipe. The more air that flows through the cap, the faster the sauce pours. [8] X Research source"
    },
    {
      "title": "Pour your finger back over the spout to stop the flow.",
      "content": "Pour your finger back over the spout to stop the flow. When you’ve got enough sauce, press firmly to reseal the spout. Once the sauce stops flowing, move the pouring spout to a new spot on your plate to add more sauce or return the bottle to an upright position on the table. [9] X Research source Use your finger to control how you use your soy sauce . Raise and lower it quickly for small spurts over rice or sushi, or keep it up for a longer pour."
    }
  ]
}