{
  "url": "https://www.wikihow.com/Repair-Google-Chrome",
  "title": "How to Repair Google Chrome: Easy Troubleshooting Guide",
  "steps": [
    {
      "title": "Close tabs other than the one giving you problems.",
      "content": "Close tabs other than the one giving you problems. If a certain tab is not responding or frozen, you might be able to make it respond by closing other open tabs—especially if you have many open tabs. Try closing every tab except the frozen one to see if it unfreezes."
    },
    {
      "title": "Close other open programs.",
      "content": "Close other open programs. Chrome will sometimes fail to load websites or freeze if too many applications are running on your computer. Try closing any programs you're not using, including background programs, to see if Chrome starts working again."
    },
    {
      "title": "Force-close and reopen Chrome.",
      "content": "Force-close and reopen Chrome. If Chrome is crashing, freezing, unresponsive, or slowing down, sometimes all you'll need to do is close and reopen the browser. If the browser won't close or reopen, you might have to end the processes manually before restarting. Here's how: Windows: Press Ctrl + Shift + Esc at the same time to open Task Manager . Find any apps or processes called \"Google Chrome.\" Select any running processes and click End Task . Mac: With Chrome open, press Option + Command + Esc to force-quit. [1] X Research source Select Google Chrome and click the Force Quit button. Open Activity Monitor . Select any Google Chrome processes that are still running. Click the Stop button ( x ) and select Force Quit . [2] X Research source"
    },
    {
      "title": "Turn off hardware acceleration.",
      "content": "Turn off hardware acceleration. Sometimes the hardware acceleration feature in Chrome can cause problems, including crashes. Fortunately, it's easy to turn this feature off: Click the three-dot menu and select Settings . Click System in the left panel. Turn off \"Use hardware acceleration\" and restart Chrome."
    },
    {
      "title": "Restart your computer.",
      "content": "Restart your computer. Especially if you haven't powered down your computer in a few days, restarting your computer will help Chrome run faster with fewer crashes."
    },
    {
      "title": "Check your internet connection.",
      "content": "Check your internet connection . If your connection is slow, your network is busy, or there's a problem with your router, you'll notice slow load times and error pages. You can generally solve Wi-Fi problems by moving closer to the router and closing background apps that take up large amounts of bandwidth (e.g., Netflix)."
    },
    {
      "title": "Run a malware check on your computer.",
      "content": "Run a malware check on your computer. If Chrome is loading weird pages or your home page recently changed without your input, you may have a virus on your computer. Running a virus check should eliminate the virus. Thompson-Brown explains that while malware tends to hide itself really well, you may be able to identify it by opening your task manager to see what is running. If you're not comfortable scanning for malware yourself, or you can't remove malware identified by your antivirus software, Thompson-Brown recommends contacting a professional."
    },
    {
      "title": "Click the three-dot menu in Chrome ⋮.",
      "content": "Click the three-dot menu in Chrome ⋮ . If you are having trouble with a particular tab or extension, you can use the Chrome task manager, a built-in Chrome repair utility, to end its process."
    },
    {
      "title": "Select More tools.",
      "content": "Select More tools . This option is near the bottom of the drop-down menu."
    },
    {
      "title": "Click Task manager.",
      "content": "Click Task manager . You'll see a Task Manager window open."
    },
    {
      "title": "Close any problematic tabs or extensions.",
      "content": "Close any problematic tabs or extensions. To close a tab or extension, click a running process, then click the End process button. Tabs are prefaced with \"Tab,\" and Extensions are prefaced with \"Extension.\" In most cases, you won't want to close any other processes. You can sort the list of open tabs and running processes in order based on how taxing they are on your system. To sort by RAM usage, click the Memory footprint column heading. To sort by processor power, click the CPU column heading."
    },
    {
      "title": "Click the three-dot menu ⋮.",
      "content": "Click the three-dot menu ⋮ . It's in the top-right corner of the Chrome window. A drop-down menu will appear."
    },
    {
      "title": "Select the Help menu.",
      "content": "Select the Help menu. You'll find this option near the bottom of the drop-down menu. A pop-out menu will appear next to the drop-down menu."
    },
    {
      "title": "Click About Google Chrome.",
      "content": "Click About Google Chrome . This opens Chrome's \"About\" page, which will automatically check for and install any available updates. If an update requires a restart, you will be prompted to restart Chrome once it is finished."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . This menu is in the top-right corner of Chrome. A drop-down menu will appear."
    },
    {
      "title": "Select Extensions.",
      "content": "Select Extensions . Another menu will expand."
    },
    {
      "title": "Click Manage Extensions.",
      "content": "Click Manage Extensions . This opens a page that contains all of your extensions."
    },
    {
      "title": "Find an extension to disable.",
      "content": "Find an extension to disable. Usually, sudden Chrome issues stem from recently installed extensions, so look for an extension that you installed within the last few days. Chrome can also become unstable if you install too many extensions at once, so consider disabling nonessential extensions as well."
    },
    {
      "title": "Toggle the extension's switch to the Off position.",
      "content": "Toggle the extension's switch to the Off position. This will prevent the extension from running. You'll need to repeat this process for each extension you want to uninstall. You can also delete the extension by clicking Remove beneath it."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . It's in the top-right corner of the Chrome window. Clicking it prompts a drop-down menu."
    },
    {
      "title": "Click Delete browsing data.",
      "content": "Click Delete browsing data . You'll see this on the menu. A window with several options will appear."
    },
    {
      "title": "Click the Basic tab.",
      "content": "Click the Basic tab. If it doesn't open by default, select it now."
    },
    {
      "title": "Choose which data to delete.",
      "content": "Choose which data to delete. To repair problems in Chrome, it's best to leave all three options (\"Browsing history,\" \"Cookies and other site data,\" and \"Cached images and files\") checked."
    },
    {
      "title": "Select All time from the \"Time range\" menu.",
      "content": "Select All time from the \"Time range\" menu. This ensures you're deleting all of your cache, history, and cookies, not just those saved recently."
    },
    {
      "title": "Click the Delete data button.",
      "content": "Click the Delete data button. This clears your cache, cookies, and browsing history in Chrome. [3] X Research source"
    },
    {
      "title": "Click the three-dot menu ⋮.",
      "content": "Click the three-dot menu ⋮ . It's in the top-right corner of Chrome. If Chrome still isn't working right, you can use this method to reset Chrome to its default settings."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . Your Chrome settings will open."
    },
    {
      "title": "Click Reset settings.",
      "content": "Click Reset settings . You will see this in the left panel just beneath \"System.\""
    },
    {
      "title": "Click Restore settings to their original defaults.",
      "content": "Click Restore settings to their original defaults . A confirmation window will appear, asking if you want to disable all extensions, reset Chrome settings and shortcuts, and delete cookies and site data. Resetting Chrome will not affect your bookmarks, saved passwords, or browsing history. [4] X Research source"
    },
    {
      "title": "Click Reset settings to confirm.",
      "content": "Click Reset settings to confirm. This restores Chrome to its default settings."
    },
    {
      "title": "Open your Windows Settings.",
      "content": "Open your Windows Settings. Whether you're using Windows 10 or Windows 11, you'll find Settings in the Start menu. You can also access Settings using the keyboard shortcut Windows key + i . If Chrome is still open, close it first. If you've already tried to uninstall Chrome but it won't uninstall, reboot your computer, then try again."
    },
    {
      "title": "Click Apps.",
      "content": "Click Apps . This option is on the Settings page. If you're using Windows 11, you'll see it in the left panel."
    },
    {
      "title": "Click Installed apps (Windows 11) or Apps & features (Windows 10).",
      "content": "Click Installed apps (Windows 11) or Apps & features (Windows 10)."
    },
    {
      "title": "Scroll down select Google Chrome.",
      "content": "Scroll down select Google Chrome . If you're using Windows 10, clicking it will bring up some buttons. On Windows 11, click the three dots next to \"Google Chrome\" to bring up the menu."
    },
    {
      "title": "Click Uninstall.",
      "content": "Click Uninstall . It's below Google Chrome."
    },
    {
      "title": "Click Uninstall when prompted.",
      "content": "Click Uninstall when prompted. Doing so will remove Google Chrome from your computer."
    },
    {
      "title": "Go to https://www.google.com/chrome.",
      "content": "Go to https://www.google.com/chrome . You'll need to do this in a different browser, such as Microsoft Edge or Firefox."
    },
    {
      "title": "Click Download Chrome.",
      "content": "Click Download Chrome . It's the blue button."
    },
    {
      "title": "Click Save or OK to save the file.",
      "content": "Click Save or OK to save the file. This downloads the Chrome installer to your computer."
    },
    {
      "title": "Double-click the Chrome setup file.",
      "content": "Double-click the Chrome setup file. It's called ChromeSetup.exe , and you'll find it in your default download folder."
    },
    {
      "title": "Follow the on-screen instructions to install.",
      "content": "Follow the on-screen instructions to install. You'll typically have to click Yes to allow the installer to run, and then review the terms. Once Chrome is finished installing, it will be added to your app list."
    },
    {
      "title": "Fix uninstall or reinstall problems.",
      "content": "Fix uninstall or reinstall problems. If you can't uninstall Chrome, it may be because Chrome processes are still running in the background. The best way to stop them is to restart your PC, then uninstall again. If that doesn't help, download and install Chrome again—this should make it so you can uninstall it without problems. If uninstalling and reinstalling doesn't repair Chrome, or you still can't reinstall, follow these steps: Make sure Chrome isn't running, including background processes. If you haven't already, uninstall Chrome. Press Windows key + E to open File Explorer. Click your Windows drive, usually (C:), in the left panel. Navigate to the Google folder by opening these folders: Users > (your username) > AppData > Local > Google . Right-click the \"Chrome\" folder and select Delete . Click your C: drive again in the left panel. Go to this location by opening each folder: Program Files (x86) > Google . Right-click the \"Chrome\" folder and select Delete . Reinstall Chrome."
    },
    {
      "title": "Close Chrome.",
      "content": "Close Chrome. If Chrome is still open, control-click the Chrome icon in your dock and select Quit to close it. [5] X Research source"
    },
    {
      "title": "Open Finder.",
      "content": "Open Finder. Click the blue, face-shaped icon in your Mac's Dock."
    },
    {
      "title": "Open the Applications folder.",
      "content": "Open the Applications folder. You'll see it in the left panel."
    },
    {
      "title": "Drag \"Google Chrome\" to the Trash.",
      "content": "Drag \"Google Chrome\" to the Trash. Just click and drag the icon to your Trash to delete the application. Alternatively, you can click Google Chrome once, click the Edit menu, and select Delete . According to Corsaro, uninstalling Chrome may ask you to enter your password. If prompted, enter the password you use to access your Mac."
    },
    {
      "title": "Go to https://www.google.com/chrome.",
      "content": "Go to https://www.google.com/chrome . You'll need to do this in a different browser, such as Safari."
    },
    {
      "title": "Click Download Chrome.",
      "content": "Click Download Chrome . It's the blue button."
    },
    {
      "title": "Click Save or OK to save the file.",
      "content": "Click Save or OK to save the file. This downloads the Chrome installer to your computer."
    },
    {
      "title": "Double-click the Chrome DMG file.",
      "content": "Double-click the Chrome DMG file. It will be in your Mac's default downloads location (e.g., the Downloads folder)."
    },
    {
      "title": "Click and drag the Chrome icon onto the Applications folder icon.",
      "content": "Click and drag the Chrome icon onto the Applications folder icon. This will install Chrome on your Mac. If prompted, you'll have to enter your Mac's password before continuing."
    },
    {
      "title": "Fix Chrome reinstallation problems.",
      "content": "Fix Chrome reinstallation problems. If you're running into Chrome problems after reinstalling, you might need to delete your Chrome installation folder after uninstalling. Uninstall Chrome again, then follow these steps: Open Finder. Click the Go menu and select Go to Folder . Type or paste ~/Library/Application Support/Google/Chrome and click Go . Select all the folders with your mouse, then drag the selected folders to the Trash. Reinstall Chrome."
    },
    {
      "title": "Tap and hold the Chrome icon on your home screen.",
      "content": "Tap and hold the Chrome icon on your home screen. A menu will expand."
    },
    {
      "title": "Tap Remove App at the bottom.",
      "content": "Tap Remove App at the bottom. A confirmation message will appear."
    },
    {
      "title": "Tap Delete App.",
      "content": "Tap Delete App . This will delete Chrome and any saved profile information, such as your bookmarks and history, from your iPhone or iPad. [6] X Research source"
    },
    {
      "title": "Open your iPhone's App Store and tap Search.",
      "content": "Open your iPhone's App Store and tap Search . It's at the bottom-right corner of the App Store."
    },
    {
      "title": "Search for Chrome.",
      "content": "Search for Chrome. Type google chrome into the search bar at the top, then tap Google Chrome in the search results."
    },
    {
      "title": "Tap the Download icon.",
      "content": "Tap the Download icon. Since you've installed Chrome before, you will see a cloud icon with an arrow pointing down. Tapping it will reinstall Chrome on your iPhone or iPad."
    }
  ]
}