{
  "url": "https://www.wikihow.com/Make-a-Viral-Video",
  "title": "How to Make a Viral Video",
  "steps": [
    {
      "title": "Film a prank or practical joke.",
      "content": "Film a prank or practical joke. No matter where you come from, what language you speak, or how you were raised, there's a good chance that you'll chuckle at a video of someone in a scary mask popping out of a trashcan and scaring his friend. Pranks and practical jokes (especially ones that involve physical humor) have a universal quality because almost anyone, anywhere can enjoy them. On top of this, they're very easy to shoot — a simple cell phone camera will usually do the job. Examples: \"Extremely Scary Ghost Elevator Prank in Brazil,\" \"Drive Thru Invisible Driver Prank.\" Viral Tip: Use common sense and stay safe when you're shooting your prank. Don't try to shoot anything that could conceivably leave anyone hurt or in jail. See our article on simple pranks for a few ideas to get you started."
    },
    {
      "title": "Record a monologue.",
      "content": "Record a monologue. Simple monologues are some of the easiest viral videos to shoot — all you need is the camera on your computer or laptop and a funny idea to get you started. Most of the most popular viral monologues are funny (sometimes accidentally), so stay away from serious speeches and political diatribes for the best chance of going viral. Examples: \"Leave Britney Alone\" Viral Tip: The biggest difficulty with monologue videos is that there's not much for your audience to look at besides your face and whatever is right behind you. This means you'll have to be creative to keep your viewers' attention — use humor or an emotional performance to separate yourself from the pack."
    },
    {
      "title": "Make a lip-sync video.",
      "content": "Make a lip-sync video. In the age of the viral video, you don't necessarily have to be able to belt like Whitney Houston to become a music sensation. Giving a funny lip sync performance over a catchy song is an easy way to get your video noticed online. If your performance is ridiculously over-the-top, all the better! Examples: \"Numa Numa Song,\" countless Let It Go lip syncs. Viral Tip: Remember that you don't have to lip sync for the entire song — a thirty-second lip sync of the funniest part of the song can be hilarious, but a four-minute video of the entire thing can be a little much."
    },
    {
      "title": "Capture an adorable family moment.",
      "content": "Capture an adorable family moment. Don't be afraid to tug at your audience's heartstrings when you're chasing viral success. Cute or heartwarming videos can be immensely popular, and one of the easiest ways to capture pure, undistilled cuteness is to turn the camera on your family. Record something truly adorable (like, for instance, a relative's enthusiastic welcome home after serving a tour of duty abroad) and you will score big with grandmothers everywhere. Examples: \"Charlie Bit My Finger,\" \"David After Dentist,\" etc. Viral Tip: If you have young children in your family, you may be sitting on a comedy goldmine. Kids often aren't afraid to act silly, stupid, cute, and earnest the way that adults can be, so keep your camera rolling on any young ones."
    },
    {
      "title": "Participate in a popular video meme.",
      "content": "Participate in a popular video meme. Can't think of a good idea for your viral video? Put your own twist on an idea that's already popular! At any given moment, there are usually at least one or two video memes experiencing popularity on sharing sites like YouTube, so hop on board before the trend grows stale — simply add your own unique charm to the existing formula. Examples: Countless \"Harlem Shake\" videos, Downfall spoofs, \"Keyboard Cat\" mashups, and many, many more. Viral Tip: If you want to get popular off of an existing meme, your best bet is to put your video out as soon as possible. The popularity of video memes usually burns bright, but short. For example, the \"Harlem Shake\" video craze of early 2013 peaked in mid-February with millions upon millions of daily views. However, by as early as the start of March, viewership had fallen drastically. [2] X Research source"
    },
    {
      "title": "Show off an amazing talent.",
      "content": "Show off an amazing talent. Can you turn your eyelids inside out? Can you shred like Hendrix on guitar? Everyone's good at something, so take the time to sharpen up with a little practice and show the world what you've got! Musical performances can make for amazing viral videos, but there's no limit here — for instance, videos of incredible sports moves, martial arts skills, Rubik's cube-solving, and much more can all achieve viral success. Examples: \"The Evolution of Dance,\" \"Chocolate Rain,\" etc. Viral Tip: For the best chance at success, try to limit yourself to things that people can't see from anyone else. For example, being able to dunk on a regulation hoop is pretty amazing, but it's something people anyone who watches basketball has seen before. Being able to dunk over a friend's head, on the other hand, is a lot rarer and more impressive."
    },
    {
      "title": "Make a \"Let's Play.\"",
      "content": "Make a \"Let's Play.\" Believe it or not, some of the biggest viral stars in the world are people who simply record themselves playing video games, then share the footage with their live commentary added in. These types of videos, which are called \"Let's Play\" videos, are a form of entertainment that's rapidly grown in popularity in the last few years, so you'll already have a built-in audience if you're able to put out funny, well-made content. Examples: YouTube channels like Markiplier, PewDiePie, etc. Viral Tip: If you gain popularity with a Let's Play channel, convert your viral success into cash! For example, some Let's Play-ers make revenue-sharing deals with advertisers, others get sponsored by established video content providers, and still others use digital payment systems like Patreon to take donations from their viewers. [3] X Research source"
    },
    {
      "title": "Show the world an especially funny or cute animal.",
      "content": "Show the world an especially funny or cute animal. There's no beating a cute animal for working your way into your audience's hearts. Cute animals have an almost universal appeal — there's something about watching a baby puppy take its first steps, for instance, that can warm even the coldest hearts. If you have an adorable pet or you happen to stumble across a heartwarming interaction at the zoo, take your phone out and start recording! Examples: \"Sneezing Panda,\" \"Otters Holding Hands.\" Viral Tip: Recording a funny or cute animal video often requires a little more luck and patience than it would take to capture a young relative doing something funny, for instance. It's difficult to predict exactly how animals will behave, even when they're well-behaved, so be patient and keep your camera running!"
    },
    {
      "title": "Teach your audience how to do something amazing.",
      "content": "Teach your audience how to do something amazing. DIY and \"How-to\" videos are immensely popular online. Though these types of videos may not be as likely to get you the internet super-stardom that funny Let's Plays or meme videos are, they can bring their brand of popularity. For instance, the YouTube channel \"DaveHax,\" which contains short how-to videos for basic crafts, routinely gets hundreds of thousands of views per video (sometimes even several million.) [4] X Research source Examples: \"Life Hack\" videos, \"WonderHowTo\" videos, etc. Viral Tip: For maximum popularity, you'll want to address problems that lots of people have a hard time dealing with. For example, common computer performance issues like slow loading times, bad Wi-Fi connections, and so on are among the very most common customer support issues. [5] X Research source"
    },
    {
      "title": "Dig up something tacky from the past.",
      "content": "Dig up something tacky from the past. It's amazing how quickly pop culture that seems cutting-edge at the time becomes embarrassingly dated. Older music, fashion, TV shows, and so on can be absolutely cringe-inducing with a decade or two of hindsight. Unearthing an old, forgotten gem of retro cheese and uploading it to the internet can be an unorthodox path to viral success, but it's one that can truly pay off if you hit the jackpot — consider how the practice of \"Rickrolling\" became a cultural touchstone based off of a decades-old music video by Rick Astley. Examples: \"Rickroll\" videos, \"Super Bowl Shuffle\" clips, \"Everything Is Terrible,\" etc. Viral Tip: Though every decade has its fair share of cheese, for many, the neon-soaked 1980s take the cake. Try watching forgotten 80s junk-cinema classics like Miami Connection for a taste of just how corny the Reagan years seem today."
    },
    {
      "title": "Make a short film.",
      "content": "Make a short film. While feature-length movies are typically beyond the time and budget constraints of most viral video producers, shorts offer a more attainable target. There are no rules here. You can go for a dramatic narrative, a simple comedy setup, or even take an experimental approach by stringing together images and textures without a traditional storyline — it's all up to your vision as the director. Examples: Five Second Films, SNL Digital shorts, etc. [6] X Research source Viral Tip: Sometimes, the key to achieving viral success with a short film is to make it a really short film. For example, the \"Five Second Films\" YouTube channel, which makes humorous clips that run just five seconds in length, has millions of subscribers."
    },
    {
      "title": "Make a music video.",
      "content": "Make a music video. These videos are a step above and beyond basic staring-into-the-webcam lipsync videos. Good music videos pair a memorable concept with a catchy song for potent results. Though it's by no means easy to plan, choreograph, and shoot an awesome music video, the results speak for themselves: as of 2014, seven of the eight most-viewed YouTube videos of all time are music videos. Examples: \"Autotune the News\" videos, \"Here it Goes Again\" by OKGO, etc. Viral Tip: While you don't necessarily have to make a music video for your own original music to go viral, be prepared for difficulties if you make one for someone else's music — song copyright holders are quick to issue takedown notices for content they believe uses their material unfairly."
    },
    {
      "title": "Try to break a record.",
      "content": "Try to break a record. People everywhere love seeing amazing feats of strength, intelligence, and creativity. Though you'll have to literally be the best in the world at something to break a world record. If you're willing to pick a very narrow category, it may not be that big of a stretch to break the record, so get creative! Examples: \"Guinness World Record: Most Shirts Worn at One Time,\" \"Tightest Parallel Park Record Broken,\" etc. Viral Tip: You don't necessarily have to break a record on your own — records like \"Biggest Sock Hop,\" for instance, recognize community organizing rather than one person's individual skill."
    },
    {
      "title": "Make an animation.",
      "content": "Make an animation. Viral videos don't necessarily have to be of real people and places. If you're skilled with animation software (like, for instance, Adobe Flash), you can put your skills to use by making cartoons, animated gags, music videos and more. Best of all, animation allows you to depict things that would be impossible to actually shoot with a camera, so you're free to be as creative as you like. Examples: Potter Puppet Pals, Charlie the Unicorn, etc. Viral Tip: Don't know how to animate? See our Adobe Flash articles to start learning about one of the most popular animation programs in use today."
    },
    {
      "title": "Use the best equipment possible.",
      "content": "Use the best equipment possible. Being shot in crystal-clear, high-resolution video as opposed to grainy cellphone footage never hurts a viral video's chances. If you want your video to look as good as possible, be willing to make the investment in professional equipment (or borrow a friend's.) Consider browsing our photography articles for technical information on how to get your shots looking amazing. You don't necessarily have to break the bank to get great-quality footage. For instance, a good-quality voice recorder and an HD camcorder, which is all you'll need for basic videos, will run you about $500."
    },
    {
      "title": "Keep the video short.",
      "content": "Keep the video short. The longer your video is, the greater you'll have to fight to keep your audience's attention. Thus, it's much easier to make a short video go viral than a long one. This isn't just common sense — academic research has found that the majority of videos that go viral are under three minutes in length. Some of the most successful videos ever, like the world-renowned \"Charlie Bit My Finger,\" are much shorter."
    },
    {
      "title": "Don't limit yourself to YouTube.",
      "content": "Don't limit yourself to YouTube. There's no disputing that YouTube is the most popular video-sharing platform in the world (official data from Alexa, an online statistics company, puts YouTube as the third-most-visited site in the world behind Google and Facebook.) However, it's not the only place to upload your videos. Hosting sites like DailyMotion, Vimeo, and more sometimes offer attractive features to video providers. For instance, DailyMotion is sometimes ranked higher in terms of video quality than YouTube. If you're interested mainly in making very short clips, consider joining Vine, a video-sharing app meant for videos up to about six seconds long. Vine has its own active user base, so it's possible to become a viral Vine sensation entirely outside of YouTube (though you'll ultimately be able to reach fewer people.)"
    },
    {
      "title": "Be positive, uplifting, or inspiring.",
      "content": "Be positive, uplifting, or inspiring. As a very general rule, people like viral videos that make them feel good about themselves and/or the world more than they like pessimistic ones (though there are, of course, plenty of exceptions.) Academic research has found that, while viewers typically prefer content that evokes a strong emotional response, \"happy\" content tends to get shared most of all. [7] X Research source A look at the top 10 most-viewed YouTube videos of all time seems to confirm this: the only one that isn't a music video is \"Charlie Bit My Finger,\" which is certainly lighthearted and funny. Of the music videos, about six or seven would generally be classified as lighthearted, depending on your personal tastes."
    }
  ]
}