{
  "url": "https://www.wikihow.com/Seal-Glass-Jars",
  "title": "How to Seal Glass Jars",
  "steps": [
    {
      "title": "Prepare your jars.",
      "content": "Prepare your jars. Before you can begin the process of sealing jars with a water bath, take some time to prepare the jars. First, inspect the jars and lids for nicks, cracks, or sharp and uneven edges. Check both the inner and outer layer of a jar's lid. Make sure the bends fit on all the jars. Defective jars should be thrown out. [1] X Research source Once you've made sure all the jars are safe for use, hand wash your jars and lids in soapy warm water. After washing them thoroughly, set them to dry in a drying rack or on a clean dish towel. [2] X Research source"
    },
    {
      "title": "Sterilize your jars.",
      "content": "Sterilize your jars. Place your jars in a large pot filled with water. The water should be hot but not boiling to start. The pot should be large enough so that the water completely covers the jars. Bring the water to a simmer. Keep the jars there until ready for use. [3] X Research source If you frequently need to seal glass jars with a water bath, consider purchasing a bath canner. This is a special device specifically designed to submerge jars in water for sterilization. However, this tool is mostly for convenience. If you do not have a bath canner, a large pot will work just as well. [4] X Research source"
    },
    {
      "title": "Prepare your canning recipe.",
      "content": "Prepare your canning recipe. When using the water bath sealing method, make sure your foodstuff is naturally acidic or has added acid. This is the only way to guarantee that bacteria will not build up in your canned goods. While you're letting the jars sterilize, prepare your canning recipe. [5] X Research source High-acid foods include fruits, fruit juices, jams, jellies and other fruit spreads, salsas, tomatoes with added acid, pickles, relishes, chutneys, sauces, vinegars and condiments."
    },
    {
      "title": "Prepare the water bath.",
      "content": "Prepare the water bath. First, turn off the heat on the pot and remove your now sterilized jars from the pot with tongs. You can also buy specialized devices designed to remove jars from hot water, called a jar lifter. This may be slightly safer than tongs. [6] X Research source Place the jars to dry in a drying rack or on a clean dish towel. Then bring the large pot to a low boil. [7] X Research source"
    },
    {
      "title": "Fill the jars.",
      "content": "Fill the jars. Set the boiling water aside and fill your jars. For the best effects, use a tool known as a jar funnel which allows you to easily transfer liquid-like substances into your jars. Make sure to leave some air space. For soft spreads, like jams and jellies, leave 1/4 of an inch. For solid foods, like fruits and pickles, leave 1/2 of an inch. [8] X Research source Place the lid on the jar and screw the ring on. [9] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source Tap the side of the jar with a wooden spoon to remove bubbles. Repeat with the other jars. Don’t screw the ring on too tightly or the excess air won’t be able to escape."
    },
    {
      "title": "Load your jars onto your canning rack.",
      "content": "Load your jars onto your canning rack. The canning rack is a device that sits on the water bath canner or pot and ensures the glass jars don’t touch the bottom and break. Make sure you have a canning rack before beginning the sealing process. Never layer the jars on the rack. You may have to seal the jars in several batches depending on the size of your canning rack."
    },
    {
      "title": "Lower the jars into the boiling water.",
      "content": "Lower the jars into the boiling water. Place the canning rack with the jars into the boiling water. Process them according to recipe directions. The processing (boiling) times will vary from recipe to recipe. Processing time starts when the pot comes back to a boil. Make sure there's about an inch or two of water above the lids of the jars. Add more water before returning it to a boil if necessary."
    },
    {
      "title": "Remove the jars.",
      "content": "Remove the jars. Remove the rack with the jars and set them on your counter to cool overnight. Wear oven mitts when moving the rack to avoid injury. Use a pair of tongs or jar lifters to lift them carefully out of the rack. [10] X Research source"
    },
    {
      "title": "Store them in a cool, dry place once cooled.",
      "content": "Store them in a cool, dry place once cooled. If the lid is not depressed, it is not sealed. You should eat it immediately instead of storing it or re-seal the jar with a new lid. Check the jar for cracks before doing so. [11] X Research source"
    },
    {
      "title": "Acquire the necessary items.",
      "content": "Acquire the necessary items. You'll need a vacuum pack machine. You'll also need a glass jar sealing attachment for your vacuum sealer. This is a special type of device that fits over glass jars, like mason jars, and allows you to vacuum seal your jars."
    },
    {
      "title": "Sterilize your jars before you seal them.",
      "content": "Sterilize your jars before you seal them. It's a good idea to sterilize any jars you're using as a precaution. You can boil them or run them through a very hot dishwasher. If you're boiling them, put them in a pot with water that completely covers the jars. Bring the pot to a boil. Reduce heat to a simmer and let them stay there until you're ready to use them. [12] X Research source"
    },
    {
      "title": "Fill the jars.",
      "content": "Fill the jars. While waiting for the jars to sterilize, prepare the food you're going to can. This may mean following a recipe for a jam or a jelly. [13] X Research source However, many people store easily breakable items that cannot be stored in bags in vacuum-sealed jars. For example, you may want to store something like small candies or nuts in a vacuum-sealed jar. [14] X Research source When you're done preparing the food, you can remove the jars from the boiling water. Use either tongs or a jar lifters. Allow them to dry and then add the food. Once again, leave some airspace. With soft spreads, like jams or jellies, leave 1/4 an inch of airspace. Whole foods, like nuts or candies, need 1/2 an inch of airspace. [15] X Research source Use a non-metallic spoon to remove bubbles. Do so by running the wooden or rubber spoon around the inner surface of the jar, pressing the food down gently."
    },
    {
      "title": "Prepare the vacuum.",
      "content": "Prepare the vacuum. Once your food is prepared, you can begin to prepare the vacuum. Place the lid on the jar you're going to seal. However, leave the lid ring off for now. Attach the hose of the vacuum pack sealer to the jar sealer attachment. From there, place the attachment over the jar. Make sure the attachment is on firm so it does not fall of when you begin vacuuming the jar. [16] X Research source"
    },
    {
      "title": "Turn the vacuum sealer on.",
      "content": "Turn the vacuum sealer on. You should process the jar according to your specific device instructions. However, in most cases you simply turn the device on until the machine indicates the jar is sealed. You should hear the lid pop when it is ready. The machine may also indicate, through a sign like a green light, that the process is complete. [17] X Research source"
    },
    {
      "title": "Screw the ring onto the jar.",
      "content": "Screw the ring onto the jar. Remove the hose from the sealing attachment. Remove the sealing attachment from the jar. Then screw the ring tightly onto the jar. Store the jar in a cool, dry place. [18] X Research source"
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. To seal your jars with wax, you'll need a ceramic wax sealer dish, filament tape, scissors, a tea candle, a kitchen lighter, and bottle sealing wax. You should be able to find a lot of these supplies at a local craft store or department store. However, if you can't find them in your area you should be able to order them online. This process is best for glass jars and bottles with slim necks. [19] X Research source"
    },
    {
      "title": "Prepare the ceramic wax sealer dish on a table.",
      "content": "Prepare the ceramic wax sealer dish on a table. If you've purchased a wax sealer dish with a place for the candle beneath it, you can just place the sealer on the table. If not, you'll need to put it on a small rack so that a candle can go beneath it."
    },
    {
      "title": "Light the candle.",
      "content": "Light the candle. Light a tea candle. Then, place it beneath the wax heating dish."
    },
    {
      "title": "Heat the wax.",
      "content": "Heat the wax. Add granular wax in any color to the ceramic dish. As the wax melts, add more wax to the dish until the liquefied wax is about 2cm from the top of the dish. The wax will take about 20 minutes to melt. Blow out the candle when it's finished."
    },
    {
      "title": "Pour a craft project or alcohol into the bottle.",
      "content": "Pour a craft project or alcohol into the bottle. Twist the cap on the bottle. Make sure the cap is on tight. If it isn’t used for eating, you can use a cork instead."
    },
    {
      "title": "Tape on the filament tape.",
      "content": "Tape on the filament tape. Wrap the filament tape around the cork or the cap where it meets the jar until it overlaps on itself. Cut the filament tape. Bend the end that's sticking out and push it against the rest of the tape. The bent part will be what is pulled to undo the seal."
    },
    {
      "title": "Dip the jar.",
      "content": "Dip the jar. Turn the jar upside down. Dip it straight down into the wax. Lift it straight up a moment later. Spin it as soon as you remove it from the wax to prevent unwanted dripping."
    },
    {
      "title": "Press your seal.",
      "content": "Press your seal. This step is optional. Press your engraved wax seal into the top immediately after dipping. A monogrammed or symbolic wax seal is a great way to personalize your project. Allow it to sit and dry completely before transporting. [20] X Research source"
    }
  ]
}