{
  "url": "https://www.wikihow.com/Replace-Cars-in-Need-for-Speed:-Most-Wanted",
  "title": "How to Replace Cars in Need for Speed: Most Wanted",
  "steps": [
    {
      "title": "Start the process of downloading new cars for NFSMW from the Internet.",
      "content": "Start the process of downloading new cars for NFSMW from the Internet. There are a variety of websites you can do this from, but one of the most popular ones is."
    },
    {
      "title": "Select NFS Most Wanted from the list of available NFS games.",
      "content": "Select NFS Most Wanted from the list of available NFS games. To do this, click the “Need for Speed” link on the top part of the site, and click “Need for Speed Most Wanted” from the list that appears."
    },
    {
      "title": "Select the car you want to add to your NFSMW.",
      "content": "Select the car you want to add to your NFSMW. You can click one of the cars under “Latest Most Wanted Cars” or click “More” to see other available cars. Once you sight the car you want, click on it."
    },
    {
      "title": "Review which car your downloaded vehicle replaces in NFSMW.",
      "content": "Review which car your downloaded vehicle replaces in NFSMW. You can see this info in the description box for your download, which is found below the vehicle’s photo. Each downloaded vehicle must replace one of the cars originally available on NFSMW. If you do not want to replace the particular original car indicated, click the Back button on your browser and select a different car to download."
    },
    {
      "title": "Download your new car.",
      "content": "Download your new car. If you are okay with replacing the car stated in the description box of the new car, click the green “Download” button. This will download a zipped (compressed) folder containing the files for the new car onto your computer."
    },
    {
      "title": "Open your NFS MW installation folder.",
      "content": "Open your NFS MW installation folder. This is the folder to which the game’s installation files were copied to during its setup and is, by default, on this path: C:\\Program Files\\ EA Games\\Need for Speed Most Wanted\\"
    },
    {
      "title": "Open the “Cars” folder.",
      "content": "Open the “Cars” folder. Do this by double-click on the folder."
    },
    {
      "title": "Move the old car’s folder to a new location on the computer.",
      "content": "Move the old car’s folder to a new location on the computer. You can do this by right-clicking the folder and selecting “Copy” or “Cut.” If the old car is SL 500, for instance, its folder will be named SL500. Head to a location where you want to keep the car file. In the new location, right-click and select “Paste.” This will allow you to later restore the old car in case you are dissatisfied with the new one."
    },
    {
      "title": "Open the zipped folder you downloaded.",
      "content": "Open the zipped folder you downloaded. Go to your Downloads folder, locate the downloaded zip file, and right-click it. Select “Unzip here” from the context menu to unzip the new car file."
    },
    {
      "title": "Copy the new car’s files from the unzipped folder.",
      "content": "Copy the new car’s files from the unzipped folder. Open the folder, and locate the new car’s file. Its folder will bear the name of the car that is to be replaced, e.g., SL500. Do this by right-clicking the folder and choosing “Copy” from the context menu"
    },
    {
      "title": "Install the new car into your NFSMW game.",
      "content": "Install the new car into your NFSMW game. Head inside the NFSMW installation folder and open the Cars folder. Right-click and select “Paste.” You will then have replaced the old car with a new car!"
    }
  ]
}