{
  "url": "https://www.wikihow.com/Perform-a-Back-Kick",
  "title": "How to Perform a Back Kick",
  "steps": [
    {
      "title": "It's a martial arts move where you kick backward at your target.",
      "content": "It's a martial arts move where you kick backward at your target. It has a number of different names, including the mule kick or horse kick. It's also sometimes called a spinning back kick since you have to turn away from the target before you strike. There are also specific names for the move in the different martial arts where it's practiced, like \"ushiro geri\" in Karate or \"dwi chagi\" in Taekwondo."
    },
    {
      "title": "It's as simple as kicking straight back at your target.",
      "content": "It's as simple as kicking straight back at your target. Start by facing away from your opponent with your feet parallel. Keep your arms up and your hands close to your face, then bend your dominant leg so your knee comes up toward your chest. Kick your leg so it sweeps underneath your body, then lean forward with your torso as your leg stretches behind you. Try to make contact with the heel of your foot, then follow through by planting the rest of your foot solidly into your target. [1] X Research source Keep your kicking leg as close to your other leg as possible—don't let your knee go out sideways or you'll lose some of the power in your kick. You can also start by standing with one foot in front of the other. If you do this, make sure your dominant foot is the one in back when you're facing away from your target. Some instructors will have you pivot first, then kick."
    },
    {
      "title": "Start facing your opponent, turn, then kick.",
      "content": "Start facing your opponent, turn, then kick. Instead of starting with your back to your target, stand with your dominant foot in front of you while you're facing the target. Pivot on the balls of your feet, turning your body until you're facing completely away from your opponent. Then, kick backward with your dominant leg like you would for a regular back kick. [2] X Research source Some instructors will just call this a back kick. Although the name might make you think you should kick while you're spinning, that's a totally different kick, like a roundhouse kick. A back kick should be a completely linear movement. Some disciplines, like Wushu and Savate, do teach a back kick with a slightly rounded motion, but this the exception rather than the rule."
    },
    {
      "title": "Do a basic back kick, but spring up as you kick.",
      "content": "Do a basic back kick, but spring up as you kick. Turn away from your opponent and crouch slightly, then lift your dominant knee toward your chest. As you start to kick backward, push up with your opposite leg so you jump in the air. [3] X Research source This might seem like it's more complicated than a regular back kick, but getting off the ground actually makes it easier to adjust your distance from the target. It also gives you a little more force on impact. Remember to look over your shoulder to spot your target as you do this."
    },
    {
      "title": "Run toward your target to do a flying back kick.",
      "content": "Run toward your target to do a flying back kick. A flying back kick is the same as a jumping back kick, but with more momentum. It's hard to run backward, though, so instead, start by running toward your target. When you get within striking distance, jump into the air, rotate until you're facing away from your opponent, and then kick backward with your dominant foot. This is a more advanced kick, so master a basic back kick and a jumping back kick before you try this one."
    },
    {
      "title": "Yes, it uses some of the biggest muscle groups in your body.",
      "content": "Yes, it uses some of the biggest muscle groups in your body. Back kicks work your back, hamstrings, and glutes, which are all large muscles. When you activate the larger muscles in your body, it requires more energy, so you end up burning more calories overall. [4] X Research source Strengthening your glutes and back will also help stabilize your core and give you better support for your knees. [5] X Research source"
    },
    {
      "title": "It's good for both attacking and counter-attacking.",
      "content": "It's good for both attacking and counter-attacking. A back kick makes a great initial attack because the huge impact can catch your opponent by surprise and throw them off-balance. However, it's also a good way to counter, especially if your opponent tries to throw a kick and they miss."
    },
    {
      "title": "Yes, it's a kick that carries a lot of momentum.",
      "content": "Yes, it's a kick that carries a lot of momentum. With a back kick, you're striking with your heel and using some of the most powerful muscles in your body, so it can do a lot of damage if you strike someone with a full-force back kick. Because of that, you should never do this kick to just play around with your friends—you could really hurt someone. If you're practicing a back kick with a sparring partner, have them hold a shield target. This is a large pad that will protect your partner as you kick. [6] X Research source"
    }
  ]
}