{
  "url": "https://www.wikihow.com/Measure-Growth-Rate-of-Plants",
  "title": "How to Measure Growth Rate of Plants",
  "steps": [
    {
      "title": "Set the ruler at the base of the plant.",
      "content": "Set the ruler at the base of the plant. Smaller plants can be measured with a ruler, while taller plants may require a measuring tape, yardstick, or meter stick. Make sure that the ruler begins at zero on the bottom. [1] X Research source If you are measuring a plant in a pot, the ruler should begin at ground level."
    },
    {
      "title": "Record the height of the plant.",
      "content": "Record the height of the plant. You will want to measure the plant from its base to its highest point. Write this down in a chart with both the date and the height recorded. Repeat every two to three days."
    },
    {
      "title": "Calculate the average using the growth rate formula.",
      "content": "Calculate the average using the growth rate formula. You can see the average daily growth rate by taking the change in size and dividing it by the amount of time it has been growing. The equation for the growth rate formula is ( S 2 − S 1 ) T {\\displaystyle {\\frac {(S2-S1)}{T}}} where S1=first measurement, S2=second measurement, and T equals the number of days between each. This is an extremely general figure. Plant growth rate is extremely fluid and can be subject to major variations day by day. Currently, there is no way to accurately predict exact daily growth rate without the use of sophisticated laboratory equipment."
    },
    {
      "title": "Create a chart.",
      "content": "Create a chart. Your chart should have rows for each date that you measure your leaves. The columns should be labeled “number of leaves,” “average length,” and “average width.” You should check your leaves every two to three days."
    },
    {
      "title": "Count the leaves on your plant.",
      "content": "Count the leaves on your plant. Be extremely thoroughly, but make sure you do not count the same leaves twice. Include new leaf tips and sprouts in your count. Record the number of leaves down in your chart."
    },
    {
      "title": "Mark the length and width.",
      "content": "Mark the length and width. Choose a random sampling of four or five leaves. Hold the ruler from the bottom to the tip of the leaf. Add up the measurements, and divide by the number of measurements you took. (For example, if you measured by five leaves, divide by five). This is the average leaf length for that day. Record this down in your chart. Repeat this process to find the width of the leaves. Measure the leaves at their widest part. Be as specific as possible; get the measurement down to centimeters and millimeters if you can."
    },
    {
      "title": "Trace your plant's leaves on grid paper.",
      "content": "Trace your plant's leaves on grid paper. Keeping the leaf on the plant, draw around the leaf on grid paper. The grid should have squares that are one inch in area. Count the number of squares covered to get the surface area of each leaf."
    },
    {
      "title": "Repeat measurements every two or three days.",
      "content": "Repeat measurements every two or three days. Leaves can grow quickly. Check the size of your leaves every few days to see how they are growing. You can use a modification of the growth rate formula for this purpose. You can calculate the leaf number growth rate. This modification of the growth rate formula will tell you how many leaves are approximately growing per day. The equation for this growth rate is ( L 2 − L 1 ) T {\\displaystyle {\\frac {(L2-L1)}{T}}} where L1=first leaf count, L2=second leaf count, and T equals the number of days between each. The leaf size formula is the same as the plant height formula. Instead of height, the variable is the surface area. The equation for the growth rate formula is ( S 2 − S 1 ) T {\\displaystyle {\\frac {(S2-S1)}{T}}} where S1=first surface area measurement, S2=second surface area measurement, and T equals the number of days between each. [2] X Research source"
    },
    {
      "title": "Create a growth template.",
      "content": "Create a growth template. Once you have gathered a few weeks’ worth of leaf tracings, you can use those shapes to create a template. Take a piece of paper or cardboard. Take the smallest tracing, and create a circle roughly that size, starting from the bottom of the paper. Create up to six larger circles that contain all of the measurements up to the largest. These should form concentric rings outside of the first circle. Label each of these circles with a number. One should be the smallest and six, the largest. [3] X Research source In the future, you can use this template to measure leaves with greater ease. Hold up the leaf at the bottom of the paper with it centered around the smallest circle. Mark the largest circle it fills without going over and record that as the leaf size."
    },
    {
      "title": "Remove your plant from its pot.",
      "content": "Remove your plant from its pot. Ease a trowel around the edges of the pot. If it is planted in the ground, dig a wide circle around the plant. You do not want to touch the roots. Lift the plant up, and with your fingers, remove the large dirt clumps around the plant. [4] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Do not pull or yank the plant out."
    },
    {
      "title": "Rinse soil from the roots.",
      "content": "Rinse soil from the roots. With a gentle stream of water, wash off dirt from the plant. You can use your fingers to gently ease clumps away. Pat your plant dry with a paper towel."
    },
    {
      "title": "Place your plant on the scale.",
      "content": "Place your plant on the scale. Do not wait for it to lose its moisture. Place it on a scale. The scale should be able to read measurements as small as milligrams. Record the weight. [5] X Trustworthy Source Science Buddies Expert-sourced database of science projects, explanations, and educational material Go to source"
    },
    {
      "title": "Replace the plant in its pot.",
      "content": "Replace the plant in its pot. Return it to its hole, and cover with fresh soil. If you are potting your plants, place some potting soil in the bottom of a pot before putting the plant back in. Cover with fresh potting soil, leaving an inch between the soil and the lip of the pot. [6] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Water the plant to replace any lost moisture."
    },
    {
      "title": "Wait a month before repeating.",
      "content": "Wait a month before repeating. You should not weigh your plants often as this can harm the plant by slowing its growth or killing it. As long as you are gentle and do not touch its roots, you may be able to safely remove and weigh the plant a few times, but exercise extreme caution when doing so."
    },
    {
      "title": "Calculate the growth rate formula.",
      "content": "Calculate the growth rate formula. After you have a second measurement, use the growth rate formula to calculate the daily average growth rate. The equation for this growth rate is ( W 2 − W 1 ) T {\\displaystyle {\\frac {(W2-W1)}{T}}} where W1=first weight, S2=second weight, and T equals the number of days between each."
    },
    {
      "title": "Choose a random plant.",
      "content": "Choose a random plant. Dry measurements will kill your plant, so you should only do this type of measurement if you have multiple specimens. Choose a random plant, and remove it from its pot. Leave the other plants alone."
    },
    {
      "title": "Wash off the soil carefully from the roots.",
      "content": "Wash off the soil carefully from the roots. With a gentle stream of water, rinse dirt from the plant. You can use your fingers to gently remove clumps. Pat it dry with a paper towel."
    },
    {
      "title": "Place your plant in the oven.",
      "content": "Place your plant in the oven. A drying oven is ideal. Set the temperature to 140 ∘ {\\displaystyle ^{\\circ }} Fahrenheit or 60-70 ∘ {\\displaystyle ^{\\circ }} Celsius. Heat the plants for at least 8 to 12 hours and up to two days to dry out the plants. [7] X Research source If you do not have a drying oven, a food dehydrator set at the same temperature will also work. A conventional oven with a convection setting may work as well. Set it at 140 Fahrenheit for six hours. It will dry out the plants well enough, although a little moisture may remain. Do not leave a conventional oven on overnight."
    },
    {
      "title": "Place your plant in a plastic zip bag.",
      "content": "Place your plant in a plastic zip bag. Pinch the zipper closed to prevent moisture from entering. This will keep the plants dry. Allow the plants to cool in the bag. [8] X Trustworthy Source Science Buddies Expert-sourced database of science projects, explanations, and educational material Go to source If leaves fall off during cooling, keep them. Place the detached leaves on the scale with the rest of the plant."
    },
    {
      "title": "Weigh your plant.",
      "content": "Weigh your plant. When it is completely cool, place the plant on the scale. Record the weight. This particular plant is now completely destroyed. You may toss out the plant this point. [9] X Trustworthy Source Science Buddies Expert-sourced database of science projects, explanations, and educational material Go to source"
    },
    {
      "title": "Calculate the growth rate after repeating.",
      "content": "Calculate the growth rate after repeating. You can take new measurements after a few days, but you may want to wait a week or two. Once you have the new measurements, you can compare them to the old. Use the growth rate formula to find an average change in weight. The equation for this growth rate is ( W 2 − W 1 ) T {\\displaystyle {\\frac {(W2-W1)}{T}}} where W1=first dry weight, S2=second dry weight, and T equals the number of days between each."
    }
  ]
}