{
  "url": "https://www.wikihow.com/Sneak-a-Boyfriend-or-Girlfriend-Into-Your-House",
  "title": "How to Sneak a Boyfriend or Girlfriend Into Your House",
  "steps": [
    {
      "title": "Scope out your house.",
      "content": "Scope out your house. You may live there, but you’ll need to look at your home with fresh eyes to understand all of its access points, blind spots, vantage points, and tattle-tale floorboards. Take a tour of the place when you’ve got some time alone to better acquaint yourself. Assess every door and window for viability as an entrance or exit. Consider the field of vision offered by all of the windows in your house. If another family member sees someone in their yard at 1:00 in the morning, they're likely to call the police—or recognize your partner and their intent. How old is your house? Older house are often noisier houses. Walking nearer to the walls or guard-rails on stairs helps keep the noise down, because there's not much else that can be done to stop those squeaking floorboards. Shaking talcum powder into the cracks of the floorboards offers temporary benefits, but will probably get you some weird looks from your parents. Alarm systems will have to be deactivated before opening windows or doors, so you’ll need the code (and have an idea about how loud the system’s noises will be while you punch the code in). Be sure to re-engage the system after your partner leaves in the morning. Pets—dogs especially—will likely be a problem. Consider how they react to people entering your house, and what usually works for calming them down. Locking animals up in another room in an effort to block their interference rarely works well. Try training your dog to associate your partner with treats, by feeding them the treats the moment that they see your partner for several days beforehand."
    },
    {
      "title": "Select the entry point.",
      "content": "Select the entry point. You should decide on the window or door beforehand so you can properly test and prepare it. Consider how visible the window is, how close it is to your parents’ room, and how far they’ll have to walk through your house before getting to the relative safety of your bedroom. Determine how much you’d need to move, open, and unlock for the person to get inside at each of possible entry point. You’ll want to prepare the chosen site beforehand, but rearranging the potted plants outside your bedroom prematurely might draw suspicion. Think about the noise you'll have to make opening that window, pulling up its blinds, or turning a dead-bolt. Minimize these factors where you can. If it is a sliding door, make sure to open it gently. The sound of the door sliding could make noise and wake your parents up. If it’s a window with a screen, you’ll need to remove the screen. The ease of doing this depends on the screen’s construction, but many can only be removed easily from the outside, meaning second-story windows (and higher) are a no go. Ensure that you don’t damage the screen either, as this will give your plan away (and cost you some allowance). Don’t get in the habit of leaving windows or doors unlocked. They’re locked for you and your family’s safety, and your parents should have an accurate idea of the home’s security. Consider how much force might be necessary to pull a person in through the window, and whether you can safely exert this force. Fire escape ladders and basement windows are unique advantages to some houses. Fire escapes will help your partner gain access to higher-up windows, and basement windows are often far away from the master bedroom. It’s unlikely that you’ll use a door (it’s also, to be clear, less fun than crawling through a window) but don’t rule them out."
    },
    {
      "title": "Walk the path.",
      "content": "Walk the path. Casually walk the route as though you’re sneaking in, without giving away to any onlookers that you’re pretend-sneaking. You should know roughly how long it will take your partner to get across the yard, through the access point, and from the access point to your bedroom once they’re inside. Sometimes a longer course offers tactical advantages. Walking on carpet or rugs, for instance, is going to be quieter than tile, which is in turn going to be quieter than a path that takes you over hardwood floors. [1] X Research source Actually walking the path will remind you of any particular squeaky floorboards you’ll need to warn your nighttime visitor about. While outside, think about the sight lines that neighbors and traffic might have on your property. A well-meaning neighbor could blow your plans when they see your significant other sneaking through the shared alley between your two houses."
    },
    {
      "title": "Designate hiding spots.",
      "content": "Designate hiding spots. You’ll want a hiding spot ready to go, both in your bedroom and near the access point. Leave a space in a closet, or clear out a spot beneath your bed. A messier room will give you more to work with (visitors could even, if you’re okay with it, bury themselves under your dirty laundry or sheets) but a suddenly messy room might raise suspicion. The darkness of an unlit house can turn every corner and cubby into a decent-enough hiding space, but don’t bet too much on your parents leaving the lights off when they’re investigating a suspicious noise. If their suspicion aroused, however, take comfort knowing that parents around 50 need twice as much light as even a 30-year-old to see in the dark. [2] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Contact your partner covertly once the coast is clear.",
      "content": "Contact your partner covertly once the coast is clear. You’ll want an easy way to communicate with your partner. Setting meeting times beforehand can work as a last resort, but when a parent is wandering around in the kitchen to get a midnight snack, you’ll wish you could warn your visitor to hold off for a few minutes. Cell phones are the most obvious—and best—choice here. Ensure yours is set to silent, or vibrate only. Home phones should be avoided on both ends. Calling your partner’s cell phone through your home phone sounds safe enough, but an unthinking callback or butt-dial can send your home phone ringing off the hook. Your parents could also pick up the phone in their bedroom while you’re already on the line, discussing your rendezvous. If it comes to it, you might risk the old-school method of taping a message in the window, or designating a certain light in your house—one which won’t be tampered with by your parents—as a signal. If it’s off, stay away. If it’s on, come on in."
    },
    {
      "title": "Ensure that your parents are asleep.",
      "content": "Ensure that your parents are asleep . This will be easier to verify if your parents sleep with their door open, but safer going forward if they close their door. Listen for snoring, or the slow, steady breathing that indicates they’ve conked out. Our bodies repeatedly cycle through several stages of sleep, some of them lighter and some heavier, but the periods of deep sleep decrease in duration as the night goes on. [3] X Research source Roughly 60 minutes after falling asleep, your parents will likely be in one of the deepest states of sleep they’ll experience that night—use this information as best you can. If your guardians’ bedroom is near the kitchen, you can train them to expect a little noise in the evening from you. Start getting cereal—or any other food you’ll enjoy—as a late-night snack for at least a week in advance. If they wake up while you’re digging around, you’ll have an innocent explanation; if they don’t, then that bodes well for the other noises you’re soon going to make. The hour that you usually turn in is also important to keep in mind. If you always go to bed early, your family may grow suspicious if you're still up at 12:30, or vice versa if you’re usually up late but say you're going to sleep at 8:00. Try and sell the former by drinking cola and acting a bit hyper, and the latter by behaving sluggishly from the moment you get home from school or work. You’ll want to recheck the designated entry point, to ensure that window or door wasn’t re-locked by your parents before they went to bed."
    },
    {
      "title": "Quietly sneak them in.",
      "content": "Quietly sneak them in. If you use a ladder or step to reach the entry point, make sure you can put it back or pull it inside with you. Move quickly, but keep as quiet as possible. It’s recommended you “run dark:” turn off all the lights, double-check that cell phones are silent, and shut off computer monitors and TV screens. If it’s not unusual for you, a radio at low volume can drown out some of the sounds you’ll make sneaking them inside. It's not noises that wake us up at night, but inconsistencies in noise. [4] X Research source A droning, familiar sound can provide white noise to cover those inconsistencies. If you’re pulling someone up a sheer wall, brace yourself so that you cannot be pulled out of where you are. An alternative to sneaking your boyfriend or girlfriend in at night is inviting them over in the late afternoon, then stowing them away in your closet until everybody else go to sleep. Wait until your parents are in a position where they wouldn’t notice your partner leaving (like out back, or using the bathroom), then act like they left a while ago. You should ensure your partner’s car or bike is well out of sight. Equip your partner with something quiet and fun to occupy them while they hide, and with snacks for their long wait! Lock the door and window after they’re in. It will keep your home safer and decrease suspicion if a parent gets out of bed during the night."
    },
    {
      "title": "Keep quiet, and stay inconspicuous.",
      "content": "Keep quiet, and stay inconspicuous. If you need something from elsewhere in the house, hide the other person as best you can before you go and get it yourself. If you or your partner changes or removes clothes, keep them somewhere out of sight. This goes for anything your partner may have brought with them as well: cell phone, wallet, keys, etc. If you need a light, rely on your cell phone's backlight, and don't shine it under the door. If the person needs to use the bathroom: don't flush."
    },
    {
      "title": "Set a silent alarm so you remember to escape in time.",
      "content": "Set a silent alarm so you remember to escape in time. If you fall asleep in your room, ensure that you’ve got an alarm set to rouse you both with plenty of time to escape. Make sure the alarm is vibration only, or quiet enough that it wouldn’t disturb your parents. Get them out of there at least an hour before your parents would normally wake up. Consider also how visible they’ll be in the morning light, and whether their own parents will wake up and notice their absence. If you can’t trust yourself to wake up with an alarm, don’t go to sleep. If you use a clock radio, use the radio and not the buzzer."
    },
    {
      "title": "Get them out of there.",
      "content": "Get them out of there. Once the other person is out of the building, have them get out of sight as soon as possible. Seeing someone leave a house in the morning can be just as incriminating as seeing them come in at night. If you’re caught, you might try to convince a parent that they were stopping by to ask for homework before school, but this is far from foolproof. Reader Poll: We asked 219 wikiHow readers if they liked to befriend their neighbors, and 73% of them said no. [Take Poll] However, it might be a good idea to make friends with your neighbors so they don't rat you out or call the police when they see someone entering or leaving your home."
    },
    {
      "title": "Erase the evidence.",
      "content": "Erase the evidence. Clean the room of any cans, bottles, wrappers, or loose clothes. Put trash from the night at the bottom of a trash can where it's less likely to be seen, and take out the trash tomorrow (but not first thing in the morning, if this is outside your normal routine). Flushing certain items may seem tempting, but you should refrain from doing so; a clogged toilet will draw far more attention than you can risk. Besides that, it’s environmentally unsound. [5] X Research source"
    }
  ]
}