{
  "url": "https://www.wikihow.com/Raise-Low-Blood-Pressure",
  "title": "How to Raise Low Blood Pressure",
  "steps": [
    {
      "title": "Drink plenty of water.",
      "content": "Drink plenty of water. Low blood pressure can accompany dehydration, so you may be able to raise your blood pressure by increasing your water intake. Aim to drink at least eight to ten 8 oz cups of water per day. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You should drink more water if this doesn’t help your symptoms or if you spend time outdoors or exercising. Health drinks with electrolytes can also help raise blood pressure, but you should avoid drinks with high sugar content."
    },
    {
      "title": "Eat smaller meals more frequently.",
      "content": "Eat smaller meals more frequently. Eating several small meals, rather than one or two large meals, can help regulate your blood sugar and blood pressure. Aim to make these meals healthy and low in carbohydrates. When you do eat carbohydrates, avoid processed carbs such as pasta and white bread. Go for complex carbs instead, such as oatmeal, whole grain pasta, whole grain bread, and barley. Low blood pressure after a meal, which is called postprandial hypotension, is common in adults over the age of 65. You may experience low blood pressure 1-2 hours after a meal."
    },
    {
      "title": "Balance your diet.",
      "content": "Balance your diet. An important way to regulate your blood pressure and improve your overall health is to eat a healthy, well-balanced diet. A balanced diet includes lean meats and fish, whole grains, and a lot of fruits and vegetables. Avoid heavily processed foods that are high in sugar and fat. While these do often contain higher levels of sodium, they are not a healthy source of other nutrients. [4] X Research source"
    },
    {
      "title": "Increase your Vitamin B12 and folate consumption.",
      "content": "Increase your Vitamin B12 and folate consumption. These vitamins contribute to a healthy blood pressure function and circulation. [5] X Research source Fortified cereal contains both minerals. Some other sources of B12 include fish and dairy products such a cheese, milk, and yogurt. Folate can be found in dark green vegetables such as broccoli and spinach. [6] X Research source"
    },
    {
      "title": "Reduce alcohol consumption.",
      "content": "Reduce alcohol consumption. Alcohol contributes to dehydration, even if consumed in moderation. If you have problems with low blood pressure, you should avoid drinking alcohol in any amount."
    },
    {
      "title": "Drink caffeine.",
      "content": "Drink caffeine. Caffeine constricts blood vessels, which can increase blood pressure. Increasing your caffeine intake by a moderate amount can help raise your blood pressure. [7] X Research source Be careful that you don't consume too much caffeine. Since it's a diuretic, caffeine may increase your fluid loss through urination, which can cause dehydration. This may in turn cause orthostatic hypotension, which is low blood pressure due to dehydration."
    },
    {
      "title": "Try taking herbal remedies.",
      "content": "Try taking herbal remedies. Herbal remedies are not proven to help blood pressure, but there is anecdotal evidence that some herbs may lessen the effects of low blood pressure. Some of these include aniseed and rosemary. [8] X Research source Adding these to your diet may offer some benefits, but you should ask your doctor before taking any herbal supplements. Cooking with these herbs is unlikely to have measurable effects, however. Ginger may actually lower blood pressure, so do not use ginger supplements if you already have low blood pressure. Cinnamon may also lower your blood pressure. Do not use cinnamon supplements if you have low blood pressure. [9] X Research source Pepper may also lower blood pressure. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Change body positions slowly.",
      "content": "Change body positions slowly. To reduce the effects of blood-pressure-related dizziness, be slow and deliberate with your motions. Use particular care when moving from lying down to sitting or from sitting to standing."
    },
    {
      "title": "Avoid crossing your legs while sitting.",
      "content": "Avoid crossing your legs while sitting. Crossing your legs can restrict your circulation. In order to maintain healthy circulation to your body, try to sit with your legs comfortably resting with your knees about hip-width apart."
    },
    {
      "title": "Exercise regularly.",
      "content": "Exercise regularly. Regular exercise benefits your health generally, but it will also help encourage and regulate healthy blood flow. Something as simple as going for a brisk 20-minute walk every day can help your mental and physical well-being. Avoid exercises that involve heavy lifting if your blood pressure has not yet regulated. This can lead to strain or injury. [11] X Research source"
    },
    {
      "title": "Wear compression stockings.",
      "content": "Wear compression stockings. Compression stockings are often worn to help reduce the swelling and pooling of blood in the lower body and to improve circulation. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Wearing low-grade compression stockings during daily activities will help regulate blood pressure by keeping blood circulating regularly through your veins."
    },
    {
      "title": "Avoid long, hot showers.",
      "content": "Avoid long, hot showers. The hot water from showers and spas can cause your blood vessels to expand, which can lead to a further drop in blood pressure. This can cause dizziness and fainting. You can remedy this by taking warm (rather than hot) showers and avoiding spas or hot tubs. You may also want to install a handrail or a shower chair in your shower in case of a dizzy spell. [13] X Research source"
    },
    {
      "title": "Seek medical attention if you are experiencing a sudden change in blood pressure.",
      "content": "Seek medical attention if you are experiencing a sudden change in blood pressure. If you had normal or high blood pressure and then had a sudden onset of low blood pressure, you should seek medical attention immediately. New onset low blood pressure can be a major warning sign of life-threatening illness, especially for people with diabetes. Even if the sudden drop in blood pressure is your only symptom, contact your doctor."
    },
    {
      "title": "Request a change in your medications or dosages.",
      "content": "Request a change in your medications or dosages. Some medications lower your blood pressure as a side effect. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Discuss with your doctor whether any of your current medications could be lowering your blood pressure and if a change in your prescription medication regimen could help you raise your low blood pressure."
    },
    {
      "title": "Get tested for underlying medical conditions.",
      "content": "Get tested for underlying medical conditions. Low blood pressure could be a sign of another medical condition such as diabetes, heart disease, cortisone deficiency, or a thyroid problem. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Have your doctor evaluate you for other medical conditions if your low blood pressure remains a problem after making diet and lifestyle changes. [16] X Research source Your doctor will likely recommend lab tests based on your specific medical history. These may include a complete blood count (CBC), comprehensive metabolic panel (CMP), A1C, thyroid stimulating hormone (TSH) test, and electrocardiogram (EKG)."
    },
    {
      "title": "Inquire about medications that raise blood pressure.",
      "content": "Inquire about medications that raise blood pressure. Fludrocortisone and Midodrine are both medications that can help raise blood pressure. Ask your physician if one of these medications would be right for your situation. People are not generally prescribed medicine for low blood pressure, as it's not often a cause for concern unless it presents with symptoms. [17] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Recognize warning symptoms.",
      "content": "Recognize warning symptoms. If your low blood pressure is accompanied by other symptoms, or if you had normal or even high blood pressure and now you suddenly have low blood pressure, you should seek medical attention. If you experience any of the following symptoms with low blood pressure, call your doctor: Dizziness Fainting Difficulty concentrating Blurred vision Nausea Clammy or pale skin Rapid, shallow breathing Fatigue Depression Thirst"
    }
  ]
}