{
  "url": "https://www.wikihow.com/Not-Show-Up-in-Suggested-Friends-on-Facebook",
  "title": "How to Not Show Up in Suggested Friends on Facebook",
  "steps": [
    {
      "title": "Open the Facebook app.",
      "content": "Open the Facebook app. It's the white \"F\" on a blue background. If you aren't logged in, enter your email address (or phone number) and password and tap Log In ."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . It's in the bottom right corner of the screen (iPhone) or the top right corner of the screen (Android)."
    },
    {
      "title": "Scroll down and tap Settings.",
      "content": "Scroll down and tap Settings . It's at the bottom of the page. [1] X Research source If you're using an Android, tap Account Settings ."
    },
    {
      "title": "Tap Account Settings.",
      "content": "Tap Account Settings . You'll see this option at the top of the pop-up menu. If you're on Android, skip this step."
    },
    {
      "title": "Tap Privacy.",
      "content": "Tap Privacy . It's near the top of the page."
    },
    {
      "title": "Tap Who can see the people, Pages and lists you follow?.",
      "content": "Tap Who can see the people, Pages and lists you follow? . This option is under the \"Who can see my stuff?\" heading at the top of the page."
    },
    {
      "title": "Tap Only Me.",
      "content": "Tap Only Me . Doing this ensures that only you will be able to see the people in your friends and followers lists."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . It's in the top right corner of the screen. If there is no Save option, tap the Back button in the top left corner of the screen."
    },
    {
      "title": "Tap Who can send you friend requests?.",
      "content": "Tap Who can send you friend requests? . It's in the middle of the page. [2] X Research source"
    },
    {
      "title": "Tap Friends of Friends.",
      "content": "Tap Friends of Friends . Selecting this option will limit the number of people who can friend you to the people who are friends of your current friends. [3] X Research source"
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save ."
    },
    {
      "title": "Tap the option at the bottom of the page.",
      "content": "Tap the option at the bottom of the page. It reads \"Do you want search engines outside of Facebook to link to your profile?\". [4] X Research source"
    },
    {
      "title": "Tap Allow search engines outside of Facebook to link to your profile.",
      "content": "Tap Allow search engines outside of Facebook to link to your profile . It's at the bottom of the page."
    },
    {
      "title": "Tap Confirm.",
      "content": "Tap Confirm . Users on Facebook will no longer be able to look you up from outside of Facebook. Additionally, now that your Facebook privacy settings have been tightened, your name will display in other users' \"Suggested Friends\" list significantly less often, and other users won't be able to view your mutual friends or list of followers."
    },
    {
      "title": "Open the Facebook website.",
      "content": "Open the Facebook website . If you're logged into Facebook, doing so will take you to the News Feed. If you aren't logged into Facebook, enter your email address (or phone number) and password in the top right corner of the page and then click Log In ."
    },
    {
      "title": "Click ▼.",
      "content": "Click ▼ . It's in the top right corner of the Facebook window."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . This option is toward the bottom of the drop-down menu."
    },
    {
      "title": "Click Privacy.",
      "content": "Click Privacy . It's on the left side of the Facebook window."
    },
    {
      "title": "Click Edit next to the \"Who can send you friend requests?\" option",
      "content": "Click Edit next to the \"Who can send you friend requests?\" option . Edit is on the right side of the window. You'll find the \"Who can send you friend requests?\" section about halfway down the Privacy page. [5] X Research source"
    },
    {
      "title": "Click the Everyone box.",
      "content": "Click the Everyone box. It should be below the \"Who can send you friend requests?\" heading."
    },
    {
      "title": "Click Friends of Friends.",
      "content": "Click Friends of Friends . Doing so will reduce the people who can request you as a friend (and, therefore, see you in the \"Suggested Friends\" menu) to people who are friends of your current Facebook friends. [6] X Research source"
    },
    {
      "title": "Click Close.",
      "content": "Click Close . It's in the top right corner of the \"Who can contact me?\" section."
    },
    {
      "title": "Click Edit to the right of the last option on this page.",
      "content": "Click Edit to the right of the last option on this page. This is the \"Do you want search engines outside of Facebook to link to your profile?\" option."
    },
    {
      "title": "Uncheck the box next to \"Allow search engines outside of Facebook to link to your profile\".",
      "content": "Uncheck the box next to \"Allow search engines outside of Facebook to link to your profile\". Doing so will ensure that people won't be able to look you up in Google, Bing, or any other search service outside of Facebook's search. [7] X Research source"
    },
    {
      "title": "Click your name tab.",
      "content": "Click your name tab. It's at the top of the Facebook page."
    },
    {
      "title": "Click Friends.",
      "content": "Click Friends . You'll find this option below and to the right of your profile picture."
    },
    {
      "title": "Click Edit Privacy.",
      "content": "Click Edit Privacy . It's in the top right corner of the list of friends. [8] X Research source"
    },
    {
      "title": "Click the box to the right of \"Friend List\".",
      "content": "Click the box to the right of \"Friend List\". It will say something like \"Public\" or \"Friends\"."
    },
    {
      "title": "Click Only Me.",
      "content": "Click Only Me . Doing so will ensure that only you can see the people in your friend list."
    },
    {
      "title": "Click the box next to \"Following\".",
      "content": "Click the box next to \"Following\". This box will also say something like \"Public\" or \"Friends\"."
    },
    {
      "title": "Click Only Me.",
      "content": "Click Only Me ."
    },
    {
      "title": "Click Done.",
      "content": "Click Done . It's at the bottom of the \"Edit Privacy\" window. Now Facebook won't display your friends list or your followers list to the public, which will prevent other users from being able to view you as a suggested friend based on mutual friends. [9] X Research source"
    }
  ]
}