{
  "url": "https://www.wikihow.com/Identify-Positive-and-Negative-Wires",
  "title": "Identifying Positive & Negative Wires: Colors & Power Types",
  "steps": [
    {
      "title": "DC (direct current) powered devices usually have 2-3 electrical wires.",
      "content": "DC (direct current) powered devices usually have 2-3 electrical wires. DC power is common in batteries, solar cells, fuel cells , and small electronics. It’s called “direct current” because the electrical current only flows in 1 direction. [1] X Research source Here’s how to tell the wire colors apart: The red wire is positive . The black wire is negative . The white wire (if present) is ground (sometimes called neutral in DC). If both wires are black but one has a white stripe, the striped wire is negative, while the plain black wire is positive."
    },
    {
      "title": "AC (alternating current) power usually has 3 or more electrical wires.",
      "content": "AC (alternating current) power usually has 3 or more electrical wires. AC power is what comes out of power outlets and ceiling light fixtures in standard home and office settings in the United States. [2] X Research source Typically, AC power handles currents of 120, 208, or 240 volts. [3] X Research source This type of wiring has multiple phases in place, but here's what you need to know: The black wire is a phase 1 “hot” wire, which means it’s a positive or live wire. This wire usually runs to the electrical outlet from the switch. The red wire is a phase 2 “hot” wire, which means it’s also a live or positive wire (but the black is the primary positive wire). The blue wire (if present) is a phase 3 “hot” wire. The white wire is neutral . Neutral is distinct from ground in AC wiring. [4] X Research source The green wire (if present) is the ground wire."
    },
    {
      "title": "The copper wire is the positive wire in a speaker.",
      "content": "The copper wire is the positive wire in a speaker . On a standard wire used for things like speakers and amps, the silver strand is the negative wire and the copper-colored strand is the positive wire . These wires are often held together by a clear casing, but you can see through that (or look at the exposed wiring on the end). [5] X Research source"
    },
    {
      "title": "Power cords",
      "content": "Power cords have hot and neutral wires rather than positive or negative. You don’t necessarily have to inspect the wire colors to tell these apart. For modern 2-strand appliance cords with 2-prong plugs, the longer prong connects to the neutral wire. [6] X Research source If you're looking at exposed wires: The neutral wire is identified by a white stripe, ribbing or white insulation . The hot (live) wire has no ribbing or stripe ; it may have black or red insulation. If the cord has a green wire (rare), it’s a ground wire."
    },
    {
      "title": "For extension cords, the ribbed wire is usually the negative wire.",
      "content": "For extension cords, the ribbed wire is usually the negative wire. If you have a wire where both sides are the same color, which is typically copper, the strand that has a grooved texture is the negative wire. Run your fingers along the wire to determine which side has the ribbing. [7] X Research source The smooth wire is the positive wire."
    },
    {
      "title": "If all else fails, use a digital multimeter to figure out which wire is which.",
      "content": "If all else fails, use a digital multimeter to figure out which wire is which. The multimeter will have 2 leads with small alligator clips on the end. Attach 1 lead to each wire. Clip the small alligator clip on the red lead to the end of 1 wire and the clip on the black lead to the end of the other. Look at the reading on the screen—you'll see a number and either a + or – sign. [8] X Research source The number is the voltage reading. The + indicates positive current. The – indicates negative current."
    }
  ]
}