{
  "url": "https://www.wikihow.com/Clear-Discord-Cache",
  "title": "5 Ways to Clear Discord Cache on Mobile & Desktop",
  "steps": [
    {
      "title": "Open Settings.",
      "content": "Open Settings. You can either swipe down from the top of your screen twice and tap the gear icon or you can tap the app icon that features a gear."
    },
    {
      "title": "Tap Apps.",
      "content": "Tap Apps . The steps will vary depending on your Android's manufacturer, but the steps are similar enough to work. For example, this might say \"Apps & notifications\" instead."
    },
    {
      "title": "Tap Discord.",
      "content": "Tap Discord . You can either enter \"Discord\" into the search bar or scroll down the alphabetical list of the apps on your phone until you find it. You may need to tap a See all link to see all your apps."
    },
    {
      "title": "Tap Storage.",
      "content": "Tap Storage . Depending on the manufacturer, this can also say \"Storage & cache\" instead. You may need to scroll down the page to see it."
    },
    {
      "title": "Tap Clear cache.",
      "content": "Tap Clear cache . It's either in the bottom right corner with an icon of a painter's brush with stars on it, or in the middle of your screen next to a trashcan icon."
    },
    {
      "title": "Open the Discord app and tap on your profile picture.",
      "content": "Open the Discord app and tap on your profile picture. This will pull up your profile information."
    },
    {
      "title": "Tap the cog icon.",
      "content": "Tap the cog icon. You can find this in the top-right corner."
    },
    {
      "title": "Scroll down to \"App Settings\" and tap Advanced.",
      "content": "Scroll down to \"App Settings\" and tap Advanced . While you could previously only delete your app cache by deleting or offloading the app, you can now delete the cache by enabling developer mode."
    },
    {
      "title": "Toggle on \"Developer Mode.\"",
      "content": "Toggle on \"Developer Mode.\" Developer Mode allows you to do a number of things with the Discord app, including delete your app cache easily within the app."
    },
    {
      "title": "Click the back arrow in the top left and scroll to the bottom of the screen.",
      "content": "Click the back arrow in the top left and scroll to the bottom of the screen. Discord's developer settings are at the bottom of the Settings screen."
    },
    {
      "title": "Tap Clear caches.",
      "content": "Tap Clear caches . There won't be any confirmation screen when you select this option. If you want to ensure your cache is 100% cleared for Discord, consider offloading or reinstalling the app."
    },
    {
      "title": "Open Settings.",
      "content": "Open Settings. Tap the app icon that features gears on a grey background. While you can now clear the Discord app's cache with developer mode on, you can still do so by offloading or deleting the app. Offloading the app will delete temporarily files (like cached files) but keep app data, which makes reinstalling Discord easy."
    },
    {
      "title": "Tap General.",
      "content": "Tap General . It's the first option in the third grouping of menu items next to an icon of a gear."
    },
    {
      "title": "Tap iPhone Storage.",
      "content": "Tap iPhone Storage . If you're using an iPad, this will say \"iPad Storage\" instead."
    },
    {
      "title": "Tap Discord.",
      "content": "Tap Discord . You'll see more information about Discord, such as the app size and how much space it's using."
    },
    {
      "title": "Tap Offload App.",
      "content": "Tap Offload App . This will clear the cache and delete temporary files, but maintain your data so reinstalling the app is easier. Tap Delete App if you want to permanently delete all your data associated with that app. You can always install the app again from the App Store, but your data will not be included in that download."
    },
    {
      "title": "Open Search.",
      "content": "Open Search. Before you proceed, make sure that Discord is closed and no longer running . You can open Search by pressing the Win key on your keyboard and wait for the Start menu to open."
    },
    {
      "title": "Search for %appdata%.",
      "content": "Search for %appdata% . You will automatically be taken to the Roaming folder inside the AppData folder."
    },
    {
      "title": "Open the discord folder.",
      "content": "Open the discord folder. If you're not in the Roaming folder, navigate to AppData > Roaming > discord ."
    },
    {
      "title": "Delete the Cache, Code Cache, and GPUCache folders.",
      "content": "Delete the Cache , Code Cache , and GPUCache folders. To delete folders you can either right-click them and click Delete , select them and press Delete on your keyboard, or drag and drop them into the Recycle Bin on your Desktop. By deleting these folders, you're also deleting the temporary files inside them. Don't worry about breaking Discord! The program will make these folders again the next time you open the app on your computer."
    },
    {
      "title": "Open Finder and select Go.",
      "content": "Open Finder and select Go . Delete the cache files from Application Support in Finder."
    },
    {
      "title": "Select Go to Folder.",
      "content": "Select Go to Folder . You can also press Shift + Cmd + G instead."
    },
    {
      "title": "Enter the following destination:",
      "content": "Enter the following destination: ~/Library/Application Support/discord . After you've entered that, press ' Return on your keyboard."
    },
    {
      "title": "Delete the Cache, Code Cache, and GPUCache folders.",
      "content": "Delete the Cache , Code Cache , and GPUCache folders. To delete folders , you can either right-click them and click Move to Trash , or drag and drop them to the Trash on your Dock. By deleting these folders, you're also deleting the temporary files inside them. Discord will make empty versions of these folders the next time you open the app on your computer."
    }
  ]
}