{
  "url": "https://www.wikihow.com/Glue-Rocks-Together-for-Landscaping",
  "title": "How to Glue Rocks Together for Landscaping: The Best Glue to Use & More",
  "steps": [
    {
      "title": "Clean the rocks and allow them to dry.",
      "content": "Clean the rocks and allow them to dry. Brush off any surface dirt and debris with a broom or stiff brush. If you don’t need to complete the job immediately, follow up by rinsing the rocks with a garden hose and letting them dry fully. It may take up to several hours, but waiting for the rocks to dry ensures better adhesion with the construction adhesive. [1] X Research source Note: If you’d prefer to use mortar instead of construction adhesive, allow the rocks to remain damp and skip ahead to the last step in this section."
    },
    {
      "title": "Apply a thick bead of construction adhesive to one of the rocks.",
      "content": "Apply a thick bead of construction adhesive to one of the rocks. Load the tube into a caulking gun , cut off the pointed tip, and squeeze the caulking gun’s trigger to release a thick bead of adhesive. Apply it in a serpentine (back and forth) pattern across the gluing surface on one of the rocks. [2] X Research source For the best results, choose a construction adhesive that is specifically designed for masonry applications."
    },
    {
      "title": "Press and secure the second rock firmly in place.",
      "content": "Press and secure the second rock firmly in place. Set the second rock straight down into the construction adhesive, giving it only a slight wiggle to help nestle it into place. Don’t spin or slide the second rock in an attempt to spread out the adhesive. Press the rocks together for around 30-60 seconds, then, if needed, use a material like wire, rope, or tape to hold the rocks in position while the adhesive dries and cures. [3] X Research source Check the product instructions for recommended drying times."
    },
    {
      "title": "Use mortar as an alternative adhesive for larger rocks.",
      "content": "Use mortar as an alternative adhesive for larger rocks. Mortar is another great choice for bigger stones—if you don’t mind being able to see what’s holding them together. Here’s a quick rundown of the process: [4] X Research source While both stones are still damp, stir together the mortar mix and water according to the package instructions until you’ve created a medium-thick paste. Use a trowel to apply a roughly 1 in (25 mm) bed of mortar to one of the stones. Nestle the other stone into the mortar, wiggling it slightly, and support the stones with wire, rope, or tape while the mortar cures. Consult the mortar mix package for curing times."
    },
    {
      "title": "Rough up smooth stones with sandpaper.",
      "content": "Rough up smooth stones with sandpaper. The more smooth and polished the rocks are, the more helpful it’ll be to scuff them up a little bit. Grab a piece of coarse-grit sandpaper and rub it back and forth over the areas where the rocks will be glued together, just enough to lightly etch the surface. [5] X Research source You can skip this step if the rocks already have a rough surface."
    },
    {
      "title": "Clean dirt and debris off the rocks.",
      "content": "Clean dirt and debris off the rocks. Knock loose any surface dirt with a stiff brush, then use water to clean off any remaining dust and debris from the surface. Allow the rocks the dry completely before proceeding. [6] X Research source If you choose to use soapy water, rinse the rocks thoroughly to get rid of soap residue."
    },
    {
      "title": "Apply the epoxy resin or epoxy putty according to its product guide.",
      "content": "Apply the epoxy resin or epoxy putty according to its product guide. Two-part epoxy adhesives come in two forms—thick liquid resin and clay-like putty. You can use either type, but resin may be better for flat rocks and the putty for uneven rocks. Here’s the process for each: Epoxy Resin: Mix the two liquid components in a disposable container with a wooden stirring stick, then apply it right away to one of the stones. Hold the stones together for at least 30 seconds while the epoxy resin cures. Epoxy Putty: Knead the two components together by hand until the separate colors have been thoroughly combined into a new color. Press a medium-thick layer of putty onto one of the stones, then press the other stone in place for at least 30 seconds. [7] X Research source"
    },
    {
      "title": "Keep supporting the stones until the adhesive fully cures.",
      "content": "Keep supporting the stones until the adhesive fully cures. Depending on the size and shape of the rocks, use tape, rubber bands, metal wire, or clamps to hold the stones securely in place for one hour to several hours, according to the product instructions. Don’t try to move or reposition the rocks once the adhesive has begun to set up."
    },
    {
      "title": "Rinse off the rocks and wait until they’re partly dry.",
      "content": "Rinse off the rocks and wait until they’re partly dry. Make sure to remove any surface dirt and debris from the rocks to promote good adhesion. If the rocks are still damp the super glue will set up even faster than normal, but it will still work plenty quickly if the rocks are completely dry. [8] X Research source"
    },
    {
      "title": "Squeeze a small dab of glue on each rock surface.",
      "content": "Squeeze a small dab of glue on each rock surface. A gel-like super glue is usually easier to work with on rocks, but the classic liquid super glue will do the job as well. Squeeze out just a dot of glue onto each rock where they will meet. Applying too much glue won’t make the bond any stronger—but it very well might make a stick mess! [9] X Research source For the best results, pick out a super glue that’s specifically designed for exterior use. Wear disposable gloves to keep the glue off of your skin."
    },
    {
      "title": "Press the rocks together for roughly 30 seconds until the glue sets.",
      "content": "Press the rocks together for roughly 30 seconds until the glue sets. Super glue sets up fast! If the rocks are damp, it may only take 15 seconds; if they’re dry, expect more like 30-45 seconds. Keep pressing the rocks together firmly throughout this quick drying time. Use tape to hold the rocks in position for an hour or more while the glue cures. [10] X Research source Check the product instructions for specific drying and curing times."
    },
    {
      "title": "Clean the pea gravel thoroughly.",
      "content": "Clean the pea gravel thoroughly. Pick out any leaves, twigs, and other debris, then use a hose to wash away surface dirt. Alternatively, for pristine results, remove the existing gravel and apply new bagged (fully cleaned) pea gravel in the 1 ⁄ 10 to 1 ⁄ 4 in (2.5 to 6.4 mm) diameter range. [11] X Research source Bonding agents work best on pea gravel beds that are approximately 1 in (25 mm) deep, but they can be applied to deeper beds as well. If you’re pouring new pea gravel, lay down landscaping fabric first."
    },
    {
      "title": "Smooth out and level the gravel.",
      "content": "Smooth out and level the gravel. Use the flat side of a garden rake to create a smooth, even surface along the top of the pea gravel. If it’s a larger area, work from the middle out so your footsteps don’t cause new indentations. [12] X Research source"
    },
    {
      "title": "Use a watering can to apply the bonding liquid.",
      "content": "Use a watering can to apply the bonding liquid. Pour the liquid resin into a watering can, then immediately start sprinkling it over the pea gravel. Aim to only lightly moisten the entire surface of the gravel with the bonding liquid. Adding too little now and having to make another pass later is better than over-saturating the gravel. [13] X Research source Depending on the thickness of the bonding liquid, you may have to drill bigger holes into your watering can’s spout. Refer to the product instructions."
    },
    {
      "title": "Keep the gravel dry and undisturbed during the curing time.",
      "content": "Keep the gravel dry and undisturbed during the curing time. Most products of this type take about 24 hours to cure. It’s important to keep the pea gravel dry and undisturbed during this time, so make sure there’s no rain in the forecast before starting the project! [14] X Research source"
    },
    {
      "title": "Construction Adhesive:",
      "content": "Construction Adhesive: Choose a construction adhesive that’s specifically designed for exterior masonry and stone. It comes in a tube that you load into a caulking gun. [15] X Research source Pros: Construction adhesive is affordable and easy to use. Also, since it retains some elasticity after curing, it can stand up to some twisting or shifting of the rocks. Cons: The adhesive usually remains visible between the rocks. Also, even construction adhesives that are designed for exterior masonry and stone tend to degrade over time due to moisture and other extreme conditions."
    },
    {
      "title": "Epoxy Resin:",
      "content": "Epoxy Resin: Epoxy resin comes in two parts—the resin and a hardener—that you stir together to activate the adhesive. Once activated, the epoxy resin hardens and cures quickly. Pros: Epoxy resin creates a strong hold quickly and stands up well to temperature extremes. It’s also mostly translucent once it fully cures. Cons: As a semi-thick liquid, it can be messy to apply. Because it’s very hard and rigid once it cures, it’s also susceptible to snapping apart despite its adhesion strength."
    },
    {
      "title": "Epoxy Putty:",
      "content": "Epoxy Putty: While epoxy resin requires you to stir together two liquids, with epoxy putty you’ll have to knead together two sticks of material that are similar to modeling clay. [16] X Research source Pros: Because it’s thick and pliable when first mixed, it’s great for sticking together rocks that aren’t smooth and flat. It also hardens and cures quickly and is very resistant to heat and cold. Cons: Since it becomes so rock-hard and inflexible once it cures, epoxy putty may not stand up well to freeze-thaw cycles or other outdoor conditions that cause the rocks to shift or twist."
    },
    {
      "title": "Super Glue:",
      "content": "Super Glue: Whether it’s the classic thin liquid or a thicker formulation, super glue adheres quickly and creates a strong bond. Make sure to choose a super glue that’s recommended for outdoor use. Pros: It’s fairly inexpensive, works quickly, and is practically invisible once it dries. Cons: It may not stand up as well to outdoor conditions as compared to epoxy, construction adhesive, or mortar. Also, it only works well if you’re gluing a flat rock surface to another flat rock surface."
    },
    {
      "title": "Mortar:",
      "content": "Mortar: Masonry mortar is made by stirring together the cement mix with water according to the product instructions. It can be used to create a durable and high-visibility bond between landscaping rocks. [17] X Research source Pros: Masonry mortar is inexpensive and easy to mix and apply. It usually stands up well to outdoor conditions. Cons: Mortar can take several days to fully cure, so it’s a longer process than other adhesives. It’s also very noticeable between the rocks, which may or may not be the look you’re going for."
    }
  ]
}