{
  "url": "https://www.wikihow.com/Put-Money-on-Steam",
  "title": "How to Put Money on Steam",
  "steps": [
    {
      "title": "Go to https://store.steampowered.com/ or open the app.",
      "content": "Go to https://store.steampowered.com/ or open the app. You can access the website from your computer, phone, or tablet, but the app is a desktop app. You can also use the mobile app. Login if prompted. If you're using a device that hasn't accessed your Steam account before, you may need to allow your device access to your account with your email."
    },
    {
      "title": "Click your username.",
      "content": "Click your username. You'll see this in the top right corner of the app or page. A menu will drop-down."
    },
    {
      "title": "Click Account details.",
      "content": "Click Account details . You'll be redirected to your account information."
    },
    {
      "title": "Click Add funds to your Steam Wallet.",
      "content": "Click Add funds to your Steam Wallet . You'll see this in the first boxed panel titled \"Store & Purchase History\" above your current Steam Wallet balance."
    },
    {
      "title": "Click Add funds next to the currency you want.",
      "content": "Click Add funds next to the currency you want. You can choose to add $5, $10, $25, $50, or $100 to your Steam Wallet. [1] X Research source You can also choose to Redeem a Steam Gift Card or Wallet Code ."
    },
    {
      "title": "Confirm your Steam account.",
      "content": "Confirm your Steam account. You'll need to sign in again with your Steam username and password."
    },
    {
      "title": "Select your payment type.",
      "content": "Select your payment type. You can pick PayPal, Visa, MasterCard, American Express, Discover, and JCB from the drop-down list. If you selected a credit/debit card, you'll need to enter the card's information such as the card number, security code, expiration date, and billing information."
    },
    {
      "title": "Click Continue to proceed.",
      "content": "Click Continue to proceed. You'll be taken to a detailed receipt of your order."
    },
    {
      "title": "Review your order and click to select the box next to \"I agree.",
      "content": "Review your order and click to select the box next to \"I agree. \" Make sure your account information is correct as well as the funds and the bank account."
    },
    {
      "title": "Click Purchase.",
      "content": "Click Purchase . You'll get an email to confirm the purchase. If you don't see the money in your account in two hours, check to make sure you got the confirmation email or restart your Steam app. You can contact customer service for more help at https://support.steampowered.com/kb_article.php?ref=1223-QROC-4460 ."
    }
  ]
}