{
  "url": "https://www.wikihow.com/Lose-Weight-Without-Going-to-the-Gym",
  "title": "How to Lose Weight Without Going to the Gym",
  "steps": [
    {
      "title": "Eat high protein, high fiber breakfast every morning.",
      "content": "Eat high protein, high fiber breakfast every morning. Eating breakfast is an important part of weight loss. Studies have shown that regular consumption of a high protein, high fiber breakfast can help you stay satisfied longer and decrease hunger cravings during the day. [3] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 24 April 2020. Fiber not only adds filling bulk to your meals, but also has been shown to prevent constipation and certain cancers like colon and rectal cancer. Starting out your day with a fiber-rich breakfast can help you reach your daily goal of 25 g for women and 38 g for men. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Examples of breakfast meals include: scrambled eggs with sautéed vegetables and 2 ounces of lean sausage, 1 cup of low-fat greek yogurt with fruit and nuts or an omelet with spinach and bacon and a glass of milk or milk substitute."
    },
    {
      "title": "Eat mostly lean protein, fruits and vegetables for every meal.",
      "content": "Eat mostly lean protein, fruits and vegetables for every meal. [5] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 24 April 2020. Studies show that one of the best diets for weight loss is a moderate to low-carb diet that emphasizes lean protein and includes lots of fruits and vegetables. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try to make most of your meals and snacks protein, fruits and vegetables. Focusing on these food groups will help you minimize the amount of carbohydrate-rich foods you consume. Make sure you include healthy fats (monounsaturated and polyunsaturated) as well, as they are an essential part of your diet, too. [7] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 24 April 2020. Examples of meals include: grilled chicken and vegetable stir fry, lettuce wrap with low-fat cheese and lean deli meat, grilled salmon with steamed vegetables, or a sliced apple with low-fat cheese. Try a big salad with tuna fish, or egg salad, or a chef salad. Minimize carbohydrate-rich foods when you can. Items like bread, rice, pasta, bagels, crackers, chips and couscous are higher in carbohydrates compared with other food groups. Although these can be part of a healthy diet, limiting your intake may help speed weight loss. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Avoid mindless snacking.",
      "content": "Avoid mindless snacking. Snacking or grazing throughout the day or late at night can sabotage weight loss. While planned, healthy snacking can support weight loss, mindless eating or grazing can counteract it. [9] X Research source Mindless eating and snacking is when you're consuming food and not realizing how much you're consuming or what you're consuming. This may happen out of boredom when you're watching TV, driving or doing work at home. When you're not aware of how much you're eating, you're more likely to overeat. If you are mildly dehydrated, your brain may confuse a need for water with hunger. Avoid this by making sure you drink plenty of fluids throughout the day. Aim for eight 8-ounce glasses (2 liters) every day. If you feel like you need to snack, make your snack planned and mindful. Sit down, portion out your food, consume it and then move on with your daily activities. Try to avoid eating from the box, bag or package. It's tough to know how much you've consumed. Also try to minimize other distractions while you're eating — like watching TV, doing work or checking emails. Focus on your snack."
    },
    {
      "title": "Don't drink your calories.",
      "content": "Don't drink your calories. One common cause of weight gain is the consumption of calorie-filled or sugary beverages. [10] X Research source Ditch the sweetened drinks and consume clear, sugar-free, hydrating fluids instead. One danger of drinking calories is that you don't necessarily feel full or satisfied after consuming that beverage. You're more likely to eat your normal calorie intake in addition to the calories from your sweetened beverages. [11] X Research source Aim for adequate fluids from drinks like: water, sugar-free flavored water, decaf black coffee or decaf tea."
    },
    {
      "title": "Avoid regular indulgences.",
      "content": "Avoid regular indulgences. A sweet treat, a glass of wine or sweetened coffee drink are types of treats that should be watched when you're trying to lose weight. Little items like these, over time, can slow or even stop your weight loss. [12] X Expert Source Pouya Shafipour, MD, MS Board Certified Family Medicine Specialist Expert Interview. 24 April 2020. Limit treats as much as possible. This is important for weight loss when you're not planning on exercising often or strenuously. You will not be burning enough calories through physical activity to cover a lot of indulgences. If you're really craving a treat, calculate how you can fit that treat in with your desired caloric goals each day. If you can have a smaller lunch or skip a snack (but never skip a meal) and stay within your daily calorie goal, it's appropriate to have the treat. Use your favorite treats as a reward for maintaining your diet!"
    },
    {
      "title": "Go to bed at a set time.",
      "content": "Go to bed at a set time. Sleeping is crucial for your overall health, but even more so for weight loss and maintenance. Studies have shown that decreased sleep affects your body's hunger hormones — increasing your cravings and hunger the next day. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Aim for between seven and nine hours of sleep each night. This is a general recommendation and should be an appropriate amount of rest for most healthy adults. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source To help you get to sleep and sleep soundly, practice good sleep hygiene. This includes turning off all lights and electronic devices. It's also recommended to stop using bright, stimulating devices — such as smartphones, tablets, TV, and laptops — about 30 minutes prior to trying to fall asleep."
    },
    {
      "title": "Start a food journal.",
      "content": "Start a food journal . Journaling has been shown to be very effective for weight loss. You can track a variety of items (like calories, activity level, hydration, sleep, etc.) to help keep you on track. The more accurate your journal, the more likely you are to be successful. It's easier now than ever to keep a food diary — download an app like MyFitnessPal onto your smartphone and use it to log your food. [15] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source One thing to keep track of is your food and beverage intake. Food journals can provide you insight into your diet and what may or may not be working for your weight loss plan. Food journals can also help keep you accountable. In addition, you can also track your progress in your journal or on your app. That might be weight, pants or dress size and what physical fitness progress you have made. Those that keep track of their weight regularly are also more successful long-term."
    },
    {
      "title": "Get support.",
      "content": "Get support. Weight loss can be difficult — especially if you've been trying or plan on trying to lose weight for a long time. Finding a support group can help build your confidence, keep you motivated and help your success long-term. [16] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Ask friends or family members if they'd like to join you on your weight loss plan. You can plan meals together or find fun, physically active things to do together. You're more likely to stick to your plan if you're doing it with a friend. Consider joining online groups or forums of others who are trying to lose weight. There are a variety of people who do not like or cannot be physically active but are still trying to lose weight."
    },
    {
      "title": "Use exercise DVDs or online videos.",
      "content": "Use exercise DVDs or online videos. If going to the gym or going for a walk or jog isn't enjoyable, try using online videos or exercise DVDs to help you get in some physical activity. Both of these options are fairly low-cost or even free and are available in a variety of skill levels to meet your needs. Research some exercise DVDs or online videos to see what ones might be fun, geared to your fitness level and whether or not they require extra equipment."
    },
    {
      "title": "Do bodyweight exercises.",
      "content": "Do bodyweight exercises. Strength training, toning and building muscle can also be done at home. You don't need special machines or weights to perform many of these exercises. Incorporate bodyweight exercises for simple strength training at home. You can try: pushups , sit-ups , tricep dips , lunges or planks. You can also use household items for weights. Try using a water battle, canned beans or a gallon jug filled with water. Use these items when you're doing exercises like bicep curls or lateral raises. You may also want to consider purchasing a set of inexpensive free weights or resistance bands so you can do a larger variety of activities at home. Aim to do about 20 minutes of strength training two to three times weekly."
    },
    {
      "title": "Go for free cardio.",
      "content": "Go for free cardio. There are a variety of cardiovascular exercises that you can do at home or in your local community. [17] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Many are low cost or are free and do not require you to go to a gym to perform. Go for a walk or jog outside in your neighborhood, outdoor track or park. Enjoy the outdoors while you workout. If the weather is bad or you don't have a safe area to walk, try walking loops in the mall. You can also go for a bike ride in your neighborhood or take your bike to a scenic trail."
    },
    {
      "title": "Increase your daily steps.",
      "content": "Increase your daily steps. If you don't have time or don't enjoy planned physical activity, try increasing the amount of steps you take each day. The more you move throughout the day, the more calories you'll burn. Think about different ways you could add more steps to your day. You could park farther away, walk the long way to your destination, or take the stairs instead of the elevator. Also consider moving more. For example, you could do leg raises during TV commercial breaks or do sitting leg lifts while you're sitting at your desk."
    }
  ]
}