{
  "url": "https://www.wikihow.com/Draw-a-Tree-House",
  "title": "How to Draw a Tree House",
  "steps": [
    {
      "title": "Decide on some basic design elements.",
      "content": "Decide on some basic design elements. There are many different things to consider when it comes to trees and tree houses. Consider the following to come up with the variables of the drawing: What kind of tree is it? How big do you want the tree? What is the appearance of the tree? What does the tree house look like? What is the tree house made of? How do people get to the tree house? Do they use a ladder? Climb the tree?"
    },
    {
      "title": "Draw the tree",
      "content": "Draw the tree . Depending on the tree that you've selected, there will be different ways of drawing the tree. Start with the large overall shape, fill in the branches where they are visible, and draw in the sky holes. Keep in mind that we do not see individual leaves from afar, so draw the leaves as masses. If the tree is older, it's likely to be taller, have more branches, and have a thicker trunk. Younger trees are notably difficult to climb due to their lack of branches and thin trunks. Make sure that the tree looks like it could support the tree house! If the tree house is resting on the fork of two thin branches, anyone who climbs into it is going to go crashing to the ground."
    },
    {
      "title": "Draw the tree house.",
      "content": "Draw the tree house. There are many different styles of tree houses and they can be located in different spots. What do you want your tree house to look like? Make sure that the tree house would be steady in its location. It can't be simply resting on one branch, as walking to the sides of the house would cause it to fall out of the tree. Try resting it across two thick branches or nailing it to the tree. Tree houses without roofs are commonly seen to be platforms with a fencing around them. However, these don't last very well in rainy environments, as the planks for the floor rot easily when they're wet. If the tree house has a roof, the most common type of build is simply a box with holes in it for doors and windows. However, there are different builds available. Look online for inspiration"
    },
    {
      "title": "Add details.",
      "content": "Add details. Does a branch hang into a window of the tree house? Do the owners of the tree house have toys stashed in it? Are there branches leading up to the tree house that permit someone to climb up quickly?"
    },
    {
      "title": "Color.",
      "content": "Color. Color the tree, the leaves, and the tree house. It should stick to a color scheme of being brown and green, although if it's set around the autumn seasons, coloring the leaves with reds, oranges and yellows will work fine."
    }
  ]
}