{
  "url": "https://www.wikihow.com/If-They-Wanted-to-They-Would",
  "title": "What Does “If They Wanted to, They Would” Mean and Is It True?",
  "steps": [
    {
      "title": "“If they wanted to they would” means that someone would make time for you or a relationship with you if they really wanted to.",
      "content": "“If they wanted to they would” means that someone would make time for you or a relationship with you if they really wanted to. If a person doesn’t make time for someone they’re dating or make an effort to meet that person’s expectations, it’s simply because they don’t want to. [1] X Research source For example, let’s say a man is interested in a woman but has a hectic schedule at work. According to the “if they wanted to, they would” philosophy, that man will figure out a way to make the relationship work and show the woman that he cares. If the man lets go of the potential relationship or puts in very little effort to maintain it, however, this is a sign that the relationship (or the person) isn’t a huge priority for him. While this phrase typically applies to dating and romantic relationships, it could also apply to one-sided or distant friendships."
    },
    {
      "title": "This dating advice can come off as overly cruel or harsh.",
      "content": "This dating advice can come off as overly cruel or harsh. While someone may say this phrase to make you feel better, it can feel a bit blunt in the aftermath of a breakup or ghosting. If you have real feelings for someone and that person starts pulling away from you, it may just make things worse to hear that it’s because they didn’t want you in the first place. Sometimes it’s easier to attribute someone’s distance or avoidant behavior to other things going on in their life rather than thinking it’s just because they didn’t want you badly enough to put in the effort. If you’re presently in a relationship and tend toward an anxious attachment style, seeing this advice may make you overthink your partner’s behavior. You may perceive every unavailable evening or one-word text as evidence that your partner doesn’t actually want to see or talk to you. Despite its helpful intent, this blunt advice may cause more harm than good."
    },
    {
      "title": "The phrase generalizes relationships without considering emotional reasons.",
      "content": "The phrase generalizes relationships without considering emotional reasons. There may be a genuine reason that someone isn’t putting energy into a romantic relationship that has absolutely nothing to do with the other person. Wanting something and not wanting something are not binary opposites; they come with a myriad of complex factors that affect how we act on our desires and relate to others, including attachment style, relationship trauma, and societal pressure. For example, someone may pull away because: [2] X Research source They recently went through a breakup and aren’t ready to move on. They recognize that they have work to do on themselves before getting into something new. They don’t want a relationship at this present moment. They’re afraid of being rejected or getting hurt. They have low self-confidence, which makes them hesitant to put themselves out there. They don’t want to appear over-eager or desperate. They’re struggling with their mental or physical health. Ask yourself whether you have always operated directly from what you want in your life. Were there opportunities and people you were interested in that you stepped away for emotional reasons, rather than for a lack of wanting?"
    },
    {
      "title": "“If they wanted to, they would” ignores all of the “life stuff” that gets in the way.",
      "content": "“If they wanted to, they would” ignores all of the “life stuff” that gets in the way. Sometimes, people are busy, and things do come up! A phone battery can die, work obligations can become overwhelming, childcare can be hard to find, family members can become sick, the person themselves can become physically or mentally unwell…the list goes on! These issues have nothing to do with you, but they prevent someone from placing a high priority on your blossoming relationship. [3] X Research source It’s easy to say that sending a quick text only takes a second, but we all know that that’s not always true. Some people have a lot of anxiety around texting first for fear of being rejected or wanting to be perceived as “playing it cool.” When you’re under a lot of stress, sending a text (especially an emotionally weighty one) can feel like a lot more effort than it is."
    },
    {
      "title": "“If they wanted to, they would” disrespect your partner’s needs and boundaries.",
      "content": "“If they wanted to, they would” disrespect your partner’s needs and boundaries. Some people argue that “if they wanted to, they would” implies that your partner’s top priority should be pleasing you. While your partner should put in effort to maintain your happiness, that’s a two-way street. [4] X Research source Always expecting a significant other to cater to your needs and desires is not a good way to build a long-term relationship In some ways, this phrase may cross your partner’s boundaries, especially when spewed by social media users who don’t know you or your relationship. The people doling out this advice don’t know your or your partner’s history. They don’t know the complexities of your relationship or your strengths and weaknesses as human beings. That’s not to say that this is always bad advice—but you should take it with a grain of salt and place it in the context of your partner’s needs and experiences."
    },
    {
      "title": "The phrase may set you up for disappointment if used improperly.",
      "content": "The phrase may set you up for disappointment if used improperly. It’s great to have expectations for how you want friends and romantic partners to treat you. However, it’s also important not to have those expectations set so high that they’re practically unattainable. [5] X Research source If you’re applying “if they wanted to, they would” to super lofty expectations, you’re setting them up for failure and yourself up for disappointment. This phrase may be most useful when applied to “bare minimum” expectations. You may not be able to expect your partner to take you on week-long tropical vacations twice a year. But, you absolutely can expect your partner to respect your time and make an effort with your friends and family."
    },
    {
      "title": "The better advice may be “if they could, they would.”",
      "content": "The better advice may be “if they could , they would.” The “if they wanted to, they would” advice can help if someone needs a blunt way to stop overthinking why someone treated them how they did. However, it doesn’t allow for all the reasons that someone may feel like they can’t give a relationship the energy it deserves—even if they want to. Shifting this phrase to “if they could, they would” allows space for all the emotional, physical, and logistical reasons that someone may bow out of a relationship. It doesn’t place blame on either person in a relationship and allows both individuals to move on."
    },
    {
      "title": "“If they wanted to, they would” can help you recognize when someone isn’t worth your time.",
      "content": "“If they wanted to, they would” can help you recognize when someone isn’t worth your time. Supporters of this phrase argue that it can help you realize when it’s time to cut someone off. Rather than making excuses for someone’s poor behavior, it may help to acknowledge that they would do better if they wanted to. If someone isn’t matching your energy and efforts or is treating you like an option (rather than a priority), it may be time to head for the door. [6] X Research source In some ways, saying “if they wanted to, they would” is a way to assign blame to the other person rather than yourself. The issue isn’t that you’re not deserving of their efforts but that they don’t care enough to give you what you deserve. Of course, everyone has traits and life events that may prevent them from showing up for you 100% of the time. Instead of holding someone to the expectation of always going above and beyond for you, look for patterns of behavior. Dropping the ball once or twice is normal, but your partner should, more often than not, make time for you and seem excited to see you. If you frequently feel like someone isn’t consistently showing you their interest, they may not be fully invested in the relationship."
    },
    {
      "title": "This phrase can give you hope that there is something better out there.",
      "content": "This phrase can give you hope that there is something better out there. Alongside the videos of dating influencers encouraging people to leave partners who aren’t putting in the work, there’s an equal amount of videos highlighting what life is like once you’ve found the person who wanted to (and did). For example, someone may post about things that their current partner does that their previous one did not. Maybe they compared an old partner’s failure to remember their birthday to their current partner’s dedication to planning a special birthday bash every year. The message behind these posts is that there is someone out there who’s willing to give you what you need without you having to ask for it."
    },
    {
      "title": "The phrase offers a hard hit of reality that’s sometimes needed in dating.",
      "content": "The phrase offers a hard hit of reality that’s sometimes needed in dating. If you’re struggling through a one-sided relationship or have just ended one, it can be easy to get lost in dissecting the relationship's demise. Sometimes, you do need a cold dose of reality, which is where “if they wanted to, they would” come in. [7] X Research source This phrase may come in handy when you’re constantly asking yourself why a certain person didn’t show up for you—why did they lose interest? Why did they start to distance themselves? Why did they ghost you? “If they wanted to, they would” offer an easy response to this question; if they wanted to be in a relationship with you, they would be, and that's the only answer you need."
    },
    {
      "title": "Look for repeated patterns of behavior.",
      "content": "Look for repeated patterns of behavior. Effort in a relationship isn’t always going to be split exactly 50-50, and your partner putting in less effort once or twice doesn’t mean they don’t love you. However, reciprocity over time is important. Otherwise, one person will always feel like they’re doing more than the other. Look for consistent signs that you may be in a one-sided relationship, such as: [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Your partner never calls you back or initiates plans to hang out. You feel exhausted and drained by the relationship. Your partner’s behavior and lack of effort are making you question your self-worth. You feel like you don’t have a meaningful, authentic connection. Your partner never sacrifices anything important to them for you. You’re always the one apologizing or making changes to your behavior. You make all the big decisions and plans. You make a lot of excuses to friends (and to yourself) for your partner’s actions."
    },
    {
      "title": "Talk to your significant other about how you’re feeling.",
      "content": "Talk to your significant other about how you’re feeling. If you feel like your partner or someone you’re dating isn’t giving 100% to the relationship, ask them why! They may have a genuine reason why they’re not giving you what you need right now. Maybe they don’t even know that they’re doing something to make you feel hurt, so having this conversation could help change that behavior. [9] X Research source Ask your partner if they can make certain changes or try to be more considerate of your needs. You may say something like, “Would it be okay to discuss the dynamic in our relationship? Do you have some space to hear my feelings about where we’re at?” Invite your partner to share their thoughts and exchange them equally. If it helps, add a third party or relationship counselor to help mediate the conversation."
    },
    {
      "title": "Assess whether or not the other person is willing (or able) to change.",
      "content": "Assess whether or not the other person is willing (or able) to change. After you let your partner know that you’re feeling unhappy, observe whether or not they make serious efforts to change their behavior. If your partner stonewalls you or immediately returns to their earlier behavior, they show you they can’t make the changes you asked for. If you’re mostly satisfied with the relationship or can accept the negative traits in your partner because their good ones outweigh them, you don’t have to break it off. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source However, if you’re feeling unseen or unappreciated in your relationship in a way that’s affecting your overall happiness, it may be time to leave."
    },
    {
      "title": "End the one-sided relationship if your needs aren’t met.",
      "content": "End the one-sided relationship if your needs aren’t met. Set a boundary with time constraints so that your partner understands exactly what consequences they’re facing if the behavior doesn’t change. For example, you could say, “I need to see real change in this area in the next three months, or we may need to consider whether this relationship is right for either of us.” [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source When doing the breaking-up itself, use neutral language and take responsibility for your contribution. Say something like, “I don’t feel like this relationship is healthy for either of us right now, and I think it’s best if we both move on.” Of course, you may be in a one-sided relationship that’s not an official relationship—like a situationship or talking stage. In this case, you might not need to have a big conversation. If someone isn’t putting in effort with you during the early stages, it’s okay to simply tell them you’re no longer interested and walk away."
    },
    {
      "title": "Move on from your relationship by focusing on yourself.",
      "content": "Move on from your relationship by focusing on yourself. Start by acknowledging that, while you can have empathy and love for the other person, their behavior wasn’t serving you, and the relationship wasn’t right. Sit with any big emotions that you have and let yourself feel sad, angry, and even guilty for the relationship’s end. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Reach out to friends and family to talk through the experience and your feelings about it. Focus on rebuilding your self-esteem and invest time in finding new hobbies and interests. Reflect on what you want out of your next relationship, and address any of your own attachment issues or communication styles that may have contributed to your relationship’s end. When you do get back into the dating pool, do so intentionally. Have a clear idea in your mind of what expectations you have for a relationship and what things are deal breakers."
    }
  ]
}