{
  "url": "https://www.wikihow.com/Convert-Within-Metric-Measurements",
  "title": "How to Convert Within Metric Measurements",
  "steps": [
    {
      "title": "Learn the most common metric prefixes.",
      "content": "Learn the most common metric prefixes. The metric system has a variety of units of measurement - you have probably heard of meters (which measure distance) and grams (which measure mass), etc. These base units are sometimes either too small or too large to make practical measurements. In these cases, it's necessary to use units that differ from the base units by a power of 10 - in other words, measurements that are 10 times larger or smaller, 100 times larger or smaller, and so on. In these cases, we add prefixes to the name of the unit to signify how much bigger or smaller it is than the base unit. [1] X Research source The most common of these prefixes, from \"1,000 times larger\" to \"1,000 times smaller,\" are: Kilo - 1,000 times larger Hecto - 100 times larger Deca - 10 times larger Deci - 10 times smaller Centi - 100 times smaller Milli - 1,000 times smaller A handy trick for remembering the basic metric prefixes is the mnemonic \"King Henry Died Until Drinking Chocolate Milk,\" (or, if you prefer, \"King Henry Doesn't Usually Drink Chocolate Milk\"). The first letter of each word corresponds to a basic metric prefix, in order of largest to smallest, except for the \"U\" in \"Until\", which corresponds to \"unit,\" or the metric base units (meter, liter, etc.)"
    },
    {
      "title": "List the prefixes on a line.",
      "content": "List the prefixes on a line. If you're unfamiliar with metric units, it can be helpful to list the metric prefixes on a line in order of largest to smallest. Put \"Kilo\" at the far left end of the line and \"Milli\" at the far right end. In the middle of the scale, between \"Deca\" and \"Deci,\" put the base unit of the dimension you're measuring. In other words, if you're measuring distance, write \"meter,\" if you're measuring volume, write \"liter,\" and so on. This line gives you a simple visual reference for how your units relate - whether the units you want are larger or smaller than the units you have, and how much larger or smaller they are."
    },
    {
      "title": "Determine whether the units you want are larger or smaller than the units you have.",
      "content": "Determine whether the units you want are larger or smaller than the units you have. Look at your line of prefixes. Find the prefix that corresponds with the units you took your initial measurement in. Next, find your desired units. Are they to the right or to the left of your initial units? If they are to the right, you are converting from a larger unit into a smaller one. If they are to the left, you are going from a smaller unit to a larger one. [2] X Research source For example, let's say that we want to know how long a 10-kilometer race is in centimeters. On our line of prefixes, we would see that \"centi\" is to the right of \"kilo\". Since our desired units are to the right of our initial units, we know we're converting from a large unit into a smaller unit."
    },
    {
      "title": "Determine the numerical relationship between the units you have and the units you want.",
      "content": "Determine the numerical relationship between the units you have and the units you want. Metric units of measurement differ by powers of 10 - 10, 100, 1,000, and so on. Thus, converting from one metric unit to another is always accomplished by multiplying or dividing your initial measurement by the appropriate power of ten. Look at the arrow you've drawn from the units you have - the units your measurement has been taken in - to the units you want to convert to. The number of spaces under your arrow gives the power of ten by which your two units are related. [3] X Research source For instance, in our 10-kilometer race example, we see that our arrow from \"kilo\" to \"centi\" jumps over five spaces. This means that kilometers and centimeters differ by a conversion factor of five powers of ten, also written as ten to the fifth power , 10 5 , or 10 × 10 × 10 × 10 × 10 = 100,000. In other words, centimeters are 100,000 times (or 10 5 , etc.) times smaller than kilometers. Thus, you know that there are 100,000 centimeters in 1 kilometer."
    },
    {
      "title": "For \"large to small\" conversions, multiply by the appropriate power of ten.",
      "content": "For \"large to small\" conversions, multiply by the appropriate power of ten. Converting from a large unit to a smaller unit means you should multiply your original measurement by the amount that its units differ from the desired final units. Remember that this number should be a power of ten given by the number of spaces under the arrow you drew in the steps above. [4] X Research source Sometimes, especially in schoolwork, it's not enough to simply give the correct number. You'll also be asked to show how you converted your initial unit label to its final form. In simple conversions like we're dealing with here, just label the units of your initial measurement as you normally would, then label your conversion factor with the fraction (desired units)/(units of your initial measurement). The units in the denominator will cancel with the units of your initial measurement, leaving your answer in terms of your desired units. In our 10-kilometer race example, we would simply multiply 10 (our initial measurement in kilometers) by 10 5 (or 100,000 - the number of centimeters in a kilometer). See below: 10 km × 10 5 cm/km = 10 km × 100,000 cm/km = = 1,000,000 cm. There are 1,000,000 centimeters in our 10 kilometer race."
    },
    {
      "title": "For \"small to large\" conversions, divide by the appropriate power of ten.",
      "content": "For \"small to large\" conversions, divide by the appropriate power of ten. Converting from a small unit to a larger unit is essentially the opposite process as the reverse - instead of multiplying, you'll need to divide. Take your initial measurement and divide it by the amount that its units differ from the desired final units - again, this should be a power of ten. [5] X Research source Alternatively, you can multiply by the inverse power of ten to get the same results. For example, rather than dividing your measurement by 10 3 , you would multiply it by 10 -3 . Both operations are valid and will give the same answer. Let's do an example problem. Let's say we want to covert 360 centimeters to decameters. Since \"centi\" and \"deca\" are three spaces apart on the line of prefixes, we know that decameters are 10 3 times larger than centimeters. We would convert by dividing as follows: 360 cm / (10 3 cm/dam) = 360 cm / (1,000 cm/dam) = = 0.36 dam. 360 centimeters make 0.36 decameters."
    },
    {
      "title": "Determine the direction and size of the conversion.",
      "content": "Determine the direction and size of the conversion. This quick method will allow you to simply and easily convert between metric units without having to perform any multiplication or division. To begin, all you need to know is whether you're converting from a small unit to a larger unit or vice versa, as well as the size of the conversion you're making - in other words, whether your desired units differ from your initial units by 10 1 , 10 2 , etc. [6] X Research source Both of these can be determined by counting spaces and/or drawing an arrow on a line of the metric prefixes. For example, if we want to convert from kilometers to decameters, we know that we're converting from a large unit to a small unit because we have to travel to the right along the line to get from \"kilo\" to \"deca,\" and we know that decameters are 10 2 times smaller than kilometers because \"kilo\" and \"deca\" are separated by two spaces."
    },
    {
      "title": "Move the decimal point in your measurement.",
      "content": "Move the decimal point in your measurement. Since two metric units always differ from each other by some multiple of ten, it's possible to make metric conversions simply by shifting your initial number's decimal point. When converting from a large unit to a smaller unit, shift the decimal point one digit to the right for each power of ten that your desired units differ from your initial units. When converting from a small unit to a larger unit, move the decimal place to the left. Remember that the power of ten by which your desired units differ from your initial units is given by the number of spaces apart the two units are on the line of prefixes. [7] X Research source For example, let's say that we want to convert 1 kilometer into centimeters. Since we can tell from the line of prefixes that centimeters are 10 5 times smaller than kilometers, we move the decimal point in \"1\" five spaces to the right. See below: 1.0 10.0 100.0 1,000.0 10,000.0 100,000.0. There are 100,000.0. centimeters in 1 kilometer. You may also do the reverse - move a number's decimal to the left to convert to a larger unit."
    },
    {
      "title": "Add zeroes as necessary.",
      "content": "Add zeroes as necessary. When you move a number's decimal point, be sure to add zeroes for each space that you move the decimal point beyond the available digits. For instance, when converting 1 kilometer to centimeters, the decimal point is initially to the right of the number 1, as so: 1. Moving the decimal place to the right means you must insert a zero so that the number becomes 10. [8] X Research source The same principal applies when moving a decimal point to the left - begin inserting zeroes when you move the decimal beyond the number's available digits. For instance, let's say we want to convert 1 millimeter into meters. Since meters are 10 3 times larger than millimeters, we would simply move the decimal three spaces to the left as below: 1.0 0.10 0.010. Notice that we add a zero to the left of the 1. 0.0010. We add another zero to get our final answer. There are 0.001 meters in 1 millimeter. Only add zeroes if you run out of digits when moving the decimal point. Inserting superfluous zeroes into the middle of a number can make your answer incorrect."
    }
  ]
}