{
  "url": "https://www.wikihow.com/Run-a-Mile",
  "title": "Training to Run a Mile? Try These Tips!",
  "steps": [
    {
      "title": "Warm up your muscles.",
      "content": "Warm up your muscles. You should always begin a workout by warming up your muscles. Spend 5-10 minutes stretching your muscles and then walking lightly to get the blood flowing in your muscles. Dynamic stretching, such as lunges and leg lifts, is more effective than static stretching. [1] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. Walk at a slower pace for a warm-up."
    },
    {
      "title": "Complete 20 minute cardio workouts.",
      "content": "Complete 20 minute cardio workouts. The first step to training for a mile run is to start completing 20 minute cardio workouts composed of walking and jogging. The 20 minute walk/run cardio sessions should be broken down into intervals that start with mostly walking and end up with mostly running. Try using the intervals listed here or make your own interval plan. [2] X Research source Week 1: Jog 1 minute, Walk 4 minutes, Repeat 4 times Week 2: Jog 2 minutes, Walk 3 minutes, Repeat 4 times Week 3: Jog 3 minutes, Walk 2 minutes, Repeat 4 times Week 4: Jog 4 minutes, Walk 1 minute, Repeat 4 times."
    },
    {
      "title": "Build in rest days.",
      "content": "Build in rest days. It’s important to take some days to rest your body and let your muscles recuperate from the hard work they are doing. You should aim to have 1 to 2 rest days throughout the week. For example, you can exercise Sunday, Monday, and Tuesday, rest Wednesday, exercise Thursday and Friday, and then rest on Saturday."
    },
    {
      "title": "Alternate between running and walking.",
      "content": "Alternate between running and walking. When you are first starting to run, switch between running and walking as you train. [3] X Research source Walking gives your body some time to recover from the stresses of running. As you increase your endurance, run for longer periods and walk for shorter amounts of time."
    },
    {
      "title": "Run a mile.",
      "content": "Run a mile. Use a treadmill, go to a track, or map out a trail to measure a one mile course. Run the length of the mile, keeping a steady pace. The first time you run, you shouldn’t worry about the time it takes you. Focus on running the entire mile. When starting out running a mile, begin on flat ground. Hills and uneven terrain make running more difficult. A treadmill or a standard track are great places for beginners. The cushioned surface of a track lightens the impact on a runner's joints. Visit local high schools to use the track when school is not in session."
    },
    {
      "title": "Run longer distances.",
      "content": "Run longer distances. In order to decrease the time it takes you to run one mile, try building endurance for longer distance runs. Once you are able to run one mile consistently without stopping or walking, try to increase your distance gradually to 1.5, 2, or 3 miles. Running longer distances will allow you to build endurance and increase your body's ability to run a single mile faster."
    },
    {
      "title": "Increase the speed of your mile.",
      "content": "Increase the speed of your mile. In order to complete races or competitive runs, you will want to shorten the time it takes you to run a mile. A regular running routine will help you build endurance and improve the speed of your mile. Set a specific training schedule. Stick to your schedule, and run everyday that you schedule yourself to practice. Sprint 1 lap around the track as fast as you can with a 1 minute rest time. Repeat the sprint and rest gradually decreasing the rest time between sprints."
    },
    {
      "title": "Start slow.",
      "content": "Start slow. Begin the run at a slow jog to ease yourself into running. You don't want to begin running as fast as you can or you might burn out before you finish the mile. You should be jogging at a slow and easy pace for the first minute or so of your mile."
    },
    {
      "title": "Set a target time.",
      "content": "Set a target time. Running a mile should take new runners about 10 to 12 minutes. If you are running on a standard track, try to complete the first lap in around 3 minutes. A mile is 4 laps on a standard track. [4] X Research source Completing each lap in around 3 minutes will give you a good pace for your mile."
    },
    {
      "title": "Pace yourself.",
      "content": "Pace yourself. The key to running a long distance is to pace your run so that you don't burn out before you're finished. You should run the mile at an easy speed that isn't too exhausting for you. [5] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. You should be able to keep your breathing steady throughout your entire run, so if you find yourself breathing harder, you need to slow down your pace. By running at a steady pace, you'll be able to speed up your pace slowly with each mile you run. Keep a consistent pace as you complete each of the laps around the track."
    },
    {
      "title": "Encourage yourself.",
      "content": "Encourage yourself. Saying positive affirmations to yourself while you run is a great way to stay motivated and make the run seem easier. Try thinking encouraging thoughts to yourself, or actually say them out loud. Use positive affirmations like, \"you can do it\", \"you're doing great\", \"you're amazing\", or \"you're getting so healthy\". You can also say phrases that focus on what you've accomplished like, \"you're halfway done\", \"almost to the finish line\", or \"one more quarter\"."
    },
    {
      "title": "Push yourself toward the finish.",
      "content": "Push yourself toward the finish. As you are running your fourth and final lap of your mile, try to increase your pace slightly. When you are running a mile starting slow and finishing strong and fast will allow you to use your energy most effectively. [6] X Research source Set a visual goal to run towards, such as a bench or a tree, and run faster until you reach the object. Slow down for a stretch and then pick a new visual target."
    },
    {
      "title": "Reward yourself for finishing.",
      "content": "Reward yourself for finishing. Find something to reward yourself with for accomplishing the goal of running a mile. Associating finishing the run with a reward will help you stay motivated when you want to run another mile. Consider rewards like new running clothes or accessories, a fun night out, or an item you've been wanting like a new book."
    },
    {
      "title": "Wear the appropriate attire.",
      "content": "Wear the appropriate attire. To have good technique, you need to wear the right shoes for your feet. There are different types of running shoes designed for different types of feet. For example, flat-footed runners do better with a high stability shoe, and runners with a high arch will need a cushioned shoe with midsole padding. Most runners also need a running shoe about a half size larger than their dress shoe. Go to a sports shoe store to get help picking a running shoe. You also need to wear flexible exercise clothing to run in. Clothing that is breathable will help your body cool off as you run. [7] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. Make sure your clothes are seasonally appropriate."
    },
    {
      "title": "Breathe rhythmically.",
      "content": "Breathe rhythmically. When you run you should breathe in a rhythm to help your body take full deep breaths. Try using the 2:1 breathing method to train yourself to breathe rhythmically. Breathe in for 2 strides and then breathe out for 1 stride. Continue this rhythm as you run your mile. Many people like the 2:1 stride method, but some feel more comfortable at 3:1 or another ratio. Find what works for you. [8] X Research source"
    },
    {
      "title": "Keep your upper body from twisting.",
      "content": "Keep your upper body from twisting. Many runners use up a lot of energy twisting their upper body while they run. This is energy that could help you run faster or longer, so getting rid of the habit of twisting your upper body while you run is a good idea. To do this, think of where a zipper would be on a jacket you’re wearing. The zipper creates a line down the center of your upper body. If your hands or arms cross over that line while you run, you’re twisting your upper body. [9] X Research source Hold your arms slightly wider than your hips. When you swing your arms back imagine them reaching back towards your back pocket.This will help keep your arms moving in a straight line and not across your body."
    },
    {
      "title": "Keep your shoulders back.",
      "content": "Keep your shoulders back. Standing tall with your shoulders pulled back will help you breathe deeper as you run. Deeper breaths get more oxygen into your lungs and keep you from getting tired too quickly. When you run with your shoulders pulled back, running will feel easier to you."
    },
    {
      "title": "Shorten your stride.",
      "content": "Shorten your stride. To have good running form, you need to have short, light steps that don’t have your feet extending too far from your body. Try to have your knee up at a 90 degree angle from the ground before you step your foot down. If you want to run faster, increase the amount of steps you take rather than the length of your stride. [10] X Research source"
    },
    {
      "title": "Strike the ground with your forefoot.",
      "content": "Strike the ground with your forefoot. Many beginners don’t pay attention to how their foot is hitting the ground and end up striking the ground with their heel as they run. Heel striking can lead to injuries and typically slows down a runner. [11] X Expert Source Kai Ng Certified Running Coach Expert Interview. 12 February 2021. Pay attention to what part of your foot is hitting the ground when you run. You want to aim for the middle to front of your foot. This may take some getting used to if you are naturally a heel striker."
    }
  ]
}