{
  "url": "https://www.wikihow.com/Make-Fingerless-Gloves",
  "title": "How to Make Fingerless Gloves",
  "steps": [
    {
      "title": "Find a pair of gloves.",
      "content": "Find a pair of gloves. They can be old or brand new, just as long as you're willing to re-purpose them. Old ones that have holes around the fingertips are great for this project, as they'll get a new lease on life. Gloves made from cotton, wool, angora, lambswool, cashmere are all great choices."
    },
    {
      "title": "Try the gloves on and make a mark where you'd like to the fingers to end.",
      "content": "Try the gloves on and make a mark where you'd like to the fingers to end. In most cases, you will want to cut them right at the first knuckle. Use a tailor's chalk (for dark gloves) or pen (light colors) to draw a line across your fingers."
    },
    {
      "title": "Take the gloves off and cut ¼-inch (0.64-centimeters) above your cutting line.",
      "content": "Take the gloves off and cut ¼-inch (0.64-centimeters) above your cutting line. You will be hemming your gloves so that they don't fray. Once you hem them, they will be the right length. Measure your other glove against the one you just cut, and cut that one too. This way, they will be even."
    },
    {
      "title": "Cut the thumb off.",
      "content": "Cut the thumb off. You can cut the entire thumb off, or you can cut it off at the middle. If you want to be more precise, pull the glove on, and draw a cutting line as you did with the fingers."
    },
    {
      "title": "Hem the cut edges.",
      "content": "Hem the cut edges. Working one finger at a time, fold the raw edge inward by ¼-inch (0.64-centimeter). Sew around the finger using a loose, running stitch or a hem stitch . Knot the thread, then snip the excess off. Pull the glove on before knotting the thread. This way, your finger will stretch and loosen the hem so that it fits. You can use a matching thread color or a contrasting one."
    },
    {
      "title": "Pull the glove on and make sure that it fits comfortably.",
      "content": "Pull the glove on and make sure that it fits comfortably. Make any adjustments, if necessary. Once you are happy with the fit, repeat the process for the other glove."
    },
    {
      "title": "Choose a pair of socks.",
      "content": "Choose a pair of socks. The best type of sock to work with a knee socks. Choose something with an interesting pattern that would work well for a pai of fingerless gloves, such as stripes."
    },
    {
      "title": "Cut off the entire foot part.",
      "content": "Cut off the entire foot part. This includes the heel and toes. Simply cut in a straight line just above the heel part, where the straight part of the sock begins. Discard the foot part, or save it for another project. [1] X Research source"
    },
    {
      "title": "Measure the sock against your hand.",
      "content": "Measure the sock against your hand. Place your palm and arm on top of the sock. Align the original hem with the top of your knuckles. [2] X Research source The cut hem should end somewhere along your arm. Make a mark where your thumb is. If you want the gloves to be shorter, make a mark there as well. For most people, the thumb hole will be about 2 inches (5.08 centimeters) down from the original hem. [3] X Research source"
    },
    {
      "title": "Cut a small, vertical slit for the thumb hole.",
      "content": "Cut a small, vertical slit for the thumb hole. Find where you made the thumb mark. Pinch the fabric in half horizontally, and cut a small, vertical slit. Something around ½ inch (1.27 centimeters) would be ideal. [4] X Research source Don't worry if the thumb hole looks too small. It will stretch. Remember, you can always cut it bigger. If you want shorter gloves, cut ½ inch (1.27 centimeters) above the mark that you made."
    },
    {
      "title": "Try the glove on.",
      "content": "Try the glove on. Slip your arm into the sock and poke your thumb out through the thumb hole. At this point, you can widen the thumb hole. You can also cut it into more of an oval shape."
    },
    {
      "title": "Hem the cut edge of the glove.",
      "content": "Hem the cut edge of the glove. Take the glove off. Fold the cut edge inward by ½ inch (1.27 centimeters). Secure it with pins, then sew it down using a stretch stitch or a zigzag stitch. You can also sew it by hand using a running stitch. You can use a matching thread color or a contrasting one. This step is not absolutely necessary, but it will give your glove a nicer touch."
    },
    {
      "title": "Consider hemming the thumb hole.",
      "content": "Consider hemming the thumb hole. This is not absolutely necessary, since sock material does not fray that much, but it could give your glove a nicer finish. Fold the raw edge inward by about ¼-inch (0.64-centimeter). Sew it by hand using a running stitch. You can use a matching thread color or a contrasting one."
    },
    {
      "title": "Repeat the process for the other glove.",
      "content": "Repeat the process for the other glove. Remember to try the glove on your other hand when making it. This ensures that the designs are mirrored perfectly."
    },
    {
      "title": "Make the pattern.",
      "content": "Make the pattern. Trace around your palm, wrist, and arm on a sheet of paper. Start tracing at the top of your knuckles, and finish anywhere you want on the arm. Lift away your arm. Connect the gap at the top of your tracing with a straight line. Connect the gap where your thumb is with a curved line. [5] X Research source Make sure that the thumb line curves into the tracing. Leave some space around your arm, especially if the fabric you'll be using is not stretchy."
    },
    {
      "title": "Cut the pattern out.",
      "content": "Cut the pattern out. Be sure to leave a ½-inch (1.27-centimeter) gap allowance all around the pattern. This will give you enough fabric for a ¼ to ½-inch (0.64 to 1.27-centimeter) seam allowance. [6] X Research source"
    },
    {
      "title": "Trace the pattern onto your fabric.",
      "content": "Trace the pattern onto your fabric. Stack two layers of fabric, right sides together, then pin the pattern on top. Trace around the pattern. Flip the pattern over, re-pin it, and trace around it for the other glove. [7] X Research source You can use any type of fabric you want. Fleece and t-shirt material are great choices because they don't fray."
    },
    {
      "title": "Cut the tracing out.",
      "content": "Cut the tracing out. Try to cut through both layers of fabric for each glove. This way, your pieces will be even. You do not need to add seam allowances because you already added them for your original pattern. [8] X Research source"
    },
    {
      "title": "Sew the pieces together.",
      "content": "Sew the pieces together. Pin the pieces together first. Sew up the left and right sides using a ¼-inch (0.64-centimeter) seam allowance. If your fabric is stretchy, or if you want tighter gloves, sew using a ½-inch (1.27-centimeter) seam allowance instead. Do not sew across the top or bottom edges or the thumb hole. [9] X Research source If you are sewing fleece or t-shirt material, use a stretchy stitch or a zigzag stitch."
    },
    {
      "title": "Hem the top and bottom edges.",
      "content": "Hem the top and bottom edges. Fold both of the top and bottom edges down by ½ inch (1.27 centimeters). Pin them in place, then sew the hems down. [10] X Research source You can use a matching thread color or a contrasting thread color. If you are using fleece or t-shirt fabric, you can skip this step. If you choose to hem them, use a stretch stitch or a zigzag stitch."
    },
    {
      "title": "Hem the thumb holes by hand.",
      "content": "Hem the thumb holes by hand. Fold the edges of the thumb hole down by about ¼-inch (0.64-centimeter). Sew it down by hand using a running stitch. You can use a matching thread color or a contrasting one. If you are using fleece or t-shirt fabric, you can skip this step."
    },
    {
      "title": "Turn the gloves inside out.",
      "content": "Turn the gloves inside out. They are now ready to wear!"
    },
    {
      "title": "Cast on 40 stitches using number 8 knitting needles and number 4 yarn.",
      "content": "Cast on 40 stitches using number 8 knitting needles and number 4 yarn. This will be the length of your gloves. If you want shorter gloves, cast on fewer stitches. If you want longer gloves, cast on more stitches. Be sure to leave a long tail. [11] X Research source Number 4 yarn is also known as worsted weight yarn. You can use a different type of yarn, but you will need to get matching knitting needles."
    },
    {
      "title": "Knit every row until the gloves are wide enough to wrap around your palm.",
      "content": "Knit every row until the gloves are wide enough to wrap around your palm. In most cases, this will be about 48 rows. Make sure that you knit every row. This will give you a stretchy, purl pattern on both sides of your work. Do not alternate between knit and purl, or your glove won't stretch right. [12] X Research source Alternatively, you can work in seed stitch. This will give you material that stretches both ways."
    },
    {
      "title": "Cast off.",
      "content": "Cast off. Once the gloves are wide enough to wrap around your palm, cast off your stitches. Cut the yarn leaving behind a long tail. Feed the tail through the last loop/stitch, then gently tug on it to tighten the knot. Do not cut it off. [13] X Research source"
    },
    {
      "title": "Fold the glove in half.",
      "content": "Fold the glove in half. Bring the cast on and cast off edges together. This is your side seam. Place your arm on top of the glove, and align your knuckles with one of the top, narrow edges. Note where the top and bottom of your thumb is."
    },
    {
      "title": "Sew the top part of the seam down towards your thumb.",
      "content": "Sew the top part of the seam down towards your thumb. Thread the long tail onto a yarn needle. Sew the side seam down using a whip stitch until you reach the top of your thumb joint. For most people, this will be about 2 inches (5.08 centimeters). [14] X Research source"
    },
    {
      "title": "Weave in the end.",
      "content": "Weave in the end. Once the top part of your glove is long enough to your liking, tie the tail off, then weave the tail back up the seam towards the top edge. Snip off the excess yarn. [15] X Research source"
    },
    {
      "title": "Sew up the bottom edge of the seam.",
      "content": "Sew up the bottom edge of the seam. Thread the long cast on tail though your yarn needle. Sew up the bottom edge of the side seam using a whip stitch. Stop when you reach the base of your thumb. You will be left with a gap in your side seam, which is the thumb hole. [16] X Research source"
    },
    {
      "title": "Weave in the end.",
      "content": "Weave in the end. As before, tie the end of the tail off, then weave it back down the seam. You don't have to weave it all the way back down--a couple of inches/centimeters will be plenty. Snip the excess yarn off."
    },
    {
      "title": "Make a second glove.",
      "content": "Make a second glove. This pattern is completely reversible, so you can use the exact same method for both gloves. You do not need to turn these gloves inside out either, as they will be the same on both sides."
    }
  ]
}