{
  "url": "https://www.wikihow.com/Animal-Messenger-5e",
  "title": "Everything You Need to Know About Animal Messenger in D&D 5e",
  "steps": [
    {
      "title": "Animal Messenger is a spell that lets you send messages via animal.",
      "content": "Animal Messenger is a spell that lets you send messages via animal. Available to bards, druids, and rangers exclusively, Animal Messenger is an unorthodox but intriguing alternative to sending allies (or enemies) non-magical messages in D&D 5e. It lets you magically use animals as your message carriers instead! [1] X Research source Level: 2 (ritual) School: Enchantment Casting time: 1 action Range: 30 feet Components: Verbal, somatic, material (a morsel of food) Duration: 24 hours"
    },
    {
      "title": "You must designate a beast you can see to deliver a message.",
      "content": "You must designate a beast you can see to deliver a message. Upon casting the spell, find and pick a tiny-sized beast (such as a frog, squirrel, raven, bat, lizard, or cat) within range. Then, give the beast a message, a location (which you must have visited), and a description of the recipient. [2] X Research source For example, you could describe the recipient as “A woman with freckles and a guard uniform” or “A bald man with blue eyes and a wide-brimmed hat.” Remember: names don’t mean much to an animal, so just saying “Barcus” won’t ensure delivery. If you’re unsure, ask your DM what qualifies as a tiny beast in the area."
    },
    {
      "title": "Your message can be up to 25 words long.",
      "content": "Your message can be up to 25 words long. Choose your words carefully and be concise when giving the beast a message, because it can’t be longer than 25 words. Once your message and delivery instructions are given, the beast will travel to the destination for the duration of the spell. Flying animal messengers can cover about 50 miles per 24 hours. [3] X Research source Animals that can’t fly will cover about 25 miles per 24 hours."
    },
    {
      "title": "Your messenger will deliver the message to the creature you describe.",
      "content": "Your messenger will deliver the message to the creature you describe. Assuming the animal reaches its destination within the duration of the spell, it’ll give the message to a creature matching your description. It’ll also deliver the message by replicating the sound of your PC’s voice! [4] X Research source If the animal doesn’t reach its destination before the spell’s duration is up (24 hours), the spell simply ends, and the message is lost. However, the duration of Animal Messenger increases by 48 hours for each spell slot level above 2nd used to cast it. So: at the 3rd level, its duration is 72 hours; at the 4th level, its duration is 120 hours, and so on."
    },
    {
      "title": "You can cast Animal Messenger as a ritual.",
      "content": "You can cast Animal Messenger as a ritual. In D&D 5e, ritual casting enables you to cast certain spells as rituals, meaning you take an extra 10 minutes to cast them but do so without using a spell slot. This is incredibly useful when you’re trying to preserve your PC’s spell slots for an important encounter or battle ahead! [5] X Research source Animal Messenger might seem slow compared to other messaging spells, but its unreliability is balanced out by its low casting cost. Thus, it’s an ideal spell to use if you want to get a message to someone but don’t need the message to arrive instantly."
    },
    {
      "title": "Recipients get your message but can’t reply to it.",
      "content": "Recipients get your message but can’t reply to it. Unfortunately, it’s impossible to know if a recipient got your message until you talk to them again in person (or get a message back from them) because the Animal Message spell doesn’t allow for replies. Thus, you’ll just have to trust that your message arrived when casting it. [6] X Research source Depending on how by-the-book (or tricky) your DM is, they might rule that your messenger gets intercepted, too. For example, a songbird might get intercepted by a hawk or owl—and a rat might get chased down by a cat. Because there’s no confirmation that your message was received, the Animal Messenger spell can feel a bit risky."
    },
    {
      "title": "Depending on distances, the message may not arrive quickly.",
      "content": "Depending on distances, the message may not arrive quickly. Animal Messenger is a slow spell; although enchanted, the animal you choose still has to travel by its own means—and there’s nothing in the spell specifying the pace it moves. So, your PC might actually deliver a message just as fast by walking there themselves! [7] X Research source Still, if your goal is to avoid backtracking and still get a message to someone within a few days, there’s nothing wrong with using Animal Messenger."
    },
    {
      "title": "Sending",
      "content": "Sending Sending is a 3rd-level evocation spell that lets you telepathically send a 25-word message to any creature you’re familiar with. The message is instantaneous, and the recipient can give you an immediate 25-word answer. Sending even works across different planes of existence (although there’s a 5% chance of failure). [8] X Research source Compared to Animal Messenger, Sending is fast, convenient, and nearly always guaranteed to work. So, if you’re in a hurry and need to make sure your message gets through, Sending is the safer choice. Bards, clerics, and wizards all have access to the Sending spell."
    },
    {
      "title": "Message",
      "content": "Message Message is a transmutation cantrip that lets you quietly whisper a message that only the recipient can hear. The recipient must be within 120 feet of you, but you don’t need to see them, and the message can pass through solid objects, openings, and around corners if you’re familiar with them. [9] X Research source The recipient can also whisper a reply to your original message. Message doesn’t have the same range and flexibility as Sending, but it’s a cantrip (so it won’t use a spell slot). Therefore, Message is ideal for urgent, short-range communication when exploring with your party members. Bards, sorcerers, and wizards all have access to the Message cantrip."
    }
  ]
}