{
  "url": "https://www.wikihow.com/Make-Brown-Rice-in-a-Rice-Cooker",
  "title": "Cooking Brown Rice in a Rice Cooker: Preparation, Cleanup & More",
  "steps": [
    {
      "title": "Measure out 1 cup (210 g) of long- or medium-grain brown rice.",
      "content": "Measure out 1 cup (210 g) of long- or medium-grain brown rice. Use your own dry measuring cup to get an accurate measurement since the scoops that come with most rice cookers only hold ¾ cup (158 g) of rice. [1] X Research source One cup of uncooked rice makes about 1.5 cups of cooked rice. [2] X Research source Use the rice cooker scoop to make a specific number of servings (1 scoop = 1 serving) or to measure out ratios (1 scoop of rice to 2 scoops of water). [3] X Research source Go for long- or medium-grain rice to get individual, slightly firm grains after cooking. Short grain rice tends to be stickier and clump together (like sushi rice)."
    },
    {
      "title": "Rinse the rice",
      "content": "Rinse the rice under cool water until the water runs mostly clear. Dump your measured out rice into a fine strainer or sieve and place it under your faucet. Run cool water over the rice while you mix it around with your fingers or shake the strainer to make sure all of the rice gets rinsed. [4] X Research source The water may look cloudy or milky at first. Keep rinsing until it is mostly clear. Shake out as much excess water as you can when you’re done rinsing. Rinsing removes any debris from the rice as well as the starchy outer layer, which causes rice to clump together or become “gummy” while it cooks."
    },
    {
      "title": "Add your rinsed rice to the rice cooker.",
      "content": "Add your rinsed rice to the rice cooker. Spread the rice over the bottom of the pot so that it cooks as evenly as possible. Try not to add more rice than the cooker can hold at once (consult your user manual or look for a “Max Fill” line inside the pot). [5] X Research source If you need to make an extra large amount of rice, plan ahead and make it in batches rather than accidentally overloading the rice cooker."
    },
    {
      "title": "Add 2 cups (473 mL) of water or broth and a pinch of salt to the pot.",
      "content": "Add 2 cups (473 mL) of water or broth and a pinch of salt to the pot. For brown rice, always add 1.5 to 2 parts water for every 1 part of rice (regardless of how you’re cooking it). [6] X Research source Use tap water or opt for veggie, chicken, or beef broth for more flavorful rice (use the same amount of broth as you would water). [7] X Research source Add ½ tsp (3.5 g) of salt per 1 cup of rice you’re cooking. The salt is optional, but adds more flavor. If you’re adding additional flavorings or seasonings, like a tablespoon (15 mL) of olive oil or butter or a teaspoon (5 mL) of vinegar, add them with the water. [8] X Research source If you used the rice cooker scoop to measure your rice, fill the pot with water up to the appropriate line inside the pot for the number of scoops you’re preparing."
    },
    {
      "title": "Turn on the rice cooker and wait about 45 minutes for perfect brown rice.",
      "content": "Turn on the rice cooker and wait about 45 minutes for perfect brown rice. Once you’ve added all your ingredients, seal the lid tightly and press “start” to use the rice cooker . Most basic rice cookers only have a “start” or “on/off” button, but some may have separate settings for brown rice specifically. Consult your user manual for directions for your rice cooker model. [9] X Research source Keep the lid on during the entire cooking process (don’t lift it up to check on the rice). The exact cook time depends on your rice cooker and the amount of rice you’re making. Since brown rice is tougher than white rice, it needs to cook longer. The cooker will shut off when the water evaporates and the internal temperature rises. For brown rice, this usually happens around 45 minutes."
    },
    {
      "title": "Let the rice rest in the cooker with the lid on for 10 minutes.",
      "content": "Let the rice rest in the cooker with the lid on for 10 minutes. Once the cooker is done cooking, wait for the rice to continue steaming in the pot for about 10 minutes before serving. This lets the rice absorb the last of the moisture in the pot and keeps it from getting dry or crunchy. [10] X Research source This step isn’t always included in cooking instructions, but it can make a big difference in the quality of your rice!"
    },
    {
      "title": "Fluff the rice with a rice paddle (shamoji), spatula, or wooden spoon.",
      "content": "Fluff the rice with a rice paddle (shamoji), spatula, or wooden spoon. Stir the rice from the edges of the pot inward to break up large clumps and release some of the steam trapped in the rice. Steer clear of metal utensils, since they can scratch the nonstick surface of your pot and damage future batches of rice. [11] X Research source Once your rice is fluffed, plate it up and enjoy!"
    },
    {
      "title": "Refrigerate leftover rice in an airtight container for up to 3 days.",
      "content": "Refrigerate leftover rice in an airtight container for up to 3 days. First, spread your leftovers out on a baking tray so they cool (hot leftovers create condensation in a container, which makes them go bad faster). If you plan on eating the rice within 3 days, store it in the refrigerator. [12] X Research source Freeze your rice in a plastic freezer bag to keep it for more than 3 days (press all of the excess air out before you seal it)."
    },
    {
      "title": "Reheat leftover rice in 30-second intervals in the microwave.",
      "content": "Reheat leftover rice in 30-second intervals in the microwave. Sprinkle about a teaspoon (5 mL) of water over the rice to remoisten it and loosen grains that are stuck together. Then, pop your rice in the microwave on medium power. Check and stir the rice every 30 seconds until it’s hot and ready to eat. [13] X Research source Alternatively, heat the rice on the stove over medium heat. Stir constantly to keep the grains moving (just be careful not to mash them). Reheat frozen rice the same way as refrigerated rice. If you’re preparing something hot like a soup or casserole, add frozen rice directly into the dish."
    },
    {
      "title": "Leave the lid off the cooker once you’re done serving so it cools quickly.",
      "content": "Leave the lid off the cooker once you’re done serving so it cools quickly. Unplug the cooker and wait until the inside is cool to the touch before you try to clean it (usually 30-60 minutes). By the time you’re done eating, for example, the insides should be dried out and cool enough to handle safely. [14] X Research source For your safety, never try to clean the rice cooker while it’s still hot or plugged in. This could result in burns to your hands or electric shock."
    },
    {
      "title": "Scrape away any dried rice from the bottom and sides of the cooker.",
      "content": "Scrape away any dried rice from the bottom and sides of the cooker. Use plastic, rubber, or wooden utensils (or your hands) to dislodge the dried rice. Then, remove the inner bowl and dump the rice bits directly into the trash can or garbage disposal. Remove as much as you can to make wiping the bowl clean easier. [15] X Research source Most rice cookers have a nonstick inner coating. Avoid using metal utensils to scrape it clean, since these can scratch or damage your cooker."
    },
    {
      "title": "Remove the inner pot and lid and hand wash them with soap and hot water.",
      "content": "Remove the inner pot and lid and hand wash them with soap and hot water. Unless your cooker has special instructions, scrub them like you would any other dish. Steer clear of steel wool or other abrasive scrubbers that can scratch the pot. Rinse the pot and lid and wipe dry with a towel. [16] X Research source Make sure the inner pot and lid are 100% dry before putting them back into the cooker. If needed, wipe any food spots off the exterior of the cooker with a damp cloth."
    }
  ]
}