{
  "url": "https://www.wikihow.com/Rack-a-Pool-Table",
  "title": "How to Rack a Pool Table",
  "steps": [
    {
      "title": "Start off with the 1-ball at the front of the rack.",
      "content": "Start off with the 1-ball at the front of the rack. This is also called the \"apex\" of the rack."
    },
    {
      "title": "Make sure that the 8-ball is in the center of the rack.",
      "content": "Make sure that the 8-ball is in the center of the rack. The center of the rack is the middle of the triangle. This should be the third row down counting from the top."
    },
    {
      "title": "Make sure the bottom corner balls are a stripe and a solid.",
      "content": "Make sure the bottom corner balls are a stripe and a solid. It doesn't matter which is which, as long as you've got one stripe and one solid. [1] X Research source"
    },
    {
      "title": "Place all the other balls at random.",
      "content": "Place all the other balls at random. Make sure the 1-ball is at the apex, the 8-ball is in the middle of the rack, and both a stripe and solid are at the bottom corner, but line up all the other balls in random fashion. If solids and solids are together, or stripes and stripes, that's okay. [2] X Research source One variant of this step in amateur play is to vary the edges of the rack so that the pattern is stripe, solid, stripe, solid, etc. This will result in the two corner balls being the same, i.e. either both stripe or both solid. Another variant of this step in amateur play is to order the balls down and from left to right, according to their number. This will always result in the 1-ball being at the apex, the 11 and 15 being at the bottom corners, and the 5-ball being in the 8's customary position."
    },
    {
      "title": "Line the apex (the first ball) up with the middle diamond on the side of the pool table.",
      "content": "Line the apex (the first ball) up with the middle diamond on the side of the pool table. The center of the first ball should be in the middle of the table at one quarter of the length. Some tables have this spot marked with a small dot. [3] X Research source"
    },
    {
      "title": "Make sure that the balls are tightly packed together.",
      "content": "Make sure that the balls are tightly packed together. A tight rack makes for an infinitely better break . [4] X Research source"
    },
    {
      "title": "Preserving the tightness of the rack, lift the rack from the balls.",
      "content": "Preserving the tightness of the rack, lift the rack from the balls. You're ready to start your 8-ball game."
    },
    {
      "title": "If possible, get a diamond-shaped rack for 9-ball.",
      "content": "If possible, get a diamond-shaped rack for 9-ball . Since the racking technique is different in 9-ball from 8-ball, a different rack is preferred. The pattern of a diamond is 1-2-3-2-1. The traditional triangular rack may be used for racking a 9-ball game, but it will produce a looser rack. [5] X Research source"
    },
    {
      "title": "In all variants of 9-ball, keep the 1-ball at the apex and the 9-ball in the center.",
      "content": "In all variants of 9-ball, keep the 1-ball at the apex and the 9-ball in the center. The 1-ball is always at the front of the rack, and the 9-ball is always directly in the center. [6] X Research source"
    },
    {
      "title": "Place all other balls in random order around the 1- and 9-ball.",
      "content": "Place all other balls in random order around the 1- and 9-ball. Like in 8-ball, traditional rules state that all other balls are placed randomly. [7] X Research source One amateur variant of 9-ball is that the billiard balls are placed in sequential orders, down and from left to right, excepting the 9-ball, which stays in the middle. If done properly, the 1-ball will be at the apex and the 8-ball will be at the bottom."
    }
  ]
}