{
  "url": "https://www.wikihow.com/Get-Service-Hours-for-High-School",
  "title": "16 Teen Volunteering Ideas: Get Community Service Hours & Make a Difference",
  "steps": [
    {
      "title": "Volunteering with a local organization lets you choose a cause you find meaningful.",
      "content": "Volunteering with a local organization lets you choose a cause you find meaningful. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Local nonprofits can be dedicated to anything from preventing domestic violence, to preserving local parks, to helping the homeless. Check out a local nonprofit's website and look for a link that says “get involved” or “contact us.” Even if they don’t look like they’re actively recruiting volunteers, it’s totally worth sending an email to check. Reach out with something like, “Hi, my name’s Sammi and I’m a local high schooler. I’m really passionate about what you do, and I’d love to get involved. Do you have any opportunities for volunteers? I’m happy to do whatever I can to help.” You can even send in a resume or just a brief sentence listing a few skills like, “I’m a diligent worker, and I have strong social media skills.”"
    },
    {
      "title": "Check out Habitat for Humanity, the American Red Cross, or the Humane Society.",
      "content": "Check out Habitat for Humanity , the American Red Cross , or the Humane Society . A national organization gives you the chance to find lots of volunteer opportunities, make a big impact, and connect with a larger community. Even though they’re national organizations, they’ll usually offer local chapters where you can do work right in your own community. [2] X Research source Here are a few national service organizations that offer both virtual and in-person opportunities: Amnesty International (Human Rights) Feeding America (Hunger) Learning Ally (Disability Support) Leukemia & Lymphoma Society (Health) Rock the Vote (Non-Partisan Civic Engagement) UNICEF (Health/Advocacy)"
    },
    {
      "title": "Serving at a soup kitchen can be a one-time or repeat volunteer experience.",
      "content": "Serving at a soup kitchen can be a one-time or repeat volunteer experience. Depending on the kitchen, you might help pick up supplies, prep food, serve food, and clean up. It’s a great opportunity to get involved and help others while collecting your service hours. [3] X Research source Search online for a local soup kitchen or a place of worship that offers meals for those in need."
    },
    {
      "title": "Volunteering with rescue animals is the perfect gig for animal lovers.",
      "content": "Volunteering with rescue animals is the perfect gig for animal lovers. Check your local shelters’ websites to check their age requirements (some might have 14+ or 16+ age restrictions). [4] X Trustworthy Source Animal Humane Society Leading animal welfare nonprofit organization providing medical care, training education, and resources for animal owners Go to source Expect volunteering with an animal shelter to be a repeated commitment since you might have to go through training first. As a volunteer, you might help socialize and care for the animals, walk dogs, clean up waste, assist with clerical work, answer phones, and interact with visitors."
    },
    {
      "title": "Search local hospitals for “junior” or “student” volunteer programs.",
      "content": "Search local hospitals for “junior” or “student” volunteer programs. While you won’t formally interact with or treat patients, you might work at a front desk, offer patients and family members beverages or snacks, retrieve needed items, and more. To volunteer at most hospitals, you’ll have to pass a background check and tuberculosis test, have up-to-date vaccinations, and go through training. As a result, this will be a repeated commitment rather than a one-off gig. [5] X Research source This is an especially great opportunity to serve if you’d like to pursue a career in medicine ."
    },
    {
      "title": "Helping out seniors",
      "content": "Helping out seniors is an incredibly meaningful way to volunteer. You can run errands, provide companionship for seniors, help out caretakers, participate in small group activities like game night, etc. Depending on the home, this could be a one-time service opportunity or a long-term volunteer position. Here are a few more ideas you could consider: [6] X Research source Get a group of musical friends together and ask the home if you can put on a concert. Offer to help residents with arthritis write letters. Visit with residents and enjoy a meal together to provide company. Walk dogs or take care of pets for the elderly. Help seniors with technology."
    },
    {
      "title": "There are tons of different volunteer opportunities at local libraries.",
      "content": "There are tons of different volunteer opportunities at local libraries. You can help answer phones, reshelve and categorize books, clean up the space, or help organize events. [7] X Research source Some libraries also offer afterschool literacy programs or tutoring programs. Depending on the library, you might be able to sign up to help for one event or on a regular basis. This is a great opportunity if you’re looking at a career in teaching or education."
    },
    {
      "title": "Want a chance to help other people learn?",
      "content": "Want a chance to help other people learn? Look for volunteer opportunities through your school or local community centers. You can choose to work in a specific subject like math or science or work as a literacy/ESL tutor helping people learn to read and write in English. [8] X Research source If you can’t find a volunteer tutoring organization, ask a teacher to act as a supervisor for your own self-made volunteering program. Put up flyers around your school and offer free tutoring during lunchtime or right after school."
    },
    {
      "title": "As a volunteer, you can become the cool role model younger kids look up to.",
      "content": "As a volunteer, you can become the cool role model younger kids look up to. You might help younger kids with homework, play games with them, or just be someone they can talk to. Call up your old elementary or middle school to ask if they need afterschool volunteers. Never underestimate your power to make a difference in elementary school or middle schoolers' lives! [9] X Research source You can also check a national community organization like the YMCA for opportunities to get involved with their afterschool programs."
    },
    {
      "title": "Teach other kids how to play the sport your love.",
      "content": "Teach other kids how to play the sport your love. Check out a local community center or a youth sports league to see if they offer volunteer coaching or referee positions. If you have a former coach or club, you can even contact them directly and see if they’ll let you help out. [10] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source To really make an impact, consider making this a long-term commitment so you can build a lasting relationship with the younger kids."
    },
    {
      "title": "Community trash pickups are an impactful and easy way to get service hours.",
      "content": "Community trash pickups are an impactful and easy way to get service hours. Search online to see if any local environmental groups are hosting a trash pickup day. [11] X Research source If not, check with your school and ask them if you can organize one. Get a teacher or staff member to approve your event, create flyers, recruit your friends, and get to work! Ask your school or a local service group if you can borrow supplies. You’ll need gloves and trash bags at a minimum, though it would be ideal to have a few trash grabbers, too. Start at a park or beach to be safe. If you work alongside a road, be very careful and wear bright clothes or high-visibility neon vests."
    },
    {
      "title": "Starting your own donation campaign lets you give back while gaining leadership skills.",
      "content": "Starting your own donation campaign lets you give back while gaining leadership skills. Partner up with a local organization to help you deliver whatever you collect to the people who need it most. [12] X Research source Then, post about the drive on social media, put up flyers at school, and set up collection points. Instead of delivering the goods to a local organization, you could also partner up with one of these national organizations: Operation Gratitude (contribute to care packages for deployed soldiers) Toys for Tots (collect toys for children whose parents can’t afford Christmas gifts) Feeding America (collect non-perishable food items to bring to local food banks)"
    },
    {
      "title": "An old-fashioned bake sale is a great way to raise money for a local charity or cause.",
      "content": "An old-fashioned bake sale is a great way to raise money for a local charity or cause. Want to raise money for community arts programs, local charities, or families in need? Bake up a batch of tasty cookies or goodies and sell them. [13] X Research source Let everyone know you’re donating 100% of the proceeds to a good cause. This is a tasty one-time or repeated service opportunity. You can even ask your school if you can do the bake sale at the next football game, orchestra concert, or school play to get more people to stop by."
    },
    {
      "title": "Charity races or relays are active, fun ways to raise awareness for causes.",
      "content": "Charity races or relays are active, fun ways to raise awareness for causes. In addition to spreading awareness, people pledge money for the number of laps or miles you complete, and the money goes to a charity. You can participate in an established relay, but your school might not count that as service hours. [14] X Research source If you’d like to organize an event, you might have better luck at getting hours. Either way, try partnering with these reputable organizations: American Cancer Society Relay For Life Girls on the Run 5ks St. Jude Hero Runs"
    },
    {
      "title": "Whether you’re religious or not, places of worship offer lots of opportunities to serve.",
      "content": "Whether you’re religious or not, places of worship offer lots of opportunities to serve. From food banking hours to community cleanups, be sure to log any hours you spend volunteering alongside your religious organization. If you're not religious, you might still be able to participate! Many places of worship will welcome volunteers for food drives and other charitable events. Keep in mind serving as a youth group leader or doing work that benefits the place of worship might not count as service hours. Some schools consider that work that benefits a private organization rather than the broader community. [15] X Research source Regardless, it’s always worth checking with your school to see whether your hours will count or not!"
    },
    {
      "title": "When in doubt, ask your teachers and guidance counselors for ideas.",
      "content": "When in doubt, ask your teachers and guidance counselors for ideas. If your school has a service hours requirement, they probably have a nice list of local partner organizations where you can donate your time. If there’s a cause you care about that’s not on the list, it’s worth asking if the volunteer activity can still count. For instance, if you’re organizing a protest for an environmental cause, your school might let you count those hours if you get the event approved in advance."
    }
  ]
}