{
  "url": "https://www.wikihow.com/Crusher-Feat-5e",
  "title": "An In-Depth Look at the Crusher Feat in Dungeons & Dragons 5e",
  "steps": [
    {
      "title": "Crusher is a feat that makes bludgeoning weapons more effective.",
      "content": "Crusher is a feat that makes bludgeoning weapons more effective. In D&D 5e, feats are optional perks you can choose to give your player character (PC) different abilities, spells, and skills. The Crusher feat is specifically designed to make your PC a master of crushing their foes in battle. Thus, with the Crusher feat, your PC will gain the following perks: [1] X Research source Increase your PC’s Strength (STR) or Constitution (CON) score by 1, to a maximum of 20. Once per turn, when your PC hits a creature and deals bludgeoning damage, they can move it 5 feet to an unoccupied space—as long as the target is no more than one size larger than your PC. Finally, when your PC scores a critical hit with bludgeoning damage, you can make attack rolls against that creature with advantage until the start of your next turn."
    },
    {
      "title": "Boost your PC’s STR or CON scores if either is at an odd number.",
      "content": "Boost your PC’s STR or CON scores if either is at an odd number. PCs specializing in melee battle (meaning they fight at close range using physical attacks) often need all the Strength and Constitution they can get! The ability score boost is especially valuable if one score is an odd number because boosting it will also raise your ability score modifier. [2] X Research source Strength determines your PC’s ability to exert physical force and the amount of weight they can carry. Constitution determines your PC’s health, vitality, stamina, and physical fortitude. Raising an ability score modifier makes that ability more effective overall. With STR, you’d get a bonus to weapon attacks, STR checks, and saving throws. With CON, you’d get more hit points and a bonus to CON checks and saving throws."
    },
    {
      "title": "Move enemies into flanking positions with an ally.",
      "content": "Move enemies into flanking positions with an ally. Flanking is a mechanic that allows you to get advantage on attack rolls against an enemy. When you and at least one ally are adjacent to an enemy (and on opposite sides of them), that enemy is considered flanked—and you can use Crusher to knock an enemy 5 feet in a direction of your choice toward an ally to flank them. [3] X Research source Essentially, when you use Crusher to give yourself and your allies advantage on attack rolls against enemies, it’ll improve your chances of successfully hitting them!"
    },
    {
      "title": "Push enemies away from your PC to make a quick escape.",
      "content": "Push enemies away from your PC to make a quick escape. If your PC is low on health (or even about to go unconscious), you can use Crusher to push an attacker 5 feet away. Once they’re out of melee range, your PC can move away without provoking an attack of opportunity. While you can also move away safely with Disengage, this option lets you get an attack in first. [4] X Research source You can also turn your PC into a stalwart defender when an ally is in trouble! When an enemy is threatening them, use Crusher to knock that enemy 5 feet away—giving your ally space to move away without getting attacked. This is especially helpful when defending allies with a lower armor class and fewer hit points (like wizards or sorcerers)."
    },
    {
      "title": "Maximize your damage and chances of making a successful attack.",
      "content": "Maximize your damage and chances of making a successful attack. When you score a critical hit against a creature, you can double the damage dice you roll—which means you’ll deal much more damage than you would on a regular hit. Since Crusher grants advantage against enemies if you crit on them, the feat makes you even more likely to hit (and deal more damage) after criticals. [5] X Research source"
    },
    {
      "title": "Combine Crusher with spells that deal even more damage to enemies.",
      "content": "Combine Crusher with spells that deal even more damage to enemies. If you (or an ally) use the Booming Blade spell against an enemy, knock them 5 feet away, and then move away, you can force them to take extra damage if they want to close the distance and attack you again. This makes Crusher and Booming Blade a powerful combination, and there are plenty of other spells like this, too. [6] X Research source For example, if an ally casts a spell that creates hazardous terrain (like Spirit Guardians, Spike Growth, or a Wall spell (Wall of Blades, Fire, and so on), you can use Crusher to push an enemy into the harmful effect. Additionally, you can maneuver enemies into a better position for allies. For example, if the wizard wants to cast Fireball on an enemy next to you, use Crusher to push the enemy away so the wizard can target them freely."
    },
    {
      "title": "Any weapon that deals bludgeoning damage will work with Crusher.",
      "content": "Any weapon that deals bludgeoning damage will work with Crusher. This includes clubs, maces, light hammers, flails, mauls, slings, and warhammers. However, depending on your class and proficiencies, some bludgeoning weapons may be better than others. Consider using the following based on your PC’s needs: [7] X Research source Mauls are heavy weapons, ideal for great weapon builds because they deal 2d6 damage per hit. Quarterstaffs can be used along with the Polearm Master feat and don’t require proficiency with martial weapons (which is handy for monks). Warhammers are versatile, meaning you can wield them with one or two hands (and deal 1d8 or 1d10 damage per hit, respectively)."
    },
    {
      "title": "Crusher is situationally useful for certain PCs.",
      "content": "Crusher is situationally useful for certain PCs. One of Crusher’s biggest strengths is the amount of control it gives you over a battlefield. You can use it to reposition enemies in ways that’ll benefit you or your allies and gain a bonus to your damage output and attack rolls simultaneously. When you can control a battlefield, getting the upper hand is much easier! [8] X Research source All in all, if you’re playing a class that can use Crusher and wield a bludgeoning weapon, this feat is surprisingly strong. On the other hand, this feat is pretty useless if you’re playing a class that doesn’t do melee combat or use bludgeoning weapons."
    },
    {
      "title": "Classes that specialize in melee fighting can excel with Crusher.",
      "content": "Classes that specialize in melee fighting can excel with Crusher. Since Crusher’s perks rely on melee combat and bludgeoning damage, your PC should have a class that allows you to do both—ideally as a main part of that PC’s build. Consider taking the Crusher feat if you’re playing one of the following classes: [9] X Research source Monk . Crusher is surprisingly fantastic for monks since all their unarmed strikes deal bludgeoning damage (as are quarterstaffs, which are typical monk weapons). Fighter . Fighters are extremely versatile, so Crusher can work with just about any Fighter build if you’re using a bludgeoning weapon. It’s especially great for Champions (since they land so many critical hits). Paladin . While other feats (like Polearm Master) may be more appealing depending on your paladin’s build, paladins can use all of the weapons covered by Crusher, making this a solid choice for paladin PCs. Barbarian . There are plenty of great feats for barbarians, so Crusher might not be your top priority—but, if you decide to go this route, it’ll enable your barbarian to control the battlefield a bit more. Cleric . Although clerics are primarily spellcasters, melee-focused War Domain clerics specifically can make use of this feat (since they get extra attacks and damage as part of the subclass). Artificer . While spellcasting-focused artificers probably couldn’t use Crusher at all, it can be quite useful to melee-oriented artificer subclasses like Armorers and Battle Smiths."
    },
    {
      "title": "Classes that rarely (if ever) use melee fighting shouldn’t take Crusher.",
      "content": "Classes that rarely (if ever) use melee fighting shouldn’t take Crusher. Druids, bards, rangers, rogues, sorcerers, wizards, and warlocks are all examples of classes that would likely find Crusher to be totally useless, since it’s designed for melee combat—which none of them specialize in. While there are a few subclass exceptions here and there, Crusher is generally a bad choice for these classes. [10] X Research source Druids really only get into melee range when using Wild Shape, so to use Crusher, you’d need to take an animal form that deals bludgeoning damage (and there aren’t many). Bards have a couple of melee-focused subclasses (Valor and Swords), but other feats (like Fey Touched or Magic Initiate) are still far better for them. Bladesinger wizards and Hexblade warlocks can use bludgeoning weapons (and Booming Blade), but Crusher isn’t a vital feat for either subclass."
    }
  ]
}