{
  "url": "https://www.wikihow.com/Relieve-Ulcer-Pain",
  "title": "How to Get Rid of Ulcer Pain: Medical Treatment & Home Remedies",
  "steps": [
    {
      "title": "Acetaminophen",
      "content": "Acetaminophen Acetaminophen (which is the active ingredient in Tylenol) works differently than most other painkillers—and thus isn’t associated with ulcers. Taking it can actually relieve the pain caused by an ulcer and make it easier to cope while the ulcer heals. [1] X Research source Do not use any other painkillers to treat ulcer pain and switch painkillers right away if you’ve been taking something other than acetaminophen. Always follow the instructions on your acetaminophen bottle when taking it, and don’t use it for more than 10 days at a time without your doctor’s approval."
    },
    {
      "title": "Antacids",
      "content": "Antacids Antacids can soothe pain and promote healing by neutralizing the acids in your stomach. [2] X Expert Source Roy Nattiv, MD Board Certified Gastroenterologist Expert Interview. 14 October 2020. Look for common over-the-counter antacids like sodium bicarbonate (Alka-Seltzer), calcium carbonate (Rolaids, Tums), magnesium hydroxide (Phillips Milk of Magnesia), and magnesium hydroxide (Maalox, Mylanta). You can also talk to your doctor about prescription-strength antacids to help you deal with ulcer pain. [3] X Expert Source Roy Nattiv, MD Board Certified Gastroenterologist Expert Interview. 14 October 2020."
    },
    {
      "title": "Prescription antibiotics, PPIs, and H-2 blockers",
      "content": "Prescription antibiotics, PPIs, and H-2 blockers Proton pump inhibitors (PPIs) block stomach acid production, while histamine (H-2) blockers prevent stomach acid from entering your digestive system. Some PPIs and H-2 blockers are available over the counter, but it's still a good idea to consult the doctor first. If the ulcer is caused by H. pylori bacteria, your doctor may prescribe antibiotics. [4] X Research source Common antibiotics used to kill H. pylori bacteria include amoxicillin (Amoxil), clarithromycin (Biaxin), metronidazole (Flagyl), tinidazole (Tindamax), tetracycline and levofloxacin. Over-the-counter PPIs include omeprazole (Prilosec), lansoprazole (Prevacid), rabeprazole (Aciphex), esomeprazole (Nexium) and pantoprazole (Protonix). Over-the-counter H-2 blockers include famotidine (Pepcid AC), cimetidine (Tagamet HB), and nizatidine (Axid AR)."
    },
    {
      "title": "NSAIDs (nonsteroidal anti-inflammatory drugs)",
      "content": "NSAIDs (nonsteroidal anti-inflammatory drugs) NSAID painkillers like aspirin, Advil, and Aleve can irritate your stomach lining and make the ulcer worse. Using NSAIDs for an extended period of time can also damage the wall of your stomach, causing ulcers to develop. [5] X Expert Source Roy Nattiv, MD Board Certified Gastroenterologist Expert Interview. 14 October 2020. Don’t use any other painkillers outside of acetaminophen unless your doctor says otherwise. Drugs to avoid include: Aspirin (also found in Bayer, Bufferin, Ecotrin, and Excedrin) Ibuprofen (found in Advil, Motrin IB, and Nuprin) Naproxen sodium (found in Aleve) Ketoprofen (found in Actron and Orudis KT) Talk to your doctor before settling on a general pain reliever to use. They may have advice or recommendations based on your personal medical situation."
    },
    {
      "title": "Acidic, spicy, and fatty foods and drinks",
      "content": "Acidic, spicy, and fatty foods and drinks These products will cause your ulcer to hurt more and potentially cause a flare-up of acid reflux. Beverages to avoid include coffee, soft drinks, alcohol, and milk, as they’re all acidic. Acidic foods like chocolate, citrus, and tomatoes can also aggravate your stomach, in addition to fried food and spicy dishes. [6] X Research source Chili peppers are actually the exception to this, as recent research suggests they don’t cause ulcers. Still, it’s best to reduce your chili pepper intake while you deal with your ulcer."
    },
    {
      "title": "Smoking",
      "content": "Smoking Smoking makes you more susceptible to ulcers; it has many negative effects, including increasing the acid in your stomach. You can eliminate unnecessary stomach pain by quitting. [7] X Expert Source Roy Nattiv, MD Board Certified Gastroenterologist Expert Interview. 14 October 2020. If you quit smoking , it can help with ulcer pain and prevent you from getting them in the future."
    },
    {
      "title": "Eat a vitamin-rich diet with fruits, vegetables, and whole grains.",
      "content": "Eat a vitamin-rich diet with fruits, vegetables, and whole grains. Healthy foods can help reduce ulcer pain and stomach irritation, which makes eating well crucial. Most fruits, vegetables, and whole grains (with the exception of citrus fruits and tomatoes) won’t hurt your stomach. A vitamin-rich diet will also support your body's healing. [8] X Research source Fruits containing flavonoids are especially helpful because they protect your stomach lining. Eat colorful fruits like apples, blueberries, and cherries, plus leafy veggies like kale. Unripe plantain bananas can also help with peptic ulcers because they contain a flavonoid called leucocyanidin. Getting more fiber from fruits and vegetables can help prevent new ulcers from developing and heal ulcers."
    },
    {
      "title": "Consume smaller meals while snacking throughout the day.",
      "content": "Consume smaller meals while snacking throughout the day. One way to help relieve ulcer pain is to decrease the amount of food you eat in each sitting. This reduces the stress on your stomach and the amount of acid in your stomach, which in turn eases stomach pain. Enjoy several nutritious snacks on a regular basis to make up for the smaller meals. [9] X Research source Avoid eating for 2 to 3 hours before bedtime, too. This reduces the risk of acid refluxing into your esophagus as you try to sleep."
    },
    {
      "title": "Learn new ways to control and cope with stress.",
      "content": "Learn new ways to control and cope with stress. Anxiety and stress can actually worsen your symptoms when you have a stomach ulcer. Identify the source of your stress and find ways to reduce it, whether that means addressing a problem directly, exercising , relaxing with friends, or expressing your emotions by talking to someone or writing in a journal. [10] X Research source Stress worsens your symptoms because it creates a natural response in your body that produces more stomach acid. By reducing stress , you’re also helping your body heal."
    },
    {
      "title": "Probiotics",
      "content": "Probiotics Probiotics are organisms found in some foods that can improve your overall gut health. They can balance out and reduce the bacteria in your digestive tract, speeding up the healing process for your ulcer. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Eat things like yogurt, which is high in probiotics, or fermented foods like tempeh, miso, kimchi, and pickles. You can also take probiotic supplements , if you prefer, which have a higher concentration of probiotics per serving."
    },
    {
      "title": "Cabbage juice",
      "content": "Cabbage juice Cabbage is rich in vitamin C, which is an antioxidant used to treat H. pylori infections that cause stomach ulcers. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It’s a common natural ulcer remedy and can actually treat other digestive ulcers beyond those in the stomach too! Drink cabbage juice daily while dealing with an ulcer to help it heal."
    },
    {
      "title": "Ginger",
      "content": "Ginger Ginger acts as an anti-inflammatory and soothing agent for the stomach and helps with nausea, vomiting, and constipation. Drink ginger tea daily to treat your ulcer; you can buy it or make your own ginger tea . Cut up 1 tsp (5.7 grams) of fresh ginger and add it to boiling water, letting it steep for about five minutes. Pour the tea into a mug and drink up! You can make ginger tea anytime during the day, but it’s most helpful when prepared 20 to 30 minutes before meals."
    },
    {
      "title": "Chamomile",
      "content": "Chamomile Chamomile tea can calm the stomach and reduce stomach pain by acting as an anti-inflammatory agent. Prepare some chamomile tea for quick pain relief anytime you need it. Chamomile is also often used to treat minor anxiety and intestinal spasms. [13] X Research source"
    },
    {
      "title": "Garlic",
      "content": "Garlic Garlic has antimicrobial and antibacterial properties, meaning it can help prevent the growth of H. pylori (and the development of ulcers). Studies have shown that it may also speed up the recovery period for existing ulcers. Try eating about 2 cloves’ worth of raw garlic per day to improve your ulcer symptoms. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Keep in mind you don’t have to eat the garlic plain. You can add it to food! Make pesto, stir it into your guacamole, add it to a pasta dish, or make garlic toast, for example."
    },
    {
      "title": "Turmeric",
      "content": "Turmeric Turmeric is a spice often found in South Asian dishes. Its medicinal properties come from its active ingredient, curcumin, which can help reduce inflammation and prevent damage caused by H. pylori bacteria. Add turmeric powder to your foods (many recipes naturally include it) or take daily turmeric supplements to improve your ulcer symptoms. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can add turmeric to smoothies, eggs, salad dressing, and hummus or use it to spice up some roasted veggies. Doses for turmeric can vary, but a typical daily intake of around ¼ tsp (1,000 mg) to ½ tsp (2,000 mg) is considered healthy."
    },
    {
      "title": "Honey",
      "content": "Honey Honey is typically used as a natural sweetener, but recent research has also suggested that it can help treat stomach ulcers! You can add honey to your tea, spread it over bread, or use it as a salad dressing. Find ways to incorporate a little honey into your diet and speed up the healing process for your ulcer. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Licorice",
      "content": "Licorice Deglycyrrhizinated licorice root (DGL) is excellent for treating hyperacidity and ulcer pain. Take DGL licorice tablets , following the instructions on the bottle to ensure you take the right amounts. The tablets’ taste might take some getting used to, but they can help! [17] X Research source Glick, L., Deglycyrrhizinated liquorice for peptic ulcer. Lancet. 1982 Oct 9;2(8302):817 Instructions can vary, but the typical dosage is 2 to 3 tablets every 4 to 6 hours."
    },
    {
      "title": "Mastic",
      "content": "Mastic Mastic, a type of resin, is more commonly known as Arabic gum, Yemen gum, and tears of Chios. It’s been used for a long time to treat gut disorders (including stomach ulcers) because it can help eradicate H. pylori bacteria. Take daily mastic gum supplements to help speed up the healing process, following all dosage instructions on the bottle. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Aloe vera",
      "content": "Aloe vera Aloe vera juice decreases inflammation and neutralizes stomach acid, in turn reducing your pain. Aim to drink ½ cup (100 mL) of organic aloe vera juice twice daily if you’re experiencing ulcer pain. It may even treat ulcers similarly to anti-ulcer medications, though research is ongoing. [19] X Research source Aloe vera also comes in tablet or gel form. Use as directed on the package! Since aloe vera can act as a laxative, limit it to a total of 1 or 2 cups daily. Don’t use aloe vera if you have chronic intestinal problems, such as Crohn's disease, ulcerative colitis, or irritable bowel syndrome."
    },
    {
      "title": "Visit your doctor if you haven’t been officially diagnosed yet.",
      "content": "Visit your doctor if you haven’t been officially diagnosed yet. It’s better to know exactly what you’re dealing with rather than assume you have an ulcer. Your doctor will first perform a physical exam. Then, depending on your symptoms, they may order laboratory tests, an upper gastrointestinal series, or an endoscopy to verify that you have an ulcer. From there, they can also outline a treatment strategy. [20] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Breath, blood, and stool laboratory tests can detect H. pylori bacteria in your body, which in turn tells the doctor whether or not you have an ulcer. Tell your doctor if you’ve ben using antacids before taking a test! Endoscopies essentially involve doctors using a scope (inserted down your throat) to examine your upper digestive system for an ulcer or signs of H. pylori bacteria. An upper gastrointestinal series means getting X-rays of your esophagus, stomach, and small intestine to detect an ulcer. Be ready to answer the doctor’s questions accurately describe your symptoms ."
    },
    {
      "title": "See a doctor if the ulcer persists, or visit the ER if it starts bleeding.",
      "content": "See a doctor if the ulcer persists, or visit the ER if it starts bleeding. Look out for signs and symptoms that might indicate an infection, a bleeding ulcer, or a hole in the ulcer wall. Don’t panic: warning signs don’t necessarily mean an emergency, but it’s best to let a doctor take a look. Visit a doctor or urgent care if the ulcer doesn't go away, and go to the ER if the warning signs below develop: Fever Severe pain, tenderness of the belly, swelling, or visible bloating of the abdomen Persistent nausea, vomiting, or vomiting blood (or material that looks like coffee grounds) Diarrhea or persistent constipation that lasts longer than two to three days Blood in your stool, which may look like red blood, or black and tarry Jaundice — yellowish discoloration of the skin and the whites of the eyes"
    }
  ]
}