{
  "url": "https://www.wikihow.com/Set-Intentions",
  "title": "How to Set and Stick to Intentions (with Examples)",
  "steps": [
    {
      "title": "Spend time checking in with yourself to find what you really want.",
      "content": "Spend time checking in with yourself to find what you really want. You'll only follow through with your intentions if they matter to you. Think about what you're passionate about and the things that actually make you happy. When do you feel the most joy? Use those moments to choose your intentions. If you don't pick things that give you joy, you're not going to be able to commit to that intention. [1] X Expert Source Annie Lin, MBA Life & Career Coach Expert Interview. 25 November 2019. For example, perhaps you realize you're most joyful when you're with your family. Maybe your intention can be \"I intend to be more fully present when I'm with my family.\" For another example, while you might feel pressured to lose weight by society, you may find that once you dig deeper, you're happy in your own body and treating your body better is more what you're passionate about."
    },
    {
      "title": "Focus on the journey rather than the goal.",
      "content": "Focus on the journey rather than the goal. A resolution or a goal is focused on an end-reward, such as losing weight or learning a new skill. An intention is more about the steps you take that could lead to that goal. For instance, \"drink less\" is a resolution. Your intention might be \"I'm going to treat my body better.\" Treating your body better may lead to drinking less, but that's not the ultimate goal, necessarily. An intention can be how you want to feel for the day or simply what you'd like to get out of the day, such as \"I want to be thankful for the good things that happen today.\" [2] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source While you can still set goals, use intentions to frame those goals in a more positive way that helps you stick with it day-to-day. For example, if you would like to learn a new skill, you might say, \"I intend to be open to learning, criticism, and anything that helps me grow and master my skill.\""
    },
    {
      "title": "Set intentions for the month, the week, and the day.",
      "content": "Set intentions for the month, the week, and the day. Focus is important in the short-term and in the long-term. Setting monthly intentions helps you look at the big picture while setting daily intentions lets you live in the moment. Both are equally important. [3] X Expert Source Annie Lin, MBA Life & Career Coach Expert Interview. 25 November 2019. For instance, if you're coming up on a holiday season, you might set a monthly goal like \"I intend to breathe in the joy and peace of this season while I seek out time with my friends and family.\" A weekly intention might be, \"I intend to remember people who are less fortunate this week and reach out to those in need.\" A daily intention might be, \"I intend to use my privilege for good today.\""
    },
    {
      "title": "Keep your intentions short and to the point.",
      "content": "Keep your intentions short and to the point. Your intention shouldn't be more than a sentence long. Make it short so you can remember it easily and to the point so you can focus on the outcome. [4] X Research source For instance, your intention could be something like, \"I intend to practice forgiveness today.\""
    },
    {
      "title": "Ensure your intention is actionable if it is goal-oriented.",
      "content": "Ensure your intention is actionable if it is goal-oriented. It doesn't have to be something you can go out and physically do, like ride a bike. However, it should be an active thing can do to make your emotional or physical well-being better, such as focus on forgiveness or seek out the best in others. [5] X Research source For instance, your intention shouldn't be \"I want to be skilled,\" as that's not an action. It should be, \"I intend to focus on learning a few chords on the piano today.\""
    },
    {
      "title": "Try mantra-like intentions to help center yourself.",
      "content": "Try mantra-like intentions to help center yourself. Intentions don't always need to be goal-oriented. You can also use them to reset your thinking and to help you be happier and more grateful for the things you have. With these types of intentions, focus on the good things in your life and the people around you. This focus will help you be more grateful and happy. [6] X Research source For example, your intention could be, \"I intend to look for the best in everyone I meet,\" or \"I will practice gratitude for the good things I have in my life.\""
    },
    {
      "title": "State your intentions in a positive way.",
      "content": "State your intentions in a positive way. If you phrase your intention in a negative way, you're less likely to follow through. Plus, setting a negative intention puts you in a poor frame of mind, setting a bad tone. [7] X Research source For example, instead of saying, \"I'm going to get rid of this stupid body fat,\" you'd write, \"I am working hard to treat my body with respect.\" While these intentions may not seem related, they are; treating your body with respect by eating healthy and exercise may result in losing body fat. However, the focus is on the positive: treating your body better."
    },
    {
      "title": "Phrase your intentions in an active form.",
      "content": "Phrase your intentions in an active form. Remove words like \"try\" from your intentions. Instead, replace them with active words. If you say you will try, then you may end up just trying, not actually doing the intention. Look for any hesitation in your phrasing and remove it. [8] X Research source For instance, instead of, \"I am going to try to work on listening today,\" say \"I am going to be an active listener today.\""
    },
    {
      "title": "Write your intention down.",
      "content": "Write your intention down. It's important to make the intention feel real to you, and physically writing it down can do that. Also, try saying it out loud. Both of these tasks will help solidify the intention in your mind. [9] X Research source You might even try saying the intention a few times in a row to help it stick."
    },
    {
      "title": "Try meditating on your intention.",
      "content": "Try meditating on your intention. If you hear \"mediation\" and get a little nervous, don't worry. It's not that big of a deal. Just spend some time with your eyes closed, focusing on your breathing for a few minutes. As you do, bring to mind your intention and think about that statement for a minute or 2. [10] X Expert Source Annie Lin, MBA Life & Career Coach Expert Interview. 25 November 2019. As you breathe out, try to let go of any anxiety you may be feeling about your intention. Pretend each breath you bring in is a soothing blue that's bringing calm into your body."
    },
    {
      "title": "Refer back to your intention throughout the day.",
      "content": "Refer back to your intention throughout the day. Carry it around on a piece of paper in your pocket or write it somewhere you'll see it often. If you prefer, try setting reminders throughout the day on your phone or computer that make you read your intention again. [11] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source The more you're reminded of your intention, the more likely you are to be mindful of the choices you make."
    },
    {
      "title": "Work on staying positive about your intention.",
      "content": "Work on staying positive about your intention. At times, you may think what you intend will never come true or that you don't have the willpower to do it. That kind of negative self-talk will only sabotage your good work, so it's important to nip it in the bud when it happens. When you find yourself using negative self-talk, re-frame it in a positive way. For instance, if you think, \"I will never have the body I want,\" re-frame it into \"I may not be able to change myself instantly, but I can choose to be kind to my body today. Today is the only time I have control over.\" You might also say, \"The past is in the past. Today, I can do things differently.\""
    },
    {
      "title": "Think about your intentions when you make plans.",
      "content": "Think about your intentions when you make plans. Use your intentions to help you make plans. That is, when you're making long-term and even short-term plans, refer to your intentions to see if your plans will help or hinder your intentions. You may need to tweak your plans a little so they fall more in line with your intentions. For instance, if you decide you are treating your body better, you may decide that partying with your friends this weekend isn't a good idea. Alternatively, you may decide to go out to the club with them but choose to only have 1 drink."
    },
    {
      "title": "Celebrate and be grateful for your successes.",
      "content": "Celebrate and be grateful for your successes. From time to time, think back on the intentions you've set and consider the ones you've followed through on. Pat yourself on the back and be grateful that you've been able to do what you intended. For instance, if you've resolved to treat your body better, look at how well you've done. Maybe you've stopped drinking so much or maybe you're exercising more. Maybe you've just stopped berating yourself about your body! Whatever it is, celebrate it!"
    }
  ]
}