{
  "url": "https://www.wikihow.com/Fix-a-Leaky-Hand-Held-Shower-Head",
  "title": "3 Easy Ways to Fix a Leaky Hand Held Shower Head",
  "steps": [
    {
      "title": "Take the shower head off of the hose.",
      "content": "Take the shower head off of the hose. If your shower head leaks when the water is turned on from the joint where the water line feeds into the shower head, you probably have a faulty washer. [1] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source If your shower head has a button where you release it, press that and pull it off. If there isn’t a button, wrap a cloth around the joint and loosen the nut holding the shower head in place by turning it counterclockwise to release it. [2] X Research source You may be able to loosen the nut by hand, but you’ll likely need to use a wrench or channel locks. This process is identical if the hose is leaking where it feeds into the wall. The only difference is that you’d loosen the nut at the wall, not under the shower head. You do not need to shut your water line off to do this."
    },
    {
      "title": "Pull out the rubber washer on the inside of the shower head opening.",
      "content": "Pull out the rubber washer on the inside of the shower head opening. Look on the inside of the shower head where it was locked into the hose. There should be a rubber washer (also known as an O-ring or gasket). Use pliers or the tip of a flathead screwdriver to remove this washer. [3] X Research source If your leak was at the joint where the hose feeds into the wall, remove the washer inside of the hose instead. There’s nothing holding or locking the washer in place. It’s just going to be sitting in a small grove inside of the opening. You may even be able to knock the washer out just by tapping the base of the shower head against your palm."
    },
    {
      "title": "Take the washer to the hardware store and get a replacement.",
      "content": "Take the washer to the hardware store and get a replacement. These rubber washers are not universal per se, but you should be able to find a nearly-identical replacement. Just take it to the store with you and compare it to the other gaskets they have available. So long as the washer is the right circumference, it will work. [4] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 29 March 2021. Pick up a few replacements if you can. These washers deteriorate over time and they shouldn’t cost more than a few cents. Having a stack of extras around may make things easier in the future!"
    },
    {
      "title": "Replace the washer and reassemble the hose.",
      "content": "Replace the washer and reassemble the hose. Put your new washer into the shower head. You don’t need to reassemble anything or add additional pieces—just put it in place where you removed the old washer and screw or slide the shower head back into place. This should resolve your leak! [5] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 29 March 2021. If you’re putting a washer back in the joint where the hose connects to the wall, wrap a few layers of Teflon tape around the threading on the pipe in the wall. That will ensure a clean and secure connection. [6] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Order a replacement cartridge from the shower’s manufacturer.",
      "content": "Order a replacement cartridge from the shower’s manufacturer. If your shower head drips when the water is off, the problem actually isn’t the shower head—the regulating device behind the handle that controls the flow of water. Look on, around, and behind the handle for a serial number and brand name. Enter that information online followed by “cartridge” and order a replacement. [7] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 29 March 2021. Depending on the brand and model, this can run you anywhere from $15 to $200. It just depends on how modern and fancy the cartridge design is. You may need to do some digging online if there isn’t a visible brand name or serial number online. Reach out to the manufacturer before you pay for a replacement—some brands have a lifetime guarantee on the cartridges. This is a very doable DIY job. However, if you don’t have a lot of experience doing home repairs or your cartridge model looks especially elaborate, you’re probably better off hiring a plumber or handyman to do this one."
    },
    {
      "title": "Turn off the water supply for your shower.",
      "content": "Turn off the water supply for your shower. If you have separate water lines in your boiler room for each source of water in your home, use the key that came with the house to shut the water line for your shower. If you don’t have separate water lines, locate the main shutoff valve for your home’s water and turn it counterclockwise all the way. Turn the water on in a random sink to make sure the water is off before proceeding. [8] X Expert Source David Balkan Professional Plumber & CEO of Balkan Sewer & Water Main Expert Interview. 29 April 2021. If you have a lever-style valve, you typically only need to turn the handle 90 degrees to shut the water off."
    },
    {
      "title": "Remove the handle using a screwdriver or hex key.",
      "content": "Remove the handle using a screwdriver or hex key. This process is different from handle-style to handle-style. If you see a screw in the center of the dial (on the front), use a Phillips head screwdriver to loosen and remove the screw. Then, pull the dial off. If there’s a hex key behind the handle, loosen that all the way and pull the handle off. [9] X Research source Put the drain stopper on or fill the drain with a rag. This way, if you drop a screw, it won’t fall down the drain. If the handle or dial doesn’t come off with a little pressure, use a flathead screwdriver to gently pry the handle off of the fixture. It might require a fair bit of force to get it off, but you should be able to remove it. [10] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 29 March 2021. Some handles have brackets in between the handle and the wall that you need to loosen in order to remove the handle. If there isn’t a hex key or handle, look online for how to remove it. Many shower handle manufactures publish their manuals online."
    },
    {
      "title": "Loosen the bracket if the cartridge doesn’t pop out easily.",
      "content": "Loosen the bracket if the cartridge doesn’t pop out easily. With the handle off, you should see a pin sticking out of a round assembly. This is your cartridge. Tug it gently to see if it comes out freely. If it does, remove it and continue on. If it doesn’t, use pliers or channel locks to loosen the round bracket on the outside of the cartridge by twisting it. [11] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 29 March 2021. If there is a bracket, be gentle. There’s probably a finish on it, and you won’t want to scratch it. If you warp the bracket, you may not be able to put it back in place."
    },
    {
      "title": "Slide the old cartridge out and check for debris.",
      "content": "Slide the old cartridge out and check for debris. With the bracket loosened, the old cartridge should slide right out. If it sticks a bit, use pliers to grab the pin and slide it out. Once the old cartridge is removed, shine in flash light in the opening to see if there’s debris in there (this may have been the source of the leak). If there is, remove it with your finger, a rag, or the tip of a screwdriver. [12] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 29 March 2021. Do not skip the flashlight! If you put a new cartridge into the opening without removing the problem, your leak may re-develop in the future. If the cartridge is super worn out and old but you don’t see any debris, you probably have hard water . [13] X Research source"
    },
    {
      "title": "Put the new cartridge into the slot and replace the bracket and handle.",
      "content": "Put the new cartridge into the slot and replace the bracket and handle. Slide the new cartridge into place with the metal pin sticking back out the same way your old cartridge was. Then, put the bracket back in place and tighten it by hand. Once you can’t turn it further, use your pliers or channel locks to turn it 2-3 more times. Put your handle back on the same way you took it off. [14] X Expert Source Dave Jones Master Plumber, Roto-Rooter Plumbing & Water Cleanup Expert Interview. 29 March 2021. Don’t overtighten the bracket! You don’t need it to be hyper-tight for the connection to be secure. Turn the water back on at your supply line and check to see if the leak is gone. If it is, you fixed it! If it isn’t, you’ll need to call a plumber."
    },
    {
      "title": "Soak the shower head in vinegar if the nozzles are leaky.",
      "content": "Soak the shower head in vinegar if the nozzles are leaky. If the nozzles where the water comes out are all leaky and sporadic whenever you take a shower, they’re probably dirty. Remove the shower head from the hose and soak in a bowl of distilled white vinegar for an hour or so. Then, rinse it off and put the shower head back in place. It should run like brand new! [15] X Research source This is fairly normal, especially if you have hard water. Calcium and mineral deposits just build up over time inside of the shower head."
    },
    {
      "title": "Replace the shower head entirely if it’s damaged.",
      "content": "Replace the shower head entirely if it’s damaged. If your shower head is leaking because it was dropped, you probably just have to replace it. Remove the shower head and take it a home improvement store. Pick up a shower head of your choice with an identical diameter on the pipe connection and follow the instructions to install it. [16] X Research source You normally just need to clean the connection on the hose, add a few layers of Teflon tape, and screw the shower head into the hose. Some handheld shower heads just snap into place."
    },
    {
      "title": "Contact a plumber if the leak is in the wall.",
      "content": "Contact a plumber if the leak is in the wall. When you’re investigating the source of a leak, you may trace the leak behind your wall. If you do, contact a plumber. It can be difficult for a non-professional to solve piping issues behind the wall, especially if you have to remove any tile or drywall. These problems aren’t typically super hard to fix, but you likely cannot resolve them without help. [17] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source There are a ton of different nuts, connections, and joints in the piping behind your shower head. Knowing exactly what you need to do to resolve the problem can be very hard for a layman."
    }
  ]
}