{
  "url": "https://www.wikihow.com/Make-a-Shoe-Wider",
  "title": "How to Make a Shoe Wider",
  "steps": [
    {
      "title": "Put on a thick sock and slip on your shoe.",
      "content": "Put on a thick sock and slip on your shoe. Find the thickest sock that you own that will fit inside the shoe you want to widen. [1] X Expert Source Trent Potter Shoe Care & Repair Specialist Expert Interview. 22 April 2021. If you don’t have a particularly thick sock, try wearing several thinner socks on your feet. [2] X Research source This blow-drying method works best on leather and suede shoes."
    },
    {
      "title": "Heat the area that feels tight with a hairdryer for 20 – 30 seconds.",
      "content": "Heat the area that feels tight with a hairdryer for 20 – 30 seconds. As you blow hot air onto your shoe, move your foot around inside your shoe. Push your foot against the area you want to widen to stretch the material. [3] X Research source If the area still feels tight after blowing hot air on it for 20 – 30 seconds, let it cool and then repeat the process. Avoid blowing hot hair on your leather shoe for more than 20 – 30 seconds at a time. Applying continuous heat for long periods may damage your shoe."
    },
    {
      "title": "Try on the shoe with a normal sock once it starts to feel loose.",
      "content": "Try on the shoe with a normal sock once it starts to feel loose. Let your shoe cool down before taking it off. Then, slip off the thick sock and put on the type of sock that you would normally wear with the shoe. [4] X Research source If the shoe still feel too snug, slip your thick sock and shoe on again and repeat the blow-drying process."
    },
    {
      "title": "Apply leather conditioner to your leather shoe to restore moisture.",
      "content": "Apply leather conditioner to your leather shoe to restore moisture. The hot air from your hairdryer will dry out your leather shoe. Applying a leather conditioner or cream immediately after blowing your shoe with hot air will help prevent the leather from cracking and could soften it so it's easier to stretch. [5] X Expert Source Trent Potter Shoe Care & Repair Specialist Expert Interview. 22 April 2021. [6] X Research source Gently rub the leather conditioner onto your shoe as if you were applying moisturizer to your skin."
    },
    {
      "title": "Place a sealable plastic bag in your shoe.",
      "content": "Place a sealable plastic bag in your shoe. Position the bag so its bottom is laying on the bottom of the inside of your shoe. Then, use your hand to spread the bag out so that it molds to the shape of your shoe. [7] X Research source A 1 US gal (3.8 L) sized bag should be large enough for most shoes. Place a second bag inside this first one if you’re nervous about water leaking into your shoe."
    },
    {
      "title": "Pour water into the bag until your shoe is full.",
      "content": "Pour water into the bag until your shoe is full. Use a liquid measuring cup or pitcher to fill the bag with water. Once your shoe is full of water, seal the bag securely so that no water will leak out. [8] X Research source Pour the water into the bag slowly so that you don’t accidently spill any onto your shoe. If you’re using 2 bags, be sure to tightly seal the outside bag as well."
    },
    {
      "title": "Leave the shoe in your freezer overnight.",
      "content": "Leave the shoe in your freezer overnight. Once you’ve filled your shoe with water and have sealed the bag closed, put it in your freezer. The water will expand as it freezes, pushing outward against the inside of your shoes, stretching them. [9] X Research source As the water turns into ice, it will expand by around 9 percent."
    },
    {
      "title": "Take the ice-filled bag out of your shoe.",
      "content": "Take the ice-filled bag out of your shoe. In the morning, remove your shoes from the freezer. Let the ice thaw for about 20 – 30 minutes, or until you can remove the ice-filled bags without causing them to tear. [10] X Research source Once you’ve taken the bag out, try on your shoes and see how they fit. If your shoes still don’t feel wide enough, try repeating this process. This freezing water method works best for shoes made of non-leather materials, including plastics, faux leather, and fabric, but should work for any kind of shoe."
    },
    {
      "title": "Reduce the width of the toe block before inserting it into your shoe.",
      "content": "Reduce the width of the toe block before inserting it into your shoe. On most shoe stretchers, you’ll turn the handle counterclockwise to reduce the width of the stretcher. If you have a two-way stretcher (a shoe stretcher that can make your shoe wider and longer), you’ll also need to adjust the heel block so that it’s as close to the toe block as possible. [11] X Research source Models of shoe stretchers vary, so read the owner’s manual for your specific model before using it for the first time. Shoe stretchers work best for leather shoes, flats, and oxfords, but should work for any kind of shoe, as long as the shoe stretcher you use is narrow enough to fit inside it. [12] X Research source"
    },
    {
      "title": "Insert the stretcher into your shoe.",
      "content": "Insert the stretcher into your shoe. Make sure you’ve adjusted your shoe stretcher to its smallest size. Then, push the shoe stretcher as far as it will go into your shoe. [13] X Research source If the shoe stretcher is too wide, try another stretcher or one of the other methods listed above."
    },
    {
      "title": "Turn the widening handle to widen your shoe.",
      "content": "Turn the widening handle to widen your shoe. Turn the widening handle until you start to feel resistance. [14] X Expert Source Trent Potter Shoe Care & Repair Specialist Expert Interview. 22 April 2021. Then, give it another 3 turns. [15] X Research source On most shoe stretcher models, you’ll turn the widening handle clockwise to widen the toe block. Other shoe stretchers may operate differently, so be sure to read the instructions that came with your specific model."
    },
    {
      "title": "Keep the shoe stretcher in your shoe for 6 – 8 hours before removing it.",
      "content": "Keep the shoe stretcher in your shoe for 6 – 8 hours before removing it. To remove the shoe stretcher, turn the widening handle counterclockwise to close the toe block. When the stretcher feels loose in the shoe, slide it out slowly and gently. [16] X Research source If you remove the shoe stretcher without waiting 6 – 8 hours, the stretch may not be permanent. If your shoe still feels tight, repeat the shoe stretching process."
    }
  ]
}