{
  "url": "https://www.wikihow.com/Is-Chime-Legit",
  "title": "Everything to Know About Chime: Legitimacy, FDIC & Neobanking",
  "steps": [
    {
      "title": "Chime is a legitimate online financial service.",
      "content": "Chime is a legitimate online financial service. Chime partners with The Bancorp Bank, N.A. and Stride Bank, N.A., which are both FDIC insured. [1] X Research source Overall, Chime has good ratings from top trusted financial review aggregators, including NerdWallet, which gave Chime a 4 out of 5 star rating. [2] X Research source FDIC deposit insurance protects your money in the event of a bank failure or closure. Deposits include checking accounts, savings accounts, CDs (certificate of deposit accounts), and MMDAs (money market deposit accounts). [3] X Research source Deposits are insured up to at least $250,000 per depositor, per bank, per ownership category (i.e. trust accounts, business accounts, single accounts, etc.). While Chime's partner banks are FDIC insured, the FDIC does not insure the closure of non-bank entities such as neobanks. [4] X Research source This means that if one of Chime's partner banks closes, you are insured by the FDIC, but if Chime closes, you are not."
    },
    {
      "title": "Chime is a financial technology (fintech) company, not a bank.",
      "content": "Chime is a financial technology (fintech) company, not a bank. It's what is known as a \"neobank,\" which is an online tech company that provides banking services by working with partnered banks. As such, some people may feel uncomfortable because Chime has no brick-and-mortar banks and all money handling is done online. [5] X Research source However, while neobanks are fintech companies, Chime's partnership with legitimate, FDIC-insured banks means your money will stay as safe as it would if you went through a traditional bank. [6] X Research source"
    },
    {
      "title": "Recently, customers have complained about Chime closing their accounts.",
      "content": "Recently, customers have complained about Chime closing their accounts. Many users have submitted complaints with the Consumer Finance Protection Bureau stating that Chime closed their accounts without notice. [7] X Trustworthy Source US Consumer Financial Protection Bureau U.S. government agency for protecting consumers in the financial sector Go to source In 2021, Chime stated to ProPublica that many of these account closures were due to suspected fraud after government stimulus payments, though admitted some of these closures may have been a mistake. [8] X Research source"
    },
    {
      "title": "Chime offers some services that traditional banks do.",
      "content": "Chime offers some services that traditional banks do. As Chime is not a bank, it doesn't offer everything a traditional bank can, such as loans, mortgages, wealth management, money orders, cashier's checks, and more. However, if you're just looking for a simple, online option for checking and savings accounts, Chime's offerings will fit your needs. Chime offers three different types of accounts: a checking, savings, and credit builder account. Checking account: Chime offers a standard checking account that can be opened by any U.S. resident who is 18 or older and has a valid social security number. Chime's checking account has no monthly or transaction fees, and you can deposit money via mobile deposit (paper checks) or in-person cash deposits at various retailers (such as Walmart, Walgreens, Target, or CVS). Chime checking accounts are, however, not eligible to be joint accounts. Savings account: Chime also offers a 2% APY savings account. You must have a Chime checking account before you can open a Chime savings account. You can transfer money over easily from your checking account, and Chime offers two automated savings programs to help you save after every transaction or direct deposit. You also don't need to maintain a minimum balance. Credit builder: Chime offers the Chime Credit Builder Secured Visa Credit Card, which is aimed at helping users build their credit . To be eligible you must have a Chime checking account and must have received at least one $200 direct deposit into your Chime checking account from your employer. If you apply and are approved, you can deposit money into your credit builder card as a security deposit, which is the amount of money you can spend on the card."
    },
    {
      "title": "Chime has very few fees.",
      "content": "Chime has very few fees. Chime doesn't charge a minimum balance fee, monthly/annual maintenance fees, foreign transaction fees, or overdraft fees. However, Chime does charge a $2.50 transaction fee for out-of-network ATMs. [9] X Research source Chime offers fee-free ATMs at Target, CVS, Circle K, 7-Eleven, and Walgreens. [10] X Research source"
    },
    {
      "title": "Chime has a number of pros:",
      "content": "Chime has a number of pros: Chime charges very few fees Chime's app is intuitive and simple to use Applying to Chime is quick and easy Chime can be used with CashApp or some cash advance apps Chime's Credit Builder can help customers with low credit work on building their score"
    },
    {
      "title": "Chime also has some cons:",
      "content": "Chime also has some cons: Chime has no physical locations Chime doesn't allow joint accounts Some ATMs may charge an out-of-network fee There have been some recent complaints about Chime closing accounts Chime does not work with Zelle"
    },
    {
      "title": "Chime is a neobank, and neobanks themselves have some pros:",
      "content": "Chime is a neobank, and neobanks themselves have some pros: Convenient, since you don't have to drive to a bank Good for people who get direct deposit payments Good for people who don't go to a bank in person often Neobanks usually have lower fees than traditional banks Neobanks usually offer higher savings interest rates than traditional banks Most neobanks partner with FDIC insured banks to offer their services"
    },
    {
      "title": "Neobanks also have some overarching cons:",
      "content": "Neobanks also have some overarching cons: Neobanks offer fewer services than traditional banks (no loans, wealth management, etc.) Neobanks typically don't have the same level of customer service as traditional banks Neobanks are a new concept, so it's harder to know if one can be trusted If a neobank itself closes, you may have a hard time retrieving your money, as the FDIC only insures banks"
    }
  ]
}