{
  "url": "https://www.wikihow.com/Ignoring-a-Narcissist",
  "title": "How to Ignore a Narcissist & How They’ll Respond",
  "steps": [
    {
      "title": "They may ignore you back.",
      "content": "They may ignore you back. When you stop responding to someone who behaves in a toxic way, they may give you the silent treatment right back. A person with narcissistic traits may “stonewall” you and stay quiet because they want to feel like they’re in control of the situation. They’ll hope that you feel more uncomfortable than they do and break the silence to reach out first. [2] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source Rather than giving in and communicating, look for some self-soothing activities to do on your own instead. Get some exercise, meditate on your feelings, or journal about how their silence makes you feel."
    },
    {
      "title": "They could gaslight you.",
      "content": "They could gaslight you. After you go quiet, this person may try to convince you that a situation or event happened differently than you remember. They could tell you that there was never an issue between you or that you misunderstood what their intentions were. They may believe what they’re saying, even if it wasn’t true, just to see if you’ll change your mind and reach out again. [3] X Research source Some common gaslighting phrases could be, “That’s not what happened,” “You’re overreacting,” or “What? It was only a joke!” Respond to gaslighting by refusing to engage or argue about what really happened. You know the truth of the situation, so you don’t have to defend yourself from someone who’s trying to manipulate you."
    },
    {
      "title": "They may act nice to try winning you back.",
      "content": "They may act nice to try winning you back. You may have good memories where this person made you feel special as you got to know each other. Once they let their true colors show and you start ignoring them, a manipulative individual may try “hoovering” to pull you right back in. They may make a fake apology, give you compliments, or try to smooth-talk their way out of your decision so they don’t lose you. Even if they’re acting nice, they still may never apologize or recognize the wrongs they’ve done. Someone who’s self-centered or toxic is afraid of losing control over people, so they may love-bomb you with kind words or gifts to feel like they can pull you back in. While it may be tempting to fall for their tricks, it’s just another way that they’re manipulating you back into an unhealthy relationship. Reader Poll: We asked 264 wikiHow readers for their most effective way to protect themselves from love bombing, and 55% of them said, recognizing and setting healthy boundaries. [Take Poll]"
    },
    {
      "title": "They could feel anxious or scared.",
      "content": "They could feel anxious or scared. Most people with narcissistic traits want to feel like they’re at the top and the most important part of your life, so they start feeling uncomfortable once you stop responding. They may text you asking what’s wrong and worry about why you’re not replying to them. In reality, they’re worried that their true selves are being exposed and that other people will catch on to their act as well. [4] X Research source You don’t need to respond even if they say they’re scared or anxious about their relationship with you. It’s better to just keep ignoring them so you don’t give up any control."
    },
    {
      "title": "They may get angry with you.",
      "content": "They may get angry with you. Someone with narcissistic qualities wants to feel better about themselves, so they keep people around who can help boost their egos. When you suddenly stop giving them what they want, there’s a chance they’ll get really upset and call you selfish for not meeting their needs. They may send angry messages or call you when they’re upset to try getting what they want. [5] X Research source Continue ignoring an angry person since it’s not worth arguing or getting involved. Even if you try to explain yourself and are in the right, they may twist your words and try making you feel bad for their outburst."
    },
    {
      "title": "They might shift the blame to you.",
      "content": "They might shift the blame to you. Someone who’s demonstrated narcissistic behaviors may avoid taking accountability for their actions, so they’ll say that you’re the one that caused an issue in your relationship. If you’re ignoring someone that ignored you, they may not even recognize that they’re doing the same thing and feel like they’re being criticized unfairly. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It’s better not to respond if this person tries to blame you. You know in your heart that it was their behavior that caused the rift, not yours."
    },
    {
      "title": "They may talk badly about you.",
      "content": "They may talk badly about you. If you’re the one that started ignoring them first, they may feel like they’ve been rejected and get upset. There’s a chance that they’ll try to spread lies about you to feel better about themselves rather than sitting with the shame or insecurity they have. [7] X Research source If you hear a lie that this person spread, compare what they say to the actual truth of what happened. Trust yourself and avoid questioning how you perceived and interpreted the situations."
    },
    {
      "title": "They could try to keep tabs on you.",
      "content": "They could try to keep tabs on you. After you cut off communication with them, someone with narcissistic traits may continue checking your social media pages to see how you’re doing. They may also try to see you while you’re at work or ask friends and family how you’re doing to feel like they’re still a part of your life even if you’re not talking to them directly. [8] X Research source Block the person from your social media pages or hide your posts from them so they’re not able to interact with you."
    },
    {
      "title": "They might try turning friends and family against you.",
      "content": "They might try turning friends and family against you. If a person feels like you’ve wronged them or aren’t giving them control, they could tell lies to your friends and family members about what happened. They may say that you’re cutting them off and try to get others to sympathize with them rather than taking responsibility for their actions. [9] X Research source Chat with your friends about the person’s behavior. Even if they seem charming to your friends and family, your loved ones will trust your experiences more."
    },
    {
      "title": "They may move on to someone else.",
      "content": "They may move on to someone else. If someone sees that you’re not going to respond no matter what they do, they’ll recognize that they don’t have control over you anymore. If they can’t do anything to make you come back to them, they’ll likely start looking for someone else that they can easily influence. [10] X Research source If someone who’s abused you in the past is talking or starting a relationship with someone you know, give them a warning about your experiences with the person. That way, your friend will know what to look out for and stand up for themselves if they experience the same behavior."
    },
    {
      "title": "They could try to sabotage you.",
      "content": "They could try to sabotage you. Some people with narcissistic tendencies may get vengeful when things don’t go their way, so they’ll try to do things that block meaningful opportunities in your life. They may try to prevent you from moving up in your career, destroy personal belongings that are important to you, or may even act out violently. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If someone starts harassing you or turns violent, contact the authorities and let them know about the issue. Don’t try to get involved on your own so you don’t risk getting hurt."
    },
    {
      "title": "Cut off or limit your contact with them.",
      "content": "Cut off or limit your contact with them. If you can, go no-contact and stop responding to show that they don’t have any control over your life. Avoid responding to their texts, calls, and DMs, and give them the silent treatment. If you can’t avoid them, like if they’re your coworker, co-parent, or classmate, try to keep your conversations brief and to the point. [12] X Research source Use the Gray Rock method to communicate with someone who has manipulated you. Rather than wearing your emotions on your sleeve, try to show as little emotion as possible when you have to communicate with them. If they can’t get a rise out of you, they’ll get more flustered."
    },
    {
      "title": "Set and maintain clear boundaries.",
      "content": "Set and maintain clear boundaries. When you set your boundaries , decide on what behavior you’ll tolerate and what you will no longer stand for in a relationship. If the person who’s hurt you tries to communicate with you, state your boundary clearly without any hesitation or defensiveness. Use a clear and firm voice and avoid trying to negotiate since they may try to break you down. Example: If you’re setting a boundary with a coworker, you may decide to only respond to questions about work duties but not open up about your personal life. You may say, “I’ve said that I don’t want to talk about my personal life, and would appreciate it if we kept our conversations work-related.\" Example: If a co-parent gets upset and starts raising their voice, you could say, “I’m not going to communicate with you when you raise your voice.” Then, wait for them to calm down before talking again. Be sure to enforce your boundaries every time they’re broken. If you let something slide once, a person who tends toward manipulation may keep pushing and try to break the boundary even more."
    },
    {
      "title": "Work toward personal goals.",
      "content": "Work toward personal goals. Invest your time into your passions and the things that you love doing so you can feel independent from someone with abusive behaviors. Focus on your interests and hobbies so you feel the most fulfilled in your life. Set goals for your personal projects and for your career that are specific to what you want to achieve in life. As you complete the things you want to, you won’t hold onto any feelings you have for the person trying to control your life. [13] X Research source Create SMART goals that are Specific, Measurable, Attainable, Realistic, and Time-sensitive. For example, you might set a goal to complete a 10,000-word short story in a month or shave 30 seconds off your 1-mile run time within 6 weeks."
    },
    {
      "title": "Spend time with friends and family that support you.",
      "content": "Spend time with friends and family that support you. Reach out to your loved ones and let them know that you’re trying to ignore a person who’s causing harm in your life. Talk about how you’re feeling and ask for their support through it all. Try to find activities that you can do together to help take your mind off the situation. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you’re really struggling to deal with someone who behaves in a narcissistic way , reach out to a therapist or check for any abuse recovery programs offered in your area. They can help you recognize that the person’s behaviors aren’t your fault and give helpful insight. A therapist may also help you understand the other person’s behavior. While there’s no excuse for any kind of abuse, it may help to understand that someone with a legitimate NPD diagnosis cannot always control their behaviors. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Someone with NPD is likely suffering from a lack of empathy and deep insecurities, and they may genuinely struggle to form relationships with other people. While these facts don’t mean that you need to keep this person in your life, it may help you better understand them and find peace in the situation."
    },
    {
      "title": "Reflect on what you need in a relationship.",
      "content": "Reflect on what you need in a relationship. Take a minute to think about what you’re looking to get out of a friendship or relationship that your ex-partner or friend wasn’t giving you. What values are important to you and how can your relationships reflect them? What needs need to be met for you to feel fulfilled? What are your expectations for the other person you’re close with? Once you find what you want out of a relationship , search for people who have those values and spend time with them."
    },
    {
      "title": "Recognize abusive or manipulative behaviors so you avoid them in the future.",
      "content": "Recognize abusive or manipulative behaviors so you avoid them in the future. Be wary of people who have controlling behavior and want you to act in a certain way to make them happy. Also be on the lookout for people who refuse to take accountability, blame you for your wrongdoings, and have trouble showing empathy towards tough times you’re experiencing."
    },
    {
      "title": "Someone who’s hurt you may change if they see the negative impacts they’re causing.",
      "content": "Someone who’s hurt you may change if they see the negative impacts they’re causing. If they see that the relationships in their personal or professional lives are breaking down, they may begin to understand how their behavior negatively impacts people. While it may take a lot of motivation and effort for this person to completely change their ways, they can still manage their behaviors if they set their mind toward being more empathetic and understanding of others. If a person works with a therapist, it’s a good sign they want to make a meaningful change. A therapist can help a person find the root cause of their behavior, challenge how they handle situations, and offer helpful insight to change how they interact with others."
    }
  ]
}