{
  "url": "https://www.wikihow.com/Fire-Raku-Pottery",
  "title": "How to Fire Raku Pottery",
  "steps": [
    {
      "title": "First you need to glaze your bisque ware using RAKU Glaze.",
      "content": "First you need to glaze your bisque ware using RAKU Glaze. These glazes have a low melting point so they will mature at cone 06 in about an hour.***note: many of these glazes work better of applied in a thin layer*** It is better to wax the bottom if you dip and glaze the objects to prevent the glaze from getting onto the part that touches the kiln shelf. If you brush and glaze, you need not wax it because you can control where exactly you are putting the glaze. You can use a soft bristle brush and follow the manufacturer's directions for the product you are using. Let one coat dry before applying the next one."
    },
    {
      "title": "Next, load the kiln and bring the temperature up to 1850 degrees.",
      "content": "Next, load the kiln and bring the temperature up to 1850 degrees. This should take about an hour. If you don't know how to fire a kiln, you should have an experienced potter help you. [1] X Research source If you are using pyrometric cones or a pyrometer, skip this step.~~ Check on the ware every 15 minutes or so after you've been firing for about 45 minutes. You're looking for bubbling in the glaze. Once it starts bubbling, you're about 15 minutes away from \"Raku Time!\""
    },
    {
      "title": "You know your ware is ready to pull when it is glowing red and the glaze surface appears shiny and liquid.",
      "content": "You know your ware is ready to pull when it is glowing red and the glaze surface appears shiny and liquid. Matt glazes are more difficult to read, so fall back on your cones/pyrometer reading if you need to."
    },
    {
      "title": "While you're waiting for the glaze to mature, you need to prepare your reduction chambers.",
      "content": "While you're waiting for the glaze to mature, you need to prepare your reduction chambers."
    },
    {
      "title": "Shred newspaper and fill some small metal cans.",
      "content": "Shred newspaper and fill some small metal cans. The cans should only be a little bigger than the pieces you want to put in them, the smaller the better to create a good reduction and lots of pretty color!"
    },
    {
      "title": "Once the pieces are ready, you're going to need 3 people to do the Raku.",
      "content": "Once the pieces are ready, you're going to need 3 people to do the Raku. (1)One to open the door, (2)one to pull the pieces out with tongs and place them in the cans, and (3)one to close the can lids. Each person should have a set of Raku gloves and appropriate eye protection. You may also want to wear dust masks as it's gonna get smoky!"
    },
    {
      "title": "Person 1 opens the door while Person 2 takes the pieces out one at a time.",
      "content": "Person 1 opens the door while Person 2 takes the pieces out one at a time. The door should be closed between pulls to retain heat. Place the pieces as quickly as possible into the waiting cans. Person 3 should wait for the newspaper to catch fire, then fit the lids on securely to smother the fire and smoke the pieces. **Note, always try to turn bowls upside down so the inside gets better color**"
    },
    {
      "title": "Wait a few minutes for the fires to smother and smoke the pieces.",
      "content": "Wait a few minutes for the fires to smother and smoke the pieces. Good cans shouldn't release too much smoke when covered, so be careful when you open them up. Keep your face away from the openings as you take off the lids. Also watch out for back drafts."
    },
    {
      "title": "THESE PIECES ARE STILL VERY VERY HOT!",
      "content": "THESE PIECES ARE STILL VERY VERY HOT! Any remaining newspaper will begin to burn again once air is introduced back into the can. You can pour some water into the cans to put them out and cool the ware."
    },
    {
      "title": "Take the pieces out with tongs and douse them in the bucket of water.",
      "content": "Take the pieces out with tongs and douse them in the bucket of water. **DO NOT DO THIS TO BOTTLES*** Bottles will explode if you douse them, allow bottles to cool naturally."
    },
    {
      "title": "Done.",
      "content": "Done."
    }
  ]
}