{
  "url": "https://www.wikihow.com/Make-Sage-Green-Paint",
  "title": "How to Make Sage Green Paint",
  "steps": [
    {
      "title": "Mix 2 parts yellow paint to 1 part blue to make a basic green.",
      "content": "Mix 2 parts yellow paint to 1 part blue to make a basic green . These are two colors that every artist should have on hand. Artist Kelly Medford suggests using a \"primary palette when you paint, meaning a warm and cool selection of each primary color plus white. This gives you [the ability to mix] more colors than you can imagine.\" In a bowl or on a plate, use a paintbrush or palette knife to combine your colors. Stir them until there are no streaks left in your paint. The result is a vibrant, classic green. [1] X Research source True green is equal parts yellow and blue. To make sage, more yellow is preferred."
    },
    {
      "title": "Add 3 parts yellow paint to the basic green to make it a bright grass green.",
      "content": "Add 3 parts yellow paint to the basic green to make it a bright grass green. The amount of yellow you use should equal the amount of green you made earlier. Mix thoroughly with your brush or knife, making circular motions until the colors are evenly blended. Try using a measure, such as 1 tablespoon (15 mL), to ensure the parts of paint are equal in size."
    },
    {
      "title": "Mix a separate blob of 3 parts white to 1 part black to create gray.",
      "content": "Mix a separate blob of 3 parts white to 1 part black to create gray. The size of the parts here should be about the same as the parts you used to make your grass green. The result is a neutral, medium-light gray color. Mix with a clean brush or knife that doesn’t have any green, blue, or yellow paint on it. [2] X Research source Make your gray darker for a more subdued sage. Try a 1:1 ratio of white to black to start. Adding white will lighten your gray, while adding black will darken it. It only takes a small amount of black to darken, but it takes lots of white to lighten. To ensure the parts of paint are equal in size, use the same measure (1 tablespoon (15 mL)) you used to create your grass green paint."
    },
    {
      "title": "Stir the grass green and gray together to create sage green paint.",
      "content": "Stir the grass green and gray together to create sage green paint. Use the full amount of gray and green you made to get a standard shade of sage, or try mixing in small amounts of gray at a time until you find the shade you’re looking for. Remember, you can always add more paint, but you can’t take it out! If your sage starts looking too dark, add more of your grass green to balance out the gray (and vice versa if it’s looking too bright)."
    },
    {
      "title": "Adjust the sage with small amounts of white, black, or gray (if desired).",
      "content": "Adjust the sage with small amounts of white, black, or gray (if desired). If you like the shade of sage you have but want it lighter, add white paint. If you want to make the shade darker, add a tiny amount of black. Add more gray to make a more subdued and somber sage, or add more grass green to make it livelier. [3] X Research source"
    },
    {
      "title": "Combine 2 parts yellow paint with 1 part blue to make a basic green.",
      "content": "Combine 2 parts yellow paint with 1 part blue to make a basic green. Mix the paint with a palette knife or paintbrush in a bowl or on a plate. Stir smoothly and thoroughly to evenly distribute the colors. [4] X Research source If you don’t have a way to precisely measure paint, err on the side of adding too much yellow rather than too much blue. In fact, according to Artist Kelly Medford, \"[to] mix a light green that has more yellow than blue, start with yellow and then slowly add blue until [you] get to the right value and hue.\""
    },
    {
      "title": "Add red paint one drop at a time to create sage.",
      "content": "Add red paint one drop at a time to create sage. Red is the opposite of green on the color wheel. As you add red, the green will begin to turn more green-brown or green-gray. Slowly add your red and mix after each added drop until you find the shade of sage you like. [5] X Research source When you’re using only these primary colors, think of sage green as a recipe: 2 parts yellow, 1 part blue, and just a dash of red for flavor. Red will overpower green quickly, so take your time adding it in."
    },
    {
      "title": "Adjust the sage with small amounts of red, green, white, or black.",
      "content": "Adjust the sage with small amounts of red, green, white, or black. If your new sage is looking too brown or red, balance it out by adding more of your green into the mix (and vice versa). Once you find the shade you like, lighten it with white paint or darken it with black paint. Black will overpower the sage quickly, so only add 1 drop at a time when you’re darkening. White is weaker and you’ll need to add more of it to lighten."
    },
    {
      "title": "Select the green paint you have that’s closest to sage.",
      "content": "Select the green paint you have that’s closest to sage. Imagine the shade of sage you want to end up with and take a look at your greens. A color like mint, camo green, or olive gives you a good starting point, although you can alter any shade of green to make sage. [6] X Research source"
    },
    {
      "title": "Add one drop of red paint at a time to turn the green into sage.",
      "content": "Add one drop of red paint at a time to turn the green into sage. Since red is the complementary color to green, it pushes the color toward the middle of the color spectrum (the gray-brown area) regardless of the shade of green you started with. Add small amounts of red at a time to avoid overpowering the green and mix thoroughly after each drop until you hit sage. [7] X Research source If the shade is too brown, add more green to balance it out. If your starting green was more on the blue side, add a “hotter” red that has some orange in it. If your green was more on the yellow side, add a “cool” red-purple or magenta color. The general rule is that cool reds will dull your greens and keep them cool, while hot reds will add warmth to the green."
    },
    {
      "title": "Adjust the brightness of your sage with black or white paint.",
      "content": "Adjust the brightness of your sage with black or white paint. Add white to lighten the color or black paint to darken it. If the whitened sage seems to lose its saturation or fullness (like a pastel green), you may need to incorporate more green or green-yellow to liven it up. As you are mixing, keep in mind Artist Kelly Medford's advice that \"color is relative to what it is next to,\" so what looks good on your palate may not be quite right in context on your painting.\" [8] X Research source Remember, black is a very strong color. You only need a drop to darken your sage paint."
    },
    {
      "title": "Experiment!",
      "content": "Experiment! There are many different shades and hues of sage you can get depending on the exact colors and proportions you're mixing together . Artist Kelly Medford suggests you \"experiment with your colors and their ratios\" so that you have a clear sense of what you like best. Once you get familiar with how the colors interact with each other, play around with different combinations and see all the new variations you can come up with. After all, painting is about creativity! [9] X Research source For inspiration about color combinations, use the color wheel (a circular chart that illustrates the relationships between all colors)."
    }
  ]
}