{
  "url": "https://www.wikihow.com/Play-on-the-PlayStation-2",
  "title": "How to Play on the PlayStation 2",
  "steps": [
    {
      "title": "Set up the PlayStation 2",
      "content": "Set up the PlayStation 2 . You can't play on the console if it's not set up in the first place. Setting up the PlayStation 2 console is not very hard and shouldn't take more than a few minutes, depending on how good you are with electronics. If needed, ask a friend, parent or sibling to help you set it up."
    },
    {
      "title": "Turn on the PlayStation 2.",
      "content": "Turn on the PlayStation 2. To turn on the PlayStation 2, you must make sure that the \"main power\" switch (located at the back of the console) is turned to the \"on\" setting. Without this switch on, the console will not work. When the switch is on, turn on the PlayStation by pressing the \"reset\" button on the front of the console. It should have a small green light."
    },
    {
      "title": "Attach the controllers.",
      "content": "Attach the controllers. The controllers for this console are not wireless so you will need to plug them in. There are some controller slots on the front of the console. Plug your control into controller slot number 1. The next control will go into controller slot number 2. Make sure the controllers are pushed all the way in to the slot. Also, make sure nobody will trip over the wires."
    },
    {
      "title": "Insert the memory cards.",
      "content": "Insert the memory cards. The memory cards are usually 8g but they can also come in 16g, which is usually more expensive. They can be inserted into the memory card slots which can be found next to the controller slots. If you don't have a memory card, you can't save any of your data so be sure to get one."
    },
    {
      "title": "Choose a game.",
      "content": "Choose a game. If you only have one game, that's the one that you will have to play. If you have a selection of games, choose one from there. If you don't like any of your games, you will have to buy some new ones. You can always invite your friends to bring their games around and you can all play together."
    },
    {
      "title": "Open the game tray.",
      "content": "Open the game tray. The game tray can be opened by pressing the small blue button on the front of the console. It should be next to the green button. You don't have to hold the button, just tap it."
    },
    {
      "title": "Put the game inside the game tray.",
      "content": "Put the game inside the game tray. Make sure that the game is sitting properly inside the tray before you close it. To check that the game is in there properly, gently move it around with your hand. If it falls off of the tray, it wasn't in there properly. If it stays on the tray, you can close it. If you close it while the game isn't on the tray properly, the game can get jammed inside the machine and break."
    },
    {
      "title": "Close the game tray.",
      "content": "Close the game tray. The game tray can be closed by pressing the same small blue button on the front of the console that you used to open it. If you just push the tray shut with your hand, you can damage it and it might stop working. Also, don't push the tray to make it shut faster, that can break it too."
    },
    {
      "title": "Let the game start up.",
      "content": "Let the game start up. Once the game has started up, you can play using the on screen instructions."
    }
  ]
}