{
  "url": "https://www.wikihow.com/Interstellar-Method-Shifting",
  "title": "Your Ultimate Guide to the Interstellar Shifting Method",
  "steps": [
    {
      "title": "Lie down and close your eyes.",
      "content": "Lie down and close your eyes. Lie in bed in the position that’s most comfortable for you. Clear your mind and let yourself relax. Focus on breathing deeply to calm yourself further, or relax using whatever method works best for you. [1] X Research source"
    },
    {
      "title": "Visualize waking up outside of a train station in space.",
      "content": "Visualize waking up outside of a train station in space. The interstellar method is similar to the train method, in which you ride a train to your desired reality. The main difference is that the train is in space rather than on Earth. Imagine waking up on a wooden bench overlooking the planet Earth. [2] X Research source Don’t be scared during this visualization. You can breathe oxygen as normal and you don’t have to worry about falling or coming into harm. Your desired reality, or DR, is the reality you’re shifting to. These are commonly pop culture worlds like Hogwarts. This shifting method may be named after the movie Interstellar ."
    },
    {
      "title": "Reach into your pocket and take out a numbered train ticket.",
      "content": "Reach into your pocket and take out a numbered train ticket. As you take in your surroundings, you’ll find a ticket for the next train. Imagine a number to connect you to your desired reality—this is important so choose a number that’s significant to you or easy to remember. When you look at your ticket, this number will be stamped on it in red. [3] X Research source"
    },
    {
      "title": "Board the train and sit down.",
      "content": "Board the train and sit down. When you look at the tracks, you see the train approaching. It stops in front of you and you get on. You can imagine other passengers or you can be the sole passenger; it’s up to you. When you look up, the roof of the train is clear and you can see all the colors of the galaxy above you. [4] X Research source"
    },
    {
      "title": "Ride the train to your DR.",
      "content": "Ride the train to your DR. The train ride can be as long or short as you like. Relax and look out the window at all the stars and planets or daydream and listen to some music. When you feel ready, imagine that the destination display screen shows “Reality: (your chosen number).” This means you’ve arrived at your DR. [5] X Research source"
    },
    {
      "title": "Exit the train and find your DR self sleeping.",
      "content": "Exit the train and find your DR self sleeping. As the train comes to a stop, the doors slide open to reveal your desired reality bedroom and you find the DR version of yourself sleeping. Look back at the train and the universe before stepping completely into your DR."
    },
    {
      "title": "Merge into your DR self and wake up in your DR.",
      "content": "Merge into your DR self and wake up in your DR. As you hear the doors close and the train pull away, that world disappears. You are now completely in your desired reality. Walk over to your sleeping self and merge into one. Open your eyes, and you’ll be your DR self. Now you’re ready to go explore your DR."
    },
    {
      "title": "Shifting is a practice that allows you to “wake up” in another world.",
      "content": "Shifting is a practice that allows you to “wake up” in another world. Shifting is a pop culture phenomenon in which believers say they truly exist in another reality. Shifters believe they can transfer their subconscious to another part of the multiverse and can create any reality they desire. However, this practice is not supported by science. [6] X Research source Shifting rose in popularity on social platforms like TikTok, Reddit, YouTube, and Amino after the WHO declared COVID-19 an international emergency. It is mainly practiced by Gen Z. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Shifters typically use a mix of meditation, affirmation, and visualization to move from their current reality (CR) into their desired reality (DR). DRs are typically based in pop culture universes like Harry Potter or Star Wars but they can be anything the shifter imagines. Shifting is based on the multiverse theory, which proposes there are infinite versions of yourself living in parallel universes. Most nonbelievers claim that shifting is a type of lucid dreaming, but most shifters argue that this is not the case."
    },
    {
      "title": "The Raven method",
      "content": "The Raven method To shift using the Raven method , lie down in a starfish position and count to 100 while reciting affirmations. Notice if you feel any shifting “symptoms” like flashing lights or feeling like you’re falling. Try to drift asleep while visualizing your DR. [8] X Research source Some example affirmations include “I am in my desired reality and I can feel it,” and “I am in my desired reality and my desired reality follows my script.” [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "The Pillow method",
      "content": "The Pillow method To use the pillow method , write a script for your DR about what you want your life to be like. Be as specific as possible and include details about yourself, the world, and the other people in your desired reality. Then, place the script under your pillow and imagine your DR while reciting your affirmations until you fall asleep. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "The Julia method",
      "content": "The Julia method To shift with the Julia method , meditate for 5-10 minutes while reciting positive “I am” affirmations. Slowly count to 100 while repeating identity affirmations about who you are in your DR. Visualize who you are and what you experience in your DR. When you feel ready, open your eyes to shift to your desired reality. While most shifting methods involve sleeping , this is one of the methods you can use while awake ."
    },
    {
      "title": "The Alice in Wonderland method",
      "content": "The Alice in Wonderland method For this method, lie on your back and imagine sitting against a tree. Then, picture someone from your DR running past you. Chase the character until you fall down a rabbit hole and find a key to unlock your DR. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}