{
  "url": "https://www.wikihow.com/Season-Pampered-Chef-Stoneware",
  "title": "How to Season Pampered Chef Stoneware",
  "steps": [
    {
      "title": "Remove the stoneware dish from the package.",
      "content": "Remove the stoneware dish from the package. Wash it by hand prior to the first use. In the future, it is not recommended that you use soap on your stoneware, or it will remove the seasoning. [1] X Research source"
    },
    {
      "title": "Dry the stoneware with a towel and set it aside.",
      "content": "Dry the stoneware with a towel and set it aside."
    },
    {
      "title": "Don’t use aerosol non-stick spray on the surface of the stoneware.",
      "content": "Don’t use aerosol non-stick spray on the surface of the stoneware. It can cause a sticky surface that prevents seasoning."
    },
    {
      "title": "Wait until you have seasoned your pan initially to use it in food preparation.",
      "content": "Wait until you have seasoned your pan initially to use it in food preparation."
    },
    {
      "title": "Preheat your oven to 425 degrees Fahrenheit (220 degrees Celsius).",
      "content": "Preheat your oven to 425 degrees Fahrenheit (220 degrees Celsius). You should not pre-heat the stoneware. It can be placed directly inside a preheated oven, even when refrigerated before use. [2] X Research source"
    },
    {
      "title": "Fill the inside of the stoneware item with vegetable oil before you use it.",
      "content": "Fill the inside of the stoneware item with vegetable oil before you use it. Fill it to two-thirds full. If you are using a muffin pan, fill each of the compartments two-thirds full of oil."
    },
    {
      "title": "Place the pan inside the pre-heated oven for 20 minutes.",
      "content": "Place the pan inside the pre-heated oven for 20 minutes. [3] X Research source"
    },
    {
      "title": "Remove the pan from the oven with oven mitts.",
      "content": "Remove the pan from the oven with oven mitts. Set it to cool on a wire rack or other sturdy surface. Turn off the oven."
    },
    {
      "title": "Let it cool for two to four hours.",
      "content": "Let it cool for two to four hours. The pan should cool completely and absorb some of the oil."
    },
    {
      "title": "Pour the oil off into a large bowl in the sink.",
      "content": "Pour the oil off into a large bowl in the sink. Reserve the oil for future seasoning or use. You can also funnel it back into an oil container."
    },
    {
      "title": "Wipe the inside of the container lightly with a paper towel.",
      "content": "Wipe the inside of the container lightly with a paper towel. Then, bake with it within the next few days."
    },
    {
      "title": "Dip a paper towel in oil and rub it around the inside of the stone surface before you use it during the next two to three uses.",
      "content": "Dip a paper towel in oil and rub it around the inside of the stone surface before you use it during the next two to three uses. Then, it should remain coated so that you have a non-stick surface for the remaining time you use it. Keep in mind that the darker and “dirtier” the stoneware looks, the better the surface will be for baking. The light coating of oil will stay on the pan, so that you don’t need to add too much oil or fat."
    }
  ]
}