{
  "url": "https://www.wikihow.com/Set-Up-Chromecast-WiFi",
  "title": "How to Set Up a Chromecast with Wi-Fi",
  "steps": [
    {
      "title": "Plug in your Chromecast to your TV.",
      "content": "Plug in your Chromecast to your TV. If your Chromecast is not plugged in, do the following: Connect the cable to the Chromecast and power supply. Plug the power supply into an outlet near your TV. Plug the Chromecast into an HDMI port on your TV. This is usually found on the back or side of the TV."
    },
    {
      "title": "Install Google Home if you do not yet have it.",
      "content": "Install Google Home if you do not yet have it. Do the following: Open the Play Store app on the home screen or app menu of your Android phone or tablet. Tap the search bar at the top and type \"google home\". Tap the app to open it. If you cannot find Google Home, you may be on an older software version that is unsupported. Check for a software update in your settings. You must be running Android 5.0 or higher on a phone, or Android 6.0 or higher on a tablet. [1] X Research source Tap Install to install the app. The app will download in the background and will be added to your app menu or home screen when done."
    },
    {
      "title": "Open the Google Home app.",
      "content": "Open the Google Home app. It looks like a white icon with a colorful house. Tap the app to open it."
    },
    {
      "title": "Setup Google Home.",
      "content": "Setup Google Home. Follow the prompts on the screen to connect your Google account and grant location access."
    },
    {
      "title": "Search for your Chromecast in the app.",
      "content": "Search for your Chromecast in the app. Google Home will automatically look for nearby devices and show you what it finds. If you have already set up Google Home before, tap Set up # device near the top left of the home screen of the app. Choose a home, then tap Next to connect the app to the Chromecast."
    },
    {
      "title": "Look for a code on your TV.",
      "content": "Look for a code on your TV. The app will display a code—check that this is the same code on your TV."
    },
    {
      "title": "Tap Yes if you saw the code on your TV.",
      "content": "Tap Yes if you saw the code on your TV. If you didn't see it, tap Try again ."
    },
    {
      "title": "Select a location for the Chromecast.",
      "content": "Select a location for the Chromecast. Tap the room where it will remain."
    },
    {
      "title": "Select a Wi-Fi network for your Chromecast.",
      "content": "Select a Wi-Fi network for your Chromecast. This should be the same network that your phone or tablet is on. Tap the network name to select it. If you wish to choose a different network, change the network on your phone or tablet in the settings. If you don't see your Wi-Fi network at all, tap Other Wi-Fi Network and enter in the network details."
    },
    {
      "title": "Tap OK to fill the password automatically.",
      "content": "Tap OK to fill the password automatically. If you prefer to enter the password manually, tap Enter manually and type in the password. You will only see this option on Android L and above. [2] X Research source"
    },
    {
      "title": "Tick the box if you want the app to remember the Wi-Fi network.",
      "content": "Tick the box if you want the app to remember the Wi-Fi network. It's recommended to keep this ticked to make it easier to set up future Google devices."
    },
    {
      "title": "Finish the rest of the setup process.",
      "content": "Finish the rest of the setup process. Connect your Google account and set email notifications."
    },
    {
      "title": "Plug in your Chromecast to your TV.",
      "content": "Plug in your Chromecast to your TV. If your Chromecast is not plugged in, do the following: Connect the cable to the Chromecast and power supply. Plug the power supply into an outlet near your TV. Plug the Chromecast into an HDMI port on your TV. This is usually found on the back or side of the TV."
    },
    {
      "title": "Install Google Home if you do not yet have it.",
      "content": "Install Google Home if you do not yet have it. Do the following: Open the App Store from the home screen of your iPhone or iPad. Tap the search icon and type \"google home\". Tap the app to open it. If you cannot find Google Home, you may be on an older software version that is unsupported. Check for a software update in your settings. You must be running iOS 11.0 or higher. Tap Get to install the app. The app will download in the background and will be added to your home screen when done."
    },
    {
      "title": "Open the Google Home app.",
      "content": "Open the Google Home app. It looks like a white icon with a colorful house. Tap the app to open it."
    },
    {
      "title": "Tap Get started.",
      "content": "Tap Get started . This will start your Google Home setup."
    },
    {
      "title": "Select your Google account.",
      "content": "Select your Google account. Tap the account you wish to use, then tap OK ."
    },
    {
      "title": "Turn on Bluetooth for a faster setup process.",
      "content": "Turn on Bluetooth for a faster setup process. Swipe up on your phone and tap the Bluetooth icon. If you wish to skip Bluetooth set up, tap No thanks . Tap the Settings app on your iPhone or iPad, go to Wi-Fi, and tap to connect to the Wi-Fi network that has your Chromecast name in it. Go back to the Google Home app and tap Next . If Bluetooth is already on, you won't see this screen."
    },
    {
      "title": "Search for your Chromecast in the app.",
      "content": "Search for your Chromecast in the app. Google Home will automatically look for nearby devices and show you what it finds. If you have already set up Google Home before, tap Set up # device near the top left of the home screen of the app. Choose a home, then tap Next to connect the app to the Chromecast."
    },
    {
      "title": "Look for a code on your TV.",
      "content": "Look for a code on your TV. The app will display a code—check that this is the same code on your TV."
    },
    {
      "title": "Tap Yes if you saw the code on your TV.",
      "content": "Tap Yes if you saw the code on your TV. If you didn't see it, tap Try again ."
    },
    {
      "title": "Select a location for the Chromecast.",
      "content": "Select a location for the Chromecast. Tap the room where it will remain."
    },
    {
      "title": "Select a Wi-Fi network for your Chromecast.",
      "content": "Select a Wi-Fi network for your Chromecast. This should be the same network that your phone or tablet is on. Tap the network name to select it. If you wish to choose a different network, change the network on your phone or tablet in the settings. If you don't see your Wi-Fi network at all, tap Other Wi-Fi Network and enter in the network details."
    },
    {
      "title": "Tap OK to fill the password automatically.",
      "content": "Tap OK to fill the password automatically. If you prefer to enter the password manually, tap Enter manually and type in the password."
    },
    {
      "title": "Tick the box if you want the app to remember the Wi-Fi network.",
      "content": "Tick the box if you want the app to remember the Wi-Fi network. It's recommended to keep this ticked to make it easier to set up future Google devices."
    },
    {
      "title": "Finish the rest of the setup process.",
      "content": "Finish the rest of the setup process. Connect your Google account and set email notifications."
    }
  ]
}