{
  "url": "https://www.wikihow.com/Borrow-Books-from-the-Library-for-a-Nook",
  "title": "How to Borrow Books from the Library for a Nook",
  "steps": [
    {
      "title": "Download Adobe Digital Editions to your computer.",
      "content": "Download Adobe Digital Editions to your computer. Adobe Digital Editions is paired with your Nook, and is required for older Nook models without the option of downloading apps. Your computer will function as a mediator between your Nook and online library account. [1] X Research source If you do not have a computer of your own, you may be able to use a library computer to complete this process."
    },
    {
      "title": "Create an ADE account.",
      "content": "Create an ADE account. Using the same email address you used to activate your Nook, create an account with Adobe Digital Editions. Creating an account will help you keep track of your downloads, and will facilitate the transfer of books from your computer to your e-reader. [2] X Research source Using an email different from your Nook email may create some difficulty in the download and transfer process."
    },
    {
      "title": "Connect your Nook to your computer.",
      "content": "Connect your Nook to your computer. Pause at this point in the process and connect your Nook to your computer using a USB cable. Turn your Nook on to make sure it registers with Adobe."
    },
    {
      "title": "Open the book using Adobe.",
      "content": "Open the book using Adobe. When you select the format you wish to download in on Overdrive (the program most libraries use to lend books digitally), a window will appear giving you the option of opening the file or downloading it. Select “Open the file with Adobe,” which will automatically pull the book open in your Adobe library."
    },
    {
      "title": "Select the “library” button.",
      "content": "Select the “library” button. Once you have opened Adobe, select the “library” button in the top left hand corner, which should bring up a list of books you have downloaded or borrowed. Having your library open will allow you to identify and highlight the book you are trying to transfer."
    },
    {
      "title": "Click and drag the book.",
      "content": "Click and drag the book. Highlight the book you want to place on your Nook, and drag it to the middle of the page on the left-hand side, where a small icon reading “Nook” will appear. This will complete the process of transferring the book to your Nook. Check your Nook before disconnecting to make sure the book has appeared in your Nook library. [3] X Research source"
    },
    {
      "title": "Click “Return Book” on your Nook.",
      "content": "Click “Return Book” on your Nook. When you have finished your digital library book, plug your Nook into your computer once more, and open Adobe. From your library on your Nook, click “Return Book.”"
    },
    {
      "title": "Click “Return Book” in Adobe.",
      "content": "Click “Return Book” in Adobe. Open Adobe and complete the return by also clicking “Return Book” inside of the Adobe program. To verify your return has gone through, you can minimize Adobe and check your Overdrive or library account. If your book does not return, you may need to contact Nook customer service or your library for assistance."
    },
    {
      "title": "Download the Overdrive app to your Nook.",
      "content": "Download the Overdrive app to your Nook. Newer Nook models have the ability to download apps directly to the device. Overdrive, the company most libraries use for digital lending, has a Nook-compatible app you can download to simplify use. [4] X Research source"
    },
    {
      "title": "Find your local library in the Overdrive app.",
      "content": "Find your local library in the Overdrive app. To borrow from your library, you will need your library card and the name of your library. Find your specific library in the search tab in the Overdrive app and select it to get a list of the available titles."
    },
    {
      "title": "Select the book you wish to borrow.",
      "content": "Select the book you wish to borrow. Once you’ve selected the book you wish to borrow, you will hit “download,” and check it out using your library card. It will be stored in your Overdrive app under “Bookshelf.” You will read your book through the app. [5] X Research source"
    },
    {
      "title": "Read your book before the expiration date.",
      "content": "Read your book before the expiration date. Through Overdrive, the library book will have a lending period automatically placed on it. Once this lending period has expired, the book will be removed from your Overdrive Bookshelf by default, and will no longer be available to read until it has been checked out again."
    },
    {
      "title": "Gather two pieces of mail with your name and address.",
      "content": "Gather two pieces of mail with your name and address. Many libraries require you to present proof of residency in order to get a library card. Before you head to the library, gather two pieces of mail with your given name and address on them, such as a bank statement or utility bill. [6] X Research source For children or teenagers, a parent’s proof of residency is usually requested."
    },
    {
      "title": "Take your state-issued ID.",
      "content": "Take your state-issued ID. Once you’ve proven residency, you need to prove you are who you say you are. Your library branch will require some form of ID. Although this is typically a state-issued license or ID, students may be able to use their school ID cards, as well. [7] X Research source"
    },
    {
      "title": "Visit your local library.",
      "content": "Visit your local library. Libraries do not issue library cards online, so make sure you locate and visit your local library in person with the required documents. If you live outside of the area, you may also be required to pay a yearly fee. [8] X Research source Although using online catalogs is possible, you have to have a library card before you can use library resources."
    },
    {
      "title": "Set up your online library profile.",
      "content": "Set up your online library profile. While at the library, set up your online library profile. This typically uses your library card barcode and a password of your choosing. Creating an online library profile is required to check out items digitally. The way to set up your online account varies from library to library. Some will have simple instructions, while others will require a librarian to complete the process for you."
    },
    {
      "title": "Select the book you want to borrow.",
      "content": "Select the book you want to borrow. Search your library’s online catalog for the book you want to borrow. To narrow your search, you can filter search results to include digital download books only."
    },
    {
      "title": "Choose the length of time you wish to borrow the book for.",
      "content": "Choose the length of time you wish to borrow the book for. Although the standard borrowing window is 21 days, some Overdrive accounts give you the option of choosing a shorter time period, such as seven or fourteen days. Select the time period that best fits your needs. If you know you are a slow reader, only check out one digital book at a time so you don’t keep other patrons waiting."
    },
    {
      "title": "Choose the correct format for download.",
      "content": "Choose the correct format for download. Overdrive offers a few downloading options, depending on the reader you are using. Options should include a computer PDF format, a Kindle format, and a Nook format. The Nook format might also read “EPUB” or something similar."
    }
  ]
}