{
  "url": "https://www.wikihow.com/Control-Breathing-While-Running",
  "title": "Breathing Tips for Running: How to Not Run Out of Breath",
  "steps": [
    {
      "title": "Breathe through your nose during light jogs and slow runs.",
      "content": "Breathe through your nose during light jogs and slow runs. Breathing through your nose is ideal since it helps warm up the air and filters out irritants. However, it's not always possible to breathe through just your nose when you're running at higher intensities. Fortunately, on light jogs and slow runs, this shouldn't be a problem. If you do find it tough to only breathe through your nose, try inhaling through your nose and exhaling through your mouth. [1] X Research source"
    },
    {
      "title": "Breathe through your mouth during high-intensity runs.",
      "content": "Breathe through your mouth during high-intensity runs. When you raise the intensity of your run, you'll need more oxygen, and it may be hard to breathe with just your nose. Since you can inhale and exhale through your mouth faster, switch to mouth breathing during high-intensity runs so you don’t lose your breath. [2] X Research source"
    },
    {
      "title": "Do diaphragmatic breathing to get more oxygen.",
      "content": "Do diaphragmatic breathing to get more oxygen. Diaphragmatic breathing, also known as abdominal or belly breathing, expands your lungs to their full capacity. [3] X Expert Source Shira Tsvi Personal Trainer & Fitness Instructor Expert Interview. 7 January 2020. Rather than raising your shoulders and chest when you breathe in, try diaphragmatic breathing by pushing your belly out as you inhale. When you exhale, purse your lips and blow the air out slowly. [4] X Research source When most people breathe, they raise and lower their chests as their lungs expand and contract, but chest breathing restricts how much your lungs can fill up."
    },
    {
      "title": "Inhale and exhale in rhythm with your footsteps.",
      "content": "Inhale and exhale in rhythm with your footsteps. Syncing your breathing to your running pace helps prevent pressure buildup on your diaphragm that can make you short of breath. For light- or moderate-intensity runs, use a 3:2 breath pattern, meaning that you’ll inhale for 3 steps and then exhale for 2 steps. For faster runs, you can increase your breath pattern to inhaling for 2 steps and exhaling for 1 step. [5] X Research source"
    },
    {
      "title": "Run with a straight upright posture.",
      "content": "Run with a straight upright posture. If you lean too far forward or slouch while you’re running, you compress your lungs and don’t get as much oxygen as you could. Relax your shoulders and straighten your back so it’s easier for you to breathe. [6] X Research source"
    },
    {
      "title": "Warm up for 10 minutes before you start running.",
      "content": "Warm up for 10 minutes before you start running. Oxygen will be able to travel through your bloodstream easier if you loosen up your muscles first. Do some gentle stretches for your thighs, hips, knees, and ankles. Get your heart beating faster and your blood pumping with some light cardio, like doing jumping jacks . [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source A proper warm-up will also help you ease soreness and avoid injury from your run."
    },
    {
      "title": "Practice deep breathing exercises.",
      "content": "Practice deep breathing exercises. Lie or sit down and put your hand just below your rib cage. Slowly breathe in as deep as you can through your nose so you feel your stomach push against your hand. Purse your lips and slowly exhale. Do deep breathing exercises for 5–10 minutes every day so you get used to breathing correctly. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source As you’re running, consciously think about your breathing to get used to it. It might feel a little distracting at first, but soon taking deep breaths will be second nature."
    },
    {
      "title": "Maintain a regular exercise routine.",
      "content": "Maintain a regular exercise routine. As you stay active, your muscles will use oxygen more efficiently so it’ll get easier to control your breathing while you’re running. Make a workout plan where you get some form of physical activity for 30 minutes during the day at least 3–4 days a week. Create a good workout by incorporating cardio and doing strength training so your lungs are in the best shape. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try to work out at the same time of day each time so it’s easier to make it part of your regular routine."
    },
    {
      "title": "Quit smoking.",
      "content": "Quit smoking. Smoking can make it harder to fill your lungs completely, so you’re more likely to run out of breath during your run. If you’re a smoker, take any preventative measures you can to help you quit . Even after 2 weeks without smoking, you may notice you’re able to exercise for longer and have more stamina. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Your run is too intense.",
      "content": "Your run is too intense. Your muscles need a steady supply of oxygen to keep up the energy of an intense run. If you’re pushing yourself too hard, it may feel tougher to catch your breath because you aren’t getting enough oxygen to keep up. Try running at a slower pace or shorter distance so you don’t get as winded. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Warming up before your workout can help your body get used to regular exercise."
    },
    {
      "title": "The air is cold, dry, or of poor quality.",
      "content": "The air is cold, dry, or of poor quality. Cold and dry air makes your airways narrower so it may feel harder to catch your breath. Other pollutants and allergens, like smog or pollen, in the air can also irritate your lungs and make it harder to breathe while you’re on your run. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use a prescription inhaler before you start your run.",
      "content": "Use a prescription inhaler before you start your run. If you have asthma or COPD, your doctor may have prescribed you an inhaler with medication to help open your airways and prevent spasms. Use your inhaler 15–20 minutes before you start your run so the medication has time to kick in. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Run on days with low pollen count and good air quality.",
      "content": "Run on days with low pollen count and good air quality. If you have asthma, irritants in the air can make it more difficult to run without an allergic reaction or asthma attack. Check the pollen count and air quality in your area online, and postpone your run if the levels are high or if there’s a lot of smog. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Increase the intensity of your run gradually.",
      "content": "Increase the intensity of your run gradually. If you’re just starting off running, begin with a relaxed, moderate pace so you can get used to running again. [15] X Expert Source Shira Tsvi Personal Trainer & Fitness Instructor Expert Interview. 7 January 2020. Practice your deep breathing as you run. If it feels too challenging, slow down or reduce the amount of time you go running. As they get easier, try slowly upping the pace and difficulty to longer, more intense runs. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try to go running 2–3 times a week with rest days in between so you can make it part of your regular routine. If you still have trouble breathing with a light jog, try walking when you start off instead. [17] X Expert Source Shira Tsvi Personal Trainer & Fitness Instructor Expert Interview. 7 January 2020."
    },
    {
      "title": "Talk to a doctor before you make changes to your exercise routine.",
      "content": "Talk to a doctor before you make changes to your exercise routine. If you want to try a more intense running workout, let your doctor know ahead of time and ask for their recommendations. They can walk you through how to make changes to your routine slowly and safely so you don’t irritate your lungs or stress your body out. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}