{
  "url": "https://www.wikihow.com/Make-Your-Boyfriend-Miss-You-Through-Text",
  "title": "10+ Texting Tips to Make Your Boyfriend Miss You (and Remember How Special You Are)",
  "steps": [
    {
      "title": "This can remind him that he's been taking your texts for granted.",
      "content": "This can remind him that he's been taking your texts for granted. He may have grown so accustomed to your sweet good morning texts that he's forgotten that they're not guaranteed! Hold off on texting him sometimes (even if it's hard), and you'll be surprised by how fast he'll start sending you those good morning texts. [1] X Research source You don't have to do this all of the time. If you've got something important to text him, go ahead and talk to him. [2] X Expert Source John Keegan Dating Coach Expert Interview. 29 July 2021. This can just be a handy tool to use every now and then to remind him that he's got to initiate sometimes, too."
    },
    {
      "title": "Fill up your day with activities instead of texting him all the time.",
      "content": "Fill up your day with activities instead of texting him all the time. Taking an extra hour or two to respond will make him wonder what you're up to and get intrigued about your life all over again. Instead of interrupting your day and responding every time he texts, take plenty of time to focus on your hobbies, passions, and goals before you respond. It'll leave him wanting you more, and you'll have exciting updates to text him once you're done. [3] X Research source Make plans with your friends and pay attention to them while you're hanging out, even if he's texted you. Then, text him when you're on the way home about how much fun you had. Don't be surprised if he responds super fast."
    },
    {
      "title": "Let him know that you're not always available to chat.",
      "content": "Let him know that you're not always available to chat. If he's usually the one that says he's got to go first, try ending the conversation yourself for a change. Let him know that you're busy and have got to go, but would love to chat or make plans later. It'll make him realize that you've got a whole interesting life going on, and he'll want to be a part of it. [4] X Research source If you've been texting back and forth all morning, text him something like, \"Well, I've got to go work on this assignment. Hope you have a great afternoon :)\""
    },
    {
      "title": "Don't tell him every aspect of your day.",
      "content": "Don't tell him every aspect of your day. If he asks what you're up to, give an answer that's a little vague. It'll make him want to learn more about your day and follow up with some questions. [5] X Research source If he asks what your plans are for the night, simply say, \"I'm going to see a movie with some friends.\" That leaves him the opportunity to ask you what movie you're going to see and who you're seeing it with."
    },
    {
      "title": "Text compliments sparingly to make them special.",
      "content": "Text compliments sparingly to make them special. Once a week or so, text him something that you really like about him. Focus on the qualities that make him unique and special. He's lucky to have someone who cares about him the way that you do, but he could start taking your relationship for granted if he's showered with compliments all the time. He'll appreciate it more if it's a little more rare, and he'll start to miss them in the time in between. [6] X Research source Send him something like, \"Can't stop thinking about your smile. It brightens my day just thinking about it.\""
    },
    {
      "title": "This makes your texts more interesting.",
      "content": "This makes your texts more interesting. Even over text, you're much more animated when you talk about things that you care about. Open up about things you're excited about and the projects that you're working on that make you happy. [7] X Expert Source John Keegan Dating Coach Expert Interview. 29 July 2021. These things are what make you unique, and they'll remind him how lucky he is to have a one-of-a-kind person like you. [8] X Research source Text him an update on a song you're writing on the guitar or a collage you've been working on the whole afternoon. Talk about your favorite bands, movies, and sports teams. Give him a chance to talk about what he loves, too. Ask him for updates on how he's liking the latest season of his favorite show, or if he enjoyed the live stream concert of a band he really likes. [9] X Expert Source John Keegan Dating Coach Expert Interview. 29 July 2021."
    },
    {
      "title": "Help him remember how much you believe in him.",
      "content": "Help him remember how much you believe in him. It'll make him want to be around you so much more. Whether it's an important meeting or a big test, send a text to encourage him and cheer him on. Pick something specific that he's been concerned about lately. It'll show that you care and have been listening throughout your conversations, which will keep him thinking of you fondly. [10] X Expert Source John Keegan Dating Coach Expert Interview. 29 July 2021. If he's got a big meeting that he's been stressed about, text him, \"You've got this! Good luck today :)\""
    },
    {
      "title": "This is a fun way to make your texts more engaging.",
      "content": "This is a fun way to make your texts more engaging. If he asks you what you're up to, send him a picture or a video to let him know. Seeing what's going on in your day can help him feel more connected to you and your life. The more interesting the photos, the more enticed he'll be to know more. [11] X Expert Source John Keegan Dating Coach Expert Interview. 29 July 2021. Perhaps you're in a long-distance relationship. Text him a picture of the view from your apartment. Follow it with a text that says, \"Here's my view this morning. What's yours?\" Maybe you're spending the day repotting your plants. Send him a picture while you're in the middle of the process with a funny caption, like, \"I have no idea what I'm doing.\""
    },
    {
      "title": "If you’re comfortable, send him a flirty text or a cute selfie.",
      "content": "If you’re comfortable, send him a flirty text or a cute selfie. Pick an outfit that makes you feel sexy and confident and take a few pictures to send to him. If you're not comfortable sending a picture, reference the last time you were intimate and what you liked about it. [12] X Expert Source John Keegan Dating Coach Expert Interview. 29 July 2021. Alternatively, send a flirty text about what you want to do with him when you're together again. It'll leave him wanting more and make him super excited to see you again. [13] X Research source Text him, \"Missing your handsome face. I can't wait to be in your arms again.\" You can also try, \"Still thinking about last night. You're the dreamiest guy.\" If he responds with something flirty in return, up the ante and respond with something a little more direct. Try, \"I can still taste you on my lips.\" [14] X Expert Source John Keegan Dating Coach Expert Interview. 29 July 2021. If you're sending him something NSFW, give him some warning first to make sure it's a good time."
    },
    {
      "title": "In other words, tell him that you miss him.",
      "content": "In other words, tell him that you miss him. Remind him that he's on your mind and that you want to spend more time talking to him. If you want your boyfriend to want you more or spend more time with you, playing games can only get you so far. Be upfront and send him a sweet text letting him know that he's on your mind and that you're looking forward to seeing him again. [15] X Expert Source John Keegan Dating Coach Expert Interview. 29 July 2021. Text him, \"Been thinking of you all morning. Can't wait to see you after work!\" or \"You've been on my mind all day. Missing you.\" If you're separated by distance, reference what you'll do together when you're reunited. Try something like, \"Woke up thinking about our last movie marathon. So excited to just relax and watch movies with you again.\""
    },
    {
      "title": "Avoid complaining too much to your boyfriend.",
      "content": "Avoid complaining too much to your boyfriend. Emphasize the good things that happened in your day and see the positive in even negative situations. To ensure a positive attitude, send plenty of texts that are funny and playful. Your good energy will be infectious, and it'll make him remember why he likes you so much. [16] X Expert Source John Keegan Dating Coach Expert Interview. 29 July 2021. Send him YouTube clips of his favorite comedies or memes that you know fit his sense of humor. When you talk about your day, share funny anecdotes that you think would make him laugh. It's totally okay to be upset sometimes. Just make sure you don't spend all of your texts talking about what's been going wrong lately. You want him to remember all the fun you two have together."
    }
  ]
}