{
  "url": "https://www.wikihow.com/How-Many-Rakats-for-Asr",
  "title": "How Many Rakats Are in Salah Asr? An Islamic Prayer Guide",
  "steps": [
    {
      "title": "Pray 4 Rakat Sunnah and 4 Rakat Fardh (obligatory) during Asr.",
      "content": "Pray 4 Rakat Sunnah and 4 Rakat Fardh (obligatory) during Asr. The Asr prayer contains 4 required Rakat Fardh that are sinful to miss intentionally. An additional 4 Rakat Sunnah are optional, but highly recommended, and are performed before the obligatory Rakat. However, some Islamic branches say this can be reduced to 2 Rakat when traveling. [1] X Research source Asr is part of the 5 daily prayers, which are collectively one of the five pillars of Islam. Unlike Fajr (dawn prayer), which is read out loud in congregation, all of Asr is in complete silence and under your breath. [2] X Research source"
    },
    {
      "title": "Pray Asr when the sun is halfway down from its noon position.",
      "content": "Pray Asr when the sun is halfway down from its noon position. The period when Asr begins is about when the sun is halfway down the sky from noon to sunset. However, some branches of Islam disagree on when the prayer starts and ends. Some Shia Islamic schools of thought say Asr prayer starts once the Dhuhr (midday prayer) is recited and ends at the beginning of the setting of the sun. [3] X Research source Some Sunni schools of thought say Asr begins when the length of any object's shadow is the length of the object itself plus the length of the same object's shadow at noon. The time for Asr ends when the sun has completely set below the horizon. [4] X Research source Others say Asr begins when the length of any object's shadow is twice the length of the object plus the length of the same object's shadow at noon. The times of the five daily prayers depend on your location. Use this tool to see when to pray each day."
    },
    {
      "title": "Fajr has 2 Rakat, Duhuhr has 4, Maghrib has 3, and Isha has 7.",
      "content": "Fajr has 2 Rakat, Duhuhr has 4, Maghrib has 3, and Isha has 7. However, this does not include the optional or recommended prayers. In addition to these, some Muslims choose to pray Tahajjid (2 or more Rakat) at night and Duha (2 or more Rakat) between sunrise and noon. [5] X Research source Fajr ( prayed before sunrise at true dawn, when light first appears): 2 Rakat Sunnah, then 2 Rakat Fardh. Dhuhr ( prayed at midday ): 4 Rakat Sunnah, then 4 Rakat Fardh, then 2 Rakat Sunnah, then 2 Rakat Nafl (optional). Maghrib ( prayed at sunset ): 3 Rakat Fardh, then 2 Rakat Sunnah, then 2 Rakat Nafl (optional). Isha ( prayed at night before bed ): 4 Rakat Sunnah, then 4 Rakat Fardh, then 2 Rakat Sunnah, then 2 Rakat Nafl (optional), then 3 Rakat Witr Wajib (obligatory, second to Fardh), then 2 Rakat Nafl (optional)."
    },
    {
      "title": "Stand and raise both hands to your ears, facing the Qibla.",
      "content": "Stand and raise both hands to your ears, facing the Qibla. In any language, say that you intend to offer Salat Asr and state how many Rakats you’re going to pray. Focus on Allah and raise both hands, palms facing the Qibla, while saying “Allah u Akbar” (“Allah is the greatest”). This position is called “qiyaam.” [6] X Research source Men raise their hands up to their earlobes while women raise their hands to their shoulders. [7] X Research source Find a clean space (like on a prayer mat) out of the way of others to perform Salat. [8] X Research source If you can’t stand, pray sitting down. If you can’t sit, pray while lying on your side. [9] X Research source Perform wudu before Asr. Men wear clothing that covers everything from the navel to the knees. Women cover everything except their face, hands, and feet. The Quibla is the Muslim holy site, located in Mecca, Saudi Arabia. Use this finder tool to position yourself in the correct direction."
    },
    {
      "title": "Place your right hand over your left below the navel.",
      "content": "Place your right hand over your left below the navel. It’s recommended for women to place their hands over their chest, right hand over left. [10] X Research source Recite the following prayers in Arabic: [11] X Research source “Subhanaka Allah humma wa bihamdika, wa tabaraka ismuka, wa ta'ala jadduka, wa la ilaha ghairuk.” “Praise and glory be to you O Allah. Blessed be Your Name, exalted be Your Majesty and Glory. There is no God but You.” “Audu bi Allah i mina ashaitan i errajeem. Bismillah i rrahman i erraheem.” “I seek Allah's shelter from Satan, the condemned. In the Name of Allah, the Beneficent, the Merciful.” “Al humdo lil-lahi rab-bil al ala-meen. Arrahman i rraheem. Maliki yaum i eddeen. Iyyaka nabudu wa iyyaka nasta een. Ihdinas sirata almustaqeem. Siratal lazhina anamta alaihim, ghairil maghdubi alaihim, wa la adhdhaal leen. (Aameen).” (Surah Al-Fatihah) “Praise be to Allah, The Cherisher and Sustainer of the Worlds; Most Gracious, Most Merciful; Master of the Day of Judgment. Thee do we worship, and Thine aid we seek. Show us the straight way, the way of those on whom Thou hast bestowed Thy Grace, Those whose (portion) is not wrath, And who go not astray. (Let it be so).” Recite any other Surah. The minimum recitation is 3 verses, or one long verse equal in length to 3 verses, but it’s better to recite a complete Surah. [12] X Research source"
    },
    {
      "title": "Bow with your hands on your knees and say “Allah u Akbar.”",
      "content": "Bow with your hands on your knees and say “Allah u Akbar.” Make sure your back is straight. Rest in this position and say “Subhana rabbiya al azeem” (“Glorified is my Lord, the Great”) at least 3 times. [13] X Research source This position is called “Ruku.”"
    },
    {
      "title": "Stand up from bowing while saying “Samia Allah u liman hamidah.”",
      "content": "Stand up from bowing while saying “Samia Allah u liman hamidah.” This means “Allah listens to him who praises Him.” When you finish standing, say “Rab'bana lakal hamd” (“Our Lord, praise be for you only”). [14] X Research source"
    },
    {
      "title": "Say “Allah u Akbar” and prostrate with your hands on the ground.",
      "content": "Say “Allah u Akbar” and prostrate with your hands on the ground. When prostrating, or laying on the ground face-down, make sure your forehead, nose, palms, hands, knees, and toes are pointed forward and touching the floor. Say “Subhana rubbiyal a'ala” (“Glory to Allah, the Exalted”) at least 3 times. [15] X Research source This position is called “Sujood.” [16] X Research source"
    },
    {
      "title": "Sit up while saying “Allah u Akbar” and return to the prostation position.",
      "content": "Sit up while saying “Allah u Akbar” and return to the prostation position. When you sit up, place the palms of your hands on your knees, sit on the bottom of your left foot, and keep the toes of your right foot pointed forward with the sole facing behind you. After a few minutes, lay on the ground face-down again while saying “Allah u Akbar.” [17] X Research source Once prostrating, recite “Subhana rubbiyal a'ala” (“Glory to Allah, the Exalted”). Women traditionally lean on their left hip, with the toes of both feet pointing to their right side. The sitting position is called “Juloos.” [18] X Research source This completes one Rakat."
    },
    {
      "title": "Say “Allah u Akbar” as you stand again to start the second Rakat.",
      "content": "Say “Allah u Akbar” as you stand again to start the second Rakat. Stand with your right hand over your left, below the navel. Recite Surah Al-Fatihah and any short Surah or verses of the Holy Qur’an. [19] X Research source Repeat steps 3 through 6 to complete the first part of the second Rakat. “Al humdo lil-lahi rab-bil al ala-meen. Arrahman i rraheem. Maliki yaum i eddeen. Iyyaka nabudu wa iyyaka nasta een. Ihdinas sirata almustaqeem. Siratal lazhina anamta alaihim, ghairil maghdubi alaihim, wa la adhdhaal leen. (Aameen).” (Surah Al-Fatihah)"
    },
    {
      "title": "Sit in the same position as before prostration and recite the Tashahud.",
      "content": "Sit in the same position as before prostration and recite the Tashahud. While sitting, recite the first part of the Tashahud. Keeping your hands resting on your knees, lift your right index finger and move it up and down as you recite the second part. [20] X Research source First part: “Attahiyat u lil Allah i wa assalawat u wa attaiyibat. Assalam u a'laika aiyoha annabiyyu wa rahmat u Allah i wa barakatuh. Assalam u a'laina wa a'la ebadi e llahi essaliheen.” “All our oral, physical, and monetary ways of worship are only for Allah. Peace, mercy and blessing of Allah be on you, O Prophet. May peace be upon us and on the devout slaves of Allah.” Second part: “Ashehadu alla ilaha illa Allah u wa ashhadu anna Muhammadan abduhu wa rasooluh.” “I testify that there is no God but Allah and I testify that Muhammad is His slave and messenger.”"
    },
    {
      "title": "Stand up and put your right hand over your left below the navel.",
      "content": "Stand up and put your right hand over your left below the navel. This is the same position you were in for the second step. However, in this movement, you only recite Surah Al-Fatihah. [21] X Research source “Al humdo lil-lahi rab-bil al ala-meen. Arrahman i rraheem. Maliki yaum i eddeen. Iyyaka nabudu wa iyyaka nasta een. Ihdinas sirata almustaqeem. Siratal lazhina anamta alaihim, ghairil maghdubi alaihim, wa la adhdhaal leen. (Aameen).” “Praise be to Allah, The Cherisher and Sustainer of the Worlds; Most Gracious, Most Merciful; Master of the Day of Judgment. Thee do we worship, and Thine aid we seek. Show us the straight way, the way of those on whom Thou hast bestowed Thy Grace, Those whose (portion) is not wrath, And who go not astray. (Let it be so).”"
    },
    {
      "title": "Perform step 9 and steps 3 through 6 two times.",
      "content": "Perform step 9 and steps 3 through 6 two times. Stand with your right hand over your left and recite Surah Al-Fatihah. Bow with your hands on your knees as you say “Allah u Akbar,” then say “Subhana rabbiya al azeem” at least 3 times. As you stand, say “Samia Allah u liman hamidah,” then say “Rab'bana lakal hamd.” Say “Allah u Akbar” and prostrate, then say “Subhana rubbiyal a'ala” at least 3 times. Sit on the bottom of your left foot with the toes of your right foot pointed forward while saying “Allah u Akbar.” After a few minutes, return to the prostration position while saying “Allah u Akbar.” Then say “Subhana rubbiyal a'ala” (“Glory to Allah, the Exalted”)."
    },
    {
      "title": "Sit on the sole of your left foot and recite the Tashahud.",
      "content": "Sit on the sole of your left foot and recite the Tashahud. Return to the same position as before prostration (“Juloos.”). While sitting, recite the first portion of the Tashahud. With your hands resting on your knees, lift your right index finger and move it up and down as you recite the second part. [22] X Research source First part: “Attahiyat u lil Allah i wa assalawat u wa attaiyibat. Assalam u a'laika aiyoha annabiyyu wa rahmat u Allah i wa barakatuh. Assalam u a'laina wa a'la ebadi e llahi essaliheen.” “All our oral, physical and monetary ways of worship are only for Allah. Peace, mercy and blessing of Allah be on you, O Prophet. May peace be upon us and on the devout slaves of Allah.” Second part: “Ashehadu alla ilaha illa Allah u wa ashhadu anna Muhammadan abduhu wa rasooluh.” “I testify that there is no God but Allah and I testify that Muhammad is His slave and messenger.”"
    },
    {
      "title": "Recite a supplication or short prayer.",
      "content": "Recite a supplication or short prayer. A popular, simple supplication is “’Rabbana aatina fid-dunya hasanataw wa fil-aakhirati hasantaw wa qina ‘adhaaban Naar’.” This means “O our Lord give us good in this world and good in the hereafter and protect us from the punishment of the Fire.” [23] X Research source"
    },
    {
      "title": "Turn your head to the right, then the left, to complete the Surat.",
      "content": "Turn your head to the right, then the left, to complete the Surat. Complete the Surat by turning your face over your right shoulder. Say “Assalam u a'laikum wa rahmatu Allah” (“Peace and mercy of Allah be on you”). Turn your face to the left and repeat the same prayer. [24] X Research source This completes the 4 Rakat Fardh."
    }
  ]
}