{
  "url": "https://www.wikihow.com/Date-an-Ex-After-Years-Apart",
  "title": "How to Date an Ex After Years Apart",
  "steps": [
    {
      "title": "Perform a relationship post-mortem to get some insight here.",
      "content": "Perform a relationship post-mortem to get some insight here. [2] X Expert Source Allen Wagner, MFT, MA Marriage & Family Therapist Expert Interview. 24 September 2021. This will help you figure out whether this is a good idea or not, and give you insight into how you should reach out to your ex if it is a solid idea. [3] X Research source Just meditate on this for a while. You can even ask outside observers about this, or try freewriting about your experience. [4] X Research source Potential reasons include: External causes. If you dated while you were young, parental disapproval may have led to the breakup. Distance is another common cause, such as dating in high school and then going to different colleges Naturally drifting apart. People change a lot when they’re young, and it’s possible the flame just died out slowly over time as you both started pursuing different things. Different values or goals. If the two of you couldn’t line up on wanting children, religion, or work/life balance, it can be hard to hash things out. Conflict. Couples fight, but if the two of you were taking it too far, this can lead to resentment, anger, and eventually, breaking up. Cheating. Infidelity is a common cause for relationships to end."
    },
    {
      "title": "If the reason you broke up may still matter, tread lightly.",
      "content": "If the reason you broke up may still matter, tread lightly. So, you did some soul searching and now you know why you broke up. Figure out whether that reason is still relevant. [5] X Expert Source Allen Wagner, MFT, MA Marriage & Family Therapist Expert Interview. 24 September 2021. If it isn’t, feel free to move forward and reach out to your ex. [6] X Research source However, if that reason is still relevant, take your time to re-think this one. [7] X Research source External causes are unlikely to be a barrier here unless physical distance is still a concern. Even then, a little time passing may have made you both mature enough to handle this one. You’ve got the green light here. If you slowly drifted apart, it’s likely the two of you were just young and figuring out what you wanted. Experience and age may have neutralized this obstacle. If some time has passed, you’re good to go. Different values or goals. Unless something has changed for one of you and you went from never wanting kids to wanting children, for example, this one can be pretty hard to get through. Conflict can be tough, since people tend to hold on to resentment and it’s hard to forget how someone made you feel. If the both of you can let go of that, it can certainly work, though. Cheating is pretty hard to get over. People don’t forget this one so easily. It can work, but if the original trauma can’t heal, this one will be challenging."
    },
    {
      "title": "Identify whether this impulse is coming from a healthy or unhealthy place.",
      "content": "Identify whether this impulse is coming from a healthy or unhealthy place. Ask yourself, “Why do I want to reach out to my ex?” Think carefully on this one and take your time. If it might be a bad idea, it’s probably best to drop it. [8] X Research source Healthy reasons to want to get back together: The original barrier that kept the relationship from working is totally gone. You still harbor love in your heart for your ex. You’ve matured, they’ve matured, and you think it’s worth another shot. Unhealthy reasons to get back with your ex: You’re lonely, and you’d rather be with your ex than by yourself. [9] X Expert Source Allen Wagner, MFT, MA Marriage & Family Therapist Expert Interview. 24 September 2021. You feel like you’re “never going to do better” than them. Things aren’t going so well elsewhere in your life, and dating will make you feel better."
    },
    {
      "title": "Making at least one big, positive change will improve your odds here.",
      "content": "Making at least one big, positive change will improve your odds here. Pick a personal project or goal and throw yourself at it. If you’ve been meaning to go back to school, apply for college, post-grad, or professional improvement courses. If you’ve had your eye on a promotion at your company, throw yourself into your work and fight tooth and nail for it. Not only will you feel better and be happier, but your ex will look at you differently if they see how far you’ve come! [10] X Research source Making a few big improvements in your life is a productive way to hold on to what made them interested in you while differentiating yourself from whoever you used to be."
    },
    {
      "title": "Making a minor change to the way you look will start things fresh.",
      "content": "Making a minor change to the way you look will start things fresh. Get a haircut, update your wardrobe, or change your diet and lose a few pounds. You want your ex to look at you see the same person they were originally attracted to, but also see a person who looks more mature, elegant, and visually appealing. This goes a big way towards winning them back over! [11] X Research source Try to take your ex’s tastes into consideration. If you really know they liked short hair, consider a fresh cut. If they mentioned an affinity for glasses, keep the contacts out and pick up a new pair of spectacles."
    },
    {
      "title": "Reach out in a low-key way over text or social media.",
      "content": "Reach out in a low-key way over text or social media. Your ex may have a bunch of feelings swell up when you contact them, so calling them may leave them flustered or confused. Give them time to figure out how they want to respond by reaching out over text or social media. This will keep things casual. [12] X Research source “Hey! How are you?” is a perfectly reasonable place to start if things ended amicably. You could come up with a “reason” for reaching out. You might say, “Remember that road trip we took to Maine? What was the name of that beach where we saw that huge fishing boat?” The classic, “Hey stranger,” is always an option if you don’t want to make a huge opening statement. If things ended kind of roughly, you might try “Hey, I know things ended kind of crazy, but I’ve been doing a lot of soul searching lately. I hope you don’t mind me reaching out. I’d love to hear about what you’re up to and how you’ve been.” Reader Poll: We asked 1567 wikiHow readers and only 9% of them would reach out to an ex by calling and sharing their feelings. [Take Poll] So a casual text like this may be the best way to reconnect!"
    },
    {
      "title": "Don’t rush to get romantic—just get to know each other again.",
      "content": "Don’t rush to get romantic—just get to know each other again. Let the conversation develop organically over text or social media. You don’t want to scare your ex off by overwhelming them too quickly, so take a few days off of talking whenever a conversation reaches a logical conclusion. As you chat, keep things light, be friendly, and just enjoy your time talking to your ex. [13] X Research source This is an essential part of the process. You (and your ex) need time to sort of figure one another out and reestablish rapport."
    },
    {
      "title": "While you’re becoming friends again, assess where things are going.",
      "content": "While you’re becoming friends again, assess where things are going. As you chat, take an emotional inventory to see how you’re feeling about this. Figure out if you want to reorient your strategy or forget about the endeavor entirely. It’s possible that your ex has changed dramatically enough that you no longer want to continue down this path. You can still be friends, though! [14] X Research source If they don’t seem all that interested in continuing to talk (they never reach out to you first, their answers are short, etc.), just let it go. If they jump right out the gates and profess their love for you and you feel the same way, awesome! Don’t pump the brakes just because you think that’s the “right” thing to do."
    },
    {
      "title": "Throw out an invitation to hang out in a super low-key environment.",
      "content": "Throw out an invitation to hang out in a super low-key environment. After a few weeks of talking, take the plunge and suggest the two of you meet face-to-face. Invite them to join you for a drink to catch up, or suggest the two of you grab a coffee sometimes. If they agree, set the date and meet up with them. This will give you the opportunity to move your friendship further, and you’ll be able to tell if vibe is right or not. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If it’s super obvious that they’re romantically interested in you, ask them on a date after you hang out at least once as friends. Real life interactions are always different than talking over text or social media, so you should see them at least once as friends before moving forward."
    },
    {
      "title": "You can ask them out directly, or just bring up the idea.",
      "content": "You can ask them out directly, or just bring up the idea. If you’re sure this is what you want, take the plunge and ask them out. They might say no, but at least you’ll be able to move on with some closure knowing that you gave it your best. Besides, they might say yes! [16] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you want to ask them out, try: “Hey, no pressure or anything, but I’ve really enjoyed talking and hanging out. Would you be interested in going on a date sometime?” “If the answer is no, I totally understand, but I’m going to kick myself later on if I never ask you out. Do you want to grab dinner and see a movie with me next week?”"
    },
    {
      "title": "If the feelings are obviously reciprocal, lay your cards on the table.",
      "content": "If the feelings are obviously reciprocal, lay your cards on the table. You know your ex, and your ex knows you. If you’ve both been flirting, talking intimately, or even kissing, both of you know what’s up—it’s just neither of you have said it out loud. If you’re ready to move forward, tell them how you feel. [17] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you want to just be direct, say: “Look, I know it didn’t work out last time, but I like you and I’m pretty sure you like me. I’d love to pick up where we left off, but I don’t want to put any pressure on you here. How do you feel about getting back together?” “I’m just going to be straight with you. I still have feelings for you. I hope you feel the same way, but if you don’t, I think I just need to know now.”"
    },
    {
      "title": "Once you start dating again, keep it casual and go slow.",
      "content": "Once you start dating again, keep it casual and go slow. If you move too quickly and the relationship becomes a hyper-passionate, daily thing, the two of you may burn out or butt heads. There are no hard and fast rules here, but just take it slowly. Enjoy hanging out, keep things casual, and be as relaxed as you possibly can. [18] X Research source Don’t sleep with them right away. Intimacy is going to carry a lot of emotional weight if the two of you were intimate in the past, and things might get messy if you have sex too soon."
    },
    {
      "title": "As things get more serious, you may need to resolve old issues.",
      "content": "As things get more serious, you may need to resolve old issues. It’s best to do this earlier on, but after you’ve established the relationship. Sit down and have a calm, pleasant conversation about whatever problems from the past you haven’t addressed yet. [19] X Expert Source Allen Wagner, MFT, MA Marriage & Family Therapist Expert Interview. 24 September 2021. This will give both of you the opportunity to resolve whatever open you may have. [20] X Research source This is going to be a hyper-personalized conversation, but you might just say, “Hey, do you still have feelings about the way we ended things last time?” If you were the one who screwed things up last time around, make it abundantly clear that you aren’t that person anymore. Apologize, promise to never do it again, and let them vent if they need to. It’s possible that whatever barrier held the two of you back before is no longer important or relevant. If that’s the case, don’t worry about it."
    }
  ]
}