{
  "url": "https://www.wikihow.com/Monitor-No-Signal",
  "title": "6 Simple Ways to Fix a Monitor When It Shows No Signal",
  "steps": [
    {
      "title": "Make sure the monitor is set to the correct output.",
      "content": "Make sure the monitor is set to the correct output. Similar to TVs, some monitors allow you to have different sources connected. Use the physical buttons on your monitor to cycle through each output."
    },
    {
      "title": "Confirm the monitor cable is in the correct port.",
      "content": "Confirm the monitor cable is in the correct port. If you have a separate GPU , you will need to plug your monitor cable directly into the GPU rather than the motherboard. This port is commonly found on the back of the PC tower, below the motherboard ports. If the cable is in the correct port, make sure it's snug against it and not loose."
    },
    {
      "title": "Look for dust and debris in the port.",
      "content": "Look for dust and debris in the port. Additionally, look for any damage to the cable itself. This can prevent the video from being transmitted properly. If it's dusty, turn off your computer and unplug everything completely before you clean it ."
    },
    {
      "title": "Use a different cable.",
      "content": "Use a different cable. Some monitors may require a newer cable. If it's an older monitor, it may require an older cable."
    },
    {
      "title": "Use Safe Mode on your computer.",
      "content": "Use Safe Mode on your computer. If your monitor isn't displaying properly but can load Safe Mode, it's most likely your resolution. While in Safe Mode , choose a low resolution and restart your computer. When you're back in again, open your Display settings and select the recommended resolution."
    },
    {
      "title": "If you're using a monitor with your laptop, change your projection settings.",
      "content": "If you're using a monitor with your laptop, change your projection settings. Some devices won't automatically mirror your original screen; you'll need to change this manually. On Windows, press Windows + P to select Duplicate , Extend , or Second screen only . On Mac, click the Apple menu > System Settings > Display > display name > Use as . [1] X Research source On some devices, you may need to open the port first. Oppido advises to look for a key with a \"little hieroglyphic that looks like two boxes with a slash in between them\" and press it. You may need to hold down the Function key to activate it."
    }
  ]
}