{
  "url": "https://www.wikihow.com/Dispose-of-Old-Laptops",
  "title": "Simple Ways to Dispose of Old Laptops",
  "steps": [
    {
      "title": "Sell your computer.",
      "content": "Sell your computer. Even if your old laptop is a little slow or doesn’t seem to work at all, there may be someone out there who wants to buy it. Advertise your laptop for sale online or around your neighborhood, making sure to list any issues with it and any specifications you can work out. [1] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Some people will purchase old laptops for different parts. For them, it doesn’t matter if the laptop isn’t working, as long as it’s in good physical condition. Before you trade in, sell, or recycle your laptop, you should remove your data and files from it."
    },
    {
      "title": "Trade in your laptop for cash or gift cards.",
      "content": "Trade in your laptop for cash or gift cards. Many different electronics stores and laptop companies have programs where you can trade in your old technology for a small payment. Look online or ask at your local electronics store to find a trade-in program near you that can give an estimate of how much they will pay for old laptops. [2] X Research source Best Buy, Apple, and Amazon all have trade-in programs that operate all over the United States. Make sure to compare the amounts and payment methods between different programs to get the best deal for your old laptop."
    },
    {
      "title": "Donate your old laptop.",
      "content": "Donate your old laptop. If your laptop is still in working order, you might be able to donate it to a family or individual in need of their own computer. Look online for local computer-based charities that are looking for donations of laptops to find somewhere to give yours away. [3] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source The National Cristina Foundation and the World Computer Exchange are both charities that handle electronics."
    },
    {
      "title": "Take it to an electronics recycler.",
      "content": "Take it to an electronics recycler. Many electronics and laptops can have toxic substances in them, such as lead, mercury, or cadmium. To try and make disposing of potentially dangerous electronics safe, a lot of places around the world have set up electronics recycling plants. Look online for one near you. [4] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Some recyclers may require you to drop off your electronics at one of a few places around your local area, where others may offer a pick-up service. Do your research to find the one that will work best for you."
    },
    {
      "title": "Throw it away as a last resort.",
      "content": "Throw it away as a last resort. If there is no other way to dispose of your laptop safely, you can throw it away in your regular garbage. Be aware that this can be very damaging to the environment and should be used as an absolute last option. Laptops have toxic materials inside them that can leak and harm the landfill regular trash goes to and there's a risk that the battery will explode due to being in the sun and cause a fire. [5] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Many states in the U.S. have passed laws requiring all electronics to be disposed of safely by being recycled. Make sure you are not breaking the law if you throw away your laptop."
    },
    {
      "title": "Back up any data you want to keep.",
      "content": "Back up any data you want to keep. Any data left on the hard drive when you dispose of it will be lost forever if you don’t back it up. Spend an hour or two looking through everything on your computer to see if there are any files that you need to save. [6] X Research source Here are a few ways you can back up your data: Purchase an external hard drive to copy your data to. This will connect to the USB port on your computer and let you copy any files you want to save. If you want to load them onto a new computer, just plug the hard drive in and copy the files over. Back up your files online with a service like Google Drive , iCloud , or Dropbox . All of these should have options for online storage that will give you plenty of room to save your most important files, although some will cost a little money if you have a lot to back up. Use any of these steps that you need in order to wipe your computer to prepare it before you sell it, trade it in, or recycle it."
    },
    {
      "title": "De-authorize any registered programs (optional).",
      "content": "De-authorize any registered programs (optional). Some computer programs will have limits on the number of computers that they can be installed on with a single license. Not all programs have limits, however, so check Microsoft Office , iTunes, Adobe Creative Suite, and anything similar to deauthorize them on your old laptop. [7] X Research source To deauthorize a computer in iTunes, click on “Account” in the top bar and then select “Deauthorize This Computer.” In Adobe products, you should be able to deauthorize your computer by selecting “Help,” “Deactivate,” and “Deactivate Permanently.” Different programs will take different methods to deauthorize. Take a look online if you’re unsure how to deauthorize any specific program."
    },
    {
      "title": "Destroy any sensitive files.",
      "content": "Destroy any sensitive files. Even though you’ll be completely wiping your hard drive, it’s always better to be safe than sorry when it comes to bank statements, tax documents, or sensitive pictures you have saved. Find a program that will permanently delete your files, rather than just sending them to the recycling bin and leaving traces behind. [8] X Research source If you’re on Windows, choose a program such as CCleaner, Eraser, or File Shredder to destroy sensitive files. This functionality is built into most Mac computers. With all of the files you want to delete in the trash can, hold down the command key and click on the trash can icon. Select “Empty Trash Securely” to safely destroy all files in the trash can."
    },
    {
      "title": "Delete your browser history.",
      "content": "Delete your browser history. If you’ve been using the same web browser on your laptop for a while, it likely will have saved a lot of your personal information, passwords, and maybe even bank details. You should wipe all of this information from your computer before disposing of it. [9] X Research source Here’s how to do it in a few different browsers: If you’re using Safari, click on the “Safari” tab in the top-left corner of your screen and select “Clear History.” Make sure that “all history” is selected and click the “Clear History” button in the bottom corner of the window that appears. In Google Chrome, Internet Explorer, Microsoft Edge, and Mozilla Firefox, you can delete your browsing history by pressing Ctrl + Shift + Delete (it's the button above your number pad, on the right side of your keyboard and will work for either Mac or PC). Make sure every box is ticked in the window that appears and that the time frame is to delete everything. Click on the delete button in the bottom corner to delete your browsing data."
    },
    {
      "title": "Uninstall all of your programs.",
      "content": "Uninstall all of your programs. Just like your internet browser, many other programs will store your personal data to prevent you from having to type it in over and over again. Take a look through your programs to delete any that will store personal data, or uninstall everything to be extra safe. [10] X Research source Programs such as Microsoft Word or Excel may store your full name and address, which you might not want the next owner of your laptop to have. If you have a program installed that lets you make purchases, such as Steam, your credit card information may be stored."
    },
    {
      "title": "Reset your computer and format your hard drive.",
      "content": "Reset your computer and format your hard drive. Once you’ve made sure to save everything you want to keep and delete everything that you don’t off of your laptop, you should perform a system reset to completely wipe your hard drive. Doing a full factory reset and wiping your hard drive can be a difficult process, so make sure you understand how to do so. [11] X Research source You'll find on-screen instructions for formatting your harddrive in Settings (Windows) or Disk Ultility (Mac)."
    },
    {
      "title": "Remove or destroy your hard drive if you can’t turn on the computer.",
      "content": "Remove or destroy your hard drive if you can’t turn on the computer. If you’re disposing of a computer because it won’t turn on, you won’t be able to easily see what’s on the hard drive. In this instance, you should remove the hard drive from the computer entirely. [12] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source Here are a few ways to do so on different computers: Some older laptops will have hard drives that simply slide out of a port on the side. You may need to flick a switch to release it, but you should be able to grip it firmly and easily pull out your hard drive to remove it. [13] X Research source The hard drive may also be hidden behind a plastic panel on the back of the laptop. Look for a long piece of plastic near the side where the laptop opens, usually held in place by a screw. Unscrew any screws holding the panel or hard drive in place to remove it. [14] X Research source If you can’t work out how to take your hard drive out of your computer, check your manufacturer’s guidelines or look online for advice specific to the model of your laptop. If you want to keep files that are stored on the hard drive, store it in an anti-static bag. If you take it to a local computer repair store, they may be able to help salvage some of the data left on it. If you don’t need anything on the hard drive, use an electric drill to drill through the drive a few times in different places to completely destroy it. You can then dispose of it with the rest of your laptop. [15] X Research source"
    }
  ]
}