{
  "url": "https://www.wikihow.com/Make-a-Spotify-Artist-Account",
  "title": "Create a Spotify Artist Page for Your Music",
  "steps": [
    {
      "title": "Sign up with a distributor, like Distrokid.",
      "content": "Sign up with a distributor, like Distrokid. To get a Spotify artist account, you must put music on the platform through a distributor. Spotify uses them to prevent copyright infringement, and without one, you cannot make an artist profile. [1] X Research source Distrokid is the least expensive distributor and a great place for small artists to start. The basic package costs $22.99 a year and lets you upload an unlimited amount of music. [2] X Research source Check out Spotify’s other distributors, like CD Baby, LANDR, and TuneCore here ."
    },
    {
      "title": "Upload the highest quality lossless versions of your music.",
      "content": "Upload the highest quality lossless versions of your music. Format your tracks as FLAC or WAV files , then upload them to your distributor. Fill out the metadata form with the name you produce under, the names of everyone who worked on the track, the cover art, and a release date. [3] X Research source Spotify recommends using the FLAC format over WAV. Make sure that you like your name and that no other artist has it. It can be difficult to change your artist name on Spotify since it has to go through your distributor. [4] X Research source ttps://youtu.be/K8iwYMdu3Ps?si=CrXshuJjpedGC3Tx&amp;t=127 Use a TIFF, PNG, or JPEG for your cover photos. They must be square (have a 1:1 ratio), at least 640px wide and tall, and in the highest resolution available. [5] X Research source Allow 7 days between your upload date and your release date."
    },
    {
      "title": "Claim your artist profile and link it to your music.",
      "content": "Claim your artist profile and link it to your music. Go to artists.spotify.com/claim and follow the prompts to claim your account. Once you have access to your profile, you can upload a picture, bio, Artist Picks, Clips, and Canvases (short looping videos that play during a song). [6] X Research source To claim your account, click Artist or manager , then Continue . Log in if you haven’t already, then select Continue under “Claim artist account.” Confirm that the account shown is the one you want to use. Search your artist or band name, or paste your Spotify link or URI in the search bar, then click on your artist profile on the drop-down menu."
    }
  ]
}