{
  "url": "https://www.wikihow.com/Grow-Copepods",
  "title": "How to Grow Copepods",
  "steps": [
    {
      "title": "Purchase an aquarium or small container.",
      "content": "Purchase an aquarium or small container. The best way to grow copepods is in a separate culturing container. Copepods prefer large containers, so an aquarium is ideal. However, if you don’t have room for another aquarium, no worries. You can also use a small container, like a Rubbermaid plastic jar. If you’re using an aquarium, a ten gallon tank works best. [1] X Research source Here’s a cool hack: divide the tank into two halves using a piece of plexiglass, creating two separate cultures. Now, you have a backup in case one culture fails! [2] X Research source"
    },
    {
      "title": "Keep your copepod container at room temperature.",
      "content": "Keep your copepod container at room temperature. Copepods are pretty hardy, but you should avoid temperature extremes. This means it may not be the best idea to keep your container in direct sunlight in July or in the drafty, uninsulated attic in winter. Pick a room in your house that you maintain at a moderate temperature. [3] X Research source"
    },
    {
      "title": "Adjust the airflow.",
      "content": "Adjust the airflow. Gentle aeration will help keep your copepods happy and healthy. Buy an air pump and attach it to a gang valve using rigid air tubing. Place the end of the tube in the water, and use the gang valve to adjust the airflow into the tank or container. It should be flowing at a rate of one bubble every three seconds. [4] X Research source If you’re using a small container, drill a hole into the lid to allow the tubing to pass through."
    },
    {
      "title": "Maintain the proper salinity.",
      "content": "Maintain the proper salinity. Keep the salinity of your tank around 25-35ppt (1.018-1.025+). [5] X Research source You can measure salinity using a number of different tools, including refractometers, hydrometers, and conductivity probes. Follow directions on the packaging for an accurate measurement. It’s best to keep your culturing container at the same salinity as your main tank. That way, when you feed your copepods to your fish or coral, the copepods won’t go into shock. [6] X Research source"
    },
    {
      "title": "Select a phytoplankton to feed your copepods.",
      "content": "Select a phytoplankton to feed your copepods. Copepods eat phytoplankton, a teeny tiny marine algae. Check to see what type of phytoplankton is best for your species of copepod. You can buy phytoplankton at your local fish store or order it online. [7] X Research source Nannochloropsis is a common phytoplankton that’s pretty easy to find."
    },
    {
      "title": "Add a few drops of phytoplankton to your container.",
      "content": "Add a few drops of phytoplankton to your container. Add phytoplankton, drop by drop, until the water turns a nice light green color. As the copepods eat the phytoplankton, the water will turn lighter. Your goal is to keep the water light green. [8] X Research source You may be tempted to clean up the “gunk” that collects at the bottom of your tank, but leave it until you do your monthly cleaning. It’s completely normal, and actually healthy for copepods! [9] X Research source"
    },
    {
      "title": "Add the copepods to the container.",
      "content": "Add the copepods to the container. Finally, it’s time to add the key ingredient to your culturing container: your copepods! Allow your copepods to reach room temperature before dumping them in. Don’t worry too much about acclimation. These guys are tough!"
    },
    {
      "title": "Harvest your copepods.",
      "content": "Harvest your copepods. When it’s time to feed your copepods to your fish or coral, take a cupful of water from your culturing container. Then, pour the water over a 100 micron screen. This will catch the adult copepods while letting the little guys go. Use some salt water to wash the copepods from the screen into a new container, and add them to your main tank. [10] X Research source Wait a week in between harvests to allow the adult population to regrow."
    },
    {
      "title": "Change the water regularly.",
      "content": "Change the water regularly. Drain the water over a 55 micron fine mesh screen to collected the copepods, and then place the screen in a clean, saltwater-filled container so they don’t dry up. Wipe the tank down with paper towel, rinse it out with a bit of fresh water, then add clean, fresh saltwater to the tank. Finally, add your copepods and fresh phytoplankton. [11] X Research source If you’re using a tank, you should change the water every four weeks. Change the water weekly for a small culturing container, like a jar or a large cup."
    },
    {
      "title": "Keep an eye out for contaminants.",
      "content": "Keep an eye out for contaminants. Sometimes, your copepod culture may become contaminated with other organisms, like ciliates, rotifers and brine shrimp. If this happens, you may need to start a new culture. The contaminants can scarf down all of the copepods’ food, eventually killing off the population. [12] X Research source"
    },
    {
      "title": "Get a refugium.",
      "content": "Get a refugium. A refugium is an area that shares water with the main tank but is partially separated to protect small or delicate organisms, like your little copepods. There are several different types of refugiums, so talk to an employee at your local fish store to find one that works with your price point and aquarium size. [13] X Research source An in-tank refugium is the simplest and cheapest type. It’s a small container that allows water to flow through but keeps bigger critters, like fish, out. A hang-on refugium is a separate container that hangs off the back of the main tank, while a sump-based refugium is a second tank that is placed under your main tank."
    },
    {
      "title": "Set up the refugium with a habitat for the copepods.",
      "content": "Set up the refugium with a habitat for the copepods. Add live rock, sand, and macroalgae like ulva to give the copepods food sources and areas to hide and breed. All of these items are available at local saltwater fish stores. [14] X Research source Don’t overclean your refugium--leave algae and detritus so your copepods can graze. You should trim your macroalgae occasionally to prevent overgrowth. [15] X Research source"
    },
    {
      "title": "Remove predators from your refugium.",
      "content": "Remove predators from your refugium. If you have other critters in your refugium, like emerald crabs or bristle worms, they may munch on your copepods, so remove a few of them before starting to grow your copepods. If removing predators is too difficult or you simply don’t want to, raise your copepods in a separate container."
    },
    {
      "title": "Add copepods to your refugium.",
      "content": "Add copepods to your refugium. Let them reach room temperature and dump them into the refugium. Turn off the pumps before you add them so they have a chance to swim away from the fish and filter feeders."
    },
    {
      "title": "Monitor your fish population.",
      "content": "Monitor your fish population. If you’re trying to grow copepods in the same tank as your fish, you’ll need to make sure they’re reproducing faster than they’re being eaten in order to maintain the population. If you have too many copepod-eating fish, it could throw off the balance. Be aware that certain fish species that don’t rely copepods as their main food source, like clown fish and line wrasse, still like to snack on them. To see how many copepods are in your tank, shine a light in your tank at night. The copepods will look like tiny white specks swimming towards the light. You may also be able to find these little critters behind live rock or collected in tank corners."
    },
    {
      "title": "Research the type of copepods best for your fish or filter feeders.",
      "content": "Research the type of copepods best for your fish or filter feeders. Copepods are typically used to feed marine fish, like mandarin dragonets and scooter blennies, or filter feeders, like coral. Different organisms feed on different types of copepods, so do your research to make sure you pick the right species. Tigriopus californicus is one of the most common species of copepods, and should be used to feed adult fish. These critters are pretty hardy and can survive at high population densities and varying water temperatures. Because Tigriopus are a larger species, they should never be used to feed fish larva. They can claw at the larva, causing distress and death. Tisbe and Nitokra are best for feeding coral and other filter feeders. They reproduce more quickly than Tigriopus and are smaller, which might make them a little harder to see. Like Tigriopus , they are tough."
    },
    {
      "title": "Purchase live copepods.",
      "content": "Purchase live copepods. You may be able buy bottles of live copepods at your local fish store. Otherwise, order them through online retailers like https://www.LiveAquaria.com or https://www.Algaebarn.com . [16] X Research source"
    },
    {
      "title": "Observe how your fish respond to the copepods.",
      "content": "Observe how your fish respond to the copepods. Larger copepods like Tigriopus may be too big for some fish to handle. In fact, Tigriopus can sometimes fight their way out of a fish gut using their strong mouthparts! If this happens, you’ll need to select a smaller species of copepod."
    }
  ]
}