{
  "url": "https://www.wikihow.com/Get-Amethyst-Shards",
  "title": "How to Get Amethyst Shards, Clusters, and Buds in Minecraft",
  "steps": [
    {
      "title": "Dig between Y=-58 and Y=30 to find an Amethyst Geode.",
      "content": "Dig between Y=-58 and Y=30 to find an Amethyst Geode. An Amethyst Geode is a large cave filled with Amethyst Blocks. You'll need to go caving within the Y levels to find it. Keep an eye on your map for any large spots of purple—this can indicate the Amethyst Geode you need. [1] X Research source Amethyst Geode : a large cluster of blocks that can be cracked open and entered, similar to a cave Budding Amethyst : the block found in the innermost layer of the Amethyst Geode that grows Amethyst Clusters over time Amethyst Bud : stage 1-3 of the growth cycle of Amethyst Clusters Amethyst Cluster : the final stage (stage 4) of the growth cycle and drops Amethyst Shards when mined"
    },
    {
      "title": "Mine Amethyst Clusters with a pickaxe.",
      "content": "Mine Amethyst Clusters with a pickaxe. These are the fully grown Amethyst gems on the Budding Amethyst. It takes about 7 in-game days to fully mature. If you try to mine Amethyst Buds before they reach the final stage, you won't get any Amethyst Shards. Using a pickaxe will yield 4 shards while other methods will yield 2 shards. It's best to mark the Amethyst Geode on the map and return routinely to mine the Amethyst Buds when they're ready. You can also find Amethyst Shards in Ancient City chests (23.2% chance)."
    },
    {
      "title": "Block of Amethyst.",
      "content": "Block of Amethyst. This is the block found within Amethyst Geodes that grow Amethyst. To craft this, you'll need 4 Amethyst Shards."
    },
    {
      "title": "Calibrated Sculk Sensor.",
      "content": "Calibrated Sculk Sensor. This is the Amethyst variant of the Sculk Sensor, which can detect vibrations nearby. To craft this, you'll need a Sculk Sensor and 3 Amethyst Shards."
    },
    {
      "title": "Spyglass.",
      "content": "Spyglass. This tool is used to zoom in on objects far away. To craft this, you'll need 1 Amethyst Shard and 2 Copper Ingots."
    },
    {
      "title": "Tinted Glass.",
      "content": "Tinted Glass. This item will block light while remaining transparent. To craft this, you'll need 4 Amethyst Shards and 1 Glass."
    }
  ]
}