{
  "url": "https://www.wikihow.com/Kill-Black-Mold",
  "title": "How to Get Rid of Black Mold Safely & Effectively",
  "steps": [
    {
      "title": "Identify black mold.",
      "content": "Identify black mold. Black mold often grows in damp areas, places that are often wet, or places where there has been a leak or water damage. Common places to find black mold include basements, crawl spaces, bathrooms, and laundry rooms. Here are a few of the identifying characteristics of black mold: [2] X Research source It appears black in color It grows in a circular pattern Patches of black mold look like they're made up of dots It looks slimy on a wet surface On a dry surface, it will look like soot"
    },
    {
      "title": "Seal the area.",
      "content": "Seal the area. To prevent mold spores from becoming airborne and spreading, you can seal the room. Put up sheets of plastic to cover doors and vents that lead to other areas of the house. Use painter’s or construction tape to tape the plastic in place and seal the room. [3] X Research source Vents you may want to cover include return vents, and heating and air conditioning vents. Leave exhaust vents open. Sealing the area will help prevent spores from spreading from one area of the house to another. Sealing won’t necessarily stop mold from growing elsewhere in the house. Mold spores are always present in the air, and mold can grow anywhere that there's moisture."
    },
    {
      "title": "Open windows.",
      "content": "Open windows. Mold itself and the cleaning products you use to kill it can irritate eyes, skin, and lungs, so you must provide yourself with as much fresh air as possible. In the area where you're going to be attacking the mold, open as many windows as possible In winter when it’s cold out, open at least one or two windows to let in some fresh air."
    },
    {
      "title": "Turn on vents and fans.",
      "content": "Turn on vents and fans. To help draw mold spores out of the room and out of the house, turn on any exhaust fans in the room you're working in. You can also position a fan in front of an open window and aim it outside. This will similarly draw mold spores out of the room and push them outside. To prevent blowing mold spores around the room, avoid using fans if they're not right in front of a window and blowing air outside."
    },
    {
      "title": "Wear personal protective equipment.",
      "content": "Wear personal protective equipment. Mold exposure can cause upper respiratory illness, and the cleaners you use to kill the mold may also be damaging and corrosive. To protect yourself while you're cleaning, consider wearing protective gear, including: [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Safety goggles Non-porous gloves Mask or respirator"
    },
    {
      "title": "Don’t mix cleaning solutions.",
      "content": "Don’t mix cleaning solutions. You will have to choose a cleaning solution to kill the mold, and it’s important that you stick to that one cleaner. Mixing different cleaners can be very dangerous, and you can create unexpected chemical reactions. Never mix ammonia or bleach together or with any other household cleaners."
    },
    {
      "title": "Consider replacing absorbent materials.",
      "content": "Consider replacing absorbent materials. Removing mold from absorbent materials can be extremely difficult. Instead, most professionals will recommend that you remove and replace such items, since it probably won’t be possible to remove the mold without damaging the material or causing further problems. [5] X Expert Source Mike Kapur Certified Mold Assessor & Home Inspector, Sonic Home Inspections Expert Interview. 19 August 2020. Absorbent materials that may need to be replaced include drywall, ceiling tiles, furniture and carpeting. [6] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Scrub the affected area with soapy water.",
      "content": "Scrub the affected area with soapy water. Fill a bucket with warm water, and add 2 tablespoons (30 ml) of liquid dish soap. Swish the soap around in the water to make suds. Dip a stiff-bristled brush into the soapy water and scrub the moldy surface with the brush. [7] X Research source Re-dip the brush regularly and scrub until the area is saturated with suds. Rinse the area with water. Pre-scrubbing the mold will help break up the surface so that you can penetrate to the roots with your cleaner and kill the mold."
    },
    {
      "title": "Mix your cleaning solution.",
      "content": "Mix your cleaning solution. There are a number of cleaning solutions and products you can use to clean mold. The most effective will be a commercial biocide or antimicrobial cleaner, which is specifically designed to kill mold. There are other cleaning solutions you can try that have proven effective, including: Equal parts ammonia and water 1 cup (235 ml) of bleach mixed with 1 gallon (3.8 L) of water Pure distilled vinegar 1 teaspoon (5 ml) of tea tree oil and 1 cup (235 ml) of water Equal parts baking soda and water, mixed into a paste in a bowl One part hydrogen peroxide mixed with two parts water 1 cup (409 g) of borax dissolved in 1 gallon (3.8 L) of water ¼ cup (102 g) of borax dissolved in ½ cup (118 ml) of vinegar and 4 cups (940 ml) of warm water"
    },
    {
      "title": "Apply cleaner and let it soak.",
      "content": "Apply cleaner and let it soak. For liquid solutions, spray generous amounts of cleaner on the moldy surface that you pre-scrubbed. For pastes, apply the paste to the affected area with a knife, brush, or old tooth brush. Let the cleaner stand for about 15 minutes. This will give it time to penetrate the mold and kill it all the way to the roots, which will prevent it from growing back. [8] X Research source"
    },
    {
      "title": "Scrub porous materials.",
      "content": "Scrub porous materials. When the cleaner has had time to soak in, scrub the surface with a stiff-bristled brush. This will help dislodge the mold and work the cleaner in even farther. You can use an non-abrasive scrubbing pad to scrub the area as well."
    },
    {
      "title": "Rinse and dry the area.",
      "content": "Rinse and dry the area. To remove any leftover mold and cleaner, rinse the area with clean water. When the mold and cleaner are gone, wipe the area dry with a towel or a squeegee. This will remove excess moisture and prevent the mold from growing back. [9] X Research source Mold can start growing on a damp surface within 24 hours, which is why it’s important to keep the area dry after cleaning."
    },
    {
      "title": "Know when to call a professional.",
      "content": "Know when to call a professional. Mold can be notoriously difficult to clean, especially in hard to reach places and on certain materials, such as dry wall and other porous materials. There are times when it’s best to call a mold removal professional, including if: [10] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Your cleaning effort wasn’t effective The affected area is larger than 10 square feet (3 square meters) You suspect there's mold in your heating, cooling, or ventilation system You have any health concerns about the mold The mold problem was caused by contaminated water or sewage"
    },
    {
      "title": "Remove the source of moisture.",
      "content": "Remove the source of moisture. [11] X Expert Source Mike Kapur Certified Mold Assessor & Home Inspector, Sonic Home Inspections Expert Interview. 19 August 2020. As long as there's a moisture source, there's the potential for mold. After cleaning your mold problem, it’s essential that you remove the source of the moisture that caused the mold to grow in the first place. [12] X Research source Depending on where in the house the mold was, possible moisture problems could include: Leaks Floods Spills Dampness from cooking or bathing Lack of moisture barrier in the basement"
    },
    {
      "title": "Lower the humidity.",
      "content": "Lower the humidity. Mold thrives in humid environments where the moisture levels are above 50 percent. To prevent mold, install a hygrometer and keep and eye on the humidity levels. When it gets too high, ways to reduce humidity include: [13] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Running a dehumidifier [14] X Expert Source Mike Kapur Certified Mold Assessor & Home Inspector, Sonic Home Inspections Expert Interview. 19 August 2020. Running the air conditioner Opening windows Increasing ventilation Opening windows and using vents when cooking"
    },
    {
      "title": "Dry your shower after bathing.",
      "content": "Dry your shower after bathing. Showers and tubs are common places for mold to grow because they stay wet all the time. To prevent this, keep a squeegee in the bathroom and ask that all family members and guests wipe down the walls after bathing. You should also open a window or turn on the bathroom fan anytime somebody uses the bathroom to bathe or shower."
    },
    {
      "title": "Fix leaks immediately.",
      "content": "Fix leaks immediately. Leaks are a huge source of moisture problems in homes, and the extra moisture creates a prime environment for mold to grow. You can still prevent mold even if a leak occurs, but you do have to act quickly to fix the leak and dry the area. Leaks to look out for include: Burst pipes Leaking pipes Roof leaks Basement and foundation leaks"
    },
    {
      "title": "Clean up after a flood right away.",
      "content": "Clean up after a flood right away. Floods can often lead to mold because there's a lot of water that comes in at once, and it’s not always possible to clean it all right away. After a flood, the steps you should take as soon as possible to clean include: [15] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Removing all the excess water Using a wet vacuum to get rid of dampness Replacing damaged carpeting, flooring, and drywall Using mold-inhibiting cleaners"
    }
  ]
}