{
  "url": "https://www.wikihow.com/Airdrop-Stuck-on-Waiting",
  "title": "12 Easy Ways to Fix Apple AirDrop When It's Not Sending",
  "steps": [
    {
      "title": "Make sure Wi-Fi is turned on.",
      "content": "Make sure Wi-Fi is turned on. You don't need to connect a network, but AirDrop uses point-to-point Wi-Fi to send data to someone else. If Wi-Fi is disabled, you'll need to turn it on. Go to Settings → Wi-Fi → toggle on Wi-Fi ."
    },
    {
      "title": "Bluetooth",
      "content": "Bluetooth must be turned on to find other devices. If you're having trouble sending files, the Bluetooth connection could have been disabled during the transfer. Go to Settings → Bluetooth → toggle on Bluetooth ."
    },
    {
      "title": "You can't have a Personal Hotspot active when trying to AirDrop.",
      "content": "You can't have a Personal Hotspot active when trying to AirDrop. You need your Bluetooth connectivity free while you complete the transfer. To turn off Hotspot, go to Settings → Personal Hotspot → toggle off Allow Others to Join ."
    },
    {
      "title": "Make sure both devices are unlocked.",
      "content": "Make sure both devices are unlocked. Use the passcode or Face ID to unlock the devices. For best results, leave the receiving device on the home page while the file sends."
    },
    {
      "title": "Change AirDrop settings to \"Everyone\".",
      "content": "Change AirDrop settings to \"Everyone\". If you have your settings set to Contacts only , you'll need to change this. Go to Settings → General → AirDrop → Everyone for 10 Minutes . Older versions of iOS will show Everyone ."
    },
    {
      "title": "AirDrop only has a range of about 30 feet.",
      "content": "AirDrop only has a range of about 30 feet. To ensure your files aren't getting lost over the connection, place the two devices next to each other. Make sure you're only sending to one device at a time."
    },
    {
      "title": "Make sure both devices have access to AirDrop.",
      "content": "Make sure both devices have access to AirDrop. You may have accidentally blocked its permissions. To change it, do the following: Open the Settings app. Tap Screen Time . Tap Content & Privacy Restrictions . Tap Allowed apps . Toggle on AirDrop ."
    },
    {
      "title": "Update both devices.",
      "content": "Update both devices. Make sure you're running the latest update supported on your device. This could include major bug fixes. On iPhone , check for updates in Settings → General → Software Update . On Mac Ventura, click the Apple menu → System Settings → General → Software Update . On Mac Monterey and older, click the Apple menu → System Preferences → Software Update . [1] X Research source"
    },
    {
      "title": "Try to restart your device and the receiving device.",
      "content": "Try to restart your device and the receiving device. You may just need a simple reset to get your connection working. On iPhone X and newer, press and hold the side button and either volume button until the slider appears. Slide to power off. On iPhones with a home button, press and hold the side button until the slider appears. Slide to power off. Wait a few seconds, then power on your device again."
    },
    {
      "title": "Disable any active VPNs.",
      "content": "Disable any active VPNs. Virtual Private Networks can interfere with your Wi-Fi or Bluetooth connection. Temporarily disable your VPN, then try to AirDrop your file again."
    },
    {
      "title": "Reset your network settings.",
      "content": "Reset your network settings. If all else fails, this might be an issue with your network. Open the Settings app. Tap General . Tap Reset . Tap Reset Network Settings ."
    },
    {
      "title": "Consider a cloud service.",
      "content": "Consider a cloud service. If you need to send a large file, consider using a cloud service such as Apple iCloud , Google Drive , or Microsoft OneDrive . These can host larger files that can be accessed around the clock, which can be beneficial if you need to share with multiple people."
    }
  ]
}