{
  "url": "https://www.wikihow.com/Call-Ukraine",
  "title": "How to Call Ukraine",
  "steps": [
    {
      "title": "Dial the exit code for the country you are calling from.",
      "content": "Dial the exit code for the country you are calling from. This code should be dialed first and will let you make a long-distance international call. The most common exit codes are 011 or 00. From the United States and Canada, the exit code is 011. The exit code for most countries in Africa, Asia, Europe, and South America is 00. If you are located in Australia, the exit code is 0011."
    },
    {
      "title": "Dial the country calling code.",
      "content": "Dial the country calling code. This number will direct your call to the correct nation. Each country has a specific country calling code assigned to it. The country calling code for Ukraine is 380. [1] X Research source"
    },
    {
      "title": "Dial the area or city calling code for the particular location in Ukraine that you would like to call.",
      "content": "Dial the area or city calling code for the particular location in Ukraine that you would like to call. Large rural parts of Ukraine are rural have “area codes,” while urban areas have “city codes.” This code will further direct your international call, as large countries may have repeated phone numbers that are kept distinct only by different city codes. The area codes in Ukraine are two digits for the provinces (or “oblasts”). For specific cities within the provinces, these two digits are followed by one or two more digits. Ukrainian city and area calling codes are roughly the same as area codes in the United States. The city code for the Ukrainian capital, Kiev, is 44."
    },
    {
      "title": "Dial the specific phone number.",
      "content": "Dial the specific phone number. This is the number of the individual phone you are trying to reach. Ukrainian phone numbers usually contain nine digits. [2] X Research source For landlines, the area code is included as part of these nine digits. The number format of a call placed to Kiev, Ukraine from the United States should look like: 011 – 380 – 44 – xxx – xxxx."
    },
    {
      "title": "Find the user’s network code.",
      "content": "Find the user’s network code. Mobile numbers do not have an associated area code or city code. To call a Ukrainian mobile number, dial in the following format: exit code – 380 – XX[network code] – xxx – xxxx. Network codes are 2-digit numbers, and are different depending on the mobile service provider. [3] X Research source Some of the common mobile network codes in Ukraine are 39, 50, 63, 66, 67 and 68."
    },
    {
      "title": "Add a “+” symbol between the country code and the mobile code.",
      "content": "Add a “+” symbol between the country code and the mobile code. If you are calling from a cell phone, you may need to add this additional symbol in order for the call to connect. [4] X Research source"
    },
    {
      "title": "Anticipate further fees if you call from a cell phone.",
      "content": "Anticipate further fees if you call from a cell phone. Many American cell-phone providers add charges to international calls. [5] X Research source Contact your own provider to ask about their charge policy."
    },
    {
      "title": "Connect with someone in Ukraine using Skype.",
      "content": "Connect with someone in Ukraine using Skype. It is free to connect to another Skype user using the Skype video chat, even if the other user are located internationally. [6] X Research source This is no different from Skyping someone domestically. If the person you are calling does not have video capabilities, you can make a voice call on Skype."
    },
    {
      "title": "Call a phone using Skype.",
      "content": "Call a phone using Skype. If the person you want to talk with does not have Skype video chat, you can use Skype to call their mobile or landline. Once you login to Skype, click on “Call phones”; from there you can enter a number to dial. Although this feature is not free (since you are calling a phone line), Skype offers low calling rates, based on the country you are calling to (not from). You can pay to call a Ukrainian landline or cell phone through purchasing Skype Credit or an international-calling subscription. [7] X Research source"
    },
    {
      "title": "Call Ukraine using Facebook Messenger.",
      "content": "Call Ukraine using Facebook Messenger. Unlike calling a cell phone or landline over Skype, Facebook Messenger allows you to place international phone calls for free. To call using Facebook, open an individual’s Messenger window, and click on the “Call” icon (the small phone at the top of the Messenger window). You can call any Facebook users—domestic or international—whose “Call” icon is blue. If the individual’s icon is black, there are either offline or have not updated their Messenger."
    },
    {
      "title": "Call Ukraine using Google Voice.",
      "content": "Call Ukraine using Google Voice. Although the Google Voice feature is only available in the United States, you can use it to make international calls, including to Ukraine. [8] X Research source Google Voice is an extension of Google Chat (which allows video calls). Before you can use Google Voice, you will be required to provide an existing U.S. phone number, or be assigned a specific Google Voice number. While international calls on Google Voice are not free, they are less expensive than calls made on a cell phone or landline."
    }
  ]
}