{
  "url": "https://www.wikihow.com/Make-Zobo-Drink",
  "title": "How to Make Zobo Drink",
  "steps": [
    {
      "title": "Get some red sorrel or roselle hibiscus leaves.",
      "content": "Get some red sorrel or roselle hibiscus leaves. Get dried hibiscus leaves (sorrel or roselle) from your local supermarket or African/Caribbean market. Make sure you get red sorrel, not white sorrel, for this drink. These are also called zobo leaves."
    },
    {
      "title": "Select a ripe pineapple.",
      "content": "Select a ripe pineapple. When looking for a pineapple at the store, make sure to get a ripe pineapple. The skin should be more yellow and orange than green, since this will result in a better flavored drink."
    },
    {
      "title": "Choose your favorite sweetener.",
      "content": "Choose your favorite sweetener. You can use any sweetener you want to make this drink. For example, agave nectar, cane syrup, or cane sugar will work. You can also make this drink without a sweetener for a sugar-free, low-calorie alternative."
    },
    {
      "title": "Pick an appropriate-sized pot.",
      "content": "Pick an appropriate-sized pot. Choose a pot depending on the amount of the drink you want to make. For a small amount of Zobo drink, such as for 2-4 people, you can use a saucepan. For a larger quantity, you can use a bigger pot."
    },
    {
      "title": "Remove the pineapple skin.",
      "content": "Remove the pineapple skin. Cut off the crown of the pineapple. Cut off the base, then cut the pineapple in half to make it easier to work with. Slice vertically down around the perimeter of the pineapple to get rid of the skin. You’ll need a sharp kitchen knife to skin the pineapple. Be careful to keep your fingers out of the way so you don’t cut yourself."
    },
    {
      "title": "Dice the pineapple.",
      "content": "Dice the pineapple. After cutting the pineapple in half, cut each slice in half again. Then, cut each of the 2 new pieces into medium sized chunks."
    },
    {
      "title": "Put the ingredients into a pot.",
      "content": "Put the ingredients into a pot. Pour the sorrel leaves into a pot. Fill it up halfway, then add the pineapple chunks. Finally, add just enough water to cover the leaves."
    },
    {
      "title": "Let the mixture boil for half an hour.",
      "content": "Let the mixture boil for half an hour. After about 30 minutes, or once the mixture starts to bubble over, turn off the heat. You should notice the dark purple-red color of the drink at this point. Let the drink cool down to room temperature. It should take approximately another 30 minutes for the drink to cool."
    },
    {
      "title": "Drain the juice to remove the solids.",
      "content": "Drain the juice to remove the solids. Drain the juice through a sieve, colander, cheese cloth, or anything you have that can separate the liquid from the solid parts. Wring out any remaining juices in the sorrel and pineapple mixture with your hand. Use a glove to keep your hands clean and avoid stains on your skin. Zobo is bright red!"
    },
    {
      "title": "Add your sweetener and refrigerate the drink.",
      "content": "Add your sweetener and refrigerate the drink. Add your sweetener of choice (optional), then stir the mixture well. Refrigerate it or add ice if you desire a cold drink. Enjoy!"
    }
  ]
}