{
  "url": "https://www.wikihow.com/Get-a-Shelf-on-the-Upper-Glutes",
  "title": "20+ Exercises to Build a Glute Shelf at Home or in the Gym",
  "steps": [
    {
      "title": "Dumbbell front squat",
      "content": "Dumbbell front squat (perform 3-4 sets of 12-15 reps): Pick up a dumbbell in each hand and stand with your feet shoulder-width apart. Hold the dumbbells at shoulder height, keeping your elbows bent and held close to your body. Lower yourself into a squat position by bending your knees and pushing your hips back, keeping the dumbbells above your elbows at all times. Push through your heels until you’re back at the starting position to complete 1 rep. [1] X Research source For good form and to prevent injury , keep your chest up and maintain a neutral spine position throughout the squat. Try squatting without dumbbells to turn this into a bodyweight exercise. Dumbbell front squats work your gluteus maximus (the largest glute muscle) as well as your quadriceps, hamstrings, calves, abdominal muscles, and spinal erectors."
    },
    {
      "title": "Barbell back squats (perform 2-4 sets of 3-8 reps):",
      "content": "Barbell back squats (perform 2-4 sets of 3-8 reps): Go to a squat rack and set a barbell slightly lower than your shoulders. Step underneath the barbell so it rests on your upper back muscles and grip the bar on both sides. Unrack the bar, then step backward so you’re a few inches away from the rack. Stand tall, keep your feet slightly wider than hip-width, and stack your shoulders on top of your hips. [2] X Research source Maintain this alignment and bend down at your hips, knees, and ankles until your thighs are about parallel to the floor. Pause for a second, then push both feet firmly into the ground to raise yourself back up. Keep your back straight and squeeze your glutes as you lift. Barbell back squats are excellent for your lower back, hamstrings, and gluteus maximus."
    },
    {
      "title": "Dumbbell Bulgarian split squat",
      "content": "Dumbbell Bulgarian split squat (perform 3 sets of 8-10 reps per leg): Grab a pair of dumbbells and stand with your back to a bench or other elevated surface. Place the top of one foot on the bench behind you and step forward with your front leg until you’re in a lunge position. Bend your knees to lower your front leg into a squat, keeping your front knee above your ankle. [3] X Research source Lower yourself until your front knee is almost touching the ground, then push back up through your front foot to a standing position. Repeat for the desired number of reps, then switch legs. Try this move without weights to make it a bodyweight exercise. Bulgarian split squats target your quads, hip adductors, gluteus maximus, and gluteus medius."
    },
    {
      "title": "Romanian deadlift",
      "content": "Romanian deadlift (perform 3-4 sets of 8-12 reps): Place a barbell on the floor right in front of you with about 1 in (2.5 cm) of space between your shins and the bar. Stand with your feet underneath your hips and grip the bar slightly wider than shoulder width. Tighten your back muscles to keep your core engaged and deadlift the bar to a standing position, keeping the bar close to your body on the way up. Pull your chest up and squeeze your glutes as you rise to focus the lift on your hindquarters. [4] X Research source To lower the bar, lean forward with your back straight and let your knees unlock slightly as your hips move backward. Lean forward until you feel a strong (but not painful) stretch in your hamstrings. Romanian deadlifts work your gluteus maximus, hamstrings, spinal erectors, and hip adductors."
    },
    {
      "title": "Sumo deadlift",
      "content": "Sumo deadlift (perform 3-4 sets of 12-15 reps): Stand with your feet slightly wider than your shoulders with your toes pointing outward at a 45-degree angle and a barbell on the ground in front of you. Grip the barbell with an overhand grip, keeping your arms inside of your legs. Tense your core and push your hips back while keeping your chest up to raise the bar. [5] X Research source Drive through your heels and keep the bar close to your body as you lift it. Straighten your legs and hips at the top of the lift, then lower and repeat. Sumo deadlifts target both your gluteus maximus and medius to a high degree since your stance is wider and your hip is slightly rotated outward."
    },
    {
      "title": "Dumbbell reverse lunge (perform 2-3 sets of 8-12 reps per leg):",
      "content": "Dumbbell reverse lunge (perform 2-3 sets of 8-12 reps per leg): Grab a dumbbell in each hand and stand with your feet hip-width apart with a slight bend in your knees. Engage your core to keep your spine neutral, then take a step backward, bending at the hips, knees, and ankles until your back knee is about 1 in (2.5 cm) or so off the ground. Pause for a second, then push through your back foot using your glute and quad to stand back up to an upright position. [6] X Research source For good form and safety, aim to keep your shoulders directly above your hips with a neutral head and neck position (tuck your chin in slightly toward your chest). Try this move without dumbbells to make it a bodyweight exercise. Reverse lunges mostly work your gluteus maximus and hamstrings (unlike forward lunges which mostly work your quadriceps)."
    },
    {
      "title": "Walking lunge",
      "content": "Walking lunge (perform 2-4 sets of 15-25 reps per leg): Grab a dumbbell in each hand and stand tall, holding them by your side or up near your shoulders. Engage your core, keep your chest tall, and take a large step forward so your front thigh is about parallel with the ground and your back knee is almost touching the floor. Hold for a second, then push through your front foot while squeezing your glutes to return to a standing position. Repeat with the other leg. [7] X Research source To keep your balance, don’t let the dumbbells swing forward as you lunge, and make sure your front heel does not lift off the ground as you lunge forward. Try this move without dumbbells to make it a bodyweight exercise. Walking lunges work your glutes, quads, and hamstrings. The deeper the lunge, the more involved your glutes get in the movement."
    },
    {
      "title": "Back hyperextension",
      "content": "Back hyperextension (perform 3-4 sets of 12-15 reps): Position yourself belly-down on the hyperextension machine with the backs of your ankles tucked under the ankle bars and the pad positioned just below your hip flexors. Start with your back extended while holding a weight to your chest, then round your upper back to bend forward, keeping the tension in your hamstrings and glutes. Bend until you feel a good stretch in your hamstrings. [8] X Research source Pause for a second at the bottom, then raise yourself back to the starting position by contracting your glutes as hard as possible (imagine squeezing your butt cheeks together). Keep your upper back rounded to avoid relying on your lower back muscles. Cross your arms in front of your chest instead of holding a weight to make this a bodyweight exercise. Hyperextensions are great for your glute muscles, hamstrings, and lower back muscles. This move is also called a dumbbell 45-degree hyperextension. Alternatively, use a barbell instead of holding a weight to do a hyper-deadlift."
    },
    {
      "title": "Reverse hyperextension (perform 3 sets of 12-15 reps):",
      "content": "Reverse hyperextension (perform 3 sets of 12-15 reps): Lay belly-down on a hyperextension or glute-ham raise developer machine and grab the hand bars (or if you don’t have those, lay on a bench with your arms wrapped underneath it). Position your hips at the end of the machine or bench so they can flex freely without your lower back extending. Brace your core and straighten your legs out behind you, flexing your hams, glutes, and lower back. [9] X Research source Hold your legs slightly above your hip line for a second, then slowly lower them back down to the ground and repeat. Reverse hypers are great for your spinal erectors, hamstrings, and gluteus maximus."
    },
    {
      "title": "Hip thrust",
      "content": "Hip thrust (perform 3-4 sets of 12-15 reps): Sit on the ground with your back against a bench and your knees bent. Place a barbell with a barbell pad across your lap and roll the bar down your legs until it’s resting on your hips. With your feet flat on the ground, raise your hips upward until your shoulders roll back onto the top of the bench and align with your knees. [10] X Research source Hold for a few seconds and squeeze your glutes before slowly lowering back down to the starting position. Hip thrusts target your gluteus maximus and gluteus medius (a smaller glute muscle in your upper buttocks), as well as your hamstrings."
    },
    {
      "title": "Weighted step-up (perform 2-3 sets of 8-10 reps):",
      "content": "Weighted step-up (perform 2-3 sets of 8-10 reps): Find a bench or exercise box you can place one foot on without raising your hip out of its normal active range, then grab a pair of dumbbells. [11] X Research source Place one foot flat on top of the box, square your hips and engage your core, then push through your elevated foot to raise yourself off the ground without pushing from your back leg. To lower yourself, shift your hips back and lower yourself with your raised leg (again not relying on too much help from your hind leg). [12] X Research source Try this move without dumbbells to make it a bodyweight exercise. Step-ups target your gluteus maximus as well as your hamstrings and quads. Reader Poll: We asked 266 wikiHow readers to tell us their favorite cardio exercise to do at the gym and only 6% of them said the elliptical machine (even though this is known to be a great way to build your glutes and complement weight lifting regimens). [Take Poll] The elliptical may not be popular, but it could be your secret weapon for building and shaping your butt!"
    },
    {
      "title": "Kettlebell swing (perform 8 sets of 20 seconds on, 10 seconds off):",
      "content": "Kettlebell swing (perform 8 sets of 20 seconds on, 10 seconds off): Stand with your feet slightly wider than your shoulders and a kettlebell about 3 ft (0.91 m) in front of you on the ground. Reach forward to grab the kettlebell with both hands—stick your butt out behind you, keep your back straight, and keep your chest and head up. Drag the kettlebell back between your legs, then explosively swing it up to shoulder height. [13] X Research source Swing through your hamstrings, glutes, and lower back in a snappy, fluid motion instead of using your arms. Keep your back straight, knees slightly bent, and arms locked in front of your body as you let the kettlebell swing back between your legs. Repeat for 20 seconds, then rest for 10 seconds. This move targets your gluteus maximus, hamstrings, quads, spinal erectors, deltoids, and abdominal muscles."
    },
    {
      "title": "Side lying hip raise (perform 3-4 sets of 12-15 reps):",
      "content": "Side lying hip raise (perform 3-4 sets of 12-15 reps): Lie on one side and prop yourself up so one elbow is directly underneath your shoulder. Stack your legs on top of each other, bend your hips slightly less than 90 degrees, and keep a bend in your knees, too. Then, press through your lower knee and foot to raise your body off the ground, pushing your hips forward and rotating your top leg upward at the hip. [14] X Research source Hold for a second, then slowly lower yourself back into the starting position. To make this exercise more intense, place a light resistance band around your thighs once you’ve mastered the form and feel ready for a challenge. This exercise target booths your gluteus maximus and medius."
    },
    {
      "title": "Standing hip abduction (perform 2-3 sets of 12-15 reps per leg):",
      "content": "Standing hip abduction (perform 2-3 sets of 12-15 reps per leg): Loop a resistance band around one ankle, then stop on the other end of the band with the ball of your other foot (the closer together your feet, the more resistance you’ll feel). Tense your core and slowly move your leg outward to the side, keeping your balance with your other leg. Slowly lower your leg back down to complete one rep. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Hold on to a stationary object or wall for balance if needed and stand tall without leaning forward or backward. Alternatively, try using a seated hip abduction machine at a gym. This exercise is great for your hip abductors as well as your gluteus medius and minimus (the smallest glute muscle that acts as a hip stabilizer). Working these smaller glute muscles from time to time helps round out the top and outside edges of your gluteus maximus."
    },
    {
      "title": "Glute kickbacks (perform 3-4 sets of 12-15 reps per leg):",
      "content": "Glute kickbacks (perform 3-4 sets of 12-15 reps per leg): Stand tall and lean forward at the hips at about a 45-degree angle (holding onto a wall for balance if necessary). Lift one leg all the way back in a slow, controlled motion, maintaining tension in your hamstrings and glutes. Slowly lower your leg back down to complete one rep. [16] X Research source To target your gluteus medius and minimus, angle your leg slightly out to the side as you raise it back. Add a resistance band around your thighs or ankle weights to make the move more challenging. Alternatively, bend your back knee at a 90-degree angle to put a little more tension on your glutes (this is called a donkey kick). This exercise primarily targets all of your glute muscles (maximus, medius, and minimus)."
    },
    {
      "title": "Pulse squats (perform 2-3 sets of 8-15 reps):",
      "content": "Pulse squats (perform 2-3 sets of 8-15 reps): Stand with your feet shoulder-width apart, your knees slightly bent, and a neutral head and neck. Engage your core and lower yourself down into a squatting position, placing your hands on your hips or reaching them forward. Once your thighs are about parallel to the floor, push through your feet to raise yourself about 2 in (5.1 cm) higher. [17] X Research source Continuously “pulse” by raising and lowering yourself with your legs, moving no more than about 2 in (5.1 cm) per pulse. Pulse squats target your glutes, hamstrings, and quadriceps. The prolonged tension and smaller movements help build endurance and strength in addition to size."
    },
    {
      "title": "Banded wall clamshells (perform 1-3 sets of 10-15 reps per side):",
      "content": "Banded wall clamshells (perform 1-3 sets of 10-15 reps per side): Place a resistance band around your thighs, just above the knee. Lie on one side and rest your head on your bottom arm to keep your spine naturally aligned. Bend your knees at a 90-degree angle and keep your hips and knees stacked perfectly on top of each other for proper alignment. Tense your core and raise your top knee as high as it will go without rotating your hips back. [18] X Research source Keep your feet together throughout the entire movement. Slowly lower your knee back down to the starting position to complete one rep. This move targets your gluteus medius and makes a great warm-up for more intense glute and leg exercises."
    },
    {
      "title": "Superman (perform 1-3 sets of 15 reps plus a 30-second hold):",
      "content": "Superman (perform 1-3 sets of 15 reps plus a 30-second hold): Lay flat on the ground on your stomach, then engage your core and back muscles to lift your torso, arms, and head off the ground. At the same time, squeeze your glutes to lift both legs so they’re about 2 in (5.1 cm) off the ground. Keep your toes pointed and lift through your heels to keep the glutes engaged. Hold the position briefly, then slowly lower yourself back to the ground. [19] X Research source The higher you lift your legs, the more tension you’ll feel in your glutes. Add a resistance band around your thighs for an extra challenge. Superman lifts and holds engage your entire back, abdominal muscles, hamstrings, and gluteus maximus."
    },
    {
      "title": "Long banded lateral walk (perform 1-3 sets of 10-12 reps per leg):",
      "content": "Long banded lateral walk (perform 1-3 sets of 10-12 reps per leg): Place a resistance band around your lower legs (keep it near the knees for an easier move, or toward the ankles for more resistance). Stand with your feet shoulder-width apart with your knees and hips slightly bent and your chest and head up. Stay low and take a wide step straight out to the side with your toes pointed forward. Follow up with the other leg, moving slowly to resist the band. [20] X Research source Always keep your feet about shoulder-width apart to maintain tension on the band. Once you’ve stepped the desired number of reps in one direction, switch directions to work the other leg. This move works all of your glute muscles (maximus, medius, and minimus)."
    },
    {
      "title": "Hip bridge",
      "content": "Hip bridge (perform 3 sets of 10-12 reps): Lie on your back on the ground and place your feet on the edge of a bench or chair so your heels hang off. Lift up your butt as high as you can and squeeze your glutes for 2 seconds at the top of the move before going back to the starting position. If this move is too challenging, perform it with your feet flat on the ground and work up to an elevated surface. To make it more challenging, place a resistance band just above your knees. Or, try performing the move with a single leg instead of using both. Hip bridges are a great workout for all 3 glute muscles as well as your core, lower back, calves, and hamstrings."
    }
  ]
}