{
  "url": "https://www.wikihow.com/Avoid-Pain-in-the-Left-Hand-While-Playing-the-Guitar",
  "title": "How to Avoid Pain in the Left Hand While Playing the Guitar",
  "steps": [
    {
      "title": "Stretch your fingers.",
      "content": "Stretch your fingers. The strength of your muscles is secondary to the flexibility and agility of your muscles. One way to improve the latter two attributes is by properly stretching your fingers before practice. Bend back each finger until it feels comfortable and hold them in that position for several seconds. Do the same for each thumb, but also stretch your thumb into your palm. Get the blood flowing through your fingers by pretending to type rapidly in the air. Roll your wrists both clockwise and counterclockwise. Spread your fingers out into a fully extended position, then release the tension. [1] X Research source If you're a new guitar player dealing with finger soreness , wait a few weeks for your fingers to develop calluses. At this point, the soreness will go away. [2] X Expert Source Ron Bautista Professional Guitarist & Guitar Instructor Expert Interview. 5 November 2019."
    },
    {
      "title": "Do hand exercises.",
      "content": "Do hand exercises. After stretching out your hand, you can strengthen the muscles you commonly use during guitar play. There are two main exercises you can do without playing the guitar itself. Work out the extensor muscles of your fretting hand with these two exercises: First hold your left hand (or fretting hand) in a relaxed position. Extend your thumb to your pinky and then pull them apart slightly. Continue this motion with the rest of your fingers: ring, middle, and then your index finger. Repeat as many times as you want, but don’t over-exercise your muscles. Hold your fretting hand relaxed with your palm facing up. Extend your pinky finger slightly and then flex it. Continue the same exercise with the rest of your fingers: ring, middle, and then your index finger. [3] X Research source"
    },
    {
      "title": "Practice speed drills.",
      "content": "Practice speed drills. After properly warming up your hand, you can practice a few lines on your guitar. Set a metronome, if available, to a comfortable tempo. For beginners, use 80 bpm, and experienced players can play at around 120 bpm. Set your hand so your index finger is on the first fret. Then play this chromatic riff across each string: 1-2-3-4. Use an individual finger to play each fret. For an added exercise, do the same motion in a descending order. Start with your pinky on the fourth fret of the last string. This technique will exercise each finger. [4] X Research source Once you become comfortable performing this exercise, increase the speed of your metronome."
    },
    {
      "title": "Hold the guitar properly.",
      "content": "Hold the guitar properly. The way you hold the neck of the guitar effects how long you can barre chords before your hand cramps and hurts. Anchor your thumb close to the center-back of the neck and not over-the-top as if it was peeking from the fretboard. Placing your thumb in the center-back of the guitar's neck should help you with the proper form. The proper form will increase your hand’s stamina. [5] X Research source Your thumb should look somewhat straight along the back of the guitar. When you do this, you should have equal curvature in each left finger. [6] X Expert Source Ron Bautista Professional Guitarist & Guitar Instructor Expert Interview. 5 November 2019. Look at the angle of your arm and wrists. You will notice that the more acute the angle of your wrist, the less strength you have in that hand. Keep all your joints from your wrist to your fingers at naturally rounded angles. There isn’t a golden rule with hand placement. Jimi Hendrix held his guitar in a way that his thumb wrapped around the guitar. Do whatever makes you comfortable. In this example, you’d hold the guitar like a tennis racket."
    },
    {
      "title": "Have the proper finger placement.",
      "content": "Have the proper finger placement. The proper finger placement helps your sound and your hand's stamina. Place your fingers close to the fret that is closest to the bridge, instead of placing your finger dead-center between the frets. This helps decrease the force needed to barre chords. You should also get into the habit of arching each finger when playing notes or chords. This way your fingers don't touch other strings and hinder the sound. If you have 1 finger on consecutive frets along the same string, you should see that both your index and little fingers point inward. [7] X Expert Source Ron Bautista Professional Guitarist & Guitar Instructor Expert Interview. 5 November 2019."
    },
    {
      "title": "Relax your posture.",
      "content": "Relax your posture. It is common to feel stressed and strained while playing the guitar. This is especially true for a beginner guitarist. It is normal to feel pain when trying out a new guitar shape. When reaching for these tougher hand shapes, it’s important to take note of how the rest of your body is reacting. Make sure you have the proper fingering, then take a deep breath and let your shoulders rest. Stiffness will only hinder a musician. Keep a relaxed posture to work the instrument into a natural position and feeling."
    },
    {
      "title": "Take productive breaks.",
      "content": "Take productive breaks. When you are practicing the guitar for longer periods of time, make sure you take breaks. A good guitarist will take productive breaks to ensure the practicing mentality isn’t lost. Take a five-minute break to drink water or go on a walk. Avoid sitting on the couch and watching TV on your break. Maintain your desire to improve as a guitarist. Keep a musical biography around to keep you inspired."
    },
    {
      "title": "Adjust the action of your guitar’s neck.",
      "content": "Adjust the action of your guitar’s neck. A guitar with high action will require more force from your fingers to press the strings down. You can adjust the truss rod on most guitars with an Allen wrench. It is easy to damage your neck, and you should take your guitar to a trusted repair shop for an easy adjustment. Also high action can be due to other causes such as neck angle, bridge height, and shallow nut slots. These are additional reasons to see a good guitar repair person. If you cannot afford to have your guitar's action fixed by a repair technician, consider using a capo on the first fret of the guitar as a temporary alternative. Placing a capo on the first fret helps bring the strings closer to the frets. Some guitars require you to remove the neck to access the truss rod."
    },
    {
      "title": "Try different neck shapes.",
      "content": "Try different neck shapes. Neck shapes play a major role in the comfort of playing. Different brands and styles of guitar offer many neck styles and shapes to their customers. Always try out a guitar before buying it. Be sure to play it up and down the neck, using both barre and open cords. Similar to buying a new pair of shoes, you want to try out guitars that not only sound great, but also feel right. For certain models of guitars, such as most Fenders, have bolt-on necks so you can change the neck of your current guitar. Still go to a repair person to do this because there is some fine fitting involved. Other instruments, such as most Gibsons, have glued-in necks and changing the neck can be a costly process. Fat necks are usually viewed in the guitar world as sturdy and reliable necks. This style of neck could be difficult for beginners. Try out several styles of necks before making any decisions."
    },
    {
      "title": "Seek medical assistance if pain persists.",
      "content": "Seek medical assistance if pain persists. Prepare for soreness and stiffness. With that in mind, a novice guitarist should not expect to have the same level of stamina exhibited by a more experienced guitarist. If pain in your fretting hand persists for longer than two days, you should let a doctor examine your hand. Your body lets you know something is wrong whenever pain becomes acute. Unlike weightlifting, where some pain is gain, in the guitar world persistent pain could mean trouble."
    }
  ]
}