{
  "url": "https://www.wikihow.com/Chant",
  "title": "How to Chant",
  "steps": [
    {
      "title": "Develop a mantra to put yourself in a positive headspace.",
      "content": "Develop a mantra to put yourself in a positive headspace. A mantra refers to any repeatable phrase that reinforces a positive spiritual message. If you aren’t a practicing member of any organized religion, come up with your own mantra or borrow a popular option. The mantra can be in your native tongue, or some other language. It’s entirely up to you, so choose a mantra that brings you peace and helps you achieve a positive headspace. [2] X Research source A popular option is, “May I be happy. May I be well. May I be safe. May I be peaceful and at ease.” after repeating this phrase once, replace “I” with “you.” [3] X Research source You can also use a phrase like, “I will be happy, I am loved, I am loving,” or something like that to reinforce positive feelings."
    },
    {
      "title": "Choose a text or quote that means a lot to you to create your own chant.",
      "content": "Choose a text or quote that means a lot to you to create your own chant. You can turn any piece of writing into a chant. If you don’t want to repeat a single mantra or you don’t want to use someone else’s religious text to chant, choose a quote, poem, or song lyrics that mean a lot to you and memorize it. Use this piece of writing as your chant and feel free to toy with the tempo or melody to make it work for you. [4] X Research source You can write your own chant if you prefer. There are no hard rules here, so do whatever makes the most sense to you. For example, you can use a set of lines from a song or poem that you find meaningful. Lines like “Success is a failure turned inside out,” from Edgar Guest’s poem, “Don’t Quit” can make for a great chant."
    },
    {
      "title": "Select a famous religious chant in whatever discipline you practice.",
      "content": "Select a famous religious chant in whatever discipline you practice. Chanting is a popular practice in basically every religion across the planet, although it’s a particularly popular practice in Hindu, Buddhist, and Catholic traditions. If you’re a practicing member of a religion (or you’re self-practicing), use a chant from your religious discipline to get closer to the God you worship. [5] X Research source There are dozens of popular Hindu chants. The most popular is “Om,” which represents the universal sound of God and reality. Other popular options include “Om shanti, shanti, Shanti,” (I am peace, peace, peace), and “Om Namah Shivaya,” (I bow to Lord Shiva). [6] X Research source Popular Christian options include “Praise God through whom all blessings flow…” “Ave Maria,” and, “Tantum ergo sacramentum,” which is sung in Latin. [7] X Research source The most popular Buddhist chant is “Om Mani Padme Hum,” which translates to “Hail to the jewel in the lotus.” Other popular options include “Nam Myoho Renge Kyo” (Glory to the Dharma of the lotus sutra), and “Amitabha” (remember the Buddha). [8] X Research source There are popular chants in basically every religious tradition. From the Jewish act of cantillation, to the Islamic Dhikr, feel free to browse around your religious texts or ask your local religious leader if there’s a popular chant that’s right for you."
    },
    {
      "title": "Memorize your chant to avoid focusing on reading while you recite it.",
      "content": "Memorize your chant to avoid focusing on reading while you recite it. If you read the words off of a piece of paper, you won’t be focused on the pattern and melody. To improve your experience, memorize your chant. Repeat it over and over again while reading it and test yourself by reciting back each line. Once you’ve memorized the chant, you’re ready to go! If you’re just starting out, feel free to just read your chant off of a piece of paper until you get a hang of the pronunciation and melody. Many traditional chants and mantras are spoken in the language they were written. Since it’s unlikely that you speak Sanskrit or ecclesiastical Latin, look the pronunciation up. There’s nothing wrong with chanting a translation of a mantra in your native tongue. If something brings you peace or makes you feel closer to whatever God you worship, do it!"
    },
    {
      "title": "Keep a meditation mala to count each chant off and develop a pattern.",
      "content": "Keep a meditation mala to count each chant off and develop a pattern. A meditation mala is a bracelet or necklace with 108 beads on it. Many Eastern religions use meditation malas to count through the chants by moving their fingers from one bead to another after each chant. This helps to focus on the meaning of the words and get into a groove. By moving your fingers from bead to bead, your hands will start following the pattern of your speech, which can help center and focus you. [9] X Research source You can always set a timer to chant for a predetermined period of time if you prefer. Just set a timer and chant until it goes off. For many people, the loud beep or alarm at the end of a peaceful chanting period is pretty disruptive, though. You can buy a meditation mala online or at any local holistic healing shop. You can use a rosary instead of a meditation mala if you’re Christian or you simply prefer to do so."
    },
    {
      "title": "Set a number to chant to based on how long you’d like to chant.",
      "content": "Set a number to chant to based on how long you’d like to chant. Chants can be repeated any number of times. There are no set rules when it comes to chanting, so feel free to choose any number that works for you. Most people repeat a phrase at least 100 times when they’re chanting, but you can use whatever number you’d like. [10] X Research source A meditation mala typically has 108 beads on it. If you plan on using a meditation mala, choose a multiple of 108 so that you know you’re done when you’ve gone through the mala a set number of times. If you’re going to use a rosary, select a multiple of 10."
    },
    {
      "title": "Sit down somewhere peaceful and quiet to chant.",
      "content": "Sit down somewhere peaceful and quiet to chant. Most people chant at home in a quiet room. You can do this in your bedroom, living room, or backyard. If you want to chant outside, head to a local park, quiet part of your neighborhood, or anywhere you feel comfortable. Sit down upright on a chair or sit lotus style on the ground. Get comfortable and take a deep breathe to get ready to chant. [11] X Research source"
    },
    {
      "title": "Pronounce the chant in a low volume and enunciate the vowels.",
      "content": "Pronounce the chant in a low volume and enunciate the vowels. Start saying your chant out loud in a low volume like you’re talking to someone right in front of you. For most chants, you hold vowels for 1-3 seconds longer than you normally would to extend the sounds. If you aren’t sure how to hold a chant, try a few different variations out until you find something that works for you. [12] X Research source You can use any melody you’d like. Once you settle into a rhythm with a melody, focus on repeating the same pattern over and over. For example, if you’re chanting “om”, you may hold the “o” sound and slowly taper down into the “m.” If the word “shanti” comes next, you may chant it “sha-” and hold the first a for a moment before pronouncing “-ti” and holding the “i.” [13] X Research source Many people prefer chanting silently because it’s easier to focus on the meaning of the words. If you don’t like chanting out loud or you’re chanting in a public space, feel free to chant in your head. [14] X Research source What matters is to allow the vibration of your sound to vibrate all the little living cells inside you. Chanting silently for 3-5 minutes before a big meeting, test, or interview is a great way to put yourself in a positive headspace."
    },
    {
      "title": "Focus on the pattern and meaning of the words as you repeat them.",
      "content": "Focus on the pattern and meaning of the words as you repeat them. Many people that chant feel themselves entering a kind of trance where the meaning of the chant and the sounds that accompany them cause them to enter a unique, spiritual headspace. Continue thinking through the complexity or simplicity of the words while you repeat them to reach this state. [15] X Research source The first few times you chant, you may feel deeply awkward and you may struggle to get much out of it. Just stick with it. Eventually the practice will become deeply rewarding!"
    },
    {
      "title": "Use chanting as a way to de-stress and relax after a busy day.",
      "content": "Use chanting as a way to de-stress and relax after a busy day. Chanting is a great way to relax and return to a peaceful state after a long day. When you get home from work or school, set aside 15-30 minutes to chant quietly. Doing this every day or every other day is a great way to develop a positive headspace and maintain it over time. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Chant every morning to start your day on a positive note.",
      "content": "Chant every morning to start your day on a positive note. Many people prefer chanting first thing in the morning to start on a peaceful note before the day starts. When you get up, make your morning tea or coffee and shower like you normally do. Then, when you’re feeling refreshed, sit down and do your 15-30 minutes of chanting. When you go out the door to start your day, you’ll feel much more in tune with yourself and ready to handle the day’s challenges. You can chant before your morning drink or shower if you prefer. It’s really entirely up to you!"
    },
    {
      "title": "Utilize chanting as a form of prayer to celebrate religiously.",
      "content": "Utilize chanting as a form of prayer to celebrate religiously. Chanting is often used at religious services as a form of communal prayer. You can either chant as a form of prayer at your local church, temple, mosque, or synagogue, or chant at home to pray whenever you want to feel closer to your God or ask for blessings. There are no right or wrong ways to do it, so chant in a way that makes sense to you!"
    }
  ]
}