{
  "url": "https://www.wikihow.com/Be-Lucky",
  "title": "How to Be Lucky",
  "steps": [
    {
      "title": "Define luck for yourself.",
      "content": "Define luck for yourself. We usually think of luck as something that's out of our control, expecting something or someone to descend on us from the clouds and improve life for us. But fortune and fame don't come to the passive. Waiting around for luck instead of creating it for yourself can create negativity and resentment, forcing you to see other people's good fortune as the result of good luck rather than good choices. Think of luck as an emotion, more than a certificate or a ticket that gains you access to some exclusive club. Just as you decide to be happy, you can decide to be lucky and become willing to change your behaviors and create opportunities for success yourself, rather than waiting for changes to happen."
    },
    {
      "title": "Take advantage of opportunities.",
      "content": "Take advantage of opportunities. If you're busy waiting for things to be perfect, you're going to wait a long time. Learn to recognize opportunities when they arise and improve your chances by embracing the opportunities you do have. If you get a big project at work you feel unprepared to tackle, you could either consider that a stroke of bad luck, gripe to your coworkers, and make excuses for yourself, or you could consider it an opportunity to shine in a big way. Think of it less as having to do with luck and more as an opportunity to succeed."
    },
    {
      "title": "Be open to change.",
      "content": "Be open to change. As you get older, it becomes easier to become stuck in your ways. Repetition and habit is comfortable, but learning to accept the possibility of making change, even small change, will keep you receptive to opportunities and luck that presents itself. Learn to take criticism and to use it as an opportunity for improvement. If your boss criticizes something you worked hard on, consider yourself lucky. You know how to do better next time. If you bomb on a date that goes horribly, use the experience as a dress rehearsal for your next date. What seemed to go wrong? What can you do differently next time?"
    },
    {
      "title": "Embrace \"small wins.\"",
      "content": "Embrace \"small wins.\" When something goes right for you, embrace it. Keep yourself humble, but learn to enjoy little wins and little successes to keep yourself positive, motivated, and happy. \"Wins\" don't even have to be a big deal. Maybe you made the best spaghetti bolognese you've ever made last night for dinner, or maybe you're feeling proud for getting out and going for a run when you didn't really feel like it. Celebrate! Don't compare your success to the success of others. It's easy to get down on yourself by minimizing your successes, saying, \"Yeah, so I got a bonus at work. My friend Bill invented the most popular iPhone app of all time.\" So what's that got to do with you?"
    },
    {
      "title": "Avoid behavior loops.",
      "content": "Avoid behavior loops. Over time, we've learned to make automatic decisions and reactions that keep us locked in feedback loops of behavior. We're often not conscious of the decisions we make, and certain status-quo elements of our life that may seem unchangeable are really easy fixes, once you recognize your behavior patterns. Maybe you always turn down after work drinks. Give it a shot next week. If you always feel the need to head out with your coworkers as soon as 5 o'clock rolls around, consider heading to the gym instead and lifting weights for an hour or two. Identify your patterns and shake them up."
    },
    {
      "title": "Be positive and generous with your time.",
      "content": "Be positive and generous with your time. Lucky people are people we all like to be around, because the wealth seems to benefit everyone. Become the kind of person people want to get a piece of by being more positive and generous with the success you do have. Make a point of congratulating others when they do a job well, or when something good comes their way. A little note of congrats can go a long way. Volunteer your skills, even with small things. If you're wondering why nobody is clamoring at your door to help you move, try to remember all the moves you've flaked out on over the years. Next time, volunteer your afternoon and your truck and see if your luck doesn't change."
    },
    {
      "title": "Make your own deadlines.",
      "content": "Make your own deadlines. Whether it be work or social goals, learning to set hard deadlines for yourself can make all the difference in the world. Even if nobody is looking over your shoulder, learning to make yourself follow through and finish a project will keep you productive and fortunate. You'll feel like you're on top of things instead of struggling to catch up all the time. [1] X Research source Give yourself a list of little steps toward the completion of some goal. If you want to get the house cleaned up, or lose weight before your high school reunion, decide what process you want done by the end of the week. It's not going to happen all at once, so let yourself create opportunities for little victories and keep seeking that victory until the larger goal is completed."
    },
    {
      "title": "Believe in your goals.",
      "content": "Believe in your goals. In order to complete things, you need to learn to value the importance of the goal, to think it's the most important thing on your plate at any given time. Treat that backyard project you've been meaning to do as your own personal Super Bowl. Start the YouTube review channel you've always wanted to start this afternoon, not \"sometime.\""
    },
    {
      "title": "Follow through.",
      "content": "Follow through. Doing a \"good enough\" job will never ensure lasting success and luck. Going above and beyond, following through your work efforts and seeing things through to completion will. Spend less of your time worrying whether or not you made a good impression on a first date, or if your boss is pissed at you because of some difficult-to-interpret email. Talk to them. Open channels of communication and be open about your confusion and your emotions. Then let it go."
    },
    {
      "title": "Raise your expectations.",
      "content": "Raise your expectations. Pump yourself up. Be the best you can be. What's good enough for you? Could your answer be more? Making yourself strive toward the things you really want, you'll create fortune in place of excuses."
    },
    {
      "title": "Work smarter",
      "content": "Work smarter , don't work harder. Learning to be efficient in your efforts will help you stay enthusiastic and energetic regarding your goals. You'll be in the mood to do more if the work you do is as easy as it could possibly be. Get partners. Learning to delegate tasks and ask for help when you need it makes jobs easier."
    },
    {
      "title": "Be proactive",
      "content": "Be proactive . Make the first efforts at making things happen. If everyone sits around complaining about the lack of hot dog carts in your town, you could all wait for someone to have the idea you've already had, or you could get cooking. Do it now. Don't set plans for some shadowy, maybe-ish date at some point in the future. Do it now. Five minutes ago. Today."
    },
    {
      "title": "Be assertive",
      "content": "Be assertive . If you want something, don't be afraid of it. You're letting yourself off the hook of your own success if you lower your expectations and avoid the scary possibility of opportunities. Go get it. Ask for a raise , break up , and make the changes you need to make rather than waiting for someone else to make them for you. Don't wait for your superiors to notice the good work you're doing, demand it for yourself. If your job isn't making you happy, learn to recognize your dissatisfaction and seek sunnier vistas."
    },
    {
      "title": "Be enthusiastic",
      "content": "Be enthusiastic . You're alive on planet Earth. You could be a weird unthinking slug floating on a piece of space debris. Think how boring that would be. Learn to be enthusiastic about what's going on in your life and the opportunities you have. If you're dissatisfied with the way things are going, use that dissatisfaction as an opportunity to do what you want. Start a band . Learn to play pool . Climb mountains . Stop making excuses and start making luck."
    },
    {
      "title": "Surround yourself with supportive people.",
      "content": "Surround yourself with supportive people. Needy people who require emotional support from you or who dominate your time with their own issues will sap your emotional energy and strength. Learn to be giving and supportive of your close friends and hold each other up. Involve yourself in mutually-beneficial relationships and stay happy, healthy, and lucky."
    },
    {
      "title": "Look for lucky bugs.",
      "content": "Look for lucky bugs. In many cultures, insects and other bugs are thought of as being lucky signs that bring fortune. Sometimes killing these insects can be considered bad luck, so it's a good idea to be aware of them and let them be. Having a ladybug land on you is often considered a sign of good fortune, sometimes thought to have healing properties for the sick. Try wearing a ladybug amulet or charm to channel the luck of the ladybug. Dragonflies are often related to water and the subconscious. Some people think being landed on by a dragonfly means that something important is about to change in your life. When crickets stop chirping, something is about to happen. Maybe something bad. Some Native Americans once thought crickets brought luck, and crickets often appear on jewelry and other amulets in the Middle East and Europe. The sound of crickets is widely considered lucky."
    },
    {
      "title": "Look for lucky plants and signs in nature.",
      "content": "Look for lucky plants and signs in nature. Across many cultures, finding certain plants has been considered a lucky omen. Keep an eye out for lucky plants. Four-leaf clovers are commonly collected by schoolchildren as signs of good luck and fortune. Finding acorns was an old Norse tradition, because oak trees attracted lightning, the sign of Thor. Holding acorns, then, was a way of keeping yourself safe from Thor's rage. Some cultures value bamboo as an aid to spiritual growth. Growing and cultivating basil for consumption is sometimes thought to awaken passions. It's also got antibacterial properties and other nutritional benefits. Honeysuckle, jasmine, sage, rosemary, and lavender are commonly scavenged plants and herbs that have a variety of nutritional and therapeutic affects. They all smell wonderful and can be used in a variety of dishes, soaps, and teas as well, so they're useful as well as lucky."
    },
    {
      "title": "Carry a lucky animal's totem.",
      "content": "Carry a lucky animal's totem. If you have a spirit animal or an animal that you feel a particular kinship with, carry a small toy or other item that channels their energy and luck. A lucky rabbit's foot is a common luck charm, related to fertility. Early Christians thought of the dolphin as a protective animal, and sailors often used the presence of dolphins to portend good news or a quick and safe trip home. Frogs have been considered lucky animals in many cultures, including ancient Rome and Egypt. The Mojave believed that the frog gifted man fire. Frogs symbolize inspiration, wealth, friendship and prosperity. Tigers and Red Bats are commonly thought of as being lucky animals in China. Turtles and tortoises are common parts of origin myths in many different cultures, and make for popular lucky animals."
    },
    {
      "title": "Decorate your house with lucky tokens.",
      "content": "Decorate your house with lucky tokens. Surrounding yourself with lucky totems in your home is a common way of keeping yourself feeling prosperous and comfortable in your dwelling place. Dreamcatchers, Kachinas, and feathers are often thought of as being lucky symbols and objects in different Native American cultures. In the Americas, these are common household items used to bring luck. Statues of the Buddha, a staple of lots of Chinese restaurants, are commonly thought to be lucky features of a home. Practice feng shui to bring luck and harmony to your living space. St. Christopher totems and Virgin Marys are common in the homes of Christians. Other prayer candles, commonly available, can be considered good luck and sources of spiritual comfort. Horses are dependable creatures and horseshoes are often thought of as being lucky. Horseshoes are often hung above doorways, keeping good luck in and bad luck out."
    }
  ]
}