{
  "url": "https://www.wikihow.com/Make-a-Care-Package-for-Your-Boyfriend",
  "title": "How to Make a Care Package for Your Boyfriend",
  "steps": [
    {
      "title": "Determine your budget.",
      "content": "Determine your budget. It’s easy to get out of hand with buying gifts for someone you care about, so stay firm on your budget. Remember that the most meaningful items for your boyfriend will likely be those that are sentimental in nature, and that the effort behind your care package will mean a lot to him, too. Make sure you factor in shipping costs to your budget. The heavier and bulkier your box is, the more expensive your shipping will be. You will also pay shipping costs based on how far the box needs to travel. You can get an estimate of what you’ll pay for shipping on your shipping company’s website. [1] X Research source"
    },
    {
      "title": "Figure out when you need to ship it.",
      "content": "Figure out when you need to ship it. If you want to get the gift to him on a certain day, pay attention to shipping dates. The closer to the deadline you ship it, the more expensive it will be or the less likely it is to get there on time. During holidays, shipping companies and post offices will usually indicate a “ship by” date to help you determine when you should mail your package in order for it to arrive in time for the holiday. You can check with your preferred carrier to help you determine your shipping deadline."
    },
    {
      "title": "Research shipping regulations.",
      "content": "Research shipping regulations. Make sure you know what you can and cannot send through the mail. If your boyfriend is in the military, he may be subject to additional regulations about what he can receive in the mail. Make sure your package doesn’t include prohibited items, including weapons, explosives, and alcohol. Policies vary by shipping company, so do your research beforehand. [2] X Research source Use extra caution if shipping overseas. Many countries have specific regulations about what can be sent through the mail. In general, sending perishable food (such as produce, meat, and dairy products) is subject to regulation and are best avoided. [3] X Research source Specific country restrictions can be found here: https://pe.usps.com/text/imm/ab_toc.htm"
    },
    {
      "title": "Determine your boyfriend’s needs.",
      "content": "Determine your boyfriend’s needs. A good care package will include some necessities, some treats, and some sentimental reminders of home. Factor in the availability of goods at your boyfriend’s location. For example, if he is just in another part of the country at college, he probably has access to the same goods as you do, so you may want to focus your care package more on local treats and sentimental items. If he is deployed in a developing country, he will appreciate more necessities than sentimental items. Remember to keep size and weight of all items in mind as you make your purchasing decisions. Consider some special items if your boyfriend is on deployment. You may wish to consult some lists about what items servicemen and women want and need while on deployment. Some items you may want to send include powdered drink mix, individual packets of condiments (such as hot sauce), socks, batteries, or puzzle books. [4] X Research source"
    },
    {
      "title": "Buy necessities.",
      "content": "Buy necessities. Buy things you know your boyfriend needs, appreciates, and will use first. You could ask him about products he uses frequently, or items he needs replacing, in order to get ideas about what you’d like to include in his care package. You might want to find out about his preferred brands of toiletries or needed clothing items. To save on shipping, you may want to consider buying travel size bottles of toiletries like shampoo, lotion, or shaving cream."
    },
    {
      "title": "Include some treats.",
      "content": "Include some treats. You may want to add some lightweight treats he loves in your care package. Consider including his favorite snacks, candy or gum, a paperback book, or magazines. You could ask your boyfriend if there are any treats he is craving from home that he can’t get where he is located. Purchase them and include them in your package. You could include some of your favorite treats in the package, too, to make him think of you. Maybe he always teases you about how much you like strawberry gum, for example. You could include a package of it with a funny little note about it."
    },
    {
      "title": "Add some items of sentimental value.",
      "content": "Add some items of sentimental value. Include a picture of you (or the both of you), a postcard from your hometown, a comic that reminds you of him, or even construction paper hearts with “I love you” written on them. These items can be as personal and unique as your relationship! If he has any children, younger cousins, or nieces and nephews, he may appreciate receiving some drawings, letters, or pictures of them. If he has a pet still at home, you could include a picture of his favorite dog or cat. If you are sending a package for a holiday, you could include some holiday decorations. For example, if you are sending a Christmas care package, you could include a homemade ornament. [5] X Research source"
    },
    {
      "title": "Make something.",
      "content": "Make something. If you want to maximize your budget, put your creative skills to good use to make your boyfriend something special. You could make him something useful or something sentimental. It can be as simple or as complicated as you wish, depending on your skill level and available time. If you are handy with fabric, you could make your boyfriend a blanket. A fleece tie blanket doesn’t even require a sewing machine. Create a scrapbook signed by all of his friends who miss him while he is away. Have his friends include small mementos, like ticket stubs or photos, in the scrapbook. You could make him a CD of his favorite music. Bake something. Bake a batch of your boyfriend’s favorite cookies, or another treat that will hold up in shipping. Make sure the food item you’re sending adheres to any rules at his residence. (For example, food with nuts might be prohibited at school.)"
    },
    {
      "title": "Include a letter.",
      "content": "Include a letter. Make sure you include a letter that expresses your feelings about him and lets him know how much he is in your thoughts. He will appreciate knowing how much he means to you. Your letter could include your feelings as well as day-to-day events in your life. You could even include letters from other friends and family in your package, particularly if he is not able to receive mail frequently."
    },
    {
      "title": "Find a box.",
      "content": "Find a box. Get the smallest box you can that will safely ship all the items in your care package. Keep in mind that you may need to specially pack certain items to insure they don’t break or leak. You can usually buy boxes at your post office or shipping company’s store. Some stores will pack your items for an additional fee. If you’ll be shipping to him often, it might make sense to keep packaging from any online orders you receive to reuse. You can ask friends and family to save theirs too."
    },
    {
      "title": "Pack it.",
      "content": "Pack it. Make sure that nothing can spill or break inside the box. Secure the contents of the box so that they do not jostle around in transit. If there is anything that is fragile, wrap it carefully with newspaper or bubble wrap. If you are sending a package to your boyfriend in a faraway country, he may appreciate the newspaper wrap to be able to read some of the news from back home! If there is any liquid, put it in a small plastic bag and tape up the ends. That way if it breaks open, the whole package isn’t ruined. Separate toiletries and foods. Secure soaps in separate plastic bags to avoid their odor contaminating the food. Put foods in their own, separate plastic bags as well. [6] X Research source Stuff newspaper or filler material in the empty spaces in the boxes to prevent contents moving around. Tape the box securely to prevent it from being opened during transit."
    },
    {
      "title": "Make the package look pretty.",
      "content": "Make the package look pretty. Decorate the package if you want. Put colorful tissue paper in it. Tie ribbons around the gifts. Draw or write something on the outside of the box that way as soon as he picks up the package, he’ll know who it’s from! Keep in mind that additional decorative material may add weight (and therefore, expense) to your shipping cost. Make sure any decorations on the outside of the box don’t obscure addresses."
    },
    {
      "title": "Ship your package.",
      "content": "Ship your package. There are plenty of shipping companies that will deliver your parcel, as well as the post office. Shipping through your post office will likely be the least expensive, and private shipping companies will be more expensive. You may want to research several companies, as well as your post office, to find out how much it will cost to send a package. For example, you may want to call the company or go online to ask, “How much would it cost to send a six pound package from Chicago to Glasgow?” You may also have to pay extra if the dimensions of the package are outside acceptable limits. [7] X Research source If you want, get insurance on the package. It is usually fairly inexpensive. Fill out a customs form if it is destined for somewhere outside of the country. You will get this form at your post office or at your shipping company. You need to list the contents of the package and the cost of the item on the form. [8] X Research source Make sure that the mailing address is correct, and that your return address is visible. If something included is perishable, make sure that that is indicated clearly on the outside of the package."
    }
  ]
}