{
  "url": "https://www.wikihow.com/Clean-Limescale-Off-Taps",
  "title": "How to Clean Limescale Off Taps",
  "steps": [
    {
      "title": "Slice a lemon in half with a kitchen knife.",
      "content": "Slice a lemon in half with a kitchen knife. Cut the lemon in half crosswise. This is a great way to use up an older lemon or one that you’ve already used for cooking. As long as it still contains some flesh and juice, it will do the trick. [2] X Research source If you’re cleaning a narrow fixture with a fresh lemon, twist a citrus reamer or spoon around the center of the lemon for a few seconds. This will loosen up the juices and create a cavity for the faucet head to sit inside. [3] X Research source"
    },
    {
      "title": "Place 1 lemon half over the calcified area on the faucet.",
      "content": "Place 1 lemon half over the calcified area on the faucet. Position the lemon with the cut-side facing the end of the tap. Then push it onto the faucet so that the lemon “hugs” the fixture. Rotate the lemon back and forth until it really latches on and the faucet head is right in the center of all the lemon flesh. Cover all of the limescale with the lemon to allow the acidic juice to break down the buildup. [4] X Expert Source Amy Mikhaiel Professional House Cleaner Expert Interview. 3 February 2019. If you’re cleaning a larger fixture, such as a showerhead, place multiple lemon halves or thick slices over the entire area. You’ll just need enough to completely cover the buildup."
    },
    {
      "title": "Secure the lemon in place with a plastic baggie and rubber band.",
      "content": "Secure the lemon in place with a plastic baggie and rubber band. Holding the lemon in place, cover it with a plastic baggie and keep it tight around the neck of the faucet. Then wrap a rubber band around the bag opening so that the lemon stays in place. [5] X Expert Source Amy Mikhaiel Professional House Cleaner Expert Interview. 3 February 2019. Use more than 1 rubber band if needed to totally secure the lemon. This is a great way to reuse a plastic baggie if you can."
    },
    {
      "title": "Leave the lemon in place for 2 to 3 hours or overnight.",
      "content": "Leave the lemon in place for 2 to 3 hours or overnight. For best results, keep the lemon on the faucet overnight so the juices have plenty of time to loosen the buildup. [6] X Expert Source Amy Mikhaiel Professional House Cleaner Expert Interview. 3 February 2019. After a few hours, though, you can check whether the limescale comes off when you wipe it with a cleaning rag. [7] X Research source"
    },
    {
      "title": "Remove the lemon and scrub away the remaining limescale.",
      "content": "Remove the lemon and scrub away the remaining limescale. Discard the old lemon and plastic baggie. Wipe around the affected area with a cleaning rag, sponge, scrub brush or toothbrush. [8] X Expert Source Amy Mikhaiel Professional House Cleaner Expert Interview. 3 February 2019. The limescale buildup should come right off."
    },
    {
      "title": "Unclog spray holes with a safety pin or toothbrush.",
      "content": "Unclog spray holes with a safety pin or toothbrush. Any remaining limescale deposits can be scrubbed off with the bristles of an old toothbrush. Scrub roughly around these areas and use the bristles to dislodge the buildup. [9] X Research source Or, if the faucet’s spray holes are still plugged up with small pieces of limescale, use the sharp point of a safety pin to pick these bits out. [10] X Research source You can also use a toothbrush to scrub around the spray holes. [11] X Expert Source Amy Mikhaiel Professional House Cleaner Expert Interview. 3 February 2019."
    },
    {
      "title": "Wash off the faucet with fresh hot water.",
      "content": "Wash off the faucet with fresh hot water. Use a clean sponge or rag to wash the remaining lemon juice and limescale from the faucet. The surface should now be clear of unsightly limescale buildup. [12] X Research source"
    },
    {
      "title": "Mix up a solution of 1 part water and 1 part plain white vinegar.",
      "content": "Mix up a solution of 1 part water and 1 part plain white vinegar. Into a small bowl, pour approximately 1 ⁄ 2 c (120 mL) of water and 1 ⁄ 2 c (120 mL) of plain white vinegar. This will yield 1 c (240 mL), but you can reduce the quantities if you only have a small area to clean. There should be just enough liquid to fully saturate a cleaning rag. [13] X Research source You can add 1 tablespoon (14 g) of baking soda to your solution to make it stronger. [14] X Expert Source Amy Mikhaiel Professional House Cleaner Expert Interview. 3 February 2019."
    },
    {
      "title": "Soak a cleaning rag in the solution.",
      "content": "Soak a cleaning rag in the solution. You can use a kitchen towel, old t-shirt, or any other rag you don’t mind using for cleaning purposes. Dunk all parts of the rag into the vinegar-water solution until its completely saturated. [15] X Research source"
    },
    {
      "title": "Scrub the limescale roughly with the rag for a minute or so.",
      "content": "Scrub the limescale roughly with the rag for a minute or so. This will help loosen up some of the limescale. If the rag starts to dry out after this process, just submerge it in the 1:1 water and vinegar solution again until it’s fully saturated. [16] X Research source"
    },
    {
      "title": "Wrap the rag around the calcified area on the faucet.",
      "content": "Wrap the rag around the calcified area on the faucet. Typically this will be the head of the faucet, where the water comes out. If there’s a milky film covering the fixture you should make sure that area is covered as well. Tightly wind the vinegar-soaked rag around the faucet a few times until it sits flush against the area affected by buildup. [17] X Research source You can add a rubber band or ponytail holder around the outside to keep the rag secure. [18] X Expert Source Amy Mikhaiel Professional House Cleaner Expert Interview. 3 February 2019. This may be useful if you plan to leave the rag in place overnight."
    },
    {
      "title": "Leave the rag there for 2 to 3 hours or overnight.",
      "content": "Leave the rag there for 2 to 3 hours or overnight. For the most effective results, let the vinegar solution work its magic overnight. Feel free to check after a couple of hours to see if the vinegar solution is working. The buildup should be dislodged immediately when wiped with a rag or scrub brush. If it’s still stuck, re-saturate the rag and leave it on longer. [19] X Research source"
    },
    {
      "title": "Remove the rag and wipe off the limescale buildup.",
      "content": "Remove the rag and wipe off the limescale buildup. After a few hours, or on the next day, remove the rag and use it to buff away the calcium deposits. The limescale should simply slide off of the faucet, and any milky film should disappear with moderate scrubbing pressure."
    },
    {
      "title": "Use a toothbrush or safety pin to unclog spray holes.",
      "content": "Use a toothbrush or safety pin to unclog spray holes. [20] X Expert Source Amy Mikhaiel Professional House Cleaner Expert Interview. 3 February 2019. After an overnight vinegar soak, stubborn deposits should come right off with a little encouragement. You can use an old toothbrush to scrub around these areas. [21] X Research source Or, use the sharp end of a safety pin to pick out the remaining bits of limescale. [22] X Research source Particularly on showerheads, limescale can get stuck in and around the small spray holes and might not go away after an initial wipedown."
    },
    {
      "title": "Rinse off the faucet with fresh hot water.",
      "content": "Rinse off the faucet with fresh hot water. Use a clean sponge or rag to cleanse the faucet of any remaining vinegar or limescale pieces. Your fixture should now be sparkling like new! [23] X Research source"
    },
    {
      "title": "Avoid using abrasive or acidic cleaning agents.",
      "content": "Avoid using abrasive or acidic cleaning agents. Fixtures that are plated with gold, brass, nickel, or any other metal possess very delicate layered finishes. These can be quickly eroded with corrosive chemicals as well as acidic household cleaners like lemon juice and vinegar. [24] X Research source They can also be easily scratched with bristle brushes, steel wool, and other abrasive cleaning cloths. [25] X Research source Keep these types of cleaning materials away from plated fixtures."
    },
    {
      "title": "Remove all moisture with a microfiber cloth on a daily basis.",
      "content": "Remove all moisture with a microfiber cloth on a daily basis. With regular care, you can easily prevent limescale buildup. Keep a microfiber drying cloth or paper towel near the fixture. After each use, or once a day, wipe down the entire fixture to soak up any moisture. This will prevent the hard water from leaving cloudy spots and mineral deposits. [26] X Research source"
    },
    {
      "title": "Clean the fixture with hot soapy water and a microfiber cloth.",
      "content": "Clean the fixture with hot soapy water and a microfiber cloth. When you want to clean off the fixture, heat up some distilled water. Unlike the water coming out of your faucet, distilled water won’t leave any mineral deposits behind. Add a squirt of mild soap to the hot water and use a soft microfiber cleaning cloth or a soft sponge to gently wipe down the fixture. Then dry it completely with a microfiber cloth. [27] X Research source Avoid applying much pressure when washing and drying the fixture since you might accidentally scratch the finish."
    },
    {
      "title": "Use a mixture of baking soda and distilled water to remove hard water spots.",
      "content": "Use a mixture of baking soda and distilled water to remove hard water spots. If you notice some cloudy water spots on the fixture, mix up a solution of 1 tsp (6 g) of baking soda and 1 US tbsp (15 mL) of hot distilled water in a small bowl. Moisten the corner of a sponge or microfiber cloth with this solution and gently dab each water spot. Rinse it off with fresh distilled water to remove the baking soda. Then completely dry the whole fixture. [28] X Research source Spot-test this method on an inconspicuous part of the fixture to make sure it doesn’t damage your fixture’s finish."
    }
  ]
}