{
  "url": "https://www.wikihow.com/Make-a-Booklet-from-Paper",
  "title": "How to Make a Booklet from Paper",
  "steps": [
    {
      "title": "Fold an 8 1/2 x 11\" piece of paper in half hamburger-style.",
      "content": "Fold an 8 1/2 x 11\" piece of paper in half hamburger-style. To start making this easy booklet, grab an ordinary piece of 8 1/2 x 11\" paper (the size used in most printers) and a pair of scissors. Fold the paper in half with a \"hamburger\" fold — in other words, your fold should make the paper shorter and fatter, not longer and skinnier."
    },
    {
      "title": "Open and fold hotdog-style.",
      "content": "Open and fold hotdog-style. Undo the fold you just made. Use a \"hotdog\" fold to fold the paper in half again the other way. Your piece of paper should be long and skinny after making this fold."
    },
    {
      "title": "Open the paper up.",
      "content": "Open the paper up. Undo the fold you just made. Your paper should be divided into four equal quarters. If your folds aren't super sharp, take this opportunity to re-crease your folds before proceeding."
    },
    {
      "title": "Fold the edges of the paper inward to the center.",
      "content": "Fold the edges of the paper inward to the center. Lay the paper sideways in front of you so that one of its long edges is facing you. Grab the right edge of the paper and fold it halfway across the paper so that the edge meets the center crease. Repeat for the other side. If done correctly, your folds should look like a set of double doors."
    },
    {
      "title": "Unfold your paper.",
      "content": "Unfold your paper. Lay your piece of paper flat in front of you. It should now be folded into equal eighths. Once again, you'll want to take this opportunity to make sharp creases if any of your folds seem \"weak\" or shallow."
    },
    {
      "title": "Fold hamburger-style and cut halfway through the center.",
      "content": "Fold hamburger-style and cut halfway through the center. [1] X Research source Make the same hamburger (short and fat) fold as you did at the beginning. Next, grab a pair of scissors and make a straight cut along the crease that divides the paper horizontally. Stop at the midpoint of this crease. To be perfectly clear, you want to make a cut from halfway up the folded side of the paper to the exact center of the paper. In other words, since your folded paper is divided into four quarters, your cut should go between the two quarters on the right side of the folded paper."
    },
    {
      "title": "Unfold the paper and make a hotdog fold.",
      "content": "Unfold the paper and make a hotdog fold. Unfold the paper completely and lay it flat in front of you. Make the same hotdog-style (long and skinny) fold that you made near the beginning of the project. You should be folding along the cut you just made, which should be centered on the midpoint of the fold."
    },
    {
      "title": "Push the two ends of the paper together.",
      "content": "Push the two ends of the paper together. Arrange your paper so that the folded edge with the cut in the middle is pointing up and the edges of the paper are facing down toward the floor or table. Carefully grab each end of the folded paper and push them together toward the center. The inside sections should fold outward in a rough diamond shape. Continue pushing until your diamond collapses and forms a cross shape. Strengthen any of the central creases as needed."
    },
    {
      "title": "Fold your paper across itself to make a booklet.",
      "content": "Fold your paper across itself to make a booklet. You're nearly done! All you need to do is grab the left end of your folded paper and fold it across to the right end of the paper. The central folds should \"accordion\" to form eight pages, while the backsides of the outer sections should form the front and back covers. Press the left edge (the \"spine\") of your new booklet to make a strong crease."
    },
    {
      "title": "Decorate or personalize your booklet as you please.",
      "content": "Decorate or personalize your booklet as you please. Now that you've made your new booklet, it's up to you to decide how to personalize it. Use any pens, markers, or other craft tools at your disposal to make your booklet uniquely your own! Below are just a few ideas for how you might want to decorate your new booklet: Add flowery, old-fashioned trim work around the edges of the front and back covers. Add page numbers and/or the booklet's title at the tops of each page. Use stickers or glue-on decorations to give your booklet flair. Keep things plain and dignified by simply writing your name and the title of the booklet on the front cover."
    },
    {
      "title": "Grab three or more lunch bag-style paper bags.",
      "content": "Grab three or more lunch bag-style paper bags. This method turns a few ordinary paper bags into a booklet that's a little bigger than the eight page booklet described above. The type of bag you'll want to use is the skinny, narrow paper bag with a \"flap\" at the bottom that's frequently used for packing lunches. White paper bags are easiest for writing and reading purposes, but standard brown bags also work fine. You'll also want to have a hole punch and some string or ribbon handy. [2] X Research source You don't specifically have to use lunch bags for this booklet — you're just looking for skinny paper bags with a \"flap\" at the bottom that allows the bag to stand upright when it's opened. As long as all your bags are the same size and shape, you can make a booklet using almost any of this type of paper bag."
    },
    {
      "title": "Lay one bag down with its flap on the left.",
      "content": "Lay one bag down with its flap on the left. Take one of your paper bags and lay it on the table or work area in front of you so that the flap is facing up. Turn the bag so that one of its long edges if facing you and the square flap is on your left."
    },
    {
      "title": "Place another bag on top with its flap on the right.",
      "content": "Place another bag on top with its flap on the right. Take another paper bag and put it on top of the first flap side-up so that its flap is on your right, rather than your left. Line the bags up so that they sit evenly on top of each other."
    },
    {
      "title": "Lay another bag on top with its flap on the left.",
      "content": "Lay another bag on top with its flap on the left. Take a third bag and lay it on top of your stack flap side-up so that its flap is on the left, exactly as you did with the first bag. Once again, line this bag up so that it's even with the ones under it."
    },
    {
      "title": "Add more bags for more pages.",
      "content": "Add more bags for more pages. At this point, you can continue adding bags as you wish, though you don't have to. The more bags you add, the more pages your booklet will have. If you want to add more bags, use the same alternating pattern you've established — your next bag should be flap side-up with its flap on the right, the bag after that should have its flap on the left, and so on. If you stick with just three bags, your booklet will have a total of 10 pages once it's completed."
    },
    {
      "title": "Fold the stack of bags in half book-style.",
      "content": "Fold the stack of bags in half book-style. When you've added as many bags as you'd like, take the entire stack of bags and fold it in half over itself. The smooth side of the bottom bag (previously touching the table or work area in front of you) should form the front and back covers of your new book, while the alternating bottoms and tops of the bags inside form the pages. In your booklet, the bag flaps can function as \"fold-out\" sections. In other words, if you want to, you can put extra information under the flaps. Alternatively, you can tape or glue them down to give your booklet a more traditional feel."
    },
    {
      "title": "Bind the pages.",
      "content": "Bind the pages. Next, to finish your booklet, you need to bind the pages together so that they'll stay together in the shape of a book without making your booklet's pages hard to turn. The easiest way to do this is generally to use a hole punch to put two or more holes along the folded edge (i.e., the \"spine\" of your book). Loop a short length of ribbon or string through each hole you make, then tie the ends together, leaving enough slack in each loop to allow the pages to turn easily. If you're handy with a sewing machine, you can alternatively use one to stitch the folded edge of the booklet together. If you do this, be careful not to put your stitches too close to the book's \"spine\" or you risk missing some of the innermost pages."
    },
    {
      "title": "Grab origami paper.",
      "content": "Grab origami paper. This method requires trickier folds than the ones above, but leaves you with an elegant, professional-looking booklet if done correctly. To make your job easier, it's useful to use square pieces of origami paper for this project. Technically, any square piece of paper will work, but origami paper is usually thin and relatively easy to fold. Plus, it often has patterns or designs on one side which can create great-looking covers. If you don't have any square paper handy, you can trim a standard 8 1/2 x 11\" piece of paper to make an 8 1 ⁄ 2 inch (21.6 cm) square piece by cutting three inches from the longer side. Be precise and use a ruler to aid your measurements. You're going to be making lots of intricate folds, so having a paper that's as close to perfectly square as possible will be a big help in the long run."
    },
    {
      "title": "Divide the paper into fourths.",
      "content": "Divide the paper into fourths. Lay your paper flat in front of you (if you're using patterned origami paper, you want it white side -up). Fold the paper in half vertically, then fold the outer edges inward to the center and crease. When you're done, your paper should be divided into four tall, skinny, equal sections with three folds that point away from you (or \"valley\" folds)."
    },
    {
      "title": "Make upward folds between the folds you've just made.",
      "content": "Make upward folds between the folds you've just made. Next, make four more vertical folds to divide each of the tall, skinny sections of the paper in half. These folds should point toward you (\"mountain\"-style), rather than away from you. [3] X Research source When you're done, you should be left with a piece of paper that's divided into eight skinny strips that fold together in an \"accordion\" pattern."
    },
    {
      "title": "Turn your paper and fold it in half.",
      "content": "Turn your paper and fold it in half. Next, turn your paper 90 degrees so that the previously vertical folds run horizontal. Unfold these folds and make one new one to divide the paper in half vertically. Use a \"valley\"-style fold (one that points away from you). [4] X Research source Your fold should intersect the folds you've already made at perfect (or nearly perfect) right angles."
    },
    {
      "title": "Turn your paper again and fold it into a pair of skinny \"doors\".",
      "content": "Turn your paper again and fold it into a pair of skinny \"doors\". Turn your paper once again so that your original set of folds are once again pointing vertically. Fold the edges inward, \"accordion-ing\" the paper along the vertical folds as you go. Don't make the final fold in the center of the paper — leave this unfolded. Your paper should look like a long, skinny set of double doors at this point. Your folded piece of paper should be one-fourth as wide as it would normally be. If you're using patterned origami paper, the \"doors\" should have this pattern. If they're plain, you may have made an error in your folding."
    },
    {
      "title": "Fold the top sixth of the \"doors\" down.",
      "content": "Fold the top sixth of the \"doors\" down. Here's where things get tricky. You may want to start following along with the video below if you get lost. Take the skinny top edge of your folded \"doors\" and fold it down so it reaches halfway to the center crease running through your \"doors\" horizontally. In other words, you'll want to put a valley fold one sixth of the way down the length of the doors. Making this sort of fold is a little trickier than folding a section of paper in half or into quarters. There are a few different ways to do this — the easiest is probably to think of the top half of the doors as one single unit and fold the top edge down until it appears that the unfolded paper below is about the same thickness as the doubled-up portion, then fold and adjust manually until you get your proportions just right."
    },
    {
      "title": "Make \"X\" folds on the top edge of the paper.",
      "content": "Make \"X\" folds on the top edge of the paper. Grab the top edge of the folded paper and fold it across itself diagonally. Line the crease you just made up with the central crease running down the center of the doors vertically and press to fold. Your paper should look like an upside down, rotated letter L. Repeat for the opposite direction to fold an \"X\" shape into the top portion of the paper."
    },
    {
      "title": "Unfold your paper and fold along the lower horizontal crease.",
      "content": "Unfold your paper and fold along the lower horizontal crease. Next, unfold your paper completely and lay it in front of you. If you're using paper that's patterned on one side, you want the white side facing up (if you're not using patterned paper, this is the side that was inside your \"doors\" earlier). If necessary, turn the paper so that the \"X\" folds run along the bottom edge. Fold the lower part of the paper underneath using the horizontal crease near the bottom of the page. When you're done, your paper should be divided by vertical folds that form triangle shapes at the bottom."
    },
    {
      "title": "Kink each triangle in half and fold.",
      "content": "Kink each triangle in half and fold. Fold each of the small triangles at the bottom of the paper inward to divide it in half. Start at one end and fold the rest of the paper around each fold as you go. Press the folded triangles together accordion-style until your entire piece of folded paper looks like a very long, skinny letter L."
    },
    {
      "title": "Use a diagonal fold to make a backwards J shape.",
      "content": "Use a diagonal fold to make a backwards J shape. Take the long, skinny end of your \"L\" and make a 45 degree fold to bring it up and over itself. Leave a small gap between the lower part of the \"L\" and the fold you make. When you're done, your folded-up piece of paper should look like a backwards letter J. Fold the interior of the J shape in upon itself to give the bottom of the J 45 degree angles all around."
    },
    {
      "title": "Open up the skinny part of the J and fold it back over itself.",
      "content": "Open up the skinny part of the J and fold it back over itself. Carefully open up the accordion-ed folds of the long, narrow part of the J shape to reveal a wide \"cape\" shaped section of paper. Fold this back over itself, turning it 90 degrees as you do so. Line your fold up with the paper behind it. Then, fold the upper section of the paper back over itself once more in the opposite direction."
    },
    {
      "title": "Turn the paper over and fold the bottom of the paper up.",
      "content": "Turn the paper over and fold the bottom of the paper up. If you're working with patterned paper, after you flip it over, your paper should now look like a wide, fat cape or glider with patterned \"trim\" at its edges. Fold the bottom edge of the paper over itself with a narrow fold — you want to create no more than a quarter inch strip of doubled-up material at the bottom."
    },
    {
      "title": "Fold the top of the paper down to form a rectangle.",
      "content": "Fold the top of the paper down to form a rectangle. Grab the top edge of the paper and fold it down over itself until it's almost (but not quite) level with the bottom edge. Your folded paper should now be in the shape of a long, skinny, horizontal rectangle. If you're using patterned paper, the entire rectangle should be patterned."
    },
    {
      "title": "Fold the outer edges of the paper in towards the \"pages\".",
      "content": "Fold the outer edges of the paper in towards the \"pages\". Your booklet should now be starting to take shape. In the middle of your rectangle, there should be a small \"tab\" of tightly-folded square segments of paper that fan out from a central point where they all meet. These will form your booklet's pages. To make your booklet's covers, fold the outer edges of the rectangle in until they meet the base of the pages and fold to crease. When you're done, there should be a tab of paper at each end of the inner tab of pages that's slightly larger than the pages themselves."
    },
    {
      "title": "If desired, glue your covers in place.",
      "content": "If desired, glue your covers in place. Congratulations! If you've made all of your folds correctly, when you're done, your tiny booklet should have ten pages and a front and back cover. If you want to, at this point you can carefully glue or tape the flaps that form the covers of the book down to secure them in place. Your booklet is now ready to use! Alternatively, for true origami authenticity, try sliding the lower tab of each cover flap into the pocket along the back of the book. This secures each cover in place without the use of adhesives, which any origami master wouldn't be caught dead using."
    }
  ]
}