{
  "url": "https://www.wikihow.com/Push-Start-a-Motorcycle",
  "title": "How to Push Start a Motorcycle",
  "steps": [
    {
      "title": "Check for other issues that may be preventing the bike from starting.",
      "content": "Check for other issues that may be preventing the bike from starting. Before trying to push-start your bike, it can save time in the long run to quickly check for the types of problems that won't be helped by push-starting. For instance, it only takes a second to make sure that your bike isn't starting because it's out of gas - simply check the gas gauge. Below is a short checklist that you may want to run through before push-starting - if one of these conditions is not true, this may be the reason your bike isn't starting: [1] X Research source There is fuel in the tank. The petcock is set to \"on\" (more pertinent to older bikes). The kickstand is up. The transmission is in neutral. The kill switch is set to \"run\"."
    },
    {
      "title": "Put the bike in 1st or 2nd gear",
      "content": "Put the bike in 1st or 2nd gear . Push-starting requires the bike to be in a relatively low gear. For most bikes, 2nd gear is the easiest gear for push-starting, though it is usually also possible in 1st gear. [2] X Research source Rarely, some bikes will even be easier to start in 1st gear than in second. Usually, if your bike is parked, it's in neutral - you can tell whether this is the case by pushing it forward. Neutral is the only gear that allows the bike to roll forward without holding in the clutch. To shift from neutral to first on a manual bike, depress the clutch and press down on the foot control. To shift from first to second, depress the clutch and press up on the foot control. [3] X Research source"
    },
    {
      "title": "Hold the clutch in and begin pushing.",
      "content": "Hold the clutch in and begin pushing. Most guides recommend getting the bike to a speed of at least 5 mph (8.0 km/h) for a successful push-starting. [4] X Research source This will require a stretch of open space in front of you, so clear the area of any obstructions before beginning. You may also want to leave plenty of space on either side on the off chance that you lose control of the bike after it starts. You can reach push-starting speed quite easily by allowing the bike to roll downhill. In this case, rather than running beside the bike and pushing, you would ride the bike. If attempting a downhill push-start, take care to ensure that you don't lose control of the bike."
    },
    {
      "title": "Release the clutch and hit the starter.",
      "content": "Release the clutch and hit the starter. Once you've gathered enough speed, release the clutch and hit the starter button in one smooth motion as the bike is rolling. Give the bike a moderate amount of throttle. As soon as the bike starts, engage the clutch again to prevent the bike from getting away from you. [5] X Research source"
    },
    {
      "title": "Rev the engine.",
      "content": "Rev the engine. Now that you've got your bike started, you don't want it to die again. With the clutch depressed, rev the engine at a medium level so that your bike doesn't choke down or go dead. Revving the engine has the added effect of charging your battery if the reason your bike wouldn't start is because the battery was dead."
    },
    {
      "title": "Ride away.",
      "content": "Ride away. Once you've got your motorcycle running, it's unlikely to stop again unless you turn it off on purpose or stall the engine. If your battery was drained, riding your bike around and/or revving your engine can help restore some of the charge, preventing the need for future push-starts. Before turning the bike off, be sure to address the underlying issue that caused the bike not to start in the first place (or at least prepare to do so). A bike that requires push-starting to start may have problems with the battery or fuel system that can require the attention of a mechanic. For instance, if your bike's battery is on its last legs, you may want to ride your bike to the nearest mechanic's to get a new battery before turning it off."
    }
  ]
}