{
  "url": "https://www.wikihow.com/Calculate-Percent-Change",
  "title": "How to Use the Percent Change Formula",
  "steps": [
    {
      "title": "Subtract the original value from the new value.",
      "content": "Subtract the original value from the new value. If your original value is smaller than the new value, then you’re calculating percent increase. First, find the difference between the two values. For example, say you’re trying to figure out how much your income increased from one year to the next. If you made $37,000 last year and $45,000 this year, subtract 37,000 from 45,000, which is 8,000. If you got a raise from $20 an hour to $22.50 an hour and want to find the percent change, subtract 20 from 22.50, which is 2.50."
    },
    {
      "title": "Divide your answer by the original value.",
      "content": "Divide your answer by the original value. Imson says that the most common mistake she sees her students make is using the wrong denominator. Because you’re looking at how much the original number increased, the original (smaller) number is your denominator. So if your difference is 8,000, like the example above, divide 8,000 by 37,000 (which is the original value). The answer is 0.216. For the hourly wage example, divide 2.5 by 20, which is .125."
    },
    {
      "title": "Multiply your answer by 100 to turn it into a percentage.",
      "content": "Multiply your answer by 100 to turn it into a percentage. This is the same as moving the decimal point two places to the right. [1] X Research source Multiply 0.216 by 100. In this case, the answer is 21.6, so your income increased by 21.6%. Move the decimal point two places to turn .125 into 12.5%. So a 12.5% increase from 20 is 22.5."
    },
    {
      "title": "Subtract the original value from the new value.",
      "content": "Subtract the original value from the new value. If you have a decrease (a lower final number) and don’t want to deal with negative numbers, Imson says you can also do the opposite of the standard equation by subtracting the new value from the original value. You can think of a percent decrease as “percent off,” like when an item is on sale. If a pair of pants was previously sold for $50 and is now on sale for $25, subtract 50 from 25, which is -25. To use the reversed equation, if you’re looking at how much a school’s enrollment changed between years, and the enrollment this year is 12,125 and it was 13,500 last year, take 12,125 away from 13,500, which is 1,375. By switching the new value and original value in the numerator, all you’re doing is changing the negative sign to a positive. If that’s confusing, just stick to the original formula."
    },
    {
      "title": "Divide your answer by the original value.",
      "content": "Divide your answer by the original value. Imson notes that the point of reference is the original number, so divide by the original (larger) value so the answer is in respect to that number. Divide the difference in price (-$25) by the old value ($50) is -0.5. Another way of thinking of it is that the $25 change is 0.5 of the $50 starting point, and the change of value is in a negative direction. For the reverse equation, divide 1,375 (the difference between the numbers) by 13,500 (the original value), which is equal to 0.1019 (when rounded)."
    },
    {
      "title": "Multiply the decimal by 100 to change the answer to a percentage.",
      "content": "Multiply the decimal by 100 to change the answer to a percentage. You can convert any fraction into a percentage by dividing the numerator by the denominator and multiplying by 100. To get the final sale percentage, multiply -.05 by 100. -0.5 × 100 = -50%. This means that the new price of the pants is 50% less than the old price. In other words, the pants are 50% off. Another way to think of this is that the $25 difference is 50% of the initial $50. Multiply 00.1019 by 100, which is 10.19. So, enrollment decreased by 10.19%."
    },
    {
      "title": "Divide your percentage by 100.",
      "content": "Divide your percentage by 100. If you’re given a value and asked to find, for example, a value 50% higher than it, start by dividing 50 by 100. [2] X Research source You can use this method to check answers from percent change problems."
    },
    {
      "title": "Multiply the value by the decimal, then add it to the original value.",
      "content": "Multiply the value by the decimal, then add it to the original value. When you multiply a number by a decimal, you get a value that represents that percentage of the original number. For example, 50 is .5 (half) of 100. By adding that result to the original value, you get a number that is that percentage more than the original number. [3] X Research source If you’re asked to find a number 87% higher than 8, then multiply 8 by .87, which is 6.96. Then, add 6.96 to 8, which is 14.96. If you found a percentage in a percent increase problem and want to check your answer, divide the percentage by 100, multiply it by the original value, and then add the result to the original value. If your percentage was correct, the answer will be the second, increased value."
    }
  ]
}