{
  "url": "https://www.wikihow.com/Become-a-Korean-Citizen",
  "title": "How to Become a Korean Citizen",
  "steps": [
    {
      "title": "Confirm your eligibility.",
      "content": "Confirm your eligibility. If you are an adult over the age of 20 and have lived in the ROK for 5 consecutive years as a legal resident, you may be eligible to apply for permanent residency. You must be able to prove that you are capable of financially supporting yourself, that you have no criminal record, and that you have a strong understanding of Korean culture, language, and traditions. [2] X Research source You can apply for permanent residency after 3 years of residency if you are an investor who has invested at least US$500,000 in Korean business and provided employment opportunities for at least 5 Korean nationals. Eligibility for permanent residency may also be granted by the Justice Minister in recognition of special contributions to Korea."
    },
    {
      "title": "Determine how many points you've accumulated.",
      "content": "Determine how many points you've accumulated. If you're not related by blood or marriage to a Korean national, you acquire permanent or long-term residency through the points system. If you accumulate at least 80 points out of a total of 120, you can get long-term or permanent residency – provided all other aspects of your application are in order. [3] X Research source You get the most points for age if you are between the ages of 30 and 34 (25 points). The least points you can get for age is 15 (if you are 51 or older). If you have a doctorate degree in science or engineering, you get 35 points. The minimum points you can get for education is 15 (for a high school diploma). The most points you can get for Korean language proficiency is 20 (for grade 6 or higher, which represents advanced language skill). Grade 4, the minimum you need to be eligible for long-term or permanent residency, will get you 16 points. You also get points based on your annual income. If you make 100 million RWK or more in a year, you get the maximum of 10 points. You need to make at least 30 million RWK a year to be eligible for long-term or permanent residency. This would get you 3 points. You can also get extra points for volunteer work and for studying at Korean universities."
    },
    {
      "title": "Volunteer in your community.",
      "content": "Volunteer in your community. You can get up to 10 extra points for doing regular volunteer work in your community. Doing volunteer work is not only a relatively easy way to earn points, it also helps you forge connections with the people in your community. Talk to your neighbors about volunteer opportunities that are available. You can also ask around your workplace about community projects you could work with."
    },
    {
      "title": "Study the Korean language.",
      "content": "Study the Korean language. To qualify for permanent residency, you must achieve at least a level 4 score on the Korean proficiency exam administered by Korean Immigration. In addition to being a basic requirement, a level 4 score also earns you 20 points on your application for permanent residency. You can learn more about the Korean proficiency exam, TOPIK, and review the schedule of exam dates and locations, by visiting https://www.topik.go.kr/TWMAIN/TWMAIN0010.do ."
    },
    {
      "title": "Take the Social Integration course.",
      "content": "Take the Social Integration course. This course is run by Korean Immigration. It was originally designed for foreign spouses, but it's open to anyone. Taking the course will earn you an additional 10 points on your application for permanent residency. To apply for the course, subscribe online to the Immigration & Social Integration Network. You can complete an online application from the network once you're registered. Completion of the program also may enable you to claim exemption from written tests for permanent residency, or for citizenship later on."
    },
    {
      "title": "Get a sponsor for your application.",
      "content": "Get a sponsor for your application. To obtain permanent residency, your application must have a sponsor. Your sponsor could be an individual Korean national, or the corporation where you work. There are 2 applications, one of which must be completed by your sponsor. [4] X Research source Your sponsor can complete their application online at https://www.visa.go.kr/ , or by visiting the nearest immigration office. Your sponsor's application must be accompanied by a copy of their Korean passport and identity card to prove that they are a Korean national."
    },
    {
      "title": "Complete and submit your application.",
      "content": "Complete and submit your application. The application for permanent residency requires information about your current nationality, criminal history, and educational and employment background. [5] X Research source You can complete and submit an application for permanent residency online at https://www.visa.go.kr/ . You can also pay your application fees online with a major credit card. When you submit your application, you'll have to pay application fees ranging between 30,000 and 80,000 KRW depending on your home country and the type of permanent residency visa you're applying for."
    },
    {
      "title": "Gather supporting documentation.",
      "content": "Gather supporting documentation. The specific documentation you need depends on the type of permanent residency visa you're applying for. All types require you to present your passport and residency card. You also need documents that support the statements you made in your application. You must also have bank and financial statements to prove that you make at least the national income average (about 20,000,000 KRW). You should also get originals and copies of your income statements and employment certificate. Get originals and copies of your real estate registration or lease contract to prove your residency."
    },
    {
      "title": "Attend your interview.",
      "content": "Attend your interview. Even if you complete and submit your application online, you'll still need to make a trip to the nearest immigration office for an interview with an immigration official. The official will ask you questions about your application, your background, and your reasons for seeking permanent residency. The official may also ask you questions to assess your knowledge and understanding of Korean culture and traditions, as well as your ability to speak and understand the Korean language. During your interview, the immigration official will also review your supporting documentation for your application. Make sure you bring originals and copies of all of these documents with you."
    },
    {
      "title": "Receive the decision from the Immigration Office.",
      "content": "Receive the decision from the Immigration Office. Generally, it takes 1 to 2 months from the time your application is received for Immigration to make a decision on whether to grant you permanent residency. The process may take longer if your application is incomplete, or if Immigration needs more information from you. [6] X Research source If you currently have a temporary residence permit, make sure it will not expire while you are waiting for a decision on permanent residency. If your application was refused, you can submit a letter to appeal the decision, or you can reapply. Review your application carefully and correct any incomplete or inaccurate information – do not resubmit the exact same application."
    },
    {
      "title": "Register and pick up your visa.",
      "content": "Register and pick up your visa. If your application is approved, you must register as a foreign resident. Provide your name, sex, date of birth, nationality, passport information, place of work, and place of residence. If any of the information you've registered changes, you must report the change to the Immigration Office within 14 days of the change taking place."
    },
    {
      "title": "Live in Korea for 5 years as a permanent or long-term resident.",
      "content": "Live in Korea for 5 years as a permanent or long-term resident. Unless you have a family relationship with a Korean national, you must live in Korea for at least 5 years as a permanent resident before you can apply for citizenship. [7] X Research source If you have a long-term residency permit rather than permanent residency, make sure your stay in Korea is continuous and that you don't allow your residency visa to lapse. Otherwise, the time period may start over."
    },
    {
      "title": "Continue studying the Korean language.",
      "content": "Continue studying the Korean language. Although you took a proficiency test for permanent residency, your language proficiency will be evaluated again for citizenship. Practice your Korean every chance you get, and take Korean language courses when you can. The official who evaluates your application for naturalization will likely want to see continued improvement in your language proficiency. Regardless, continued improvement will show your dedication towards becoming a Korean national."
    },
    {
      "title": "Maintain a clean criminal record.",
      "content": "Maintain a clean criminal record. If you get charged with a crime while in Korea as a foreign resident, you will likely get deported. However, even if you are only charged for a minor infraction, it could ruin your chances of becoming a citizen. You're also expected to show good conduct and personal discipline. Acts that don't rise to the level of criminal activity, such as noise complaints, could still jeopardize your chances of gaining citizenship."
    },
    {
      "title": "Work continuously to financially support yourself.",
      "content": "Work continuously to financially support yourself. Not only are you expected to be continuously employed while a foreign resident of Korea, but you're also expected to save some of the money you earn. To be eligible for citizenship under the general naturalization process, you must present a certificate from your bank showing that you have an account balance of at least 30,000,000 KRW. When you apply for naturalization, you will need to provide a statement from your current employer, as well as any previous employers. If you switch jobs while a foreign resident, make sure you stay on good terms with your former employer."
    },
    {
      "title": "Participate in your local community.",
      "content": "Participate in your local community. As with gaining permanent residency, continuing to be an active part of your community is important if you want to become a Korean citizen. This demonstrates that you care about Korea and want to improve the circumstances around you. During your naturalization interview, the immigration official will assess your attitude towards Korea and its culture. Being an active part of your community shows that you willingly give of yourself and your time to better the lives of those around you."
    },
    {
      "title": "Request recommendation letters from 2 qualified Korean nationals.",
      "content": "Request recommendation letters from 2 qualified Korean nationals. Korean immigration law dictates the types of people who are qualified to write recommendation letters. Typically, at least one of your recommendation letters will be from a manager at the company where you work. [8] X Research source Local government officials also are qualified to write recommendation letters. However, if you seek a recommendation letter from a government official, make sure they actually know you personally. Attorneys, judges, and other public officers are also qualified to write recommendation letters."
    },
    {
      "title": "Complete your naturalization application forms.",
      "content": "Complete your naturalization application forms. To apply for citizenship, you will need a Naturalization Application Form, a Statement for Citizenship Application, and a Statement of Identity. You must attach a color photo to your Statement of Identity. These forms are only available in Korean. [9] X Research source Necessary forms can also be downloaded at https://www.hikorea.go.kr/pt/DownLoadTemplPopupR_en.pt . Scroll down to find links to naturalization-related forms."
    },
    {
      "title": "Gather supporting documentation.",
      "content": "Gather supporting documentation. In addition to the application forms, you will need a copy of your passport, documents proving your financial stability, personal documents such as marriage or birth certificates, and your recommendation letters. [10] X Research source Documents sufficient to prove your financial stability include bank or investment statements that show you have financial assets in excess of 60 million KRW, a certificate of income, or a certificate of real estate registration worth in excess of 60 million KRW."
    },
    {
      "title": "Have supporting documents translated, if necessary.",
      "content": "Have supporting documents translated, if necessary. If you have documents in a foreign language, they must be translated into Korean by a certified translator. The translated document must be notarized. [11] X Research source Documents in Chinese or English are exempt from the notarization requirement. However, they still must be translated into Korean, and you must provide a name and contact information for the translator."
    },
    {
      "title": "Take the comprehensive assessment.",
      "content": "Take the comprehensive assessment. The comprehensive assessment is a written and oral test that evaluates basic qualities necessary for naturalization, including Korean language ability and an understanding of Korean society, culture, and liberal democratic values. [12] X Research source You can apply to take the comprehensive assessment at http://www.socinet.go.kr/soci/main/main.jsp?MENU_TYPE=S_TOP_SY ."
    },
    {
      "title": "Submit your application materials to the nearest immigration office.",
      "content": "Submit your application materials to the nearest immigration office. Once you've completed your naturalization paperwork and gathered your supporting documents, make an appointment to have them reviewed at the immigration office. While you can walk in, reserving an appointment means you won't have to wait. [13] X Research source To find the immigration office with jurisdiction over the area where you live, go to https://www.hikorea.go.kr/pt/InfoDetailR_en.pt?categoryId=2&parentId=398&catSeq=453&showMenuId=377 . When you submit your application, you must pay a fee of 300,000 KRW, as of 2018. Contact the Immigration Office or check the immigration website to get the most current statement of fees."
    },
    {
      "title": "Attend your naturalization interview.",
      "content": "Attend your naturalization interview. Before you will be granted citizenship, an interview with an immigration official is necessary. The official will ask questions about your application and background. They will also assess your understanding of the Korean language, culture, laws, and traditions. [14] X Research source You can download an educational booklet at https://www.hikorea.go.kr/pt/InfoDetailR_en.pt that will help prepare you for your interview. There are also sample interview questions available at https://www.hikorea.go.kr/pt/InfoDetailR_en.pt . You will also be tested on your ability to sing the national anthem. [15] X Research source"
    },
    {
      "title": "Wait for notification from the Ministry of Justice.",
      "content": "Wait for notification from the Ministry of Justice. [16] X Research source You can check the announcement page on www.immigration.go.kr or www.hikorea.go.kr for an estimate on how long you will have to wait for notification. The time frame varies among individual cases and depending on the number of outstanding applications."
    },
    {
      "title": "Apply for an identification certificate.",
      "content": "Apply for an identification certificate. If you are granted citizenship, go to the community centre nearest where you live for your identification certificate and register as a resident. [17] X Research source When you become a Korean national, you are expected to turn over your foreign residence card."
    },
    {
      "title": "Renounce your foreign nationality within 1 year.",
      "content": "Renounce your foreign nationality within 1 year. After you are granted Korean citizenship, you are expected to renounce your citizenship in your home country. If you fail to renounce your foreign nationality after 1 year, you will lose your Korean nationality. [18] X Research source Go to the nearest embassy or consulate for your home country to renounce your citizenship. Get written certification from a consular officer that you have officially renounced your citizenship. You'll need to submit this to the Immigration Office. If you acquired Korean nationality by marriage to a Korean national, you do not have to renounce your foreign nationality. However, you do have to make a declaration not to exercise it, such as by getting a passport issued by your home country. If you choose to make a declaration not to exercise your foreign nationality, you are only allowed to exercise your Korean nationality while in Korea."
    }
  ]
}