{
  "url": "https://www.wikihow.com/Clean-Hair-in-the-Bathroom",
  "title": "The Complete Guide to Removing Hair in Your Bathroom",
  "steps": [
    {
      "title": "Vacuum hardwood, vinyl, and linoleum floors on the “floor” setting.",
      "content": "Vacuum hardwood, vinyl, and linoleum floors on the “floor” setting. If you have a vacuum that works on carpets and floors, switch it to the “floor” setting to turn off the spinning beater bar. Then, vacuum as much of the hair as you can and use any helpful attachments you may have to suck up hair in corners, cracks, and crevices. [1] X Research source Avoid vacuuming stone and ceramic tiled floors, as the vacuum may cause surface damage. Instead, sweep hair from these surfaces with a rubber squeegee broom. Vinyl floors, in particular, can be damaged by the spinning beater bar, so be sure to turn it off before proceeding with the vacuum. [2] X Research source Storing a hand-held vacuum cleaner in your bathroom may be particularly useful if you find yourself combating hair often."
    },
    {
      "title": "Go for a large sticky roller to collect hair on any even surface.",
      "content": "Go for a large sticky roller to collect hair on any even surface. Roll a large, reusable sticky roller across every area of the floor the same way you would a vacuum. Start towards the center of the bathroom and go towards the outer edges so hair doesn't stick to your shoes (and disperse) as you're cleaning. [3] X Research source Clean the roller after each use with soap and water. While a sticky roller can pick up hair off of any surface, it won’t work as well on uneven surfaces like stone and tiled floors."
    },
    {
      "title": "Try sweeping hair from any floor with a rubber squeegee broom.",
      "content": "Try sweeping hair from any floor with a rubber squeegee broom . Use a rubber broom just like a regular broom, pulling it toward you in short, deliberate strokes. Start around the edges of the bathroom and sweep the hair towards you. Then, sweep it all into a dustpan and toss it in the trash. [4] X Research source Rubber brooms are more effective at picking up hair than a regular broom and can be used on vinyl, hardwood, stone, ceramic, and linoleum floors. For uneven stone floors and ceramic tiled floors with lots of grout lines, use a bristled rubber broom instead. Rinse the head of the broom under running water to clean it after each use."
    },
    {
      "title": "Dry-mop bathroom floors before damp-mopping for a hair-free clean.",
      "content": "Dry-mop bathroom floors before damp-mopping for a hair-free clean. Go over the entire surface area of the bathroom floor with any dry mop (like a Swiffer) to grab hair and debris. Soak the sponge of the mop in a mild, floor-safe cleanser and wring it out (so it’s not dripping wet) before mopping. [5] X Research source Damp-mopping a floor that hasn’t been dry-mopped will only push the hair around and make it stick to the floor. Dry-mopping can grab hair from most floor surfaces, but it may not work as well on uneven natural stone or tiled floors with lots of grout lines."
    },
    {
      "title": "Use a hand-held sticky roller to pick up loose strands from any surface.",
      "content": "Use a hand-held sticky roller to pick up loose strands from any surface. Peel off the outer layer of a sticky (lint) roller to reveal a fresh sticky sheet. Then, roll the roller over the entire surface of the countertop to collect hair and debris. [6] X Research source Sticky lint rollers also work well on the floor or bathroom rugs but may take a while to roll the entire surface area. Sticky rollers won’t work on uneven surfaces like natural stone or ceramic tiles with a lot of grout lines."
    },
    {
      "title": "Wipe down the counter with a microfiber rag or dry dust wipe.",
      "content": "Wipe down the counter with a microfiber rag or dry dust wipe. Lay a microfiber hand towel or dust wipe over your palm and wipe down the entire surface of the countertop. Make sure to go over every nook and cranny where hair might be hiding! [7] X Research source Dry dust wipes pick up more hair than a paper towel or regular towel would. Microfiber towels and dust wipes are safe for use on any surface."
    },
    {
      "title": "Clean laminate with a damp microfiber rag and a mild cleanser.",
      "content": "Clean laminate with a damp microfiber rag and a mild cleanser. Dampen the microfiber towel and spritz the countertop with mild, laminate-safe cleanser . Run the microfiber towel over the entire surface of the counter to pick up hair and debris. [8] X Research source Avoid acidic or alkaline cleansers, which can corrode and discolor laminate surfaces. Mild cleansers are safe to use on most surfaces except wood, as any moisture can cause discoloration or weaken the wood."
    },
    {
      "title": "Remove hair from stone countertops with dish soap and water.",
      "content": "Remove hair from stone countertops with dish soap and water. Pour about 1 tablespoon (15 mL) of mild dish soap into a 14 fl oz (410 mL) or 16 fl oz (470 mL) spray bottle and fill it up with warm water. Shake it and then spray the solution liberally onto the counter. Dampen a microfiber towel or soft rag and wipe away the dust and hair. [9] X Research source Avoid using cleansers or soaps with lemon juice or other acids (like vinegar) on granite or marble countertops, as it eats through the sealant that protects the surface from stains and etches. You may use dish soap and water on any surface, so long as you don’t use an abrasive sponge such as steel wool or the backside of a kitchen sponge which can scratch the surface of granite, marble, stone, wood, porcelain, fiberglass, and ceramic countertops."
    },
    {
      "title": "Use a stone-specific commercial cleanser for stone countertops.",
      "content": "Use a stone-specific commercial cleanser for stone countertops. Look for a formula that says explicitly “for natural stone surfaces” or “pH-neutral” on the package. Spray a liberal amount of the cleanser onto the surface and wipe away hair and dust with a microfiber cloth. [10] X Research source Avoid using cleansers containing high-acidity ingredients like vinegar, bleach, and ammonia, as they can damage the stone. Stone-safe cleansers are safe for use on any surface, including painted wood."
    },
    {
      "title": "Rub dry surfaces in a circular motion with your fingers to gather hair.",
      "content": "Rub dry surfaces in a circular motion with your fingers to gather hair. If you notice dry hair on the sides of your tub, shower, or sink, use your hand to rub the surface in a circular motion to grab the hair. Once the hair has balled up, toss it in the trash. [11] X Research source Collecting the hair with your fingers will only work if the hair and surface are dry. Any moisture will make the strands stick to the surface. Placing a hairband or rubber band around your hand (so it lies across your palm) will act as a lip for the hair to stick to and may make the clean-up process more manageable."
    },
    {
      "title": "Use a squeegee or microfiber towel to clean stone sinks and showers.",
      "content": "Use a squeegee or microfiber towel to clean stone sinks and showers. Use plain water or spray the stone's surface with a stone-safe cleaner. Wipe up the hair and other grime with a microfiber cloth or a squeegee for flat stone surfaces. [12] X Research source Soft, non-scratch sponges also work well to gather hair from curved sinks or uneven stone surfaces."
    },
    {
      "title": "Clean glass surfaces with Windex and a microfiber cloth.",
      "content": "Clean glass surfaces with Windex and a microfiber cloth. If your sink or shower walls are glass, use a mild glass cleaner and a soft sponge or microfiber towel to remove hair. Spritz the glass cleaner onto the surface and go over the surface of the glass in circular motions to gather and remove the strands. [13] X Research source Avoid using any cleaners containing chlorine or bleach, as these could damage the surface of the glass sink or shower door."
    },
    {
      "title": "Run a dry sponge over porcelain or metal surfaces to catch hair.",
      "content": "Run a dry sponge over porcelain or metal surfaces to catch hair. Hold a simple, dry kitchen sponge at the base of the tub or sink (near the drain) and run it out towards the sides. Then, do a final circular sweep around the sink or tub to gather the hair. Use your fingers to remove the hair from the surface once it’s balled up. [14] X Research source If the sink or tub is wet, some of the hair will stick to the sponge, and some will stay on the surface. To combat this, go over it again with a dry paper towel to get any stuck-on strands."
    }
  ]
}