{
  "url": "https://www.wikihow.com/Fold-Toilet-Paper",
  "title": "8 Decorative Ways to Fold Your Toilet Paper Roll",
  "steps": [
    {
      "title": "Pull out 1 or 2 toilet paper sheets from the roll.",
      "content": "Pull out 1 or 2 toilet paper sheets from the roll."
    },
    {
      "title": "Fold the right corner underneath to the left edge.",
      "content": "Fold the right corner underneath to the left edge. Bring the corner to the left edge of the toilet paper so it’s perfectly aligned. [1] X Research source"
    },
    {
      "title": "Fold the left corner up to the right corner of the toilet paper.",
      "content": "Fold the left corner up to the right corner of the toilet paper. Hide the folds on the back of the toilet paper so the front has a clean triangle shape. [2] X Research source"
    },
    {
      "title": "Layer the toilet paper down so the triangle sits neatly.",
      "content": "Layer the toilet paper down so the triangle sits neatly. Roll the toilet paper back up to prevent it from hanging loosely."
    },
    {
      "title": "Lift up 1 ½ squares of toilet paper from the roll.",
      "content": "Lift up 1 ½ squares of toilet paper from the roll."
    },
    {
      "title": "Fold the bottom right corner to the top left corner.",
      "content": "Fold the bottom right corner to the top left corner. [3] X Research source"
    },
    {
      "title": "Bring the bottom left corner to the paper’s top right corner.",
      "content": "Bring the bottom left corner to the paper’s top right corner. The folds on the toilet paper will look like a triangle. [4] X Research source"
    },
    {
      "title": "Fold the triangle up.",
      "content": "Fold the triangle up. Fold along the triangle’s longest side so it points up."
    },
    {
      "title": "Flip the triangle up.",
      "content": "Flip the triangle up. Make a fold where the point of the triangle touches the toilet paper. Bring the toilet paper up so the triangle is hidden."
    },
    {
      "title": "Fold the two corners down to the triangle’s point.",
      "content": "Fold the two corners down to the triangle’s point. [5] X Research source"
    },
    {
      "title": "Gently set the toilet paper back down.",
      "content": "Gently set the toilet paper back down."
    },
    {
      "title": "Pull out 2 or 3 sheets of toilet paper.",
      "content": "Pull out 2 or 3 sheets of toilet paper."
    },
    {
      "title": "Start pleating the sheets with an accordion fold.",
      "content": "Start pleating the sheets with an accordion fold. Leave a gap that’s about 1 in (2.5 cm) between each fold. For a smaller pleat, space the folds 1 ⁄ 2 in (1.3 cm) instead."
    },
    {
      "title": "Continue pleating the sheets until you have 8 or more folds.",
      "content": "Continue pleating the sheets until you have 8 or more folds. Work your way up the sheets you pulled out so they have consistent folds. [6] X Research source"
    },
    {
      "title": "Compress the pleats as tightly as possible.",
      "content": "Compress the pleats as tightly as possible."
    },
    {
      "title": "Fold the stack of pleats in half towards you.",
      "content": "Fold the stack of pleats in half towards you. Pinch the middle of the pleats in your finger and bring the ends together toward you."
    },
    {
      "title": "Squeeze the stack together while you press the creases firmly.",
      "content": "Squeeze the stack together while you press the creases firmly."
    },
    {
      "title": "Release the stack of pleats.",
      "content": "Release the stack of pleats. Let go of the toilet paper and let the folds relax."
    },
    {
      "title": "Hold the 2 edge pleats together and fold the top corner down.",
      "content": "Hold the 2 edge pleats together and fold the top corner down. Form a small triangle with the fold. Fold this corner down once more to lock the two halves together."
    },
    {
      "title": "Lay the toilet paper back on the roll and fluff the pleats.",
      "content": "Lay the toilet paper back on the roll and fluff the pleats. The end of the roll will resemble a a fan or seashell."
    },
    {
      "title": "Tear off 1-2 sheets of toilet paper.",
      "content": "Tear off 1-2 sheets of toilet paper."
    },
    {
      "title": "Fold the sheets into pleats.",
      "content": "Fold the sheets into pleats. Start from the end of the sheet and leave about 1 ⁄ 2 –1 inch (1.3–2.5 cm) between each fold. [7] X Research source"
    },
    {
      "title": "Compress the pleats into one neat stack.",
      "content": "Compress the pleats into one neat stack."
    },
    {
      "title": "Fold the pleat stack in half.",
      "content": "Fold the pleat stack in half. Bring the ends of the stack together so they’re touching."
    },
    {
      "title": "Let the pleats relax.",
      "content": "Let the pleats relax. Let go of the pleats, and find the two that are closest to one another."
    },
    {
      "title": "Align the two edge pleats together.",
      "content": "Align the two edge pleats together."
    },
    {
      "title": "Fold the ends of the 2 pleats down to form a small triangle.",
      "content": "Fold the ends of the 2 pleats down to form a small triangle. Make a second triangle fold down to lock the two pieces together so it looks like a fan."
    },
    {
      "title": "Insert the fan into a diamond fold or basket fold.",
      "content": "Insert the fan into a diamond fold or basket fold ."
    },
    {
      "title": "Pull down 1 ½ sheets of toilet paper.",
      "content": "Pull down 1 ½ sheets of toilet paper."
    },
    {
      "title": "Fold the bottom edge of the toilet paper back 1 in (2.5 cm).",
      "content": "Fold the bottom edge of the toilet paper back 1 in (2.5 cm). [8] X Research source"
    },
    {
      "title": "Fold the bottom edge of toilet paper back again.",
      "content": "Fold the bottom edge of toilet paper back again. The second fold hides the raw edge so the basket will have a soft rim."
    },
    {
      "title": "Fold the toilet paper up.",
      "content": "Fold the toilet paper up. Bring the fold up as much as you want up depending if you want a shallow or deep basket."
    },
    {
      "title": "Fold the left and right edges of the toilet paper behind.",
      "content": "Fold the left and right edges of the toilet paper behind. This forms the sides of the basket. Make the angle of the fold sharp if you want a narrow base or subtle if you want a wide base. [9] X Research source"
    },
    {
      "title": "Adjust the toilet paper basket up and down to position it.",
      "content": "Adjust the toilet paper basket up and down to position it. If you are going to add a decoration, like a pleated piece of toilet paper , lower the basket so the decoration is in the center."
    },
    {
      "title": "Fold the corners up a third of the way in from the edges.",
      "content": "Fold the corners up a third of the way in from the edges."
    },
    {
      "title": "Pull the toilet paper down so the sheet’s edge is just below the roll.",
      "content": "Pull the toilet paper down so the sheet’s edge is just below the roll."
    },
    {
      "title": "Fold the toilet paper up.",
      "content": "Fold the toilet paper up. Make the fold about 1 inch (2.5 cm) above the triangular folds."
    },
    {
      "title": "Fold the bottom corners under the toilet paper behind.",
      "content": "Fold the bottom corners under the toilet paper behind. This makes the tapered bottom of the gem. If this is too tricky you can lift the toilet paper up."
    },
    {
      "title": "Layer the toilet paper back down and admire the gem shape.",
      "content": "Layer the toilet paper back down and admire the gem shape."
    },
    {
      "title": "Make a small vertical rip from the bottom edge of the toilet paper.",
      "content": "Make a small vertical rip from the bottom edge of the toilet paper. Make the rip nearly 1 inch (2.5 cm) long."
    },
    {
      "title": "Fold up both corners of the ripped section of the toilet paper.",
      "content": "Fold up both corners of the ripped section of the toilet paper. This makes two small triangles in the center. Try to make these the same size and make sure the folds are at a 45-degree angle. [10] X Research source"
    },
    {
      "title": "Fold in the left and right corners of toilet paper.",
      "content": "Fold in the left and right corners of toilet paper. Make these triangles the same size as the ones in the middle."
    },
    {
      "title": "Pull the toilet paper one and a half sheets down.",
      "content": "Pull the toilet paper one and a half sheets down."
    },
    {
      "title": "Fold the end of the toilet paper back up.",
      "content": "Fold the end of the toilet paper back up. Fold up about 3 inches (7.6 cm) of the toilet paper."
    },
    {
      "title": "Fold the bottom corners behind the toilet paper.",
      "content": "Fold the bottom corners behind the toilet paper. This makes the pointed bottom of the heart. Ensure you keep the other folds neat while you form the bottom of the heart."
    },
    {
      "title": "Roll the toilet paper back up so the heart is in the middle.",
      "content": "Roll the toilet paper back up so the heart is in the middle."
    },
    {
      "title": "Lift up one and a half sheets of toilet paper.",
      "content": "Lift up one and a half sheets of toilet paper."
    },
    {
      "title": "Fold the two top corners behind to the middle.",
      "content": "Fold the two top corners behind to the middle. Make the edges meet in the center. [11] X Research source"
    },
    {
      "title": "Adjust the toilet paper back onto the roll.",
      "content": "Adjust the toilet paper back onto the roll."
    },
    {
      "title": "Fold up the left and right edges a little.",
      "content": "Fold up the left and right edges a little. If you want a narrow sail, fold in a lot, and if you want a wide sail, fold just a small amount. [12] X Research source"
    },
    {
      "title": "Fold the triangle up at the base.",
      "content": "Fold the triangle up at the base. This creates a triangle that points up."
    },
    {
      "title": "Roll the toilet paper down until the triangle is centered.",
      "content": "Roll the toilet paper down until the triangle is centered."
    },
    {
      "title": "Fold up the bottom edge of the triangle.",
      "content": "Fold up the bottom edge of the triangle. This creates the ship’s hull. For a shallow hull, only fold a tiny bit. For a deeper hull, make a larger fold."
    },
    {
      "title": "Fold the left and right sides of the hull underneath.",
      "content": "Fold the left and right sides of the hull underneath. This makes the shape of the boat look more rounded."
    },
    {
      "title": "Center the boat on the roll.",
      "content": "Center the boat on the roll. Admire the shapes of the bow and stern of the sailboat."
    }
  ]
}