{
  "url": "https://www.wikihow.com/Clean-Stainless-Steel-Refrigerators",
  "title": "How to Clean Stainless Steel Refrigerators",
  "steps": [
    {
      "title": "Choose a nonabrasive cleaning cloth.",
      "content": "Choose a nonabrasive cleaning cloth. Stainless steel scratches easily, and even a mild kitchen scrubbing pad will mar the surface. [1] X Research source Use a microfiber cloth. They work better than lint-free cotton because they leave less fibrous material on the surface of the stainless steel Clean and shine your refrigerator with paper towels. If you want a super, non- streak shine, first clean the surface with the microfiber cloth and your favorite cleaning agent, and then wipe down the refrigerator with paper towels."
    },
    {
      "title": "Clean with the grain.",
      "content": "Clean with the grain. You may have to look closely to see the grain, but you will be able to detect which way the grain is going. Rubbing against the grain, even with a microfiber cloth, will leave permanent scratches on the surface of your appliance. [2] X Research source"
    },
    {
      "title": "Use plain water.",
      "content": "Use plain water. This is the cheapest method for cleaning your refrigerator, but stubborn stains and fingerprints will require extra rubbing or the addition of a few drops of dishwashing liquid soap. If you use soap, you will have to rinse off the surface with clear, hot water before you dry it with a paper towel. (Dry it quickly so that it doesn’t streak.) [3] X Research source"
    },
    {
      "title": "Clean with oil.",
      "content": "Clean with oil. Any vegetable oil, including olive oil, will clean stainless steel. You can also use baby oil; cleaning with oil does require extra drying to soak up the oil, this cleaning method leaves a very glossy shine but a darker shade. [4] X Research source"
    },
    {
      "title": "Try white vinegar and water on your appliance.",
      "content": "Try white vinegar and water on your appliance. Mix the two together in a spray bottle, using 3 parts white vinegar and 1 part water. Spray on your refrigerator and wipe it down with paper towels. Vinegar is excellent at cutting through greasy fingerprints. [5] X Research source"
    },
    {
      "title": "Use commercial cleaners.",
      "content": "Use commercial cleaners. Some people prefer the convenience of glass cleaning products and products that are sold specifically for cleaning stainless steel appliances."
    }
  ]
}