{
  "url": "https://www.wikihow.com/Clean-a-DVD",
  "title": "How to Clean a DVD",
  "steps": [
    {
      "title": "Place the DVD label-down on a soft cloth.",
      "content": "Place the DVD label-down on a soft cloth. This can be anything from a tablecloth to a washcloth or a pillow so long as the label is facing down and the blemished side of the DVD is face-up."
    },
    {
      "title": "Gather your tools.",
      "content": "Gather your tools. In order to clean adequately your DVD, you'll need the following items: Isopropyl alcohol - Used as a cleaner. You can also use toothpaste here, but be wary of most other cleaning supplies as they have additional solvents that may harm your DVD. Water - Used to cleanse the DVD after cleaning. Microfiber cloth - Used to wipe and dry the DVD. Do not use a washcloth or paper products, as these items can leave scratches on the DVD."
    },
    {
      "title": "Review the condition of the DVD's surface.",
      "content": "Review the condition of the DVD's surface. If the DVD's surface has streaks of residue and dust on it, you'll need to give it the full treatment; however, if there are only a few dusty sections of the DVD, you should only need to rinse it and dry it. If you determine that you only need to rinse and dry the DVD, skip ahead to the \"Rinse the DVD\" step."
    },
    {
      "title": "Add isopropyl alcohol to the DVD's surface.",
      "content": "Add isopropyl alcohol to the DVD's surface. If your isopropyl alcohol container has a \"mist\" setting, mist the whole surface of the DVD; if not, a few generous drops spaced around If you're using toothpaste, place a few dots of toothpaste around the DVD's surface, then spread it out into one even coat covering the DVD's surface."
    },
    {
      "title": "Gently wipe the alcohol off of the DVD in straight lines.",
      "content": "Gently wipe the alcohol off of the DVD in straight lines. Using the microfiber cloth, brush the isopropyl alcohol outward from the center of the disc, making sure to use straight lines when doing so. The goal here is to make sure that every piece of the disc's surface is coated by isopropyl alcohol at some point, so add more if needed. If you're using toothpaste, rinse off the toothpaste with water."
    },
    {
      "title": "Rinse the DVD.",
      "content": "Rinse the DVD. Run mild-temperature water over the surface of the DVD to wash away any remains of residue, dust, and fragments of cloth."
    },
    {
      "title": "Dry off the DVD.",
      "content": "Dry off the DVD. Ideally, you'll stand the DVD upright or lean its label side against a soft object (e.g., a roll of paper towels) to allow it to dry without having to use a cloth, but if you're in a hurry, you can dry off the DVD by wiping it with the microfiber cloth using straight lines. [1] X Research source"
    },
    {
      "title": "Test the DVD.",
      "content": "Test the DVD. Insert the dry DVD into a DVD player to see if it will run correctly. If the DVD still won't play properly, you may have to take your DVD into a professional resurfacing service. Stores such as Best Buy and Radio Shack often offer this service."
    }
  ]
}