{
  "url": "https://www.wikihow.com/Create-an-Inexpensive-Photography-Lightbox",
  "title": "How to Create an Inexpensive Photography Lightbox",
  "steps": [
    {
      "title": "Choose a cardboard box large enough for the object you want to photograph.",
      "content": "Choose a cardboard box large enough for the object you want to photograph. Try and find the biggest box that you can, as this will let you take pictures of almost anything you'd need to photograph. Ask at local shops, find a box you're no longer using, or look at purchasing one from a storage company to get the perfect cardboard box. [1] X Research source If you want a lightbox that lasts longer, you can use a box made of a more sturdy material. A large wooden box or one made of an opaque plastic would also work. However, you'll likely need something stronger than a box cutter, such as a saw, to cut the lighting panels in the side."
    },
    {
      "title": "Tape up the flaps on one side.",
      "content": "Tape up the flaps on one side. Turn your cardboard box over and fold the flaps down to create a flat bottom. Use packing tape, duct tape, or something similar to hold the flaps in place and keep the box steady. Tape down the flaps on the inside of the box as well, to keep them out of your way while you work. [2] X Research source Some boxes will come with one side already held together with cardboard tabs. While this should keep the box steady as you work, it might pay to tape the edges of the box together as well for extra stability."
    },
    {
      "title": "Measure out windows on either side of your box.",
      "content": "Measure out windows on either side of your box. Place your box on its side, so that the open flaps are facing you. Use a ruler to mark a point roughly 2 inches (5.1 cm) from each edge on one side of the box. Draw a straight line with a pencil along the edges of the box to connect these points, creating a rectangle with space around the edges. Repeat on the opposite side. [3] X Research source This will be the size of the window that you will cover with a piece of fabric, parchment paper, or tissue. If you have a particularly big box, you might want to make the window smaller to ensure that you can still cover it with one piece the fabric or paper. You can also trace a window on the top of your box as well, which will allow you to light the item you're taking a picture of from above."
    },
    {
      "title": "Cut out the windows in your box.",
      "content": "Cut out the windows in your box. Use a box cutter or a sharp pair of scissors to cut along the lines you have marked. Go around each line until you can remove a piece of cardboard in the middle, leaving you with a small window. Repeat on the other side to make another window. [4] X Research source To keep the lines extra straight, hold a ruler against the pencil lines and cut along them. This won't affect the functionality of the box but will make it look better."
    },
    {
      "title": "Trim a piece of white poster board to be the same width as your box.",
      "content": "Trim a piece of white poster board to be the same width as your box. Place a piece of white poster board or a thick piece of white paper over the top of the box. Use your scissors or box cutter to trim away any edges, so that it will be able to fit on the inside of your box. The poster board should be the same width as the box, and around twice as long as the top side. [5] X Expert Source Crystal Bear Professional Photographer Expert Interview. 21 January 2021. [6] X Research source White poster board works excellently for this, as it will be smooth and will not easily crease inside the box. It should be available at your local craft store for a low price. If you can't find it, any large piece of sturdy white paper or card with a matte finish should work just as well. White poster board will give you an easy “infinity” look as if the item you are photographing is sitting in an empty space. Try using different colors to get different cool effects. The most important part of the material that you choose is that it has a matte surface. Anything that is too shiny will reflect the light and ruin the purpose of a lightbox."
    },
    {
      "title": "Tape the posterboard to the top inside edge of the lightbox.",
      "content": "Tape the posterboard to the top inside edge of the lightbox. Attach a long piece of duct or packing tape to the top edge of your poster board. Being careful not the let the tape touch anything else, press it onto the inside of your cardboard box as close to the top of the back side as possible. Use another piece of tape to hold the other end of the posterboard to the bottom of the box. [7] X Research source Avoid folding or creasing the poster board as much as possible. Try and make it bend so that you have a slight curve along the back bottom corner. Don't worry about covering the entire box, as long as you have a wide enough section that you can take a picture without seeing any of the exposed cardboard."
    },
    {
      "title": "Cut out two pieces of white fabric or tissue paper to cover the windows.",
      "content": "Cut out two pieces of white fabric or tissue paper to cover the windows. This will work to diffuse the light that shines into the lightbox, giving the whole picture even lighting. Cut out some pieces of white fabric, tissue paper, or something similar to be around 1 inch (2.5 cm) bigger on each side than the windows you have cut. [8] X Research source To make this easier, you can use the piece of cardboard you cut from the box when making the windows as a guide. Place it on the fabric or tissue paper and cut around it, leaving space on each side to attach it to the box. A smooth white fabric, tissue paper, parchment paper or anything similar will work for this. The material you choose just needs to be non-reflective, and let some but not all of the light through it."
    },
    {
      "title": "Tape or glue the fabric or tissue paper in place.",
      "content": "Tape or glue the fabric or tissue paper in place. Starting with the top edge of your chosen material, use a piece of tape or some hot glue to secure it over one of the windows. Let it drape down over the window and secure the other sides with more tape or glue. Repeat for all of the windows you have cut until all of them are covered. [9] X Research source"
    },
    {
      "title": "Put the item you want to photograph in the middle of your lightbox.",
      "content": "Put the item you want to photograph in the middle of your lightbox. Place your finished lightbox on a large flat surface, leaving space to position lights on either side. Position the item you need to photograph in the center of the white surface in your lightbox. [10] X Expert Source Crystal Bear Professional Photographer Expert Interview. 21 January 2021. [11] X Research source Use the viewfinder or screen on your camera to help position the item in the lightbox. Shift the camera and the item around until you can get a clean shot without any exposed cardboard showing. If you can't get the item or your camera positioned just right, you can always crop the photo to remove anything you don't want to be seen. You shouldn't need to do any other photo editing, but a simple crop can save you a lot of careful repositioning."
    },
    {
      "title": "Set up a lamp on either side of the lightbox.",
      "content": "Set up a lamp on either side of the lightbox. Lamps that provide directional lighting, rather than ambient lighting, will work best with your lightbox. Find as many desk lamps or other directional lights as you have windows on the lightbox. Position the lamps so that they are facing directly into the windows you have cut, and switch them on. [12] X Research source Keep your lights at least 5 inches (13 cm) away from the windows at all time, to prevent the material covering them from getting too hot. Your lights should be an even distance from the lightbox when you first turn them on. Try moving different ones further away or closer to the windows to create some more interesting lighting effects inside. Use light bulbs with a cool white light for the best results, as other types may give your images a yellowish tinge. You should be able to find cheap desk lamps or lamps that can clip onto furniture for a few dollars online or at your local homeware or office stationery store. If you don't have a good lamp, feel free to use a northern-facing window (for indirect light) and point the lightbox at the window to let the light bounce off the white paper. [13] X Expert Source Crystal Bear Professional Photographer Expert Interview. 21 January 2021."
    },
    {
      "title": "Play with the settings on your camera.",
      "content": "Play with the settings on your camera . It's not often that you'll be taking pictures of something so evenly and brightly lit, so your first pictures might end up being too bright or entirely the wrong color! Change the shutter speed, ISO, and white balance settings on your camera until your photos look normal. [14] X Research source If you're using a smartphone camera, or a camera with an automatic mode, you shouldn't need to touch the settings at all. Photos that look too yellow or blue are normally a sign that your white balance settings aren't right. If your photos are too dark or too bright, try adjusting the exposure by changing the ISO, shutter speed, or aperture. Keep on trying until you get a perfect photo!"
    },
    {
      "title": "Take the picture.",
      "content": "Take the picture. Once you've got your item lined up and your camera settings perfect, it's time to take the picture. Move the camera around so that there's nothing other than the white background in the shot, hold it steady, and snap a few pictures! [15] X Research source Use the flaps of cardboard that are left open to block any light shining from the lamps directly into the camera. Any light that's not going through the windows might create a lens flare and reduce the effect of a photography lightbox."
    }
  ]
}