{
  "url": "https://www.wikihow.com/Roll-a-Filter-Cigarette-by-Hand-That-Requires-Little-Effort",
  "title": "How to Roll a Filter Cigarette by Hand That Requires Little Effort",
  "steps": [
    {
      "title": "Gather your equipment.",
      "content": "Gather your equipment. This includes Rolling tobacco, papers and filter tips."
    },
    {
      "title": "Take some tobacco (you will learn to guess the right amount in time, but in the beginning, its better to take out more than you need).",
      "content": "Take some tobacco (you will learn to guess the right amount in time, but in the beginning, its better to take out more than you need). Make sure that the tobacco is not too compact, tear it apart lightly so it still forms one connected unit."
    },
    {
      "title": "Roughly form the tobacco in the shape and length of a cigarette.",
      "content": "Roughly form the tobacco in the shape and length of a cigarette."
    },
    {
      "title": "Place the tobacco on the paper, making sure the side of the adhesive faces upwards and is on the side sticking away from you.",
      "content": "Place the tobacco on the paper, making sure the side of the adhesive faces upwards and is on the side sticking away from you."
    },
    {
      "title": "Insert the filter tip and begin rolling the paper with the tobacco inside, not yet completely folding the paper around the tobacco.",
      "content": "Insert the filter tip and begin rolling the paper with the tobacco inside, not yet completely folding the paper around the tobacco. It is important not to work with too much pressure of your fingers, but with more of a light pull towards both ends of the cigarette. Make sure you work with a lot of surface of your fingers, this will keep the tobacco from forming more compressed areas."
    },
    {
      "title": "Always keep your fingers on the filter to make sure the paper is folded exactly around the filters form, not leaving any space for air to bypass the filter.",
      "content": "Always keep your fingers on the filter to make sure the paper is folded exactly around the filters form, not leaving any space for air to bypass the filter."
    },
    {
      "title": "Fold the non-adhesive side of the paper completely around the tobacco, and again, do not work with pressure.",
      "content": "Fold the non-adhesive side of the paper completely around the tobacco, and again, do not work with pressure. Apply a light pull to both ends of the cigarette with your thumbs, this will make sure the end of the paper that is folded in does not crack or fold. If the paper is not folded in neatly your cigarette will not burn evenly."
    },
    {
      "title": "After you folded the paper in, just roll it more in the same direction until the adhesive gum strip is sticking out just a little bit.",
      "content": "After you folded the paper in, just roll it more in the same direction until the adhesive gum strip is sticking out just a little bit."
    },
    {
      "title": "Lick the gum strip with not too much saliva.",
      "content": "Lick the gum strip with not too much saliva. The amount that normally sticks to your tongue will work just fine."
    },
    {
      "title": "Finish rolling in one smooth motion, supporting the adhesive side from behind with a broad index or middle finger surface.",
      "content": "Finish rolling in one smooth motion, supporting the adhesive side from behind with a broad index or middle finger surface. This will again prevent crackling or folding the paper."
    }
  ]
}