{
  "url": "https://www.wikihow.com/Create-a-DIY-Photo-Album",
  "title": "How to Create a DIY Photo Album",
  "steps": [
    {
      "title": "Stock up on paper.",
      "content": "Stock up on paper. Go to your local craft store to purchase paper for your covers and the subsequent album pages. [1] X Research source Create your covers with a decorative heavy paper. The cover sheets should be made of heavier paper like cardstock and should have distinguishing details like patterned paper. Create the album pages with solid sheets of paper that are one color. Sheets should have measurements of 12x12."
    },
    {
      "title": "Cut the 12x12 solid pieces of paper.",
      "content": "Cut the 12x12 solid pieces of paper. Divide the 12x12 sheets evenly in half to create two sections of 6x12 pieces. On each 6x12 piece, use a ruler to measure 3 sections that are 4 inches in length. Fold the 6x12 piece against each of the three 4-inch lines and press it firmly to make the folds smooth. Measure and cut the heavy cover pages into two 4x6 cut pieces."
    },
    {
      "title": "Tape the album together.",
      "content": "Tape the album together. Take both of the 6x12 inch sections of paper at their short ends and secure with tape. Fold the paper up like an accordion to discern where the album’s front and back covers will be. [2] X Research source"
    },
    {
      "title": "Glue the decorative sheets to the album.",
      "content": "Glue the decorative sheets to the album. The heavy decorative paper from earlier will act as the front and back covers of the album. Place glue at the corners and sides of the page and place them firmly at the front and back of the album pages."
    },
    {
      "title": "Add your photos.",
      "content": "Add your photos. Arrange photos on the remaining open pages of the album, placing them on available sheet: front and back. Do not glue photos onto the pages. Instead use photo mount squares on each of the photo’s corners to ensure that they are secure on their respective pages."
    },
    {
      "title": "Cut a piece of ribbon for your bow.",
      "content": "Cut a piece of ribbon for your bow. Make sure that the ribbon is long enough to wrap around the entire length of the album when tying it. Use super adhesive glue to secure the ribbon on the back cover of the album. Tie the ribbon’s ends into a simple bow. [3] X Research source Use your creativity to add designs. Use a glitter marker or a gold permanent marker and fill the cover with different drawings or words that have to do with who you’re creating the album for. Add stickers to the front and back if you desire to or even additional photos. As an added personal touch, glue a metal label holder to the front cover to write a name or date."
    },
    {
      "title": "Purchase brown lunch bags.",
      "content": "Purchase brown lunch bags. Brown paper bags can be bought at either your local grocery store or at a craft store. For the pages, be sure to have at least 3-4 bags to use."
    },
    {
      "title": "Stack the 3-4 brown paper bags together.",
      "content": "Stack the 3-4 brown paper bags together. Place them so that the side facing up alternates: one side opened, the next side closed. [4] X Research source"
    },
    {
      "title": "Fold the stacked bags in half.",
      "content": "Fold the stacked bags in half. Form the folded bags into a book. Use a hole puncher to punch two holes into the folded paper book: one at the top left corner and one at the bottom left corner. Thread ribbon into each of the holes and bring the ends together in the front of the album. Tie a bow out of the ribbon."
    },
    {
      "title": "Fill the paper bag pages with photos.",
      "content": "Fill the paper bag pages with photos. Tape or glue the 4x6 photos into place. One photo should fit squarely on each page, front and back. A great way to arrange them is chronologically, but you can also get creative and place photos together that are similar in color."
    },
    {
      "title": "Decorate the front and back covers of the album.",
      "content": "Decorate the front and back covers of the album. Use leftover wrapping paper or decorative scrapbook paper to add design to the covers. Place dots of glue on the corners of the paper and place firmly and smoothly against the covers. Write on the front of the book with a colorful marker to use cursive penmanship as a way to name it. Place another photo on the front cover to give a hint of what the album will be about and the kinds of photos it holds."
    },
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. Have at least 10 printed wallet size photos, 10 blank 3x5 index cards, a ribbon or binding material, a felt tip pen marker, and a hole puncher. [5] X Research source"
    },
    {
      "title": "Apply rubber cement glue on the back of the photos.",
      "content": "Apply rubber cement glue on the back of the photos. Turn the blank index card so that it is on its longest side in landscape position. The wallet sized photos will be placed portrait style on the cards. Stick the photo to the right sides of your blank index cards."
    },
    {
      "title": "Write details depicting the photo on the left side of the card.",
      "content": "Write details depicting the photo on the left side of the card. Use this space to write about the people in the photo, the date of the event, or just a title for the photo."
    },
    {
      "title": "Place a blank index card in the immediate front and back to act as covers for the album.",
      "content": "Place a blank index card in the immediate front and back to act as covers for the album. Decorate the front with markers or keep the look sleek and clean by placing a simple monogram on it by using stencils for lettering."
    },
    {
      "title": "Punch holes at the top and bottom of your booklet.",
      "content": "Punch holes at the top and bottom of your booklet. Place the hole at about ½ an inch from the very bottom and very top of the book. Through those holes, thread a ribbon and tie it into a bow."
    }
  ]
}