{
  "url": "https://www.wikihow.com/Make-a-Baby-Sling",
  "title": "How to Make 4 Different Types of Baby Wrap Carriers",
  "steps": [
    {
      "title": "Use at least 2 yd (1.8 m) of a woven cotton fabric.",
      "content": "Use at least 2 yd (1.8 m) of a woven cotton fabric. Clothing designer Daniela Gutierrez-Diaz says to choose a fabric with “some softness… but that doesn’t stretch a lot.” [1] X Expert Source Daniela Gutierrez-Diaz Clothing Designer Expert Interview. 3 July 2019. Woven linen and cotton are soft, breathable fabrics that can be strong enough to support your baby's weight without tearing. Buy 2–2.5 yd (1.8–2.3 m) of material that's at least 36 in (91 cm) wide. Add 18 in (46 cm) of material for every size above a US large to ensure you get a comfy fit. [2] X Research source Try to avoid using anything too stretchy, like jersey or other knit fabrics. Knit fabrics can stretch out and lose their shape after a while, so they might not hold your baby safely. [3] X Research source Pick a fabric in a fun color that matches your personality. If you're really crafty, buy extra material to make matching clothes or cloth diapers for your baby!"
    },
    {
      "title": "Fold the blanket into a triangle and pull one corner over your shoulder.",
      "content": "Fold the blanket into a triangle and pull one corner over your shoulder. Take a square-shaped blanket, bed sheet, or large scarf and fold it in half diagonally to create a triangle. Lay the triangle behind your back with the longest side facing upward. Pull one corner over your right shoulder and the other corner under your left shoulder. [4] X Research source Make sure that the tip of the triangle is against your left hip or leg. [5] X Research source If you’re using a scarf: Leave it unfolded and stretch one side over your right shoulder and the other under your left arm."
    },
    {
      "title": "Pull the right corner over the left corner and tie them into a knot.",
      "content": "Pull the right corner over the left corner and tie them into a knot. Pull the left corner of the blanket behind the right corner laying over your shoulder. Thread the left corner over and behind the right corner. Cross the two corners over each other and thread one of them through the loop in the center to tie an overhand knot . Pull tight on both corners to finish the knot. [6] X Research source An overhand knot is the same as the first tie you make when tying your shoelaces. This creates an adjustable knot. [7] X Research source To make it non-adjustable, tie another overhand knot."
    },
    {
      "title": "Tuck the tip of the triangle under the sling to create a pouch.",
      "content": "Tuck the tip of the triangle under the sling to create a pouch. Adjust the sling to your liking by sliding the knot up or down the side of the blanket over your shoulder. [8] X Research source Fold the tip of the triangle hanging by your leg up and into the sling so it lies against your chest. This creates a small pouch for your baby to sit inside. [9] X Research source If you’re using a scarf: Open the long side of the scarf that stretches over your chest so your baby can sit snugly inside."
    },
    {
      "title": "Tuck your baby’s legs in and slide the sling around their back.",
      "content": "Tuck your baby’s legs in and slide the sling around their back. Hold the tip of the triangle against your chest. [10] X Research source For newborns, lay your baby against your left shoulder, tuck their legs underneath their bottom, and slide them into the sling. [11] X Research source If your baby is older, hold them against your chest, pull their legs through both sides of the sling, and pull the fabric over their back. [12] X Research source If you’re using a scarf: Tuck the bottom of the scarf up under your newborn’s legs or around your baby’s bottom so they’re supported underneath. Adjust the size of the carrier so your baby sits snugly against your chest by pulling up on the knot and tightening the corners of the blanket. [13] X Research source"
    },
    {
      "title": "Purchase 2 rings designed for a baby sling.",
      "content": "Purchase 2 rings designed for a baby sling. Purchase rings specifically meant for baby slings—these are strong enough to hold your baby's weight, and they're made of materials that are safe for a baby. [14] X Research source Buy rings that are 2.5–3.5 in (6.4–8.9 cm) in diameter and .25–.5 in (0.64–1.27 cm) thick. If you're using a heavy-weight or thick fabric, opt for the bigger 3.5 in (8.9 cm) rings."
    },
    {
      "title": "Iron and hem the edges of the fabric to keep it from unraveling.",
      "content": "Iron and hem the edges of the fabric to keep it from unraveling. Iron the fabric to get rid of the creases, wrinkles, and folds. Starting with the longer sides of the fabric, fold the edges over .25 in (0.64 cm), then iron and pin them down. [15] X Research source Sew a catch or zig-zag stitch along the folded edge along each side. [16] X Research source To hem by hand, pierce the needle through the back of the folded edge and pull the thread through. Push the needle in, up, and through the main piece of fabric. Repeat down each side. [17] X Research source To hem with a sewing machine, set your machine to a zig-zag stitch and sew along where the folded edge meets the main stretch of fabric."
    },
    {
      "title": "Slide the rings 15 in (38 cm) down one of the short sides.",
      "content": "Slide the rings 15 in (38 cm) down one of the short sides. Lay your fabric flat and use a ruler or measuring tape to mark 15 in (38 cm) down from one of the short sides of the fabric with a pin. [18] X Research source Slide both of the rings down the fabric, folding the fabric over the ring’s edges so that one end meets the pin. [19] X Research source As you pull the fabric through, make sure it doesn’t get twisted so you can sew the two pieces together evenly."
    },
    {
      "title": "Pin both layers of fabric together and secure it with 3 layers of stitches.",
      "content": "Pin both layers of fabric together and secure it with 3 layers of stitches. Lay the fabric flat on a table and pin the folded layer to the main stretch of fabric along the 15 in (38 cm) mark. Sew a straight line across both layers of fabric, removing the pins as you go. [20] X Research source Sew a second line about .25 in (0.64 cm) above the first line, and the third .25 in (0.64 cm) above that. To sew a straight stitch by hand, pierce the needle through both layers of fabric, then poke it through about .25 in (0.64 cm) from the first hole. Pull the thread tight, then repeat along the length of the fabric. The three layers of stitches support your baby’s weight and ensure that the sling won’t come apart while wearing it for a long time. No-sew ring sling: Skip this step. The short length of fabric will tuck into the longer side, and the weight of the baby and the friction of the two layers will hold the rings in place. [21] X Research source"
    },
    {
      "title": "Lay the rings by your collarbone and grab the top edge of the fabric.",
      "content": "Lay the rings by your collarbone and grab the top edge of the fabric. Hold the rings next to your collarbone, with the fabric over your shoulder. With your other hand, grab the top edge of the fabric behind you, making sure it doesn’t get twisted behind your back. [22] X Research source As you wrap your sling, try not to slide the rings too far up so they won’t put pressure on your shoulder."
    },
    {
      "title": "Pull the fabric up through the rings, then down between the 2 rings.",
      "content": "Pull the fabric up through the rings, then down between the 2 rings. Bunch up the fabric with your hand so the same side faces out. Thread the fabric through the two rings, leaving enough slack in front of you to hold your baby. [23] X Research source Gather the fabric poking out of the rings and thread it between the two rings and inside the bottom ring. [24] X Research source Keep your thumb in the loop of fabric around the rings and try to avoid pulling the fabric tight so you can adjust it when you put your baby inside. [25] X Research source Make sure the pouch in front of you is not too loose that your baby won’t fit snugly inside, but not too tight that they won’t fit safely."
    },
    {
      "title": "Put your baby on your chest and slide them into the sling feet-first.",
      "content": "Put your baby on your chest and slide them into the sling feet-first. Slide your baby into the sling so the fabric is under their bottom and their legs are hanging out. Pull the fabric up over their back and make sure the fabric stretches from knee to knee. [26] X Research source Pull the hanging end of the fabric straight out in front of you to tighten the sling. [27] X Research source Gently tug at the side of the fabric wrapped around you and tighten the sling to make sure it’s snug all the way around your baby. [28] X Research source To give more support to your baby’s head, pull the sling up so it’s above their neck. Twist the hanging end of the fabric and push it up under the extra slack above their neck. [29] X Research source To make sure your baby is secure and comfortable, double-check that their knees are higher than their bottom."
    },
    {
      "title": "Cut straight across under the sleeves of 3 shirts to create tubes.",
      "content": "Cut straight across under the sleeves of 3 shirts to create tubes. Using a pair of fabric scissors, cut each shirt horizontally under the sleeves to create a tube out of the body. [30] X Research source You can also use 3 tube top shirts. [31] X Research source 2 of the shirts will stretch across your shoulders and 1 will stretch across the baby’s back, almost like a front wrap cross carrier."
    },
    {
      "title": "Wear 2 of the tubes over your shoulders and step into the other tube.",
      "content": "Wear 2 of the tubes over your shoulders and step into the other tube. Pull one tube over your right arm and head, almost like a sash. Poke your head and left harm through the other tube, making sure both tubes are flat and untwisted against your chest. [32] X Research source Put both of your legs through the third tube and pull it up over your stomach. [33] X Research source You’ll pull the third tube up over your baby in the next step. Make sure the T-shirts aren't stretched out or torn so they can fit snugly on your body."
    },
    {
      "title": "Slide your baby under the 2 crossed tubes and pull the third tube up.",
      "content": "Slide your baby under the 2 crossed tubes and pull the third tube up. Lift your baby high up on your chest and pull the 2 tubes away from your body. Slide your baby into the fabric, making sure their legs come out between the two fabric sections on either side. Pull the third tube up over your baby’s legs and back for extra support. [34] X Research source Make sure their arms are tucked into the 2 shirts. The material will form an “X” under your baby’s bottom and back, and their legs will dangle in an “M”-shape."
    },
    {
      "title": "Place the fabric’s center in front and pull one side over your shoulder.",
      "content": "Place the fabric’s center in front and pull one side over your shoulder. With your right hand, hold the top edge of the center of the fabric against the middle of your chest. With the other hand, grab one side of the fabric and pull it over your left shoulder. Shift your right hand over from the center of the fabric to the other side. [35] X Research source The left tail of the fabric will be over the stretch of fabric over your chest. This wrap works well for newborns and babies."
    },
    {
      "title": "Pull the other side around your back and over your other shoulder.",
      "content": "Pull the other side around your back and over your other shoulder. Pull the fabric stretching over your chest around your back and over your right shoulder. [36] X Research source Make sure both sides of the fabric lie flat and untwisted against your back. This will form a stretch of fabric around your torso with the ends hanging down from each shoulder. [37] X Research source This will also create an “X” shape behind your back."
    },
    {
      "title": "Slide your baby through the center fabric and pull it over their back.",
      "content": "Slide your baby through the center fabric and pull it over their back. Gather the fabric against your chest to create a pouch, pulling on the hanging ends to adjust the slack. [38] X Research source Hold the baby against one of your shoulders, poke your other hand through the pouch, and pull their legs through it so their bottom is sitting on the fabric. Pull the wrap up over their back. [39] X Research source Stuff the bottom side of the fabric underneath your baby and against your chest so their knees are above their bottom. [40] X Research source"
    },
    {
      "title": "Pull on the hanging ends and cross them under the baby’s bottom.",
      "content": "Pull on the hanging ends and cross them under the baby’s bottom. Starting with the end under the “X” on your back, pull tightly and place it between your knees. Tug on the other hanging end to tighten it, then pull on both ends. [41] X Research source Cross the ends over each other under the baby’s bottom so they go under the baby’s legs. [42] X Research source Before crossing the ends, tug on the center and middle edges of each end so they’re tight. Try not to tug too much on the outer edges so you have a pocket for the baby’s bottom. [43] X Research source If your newborn is smaller, twist the ends together under the baby’s bottom and then wrap them under the baby’s legs so it’s more comfortable. [44] X Research source"
    },
    {
      "title": "Tie the ends in a double knot behind your back.",
      "content": "Tie the ends in a double knot behind your back. Cross the two ends over each other behind your back and thread the bottom end through the hole between your back and the fabric. Pull tightly, then repeat the knot to create a double overhand knot. [45] X Research source With your thumbs, pull each piece of fabric on your shoulder out over your arms, then fold the fabric back over your shoulder to create a comfortable shoulder pad on each side. [46] X Research source"
    },
    {
      "title": "Follow the T.I.C.K.S. checklist so your baby breathes comfortably.",
      "content": "Follow the T.I.C.K.S. checklist so your baby breathes comfortably. If babies are not put into slings correctly, they could be at risk of suffocation. [47] X Research source When you’re wearing a carrier or sling, make sure that it’s: [48] X Research source Tight: The sling is tight enough to hug your baby close to you. Too much slack can cause your baby to slump down in the sling, restricting their breathing and pulling on your back. In view at all times: You can see your baby’s face by glancing down. The fabric isn’t over their face so they can breathe freely. Close enough to kiss: You can kiss your baby on the head or forehead by tipping your head slightly forward. Keeping their chin off their chest: Make sure there’s always at least a finger of space under your baby’s chin so their breathing isn’t restricted. Supporting their back: The baby’s back is supported with their tummy and chest pressed against you. If the sling is too loose, they may slump, which can restrict their breathing."
    },
    {
      "title": "Make sure your baby’s knees are above their bottom.",
      "content": "Make sure your baby’s knees are above their bottom. When wearing a sling, make sure that your baby’s legs are straddling your body. Their knees need to be spread apart, so their thighs are supported and their hips are bent. [49] X Research source This encourages proper hip development and reduces the risk of issues like development dysplasia of the hip."
    },
    {
      "title": "Hold onto something stable and bend down at your knees.",
      "content": "Hold onto something stable and bend down at your knees. If you need to bend down to pick something up, hold onto something stable, like a pole or table. Bend at your knees, not your waist, to prevent your baby from falling out of the sling. [50] X Research source Try to avoid wearing a front-facing sling when cooking to prevent accidentally burning your baby. Wear shoes that are easy to walk in to prevent tripping while wearing the sling."
    }
  ]
}