{
  "url": "https://www.wikihow.com/Beat-the-End-in-Metal-Gear-Solid-3",
  "title": "How to Beat the End in Metal Gear Solid 3",
  "steps": [
    {
      "title": "Follow the darts.",
      "content": "Follow the darts. Let him shoot you once; then check your body to see where the dart came from. If the dart is stuck on your left side, with a right-ish angle, then he shot you from the right of where you stand. If he shot you on the left side, but the dart angle is left-ish, then he is hiding somewhere on your left. Once you find the pattern, it will become very easy to end this boss battle. Act immediately. Once you're out of the menu, spot him and shoot him. Don't give him the time to hide again. Also remember, these examples are using a first person perspective of snake; when you use the heal menu, from your point of view, the right-ish angle will be left-ish, like when you see yourself in the mirror."
    },
    {
      "title": "Don't keep looking at him with the binoculars too much.",
      "content": "Don't keep looking at him with the binoculars too much. It's fun, but it can easily blow your cover. If he detects you, you may as well as run before he catches you."
    },
    {
      "title": "Always keep your anti-personnel sensor (AP sensor) equipped.",
      "content": "Always keep your anti-personnel sensor (AP sensor) equipped. This one vibrates your joystick only when a human is near you and also makes a sound continuously. The more the human is near to you, the faster the sound becomes."
    },
    {
      "title": "Use the map when fighting the end boss.",
      "content": "Use the map when fighting the end boss. There are sniping points marked in a white circle. When the end shoots you with a tranquilizer dart, check out the map, one of the white circles will turn red, that's where he is. shoot him with a SVD sniper rifle or anything."
    },
    {
      "title": "Don't leave footprints!.",
      "content": "Don't leave footprints!. Did you know the end also keeps an eye on your footprints? Well, He does. He tracks all the way where you are and freezes you from behind. If frozen from behind, you won't be able to move."
    },
    {
      "title": "Take advantage of his pet parrot.",
      "content": "Take advantage of his pet parrot. If you find a colourful parrot somewhere it's his and it means a sign of him nearby. From this point you have a number of choices, either kill the parrot or capture it alive by shooting the EZ gun or MK22 at it. Eat the parrot if you want (which is utterly pointless). It is horrible. Covers a barely noticeable amount of stamina. If you captured it alive, and cannot find the end, throw the parrot somewhere. Then use the Directional microphone, you will hear the end scolding loudly to his parrot. Sneak up to him or attack him once you've pin pointed his location."
    },
    {
      "title": "Use thermal goggles.",
      "content": "Use thermal goggles. Whenever you notice a bit of whiteness, check it up using the binoculars. There's a chance you'll find him!."
    },
    {
      "title": "Try the crocodile cap prank.",
      "content": "Try the crocodile cap prank. You will find it in the swamp after you meet Eva the first time. Keep swimming around until you find logs blocking your way, go under it by diving using the X button. You will find a tree you can climb up. Climb up the tree and you must hand on the branch before you reach the rope tied to it. Keep going until you find another rope below. Let go from the rope and quickly press triangle button when you are about to reach the other rope go and you will end up on a hill. There it is. In Sokrovenno west where the river is, crawl there and equip the crocodile cap. The End will think you are a crocodile and won't shoot. Works only once, and one more thing; you can only equip the crocodile cap in the items menu. where you equip the thermal goggles, AP sensor Etc."
    }
  ]
}