{
  "url": "https://www.wikihow.com/Calculate-Amortization",
  "title": "How to Calculate Amortization",
  "steps": [
    {
      "title": "Gather the information you need to calculate the loan’s amortization.",
      "content": "Gather the information you need to calculate the loan’s amortization. You’ll need the principal amount and the interest rate. To calculate amortization, you also need the term of the loan and the payment amount each period. In this case, you will calculate monthly amortization. [1] X Research source The principal is the current loan amount. For example, say you are paying off a 30-year mortgage. If your loan has a balance outstanding of $100,000 (not counting any accrued interest), that is the principal. Your interest rate (6%) is the annual rate on the loan. To calculate amortization, you will convert the annual interest rate into a monthly rate. The term of the loan is 360 months (30 years). Since amortization is a monthly calculation in this example, the term is stated in months, not years. Your monthly payment is $599.55. The dollar amount of the payment stays constant. However, the portion of the payment that is principal or interest will change. You will mostly be paying off the interest when you start making payments, and then your payments will start to go to the balance."
    },
    {
      "title": "Set up a spreadsheet.",
      "content": "Set up a spreadsheet. This calculation has a few moving parts and would best be accomplished in a spreadsheet where you've pre-loaded all your relevant info into column headings like: Principal, Interest Payment, Principal Payment, and Ending Principal. The total number of rows below those headings would be 360 to account for each monthly payment. A spreadsheet makes the calculations significantly quicker because, if done correctly, you only have to enter a given equation once (or twice, as when you are using the previous month's calculation to fuel all subsequent calculations). Once entered correctly, simply drag your equation(s) down through the remaining cells to compute amortization over the life of the loan. Even better is to set aside a separate set of columns and input your main loan variables (e.g. monthly payment, interest rate) as this will allow you to quickly visualize how changes will affect each other over the life of the loan. You can also try an online amortization calculator."
    },
    {
      "title": "Calculate the interest portion of the monthly payment for month one.",
      "content": "Calculate the interest portion of the monthly payment for month one. This calculation requires several steps. You need to convert the interest rate to a monthly amount. The monthly rate is used to compute how much interest you will pay for the month. [2] X Research source Loans that amortize, such as your home mortgage or car loan, require a monthly payment. As a result, you need to compute the interest and principal portion of each payment on a monthly basis. Convert the interest rate to a monthly rate. That amount is: (6% divided by 12 = 0.005 monthly rate). Multiply the principal amount by the monthly interest rate: ($100,000 principal multiplied by 0.005 = $500 month’s interest). You can use the equation: I=P*r*t, where I=Interest, P=principal, r=rate, and t=time."
    },
    {
      "title": "Compute the principal portion of the payment for month one.",
      "content": "Compute the principal portion of the payment for month one. Subtract the interest for the month from the first payment to compute the principal payment amount. [3] X Research source Subtract the month’s interest from the payment amount to calculate the principal payment: ($599.55 payment - $500 interest = $99.55 principal payment). As more principal is repaid, the interest due on your principal balance each month will decline. A larger portion of each monthly payment will go toward principal repayment."
    },
    {
      "title": "Use the new principal amount at the end of month one to calculate amortization for month two.",
      "content": "Use the new principal amount at the end of month one to calculate amortization for month two. Each time you calculate amortization, you subtract the principal amount repaid in the prior month. [4] X Research source Calculate the principal amount for month two: ($100,000 principal - $99.55 principal payment = $99,900.45). Compute the interest for month two: ($99,900.45 principal X 0.005 = $499.50)."
    },
    {
      "title": "Determine the principal repayment for month two.",
      "content": "Determine the principal repayment for month two. Just as you did in month one, your interest for the month is subtracted from the total monthly loan payment. The remaining amount is your principal repayment for the month. [5] X Research source Calculate the principal payment in month two: ($599.55 - $499.50 = $100.05). The principal repayment in month two ($100.05) is larger than month one ($99.55). Since the total principal balance declines each month, you pay less interest in the balance. In month one the interest was $500. In month two, the interest was only $499.50. As the required interest payment declines, the portion of the payment that goes toward principal increases."
    },
    {
      "title": "Analyze the trend that occurs over time.",
      "content": "Analyze the trend that occurs over time. You can see that the loan’s principal is reduced each month. Because the principal amount declines, the interest computed on the lower principal amount also goes down. Over time, a growing amount of each monthly payment goes toward principal. [6] X Research source Calculate the new principal balance for month three’s interest calculation: ($99,900.45 - $100.05 = $99,800.40). Compute interest for month three: ($99,800.40 X 0.005 monthly interest = $499). Calculate the principal payment in month three: ($599.55 monthly payment - $499 interest in month three = $100.55)."
    },
    {
      "title": "Consider the impact of amortization at the end of the loan’s term.",
      "content": "Consider the impact of amortization at the end of the loan’s term. You’ll see that, over time, the amount of interest charged each month declines. The principal portion of each payment increases over time as your remaining balance gets smaller. [7] X Research source Interest payments decline to nearly zero. In the last month of the loan’s term, the interest payment is $2.98. By the last period of the term, the principal portion of the payment ($596.37) is close to the entire payment amount. The principal amount still owed is $0 at the end of the term."
    },
    {
      "title": "Use the concept of amortization to make smart choices about your finances.",
      "content": "Use the concept of amortization to make smart choices about your finances. Since your mortgage loan and many car loans use amortization, you need to understand this concept. You can use your knowledge of amortization to manage your personal debts. [8] X Research source Whenever possible, make extra payments to reduce the principal amount of your loan faster. The faster you’re able to reduce principal, the less total interest you will pay over the loan term. Consider the interest rate on the debts you have outstanding. Your extra payment will have the biggest impact on the loan with the highest interest rate. You want to reduce the principal amount for the debt with the highest interest rate. You can find loan amortization calculators on the Internet. Use a calculator to compute the interest you will save if you make extra payments. Say, for example, that your extra payment reduces your principal from $10,000 to $9,900. Use the $10,000 figure and calculate your amortization over the remaining term of the loan. Change the principal from $10,000 to $9,900 and run the calculation again. Take a look at the total interest paid over the life of the loan. You’ll see a difference, based on the extra $100 principal payment."
    }
  ]
}