{
  "url": "https://www.wikihow.com/Eat-Sea-Moss",
  "title": "How to Eat Sea Moss",
  "steps": [
    {
      "title": "The easiest way to eat sea moss is by adding gel to different foods.",
      "content": "The easiest way to eat sea moss is by adding gel to different foods. You’ll need dried sea moss, water, and a blender to prepare it yourself. Soak 1/2 cup (100 g) of sea moss in water for 4 hours. Then, rinse the moss off with tap water and boil it in a pot with the lid closed for 10-12 minutes. Then, put the softened moss in a blender and blend until the gel is smooth. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Once made, your gel should last refrigerated for up to 20 days."
    },
    {
      "title": "Sea moss has lots of nutrients, but it’s unhealthy to overindulge.",
      "content": "Sea moss has lots of nutrients, but it’s unhealthy to overindulge. This is because sea moss also contains iodine, which your body needs to maintain a healthy thyroid. However, too much iodine can damage your thyroid. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Therefore, it’s best to stick to 1–2 US tbsp (15–30 mL) a day and consult your doctor if you have concerns."
    },
    {
      "title": "Sea moss becomes a tasteless (but healthy) ingredient in fruit smoothies.",
      "content": "Sea moss becomes a tasteless (but healthy) ingredient in fruit smoothies. Blend it together with any of your other favorite smoothie ingredients for a quick nutrient boost. It’ll pair seamlessly with any smoothie because it has such a neutral flavor on its own. Mix and match smoothie ingredients including (but not limited to) apples, bananas, blueberries, kale, mango, pineapple, raspberries, strawberries, or spinach. [3] X Research source For example, you could make a classic banana smoothie and blend in 2 US tbsp (30 mL) of sea moss gel as well. Make a refreshing green smoothie and add sea moss gel to that."
    },
    {
      "title": "Stir a tablespoon of gel into your juice of choice.",
      "content": "Stir a tablespoon of gel into your juice of choice. Any kind of juice can be combined with sea moss, from pineapple to orange and even lemonade (either fresh or made from powder). Simply grab a glass, measure out 1–2 US tbsp (15–30 mL) of sea moss gel into the glass, and then pour in the juice. Mix them until the juice and gel are well-blended, add some ice if desired, and enjoy. If you want to get fancy with your juice concoctions, sea moss and watermelon juice is another popular choice, with a few mint leaves and lime as garnish."
    },
    {
      "title": "Gelatin-like sea moss gel is a fantastic thickening agent.",
      "content": "Gelatin-like sea moss gel is a fantastic thickening agent. Get creative and add sea moss gel when you're making your favorite sauce , soup, stew, and even curry recipes! Add a couple of tablespoons of sea moss to thicken the soup up and make it more creamy. You can even use the gel in soups to replace regular gelatin (which is made from animal parts) for a healthy vegan gluten-free option. [4] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source Add about 1 tsp (4.9 mL) of gel per 1 c (240 mL) of broth when making soup. [5] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source For sauces, add 2 tsp (9.9 mL) of gel per 1 c (240 mL) of broth (since they tend to be thicker)."
    },
    {
      "title": "This tasty, healthy drink has a fast prep time, and it’s also vegan.",
      "content": "This tasty, healthy drink has a fast prep time, and it’s also vegan. Blend 2 US tbsp (30 mL) of sea moss gel, 1 1/4 c (296 mL) of non-dairy milk, 4 pitted dates, 1/2 tsp (2.8 g) each of cinnamon and vanilla extract, and 1/4 tsp (1.4 g) of nutmeg. If the drink is too thick, you can also add more milk until it reaches a consistency you like. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Feel free to sprinkle a little cinnamon on top as garnish, too!"
    },
    {
      "title": "Replace fruit pectin or cornstarch when making jams and jellies.",
      "content": "Replace fruit pectin or cornstarch when making jams and jellies. Since sea moss gel is such a great thickener, you can also use it when you're making homemade jam .The use of such thickeners in jam is optional, as it can be made with fruit, sugar, butter, and lemon juice alone, but a proper thickener can help you get a jam-like consistency quicker."
    },
    {
      "title": "Add sea moss gel when you're making any homemade ice cream recipe.",
      "content": "Add sea moss gel when you're making any homemade ice cream recipe . You can also make special Irish moss ice cream by combining 2 c (470 mL) of the aforementioned Irish moss drink with 1 c (240 mL) of heavy whipping cream and sugar in an ice cream maker. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Let the Irish moss ice cream churn for 30 minutes and set it in the freezer for 4-6 hours before serving. This gives you a healthy twist to any ice cream dessert, and you won’t be able to taste the seaweed addition at all."
    },
    {
      "title": "Replace the gelatin ingredient with sea moss gel.",
      "content": "Replace the gelatin ingredient with sea moss gel. For sea moss jello, you’ll have to make the jello from scratch rather than from a box. However, it’s easy to incorporate sea moss into jello. Look at the recipe you’re using to see how much gelatin it calls for, and replace the gelatin with sea moss gel instead. You can also whip up pudding with sea moss gel. As a thickening agent, it can replace the cornstarch that is typically used in puddings."
    },
    {
      "title": "You can make a basic tea from the gel or add other herbs too.",
      "content": "You can make a basic tea from the gel or add other herbs too. The basic tea is easy: just bring your water to boil in a pot, and then stir sea moss gel into the pot—1 part gel to every 4 parts water. From there, you can add in any other spices that you like in your tea, and drink it. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For example, you can steep a teabag of your favorite herbal mix in the sea moss tea. Popular herbs include hibiscus, lemon balm, ginger, rooibos, mint, and chamomile."
    },
    {
      "title": "Dry powder can be an alternative to gel if desired.",
      "content": "Dry powder can be an alternative to gel if desired. Sea moss powder is easily purchased online (on Amazon and other retailers, for example) for a quick alternative to sea moss gel. You can also purchase whole dried sea moss and blend it into your smoothies and beverages. Sea moss powder is also available as pill supplements, which you can swallow rather than mixing the moss into your food. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}