{
  "url": "https://www.wikihow.com/Cast-Oculus-Quest-2-to-Samsung-TV",
  "title": "How to Cast Your Oculus Quest to Your Samsung TV",
  "steps": [
    {
      "title": "Purchase a Chromecast.",
      "content": "Purchase a Chromecast. Chromecasts are streaming devices you can use to cast your phone (and your Oculus Quest 2) to your TV. There are different Chromecast models. They start at $29. You can purchase one from the Google Store online or from a local electronics store. [1] X Research source"
    },
    {
      "title": "Connect the Chromecast to your TV.",
      "content": "Connect the Chromecast to your TV. Chromecasts are tiny circular devices that connect directly to an HDMI port on the back of your TV. They also come with a power cable you use to plug it in. Connect the Chromecast to an HDMI port on your TV and then connect the power cable to it and plug it in. The first time you connect your Chromecast, you will need to download the Google Home app on your smartphone and use the Google Home app to set up your Chromecast ."
    },
    {
      "title": "Turn on your TV and select the Chromecast source.",
      "content": "Turn on your TV and select the Chromecast source. Use your TV remote to select the source port that your Google Chrome cast is connected to. By default, the Chromecast displays Google images of art and Google Earth images as a screensaver."
    },
    {
      "title": "Put your Oculus Quest 2 on and power it on.",
      "content": "Put your Oculus Quest 2 on and power it on. Place your Oculus Quest 2 on your head and press the button on the right side to power it on."
    },
    {
      "title": "Open the Camera app.",
      "content": "Open the Camera app. It has a pink icon with an image that resembles a camera. By default, it's in the dock at the bottom of the Oculus Quest home screen. Aim the Oculus motion controller at the Camera icon and squeeze the trigger button to select the camera app."
    },
    {
      "title": "Select Cast.",
      "content": "Select Cast . It's the first option in the upper-left corner of the Camera menu on the Oculus Quest. This displays options for casting your Oculus Quest to other devices. Allow a few minutes for your Quest to scan for nearby devices."
    },
    {
      "title": "Select your Chromecast device and click Next.",
      "content": "Select your Chromecast device and click Next . Once your Oculus Quest 2 detects your Chromecast device, it will appear in the casting menu. Select your Chromecast and then click Next at the bottom of the menu. This will start casting to your Chromecast which will display on your TV. When you are ready to stop casting, open the Camera app on your Oculus Quest and tap Stop Casting ."
    },
    {
      "title": "Turn on your Samsung TV.",
      "content": "Turn on your Samsung TV. Make sure your Samsung TV is powered on and connected to the internet before you begin."
    },
    {
      "title": "Install the Meta Quest app on your iPhone or iPad.",
      "content": "Install the Meta Quest app on your iPhone or iPad. The Meta Quest app is required to set up your Oculus Quest 2. If you don't have the Meta Quest app installed on your iPhone or iPad, you can download it for free from the App Store ."
    },
    {
      "title": "Open the Meta Quest app.",
      "content": "Open the Meta Quest app. Once you have the Meta Quest app installed on your iPhone or iPad, tap the Oculus app icon to open it. If you are not signed into your Oculus account, go ahead and sign in."
    },
    {
      "title": "Put your Oculus Quest 2 on and power it on.",
      "content": "Put your Oculus Quest 2 on and power it on. Place your Oculus Quest 2 on your head and press the button on the right side to power it on."
    },
    {
      "title": "Open the Camera app.",
      "content": "Open the Camera app. It has a pink icon with an image that resembles a camera. By default, it's in the dock at the bottom of the Oculus Quest home screen. Aim the Oculus motion controller at the Camera icon and squeeze the trigger button to select the camera app."
    },
    {
      "title": "Select Cast.",
      "content": "Select Cast . It's the first option in the upper-left corner of the Camera menu on the Oculus Quest. This displays options for casting your Oculus Quest to other devices. Allow a few minutes for your Quest to scan for nearby devices."
    },
    {
      "title": "Select Meta Quest mobile app and click Next.",
      "content": "Select Meta Quest mobile app and click Next . The Meta Quest mobile app option should be at the top of the list. Select this option and click Next at the bottom of the menu."
    },
    {
      "title": "Tap Start Casting on your iPhone or iPad.",
      "content": "Tap Start Casting on your iPhone or iPad. Return to your iPhone or iPad and tap Start casting . Allow a few minutes for your Oculus Quest to start casting to your iPhone or iPad."
    },
    {
      "title": "Swipe down from the upper-right corner of the screen.",
      "content": "Swipe down from the upper-right corner of the screen. This displays the Quick Access menu."
    },
    {
      "title": "Tap the Screen Mirroring icon.",
      "content": "Tap the Screen Mirroring icon. It has an icon that resembles two rectangular screens layered on top of each other. Tap this icon to display a list of devices you can mirror your screen to."
    },
    {
      "title": "Tap your Samsung TV.",
      "content": "Tap your Samsung TV. This will start mirroring your iPhone or iPad screen to your Samsung TV while you are casting your Oculus Quest to your iPhone or iPad. You are now indirectly casting your Oculus Quest to your Samsung TV. When you are ready to stop casting, open the Camera app on your Oculus Quest and tap Stop Casting ."
    },
    {
      "title": "Turn on your Samsung TV.",
      "content": "Turn on your Samsung TV. Make sure your Samsung TV is powered on and connected to the internet before you begin."
    },
    {
      "title": "Download and install the Samsung SmartThings app on your mobile phone.",
      "content": "Download and install the Samsung SmartThings app on your mobile phone. If you have a Samsung Galaxy device, the SmartThings app comes pre-installed on your phone. If you are using a different Android device, you can download it for free from the Google Play Store . The SmartThings app is also available on iPhone and iPad from the App Store."
    },
    {
      "title": "Connect the SmartThings app to your TV.",
      "content": "Connect the SmartThings app to your TV. You will need to connect the SmartThings app to your TV in order to cast your phone to your TV. If you haven't already done so, go ahead and use the following steps to connect your Samsung TV to the SmartThings app: [2] X Research source Open the SmartThings app. Tap the plus ( + ) sign in the upper-right corner. Tap Add Device . Tap Scan below \"Scan for nearby devices.\" Tap Add below your Samsung TV. Tap Ok or Allow . Some TVs may require you to enter the PIN displayed on the TV screen and tap Done ."
    },
    {
      "title": "Download and install the Metal Quest mobile app.",
      "content": "Download and install the Metal Quest mobile app. The Meta Quest app is required to set up your Oculus Quest. If you no longer have the Meta Quest app, you can download it for free from the Google Play Store on Android, or from the App Store on iPhone and iPad."
    },
    {
      "title": "Open the SmartThings app on your mobile device.",
      "content": "Open the SmartThings app on your mobile device. It has an icon that resembles 5 dots connected by a larger dot in the middle. Tap the SmartThings app on your Home screen or Apps menu to open the SmartThings app."
    },
    {
      "title": "Tap your Samsung TV.",
      "content": "Tap your Samsung TV. It should be listed at the bottom of the screen along with any other devices you have connected."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . It's the icon with three vertical dots in the upper-right corner. This displays the menu."
    },
    {
      "title": "Tap Mirror Screen (Smart View) and tap Start now.",
      "content": "Tap Mirror Screen (Smart View) and tap Start now . Tapping the Mirror Screen option displays a pop-up at the bottom of the screen. Tap Start now in the pop-up to start mirroring your phone screen to your Samsung TV. Allow a few minutes for your phone to connect to your TV."
    },
    {
      "title": "Open the Meta Quest app.",
      "content": "Open the Meta Quest app. Once you are successfully mirroring your phone screen to your TV, open the Meta Quest app."
    },
    {
      "title": "Put your Oculus Quest 2 on and power it on.",
      "content": "Put your Oculus Quest 2 on and power it on. Place your Oculus Quest 2 on your head and press the button on the right side to power it on."
    },
    {
      "title": "Open the Camera app.",
      "content": "Open the Camera app. It has a pink icon with an image that resembles a camera. By default, it's in the dock at the bottom of the Oculus Quest home screen. Aim the Oculus motion controller at the Camera icon and squeeze the trigger button to select the camera app."
    },
    {
      "title": "Select Cast.",
      "content": "Select Cast . It's the first option in the upper-left corner of the Camera menu on the Oculus Quest. This displays options for casting your Oculus Quest to other devices. Allow a few minutes for your Quest to scan for nearby devices."
    },
    {
      "title": "Select Meta Quest mobile app and click Next.",
      "content": "Select Meta Quest mobile app and click Next . The Meta Quest mobile app option should be at the top of the list. Select this option and click Next at the bottom of the menu."
    },
    {
      "title": "Tap Start Casting on your phone.",
      "content": "Tap Start Casting on your phone. Return to your mobile phone and tap Start casting . Allow a few minutes for your Oculus Quest to start casting to your mobile phone, which is already casting to your Samsung TV. You are now indirectly casting your Oculus Quest to your Samsung TV. When you are ready to stop casting, open the Camera app on your Oculus Quest and tap Stop Casting ."
    }
  ]
}