{
  "url": "https://www.wikihow.com/Crochet-a-Headband",
  "title": "How to Crochet a Headband",
  "steps": [
    {
      "title": "Chain enough stitches to wrap around your head.",
      "content": "Chain enough stitches to wrap around your head. Start by making a chain . Chain enough stitches so that the chain will wrap around your head where you would wear a headband. It should feel snug, but not too tight. To make a chain, you first need to make a slipknot . To do this, loop the yarn around your index and middle finger twice and then pull the first loop over the second loop. Slide the new loop onto the hook and tighten it by tugging on the tail. [1] X Research source The number of stitches you need to chain will depend on your hook size and yarn type. For example, if you are using a bulky yarn with a size J hook, then you would need to chain about 44 stitches. [2] X Research source"
    },
    {
      "title": "Secure the ends of the chain with a slipstitch.",
      "content": "Secure the ends of the chain with a slipstitch. Insert your hook into the first stitch in your chain and loop the yarn over the hook. Then, pull the yarn through to secure the slipstitch. Be careful not to twist your stitches as you connect the ends. Make sure they are straight before doing the slipstitch. [3] X Research source"
    },
    {
      "title": "Crochet until the headband is the width you want it to be.",
      "content": "Crochet until the headband is the width you want it to be. Crochet around the circumference of the headband. You can use any stitch you like to crochet your headband, but you might want to do your first one using the single crochet stitch . To single crochet, insert the hook into the stitch, then loop the yarn over and pull through the stitch. Then, loop the yarn over again and pull through both stitches. [4] X Research source You can use a single, double , or other crochet stitch depending on your intentions for the headband. If you want the headband to be something you can wear in the winter to keep your ears warm, then a tight stitch like single crochet might be best. However, if you want the headband to have some gaps and look a little fancier, then you could use the shell stitch or box stitch. When you insert the hook to make your stitches, insert it under both the front and back loops of each stitch. This will help to ensure that your headband lays flat."
    },
    {
      "title": "Finish the headband.",
      "content": "Finish the headband. To complete your crochet project , you will need to cut the yarn, fasten the end, and weave in the tail. Use the crochet hook to widen your last loop by at least a few inches and then cut it in the center. Pull the unattached free end of the yarn out of the loop, and then tug on the tail to tighten the knot. Then, use a darning or wide eyed tapestry needle to weave the tail into the edges of the headband."
    },
    {
      "title": "Chain your foundation stitches.",
      "content": "Chain your foundation stitches. Start by making a slipknot and then make a chain of six or more stitches for your foundation. [5] X Research source Six stitches might work well if you are using a bulky or super bulky yarn. If you are using a medium worsted weight yarn, then 10 stitches might be a good width. Experiment to find the ideal width for your headband."
    },
    {
      "title": "Skip a stitch and single crochet.",
      "content": "Skip a stitch and single crochet . Skip over the first stitch next to your hook and single crochet into the second stitch. Single crochet to the end of the chain. This will complete your first row. You can work your rows in a stitch other than single crochet if desired. Single crochet is a good practice stitch if this is your first headband. Some other stitches you can try include: Popcorn stitch Shell stitch Box stitch"
    },
    {
      "title": "Turn and chain one.",
      "content": "Turn and chain one. When you reach the end of your first row, you will need to turn your work over to work the second row. Chain one stitch. This will be your turning chain. A turning chain provides some slack to prevent the stitches from bunching up or puckering."
    },
    {
      "title": "Keep crocheting.",
      "content": "Keep crocheting. You will need to keep crocheting your rows in the stitch of your choice until the headband is long enough to fit snugly around your head. [6] X Research source Check now and then when the headband starts to get close to this length. Cut the free end of the yarn and tie it to secure it when you are finished. You can leave the tail a few inches long and then weave in the end, or trim off the excess."
    },
    {
      "title": "Attach the ends or use something to fasten them.",
      "content": "Attach the ends or use something to fasten them. When your headband is the length that you want it to be, you can attach the ends or fasten them. You can either use a darning needle and some extra yarn to sew the ends together or you can hold them together with a safety pin or broach. Another option is to leave a longer tail and use this to attach the ends. Thread the yarn through a darning needle or large eye tapestry needle and sew the ends together. Then, tie the end to the seam to secure it and trim off the excess."
    },
    {
      "title": "Add ribbon.",
      "content": "Add ribbon. Ribbon is an easy way to embellish your headband. You can use ribbon to accent one part of your headband or thread ribbon through the entire headband. Choose a ribbon that complements your yarn color and attach or thread it through the headband where you want it. You can even use the ribbon to hide your seam if you created a strip headband and sewed the ends together. Loop the ribbon around the seam a few times and tie it in a knot or bow."
    },
    {
      "title": "Sew on a button.",
      "content": "Sew on a button. Adding a decorative button is a cute way to embellish a headband. You can even use a button to attach the ends of a headband if you have used a stitch with some gaps in it. [7] X Research source Sew the button onto the headband with a needle and thread."
    },
    {
      "title": "Attach a flower.",
      "content": "Attach a flower. [8] X Research source You can either crochet a flower to add to your headband or you can attach a silk flower to your headband. Choose a yarn or silk flower color that complements your headband and attach it with a needle and thread or just use a safety pin to secure it temporarily."
    },
    {
      "title": "Loop a chain around one portion of the headband.",
      "content": "Loop a chain around one portion of the headband. If you want to give your headband a bow-like appearance without actually adding a bow, then you can use a chain of stitches to create this effect. [9] X Research source Make a chain of about 10 to 15 stitches. Then, loop the chain around one part of the headband a few times. Make sure to wrap the chain around the headband tightly. Use a slipstitch to secure both ends of the chain. Pull the free end of the yarn through, cut the end, and tie off the end."
    }
  ]
}