{
  "url": "https://www.wikihow.com/Drink-Green-Coffee",
  "title": "How to Drink Green Coffee",
  "steps": [
    {
      "title": "Purchase green coffee beans.",
      "content": "Purchase green coffee beans. Look for high-quality beans that are wet-processed. This means they weren't dried with the fruit left on which can lead to mold growth. If you can, buy beans that were machine-hulled which removes the husks. [1] X Research source You can purchase green coffee beans online or ask your local coffee roaster to put aside some unroasted beans for you to purchase."
    },
    {
      "title": "Rinse 1 cup of green coffee beans and put them in a pot.",
      "content": "Rinse 1 cup of green coffee beans and put them in a pot. Put 1 cup (170 g) of green coffee beans into a fine mesh strainer and place it under the sink faucet. Rinse the beans briefly and then transfer them to a pot on the stove. [2] X Research source Avoid rubbing the beans vigorously because they'll lose the papery chaff that contains antioxidants."
    },
    {
      "title": "Add 3 cups (710 ml) of water and bring the water to a boil.",
      "content": "Add 3 cups (710 ml) of water and bring the water to a boil. Pour in filtered or spring water and put the lid on the pot. Turn the burner to high and heat the beans until the water begins to boil. [3] X Research source"
    },
    {
      "title": "Simmer the beans for 12 minutes over medium heat.",
      "content": "Simmer the beans for 12 minutes over medium heat. Take the lid off of the pot and turn the burner down to medium so the water bubbles gently. Simmer the beans for 12 minutes and stir them occasionally. [4] X Research source Stir them gently so you don't loosen the chaff from the corners of the beans."
    },
    {
      "title": "Turn off the burner and strain the extract into a storage container.",
      "content": "Turn off the burner and strain the extract into a storage container. Set a fine mesh strainer over a bowl or storage container such as a jug. Slowly pour the extract through the strainer and into the container. [5] X Research source The strainer should catch the beans and large flakes of the chaff. Consider storing the beans to steep again. Put them in a sealable bag once they've cooled and refrigerate them. Steep them again within 1 week and then discard them."
    },
    {
      "title": "Drink the green coffee extract.",
      "content": "Drink the green coffee extract. Unlike commercial powders that you need to mix, your green coffee extract is ready to drink immediately. If you dislike the strong flavor, dilute it with a little water or juice. [6] X Research source Cover and refrigerate the extract for up to 3 to 4 days."
    },
    {
      "title": "Try drinking green coffee for weight loss.",
      "content": "Try drinking green coffee for weight loss. Small research studies suggest that drinking green coffee may prevent weight gain. This is because green coffee contains chlorogenic acid that limits your body from absorbing carbohydrates that you eat. [7] X Research source Although more research is needed, green coffee may reduce blood pressure and improve blood sugar."
    },
    {
      "title": "Track your dosage throughout the week.",
      "content": "Track your dosage throughout the week. If you bought green coffee powder and are mixing it with boiling water, follow the dosing instructions on the package. Unfortunately, since there aren't dosing recommendations for how much chlorogenic acid to add to your diet, you'll need to monitor how much green coffee extract you're drinking every day. If you develop side effects, cut back on your daily dose. [8] X Research source Some studies recommend adding 120 to 300 mg of chlorogenic acid (from a 240 to 3000 mg dose of green coffee extract), but there's no way to tell how much is in your homemade green coffee extract."
    },
    {
      "title": "Pay attention to side effects such as headache, diarrhea, and anxiety.",
      "content": "Pay attention to side effects such as headache, diarrhea, and anxiety. Since green coffee contains more caffeine than traditionally roasted coffee, you're more likely to experience side effects from the caffeine. You may feel anxious, jittery, or develop a rapid heartbeat. If you experience side effects, cut back on the green coffee and consult with your doctor. [9] X Research source Other possible side effects include diarrhea, headache, and urinary tract infection."
    },
    {
      "title": "Drink green coffee 30 minutes before your meals.",
      "content": "Drink green coffee 30 minutes before your meals. Regardless of whether you're drinking homemade green coffee extract or a powdered green coffee drink, plan to drink your dose on an empty stomach. Wait 30 minutes before eating a meal or snack. [10] X Research source Follow the manufacturer's instructions about how many times you can drink green coffee through the day. For example, some may recommend that you limit it to 2 doses a day."
    }
  ]
}