{
  "url": "https://www.wikihow.com/Harvest-Celery",
  "title": "How to Harvest Celery",
  "steps": [
    {
      "title": "Wait 3 to 5 months after planting the celery to harvest it.",
      "content": "Wait 3 to 5 months after planting the celery to harvest it. The growing period for celery is much longer than 3 months, but they’re best when harvested immature. Wait for 3 months after transplanting, or 4 months after the seed was first started to harvest the stalks. [1] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source The longer the celery grows, the tougher it will become. However, the tougher the celery, the more nutritious it tends to be. Harvest according to your personal preferences, but don’t wait longer than 5 months to harvest your first stalks!"
    },
    {
      "title": "Harvest before the outdoor temperature reaches 65 °F (18 °C).",
      "content": "Harvest before the outdoor temperature reaches 65 °F (18 °C). If you wait until the weather becomes too hot, the celery will be dry and bitter. Instead, harvest when temperatures are cool and the air is humid. [2] X Research source If you like darker celery, wait until the temperature reaches around 70 °F (21 °C). The celery will be slightly tougher, but not inedible."
    },
    {
      "title": "Make sure the lower stalks are at least 6 in (15 cm) long.",
      "content": "Make sure the lower stalks are at least 6 in (15 cm) long. Even the smallest stalks on the plant need to be at least 6 inches (15 cm) tall in order to be edible. The tallest stalks should be around 18 inches (46 cm), but can be much taller depending on the plant! If your celery plant hasn’t reached this size by the time you want to harvest it, wait another week and measure the stalks."
    },
    {
      "title": "Ensure the plant is 3 in (7.6 cm) across to harvest all of the stalks.",
      "content": "Ensure the plant is 3 in (7.6 cm) across to harvest all of the stalks. To harvest a whole plant, you need to wait until it has reached its full size. Measure across the plant from one side to the other, through the center of the stalks. [3] X Research source If the plant isn’t at least 3 inches (7.6 cm) wide, wait 1 to 2 weeks before harvesting it."
    },
    {
      "title": "Look for stalks that are compact if you want to harvest the whole plant.",
      "content": "Look for stalks that are compact if you want to harvest the whole plant. It’s best to harvest whole plants that haven’t had any stalks removed. Check the top of the plant for open spaces between the stalks. They should be close together and moderately difficult to separate. [4] X Research source If there are open spaces or the plant isn’t compact at the top, it’s best to harvest the individual stalks as they grow."
    },
    {
      "title": "Harvest the longest stalks on the outside of the plant as needed.",
      "content": "Harvest the longest stalks on the outside of the plant as needed. When choosing stalks to remove, look around the outer edge of the plants. The outer stalks are the most mature stalks, and the inner stalks will continue to grow after the outer stalks are removed. [5] X Research source The outer stalks are best for cooking, as they tend to be more nutritious. If you’re looking for tender stalks to eat raw, select a few from closer to the center of the plant. If you want to gather seeds from any of your celery plants, let the center stalks grow throughout the season."
    },
    {
      "title": "Separate stalks at the crown if you don’t need the whole plant.",
      "content": "Separate stalks at the crown if you don’t need the whole plant. Using a serrated knife, cut the stalk away from the bottom of the plant, where all of the stalks are joined together. Hold the stalk in your hand while you cut it off of the crown. [6] X Research source Always be careful when using a knife in the garden, and remember to sanitize the knife after you use it to prevent the spread of bacteria, fertilizer, or pesticides."
    },
    {
      "title": "Cut through the crown just below the soil line to remove the whole plant.",
      "content": "Cut through the crown just below the soil line to remove the whole plant. Use your hand to push the soil away from the bottom of the plant until the crown is exposed. Then, use a serrated knife to cut just below the crown, separating the stalks from the roots. [7] X Research source Make sure you’re cutting in a straight line all the way across the bottom of the plant. If you cut on a diagonal, you might cut off one of the stalks. Be sure to hold the top of the plant upright as you cut to prevent it from falling over. Do not use scissors since they may damage the celery."
    },
    {
      "title": "Remove the remaining stalks from the ground at the end of the 2nd year.",
      "content": "Remove the remaining stalks from the ground at the end of the 2nd year. Celery are biennial vegetables, which means that after harvesting the celery for two years, the plants will not grow back. Either pull the remaining stalks out or dig them out of the ground, including the roots. [8] X Research source If you want more celery the following year, gather the seeds that fall from the remaining celery stalks at the end of the growing season, and plant them!"
    },
    {
      "title": "Remove the outer leaves of any harvested stalks.",
      "content": "Remove the outer leaves of any harvested stalks. Before you prepare the celery to store or eat it, pull or cut the outer leaves off of the top of the harvested stalks. This will help the stalk stay fresh and crispy. [9] X Research source You can also use celery leaves in a variety of recipes, including soups and salads."
    },
    {
      "title": "Store harvested celery in a bag in the refrigerator for up to 2 weeks.",
      "content": "Store harvested celery in a bag in the refrigerator for up to 2 weeks. With the leaves removed, celery can last in the refrigerator for quite a while. Place the stalk in a plastic bag with the end open, and leave it in a crisper drawer with high humidity until you need to use it. [10] X Research source With the leaves attached to the stalk, the stalks will last for about 2-3 days."
    },
    {
      "title": "Refrigerate cut stalks in water to increase the crispiness of the celery.",
      "content": "Refrigerate cut stalks in water to increase the crispiness of the celery. If you want extra crispy celery, or have cut up a portion of a stalk, place the pieces in a container with water. Cover the container and place it in the refrigerator, where the celery will last up to 2 weeks. [11] X Research source Replace the water in the container every 1-2 days to ensure that the pieces are absorbing fresh water. You can cut the pieces to whatever size you prefer, as long as they fit in the container with a lid on it."
    }
  ]
}