{
  "url": "https://www.wikihow.com/Repair-Peeling-Plaster-Walls",
  "title": "How to Repair Peeling Plaster Walls",
  "steps": [
    {
      "title": "Maybe the plaster wasn’t fully dry before it was painted.",
      "content": "Maybe the plaster wasn’t fully dry before it was painted. If your walls are newly plastered and painted, the paint can start to flake off if there is still moisture in the plaster underneath. Plaster must be fully dry before you paint it. [1] X Research source It usually takes at least a few days for plaster to dry completely, but it’s recommended to wait at least 1 week to paint newly plastered walls. Fully dry plaster is a light creamy pink color."
    },
    {
      "title": "Layers of paint can start peeling off old plaster because of the buildup.",
      "content": "Layers of paint can start peeling off old plaster because of the buildup. It’s common for people to just slap on new coats of paint to freshen up plaster walls over the years. However, when so many layers of paint are applied to old plaster, the walls often start to peel. [2] X Research source If it seems like the paint is peeling because there are too many old coats, sand or scrape off the old paint and repaint the plaster. Paint can also flake off if the plaster wasn’t primed before the coat of paint was applied."
    },
    {
      "title": "Excessive moisture can cause the top layer of plaster to peel up.",
      "content": "Excessive moisture can cause the top layer of plaster to peel up. There are typically 3 coats of plaster applied to any plastered wall: the scratch coat, the intermediate coat, and the top coat or hard coat. The top coat is the thinnest layer and therefore can pop up from the substrate layers if it gets damp frequently. [3] X Research source This is most common on exterior walls, bathroom walls, and kitchen walls, but it can happen anywhere. Changes in temperature from day to night and due to air conditioning can also make plaster walls moist."
    },
    {
      "title": "Begin by scraping away all the peeling paint.",
      "content": "Begin by scraping away all the peeling paint. Scrape off all the loose paint flakes with the edge of a putty knife. Move the putty knife back and forth across the whole area, changing direction occasionally, to get rid of all the peeling paint. [4] X Research source This also lets you see the plaster below the paint and make sure it is still solid and not flaking off the substrate layers. As long as the top coat of the plaster isn’t loose, you can proceed with paint prep."
    },
    {
      "title": "Smooth the edges of the remaining paint with sandpaper.",
      "content": "Smooth the edges of the remaining paint with sandpaper. Put a piece of fine-grit sandpaper, such as 1500-grit or 2000-grit sandpaper, on a small sanding block. Rub it back and forth over the edges of the intact paint around the peeled area to blend them in. [5] X Research source Note that if there is any plaster damage below the paint, you must repair it first before you proceed to repaint the area. You can do this by patching it with joint compound or patching plaster."
    },
    {
      "title": "Prime the damaged area.",
      "content": "Prime the damaged area. Use a paint brush to brush 1 coat of plaster primer onto the peeled area. Let the primer dry for at least 1 hour before you move on to painting it. [6] X Research source If you repaired any damaged plaster, make sure to wait at least 3 days and preferably 1 week for it to dry before priming and painting it. Make sure that the wall is your desired smoothness—once you start applying the primer, you'll can see any imperfections."
    },
    {
      "title": "Acrylic emulsion paint.",
      "content": "Acrylic emulsion paint. Use a smooth roller to apply the desired color of acrylic paint to the repaired and primed area of the wall. Let the first coat dry overnight, then apply 1-2 more coats of paint to the whole wall to give it a new, uniform look. [7] X Research source Semi-glossy or glossy paints look nice on plaster if you want to give it a bit of a shine. Try to match the color of the paint to the existing coat. If you can't, prime the whole wall with a plaster primer and repaint it all with a fresh coat of paint."
    },
    {
      "title": "It’s better to use joint compound or patching plaster for minor repairs.",
      "content": "It’s better to use joint compound or patching plaster for minor repairs. Mix the joint compound with water according to the manufacturer’s instructions and press it into the damaged area with a putty knife. Smooth it out into the surrounding area with the edge of the putty knife and let it dry for at least 24 hours. [8] X Research source For example, if you discover the top coat of the plaster is damaged underneath a section of peeling paint, you can patch the area this way before repainting it. You can also fill in small cracks in your plaster with joint compound or patching plaster. For any large damaged ares, say bigger than 2 ft (0.61 m) by 2 ft (0.61 m), it’s best to get professional plaster repair done using traditional methods and matching materials."
    },
    {
      "title": "Drill pilot holes into the plaster on both sides of the crack.",
      "content": "Drill pilot holes into the plaster on both sides of the crack. Use a 3/16-inch (4.76 mm) masonry bit to drill a hole about 2 in (5.1 cm) from the crack on 1 side. Do the same on the opposite side, so the holes are about 4 in (10 cm) apart. Make a series of holes about 3 in (7.6 cm) apart from each other along each side of the crack. [9] X Research source The masonry bit won’t go through the wooden lath beneath the plaster, so just back the drill out as soon as you feel it hit wood."
    },
    {
      "title": "Inject plaster repair adhesive into the holes.",
      "content": "Inject plaster repair adhesive into the holes. Vacuum the plaster crumbs out of all the holes first. Then, squeeze plaster repair adhesive into each hole using a caulking gun. [10] X Research source Note that this is intended to help the plaster re-adhere to the lath below and prevent further separation of the plaster when there is a really deep crack. If the crack is just in the top layer of plaster, you can patch it with joint compound or repair plaster."
    },
    {
      "title": "Screw the plaster into the lath below and let the glue dry.",
      "content": "Screw the plaster into the lath below and let the glue dry. Place a 2 in (5.1 cm) plastic washer over a 5/8-inch (15.87 mm) drywall screw for each hole you drilled. Drive the screws through each of the holes, all the way into the wooden lath below. Wait 1-2 days, then remove the screws and washers. [11] X Research source Wipe off any excess adhesive that oozes out of the holes with a wet sponge. You should see the crack shrink as the screws pull the separating plaster back together. If there is still a small crack after you remove the screws, fill it in with joint compound or repair plaster and prime and paint over it."
    },
    {
      "title": "Only if the plaster is beyond repair.",
      "content": "Only if the plaster is beyond repair. Especially in older buildings, there’s no reason to replace plaster with drywall unless it has extensive damage that would be too expensive or difficult to repair. Traditional plaster and lath construction provides some insulation, soundproofing, and fire resistance, so it’s worth preserving if it is just peeling or has other minor damage. [12] X Research source Plaster construction gradually went out of style as drywall became more prominent from the 1950s and onward, but that doesn’t mean it’s not a great method of building walls! Drywall is used in modern construction because it’s faster and cheaper to use."
    }
  ]
}