{
  "url": "https://www.wikihow.com/Pin-a-Comment-on-Tiktok",
  "title": "How to Pin a Comment to Your TikTok Video's Comment Section",
  "steps": [
    {
      "title": "No, you cannot pin TikTok comments anymore.",
      "content": "No, you cannot pin TikTok comments anymore. TikTok quietly removed the ability to pin comments sometime in 2022, which upset many creators who used the pinned comment for video corrections, sources, or more information. However, you can still \"pin\" comments to your videos using what some creators call a \"shadow pin\" workaround. [1] X Research source"
    },
    {
      "title": "Make a video reply to the comment you want to pin.",
      "content": "Make a video reply to the comment you want to pin. When you make a video reply to a comment, the comment will be boosted to the top of the comments section. To make a video reply, find the comment you want to reply to (or pin, in this case), long press it, and select Reply with Video . You can then start to record your video. For the purpose of pinning a comment, however, you can record just a couple of seconds. Post the video reply once you're finished."
    },
    {
      "title": "Private the video reply you just made.",
      "content": "Private the video reply you just made. This will leave the comment you video replied to at the top of the comment section, but the video reply will not show. Since there is no visual indicator that the top comment is pinned, however, you may want to preface any pinned comments you write with Pinned comment: . To private a video reply, open it and tap the three-dot menu in the bottom-right corner. Then tap Privacy settings and select Only you under \"Who can watch this video\". You can also toggle off the ability for others to comment, Duet, Stitch, and more at the bottom of the privacy menu."
    },
    {
      "title": "While you can pin any comment, some comments are a better choice than others.",
      "content": "While you can pin any comment, some comments are a better choice than others. The best comments to pin in your TikTok video's comment section are: Corrections Additional information or clarification Responses to common commenter question(s) Sources Directives to a part 2 video An interesting perspective from a viewer A funny comment that made you laugh Don't discount the value of a funny comment! Jenna Jean Davis, social media influencer, marketer, and the founder and CEO of Jenna Jean Marketing LLC, says that \"the comment section of TikTok is almost as entertaining as the videos themselves.\""
    }
  ]
}