{
  "url": "https://www.wikihow.com/Completely-Power-Down-Your-iPad",
  "title": "3 Simple Ways to Completely Power Down Your iPad or iPad Pro",
  "steps": [
    {
      "title": "Press and hold either volume button and the top button at the same time.",
      "content": "Press and hold either volume button and the top button at the same time. Do this until you see the power off slider. [1] X Research source If your iPad has a Home button, you'll just need to press and hold the top button until the power off slider appears."
    },
    {
      "title": "Drag the \"power off\" slider to the right.",
      "content": "Drag the \"power off\" slider to the right. This will power off your iPad."
    },
    {
      "title": "Wait at least 30 seconds.",
      "content": "Wait at least 30 seconds. It may take a moment for your iPad to fully power off. If the physical buttons aren't working on your iPad, you can use the settings instead."
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. This is the grey cog icon. If you can't use the buttons on your iPad, you can shut it down from its settings instead."
    },
    {
      "title": "Tap General.",
      "content": "Tap General . You can find this in the left panel."
    },
    {
      "title": "Scroll down and tap Shut Down.",
      "content": "Scroll down and tap Shut Down . This is in blue text at the very bottom of the page."
    },
    {
      "title": "Slide the \"power off\" switch.",
      "content": "Slide the \"power off\" switch. This will turn off your iPad. Be sure to wait at least 30 seconds to make sure it's fully off."
    },
    {
      "title": "Understand when this is necessary.",
      "content": "Understand when this is necessary. You should only need to force-restart your iPad if it's frozen or otherwise unresponsive to the \"Sleep/Wake\" button. [2] X Research source Force-restarting your iPad can cause some apps to crash, and you may lose any unsaved work."
    },
    {
      "title": "Quickly press and release the volume button closest to the top button.",
      "content": "Quickly press and release the volume button closest to the top button. This will vary depending on your iPad model. [3] X Research source If your iPad has a Home button, simply press and hold the top button and Home button at the same time. Release both buttons when the Apple logo appears."
    },
    {
      "title": "Quickly press and release the volume button farthest from the top button.",
      "content": "Quickly press and release the volume button farthest from the top button. This will vary depending on your iPad model."
    },
    {
      "title": "Press and hold the top button.",
      "content": "Press and hold the top button. This is the iPad's lock button. Wait for the Apple logo to appear."
    },
    {
      "title": "Release the top button.",
      "content": "Release the top button. You should see your iPad's lock screen in a few moments. You can now perform a regular shut down."
    },
    {
      "title": "Press and hold either volume button and the top button at the same time.",
      "content": "Press and hold either volume button and the top button at the same time. Do this until you see the power off slider. If your iPad has a Home button, you'll just need to press and hold the top button until the power off slider appears."
    },
    {
      "title": "Drag the slider to the right.",
      "content": "Drag the slider to the right. This will power off your iPad. Be sure to wait at least 30 seconds to make sure it's fully off."
    }
  ]
}