{
  "url": "https://www.wikihow.com/Accept-Payments-on-Craigslist",
  "title": "How to Accept Payments on Craigslist: Best Ways to Stay Safe",
  "steps": [
    {
      "title": "Ask yourself whether you are comfortable with shipping the item.",
      "content": "Ask yourself whether you are comfortable with shipping the item. The recommendation from Craigslist is that you only do business locally, and for good reason. You are much less likely to be scammed by someone who you meet and transact with face-to-face. Asking a buyer to stop by your house to pick up the item is the norm (and the safest way to transact), but it isn't out of the question to ship an item. Just make sure you understand the risks involved."
    },
    {
      "title": "Request that the buyer pay you through PayPal or a similar service.",
      "content": "Request that the buyer pay you through PayPal or a similar service. If you decide to ship your item, this is the only payment option you should entertain. A buyer can make a payment to your PayPal account using nothing but your email address. Only after you have confirmed payment should you ship the item. If the buyer is not willing to pay in advance, do not do business with them."
    },
    {
      "title": "Request a cash payment at the time of sale.",
      "content": "Request a cash payment at the time of sale. If you decide to meet your buyer in person, ask that they pay cash. Any honest buyer will understand your hesitance to accept other forms of payment and will gladly stop by an ATM to get the cash. If a buyer insists on paying by check or some other form, strongly consider calling off the deal."
    },
    {
      "title": "Ask that a buyer pay at least partially in cash.",
      "content": "Ask that a buyer pay at least partially in cash. If you meet a buyer in person and they do not have sufficient cash on them, you could ask them to pay for part of the item in cash and cover the rest with a personal check. Remember that by doing this, you run the risk of the check bouncing."
    },
    {
      "title": "Exercise caution before accepting a cashier's check.",
      "content": "Exercise caution before accepting a cashier's check. Even though these are typically viewed as sound because they are drawn on a bank's funds, they are surprisingly easy to forge. It is not a good idea to do business with a Craigslist buyer who insists on paying by cashier's check."
    },
    {
      "title": "Never accept a money order.",
      "content": "Never accept a money order. Money orders are the type of payment most often associated with scams on Craigslist. Never do business with anyone who offers to pay you by money order for more than your asking price, especially if they are asking for a portion of the money to be wired to a third party. This is a classic formula for Craigslist scamming."
    }
  ]
}