{
  "url": "https://www.wikihow.com/Hide-Your-Phone-Number-(UK)",
  "title": "How to Hide Your Phone Number (UK)",
  "steps": [
    {
      "title": "Dial \"141\".",
      "content": "Dial \" 141 \". Enter this prefix before dialing a phone number to prevent the person you are calling from seeing your phone number on caller ID. [1] X Research source"
    },
    {
      "title": "Dial the phone number of the person you are calling.",
      "content": "Dial the phone number of the person you are calling. Enter all digits of the phone number as you normally would."
    },
    {
      "title": "Repeat the process each time you want to hide your number.",
      "content": "Repeat the process each time you want to hide your number. Entering 141 is not a permanent way to hide your number. You'll need to enter 141 each time you want to conceal your number."
    },
    {
      "title": "Change your phone's settings.",
      "content": "Change your phone's settings. Most mobile phones will allow you to keep your number hidden every time you make a call. The process is different for smart phones and non-smart phones and varies by model."
    },
    {
      "title": "Find the \"Settings\" or \"Phone Options\" menu.",
      "content": "Find the \"Settings\" or \"Phone Options\" menu. Look for a setting called \"Show or Hide\" or \"Restrict My Identity\" or something similar. Depending on the make and model of your phone, the exact wording may be different. [2] X Research source"
    },
    {
      "title": "Set the option to \"Hide\" or \"Always\" depending on what's appropriate and hit \"Save.\"",
      "content": "Set the option to \"Hide\" or \"Always\" depending on what's appropriate and hit \"Save.\" [3] X Research source For most non-smart phones, click \"Menu\" and then choose \"Settings.\" Once inside, find and click \"Send my caller id\" and change the setting to \"No.\" Save your change if necessary."
    },
    {
      "title": "Contact your mobile provider.",
      "content": "Contact your mobile provider. You can call your provider directly and request they change your preferences for your phone number. They can also provide assistance with your mobile phone model to know exactly which menus to access."
    },
    {
      "title": "Sign up for ex-directory.",
      "content": "Sign up for ex-directory. If you have phone service with BT, you can sign up for ex-directory. If you do so, your information will not be included in the phone book and will not be available via directory enquiries nor through online directory service. [4] X Research source"
    },
    {
      "title": "Register with The Telephone Preference Service (TPS).",
      "content": "Register with The Telephone Preference Service (TPS). Sign up for the central opt out register to prevent companies from making unsolicited calls to your number. [5] X Research source"
    },
    {
      "title": "Contact the ICO.",
      "content": "Contact the ICO. If you are receiving nuisance calls, you can file a complaint with the Information Commissioners Office. The ICO investigates companies violating TPS preferences and assists consumers in stopping nuisances calls. [6] X Research source"
    },
    {
      "title": "Get a second number.",
      "content": "Get a second number. You can use a service that \"cloaks\" your phone number by assigning you a second number. Use the alternative number to give to those you might like to receive a call from but don't know or trust well enough to provide your actual phone number. When they place a call to you, it will be diverted to your true phone number without them being aware of the transfer. [7] X Research source"
    },
    {
      "title": "Download an app.",
      "content": "Download an app. There are apps available for Android and iPhones that allow you to create a \"disposable\" phone number. The number will mask your true phone number and not allow calls to be traced back to your phone. You can get multiple phone numbers and discard them at any time. [8] X Research source This can be a great option for avoiding spam and maintaining privacy when you're job hunting or posting your number in online ads or social media sites."
    },
    {
      "title": "Sign up for temporary call forwarding.",
      "content": "Sign up for temporary call forwarding. Some service providers allow you assign a temporary number to be forwarded to your primary landline or mobile number. This is a good option if you want to provide an alternative number to a group of people. [9] X Research source"
    }
  ]
}