{
  "url": "https://www.wikihow.com/Make-a-Scorpio-Man-Obsessed-with-a-Capricorn-Woman",
  "title": "How to Attract a Scorpio Man as a Capricorn Woman",
  "steps": [
    {
      "title": "A Scorpio admires intensity in other people, and he’ll want to see that in you.",
      "content": "A Scorpio admires intensity in other people, and he’ll want to see that in you. These guys desire company who can match their energy and inspire them to find more depth and meaning in their own lives. He’s always looking for people who really care about their beliefs, go after what they want, and enjoy strong emotions. As a Capricorn, some of this will be second nature. [1] X Research source [2] X Research source You probably find meaning through your personal achievements. You also probably feel super emotionally invested in your self-improvement. But you might not be used to describing these things in terms of your feelings. To snag a Scorpio’s affection though, you should try! When you’re fighting hard for a promotion, try telling him all about it. Include details you might usually leave out, like how you were too nervous to sleep last night. Or, you could mention that you’ve secretly already fantasized about sitting in your new office. He’ll be totally enchanted by your passion!"
    },
    {
      "title": "Scorpio men aren't interested in light conversation.",
      "content": "Scorpio men aren't interested in light conversation. He doesn’t want to talk about the weather, and if he thinks you do, that’ll hurt your chances of making him fall for you. For a Capricorn , this will be beyond simple. You probably hate thoughtless, boring conversations just as much as he does. [3] X Research source [4] X Research source Start conversations on things that really interest you, like your family dynamic, your philosophical beliefs, or even something a bit out there, like whether or not aliens exist. Both of these signs just aren't interested in fake, meaningless chat. Use this to your benefit! Draw him into conversation often and flaunt your love of authenticity. He'll be totally taken with you. Reader Poll: We asked 610 wikiHow readers who've dated Scorpio men, and only 7% of them agreed that the best way to attract them is by being intelligent and analytical. [Take Poll] So don’t think you have to be an expert on deep, analytical topics. Just talk about the things that are important to you, and he’ll want to know more."
    },
    {
      "title": "Scorpio men love a lively debate, but not if it goes too far.",
      "content": "Scorpio men love a lively debate, but not if it goes too far. He wants to see you passionately fight for the things you believe in and see him do the same thing. However, he’s also super tied to his own individuality. It’ll definitely rub him the wrong way if you cross the line from fun challenge to grudge match. [5] X Research source As a Capricorn woman, intellectual, analytic discussions are fun and easy. Challenge away! He’ll love that you find little weaknesses in his arguments and that you aren’t afraid to question him. That being said, it can be hard for a Capricorn woman to fight her need to be right. Try to make sure that your debates end on a pleasant note and that both of you get to be content with your own opinions. He'll love that you're passionate, but still respect his take! [6] X Research source"
    },
    {
      "title": "Scorpios want what they can't have.",
      "content": "Scorpios want what they can't have. Having to earn someone else's interest, ironically, is what keeps them on the line. This can be super challenging for a Capricorn woman in some ways, and in others, not so much. On the one hand, your conversational style can come off as distant, which some people find mysterious. Then again, you love being the instigator, too! [7] X Research source [8] X Research source Really think about why you hope to draw this person in. Because if it's for love, there will always be a point where bending to his preferences means sacrificing what you want. And that's no good! However, if you're comfortable with the compromise, you should definitely let him come to you. Try not to text first and try to avoid taking the lead (even though you love taking the lead!). He'll appreciate taking the reins."
    },
    {
      "title": "Scorpios, famously, love a good mystery.",
      "content": "Scorpios, famously, love a good mystery. He’ll want to know all of your secrets, but still get to wonder what you'll do next. This can be a hard line to walk when you’re wooing a Scorpio, but luckily, Capricorns have a leg up. [9] X Research source Capricorns can be super aloof at the outset. You may come off as unreadable and unreachable to others early in a relationship. This can be super exciting to a Scorpio! Try to lean into this natural instinct a bit, while still opening up to him when you're deep in conversation. When you’re not, feel free to be quieter, or more withdrawn—just like you like it. The combination will drive him absolutely nuts! [10] X Research source"
    },
    {
      "title": "A Scorpio wants someone who really gets him.",
      "content": "A Scorpio wants someone who really gets him. He goes through life feeling misunderstood by others, so to make him obsessed, you’ll need to prove that you’re an exception. Luckily for a Capricorn woman, reading people comes pretty easily. You do struggle a bit to apply that big, analytical brain in emotional conversations, though. [11] X Research source Even if a chat about his moods and dreams seems silly to you, be patient. Take his introspections seriously and keep listening closely. Remember what he tells you and really try to understand where he’s coming from. Ask thoughtful questions and give informed responses that show you get him. He’ll be super into this—and you! [12] X Research source"
    },
    {
      "title": "Scorpio men want everything to be totally authentic.",
      "content": "Scorpio men want everything to be totally authentic. He's super against fakeness in general and prefers to surround himself with honest company, with upfront and solid people. [13] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. Capricorns and Scorpios, on the whole, have this in common. Because Capricorn women are so grounded, you should have an easy time convincing him that you're genuine. [14] X Research source On the other hand, Capricorns do definitely love the finer things in life. This can sometimes come off as materialistic to a sign like Scorpio. If you feel stressed about how he might perceive your need for high-thread-count sheets, just try to be honest and open. You could just inform him that having comfortable things helps you relax after a day of hard work. Your transparency will probably be super exciting to him! [15] X Research source"
    },
    {
      "title": "For a Scorpio man to really fall for someone, he needs to feel totally unjudged.",
      "content": "For a Scorpio man to really fall for someone, he needs to feel totally unjudged. The truth is, men of this sign are usually moody. More than anything, he wants passion and depth, [16] X Expert Source Angel Eyedealism Astrologer & Performance Artist Expert Interview. 8 December 2021. and so naturally, his emotions will probably run the gamut. He’ll be totally amazed by anyone who can truly take his moods in stride. [17] X Research source For a Capricorn woman, this will probably be a bit of a struggle! One of your biggest sources of personal pride is your ability to self-regulate your feelings. Witnessing your Scorpio’s emotions totally take the wheel may seem odd, or even annoying. Capricorns, too, can be a bit judgmental. Try your best to be patient. Give him space when he seems edgy. If you feel yourself getting angry, take a deep breath or consider heading home for the day. [18] X Research source"
    },
    {
      "title": "Scorpio men adore loyalty in friends and romantic interests.",
      "content": "Scorpio men adore loyalty in friends and romantic interests. For him, it’s actually more of a necessity. If a Scorpio doesn’t know you’re 100% trustworthy, he’ll consider it a non-starter. This is another area where you, Capricorn woman, shine! Usually, you reserve your devotion for people you know super well, but to make a Scorpio man obsessed, you should try and be super dependable from the start. [19] X Research source [20] X Research source Be someone he can count on, never go behind his back, and keep his secrets close to the chest. He’s way more likely to fall for you if he knows you’ve got his back."
    },
    {
      "title": "Scorpios love an independent spirit, but they also want to feel useful.",
      "content": "Scorpios love an independent spirit, but they also want to feel useful. For some signs, attracting a Scorpio would mean fighting the urge to be too clingy too early. But self-sufficiency is Capricorn’s middle name. So instead, you should focus on finding ways to lean on him a little bit. [21] X Research source If there’s a subject that, shockingly, you haven’t mastered yet, fight the urge to research. Instead, ask him what he knows about it. He already gets that you can do anything on your own, so he’ll love that you still thought to ask. Or, next time you want to hang a painting, ask for his help. You hang the frame, he checks the alignment. Gestures like this, paired with your natural independence, will have him absolutely obsessed with you! [22] X Research source"
    },
    {
      "title": "A Scorpio man will probably be quick with emotional intimacy, but slow with commitment.",
      "content": "A Scorpio man will probably be quick with emotional intimacy, but slow with commitment. For him, this is just the natural order of a relationship. He has no problem diving right into your passions, dreams, and vulnerabilities, but it’s the formal commitment, in his mind, that should come in due time. For a Capricorn woman, going slow will be easy. But, you may need to fight some of your natural instincts regarding what parts of the relationship come when. [23] X Research source When the Scorpio man has dredged up feelings and introspections you wouldn’t normally share until a year of dating (if ever), you may feel a bit of discomfort. When the two of you are on an emotional deep dive after two weeks of hanging out, try reminding yourself that this is normal for him. For a Scorpio to feel totally obsessed, he'll need to know how deep you are. Don't let it phase you. Instead, in the relationship's other aspects, stick to the slow and steady pace you love, Capricorn! [24] X Research source"
    }
  ]
}