{
  "url": "https://www.wikihow.com/Play-the-Elephant-Game",
  "title": "How to Play the Elephant Game",
  "steps": [
    {
      "title": "Get some people.",
      "content": "Get some people. You should generally have 1 to five people, but the bigger the better. Just make sure no one will spoil it once they have solved the riddle ."
    },
    {
      "title": "Explain",
      "content": "Explain to them the game. Explain to them that you'll be giving them multiple numbers of elephants, and they need to try to figure out how many elephants there are. Don't tell them how to calculate the number of elephants, though."
    },
    {
      "title": "Provide about three different numbers of elephants.",
      "content": "Provide about three different numbers of elephants. It's best to use the scene around you and incorporate people. Here's a good example: There's fourteen elephants in Jimmy's hat, eighty three in Darla's pocket, and two in Terry's nose."
    },
    {
      "title": "Ask",
      "content": "Ask how many elephants there are. This isn't as simple as it seems. The amount of words in your final question symbolise the amount of elephants. For instance, asking \"how many elephants are there?\" means there are five elephants, regardless of the numbers provided beforehand. \"How many?\" means two elephants, and so on. So once you ask this question, you'll probably get a variety of answers from everyone. Once they're done, say the real answer."
    },
    {
      "title": "Continue playing until most people know the answer.",
      "content": "Continue playing until most people know the answer. For some people, the answer shouldn't take very long. For others, they'll think you're doing really complex math and will attempt long equations having to do with the first numbers you provided. After a while, these people will give up and will walk away wondering. Eventually, they'll find out."
    },
    {
      "title": "Give hints to beggars.",
      "content": "Give hints to beggars. Some people may be so frustrated about the simple riddle that they'll be dying for hints. The biggest hint you can give away is something like \"Bop, beep, beep, beep bop. How many?\" Don't even provide numbers anymore, and only have a question. Then they'll probably get it."
    },
    {
      "title": "Tell them how to do it.",
      "content": "Tell them how to do it. Only do this if they are really mad and frustrated. It isn't worth spoiling a good puzzle over someone who's just curious . If they are really aggravated by it, tell them how. It's not worth losing a friend over."
    }
  ]
}