{
  "url": "https://www.wikihow.com/Change-the-Default-Media-Player-on-a-Mac",
  "title": "A Quick Tutorial to Change the Default Video Player for iOS",
  "steps": [
    {
      "title": "Right-click the file you want to open.",
      "content": "Right-click the file you want to open. You can change the default media player for any audio or video file on your Mac. Use your mouse or touchpad to move your cursor on the file, and right-click on it to expand a drop-down menu of options."
    },
    {
      "title": "Click Get Info.",
      "content": "Click Get Info . This option should be at the top of the third section on the right-click menu. It will open a new window with the file and format details of this video."
    },
    {
      "title": "Click the arrow next to Open with (to expand the menu).",
      "content": "Click the arrow next to Open with (to expand the menu). The default media player for this file type will display. If the \"Open with\" panel is already open, you can skip this step to expand the menu since clicking this arrow will only close the panel if it's open."
    },
    {
      "title": "Click the currently listed default player.",
      "content": "Click the currently listed default player. This will prompt a list of apps compatible with your file type to drop-down. [1] X Research source Click Other if you don't see your favorite media player displayed in the list. Alternatively, click App Store at the bottom of the menu to see a list of available software for download. It will open the Mac App Store, and list all media players that will play, edit, or convert this file format."
    },
    {
      "title": "Select a media player from the list.",
      "content": "Select a media player from the list. Click on the media software you want to set as your new default player for this file format."
    },
    {
      "title": "Click Change All.",
      "content": "Click Change All . This will change your default media player selection for all files with the same file format extension. You will have to confirm your action in a pop-up box by clicking Continue . Changing the default player for an audio or video format will not apply your changes to all file formats. For example, if you change the default video player for MOV files, you will still have to change it for AVI files manually."
    }
  ]
}