{
  "url": "https://www.wikihow.com/Blow-Dry-and-Add-Volume-to-Your-Hair",
  "title": "How to Blow Dry and Add Volume to Your Hair",
  "steps": [
    {
      "title": "Wash your hair with shampoo and then apply conditioner.",
      "content": "Wash your hair with shampoo and then apply conditioner. Choose shampoo and conditioner that are right for your hair type. If your hair is dry, buy a moisturizing shampoo. If your hair is too oily, buy a shampoo designed for oily hair. Use a volumizing conditioner, unless your hair already has too much volume. [1] X Research source Use about a dime to a quarter-sized amount of both shampoo and conditioner. Rinse out the conditioner with cool water to seal the cuticle."
    },
    {
      "title": "Towel dry your hair.",
      "content": "Towel dry your hair. Do not rub your hair! Instead, blot it gently and repeatedly with a towel. Try to get all the excess moisture out. [2] X Research source You can use an old T-shirt instead of a towel to reduce frizz."
    },
    {
      "title": "Put in volumizing, alcohol-free mousse.",
      "content": "Put in volumizing, alcohol-free mousse. [3] X Expert Source Gina Almona Professional Hair Stylist Expert Interview. 12 December 2019. Put a tennis-ball sized amount of mousse into your hands. Apply the mousse from the roots of your hair to the ends. If you have longer hair, put it up near your scalp, too. The same products do not work for everyone, especially in terms of mousses and volumizing products. If you try a mousse and it does not work well for your hair, ask your hairstylist what kinds of products are be best for blow drying your hair."
    },
    {
      "title": "Wait until your hair is mostly dry.",
      "content": "Wait until your hair is mostly dry. Before you begin blow drying, your hair should be at least 60% dry. Keep blotting with a towel if you do not have the time for your hair to just air dry. This might seem like a long time to wait, but, to protect your hair and prevent frizziness after blow drying, the 60% dry rule is really important! [4] X Research source"
    },
    {
      "title": "Apply heat protectant to your hair.",
      "content": "Apply heat protectant to your hair. [5] X Expert Source Gina Almona Professional Hair Stylist Expert Interview. 12 December 2019. Use a thermal heat protectant that prevents damage from the heat of the blow dryer. [6] X Research source Heat protectants come in many different forms. Sometimes they are sprays, but they can often be oils. Apply it lightly and evenly to all of your hair."
    },
    {
      "title": "Divide your hair into sections.",
      "content": "Divide your hair into sections. [7] X Expert Source Gina Almona Professional Hair Stylist Expert Interview. 12 December 2019. These sections should depend on the width, texture, and length of your hair. Secure them with hair clips on top of your head. Leave the bottom layer of your hair down. You should blow dry this section first. Then, let the other sections down gradually as you blow dry the rest of your hair. If you have really thin hair, you should opt for 4 to 6 sections for your whole head. If you have thick hair, you can divide it into 10 or more sections. Take your time, and make the sections as small as you can without sacrificing too much time."
    },
    {
      "title": "Put your blow dryer on a low heat.",
      "content": "Put your blow dryer on a low heat. While many people think that a hotter blow dryer is be more effective, it could give you dry, frizzy hair. Put your blow dryer on the lowest possible setting. [8] X Research source If the lowest possible setting seems really ineffective, try the next highest setting. However, your hair should be mostly dry by the time you even begin blow drying, so the blow dryer should be used more as a styling tool than a drying method."
    },
    {
      "title": "Wrap 1 section of hair around a round brush.",
      "content": "Wrap 1 section of hair around a round brush. Do not wrap it all the way around the brush. Pull the brush (with the hair wrapped around it) to create tension on your hair, and begin to blow dry from the tips of the hair, moving the round brush up from the tips, to the middle of the hair strand, and finally to the roots. [9] X Research source Before releasing the brush, blast your hair with cool air for a few seconds to set the curl.. Make sure that you have a high quality blow dryer with a nozzle to direct the air at the round brush. [10] X Research source Place the hair on top of the brush and direct the air from the blow dryer beneath the brush to add volume to your roots. The type of brush you need will vary with your hair type. While people with thicker, more textured hair may want to opt for a paddle brush, people with thinner, fine hair may want a ceramic round brush. If you have questions about what is best for your hair, consult your hairstylist."
    },
    {
      "title": "Repeat this process with all the sections in the bottom layer of your hair.",
      "content": "Repeat this process with all the sections in the bottom layer of your hair. Release the sections one at a time from the next layer of your hair. Repeat the same drying process for all the layers of your hair."
    },
    {
      "title": "Blow dry your hair until it is warmer than room temperature.",
      "content": "Blow dry your hair until it is warmer than room temperature. Many people, especially if they start with wet hair, do not blow dry their hair until it is thoroughly dry and also warm. Run your hands through all of your hair, making sure that it is warmer than the room temperature. Especially check the bottom and back of your head for cold spots. If you blow dry your hair but leave it cold, it could get dry and frizzy. [11] X Research source"
    },
    {
      "title": "Blow hair up and back from your face.",
      "content": "Blow hair up and back from your face. When all of your hair is dry, blow it all backwards, away from your face. Part your hair. [12] X Research source If you want extra volume, part your hair on the opposite side than you typically do. Add any finishing products that you like (such as Moroccan oil) and style further."
    }
  ]
}