{
  "url": "https://www.wikihow.com/Become-a-Facebook-Roleplayer",
  "title": "How to Become a Facebook Roleplayer",
  "steps": [
    {
      "title": "Understand what a roleplayer is.",
      "content": "Understand what a roleplayer is. Many people don't understand roleplaying at all, and just see roleplayers as posers, which they are most certainly not! The definition of a roleplayer (or Facebook roleplayer in this case) is: someone who assumes or acts out a particular role . Basically, roleplaying involves picking a character from a TV show, movie, book, or even from the celebrity line-up and acting as them. It's exactly the same thing on Facebook. Just make sure to tell people that you are a roleplayer and who you are supposed to be, so that everyone is clear as to what is happening."
    },
    {
      "title": "Choose your character to roleplay.",
      "content": "Choose your character to roleplay. Either select someone as discussed in the previous step or make up your own character. This latter creation is known as an \"original character\" OC for short. Or, you mix a bit of reality and fantasy together to create your own character based on the category of a TV show, movie, or book. For example, you could create a character who is supposed to be a media or literary character's nonexistent brother, sister, boyfriend, etc. This is quite handy for favorite characters who were killed off, changed for the worst or simply disappeared!"
    },
    {
      "title": "Create a new Facebook account.",
      "content": "Create a new Facebook account. Instead of using your actual Facebook account, just make a new one to roleplay on. Make absolutely sure that if you are roleplaying as a celebrity to put in your name that you're fake or put 'Rp' for Roleplay. Look up roleplayers from your genre of roleplay. For example, if you were to choose to be a Harry Potter roleplayer, you would look up Harry Potter characters in the Facebook search box, add them, and then roleplay with them."
    },
    {
      "title": "Understand the roleplay language.",
      "content": "Understand the roleplay language. Don't be caught off guard – there are some key Facebook roleplay terms that it's important to know and understand. Here are some key ones: Rp – Roleplay, or RPer would be roleplayer. OOC – Out of character. You would use this if you are writing a status as the real you. For example, 'OOC: My real boyfriend just proposed to me!' You can also use double parenthesis. For example, ((I gotta go. Let's continue next time)). // When writing on another roleplayers' wall as the real you. For example, '//Want to roleplay?'. Starter – this is what you need to start roleplaying and is used for starting the roleplay session. Make a starter by writing on that person's wall. Starters are usually hard for a lot of roleplayers to write, but just a \"I was walking down the streets of town when I saw, [Person's name]. \"Hello!\" I called out, running and hugging [him or her]\" will do. Then they reply on your wall and this will start a roleplay! Para only – this means that you paragraph roleplay. Usually all replies and starters are about a five to seven sentence paragraphs and contain lots of detail."
    },
    {
      "title": "Start roleplaying.",
      "content": "Start roleplaying. When roleplaying with somebody, make sure not to use chat speak language. Use good spelling and grammar so that they can understand you. Make sure to notify them before you start roleplaying with them, then send them a starter."
    },
    {
      "title": "If you are roleplaying as a celebrity, let people know that you aren't real.",
      "content": "If you are roleplaying as a celebrity, let people know that you aren't real. Sometimes people think you are real, or that you're \"posing\". To make sure that people know that you aren't that celebrity, try putting the word(s) \"Fake\" or \"Not Real\" in your name. Also, add the real celebrity, then tag them in a post. For example, write a status putting @ and then the person's name, saying \"I am a roleplayer, and @(Celebrity's name) Is the real.\""
    },
    {
      "title": "Keep roleplaying.",
      "content": "Keep roleplaying. Now you are a roleplayer! Now it's time to spread your wings and try a few more things. Here are some good beginning things to try: Find a boyfriend or a girlfriend. Make absolutely certain that the person is also a roleplayer before \"wooing\" them. Also, if you are a lesbian or gay roleplayer, make sure that they are, too, before you ask them out, so they won't block you or delete you. To ask them out, just say, \"Hello, I noticed that we are both single roleplayers, and want to know if you would be my (girlfriend/boyfriend) on roleplay only. Please let me know if you are interested,\" in a message to them. Broaden your additions. Don't only add roleplayers from the same category as you. Just because you are a Harry Potter roleplayer doesn't mean you can't add Twilight roleplayers. You can end up having a lot of fun if you mix things up a little bit. Add family members, too, or join a family. 'ShadowCullen's' and 'McJonas' are two popular Facebook roleplay families."
    },
    {
      "title": "Using symbols for actions.",
      "content": "Using symbols for actions. If you don't feel like writing paragraphs, you can just talk normally like you usually would. For actions you can use symbols like *. For example, *hugs you really tight*."
    }
  ]
}