{
  "url": "https://www.wikihow.com/Create-a-Status-on-WhatsApp",
  "title": "How to Create a Status on WhatsApp: Step-by-Step Guide",
  "steps": [
    {
      "title": "Open WhatsApp Messenger.",
      "content": "Open WhatsApp Messenger. The WhatsApp icon looks like a green box with a white speech balloon and a telephone in it. [1] X Research source A Status on WhatsApp can be seen by your contacts and disappears after 24 hours, similar to Snapchat Stories ."
    },
    {
      "title": "Tap Updates.",
      "content": "Tap Updates . This is at the bottom-left corner (iPhone) or at the top (Android). If WhatsApp opens up to a conversation, tap the back button in the upper-left corner."
    },
    {
      "title": "Tap +.",
      "content": "Tap + . This is at the top of the screen, next to My status ."
    },
    {
      "title": "Create your Status.",
      "content": "Create your Status. Tap the white circle at the bottom of your screen to take a picture, or hold it down to record video. To flip the camera, tap the two curved arrow icons in the bottom-right corner. You can also select a photo or video from your Camera Roll at the bottom-left of your screen to add it to your Status."
    },
    {
      "title": "Edit your Status.",
      "content": "Edit your Status. Use WhatsApp's tools to add text, emoji, and drawings on your Status update. [2] X Research source Tap the Pencil icon in the upper-right corner to make colorful drawings on your Status update. Tap the T icon to add text. You can make your text any color or size, and you can move it around to put it anywhere. Tap the Sticker icon to add a sticker, emoji, or avatar. Tap the Crop button to adjust or crop the picture."
    },
    {
      "title": "Tap the Send button.",
      "content": "Tap the Send button. It looks like a tiny paper plane in the lower-right corner of your screen. It will add this update to your Status. To delete a status, return to the Updates tab. Tap your status, and then tap the three-dots icon next to the status. Tap Delete ."
    },
    {
      "title": "Open the WhatsApp desktop app.",
      "content": "Open the WhatsApp desktop app. You can also use WhatsApp in a browser at https://web.whatsapp.com/ . If you aren't already logged in, do so now."
    },
    {
      "title": "Click the Status icon.",
      "content": "Click the Status icon. This looks like a circle surrounded by three curved lines. You can find this at the top of the left panel."
    },
    {
      "title": "Click +.",
      "content": "Click + . This is at the top of the screen, next to My status ."
    },
    {
      "title": "Click Photos & videos.",
      "content": "Click Photos & videos . If you only want to post text, click Text instead."
    },
    {
      "title": "Select a photo or video.",
      "content": "Select a photo or video. Use the pop-up window to navigate your device. Select the file, and then click Open . If you want to post text, enter your text into the editor."
    },
    {
      "title": "Edit your Status.",
      "content": "Edit your Status. Use WhatsApp's tools to add text, emoji, and drawings on your Status update. Click the Pencil icon in the upper-right corner to make colorful drawings on your Status update. Click the T icon to add text. You can make your text any color or size, and you can move it around to put it anywhere. Click the Sticker icon to add a sticker, emoji, or avatar."
    },
    {
      "title": "Click the Send button.",
      "content": "Click the Send button. It looks like a tiny paper plane in the lower-right corner of your screen. It will add this update to your Status. To delete a status, return to the Updates tab. Click your status, and then click the three-dots icon at the top. Click Delete ."
    }
  ]
}