{
  "url": "https://www.wikihow.com/Most-Loyal-Zodiac-Sign",
  "title": "Ranking the Loyalty of Astrological Signs",
  "steps": [
    {
      "title": "Cancer",
      "content": "Cancer is the sign that's totally got your back. Water signs tend to be super loyal and Cancer is the perfect example of that. They'd never dream of cheating on a partner or betraying a friend—they're just too empathetic! This sign is like a personal counselor to their friends and family. They're amazing emotional supporters. Keep your Cancer friend on speed dial—this is someone who'll be there for you any time, night or day. [1] X Research source If you're romantically involved with a Cancer , lucky you! You're with someone who'll stay with you through thick and thin—Cancer's in the relationship for the long haul."
    },
    {
      "title": "Taurus is one of the most honest and dependable signs.",
      "content": "Taurus is one of the most honest and dependable signs. Taurus won't test you or play games—they're straightforward because they want security in their relationships. Their ultimate goal is total loyalty, but it has to be mutual. To get a Taurus to devote themselves to you , show that you'll do the same for them, too. This fixed sign just wants to be a homebody or enjoy the friendship you two have built. Need some really good advice? Taurus is the person for you—they won't sugarcoat their opinions, but they'll also give you helpful, honest guidance."
    },
    {
      "title": "Leo shows their loyalty through leadership.",
      "content": "Leo shows their loyalty through leadership. Leos consider themselves to be the ruler of a pack, so they feel that friends and relationships are critical. Leo's friends know they'll get support and help from the Leo in their life, and in return, Leo gets to be a leader. It's a win-win! It's true that these fire signs are wild, exciting people, but when you really need them, they'll be there. You can count on a Leo!. [2] X Research source"
    },
    {
      "title": "Capricorn",
      "content": "Capricorn thrives on loyalty and stability. If you want a friend till the end, a Capricorn's the person for you. It can take a little time for them to warm up to new friendships or relationships, but once they do, they're in it for life. They might be the most responsible friend in the zodiac, so you know you can always rely on your Capricorn. [3] X Research source To Capricorns, loyalty is a two-way street—don't be surprised if your Cap expects you to be just as devoted as they are."
    },
    {
      "title": "Scorpio can be loyal to the point of obsession.",
      "content": "Scorpio can be loyal to the point of obsession. You probably think of Scorpio as being a mysterious and secretive sign, but if they fall for you or become your bestie, it means they're committed to you for life! Feel like a Scorpio's testing you? They totally are—Scorpios have to know if their friend or partner is loyal to them, so be prepared. If it seems like Scorpio's a little distrustful at times, it's because they fear betrayal. Show your Scorpio that you're loyal and they'll love you forever! Reader Poll: We asked 485 wikiHow readers who are Scorpios what they value most in a relationship, and 69% of them agreed that loyalty is most important to them. [Take Poll]"
    },
    {
      "title": "Virgo is steadfast and dependable.",
      "content": "Virgo is steadfast and dependable. If a Virgo gives you their word, rest assured that they'll keep it. Sure, Virgo may not be as exciting or spontaneous as other zodiac signs, but they're definitely loyal. If you need anything, Virgo tends to bend over backward to help you out. [4] X Research source If you've noticed that your Virgo partner or friend is constantly helping you out, it's a really good sign. Virgo shows their loyalty by being useful."
    },
    {
      "title": "Aries prioritizes themselves and their own goals.",
      "content": "Aries prioritizes themselves and their own goals. This means that Aries will put their own needs and desires above their loyalty to you—so their dedication may fluctuate. But you can trust that Aries still cares about you and will be there when it really counts, even when they’re off doing their own thing! Aries is the sign that might say something hurtful in the heat of the moment, but they'll be fiercely loyal if you're committed to the relationship."
    },
    {
      "title": "Pisces",
      "content": "Pisces loves flexibility, so they're not terribly reliable. The Most Likely to Ghost award would definitely go to Pisces. Though they mean well, this water sign spends their days wrapped up in daydreams—meaning, they might not always be the most dependable. However, if you've got their attention, they'll give you their all. Pisces will let you vent to them for hours if you need it. Pisces will try their best to be there for you, but they may not always follow through. This sign would insist you call them so they can offer you emotional support, but forget that their phone was about to die!"
    },
    {
      "title": "Libra is a loyal friend, but inconsistent in romantic relationships.",
      "content": "Libra is a loyal friend, but inconsistent in romantic relationships . Libras are known for being one of the most outgoing signs, and they're super dedicated to their close friends. However, Libras tend to flip flop, so when they're in a relationship, they want out; when they're not in one, all they can think about is finding a relationship. A flirty Libra might have the best time ever at your romantic, candlelit dinner—but that doesn’t mean they’re skipping the date they had planned for afterward! With a friend though, Libra is a ride or die. This is the pal who’d show up an hour before your big date with tons of fabulous outfits for you to try on."
    },
    {
      "title": "Aquarius fears losing their independence, so they're not the most reliable.",
      "content": "Aquarius fears losing their independence, so they're not the most reliable. It might not make sense—Aquarius is such a humanitarian, but they struggle with relationships. It's just super hard for them to get excited about commitment ! Your Aquarius friend might bail on hanging out at the last minute or stand you up after you've made reservations. Aquarius is a tough nut to crack, but they're the sign to go to when you want to have a totally unique conversation or get a fresh perspective."
    },
    {
      "title": "Gemini is so unpredictable that it's hard to trust them.",
      "content": "Gemini is so unpredictable that it's hard to trust them. Air signs like Gemini are impressionable—they're thinkers who frequently change their minds. If it seems like they blow hot and cold, it's because they totally do! Their inconsistency can make friendships or relationships with a Gemini a little tricky. [5] X Research source Gemini can change their opinion so quickly it can make your head spin, so you may not want to ask for their advice. If you're with a Gemini, you can build trust over time, especially if you strengthen the relationship by having deep, thoughtful conversations. But it may not come easily!"
    },
    {
      "title": "Sagittarius loves the idea of loyalty, but they find it hard to be tied down.",
      "content": "Sagittarius loves the idea of loyalty, but they find it hard to be tied down. Fire signs like Sagittarius are passionate—loyalty is like throwing water on the blaze. They just don't do usually do commitment in a relationship since they value their freedom too much. The good news is that Sagittarius has a much easier time being steadfast in friendships. Looking for excitement and adventure with a pal? Sagittarius has got you covered!"
    }
  ]
}