{
  "url": "https://www.wikihow.com/Get-Smoke-Smell-Out-of-Car",
  "title": "14 Easy Ways to Get Smoke Smell Out of Your Car Permanently",
  "steps": [
    {
      "title": "Letting in the fresh air can help the smoke smell disappear.",
      "content": "Letting in the fresh air can help the smoke smell disappear. On a clear and sunny day, open up all the doors and windows on your vehicle. Take out your floor mats and lay them out in the sun to help them air out. Keep your doors or windows open as long as you possibly can so the breeze blows through your vehicle. [1] X Research source If you have a garage or enclosed parking spot, keep your windows cracked when you park your car to let the odors vent out. The UV rays from the sun can also help kill odor-causing bacteria on your floor mats."
    },
    {
      "title": "Smelly smoke particles can stick to everything you keep in your car.",
      "content": "Smelly smoke particles can stick to everything you keep in your car. Start by throwing away any trash on the floors or ashes in the ashtray since they create the strongest odors. If you have any other items in your vehicle, like seat covers, clothes, backpacks, or bags, take them out and clean them separately so the smell doesn’t linger around. [2] X Research source If you’re trying to remove smoke smell from clothes , put them in a load of laundry with ½ to 1 cup (115 to 230 g) of baking soda and let them air out to dry. To get cigarette smoke out of a bag , wash it by hand with laundry soap and let it air out to dry."
    },
    {
      "title": "A vacuum will lift up any ash particles and smelly residue.",
      "content": "A vacuum will lift up any ash particles and smelly residue. Use a bristle brush attachment to vacuum the area around your center console and dashboard where ashes are most likely to gather. For the floors and upholstery, use a long narrow attachment to reach into deep seams and crevices. [3] X Research source After vacuuming, try spraying an antibacterial air freshener like Febreze to help kill the odor."
    },
    {
      "title": "Baking soda absorbs unpleasant smoke smells within 2 hours.",
      "content": "Baking soda absorbs unpleasant smoke smells within 2 hours. Spread a thin, even layer of baking soda over any carpet or upholstered surfaces in your vehicle. Let the baking soda sit in your vehicle for at least 2 hours so it has time to absorb and neutralize the smoke odors. After that, run your vacuum over the surfaces with an upholstery attachment to suck up all the baking soda. [4] X Research source To make baking soda even more effective, let it sit in your vehicle overnight so it has more time to absorb the odors."
    },
    {
      "title": "Activated charcoal",
      "content": "Activated charcoal , cat litter, and used coffee grounds all trap odors. Put either activated carbon, cat litter, or used coffee grounds in a tray on the floor, or pour them into sachets to avoid making a mess. Keep the odor absorbers inside your vehicle overnight, or even for a few days, so they have time to absorb the smoky smells trapped inside of your vehicle. [5] X Research source"
    },
    {
      "title": "Vinegar contains acids that break down odor-causing smoke particles.",
      "content": "Vinegar contains acids that break down odor-causing smoke particles. Mix a solution that’s half warm water and half distilled white vinegar. Spray the solution on a microfiber towel or soft-bristle brush, and scrub surfaces like your dashboard, ashtray, cup holders, door seals, and trim. If you’re trying to get smoke smell out of vinyl car seats, vinegar solution works great too. [6] X Research source Don’t worry about your car smelling like vinegar when you’re finished since the odor will dissipate after it’s dry. If vinegar doesn’t work, try switching to a chemical-based all-purpose car cleaner to cut through the smoke smell."
    },
    {
      "title": "Car fabric cleaners",
      "content": "Car fabric cleaners penetrate the seatbelt fibers to get rid of the odor. Pull your seatbelt out as far as it can go and hold it in place. Spray the fabric cleaner directly onto the seatbelt. [7] X Research source Scrub the seatbelt with a towel or soft-bristle brush in the direction of the fibers to prevent the seatbelt from fraying. Then, wipe off the surface with a clean towel. For additional odor-fighting power, brush a mixture 1 US tbsp (15 ml) of dish soap, 2 US tbsp (30 ml) of distilled white vinegar, and 1 c (240 ml) of warm water onto the seatbelt. Test the solution in an inconspicuous spot first to make sure it doesn’t change the color."
    },
    {
      "title": "A dedicated odor-fighting leather cleaner prevents damage to the fabric.",
      "content": "A dedicated odor-fighting leather cleaner prevents damage to the fabric. Spray the leather cleaner onto a clean microfiber towel or soft-bristled brush. Gently scrub the leather on your seats, steering wheel, and center console to work the cleaner into the pores of the fabric. Once you’re finished, wipe up any leftover cleaner with a clean towel. [8] X Research source If you still notice a smoky smell on the leather, try cleaning it again to work the cleaner even deeper into the fabric. Apply a conditioner when you’re finished cleaning to help maintain the leather."
    },
    {
      "title": "Smelly ash particles can stick and create a haze on the glass.",
      "content": "Smelly ash particles can stick and create a haze on the glass. Spray glass cleaner onto a clean microfiber towel and wipe off the interior glass surfaces. Move the towel in circular motions over all of the windows, windshield, rearview mirror, and sunroof if you have one. [9] X Research source"
    },
    {
      "title": "Odor neutralizers",
      "content": "Odor neutralizers run through your vents to remove the smoky smell. Turn your vehicle’s AC to the highest fan setting and the coldest temperature. Set the air to recirculate so you don’t pull any in from outside. Spray your odor neutralizer into the AC intake vents, which are usually at the fronts of the driver and passenger footwells. Let the fans run for about 10 minutes so the neutralizer moves through the vents and removes the smoke smell from your air conditioner . [10] X Research source To prevent smoke odors from your AC in the future, change the air intake setting to pull from the outside and set it to full blast if you smoke in the car again. That way, the air won’t keep circulating inside."
    },
    {
      "title": "Steam flushes out odors from areas with the most smoke buildup.",
      "content": "Steam flushes out odors from areas with the most smoke buildup. The headliner is the upholstery on the roof’s interior, and it normally has the strongest smell as smoke floats up into it. Turn your steam cleaner onto a low heat setting and put on an upholstery attachment. Run the steam cleaner across the headliner, focusing on the area above the driver’s side seat. Once you finish, wipe the headliner off with a dry cloth. [11] X Research source Keep your doors and windows open while you steam-clean so the moisture can vent out. If moisture gets trapped, it could make your car smell a little musty."
    },
    {
      "title": "An air freshener helps mask residual odors in your vehicle.",
      "content": "An air freshener helps mask residual odors in your vehicle. As a quick fix, try rubbing dryer sheets over the surfaces in your vehicle to lift up the scent and make your car smell good . Alternatively, hang an air freshener from your mirror or attach it to the vents so the smell spreads any time you run the AC. [12] X Research source As a natural air freshener, try putting citrus peels in a sachet to use as potpourri."
    },
    {
      "title": "A dirty filter might be holding onto the smoke odors in your vehicle.",
      "content": "A dirty filter might be holding onto the smoke odors in your vehicle. Check your car’s manual to find where the cabin air filter is located, but you’ll usually be able to access it at the back of your glove compartment. Pull the paper filter out and gently brush or vacuum it to remove the loose particles. If the filter doesn’t look any cleaner or is still smelly, get a new filter instead. Avoid running your vehicle without a cabin air filter since dust and dirt could blow into your vehicle when you run your fans."
    },
    {
      "title": "An ozone generator reaches stubborn odors in hard-to-reach places.",
      "content": "An ozone generator reaches stubborn odors in hard-to-reach places. Turn on your vehicle and set the fan to recirculate on the highest setting. Put the ozone generator inside your and shut the doors and windows. Plug the generator in and let it run for about 30–45 minutes. After that, unplug the ozone generator. Open your vehicle’s doors and set the fan to intake outside air for another 20–30 minutes so the smells can air out. [13] X Research source Avoid sitting in your vehicle while running the ozone generator since it can irritate your eyes and nose."
    }
  ]
}