{
  "url": "https://www.wikihow.com/Play-Ludo",
  "title": "Ludo: Setup, Instructions, & How to Win",
  "steps": [
    {
      "title": "Place your 4 pieces in the corner of the same color.",
      "content": "Place your 4 pieces in the corner of the same color. Play a game of Ludo with 2–4 players of any age. Choose one of the 4 corners on the board as your home base and take all 4 pieces that are the same color. Put all 4 of the pieces inside of your home base to finish setting up. [1] X Research source A Ludo board is split into 4 arms. Each arm has 3 columns of squares where the outer columns are part of the main track and the center, or “home column,” is the same color as one of the player’s pieces."
    },
    {
      "title": "Determine the first player by rolling the die.",
      "content": "Determine the first player by rolling the die. Let each player take a turn rolling the die. Whoever rolls the highest number takes the first turn of the game. After that, each player takes turns going clockwise around the board. [2] X Research source If you’re playing with younger kids, have the youngest person go first. If players tie for the highest number, re-roll the dice until someone wins. Variation: Some people may play Ludo using 2 dice instead of 1. Whoever has the highest total is the first player."
    },
    {
      "title": "Roll a 6 to move a piece out of your base onto the main track.",
      "content": "Roll a 6 to move a piece out of your base onto the main track. If you roll a 1-5, you can't use your roll to move a piece to the main track. The pieces in your home base aren’t considered “in the game” until they move onto the squares of the main track, so rolling 6s early will be key. Roll the die on your turn, and move your piece into the starting square on the board if you got a 6. If you get a 1–5 when all your pieces are in the home base, then your turn ends without making a move. [3] X Research source"
    },
    {
      "title": "Roll the die a second time after each time you get a 6.",
      "content": "Roll the die a second time after each time you get a 6. After any time you roll a 6, you earn a bonus roll. When you roll a 1–5, move the piece on the starting space that number of squares clockwise around the board’s main track around the outside of the board. If you roll another 6, either choose to move the piece that’s in the starting space around the board or move a second piece from your base into the starting space. Additionally, you get another bonus roll. [4] X Research source If you roll three 6s in a row, then your turn automatically ends."
    },
    {
      "title": "End your turn after moving a piece if you didn’t roll a 6.",
      "content": "End your turn after moving a piece if you didn’t roll a 6. Once you move a piece after rolling any number besides a 6, end your turn. Hand the die to the next player on your left so they can take their turn. [5] X Research source"
    },
    {
      "title": "Roll the die to move a piece during each of your turns.",
      "content": "Roll the die to move a piece during each of your turns. At the start of each turn, roll the die. If you have multiple pieces in play on the board, choose one of them to move during your turn. Any time you roll a 6, you have the option to move a piece out of your home base onto the main track or move a different piece around the board. [6] X Research source If you don’t have any pieces on the main track and you didn’t roll a 6 to move one from your home base, end your turn without doing anything. Variation: If you’re playing with 2 dice, you can split the dice between 2 pieces or move a single piece the total number. So if you rolled a 2 and a 4, you could either move one piece 2 spaces and another piece 4 spaces, or move a single piece 6 spaces."
    },
    {
      "title": "Land in a space with an opponent's piece to send it back to their base.",
      "content": "Land in a space with an opponent's piece to send it back to their base. If the dice roll makes you land exactly in the same space as another player’s piece, take their piece off of the board. Place the piece back in their home base to set them back. On their turn, the other player must roll a 6 again to get the piece back onto the board’s main track. [7] X Research source"
    },
    {
      "title": "Move onto the same space as one of your pieces to make a block.",
      "content": "Move onto the same space as one of your pieces to make a block. If you land on the same square as another one of your pieces, place them next to or on top of each other to create the block. The other players cannot land on or pass the square with a block, but you can still move through them with your pieces to get ahead on the board. [8] X Research source If there is a block 3 spaces away from your piece and you roll a 4, you cannot move and must pass your turn. On a future turn, you’re allowed to split the movement between the pieces you’re blocking with if you roll an even number. For example, if you roll a 4, you could move both pieces forward 2 spaces. If you’re not able to move any other piece, you must move one of the pieces you’re using to block."
    },
    {
      "title": "Try to land on marked safe spaces (if your board has them).",
      "content": "Try to land on marked safe spaces (if your board has them). Some versions of Ludo have additional markings on certain spaces, such as globes or stars. When you land on a globe, your piece can’t be captured by another player, so you’re safe until you move it again. If you land on a star, then move forward on the board to the next star on the track. [9] X Research source If another player has their piece on a globe space that’s the same as your starting space, you can capture it by rolling a 6 and moving one of your pieces out from your home base."
    },
    {
      "title": "Move your pieces into your home column once you go around the board.",
      "content": "Move your pieces into your home column once you go around the board. Make 1 complete lap clockwise around the board’s main track until you reach the bottom square of the home column. Rather than continuing around the outer track, now your piece can move into the home column toward the finishing square in the middle. [10] X Research source Only pieces that match the color of the home column are allowed to move into them. Once you move a piece into the home column, it can’t be captured by any other players."
    },
    {
      "title": "Roll the exact number you need to get pieces into the finishing square.",
      "content": "Roll the exact number you need to get pieces into the finishing square. Once you move a piece into your home column, you cannot jump over your own pieces. If you roll the exact number of spaces you need to reach the finishing square in the middle of the board, then move your piece there. If you roll a lower number, you’re still able to move that many spaces forward, but if you roll higher, you must choose a different piece to move. [11] X Research source Example: If you have 1 space to move and roll a 2 or higher, you cannot move that piece into the finishing square."
    },
    {
      "title": "Win the game by moving all 4 of your pieces to the finishing square.",
      "content": "Win the game by moving all 4 of your pieces to the finishing square. Continue taking turns and moving your pieces around the board and into your home column. Roll the exact number you need for each of your pieces so you’re able to move them into the finishing square. As soon as a player gets all 4 of their pieces into the middle of the board, they’ve won the game! [12] X Research source"
    }
  ]
}