{
  "url": "https://www.wikihow.com/Make-a-Cover-Page",
  "title": "How to Make a Cover Page",
  "steps": [
    {
      "title": "Keep the letter to one page.",
      "content": "Keep the letter to one page. A cover page for a resume should be formatted as a professional letter, with the cover only one page in length. The document should be aligned to the left and single-spaced, with a blank line separating each paragraph. [1] X Research source You should usually use standard 1-inch (2.5-cm) margins, but you can use margins as small as 0.7 inch (1.8 cm) as long as they are the same on all sides."
    },
    {
      "title": "Include your contact information in the upper left corner.",
      "content": "Include your contact information in the upper left corner. Each of these components should be placed on a separate line. Be sure to include your full name, address, phone number, and e-mail address. This will make it easy for potential employers to contact you. [2] X Research source If you have a fax number, you should include it below your phone number and above your e-mail address."
    },
    {
      "title": "Write the full date below your contact information.",
      "content": "Write the full date below your contact information. Write the date in Month, Day, Year format if you are in the United States. Most other Western countries use a Day, Month, Year format, while China and Japan use Year, Month, Day. [3] X Research source Write out the full name of the month, rather than abbreviating by using a number. For example, rather than write 1/1/2001, you should write January 1, 2001. Leave a blank line above and below the date."
    },
    {
      "title": "State the name and address of the receiver.",
      "content": "State the name and address of the receiver. Name the specific contact you are sending your resume to, along with his or her title and the address of the company. The receiver's name and title should be listed on the same line and separated by a comma. The name of the company should be written below the name of your contact, and the address of the company should be placed below that. [4] X Research source Note that you do not need to include an e-mail address, phone number, or fax number for the company. If you do not know the name of a specific contact at the company, skip over that information."
    },
    {
      "title": "Address the receiver by name.",
      "content": "Address the receiver by name. Formally address the reader with the word \"Dear.\" You should address your letter to a specific person whenever possible. [5] X Expert Source Amber Rosenberg, PCC Founder of Pacific Life Coach Expert Interview. 8 March 2022. When you are unable to find a specific name, though, you can address the letter to \"Dear Hiring Manager,\" \"Dear Hiring Professionals,\" or \"Dear Selection Committee.\" [6] X Research source When you can determine the gender of the receiver, leave out his or her first name and address the receiver as \"Mr.\" or \"Ms.\" For example, \"Dear Ms. Smith\" or \"Dear Mr. Johnson.\" If you do not know the gender of the receiver, skip the title and use his or her full name. For example, \"Dear Pat Roberts.\" Leave a blank line before and after you address the receiver. Try to find the correct name of the person by looking at the job description, the organization's website, or the organization's LinkedIn profile. [7] X Expert Source Amber Rosenberg, PCC Founder of Pacific Life Coach Expert Interview. 8 March 2022."
    },
    {
      "title": "Write an introduction.",
      "content": "Write an introduction. The introduction should be brief and include your most basic, essential information.If you have had any previous contact with your reader or with the company, state that contact in your introduction. [8] X Research source If you are a student, state the university you attend and your major. Indicate what position you are applying for as well as how or where you heard about the position. You can also mention the name of a professional or academic contact you know who has a positive connection to the reader or company. Make your introduction stand out by starting off with an engaging hook. This could include a few unique, attention-grabbing lines, as well as relevant anecdotes, facts, or quotes. Include the specific value that you can bring to organization and/or role. [9] X Expert Source Amber Rosenberg, PCC Founder of Pacific Life Coach Expert Interview. 8 March 2022."
    },
    {
      "title": "Highlight your skills in one to three body paragraphs.",
      "content": "Highlight your skills in one to three body paragraphs. Use the body of your letter to explain how you are qualified for the position and why you would be a good addition to the company. [10] X Expert Source Amber Rosenberg, PCC Founder of Pacific Life Coach Expert Interview. 8 March 2022. Make sure to include a few specific examples that prove your point. [11] X Research source Review the job ad and note any specific qualities requested by the employer. Touch on these qualities in your body paragraph. [12] X Expert Source Amber Rosenberg, PCC Founder of Pacific Life Coach Expert Interview. 8 March 2022. List any special projects, awards, or accomplishments that have a clear connection to the skill set requested by the employer. Whenever possible, use numbers to give concrete examples of the scope, frequency, and scale of the work you've done. For example, include metrics that show how you saved the company money, increased efficiency, increased sales, retained customers/clients, and/or grew your team. [13] X Expert Source Amber Rosenberg, PCC Founder of Pacific Life Coach Expert Interview. 8 March 2022. Above all, be specific, memorable, and concise. [14] X Expert Source Amber Rosenberg, PCC Founder of Pacific Life Coach Expert Interview. 8 March 2022."
    },
    {
      "title": "Briefly conclude your letter.",
      "content": "Briefly conclude your letter. Write a short concluding paragraph that expresses your eagerness about the position. [15] X Expert Source Amber Rosenberg, PCC Founder of Pacific Life Coach Expert Interview. 8 March 2022. At this point, you can also request an interview or state that you intend to contact the reader in several weeks. [16] X Research source You can include your phone number and e-mail address, as well, but it is not entirely necessary since this information is included in your header. Your conclusion is where you confidently tell the reader that you'll bring value to their organization. This is your last chance to convince them that you'll be a great fit, so keep the focus of the conclusion on the strengths and transferable skills that you have. [17] X Expert Source Amber Rosenberg, PCC Founder of Pacific Life Coach Expert Interview. 8 March 2022."
    },
    {
      "title": "Close the letter formally.",
      "content": "Close the letter formally. Type a polite closing like \"Thank you\" or \"Sincerely,\" then include your full typed name four lines below your closing. Sign your name by hand in between the closing and your typed name. [18] X Research source Always use black ink to sign formal documents."
    },
    {
      "title": "Provide your name and address in the header.",
      "content": "Provide your name and address in the header. Use a formal letterhead if you have one. Otherwise, type your full name and the address of your company or institution at the center top of your cover page. Include your phone number and your fax number beneath your name and address. Leave at least two blank lines below this header and the rest of the document."
    },
    {
      "title": "Format the cover sheet in two columns.",
      "content": "Format the cover sheet in two columns. The contact information for both you and the receiver should be indicated toward the top of the page. These columns should be double-spaced. It's a good idea to save your document as a template for future fax use, since the general format will remain the same. The most important quality to your fax cover sheet is that it be clear and easy to read."
    },
    {
      "title": "List the date, receiver's name, sender's name, and sender's phone number in the left column.",
      "content": "List the date, receiver's name, sender's name, and sender's phone number in the left column. Each piece of information should be labeled, and each label should be in all capital letters and followed by a colon. Label the date with \"DATE,\" the receiver's name with \"TO,\" your name with \"FROM,\" and your phone number with \"PHONE.\" In the United States, the date will be written in \"Month, Day, Year,\" while in most other countries, it will be written \"Day, Month, Year.\""
    },
    {
      "title": "List the time, both fax numbers, and your e-mail address in the right column.",
      "content": "List the time, both fax numbers, and your e-mail address in the right column. Each piece of information should be labeled, and each label should be in all capital letters and followed by a colon. Label the time with \"TIME,\" the receiver's fax number with \"FAX,\" your fax number with \"FAX,\" and your e-mail address with \"EMAIL.\" Note that the receiver's name and fax number should be placed on the same horizontal line. Likewise, your name and fax number should be placed on a shared horizontal line of their own."
    },
    {
      "title": "Indicate the number of pages.",
      "content": "Indicate the number of pages. Directly below the information in your left column, state the number of pages contained in the fax. Introduce this information with something like, \"Number of pages including cover sheet:\" Note that this line does not need to be in all capital letters."
    },
    {
      "title": "Include a brief message.",
      "content": "Include a brief message. The message does not need to be more than a few lines. Clearly state the sort of document being faxed and why you are faxing it to the receiver. [19] X Research source If you had previous contact with the receiver concerning this fax, state that information. Introduce your message with the label \"MESSAGE:\" Below your message, ask the receiver to verify the receipt of the document by calling the phone number provided or using the e-mail address provided."
    },
    {
      "title": "Write a disclaimer, if necessary.",
      "content": "Write a disclaimer, if necessary. If the information is confidential, clearly state that it is for the use of the intended receiver only and that use by another receiver is strictly prohibited. Include the request that you be contacted should the full fax not be received, or if the fax has been received accidentally, i.e. you sent it to the wrong fax number. Specific privacy guidelines for transmission of protected confidential information may vary. If you work for a health provider, you may need to follow additional guidelines to protect the privacy of your client."
    },
    {
      "title": "Include your contact information.",
      "content": "Include your contact information. Type your full name, address, phone number, and e-mail address in the upper left corner of the cover page. While you may choose to include the title of your manuscript on the cover page, this is a separate document from the title page. Use your real name. If you are submitting the manuscript under a pen name, you can follow your real name with your pen name. Introduce a pen name with \"A.K.A.\" or \"(Pen name: John Doe).\" If you're submitting your work to a context that will be judged anonymously, you'll include your contact information on the cover page, while omitting your name and contact information from the title page."
    },
    {
      "title": "List the word count.",
      "content": "List the word count. Your approximate word count should be placed in the upper right corner. If you are submitting to a context which has a strict word count, make sure you are following the guidelines, or your work will be automatically disqualified. You do not need to use an exact word count. For instance, if your manuscript is 63,472 words, round it off to 63,000 or 63,500. Introduce the word count with \"Approximately ______ words.\""
    },
    {
      "title": "Include the title of your manuscript.",
      "content": "Include the title of your manuscript. In the middle of the page, center the full title of your manuscript. Your title should never be longer than one line. Typing the title in all capital letters is a fairly common practice, but it is not necessary. It's not necessary to underline, italicize, or bold the title."
    },
    {
      "title": "Finish with the name of the author.",
      "content": "Finish with the name of the author. On the line below your title, list the name you want to publish under. This can be your real name or a pen name. [20] X Research source You don't have to include any indication of copyright protection, as your work is automatically protected. Never bind or connect the pages of your manuscript in any way. Your cover letter, like the other pages of your manuscript, should be unbound and placed in an envelope or box."
    },
    {
      "title": "Use a standard font and margin.",
      "content": "Use a standard font and margin. Unless otherwise specified by your instructor, your cover page should be in 12-point Times New Roman font and double-spaced. Use a standard 1-inch (2.5-cm) margin on all sides of the title page."
    },
    {
      "title": "Place a running head in the upper left corner.",
      "content": "Place a running head in the upper left corner. A running head is a header that will be found on each page of your paper. Your running head should include an abbreviated form of the title. Introduce the running head with the words \"Running head.\" Follow this label with a colon. The running head itself should be in all capital letters. The running head should be no longer than 50 characters, including spaces and punctuation."
    },
    {
      "title": "Include the page number in the upper right corner.",
      "content": "Include the page number in the upper right corner. Since this is the first page of your essay, the page number will be “1.” Use standard numerals, not Roman numerals or written numbers. The page number and running head should be evenly aligned horizontally."
    },
    {
      "title": "Center the title.",
      "content": "Center the title. The title should be placed roughly one-third of the way down from the top of the page. Generally, this would place the title about 2 inches below the header line. Capitalize the first letter of all major words but not for minor words. For example: How to Make a Cover Page Do not italicize, bold, or underline the title."
    },
    {
      "title": "Include your name below the title.",
      "content": "Include your name below the title. On the line directly below the title, include your first name, middle initial, and last name. If other students were involved in your study or essay, their names must be listed, as well. Separate each name with a comma."
    },
    {
      "title": "Include the name of your institution.",
      "content": "Include the name of your institution. The line directly below your name should state the institution you are associated with. The first letter of each major word should be capitalized. For example, if you are submitting the paper for a class taken at the University of North Carolina at Asheville, you should include this in the line beneath the author's name (i.e. your name, and the names of your co-authors.) Check with your professor for any additional guidelines."
    },
    {
      "title": "Use a standard font and standard margins.",
      "content": "Use a standard font and standard margins. Use 12-point Times New Roman font and 1-inch (2.5-cm) margins on all sides. Keep the alignment centered. [21] X Research source Be aware that cover pages are not standard in MLA format, but some professors do request them."
    },
    {
      "title": "Center the title.",
      "content": "Center the title. The title should be placed roughly one-third of the way down from the top of the page. The first letter of each major word should be capitalized, but minor words should be left in lowercase. For example: How to Make a Cover Page. If you have a subtitle, include it below the title. [22] X Research source Do not bold, italicize, or underline either the title or the subtitle."
    },
    {
      "title": "Write your full name.",
      "content": "Write your full name. Skip several lines below the title, and make sure to include both your first and your last name. If other people collaborated with you on this paper, include their names as well. [23] X Research source Your name should be written using the same font and size as the other words on your title page. Don't try to use a cute or clever font for any part of your cover page, as professors don't care for this."
    },
    {
      "title": "List the receiver of your paper.",
      "content": "List the receiver of your paper. Beneath your name, write the name of your instructor, name of the class, and date. Each of these elements should be listed on a separate line. Make sure each line is double-spaced. [24] X Research source Introduce your instructor as \"Dr.\" when appropriate. If you cannot use this title to address your instructor, at least introduce him or her as \"Professor.\" For example, \"Dr. John Doe\" or \"Professor John Doe.\" Include both the course name and number."
    },
    {
      "title": "Use a standard font and standard margins.",
      "content": "Use a standard font and standard margins. Most professors prefer you use 1-inch (2.5-cm) margins on all sides and a 12-point Times New Roman font. The cover page should be center-aligned. [25] X Research source In Chicago style, cover page and title page refer to the same thing. Your professor may have other requirements. Make sure you use the preferred formatting for your course."
    },
    {
      "title": "List the title first.",
      "content": "List the title first. Your title should be typed about a third of the way down from the top of the page. It should be centered on the page. [26] X Research source Capitalize the first letter of each major word in your title, but not those belonging to minor words. For example: How to Make a Cover Page Alternatively, some style guides suggest that the title be presented in ALL CAPS. Do not underline, italicize, or bold the title. If you have a subtitle, place a colon following your title and write the subtitle on the following line."
    },
    {
      "title": "Write your full name.",
      "content": "Write your full name. You should go several lines beneath the title, and write your first and last name. If you collaborated with other authors, make sure to include their names as well, separated by a comma. [27] X Research source Your name should be typed about three quarters of the way down the page. Use the same font and size that you've used throughout the cover page."
    },
    {
      "title": "Specify the subject, instructor, and date in your final section.",
      "content": "Specify the subject, instructor, and date in your final section. Note that this final section should be double-spaced, and each of these elements should be listed on a separate line. [28] X Research source Include both the name and course number of the subject. Write your professor's full name and title. Use \"Dr.\" only when appropriate. For example: \"Dr. John Doe\" or \"Professor John Doe.\""
    }
  ]
}