{
  "url": "https://www.wikihow.com/Pay-French-Tolls",
  "title": "How to Pay French Tolls",
  "steps": [
    {
      "title": "Drive on to a toll motorway.",
      "content": "Drive on to a toll motorway. These motorways are marked with the word \"Péage.\" You should see this on signs for the motorway before you enter it, so you know you're getting on a pay road. Most major motorways in France have tolls, though, so keep that in mind. [1] X Research source Every vehicle on the road is subject to a toll. The main motorways that don't have tolls are bypasses around big cities."
    },
    {
      "title": "Grab your ticket as you enter the motorway.",
      "content": "Grab your ticket as you enter the motorway. The French system is a closed one, so you enter a tollbooth right as you get on the motorway. Hit the button in the booth and pick up the ticket to take with you. [2] X Research source Don't lose the ticket, as it shows how far you've driven on the tollway. If you lose it, you'll likely need to pay the highest fee for the road."
    },
    {
      "title": "Enter a lane marked by a green arrow or credit card symbol to pay with a credit card.",
      "content": "Enter a lane marked by a green arrow or credit card symbol to pay with a credit card. You'll enter the tollbooth when the toll road runs out or when you exit the toll motorway. As you approach, identify the lanes that take credit cards. Typically, these are marked with electronic symbols at the top. One symbol looks like a series of credit cards stacked together. Alternatively, find the lane with a single green arrow pointing down, which indicates all forms of payment are accepted. [3] X Research source Avoid the lane that just has a stylized \"t\" and a number next to it, as that's for the automatic payment system. The credit card lanes accept CB, Visa, Eurocard Mastercard, Confinoga, DKV, EuroShell, Essocard, Total GR, and Eurotraffic. [4] X Research source"
    },
    {
      "title": "Look for a green arrow if you need to pay with cash.",
      "content": "Look for a green arrow if you need to pay with cash. Find the lane that accepts all forms of payment, which is marked by a large green arrow pointing down. Avoid the lanes that just have credit card symbols or stylized \"T\" symbols, as they won't accept cash. [5] X Research source If you have a foreign credit card, you may want to pay with cash all the time. Sometimes, the machines have trouble with cards from other countries. [6] X Research source Euros are the preferred currency, but some areas accept Swiss francs, British pounds, and US dollars, as well as checks. [7] X Research source"
    },
    {
      "title": "Insert your ticket into the machine to determine how much you need to pay.",
      "content": "Insert your ticket into the machine to determine how much you need to pay. Grab the ticket you got from the tollbooth when you entered the motorway. Insert it into the machine according to the directions and wait for an amount to pop up. When it does, that's the amount you need to pay. [8] X Research source The amount is given in euros."
    },
    {
      "title": "Pay the requested amount and exit the motorway.",
      "content": "Pay the requested amount and exit the motorway. If you're in a credit card lane, insert your credit card with the chip first to pay the toll. If you're in a cash lane, pay the attendant or insert your cash into the machine; wait for your change before leaving the lane. [9] X Research source If you have problems, you can push the button to call the attendant."
    },
    {
      "title": "Purchase a toll pass ahead of time.",
      "content": "Purchase a toll pass ahead of time. You can purchase a pass through Eurotunnel or emovis tag. Set up your toll account by linking the pass to your bank account. Attach the pass to the top of your windshield on the inside of your vehicle as per the instructions. Then, you can go through the toll without stopping and your account will automatically be charged. [10] X Research source To purchase a tag, visit https://www.emovis-tag.co.uk/ . The initial cost is about 40 EUR in 2019. The tag itself is 20 EUR, which is refundable if you return it to the company after you're done. It has a 6 EUR annual fee plus a 5 EUR fee for each month you use it, up to 10 EUR in a year. This initial fee also puts money in your toll account to cover the tolls you go through."
    },
    {
      "title": "Enter a liber-T lane at the tollbooth.",
      "content": "Enter a liber-T lane at the tollbooth. When getting on the motorway, look for an electronic symbol that's the stylized lowercase \"t.\" It's typically orange. Some lanes will have a speed limit next to this symbol, usually 30 kilometres (19 mi) per hour. [11] X Research source You don't need to grab a ticket. Just wait for the beep and drive through."
    },
    {
      "title": "Go through the liber-T lanes when exiting the motorway.",
      "content": "Go through the liber-T lanes when exiting the motorway. These are also marked with a stylized lowercase \"t\" and sometimes a speed limit. All you need to do is drive through them, and the tollbooth will charge your pass. [12] X Research source Listen for the \"beep\" from your auto tag system to make sure it's charged. If you're worried, go through the slower lanes where you actually need to stop and then move the tag around until it beeps and lets you through."
    },
    {
      "title": "Expect withdrawals from your account.",
      "content": "Expect withdrawals from your account. As your toll account gets low, this system makes an automatic withdrawal from your bank account. Make sure to keep an eye on the toll account so you're not surprised by a sudden withdrawal. [13] X Research source"
    },
    {
      "title": "Expect your tolls to be higher for heavier vehicles.",
      "content": "Expect your tolls to be higher for heavier vehicles. French tolls are divided into 5 classes. The first class is \"lighter vehicles,\" which includes all sedans. To fall into this class, your vehicle and anything you're towing must be under 2 metres (6.6 ft) tall, plus the car and the towing vehicle can only weigh 3,500 tonnes (3,900 sh tn) together. The next class is \"intermediate vehicles,\" where the height of the vehicle and anything you're towing must be between 2 to 3 metres (6.6 to 9.8 ft); the weight for this class is the same as lighter vehicles. Class 3 is for trucks and buses with 2 axles. Vehicles over 3 metres (9.8 ft) tall and 3,500 tonnes (3,900 sh tn) fall into this category, unless they have more than 2 axles. Class 4 is for trucks and buses with 3 or more axles. Class 5 is motorcycles and tricycles. Every class is progressively more expensive with the exception of class 5, which is the cheapest."
    },
    {
      "title": "Estimate your route based on 0.10 EUR per 1 kilometre (0.62 mi).",
      "content": "Estimate your route based on 0.10 EUR per 1 kilometre (0.62 mi). Toll roads range anywhere from about 0.03 EUR to 0.53 EUR per 1 kilometre (0.62 mi) for lighter vehicles, depending on the road. However, the high end is the exception rather than the rule, so aim for the 0.10 EUR per 1 kilometre (0.62 mi), and you should get a good idea of what your vehicle will cost. [14] X Research source Keep in mind, the cost is about double for intermediate vehicles."
    },
    {
      "title": "Put your routes in a toll calculator for a more precise estimate.",
      "content": "Put your routes in a toll calculator for a more precise estimate. List every city or site you plan to visit in order to lay out the route. Then, let the calculator figure out how much your tolls will be. The tolls will be given in euros, so you may need to convert them to pounds or your native currency. [15] X Research source Make sure to list every stop in order. If you do it out of order, you could throw off the cost of your trip. As an added bonus, these systems will give you turn-by-turn directions. Use a toll calculator like this one: https://www.autoroutes.fr/en/routes.htm ."
    }
  ]
}