{
  "url": "https://www.wikihow.com/Make-Sherbet-Powder",
  "title": "How to Make Sherbet Powder",
  "steps": [
    {
      "title": "Mix the ingredients in a bowl.",
      "content": "Mix the ingredients in a bowl. Add 1 teaspoon (5 g) of baking soda, 1 teaspoon (5 g) of food grade citric acid, 3 tablespoons (23 g) of icing sugar, and 2 tablespoons (19 g) of flavored gelatin crystals in the flavor of your choice to a small bowl. Use a spoon to mix the ingredients together well, so they’re fully blended. In some parts of the world, icing sugar is also known as powdered sugar. In some parts of the world, flavored gelatin is also known as jelly crystals. Food grade citric acid is usually sold in grocery and mass merchandise stores with the canning supplies. If you can’t find it in a local store, you can also order it online. The citric acid helps give the sherbet powder a sour taste to contrast with the sweetness of the sugar. It also reacts with the baking soda for a fizzy sensation. If you want sherbet powder to be more fizzy, you can add in a little more citric acid."
    },
    {
      "title": "Transfer the sherbet powder to a plastic bag for storage.",
      "content": "Transfer the sherbet powder to a plastic bag for storage. After you’ve mixed all of the ingredients, pour the sherbet powder into a sealable plastic bag for storage. Make sure that you have a separate bag for each flavor of powder that you’ve mixed up. You can substitute any airtight container for the plastic bag. A jar with a lid or a tupperware container will also work well."
    },
    {
      "title": "Serve the powder with lollipops or popsicles sticks.",
      "content": "Serve the powder with lollipops or popsicles sticks. A lollipop is one of the most common ways to enjoy sherbet powder. Lick the lollipop, dip it in the powder, and then lick it off. If you don’t want to use candy to eat the powder, you can just use a plain wooden popsicle stick to dip into it. Kids often enjoy just dipping their fingers into the sherbet powder and licking it off. This recipe will make a single flavor of sherbet powder. If you want to create more than one flavor, you’ll need 1 teaspoon (5 g) of baking soda, 1 teaspoon (5 g) food grade citric acid, and 3 tablespoons (23 g) of icing sugar for every 2 tablespoons (19 g) of different flavored gelatin that you plan to use."
    },
    {
      "title": "Grind the sugar in a food processor.",
      "content": "Grind the sugar in a food processor. Add 4 cups (500 g) of caster sugar to the bowl of a food processor. Process the sugar for approximately 1 minute or until it is finely ground. [1] X Research source In some areas of the world, caster sugar is superfine or bar sugar. If you don’t have a food processor, you can use a spice or coffee grinder."
    },
    {
      "title": "Mix in the citric acid and baking soda.",
      "content": "Mix in the citric acid and baking soda. Once you’ve ground the sugar, add 2 teaspoons (10 g) of food grade citric acid and 1 teaspoon (5 g) of baking soda to the food processor. Blend the mixture for another 30 seconds or until the ingredients are fully mixed. [2] X Research source In some areas of the world, baking soda is also known as bicarbonate of soda."
    },
    {
      "title": "Transfer half of the powder to a bowl.",
      "content": "Transfer half of the powder to a bowl. After the ingredients are fully blended, pour half of the powder into a separate bowl. Set it aside for the moment. [3] X Research source"
    },
    {
      "title": "Blend the lemon extract and yellow food coloring into the powder in the food processor.",
      "content": "Blend the lemon extract and yellow food coloring into the powder in the food processor. With half of the powder still in the food processor, add 2 to 3 drops of lemon extract and a small amount of yellow gel food coloring to the mixture. Blend it in the food processor again until it turns a light pastel yellow, and pour it into a clean bowl. [4] X Research source If you prefer, you can substitute orange extract for the lemon if you prefer. In that case, use orange gel food coloring to color the powder."
    },
    {
      "title": "Repeat the process with the remaining powder, raspberry flavoring, and red coloring.",
      "content": "Repeat the process with the remaining powder, raspberry flavoring, and red coloring. After you’ve removed the lemon flavored powder from the food processor, clean out the bowl and return the other half of unflavored powder to it. Add 2 to 3 drops of raspberry flavoring and a small amount of red food coloring to the mixture. Blend it as you did with the lemon powder until it turns a pale pink. [5] X Research source You can usually find raspberry flavoring in the baking aisle of the grocery store with the other flavor extracts."
    },
    {
      "title": "Transfer the sherbet powders to airtight containers for storage.",
      "content": "Transfer the sherbet powders to airtight containers for storage. After you’ve mixed up both flavors of the sherbert powder, pour them into airtight containers to store them. You should have a separate container for each flavor so they don’t get mixed together. [6] X Research source Sealable plastic bags work well for storing the sherbet powder."
    },
    {
      "title": "Dip lollipops into the powder to enjoy.",
      "content": "Dip lollipops into the powder to enjoy. To eat the sherbet powder, suck on your favorite flavor of lollipop. Dip the pop into the powder so it sticks to the surface and lick it off. You can also use wooden popsicles sticks or plastic spoons to dip into the powder. [7] X Research source If you don’t mind getting dirty, you can also dip your fingers into the powder to eat it."
    },
    {
      "title": "Grease a lollipop mold.",
      "content": "Grease a lollipop mold. To make the lollipop dippers, you’ll need a round lollipop mold with 12 holes. Use nonstick vegetable oil spray to grease the mold compartments so you can easily remove the lollipops after they’ve hardened. [8] X Research source You can usually find candy and lollipop molds at the craft store. If you prefer, you can choose a novelty-shape for your mold, such as stars or hearts. You don’t necessarily have to have a lollipop mold. Line a cookie sheet with parchment paper and grease it with nonstick spray. When you’ve made the candy for the lollipops, use a spoon to pour it onto the parchment paper in circles. You can use regular vegetable oil in place of the spray to grease the mold."
    },
    {
      "title": "Heat the sugar, golden syrup, cream of tartar, and water.",
      "content": "Heat the sugar, golden syrup, cream of tartar, and water. Add 1 ½ cups (300 g) of granulated sugar, 7 tablespoons (150 g) of golden syrup, ½ teaspoon (2 g) of cream of tartar, and 6 ounces (175 ml) of water to a large saucepan. Place the pan on the stove over medium heat until the sugar dissolves, which should take approximately 5 to 10 minutes. [9] X Research source You can usually find golden syrup in the baking aisle of the grocery store. However, in some parts of the world, you may find it in the international foods section. It’s best to use a deep saucepan so you don’t have to worry about the hot candy mixture boiling over as you cook it. Make sure to stir the mixture regularly as the mixture’s heating so the sugar crystals don’t stick to the pan."
    },
    {
      "title": "Bring the mixture to a boil.",
      "content": "Bring the mixture to a boil. Once the sugar has dissolved, add a clip-on candy thermometer to the side of the pan. Continue to heat the mixture until it comes to a boil, which should take another 5 to 7 minutes. [10] X Research source While you don’t have to stir the mixture as frequently as when the sugar was dissolving, mix it periodically to ensure that it’s heating evenly."
    },
    {
      "title": "Continue to heat the mixture until it reaches the hard-crack stage.",
      "content": "Continue to heat the mixture until it reaches the hard-crack stage. After the mixture has come to boil, keep heating it over medium heat. Watch the candy thermometer, and cook it until it reaches 309 degrees Fahrenheit (154 degrees Celsius) or the hard-crack candy stage. [11] X Research source The mixture will be extremely hot so be sure to handle it carefully."
    },
    {
      "title": "Remove the pan from the heat and add the extract and food coloring.",
      "content": "Remove the pan from the heat and add the extract and food coloring. As soon as the lollipop mixture reaches the proper temperature, take the pan off the heat. Add 1 teaspoon (5 ml) of orange or lemon extract and a small amount of gel food color in your choice of color, and stir well until the ingredients are completely blended. [12] X Research source You can substitute another fruit flavoring or extract, such as raspberry flavoring or lime extract, for the lemon or orange."
    },
    {
      "title": "Pour the mixture into the mold and add lollipop sticks.",
      "content": "Pour the mixture into the mold and add lollipop sticks. Once the mixture is flavored and colored, carefully pour it into the greased lollipop mold. Place a lollipop stick in each compartment so the pops will have a handle. [13] X Research source You can usually find lollipop sticks at the craft store. Be very careful when you’re pouring the candy mixture. It will be extremely hot, so it may burn your skin if you accidentally get it on yourself. If you’re not using a mold for the lollipops, allow the mixture to cool for approximately 5 minutes so it thickens and is easier to pour into a circle with a spoon."
    },
    {
      "title": "Allow the lollipops to cool completely before unmolding.",
      "content": "Allow the lollipops to cool completely before unmolding. After you’ve filled the mold, allow the lollipops to sit for 10 to 15 until they harden and cool completely. When they’re set, gently bend the mold to remove the lollipops. Give one a lick and dip it in your sherbet powder to enjoy. [14] X Research source Store any unused lollipops in individual cellophane bags."
    }
  ]
}