{
  "url": "https://www.wikihow.com/Convert-Micrometers-to-Nanometers",
  "title": "How to Convert Micrometers to Nanometers",
  "steps": [
    {
      "title": "Understand the relationship between micrometers and nanometers.",
      "content": "Understand the relationship between micrometers and nanometers. Micrometers and nanometers are both units of measurement in the metric system. Nanometers are smaller than micrometers. There are 1,000 nanometers in 1 micrometer."
    },
    {
      "title": "Determine the number of micrometers you are converting.",
      "content": "Determine the number of micrometers you are converting. This information should be given to you. Make sure you are supposed to convert micrometers to nanometers. If you are converting nanometers to micrometers, or between units of measurements other than these two units, you cannot use this method, as your calculations will be different . The micrometers might be listed as a whole number, or as a decimal. For example, you might need to convert 7.8 micrometers to nanometers."
    },
    {
      "title": "Multiply the number of micrometers by 1,000.",
      "content": "Multiply the number of micrometers by 1,000. Since you are converting a larger unit into a smaller unit, you will end up with more units than you started with. [1] X Research source Since there are 1,000 nanometers per 1 micrometer, to find the number of nanometers, multiply by 1,000. For example, 7.8 × 1 , 000 = 7 , 800 {\\displaystyle 7.8\\times 1,000=7,800} . So, 7.8 micrometers = 7 , 800 nanometers {\\displaystyle 7.8\\,{\\text{micrometers}}=7,800\\,{\\text{nanometers}}} ."
    },
    {
      "title": "Understand how nanometers are related to micrometers.",
      "content": "Understand how nanometers are related to micrometers. Both are units of measurement in the metric system. 1 micrometer equals 1,000 nanometers."
    },
    {
      "title": "Ensure you are converting nanometers to micrometers.",
      "content": "Ensure you are converting nanometers to micrometers. You should be given the number of nanometers you need to convert. If you are using measurements other than nanometers or micrometers, you would use different calculations and thus could not use this method. For example, you might need to convert 14,500 nanometers to micrometers."
    },
    {
      "title": "Divide the number of nanometers by 1,000.",
      "content": "Divide the number of nanometers by 1,000. When converting a smaller unit into a larger unit, you end up with less units than you started with. Thus, you need to divide. [2] X Research source Since there is 1 micrometer per 1,000 nanometers, to find the number of micrometers, divide by 1,000. For example, 14 , 500 ÷ 1 , 000 = 14.5 {\\displaystyle 14,500\\div 1,000=14.5} . So, 14 , 500 nanometers = 14.5 micrometers {\\displaystyle 14,500\\,{\\text{nanometers}}=14.5\\,{\\text{micrometers}}} ."
    },
    {
      "title": "Try this problem.",
      "content": "Try this problem. Convert 18 micrometers into nanometers. Since you are converting a larger unit (micrometers) into a smaller unit (nanometers), you should multiply. There are 1,000 nanometers in 1 micrometer. 18 × 1 , 000 = 18 , 000 {\\displaystyle 18\\times 1,000=18,000} 18 micrometers = 18 , 000 nanometers {\\displaystyle 18\\,{\\text{micrometers}}=18,000\\,{\\text{nanometers}}} ."
    },
    {
      "title": "Complete the following conversion.",
      "content": "Complete the following conversion. 300 nanometers = ___ micrometers. Since you are converting a smaller unit (nanometers) into a larger unit (micrometer), you should divide. There is 1 micrometer per 1,000 nanometers. 300 ÷ 1 , 000 = 0.3 {\\displaystyle 300\\div 1,000=0.3} 300 nanometers = 0.3 micrometers {\\displaystyle 300\\,{\\text{nanometers}}=0.3\\,{\\text{micrometers}}} ."
    },
    {
      "title": "Analyze the following conversion:",
      "content": "Analyze the following conversion: 3.8 __ = 3,800 __. Determine which value is stated in micrometers, and which value is stated in nanometers. There are 1,000 nanometers in 1 micrometer. Micrometers are larger than nanometers. This means a smaller number of micrometers will equal a larger number of nanometers. 3.8 × 1 , 000 = 3 , 800 {\\displaystyle 3.8\\times 1,000=3,800} 3.8 micrometers = 3 , 800 nanometers {\\displaystyle 3.8\\,{\\text{micrometers}}=3,800\\,{\\text{nanometers}}}"
    }
  ]
}