{
  "url": "https://www.wikihow.com/Get-a-Ladder-in-Animal-Crossing",
  "title": "6 Steps to Craft a Ladder in Animal Crossing: New Horizons",
  "steps": [
    {
      "title": "Build a house.",
      "content": "Build a house. Whether you're a new player or you just reset your island , you'll be charged 5,000 Nook Miles by Tom Nook in exchange for a tent and residency on the island. Once you pay off this debt, you'll be able to upgrade your tent into a house. To pay off the 5,000 Nook Miles debt, complete the activities in the NookPhone menu. This may involve fishing, catching bugs, speaking to villagers, etc. Selling creatures is also a great way to earn lots of Bells . When you have enough Nook Miles saved up, speak to Tom Nook again. He'll offer to upgrade your tent on the following day."
    },
    {
      "title": "Build Nook's Cranny.",
      "content": "Build Nook's Cranny. In early stages of the game, players can buy and sell goods with Timmy in the Resident Services tent. Building the store is another step you must complete to get the ladder DIY recipe. [1] X Research source To do so: Pay off the first 5,000 Nook Miles debt : This should be completed in the previous step. Upgrade from a tent to a house : This should be completed in the previous step. You must wait until the next day for the tent to upgrade. Place Blathers' tent : To get Blathers' tent, you must donate 5 unique bugs or fish to Tom Nook. Grab your net or fishing rod and start capturing creatures. When these milestones have been completed, return to Resident Services the following day. You'll now be able to supply Timmy with crafting materials to build Nook's Cranny. Gather and give the following : 30 softwood, 30 wood, 30 hardwood, 30 iron nuggets. Once the materials have been turned in, you'll be able to place down the Nook's Cranny plot marker. It will open the following day."
    },
    {
      "title": "Build your first bridge.",
      "content": "Build your first bridge. Once Nook's Cranny is built, Tom Nook will receive a phone call during his normal announcement; three villagers will be moving in soon. To prepare for their arrival, you'll need to build a bridge. Talk to Tom Nook at Resident Services to receive the bridge construction kit. Collect the following: 4 log stakes , 4 clay, and 4 stone. Visit a workbench to build the bridge construction kit. Once built, put down your bridge."
    },
    {
      "title": "Speak to Tom Nook.",
      "content": "Speak to Tom Nook. When the bridge has been built, Tom Nook will give you 3 housing kits for the new villagers. He'll also send you plenty of DIY recipes, which includes the ladder. If you're playing with another person on the same Switch, they'll need their own copy of the recipe. In this case, you can now find the recipe in Nook's Cranny for 500 Bells."
    },
    {
      "title": "Craft the ladder.",
      "content": "Craft the ladder. Visit a workbench and open the crafting menu. You'll need 4 softwood, 4 wood, and 4 hardwood. Find the ladder recipe card in the menu and select Craft it! You can now use the ladder to climb onto higher levels of the island."
    },
    {
      "title": "Unlock the Ladder Set-Up Kit Recipe (optional).",
      "content": "Unlock the Ladder Set-Up Kit Recipe (optional). This item allows you to place a permanent ladder anywhere on your island, making it easy for yourself and visitors to climb levels without their own ladder. You can find this recipe in Nook's Cranny for 2,000 Bells. To craft a wooden ladder set-up kit, you'll need 1 ladder and 5 wood."
    }
  ]
}