{
  "url": "https://www.wikihow.com/Can-You-Repeat-That",
  "title": "What's the Meaning of \"Can You Repeat That\" in English?",
  "steps": [
    {
      "title": "“Can you repeat that?” is used to ask someone to say something again.",
      "content": "“Can you repeat that?” is used to ask someone to say something again. This question is a polite way of asking someone to repeat themselves because you didn’t hear or fully understand them. [1] X Research source It communicates that you need clarification on what they just said, so feel free to use it in casual and professional settings—with strangers, loved ones, or colleagues."
    },
    {
      "title": "Ask “Can you repeat that?” if you didn’t hear or understand something.",
      "content": "Ask “Can you repeat that?” if you didn’t hear or understand something. Struggling to hear someone in a loud environment or fully understand what they’re saying? Use “Can you repeat that?” to politely ask them to repeat themselves. Asking for clarification shows that you’re genuinely interested in what they have to say, opposed to acting like you heard them. Them: “Hey, how was your weekend?” You: “Can you repeat that? Sorry, my phone is cutting out!”"
    },
    {
      "title": "“Could you repeat that?” sounds more formal than “Can you repeat that?”",
      "content": "“Could you repeat that?” sounds more formal than “Can you repeat that?” While both phrases are commonly used in formal and casual settings, “Can you repeat that?” is considered more direct and casual. “Could you repeat that?” is slightly more polite and formal because it implies a request, rather than assuming the other person will repeat themself for you. [2] X Research source Both “can” and “could” are modal verbs that express ability or possibility, but “can” suggests that something is very likely to happen. “Could” implies something might happen, but it also might not. If you’re speaking to your boss or someone of higher authority, use “Could you repeat that?” to be professional . If you’re speaking to your friend, family member, or romantic partner, “Can you repeat that?” is perfectly fine."
    },
    {
      "title": "The expression “Can you repeat that again?” sounds redundant.",
      "content": "The expression “Can you repeat that again?” sounds redundant. If you’ve already asked someone to repeat themself, “Can you repeat that again?” is grammatically correct. However, it’s semantically redundant since the word “repeat” implies another time, or “again.” [3] X Research source Instead, you could ask “I’m sorry, could you repeat that?” in formal settings, or “Say that again?” in casual settings."
    },
    {
      "title": "“Sorry, what did you say?”",
      "content": "“Sorry, what did you say?” This is one of the most popular ways to ask someone to repeat themselves in everyday conversation because it’s both friendly and polite. It works for every situation, so feel free to say it to friends, family members, your significant other, or close colleagues. If you’re speaking with your boss, say “I’m sorry” to sound more polite . Them: “Want to hit the beach next weekend?” You: “Sorry, what did you say?”"
    },
    {
      "title": "“I’m sorry?”",
      "content": "“I’m sorry?” This phrase works for both formal and informal settings, as long as you lean in toward the other person and use rising intonation. Your body language communicates that you didn’t hear them, and raising your voice at the end of the sentence signals that you need clarification about something. [4] X Research source Them: “Do you want to grab lunch sometime?” You: “I’m sorry?”"
    },
    {
      "title": "“Could you say that one more time?”",
      "content": "“Could you say that one more time?” If you already asked someone to repeat themselves but still don’t understand what they’re saying, use this polite question to ask them to repeat again. It works in both formal and informal situations, so feel free to say it in the workplace or in casual conversation. Them: “What are your thoughts on the new market?” You: “I’m sorry?” Them: “What are your thoughts on the new marketplace?” You: “Could you say that one more time?”"
    },
    {
      "title": "“Sorry, I still don’t understand. Can you rephrase what you said?”",
      "content": "“Sorry, I still don’t understand. Can you rephrase what you said?” If you can’t comprehend what someone is saying, and you’ve already asked them to repeat themselves, use this polite expression. Asking someone to rephrase something, or say it again in a different and clearer way, is one of the easiest (and most efficient) ways to get clarification. Them: “What accounts for changes in the grading system?” You: “Can you repeat that?” Them: “I said, ‘What accounts for changes in the grading system?” You: “Sorry, I still don’t understand. Can you rephrase what you said?”"
    },
    {
      "title": "“I’m sorry, I didn’t catch all the details. Could you repeat them?”",
      "content": "“I’m sorry, I didn’t catch all the details. Could you repeat them?” If you couldn’t hear everything that the other person just told you, preface your question with the phrase “I didn’t catch all the details.” This shows that you have a general idea of what they’re talking about, but you need them to repeat it one more time to fully understand them. Them: “The event is going to take place on December 5th. One hundred people are attending, and we need to contact the vendor for pamphlets, lights, invitations, the projector, and viewing system.” You: “I’m sorry, I didn’t catch all the details. Could you repeat them?”"
    },
    {
      "title": "“Would you mind speaking up? I’m struggling to hear you.”",
      "content": "“Would you mind speaking up? I’m struggling to hear you.” Whether you’re in a noisy environment or simply have a hard time hearing, use this question to ask someone to speak louder. There’s absolutely nothing wrong with asking them to raise their voice, and if you’re still having trouble hearing them, you can request to move to a quieter room. [5] X Research source Them: “How was your vacation? I heard you were in Hawaii for three weeks?” You: “Would you mind speaking up? I’m struggling to hear you over the music.”"
    },
    {
      "title": "“I’m afraid I missed what you said. Could you kindly repeat yourself?”",
      "content": "“I’m afraid I missed what you said. Could you kindly repeat yourself?” If you’re speaking to your boss or someone of higher authority, use the word “kindly” instead of “please” when making a request. It sounds more formal and respectful, so it’s a great way to appear professional in the workplace. Them: “During the team meeting next Friday, could you make sure you emphasize our KPIs, deadlines, and general policies?” You: “I’m afraid I missed what you said. Could you kindly repeat yourself?”"
    },
    {
      "title": "“I beg your pardon?”",
      "content": "“I beg your pardon?” Looking for a more formal way to say “Can you repeat that?” The question “I beg your pardon?” is a great alternative because it’s considered polite and professional. It can come across as old-fashioned, so reserve it for exchanges with an older boss or someone of higher authority. [6] X Research source Them: “I appreciate all the work you’ve put into the project. Was it as stressful as you imagined?” You: “I beg your pardon?”"
    },
    {
      "title": "“Say that again?”",
      "content": "“Say that again?” If you’re talking to a friend, family member, or your significant other, say this phrase with rising intonation to ask them to repeat something. It’s the shortened form of the expression “Can you say that again?” and you can replace “that” with the specific thing you need clarification on. [7] X Research source “Say that name again?” “Say that last part again?” “Say the restaurant name again?”"
    },
    {
      "title": "“Could you slow down a bit? I’m not following what you’re saying.”",
      "content": "“Could you slow down a bit? I’m not following what you’re saying.” Is your loved one speaking at lightning speed? Asking them to “slow down a bit” implies that you didn't hear everything they said because they were talking too fast. Reserve this expression for casual exchanges with friends, family members, or your S.O. because it may come off as rude or unprofessional in the workplace. Them: “I’m sooo excited for the party. I can’t wait to dress up and take cute photos together. What are you wearing, and what time should I pick you up?” You: “Could you slow down a bit? I’m not following what you’re saying.”"
    }
  ]
}