{
  "url": "https://www.wikihow.com/Connect-a-Keyboard-to-Galaxy-Tab-2",
  "title": "2 Ways to Use Your Samsung Galaxy Tab 2 with a Keyboard",
  "steps": [
    {
      "title": "Power on the keyboard and put it into pairing mode.",
      "content": "Power on the keyboard and put it into pairing mode. The process for this varies from keyboard to keyboard, but generally you'll need to turn it on. Some keyboards will also require you to press a \"Connect\" button."
    },
    {
      "title": "Open the Settings app on your Samsung Galaxy Tab.",
      "content": "Open the Settings app on your Samsung Galaxy Tab."
    },
    {
      "title": "Tap the \"Bluetooth\" slider to toggle it On.",
      "content": "Tap the \"Bluetooth\" slider to toggle it On."
    },
    {
      "title": "Tap your keyboard in the list of available devices.",
      "content": "Tap your keyboard in the list of available devices. Your Samsung Galaxy Tab will attempt to connect to the keyboard."
    },
    {
      "title": "Type the PIN that appears (if necessary).",
      "content": "Type the PIN that appears (if necessary). You may be prompted to enter a PIN in order for the Samsung Galaxy Tab to connect to the keyboard. Type the PIN on the keyboard to make the connection."
    },
    {
      "title": "Start using the keyboard.",
      "content": "Start using the keyboard. Once you make the connection, you should be able to begin using your keyboard immediately."
    },
    {
      "title": "If your keyboard isn't working, open the Settings app.",
      "content": "If your keyboard isn't working, open the Settings app. You may need to manually select your keyboard. Select \"Language & input\" Ensure that your keyboard is checked in the list of input methods."
    },
    {
      "title": "Plug the keyboard or dock into the port on the bottom of the Galaxy Tab.",
      "content": "Plug the keyboard or dock into the port on the bottom of the Galaxy Tab. You can use any USB keyboard if you get a USB OTG host cable. This adapter lets you connect a standard-sized USB plug to your Samsung Galaxy Tab. OTG is only supported on higher-end Galaxy Tabs."
    },
    {
      "title": "Start using the keyboard.",
      "content": "Start using the keyboard. As soon as you plug the keyboard in or set it in the dock, it should begin working immediately."
    },
    {
      "title": "If your keyboard isn't working, open the Settings app.",
      "content": "If your keyboard isn't working, open the Settings app. You may need to manually select your keyboard. Select \"Language & input\" Ensure that your keyboard is checked in the list of input methods."
    },
    {
      "title": "Power down your Samsung Galaxy Tab if the dock isn't recognized.",
      "content": "Power down your Samsung Galaxy Tab if the dock isn't recognized. There's a known error with some versions of the Samsung Galaxy Tab and the official dock. The quickest way to fix it is to follow this procedure: Power down the Samsung Galaxy Tab completely by holding the Power button and then selecting Power Off. Insert the powered-down Tab into the dock. Power the Samsung Galaxy Tab back on. Check the \"Language & inputs\" menu to ensure that your dock is enabled. Charge your dock. If it's still not working, give your dock some time to charge. It may not have enough power to work."
    }
  ]
}