{
  "url": "https://www.wikihow.com/Establish-an-Office-Filing-System",
  "title": "How to Create and Maintain an Effective Filing System",
  "steps": [
    {
      "title": "Label each folder alphabetically, by subject, or chronologically.",
      "content": "Label each folder alphabetically, by subject, or chronologically. Divide all the documents you have alphabetically, by subject, or by year. Place each pile in document binders or hanging file folders for a file bin or cabinet. [1] X Research source By subject: Professional organizer Ashley Moon recommends organizing office files “by category, like ‘Financial’ or ‘Legal.’” Alphabetically: Sort files in order from A to Z. This system might work best if most files are names of patients, clients, or customers you can sort by last name. Chronologically: Separate documents into a hanging folder for each year, then place them in order from newest to oldest so the most recent documents are in front. Organize undated documents by importance or how frequently you use them. Highlight the date on each document to help you find them more easily in the future."
    },
    {
      "title": "Color code each tab or folder to easily identify different file categories.",
      "content": "Color code each tab or folder to easily identify different file categories. Differently colored tabs or folders can save you time when searching for documents. You could assign a different color to each category of files (like green for bills and blue for project files) or color-code files you use regularly with a yellow tab and files you need to archive with a purple tab. You might use blue folders for household and individual family files, red folders for banking, bills, and investments, and yellow folders for property and vehicle information. [2] X Research source Create a color code key and tape it to the top of the file box or cabinet to keep track of the color assigned to each document category. Use a label maker to create neat, easy-to-read labels to attach to each file tab."
    },
    {
      "title": "Create a special folder for each major work project in progress.",
      "content": "Create a special folder for each major work project in progress. Instead of having one folder for spreadsheets, one folder for reports, and one folder for proposals, consider storing spreadsheets, reports, and proposals that all relate to one specific project in a single folder. This can ensure that you can quickly find what you need by looking for a particular project. Consider placing all plastic tabs on the left or right side of the files to make your file cabinet or box look neat ."
    },
    {
      "title": "Break up multiple documents in one folder into separate folders.",
      "content": "Break up multiple documents in one folder into separate folders. If a folder gets more than 1 ⁄ 2 inch (1.3 cm) thick, try breaking the documents up into smaller subfolders or subcategories. [3] X Research source If you have an overflowing folder for a client named “John Wohikiw,” you might divide it into subfolders labeled “Wohikiw, John Bills” and “Wohikiw, John Contracts.” If you have an overfilled hanging folder for the year “2019,” separate the documents into manila folders labeled with each month, like “March 2019,” “April 2019,” and “May 2019.” For a folder called “Household,” divide it into folders like “Utility Bills,” “Tax Statements,” “Receipts,” “Medical Records,” and “School Report Cards.” [4] X Research source"
    },
    {
      "title": "Shred or recycle any irrelevant documents once a week.",
      "content": "Shred or recycle any irrelevant documents once a week. Disposing of unnecessary files and documents each day can help reduce file build-up and keep your workspace clean and organized. Consider placing a small recycling bin, a paper shredder , or a basket of documents you need to shred near your desk. [5] X Research source Shred anything that includes your personal information or confidential company information. Recycle any generic junk mail, envelopes, and loose notes. [6] X Research source"
    },
    {
      "title": "Place a stack of manila and hanging folders next to the file cabinet or box.",
      "content": "Place a stack of manila and hanging folders next to the file cabinet or box. Make sure your filing system is in a secure location that’s easily accessible and place a stack of extra folders next to it. [7] X Research source This way, you can easily add a folder if you have a document that doesn’t fit easily into an existing folder. Hanging folders can be used as categories, while manila envelopes can act as subcategories that you can remove from the file cabinet or box."
    },
    {
      "title": "Keep any ongoing paperwork on your desk until you complete it.",
      "content": "Keep any ongoing paperwork on your desk until you complete it. Professional organizer Ashley Moon recommends keeping any “hot” or immediate paperwork “either in a red file or the front of your file drawer on your desk.” Once the job is done, move the work into the appropriate file folder. Every one or two weeks, move the files you’re no longer working on into the folders where your completed work is stored."
    },
    {
      "title": "Hang file holders next to your door to hold documents you just received.",
      "content": "Hang file holders next to your door to hold documents you just received. Instead of cluttering the top of your desk with files and folders, mount a wall file holder and label each space by the type of files that should go in each one. [8] X Research source A few labels you can use might include “Invoices,” “Receipts,” “Pending Bills,” “To File,” or “Current Project Documents.” Mount three magazine holders by your desk—one for projects due this week, one for things you plan to do in three months, and one for anything on which you’re waiting for a response. [9] X Research source"
    },
    {
      "title": "Scan documents and organize them in electronic files on your computer.",
      "content": "Scan documents and organize them in electronic files on your computer. If you have any archived files or files you’d like to send electronically, use a scanning machine to create digital copies. Create folders on your computer, organize them alphabetically, by subject, or by date, and sort your scanned files into their appropriate folders. [10] X Research source Digital copies can also be useful if you don’t have a lot of storage space or if you’d like to store your documents in a more secure place. For folders for specific projects, add subfolders like “Resources,” “In Progress,” “Final,” and “Scrap” so you can easily find what you need. [11] X Research source If there’s a folder you’d like to appear at the top when you sort them alphabetically, put a hyphen (-) before the name. [12] X Research source Rename photos with the year, month, and a short description of the picture so you can search for those keywords later. [13] X Research source If you have a picture of your brother and sister from a family vacation to Florida from March 2018, you might title it “2018-3 Brittany and Josh Florida Vacation.”"
    },
    {
      "title": "Set an expiration date for your files to shred or recycle them.",
      "content": "Set an expiration date for your files to shred or recycle them. Depending on the type of business you work for or what kind of files you're keeping, an expiration date might be a year, five years, or ten years. Set a day each year to shred or recycle any unnecessary files and go through your old folders to see if anything needs to be archived. [14] X Research source To archive files, digitize them or move them to a specialized archive box or drawer organized by year. [15] X Research source This can keep your main file system from getting cluttered with old documents. Relabel or replace any folders if necessary to make sure that each section is clean and organized correctly."
    }
  ]
}