{
  "url": "https://www.wikihow.com/Avoid-Becoming-a-Script-Kiddie",
  "title": "How to Avoid Becoming a Script Kiddie",
  "steps": [
    {
      "title": "Learn a programming language in-depth.",
      "content": "Learn a programming language in-depth. Hackers commonly prefer Python, C or C++, though the language is up to you. Try to avoid languages with bad reputations like Visual Basic. Batch or VBScript are not technically programming languages, they are shell scripts. Shell scripts have many limitations when compared to fully featured programming languages. ."
    },
    {
      "title": "Understand the underlying concepts of how operating systems function (i.e.",
      "content": "Understand the underlying concepts of how operating systems function (i.e. the Kernel), you will require an in-depth understanding of how both the Windows and Linux operating systems work."
    },
    {
      "title": "Don't threaten to hack people that anger you.",
      "content": "Don't threaten to hack people that anger you. It makes you seem petty and immature. Go for logical debates instead of just attempting to destroy someone. Even if you don't 'win' the argument, you will come out looking mature."
    },
    {
      "title": "Don't self-promote.",
      "content": "Don't self-promote. This goes for any kind of hobby or job. Even if you're good at what you do, don't constantly tell everyone how skilled you are at programming in Assembly language, or your grasp of how a buffer overflow is achieved."
    },
    {
      "title": "Don't fall into the lure of the black-hat hacking community, also known as \"malicious hackers\".",
      "content": "Don't fall into the lure of the black-hat hacking community, also known as \"malicious hackers\". They hack primarily for their own selfish gain, to inflict pain into people's lives, and for self-entertainment. Not only is it illegal to hack people's computers, but if you are caught you could do some jail time and you will find it next to impossible to attain a job with any kind of contact with computers. Companies do not want someone who has a history of hacking with malicious intent (think about it, why would a computer company employ a hacker who may hack them?). Use your skills to help people, there are so many really awesome jobs for ethical hackers."
    },
    {
      "title": "Resist the urge to use tools without understanding the concepts.",
      "content": "Resist the urge to use tools without understanding the concepts. Hacking tools can be great help in the process, but most tools are investigated by the companies they exploit, and therefore they don't usually work for long. If you understand the underlying concepts of programs and the operating systems, then with this knowledge, you can create your own exploits."
    },
    {
      "title": "Widen your interests, and keep an active social life.",
      "content": "Widen your interests, and keep an active social life. This isn't really related to script kiddies, but hackers in general often become so absorbed with their various projects on the computers, that they ignore their friends, or simply don't make friends."
    }
  ]
}