{
  "url": "https://www.wikihow.com/Become-a-Substitute-Teacher-in-New-York-City",
  "title": "How to Become a Substitute Teacher in NYC: Licensing, Fees, & More",
  "steps": [
    {
      "title": "Decide if you want to invest in the process.",
      "content": "Decide if you want to invest in the process. It will take about two to four months, patience with the Department of Education bureaucracy (DOE), and $416 for fees."
    },
    {
      "title": "Visit the NYC DOE website for basic information on subs:",
      "content": "Visit the NYC DOE website for basic information on subs: https://www.schools.nyc.gov/careers/substitute-teaching . You must wait for a certain date early in the fall to begin, and if you wait too long you may not be able to get certification that year (the DOE has a recruitment target for new subs)."
    },
    {
      "title": "Find a public school principal to nominate you for becoming a substitute.",
      "content": "Find a public school principal to nominate you for becoming a substitute. If you grew up in NYC you can go to your old high school; otherwise just contact a school close to where you live and schedule an interview with the principal. If you get turned down at one school, try another! Go in person if you have to without an interview scheduled. At any interview you of course want to dress professionally, bring your resume, and be prepared to discuss why you want to teach. [2] X Research source"
    },
    {
      "title": "Apply for substitute status.",
      "content": "Apply for substitute status. After the principal submits your name, you will receive an e-mail from the DOE. Follow the directions to fill out a substitute teacher application. [3] X Research source"
    },
    {
      "title": "Complete initial registration with the DOE.",
      "content": "Complete initial registration with the DOE. Once the DOE accepts your application, complete the employment forms and get fingerprinted. DOE fingerprinting costs $115 and requires going to their headquarters at 65 Court Street in Brooklyn."
    },
    {
      "title": "Complete online training.",
      "content": "Complete online training. Register on Sub-Hub, an education website, and complete the 5 required courses. You will receive instructions from the DOE on how to do this, and they pay for the courses. Each one will take about two hours, and when you finish them you need to print certificates. [4] X Research source"
    },
    {
      "title": "Purchase and complete three other workshops.",
      "content": "Purchase and complete three other workshops. The first two are the Preventing School Violence and Preventing Child Abuse & Neglect workshops through Sub-Hub. They're $10 each through the DOE, which is a steep discount from what you would pay as an individual. These workshops also take about two hours each. You also need to complete the Dignity for All Students Act (DASA) workshop, which has 3 hours of online training and an in person workshop. This costs $50.00, which must be in a money order (available from post offices). [5] X Research source"
    },
    {
      "title": "In any order you choose, complete the remaining requirements:",
      "content": "In any order you choose, complete the remaining requirements: (a) Get a tuberculosis test from a doctor or Department of Health clinic. It's free if you get it from a DOH clinic, and you will be given a list of locations. (b) Take the Academic Literacy Skills Test (ALST), the first of the three New York State Teacher Certification Exams (NYSTCE). [6] X Research source The test costs $131 and is offered daily at multiple locations. This is a very easy test, but you can find study materials for it at the public library, in NYSTCE prep books (Kaplan has a good one). (c) Create an online profile with the New York State Education Department, Office of Teaching Initiatives."
    },
    {
      "title": "Register for Assessment and Processing.",
      "content": "Register for Assessment and Processing. Once you've completed all of the above requirements and have all your paperwork in order, register for a substitute Combined Assessment & Processing event, where you turn in your paperwork and complete two workshops: SubCentral and BloodBorne Pathogens. [7] X Research source"
    },
    {
      "title": "On your scheduled date, bring all your paperwork to the DOE.",
      "content": "On your scheduled date, bring all your paperwork to the DOE. You'll need a $100 money order (which you can get from a post office), government photo ID, an original Bachelor's Degree diploma or official transcript showing a Bachelor's Degree, and the proof of completion for your online workshops and the ALST to the DOE on your Assessment date. The building is 65 Court Street, 19th floor, in downtown Brooklyn. [8] X Research source"
    },
    {
      "title": "At the Assessment and Processing, listen to all instructions in the classroom with the other applicants.",
      "content": "At the Assessment and Processing, listen to all instructions in the classroom with the other applicants. The administrators will tell you all the necessary steps for after the interview. Then write a 100 word essay (a test of your English skills) and wait in line for a personal interview (a test of your spoken English), which will be short."
    },
    {
      "title": "Register on SubCentral (the automated sub calling system), wait for your ID card in the mail, and make connections at any schools at which you want to sub.",
      "content": "Register on SubCentral (the automated sub calling system), wait for your ID card in the mail, and make connections at any schools at which you want to sub. You can receive jobs from random schools through SubCentral, but it will be quicker and easier for you to get jobs from schools where the principals know you. [9] X Research source"
    },
    {
      "title": "Enjoy making $199.27 each sub day!",
      "content": "Enjoy making $199.27 each sub day! Don't let the kids drive you crazy, and learn from your mistakes and from experienced teachers. If you sub for more than 40 days in one school year, you will have to take 6 professional education credits to be eligible for subbing in the subsequent year. If you want to sub for the next year, you must sub for at least 20 days in the current school year."
    }
  ]
}