{
  "url": "https://www.wikihow.com/Create-a-Church-With-Your-Fingers",
  "title": "How to Do the “Here’s the Church, Here’s the Steeple” Finger Game",
  "steps": [
    {
      "title": "Create the body of the church using your fingers.",
      "content": "Create the body of the church using your fingers. Open your hands and hold them about an inch apart. Turn your palms towards each other and put your fingers to the sky, then interlace your fingers so your digits face downwards, and your thumbs stay facing up. Keep your thumbs straight and pointing up at this stage. They will eventually create the doors of the hand church. If you’re having difficulty lacing your fingers, face your hands down and put them back to back, then push your fingers together and close your hands. [1] X Research source"
    },
    {
      "title": "Make the doors of the church with your thumbs.",
      "content": "Make the doors of the church with your thumbs. Keep your thumbs straight up and down and press them together—all your other fingers stay locked. You’re now ready for the first part of the rhyme: “ Here is the church .” [2] X Research source At this point, the tops of your knuckles on both hands form the roof of your finger church. Don’t leave any space between your thumbs."
    },
    {
      "title": "Use your fingers to create the steeple.",
      "content": "Use your fingers to create the steeple. Press the pads of both index fingers together while still holding them upward to make the steeple. Keep the rest of your fingers interlocked and your thumbs pressed together. Now it’s time for the next line: “ Here is the steeple .” [3] X Research source Make sure your fingers are in a triangle and touching at the top. Steeples have specific meaning to the church; some historians believe they symbolize Christians’ desire to lift their hearts and minds up toward heaven."
    },
    {
      "title": "Pulling your thumbs apart creates the open door.",
      "content": "Pulling your thumbs apart creates the open door. Swing your thumbs apart while holding your pointer fingers together. As you do this, keep your other fingers locked and tilt your wrists slightly upward to show the locked fingers inside your hands. Now say: “ Open the doors and… ” [4] X Research source Your locked fingers are the people sitting on pews inside the church."
    },
    {
      "title": "Use your fingers to show the people inside.",
      "content": "Use your fingers to show the people inside. They represent the people you’ve just revealed by opening the doors. Make those guys dance and say the final part of the rhyme: “ See all the people! ” [5] X Research source Say the last two lines (“open the doors and see all the people”) without any pause in between. You don’t have to wiggle your fingers, but it makes the whole ritual more fun."
    },
    {
      "title": "\"Here’s the parson going up the stairs. And here he is saying his prayers.\"",
      "content": "\"Here’s the parson going up the stairs. And here he is saying his prayers.\" [6] X Research source As you add the final line, finish with your hands pressed together in prayer. Press both hands (including your thumbs) together and point them at the sky to represent the parson praying. If you include this step, the rhyme can be a good way to encourage children to pray. A parson is a member of the clergy, especially Anglican. There’s another alternative ending that goes: \" Close the doors, and let them pray. Open the doors and they’ve all gone away! \" To do this, close your thumbs, then open your hands almost all the way, with your pinkies touching. This will surprise and thrill small children when they see the parishioners have vanished."
    }
  ]
}