{
  "url": "https://www.wikihow.com/Sharpen-Dog-Clippers",
  "title": "How to Sharpen Dog Clippers",
  "steps": [
    {
      "title": "Take the blades out of the clippers.",
      "content": "Take the blades out of the clippers. Before starting, make sure the cord is unplugged or, on cordless models, the switch is in the off position.The blades are held in place by one of two different methods: screws or a snap-on latch. Pushing on the tab which holds the blades to the clippers will cause the snap-on blade to “pop” open. It can then be pulled off to remove it from the clipper. Blades held to the clipper with screws usually have two screws holding them onto the clipper body. These will need to be removed before slipping the blade off the clipper. Store the screws in a safe place so you do not lose them. Also, make sure to remember how the blades came off the clippers, so you can figure out how to replace them when you are finished sharpening them."
    },
    {
      "title": "Brush out the blades.",
      "content": "Brush out the blades. Use a toothbrush, or the brush that came with the clippers, to brush out all hair from the blades. This is also a good time to clean out the clipper head with the brush."
    },
    {
      "title": "Use a cleaning solution to clean the blades.",
      "content": "Use a cleaning solution to clean the blades. [1] X Research source Wipe on a cleaning solution made for clippers with a cotton ball and scrub away any rust or debris. Alternatively, you can soak the blades for a few hours to remove really stuck on debris or rust. Oster, Andis, Wahl and other manufacturers all make lubricating/cleaning solutions for clipper blades. Alternatively, you can dip the blades, while still attached to the clippers, in a cleaning solution and run them for 5-10 seconds. [2] X Research source When done, wipe the blades off with a soft, clean cloth. Allow the blades to dry. Once they are dry you can sharpen them."
    },
    {
      "title": "Gather sharpening tools.",
      "content": "Gather sharpening tools. You will need a coarse 4000 grit surface whetstone (also called sharpening or honing stones) along with an 8000 grit stone. These can be purchased from hardware stores and sometimes come in a combined stone. If you have a ceramic blade in your clippers you will need to use a diamond sharpening stone instead of a whetstone. These can also be found in many hardware stores or can be found online."
    },
    {
      "title": "Spray water on the stones.",
      "content": "Spray water on the stones. If you spray water on the stone and the water absorbs immediately, then your stone needs to be soaked for 10 minutes. If you spray the stone and it absorbs some of the water but a thin sheen remains on the surface, then it is ready to use."
    },
    {
      "title": "Hold the blade at a 35-45 degree angle.",
      "content": "Hold the blade at a 35-45 degree angle. You do not want to drastically change the angle of the blade, you just want to hone the end of it, so keep it as close to the same angle it has already as possible. [3] X Research source It is very important to hold the blade at the correct angle, so take your time to find the right position. The blade should be held between your thumb and your ring finger."
    },
    {
      "title": "Move the blade side to side across the coarser stone five to ten times.",
      "content": "Move the blade side to side across the coarser stone five to ten times. Wipe it with the soft cloth to remove away the fine powder. Repeat the process with the other side of the blade."
    },
    {
      "title": "Repeat the movement across the fine 8000 grit whetstone.",
      "content": "Repeat the movement across the fine 8000 grit whetstone. Keep the same angle and repeat the movement five to ten times. The blade should look shiny when finished. Wipe the blades off when finished."
    },
    {
      "title": "Reassemble the clippers.",
      "content": "Reassemble the clippers. Now that you’ve sharpened your blades it’s time to put them back onto the clipper body. Snap or screw them back into to place. Place a few drops of clippers oil (a light oil) on the blades to lubricate them. Then turn the clippers on and run the blades to distribute the oil and to make sure everything works well."
    }
  ]
}