{
  "url": "https://www.wikihow.com/Know-if-a-Jade-Roller-Is-Authentic",
  "title": "Is Your Jade Roller Authentic? Cost, Materials, and Quality Check",
  "steps": [
    {
      "title": "Large online retailers probably aren’t using real jade.",
      "content": "Large online retailers probably aren’t using real jade. If you’re in the market for a jade roller, go to a higher end beauty store instead of a drug store or an online marketplace. That way, you’ll be able to trust their authenticity reports and their materials. [1] X Research source Large retailers, like Amazon and eBay, aren’t the best spots to search for an authentic jade roller. You can find real jade rollers on those platforms, but you have to research the seller thoroughly and check the reviews before you buy anything."
    },
    {
      "title": "There are only 2 types of real jade:",
      "content": "There are only 2 types of real jade: jadeite and nephrite. If the jade roller is made of serpentine (also called new jade or olive jade), Xiuyan jade, prehnite, Australian jade, Malaysian jade, or mountain jade, it’s not real. Check on the manufacturer’s website before you buy one to double check. [2] X Research source Australian jade is also called chrysoprase. Malaysian jade is also sometimes called blue jade or green jade."
    },
    {
      "title": "If it’s under $20, it’s probably not real jade.",
      "content": "If it’s under $20, it’s probably not real jade. A real jade roller can cost upwards of $60 if it’s authentic. Cheaper stone, like marble, serpentine, or quartz, will drive the price down. [3] X Research source If you bought a cheap jade roller, it doesn’t mean it’s worthless! You can still use the roller for its cooling, soothing properties (especially if you pop it in the fridge first)."
    },
    {
      "title": "Jade can come in a variety of colors.",
      "content": "Jade can come in a variety of colors. Vivid green jade is the most common, but you might also see a blend of white and cream in your jade. If the jade is any other color, it’s probably not real. [4] X Research source Sometimes jade can be turned pink or black because of impurities. However, it’s not very common."
    },
    {
      "title": "Real jade usually has milky white or black specks running through it.",
      "content": "Real jade usually has milky white or black specks running through it. They sometimes look like fibers or veins. If you hold the jade roller up to the light and it looks completely smooth without any imperfections, it might not be real. [5] X Research source If the “jade” looks completely smooth and all one color, it’s probably chrysoprase, which is commonly used as an imitation jade."
    },
    {
      "title": "Real jade is scratch-resistant, so it shouldn’t get marked up.",
      "content": "Real jade is scratch-resistant, so it shouldn’t get marked up. Grab a pin or a metal object and gently run them over the jade stone in your roller. If you can see a clear scratch in the stone, it’s probably not real jade. [6] X Research source Always use a metal object for this test. Jade can’t get scratched by steel, so it’s a great way to differentiate between real and fake. Warning: Do not use scissors or a sharp knife for this and go very gently. In the event that you don’t have authentic jade, you may end up damaging your item."
    },
    {
      "title": "Real jade often feels smooth and cool to the touch.",
      "content": "Real jade often feels smooth and cool to the touch. While this test can be a little bit objective, it’s a good way to double check if the stone is real. Wrap your hand around the jade to check its temperature and hold it in your hands for 1 to 2 minutes. If the jade warms up, it might be fake. [7] X Research source Other stones, like marble, can also be cool to the touch, so you shouldn’t rely on this test 100%. However, you can use it in conjunction with a few others on this list."
    },
    {
      "title": "Real jade is often heavier than other stones.",
      "content": "Real jade is often heavier than other stones. Hold the jade in your hands and gently toss it up and down. If it feels heavier than you’d expect, it might be real jade. If it feels light or hollow, it might be fake. [8] X Research source This is a good starting point, but it can’t tell you definitively whether or not jade is real."
    },
    {
      "title": "Listen for a soft, clinking sound as it hits your table or countertop.",
      "content": "Listen for a soft, clinking sound as it hits your table or countertop. Other materials, like stones or glass, sound heavy, while plastic sounds hollow. This test is very subjective, so you can use it in combination with a few other tests. [9] X Research source This test works best if you have a piece of jade on-hand that you know is authentic. You can tap both of them on your table and listen to the difference in sound."
    },
    {
      "title": "Most retailers will send you a certificate stating the jade is real.",
      "content": "Most retailers will send you a certificate stating the jade is real. If they don’t, your jade roller might be fake. However, some companies don’t do this, so you shouldn’t treat this as a 100% accurate way of testing your jade. [10] X Research source If they didn’t send a certificate and you’re wondering if the jade is real, you can always reach out to the company you purchased the roller from. If the jade is real, they should be able to send you proof."
    },
    {
      "title": "Jewelers are trained to test stones for authenticity.",
      "content": "Jewelers are trained to test stones for authenticity. If you’re really curious about your jade roller, you can take it to a jeweler for a density test. The jeweler will take the stone out of the roller and use a water displacement test to measure its density. Then, they’ll compare it against a jade density chart to figure out if it’s real or not. [11] X Research source This test can be a little involved, and it might cost you some money. You should only take your jade roller to a jeweler if you’re super curious or you spent a lot of money on it."
    }
  ]
}