{
  "url": "https://www.wikihow.com/Save-Your-Laptop-After-Water-Damage-with-Rice",
  "title": "How to Save Your Wet Laptop with Dry Rice",
  "steps": [
    {
      "title": "Turn off your laptop immediately by holding the power button.",
      "content": "Turn off your laptop immediately by holding the power button."
    },
    {
      "title": "Disconnect the power cable and all connected peripherals.",
      "content": "Disconnect the power cable and all connected peripherals. If the power cable is attached to an outlet, unplug it right away."
    },
    {
      "title": "Pull out the battery (if removable).",
      "content": "Pull out the battery (if removable)."
    },
    {
      "title": "Tilt the laptop at an angle to discourage liquid from reaching deeper parts of the laptop.",
      "content": "Tilt the laptop at an angle to discourage liquid from reaching deeper parts of the laptop. For most spills, this may mean flipping the laptop upside down, but use your own judgment ."
    },
    {
      "title": "Dry the computer with paper towels or microfiber cloth in all reachable wet areas.",
      "content": "Dry the computer with paper towels or microfiber cloth in all reachable wet areas."
    },
    {
      "title": "Use one of two methods that can be used to dry the computer’s internal parts.",
      "content": "Use one of two methods that can be used to dry the computer’s internal parts. One method is to immerse the computer in dry, uncooked rice in a sealed container or plastic bag. Another method is to place the computer in a dry location. The moisture should leave the computer naturally."
    },
    {
      "title": "Wait at least 48 hours.",
      "content": "Wait at least 48 hours. This time duration may seem excessive, but waiting for the allotted time can ensure that all of the water inside the computer has left."
    },
    {
      "title": "Reconnect the power cord carefully to the laptop.",
      "content": "Reconnect the power cord carefully to the laptop. If the battery is removable, try doing this without inserting the battery first."
    },
    {
      "title": "Test to see if your computer turns on and is operational.",
      "content": "Test to see if your computer turns on and is operational."
    },
    {
      "title": "Back up",
      "content": "Back up all your files immediately if your computer is operational. In some occasions, the computer will only function for a few hours before permanent failure."
    },
    {
      "title": "Seek professional assistance if your computer is still not functioning.",
      "content": "Seek professional assistance if your computer is still not functioning."
    }
  ]
}