{
  "url": "https://www.wikihow.com/Save-a-Fillable-PDF-on-Google-Chrome",
  "title": "How to Save a Fillable PDF on Google Chrome",
  "steps": [
    {
      "title": "Open the PDF in Google Chrome.",
      "content": "Open the PDF in Google Chrome. If the PDF isn't already open in Google Chrome, you can use your computer's \"Open With\" feature to open the PDF in Chrome: Windows — Right-click the PDF, select Open with in the drop-down menu, and click Google Chrome in the resulting pop-out list. Mac — Click the PDF once to select it, click File , select Open With in the drop-down menu, and click Google Chrome in the resulting pop-out list."
    },
    {
      "title": "Fill out your PDF.",
      "content": "Fill out your PDF. Click a text field in the PDF and type in your answer, then repeat with the PDF's other text fields until you've filled out the whole PDF. Some PDF text fields, such as checkboxes, only need to be clicked in order to input an answer."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . It's in the top-right corner of the Chrome window. A drop-down menu will appear."
    },
    {
      "title": "Click Print….",
      "content": "Click Print… . You'll find this option near the top of the drop-down menu. Doing so will open the Print menu on the center of the Chrome window."
    },
    {
      "title": "Click Change….",
      "content": "Click Change… . This is below and to the right of the \"Destination\" heading. A pop-up window with different printing options will appear."
    },
    {
      "title": "Click Save as PDF.",
      "content": "Click Save as PDF . It's an option below the \"Print Destinations\" heading. The pop-up window will close."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . This blue button is at the top of the Print menu on the left side of the window. Clicking it prompts a Save As window to open."
    },
    {
      "title": "Enter a name for your PDF.",
      "content": "Enter a name for your PDF. Type whatever you want to save your PDF as into the \"File name\" (Windows) or \"Name\" (Mac) text box in the Save As window."
    },
    {
      "title": "Select a save location.",
      "content": "Select a save location. Click a folder on the left side of the window to select it as the location in which you want to save your filled-out PDF. On a Mac, you may instead have to click the \"Where\" box and then click a folder in the resulting menu."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . It's at the bottom of the window. Doing so will save your filled-out PDF in your specified file location."
    }
  ]
}