{
  "url": "https://www.wikihow.com/Remove-Caulk",
  "title": "How to Remove Caulk",
  "steps": [
    {
      "title": "Soften the caulk with chemicals or heat.",
      "content": "Soften the caulk with chemicals or heat. Fresh caulk can usually be removed without softening it, but older caulk that has fully hardened may need to be softened first in order to make it pliable enough to remove. You can usually do this with water, vinegar, chemicals, or heat, depending on the type of caulk. Commercial caulk remover is the simplest choice and may be your best option for silicone caulk. Apply the caulk remover by squeezing a wide bead along the caulk line, completely covering it from end to end. Let it sit for several hours as directed on the label. [1] X Research source If you are dealing with non-acrylic water-based caulk, you can soak the caulk with saturated rags for 72 hours to soften the caulk effectively. If dealing with water-based acrylic caulks or polyvinyl acetate resins, soak the caulk by dampening it with iso-propyl rubbing alcohol. [2] X Research source To use heat on any form of caulk, apply heat from a hair dryer on the lowest setting for 30 to 40 seconds. Work in patches of about 8 inches (20 cm) at a time. [3] X Research source"
    },
    {
      "title": "Slice through the caulk with a blade.",
      "content": "Slice through the caulk with a blade. Use a small razor blade to cut through each end bead of caulk, exposing the edge of the line. Alternatively, you can slice from end to end, spanning the full length of the caulk and cutting the line completely in half. Doing so can free up more edge and may even cause some of the caulk to fall out on its own."
    },
    {
      "title": "Pull the caulk out by hand.",
      "content": "Pull the caulk out by hand. Grab the exposed edge of the caulk with your fingers and pull out as much as possible. Pull toward the direction of the remaining line of caulk to lift it out. If you cut along the full length of the caulk line, peel up the line starting on one end and pull in the direction opposite that end to remove as much as possible."
    },
    {
      "title": "Scrape out the remaining caulk.",
      "content": "Scrape out the remaining caulk. Use a glass scraper to scrap out any remaining, visible caulk. Hold the scraper at a shallow angle, keeping it as flat as possible, to avoid scratching the surface. You could also use a putty knife, plastic razor blade, or another similar tool. [4] X Expert Source Emily Fazio Home Improvement & DIY Specialist Expert Interview. 27 July 2021. Keep in mind that the tool you use should have a fairly flat “blade” with a somewhat dull edge. You do not need to cut more of the caulk out with this tool; you only need the tool for the sake of scraping away caulk from underneath."
    },
    {
      "title": "Pull caulk out of deep crevices with needle-nose pliers.",
      "content": "Pull caulk out of deep crevices with needle-nose pliers. If you cannot reach some of the caulk with your scraper, use needle-nose pliers to pick and pull out any visible chunks. Needle-nose pliers are preferable to other types of pliers since they tend to be narrower and are easier to maneuver in and out of small crevices."
    },
    {
      "title": "Rake out remaining chunks of caulk.",
      "content": "Rake out remaining chunks of caulk. Use the hook end of a painter's five-in-one tool to scrape out any remaining caulk debris from the crevice. [5] X Research source Scrape in one direction, pulling as much of the caulk away and out as possible. Hopefully, you should be able to get rid of the rest of the chunks after completing this step."
    },
    {
      "title": "Scrub the surface with an abrasive pad.",
      "content": "Scrub the surface with an abrasive pad. Soak the abrasive pad in mineral water or mineral spirits before scrubbing with firm, even force along the surface from which the old caulk had been removed. Rubbing the surface down with mineral spirits strips away any remaining caulk residue. Residue can prevent new caulk from sticking. Moreover, if there is mildew or mold caught in that residue, it poses a health hazard if it is not removed."
    },
    {
      "title": "Wash the surface with a non-ammoniated bath cleaner.",
      "content": "Wash the surface with a non-ammoniated bath cleaner. Clean away soap scum by thoroughly scrubbing the surface with a cleaner and sponge. Do not use ammonia or a cleaner that contains ammonia. You will be using bleach in the next step, and when combined, bleach and ammonia can create toxic fumes."
    },
    {
      "title": "Wash with a diluted bleach solution.",
      "content": "Wash with a diluted bleach solution. Combine 1/3 cup (80 ml) bleach with 1 gallon (4 L) of water until well mixed. Apply this solution to the gap from which the caulk was removed. Use paintbrush or foam brush too apply the bleach solution. Let the solution sit on the caulk for about five minutes before disturbing it. Scrub the bleach away with a toothbrush or firm plastic pad."
    },
    {
      "title": "Rinse and let dry.",
      "content": "Rinse and let dry. Rinse the area with warm water and pat the surface and the gap with a clean, dry rag. At this point, you can and should apply new caulk. Make sure that the surface is completely dry before doing so, however, since caulk may not adhere to wet surfaces."
    },
    {
      "title": "Rinse the area with mineral water.",
      "content": "Rinse the area with mineral water. Before applying any chemical solvent to a caulk stain on marble or any other hard surface, rinse the area with mineral water or distilled water to remove any residue."
    },
    {
      "title": "Moisten the stain with a chemical solvent.",
      "content": "Moisten the stain with a chemical solvent. Choose a chemical solvent noted for effectiveness against silicone caulk. Dampen the stained area using a clean rag. Note that you only need to use heavy solvents on silicone caulk stains. Other types of caulk stains, like acrylic and non-acrylic caulks, are less stubborn and can usually be removed with nothing but water and physical scraping. Common, effective chemicals include Methylene Chloride, Dichloromethane, Methylene Bichloride, and Methylene Dichloride."
    },
    {
      "title": "Mix the solvent with a white absorbent material.",
      "content": "Mix the solvent with a white absorbent material. Combine additional solvent with enough white absorbent material to form a thick paste. Possible absorbent material options include molding plaster, untreated white flour, white tissue, white paper towels, powdered chalk, talc, fullers earth, or laundry whiting. Note that you'll need about 1 lb (450 g) of paste for every square foot (30.5 square cm)."
    },
    {
      "title": "Apply the paste to the stain.",
      "content": "Apply the paste to the stain. Layer the paste on the caulk stain using a plastic or wooden spatula. Make sure that the paste is 1/4 inch (6.35 mm) thick or less. This paste should cover the entire stain and extend a bit past the edges. If you do not let the paste extend past the stain, the stain could end up being forced onto clean patches of stone. After applying the paste, make sure that the coating is free of any air pockets."
    },
    {
      "title": "Let the paste set.",
      "content": "Let the paste set. Cover the paste with plastic sheeting and seal the edges off with masking tape. Let it set for 48 hours undisturbed. If using a solvent with other instructions, however, follow the instructions provided on the solvent label."
    },
    {
      "title": "Dampen the area with mineral water.",
      "content": "Dampen the area with mineral water. Doing so softens the hardened paste enough to help lift it off."
    },
    {
      "title": "Scrape away the dried paste and caulk.",
      "content": "Scrape away the dried paste and caulk. Use a wooden or plastic spatula to gently scrape away the paste and the loosened caulk. Do not use anything harder since many hard surfaces, like marble, can get scratched up as a result."
    },
    {
      "title": "Rinse with mineral water.",
      "content": "Rinse with mineral water. Rinse the area once more with mineral water or distilled water to remove any residue. Blot dry with clean paper towels. You might need to apply this treatment multiple times before all the caulk comes up. You can do so once the surface is completely dry."
    },
    {
      "title": "Wipe off as much of the caulk as possible.",
      "content": "Wipe off as much of the caulk as possible. If you catch the stain as soon as the caulk gets onto the material, you might be able to wipe most of it off with a clean, damp rag. Gently rub at the stain. As you rub, use a slight upward motion to encourage the caulk to come off the material instead of rubbing it further into the fibers. You could attempt to simply dab at the stain, but this may not be enough force depending on how much the caulk has already begun to set. Use warm water instead of cold water since warmth encourages the caulk to stay soft."
    },
    {
      "title": "Freeze the material, if possible.",
      "content": "Freeze the material, if possible. If the caulk got on your clothes or some other removable item of fabric, place the stained item in the freezer for 30 to 60 minutes or until well frozen. You do not, of course, need to do this step or any of the following steps if the caulk came off simply by scrubbing it. When ready, the fabric should be very stiff and the caulk should be hard to the touch."
    },
    {
      "title": "Scrape or peel the hardened caulk off.",
      "content": "Scrape or peel the hardened caulk off. The solidified caulk should be easier to remove. You can scrape at it with a painter's chisel until the strip of caulk begins to peel up, then peel the rest away with your fingers. It is not recommended for you to chisel or scrape away the entire caulk stain. Doing so could cause the fibers in the material to tear more than necessary."
    },
    {
      "title": "Apply an acetone-based cleaner.",
      "content": "Apply an acetone-based cleaner. [6] X Research source If some of the caulk stain still remains, you can apply a small amount of an acetone-based cleaner directly to the stain before dabbing it out. Before using the acetone, test it on a small part of the material hidden along the underside. Acetone can fade and ruin certain fabrics, so testing it is necessary if you do not want to risk further damage. Apply the cleaner to the fabric using a cotton swab or cotton ball. Let it sit for five minutes or as directed on the label before rinsing out with warm water. Launder the cloth as usual when done."
    }
  ]
}