{
  "url": "https://www.wikihow.com/Create-a-Sauna-Environment-in-a-Bathroom",
  "title": "2 Ways to Transform Your Bathroom Into a Sauna",
  "steps": [
    {
      "title": "Raise the upper range of your hot water heater to 140 °F (60 °C).",
      "content": "Raise the upper range of your hot water heater to 140 °F (60 °C). To create a steamy environment, adjust your hot water heater to a high temperature of 140 °F (60 °C). [2] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source After your sauna session, be sure to turn down your hot water heater to the accepted safety range of 120 °F (49 °C) to 130 °F (54 °C) to avoid burns and scalding. [3] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source"
    },
    {
      "title": "Select the smallest bathroom in your home to serve as a steam room.",
      "content": "Select the smallest bathroom in your home to serve as a steam room. When it comes to choosing a room for your sauna, smaller is better. A small bathroom mimics the high temperature of a real sauna because it heats up quickly and traps in more steam than a large room. If you have multiple bathrooms of similar size, choose the one that is located in a warmer area of the house."
    },
    {
      "title": "Organize your bathroom to create a more relaxing environment.",
      "content": "Organize your bathroom to create a more relaxing environment. To recreate the look and feel of a sauna room, remove any dirty clothes and towels from the room, and wipe down messy countertops with a damp cloth. Organize bathroom items like cotton balls and Q-tips into acrylic organizers , and move any remaining clutter into another room. [4] X Research source"
    },
    {
      "title": "Recreate the peaceful ambiance of a sauna.",
      "content": "Recreate the peaceful ambiance of a sauna. For a calming sauna session, dim the lights, set up some aromatherapy candles , and turn on a relaxing spa playlist. Turn off your phone (or leave it in another room) to truly focus on the experience and relax your mind . [5] X Research source If you don’t want to deal with candles, place a few drops of aromatherapy oil in the tub or in a diffuser . Lavender, lemon, and bergamot oils are believed to relieve stress and reduce anxiety. [6] X Research source"
    },
    {
      "title": "Close the bathroom doors and windows.",
      "content": "Close the bathroom doors and windows. To trap as much steam in your bathroom as possible, shut the doors of any rooms within your bathroom, such as a linen closet. Close the windows, and draw the curtains and blinds to create a dark, spa-like environment."
    },
    {
      "title": "Use towels to cover any gaps and cracks in the room.",
      "content": "Use towels to cover any gaps and cracks in the room. To prevent steam from escaping the room, stuff a thick, rolled up towel between the floor and the bottom of the bathroom door. Then, cover any drafty areas around the windows, especially if the weather is cold outside. If there is a closet inside your bathroom, place rolled towels along the bottom of that door as well. The more you insulate, the more you can replicate a sauna environment."
    },
    {
      "title": "Shower before you begin your sauna.",
      "content": "Shower before you begin your sauna. Before starting your sauna, take a shower to remove any dirt and grime, especially if you’ve been sweating or working out beforehand. Wash your face to take off any traces of makeup or sunscreen, which could sweat down your face and sting your eyes. Showering will also maintain the cleanliness of the room and keep it smelling fresh."
    },
    {
      "title": "Remove your jewelry and glasses.",
      "content": "Remove your jewelry and glasses. The steam from the room can tarnish certain metals, so take off any rings, necklaces, or bracelets before starting your session. If you wear glasses, the steam will make them cloudy so set them aside while you enjoy the sauna."
    },
    {
      "title": "Plug your bathtub drain and fill your tub with hot water.",
      "content": "Plug your bathtub drain and fill your tub with hot water. To begin the sauna session, turn on the water in your bathtub to the hottest setting, and leave the water running until the tub is about halfway full. Keep your shower door (or curtain) open to let the heat and steam fill the bathroom. If your hot water supply runs out before your tub is full, turn off the water to avoid diluting the steam with cool water, then wait 10-15 minutes until hot water comes out again. If you have a stand-up shower without a bathtub, point the shower head away from you and turn on the water to the hottest setting. Let the water run for 10-20 minutes, depending on how long you want the session to be. Leave your sink running at the same time to increase the amount of steam in the room."
    },
    {
      "title": "Sit next to the tub and enjoy the steam that has filled the room.",
      "content": "Sit next to the tub and enjoy the steam that has filled the room. Lean over your bathtub to inhale the steam that is rising from the water. Sitting in a sauna is linked to lower stress levels, so take this time to close your eyes and detach from everything going on in life. [7] X Research source If you have a shower without a bathtub, sit on the shower floor, if possible. If there’s no way to avoid the scalding water, sit beside the shower on the bathroom floor, and place a towel underneath you for comfort."
    },
    {
      "title": "Follow your sauna with a cold or lukewarm shower.",
      "content": "Follow your sauna with a cold or lukewarm shower. After getting out of the sauna , take a shower to prevent any sweat and toxins from reabsorbing through your skin. Follow up by drinking 2-4 glasses of water to replenish lost fluids and prevent dehydration . [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Clean your bathroom to prevent mold.",
      "content": "Clean your bathroom to prevent mold. Steam can lead to moisture damage and eventual mold growth, so ventilate your bathroom as soon as you get out of the shower. Open the windows to let steam escape, and turn on your exhaust fan for 20-30 minutes. Remove any damp clothes, towels, or bath mats from the room, and wipe down all the surfaces with disinfectant wipes. [9] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source If you find small traces of mold in your bathroom, scrub the area with detergent and water, then let it dry completely. [10] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source If the area of mold is over 10 square feet (0.93 m 2 ), call a mold specialist or professional cleaner for help. The mold can be difficult to remove on your own, and it may spread inside your walls. [11] X Research source"
    },
    {
      "title": "Choose a well-ventilated location that can be waterproofed.",
      "content": "Choose a well-ventilated location that can be waterproofed. To transform your bathroom into a sauna, strip the desired area down to its bare ceiling joists and wall studs. Make sure the space is at least 7 feet (2.1 m) tall and has smooth, level flooring. As long as the floor is waterproof, it can be any material like concrete, tile, or vinyl. [12] X Research source To achieve a balanced temperature in the sauna, zone out a square-shaped area, and allow 2 feet (0.61 m) of bench space per person, or 6 feet (1.8 m) of bench space per person for reclining. [13] X Research source"
    },
    {
      "title": "Install any necessary pipes, wires, or gas lines.",
      "content": "Install any necessary pipes, wires, or gas lines. Hire a licensed electrician to wire the room for an interior light, light switch, sauna heater wire conduit, and exterior controls. The easiest and most popular heater is electric, but there are also gas, wood, and infrared options. Depending on the type of sauna heater you choose, set up the appropriate power source: [14] X Research source If you choose an electric or infrared heater , have an electrician verify that there’s enough power on your breaker. If you choose a gas heater , have a plumber set up a gas line. If you choose a wood heater , just purchase sauna stones and firewood—there’s no need to hire a professional."
    },
    {
      "title": "Construct the sauna framework out of cedarwood.",
      "content": "Construct the sauna framework out of cedarwood. Frame the room by following the conventional 16 inches (41 cm) on-center (OC) framing method, and block off space for the sauna heater and benches. [15] X Research source To ensure the room is breathable, leave space for 2 ventilation points: one below the heater and one on the opposite wall just below the upper bench. [16] X Research source Alternatively, hire a professional carpenter or purchase a wooden sauna kit that requires minimal assembly. Cedar is the preferred wood choice because it handles moisture well, but it can be a little pricey. If it isn’t within your budget, choose another flexible softwood like aspen, hemlock, poplar, or basswood. [17] X Research source"
    },
    {
      "title": "Insulate the framework and ceiling with fiberglass.",
      "content": "Insulate the framework and ceiling with fiberglass. Insulation allows the sauna to retain heat, so double check the measurements of the total area of the individual walls, as well as the width between each wall stud. Before handing the fiberglass , wear protective gear ( cut-resistant gloves , a dust mask , long sleeves and pants). Carefully roll out the insulation with the paper side down, then cut the insulation with a sharp utility knife and stuff each piece into the framework. [18] X Research source For 16 inches (41 cm) on-center (OC) framing, it should be 16 inches (41 cm) wide, but you can always leave a little extra material to ensure the fiberglass covers the walls and stays in place."
    },
    {
      "title": "Set up the foil-coated vapor barrier.",
      "content": "Set up the foil-coated vapor barrier. To keep moisture off of the fiberglass and help it last longer, wrap the interior of the sauna with a foil vapor barrier and staple it in place. Make sure the reflective side is facing toward the sauna, and go over any seams with an aluminum foil tape to ensure the steam doesn’t penetrate your walls. [19] X Research source The foil coating is an additional insulator because it reflects heat back into the sauna room."
    },
    {
      "title": "Install the interior paneling out of cedarwood.",
      "content": "Install the interior paneling out of cedarwood. For the easiest installation, panel the walls with 0.75 inch (1.9 cm) x 7 inch (17.8 cm) tongue and groove cedar planks . For the first panel, nail through the face of the plank and ensure the tongue is facing away from the wall. For the rest of the panels, line the groove up with the previous panel and nail through the tongue and into the joists. Use 1.25 inch (3.2 cm) stainless steel screws to prevent rust, and leave ventilation spots for steam to escape. [20] X Research source To give your room a clean finish, start by installing the planks from the ceiling. Feel free to arrange them in a horizontal or vertical direction, depending on your design preference. [21] X Research source"
    },
    {
      "title": "Fit and mount the sauna heater.",
      "content": "Fit and mount the sauna heater. Before purchasing the heater, measure the dimensions of your room to select the correct size: if your sauna heater is too small, it will take hours to heat up the room, and if it’s too big, it will heat up the room too quickly (before it produces steam). [22] X Research source If you’re using an electric heater, allow 1 kW for every 45 cubic feet (1.3 cubic meters) of room space, and hire a licensed electrician to wire the heater to your power source. [23] X Research source For gas, wood, and infrared heaters, read the instructions of the specific heater to see the size ranges that they can safely operate in. [24] X Research source"
    },
    {
      "title": "Assemble the sauna benches from cedarwood.",
      "content": "Assemble the sauna benches from cedarwood. To build a wooden bench to fit your sauna space, measure the distance between the 2 parallel walls to construct the frame. Cut 2 in (5.1 cm) x 4 in (10.1 cm) cedar boards to length, and assemble them. Position the legs vertically and flat against the corner of the walls, and nail drill them in place with 2.5 inches (6.4 cm) screws . Then, drill the frame to the wall with the same screws. Be sure to drill the boards in place from the underside so the screws aren’t visible. [25] X Research source At this point, add any other fixtures you desire, such as handrails, backrests, or bench lighting."
    },
    {
      "title": "Install a prehung sauna door.",
      "content": "Install a prehung sauna door. Using wood shims to hold the frame in place, center the door frame inside the opening, making sure the door swings outward from the sauna. Mount the frame with 6d finishing nails , and test the door by opening and closing it. If all the air gaps are closed, tighten everything in place, then attach the wooden door handle. [26] X Research source If you tend to get claustrophobic, choose a glass door or one with windows to provide more light. [27] X Research source"
    }
  ]
}