{
  "url": "https://www.wikihow.com/Reduce-Pain-After-an-Injection",
  "title": "How to Reduce Pain After an Injection",
  "steps": [
    {
      "title": "Move your arm or leg around immediately after getting a limb injection.",
      "content": "Move your arm or leg around immediately after getting a limb injection. If you got an injection on your arm or leg, wait for the doctor or nurse to finish taping it off with gauze. When they’re done with the bandaging, slowly rotate your arm over your head in a circular motion 9-10 times to get the blood flowing. If you were injected on your leg, shake it back and forth lightly 9-10 times and raise your knee once or twice. Letting a limb rest immediately after an injection will increase the odds that it becomes sore, so move around a little after the doctor or nurse is done. [1] X Research source You don’t need to run a marathon or anything. Simply move your body around enough to keep your blood flowing for 30-45 seconds. If you were injected on your side or hip, stretch that area out the best that you can to keep the injection site from swelling up. Staying on your feet will help in this case."
    },
    {
      "title": "Put a cold pack on the injection site for a little to ease the muscles.",
      "content": "Put a cold pack on the injection site for a little to ease the muscles. After you’ve moved around a little, put a cold pack on the injection site for 10 minutes to reduce the pain in your muscles. Take the cold pack off and expose the skin to room temperature air. Then, put the cold pack back on for another 1-2 minutes. Alternate using the cold pack and leaving your skin exposed to relieve the pain. [2] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Avoid using a warm pack on the injection site afterward since it won’t ease the pain as well as something cold. However, you can use a warm back before the injection to help increase absorption."
    },
    {
      "title": "Take over-the-counter pain medication to reduce the symptoms.",
      "content": "Take over-the-counter pain medication to reduce the symptoms. After your injection, take 600 mg of acetaminophen if it’s your preferred pain reliever. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source However, you can also take 400 mg of ibuprofen if you want to prevent inflammation. [4] X Research source Both medications will help reduce the pain after an injection. Ask your doctor which would be better for your specific injection. If you expect swelling, take ibuprofen instead of acetaminophen. [5] X Research source Do not take more than the daily recommended amount of ibuprofen or acetaminophen. Acetaminophen is the pain-relieving ingredient in Tylenol."
    },
    {
      "title": "Stay hydrated",
      "content": "Stay hydrated and drink plenty of water after your shot. Drink 24–48 fluid ounces (0.71–1.42 L) of water over the next 3-4 hours after getting your shot to ensure that your body stays properly hydrated. Maintaining a healthy level of fluids after getting a shot will ensure that you don’t start to get unnecessarily sore during the healing process. [6] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Don’t just chug water to the point that you start cramping and feeling sick. Just calmly drink water periodically after your shot to rehydrate."
    },
    {
      "title": "Put a cold pack or cool towel on the injection site to reduce swelling.",
      "content": "Put a cold pack or cool towel on the injection site to reduce swelling. If you get a shot and your skin starts to swell up, start by reducing the surface temperature of the injection site. Put an ice pack, cold compress, or towel soaked in cool water over the injection site. Leave the pack, towel, or compress on the site until the swelling goes down. [7] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Do not apply an ice pack to the injection site without covering the skin with a towel or thick cloth first. The cold will also reduce the pain and tenderness in the area as the swelling goes down. You can easily make your own ice pack by stuffing a resealable plastic bag with ice cubes. Heat can help with muscle soreness, but cold reduces swelling. Heat tends to not be as helpful for this particular task."
    },
    {
      "title": "Take 400 milligrams of ibuprofen to reduce inflammation and pain.",
      "content": "Take 400 milligrams of ibuprofen to reduce inflammation and pain. Take 2-3 ibuprofen after you start to feel inflammation or swelling from your injection. Unlike acetaminophen, ibuprofen is an anti-inflammatory pain killer, which means that it will really help the swelling or inflammation go down. Make sure that you’ve eaten something before taking it though to prevent stomach pain and possible damage. [8] X Research source You can safely take a maximum of 1200 mg of ibuprofen in a 24 hour period."
    },
    {
      "title": "Rest the area and avoid overworking the muscles near the injection site.",
      "content": "Rest the area and avoid overworking the muscles near the injection site. To avoid aggravating the area that is inflamed, avoid using the muscles in the area near the injection site for at least 4-6 hours. For example, if you’ve had a shot in your shoulder, avoid using your bicep, shoulder, or upper pectoral muscles. Keeping all of the nearby muscles rested for a period will help keep the inflammation from getting worse. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source While you normally want to move around after an injection, swelling and inflammation usually takes longer to heal if it isn’t rested. [11] X Research source"
    },
    {
      "title": "Consult your doctor to see if they can prescribe you a stronger anti-inflammatory medication.",
      "content": "Consult your doctor to see if they can prescribe you a stronger anti-inflammatory medication. In some instances, a higher-strength or specialized anti-inflammatory medication may be required. If the swelling doesn’t go down, you develop a fever, or any aching sensations don’t go away, consult your doctor immediately to see if there are any other medications that they can prescribe. [12] X Research source In general, you should consult your doctor if any of your symptoms continue to get worse instead of better."
    },
    {
      "title": "Distract children after a shot to help them feel less pain and anxiety.",
      "content": "Distract children after a shot to help them feel less pain and anxiety. Children may get fussy or overreact to pain from an injection, so do your best to draw their focus somewhere else. Let them play with their favorite toy, read them a book, or have them watch a video on your phone or tablet. When the injection is completed, offer your child a reward, such as a sticker or a piece of candy for their good behavior. [13] X Research source Make sure your child doesn’t move around a lot while they receive the injection since it will be more difficult for whoever is giving the shot."
    },
    {
      "title": "Give your child a lot of fluids and do not wrap the injection site.",
      "content": "Give your child a lot of fluids and do not wrap the injection site. The 2 easiest ways to reduce pain after a child gets a shot is to give them plenty to drink and to leave the area alone. Give your child a glass of water after the injection and encourage them to drink it. Then, over 2-3 hours, encourage them to drink 1-2 more glasses. Do not wrap the site or put any pressure on it. Give your child 1-3 8 fluid ounces (240 mL) cups of water to keep them hydrated. Encourage them to drink a little more if they’re up to it!"
    },
    {
      "title": "Ask your doctor if you can give your child acetaminophen or ibuprofen.",
      "content": "Ask your doctor if you can give your child acetaminophen or ibuprofen. Children older than 5 are usually able to consume some amount of acetaminophen or ibuprofen to ease the pain as long as there are no negative interactions with other medications that they’ve taken. Ask your doctor about acetaminophen or ibuprofen while they’re administering the shot. Do not give your children aspirin products if they develop a fever or flu-like symptoms. The medication is not designed for children under 3 under any condition. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Apply a cold washcloth over areas that swell up or get inflamed.",
      "content": "Apply a cold washcloth over areas that swell up or get inflamed. If the injection site starts to swell up after they’ve had their shot, take a washcloth and run it under cold water. Fold the washcloth over until it’s a small, soft rectangle. Ask your child to sit or lay down and put the cloth over the area that’s beginning to swell up. This will help reduce the swelling by cooling the area while your child rests. You can use an ice pack if you want, but you may have a hard time getting younger children to sit still with the cold pack on their skin."
    }
  ]
}