{
  "url": "https://www.wikihow.com/Secure-Patio-Furniture-from-Wind",
  "title": "11 Ways to Secure Your Patio Furniture from the Wind",
  "steps": [
    {
      "title": "The weight of all your furniture is harder to blow around in strong winds.",
      "content": "The weight of all your furniture is harder to blow around in strong winds. If you have stackable patio chairs, put them in a pile so they aren’t as likely to move around. To keep the stack from falling apart, use a rope to tie all of them together. Otherwise, use pieces of rope to tie the bases of all your furniture together. [1] X Research source The wind may still move your furniture a little bit, but it’s pretty unlikely it will all blow away unless there are extremely strong winds."
    },
    {
      "title": "The wall blocks wind from one side so your furniture stays put.",
      "content": "The wall blocks wind from one side so your furniture stays put. When your furniture is out in the open, wind can hit from every direction and make it easier to blow away. To protect your outdoor furniture, just push it as close to the side of your home as you can. That way, your furniture will only move if the wind blows in a specific direction. [2] X Research source Stacking your furniture will make it even harder to blow away. You could even tie your furniture to a rail on the side of your home for additional support."
    },
    {
      "title": "Using bungee cords lets you secure your furniture to a sturdier object.",
      "content": "Using bungee cords lets you secure your furniture to a sturdier object. Wrap a bungee cord around the sturdiest part of your furniture, like the thickest part of the base or legs. Secure the ends of the bungee cord to a solid object in your yard, like a railing, tree, beam, or fence. [3] X Research source If you need to secure a porch swing in the wind, use a few bungee cords to secure it to the side of your home or a guard rail. [4] X Research source"
    },
    {
      "title": "The added weight holds your furniture in place during strong winds.",
      "content": "The added weight holds your furniture in place during strong winds. A furniture weight is about the size of a cushion and is filled with sand or other heavy material. Just set the weight on the seat of a chair or the top of your table. Leave the weights in place whenever there are strong winds or heavy storms. [5] X Research source You can also get weighted umbrella stands to keep an umbrella from blowing away without completely taking it down. In a pinch, you can use dumbbells or landscaping stones as makeshift weights to keep your furniture secure."
    },
    {
      "title": "An outdoor furniture cover holds your furniture down and protects it.",
      "content": "An outdoor furniture cover holds your furniture down and protects it. Get a heavy-duty furniture cover that’s made of waterproof and UV-resistant material so your furniture doesn’t get damaged when it’s storming. Make sure the cover fits tightly over your furniture since it could blow off if it’s too large. Check if the cover has vents, which help wind blow through it without it coming undone. [6] X Research source You can get individual covers for each of your pieces of furniture, or get a custom cover that will fit a patio table and chairs."
    },
    {
      "title": "Tying furniture to lawn stakes holds them firmly to the ground.",
      "content": "Tying furniture to lawn stakes holds them firmly to the ground. Lawn stakes dig into the ground, so strong winds won’t be able to pull them out of the soil. Put your patio furniture in a spot with firm soil and drive the lawn stakes into the ground. Tie your furniture to the clip on top of the lawn stake with a rope or a bungee cord to keep your furniture secure. [7] X Research source If the soil is wet or loose, lawn stakes will pull out easier and might not keep your furniture from moving around."
    },
    {
      "title": "Using deck anchors works best for raised decks and patios.",
      "content": "Using deck anchors works best for raised decks and patios. A deck anchor is a small clip that fits between the slats of a deck and grips onto the wood to hold your furniture in place. Slide deck anchors in between the slats underneath your furniture. Twist the anchor and pull it straight up so it catches underneath the wood. Then, just tie ropes or bungee cords to the clips on the anchors. [8] X Research source Use 2 or 3 deck anchors per piece of furniture to hold it down more securely."
    },
    {
      "title": "The earthquake gel sticks to the ground and keeps furniture from moving.",
      "content": "The earthquake gel sticks to the ground and keeps furniture from moving. Earthquake gel is really sticky and is normally used to keep glass from moving or breaking during earthquakes. Take a piece of the earthquake gel and place it on the bottom of each leg of your patio furniture. Press the furniture down firmly against your patio or deck so it stays in place. Earthquake gel isn’t permanent, but it may be hard to pick up and move around your furniture after you stick it down."
    },
    {
      "title": "A windbreak slows down the wind blowing past your patio furniture.",
      "content": "A windbreak slows down the wind blowing past your patio furniture. When the wind passes through a windbreak, the gusts won’t be as strong and won’t move your furniture as much. You can buy a windbreak screen to guard your furniture. For additional protection, you can also build a fence, grow hedges, or plant a line of trees to help block the wind. [9] X Trustworthy Source U.S. Department of Energy Official site for the U.S. Department of Energy, which provides resources related to energy safety, conservation, and efficiency Go to source Still secure your patio furniture if you’re using a windbreak just in case there are really strong gusts that still blow through."
    },
    {
      "title": "You’ll have the best protection from severe weather and damage inside.",
      "content": "You’ll have the best protection from severe weather and damage inside. If you have the room in your home to temporarily store your furniture, bring it inside before the strong winds hit. If you don’t have room in your home, you can always put the furniture in a garage or shed as well. [10] X Research source Bringing furniture inside is one of the best ways to protect it from wind or water damage from a hurricane. If you have a porch swing, take it down and bring it inside during severe weather to prevent it from knocking into your home."
    },
    {
      "title": "Wrought iron and heavy wood are more sturdy materials in the wind.",
      "content": "Wrought iron and heavy wood are more sturdy materials in the wind. If you live in an area with a lot of strong winds or severe weather, upgrading to more durable furniture might be a good option. Rather than using furniture made from plastic or lightweight teak, choose tables and chairs made with hardwoods, wrought iron, or steel. [11] X Research source"
    }
  ]
}