{
  "url": "https://www.wikihow.com/Poison-the-Honningbrew-Vat-in-Skyrim",
  "title": "How to Poison the Honningbrew Vat in Skyrim",
  "steps": [
    {
      "title": "Start the “Dampened Spirits” quest.",
      "content": "Start the “Dampened Spirits” quest. This is the fourth quest as a member of the thieves guild, right after “Loud and Clear.” To start the quest, go talk to Brynjolf, who can be found in the marketplace of Riften during the day. He will direct you to Maven Black-Briar."
    },
    {
      "title": "Find Maven Black-Briar.",
      "content": "Find Maven Black-Briar. During the day, you can find her on the second floor of the Bee and the Barb or, during the night, her manor (both in Riften). The manor, however, will be locked, so conversing with her after breaking in would cause the guards to attack you."
    },
    {
      "title": "Talk to Maven.",
      "content": "Talk to Maven. After finding her in either the Bee and Barb or the manor, Maven will want you to sabotage her competition, the Honningbrew Meadery, and direct you to meet a man named Mallus Maccius at the Bannered Mare in Whiterun."
    },
    {
      "title": "Head to Whiterun.",
      "content": "Head to Whiterun. Since you have already been there, just fast travel to Whiterun. Do this by opening up the map and selecting the icon that looks like a horse on a shield as your destination."
    },
    {
      "title": "Find Mallus Maccius.",
      "content": "Find Mallus Maccius. The Bannered Mare is a bar located in the shopping area of Whiterun, simply head north from the entrance gates until you reach a large building with a sign of a bucking horse on its front. Enter the bar, then head straight until you see a small hall on the left side of the main room . This hall leads to a smaller room with a fireplace; Mallus will be seated at one of the tables."
    },
    {
      "title": "Talk to Mallus.",
      "content": "Talk to Mallus. Hit the appropriate button to interact with Mallus, and tell him that Maven sent you. He’ll tell you the plan is to poison the competitor’s batch of mead. You will be prompted to ask if he has the poison. Throughout the conversation, you will be prompted to select dialog options, but you only receive one option at a time, making the conversation a scripted event you have to proceed through. Simply get through the conversation as he explains the plan Once he is done explaining, you can question why he’s doing this, but more importantly, ask how to get into the brewing vats."
    },
    {
      "title": "Visit the Honningbrew Meadery.",
      "content": "Visit the Honningbrew Meadery. After you’re finished speaking with Mallus, exit the bar and head out the front gates of Whiterun. The Honningbrew Meadery is located just south of Whiterun. Head down, past the stables, and past the Pelagia farm to reach the Meadery. Make sure to visit during the day, when the meadery will be open. Most shops are open from 8 a.m. to 8 p.m."
    },
    {
      "title": "Talk to Sabjorn.",
      "content": "Talk to Sabjorn. Enter through the main double doors of the Meadery, and talk with Sabjorn, who will be waiting for you in front of the bar. Offer to help him with the infestation problem in the Meadery basement, and Sabjorn will give you some pest poison."
    },
    {
      "title": "Go down to the basement of the Meadery and kill Skeevers.",
      "content": "Go down to the basement of the Meadery and kill Skeevers. Enter the double doors on the right side of the room and head down the stairs in the center. After entering the basement, you will be ambushed by Skeevers, large rodent-like creatures. They’re weak but fast, so try to bring them down with destruction, magic or arrows. In close combat, they can bite you and infect you with a disease called Ataxia, so take care to keep a good distance."
    },
    {
      "title": "Go further down into the basement and kill more Skeevers.",
      "content": "Go further down into the basement and kill more Skeevers. After taking down the wave of Skeevers, head forward through the basement until you reach the opposite wall. Look to the right, and you will see a small entrance that leads further underground. Follow the path to reach the Skeevers nest. Even more will attack than earlier, so be prepared for a nasty fight. Continue heading down the path, where an ambush of Frostbite spiders is waiting for you. Defeat them the same way you did the Skeevers, and journey deeper into the cave, travelling even further underground. There are bear traps, wire traps, and a few more Skeevers lurking, so be careful"
    },
    {
      "title": "Kill the boss.",
      "content": "Kill the boss. After reaching a large chamber, you will face the final boss of this quest, a lone wizard named Hamelyn. Hamelyn has guardian Skeevers to protect him, and casts powerful destruction spells. To defeat him, try to rush him with a physical attack, as he does better with long-ranged combat."
    },
    {
      "title": "Poison the Skeever nest.",
      "content": "Poison the Skeever nest. After killing Hamelyn, you can poison the Skeever nest next to his Alchemy lab by approaching it, and hitting the prompt that appears on the screen."
    },
    {
      "title": "Poison the brewing vat.",
      "content": "Poison the brewing vat. After collecting the goodies from Hamelyn’s hideout, head back up the way you came to enter the brewery again. Once you reach the basement, head through the door on the right wall that leads to the boiler. Head up the stairs that lead to the wooden platforms over the vats, and stand in front of them. Hit the appropriate button when prompted to poison the vat."
    },
    {
      "title": "Complete the “Dampened Spirits” quest.",
      "content": "Complete the “Dampened Spirits” quest. You can now either go on your way and complete the “Dampened Spirits” quest later, or you can talk to Sabjorn to begin the conclusion of the quest. If you opt to conclude the quest, talk to Sabjorn and wait for him to be arrested. Speak with Mallus afterwards then go open the dresser to the left of the bed upstairs. Take the note in the dresser to Maven in Riften, and then talk to Brynjolf to finish the quest."
    }
  ]
}