{
  "url": "https://www.wikihow.com/Discord-Update-Failed-Loop",
  "title": "Discord Update Failed? Here's How to Fix It for Good",
  "steps": [
    {
      "title": "A faulty internet connection will interfere with Discord's update and create an update loop.",
      "content": "A faulty internet connection will interfere with Discord's update and create an update loop. Test your internet speed online with https://fast.com or open your ISP's mobile app and see if there are scheduled maintenance or outages that might be restricting your internet. Check out this wikiHow article to figure out why your internet is so slow and how you can fix it. [1] X Research source"
    },
    {
      "title": "If the servers are down, you'll see that the update fails continuously.",
      "content": "If the servers are down, you'll see that the update fails continuously. Go to https://discordstatus.com/ to check if everything is operational. You'll have to wait until the servers are back up to download updates successfully."
    },
    {
      "title": "Certain permissions are needed for updates, which only admins have access to.",
      "content": "Certain permissions are needed for updates, which only admins have access to. The update may fail if you just opened the app without administrator permissions, so you need to close any running instances first. To do that, right-click the icon in the System Tray and select Quit Discord . Once it's closed, right-click the icon on your desktop or in the Start menu and select Run as administrator . If you have been running Discord as an admin, try refreshing it instead."
    },
    {
      "title": "A firewall or antivirus can prevent Discord from connecting to the internet.",
      "content": "A firewall or antivirus can prevent Discord from connecting to the internet. Without being able to connect, Discord will forever loop and try to update. Go to your firewall/antivirus settings and make sure Discord is allowed to access the Internet."
    },
    {
      "title": "Corrupted data can cause updates to fail in Discord.",
      "content": "Corrupted data can cause updates to fail in Discord. While this cache is originally intended to make the app run smoother and faster, it can sometimes save corrupted data that prevents normal functions from working. On Windows, open Run ( Win + R ) and enter %app data%\\discord . Then delete the \"Cache\", \"Code Cache\", and \"GPU Cache\" folders. On Mac, select Go > Go to Folder in Finder and enter ~/Library/Application Support/discord/ . Then delete the \"Cache\", \"Code Cache\", and \"GPU Cache\" folders. Empty your Trash or Recycling Bin , then restart your computer."
    }
  ]
}