{
  "url": "https://www.wikihow.com/Make-Loom-Bands-with-Beads",
  "title": "How to Make Loom Bands with Beads",
  "steps": [
    {
      "title": "Get your materials together.",
      "content": "Get your materials together. You will need: Loom bands- it's easiest to use one colour at first. Beads- if you have a bead kit it's perfect, but you just need some beads with a hole big enough to fit a piece of string through. String- coloured is best, the best is the string you get in a bead kit. Make sure that it is long enough to fit around your wrist. Your fingers."
    },
    {
      "title": "Start stringing your loom bands as you would in a fishtail loom.",
      "content": "Start stringing your loom bands as you would in a fishtail loom. Start by putting one band in a figure of 8 position on your middle finger and index finger. Then put another band normally on your middle finger and index finger above the first band. [1] X Research source"
    },
    {
      "title": "Put an 'S' clip on the figure of 8 band.",
      "content": "Put an 'S' clip on the figure of 8 band. Then take your string, thread it through the second band and tie it on to the figure of 8 band. Next, hook the figure of 8 band on to the second band, like you would in a fishtail band."
    },
    {
      "title": "Take a third loom band and place it on your middle finger and index finger.",
      "content": "Take a third loom band and place it on your middle finger and index finger. Thread the string through the middle of this band. Then take a bead and slide it to the bottom of the string. Take the second band and hook it on to the third band. Don't worry if the bead pops out- you can rectify this at the end."
    },
    {
      "title": "Repeat until you reach the end of the bracelet and it is long enough to go around your wrist.",
      "content": "Repeat until you reach the end of the bracelet and it is long enough to go around your wrist. Remember, put each band on your middle finger and your index finger, thread the string through, slide the bead on the string, hook the band onto the bead, then put another band on your fingers. Continue doing this to the end. [2] X Research source Remember, don't let go of the string when a bead is on it or the bead will slide off of the end. Get plenty of bands and beads- you don't want to run out halfway through."
    },
    {
      "title": "At the end, put a last band on but don't put a bead on.",
      "content": "At the end, put a last band on but don't put a bead on. Then hook the end to the 'S' clip. Poke the beads that have popped out into the bands if you want, but it looks good either way. Cut the loose end off the string. Your loom band with beads is now finished."
    }
  ]
}