{
  "url": "https://www.wikihow.com/Be-Honest-Without-Being-Harsh",
  "title": "How to Be Honest Without Hurting Someone's Feelings",
  "steps": [
    {
      "title": "Ask yourself if your intentions are positive.",
      "content": "Ask yourself if your intentions are positive. It’s easy to criticize, but sometimes we criticize just for the sake of it, and not actually to help someone be better or to find a solution, which is a recipe for hurt feelings. Licensed Clinical Psychologist Christy Irvine says to “ask yourself what the purpose of your honesty is,” and what you hope to achieve by voicing it. [1] X Expert Source Christy Irvine, PhD Licensed Clinical Psychologist Expert Interview. 9 April 2021. If you’re delivering criticism , ask yourself if the criticism is either welcome or necessary to avoid further harm. Also, ask yourself if there’s a possibility that you’re the one in the wrong. It’s important to be honest with yourself, too! Never hesitate to be honest about your own feelings or emotions, especially when someone else is hurting them."
    },
    {
      "title": "Find the right time and place to make your point.",
      "content": "Find the right time and place to make your point. The context of your criticism also matters. [2] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Even the kindest criticism can hurt if the other person isn’t ready to receive it. Try to find a moment where they’re in a positive, receptive mood, and opt to talk to them in private, to avoid embarrassing anyone in front of others. Face-to-face is best; it helps both people read each other’s body language and respond to nonverbal cues. Of course, there isn’t always a perfect time or place, but still try to find the best conditions possible to voice your thoughts."
    },
    {
      "title": "Ask them if they’re comfortable discussing the issue.",
      "content": "Ask them if they’re comfortable discussing the issue. Someone who’s not open to criticism may never get the message, no matter how well you put it. Start your conversation by asking them if they’re open to an honest talk, and express that having the conversation is important to you. Also express that their own honesty is welcome, too. [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source For example, you might say, “Hey, something’s been on my mind recently and I wanted to share my honest thoughts with you. Is this a good time?” Again, there may never be a perfect time, so if the matter is urgent, you might try to broach the subject anyway, even if the other person is reluctant."
    },
    {
      "title": "Start with a compliment and keep an approachable tone.",
      "content": "Start with a compliment and keep an approachable tone. Leadership and Executive Coach Lauren Krasny says to “ start out with some positive validation , and then segue into the constructive feedback.” [4] X Expert Source Lauren Krasny Executive, Strategic, & Personal Coach Expert Interview. 27 March 2020. This helps the other person feel more comfortable, and less like you’re attacking them. As you talk, keep an approachable tone to help cushion your words. Talk softly and at a comfortable pace. For example, you might say, “I love how much effort you’ve put into this, and I want it to be the best it can be. Can I offer some critiques?”"
    },
    {
      "title": "Focus on being helpful, not hurtful.",
      "content": "Focus on being helpful, not hurtful. Avoid lingering too long on the negatives. They’re important to point out, but once they’re established, pivot and start talking about ways to fix them, or how to move forward. [5] X Research source This shows the other person that you really care, and aren’t just here to poke holes. For example, say, “I’ve noticed you’ve lagged on some deadlines. Is there anything I can do to help you to get these tasks done on time?”"
    },
    {
      "title": "Soften your language to avoid placing unnecessary blame.",
      "content": "Soften your language to avoid placing unnecessary blame. While it might be true that they’re in the wrong, blaming someone only gets you so far, and doesn’t solve the problem. When you talk about the issue, focus on just the facts of the event and your own perspective on it, and don’t linger on who’s to blame. Licensed Clinical Psychologist Christy Irvine says to emphasize feedback, rather than making personal attacks. [6] X Expert Source Christy Irvine, PhD Licensed Clinical Psychologist Expert Interview. 9 April 2021. For example, you might say, “Your comment really hurt my feelings,” instead of, “You hurt my feelings.” This focuses on the problem—what was said—rather than the person who said it. Also, if you find yourself saying, “Well, someone had to say it,” as a way to express anger toward someone, you may be using your honesty as a way to blame others."
    },
    {
      "title": "Make requests, not demands.",
      "content": "Make requests, not demands. Certified Life Purpose Coach Mel Shipman says to “respectfully present your ideas on how things can be improved.” [7] X Expert Source Mel Shipman Certified Life Purpose Coach, Owner of NextLevel Life, LLC Expert Interview. 31 August 2021. Part of that is framing your language. Even the best of us don’t like being told what to do. When offering solutions, avoid demanding change. Instead, ask for it, or express how much it would mean to you if things changed. This shows that you respect their agency and dignity, and aren’t just being controlling. For example, you might say, “I’d appreciate it if we didn’t talk about that so much. It embarrasses me,” instead of, “Stop saying that.”"
    },
    {
      "title": "Validate their feelings and listen to their response.",
      "content": "Validate their feelings and listen to their response. Honesty is a 2-way street, and they’re likely to have their own thoughts on the matter. Licensed Clinical Psychologist Christy Irvine says, “if they have a reaction to the honesty that you're giving them… [be] ready for that and [be] open to that conversation as well, even when it's hard for you to hear.” [8] X Expert Source Christy Irvine, PhD Licensed Clinical Psychologist Expert Interview. 9 April 2021. For example, say, “I understand if you’re upset by this, but I felt it was important to say, because I really respect and want the best for you. I’d love to hear your thoughts on it.” Also take note of their reaction. If they seem uncomfortable, like if they’re avoiding eye contact, you may need to soften your tone more, or shift to more positive aspects."
    },
    {
      "title": "End with a compliment or some humor.",
      "content": "End with a compliment or some humor. Certified Life Purpose Coach Mel Shipman says to close with “one last acknowledgement or appreciation for what they did.” [9] X Expert Source Mel Shipman Certified Life Purpose Coach, Owner of NextLevel Life, LLC Expert Interview. 31 August 2021. This ends things on a positive note and makes the other person more likely to take your honesty to heart. A little humor can also communicate that, though it’s a tough conversation, it’s not the end of the world. For example, you might say, “I really appreciate how honest I can be with you, and I like talking to you. Don’t hesitate to share your own thoughts!”"
    },
    {
      "title": "Sidestep tough questions, if necessary.",
      "content": "Sidestep tough questions, if necessary. Not every situation calls for complete honesty. For example, if someone asks, “Do you like my boyfriend?” or, “What do you think of these pants?” and your true feelings are negative, make your answer more general but still supportive. This allows you to be honest yet still kind and inoffensive. For example, your response might be, “I like that he makes you happy,” or, “I love how confident you look in those pants.”"
    },
    {
      "title": "Take deep breaths and keep your emotions neutral.",
      "content": "Take deep breaths and keep your emotions neutral. Even if your honest talk is about hurt feelings, it’s best to think of the situation from a detached perspective to have the most level-headed conversation. This doesn’t mean being cold or stoic; rather, it means focusing your energy on the problem, not how you feel in the moment. [10] X Research source For example, say, “Your habits keep making us late, and I want to figure this out,” instead of, “I can’t believe we’re late again because of you. What’s wrong with you?” If you need to, wait for your emotions to cool before you talk. Say, “I’m upset now, but I’d like to speak with you about this later so we can better understand each other.”"
    },
    {
      "title": "Withhold your judgments about them as a person.",
      "content": "Withhold your judgments about them as a person. Voicing your negative opinion of them as a person can be cruel, shuts down the conversation, and doesn’t leave any room for solutions. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Always focus on the situations and actions at hand, rather than the person’s moral character. For example, instead of saying, “I thought you weren’t the kind of person who would do drugs,” say, “I’m concerned about how drug use might be affecting our relationship.”"
    },
    {
      "title": "Remind yourself of the positives, and assume the best.",
      "content": "Remind yourself of the positives, and assume the best. It’s easy to assume the worst of someone when you’re frustrated with them, but that can hurt your communication. Before and after the conversation, think positive thoughts about them, and remind yourself that they probably didn’t mean to act negatively. [12] X Research source For example, you might think, “It was bad that they made us late, but they’re trying their best and they didn’t mean to.” Also, while it’s fine to talk to other friends or confidants about the issue, avoid bad-mouthing the person, which isn’t productive."
    }
  ]
}