{
  "url": "https://www.wikihow.com/Dab",
  "title": "Dabbing 101: How to Dab Like a Pro",
  "steps": [
    {
      "title": "Lift your arms out to your sides.",
      "content": "Lift your arms out to your sides. Raise up both of your arms so they are going straight out from your shoulders. Then, bend one arm in towards your body, as if you are preparing to sneeze into your hand. [1] X Research source Keep the other arm straight."
    },
    {
      "title": "Tuck your head down.",
      "content": "Tuck your head down. Next tuck your forehead down towards the arm that is bent and touch your forehead to your elbow area as if you are sneezing into your sleeve or dabbing sweat off of your brow. [2] X Research source [3] X Research source Keep the other arm straight. [4] X Research source Straighten out your arm after you dab your forehead on it."
    },
    {
      "title": "Bang your head into your elbow.",
      "content": "Bang your head into your elbow. After you bring your head in towards your elbow, you can do a quick head bang motion (or two) before you straighten out your arm and switch sides. [5] X Research source Just quickly jolt your head forward towards your elbow. Head banging is generally considered safe, but keep in mind that is can cause injuries if you do it too hard. [6] X Research source You can always skip the head bang motion if you have concerns."
    },
    {
      "title": "Switch sides.",
      "content": "Switch sides. You can repeat the dab multiple times on one side or switch sides. If you switch sides, then repeat the same dab movement on the other side with your other arm. For example, if you started by dabbing on your left side, then switch over to your right side. Keep switching back and forth along with the music."
    },
    {
      "title": "Move around.",
      "content": "Move around. You can do the dab movement with your upper body and move your lower body however you like. You can hop around, walk around, or wiggle your hips. You can also do other moves in between dabs, such as waving your fists in the air or moving your arms from side to side in front of you. [7] X Research source Add your own flair and just try to have fun!"
    },
    {
      "title": "Squat down.",
      "content": "Squat down. Hitting the Quan requires lots of movement in your lower body, so squat down a bit to give your legs and hips more room to move. Bend your knees so that you are squatting down a little bit. Keep in mind that you do not have to get really low to the ground to do this dance move. A slight bend in your knees is all you need."
    },
    {
      "title": "Swing your arms.",
      "content": "Swing your arms. Next, let your arms go a little limp at your sides and then use your shoulders to move your right arm in front of you and your left arm behind you. Then, switch your arms so that your left arm is in front of you and your right arm is behind you. [8] X Research source Keep rotating your arms back and forth like this. You can hold your arms up higher or down low. You can also bend your arms slightly at the elbows or keep them out straight."
    },
    {
      "title": "Move your hips.",
      "content": "Move your hips. Next, start to move your hips back and forth in a slow rolling movement. Keep rolling your hips forward and backwards. Try to move your body like a worm. You can also move your abs if you are flexible enough to do so. Some people use a thrusting movement when they hit the quan. [9] X Research source Do whatever feels natural to you."
    },
    {
      "title": "Move around.",
      "content": "Move around. Take baby steps forwards and backwards or move side to side as you continue to wave your arms back and forth and move your hips. [10] X Research source You can also do little hops or just stay in one place if you prefer."
    },
    {
      "title": "Stand with your feet shoulder width apart.",
      "content": "Stand with your feet shoulder width apart. The Shmoney is a really simple dance and it is great for slower songs. You can do it standing in one place, by yourself, or with a partner. You will need to start by standing with your feet shoulder width apart and bending your knees slightly. You don’t need to get super low to the ground for this dance, but you can if you like. It is up to you."
    },
    {
      "title": "Start twisting your hips.",
      "content": "Start twisting your hips. To generate movement for the shmoney dance, you will need to start rotating and twisting your hips back and forth. Allow your knees to move along with your hips. Move to the music and just relax. [11] X Research source Try moving one side twice and then move the other side once to add a little variation. Or, come up with your own pattern to follow."
    },
    {
      "title": "Move your arms in time with your hips.",
      "content": "Move your arms in time with your hips. You can raise your arms over your head or just raise them slightly above your chest. Move your arms however you like as you do the Shmoney. [12] X Research source Try swaying your arms back and forth over your head or twist them back and forth in front of you."
    }
  ]
}