{
  "url": "https://www.wikihow.com/Clear-a-Cartridge-Jam-in-a-Handgun",
  "title": "How to Clear a Cartridge Jam in a Handgun",
  "steps": [
    {
      "title": "Make sure the round has jammed and not misfired.",
      "content": "Make sure the round has jammed and not misfired. It is suggested you allow the handgun to remain pointed in a safe direction for several minutes before attempting to clear the jam in the event it is a delayed fire, and not a jam. For rounds that fired and left the empty shell casing stuck in the chamber, this step can be omitted."
    },
    {
      "title": "Keep the weapon pointed in a safe direction at all times when attempting to clear the jam.",
      "content": "Keep the weapon pointed in a safe direction at all times when attempting to clear the jam."
    },
    {
      "title": "If using an approach through the gun's barrel to clear a jam, use pliers or another tool to grip the cleaning rod or other tool you are removing the round with so your hand is never in front of the muzzle.",
      "content": "If using an approach through the gun's barrel to clear a jam, use pliers or another tool to grip the cleaning rod or other tool you are removing the round with so your hand is never in front of the muzzle."
    },
    {
      "title": "Make sure the ammunition you are using is suitable for your weapon before loading and firing it.",
      "content": "Make sure the ammunition you are using is suitable for your weapon before loading and firing it. Here are examples of potential ammunition problems that can cause jams: Old, corroded, bent, or malformed ammunition. Ammunition that has been incorrectly reloaded. Ammunition that has been exposed to moisture or extreme temperatures. Ammunition that is the incorrect caliber or style for your weapon."
    },
    {
      "title": "Consider the risk of using a gun that isn't feeding/firing correctly.",
      "content": "Consider the risk of using a gun that isn't feeding/firing correctly. Yes, you can probably clear a simple jam and continue shooting your handgun, but in the long run, if there are either mechanical issues or underlying problems with the gun, you might be putting yourself or others at risk by doing so. A trip to a qualified gunsmith might be money well spent."
    },
    {
      "title": "Keep the pistol pointed in a safe direction at all times.",
      "content": "Keep the pistol pointed in a safe direction at all times."
    },
    {
      "title": "Make sure it is a jam, and not that you had a misfire or are just out of ammunition.",
      "content": "Make sure it is a jam, and not that you had a misfire or are just out of ammunition. Open the action and look to see if a cartridge is stuck in the chamber or if another cartridge has failed to load completely."
    },
    {
      "title": "Remove the magazine.",
      "content": "Remove the magazine."
    },
    {
      "title": "Rack the slide a few times until the jammed round flies out.",
      "content": "Rack the slide a few times until the jammed round flies out."
    },
    {
      "title": "Insert a magazine and rack the slide.",
      "content": "Insert a magazine and rack the slide."
    },
    {
      "title": "Continue shooting.",
      "content": "Continue shooting."
    },
    {
      "title": "Remove the magazine from the firearm.",
      "content": "Remove the magazine from the firearm."
    },
    {
      "title": "Open the action to visually confirm there is an expended round in the chamber.",
      "content": "Open the action to visually confirm there is an expended round in the chamber. This event can be caused by either a weak ejector tang, a dirty chamber, or a damaged shell casing. If sliding the action back doesn't dislodge the jammed round, you may be able to visually inspect the shell extractor, it is a small metal item that grips the edge of the round to remove it from the chamber. If the bend at the end doesn't look clean or is deformed, continuing without repairing it will not be advisable. If the extractor appears to be in good condition, continue reading."
    },
    {
      "title": "Use a small, sharp tool to pry the round out of the chamber if the action is shallow enough to allow this method.",
      "content": "Use a small, sharp tool to pry the round out of the chamber if the action is shallow enough to allow this method. With the action locked open, use a metal pick, or a very small flat bladed screw driver, to pry the edge of the cartridge out of the chamber. Look closely at the chamber and cartridge for visual indications of why the cartridge jammed."
    },
    {
      "title": "Use a cleaning rod to tap the cartridge out of the chamber.",
      "content": "Use a cleaning rod to tap the cartridge out of the chamber. If you are not able to pry out the cartridge, lock the gun's action open and run a cleaning rod down the barrel to push out the jammed cartridge."
    },
    {
      "title": "Understand that a stovepipe jam differs slightly from a simple failure to extract jamb.",
      "content": "Understand that a stovepipe jam differs slightly from a simple failure to extract jamb. This is an event where the spent round failed to extract and another round tried to load behind it."
    },
    {
      "title": "Keep the pistol pointed in a safe direction at all times.",
      "content": "Keep the pistol pointed in a safe direction at all times."
    },
    {
      "title": "Remove the magazine of the pistol.",
      "content": "Remove the magazine of the pistol."
    },
    {
      "title": "Pull back on the slide or (in the case of pistols without a true \"slide\" open the action) and allow the round that failed to load to drop out.",
      "content": "Pull back on the slide or (in the case of pistols without a true \"slide\" open the action) and allow the round that failed to load to drop out. This can usually be done by tilting the open side of the action toward the ground, allowing it to simply fall out."
    },
    {
      "title": "Shake the empty case out, or lock the pistol open and pick the empty case out.",
      "content": "Shake the empty case out, or lock the pistol open and pick the empty case out."
    },
    {
      "title": "Replace the magazine and load a cartridge to resume firing.",
      "content": "Replace the magazine and load a cartridge to resume firing."
    },
    {
      "title": "Recognize that the other common event is a fail to feed, which means the old case is not in the way, but the pistol is having trouble feeding a fresh cartridge after firing.",
      "content": "Recognize that the other common event is a fail to feed, which means the old case is not in the way, but the pistol is having trouble feeding a fresh cartridge after firing. This can be caused by a few different issues, the most common being bullets of a shape that don't function well in a particular firearm, but clearing it is the same, regardless. If the pistol is \"jammed,\" that means the next cartridge has been stripped from the magazine, but didn't make it into the chamber in the proper way."
    },
    {
      "title": "Keep the pistol pointed in a safe direction.",
      "content": "Keep the pistol pointed in a safe direction."
    },
    {
      "title": "Remove the magazine.",
      "content": "Remove the magazine. If the loose cartridge did not fall out when you removed the magazine, pull back on the slide (or open the action) and tip the gun, to shake out the loose cartridge (do not re-use that cartridge if it has been deformed)."
    },
    {
      "title": "Replace the magazine and chamber a cartridge to resume shooting.",
      "content": "Replace the magazine and chamber a cartridge to resume shooting."
    },
    {
      "title": "Look at the whole situation after clearing the jammed cartridge.",
      "content": "Look at the whole situation after clearing the jammed cartridge. Is there an immediate need to continue firing, for instance, a self defense situation? If there is an urgent need to continue firing, then do so, but understand there may be risk involved."
    },
    {
      "title": "Examine the bullets and gun to make sure they are all in good working order.",
      "content": "Examine the bullets and gun to make sure they are all in good working order. Use a pen light to examine the chamber, looking for fouling, rust, or other damage that could cause the cartridge case to hang up. Look at the shells to make sure they are the correct caliber and type for your firearm. There are numerous different 9mm cartridges available, like 9mm Luger, 9mm Parabellum, and .380 Auto. These are not interchangeable. If you cannot ascertain you have the correct ammo, do not reload and fire your weapon."
    },
    {
      "title": "Understand that true jams almost never occur with a revolver.",
      "content": "Understand that true jams almost never occur with a revolver. If you experience one, you can tap the stuck round out of the cylinder (carefully, especially if it is an unfired round). You will probably find either a very dirty or corroded cartridge or chamber, or the incorrect caliber round."
    },
    {
      "title": "Note that double and single action revolvers have a mechanism to cycle the cylinder and to align it with the barrel before firing.",
      "content": "Note that double and single action revolvers have a mechanism to cycle the cylinder and to align it with the barrel before firing. If the cylinder fails to revolve , you probably need to carry the weapon to a qualified gunsmith for mechanical repairs."
    }
  ]
}