{
  "url": "https://www.wikihow.com/Have-a-Secret-Relationship-With-Someone",
  "title": "How to Hide a Relationship from Work, Family, or Friends",
  "steps": [
    {
      "title": "Keep any intimacy away from work.",
      "content": "Keep any intimacy away from work. Refrain from any shows of intimacy, romance, or affection while you’re in the office or around colleagues. [1] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Romantic behavior is always inappropriate at the office, but especially when you’re trying to hide a relationship. It's much too easy to get caught, and in many offices, that would be a reason to fire you. [2] X Research source Though some offices will fire you, other companies will move one of you to another department, suspend you, or give you a formal negative mark on your record."
    },
    {
      "title": "Invite others along when you spend time together.",
      "content": "Invite others along when you spend time together. If you decide to grab coffee on your lunch break, for example, invite others along at least 50% of the time. People will notice if you're always leaving and coming back together, and they may start to talk if you don't include other colleagues on occasion. [3] X Research source"
    },
    {
      "title": "Don't plan vacations together.",
      "content": "Don't plan vacations together. While it might sound like fun to be away together, if you're constantly gone at the same time for vacation, people may begin to wonder about your relationship. If you want to keep your office relationship a secret , stagger your vacations so that you’re never away at the same time. [4] X Research source If you really want to take a vacation together, do so on a week or weekend that everyone has off so you don’t seem suspicious."
    },
    {
      "title": "Don’t post photos of each other on social media.",
      "content": "Don’t post photos of each other on social media. Keep your online relationship status set to “single” and avoid posting any photos of the two of you on social media. If your colleagues see you constantly together on Instagram or Facebook, they may get suspicious. Remember, once you post something, even if it's only to your friends, it can easily become public if someone else posts it themselves."
    },
    {
      "title": "Control feelings of jealousy when you see your partner with other people.",
      "content": "Control feelings of jealousy when you see your partner with other people. When you’re around your coworkers, you have to treat your secret S.O. as if they were a platonic friend or colleague. Let’s say, for example, that some people in your office go for drinks after work and someone is flirting with your partner. You must pretend that this doesn’t bother you and react the same way you would with a friend. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Seize opportunities to be romantic, but be discreet.",
      "content": "Seize opportunities to be romantic, but be discreet. If you find yourself alone at the end of the day with your secret partner, take the opportunity to cherish that time together. Go out and have dinner, spend the evening together, or sweep them into a clandestine kiss. Just be sure to plan ahead by having a change of clothes on hand for the next morning so no one becomes suspicious. [6] X Research source"
    },
    {
      "title": "Be honest if confronted about your relationship.",
      "content": "Be honest if confronted about your relationship. If someone asks you directly about the relationship, it’s best to just tell the truth. If one person is asking, more people probably already suspect you are in a relationship, so it’s probably time to just come clean. [7] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Stay off of social media.",
      "content": "Stay off of social media. Just like with a romantic work relationship, if you want to keep a romantic relationship secret from your friends and family, keep pictures of you two together off of social media. In addition, of course, you don't want to change your relationship status. [8] X Research source"
    },
    {
      "title": "Delete your communications.",
      "content": "Delete your communications. If you are around friends and family members who will be looking at your phone or other devices from time to time, it's important to delete any communications between you and your secret partner. Delete text messages, instant messages, phone calls, photos, and voice messages from your significant other as soon as you can. [9] X Research source Make sure to delete evidence across all devices—including your phone, tablet, and computer. An alternative to this step is to buy a cheap phone specifically for your secret relationship. However, it may be more difficult to keep track of two phones."
    },
    {
      "title": "Keep a separate email account for your messages.",
      "content": "Keep a separate email account for your messages. If anyone has access to your email account, you may need to get a second one to hide your relationship. [10] X Research source Pick a different service than you normally use, and try using a different name so that it won't be linked to you."
    },
    {
      "title": "Clear your browser history regularly.",
      "content": "Clear your browser history regularly. If you're visiting sites that might seem suspicious, even if it's just a fancy restaurant that you’d only bring a date to, you need to clear your browser history when you're done with the computer. Of course, you only need to clear it if you're using a shared computer, but it's better to be safe than sorry if you're really trying to keep a secret . On some browsers, such as Google Chrome, you can activate incognito mode to browse without the computer tracking what you do. If your browser doesn't have that feature, you can simply clear the history and the cookies when you are done with each session, the controls for which are located under the main menu and the history section. [11] X Research source"
    },
    {
      "title": "Use a separate credit card for any related expenses.",
      "content": "Use a separate credit card for any related expenses. If you share a bank account with another person, use a separate credit card when you go out with your new romantic partner. Otherwise, pay in cash if you can. If you pay with your normal card, your family member or friend may wonder where the new charges are coming from. [12] X Research source If there’s any chance that friends or family members may look through your wallet, it's best to keep this card somewhere more discreet."
    },
    {
      "title": "Go to discreet locations that your friends and family don’t frequent.",
      "content": "Go to discreet locations that your friends and family don’t frequent. Try to avoid any location where you might run into people who know you and whom you’re trying to hide the relationship from. If you must, drive to a nearby town or suburb so you don't run into people you know."
    },
    {
      "title": "Communicate with your partner about the reasons for your secret relationship.",
      "content": "Communicate with your partner about the reasons for your secret relationship. When you are going to intentionally hide a relationship, your significant other needs to be on board. Otherwise, they may feel like you are embarrassed by them. Discuss the reasons why you want to keep it secret and be open about your feelings. Propose a deadline for when you’ll make the relationship public and how you’ll present the news to the people in your life. The most important thing is that the two of you are in agreement on the timeline. Understand that, whatever the reason for hiding the relationship, your partner may be upset. Most of the time, people don't want to be kept hidden, so you may ruffle some feathers if you make this suggestion. When navigating this tricky topic, Ratson suggests focusing on “communication, respect, and understanding each other’s needs.” “For some people,” Ratson continues, “that kind of privacy or secrecy will be problematic. But how do they communicate that? Does it amplify their insecurities? What can you do to work with them?”"
    },
    {
      "title": "A secret relationship is a relationship where your romance is kept hidden.",
      "content": "A secret relationship is a relationship where your romance is kept hidden. These relationships are typically between two people who are romantically and physically intimate, but one or both partners are keeping their relationship secret from their friends, family, or workplace. This situation may also be referred to as “secret dating,” “secret romance,” or even “forbidden love.” Keep in mind that private relationships and secret relationships aren’t the same thing. Someone in a private relationship won’t care about being seen with you, but they might avoid posting on social media or talking about your relationship to others. [13] X Research source"
    },
    {
      "title": "Avoiding judgment",
      "content": "Avoiding judgment Some people want to focus on their relationship rather than the opinions of others. A new relationship can bring on a lot of opinions from other people. While those opinions are worth listening to if they point to toxicity or abuse, someone in a new relationship might want to focus on building a strong bond with their partner without worrying about what others think."
    },
    {
      "title": "Undefined relationships",
      "content": "Undefined relationships If two people are involved but not quite a couple yet, they don’t really have an intentionally secret relationship. However, they may be keeping things under wraps until they decide how serious the relationship really is. This situation is especially common when a romance blooms between two friends or coworkers who have to navigate the complexities of their relationship."
    },
    {
      "title": "Familial or social pressure",
      "content": "Familial or social pressure Someone may avoid revealing their significant other because they're worried about judgment and shunning. They may have been raised in a religion or culture that encourages them to only date within their social circle. As a result, they may try to hide their forbidden relationships or seek out real romantic connections after being forced into a commitment that they didn’t want. [14] X Research source"
    },
    {
      "title": "Fears of homophobia",
      "content": "Fears of homophobia If someone privately identifies as a member of the LGBTQIA+ community but hasn’t come out to friends and family, they may want to hide their new relationship from certain people. This individual (or their partner) may be from a conservative family or live in an area where homophobic attitudes could pose a real danger. [15] X Research source"
    },
    {
      "title": "Protection and safety",
      "content": "Protection and safety If a person fears that the exposure of their relationship will cause harm to them or their secret lover, then they may be hiding the romance in order to protect both parties from physical or emotional damage. This scenario could arise if one person is in an open relationship that’s unknown to family and friends, if one person is concerned about how their family will react, or if one person is famous on the internet and worried about harassment from fans. In more extreme cases, one of the participants in the secret relationship may already be in a public relationship with someone who’s physically or emotionally abusive or neglectful. [16] X Research source They may be in the process of leaving this relationship and want to save their new romantic interest from any repercussions from a toxic partner."
    },
    {
      "title": "Infidelity",
      "content": "Infidelity If one or both partners in the secret relationship are already in committed relationships with other people, they’re probably afraid of this infidelity being exposed. While this type of secret relationship may feel fun or risque at first, participants should keep in mind that cheating and infidelity have the potential to do real damage to people’s lives (including their own). [17] X Research source In almost every situation, it’s better for the monogamous couple to break up rather than engage in infidelity. If one person is not already in a committed relationship and the other is, the single individual may want to consider what the future of this relationship looks like and what harm they may be complicit in causing."
    },
    {
      "title": "Signs of hidden relationships include a lack of public dates and social media posts.",
      "content": "Signs of hidden relationships include a lack of public dates and social media posts. While it may seem like secret relationships are easy to spot, it’s not always obvious—and sometimes, one person is intentionally hiding the relationship while the other has no idea. You may be in a secret relationship if your partner is doing any of these things: [18] X Research source Acting reluctant to introduce you to family and friends. Introducing you to others but without a romantic label. Not telling people in their lives about your relationship. Avoiding spending time with you in public. Acting nervous or anxious when you’re out in public together. Using only one form of communication (i.e., email but not text or phone calls). Refusing to post you on social media (but they post about every other aspect of their lives). Giving you gifts but asking you to keep them secret. Being physically intimate with you but not making time for conversation or other activities."
    },
    {
      "title": "Secret relationships may work out, but it depends on the situation.",
      "content": "Secret relationships may work out, but it depends on the situation. Hidden relationships that involve infidelity or cheating are usually toxic, harmful, and unlikely to last. Alternatively, a pair of single colleagues who want to avoid workplace gossip have a higher likelihood of success. In general, however, the continued stress of a secret relationship can place a strain on a relationship and cause it to fail. According to Ratson, “secrecy in general is not something positive in a healthy relationship because you’re hiding something. You have to ask yourself why you’re hiding the information. What is it that you’re trying to achieve?” If you’re not sure whether your secret relationship is healthy and worth the effort, follow Ratson’s advice and start by asking why you’re hiding the relationship. This is especially important if you’re dealing with a partner who wants to hide the relationship when you don’t. Evaluate if they have a valid reason (e.g., fear of homophobic or discriminatory family members) or not (e.g., they’re married to a faithful partner). Consider the timeline and plan for your relationship—at some point in the near future, will you be able to be together publicly? If not, continuing this romance may not be worth it. Identify any potential consequences of your actions and use those as a deciding factor. Will your actions hurt someone else? Will they isolate you from family and friends? Will they potentially damage your career goals?"
    }
  ]
}