{
  "url": "https://www.wikihow.com/Catch-a-Squirrel",
  "title": "How to Catch a Squirrel",
  "steps": [
    {
      "title": "Buy a live trap designed for squirrels.",
      "content": "Buy a live trap designed for squirrels. Most live traps are metal cages with a trip-lever in the back. The squirrel walks in, drawn by the alluring smell of bait, and trips the lever to shut the door of the cage. This way, you can catch it without hurting it. Visit a local hunting and fishing supply store or look online for the right trap. Make sure that the cage is large enough to hold a squirrel. In general, it should be at least 16 in (41 cm) long, 5 in (13 cm) wide, and 5 in (13 cm) high. [1] X Research source If you're up for a project, consider building a squirrel trap from things you might have lying around your home. This trapping method also works if you're hunting for squirrels outside."
    },
    {
      "title": "Use nuts and grains as bait for the squirrel.",
      "content": "Use nuts and grains as bait for the squirrel. There are a few things squirrels particularly like. Peanut butter is tasty and it isn't something that squirrels come across often, so they'll definitely go for it. Grains like bread are a great supplement to the nutty flavor, so try spreading peanut butter onto a piece of bread. You can also use any other nuts, nut butter, seeds, trail mix, or fresh fruit. [2] X Research source Don't use meat or dairy products to attract the squirrel. These could make them sick."
    },
    {
      "title": "Try to \"chum\" the squirrels to attract them to the area.",
      "content": "Try to \"chum\" the squirrels to attract them to the area. Leave small morsels of your bait out in the open, either with no trap or a disabled trap, so they get used to the taste. Do this for a couple of days before you try to catch a squirrel. This will \"train\" the squirrel to seek out these easy, tasty meals. [3] X Research source This is also a good method if you're hunting or trying to get squirrels off a large outdoor property."
    },
    {
      "title": "Set the trap where a squirrel will find it.",
      "content": "Set the trap where a squirrel will find it. Pick a spot where you've spotted the squirrel or attracted it with chum. To set the trap, pull the door up to open it. Then slide the retaining hook inside the trap to lock the door in place. Lay it on the ground and put some bait at the back of the trap to attract the squirrel. [4] X Research source Different traps might have different instructions, so follow the directions on the device you use. Be careful not to touch the platform inside the trap or the door will close."
    },
    {
      "title": "Check the trap every day.",
      "content": "Check the trap every day. The squirrel won't last too long without food, so you'll need to release it quickly. Monitor the trap at least once a day so you find any trapped squirrels. [5] X Research source Try not to spook the squirrels. Check the trap from far away if you can. If the trap is outside, look out your window instead of coming close. However, if the trap is in your attic or another indoor space, you might not be able to avoid creating a disturbance. If you don't catch a squirrel within a week, try putting fresh bait into the trap or moving it to a new location."
    },
    {
      "title": "Release the squirrel outside when you catch it.",
      "content": "Release the squirrel outside when you catch it. Bring the trap outside while it's still closed. Set the trap on the ground and wait for the squirrel to calm down. Then, when you're ready, carefully pull open the door of the trap and hold it to let the squirrel run free. Be patient. You may need to wait a minute or two for the squirrel to feel comfortable making a dash. Try walking away from the trap for a minute, then coming back once the squirrel has escaped. You may have heard that releasing the squirrel far away from your property is a good solution, but this isn't true. The squirrel will probably find its way back, and it's also harmful to the squirrel to be taken away from its home area. [6] X Research source"
    },
    {
      "title": "Leave some food out in a corner to attract the squirrel.",
      "content": "Leave some food out in a corner to attract the squirrel. You can still catch the squirrel if you don’t have a trap, but you’ll have to lure it to a particular spot. Squirrels are especially attracted to peanut butter and nuts, so this is a good choice to leave out as bait. Then wait for the squirrel to approach the food. The corner of a room is the best spot because the squirrel won’t be able to escape. If there is nearby furniture that the squirrel could duck behind, move it before putting the food out. Keep a close eye on the spot, but don’t stay too close. The squirrel will probably not come over if you’re nearby. Stay quiet too. You don’t want to scare the squirrel away."
    },
    {
      "title": "Put on a heavy pair of work gloves.",
      "content": "Put on a heavy pair of work gloves. You’ll have to get pretty close to catch the squirrel without a trap. Since scared squirrels might bite, put on a thick pair of work gloves to protect yourself. [7] X Research source The gloves are just a precaution. If all goes well, you won’t be directly touching the squirrel."
    },
    {
      "title": "Approach the squirrel holding a blanket up so it can’t see you.",
      "content": "Approach the squirrel holding a blanket up so it can’t see you. This might feel a little silly, but it works well. When the squirrel starts eating the food, hold up the blanket in front of you so it blocks the squirrel from seeing you. Approach the squirrel slowly and quietly, without making any sudden movements. Holding the blanket up is important because the squirrel will get spooked if it sees a human shape. You could also use a towel, sheet, or net if that’s what you have."
    },
    {
      "title": "Throw the blanket over the squirrel and roll it up.",
      "content": "Throw the blanket over the squirrel and roll it up. When you’re close enough, toss the blanket out so it covers the squirrel. Then, quickly but gently, roll the blanket up to trap the squirrel. Don’t press down on the blanket or hold it with too much pressure. You don’t want to hurt the squirrel. Do not try to grab the squirrel if it isn’t wrapped up in the blanket. It might start biting. If it starts getting out, let it go so you don’t get bitten."
    },
    {
      "title": "Release the squirrel outside.",
      "content": "Release the squirrel outside. Keep the squirrel wrapped up gently and bring it outside your home. Place the towel on the ground and unroll it. When the squirrel is free, it will run off. The squirrel will probably be struggling in the blanket. Do your best to keep it wrapped up without pressing hard on it. You might be tempted to bring the squirrel far away from your property to release it, but this isn't the best plan. The squirrel will probably find its way back, and it's also harmful for the squirrel to be taken away from its home area. [8] X Research source"
    }
  ]
}