{
  "url": "https://www.wikihow.com/Download-Purchased-Games-on-PS4",
  "title": "How to Download Purchased Games on PS4",
  "steps": [
    {
      "title": "Press the PS button on your controller.",
      "content": "Press the PS button on your controller. This opens your profile's Dashboard page."
    },
    {
      "title": "Use the left analog stick to highlight Library.",
      "content": "Use the left analog stick to highlight Library . This tile is the furthest one on the right."
    },
    {
      "title": "Press ✕ on the controller.",
      "content": "Press ✕ on the controller. This opens the Library."
    },
    {
      "title": "Scroll down to highlight Purchased.",
      "content": "Scroll down to highlight Purchased . This option is on the left side of the screen. Highlighting it shows you every game you've previously purchased with your account. Games that are not currently installed are displayed first, with currently installed games displayed beneath them."
    },
    {
      "title": "Highlight a game and press ✕.",
      "content": "Highlight a game and press ✕ . This opens the game's Details page."
    },
    {
      "title": "Press ✕ again to select Download.",
      "content": "Press ✕ again to select Download . The game is downloaded to your console. Depending on the size of the game and the speed of your internet connection, your download may take some time to complete. [1] X Research source"
    },
    {
      "title": "Press the PS button on your controller.",
      "content": "Press the PS button on your controller. This opens your profile's Dashboard page."
    },
    {
      "title": "Use the left analog stick to highlight the PlayStation Store tile.",
      "content": "Use the left analog stick to highlight the PlayStation Store tile. This tile is the furthest one on the left."
    },
    {
      "title": "Press ✕.",
      "content": "Press ✕ . This opens the PlayStation Store."
    },
    {
      "title": "Highlight Search and press ✕.",
      "content": "Highlight Search and press ✕ . This opens the Search menu."
    },
    {
      "title": "Type the name of a game you want to download.",
      "content": "Type the name of a game you want to download. You can use the on-screen keyboard to do this. As you type, a list of search results will appear. This screen also shows you a list of the day's most-searched games. Choose one by highlighting it and pressing ✕ ."
    },
    {
      "title": "Highlight your game and press ✕.",
      "content": "Highlight your game and press ✕ . This brings up the game's screen."
    },
    {
      "title": "Highlight Download and press ✕.",
      "content": "Highlight Download and press ✕ . It's in the bottom-left area of the screen. The game will now download to your PS4. If the option displays a price and reads Add to Cart instead of Download , you don't currently own a digital license for this game. To buy it, select Add to Cart and then Proceed to Checkout on the next screen to complete the purchase. Depending on the size of the game and the speed of your internet connection, your download may take some time to complete."
    }
  ]
}