{
  "url": "https://www.wikihow.com/Edit-Ads-on-Instagram",
  "title": "How to Edit Ads on Instagram Using the \"Delete Promotion\" Trick",
  "steps": [
    {
      "title": "Go to your Instagram profile.",
      "content": "Go to your Instagram profile. Once you've opened Instagram on your phone or tablet, tap the Profile icon, which is the outline of a person at the bottom-right corner."
    },
    {
      "title": "Tap Promotions.",
      "content": "Tap Promotions . It's at the top of your profile. [1] X Research source A list of your ads will appear."
    },
    {
      "title": "Tap View Insights on the ad you want to edit.",
      "content": "Tap View Insights on the ad you want to edit. It's below the ad."
    },
    {
      "title": "Scroll down and tap Delete Promotion.",
      "content": "Scroll down and tap Delete Promotion . A confirmation message will appear."
    },
    {
      "title": "Tap OK to confirm.",
      "content": "Tap OK to confirm. The ad is now deleted, although the original post on which the ad was based is still on your profile."
    },
    {
      "title": "Return to your profile.",
      "content": "Return to your profile. Now that you've deleted the ad, you can edit the original post and make a new ad based on that."
    },
    {
      "title": "Tap the post you want to promote.",
      "content": "Tap the post you want to promote. This opens the post for viewing."
    },
    {
      "title": "Tap the three dots and select Edit.",
      "content": "Tap the three dots and select Edit . The three dots are at the top-right corner of the post. Now you can replace the text in the post with the desired text. If you want to change the images or videos in the post, you'll need to just create a whole new post."
    },
    {
      "title": "Make your changes and tap Done.",
      "content": "Make your changes and tap Done . The contents of the post will update automatically."
    },
    {
      "title": "Tap Promote beneath your post to turn it into an ad.",
      "content": "Tap Promote beneath your post to turn it into an ad. Now that you've saved your edits, you can promote the new version. [2] X Research source"
    }
  ]
}