{
  "url": "https://www.wikihow.com/Defrost-a-Refrigerator",
  "title": "The Complete Guide to Defrosting a Refrigerator Fast",
  "steps": [
    {
      "title": "Empty out your refrigerator.",
      "content": "Empty out your refrigerator. Take this as an opportunity to get rid of all the junk or expired food you’ve collected over time! To stop the rest of your food from spoiling when you remove it from the fridge, store it in coolers or on ice. [1] X Research source"
    },
    {
      "title": "Remove the shelves and drawers from your refrigerator.",
      "content": "Remove the shelves and drawers from your refrigerator. Though you don’t necessarily need to clean them all, this would be a great time to do so. Be careful at this point, since cold plastic is more likely to be brittle and break."
    },
    {
      "title": "Unplug your refrigerator and open the doors so the ice can melt.",
      "content": "Unplug your refrigerator and open the doors so the ice can melt. [2] X Expert Source Aaron Beth Appliance Technician Expert Interview. 14 July 2020. Moving the fridge away from the wall will make it easier to clean any leaking water, as well as give you the chance to sweep behind and beneath. At this point, it’s also important to lay down some bowls or towels to collect water that may leak out as the frost melts. [3] X Research source"
    },
    {
      "title": "Leave the refrigerator open and unplugged for eight hours.",
      "content": "Leave the refrigerator open and unplugged for eight hours. If you’re not in a rush, this is your best option to thoroughly defrost the fridge, though you will need to find a more stable and cool place to store food for this period of time. [4] X Research source"
    },
    {
      "title": "Place a pot of hot or boiling water in the refrigerator.",
      "content": "Place a pot of hot or boiling water in the refrigerator. [5] X Expert Source Aaron Beth Appliance Technician Expert Interview. 14 July 2020. The heat will help to more quickly melt the ice and frost, but be careful! Make sure to put a towel, blanket, or pot holder underneath to protect your floors. [6] X Research source"
    },
    {
      "title": "Use a hair dryer to loosen and melt small bits of frost.",
      "content": "Use a hair dryer to loosen and melt small bits of frost. For larger chunks of ice, loosen them first with the dryer, then use a soft, plastic spatula to chip away or pick it up out of the fridge. Only use a hairdryer if your refrigerator does not have styrofoam insulation, which could melt. [7] X Expert Source Aaron Beth Appliance Technician Expert Interview. 14 July 2020. It’s important to use a plastic, not a metal spatula, because metal may puncture or damage your refrigerator. [8] X Research source"
    },
    {
      "title": "Place a fan near the open refrigerator and turn it on.",
      "content": "Place a fan near the open refrigerator and turn it on. The increased airflow will not only help to defrost your refrigerator more quickly by raising the temperature, but it will also help some of the melted water evaporate. This will make clean up much easier! [9] X Research source"
    }
  ]
}