{
  "url": "https://www.wikihow.com/Peel-Shrimp",
  "title": "Peel and Devein Raw, Frozen, or Cooked Shrimp Fast",
  "steps": [
    {
      "title": "Cover the shrimp in cold water to thaw them.",
      "content": "Cover the shrimp in cold water to thaw them . You can soak them in a large mixing bowl or put them in a colander under running water. Thaw the shrimp for about 10 to 20 minutes, or until they feel soft to the touch and you don’t feel any ice crystals. [2] X Research source Make sure you use cold water because warm water will harden the texture of your shrimp. Prepare another part of your meal while the shrimp thaw to save time in the kitchen."
    },
    {
      "title": "Place the shrimp in a colander and hold them under running water.",
      "content": "Place the shrimp in a colander and hold them under running water. Gently shake the shrimp to make sure they’re all thoroughly rinsed, then pour them out on a baking sheet . Add salt to the water if your shrimp were frozen to refresh the flavor. Just add 1 to 2 teaspoons (6 to 12 grams) of salt per 1 quart (0.95 L) of water. [3] X Research source"
    },
    {
      "title": "Shrimp spoil quickly, so keep them cold.",
      "content": "Shrimp spoil quickly, so keep them cold. Fill a large bowl with ice and water, then set it near your work area. Place the unpeeled shrimp on one side. As you peel your shrimp, put them back into the bowl to keep them chilled. [4] X Research source All of your shrimp should be either raw or cooked, so they can be in the same bowl."
    },
    {
      "title": "Hold the shrimp in one hand, and remove the head with the other.",
      "content": "Hold the shrimp in one hand, and remove the head with the other. With an easy twist, the entire head will break off the shrimp. Place the heads in a separate pile of shells. [5] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source What if the recipe says “head-on”? Just skip this step. The heads add a unique flavor that’s sweet and buttery, and they help keep the shrimp moist."
    },
    {
      "title": "The shell under the legs is softer, so they should pull off easily.",
      "content": "The shell under the legs is softer, so they should pull off easily. Grip them with your fingers and pull. If the shell remains attached to the legs, keep going to pull the shell off in one piece. [6] X Research source"
    },
    {
      "title": "Use your fingers to remove the shell.",
      "content": "Use your fingers to remove the shell. Push your thumb under the edge of the shell and pull the shell up. Slide the shrimp out of the shell, then place the shell to the side. [7] X Research source Alternative: Try the fork method! Push the bottom tine of a fork under the top of the shell where the vein is. Then, pull up to break the shell. Use your fingers to pull the shell off the rest of the way. Save the shells to make shrimp stock, seafood soup, or bisque. [8] X Research source Just rinse them and freeze them. They’ll stay fresh in your freezer for up to 3 months."
    },
    {
      "title": "Use your thumb and forefinger to remove the tail.",
      "content": "Use your thumb and forefinger to remove the tail. It should slide off easily and leave the meat intact. Add the tail to your pile of shells to use for stock or soup. [9] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source Can you leave the tail on? Leave the tail on raw shrimp if your recipe calls for tail-on shrimp. Similarly, you might leave the tail on cooked shrimp if you like the look. For instance, a shrimp cocktail looks great with tail-on shrimp. To peel the shrimp faster, just leave the tails on."
    },
    {
      "title": "Cutting the shrimp makes it much easier to devein it.",
      "content": "Cutting the shrimp makes it much easier to devein it. Press the tip of your paring knife about 1 ⁄ 4 in (0.64 cm) into the shrimp at either end of the tail. Then, slowly glide your knife along the back of the shrimp. [10] X Research source Only make a shallow cut because the vein is right under the skin. You could also use a deveining tool , if you have one. [11] X Research source You don’t need to devein small or medium shrimp unless the vein bothers you. [12] X Research source"
    },
    {
      "title": "It’s okay if you need to remove the vein in pieces.",
      "content": "It’s okay if you need to remove the vein in pieces. Lift up the vein using the tip of the knife, then pull out the vein. Either pick it out with your fingers or pull it up with your knife, depending on what’s easiest for you. [13] X Research source The vein is the shrimp’s digestive system. Eating it won’t hurt you, but it typically tastes bitter and might add grit. Some shrimp have a second vein on their belly. You don’t need to remove this vein unless it really bothers you. If it does, simply cut along the belly with your paring knife, then pull out the vein. [14] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Pour the shrimp and water over your colander.",
      "content": "Pour the shrimp and water over your colander. Then, lay them out on your baking dish. Pat the shrimp dry again with a clean towel or a paper towel. You want the shrimp to be mostly dry because they’ll be more flavorful, since excess water could dilute the seasoning. [15] X Research source You might want to rinse them again if there’s any stuck-on debris left from the veins. However, this usually isn’t necessary."
    },
    {
      "title": "Store them in either the refrigerator or the freezer.",
      "content": "Store them in either the refrigerator or the freezer. If you’re going to use the shrimp within 48 hours, put them in an airtight container and place them in the refrigerator at 40 °F (4 °C) or below. To preserve the shrimp longer, wrap them in parchment paper, plastic wrap, or foil, then freeze them. [16] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    }
  ]
}