{
  "url": "https://www.wikihow.com/Ask-Someone-if-They-Like-Your-Friend",
  "title": "10 Smart Ways to Ask Someone if They Like Your Friend",
  "steps": [
    {
      "title": "It’s the easiest way to figure out if someone likes your friend.",
      "content": "It’s the easiest way to figure out if someone likes your friend. Make sure you get your friend’s permission before talking to their crush. If your friend’s okay with it, simply walk up to your friend’s crush and pop the question. Try to do it privately so they don’t feel like they’re on the spot. [1] X Research source You could simply ask, “Hey, do you like Breanne?” Keep in mind that your friend’s crush might be too shy to admit their feelings to you, so they might say no, even if they don’t mean it."
    },
    {
      "title": "Use this less invasive option if the person is a little shy.",
      "content": "Use this less invasive option if the person is a little shy. Your friend’s crush might feel better about admitting their feelings if you shoot them a text or DM. If you have their number, just ask them who they have a crush on or if they like your friend. [2] X Research source Send a simple text like, “Hey, do you have a crush on anyone?” If the answer is yes, you can forward the good news to your friend! If the answer is no, you can slowly but surely convince your friend to set their sights on someone else."
    },
    {
      "title": "Casually mention that your friend thinks the crush is cute.",
      "content": "Casually mention that your friend thinks the crush is cute. You don’t have to spill all your friends’ secrets (like how they write about their crush in a journal every night), but you can give their crush a clue. Put your friend on their radar by saying something like: [3] X Research source “You probably already know this, but Jessica thinks you’re cute.” “Have you talked to Brian lately? I think he kinda likes you.”"
    },
    {
      "title": "Ask if they’re dating anyone to get a read on the situation.",
      "content": "Ask if they’re dating anyone to get a read on the situation. If they’re talking to someone or hanging out with someone else, you can probably tell that they don’t like your friend. If they make it clear that they’re single, though, your friend still has a chance! [4] X Research source Say something like, “So, are you dating anyone?” Or, “How’s the love life been lately?”"
    },
    {
      "title": "If your friend’s crush is single, it might be by choice.",
      "content": "If your friend’s crush is single, it might be by choice. Ask them a few questions to see if they’re looking for someone to date or if they’re not super interested. If they are open for a relationship, your friend still has a chance! [5] X Research source Say something like, “You’ve been single for a while now. Are you looking for a new girlfriend?” Or, “I heard that you and your boyfriend broke up. Are you taking a break from the dating scene for a while?”"
    },
    {
      "title": "Someone’s type is an insight into who they might like.",
      "content": "Someone’s type is an insight into who they might like. If your friend’s crush describes your friend to a tee, they’re probably a good match! You can also ask about people they’ve dated in the past to get a better read on who they might like. [6] X Research source Ask something like, “Do you have a type?” Or, “What kind of people do you normally date?”"
    },
    {
      "title": "Slyly ask your friend’s crush if they like your friend.",
      "content": "Slyly ask your friend’s crush if they like your friend. Try asking your friend’s crush who they like or who they’re eyeing right now to get a read on the situation. Don’t push it too hard, or you might be a little obvious. [7] X Research source Say something like, “Do you have a crush on anyone?” Or, “Who do you like?”"
    },
    {
      "title": "It’s a great way to ask if they like your friend while staying lowkey.",
      "content": "It’s a great way to ask if they like your friend while staying lowkey. Phrase it in a way that makes it seem totally crazy. You can keep it lowkey while still getting a straight answer out of your friend’s crush. Try not to make it obvious, and say something like: [8] X Research source “If you absolutely had to date one of my friends, who would you pick?” “If you had to, which of my friends would you ask out on a date?”"
    },
    {
      "title": "Be a good wingman by setting the two of them up.",
      "content": "Be a good wingman by setting the two of them up. Check in with your friend first to make sure it’s okay. Then, offer to text your friend’s crush your friend’s number so they can hang out later. If they say yes, it’s a good sign! [9] X Research source Say something like, “Hey, I could give you Taylor’s number if you want it.” Your friend might be embarrassed about this at first, but they’ll be grateful later on when they get a fun text from their crush."
    },
    {
      "title": "If their crush agrees, it’s a great sign!",
      "content": "If their crush agrees, it’s a great sign! Try hinting about how cool or awesome your friend is when their crush is around. You could compliment their school work, their outfit, or how kind they are. Try something like: [10] X Research source “Elaine always wears the coolest outfits to school.” “It’s crazy how smart James is. He’s probably the smartest guy in our school.”"
    }
  ]
}