{
  "url": "https://www.wikihow.com/Run-a-6-Minute-Mile",
  "title": "How to Run a 6 Minute Mile",
  "steps": [
    {
      "title": "Work on your 1⁄4 and 1⁄2 mile (0.4 and 0.8 km).",
      "content": "Work on your 1 ⁄ 4 and 1 ⁄ 2 mile (0.4 and 0.8 km). Instead of looking at the whole, break down the mile into parts; it's a lot more manageable to work on your skills in 90-second chunks. When you get to that 90-second 1 ⁄ 4 mile (0.4 km), start working on your 1/2. When you can do a half-mile for around 3 minutes, you'll be jazzed to see if you can keep the pace. So skip the unnecessary duress on your knees and break it into pieces. Psychologically, your brain looks at that 6-minute mile and goes wah-ha-ha-ha-ait a second. 6 minutes? Are you crazy? But 90 seconds of going all out? ... Why not?"
    },
    {
      "title": "HIIT it.",
      "content": "HIIT it. That stands for High-Intensity Interval Training and it's quite possibly one of the best things you can do for your mile time and for your overall athletic performance. It's like sprints (as discussed above), but repetitive and cyclical. For example, you might run all out for one minute, rest for one minute, and repeat for 8 or so cycles. Eventually, that 6-minute mile seems like a leisurely walk in the park. As you get better at it, up the intense periods. Go to 75 seconds of running and after that, 45 seconds of rest. Keep going in small increments until you're up to two 3-minute chunks. Then all you have to do is piece them together!"
    },
    {
      "title": "Work on your endurance with long-distance running.",
      "content": "Work on your endurance with long-distance running. When you train, run more than just that goal of 1 mile (1.6 km). Speed isn't the only key -- endurance will get you going, too. So take a break from your speed training and go for a nice, long jog to break up your running routine. When you routinely run 5 miles (8.0 km), the 1 mile (1.6 km) poses way less of a threat. Use it as a reason to change up your environment. Move your run to the gym, your home treadmill, or a different trail outside. It's about keeping your mind fresh, too! Build your endurance by spending a little more time running each day. You might start running for 10 minutes, then increase it to 15 minutes during your next workout."
    },
    {
      "title": "Run hills.",
      "content": "Run hills. The third player here, in addition to endurance and speed, is strength. To propel your body at this speed, you're gonna need to build it up. Jogging the track for miles won't do you as many favors as a hilly track will! Getting your heart rate up and your muscles earning it on inclined terrain primes them to take you to the next level when the ground is flat. This is a good excuse to change up your routine, too. It's easy to hit the gym or your favorite track at the beginning, but then you inevitably get bored with it and hit autopilot, never reaching your goals. Spice it up by finding a hillier route to keep your mind in the speed zone, too."
    },
    {
      "title": "Start training for time.",
      "content": "Start training for time. Learn to run a 1 ⁄ 4 mile (0.4 km) in 1:30, then a 1 ⁄ 2 mile (0.8 km) in 3:00, then a 3 ⁄ 4 mile (1.2 km) in 4:30, and finally try to reach the goal of a 6 minute mile. Find a route where you can easily see the distance markers, grab your stopwatch, and see where your feet take you. It's the only way to know how lofty your goals are -- or how attainable. That being said, don't feel the need to do this every day. Work on your skills for the majority of the week and then see how far you've come. If you do it every day, it'll just become a drag."
    },
    {
      "title": "If you're racing, keep a few things in mind.",
      "content": "If you're racing, keep a few things in mind. If that 6-minute goal is because you're a competitive runner, there's some science that can help you get ahead of the pack and get you to the finish line sooner: Start strong. Unless you're playing the dark horse card, you don't want the pressure of making some ultimate comeback. Hang near the front group initially so you aren't facing a mob of obstacles in front of you. But don't feel the pressure to be in the lead at first. That person sets the pace, breaks the wind, and feels an enormous amount of pressure from all the people running at their heels. They'll get tired eventually and that's when you make your break for it. Make sure to run your own race. The worst mistake you can make in a middle to long-distance race is in the first minute; that is, going out too fast. If you're running on a track, pass on the straights. If you try to make a go of passing the runner in front of you on a curve, you're actually running a bit further to get around that person. Just a waste of energy, really. Push yourself in the third lap. Deepen your breathing, smooth out your stride, and push yourself a little more. Your mind will tell you to stop long before your body makes you. If you push yourself a little more than the first two laps here, then your pace will remain constant or improve. You need to feel like you are running faster in the third lap for you to maintain your pace. Also, it is much easier to push yourself to your limits in the last lap, so if you push yourself a little here, it will only improve your time. Once you can see the finish line, you can almost always find the drive to finish strong. Focus on your form, breathing, and what's in front of you. Also, once you start your finishing kick, focus on still maintaining form and driving your knees a little higher. Do NOT focus on your crowd of adoring fans, your coach, or your feet. Keep your head straight and your eyes on the prize and don't get distracted. A second's look could make or break your time."
    },
    {
      "title": "Know the correct way to breathe.",
      "content": "Know the correct way to breathe. It's a bad habit for a lot of us to breathe at the top of our lungs. Don't do it! Make sure your breaths are deep and coming in through your nose and out slowly through your mouth. Insufficient breathing can wear out your muscles before they wear out themselves. Try to get into a rhythm while you're running. Take a breath every 3 or 4 steps. Staying in sync will give you something to concentrate on, too."
    },
    {
      "title": "Always warm up and cool down.",
      "content": "Always warm up and cool down. To get your muscles ready to turn into speed machines, you gotta warm up. If you don't, you risk asking them to do things they're not ready to do -- and they'll revolt by ripping and tearing. So do some jumping jacks, some burpees, high knees, butt kicks, and get your body loose and ready. Cool down after your workouts, too, with a good stretching session. That'll help bring your heart rate down and get your head back down from the rush you've just had, in addition to keeping your muscles safe and not freezing back up."
    },
    {
      "title": "Learn good running form.",
      "content": "Learn good running form. Improper form is not only potentially dangerous, but it wastes energy needlessly. To hit that 6-minute mile, you need to be running as efficiently as possible. Here's the gist: For your upper body, make sure you are looking forward to the horizon and not to either side. Keep your shoulders loose -- if you notice they're stiff, give 'em a quick shake to rid yourself of the tension. Keep your back straight and your elbows at a 90-degree angle, hands in loose fists. For your lower body, make sure you're hitting the ground lightly (quieter = quicker) with your mid-foot, rolling onto your toes, and propelling forward. Lift your knees slightly, keep your strides short, and your feet land directly beneath you. Aim to feel as if you're springing off the ground."
    },
    {
      "title": "Work out your arms, legs, and core",
      "content": "Work out your arms, legs, and core . Since so much of a good mile time is about strength, working out your body is useful, too. Include squats, lunges , planks, sit ups , and push-ups into your regimen to keep your muscles primed for optimal performance. Incorporate work with free weights into your routine as well. Do bicep curls, tricep kickbacks, or hammer grabs working your biceps, triceps, forearms, and shoulders. You can work out your arms even when you're just in front of the television , too!"
    },
    {
      "title": "Stay hydrated.",
      "content": "Stay hydrated. Your body will not operate at peak performance if it's dehydrated, point-blank. Make sure to drink plenty of water each day since you're training so hard, and definitely drink a glass or two before your run. After, too! You'll need to replenish the water your body loses. Water is by far the best thing you can drink. However, coffee (black) ingested before a run can give your body a jolt of energy. Just don't rely on it and definitely don't go overboard or depend on it the day of a race. You never know how caffeine will react with your body and digestive system."
    },
    {
      "title": "Eat well before (and after).",
      "content": "Eat well before (and after). If you were planning to run a marathon, that'd be one thing. But running a mile is very different -- you do not need to carb load or any of that business. You simply need to not eat about an hour before your run (but make sure you've eaten the latest meal), and concentrate on complex carbs, protein, and fruits and veggies. And don't run when you're starving! A piece of fruit (like a banana, an apple, or peach) can give you a natural, safe sugar rush. An English muffin or some oatmeal is good, too. [1] X Research source Try energy gels, like Gu, if you're interested. It's a blast of sugar and energy to your system that may be able to make you reach that finish line a few seconds quicker."
    },
    {
      "title": "Watch your weight.",
      "content": "Watch your weight. Your body has to carry itself across the finish line. If you're overweight or have extra pounds for the size of your body type, it is going to slow you down. 5 or 10 extra pounds could make a big difference in your health and increases the amount of work your body has to do. If you have it to lose and can lose the weight, then you should work at it to decrease your run time. That being said, you need muscle even more. So don't start cutting the calories, dropping weight, and expecting to practically fly when all you're doing is losing muscle. If you're an acceptable weight for your height, you're fine."
    },
    {
      "title": "Get good running shoes.",
      "content": "Get good running shoes. Why? Because the alternative is running and eventually hurting yourself. No brainer, huh? And your time will most likely improve, too! So spring for a good pair from a shop that caters to runners. Too many people grab the first pair they like the looks of. No, no, no -- you need to know exactly what to look for optimal performance. Talk to the clerk about the perfect shoe for your foot. Here are a few pointers: The heel and upper portion should feel snug, but not tight. You should be able to slide your foot out when the shoe is laced but not tied. Feet swell naturally throughout the day and during runs, so make sure there's enough toe room -- about a thumb's width of space. [2] X Research source And if you want to be doubly careful, buy your shoes in the evening, when your feet are the largest they're going to get. Try out the shoe. Put the pair on and take a jog around the store or on their treadmill -- just standing in them won't tell you much. You need to make sure the arch of your foot matches the arch of the shoe. You wouldn't buy a car without test driving it, right? Unless you have something really wrong with your stride that needs to be corrected, don't splurge on expensive orthotics. It is much better to get a good pair of shoes in the first place than spend hundreds of dollars on something unnecessary."
    },
    {
      "title": "Get some nice gear.",
      "content": "Get some nice gear. So many of our accomplishments really more on our state of mind than we realize. If you're close to this 6-minute goal, your mindset may be what's mainly in your way. So invest in yourself and this fun, healthy hobby. Get some workout clothes. There are pieces marketed specifically for \"runners,\" but at the end of the day, if you're comfortable moving in it, it's good. Get a nice towel, water bottle, \"fuel\" belt, stopwatch, etc. Material things may not be what the world's about, but having nice stuff to use will definitely encourage you to use them."
    },
    {
      "title": "Listen to music.",
      "content": "Listen to music. Create a playlist for this goal and fill it with songs around 190 BPM. [3] X Research source When your ears are racing, you may find that your feet can't help but keep time. And when your jam comes on, you'll feel that extra burst of get-up-and-go that you just can't resist. The Internet is full of ready-made playlists for you to choose from if you don't know where to start. You'll need an iPod or some sort of music player, of course!"
    },
    {
      "title": "Find a friend.",
      "content": "Find a friend. Because who doesn't like a healthy dose of competition to get their juices flowing? Just make sure that friend runs around the same speed you do, or better -- a little faster. If they're dragging you down or running laps around you, you might as well be running by yourself. Or you could take turns with your friend -- makes the timekeeping a lot easier. And knowing someone is standing at the finish line judging you is quite the kick-starter!"
    },
    {
      "title": "Set goals.",
      "content": "Set goals. For each week that you run, try to work on having small, attainable goals. The more and more of them you reach, the more motivated you'll be to keep going. Whether it's to run X amount of miles, complete so many intervals, or shave 10 seconds off every week, set it and keep your eyes on the prize. Those smaller checkpoints will keep you in line. And be sure to reward yourself! After every 10 seconds shaved off, treat yourself to something you'd enjoy. You may not think 10 seconds matters, but it sure does add up over time. And for that you deserve something!"
    }
  ]
}