{
  "url": "https://www.wikihow.com/Contact-Fitbit",
  "title": "How to Contact Fitbit",
  "steps": [
    {
      "title": "Call Fitbit’s customer support line for general questions.",
      "content": "Call Fitbit’s customer support line for general questions. For account setup or trouble shooting, call Fitbit’s general customer support line. They are open every day from 4am to 9pm Pacific Standard Time. You will be prompted to provide your account information as well as your specific question. [1] X Research source Call 877-623-4997 to reach customer support."
    },
    {
      "title": "Start a live chat online to talk with someone right away.",
      "content": "Start a live chat online to talk with someone right away. If you need your question answered right away, contact a Fitbit customer support representative online. You may have to wait until a customer service representative is available before you can chat with them. Log in with your account information before you start your chat. [2] X Research source Visit https://myhelp.fitbit.com/s/support?language=en_US and click on “Live Chat” to start your chat."
    },
    {
      "title": "Contact Fitbit on Twitter for a fast reply.",
      "content": "Contact Fitbit on Twitter for a fast reply. Fitbit has a Twitter account that provides customer support. Send them a direct message to have your questions answered privately, or tag them in a tweet for a public answer. [3] X Research source Visit Fitbit’s Twitter account at https://twitter.com/FitbitSupport"
    },
    {
      "title": "Submit a general inquiry to get an emailed response.",
      "content": "Submit a general inquiry to get an emailed response. Fitbit does not have a customer support email address. However, if you use their website to submit a question, they will email you with their answer. Provide your full name, email address, and your specific problem to get an answer from Fitbit. [4] X Research source Visit https://help.fitbit.com/?cu=1&form=general to submit your inquiry."
    },
    {
      "title": "Sign into your account to claim warranties.",
      "content": "Sign into your account to claim warranties. If you need to contact Fitbit because your band is broken, you can claim a warranty to have a new one sent to you. Sign into your account using your email address or Facebook account. Submit your claim to receive a new band shipped to you. [5] X Research source Visit https://help.fitbit.com/?l=en_US&cu=1&fs=ContactUs and click on “Broken Band?” to submit your warranty claim."
    },
    {
      "title": "Search the Fitbit forums to find answers to your questions.",
      "content": "Search the Fitbit forums to find answers to your questions. Fitbit has a community that may be able to answer your questions for you. Search your question to see if anyone else has had the same problem and can tell you how to solve it. You can search the forums by key terms or by products. [6] X Research source Visit https://community.fitbit.com/t5/Community/ct-p/EN to search the Fitbit forums."
    }
  ]
}