{
  "url": "https://www.wikihow.com/Deal-with-a-Narcissist",
  "title": "How to Deal with a Narcissistic Person",
  "steps": [
    {
      "title": "Educate yourself on narcissistic personality disorder.",
      "content": "Educate yourself on narcissistic personality disorder. Calling someone a “narcissist” doesn’t mean that they’re just self-centered or have a big ego—narcissistic personality disorder is a complex mental health condition with a variety of symptoms that range in severity. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Common symptoms of people with NPD include a need for frequent admiration, difficulty handling criticism, and challenges seeing situations from other people’s perspectives. However, it’s crucial to understand that many people have these traits but would not meet the requirements to be diagnosed with NPD. Only a professional psychologist who has spent a significant amount of time with an individual can identify if said person has narcissistic personality disorder . [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source It’s important to note that a diagnosis of narcissistic personality disorder (or conduct disorder for persons under 18) does not mean someone is a narcissist."
    },
    {
      "title": "Try to show compassion.",
      "content": "Try to show compassion . Being compassionate toward someone who's hurt you may be easier said than done. Try to remember that someone with narcissistic qualities may truly be struggling with a mental health condition. Despite how they may come off, a person with narcissistic personality disorder needs external approval and struggles to connect with a wide range of emotions. [3] X Research source Being empathetic toward this person’s struggles doesn’t mean you have to let them walk all over you. However, you can remember that this individual is struggling to connect with other people and act outside their own best interests. They may struggle to form both personal and professional relationships due to their difficulty relating to and empathizing with others. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source This is a terribly lonely way to live, and they may need more support than you know."
    },
    {
      "title": "Set healthy boundaries.",
      "content": "Set healthy boundaries. Some people with narcissistic qualities will unintentionally try to get what they need at the expense of others. This type of person may constantly come to you for emotional support or validation and provide you none in return. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Establish boundaries with this person by telling them that their behavior is unacceptable to you. Communicate clearly and try to stay calm. Let them know what you are willing and unwilling to help them with. Once you communicate these boundaries, make sure you hold to them. Giving into their demands may make their behavior worse."
    },
    {
      "title": "Build up your self-esteem.",
      "content": "Build up your self-esteem. It’s common to seek external validation from friends and family to improve your self-worth . However, loved ones who have been diagnosed with NPD by a mental health professional may struggle to provide you with this type of support. [6] X Research source Someone who shows narcissistic behavior may criticize you or belittle you in order to make themselves feel superior. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Although it may be difficult, try to remember that this behavior most likely comes from their inner feelings of shame and insecurity. If you’re able to improve your self-esteem , it’ll be easier to cope with these behaviors and brush off any condescending comments. Try using positive affirmations , practicing self-care , and developing a healthy support system of friends that make you feel good about yourself."
    },
    {
      "title": "Focus on your own needs.",
      "content": "Focus on your own needs. If someone in your life is struggling with narcissistic behaviors, consider seeing a mental health professional to work through your own emotions. If that person isn’t providing you with the mutual support and understanding you need, limit the time you spend with them. On the other hand, if the person whose behavior you’re concerned about is bettering your life in other ways, you may want to keep them around for the time being. However, make sure that this individual isn’t harming you or making you feel bad about yourself. If you feel bad about yourself after spending time with this person or find yourself drained by their need for validation, praise, and attention, it may be time to move on from the relationship . If you recognize signs of abuse in your relationship with any individual, such as feeling manipulated or treated as if you have no value, remove yourself from the situation immediately and seek support from trusted loved ones."
    },
    {
      "title": "Disengage from any mind games or fruitless arguments.",
      "content": "Disengage from any mind games or fruitless arguments. It’s common for people with narcissistic personalities to play mind games that force you to be on the defensive. The best way to deal with these mind games is to recognize what’s happening and remove yourself from the situation. Someone with narcissistic qualities may struggle to recognize their own wrongdoings or mistakes, meaning they need someone to blame for any failures. If you try to present your side (even if you’re right), someone with these traits may become very defensive or spin the truth so that they come out looking better than you. [8] X Research source Instead of trying to argue with them or explain your perspective, you have to set boundaries, provide them with irrefutable facts, or walk away. If your co-worker is arguing with you about the fact that they forgot to order more paper, say something non-accusatory like, “Hey Dan, here’s the inventory count which shows we do need more paper.”"
    },
    {
      "title": "Remove any expectation you have of pleasing this person.",
      "content": "Remove any expectation you have of pleasing this person. This step is especially difficult if you’re dealing with parents who show narcissistic behaviors . Understandably, you want to please your parents and any other person in your life that you care about. However, many people with narcissistic tendencies have large egos and think overly well of themselves, meaning they will view you as someone who is, in some ways, inferior. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source While you may be able to win their favor on a short-term basis, you shouldn’t expect or attempt to satisfy or impress them in the long term. As clinical psychologist Dr. Liana Georgoulis describes it, people with narcissistic qualities inherently view others as “less important, less competent, less capable, [or] less valuable.” [10] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. Try not to take their perspective or criticism to heart. Remember that if they’ve been diagnosed with clinical NPD, this person isn’t able to see the full picture of a situation and put aside their own feelings of low self-worth. [11] X Research source If they're constantly belittling you (whether they’re a spouse, a parent, or a boss), find someone you trust to talk about their behavior and, if you can, take some space from them."
    },
    {
      "title": "Genuinely praise them as much as possible.",
      "content": "Genuinely praise them as much as possible. In all likelihood, there is some quality about this person that you admire. When you see them doing something that you respect or find interesting, let them know directly. Your praise will seem genuine and sincere, which will help strengthen your relationship with this individual and remind you why you keep them in your life. For example, if your friend is a really good writer, say things like, “You're really articulate. I love the way you manage to get your ideas across so clearly.” Remember that people who demonstrate a sense of superiority or grandiosity often do so from a place of insecurity—deep down, they desire an excessive amount of praise and appreciation. [12] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source By giving them a genuine compliment as someone they love and trust, you will hopefully help them have a healthier view of themselves and act more kindly in the future. However, whether this person has clinical NPD or just some narcissistic qualities, change is unlikely to happen overnight, even if you give them the praise that they crave. They may still try to find ways to undercut you due to their deep insecurities."
    },
    {
      "title": "Present constructive criticism in positive or neutral terms.",
      "content": "Present constructive criticism in positive or neutral terms. In most cases, people with narcissistic qualities struggle immensely with any perceived criticism and may feel humiliated or rageful. [13] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Try framing your feedback in a positive or roundabout way, like offering an alternative approach rather than a better one. [14] X Research source For instance, if you need to remind a client to pay you, gently remind them by asking them for a reminder of the agreed-upon pay period rather than directly stating that the payment is late. Or, if you are trying to steer a colleague in a different direction, say something like, “I’ve never seen anyone do it that way; I usually do it this way…” When constructive criticism is needed, try giving it to them in small amounts over some time. In other cases, you may want to learn to choose your battles and walk away from situations where your feedback isn’t strictly necessary."
    },
    {
      "title": "Recognize when you need to move on.",
      "content": "Recognize when you need to move on. In some cases, people with narcissistic qualities can become verbally or emotionally abusive. Look out for signs of gaslighting or other signs of abuse like name-calling, accusatory language, public humiliation, or monitoring your movements or actions. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If someone in your life is treating you this way, it’s probably time to leave the relationship. If someone is making you feel frightened or threatening you, stop seeing them immediately and call the National Domestic Violence Hotline at 800-799-7233."
    },
    {
      "title": "Determine if an intervention is appropriate.",
      "content": "Determine if an intervention is appropriate. If someone you love and want in your life, like a significant other or parent, is displaying narcissistic behaviors, consider confronting them directly. However, remember that one of the main qualities of people with narcissistic tendencies is a lack of empathy. [16] X Research source If this person truly has narcissistic personality disorder, it will be difficult or impossible to convince them of how their behavior is affecting others. NPD is a personality disorder based on factors like genetics and upbringing, and it’s not something that can be changed with just an intervention. Rather, this individual will need support and professional help from a therapist or clinical psychologist in order to improve their behavior."
    },
    {
      "title": "Get the help of a professional.",
      "content": "Get the help of a professional. Before carrying out an intervention, ask the advice of a mental health professional. Not only can this person tell you whether or not an intervention is a good idea, but they can also help you with the next steps, whether or not that includes an intervention. Remember, only a licensed healthcare provider can assess whether or not someone has narcissistic personality disorder. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Try to get the advice of someone like a behavioral therapist, psychologist, or licensed clinical social worker who is knowledgeable about NPD. A professional can discuss ways to treat NPD, such as cognitive or group therapy. Do a Google search for doctors in your area and ask some people whose opinions you trust about whom they might recommend."
    },
    {
      "title": "Plan the intervention.",
      "content": "Plan the intervention. If a mental health professional advises you that an intervention is a good idea, begin to plan out everything you will say and do during the intervention. Develop 2-3 talking points that you will stick to throughout the conversation. Talking points could include specific examples of how this person’s behavior is hurting your family or an explanation of why you decided to have the intervention."
    },
    {
      "title": "Recruit about 4 to 5 people to support you.",
      "content": "Recruit about 4 to 5 people to support you. These people should all be close to the person whose behavior you’d like to address. They all should have in some way been hurt by this person’s actions but are still willing to get them help for their narcissistic behaviors . Make sure that each of your recruits is educated about the differences between someone showing narcissistic traits and being diagnosed with narcissistic personality disorder. Advise them to avoid speaking to others about the situation or spreading any gossip, whether intentional or not."
    },
    {
      "title": "Stage the intervention.",
      "content": "Stage the intervention. Bring up each of your talking points and provide specific examples to back yourself up. Avoid straying from these talking points onto tangential issues or incidents. Be sure to emphasize how the person is hurting themselves and how making a change will be mostly for their benefit. Use “I” statements to reduce the chance of the person becoming defensive. For example, say, “I feel ignored when you constantly turn the conversation to yourself.” It’s important to use compassion during the intervention since the reason you’re doing it is to give this person a chance to get better and improve their relationships. If they refuse the intervention, you can ask them to talk to a therapist rather than talking to you. If they refuse to get any help and their behavior continues to be harmful to you or others, it may be time to walk away or establish clear boundaries with this person."
    },
    {
      "title": "Be prepared for the possibility that the intervention won’t work.",
      "content": "Be prepared for the possibility that the intervention won’t work. Remember that if you do stage an intervention, it doesn't mean that the individual will actually do what they need to do to get better. Even if this person does see a psychologist and is diagnosed with NPD, there’s no immediate cure. It may take years of therapy for them to fully recognize and improve their behavior. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}