{
  "url": "https://www.wikihow.com/Overcome-a-Lack-of-Academic-Confidence",
  "title": "How to Overcome a Lack of Academic Confidence",
  "steps": [
    {
      "title": "Take responsibility for your work.",
      "content": "Take responsibility for your work. Lack of academic confidence often stems from bad grades or critique you received on your work. By assessing your work and taking responsibility for your role in bad grades or negative feedback, you can start making changes that will help cultivate academic confidence. [1] X Research source For example, if you received a bad grade for an assignment because you didn’t read the instructions or did it too quickly, these are factors that you can easily control. Accept that the mistakes were your responsibility and make sure to learn from the experience. [2] X Research source Taking responsibility for your work also means knowing when it is strong, regardless of feedback. For example, if you get negative comments on an essay that you believe makes a strong argument, evaluate the comments objectively. You may find that you disagree with some of them, and that's okay. Because so much academic work is interpretive and subjective, interpretations may differ. You are not automatically wrong simply because someone says you are."
    },
    {
      "title": "Identify other sources of academic insecurity.",
      "content": "Identify other sources of academic insecurity. Acknowledging other factors that cause your lack academic confidence will allow you to see what you can control academically. This can help you formulate plans that will ultimately contribute to a boost in your confidence. [3] X Research source On a piece of paper, list anything that causes you anxiety academically. Read the list and check off those items you can actively change. For example, if writing assignments, such as essays or even articles, are a source of frequent criticism, this may cause you anxiety. Writing is a learning process and something that you can always improve at. The more you practice, the more you will gain academic confidence. [4] X Research source"
    },
    {
      "title": "Let go of unrealistic academic expectations.",
      "content": "Let go of unrealistic academic expectations. Lack of confidence can start with unrealistic expectations of yourself or in your abilities. Letting go of any unrealistic or unattainable expectations you have will not only keep you from setting yourself up for failure, but also allow you to build confidence in your academic skills. For example, if you are a graduate student, it is not likely that you will publish a study that completely re-envisions your field. If you can accept this fact, then you can focus on developing yourself as a young scholar and making contributions to your field. [5] X Research source Accept that no student or scholar is perfect. No one can be great at every aspect of academics, so focus on your strengths and develop your weaknesses as you can. [6] X Research source"
    },
    {
      "title": "Let go of negative feedback, grades, and people.",
      "content": "Let go of negative feedback, grades, and people. Holding on to negativity from feedback, other people, or grades will only undermine your confidence. Being able to let go of negativity will allow you to focus on your academic strengths and develop your weaknesses. [7] X Research source Whenever you get negative feedback that undermines your confidence, learn from it by talking to your teacher or professor. Then implement suggestions and move forward. [8] X Research source Don’t dwell on bad grades, negative feedback or negative people. This will only further shake your academic confidence."
    },
    {
      "title": "Don’t compare yourself to others students or colleagues.",
      "content": "Don’t compare yourself to others students or colleagues. Every person has different academic strengths and weaknesses and there will almost always be someone performs better academically than you do. Avoid comparing yourself to other students, teachers, or professors and focus on your performance so that you don’t undermine your confidence. By focusing on your own academic performance and developing your abilities, you won’t be tempted to compare yourself with another classmate or student. If you have a hard time not comparing yourself, try to think of something you do better academically than the other person. For example, you may write better essays or be better at taking tests."
    },
    {
      "title": "Limit or remove negative and competitive people from your academic life.",
      "content": "Limit or remove negative and competitive people from your academic life. The people with whom we surround ourselves have a significant impact on our attitudes and self-esteem, especially when it comes to academic performance. Limiting or removing anyone who undermines your academic confidence through nasty comments or competition will help you focus on your strengths and build your self-esteem. If classmates or colleagues make comments about academic failures, disregard the comments and focus on yourself and what you can do to improve. Many people are competitive when it comes to academic elements such as grades, awards, or publications. Not getting caught up in the competition will help you maintain your confidence and continue to build it based on your own accomplishments. If you can’t remove a person from your life entirely, or you don’t want to hurt him, limit your exposure to him. You can also counteract negative feedback or viewpoints by pointing out the positive in the person’s commentary."
    },
    {
      "title": "Recognize signs of \"impostor syndrome.\"",
      "content": "Recognize signs of \"impostor syndrome.\" Impostor syndrome is very common among academics. It causes feelings of intense self-doubt, as though you do not deserve success or feeling like you are a phony. Even students who are very intelligent and hard-working may experience impostor syndrome; these feelings are usually unrelated to your actual achievement levels. Consider whether you have experienced any of the following: Feeling like you're a fraud. You may feel like you don't deserve the success or respect that you have earned. You might have thoughts such as, \"People don't understand how little I know about my subject\" or \"I just look competent, but I'm really not.\" Feeling like you're just lucky. You might think that getting that publication or grant was just \"luck,\" failing to acknowledge that many people submit essays or grant proposals and do not get accepted. Discounting your successes. You may feel pressure to downplay your successes, such as saying \"Oh, everyone does that\" or \"It's really not a big deal.\" This type of thinking is usually due to a cognitive distortion, or unhelpful thinking habit, that focuses on your weaknesses without acknowledging your strengths. For example, if you are a graduate student, it might be natural to feel like you really don't know anything about your field when you compare your body of knowledge to someone who's been doing research for a decade or two. However, this discounts what you do know: after all, you would not have gotten into a graduate program without having promise, and you have probably learned a great deal that you're not acknowledging to yourself."
    },
    {
      "title": "Talk to a teacher or professor about your work.",
      "content": "Talk to a teacher or professor about your work. [9] X Expert Source César de León, M.Ed. Educational Leadership Consultant Expert Interview. 11 November 2020. Teachers and professors often have insights on your work or academic performance that you can’t objectively assess. By talking to your teacher or professor about your work, you may be able to take much more proactive steps to building your confidence. Prepare yourself before your meeting. Having a list of points you want to discuss will help focus the conversation. You can discuss items such as strengths and weaknesses, how you can improve your work, or how to deal with larger issues such as career planning."
    },
    {
      "title": "Get help from a tutor or counselor.",
      "content": "Get help from a tutor or counselor. If you need help with work or have questions about your future, hire a tutor or talk to a counselor. Both can have a significant impact on your work and focusing on your goals. [10] X Expert Source César de León, M.Ed. Educational Leadership Consultant Expert Interview. 11 November 2020. A tutor can help you develop your academic skills further and build confidence with positive feedback. A guidance or career counselor can help you formulate a plan to develop your skills or meet long term goals such as getting into college or becoming a professional editor."
    },
    {
      "title": "See the positive in your academic performance.",
      "content": "See the positive in your academic performance. Negative thoughts and attitudes are draining and if you give in to them, they will undermine any confidence you have. Seeking out the positive in any academic situation will help shift your mindset and build confidence in your work and skills. [11] X Research source Any academic failure or criticism has some redeeming aspect. It might take some time to recognize, but being able to see the positive aspects in a bad grade or criticism will help you move on and focus on your strengths. Remember that negative feedback or bad grades do not define you as a person. They do not even define the overall quality of your work; they represent only a small part it. [12] X Research source Most people who assess your work will try to find positive and negative aspects. Use these comments to balance out each other. Maintaining a positive attitude will contribute significantly to building your confidence. [13] X Research source"
    },
    {
      "title": "Make a list of your academic strengths and focus on them.",
      "content": "Make a list of your academic strengths and focus on them. Listing all of your academic strengths and focusing on them will help you counteract any negative thoughts that may arise about your work or skills. In turn, this will help build your confidence. [14] X Research source In situations where you receive negative feedback or a bad grade, read the list of your strengths. This will remind you to stay positive. For example, you may be an excellent researcher and a less strong writer. If this is the case, impress your critics with your research and work on improving your writing."
    },
    {
      "title": "Make a list of your academic achievements.",
      "content": "Make a list of your academic achievements. Listing any positive achievements you have will also help you to counteract negative feedback. Your list can be very simple and should help you remain confident or build your confidence. No achievement is too small or insignificant. For example, you can list “my teacher praised me for paying close attention in class” or"
    },
    {
      "title": "Make a list of your goals and take steps to achieve them.",
      "content": "Make a list of your goals and take steps to achieve them. Having a visual aid of your goals can help keep you focused on the positive aspects of your academic experience. Taking steps to achieve your goals will help build your confidence by supporting your goals. [15] X Research source Have a list of short-, mid-, and long- term goals. For example, your short-term goal could be passing your geometry class, while a mid-term goal could be taking more difficult math classes, and your long-term goal could be getting a degree in mathematics. Remember to keep your goals realistic to your abilities. For example, if your goal is to be a better writer, take a beginning writing course. This class will help you develop your skills and likely provide you with support and much needed positive feedback. [16] X Research source"
    },
    {
      "title": "Think and be positive about yourself.",
      "content": "Think and be positive about yourself. The thoughts and language you choose significantly influence your attitude and emotional outlook. Thinking positively about yourself and your academic abilities will help you stay positive, counteract negativity, and build your confidence. [17] X Research source Use positive language in addition to having positive thoughts. Phrases like \"I am hopeful” or \"I will find a resolution\" will help you stay positive. [18] X Research source Giving yourself a positive affirmation every morning when you wake up will set off your day on a positive path. For example, you can say to yourself “today is going to be a great day. I feel good and I’m ready to write that great essay.” Taking care of yourself is an important part of being positive. Make sure you get enough exercise, eat healthily, and get enough rest. These will also positively impact your academic performance. [19] X Research source"
    },
    {
      "title": "Surround yourself with others who have academic confidence in you and themselves.",
      "content": "Surround yourself with others who have academic confidence in you and themselves. Having supportive people around you who can put academic setbacks in perspective is important to maintaining and building your confidence Surrounding yourself with positive people will counteract any negative feedback and keep you focused on your academic strengths. [20] X Research source Have a teacher, professor, or counselor who can act a mentor for you. They will not only help you get past failures and focus on your accomplishments, but also build your confidence. Talk with peers. You might be surprised to find out that the star mathlete at your school is actually just as worried about her grades as you are, or that other graduate students in your department also feel like impostors. Knowing that doubts and mistakes are a normal part of everyone's student experience will help you accept your own."
    },
    {
      "title": "Consider seeing a therapist or counselor.",
      "content": "Consider seeing a therapist or counselor. If your lack of confidence is negatively impacting your ability to do well in school, handle relationships, or live your everyday life, you might benefit from seeing a therapist or counselor. A therapist can also help you identify unhelpful thinking patterns that may be contributing to your lack of confidence, such as minimizing your accomplishments while magnifying your mistakes. Having a safe space where you can voice your fears and doubts to a trained, objective individual can also be very helpful in moving past those feelings."
    },
    {
      "title": "Keep trying and move forward.",
      "content": "Keep trying and move forward. You’ll occasionally have setbacks, which is normal and acceptable, but learn not to dwell on them. By always moving towards the positive, you will be able to maintain and build your academic confidence. Remember that success breeds success. One study showed that a positive attitude contributes to success more than anything else, including knowledge or skills. Having confidence in yourself will bring you success, which in turn will bring more success and further build your academic confidence. [21] X Research source"
    }
  ]
}