{
  "url": "https://www.wikihow.com/Convert-Metric-Weight-to-Pounds",
  "title": "How to Convert Metric Weight to Pounds",
  "steps": [
    {
      "title": "Convert every kilogram to 2.",
      "content": "Convert every kilogram to 2. 2 pounds. A kilogram is a unit of weight equal to 2.2 pounds: 1kg = 2.2 lbs. [1] X Research source This means that 2 kg = 4.4 lbs, 3 kg = 6.6 lbs, and so on. 1 k g ∗ 2.2 l b k g = 2.2 l b s {\\displaystyle 1kg*2.2{\\frac {lb}{kg}}=2.2lbs} Kilograms are abbreviated kg and pounds are abbreviated lbs."
    },
    {
      "title": "Multiply your weight in kilograms by 2.2 to get your weight in pounds.",
      "content": "Multiply your weight in kilograms by 2.2 to get your weight in pounds. [2] X Research source Since each kilogram is 2.2 pounds, all you have to do is multiply the number of kilograms by this number to get your weight in pounds: 100 k g = 2.2 l b k g ∗ 100 k g = 220 l b s {\\displaystyle 100kg=2.2{\\frac {lb}{kg}}*100kg=220lbs} 38 k g = 2.2 l b k g ∗ 38 k g = 83.6 l b s {\\displaystyle 38kg=2.2{\\frac {lb}{kg}}*38kg=83.6lbs} 69.42 k g = 2.2 l b k g ∗ 69.42 k g = 152.724 l b s {\\displaystyle 69.42kg=2.2{\\frac {lb}{kg}}*69.42kg=152.724lbs}"
    },
    {
      "title": "Use a more precise conversion.",
      "content": "Use a more precise conversion. One kilogram is actually slightly heavier than 2.2 pound. This difference is so small that it doesn't matter in everyday life. If precision is very important, such as in a chemical reaction, use a more precise conversion: 1 k i l o g r a m = 2.20462 p o u n d s {\\displaystyle 1kilogram=2.20462pounds} [3] X Research source"
    },
    {
      "title": "Estimate the conversion in your head.",
      "content": "Estimate the conversion in your head. Quickly, without a calculator — what is 78.4 kilograms converted into pounds? The following estimation methods will help you get a close answer if you just need to approximate something, though you should remember they aren't always accurate: [4] X Research source Rounding up and down: Round to the closest number you can easily multiply for a rough estimate. In this example, round 78.4 kg to 80 kg, and 2.2 lb/kg to 2 lb/kg: Estimated Answer: 80 kg * 2 lb/kg = 160 lbs. Double Decimals: Remember that 78.4 ∗ 2.2 = ( 78.4 ∗ 2 ) + ( 78.4 ∗ 0.2 ) {\\displaystyle 78.4*2.2=(78.4*2)+(78.4*0.2)} This is still pretty difficult, so round 78.4 to the nearest whole number to get (78 * 2) + (78 * 0.2). Multiply 78 by 2 to get 156. For the second part, you can use the same result (156), then just slide the decimal one place to the left: 156 becomes 15.6. Add the two results together and voila! Estimated Answer: (78 * 2) + (78 * 0.2) = 156 + (156 * 0.1) = 156 + 15.6 = 171.6 lb Actual Answer (for comparison) : 78.4 kg * 2.2 lb/kg = 172.48 lbs."
    },
    {
      "title": "Convert between metric weights with powers of ten.",
      "content": "Convert between metric weights with powers of ten. The basic metric unit of weight is the gram. All other metric units of weight are equal to the gram multiplied by a power of ten, as described by the prefix. For example, \"kilo-\" means 1000, and a kilogram weighs exactly 1000 grams. \"Milli\" means \"1/1000,\" so each milligram is one one-thousandth the weight of a gram (thus, 1000 milligrams = 1 gram). [5] X Research source 1 k i l o g r a m = 1 , 000 g r a m s {\\displaystyle 1kilogram=1,000grams} 1 m i l l i g r a m = 1 1000 g r a m {\\displaystyle 1milligram={\\frac {1}{1000}}gram} = 0.001 grams This article uses American notation, writing decimal marks with a period (.)."
    },
    {
      "title": "Convert your measurement into kilograms by moving the decimal the appropriate direction.",
      "content": "Convert your measurement into kilograms by moving the decimal the appropriate direction. Converting between metric units doesn't even require arithmetic. Instead, move the decimal point one place to the left to divide by 10, or one space to the right to multiply by 10. [6] X Research source Here's an example: To convert 450 grams into kilograms , first work out the conversion for a single gram: 1000 grams = 1 kg, so therefore 1 gram = 1 1000 {\\displaystyle {\\frac {1}{1000}}} kg → 1 gram = 0.001 kg. The conversion from 1 gram to 0.001 kg involves moving the decimal place to the left three times (1 → 0.1 → 0.01 → 0.001). Do the same to convert your measurement from grams to kilograms. Start with 450 grams, move the decimal to the left three times, and you get 0.45. Therefore 450 grams = 0.45 kg ."
    },
    {
      "title": "Multiply your converted kilograms by 2.2 to change them into pounds.",
      "content": "Multiply your converted kilograms by 2.2 to change them into pounds. Once you've got your measurement in kilograms, the process is the same as described in the section above. Simply multiply the kilograms by 2.2 to convert them into pounds. In the last example above, multiply 0.45 kg * 2.2 lb/kg = 0.99 lb. Here's another example to show you the whole process from start to finish: Convert 3045 grams into pounds. First, convert grams into kilograms: 1 gram = 0.001 kg 3045 g = 3.045 kg Next, convert kilograms to pounds: 1 kg = 2.2 lb 3.045 kg * 2.2 lb/kg = 6.699 lb"
    }
  ]
}