{
  "url": "https://www.wikihow.com/Organize-Desk-Cables",
  "title": "How to Organize Desk Cables",
  "steps": [
    {
      "title": "If you aren’t using the cables, coil and store them in empty cardboard rolls.",
      "content": "If you aren’t using the cables, coil and store them in empty cardboard rolls. When you use the last bit of toilet paper, save the cardboard tube. Wrap your cable loosely and push the coil into the center of the tube. Write the name of the cord on the tube and keep it tucked away in a drawer until you need to use it again. Keep each cord in a separate tube so they don’t get tangled with other cables. Keep longer cables in a paper towel roll instead so they’re less likely to get tangled."
    },
    {
      "title": "Hang clips on the edge of the desk for easy access to your cables.",
      "content": "Hang clips on the edge of the desk for easy access to your cables. Squeeze the clips to open them and slide them onto the side of your desk. Slide the end of a cable through the wide section of the metal brackets on the binder clip. Then guide the cable into the closed end of the metal bracket so the cable doesn’t fall back through. When you need your cable, just grab it and plug it in! [1] X Research source Leave enough slack on your cables so they can reach where you need to plug them in. Binder clips may not fit on your desk if the top is really thick."
    },
    {
      "title": "Secure your cables to your desk legs with matching zip ties.",
      "content": "Secure your cables to your desk legs with matching zip ties. Take a bundle of 3–6 wires and straighten them out to get rid of any slack. Place your first zip tie a couple of inches from the end of the bundle so you can still move and manipulate the wires. Move the bundle of wires against one of your desk’s legs and wrap a zip tie around them. Pull the zip tie tight enough so the wires don’t slip around, but leave enough space so you can easily cut the zip tie off later on. [2] X Research source Choose zip ties that are the same color as your desk so they blend in well. Be careful not to overtighten the zip ties since you could damage your cords."
    },
    {
      "title": "Cable clips stick to your desk and hold the cables in place.",
      "content": "Cable clips stick to your desk and hold the cables in place. Simply peel the adhesive backing off of the clips and press them onto the back or underside of your desk. Gently push the cable into the slot on the front of the clip to hold it in place. Place the clips along the back legs of your desk and push the cable into them so it doesn’t have a lot of slack. That way, you won’t be able to see the cables from the front. [3] X Research source Buy cable clips online or at your local office supply store. You can instead buy nail-in clips if you have a wooden desk. Put the cable inside of the clip and then use a hammer to nail the clip into your desk. [4] X Research source"
    },
    {
      "title": "Bundle a large group of cables with these hook and loop fasteners.",
      "content": "Bundle a large group of cables with these hook and loop fasteners. Gather all of the cables that you want in the same bundle and keep them untangled. Wrap one of the cable wraps around the ends of the cords and press down on the end to secure the fastener. Place additional cable wraps every few inches along the cords’ lengths so they don’t get tangled together. [5] X Research source Buy cable wraps at electronics stores or online. Cable wraps are reusable, so they’re perfect if you reorganize your desk frequently."
    },
    {
      "title": "Use a cable sleeve to keep a long bundle of cords secure.",
      "content": "Use a cable sleeve to keep a long bundle of cords secure. Gather all of the cables and wrap one end of the sleeve around them to secure them. Straighten the cables out as you work down their lengths, wrapping the sleeve around them as you go. Coil and fold any extra cord into the sleeve before securing the end so there isn’t as much exposed from the end. [6] X Research source Your cable sleeve also protects your wires inside a bundle so they don’t get damaged as easily. Some cable sleeves have holes along the sides so you can pull a power adaptor through them. That way, you can still run the power cord inside the sleeve with the rest of your cables."
    },
    {
      "title": "These boxes keep all of your cords organized right where they plug in.",
      "content": "These boxes keep all of your cords organized right where they plug in. Set the cover near your outlet and place the power strip inside. Plug in each cable and coil the excess length so you can tuck them inside the cover. Feed all of the cables out from the side of the cover and place the lid on top to keep your desk space sleek and organized. [7] X Research source Power strip covers come in many different colors so you can get one that complements or matches your desk."
    },
    {
      "title": "Cord covers keep your cords straight and hidden in plain sight.",
      "content": "Cord covers keep your cords straight and hidden in plain sight. You can install cord covers that go on your wall, along the baseboards, or underneath your desk. Use a hacksaw to cut the cover to the length you need. [8] X Research source Apply double-sided adhesive strips along the back piece and press it against your wall. Pull your cords along the length of the cover and press the top piece on to secure them. [9] X Research source Cord covers are usually white, but you can paint them to blend in with your desk or wall to camouflage them better."
    },
    {
      "title": "Wire trays attach under your desk to keep cords off the ground.",
      "content": "Wire trays attach under your desk to keep cords off the ground. Find a wire tray that’s short enough to fit underneath the bottom of your desktop. Follow the instructions that came with your tray to nail or screw it onto your desk. Set a power strip in the tray and plug in all of your cables. Keep any excess cable coiled inside of the tray so they don’t sag down. [10] X Research source Make sure there’s still room underneath the desk for your legs before installing a tray."
    },
    {
      "title": "Keep a power strip and chargers in a drawer to declutter your desktop.",
      "content": "Keep a power strip and chargers in a drawer to declutter your desktop. Take the drawer out from your desk and use a hole saw to cut a hole through the back. Place a power strip inside the drawer against the side with adhesive strips. Plug your chargers into the power strip and place your drawer back in your desk. When you need to charge something, open the drawer and plug it in. [11] X Research source This works great for charging your phone without it being a distraction while you’re working."
    }
  ]
}