{
  "url": "https://www.wikihow.com/Clear-Watch-History-Tiktok",
  "title": "The Easiest Way to Delete Your Watch History on TikTok",
  "steps": [
    {
      "title": "Access your watch history.",
      "content": "Access your watch history. Your watch history shows all the videos you have watched on TikTok in the last 180 days. You need to use the TikTok app to delete your watch history. This option is not available in a web browser. Use the following steps to view your watch history : Open TikTok. Tap the Profile icon in the lower-right corner. Tap the icon with three lines ( ☰ ).in the upper-right corner. Tap Settings and privacy . Tap Activity center . Tap Watch history ."
    },
    {
      "title": "Delete a single video.",
      "content": "Delete a single video. To delete a single video from your Watch History, tap and hold the video you want to delete. Then tap Delete in the pop-up menu. Then tap Delete in the confirmation window."
    },
    {
      "title": "Delete multiple videos.",
      "content": "Delete multiple videos. To delete multiple videos, tap Select in the upper-right corner. Then tap the videos you want to delete. Tap Delete in the lower-right corner. Then tap Delete in the confirmation window."
    },
    {
      "title": "Delete your entire watch history.",
      "content": "Delete your entire watch history. To clear your entire watch history, tap Select in the upper-right corner. Then tap Select all watch history in the lower-left corner. Then tap Delete in the lower-right corner. Tap Delete in the confirmation pop-up. Warning: Deleting videos from your watch history is permanent. You cannot restore videos to you watch history after they have been deleted. Warning: TikTok no longer gives you the option to turn off your watch history. You'll need to clear your watch history frequently if you don't want TikTok saving your watch history."
    },
    {
      "title": "Access the Account menu.",
      "content": "Access the Account menu. If you want to save a list of your watch history before deleting it, you can do so by downloading your data. To download your data, you will need to access the Account menu. Use the following steps to do so: Open TikTok. Tap the Profile icon in the lower-right corner. Tap the icon with three lines ( ☰ ).in the upper-right corner. Tap Settings and privacy . Tap Account ."
    },
    {
      "title": "Tap Download your data.",
      "content": "Tap Download your data . It's near the bottom of the Account menu."
    },
    {
      "title": "Select the data you want to download (optional).",
      "content": "Select the data you want to download (optional). If you want to download a list of your watch data, you'll need to download your account activity at least. By default, it will send a request for all of your data. If you just want to download activity, use the following steps to do so: Tap the menu next to Select data to download. Tap Custom . Tap the checkbox next to Activity . Tap the checkbox next to anything else you want to download. Tap Done ."
    },
    {
      "title": "Select a format.",
      "content": "Select a format. You'll probably want to download your information as a txt file. This is the default option. However, if you are a developer and want to download your information as a JSON file to import your data into another service. Use the following steps to do so: Tap the menu next to Select file format . Tap TXT or JSON . Tap Done ."
    },
    {
      "title": "Tap Request Data.",
      "content": "Tap Request Data . It's the red button at the bottom of the screen. This sends a request to TikTok for your account data."
    },
    {
      "title": "Wait for TikTok to prepare your file.",
      "content": "Wait for TikTok to prepare your file. It may take anywhere from a few minutes to a few days for TikTok to prepare your file."
    },
    {
      "title": "Tap the Download data tab.",
      "content": "Tap the Download data tab. It's at the top of the Download TikTok Data menu. This is where you can download the file once it is ready."
    },
    {
      "title": "Tap Download next to your file.",
      "content": "Tap Download next to your file. This downloads the file to your device. [1] X Research source If you see a \"Cancel\" button instead of a \"Download\" button, your file is not yet ready."
    }
  ]
}