{
  "url": "https://www.wikihow.com/Buy-a-House-in-Riften",
  "title": "How to Buy a House in Riften",
  "steps": [
    {
      "title": "Befriend the Jarl at Mistveil Keep.",
      "content": "Befriend the Jarl at Mistveil Keep. Mistveil Keep is a stone castle near the southern end of Riften. [2] X Research source If the Imperials are in control, you can win the newly installed Jarl’s favor by talking to them. The Imperial Jarl’s name is Maven Black-Briar. If not, Laila Law-Giver is the Jarl."
    },
    {
      "title": "Help Wujeeta at the Riften Fishery.",
      "content": "Help Wujeeta at the Riften Fishery. Your first task is to impress the Jarl is to get Wujeeta a potion to get her off of Skooma. After giving her the healing potion, intimidate her to find out where she gets her Skooma. [3] X Research source"
    },
    {
      "title": "Confront the dealer at the Riften Warehouse.",
      "content": "Confront the dealer at the Riften Warehouse. The warehouse is on the west side of town, south of the fishery. Retrieve information on where the dealer gets the Skooma so you can report back to the Jarl."
    },
    {
      "title": "Return to the Jarl and agree to take down the Skooma operation.",
      "content": "Return to the Jarl and agree to take down the Skooma operation. When you report your findings to Jarl, she'll ask you to shut down the operation. Agree to the quest."
    },
    {
      "title": "Kill everyone in Craigslane Cavern.",
      "content": "Kill everyone in Craigslane Cavern. You'll have to kill at least 7 people, but there usually won't be that many people in the cavern at once. This means you'll have to return more than once to complete this part of the mission. [4] X Research source"
    },
    {
      "title": "Complete at least 5 quests for the people of Riften.",
      "content": "Complete at least 5 quests for the people of Riften. This is needed to increase your reputation. After you've finished the 5th quest, you'll receive a new request to speak with the Jarl. [5] X Research source"
    },
    {
      "title": "Complete all quests for Wylandriah.",
      "content": "Complete all quests for Wylandriah. She's the Jarl's mage, and will instruct you to complete retrieval quests in Winterhold, Ivarstead, and Windhelm. [6] X Research source"
    },
    {
      "title": "Visit the Riften Jail to complete the Lover's Requital quest.",
      "content": "Visit the Riften Jail to complete the Lover's Requital quest. The jail is below Mistveil Keep (where the Jarl is). [7] X Research source Speak with Sibbi Black-Briar to receive the quest, and then complete it."
    },
    {
      "title": "Complete the Dragon Bounty quest for the Jarl's steward.",
      "content": "Complete the Dragon Bounty quest for the Jarl's steward. You'll find the steward standing outside of the jail (right next to the Jarl) after you complete the Lover's Requital quest. Agree to complete the request and then follow the instructions."
    },
    {
      "title": "Complete the Under the Table quest for Romlyn Dreth.",
      "content": "Complete the Under the Table quest for Romlyn Dreth. You’ll find him at the Meadery west of town. Once you complete this quest, you'll receive an objective to talk to the Jarl."
    },
    {
      "title": "Return to the Jarl to purchase the house.",
      "content": "Return to the Jarl to purchase the house. The Jarl will tell you that she'll make you Thane if you purchase a house in Riften. She'll have you speak to her steward, who will now walk you through buying the house."
    }
  ]
}