{
  "url": "https://www.wikihow.com/Pick-Me-Boy-Meaning",
  "title": "What Is a Pick Me Boy? Everything You Need to Know",
  "steps": [
    {
      "title": "A Pick Me Boy puts himself down in order to emotionally manipulate a woman.",
      "content": "A Pick Me Boy puts himself down in order to emotionally manipulate a woman. At first, it might seem like the guy has low self-esteem, but it's actually a tactic to get recognition or emotional support from a woman he likes. [1] X Research source Usually, he'll say something self-deprecating in order to make the woman he's talking to reassure him and tell him how great he is. He might even go so far as to ask her out, hoping that she feels so guilty she'll accept."
    },
    {
      "title": "The Pick Me Boy tries to stand out by voicing feminist views he doesn't really hold.",
      "content": "The Pick Me Boy tries to stand out by voicing feminist views he doesn't really hold. He'll share viewpoints that seem really progressive or feminist because he thinks that will make him seem different than other guys. Pick Me Boys are also notorious for making stereotypical assumptions about gender roles."
    },
    {
      "title": "Pick Me Boy has its origins in African American Vernacular English.",
      "content": "Pick Me Boy has its origins in African American Vernacular English. The term first popped up in online magazines like Dominique and The Root back in 2017. Articles described the Pick Me Man as a variation of a simp—someone who does way too much for someone they like. [2] X Research source Although the term means something different now, it's important to recognize that it had its start in Black internet culture. You can treat a Pick Me Boy the same way you'd deal with a simp —be honest and clear about how you feel."
    },
    {
      "title": "The term showed up on Urban Dictionary and TikTok in 2021.",
      "content": "The term showed up on Urban Dictionary and TikTok in 2021. Pick Me Boy entries popped up on Urban Dictionary in February and the idea quickly made its way to TikTok, where the term became really popular. [3] X Research source A lot of TikToks point out the differences between the Pick Me Girl and the Pick Me Boy—neither of the terms is very positive, so they're cautionary videos. The Pick Me Girl claims to be different from all other women, so she stands out to men."
    },
    {
      "title": "\"You're out of my league.\"",
      "content": "\"You're out of my league.\" This is a Pick Me Boy's way of giving a compliment, but he expects something in return. Specifically, he wants you to argue and say that he's good enough for you. He may continue this idea until he can ask you out. [4] X Research source Here's another way he does this when messaging: Boy: \"Hi. 😃\" You: \"Hi.\" Boy: \"Oh, wow. Girls never text me back.\" He'll probably be pretty soft spoken or timid when saying these things—it's only after you reject him that his demeanor totally changes."
    },
    {
      "title": "\"I'm used to rejection.\"",
      "content": "\"I'm used to rejection.\" He says this to immediately get your pity. Plus, it's his way of setting you up for a challenge—he's hoping you'll want to prove him wrong and give you a chance. Think of this response as a bit of sly reverse psychology. He might also say: \"I'm so ugly.\" \"No one ever talks to me.\" \"I don't blame you. Who would want to go out with me?\" The guy will probably pause and look at you after saying something like this—he's waiting for you to jump in and correct him."
    },
    {
      "title": "\"I just want equal pay for women.\"",
      "content": "\"I just want equal pay for women.\" He might bring up a feminist idea out of the blue just to signal how progressive he is. Don't be surprised if he immediately makes a move after saying something like this—he thinks you'll be impressed that understands you and you won't dare turn him down. [5] X Research source He'll probably seem vocal or passionate about a topic before he totally switches gears and focuses on you."
    },
    {
      "title": "\"Nice guys always finish last.\"",
      "content": "\"Nice guys always finish last.\" This is his last shot at making it with you. If he's not getting emotional support or recognition from you, he'll fall back on this phrase. It's kind of like his Hail Mary—he's hoping you'll change your mind and agree to keep talking with him or accept your offer of a date. [6] X Research source He might switch this up a bit and say something like, \"I'll stop bothering you now.\" Pay attention to how he starts acting. He might act overly emotional and start crying, or he'll become bitter and angry."
    }
  ]
}