{
  "url": "https://www.wikihow.com/Contact-Minecraft-Support",
  "title": "How to Contact Minecraft Support",
  "steps": [
    {
      "title": "Go to https://help.minecraft.net/hc/en-us in a web browser.",
      "content": "Go to https://help.minecraft.net/hc/en-us in a web browser. You can use either a desktop or mobile browser to contact Minecraft Support. You'll be taken to a Mojang branded website, but they are the company responsible for Minecraft."
    },
    {
      "title": "Click or tap Contact.",
      "content": "Click or tap Contact . You'll find this at the bottom of the page next to News , About , Games , and Account ."
    },
    {
      "title": "Fill out the form.",
      "content": "Fill out the form. This is the form you'll submit to request help. You can request a refund, to delete your Minecraft account, or to report brand violations. All fields with a red asterisk (*) are required. Click or tap Please Select…\" to get a drop-down menu so you can pick your answer. Depending on the answer you choose in response to \"What best describes your question,\" you might have more questions to answer before you can finish. After you answer all the questions from the drop-downs, you'll need to type in answers like your name, email address, Xbox LIVE gamertag, and the description of the issue you're submitting. In some cases, you can attach files by dragging and dropping them in the attachment field or by clicking/tapping the text in the field."
    },
    {
      "title": "Click or tap to verify you are human.",
      "content": "Click or tap to verify you are human. This is another required field before you can continue."
    },
    {
      "title": "Click or tap Submit.",
      "content": "Click or tap Submit . You'll see this green button in the bottom right corner of the page. You'll be directed back to the main help page and see a notification in the upper right corner of your browser that your request has been submitted. [1] X Research source"
    }
  ]
}