{
  "url": "https://www.wikihow.com/Make-a-One-Balloon-Cat",
  "title": "How to Make a One Balloon Cat",
  "steps": [
    {
      "title": "Get your balloon.",
      "content": "Get your balloon."
    },
    {
      "title": "Fill the balloon with 75% air.",
      "content": "Fill the balloon with 75% air."
    },
    {
      "title": "Tie the balloon.",
      "content": "Tie the balloon."
    },
    {
      "title": "Make two inch-long bubbles.",
      "content": "Make two inch-long bubbles. This is for the muzzle."
    },
    {
      "title": "Take the knot and wrap it around the last section.",
      "content": "Take the knot and wrap it around the last section. The two bubbles should now be connected."
    },
    {
      "title": "Wrap the knot around the two bubbles.",
      "content": "Wrap the knot around the two bubbles. This is to make sure they don't come apart and to get the knot out of the way."
    },
    {
      "title": "Make two tiny bubbles.",
      "content": "Make two tiny bubbles. This is for the back of the head. Make sure they are the same size."
    },
    {
      "title": "Make five bubbles that are a little over an inch.",
      "content": "Make five bubbles that are a little over an inch. This is for the head. When making them, count to ten while twisting each bubble."
    },
    {
      "title": "Twist the last of the two tiny bubbles you made in step #7 with the last of the five larger bubbles you made in step #8.",
      "content": "Twist the last of the two tiny bubbles you made in step #7 with the last of the five larger bubbles you made in step #8. It should make a loop, kind of like a flower."
    },
    {
      "title": "Stick the muzzle through the hole.",
      "content": "Stick the muzzle through the hole."
    },
    {
      "title": "Pinch the two little bubbles that are beside the center bubble.",
      "content": "Pinch the two little bubbles that are beside the center bubble. To pinch them, pull it out and turn it."
    },
    {
      "title": "Make another small bubble for the neck.",
      "content": "Make another small bubble for the neck."
    },
    {
      "title": "Add two bubbles that are three inches long.",
      "content": "Add two bubbles that are three inches long. These will be the legs."
    },
    {
      "title": "Take the beginning section of the first 'bubble-leg' and twist it in with the last section of the second bubble-leg.",
      "content": "Take the beginning section of the first 'bubble-leg' and twist it in with the last section of the second bubble-leg. Bend the legs down, where they are vertical."
    },
    {
      "title": "Add another small section for the body.",
      "content": "Add another small section for the body. This section should just be a little over an inch."
    },
    {
      "title": "Now make two more three-inch bubbles for the hind legs.",
      "content": "Now make two more three-inch bubbles for the hind legs. Twist them together like you did for the front legs earlier."
    },
    {
      "title": "Kink the tail.",
      "content": "Kink the tail. Bend it in an 'S' shape and massage it for a few seconds. Turn the tail so it is facing up."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}