{
  "url": "https://www.wikihow.com/Is-It-Normal-to-Lose-Touch-with-Friends",
  "title": "Is It Normal to Lose Touch with Friends? How to Reconnect or Move on",
  "steps": [
    {
      "title": "Yes, it’s a pretty normal part of life.",
      "content": "Yes, it’s a pretty normal part of life. Just because everyone does something doesn’t mean you should do it too, but in the case of losing friends, you can rest assured that it’s a fairly universal experience. As you age, you might find that your life is busier or you have different priorities than you did when you were younger. This doesn’t mean that you should give up on your old friends entirely, but it does mean that your friends are probably going to be more understanding about losing touch than you think. [1] X Research source"
    },
    {
      "title": "You might have gone through a big change in your life.",
      "content": "You might have gone through a big change in your life. Things like going to college, getting a new partner, getting married, and having children are super exciting, but they can also distract you from your friends and create some distance. It’s not necessarily a bad thing—as we go through phases in our life, we’re bound to meet new people and get too busy to make time for our old friends. [2] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020."
    },
    {
      "title": "You may be focused on just a few relationships.",
      "content": "You may be focused on just a few relationships. As we age, we tend to narrow our social circles down quite a bit. Instead of having a large group of friends, we have a few close friends and maybe a romantic partner. [3] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. We might also grow closer to our parents or our siblings and spend more time with them. If you used to have a large group of acquaintances and you’ve narrowed it down to a few close people, that’s great! It doesn’t mean that you’re a bad person, it just means that you’ve changed a bit. [4] X Research source"
    },
    {
      "title": "You might not be around them as often.",
      "content": "You might not be around them as often. When you lose your natural venue of keeping in touch, it’s more likely that you won’t see your friends as often. If you made your friends at work or during school, and then you found a new job or graduated, you won’t see them every day anymore. This can make it tough to keep up with them, and you might lose interest in keeping up the relationship. [5] X Research source"
    },
    {
      "title": "They might just be busy.",
      "content": "They might just be busy. Think about how busy you’ve been recent. Now, imagine your friends are in the same boat (which, if you’re all around the same age, they probably are). If you’ve texted or called and you just can’t get ahold of your friend, chalk it up to the fact that they’re probably busy with work, school, or family stuff. [6] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. Most of the time, people aren’t ignoring you to be mean—they just simply can’t find the time to reach out right now, and that’s okay. [7] X Research source If you think that’s the case, don’t give up on your friend! Let them know that you’re here whenever they’re free, and let them reach out to you when they have some time. Reader Poll: We asked 378 wikiHow readers about how they start a phone conversation with someone they haven't talked to in a long time, and only 8% of them said by jumping right into catching up on their life . [Take Poll] Jumping right into catching up might be too jarring for your friend if you haven’t talked in a long time. Instead, acknowledge that it’s been a while and ask how they’re doing."
    },
    {
      "title": "They might be angry or annoyed at you.",
      "content": "They might be angry or annoyed at you. While it’s probably not the case, sometimes when a person is mad at you, they’ll just ignore you. If you and your friend got into a fight and now you can’t get ahold of them, send them one last message saying that you’d really like to talk. After that, the ball is in their court, and they can reach out to you when they’re ready to reconcile. [8] X Research source"
    },
    {
      "title": "Yes, if you’d like to!",
      "content": "Yes, if you’d like to! Keeping in touch with friends can bring a lot of happiness and joy, especially if you’ve known them for a long time. Taking the time to call, text, or hang out in person can really enrich your life and make you feel better. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source On the other hand, you shouldn’t feel pressured to hang out with old friends just because you’ve known them for a long time. If you don’t feel like they’re great friends or you just don’t want to see them anymore, you don’t have to."
    },
    {
      "title": "Reach out on social media or through text.",
      "content": "Reach out on social media or through text. As we get older, we might not have the time to dedicate a few hours (or a full day) to hanging out with a friend. A great way to stay connected is to follow your friends on social media and send them messages every now and then. This is a good way to stay updated on their lives without putting a ton of pressure on them (or yourself). [10] X Research source If you live far away, you could even schedule video chats to hang out with your friends virtually."
    },
    {
      "title": "Make specific plans with a date and a time.",
      "content": "Make specific plans with a date and a time. Instead of reaching out and saying “We should hang out sometime!” try something a little more concrete. If you propose a fun plan to hang out, your friend is much more likely to say yes (or give you an alternative if that doesn’t work). [11] X Research source For instance, you could reach out and say, “Hey! I was thinking of trying out that new bar downtown this weekend. Care to join me on Friday?” Or, “I just bought tickets to the Tame Impala concert in February! Wanna tag along?”"
    },
    {
      "title": "Let go of the friendship when you’ve grown too far apart.",
      "content": "Let go of the friendship when you’ve grown too far apart. As we age, we tend to change and evolve from who we were as kids. If you and your friends are much different people from your younger years, that’s okay, and it’s no one’s fault. [12] X Expert Source Lena Dicken, Psy.D Clinical Psychologist Expert Interview. 15 December 2020. Not having much in common is a totally valid reason to stop hanging out, and there won’t be any hard feelings on either end. [13] X Research source"
    },
    {
      "title": "Let go of the friendship when you make the effort, but they don’t.",
      "content": "Let go of the friendship when you make the effort, but they don’t. Maybe you’ve called, texted, and messaged them over and over, but they just don’t reciprocate. A friend ignoring you never feels good, and you shouldn’t keep trying just to get rejected again. If you feel like you’ve done all you can do to stay in touch, give yourself permission to stop reaching out and let the friendship fade away. [14] X Research source"
    }
  ]
}