{
  "url": "https://www.wikihow.com/Respond-to-Wtw",
  "title": "How to Respond to WTW: What It Means, How to Reply, & More",
  "steps": [
    {
      "title": "WTW can mean “what’s the word” over text.",
      "content": "WTW can mean “what’s the word” over text. WTW is sort of like “what’s up?” or “what’s going on?” It’s a way of asking people what they’re up to. However, unlike a traditional “what’s up,” there’s an implication here that whoever sent you WTW is interested in hanging out! [1] X Research source When people send WTW, they’re usually throwing it out there that they’re interested in meeting up depending on what you’re doing. For example, someone might say, “WTW tonight?” as a way of coolly asking, “What are you up to tonight? Do you want to hang out?”"
    },
    {
      "title": "WTW might mean “what the what.\"",
      "content": "WTW might mean “what the what.\" This is the most common alternative definition of WTW. It’s sort of like “what the heck!” This version of WTW is used to communicate surprise or alarm, so use it to spice up your reactions to unexpected news. [2] X Research source For example: Them: “Did you hear Jenny got fired?!” You: “WTW!!! She’s the best salesperson on the team!”"
    },
    {
      "title": "WTW also means “what’s the word” or \"what the what\" on social media.",
      "content": "WTW also means “what’s the word” or \"what the what\" on social media. The meaning of WTW doesn’t change from platform to platform. If you see WTW on Snapchat, TikTok, Instagram, Twitter, or Facebook, it means “what’s the word\" or \"what the what.\""
    },
    {
      "title": "“I’m just hanging out. Wanna meet up?”",
      "content": "“I’m just hanging out. Wanna meet up?” If someone sends you WTW and you’d be interested in hanging out, let them know that you’re not busy and down to hang. You can be as casual or excited as you’d like, so respond openly by telling them what you’re up to and ask them to chill. You might say: “I’m at my Dad’s place just watching the game. You want to come over?” “I’ve got nothing going on, but I’m hungry. You want to grab a bite with me?” “The word is the bird. You trying to chill?”"
    },
    {
      "title": "“I’m not really up to anything.”",
      "content": "“I’m not really up to anything.” If you want more information about why they’re hitting you up in the first place or you get the vibe that they’re just checking in on you, let them know what you’re up to and wait for more info. Once they reply you’ll know why they’re texting you. You might say: “I’m still at work but I’ll be off at 6.” “Just hanging out at home.” “I’m at Lonnie’s place. We’re just playing some foosball.”"
    },
    {
      "title": "“Ugh, I’m busy tonight. I’m sorry!”",
      "content": "“Ugh, I’m busy tonight. I’m sorry!” If you aren’t trying to hang out with the person who texted you or you really aren’t free to do anything, let them know you can’t hang out. You could tell them: “I’ve got plans with my family tonight, unfortunately.” “I’m free tomorrow, but I can’t do anything tonight.” “I’m going to have to take a rain check. I’m swamped with homework.”"
    },
    {
      "title": "“We’re all going out tonight. You in?”",
      "content": "“We’re all going out tonight. You in?” If you’ve got the inside scoop on something interesting that’s happening and you want to invite the person who messaged you WTW, this is the perfect time to fill them in with the details. You might respond: “Jimmy, Sarah, and I are all going to see the new Marvel flick at 7. Come with us!” “Rashad’s throwing a party tonight. Mikey and I are pregaming right now. Come over!” “If you want to chill tonight, I’ll be at Three Aces Tavern in about 15. Want to meet and have a drink?”"
    },
    {
      "title": "“Oh, sorry! I’m still waiting on the address for the party.”",
      "content": "“Oh, sorry! I’m still waiting on the address for the party.” People will occasionally use WTW as a way of probing someone for an update when there was supposed to be a plan. If you know someone is hitting you up for info, give them the details or let them know what’s going on. You might reply: “Hey, I’m still waiting for Kim. She’s dragging her feet getting ready.” “We’re on the way, the GPS says we’ll be there in 15ish.” “I totally forgot to message you, my bad. We’re all meeting up at 8.”"
    },
    {
      "title": "“I know, right!?”",
      "content": "“I know, right!?” People use WTW to articulate surprise and shock. If you agree and think they’re right to be amazed, let them know. Respond by seconding their shock. You might reply: “I thought it was wild, too!” “Ikr?” “Agreed. Totally nuts.”"
    },
    {
      "title": "Respond to whatever they said after “WTW.”",
      "content": "Respond to whatever they said after “WTW.” “What the what” is an expression of surprise, so you don’t actually have to respond to WTW specifically. It’s sort of like someone saying “wow” or “huh.” If there’s something else in their message to respond to, focus on responding to that."
    },
    {
      "title": "Send WTW to people to prompt them to hang out.",
      "content": "Send WTW to people to prompt them to hang out. If you want to meet up with a friend but you don’t want to be super forward or you’re worried about being too clingy, send them a slick “WTW” text. It’s friendly, casual, and way more laid back than “Do you want to hang out?” You might send something like: “Aye! WTW tonight?” “WTW Kev? You trying to do something tonight?” “Hey, WTW? I heard there’s a party tonight, you got the details?”"
    },
    {
      "title": "Use WTW instead of “what’s up?”",
      "content": "Use WTW instead of “what’s up?” You can also use WTW to reply to vague messages when people hit you up. When you use it this way, you open the door to the possibility of hanging out, but it’s sort of like you need more information. For example, you might use it this way: Them: “Hey you going to Alex’s tonight?” You: “Maybe. Why, WTW?” Them: “I didn’t want to go alone, was going to see if you wanted to go together.”"
    },
    {
      "title": "Send WTW to communicate surprise.",
      "content": "Send WTW to communicate surprise. If you want to use WTW as in “what’s the word,” just send WTW in response to alarming information. Basically, it’s the same thing as sending “WTF” or “holy cow!” For example: Them: “Did you hear about Mr. Johnson? He got fired for pushing a student.” You: “WTW! He was always so nice and friendly, I can’t believe it.”"
    },
    {
      "title": "Walk the walk",
      "content": "Walk the walk If you “walk the walk” that means that you’re the real deal. What you say is what you do. You don’t sugarcoat things, exaggerate, or lie—everything about you is authentic! [3] X Research source As an example: Them: “Is it true you stood up to Mr. Jefferson for giving you detention?” You: “I WTW. I told him he was being bogus, which is true.”"
    },
    {
      "title": "Worth the wait",
      "content": "Worth the wait If something is worth the wait, it means you were paid for your patience! Maybe you were waiting to see that new Star Wars film, or maybe you were really excited about a concert you went to last night. [4] X Research source For example: Them: “Dude, how was the show last night? Was it everything you ever imagined?” You: “It was totally WTW! I had such a good time. I wish you could have joined me.”"
    }
  ]
}