{
  "url": "https://www.wikihow.com/Get-Rid-of-Hemorrhoids-Naturally",
  "title": "A Doctor-Approved Guide to Naturally Healing Hemorrhoids",
  "steps": [
    {
      "title": "Take warm baths to soothe your hemorrhoid.",
      "content": "Take warm baths to soothe your hemorrhoid. If you don’t want to take a full bath, you can take a Sitz bath, where you sit in a few inches of water. Add about 1 cup of Epsom salts to a full bathtub and 2–3 tablespoons (29.6–44.4 ml) of Epsom salts for a few inches of water in the tub. Keep the water warm, but not too hot. Repeat 2-3 times a day. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Using Epsom salts may also speed up the healing process."
    },
    {
      "title": "Apply a warm compress for pain relief and comfort.",
      "content": "Apply a warm compress for pain relief and comfort. Get a clean, cotton wash cloth and soak it in warm (not hot) water. Apply the compress directly to the hemorrhoids for about 10-15 minutes. Repeat 4-5 times a day. This should offer some soothing comfort."
    },
    {
      "title": "Shrink the hemorrhoids with an astringent.",
      "content": "Shrink the hemorrhoids with an astringent. You can use a cotton pad soaked in witch hazel after a bowel movement. Witch hazel acts as an astringent and may help reduce swelling. Repeat as often as needed--at least 4-5 times a day."
    },
    {
      "title": "Clean yourself thoroughly after using the restroom.",
      "content": "Clean yourself thoroughly after using the restroom. After having a bowel movement, be sure that you clean yourself completely to avoid irritation. You might want to use baby wipes or a pre-moistened toilet paper product rather than dry toilet paper to clean yourself. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Apply an ice pack for 5-10 minutes to relieve swelling and pain.",
      "content": "Apply an ice pack for 5-10 minutes to relieve swelling and pain. An ice pack may help reduce your hemorrhoidal swelling but it should not be left on for too long; limit the ice pack use to 5-10 minutes at most each time. [3] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Sit on a cushion to relieve the pressure on your hemorrhoids.",
      "content": "Sit on a cushion to relieve the pressure on your hemorrhoids. Find a foam cushion or a doughnut cushion to sit on. This can help relieve some of the pressure associated with hemorrhoids. While this will not aid in \"curing\" your hemorrhoids, it may help ease your discomfort and make them easier to live with. Keep in mind that hemorrhoids are caused by too much pressure on your veins."
    },
    {
      "title": "Avoid excessive strain during bowel movements.",
      "content": "Avoid excessive strain during bowel movements. Allow gravity to help, but let your bowels do most of the work. If nothing happens, put it off for an hour or so, and try again but most importantly, don’t strain and force a bowel movement that isn’t happening naturally."
    },
    {
      "title": "Stay hydrated to help keep your stool soft.",
      "content": "Stay hydrated to help keep your stool soft. Increase your water consumption to at least 8-10 8 oz glasses each day. Stool (feces) contain significant amounts of water—and the more water a stool contains, the softer it will be, which makes it easier to pass."
    },
    {
      "title": "Consume more fiber in your diet to bulk up your stools.",
      "content": "Consume more fiber in your diet to bulk up your stools. Fiber helps keep water in the stool and bulks it up so that it passes through the rectum and anus more easily--and in the case of hemorrhoids, with less pain. Good sources of fiber include: Seeds -- One hand full of chia seeds will ensure you will get enough fiber. Whole grains-- include brown rice, barley, corn, rye, bulgur wheat, kasha (buckwheat) and oatmeal Fruits, especially with the rinds Vegetables (especially leafy vegetables like Swiss chard, collard greens, spinach, lettuces, beet greens) Beans and legumes-- be aware that for some, eating beans and legumes can increase intestinal gas"
    },
    {
      "title": "Avoid laxatives because they weaken your bowels.",
      "content": "Avoid laxatives because they weaken your bowels. Laxatives can be habit forming and can also weaken the bowels, potentially leading to chronic constipation. If you do feel as though you need a laxative, try an herbal laxative instead. [4] X Research source Senna and Psyllium are herbal laxative options. Senna is a natural and gentle stool softener. You can take senna as tablets (follow manufacturer’s instructions) or as a nightly tea. You can also try psyllium fiber as found in Metamucil. Psyllium [5] X Research source is a natural bulking agent."
    },
    {
      "title": "Exercise regularly to improve your circulation.",
      "content": "Exercise regularly to improve your circulation. The exercise can be aerobic, endurance, cardiovascular, or even just walking. Exercise makes your heart stronger, thus increasing the efficiency of your cardiovascular system. During exercise, you will also have high circulation thus removing your hemorrhoids (as these are basically blood sacks, caused by sedentary lifestyle and weak cardiovascular system)"
    },
    {
      "title": "Go to the bathroom as soon as you feel the urge to go.",
      "content": "Go to the bathroom as soon as you feel the urge to go. Don’t wait once you feel the urge to have a bowel movement; go as soon as you can, but don’t sit and try for too long waiting—sitting is also associated with an increased risk of hemorrhoids. [6] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source"
    },
    {
      "title": "Put yourself on a regular restroom schedule.",
      "content": "Put yourself on a regular restroom schedule. See if you can arrange a regular time to have a bowel movement without interruptions around the same time every day. This tends to make bowel bleeding movements easier, and it turns out that having regular bowel movements is a great predictor of overall good health. [7] X Research source"
    },
    {
      "title": "Try baby teething gel to relieve your pain.",
      "content": "Try baby teething gel to relieve your pain. It may sound a bit odd, but if the hemorrhoids are very painful and uncomfortable, use a tiny bit of baby teething gel on the area. The gel contains a local antiseptic that can decrease the pain and discomfort. [8] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Use topical pain and itch-relieving products to soothe hemorrhoids.",
      "content": "Use topical pain and itch-relieving products to soothe hemorrhoids. Gently clean your anal area with warm water and carefully pat dry. Then apply a small amount of aloe vera gel or an ointment such as Preparation H to help with hemorrhoid pain and/or discomfort. Apply as often as needed. [9] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Hemorrhoid relief ointments such as Preparation H usually contain petroleum jelly, mineral oil, shark liver oil and phenylephrine, which acts as a decongestant and helps shrink the hemorrhoid. Aloe vera gel contains components that have been shown to inhibit infection and help in healing minor wounds. Avoid steroid creams as they can damage the delicate tissue around a hemorrhoid."
    },
    {
      "title": "Take an over-the-counter pain reliever for extreme discomfort.",
      "content": "Take an over-the-counter pain reliever for extreme discomfort. If you have persistent discomfort, you may want to consider taking an over-the-counter pain reliever such as acetaminophen, aspirin, or ibuprofen. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source These can help you feel more comfortable and may aid in swelling reduction as well. As always, check with your care provider to ensure that it is safe to take a medication that you do not normally take."
    },
    {
      "title": "See your doctor for extreme pain, excessive bleeding, or persistent hemorrhoids.",
      "content": "See your doctor for extreme pain, excessive bleeding, or persistent hemorrhoids. Typically, hemorrhoids go away within of week of starting home treatment. If yours doesn’t start improving or immediately comes back, then it’s best to talk to your doctor about it. Additionally, you may need additional treatments if your hemorrhoids are causing extreme pain or excessive bleeding. Don’t ignore these symptoms. [11] X Research source Let your doctor know that you’ve been experiencing symptoms of a hemorrhoid, as well as how you’ve been caring for it."
    },
    {
      "title": "Seek immediate care if you feel faint, lightheaded, or dizzy.",
      "content": "Seek immediate care if you feel faint, lightheaded, or dizzy. While you likely have nothing to worry about, these symptoms may be a sign of a more serious condition. It’s best to get checked by a doctor to make sure you’re okay. If you do need treatment, your doctor will provide it for you. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Call your doctor for a same day appointment or visit an urgent care center. Let them know your symptoms first started with a hemorrhoid."
    },
    {
      "title": "Talk to your doctor if you’re over 40 and notice rectal bleeding.",
      "content": "Talk to your doctor if you’re over 40 and notice rectal bleeding. Although rectal bleeding is typical with hemorrhoids, it may also be a sign of anal cancer or colon cancer. Try not to worry because it’s likely it’s just your hemorrhoids. However, your doctor can examine you and provide a proper diagnosis so you get the right treatment. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you notice frequent rectal bleeding, monitor your bowel movements for changes in color, consistency, and frequency. Report what you observe to your doctor to help with your diagnosis, as anal or colon cancer might cause these kinds of changes."
    },
    {
      "title": "Expect your doctor to do a visual exam and possibly a finger exam.",
      "content": "Expect your doctor to do a visual exam and possibly a finger exam. After discussing your symptoms with you, your doctor will likely do a visual examination to check for hemorrhoids. If you have may have an internal hemorrhoid, they might do a quick finger exam, where they feel the area with a gloved finger. This will help them make a diagnosis. [14] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Your doctor may make a diagnosis based solely on your symptoms. The exam won’t hurt, but you might feel a little uncomfortable. Although hemorrhoids can feel embarrassing, they’re totally normal and most people have them at some point. Your doctor has likely seen a lot of hemorrhoids, so there’s no need to be embarrassed."
    },
    {
      "title": "Talk to your doctor about additional treatments for severe hemorrhoids.",
      "content": "Talk to your doctor about additional treatments for severe hemorrhoids. If your hemorrhoids won’t go away or are significantly impacting your life, your doctor may recommend getting a medical procedure to help you heal. Most of these procedures are minimally invasive. The most common ways to treat severe hemorrhoids include: [15] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Ligation, which involves tying a rubber band around the base of the hemorrhoid to cut off the blood flow. Injection of a chemical solution designed to shrink the hemorrhoid without causing you pain. Cauterization to heat the hemorrhoid until it hardens and stops causing symptoms. Hemorrhoid stapling, which blocks blood flow to an internal hemorrhoid so it shrinks. Hemorrhoidectomy, which is the surgical removal of a severe hemorrhoid that’s interfering with your daily function."
    }
  ]
}