{
  "url": "https://www.wikihow.com/Connect-With-Your-Father",
  "title": "How to Connect With Your Father",
  "steps": [
    {
      "title": "Check in with your feelings about your dad.",
      "content": "Check in with your feelings about your dad. If your connection with your father is damaged from the past, you might be wondering if it’s worth it to re-connect. Ask yourself: how did my father's actions impact my life? Allow yourself to see both the positive and negative effects he's had on your life. [1] X Trustworthy Source Greater Good in Action An initiative by UC Berkeley's Greater Good Science Center promoting science-based practices for a meaningful life Go to source Allowing yourself to acknowledge that past actions were not okay is part of the process of forgiveness. Deciding to connect doesn't mean excusing your dad's past behavior. But if you've decided to try to connect, you'll need to find a way to be willing to forgive him for things that hurt you in the past."
    },
    {
      "title": "Reach out to your dad.",
      "content": "Reach out to your dad. Picking up the phone may be scary, but it's necessary. If you really are serious about connecting with your dad, you'll have to let him know. Say something very simple to break the ice. A simple explanation is the best. For example, \"Hi Dad. It's Paul. I was thinking about you and would like to get together sometime. Look forward to hearing back from you.\" [2] X Research source [3] X Expert Source Steven Hesky, PhD Licensed Clinical Psychologist Expert Interview. 2 September 2021. If you don't hear back within the week, try again. If a phone call feels too difficult, send him an email. [4] X Expert Source Steven Hesky, PhD Licensed Clinical Psychologist Expert Interview. 2 September 2021. Include your contact information on everything you send so that he'll be able to respond."
    },
    {
      "title": "Use \"I\" statements.",
      "content": "Use \"I\" statements. Rather than criticize your dad for what he's done to hurt you, stick to your experiences. For example, instead of saying \"You always came home drunk,\" say what you felt: \"I grew up feeling confused about what to expect.\" [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source By using \"I\" statements, you're avoiding arguing. Your dad can't argue with how you felt. For instance, \"I used to feel embarrassed to bring my friends over to play,\" speaks to your own experience, while, \"You never had a job and were always hanging around harassing me,\" might make him defensive."
    },
    {
      "title": "Consider asking your father about his choices.",
      "content": "Consider asking your father about his choices. If your father did things or made choices that hurt you as a child, you might wonder why he did these things. Perhaps you've made up reasons to explain his actions, but you might be unaware of his real motives. Maybe there were circumstances that you didn't know about as a child that he can share with you now. [6] X Research source Examples of questions that you might use include \"Can you tell me why you took that job working for the airlines when I was a child?\" or \"I'd like to understand more about your relationship with your new wife. How did you meet?\" Be careful to keep yourself from asking in a blaming way. Be open to hearing what he has to say."
    },
    {
      "title": "Don't blame him for what's past.",
      "content": "Don't blame him for what's past. Statements like \"You always did this to me...\" are provocative and antagonistic: they start fights, not connections. After all, there's nothing he can do to change the past now. Start with the people you are now. If there are lingering feelings from the past, they are yours to work on. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If your parents mistreated, abused or neglected you in the past, it wasn't your fault. You can seek help for your wounds in therapy, counseling, or support groups. The patterns of blaming can be surprisingly deep. If you find yourself getting angry, defensive, or hurt, pause. Take a deep breath. Notice your thoughts, and consider if it seems that you're going into familiar blaming thoughts. Remember that you can't change him. You couldn't change him when you were a child, and you still can't. Accepting this truth will help you improve your relationship. Feel free to talk to a trusted friend, counselor, or mentor if your feelings start getting intense. [8] X Expert Source Steven Hesky, PhD Licensed Clinical Psychologist Expert Interview. 2 September 2021."
    },
    {
      "title": "Stop taking his actions personally.",
      "content": "Stop taking his actions personally. Remember that whatever your father does (or doesn't do) has more to do with him than you. The stories that you tell yourself about your father's intentions are just stories, and aren't necessarily true. [9] X Research source If you start to notice patterns in the stories you tell yourself about your father, you'll learn more about yourself. For example, are you finding that you're often the victim of your father's behavior? If so, that's likely a pattern that's continued into other relationships. Allowing yourself new insights into possible alternatives to your dad's behavior provides you with new stories about your own life. Remember that your dad, like most people, is probably busy. If he doesn't return your phone call, that doesn't mean he doesn't love you. He might have been busy, or simply forgotten. Learning to give your dad the benefit of the doubt will go a long way in deepening the connection you have together."
    },
    {
      "title": "Realize that nobody's perfect.",
      "content": "Realize that nobody's perfect. Your father will make mistakes. This doesn't make you a victim. It just makes him human. If you let go of the belief that your dad should be perfect, you'll have an easier time connecting with him. Ask yourself: “Am I being overly critical of my dad?” [10] X Research source A warning sign of believing in a \"perfect father\" is when you find yourself thinking about what a dad should be like. The belief that there is a right and wrong way to be a father is rooted in setting up expectations that will eventually fail. Don't compare your dad to other fathers you see, especially when it seems like the other fathers are better than yours. You can't really judge another person's relationship with his father. This is really another way people have of imagining a perfect father."
    },
    {
      "title": "Make a decision to forgive your dad.",
      "content": "Make a decision to forgive your dad. To forgive is not the same as excusing your father's actions, and it doesn't mean you're reconciled. But making a decision to forgive is the first step in letting go of the resentments and anger you may still carry from the past. [11] X Trustworthy Source Greater Good in Action An initiative by UC Berkeley's Greater Good Science Center promoting science-based practices for a meaningful life Go to source Think about your father's point of view. What was his own childhood like? What pressures was he carrying when you were a child? Try to understand his perspective. Notice any small feeling of softness that might enter your heart when you think of his perspective. Cultivate that feeling with kindness, knowing that it doesn't mean that you're justifying his behavior. Try to find some meaning in what you've experienced. Sometimes terrible actions have consequences that bring depth and usefulness to a person's life. Letting go of the expectations you once had will help you make a stronger connection with your father today. You may need to talk about things from the past with him, but be willing to forgive him - and yourself - for those things. Holding onto resentments will only get in the way of your connection. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you find yourself obsessing over the past and getting angry about it, talk to someone else, such as a friend, therapist, spouse or religious authority. Be willing to take this slowly. Forgiveness doesn't come all at once, and relationships can take time to mend."
    },
    {
      "title": "Find common ground.",
      "content": "Find common ground. If you're trying to connect with your father, engage him in activities or topics in which you share common interest. These don't have to be life-changing moments–they can be little things like a favorite TV series or following your favorite team together. Most people report feeling more comfortable when spending time with people who share their interests and perspectives. [13] X Expert Source Steven Hesky, PhD Licensed Clinical Psychologist Expert Interview. 2 September 2021. If you disagree on politics or religion, steer clear of those issues. Reminding your dad of things you used to do together when you were a child can be one way of finding common ground."
    },
    {
      "title": "Get to know him.",
      "content": "Get to know him. Just because he's your father, don't expect that you know everything about him. Try asking him some questions you might ask any new friend, like \"What were your parents like?\" or \"What kind of experience did you have in grade school? Who was your best friend?\" You may find that your father is more interested in talking about himself than he is in talking about you. For many adult children, this can be a change from what they remember their parents being like when they were younger. It might take some getting used to. Doing things together may prompt more questions. For example, if you're at a baseball game, you might ask him about the first time he ever went to a game, who he was with, who was playing, etc. When you're not sure where to begin, ask open-ended questions to start conversations. Questions such as \"What would your perfect day be like?\" or \"What are a few things you and your brother always had in common?\" might result in interesting new information. The more time you spend together, the more personal questions you can ask. [14] X Expert Source Steven Hesky, PhD Licensed Clinical Psychologist Expert Interview. 2 September 2021."
    },
    {
      "title": "Focus on the positive.",
      "content": "Focus on the positive. Whenever you're tempted to get defensive or irritated at your father, think about what you like about him. Even though he tells terrible jokes, you might appreciate that he always tries to put others at ease. Maybe he's kind, or patient. Keep your attention on these attributes, and you'll be more likely to connect. Staying focused on your dad's positive traits doesn't mean that his negative traits didn't exist. For example, he may have been aloof and distant when you were a child, but this taught you to be self-motivated and independent. You might now appreciate the way he allowed you to make your own mistakes and learn from them. If you find yourself unable to think of any positive traits, take a break. Walk away, and spend some time collecting your thoughts. Everyone has positive traits. Your connection with your dad won't happen until you can identify some of his."
    },
    {
      "title": "Make an effort.",
      "content": "Make an effort. Many times, connecting with someone is just a matter of spending time together. [15] X Expert Source Steven Hesky, PhD Licensed Clinical Psychologist Expert Interview. 2 September 2021. Setting aside time to visit your father, whether it's weekly or monthly, will go a long way towards helping you connect. This is particularly true if your father has developed age-related infirmities. Simply spending time sharing your life through stories and pictures can help your dad connect with your life now. Even if you don't talk much together, your presence itself can generate a kind of connection. One way of visiting is just to sit quietly together. [16] X Research source If you allow silence to be comfortable, it will be. Keep in mind that connecting with your father is a long-term process. It probably won’t happen in just 1 week. [17] X Expert Source Steven Hesky, PhD Licensed Clinical Psychologist Expert Interview. 2 September 2021."
    }
  ]
}