{
  "url": "https://www.wikihow.com/Grow-Geraniums",
  "title": "How to Grow and Care for Geraniums",
  "steps": [
    {
      "title": "Pick a spot with 5-6 hours of sunlight each day.",
      "content": "Pick a spot with 5-6 hours of sunlight each day. Whether you are planting your geraniums in the ground or in a pot, geraniums are generally one of the easier plants to take care of. They can be planted in spots that get full sun, partial sun, or light shade. Make sure that they will get morning sun and afternoon shade if possible. [1] X Research source Generally, geraniums are happiest with five or six hours of sunlight a day, though this number can be a bit more or a bit less. It is best to plant geraniums in soil that drains well. Geraniums don’t really like getting their feet too wet and soggy soil could lead to a sick plant. [2] X Research source If you live in an area that is really hot a lot of the year, try to find a spot that gets afternoon shade and has relatively moist soil."
    },
    {
      "title": "Get a pot that has holes in the bottom.",
      "content": "Get a pot that has holes in the bottom. Geraniums do not like sitting in soggy soil, so it is important to get a pot with good drainage. [3] X Research source Buy a pot that is large enough for your plant, depending on the variety of geranium you bought. If you have a smaller plant, you may be fine with a 6 or 8 inch (15.2 or 20.3 cm) pot, while larger varieties will need a 10 inch (25.4 cm) pot. Avoid placing a saucer under your plant’s pot unless the saucer has pebbles in it."
    },
    {
      "title": "Plant geraniums in the spring, after the last hard frost.",
      "content": "Plant geraniums in the spring, after the last hard frost. Depending on the type of geranium, the plant may bloom in midsummer, late summer, or fall, though sometimes the flowers have a mind of their own and they’ll burst into bloom in spring. Regardless, be prepared for their beauty to pop up anytime but winter."
    },
    {
      "title": "Prepare loose soil or potting mix with compost.",
      "content": "Prepare loose soil or potting mix with compost. Geraniums flourish in soil that has been tilled and is loose. Use a tiller or rake to ensure that the soil is loose a good 12 to 15 inches (30.5 to 38.1 cm) down. After loosening the soil, mix in 2 to 4 inches (5.1 to 10.2 cm) of compost to give the soil as much nutrients as possible."
    },
    {
      "title": "Give each plant enough space to grow.",
      "content": "Give each plant enough space to grow. Depending on the type of geranium, you will want to separate each plant by 6 inches (15.2 cm) to 2 feet (0.6 m) in distance. If you have picked up a larger variety of geranium, you will want to give each plant a good 2 feet (0.6 m) of space to grow."
    },
    {
      "title": "Dig holes for each plant.",
      "content": "Dig holes for each plant. Each hole should be roughly double the diameter of the plastic pot that the geranium is contained in. For example, if you bought a geranium that came in a 6-inch plastic pot, you should make a hole that is 1 foot (0.3 m) in diameter. If you choose to grow your geraniums from seeds, sow them directly into the ground. If you do choose to use seeds, know that your plants will take longer to grow and blossom. If you are sowing seeds in a pot, start your pot off indoors while the seeds take root. Once the seeds begin to sprout, you can move the pot outside. If you need to move the plants outside during harsher weather, then start by leaving them outside during the day when it is warmer and bringing them in at night. This is called “hardening off.”"
    },
    {
      "title": "Place the plant in the hole.",
      "content": "Place the plant in the hole. Gently take the geranium out of its container, making sure to not break any of its roots. Place the plant in the hole so that the plant’s root ball (the bundle of roots that have been squished together in the plastic container) is level with the surface of the soil. However, if your soil has a lot of clay in it, then you may want to plant it up higher since clay will make a basin for water and this will cause your geraniums to rot. Fill the rest of the hole up with soil and pat the soil down around the plant so that the geranium can stand up on its own. Water your plant immediately, but be careful not to rinse the soil away from the root ball. Water gently at the base of the plant. Try to avoid putting soil on the stem of the plant, as a buried stem could lead to a rotting plant."
    },
    {
      "title": "Water your plants whenever the soil is dry or barely moist.",
      "content": "Water your plants whenever the soil is dry or barely moist. Geraniums are considered relatively drought resistant, but that doesn’t mean you should never water them. To tell if your plants need to be watered, check the soil. Use your fingernail to scratch just below the surface of the soil--if it is dry or barely moist, you should water your flowers. It is important to let the soil dry out between waterings. [4] X Research source For geraniums in pots, make sure that you give them enough water. Water the plants until the water runs out the bottom (hence why you need holes in the bottom of your pot.)"
    },
    {
      "title": "Keep the compost flowing.",
      "content": "Keep the compost flowing. Each spring, you should add a new layer of compost around your geraniums. Place 2 inches (5.1 cm) of mulch on top of this layer of composted soil. The mulch will help to keep the soil moist, and will also reduce the number of weeds brave enough to grow around your geraniums. [5] X Research source"
    },
    {
      "title": "Keep your plant healthy by removing dead flowers.",
      "content": "Keep your plant healthy by removing dead flowers. After the flower has bloomed, remove the dead flowers and parts of the plant so that it can regrow healthy and strong. [6] X Research source Remove leaves and stalks that have died (they will be brown in color) so that your plant does not grow any fungus (which appears on dead parts of plants.)"
    },
    {
      "title": "Separate your plants every three to four years.",
      "content": "Separate your plants every three to four years. Once your plants have grown large (and most likely extended their boundaries a good deal,) you should separate the plants. Divide the plants in late spring. To do this, lift the plants (and their roots) out of the ground, separate the plants by the clumps they have grown around their stems, and replant them."
    },
    {
      "title": "Fertilize with liquid fertilizer such as 20-20-20.",
      "content": "Fertilize with liquid fertilizer such as 20-20-20. [7] X Research source Follow the directions on the fertilizer to know how much to use. Try to keep from getting fertilizer on the plant leaves. Repeat the application once every two weeks during active growing seasons. [8] X Research source"
    }
  ]
}