{
  "url": "https://www.wikihow.com/Do-Hindu-Pushups",
  "title": "How to Do Hindu Pushups for a Full-Body Workout",
  "steps": [
    {
      "title": "Move down onto your hands and knees.",
      "content": "Move down onto your hands and knees. Place your palms on the floor with your fingers spread out. Line up your wrists so they are parallel with each other and positioned directly under your shoulders. Place your knees under your hips. Keep your hands in line with your knees. [2] X Research source This is called the tabletop position, and it’s the easiest way to get into an inverted V or downward-facing dog pose."
    },
    {
      "title": "Curl your toes under and roll back onto your feet.",
      "content": "Curl your toes under and roll back onto your feet. Press your hands into the ground as you lift your knees away from the floor. Look down at the ground and keep your neck and back in a straight line. For beginners, place your hands and feet slightly farther than shoulder-width apart. [3] X Research source If you're familiar with downward dog, keep your hands and feet closer together for a more intense workout. [4] X Research source Keep your knees and elbows bent to maintain stability as you adjust your stance."
    },
    {
      "title": "Straighten your knees and elbows to make the inverted V.",
      "content": "Straighten your knees and elbows to make the inverted V. Support your shoulders, arms, and wrists by lifting through your hips toward the ceiling. Lower your heels to the ground and look toward your feet. In this position, you will look like an upside-down V. [5] X Research source This is the beginning position for a Hindu pushup. You will return to it after completing each repetition. Bend your elbows slightly and move your shoulders away from your ears. It’s okay if you aren’t able to lower your heels all the way to the ground. Many people have tight hamstrings and this position may help stretch them out."
    },
    {
      "title": "Bend your arms and lower your hips so your body is parallel to the floor.",
      "content": "Bend your arms and lower your hips so your body is parallel to the floor. Inhale as you lower your body. Bend your elbows, keeping them close to the side of your body. Some people place their forearms on the floor as their body lowers. This is fine, but don’t allow the rest of your body to touch the floor. [6] X Research source Keep your head, neck, and back in a straight line."
    },
    {
      "title": "Straighten your arms to bring your head and chest up.",
      "content": "Straighten your arms to bring your head and chest up. Without allowing your body to touch the ground, push your head and chest forward. [7] X Research source Exhale through your mouth as you move your head and chest in a smooth C-shaped motion that feels like diving under a bar. [8] X Research source After scooping your head in a diving-and-resurfacing motion, straighten your arms, lift your torso, and look upwards. [9] X Research source This position is very similar to the upward dog pose in yoga, but you don't adjust your feet so the toes of them are touching the floor. Before you begin this movement, remember to breathe in deeply through your nose. [10] X Research source"
    },
    {
      "title": "Lift your hips to return to the V position.",
      "content": "Lift your hips to return to the V position. Use your abs and gluteus maximus, i.e., your butt muscles, to bring your backside up into the air. [11] X Research source As you push back to the starting position, inhale deeply through your nose. Exhale through your mouth as you reach the V position. To return to the starting position, you do not need to reverse back through the sweeping, diving motion. Simply push your hips back into the inverted V. At this point, you have completed 1 Hindu pushup. Use fluid movements to go through each step."
    },
    {
      "title": "Focus on using good form.",
      "content": "Focus on using good form. When starting a new fitness routine , it’s best to take things slowly. If you’re a beginner, doing as many pushups or repetitions as you can while using good form is recommended. For example, 3 or 5 repetitions are fine. [12] X Research source As you improve, increase repeptitions and add more sets. For example, do 2 sets of 3 repetitions or pushups. If you are more advanced, do more sets with more repetitions. For example, 3 sets with 8 to 10 pushups or repetitions. Perform Hindu pushups seamlessly in a sweeping motion without delay between each part."
    }
  ]
}