{
  "url": "https://www.wikihow.com/Defeat-Chauncey-in-Luigi%27s-Mansion",
  "title": "How to Defeat Chauncey in Luigi's Mansion",
  "steps": [
    {
      "title": "After you have defeated Neville and Lydia in the previous rooms, you will hear screaming from Chauncey's room.",
      "content": "After you have defeated Neville and Lydia in the previous rooms, you will hear screaming from Chauncey's room. Go inside to reveal a nursery, with a crib, rocking horse, and bouncing balls."
    },
    {
      "title": "Use you vacuum on the rocking horse so it rocks.",
      "content": "Use you vacuum on the rocking horse so it rocks. After you do that, Chauncey will appear."
    },
    {
      "title": "Chauncey will now ask if you want to play with him.",
      "content": "Chauncey will now ask if you want to play with him. He will summon the teddy bears on the shelf to home in towards you. Avoid them or else you will lose some health."
    },
    {
      "title": "While Chauncey is doing this, vacuum up that ball on the ground and shoot it at Chauncey.",
      "content": "While Chauncey is doing this, vacuum up that ball on the ground and shoot it at Chauncey. After you do that, he will shrink you and transport you to his crib."
    },
    {
      "title": "After the cutscene, Chauncey will make giant rocking horses swoop down towards you.",
      "content": "After the cutscene, Chauncey will make giant rocking horses swoop down towards you. Avoid these and step in a place where they won't hit you."
    },
    {
      "title": "When the rocking horses stop swooping towards you, many bouncing balls will appear.",
      "content": "When the rocking horses stop swooping towards you, many bouncing balls will appear. They will all disappear quickly, except for one. Suck the remaining one in your Poltergeist and shoot it at Chauncey."
    },
    {
      "title": "Chauncey will expose his heart and become vulnerable.",
      "content": "Chauncey will expose his heart and become vulnerable. This is your chance to vacuum him up. Chauncey puts up a fight, though, so you will lose hold of him."
    },
    {
      "title": "After losing hold of him, he will bounce around the stage and will hurt you if you come in contact with him.",
      "content": "After losing hold of him, he will bounce around the stage and will hurt you if you come in contact with him. He gets back up, and summons more rocking horses. Avoid these just like before."
    },
    {
      "title": "When the bouncy balls appear again, repeat Step 6 and vacuum him up again.",
      "content": "When the bouncy balls appear again, repeat Step 6 and vacuum him up again. Continue to repeat steps 5 and 6 until you have drained his HP down to 0."
    },
    {
      "title": "The lights will come on, revealing a treasure chest.",
      "content": "The lights will come on, revealing a treasure chest. Open it to reveal a key to that door at the bottom of the foyer. E. Gadd will suddenly contact you and take you to his lab to empty out all of your ghosts."
    }
  ]
}