{
  "url": "https://www.wikihow.com/Drill-Metal",
  "title": "10 Tips to Drill through Metal",
  "steps": [
    {
      "title": "You’ll need a stronger bit when you’re drilling harder metals.",
      "content": "You’ll need a stronger bit when you’re drilling harder metals. If you’re using your drill on a softer metal like aluminum, you can use a standard high-speed steel bit that you’d use on wood. If you’re drilling steel or another hard metal, use a cobalt , titanium , or carbide bit since they’re stronger. If you need to make a hole that’s larger than 1 inch (2.5 cm), get a hole saw attachment for your drill instead. Try a cone-shaped step bit if you’re working with thin sheet metal. Step bits also let you drill multiple sizes of holes without changing the bit. A drill press will give you the most power to cut through the thickest metals, and you may be able to use one at a community workshop in your area."
    },
    {
      "title": "Gloves",
      "content": "Gloves and safety glasses protect you from sharp metal shavings. Drilling through metal can kick up small and sharp scrap pieces. Wear thick work gloves and a pair of safety glasses whenever you’re using your drill so you don’t get any nicks or cuts. Wear a long-sleeved shirt with a closed collar to protect your arms and body too."
    },
    {
      "title": "Using clamps keeps the metal from moving around while you drill.",
      "content": "Using clamps keeps the metal from moving around while you drill. It’s better to hold your tool with both hands when you drill metal. Secure the ends of the metal onto a sturdy work surface with your clamps so the piece doesn’t shift or move. [1] X Research source If you’re drilling a hole through thin sheet metal, sandwich it between 2 pieces of plywood so the edges stay flat and smooth."
    },
    {
      "title": "Marking the metal ensures you drill in the right spot.",
      "content": "Marking the metal ensures you drill in the right spot. Start the end of a tape measure on the edge of the metal and measure in to where you want to drill. Mark where you want the center of the hole to be with an X or a dot. [2] X Research source"
    },
    {
      "title": "An indentation prevents your drill bit from slipping.",
      "content": "An indentation prevents your drill bit from slipping. Put the pointed end of a center punch on the mark you made in the metal. Tap the top of the center punch lightly with a hammer to make a small dent on the surface where you can place the end of the drill bit. [3] X Research source In a pinch, you can use a nail instead of a center punch."
    },
    {
      "title": "Using cutting oil adds lubrication so it’s easier to drill through metal.",
      "content": "Using cutting oil adds lubrication so it’s easier to drill through metal. Drilling into metal makes a drill bit heat up, but the cutting oil cools it down and keeps it running smoothly. Dab a coin-sized amount of the oil into the divot you just made. Keep the oil nearby just in case you need to add more lubrication while you’re drilling. [4] X Research source Cutting oil also helps keep your drill bit sharp so it doesn’t dull as fast."
    },
    {
      "title": "A slow speed prevents the metal or drill bit from breaking or getting hot.",
      "content": "A slow speed prevents the metal or drill bit from breaking or getting hot. Put the end of the drill bit into the divot and hold it perpendicular to your piece of metal. Hold the handle with one hand and put your other hand on top for extra support. Lightly squeeze the trigger to use your drill and push the bit down into the metal to start boring a hole through it. [5] X Research source You can use drill bits smaller than 1 ⁄ 16 inch (1.6 mm) up to a speed of 3,000 RPM. If you’re working with a drill bit that’s larger than 1 ⁄ 2 inch (1.3 cm), keep it around 1,000–1,500 RPM. [6] X Research source If you’re trying to drill a large hole in thick metal, start with a 1 ⁄ 4 in (0.64 cm) bit to make a pilot hole since it’ll be easier to cut out. Then, change the drill bit to the next size larger and drill through the hole again to widen it out."
    },
    {
      "title": "You’re more likely to damage a drill bit when it heats up.",
      "content": "You’re more likely to damage a drill bit when it heats up. If the drill bit or piece of metal gets hot or starts glowing, let go of the trigger and let them cool down. While you’re waiting, squirt a few drops of cutting oil into the hole to lubricate the metal again."
    },
    {
      "title": "Reversing the drill bit makes it easier to pull it out.",
      "content": "Reversing the drill bit makes it easier to pull it out. Find the switch on your drill that changes the direction your drill spins, and set it to reverse. Squeeze the trigger to back the drill bit out of the metal. As the drill bit spins, pull it straight up and out of the hole. [7] X Research source"
    },
    {
      "title": "A deburring tool smoothes out edges so you don’t cut yourself.",
      "content": "A deburring tool smoothes out edges so you don’t cut yourself. A deburring tool has small blades that shave off raised edges on metal. Put the point of the deburring tool into the hole and apply light pressure as you turn it. When you remove the tool, the edges of the hole will be smooth and safe to touch. [8] X Research source Collect metal shavings in a plastic bucket with a lid to recycle or take to a scrapyard. [9] X Research source"
    }
  ]
}