{
  "url": "https://www.wikihow.com/Hitchhike",
  "title": "How to Hitchhike",
  "steps": [
    {
      "title": "Invest in a good map.",
      "content": "Invest in a good map . A detailed map is worth the money. If you need a free map, however, find a tourist spot, such as a hotel , airport , bus station, or tourist information booth, and pick up a pamphlet that has a decent map inside. State welcome centers on interstate highways also have free highway maps for their state. Rental car places tend to have the best free maps. Look for a map that shows road numbers, rest areas, and gas stations. [1] X Research source Having a good map will also make you look more knowledgeable and prepared, and thus appealing to drivers."
    },
    {
      "title": "Know how to find a good hitchhiking spot.",
      "content": "Know how to find a good hitchhiking spot. A good spot might be near an on-ramp – these locations often have steady traffic and enough space for a car to pull over and pick you up. Near stop signs and stoplights is often a good option because it gives drivers enough time to observe you and make a decision about whether to pick you up. [2] X Research source [3] X Research source Make sure that you are on the side of the city or town that's in the direction you're traveling. For example, if you're heading west, get on the west side of town. Choose a straight stretch of road (700 meters in either direction) so that drivers can see you for a longer time. An incline would be even better. Standing at a turning point increases the risk of getting hit by a car that has no visual on you. It is the most dangerous spot for cars to stop. It is also best to avoid bridges altogether, including the entrance, on the bridge, and around the exit area. Tunnels are a bad spot for hitchhiking too. Choose a place where cars passing at less than 50 mph (80km/hr). Make sure that they are headed in your direction Make sure that the spot is well-lit. This will not only keep you safe, but also make you more noticeable. [4] X Research source"
    },
    {
      "title": "Keep your face visible.",
      "content": "Keep your face visible. Your face is your profile. Avoid wearing sunglasses, as drivers need to see your eyes within the brief one or two seconds they have to assess you and decide whether to stop for you or not. Without your eyes being seen, it can be difficult for people to trust you."
    },
    {
      "title": "Pack as light as possible, but bring enough supplies to last you a few days.",
      "content": "Pack as light as possible, but bring enough supplies to last you a few days. The less you carry, the easier it will be for you to travel. Avoid suitcases and trash bags, and opt for a backpack instead. Pack as though you are going for a three-day hike, in case you get stranded and are unable to find a ride. [5] X Research source Consider bringing the following: [6] X Research source A least two containers of water Stay hydrated and fresh. Even if you're exhausted and have been waiting for a ride for hours, try not to show a hopeless posture. A tired posture screams: Not fun to travel with! Remember that hitchhiking is an exchange, and drivers often pick up hitchhikers for pleasant conversations. They may be looking to stay awake or simply bored of staring at the road. So what they really don't need is two more eyes staring at the road. It will be awkward he may drop you off sooner. They look for someone to have a cool chat with. When someone offers you a free ride, be generous enough to share some words, stories, or jokes with them. Energy-filled snacks Sunscreen and insect repellent Sleeping bag and a small tent A change of clothes, plus a light jacket, raincoat/poncho, extra socks, long underwear, a hat, and boots Cell phone chargers, if necessary Don't bring anything of sentimental value. Consider packing some pepper spray, especially if you are female. Keep in mind that pepper spray is not legal in some areas."
    },
    {
      "title": "Consider making a sign.",
      "content": "Consider making a sign. It will show people that you're serious about your trip and that you have a plan or destination in mind. Write the sign using a black permanent marker on a piece of cardboard. Keep the message short, and use all caps. This will make your sign easier and quicker to read. [7] X Research source Writing the name of a big town/city in the direction you are heading is a good idea, such as: LONDON, PARIS, NYC. Keep it close, about 20 to 50 miles (32 to 80 kilometers). Writing a distance is a good option. Keep it around 12 miles (20 kilometers). Most drivers will be traveling around that distance. Funny signs can help catch a rider's interest. If you have enough space, consider adding something silly, like \"Free Hugs,\" \"I Like Tacos\" or \"Doesn't Bite.\" [8] X Research source"
    },
    {
      "title": "Be aware of the laws.",
      "content": "Be aware of the laws. Laws regarding hitchhiking will vary from place to place. For example, hitchhiking is legal in all 50 states of the US, but how you do it will vary from state to state. In general, however, you should stay off the highways. [9] X Research source"
    },
    {
      "title": "Make digital copies of all your IDs, documents, and papers.",
      "content": "Make digital copies of all your IDs, documents, and papers. Scan your ID (and passport, if traveling internationally) and e-mail it to yourself. This way, if it gets stolen, print out copies at a library. For passports, go to an embassy with your copies and do what you need to do to get a new passport. Have the phone number for your credit card company before you leave. If you lose your credit card, call them immediately, cancel your card, and have them send a new one to an address where you can receive it, like an embassy."
    },
    {
      "title": "Be prepared financially.",
      "content": "Be prepared financially. Have some backup money, as well as traveler's insurance. Accidents happen, and you will need to be prepared for that; traveler's insurance will help you with that. Also, having spare money will help you get food and shelter in the event you are stranded in a certain area for longer than you expected."
    },
    {
      "title": "Be mindful of the weather.",
      "content": "Be mindful of the weather. Rain will not increase your chances of getting picked up, especially if you're totally drenched. Snow, however, tends to increase the odds of getting a ride. People generally don't mind the occasional snowflake on their upholstery because it brushes off easily, while rain tends to collect in seat cushions. If it's raining, an easily removable poncho or umbrella may reassure picky drivers that their car won't get soaked. If you have time, it is often better just to wait out a rainstorm. Consider waiting it out someplace warm and heated, such as a diner, a cafe, a library, etc."
    },
    {
      "title": "Be selective about which rides you take.",
      "content": "Be selective about which rides you take. You'll actually get to your destination faster that way. It's better to travel 50 miles and get dropped off at a gas station or truck stop than to travel 100 miles and get dropped off in a bad hitchhiking spot. If you're on a busy roadway for more than two hours and people aren't stopping, you're probably on the wrong road or the wrong side of the road. [10] X Research source Never take rides from anyone who appears intoxicated. Drinking while driving is illegal in many places, but people still do it. Don't be afraid to ask the driver questions to get to know them better. Ask them where they are going, and why. This might give you a better idea of their intentions. [11] X Research source Short rides can make it easier for you. Sometimes accepting a short ride can get you somewhere that is easier to get the long rides and they can be more fun. There are cool people driving all kinds of vehicles. From big trucks to SUVs, Old sedans, sometimes fancy cars, and even tractors. They will choose you. So stand there and wait for your turn to come. Usually, the one who you don't expect will stop for you. You only need to be cautious about the drivers' character. Just be ready to filter the bad ones as well. But it's recommended not to reject the ride just because it's not going to get you far."
    },
    {
      "title": "Know that you don't have to accept every car that pulls over.",
      "content": "Know that you don't have to accept every car that pulls over. Even if you are desperate, your safety is more important. If you are getting bad vibes from the first car that has pulled over in hours, don't get in. It is not worth the risk. Wait for another car. You should be wary of the following: [12] X Research source Cars that look and/or smell dirty. This implies that the person is not responsible and doesn't care about themselves, and quite possibly others. Cars that have bottles or cans, especially empty ones. If they are alcoholic, stay away; the driver might be intoxicated. Cars that have multiple people inside. This means that there are more people who can take advantage of you. Drivers who give too much or not enough eye contact. They usually are hiding something. Drivers who are angry, controlling, or impatient. Not only can they make your ride less enjoyable, but they might not be very safe drivers."
    },
    {
      "title": "Trust your instincts and don't be afraid to excuse yourself.",
      "content": "Trust your instincts and don't be afraid to excuse yourself. If someone pulls over for you and you don't feel safe (or if you are already in the car and no longer feel safe), you should not hesitate to stand firm and refuse the ride. If you are already in the car, politely ask to be let out at the next stop. If that doesn't work, here are some things you could say to excuse yourself,: [13] X Research source \"I'm sorry, I was hoping for a ride that is going further than that.\" \"Oh no, I think I forgot something back in town. I need to head back. Thanks for the offer, though.\" \"Ugh... I feel sick...\" Be sure to look nauseated while doing this. Most people don't want to vomit in their car. Always have an escape plan, in case something goes wrong. However, being overly insecure can make the driver feel untrusted and offended, which might provoke negative behavior. Stay relaxed and confident, knowing you have an escape plan if needed. What you really need to know is that the driver is the vulnerable one. Cause at least one of their hands will be busy controlling the steering wheel. Their legs are busy down there as well, and they can not get their eyes off the road for a long time. Remember, in an emergency situation, in which the driver wants to harm you, or changes the destination without your consent, your left leg will control the brake, and your left hand will hold the steering wheel, giving you full control of the car and the ability to stop it quickly if necessary."
    },
    {
      "title": "Stay connected to your friends and family.",
      "content": "Stay connected to your friends and family. Before going on a trip, tell your friends and family where you are going, for how long you will be gone, and when to expect you back. This way, if something goes wrong and you are gone for longer than expected, they will notify the police and send someone to look for you. Before you get into a car, it would be a good idea to text the license place to a friend. This may help police find you if you do go missing. [14] X Research source Once you are into the car, consider calling a friend and letting them know where you are at. This way, if the driver had evil intentions, they'll be less likely to carry them out. [15] X Research source"
    },
    {
      "title": "Stand where cars are parked while waiting for someone to pick you up along the road.",
      "content": "Stand where cars are parked while waiting for someone to pick you up along the road. Look for parking lots near the road, gas stations, road restaurants, and similar places. Drivers of parked cars will have more time to observe you, analyze you and see your vulnerable humane side and understand that you're just someone in need of a ride, without any harmful intentions."
    },
    {
      "title": "Avoid standing too close to passing cars or excessively thumbing for a ride.",
      "content": "Avoid standing too close to passing cars or excessively thumbing for a ride. Someone who intends to pick you up will do so. In my experience, it was often when I stopped caring too much that someone stopped for me. They notice you standing there, so stay calm, enjoy watching your surroundings, and trust that your ride will come. Being overly stressed about when your ride will arrive only makes it harder for you to get that ride and also will ruin your experience."
    },
    {
      "title": "Avoid hitchhiking at night.",
      "content": "Avoid hitchhiking at night. Not only are the roads more dangerous, but you will be harder to see. You'll be more likely to get hit by a car than picked up by one. Also, people tend to commit more crimes at night, because the darkness gives them cover. [16] X Research source Find a place to camp or a motel to stay at."
    },
    {
      "title": "Keep your bag with you at all times.",
      "content": "Keep your bag with you at all times. Avoid putting it into the trunk. If you put it into the trunk, the driver might drive away with it when they let you off. You will be stuck without supplies for a long time. [17] X Research source Keep valuables, such as wallets and phones, on your person at all times. This way, if your bag does get lost, you will still have money and some form of communication on you. [18] X Research source"
    },
    {
      "title": "Consider bringing a friend if this is your first time, or if you are female.",
      "content": "Consider bringing a friend if this is your first time, or if you are female. It is always safer to travel in pairs, especially if you are female. It might also be a good idea to hitchhike with a friend who has done this before. You'll feel more at ease, and you'll be less likely to make mistakes. A friend may also help ease boredom and frustration. [19] X Research source On the other hand, some people find that pairs have a harder time picking up rides."
    },
    {
      "title": "Smile and be approachable.",
      "content": "Smile and be approachable. Waiting for a car to stop can take a while, so you might want to do something that will keep you happy, such as singing, listening to music, or playing on a guitar. Avoid sitting or reading a book, as this will make you look bored or unapproachable; it will also take your attention off the road and potential rides. You should also avoid smoking, drinking, doing drugs, etc. Not all drivers are open to these sorts of things, and you'll reduce your chances of getting picked up if you smoke, drink, or do drugs. [20] X Research source If someone shouts something rude to you, or make a rude gesture, don't fight back. Simply smile, and let it go. If you start to feel irritable, take a 15 to 20-minute break in a cafe or take a nap. Drivers won't pick up someone who looks irritable. Doing something fun while you wait, such as playing an instrument, juggling, or dancing will help make you look more visible and thus interesting. You'll be more likely to pick up a ride. Don't cross your arms or keep them in your pockets. You'll look bored and unapproachable. Instead, smile, wave, and say \"hello.\" [21] X Research source"
    },
    {
      "title": "Look clean and presentable.",
      "content": "Look clean and presentable. This goes for both your clothes and body. If you look dirty and unkempt, people may think that you are either homeless or an escaped prisoner rather than a traveler. People usually do not give rides to homeless people or escaped prisoners. Make sure your hair is brushed and that you are clean-shaven. Make sure that your clothes are clean, and not torn or rumpled."
    },
    {
      "title": "Consider dressing for the area you are in.",
      "content": "Consider dressing for the area you are in. People tend to warm up to those who dress like they do. Consider wearing jeans and a flannel shirt if you are in a working-class area, and khakis and a collared shirt if you are in a \"white-collar\" area. [22] X Research source"
    },
    {
      "title": "Know what types of clothing to avoid.",
      "content": "Know what types of clothing to avoid. In general, you'd want to avoid wearing clothing that is dirty, torn, faded, or ill-fitting. People might mistake you for a homeless person or an escaped prisoner, and will be less likely to give you a ride. You'll also want to avoid wearing sunglasses because they will prevent eye contact and imply that you are hiding something. Avoid wearing black, as it will make you look more intimidating and harder to see. Opt for lighter or brighter colors. You'll be more visible and more approachable. [23] X Research source Super short hair is often associated with prisons and asylums. People may think that you are on the run from them, especially if the rest of your appearance is ragged. Long hair and beards are often associated with untidiness."
    },
    {
      "title": "Be mindful and respectful of other hitchhikers.",
      "content": "Be mindful and respectful of other hitchhikers. If there is another hitchhiker, try to make a conversation with them. If they are going in the same direction you are, ask to pair up. It is always safer to travel in numbers. If they are not going in the same direction, then step aside, and wait your turn. You can learn a lot from your fellow hitchhikers. They can give you tips on traveling and the surrounding area."
    },
    {
      "title": "Be friendly once in the car.",
      "content": "Be friendly once in the car. You will likely be in the car for a while, and you don't want the ride to be awkward. Many drivers won't mind talking, and some may even start a conversation with you by asking about your trip, where you are going, etc. Don't be afraid to ask some questions yourself. Keep personal details to a minimum, however, at least until both you and the driver feel comfortable. [24] X Research source If you are traveling in a foreign country, consider learning some of the languages. Many drivers will pick up hitchhikers out of the need for companionship. Knowing the language will help you carry a conversation. A friendly conversation can also earn you a free meal, an extra mile or two, or helpful information. Never ask for free food, however, but accept it when it is offered—use your intuition, however! [25] X Research source Avoid sensitive subjects, such as politics, race, and religion. They can make friendly conversations turn unfriendly quickly. [26] X Research source"
    },
    {
      "title": "Plan ahead for getting dropped off.",
      "content": "Plan ahead for getting dropped off. It would be a good idea to discuss your drop-off location towards the beginning of the ride. Ask to be dropped off at a safe, well-lit location, such as a gas station. Also, ask to be dropped off right before or right after a city; hitchhiking in cities is difficult. [27] X Research source Truck stops are a great drop-off place. You'll be able to get more supplies and find more rides there."
    }
  ]
}