{
  "url": "https://www.wikihow.com/Bend-Words-in-MS-Word",
  "title": "How to Bend Words in MS Word",
  "steps": [
    {
      "title": "Open your Word document.",
      "content": "Open your Word document. Double-click the document in which you want to bend a word or phrase."
    },
    {
      "title": "Select a word or phrase.",
      "content": "Select a word or phrase. Click and drag your mouse cursor across the word or phrase that you want to bend."
    },
    {
      "title": "Click the Insert tab.",
      "content": "Click the Insert tab. It's at the top of the Word window. The Insert toolbar will appear at the top of the window."
    },
    {
      "title": "Click WordArt.",
      "content": "Click WordArt . This option is in the \"Text\" section of the toolbar. Clicking it prompts a drop-down menu."
    },
    {
      "title": "Select a WordArt appearance.",
      "content": "Select a WordArt appearance. Click one of the icons in the WordArt drop-down menu to set it as your selected text's appearance."
    },
    {
      "title": "Click Text Effects.",
      "content": "Click Text Effects . It's in the \"WordArt Styles\" section of the Format tab that opens. A drop-down menu will appear. If this tab doesn't automatically open after applying a WordArt appearance to your selected text, click the Format tab before proceeding."
    },
    {
      "title": "Select Transform.",
      "content": "Select Transform . This option is in the drop-down menu. Selecting it prompts a pop-out menu."
    },
    {
      "title": "Click a curved option.",
      "content": "Click a curved option. You should see four curved options in the \"Follow Path\" section of the drop-down menu. Click the one you want to use to apply it to your selected text. [1] X Research source If you want to bend your text around a circular object, click the Rotate option (e.g., the circular text with no word in the middle) in this drop-down menu."
    },
    {
      "title": "Adjust your WordArt's appearance.",
      "content": "Adjust your WordArt's appearance. If you want to change the size and/or curvature of your WordArt word or phrase, do the following: Click and drag in or out any of the white dots to shrink or enlarge the word or phrase. Click and drag the yellow dot to adjust the curvature of the word or phrase."
    },
    {
      "title": "Save your changes.",
      "content": "Save your changes. When you're done adjusting the text, click File and then click Save to save your changes to the document."
    }
  ]
}