{
  "url": "https://www.wikihow.com/See-Messages-from-Non%E2%80%90Friends-on-Facebook-Messenger-on-a-PC-or-Mac",
  "title": "See Messages from Non‐Friends on Facebook Messenger: Mac/PC",
  "steps": [
    {
      "title": "Go to https://www.facebook.com.",
      "content": "Go to https://www.facebook.com . Use any web browser on a Mac or Windows computer to get online and look at your message requests. If you see the login screen instead of your News Feed, type your username and password into the blanks and click Log In . You can also see your message requests on Android."
    },
    {
      "title": "Click Messenger.",
      "content": "Click Messenger . It’s on the right side of the screen and looks like an icon of a lightning bolt inside a chat bubble. Clicking this prompts a menu to drop down."
    },
    {
      "title": "Click … .",
      "content": "Click … . This horizontal three-dot menu is in the top right corner of the drop-down menu and will give you more options."
    },
    {
      "title": "Click Message requests.",
      "content": "Click Message requests . It's near the middle of the menu next to a group of chat bubbles. You’ll see a list of messages you’ve received from people you’re not connected with on Facebook separated into two categories: You may know and Spam ."
    },
    {
      "title": "Click a message to view its contents.",
      "content": "Click a message to view its contents. The sender will not know you’ve read the message unless you reply. Click I don't want to hear from [PERSON] at the bottom of the message to archive it without the sender ever knowing you’ve read it. [1] X Research source"
    },
    {
      "title": "Open Messenger for Windows or macOS.",
      "content": "Open Messenger for Windows or macOS. This app icon looks like a purple and blue speech bubble with a white lightning bolt inside it. If you don't have this desktop app, you can download it for free from the Mac App Store or the Microsoft Store."
    },
    {
      "title": "Click the \"Requests\" icon.",
      "content": "Click the \"Requests\" icon. It looks like a chat bubble with three dots inside it and is usually the last icon in the sidebar on the left side of the Messenger window. You'll see all your message requests in the center panel ( You may know and Spam )."
    },
    {
      "title": "Click on a message to read it.",
      "content": "Click on a message to read it. The sender will not know you’ve read the message unless you reply. Click I don't want to hear from [PERSON] at the bottom of the message to archive it without the sender ever knowing you’ve read it."
    },
    {
      "title": "Go to https://facebook.com and sign in.",
      "content": "Go to https://facebook.com and sign in. You can change the message delivery settings on any web browser as well as using the desktop app."
    },
    {
      "title": "Click Messenger.",
      "content": "Click Messenger . It’s on the right side of the screen and looks like an icon of a lightning bolt inside a chat bubble. Clicking this prompts a menu to drop down. If you're using the desktop app, click your profile picture (in the bottom left corner) and select Preferences ."
    },
    {
      "title": "Click … .",
      "content": "Click … . This horizontal three-dot menu is in the top right corner of the drop-down menu and will give you more options. On the desktop app, click Account settings and your browser will open to your Facebook account settings."
    },
    {
      "title": "Click Message delivery settings.",
      "content": "Click Message delivery settings . It's near the bottom of the menu and will redirect you to Privacy settings. If you were using the desktop app, you're now looking at account settings in a web browser. Click Privacy to see the same menu."
    },
    {
      "title": "Change your settings under the \"How you get message requests\" header.",
      "content": "Change your settings under the \"How you get message requests\" header. You can change settings like who can send you chats and which messages are sent as message requests. Since Facebook and Instagram are Meta companies, you can also change your settings so those who message your Facebook from Instagram are either sent as chats or message requests. The page automatically saves your changes, so don't worry about finding a \"Save\" button. Messages that go against Community Standards are typically labeled as \"Spam.\""
    }
  ]
}