{
  "url": "https://www.wikihow.com/Make-Paper-Clay",
  "title": "How to Make Paper Clay",
  "steps": [
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. To make paper clay, you'll need toilet paper as well as a few supplies you can find at the hardware store. This recipe results in a smooth, malleable clay you can mold over any type of prepared form. It dries into a hard surface to which you can apply paint or varnish. Here's what you need: [1] X Research source 1 roll of single ply toilet paper (not the kind with lotion, scent or color added) 1 cup premixed joint compound (do not buy it in powdered form; get \"regular\") 3/4 cup PVA glue (white school glue) 2 tablespoons mineral oil 1/2 cup white flour 2 large bowls Electric mixer Measuring cups"
    },
    {
      "title": "Remove the toilet paper from the roll.",
      "content": "Remove the toilet paper from the roll. It's less messy to slip the entire roll of paper off of the cardboard roll at once, rather than unwinding the paper entirely. Place the toilet paper in one of the bowls."
    },
    {
      "title": "Fill the bowl with water.",
      "content": "Fill the bowl with water. Pour it over the toilet paper until it's completely saturated. Push the toilet paper down into the water to make sure it all gets wet."
    },
    {
      "title": "Squeeze out the toilet paper and place the pulp in a separate bowl.",
      "content": "Squeeze out the toilet paper and place the pulp in a separate bowl. Tear it off in smaller chunks (1 inch or less) so you can squeeze out as much water as possible. Place the pulpy chunks in a separate bowl so you can mix them with the other ingredients. Keep going until you've squeeze out all of the toilet paper."
    },
    {
      "title": "Measure 1 1/2 cups of toilet paper pulp.",
      "content": "Measure 1 1/2 cups of toilet paper pulp. One roll of plain toilet paper typically equals a cup and a half of pulp. If your brand of toilet paper makes very small or large rolls, you might end up with less or more pulp than you need. Make more toilet paper pulp or discard the excess as needed, so you have 1 1/2 cups of pulp in the bowl."
    },
    {
      "title": "Add the remaining ingredients.",
      "content": "Add the remaining ingredients. To the bowl with the pulp, add a cup of premixed joint compound, 3/4 cup white school glue, 2 tablespoons (29.6 ml) mineral oil, and 1/2 cup white flour. Do not substitute these ingredients. Different types of glue, oil, flour, and so one will change the consistency of the paper clay and may not produce the results you want."
    },
    {
      "title": "Mix up the clay until smooth.",
      "content": "Mix up the clay until smooth. Use your electric mixer to beat the clay at a high speed. The paper fibers will break down and blend with the joint compound, glue, oil and flour until it takes on a smooth, dough-like consistency. If you want a thicker clay, mix in an extra half cup of flour. For a thinner consistency, add an extra half cup of glue."
    },
    {
      "title": "Prepare a sculpture form.",
      "content": "Prepare a sculpture form. Paper clay is used in place of paper mache strips, which are typically dipped in water and applied to a wire or masking tape sculpture form. Paper clay is used the exact same way, but with a neater, more professional finish. Prepare your sculpture form for its clay application. [2] X Research source"
    },
    {
      "title": "Spread the clay onto the form using a knife or your fingers.",
      "content": "Spread the clay onto the form using a knife or your fingers. The paper clay will be spreadable, like icing, and you should be able to spread it directly onto the form for a smooth finish. Completely coat the form in clay, just as you would if you were using paper mache strips. If you prefer to use thicker clay and sculpt with your fingers, follow the instructions above for adding extra flour to create a thicker consistency. Use your fingers, a spoon, and any other tools you want to coat your sculpture form in paper clay. Let the first layer set. It will begin to harden into a tough outer coating upon which you can build using more paper clay."
    },
    {
      "title": "Add more layers.",
      "content": "Add more layers. Apply extra layers of clay in places where you want your sculpture to look thick. Keep building layers, letting them set, and adding more as needed. You can add as many or as few layers as you want to your sculpture form. The more you add, the heavier your sculpture will be."
    },
    {
      "title": "Create detail with your fingers and other tools.",
      "content": "Create detail with your fingers and other tools. For example, if you're sculpting a face, the paper clay will allow you to add intricate detail around the eyes, nose and mouth. Continue building the sculpture with your fingers and other sculpting tools until you're happy with the result."
    },
    {
      "title": "Let the clay completely dry before painting.",
      "content": "Let the clay completely dry before painting. After a day or two it will be as hard as a rock. Don't apply paint or varnish until it's completely dry. Paper clay works well with any type of paint or varnish you wish to use."
    },
    {
      "title": "Store leftover clay in an airtight container.",
      "content": "Store leftover clay in an airtight container. This will prevent it from drying out between uses. If kept in an airtight container, the clay will keep for several weeks."
    }
  ]
}