{
  "url": "https://www.wikihow.com/Recycle-Nespresso-Pods",
  "title": "A Simple Guide to Recycling Nespresso Pods",
  "steps": [
    {
      "title": "Order a free Nespresso recycling bag with your next pod shipment.",
      "content": "Order a free Nespresso recycling bag with your next pod shipment. Nespresso offers free recycling bags for collecting your used pods. You can add 1 to 2 bags to your order each time you buy new coffee pods online. [1] X Research source All Nespresso boutiques and many partner stores have recycling bags available for free. You cannot get them from a big-box retailer, though. If you live in New York City , simply place your used pods in your blue recycling bin. You do not have to put your pods in bags or take them anywhere for them to be recycled. [2] X Research source"
    },
    {
      "title": "Fill your bag with used pods and close it when it’s full.",
      "content": "Fill your bag with used pods and close it when it’s full. Keep the bag near your Nespresso machine and toss the used pods in every time you make coffee. The bag can hold 200 original-sized capsules or 100 VertuoLine capsules. Once it’s filled, seal it at the top by pressing the plastic tabs together and folding it over at the top. [3] X Research source There is only one size of recycling bag. You can include the aluminum tabs that peel off the top of the pods. Do not overfill your bag, or it may not be accepted for recycling."
    },
    {
      "title": "Drop your bag in the container or with an employee at a collection point.",
      "content": "Drop your bag in the container or with an employee at a collection point. Use Nespresso’s recycling map to locate a nearby collection point. Some of the collection points are public bins that are sitting out in the lobby or entryway of a store, while others are held behind a customer service desk. Simply place your recycling bag in the container or leave it with a customer service clerk. [4] X Research source A lot of collection points are in or near Nespresso retailers. This makes it easy to drop them off the next time you pick up some pods. Use the collection point search engine in the Nespresso app for Android or iOS to find a nearby location, too. The collection points are periodically collected by a Nespresso pickup service and taken to a special plant to be recycled."
    },
    {
      "title": "Find a nearby Nespresso store and hand your bag to an employee.",
      "content": "Find a nearby Nespresso store and hand your bag to an employee. Take your recycling bag of used pods to any Nespresso boutique and some other stores Nespresso partners with, like William Sonoma or Sur La Table. Simply use Nespresso’s store locator map to find a nearby store. Let the clerk behind the counter know that you have Nespresso pods to recycle and they will take them from you. [5] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source The boutique drop-off service is different from the collection point program. The collection point program requires you to place the pods in a Nespresso recycling bag. Some boutiques might require the recycling bag, while others don’t. Note : Nespresso shops and partner stores typically have free bags on hand to put your pods in if you didn’t collect them in a recycling bag. After collecting your used pods, the store ships them to Nespresso for recycling. There is no charge for this service."
    },
    {
      "title": "Bring your bag of used pods to a UPS drop-off location.",
      "content": "Bring your bag of used pods to a UPS drop-off location. Nespresso partners with UPS stores to ship used pods to their recycling centers; the recycling bags you order include a prepaid shipping label. Simply find a nearby UPS store using UPS’ store locator map . Then, place the bag in the UPS drop box, or hand it to a staff member inside the store. [6] X Research source If you live in Alaska, Hawaii, or Puerto Rico , the UPS recycling program is not available to you at this time. Use another method to recycle your pods. [7] X Research source"
    },
    {
      "title": "Give your recycling bag to the driver when they bring your order.",
      "content": "Give your recycling bag to the driver when they bring your order. When the delivery driver arrives with your Nespresso order, tell them that you have a recycling bag filled with used pods. The delivery driver will take your bag and bring it back to the shipment center on their truck. [8] X Research source There is no additional charge for giving your delivery driver a recycling bag to take back with them. Keep ordering recycling bags every time you buy new pods. This makes it easy to continue the recycling pickup process when your coffee gets delivered."
    },
    {
      "title": "Cut off the cap and wash the pod with soap and water.",
      "content": "Cut off the cap and wash the pod with soap and water. Use a knife or box cutter to carefully cut the aluminum foil cap off the pod. Then, gently tap the pod over your garbage can or compost bin to remove most of the coffee grounds. Clean out any leftover residue with dish soap and warm water. [9] X Research source Dry your pod with a paper towel or cloth. Reuse your pods about 2 to 3 times. After 2 to 3 uses, reused pods typically lose their shape and won’t work in your machine. Warning: Do not harshly scrub the outside of the pods, as this can damage the barcode underneath the lip of the pod. Nespresso machines work by reading the barcode on the pod."
    },
    {
      "title": "Use scissors to cut a circular cover out of aluminum foil.",
      "content": "Use scissors to cut a circular cover out of aluminum foil. Pull out a short length of aluminum foil. Then, place it over your pod and cut out a circle that fits over the pod. Just leave an extra 1–3 inches (2.5–7.6 cm) of aluminum foil hanging on each side of your pod. [10] X Research source If it’s easier for you, cut out a square of aluminum foil and trim off the edges to make it a circle. Alternatively, use pre-cut aluminum foil lids . These are made to fit Nespresso pods and have an adhesive edge that you simply stick on the pod."
    },
    {
      "title": "Fill your pod with coffee grounds, leaving 1 mm of space at the top.",
      "content": "Fill your pod with coffee grounds, leaving 1 mm of space at the top. Use a spoon to fill your pod with grounds so they’re about level with the top of the pod. Pat the grounds down with your thumb or spoon to compact them and increase the flavor of your espresso. [11] X Research source Leave a small amount of space on top so the aluminum foil can be compacted into your coffee when it brews. If you leave too much space at the top, the aluminum foil may be pushed into the cup, sending grounds all over your Nespresso machine. Don’t compact the grounds if you don’t want a strong cup of coffee."
    },
    {
      "title": "Place the foil over your pod and wrap it under the lip.",
      "content": "Place the foil over your pod and wrap it under the lip. Center the aluminum foil over the top of your pod so a little bit sticks out past each side. Use your non-dominant hand to keep the foil in place as you use your other hand to wrap the foil under the lip. Then, pinch the foil against the underside of the brim to smooth it down and fix it permanently in place. [12] X Research source"
    },
    {
      "title": "Use your refilled pod the same way that you would use a normal pod.",
      "content": "Use your refilled pod the same way that you would use a normal pod. Place your pod in your Nespresso machine and press the start button. The refilled pod functions the same way that a standard Nespresso pod does. When your coffee is done brewing, refill the pod again or place it in a Nespresso bag for recycling. [13] X Research source If your aluminum foil falls off during the brewing process, use a wet paper towel or cloth to clean the inside of your machine."
    }
  ]
}