{
  "url": "https://www.wikihow.com/Get-a-Cashier%27s-Check",
  "title": "The Complete Guide to Purchasing a Cashier’s Check",
  "steps": [
    {
      "title": "Know the “payee”, the name of the person you will give the check to.",
      "content": "Know the “payee”, the name of the person you will give the check to. You cannot get a blank cashier's check. You must have a payee. A cashier's check has the payee information completed on the check itself. Unlike a money order, on a cashier's check you can't write in the payee information yourself. It may be useful to take the payee to the bank with you, so that you have all the information you need. On the check itself, be sure to give the first and last name of the payee as it appears on their identification. If you are not sure of this information, ask the payee. If your cashier's check is getting used to pay an organization and not an individual, be sure to find out how to complete the payee information according to the organization's guidelines. Cashier's checks are a better option than a money order for larger payments, because money orders often have maximum limits, but there will be no maximum limit on a cashier's check amount. Find a large bank that issues cashier's checks to the general public, and bring cash funds, if you do not have a bank account."
    },
    {
      "title": "Determine the exact amount needed.",
      "content": "Determine the exact amount needed. You need to know the exact amount before you get the check. In many cases, the amount is printed on to the check when you receive it from the bank teller. But in any case, the amount will be filled in by the cashier, so you will have to tell him exactly how much to put on it. The cashier will sign the check after verifying you have the funds in your account (or with you) to cover the amount of the check. [2] X Research source Bring any documents that show how much you need the check to be written out for, to ensure you have this information with you when purchasing the check."
    },
    {
      "title": "Be ready with your identification.",
      "content": "Be ready with your identification. The bank you purchase your cashier's check from will require you to show identification. Banks guarantee a cashier's check with their own funds. For this reason, they will ask to verify your identity, access your account, and ensure you have the money necessary to cover the check amount. It may be beneficial to bring multiple forms of ID, particularly if you need a cashier's check for a large amount."
    },
    {
      "title": "Prepare the necessary funds.",
      "content": "Prepare the necessary funds. Deposit enough money into your account to cover the amount of the cashier's check. If you are purchasing the check from a bank where you don't have an account, bring the amount in cash. You will have to pay a small fee to pay for the service the bank provides. [3] X Research source If you are a customer of the bank where you purchase the cashier's check, you may receive a discounted price for the service. If you are not a customer of the bank where you purchase the check, you may have to pay a higher fee (typically some percentage of the check amount). Banks are not required to issue these checks to the general public. Some upper-level bank accounts may qualify for free cashier's check service."
    },
    {
      "title": "Visit your chosen bank to purchase the check.",
      "content": "Visit your chosen bank to purchase the check. Any bank can issue a cashier's check, but the best option for you will be the cheapest option. Check with your bank to find out if you qualify for any special pricing or fee waivers. Compare prices between different banks to get the best deal. The top ten banks in the United States have an average cashier's check fee of $9.10."
    },
    {
      "title": "Give a bank teller all the information you have prepared, and allow him to print the check for you.",
      "content": "Give a bank teller all the information you have prepared, and allow him to print the check for you. A bank teller will prepare a cashier's check for you on the spot—you do not need an appointment. You will, however, have to meet face-to-face with a teller to get the check. The teller may have to sign the check for you, he may use a stamp, or another method of verification."
    },
    {
      "title": "Pay for the check.",
      "content": "Pay for the check. The amount of the check you are purchasing plus the bank's fee will be debited from the account into which you deposited the funds. [4] X Research source If you are not a customer at the bank where you purchase the check, present your cash for the check's amount plus the bank's fee. Find out fee costs ahead of time to ensure you have the cash to cover the full amount."
    },
    {
      "title": "Get a receipt for your cashier's check.",
      "content": "Get a receipt for your cashier's check. Make sure to get a receipt in case you lose or damage the check; unlike a personal check, you can't simply tear it up and write a new one. The receipt will have the check number and date, allowing you to contact the bank in case you should lose the check for any reason. Be sure to keep your receipt in a safe place at least until the check has cleared."
    },
    {
      "title": "Track your check.",
      "content": "Track your check. The bank has sophisticated ways of tracking your check, to be able to tell whether the check has been cashed or not. Databases can be searched for the check number, and, if it is not found, this tells the bank that the check has not yet cleared. Simply present your receipt at the bank for an update about whether your check has been cashed by the payee. If the check never reaches its destination for any reason, the bank can cancel the original check and resend payment. Check with the payee periodically in addition to the bank to see if the check has reached its destination."
    },
    {
      "title": "Get proof of the cashed check.",
      "content": "Get proof of the cashed check. You can get proof of the check's having been cashed with a copy of the front and back of the check from the bank. A fee may be required for this service. In the event that the person who cashed the check is not the payee, the bank can get the money back and initiate criminal proceedings against the person who cashed the check illegally. Lots of fraud is committed via cashier's checks, so keep a close eye on your cashier's check to be sure it has reached its destination using the tracking tools the bank has at its disposal. [5] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source"
    }
  ]
}