{
  "url": "https://www.wikihow.com/Draw-a-Grid",
  "title": "How to Draw a Grid",
  "steps": [
    {
      "title": "Before making your grid, you should consider what the grid is being used for.",
      "content": "Before making your grid, you should consider what the grid is being used for. You may want cells that are square or rectangular. You may want cells that are uniform in size or variable in size. That all depends on how you want your grid to look. This example will use square, uniform cells. You can alter this method to be used in any type of grid you want to make."
    },
    {
      "title": "For example, you might want each square to measure 1 by 1 in (2.5 by 2.5 cm).",
      "content": "For example, you might want each square to measure 1 by 1 in (2.5 by 2.5 cm). Record these measurements, as they will be the basis for your markings. Do your homework on the measurements, and know the size of the paper you are working with. Ensure that the size of your squares divides evenly into the size of the paper, or you will have squares that won't fit evenly into it."
    },
    {
      "title": "Place your ruler flat on the paper (somewhere near the top).",
      "content": "Place your ruler flat on the paper (somewhere near the top). Line it up so that the first mark on your ruler lines up with the left edge of the paper. This will ensure that the marks you are making are straight and accurate."
    },
    {
      "title": "Place your drawing utensil at the left edge of the paper, where the first mark of your ruler is.",
      "content": "Place your drawing utensil at the left edge of the paper, where the first mark of your ruler is. Then, make dots at increments of however wide you decided on making the squares. If you wanted the squares to be 1 inch wide, make marks at increments of 1 inch until you reach the edge of your paper."
    },
    {
      "title": "Repeat the previous step at least 2 times on different positions up and down the left side of your paper.",
      "content": "Repeat the previous step at least 2 times on different positions up and down the left side of your paper. This way, you have multiple dots in a row at each given increment. These will be the basis for your lines."
    },
    {
      "title": "Rotate the paper by 90 degrees and repeat the point-making process.",
      "content": "Rotate the paper by 90 degrees and repeat the point-making process. Do this until you have successfully made both horizontal and vertical points."
    },
    {
      "title": "Line up the edge of the ruler with the dots you've made.",
      "content": "Line up the edge of the ruler with the dots you've made. Make sure all of the points lie on the ruler so that the line will be straight. Using your drawing utensil and the straight edge of your ruler, draw a line connecting your points."
    },
    {
      "title": "Repeat the necessary steps to make sure your grid is as accurate as possible.",
      "content": "Repeat the necessary steps to make sure your grid is as accurate as possible."
    }
  ]
}