{
  "url": "https://www.wikihow.com/Play-Sevens-(Card-Game)",
  "title": "How to Play Sevens (Card Game)",
  "steps": [
    {
      "title": "Deal out an entire deck of cards.",
      "content": "Deal out an entire deck of cards. Pick one person to be the dealer and have them hand out a deck of 52 playing cards, face-down and one at a time, to each person going clockwise. This game can be played with anywhere from three to eight people. [1] X Research source Depending on the number of players, the cards may be dealt unequally. To solve this, switch dealers each round so that everyone has a round with the lowest or highest amount of cards. As long as the dealer switches clockwise and each dealer hands out cards going clockwise, the pattern will repeat fairly."
    },
    {
      "title": "Arrange your hand in order of suit and numerical order.",
      "content": "Arrange your hand in order of suit and numerical order. To help keep yourself focused , organize the hand dealt to you. You want to arrange the cards first by suit, and then in numerical order. It’s best to start with any twos on the far left and run them up to the ace on the far right. A whole run will look like this: 2 ♥ - 3 ♥ - 4 ♥ - 5 ♥ - 6 ♥ - 7 ♥ - 8 ♥ - 9 ♥ - 10 ♥ - J ♥ - Q ♥ - K ♥ - A ♥ . [2] X Research source The four suits are hearts, diamonds, spades, and clubs. Alternating the colors of the suits in your hand will also make it easier to find cards to play with."
    },
    {
      "title": "Start each round with the 7♦ .",
      "content": "Start each round with the 7 ♦ . Whoever has the 7 ♦ lays them down on the table. When a seven of any suit is played it starts a \"layout.\" A layout is made by laying cards down one by one next to the seven in sequential order. You will have four layouts total, one for each suit. As the game continues, the only way a suit layout can be started on the table is if someone plays a seven. Some variations of this game select the person to the left of the dealer to go first, regardless of who has the 7 ♦ ."
    },
    {
      "title": "Organize the layouts on the table.",
      "content": "Organize the layouts on the table. Layouts go horizontally on the table. You can create a grid of 4x13 cards if you put each suit going sideways above one another. Or instead, you can start stacking the rest of the sequence of a suit on top of the 6 and 8 cards to save space. If you lay the cards vertically within their suits, the game will resemble the solitaire setup."
    },
    {
      "title": "Place one card down at a time.",
      "content": "Place one card down at a time. Each person puts down one card on their turn, but it has to be the next card in relation to the ones already on the table. For example, the next cards played after a seven will either be the six or the eight in that suit. Going in order from the seven means you will play cards that descend to the two-card of that suit on the left-hand side of the seven and on the right-hand side, the card values will ascend to the ace. [3] X Research source For example, if you have a 10 ♥ on the table, you can only put cards of the same suit together. If a 7 ♥ is on the table, you can only play a 6 ♥ next to it, not a 6 ♠ . [4] X Research source"
    },
    {
      "title": "”Knock” when you cannot play any cards.",
      "content": "”Knock” when you cannot play any cards. Knocking the table is one way to say that you are passing on your turn. Or instead, you can just say “pass.” You may pass when you don’t have any cards that are playable. For instance, if there are only fives through nines on the table and all you have left are twos and face cards. [5] X Research source It is against the rules to pass on a turn if you have a card that can be played anywhere on the table. If playing with poker chips , one penalty you can use is that if someone passes when they had cards to play, they have to put three chips in the pot."
    },
    {
      "title": "Continue playing until someone runs out of cards.",
      "content": "Continue playing until someone runs out of cards. Go around the table, each putting one card down until someone plays their last card. They are the winner of that round, and if you’re only playing one round then they are the winner of the game. Collect all 52 of the cards and start a new round or game. You can play several rounds within one game to play longer or just play a quick game while killing time. You have several options for choosing the next dealer. One option is that the person to the left of the original dealer is now the new dealer. The other option is to have the winner deal the cards, or the person to the left of them. All that matters is that each person gets a chance to become the card dealer."
    },
    {
      "title": "Hold on to your sevens, sixes, and eights as long as possible.",
      "content": "Hold on to your sevens, sixes, and eights as long as possible. If you decide not to play these cards, it will keep other players from being able to get rid of their own cards. No one can play their low or high cards out of sequence so you have the power to stall the game and increase your chances of winning. [6] X Research source Of course, if these numbers are your only playable cards, you can’t pass but have to play them."
    },
    {
      "title": "Use poker chips to raise the stakes.",
      "content": "Use poker chips to raise the stakes. When the game starts, each player puts a chip into the pot. The people with the least amount of cards in their hand put an extra chip in the pot to even the playing field. [7] X Research source Every time someone passes, they have to add a chip to the pot. The winner of the round or game gets the whole pot. Use tokens, pennies, or even candy instead of chips. You can attribute money to the chips for real gambling or not, if you choose."
    },
    {
      "title": "Allow people to play more than one card.",
      "content": "Allow people to play more than one card. To speed up the game, scrap the rule that says you can only lay down one card at a time. For example, if you have 4 ♠ , 3 ♠ , and 2 ♠ , you would be allowed to lay down all three as a run. This variation only applies to one suit at a time. You can’t lay down an 8 ♥ , 9 ♥ , and 10 ♦ . Even if you have numerical ordering, the cards have to be in the same suit to lay them down as a run in one turn."
    },
    {
      "title": "Keep track of how many cards you have left for scoring.",
      "content": "Keep track of how many cards you have left for scoring. After someone gets rid of their cards, use a piece of paper or notebook to log how many cards each player has left. Each card equals 1 point. Start a new round, and keep track at the end of each. Once someone reaches 100 points, the game is then over and the winner is whoever has the smallest score. [8] X Research source For shorter games, only go to 50 or 25 points, depending on how much time you have."
    },
    {
      "title": "Use the Ace as the lowest card instead of a two.",
      "content": "Use the Ace as the lowest card instead of a two. Some people order the cards starting with the ace, and going up from the two to the king as the highest card. This will only slightly change the order of the layout. On the left side of the two, you will lay out cards to the two instead of the ace, and on the right side the run will end at the king. [9] X Research source"
    }
  ]
}