{
  "url": "https://www.wikihow.com/Lilith-in-Capricorn",
  "title": "Lilith in Capricorn 101",
  "steps": [
    {
      "title": "You resist authority and rebel against structure.",
      "content": "You resist authority and rebel against structure. You don’t see much point in coloring in the lines—and the more people try to get you to, the more you resist. Though you roll your eyes at authority figures and can’t seem to adhere to a regular schedule if your life depended on it, you work hard and you know what’s important. In fact, while your resistance to authority may make you a bit of a troublemaker at times, it’s often because of your reluctance to follow preestablished rules without question that you can accomplish as much as you do. However, you may also struggle with a fear of failure and an anxiety around “making it” in the world. While this anxiety helps to motivate you sometimes, it’s important to go easy on yourself and relinquish preconceived notions of “success.” [1] X Research source Your ability to follow the beat of your own drum makes you passionate, creative, and innovative. However, your fierce independence may lead to difficulty in interpersonal relationships, as ceding control is essential for fostering trust."
    },
    {
      "title": "Resistant to authority",
      "content": "Resistant to authority Capricorn is the sign of authority and rules. Since your Lilith represents the shadow side of whatever sign it’s in, being a Cap Lilith means blindly following the rules makes you crawl out of your skin. You turn your nose up at laws and regulation, preferring to do things your own way. As you see it, rules are for being broken—and you break them. While some people thrive under rules, you can’t help but see the downsides to them: how much injustice has spawned from rigid structure? How often has abiding by rules dampened creativity and discouraged people from asking important questions?"
    },
    {
      "title": "Responsible",
      "content": "Responsible Though you rebel at every chance, you’re still a dedicated worker who sticks by what you believe in. You get your work done, and you’re always looking out for others as well as for yourself—since you don’t believe in hierarchies, you firmly believe everyone is entitled to the same care and respect, and you work hard to make sure they get it. [2] X Research source Your resistance to authority and hierarchies isn’t necessarily shared by everyone around you, and in many cases, you’re thrust to the top of the pecking order simply because you refuse to be a follower. As a Cap Lilith, you may have even been forced to be the “parent” in your family from an early age, and that urge to take the lead or oversee others’ safety and happiness likely followed you into adulthood. It’s not a bad trait to have, looking out for others, but remember that you can’t control everything—and you don’t have to. Practice relaxing and letting people take care of themselves once in a while."
    },
    {
      "title": "Fiercely independent",
      "content": "Fiercely independent Capricorn is ruled by Saturn, the sign of quick judgments and forward thinking. As a Cap Lilith, your urge to break rules and take on extra responsibility usually leads you to be a loner. If others don’t understand or approve of your methods, well, then, you’ll go off on your own—usually, with good results. As you see it, rules, red tape, and bureaucracy do nothing but get in the way of progress. You’re better off without them. Your independence and willingness to break rules and make mistakes leads you to be extra creative and innovative. Problems others simply abandon, you solve with ease. While others may say, “If it ain’t broke, don’t fix it,” you’re always focused on how to make things better, whether they’re broken or not."
    },
    {
      "title": "Hardworking",
      "content": "Hardworking While some people equate not following rules with being “difficult” or even “lazy,” you’re anything but. You just have a clear vision of how things should be done, regardless of what others tell you, and you do it your way. You hold tightly to your values and you work hard in the service of those values. Your sense of responsibility and dedication may also speak to a fear of failure. Practice letting go of your preconceived notions of “success” and ask yourself if what you’re working so hard for is worth it. [3] X Research source When you’re forced to work for something you don’t believe in, it can be a slog. It’s important for you to get a job in a field you’re passionate about, where you feel you can really make a difference; anything less, and you’re likely to get frustrated or depressed, or quit."
    },
    {
      "title": "Cap Liliths may struggle to let others in.",
      "content": "Cap Liliths may struggle to let others in. You’re always looking out for the people around you, but who’s looking out for you? Your independence is a gift most of the time, but it can also hold you back when it comes to interpersonal relationships, including romance. Part of being in a relationship is being known, and part of being known is letting your guard down, which you may struggle to do. Remember that in a healthy relationship, being vulnerable doesn’t mean giving someone control over you, but it does mean giving up some control to the universe. It’s terrifying, especially if you’ve grown up believing you can’t let your guard down, but it’s worth it, we promise."
    },
    {
      "title": "Capricorn Liliths thrive in loosely structured careers they believe in.",
      "content": "Capricorn Liliths thrive in loosely structured careers they believe in. You don’t abide rigid structures: you see them as obstacles to success more than tools to help you thrive. All you need to succeed is motivation, and thanks to Capricorn’s influence, you’ve got that in spades. It can be tricky to land a job that lets you do what you want, when you want, but if you can find that unicorn, you’re sure to thrive in it. A loosely structured job could mean a remote position, but being too distant from others may not jive with your need to look out for people, so consider opting for a role that allows for plenty of opportunities for in-person work, or volunteer in person on the side. You may find success working a number of freelance positions where you can do what you want and set your own schedule. Making a living off freelance is hard work, but you’re no stranger to that—and you get to be your own boss, a major plus."
    },
    {
      "title": "Your Lilith is the farthest point in the moon’s orbit when you’re born.",
      "content": "Your Lilith is the farthest point in the moon’s orbit when you’re born. While most other placements in your chart refer to the position of planets, your Lilith sign—also called your Dark Moon Lilith—refers to a point in space: the farthest point in the moon’s orbit around Earth. [4] X Research source This is also called the “lunar aphogee.” The term originates from the Jewish myth of Lilith and carries strong feminist aspects. Lilith was Adam’s first wife, before Eve, but she refused to serve Adam or God and reclaimed her independence."
    },
    {
      "title": "Your Lilith highlights taboo parts of your personality.",
      "content": "Your Lilith highlights taboo parts of your personality. Lilith, the mythical first woman, represents everything taboo and independent—and repressed. This placement reflects the parts of you that go against the grain, or that you’re reluctant to address. Often, but not always, Lilith signs are associated with trauma and personal healing. [5] X Research source Just as the mythical Lilith was repressed and fought to overcome the bonds placed upon her, eventually winning her sovereignty, your own Lilith placement asks you to reflect on the parts of you that you’re hiding or that society says are “bad,” and bring them to light. Want to figure out what your Lilith sign is? You can calculate your birth chart using free websites like Co-Star or Astro Charts ."
    }
  ]
}