{
  "url": "https://www.wikihow.com/Know-if-Someone-Screenshots-Your-Instagram-Story",
  "title": "Instagram Screenshot Notifications Explained: Does IG Notify When You Screenshot a Story?",
  "steps": [
    {
      "title": "When someone screenshots a disappearing DM, Instagram notifies the person that sent the message.",
      "content": "When someone screenshots a disappearing DM, Instagram notifies the person that sent the message. [1] X Research source Disappearing DM's are taken using the Instagram camera instead of your phone's camera (IG won't notify you of a screenshot if the picture you sent was uploaded from your camera roll). By default, this can only be viewed once, but you can change it to be viewed twice with \"Replay.\" However, you will not be notified if the other person screenshots a chat, including individual messages, conversation history, and posts sent back and forth. [2] X Research source"
    },
    {
      "title": "You will see a screenshot icon next to the message.",
      "content": "You will see a screenshot icon next to the message. It looks like a circle made up of lines pointing out like a starburst. It will be next to any kind of message in vanish mode: pictures and videos. If you go to your Direct Message inbox , you'll also see Screenshot next to the conversation where your disappearing message was screenshotted. [3] X Research source"
    },
    {
      "title": "Didn't Instagram used to notify for Story screenshots?",
      "content": "Didn't Instagram used to notify for Story screenshots? You used to get notifications if someone screenshotted your Story, but you don't anymore. Instead, you can view your Story and see who else viewed it ."
    },
    {
      "title": "Does Instagram notify when someone screenshots posts or reels?",
      "content": "Does Instagram notify when someone screenshots posts or reels? No. Instagram does not notify when someone screenshots posts, reels, or Stories. [4] X Research source If you have a professional account, you can use analytics to see who shared those ."
    },
    {
      "title": "Use Instagram in a web browser.",
      "content": "Use Instagram in a web browser. For now, Instagram does not notify when someone takes a screenshot from a web browser. That rule may change, so be careful."
    },
    {
      "title": "Put your phone in airplane mode.",
      "content": "Put your phone in airplane mode. If the internet signals are turned off in airplane mode on your Android or iPhone , your phone won't be able to send a signal that it screenshotted a disappearing DM."
    },
    {
      "title": "Use another camera.",
      "content": "Use another camera. Although the screenshot may not be the best quality, you can always use another camera to take a picture of the disappearing DM on your phone. If you do that, Instagram won't notify that you took a screenshot."
    }
  ]
}