{
  "url": "https://www.wikihow.com/Cut-a-Terracotta-Pot",
  "title": "How to Cut a Terracotta Pot",
  "steps": [
    {
      "title": "Use a rotary saw (such as Dremel) to cut a smaller pot.",
      "content": "Use a rotary saw (such as Dremel) to cut a smaller pot. It won’t cut through like butter, but it does the job! You’ll get the best results with the diamond cutting wheel attachment on your Dremel (or similar handheld rotary saw tool). Here are some tips to keep in mind: [1] X Research source Put on work gloves, eye protection, and a dust mask. Soak the pot in water for 20 minutes so it produces less dust. It’ll still be a dusty job, though, so work outside. Put the pot in a vise (securely, but without cracking it!) to stabilize it while cutting. Turn on the saw and lightly touch the spinning blade to the pot. Apply even pressure instead of trying to force the blade through the terracotta. Etch into and eventually through the material, then slowly move the blade along the cut line. Pour or squirt on more water every so often to keep the pot from overheating. Carefully sand down any jagged edges along the cut with an 80-grit sanding block."
    },
    {
      "title": "Opt for an angle grinder to cut a larger pot.",
      "content": "Opt for an angle grinder to cut a larger pot. The setup and cutting technique is pretty much identical to using a rotary saw, but an angle grinder is bigger and much more powerful! Be sure to put on your protective gear, soak the pot to cut down on the dust, etch through the terracotta with light pressure, and sand down jagged edges with a sanding block. [2] X Research source Unlike a rotary saw, which you can control with one hand, you’ll need to use both hands to keep an angle grinder steady. Secure the pot in a vise—without squeezing it too tightly—so you can keep both hands free to control the grinder. A diamond cutting wheel attachment works great, but a masonry blade also gets the job done. Angle grinders are loud, so it’s a good idea to put on ear protection as well."
    },
    {
      "title": "Use a hacksaw with a carbide blade as a slower but effective alternative.",
      "content": "Use a hacksaw with a carbide blade as a slower but effective alternative. If you have the time and stamina to cut the pot by hand, switch out your standard hacksaw blade for a carbide blade. This blade cuts with grit (more like sandpaper) rather than metal teeth. As when using power tools, soak the pot, put on safety gear, mark your cut, and put the pot in a vise for the best results. Cut with long, even, steady back-and-forth strokes, applying just enough pressure to etch away at the terracotta. [3] X Research source To replace a hacksaw blade, loosen the wingnut near the handle by turning it counterclockwise. Lift the old blade off of the 2 holding pins, then slide the new blade onto the pins. Twist clockwise to tighten the wingnut."
    },
    {
      "title": "Avoid using power saws or hand saws with toothed blades.",
      "content": "Avoid using power saws or hand saws with toothed blades. The bigger the teeth on the blade, the more likely they are to catch on the terracotta and either crack it or flake pieces off of it. Always opt for cutting tools that grind into the terracotta rather than rip into it. [4] X Research source Whether you’re using a rotary tool, angle grinder, or hand saw, choose a cutting attachment—such as a diamond or carbide blade—that’s designed to grind through materials like masonry or glass."
    },
    {
      "title": "Slowly work your rotary saw or angle grinder around the pot.",
      "content": "Slowly work your rotary saw or angle grinder around the pot. Whether you mark a cutting line to follow or decide to cut freehand, cut at least 1 in (2.5 cm) above the bottom of the pot to reduce the chance of cracking it. Etch a shallow channel into the terracotta with your saw or grinder, rotate the pot a little, continue etching the channel, and keep going around and around until you cut all the way through. [5] X Research source It’ll probably take 1-2 passes all the way around to cut through the terracotta with an angle grinder, and 2-3 passes with a rotary saw. Secure the pot in a vise to make a more precise cut, or lay it on its side on the ground if you’re less worried about precision."
    },
    {
      "title": "Yes—etch the cut line with your saw or grinder, then split it carefully.",
      "content": "Yes—etch the cut line with your saw or grinder, then split it carefully. Mark a cut line that divides the pot in half and secure the pot in a vise, side facing up. Etch along the cut line with your blade, using light, even pressure. Aim to cut about 1/2 to 2/3 of the way into the terracotta. The pot may split in two on its own as you finish etching it; if not, tap it very lightly along the cut line with a small rubber mallet or similar object. [6] X Research source If you cut completely through the terracotta with your rotary saw or angle grinder, the pot is more likely to crack and break apart. The cut won’t be completely clean, so watch for jagged edges."
    },
    {
      "title": "You can make engravings with a handheld engraver.",
      "content": "You can make engravings with a handheld engraver. Clean and soak the pot, then use stencils (or just draw by hand) to apply the design(s) you want to engrave. Put on your safety gear—gloves, eye protection, and dust mask—and turn on the handheld engraver. Use the pencil-like tip to etch out the design to the depth you prefer. Wipe the dust away with a clean cloth. [7] X Research source As with handheld rotary saws, Dremel is a well-known brand but not your only option. Consider putting the pot in a vise to hold it steady while you work."
    },
    {
      "title": "Use a handheld engraver to carve all the way through terracotta as well.",
      "content": "Use a handheld engraver to carve all the way through terracotta as well. The only real difference here is that you want to keep working the handheld engraver’s tip into the terracotta until it punches through. Once it has, use both the end and the side of the engraving tip to continue carving out your decoration. The high-speed engraver tip helps to smooth out some of the jagged edges, but you may need to use sandpaper when you’re done. [8] X Research source This is a great way to create a jack-o-lantern effect with your terracotta pots!"
    },
    {
      "title": "Drill carefully with a masonry bit and enlarge the hole with bigger bits.",
      "content": "Drill carefully with a masonry bit and enlarge the hole with bigger bits. Soak the pot in water for at least 20 minutes—or even overnight—to soften it a little and cut down on dust. Put masking tape in an X-shape over the spot you want to drill. Secure the smallest masonry bit you have into your power drill and slowly drill through the terracotta—push down on the drill just hard enough to keep the bit from skipping around. [9] X Research source Use your second-smallest masonry bit to make the hole bigger, if needed, and keep working your way through larger and larger bits until the hole is the size you need. Wear safety glasses and work gloves in case the pot shatters. Remember to let the spinning drill bit do the work—you’ll shatter the pot if you try to push the bit into the terracotta!"
    },
    {
      "title": "Use a scrap of wood and a hammer for a semi-controlled break.",
      "content": "Use a scrap of wood and a hammer for a semi-controlled break. Put on safety glasses, work gloves, boots, and long sleeves and pants to protect yourself from terracotta shards. Hold the scrap of wood—such as a piece of dimensional lumber—against the inner wall of the pot, in the area in which you want to create the break. Smack the outside of the pot—directly opposite of the wood scrap—firmly with your hammer. You’ll likely break off at least one larger shard of terracotta along with several smaller pieces. [10] X Research source Lay a towel over the pot for added protection against flying terracotta shards. You may wonder why in the world you’d want to break a pot on purpose, but there are numerous crafting ideas for broken pots—for instance, the increasingly-popular broken pot fairy garden! If you are looking to make a fairy garden, aim to break off one side of the pot while keeping the bottom intact."
    },
    {
      "title": "Fill the pot with its broken pieces, soil, plants, and fairy garden decor.",
      "content": "Fill the pot with its broken pieces, soil, plants, and fairy garden decor. Fill the broken pot about 1/4 of the way with soil, then arrange the larger and smaller potsherds (broken terracotta pieces) and add more soil to create a wall, sloped area, and winding staircase. Add a few miniature plants (like baby’s breath and blue curls) and a fairy-size house, castle, or whatever else you wish. [11] X Research source Shop online, at hobby shops, or even at aquarium retailers for fairy-size decor. Search for “broken pot fairy garden” online for inspiration. Some of the examples you’ll see are very impressive!"
    },
    {
      "title": "Don’t just throw out the broken terracotta shards—upcycle them!",
      "content": "Don’t just throw out the broken terracotta shards—upcycle them! If your pot is too smashed up to make a good fairy garden, look for other ways to use the pieces. For example, fill the bottom of your planter pots with terracotta shards to improve drainage. Or, lay the shards around the base of your plants to keep squirrels from digging holes. [12] X Research source Broken sections of the top rim make good plant labels—just write the name of each item you planted and press the shards into the soil. Just keep in mind that terracotta shards can be really sharp—so handle them with care!"
    }
  ]
}