{
  "url": "https://www.wikihow.com/If-a-Person%27s-Phone-Is-Dead-Will-It-Ring",
  "title": "Will a Phone Ring if It's Dead, Disconnected, or Has No Service?",
  "steps": [
    {
      "title": "No, a phone that is dead will not ring.",
      "content": "No, a phone that is dead will not ring. If a phone's battery has died completely and it won't turn on, the phone won't ring. The call will go straight to voicemail instead of even ringing. [1] X Research source Similarly, phones that are turned off will go straight to voicemail, even if the phone still has battery power left."
    },
    {
      "title": "No, a disconnected phone will not ring.",
      "content": "No, a disconnected phone will not ring. Whether the phone is disconnected due to being turned off, a dead battery, or not having an active service plan, it won't ring when called. When calling a disconnected number, it won't ring and will just go to voicemail. If you call a disconnected number, you may hear a voice message letting you know that the number is disconnected. If the phone is just off or dead, you will get the standard voicemail message for the person you're calling."
    },
    {
      "title": "No, a phone will not ring when it has no service.",
      "content": "No, a phone will not ring when it has no service. Similarly to when a phone is dead, turned off, or disconnected, you won't hear the line ring at all and the call will go straight to voicemail. If the person you're calling manages to get service or cell reception back while you're in the middle of calling, the call may end up going through, or the person you're calling may see that someone is leaving them a voicemail (if you choose to do so)."
    },
    {
      "title": "Leave a voicemail.",
      "content": "Leave a voicemail. If a phone is dead, turned off, disconnected, or not in a service area, they may or may not get a missed call notification. [2] X Research source To be safe, make sure you leave a voicemail to let the other person know you called, so they can return your call when they get access to their phone again."
    },
    {
      "title": "Get law enforcement involved.",
      "content": "Get law enforcement involved. If you're trying to call someone's phone that is missing, you may want to involve local law enforcement . Law enforcement officers have access to various tools that can try to locate devices based off of \"pings\" to nearby cellular towers, and that information isn't available to the general public. These pings may help locate the phone and its missing owner."
    }
  ]
}