{
  "url": "https://www.wikihow.com/Join-a-Yahoo!-Group",
  "title": "How to Join a Yahoo! Group",
  "steps": [
    {
      "title": "Create a Yahoo account.",
      "content": "Create a Yahoo account. In order to access Yahoo! Groups you will need a Yahoo account. [1] X Research source Create an account by going to www.Yahoo.com and clicking “Mail.” Follow the prompts to create a new account. [2] X Research source You will need to provide a username and password Choose a username that you do not mind having people see. Once you are in a group other people will see this name. You will use this username and password to log in to Yahoo! Groups."
    },
    {
      "title": "Remember to protect yourself.",
      "content": "Remember to protect yourself. Be Internet safe by following some simple guidelines. [3] X Research source You may want to make up a username (avoid using your real name for privacy). When creating a password, do not use your birthdate, Social Security number or consecutive numbers or letters (1234 or abcd). Do not share your password with anyone. If you write it down, keep it in a safe place."
    },
    {
      "title": "Login with an existing account.",
      "content": "Login with an existing account. If you already have a Yahoo email account, you do not have to create another for Yahoo! Groups. Log in to your Yahoo email account at https://login.yahoo.com/ . Click on \"Groups\" at the top of the screen to access Yahoo! Groups."
    },
    {
      "title": "Find a group by browsing.",
      "content": "Find a group by browsing. Select from the different categories listed on the Yahoo! Groups main page found at www.groups.yahoo.com. Categories include Business & Finance, Computers & Internet, Family & Home, Government & Politics, Hobbies & Crafts, Romance & Relationships, Schools & Education, and many more. Start looking for a group by clicking on any of these categories. Clicking on a group name will reveal a description of the group."
    },
    {
      "title": "Find a group by searching.",
      "content": "Find a group by searching. If you know the name of the group you want to join, you can search for it. Use the search box at the top of the Yahoo! Groups main page and type in the keyword(s) for the group you're looking for. Click the “Search Groups” button beside the search box to begin your search. You may need to try a few combinations of keywords until you find the correct group."
    },
    {
      "title": "Join a group that interests you.",
      "content": "Join a group that interests you. Once you have found a group, ask to join. On the group page, click the “Join Group” link. If the group is restricted, the group owner or administrator will need to approve your request before you can join the group. If the group is open, you will be automatically added to the group. Once you're in the group you can access the messages, photos, files, and everything else posted on the group."
    },
    {
      "title": "Share your membership information.",
      "content": "Share your membership information. Choose what to share with others in the group. Choose an alias (display name). The default alias will be your email address. Share your email address. Decide how often you would like to receive notifications from the group."
    },
    {
      "title": "Confirm your choices by typing the text that appears in the box.",
      "content": "Confirm your choices by typing the text that appears in the box. This helps to verify your identity. You can change how often the group emails you at any time. Go to the Edit Membership area of the group's homepage and click the edit icon next to the Subscription button. Change the display name (alias) by signing into your Yahoo mail. Click on \"Settings\" then \"Accounts\". Click \"Edit\" to the right of \"Yahoo Account\" and enter a new name under \"Sending Name.\" [4] X Research source"
    },
    {
      "title": "Receive emails from a group.",
      "content": "Receive emails from a group. You can receive emails from a group without joining. To subscribe, send a blank email to groupname-subscribe@yahoogroups.com. Replace “groupname” with the actual name of the group."
    },
    {
      "title": "Once you reply to the confirmation, you will start to receive emails from the group.",
      "content": "Once you reply to the confirmation, you will start to receive emails from the group. You will not have access to all the group's web features such as photos, files, polls and calendar. You can decide to join the group later by sending a request to join from the group's homepage."
    },
    {
      "title": "Post to the group via Conversations.",
      "content": "Post to the group via Conversations. The Conversations area is where most group activity happens. Click on “Conversations” on the group's homepage. Click on “New Topic,” enter a new message and click “Send.” Click on “Reply to this message” to post a reply to another member's message. You can add a link to video, for example a YouTube link."
    },
    {
      "title": "Send email to the group.",
      "content": "Send email to the group. You can email the group just as you would email anyone else. Use the email account that you have designated for Yahoo! Groups. This is most likely your Yahoo email account. Type groupname@yahoogroups.com into the \"To:\" field. Replace “groupname” with the actual name of the group. Write your message in the email body and click “Send.” You can add photos as attachments."
    },
    {
      "title": "Search previously posted items.",
      "content": "Search previously posted items. Find messages, files and photos that have been posted. While in the group, use the \"Search\" icon to find older postings. The \"Search\" icon looks like a magnifying glass inside a square box. The icon can be seen and used no matter where you are on the page. Once you click the \"Search\" icon, enter the term/name you want to find. Click \"Enter\" to see the search results."
    }
  ]
}