{
  "url": "https://www.wikihow.com/Do-Siren-Eyes",
  "title": "The Viral TikTok Sensation “Siren Eyes” & How to Get Them",
  "steps": [
    {
      "title": "Siren eyes are an elevated smokey eye look that elongates the eye shape.",
      "content": "Siren eyes are an elevated smokey eye look that elongates the eye shape. The makeup trend hit the world by storm in 2022, making appearances on TikTok, Instagram, and YouTube. The soft and dramatic look takes cat eyes to another level, with an outer corner upward flick and inner corner downward flick. The elongated almond shape and blurred edges have a mysterious and mythical allure, which is likely why the look is named after the alluring sea nymphs who lured sailors to their deaths with enchanting songs. Siren eyes work on all eye shapes, thanks to the illusion the brush strokes and eyeshadow create."
    },
    {
      "title": "Use brown eyeshadow to line the upper lash line.",
      "content": "Use brown eyeshadow to line the upper lash line. Add a small amount of matte brown eyeshadow to a small blending brush . Gently drag the brush along the upper lash line, focusing on the middle to the end of the eye and flicking out toward your temple. This will help elongate your eyes if you don’t naturally have almond-shaped eyes. [1] X Research source If the line isn’t perfect, no worries! This first step won’t make or break the look but will add dimension and a guiding point for your eyeliner later. Do this before or after doing the rest of your face makeup. Simply follow your regular makeup routine, and try this tutorial whenever you normally do your eye makeup. Pro tip: Before applying any eye makeup, start with an eye primer to ensure your makeup stays in place and doesn't crease."
    },
    {
      "title": "Apply liquid eyeliner to the upper lash line with an outward flick.",
      "content": "Apply liquid eyeliner to the upper lash line with an outward flick. Start at the middle of your lash line and work outwards. Drag the eyeliner applicator along your lash line, following the shadowed line you previously made. When you reach the end of your eye, flick the brush outward toward your temple to create a long, exaggerated wing. [2] X Research source Avoid following your upper lash line while making the wing like you would when doing a cat-eye makeup look , as this makes the wing perkier rather than elongated. Instead, get the perfect angle for siren eyes by following your bottom water line. Create a guide for the liner by holding the end of a makeup brush to your face. Line the end of the brush (the end without bristles) up with your bottom water line, pointing it toward your temple rather than your brow. Then, hold the brush steady and use it as a guide while applying the liner. Alternatively, place makeup tape on the outer corner of your eye to make a stencil. Stick a strip underneath your bottom lashes, angling the end outward. Then, add your eyeshadow and eyeliner along the tape, and peel it off when you’re done. If you have hooded eyes, try drawing the wing with eyeshadow on an angled brush first. This way, you can see how the wing will lay on your face before adding liquid liner. [3] X Research source You can use liquid or gel eyeliner. They're both good choices because of their creamy consistency, which offers a better smudging ability."
    },
    {
      "title": "Blend everything together with an eyeshadow brush.",
      "content": "Blend everything together with an eyeshadow brush. Take a fluffy brush and use gentle, circular motions to blend the eyeshadow and liquid eyeliner. Don’t be too rough. Aim to blur the lines rather than fuse them together. The beauty of this makeup look is the sultry, smokey look. [4] X Research source Follow the direction of the lines as you blend to keep the elongated, almond shape. Add a little more eyeshadow on your blending brush for an even smokier look. Don’t wait too long to blend the eyeliner and eyeshadow together. Once the eyeliner dries, it’ll be harder to blend. For a sharper look, clean up the area under the wing with a makeup remover (if you haven’t already done a full face of makeup) or concealer on an angled brush. For a softer look, skip adding liquid eyeliner altogether and use a darker shade of eyeshadow or pencil eyeliner instead."
    },
    {
      "title": "Use liquid eyeliner to line the inner corner of the eye.",
      "content": "Use liquid eyeliner to line the inner corner of the eye. Take the liquid eyeliner you used before to emphasize the almond shape you’re building. Trace the inner corner of your eye with the liner, and place a thin, downward point at your waterline. [5] X Research source For a subtler look, use a darker brown eyeshadow to deepen the bottom lash line and inner corner."
    },
    {
      "title": "Line your bottom lash line with brown eyeshadow.",
      "content": "Line your bottom lash line with brown eyeshadow. As you did in the first step, take an eyeshadow brush and drag a line of brown shadow under your eye. Try to keep this line as thin as possible. Then, connect the bottom lash line with the downwards point you made in your inner corner to create a reverse cat eye effect. [6] X Research source"
    },
    {
      "title": "Define the lashes with mascara.",
      "content": "Define the lashes with mascara. And that’s it! Now, all that’s left to do is accentuate your gorgeous eyes with 2 even coats of mascara on your top and bottom lashes. [7] X Research source For extra drama, apply false lashes for added volume. Feel free to curl your lashes before applying any mascara."
    },
    {
      "title": "Siren eyes elongate the eyes, while doe eyes widen them.",
      "content": "Siren eyes elongate the eyes, while doe eyes widen them. When you think of a doe or baby deer, chances are you think of wide eyes and a tiny face. Doe eyes are exactly that! This makeup trend rounds out the eye to give it a cutesy appearance, unlike siren eyes, which lengthen the eye for a sultry, sophisticated look. [8] X Research source Siren eyes use a long eyeliner wing and dramatic inner corner to condense and elongate the eyes. Doe eyes focus eyeliner on the upper lash line with a flicked-out wing and a white-lined waterline to make the eyes appear bigger and wider. [9] X Research source"
    }
  ]
}