{
  "url": "https://www.wikihow.com/Change-Xfinity-WiFi-Password",
  "title": "How to Change Xfinity WiFi Password",
  "steps": [
    {
      "title": "Open Xfinity My Account on your phone or tablet.",
      "content": "Open Xfinity My Account on your phone or tablet. It’s the white or gray icon with a blue chat bubble, the outline of a person, and the word ″Xfinity″ inside. You’ll usually find it on the home screen (iPhone/iPad) or in the app drawer (Android). [1] X Research source If you’re not already signed in to your account, sign in now."
    },
    {
      "title": "Open your Internet settings.",
      "content": "Open your Internet settings. The steps are slightly different for iOS and Android: [2] X Research source iPhone/iPad: Tap Internet at the bottom of the screen. Android: Tap the ≡ menu at the top-left corner of the screen, then tap Internet in the menu."
    },
    {
      "title": "Tap your wireless modem or router.",
      "content": "Tap your wireless modem or router. It’s under the ″Devices″ header."
    },
    {
      "title": "Tap Change WiFi settings.",
      "content": "Tap Change WiFi settings . It’s the first option in the menu. [3] X Research source"
    },
    {
      "title": "Type the new password into the second blank.",
      "content": "Type the new password into the second blank. Be mindful of capital and lowercase letters as passwords are case-sensitive."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . It’s the blue button at the bottom of the screen. The new password is now saved. You’ll see a message that says the gateway is being updated and that the process may take several moments. [4] X Research source"
    },
    {
      "title": "Tap Done.",
      "content": "Tap Done . It’s at the top-right corner of the screen."
    },
    {
      "title": "Wait a few moments and then reconnect to the WiFi network.",
      "content": "Wait a few moments and then reconnect to the WiFi network. Upon reconnecting, you’ll have to enter the new WiFi password. [5] X Research source Any computers, phones, tablets, and other devices that were previously connected to this access point will have to reconnect using the new password."
    },
    {
      "title": "Open Xfinity My Account on your phone or tablet.",
      "content": "Open Xfinity My Account on your phone or tablet. It’s the white or gray icon with a blue chat bubble, the outline of a person, and the word ″Xfinity″ inside. You’ll usually find it on the home screen (iPhone/iPad) or in the app drawer (Android). If you’re not already signed in to your account, sign in now. Use this method to change the password you use to access Xfinity WiFi hotspots when you’re away from home. This will also change the password you use to sign into your account."
    },
    {
      "title": "Tap the profile title.",
      "content": "Tap the profile title. This is where you’ll usually see your name and Xfinity username."
    },
    {
      "title": "Tap Change Password.",
      "content": "Tap Change Password . It’s the first option in the menu. [6] X Research source"
    },
    {
      "title": "Enter your current password into the first blank.",
      "content": "Enter your current password into the first blank. This is the password you use to sign into Xfinity hotspots when you’re on the go, as well as the password you use to sign into your Xfinity account/the mobile app."
    },
    {
      "title": "Enter and confirm a new password.",
      "content": "Enter and confirm a new password. Type the password exactly the same into both blanks. Passwords are case-sensitive and can be 8 to 16 characters in length."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . Your password is now reset. If you were signed into an Xfinity hotspot, you’ll need to sign back in using the new password. [7] X Research source If the password doesn’t meet the minimum requirements, you’ll be prompted to select a new password."
    },
    {
      "title": "Go to http://www.xfinity.com/myaccount in a web browser.",
      "content": "Go to http://www.xfinity.com/myaccount in a web browser. You can reset your WiFi access point password using any web browser on your computer, including Safari, Edge, and Chrome. [8] X Research source If you’re not already signed in to your Xfinity account, follow the on-screen instructions to sign in now."
    },
    {
      "title": "Click Settings.",
      "content": "Click Settings . It’s in the menu bar at the top of the page."
    },
    {
      "title": "Click Internet.",
      "content": "Click Internet . It’s under the ″Xfinity Services″ header in the second group of settings. [9] X Research source"
    },
    {
      "title": "Click WiFi credentials.",
      "content": "Click WiFi credentials . It’s next to ″Service Details.″"
    },
    {
      "title": "Click Edit next to ″WiFi Password.",
      "content": "Click Edit next to ″WiFi Password. ″ It’s the second ″Edit″ on the screen. [10] X Research source"
    },
    {
      "title": "Type the new password into the second blank.",
      "content": "Type the new password into the second blank. Be mindful of capital and lowercase letters as passwords are case-sensitive."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . This resets the password for your Xfinity WiFi access point. It may take a few moments for the settings to update. [11] X Research source"
    },
    {
      "title": "Wait a few moments and then reconnect to the WiFi network.",
      "content": "Wait a few moments and then reconnect to the WiFi network. Upon reconnecting, you’ll have to enter the new WiFi password. Any computers, phones, tablets, and other devices that were previously connected to this access point will have to reconnect using the new password."
    }
  ]
}