{
  "url": "https://www.wikihow.com/Save-a-Cat-Attacked-by-Dogs",
  "title": "How to Save a Cat Attacked by Dogs",
  "steps": [
    {
      "title": "Separate the dog from the cat.",
      "content": "Separate the dog from the cat. If you see the cat being attacked by the dog, you must act quickly to break up the fight. Keep your own safety in mind as you do this—the dog may end up injuring you, too. If you have a leash (or are near your home where you can run quickly and get one), approach the dog quietly and wrap the leash around his back end. Aim for an area close to his hips. Thread the free end of the leash through the leash's handle and pull back forcefully to make the leash taut around the dog's body. Back the dog away from the cat and tie the leash to the nearest sturdy structure, such as a telephone pole. Be mindful that the dog will still be in 'fight' mode. If you are uncomfortable breaking up the fight on your own, find someone nearby who can assist you. Check the dog's collar for an ID tag. If you see the owner's information, contact the owner to come get the dog. If you don't see identification, call your local animal control."
    },
    {
      "title": "Approach the cat with caution.",
      "content": "Approach the cat with caution. An injured cat is likely to lash out due to intense pain. In addition, she is probably extremely frightened. Approaching her carefully may lessen the likelihood of her biting or scratching you. [1] X Research source Keep calm as you approach the cat. [2] X Research source The cat is frightened enough from the attack. If you seem anxious or fearful, she may notice those feelings and become even more frightened. Talking to the cat in a low and soothing voice may help her see you as non-threatening."
    },
    {
      "title": "Call your veterinarian.",
      "content": "Call your veterinarian. Once you are able to approach the cat and get a general idea of her injuries, call your veterinarian. When you call, provide as many details about the situation, [3] X Research source such as the location of the attack, a physical description of the dog, and visible injuries on the cat. Be aware that the cat may have suffered internal injuries that would not be readily apparent. Calling the veterinarian will give the veterinary team a good idea of the cat's injuries, allowing them to prepare for your arrival accordingly. [4] X Research source The veterinary team can also give you instruction on giving the cat first aid and transporting her safely to the veterinary hospital. [5] X Research source"
    },
    {
      "title": "Keep the cat calm.",
      "content": "Keep the cat calm. The cat has just been in full-on 'fight or flight mode.' With her injuries, she should stay as calm as possible to avoid making her injuries worse. One way to calm her down is to muzzle her. Muzzling a cat can be challenging, though, and you may not have a cat muzzle on hand. [6] X Research source You can create a makeshift muzzle by looping a piece of rope or pair of pantyhose around the cat's head. Closing her mouth with the muzzle will keep her from biting you. [7] X Research source Do not attempt to muzzle her if she is having trouble breathing or has injuries to her mouth. The muzzle could increase her suffering rather than calm her down. If putting a muzzle on the cat is not feasible, drape a towel over her head. This will block her view and awareness of the outside world. Not seeing or hearing disturbing activity could help calm the cat's nerves and prevent her from reacting aggressively. [8] X Research source If the cat does not have bone or spinal injuries, you can wrap her in a towel or a bag. Leave her head exposed and give her room to breathe. [9] X Research source A cat with bone or spinal injuries must lie flat on a firm surface, such as a sturdy board. Take care to keep her head and neck still. [10] X Research source Wrapping rope or cords around her body and the board will minimize her movement."
    },
    {
      "title": "Keep the cat warm.",
      "content": "Keep the cat warm. The cat may be in a state of shock after the attack. Keeping her warm is one of the best things you can do to keep her comfortable until you reach the veterinary hospital. Gently wrap the cat in some towels or a thick blanket. [11] X Research source"
    },
    {
      "title": "Breathe for the cat.",
      "content": "Breathe for the cat. If the cat is having trouble breathing, you will probably need to perform mouth-to-nose resuscitation before transporting her to the veterinary hospital. Attempt this only if the cat is not lashing out at you. To begin, gently pull her tongue out of her mouth and position her head and neck so they are in a straight line. [12] X Research source Reach in her mouth and clear out any debris or saliva that may obstruct airflow to her lungs. [13] X Research source Put your hand over the cat's muzzle, close her mouth, and breathe into her nostrils. Watch for the rise and fall of her chest to indicate air going into her lungs. [14] X Research source Give about 20 breaths per minute. [15] X Research source If she is not breathing, reposition her neck and try again. [16] X Research source If she does not start breathing on her own after multiple attempts, take her immediately to the veterinary hospital. Use extreme caution if she has a spinal injury."
    },
    {
      "title": "Control the bleeding.",
      "content": "Control the bleeding. The cat probably has some bleeding wounds following the attack. Your job is to make an initial attempt to stop the bleeding before taking the cat to the veterinary hospital. First, use your fingers or palm of your hands to press down on the wound, then wrap a piece of fabric (e.g., wash cloth, hand towel) or gauze around the bleeding area. [17] X Research source Wrap the bandage firmly, but not tightly. Wrapping the bandage too tightly would cut off blood circulation. [18] X Research source If the bleeding does not stop, place additional bandage material on top of what is already there and continue applying pressure. Do not take off the original bandage material. [19] X Research source Do not prolong your first aid if you cannot control the bleeding. Bleeding wounds often require medical or surgical treatment. [20] X Research source Do not delay treatment with your efforts to stop the bleeding completely on your own."
    },
    {
      "title": "Tend to the cat's fractures.",
      "content": "Tend to the cat's fractures. Fractures are either open (bone has gone through the skin) or closed (skin remains intact). If you see an open fracture, cover it with a clean cloth to prevent debris from entering it and possibly causing an infection. [21] X Research source Do not try to fix the fixture yourself! Not only would you make the injury worse, but the cat would likely bite you. [22] X Research source"
    },
    {
      "title": "Minimize the cat's movement.",
      "content": "Minimize the cat's movement. Transporting the cat safely to the veterinary hospital requires that you minimize the motion of her head, neck, and spine. [23] X Research source Any sudden movement of these body parts could make her injuries much worse. If the cat has a fracture, do you best to provide extra support and stabilization to that injured area. [24] X Research source Placing the cat in a large box can also restrict her movement. Cut several holes in the box so you can see her. [25] X Research source Place the box in the front passenger seat, or on the floor in front of that seat, to keep an eye on her."
    },
    {
      "title": "Drive carefully.",
      "content": "Drive carefully. Although you should get the cat to a veterinary hospital as soon as possible, you will need to drive carefully. [26] X Research source This is not the time to use your lead foot or throw on the brakes! Erratic driving would increase the cat's fear and bewilderment, and possibly make her injuries even worse."
    },
    {
      "title": "Allow the veterinary team to do its job.",
      "content": "Allow the veterinary team to do its job. Depending on the severity of the cat's injuries, the veterinary team may need to perform extensive care to save her. After giving the team a brief history of the attack, let them go to work on diagnosing and treating the cat's injuries. Because of the emergency situation, they will make a quick assessment of the injuries, then work quickly to stabilize the cat (e.g., intravenous fluids, oxygen supplementation) and treat the most life-threatening injures. [27] X Research source Part of that initial assessment will be evaluating the cat's airway, breathing, circulation, and consciousness. [28] X Research source In addition to a full physical exam, your veterinarian will perform other diagnostics, such as bloodwork, urinalysis, and chest x-rays. Be aware that emergency veterinary care is expensive."
    },
    {
      "title": "Follow treatment recommendations.",
      "content": "Follow treatment recommendations. After the cat has recovered enough to be released, you will need to continue treatment at home. Your veterinarian will likely recommend several treatments, including pain medication and antibiotics. You may also be responsible for changing bandages and checking wounds for signs of inflammation (e.g., redness, swelling) or infection (discharge). [29] X Research source You will also need to restrict the cat's activity and prevent her from jumping from furniture. [30] X Research source The specific type of at-home care will depend on the extent of the cat's injuries. Be sure you fully understand the at-home care instructions before taking the cat home. [31] X Research source You may need to schedule a follow-up appointment so the veterinarian can assess your cat's recovery. [32] X Research source"
    }
  ]
}