{
  "url": "https://www.wikihow.com/Crying-Horizontally-Meaning",
  "title": "What Is “Crying Horizontally?” The TikTok Term Explained",
  "steps": [
    {
      "title": "It’s when you tilt your head to cry so you don’t ruin your makeup.",
      "content": "It’s when you tilt your head to cry so you don’t ruin your makeup. According to TikTok, “crying horizontally” involves tilting your face so it’s parallel to the floor in order to preserve your foundation. Some people lie down “horizontally” on their couch or bed to stop the tears from falling down their face. [1] X Research source “Crying Horizontally” is also a song by the artist Elias. The lyrics describe a girl who’s crying horizontally to avoid messing up her makeup. [2] X Research source Some people think that those who cry horizontally are superficial and vain because they care about their appearance even when they’re upset."
    },
    {
      "title": "Blot your tears and avoid rubbing your eyes.",
      "content": "Blot your tears and avoid rubbing your eyes. According to makeup artist and hair stylist Alicia D’Angelo, you can repair your makeup after crying by “lightly patting [the tears] dry with a tissue.” Let the tears along your lash line and cheeks dry on their own, instead of rubbing them. Rubbing will remove your makeup and create a blotchy appearance. If you don’t have anything with you, D’Angelo says to “immediately treat your finger like a sponge and dab the [wet] area to reblend.”"
    },
    {
      "title": "Dab ice or cold water over your eyes to combat swelling.",
      "content": "Dab ice or cold water over your eyes to combat swelling. When you cry, blood rushes to your eyes, making them appear red and puffy. Treat puffy eyes by wrapping an ice cube in a clean paper towel, then gently pressing it over your eyes. [3] X Research source If you’re in a public place, go to the bathroom, wet a paper towel with cold water, then press it under your eyes."
    },
    {
      "title": "Use eye drops to get rid of any remaining redness.",
      "content": "Use eye drops to get rid of any remaining redness. If you have any type of eye drops on hand, put 1-2 drops in each eye to hide that you’ve been crying. Carefully follow the directions of your specific product so you don’t overuse it, and make sure it’s safe to use with contacts (if you wear them). In 10-15 minutes, your eyes will look clear. [4] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source If you’re a frequent crier, do not use redness-relieving eye drops (also known as antihistamine or decongestant eye drops) too often—they can make your eyes drier over time. Stick to 1-2 drops in each eye up to 4 times a day, up to a 72 hour time frame. [5] X Research source"
    },
    {
      "title": "Re-blend your foundation and apply powder on top.",
      "content": "Re-blend your foundation and apply powder on top. Use a makeup sponge to smooth out your foundation and get rid of any streaks. Once your skin looks even, use the clean side of the sponge to apply a setting powder . [6] X Research source If you have any remaining redness or blotchiness, apply a concealer on the affected areas before applying powder."
    },
    {
      "title": "Reapply your eyeliner and mascara.",
      "content": "Reapply your eyeliner and mascara. If you were wearing eyeliner beforehand, apply another swipe to redefine your lash line. Your eyelashes are probably clumpy post-cry, so remove as much mascara from your lower lash line as possible before reapplying a waterproof mascara . [7] X Research source If you have an eyelash comb , use it to declump your lower lashes before applying mascara."
    },
    {
      "title": "The “T_T” emoticon represents a crying face.",
      "content": "The “T_T” emoticon represents a crying face. It’s most often used to symbolize sadness, but some people use it when they’re annoyed or unimpressed. The horizontal lines of the Ts are meant to represent the eyes, while the vertical lines of the Ts are meant to represent tears. The “_” (or underscore) represents the mouth. [8] X Research source “I failed my exam T_T” “Winter depression is real T_T” “I’m so sad and lonely since I moved T_T” Them: “Sorry this is last minute, but I’m not going to the party anymore.” You: “T_T”"
    }
  ]
}