{
  "url": "https://www.wikihow.com/Be-Good-at-Small-Talk",
  "title": "How to Be Good at Small Talk",
  "steps": [
    {
      "title": "Practice.",
      "content": "Practice. Small talk is like any other skill. It takes practice to master. If you want to be better at small talk, practice making small talk whenever you can. [1] X Research source Choose low stakes situations to practice small talk. If you're going to a party on Friday, you may be very nervous about making small talk with potential new friends. Therefore, work on making small talk during less intense social situations. For example, make small talk at the line in the grocery store. Try to strike up small talk with a barista at a coffee shop. If you're making small talk with people you're unlikely to see again, you may be calmer."
    },
    {
      "title": "Stay positive during small talk.",
      "content": "Stay positive during small talk. If you're stressed when making small talk, this is likely to rub off on other people. Therefore, work on developing a positive mentality surrounding small talk. Going into the situation positive can make it a more positive experience for everyone. This can make small talk easier, easing your social anxiety in future situations. [2] X Research source Change how you think about small talk. Don't think of it as a burden. Instead, look at it as a way to get to know new people. Try doing something to relax, like taking a few deep breaths, before going into a situation that requires small talk. You will end up calmer during the situation, and better equipped to make small talk in a positive manner."
    },
    {
      "title": "Learn people's names.",
      "content": "Learn people's names. You may feel anxious going into a social situation where you don't know anyone. Something as simple as learning people's names can help. In places where you need to make small talk, like your office, work on learning the names of co-workers. [3] X Research source After you've heard someone's name the first time, repeat it once or twice in your head. This can help you commit the name to memory. Repeating the person’s name out loud when you meet can also be helpful, such as by saying something like, \"Nice to meet you, John.\" You can also try coming up with a way to connect the name to something familiar to you and this may help you to remember. For example, you might think to yourself, \"John with the tweed blazer,\" or \"John rhymes with Sean my brother,\" or \"John, like my uncle John.” Remember, you can always ask a third party for someone's name if you forgot it."
    },
    {
      "title": "Remember other people get anxious.",
      "content": "Remember other people get anxious. Sometimes, just knowing you're not alone can help you make small talk. Going into a social situation, remind yourself that everyone gets nervous. You are probably not the only one feeling anxious during small talk. When you start to feel social anxiety coming on, remind yourself the other person is likely as anxious as you are. [4] X Research source"
    },
    {
      "title": "Listen actively.",
      "content": "Listen actively. Being a good listener is important even when you are just making small talk. Active listening is a way to stay focused while someone is talking while also showing them that you are listening. [5] X Expert Source Sabrina Grover, LMSW Licensed Master Social Worker Expert Interview. 3 December 2021. To be an active listener, try to: [6] X Research source Show that you are listening using your body language. Maintain eye contact, face the person, and nod your head. Use neutral leading statements to make the person feel heard. Try saying things like, “yes,” “uh-huh,” and “I see.” Ask questions to keep the person talking or to clarify. When appropriate, try asking questions like, “What happened next?” “How did you feel?” and “What did you mean when you said ___?”"
    },
    {
      "title": "Be empathetic",
      "content": "Be empathetic . Showing empathy for someone else can also help you to be a good listener. When making small talk with someone, try to consider their perspective when they tell you things. How might you feel if the same thing happened to you? This can help you to respond appropriately to the things the other person says. For example, if you are making small talk with a coworker who tells you she got halfway to work and realized she left her phone at home and had to go back, then you might guess that she felt very frustrated and it was not a pleasant morning for her. Therefore, an appropriate response might be something like, \"Oh no! That sounds frustrating! I hope the rest of your day goes better.”"
    },
    {
      "title": "Read the news.",
      "content": "Read the news. Having a lot to discuss can improve your small talk skills. One way to do this is to stay up-to-date on the news. Most people follow current events to some degree. Being able to comment on what's happening in the world can be excellent fodder for small talk. [7] X Research source The news can usually make a good conversation starter. For example, you can say something like, \"Did you hear about...\" or \"How do you feel about...\" However, it may be best to avoid controversial topics in small talk. You do not want to make someone feel uncomfortable asking their opinion on a hot button issue."
    },
    {
      "title": "Avoid awkward subjects.",
      "content": "Avoid awkward subjects. Certain subjects should not be raised during small talk. They tend to halt the conversation, and may make others feel awkward. While engaging in small talk, make sure to avoid conversation killers. Don't talk about yourself too much. While it's okay to talk about your own experience, do not relate everything the other person says back to a personal anecdote. Never interrupt someone. Even if you think you know where a sentence is going, it's considered rude to try to finish someone else's sentence. Avoid arguing with someone during small talk. If someone brings up a political point you don't agree with, let it slide instead of arguing. People may take disagreements personally, and you don't want to risk alienating someone."
    },
    {
      "title": "Discuss the setting.",
      "content": "Discuss the setting. This is another good go-to if you're nervous during small talk. You can always talk about the setting. Comment on the theme or atmosphere of a bar where you're socializing. Make a comment on the weather. Compliment someone's home or apartment if you've been invited over for dinner. [8] X Research source"
    },
    {
      "title": "Remember facts about others.",
      "content": "Remember facts about others. You will be a better conversationalist if you can remember small details about people's lives. This can help streamline small talk. When people tell you about themselves, make note of small details. You can use these to fuel small talk later. [9] X Research source For example, you may learn you co-worker has a dog named Linus. If you need to, say, make small talk in the elevator, you can ask something like, \"How is Linus doing?\""
    },
    {
      "title": "Add interesting facts when you can.",
      "content": "Add interesting facts when you can. You can always talk a bit about yourself if you have something interesting to share. While you should not go overboard talking about yourself, relevant and interesting facts about your life can help move small talk forward. If someone asks something about you, give an interesting answer. This will help conversation move along. [10] X Research source For example, say something asks you how your weekend was. Do not simply answer fine. Tell them about something you did that weekend that may be of interest. For example, \"My weekend was good. I went to the beach with my friend and we collected seashells. How was your weekend?\""
    },
    {
      "title": "Remember you can always ask questions.",
      "content": "Remember you can always ask questions. People love to talk about themselves. If there's a lull in the conversation, you can always ask someone something about themselves. Most people will eagerly share facts about themselves when asked. [11] X Research source For example, if you were just talking about something at work, and the conversation has stalled, ask something like, \"So, how did you find your job?\" You can also ask about the other person's interests. If conversation slows, try a generic conversation starter like, \"Have you seen any good movies lately?\""
    },
    {
      "title": "Keep the conversation going during lulls.",
      "content": "Keep the conversation going during lulls. Sometimes, there are awkward silences during small talk. If a conversation slows, do something to keep it going. Ask appropriate questions during quiet moments to keep a conversation going. [12] X Research source Bring up something mentioned previously in the conversation. For example, say something like, \"So, tell me more about your job.\" Encourage someone to share a personal story. Ask them something like, \"So, you studied English in college? How did you get into that?\" Recalling and asking about information brought up previously can always push the conversation forward, so make sure you pay attention when people talk. You may need to use the information later."
    },
    {
      "title": "Learn something from each conversation.",
      "content": "Learn something from each conversation. Building your skills at small talk is a learning process. Each time you successfully engage in small talk, try to learn something about the experience. [13] X Research source The more you know about the world, the better you'll be at conversation. Talking to people from a variety of backgrounds, with a variety of different experiences, can broaden your horizons. Make an active effort to learn from people. Ask about other people's opinions and experiences. Remember interesting tidbits and facts you learn from others. You can use this information in conversations down the road."
    },
    {
      "title": "Recognize the benefits of making small talk.",
      "content": "Recognize the benefits of making small talk. Some people dislike small talk because they see it as fake or useless. However, making small talk can help you to build new relationships with people, such as for friendships, romantic relationships, or working relationships. Try to remind yourself that making small talk can lead to great things in some situations."
    },
    {
      "title": "Maintain good body language.",
      "content": "Maintain good body language. Confident body language will help you give off the right attitude during conversations. Work on maintaining eye contact, sitting up straight, and doing other things to look social and engaged. [14] X Research source Be aware of your body language. Strive to look engaged with the person. Avoid gestures that make you look distant. Don't, for example, cross your arms, look at the clock or phone, or lean away from the person."
    },
    {
      "title": "Start with a small challenge each day.",
      "content": "Start with a small challenge each day. If you want to build your social skills, start small. If you're shy by nature, you don't want to push yourself to do too much too soon. Set a goal to do one small thing each day to push you out of your comfort zone. [15] X Research source For example, you could set a goal to eat lunch in the break room instead of alone in a nearby coffee shop. This way, you'll have to be social with your co-workers. From there, work your way up. Set more and more small goals, until you're brave enough to go out for drinks with co-workers after work."
    },
    {
      "title": "Find a model for social skills.",
      "content": "Find a model for social skills. It can help to model your behavior after someone you see as socially adept. You can, for example, study the behavior of a very social co-worker in your office. Pay attention to how they interact and make conversations with others. Try to emulate some of their behaviors. [16] X Research source"
    },
    {
      "title": "Push yourself to try new things.",
      "content": "Push yourself to try new things. Shyness is often linked to a lack of confidence. If you're shy by nature, trying new things can help you feel more confident in yourself. Developing a wide skill set or a wide array of hobbies and interests can make you feel bolder. It can also give you more to talk about during small talk. Join a club. Take a class. Enroll in a sport's team. Do anything that pertains to your interests that is new and exciting for you."
    }
  ]
}