{
  "url": "https://www.wikihow.com/Create-a-New-Playlist-on-YouTube",
  "title": "2 Easy Ways to Create and Manage Playlists on YouTube",
  "steps": [
    {
      "title": "Open the YouTube app.",
      "content": "Open the YouTube app. This looks like a white play button in a red rectangle. You must be logged into your account to create and edit playlists. Tap Sign in and enter your login information to do so now. YouTube is available for iOS in the App Store and for Android in the Google Play Store ."
    },
    {
      "title": "Navigate to a video.",
      "content": "Navigate to a video. Before you can create a playlist, you'll need to find a video you want to add. Use the search bar at the top to find a video, or browse your feed."
    },
    {
      "title": "Tap Save.",
      "content": "Tap Save . This will be below the video, next to a bookmark icon. This option is in the same row as the Like button. You may need to tap and drag the options to find it. A pop-up menu will open."
    },
    {
      "title": "Tap + New playlist.",
      "content": "Tap + New playlist . This is at the top of the menu. If the pop-up menu doesn't open, YouTube may have automatically saved the video to your last playlist or to your Watch Later playlist. Tap Change on the pop-up notification to change this. [1] X Research source"
    },
    {
      "title": "Enter a name for the playlist.",
      "content": "Enter a name for the playlist. You can use up to 150 characters. By default, the playlist is set as Private . To change this, tap the drop-down menu and select Public or Unlisted ."
    },
    {
      "title": "Tap Create.",
      "content": "Tap Create . This will create a new playlist and add the video. You can also create a playlist from your Library tab. Tap your profile picture in the bottom-right corner, and then tap New playlist underneath the Playlists header. Select videos from your recently watched history to add it."
    },
    {
      "title": "Edit your playlist (optional).",
      "content": "Edit your playlist (optional). Tap your profile icon in the bottom-right corner and select your playlist from underneath the Playlists header. To edit the title or description, tap the pencil icon. Enter the new text, and then tap Save . To reorder your playlist, tap and hold the two bars on the left side of the video. Drag the video to where you want it. To filter your playlist, tap Sort and select a filter. To delete your playlist, tap ⋮ in the top-right corner and tap Delete playlist ."
    },
    {
      "title": "Go to https://www.youtube.com/ in a web browser.",
      "content": "Go to https://www.youtube.com/ in a web browser. This will open your YouTube home page if you're logged into your YouTube account. If you aren't logged into your YouTube account , click Sign in in the top-right corner of the page to do so now."
    },
    {
      "title": "Navigate to a video.",
      "content": "Navigate to a video. Before you can create a playlist, you'll need to find a video you want to add. Use the search bar at the top to find a video, or browse your feed."
    },
    {
      "title": "Click ••• .",
      "content": "Click ••• . This will be underneath the video."
    },
    {
      "title": "Click Save.",
      "content": "Click Save . A pop-up menu will open."
    },
    {
      "title": "Click Create new playlist.",
      "content": "Click Create new playlist . This is at the bottom of the pop-up menu."
    },
    {
      "title": "Enter a name for the playlist.",
      "content": "Enter a name for the playlist. You can use up to 150 characters. By default, the playlist is set as Private . To change this, click the drop-down menu and select Public or Unlisted ."
    },
    {
      "title": "Click Create.",
      "content": "Click Create . This is at the bottom-right corner."
    },
    {
      "title": "Edit your playlist (optional).",
      "content": "Edit your playlist (optional). Click the Playlists tab in the left panel and find your playlist. Click View full playlist underneath the video thumbnail. To edit the title or description, click the pencil icon. Enter the new text, and then click Save . To reorder your playlist, click and hold the two bars on the left side of the video. Drag the video to where you want it. To filter your playlist, click Sort and select a filter. To delete your playlist, click ⋮ below the video thumbnail and select Delete playlist ."
    }
  ]
}