{
  "url": "https://www.wikihow.com/Adjust-Which-Genders-You-Are-Interested-in-on-Tinder",
  "title": "How to Change Your Gender Preferences on Tinder",
  "steps": [
    {
      "title": "Open Tinder and click the profile icon in the bottom right corner.",
      "content": "Open Tinder and click the profile icon in the bottom right corner. Find the Tinder app on your phone and tap it to launch the app. Then, look for your Tinder profile icon in the bottom right corner, which looks like a person. Click it to open your profile. [1] X Research source If you haven’t used Tinder in a while, you might have to log in to the app again. Just choose to log in with Google, Facebook, or your phone number."
    },
    {
      "title": "Click the gear icon in the top right corner.",
      "content": "Click the gear icon in the top right corner. Press the gray, gear-shaped icon in the top right corner of your screen. This opens up your profile and account settings. [2] X Research source"
    },
    {
      "title": "Scroll to “Discovery Settings,” click “Show Me,” and make changes.",
      "content": "Scroll to “Discovery Settings,” click “Show Me,” and make changes. To adjust which gender(s) you want to see in your matches, find “Discovery Settings” on the profile settings page and then scroll until you see “Show Me.” Press “Show Me” and then select the gender(s) you want to match with on Tinder. When you select a gender, a checkmark appears next to it. [3] X Research source Currently, there are options for “Men,” “Women,” and “Everyone.” If there’s a gender selected that you aren’t interested in, click it to remove the checkmark. If you’re still seeing matches that don’t conform to your gender preferences, log out of Tinder and then log back in. [4] X Research source"
    },
    {
      "title": "Ensure your gender on Tinder matches your Facebook gender.",
      "content": "Ensure your gender on Tinder matches your Facebook gender. If you set up your Tinder profile through Facebook, Tinder might pull your gender information from your Facebook account which can affect the people you see on Tinder. For instance, if you’re a straight woman but your gender on Facebook is set to “Male,” you might see women on Tinder. So, double-check that the gender you listed on Facebook aligns with your gender identity. On the Facebook app : [5] X Research source Tap your profile icon in the bottom right corner. Under “Menu,” click your name and then tap “Edit Profile.” Scroll down to “Edit Your About Info” and then to “Basic Info.” Click edit and choose “Female,” “Male,” “Nonbinary,” or “More options.” On the Facebook website : [6] X Research source Click your profile and then click “About.” Press “Contact and basic info” and find “Gender.” Click the pencil icon and choose “Female,” “Male,” “Nonbinary,” or “More options.”"
    },
    {
      "title": "Open Tinder and press the profile icon in the bottom right corner.",
      "content": "Open Tinder and press the profile icon in the bottom right corner. Press the Tinder app on your phone and look for the profile icon in the bottom right corner of the home page. Then, click your profile. [7] X Research source"
    },
    {
      "title": "Press the pencil icon and scroll to the bottom of the page.",
      "content": "Press the pencil icon and scroll to the bottom of the page. Look for the pencil icon that says, “Edit Info” and click it. This opens up your profile information. Just scroll to the bottom of the page, which is where your gender and sexual orientation information is typically located. [8] X Research source"
    },
    {
      "title": "Click “Gender” and make any changes to your gender identity.",
      "content": "Click “Gender” and make any changes to your gender identity. When you press “Gender,” you’ll see options to select “Man,” “Woman,” or “More.” If you select “More,” you’re prompted to type in details about your gender and select the option you most identify with. For instance, there are options for “Transgender” and “Gender fluid.” [9] X Research source On the “Gender” page is an option to show your gender on your profile. Simply toggle the switch on or off if you want Tinder users to see your gender. Add your preferred pronouns, too. Just find “Pronouns” under your profile information and add up to 4 pronouns. Then, switch the toggle to make your pronouns visible on your profile. [10] X Research source"
    },
    {
      "title": "Press “Sexual Orientation” to add your sexual orientation.",
      "content": "Press “Sexual Orientation” to add your sexual orientation. On the “Sexual Orientation” screen, you can select up to 3 terms that describe your sexual orientation. For instance, there are options for “Straight,” “Gay,” “Bisexual,” and “Queer.” [11] X Research source There is also an option to show your sexual orientation on your profile. Just press the toggle button to let Tinder users see your sexual orientation."
    }
  ]
}