{
  "url": "https://www.wikihow.com/Save-Facebook-Messages",
  "title": "2 Easy Ways to Download & Save Facebook Messages",
  "steps": [
    {
      "title": "Open Messenger.",
      "content": "Open Messenger. Tap the icon that looks like a chat bubble with a lightning bolt inside it."
    },
    {
      "title": "Tap your profile icon.",
      "content": "Tap your profile icon. It's in the upper left corner of your screen next to \"Chats.\""
    },
    {
      "title": "Tap Account settings.",
      "content": "Tap Account settings . This is under the \"Account\" header next to a blue circle with a gear in it."
    },
    {
      "title": "Tap Download your information.",
      "content": "Tap Download your information . You'll find this under the \"Your information\" header next to an arrow that's pointing down."
    },
    {
      "title": "Tap Deselect all.",
      "content": "Tap Deselect all . It's on the right side of your screen across from \"Your activity across Facebook,\" and will uncheck everything in the list. If you don't see this wording, make sure you're in the Request Copy tab first."
    },
    {
      "title": "Tap the circle next to \"Messages\" to select it.",
      "content": "Tap the circle next to \"Messages\" to select it. Since you're only downloading your Messenger conversations, unchecking everything else and checking \"Messages\" will make sure your saved document only contains messages."
    },
    {
      "title": "Select a date range, format, and quality.",
      "content": "Select a date range, format, and quality. Tap the drop-down arrows to make your selections to customize your file. Since HTML is the easiest file to open and read , you'll want to select that from the format dropdown."
    },
    {
      "title": "Tap Create File.",
      "content": "Tap Create File . This button is centered at the bottom of your screen and will prompt Facebook to begin gathering your information into a downloadable file. Depending on the amount of information that you're downloading, this process may take a while. As this process starts and when it ends, you'll receive emails letting you know the progress of the file creation."
    },
    {
      "title": "Open your email app (if you want to download the file to your mobile).",
      "content": "Open your email app (if you want to download the file to your mobile). This could be Thunderbird for iOS, Gmail, or any other email app for mobile. If you don't want to download the file on your phone or tablet, you can open your email on your computer."
    },
    {
      "title": "Navigate to the email from Facebook.",
      "content": "Navigate to the email from Facebook. The subject line should say something like \"Your information file is ready.\""
    },
    {
      "title": "Tap the \"Download Your Information\" link in the email.",
      "content": "Tap the \"Download Your Information\" link in the email. Tapping or clicking this will bring you to the tab that allows you to download your information, which is Messenger > Account settings > Download your information > Available copies . For security purposes, the file that you requested will only be available for a few days after the email is sent. If you couldn't download the file in that time frame, you'll need to restart the process and request your information again."
    },
    {
      "title": "Tap Download.",
      "content": "Tap Download . If you're on a computer, you'll be prompted to select a save location using the file manager. If you're on mobile, however, you'll just see when the download finishes. Enter your Facebook password when prompted. Unzip the file or tap the file on your phone to extract the files inside the zipped folder. To view these files, open your file manager, then go to Downloads > Messages. If you want to save the images only instead of your text, tap the image then tap Save ."
    },
    {
      "title": "Go to https://facebook.com in a web browser.",
      "content": "Go to https://facebook.com in a web browser. You can use any web browser, like Chrome or Firefox, to request your information and download it."
    },
    {
      "title": "Click your profile icon.",
      "content": "Click your profile icon. You'll see this circular icon in the top right corner of the page, and clicking it will prompt a menu to drop down."
    },
    {
      "title": "Click Settings & privacy and Settings.",
      "content": "Click Settings & privacy and Settings . Both of these options are next to an icon of a gear."
    },
    {
      "title": "Click Your Facebook Information.",
      "content": "Click Your Facebook Information . This is in the panel on the left side of the page next to a grid icon."
    },
    {
      "title": "Click Download your information.",
      "content": "Click Download your information . You'll see this on the right side of the page."
    },
    {
      "title": "Select your file options.",
      "content": "Select your file options. Under \"Select file options,\" pick a date range, format, and quality. Click the drop-down arrows to make your selections to customize your file. Since HTML is the easiest file to open and read , you'll want to select that from the format dropdown."
    },
    {
      "title": "Click Deselect All.",
      "content": "Click Deselect All . It's on the right side of the page. If you don't see this wording, make sure you're in the Request a download tab, which you will find in the top right corner of the page."
    },
    {
      "title": "Click \"Messages\" to select it.",
      "content": "Click \"Messages\" to select it. Since you're only downloading your Messenger conversations, unchecking everything else and checking \"Messages\" will make sure your saved document only contains messages."
    },
    {
      "title": "Tap Request a download.",
      "content": "Tap Request a download . This button is centered at the bottom of your screen and will prompt Facebook to begin gathering your information into a downloadable file. Depending on the amount of information that you're downloading, this process may take a while. As this process starts and when it ends, you'll receive emails letting you know the progress of the file creation."
    },
    {
      "title": "Click the notification.",
      "content": "Click the notification. As well as an email, you'll also be notified by a notification when your file is ready to download. You can access your notifications by clicking the bell icon in the top right corner of Facebook. You can also get to the file download by going to Settings & privacy > Settings > Your Facebook Information > Download your information > Available Files . For security purposes, the file that you requested will only be available for a few days after the email is sent. If you couldn't download the file in that time frame, you'll need to restart the process and request your information again."
    },
    {
      "title": "Click Download.",
      "content": "Click Download . It's to the right of the file that you requested. [1] X Research source You'll be prompted to enter your Facebook password to download the file then your file manager will appear and ask where you want to save the file. Unzip the file and extract the files to a location that you'll remember. To view these files, find them in your file manager. If you want to save the images only instead of your text, tap the image, right-click it, then select Save Image ."
    }
  ]
}