{
  "url": "https://www.wikihow.com/Love-Yourself-when-You-Are-Overweight",
  "title": "How to Love Yourself when You Are Overweight",
  "steps": [
    {
      "title": "Present yourself at your best.",
      "content": "Present yourself at your best. As much as it isn't fair, people do judge by appearance. It's how human beings assess one another to begin with, before getting to know one another better. However, this aspect is one that you can use to your advantage, by dressing in a style that says: \"I look good and I feel good.\" Good clothing does help you to feel better. Wear what you like to wear, it doesn't matter what just, as long as you like how you look, and as long as it's quality. Whether it's vintage, hipster, girl punk, gal or bright colors, it is just fine. Your body is your home, feel free to decorate it."
    },
    {
      "title": "Wear accessories.",
      "content": "Wear accessories. Accessories are fun and they can help you to show off your individuality. Whether you love delicate necklaces, animal brooches, studded wrist bands or dangling earrings, the accessories can make your outfit and boost your confidence. They're a unique part of defining your own style and can be a great talking point."
    },
    {
      "title": "Choose your makeup to suit the person you are.",
      "content": "Choose your makeup to suit the person you are. Whether you do your makeup with little or no eyeliner, or with a cat's eye or a lot of eyeliner, it's up to you. Choose a lipstick in the colors that look best for your skin type and that you actually like. Experiment with blush, foundation and eyeshadow to see what works well for you. If you don't like makeup, wear cute hairstyles to enhance your style. Or, if you like messy buns and a crazy load of lipstick, do that instead. Again, it's your choice and it's perfectly fine. Guys can wear makeup too. There are many excellent tutorials available online to assist you with choosing the types of makeup and looks that might be suitable for you."
    },
    {
      "title": "Decide whether you want to change your body or whether you're happy with things just the way they are.",
      "content": "Decide whether you want to change your body or whether you're happy with things just the way they are. Only you get to choose to love your body, not someone else. It's up to you but you must reach that decision based on your personal preferences, not because of social disapproval or someone pushing you. If you have health challenges owing to your weight (and this is never a given, as many skinny people are unhealthy and many fat people are perfectly healthy), you may want to make the change for that reason. However, if you're fit and healthy, and happy with your weight, that's who you are and it's not for others to make you change your mind or feel bad about yourself. If you're afraid of change, be aware that you won't change because of your shape, you're still going to have the same soul. Ways of reducing weight can include: Working out, drinking lots of water, eating small portions of nutritionally dense foods. But always have those little cheat days that allow you to eat some favorites, such as fries, pizza etc., just in small portions. Depriving yourself only leads to feeling worse and often to giving up."
    },
    {
      "title": "Keep fit.",
      "content": "Keep fit. Find a form of physical exercise that you enjoy . Do it regularly. This will help you to keep fit. Avoid seeing it as being about weight loss unless that is something you're striving for; fitness is about being able to walk with ease, have high levels of energy and participate in daily life with ease. It's also about ensuring that your body stays in a good condition for all of your life. Some fun ways to keep fit include: Walking everywhere possible. Go for walks in beautiful places as often as possible, to restore your spirit as much as helping your fitness––try the beach, a local park or woods, the local hiking trails, a waterfront, local wetlands, and so forth. Cycling. This can be done for recreation or even semi competitively. Try mountain biking if you're keen on hills, mud and nature. Swimming. Swimming is a way to build strength and stamina while being buoyed with ease by the water. It's a great way to cool down on a hot day, but find a heated, indoor pool for the cooler weather. Finish it off with an aqua-aerobics class if you're feeling adventurous. Rowing, kayaking or canoeing. These sports take a bit more dedication as you may need to either own the boat or hire one, but it's a great sport for getting out on the water and building strength. It can also be good for being part of a team. Fit in an hour over lunchtime if you work near a waterfront or book out a half day on your weekend."
    },
    {
      "title": "Find a doctor who respects you, and get regular check-ups.",
      "content": "Find a doctor who respects you, and get regular check-ups. Every person needs to have their health assessed on a regular basis. Knowing whether you have potential health challenges or not is important, for if they're caught early, many medical problems can be managed or even fixed. A doctor who makes you cry is a bad doctor. Don't tolerate a mean doctor. Look for someone else."
    },
    {
      "title": "Remind yourself that it's what is on the inside that counts.",
      "content": "Remind yourself that it's what is on the inside that counts. Weight does not define the temperament, personality and nature of the person. Who you are is determined by the way you think, the ability to improve yourself through enhancing your better character traits and the (kind) way that you deal with others. There are very thin models who have very mean-spirited personalities, while there are very large people who think of nothing more than helping others; and vice versa. Boxing people into stereotypes due to their appearance and/or weight is narrow-minded and untrue; if you come across someone fixated on defining you by your looks, do not take anything that person says seriously. It can help to understand that many of the people invested in the \"skinny myth\" equate being thin or a size 0 with being happy and lovable. If you were feeling particularly unkind, you could ask them how that's working out for them. But seriously, any attempt to link appearance with happiness is a fleeting and shallow linkage that is bound to end in tears. After all, even the thinnest person ages and if they spend their life valuing their worth by appearance alone, they'll find aging a terrible shock."
    },
    {
      "title": "Accept yourself.",
      "content": "Accept yourself. If you spend your life afraid of what others think of you, it is a life half lived, a life spent hanging back in the shadows. Begin by not rejecting yourself and should others seek to reject you, you will know that you are not in need of their validation. They can fall by the by, you don't need them. Embrace yourself with a daily hug, a smile in the mirror every time you see yourself and a thumbs up for the great thoughts you have about yourself and others. Try to participate in sports or activities with others that move your body. This way, you'll improve your body image and really start to appreciate what your body is doing for you. The more you appreciate your body, the more comfortable you will be with it. Embrace not only yourself, but diversity too. Diversity is a celebration that humanity is made up of all sorts of people, even the grumpy and scolding ones; diversity is essential for humanity to thrive and keep on being a creative species. Embrace complexity. Life is rather more complex than the size of a person's dress or the numbers that pop up on the scales. In fact, people who chuck the scales are often much happier because measuring your life in this way can easily take on a limiting and obsessive inward-looking focus. What about improving your character or making real achievements that benefit others? A far more complex, and far more satisfying approach to life!"
    },
    {
      "title": "Hang out with positive people who value character, not appearance.",
      "content": "Hang out with positive people who value character, not appearance. The people you spend most of your time with shouldn't judge you or call you mean names. If they do, they're not the people for you. Find friends who love you for you and look beyond the artificiality of appearance. If someone calls you fat, your friends should be the ones sticking up for you, it's what friends are supposed to do."
    },
    {
      "title": "Write a letter to yourself.",
      "content": "Write a letter to yourself. Get out a paper and crayons, markers, sharpies for make a letter to yourself. Write all the things you wish you could change about yourself. On another piece of paper, write down all of the things you do like about yourself. If you like, have a friend or a family member participate and write something they would never want to change about you. Read both of the letters. Keep them for future reference or get rid of the negative one. One option is to burn it. Get a lighter and burn the paper, watch it burn, because you're taking away those negative things. Just how fire makes things be forgotten, so will those things you wrote on the paper. On the other hand, frame the positives. Be proud of them; you become what you focus on most."
    }
  ]
}