{
  "url": "https://www.wikihow.com/Replace-a-Smoke-Detector",
  "title": "How to Replace Smoke Detectors",
  "steps": [
    {
      "title": "Shut off the electricity using the circuit breaker.",
      "content": "Shut off the electricity using the circuit breaker. Find your circuit breaker and switch off power to the smoke detector in question. This will remove the danger of electric shock resulting from touching open wires. [2] X Research source"
    },
    {
      "title": "Remove the old detector from the mounting.",
      "content": "Remove the old detector from the mounting. Try to rotate the detector about a quarter-turn counterclockwise to remove it. If it doesn’t move, look for a depressed tab and press while turning it. The unit will now be suspended from the ceiling by three wires, all connected to the detector via one plug called the wiring harness. These wires are: Black - 120 volts White - Neutral Red or Yellow - Interconnect (this is the wire that connects the alarm with the remaining alarms in your residence)"
    },
    {
      "title": "Unhook the wire harness from the detector.",
      "content": "Unhook the wire harness from the detector. Squeeze both sides of the plastic plug while pulling the plug away from the detector. The old detector should now be completely detached. In the rare event that the smoke alarm is one of the super old models that has no harness, cut and strip the wires connecting the smoke alarm."
    },
    {
      "title": "Remove the mounting plate.",
      "content": "Remove the mounting plate. Take a screwdriver and remove the two screws that hold the mounting plate to the electrical box in your ceiling. Be careful not to accidentally pull the wires out of the ceiling while removing the mounting plate. It’s always worth checking to see if the existing mounting plate will work with your new unit before you replace it."
    },
    {
      "title": "Remove the wiring harness.",
      "content": "Remove the wiring harness. Start by removing any electric tape or wire caps that are attached to the wiring harness. Untwist the wires and remove the wiring harness. The three wires in the ceiling should now just be exposed metal ends. [3] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source Even if you’re replacing a smoke alarm with an identical model, it’s best to not reuse the old wiring harness. It’s rare, but it’s possible the manufacturer changed the amperage or current rating of the harness for their newer models."
    },
    {
      "title": "Attach the new wiring harness to the wires in the ceiling.",
      "content": "Attach the new wiring harness to the wires in the ceiling. The new smoke detector should also come with a wiring harness very similar to the one you removed. Match the wires using the color coding and attach them by twisting the metal ends around each other. Wrap the newly attached metal ends in electric tape or attach a wire cap. Attach the wires in the following manner: black to black, white to white, and red or yellow to the color of the third wire in your ceiling (this color can vary). [4] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source After attaching the wires, pull down slightly on the wire harness to make sure you have a good connection that can support the weight of the alarm. If the wire harness comes undone you will need to reattach the wires, making sure to wrap them tightly around each other. If there are only two wires, you only need to attach black to black and white to white. Switching to a battery powered unit? If you’re replacing a hardwired unit with a battery-powered smoke detector, terminate the wire connections by twisting wire nuts on each wire, wrap them in electrical tape, and tuck the wires in the ceiling."
    },
    {
      "title": "Attach the new mounting plate.",
      "content": "Attach the new mounting plate. Take the new mounting plate that came with the new alarm and pass the wiring harness through the large hole in the center of the plate. Then screw the plate into the ceiling/wall with the two screws that you removed earlier. You can do this before attaching the new wire harness if you’d like."
    },
    {
      "title": "Connect the new smoke detector to the harness.",
      "content": "Connect the new smoke detector to the harness. Plug the wiring harness into the new detector, and then attach the smoke detector to the mounting plate. This can most likely be done by holding the detector up on the mounting plate and turning the detector clockwise. [5] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source If your smoke detector has a backup battery (which most do these days), don’t forget to install batteries before you attach it to the mounting plate. You shouldn’t need to replace these batteries in the future, but start off with a fresh set to ensure that stays the case."
    },
    {
      "title": "Turn on the electricity and check your work.",
      "content": "Turn on the electricity and check your work. Flip the circuit breaker back on. All smoke detectors have a “test” button (sometimes it is the only button on the face of the detector). Press and hold the button for at least 5 seconds, and you should hear a beep. [6] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source If you have other working smoke alarms in the house, they may all beep. This is a sign that you connected your new smoke alarm properly. If the smoke detector does not beep when tested, check that you matched the wires properly and that they are sufficiently attached at the metal ends. Check the circuit breaker to make sure the power is on. You can use an aerosol can of smoke to perform a real test of the detector, if desired."
    },
    {
      "title": "Replace the battery on the back whenever a unit chirps.",
      "content": "Replace the battery on the back whenever a unit chirps. Battery-powered detectors will make a chirp every 30-45 seconds whenever the batteries need replacing. Replace the batteries in the units you’ve identified as malfunctioning and re-test them. [7] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source To replace the batteries: Remove the detector from the mounting. Most smoke detectors simply require a quarter turn counterclockwise. Replace the batteries. Most smoke detectors use 9V batteries. The battery compartment should be visible on the back side of the detector. Remove the cover and replace the battery. Reattach the detector. Replace the battery cover and hold the smoke detector up against the mounting. Turn the detector clockwise to reattach it to the mount. Re-test your detector. Hold the test button for at least 5 seconds. If you hear a beep, your smoke detector is functioning properly."
    },
    {
      "title": "Swap out your battery-powered units after 10 years.",
      "content": "Swap out your battery-powered units after 10 years. Even battery units lose their efficacy after a while. Luckily, replacing battery-powered units is easy. Simply purchase a new detector, insert a battery, and then twist it clockwise into the mount in the ceiling. If you need to install a new mount, just unscrew the old one and then install the new mount using the provided screws. [8] X Research source"
    },
    {
      "title": "Locate all of your smoke detectors.",
      "content": "Locate all of your smoke detectors. There should be at least one detector on every floor of the house, including finished attics or basements. You may even have multiple smoke detectors on each floor, so make sure to check every room. If you notice you’re missing a smoke detector on a floor, install one!"
    },
    {
      "title": "Check the manufacture date and replace all detectors after 10 years.",
      "content": "Check the manufacture date and replace all detectors after 10 years. The location of the manufacture date should be easy to find but varies by model. If you find a smoke detector that is over 10 years old, replace it immediately. If you can't find a manufacture date on the smoke detector, the detector is probably over 10 years old anyway and should be replaced. [9] X Research source"
    },
    {
      "title": "Test your smoke detectors monthly to ensure they work.",
      "content": "Test your smoke detectors monthly to ensure they work. Find the button on the face of the detector and hold it for at least 5 seconds. If the smoke detector beeps, it is functioning properly. If the detector does not beep, something is wrong. [10] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source You may hear all of your smoke alarms beep while only testing one of them; this is normal, and indicates the smoke detector in question is functioning properly. You can buy an aerosol can of smoke to test your detector if you wish."
    },
    {
      "title": "Use the right type of smoke detector for your space.",
      "content": "Use the right type of smoke detector for your space. Deciding on a smoke detector is mostly personal preference, but there are some features to know about. [11] X Trustworthy Source National Fire Protection Association Nonprofit organization devoted to eliminating death, injury, property and economic loss due to fire, electrical and related hazards. Go to source Some newer smoke detectors also function as a carbon monoxide detector. If you don’t have a CO detector in your house, this is a good option. It is only necessary if you use gas in the house. Wireless smoke detectors are convenient, but they can only connect to other wireless alarms of the same model. If you’re replacing all of the smoke detectors in your house and choose the wireless option, make sure to purchase the same make and model. Check the manufacture date. Since smoke alarms have a fairly static 10-year lifetime, buying one that has been on the shelf for two years will only give you 8 years of use."
    }
  ]
}