{
  "url": "https://www.wikihow.com/Sell-Stocks-on-Cash-App",
  "title": "How to Sell Stocks with Cash App Investing",
  "steps": [
    {
      "title": "Open the Cash App app.",
      "content": "Open the Cash App app. This looks like a white $ with a green background. Cash App is available to use on iPhone and Android . [1] X Research source"
    },
    {
      "title": "Tap Money.",
      "content": "Tap Money . This is the tab at the bottom with the dollar symbol ($)."
    },
    {
      "title": "Tap Investing.",
      "content": "Tap Investing . You may need to scroll down to find this tile."
    },
    {
      "title": "Scroll down to \"Stocks Owned\".",
      "content": "Scroll down to \"Stocks Owned\". You'll see a list of all currently purchased stock ."
    },
    {
      "title": "Tap the company.",
      "content": "Tap the company. The companies should be listed in alphabetical order."
    },
    {
      "title": "Tap Sell.",
      "content": "Tap Sell . You can find this button below the company's name."
    },
    {
      "title": "Select an amount.",
      "content": "Select an amount. Cash App will offer preset amounts. Tap one to select it. You can also tap ••• to enter a custom amount."
    },
    {
      "title": "Enter your PIN or Touch ID.",
      "content": "Enter your PIN or Touch ID. This will confirm your transaction. Your stock will be sold. Sales may take up to 2 business days to be deposited in your Cash App balance . You can monitor your other stock investments on the Home page, under Investment ."
    },
    {
      "title": "There's a minimum sale amount of $1.",
      "content": "There's a minimum sale amount of $1. You won't be able to sell stock less than this amount."
    },
    {
      "title": "You can sell under 98% of your stock or 100% of it.",
      "content": "You can sell under 98% of your stock or 100% of it. If you want to place a sell order that is close to the amount you fully own, it must be less than 98%. If it's over 98%, you must sell 100% of it. [2] X Research source"
    },
    {
      "title": "You can only place three (3) day trades within a rolling 5-day trading period.",
      "content": "You can only place three (3) day trades within a rolling 5-day trading period. A day trade is when you buy and sell the same stock on the same market day. If you reach your day trade limit, you can still buy and sell stock as long as you're selling on a different day. [3] X Research source"
    }
  ]
}