{
  "url": "https://www.wikihow.com/Clean-Drive-C-for-More-Space",
  "title": "How to Clean Drive C for More Space",
  "steps": [
    {
      "title": "Open Windows 11 search box.",
      "content": "Open Windows 11 search box. It should be on the bottom of your screen and located next to the blue Windows icon. You'll see a small box with a magnifying glass, and the word \"Search\" is written on it."
    },
    {
      "title": "Type in disk cleanup in the pop-up window.",
      "content": "Type in disk cleanup in the pop-up window. This operation will help you find matching Windows settings, applications, photos, and also website results."
    },
    {
      "title": "Click Disk Clean-up.",
      "content": "Click Disk Clean-up . It should be in the Best Match section in the Windows search box interface. You'll open the Disk Clean-up window after clicking the button."
    },
    {
      "title": "Select drive C and click OK in the pop-up window.",
      "content": "Select drive C and click OK in the pop-up window. If you change your mind, you can also click on Exit to cancel the disk cleanup. (You can also choose another drive in this selection part.)"
    },
    {
      "title": "Click Clean up system files.",
      "content": "Click Clean up system files . You can clean up more space on the C drive by cleaning up system files. You may need to wait a few seconds to let OS calculate the available items."
    },
    {
      "title": "Choose files to delete.",
      "content": "Choose files to delete. You'll see multiple items you can delete in Disk Clean-up, and every item has a checkbox. Ensure you check every checkbox next to the items you want to delete. Suppose you don't know the actual meaning of every item. In that case, you can check the following explanation: Windows Update Clean-up: Windows will still keep copies of all installed updates after installation. You can free up a lot of space by deleting Windows updates. Downloaded Program Files: These files include Java applets, Activex controls, and also website browser extensions. Temporary Internet Files: All the internet caches, such as web pages, pictures, videos, and other media items. Basically, these caches were created while visiting the websites. Offline webpages: All the webpages you can visit without any internet connections. System error memory dump files: All the information about the system errors, and these files, like the Windows error reports that record every crash of the OS. Temporary files: All the temporary files created by the applications and Windows operating system."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . If you don't want to delete files and perform a disk clean-up, you can also click {{MacButton|Cancel} to close his window."
    },
    {
      "title": "Click Delete Files in the pop-up window.",
      "content": "Click Delete Files in the pop-up window. After clicking this button, the Disk Clean-up utility will start to permanently delete the selected files."
    },
    {
      "title": "Wait for minutes, and the Disk Clean-up window will automatically close when the deletion finish.",
      "content": "Wait for minutes, and the Disk Clean-up window will automatically close when the deletion finish. If you select many large files, the deletion time will be longer."
    },
    {
      "title": "Open Windows 11 search dialogue.",
      "content": "Open Windows 11 search dialogue. It is easy to find this search utility, and you'll see a small box with a magnifying glass, and the word \"Search\" is written on it."
    },
    {
      "title": "Type in storage settings and click Storage settings.",
      "content": "Type in storage settings and click Storage settings . You'll search for Windows Storage Settings and open the Windows Storage Settings window."
    },
    {
      "title": "Turn on Storage Sense by clicking the switch button.",
      "content": "Turn on Storage Sense by clicking the switch button. If the Storage Sense is already turned on, the switch button will show blue with the word \"On\"."
    },
    {
      "title": "Click Storage Sense to adjust advanced settings.",
      "content": "Click Storage Sense to adjust advanced settings. You can enable automatic cleanup and run Storage Sense manually in the pop-up window."
    },
    {
      "title": "Check the checkbox under Cleanup of temporary files, and turn on Automatic User content cleanup.",
      "content": "Check the checkbox under Cleanup of temporary files , and turn on Automatic User content cleanup. You can configure Windows Storage Sense's cleanup schedules in this window. Run Storage Sense every day/week/month or during low free disk space. Delete files in the Recycle Bin for over 1/14/30/60 days. You can also set it to never do this operation as well. Clean up files in the Downloads folder that are not opened for more than 1/14/30/60 days. Choose Never to refuse to automatically delete the files in the Downloads folder. Click Run Storage Sense now will perform a cleanup immediately."
    },
    {
      "title": "Double click Recycle Bin icon to open the Windows 11 Recycle Bin folder.",
      "content": "Double click Recycle Bin icon to open the Windows 11 Recycle Bin folder. You can easily find Recycle Bin on the desktop. You can easily empty the Recycle Bin by right-clicking the Recycle Bin icon and choosing Empty Recycle Bin ."
    },
    {
      "title": "Click Empty Recycle Bin.",
      "content": "Click Empty Recycle Bin . This button has a trash icon at the top of the Recycle Bin window. Move your pointer to the button, and you will see the explanation \"Delete all items in the Recycle Bin to clear some disk space\"."
    }
  ]
}