{
  "url": "https://www.wikihow.com/Anchor-a-Swing-Set",
  "title": "How to Anchor a Swing Set",
  "steps": [
    {
      "title": "Position the swing set and mark the location of each leg with a shovel.",
      "content": "Position the swing set and mark the location of each leg with a shovel. Place the swing set where you intend to permanently install it. Make a small mark in the ground where each leg is with the blade of a shovel. Make this mark on the very edge of each leg so that it is as accurately located as possible. [1] X Research source Be sure you’re confident with the location for your swing set. Once you pour in your concrete anchoring, it will be very difficult to move the set. Nearly any type of soft ground (such as dirt or sand) will work for this method, and you can use this method with wooden and metal swing sets."
    },
    {
      "title": "Dig holes at each point where you marked the ground with your shovel.",
      "content": "Dig holes at each point where you marked the ground with your shovel. Move the swing set out of the way so you can have direct access to each anchor point. Dig each hole to be roughly 12 inches (30 cm) deep and 8 inches (20 cm) in diameter. For maximum safety, always use 4 anchors to secure all 4 legs of the swing set."
    },
    {
      "title": "Drill holes into the sides of each leg of the swing set.",
      "content": "Drill holes into the sides of each leg of the swing set. Use a 3 ⁄ 8 inch (9.5 mm) drill bit to drill a hole on either side of each leg, oriented horizontally. Drill each hole at least 1 inch (2.5 cm) above the bottom of the leg. [2] X Research source This is technically optional if your swing set has wooden legs, since you may be able to screw in the anchors without pre-drilling a hole. However, it’s a much easier process if the legs already have holes in them, especially if they’re made of metal."
    },
    {
      "title": "Place the plate of a concrete anchor at the bottom side of each leg.",
      "content": "Place the plate of a concrete anchor at the bottom side of each leg. Use the materials that came with your anchoring kit for best results. [3] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 24 September 2021. Screw 2 large bolts or screws through each anchoring plate to attach it to its corresponding leg. Slide the bolts into the screw holes of the plate, then use a drill to twist each one into the leg material. [4] X Research source You can purchase an anchoring kit at most home improvement stores and any store that sells supplies for swing sets. Typically, you'll need to use two large bolts or screws to attach each anchoring plate to the corresponding leg."
    },
    {
      "title": "Mix a batch of concrete",
      "content": "Mix a batch of concrete and pour some into each hole. [5] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 24 September 2021. Wait to mix your concrete until just before you’re ready to pour it into the ground. Fill each hole nearly full with concrete, so that there is 1 inch (2.5 cm) between the concrete and the top of the hole. [6] X Research source When mixing the concrete, follow the manufacturer's instructions regarding the correct ratio of concrete mix to water. The ideal texture of the finished concrete should be consistent and very thick. Continue to the next step while the poured concrete remains wet."
    },
    {
      "title": "Place each anchor in the anchoring hole.",
      "content": "Place each anchor in the anchoring hole. Carefully position the swing set over each filled anchoring hole and press the bottom of each anchor plate into the concrete. [7] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 24 September 2021. Insert the bottom of the anchor plate deep enough into the hole so that the entire bottom half of the anchor rests below the concrete. [8] X Research source Be sure that this bottom portion does not stick out of the ground; it could present a safety hazard if it does. For best results, have 1 person hold each leg of the swing set as you lower them into the holes to keep the swing at an even level."
    },
    {
      "title": "Let the concrete dry, then cover the area beneath the swing.",
      "content": "Let the concrete dry, then cover the area beneath the swing. Allow 24 hours for the concrete to fully harden. Then, pack the previously removed soil around the base of each leg and cover the ground area beneath the swing with soft material. [9] X Research source Note that the total amount of time may vary depending on the concrete formula and current weather conditions. Tap on the concrete to test its hardness before use. If you’re using wood mulch or shredded bark mulch, cover the ground beneath the set with at least 9 inches (23 cm) of material. If you’re using uniform wood chips, fine sand, or fine gravel, cover the ground with at least 12 inches (30 cm). For maximum safety, check the swing set once more after covering the area beneath it. Firmly push on each leg of the set. If you anchored the set properly, the pressure should not be enough to cause any leg movement."
    },
    {
      "title": "Position the set, then hammer stakes into the ground under each leg.",
      "content": "Position the set, then hammer stakes into the ground under each leg. Choose the best location for your swing set and temporarily position the set in place. Then, use a hammer to insert a wooden stake into the ground where each leg is positioned. You’ll need to hammer each stake in 1 of 2 ways, depending on if you’re using a 1-piece anchor or a 2-piece anchor: If you’re using a 1-piece anchor, simply hammer each stake directly in front of each leg. If you’re using a 2-piece anchor, insert the wooden stakes into the ground exactly where each leg of the swing set will be. This will require you to have someone move the leg out of the way while you’re hammering."
    },
    {
      "title": "Remove the stakes and twist each anchor into the holes in the ground.",
      "content": "Remove the stakes and twist each anchor into the holes in the ground. Carefully shift the legs of the set to the sides of each marked hole. Then, twist each ground anchor while applying downward pressure to insert it into the soil at each marked position. Be sure to keep the anchor vertical as you twist it into the ground. [10] X Research source Make sure that you insert the anchors into solid ground. Packed soils are better than loose soil or sand, while soils containing clay or covered in dense grass are even better. If you are unable to twist the anchor with your hands, slide a metal bar through the eye of the anchor and use it as a lever to help rotate the anchor down."
    },
    {
      "title": "Attach each leg of the swing set to its corresponding anchor.",
      "content": "Attach each leg of the swing set to its corresponding anchor. [11] X Expert Source Ryaan Tuttle Home Improvement Specialist Expert Interview. 24 September 2021. If you used 1-piece anchors, slide a screw or bolt into the eye of each anchor, then drill the screw directly into the side of the leg near the bottom. If you used 2-piece anchors, place 1 4-by-4 leg attachment at the bottom of each leg. Then, drill this attachment to the leg using 2 3 ⁄ 8 inch (9.5 mm) bolts, drilling each bolt into the side of the leg. The screws or bolts you'll need should come with the anchoring kit. You may need to drill the holes with an appropriately sized drill bit before fitting the bolts into the legs, especially when working with metal sets. Position the swing set back in place so that the legs sit directly next to each anchor. Use a drill to carefully insert each screw through the eye of the anchor and into the bottom side of each leg. Be sure to cover any exposed screws with appropriately sized bolt caps."
    },
    {
      "title": "Fit the upper anchor over the ground anchor, if applicable.",
      "content": "Fit the upper anchor over the ground anchor, if applicable. Line up each leg with each ground anchor, then push the leg attachments onto the revealed ground anchors. Finally, slide a bolt into the corresponding sets of holes on each anchor to secure them to each other. This is only necessary to do if you’re using 2-piece anchors. Match up the screw holes, when applicable. Drill another bolt through each overlapping pair of holes to secure each leg attachment to its corresponding ground anchor."
    },
    {
      "title": "Lay ground covering over the area.",
      "content": "Lay ground covering over the area. Cover the base of each leg with soil or mulch. For added safety, cover the ground beneath the set with additional mulch. After covering the ground, check the swing set by pushing on each leg. If the set does not budge when you apply pressure, you've anchored it successfully. Apply roughly 9 inches (23 cm) of wood mulch or 12 inches (30 cm) of fine sand or fine gravel as your ground covering."
    }
  ]
}