{
  "url": "https://www.wikihow.com/Recognize-Spina-Bifida-Symptoms",
  "title": "How to Recognize Spina Bifida Symptoms",
  "steps": [
    {
      "title": "Check for spinal area discoloration or birthmarks.",
      "content": "Check for spinal area discoloration or birthmarks. The color change could be the spot of neural tube incompletion. There may also be a malformation on the spine. Keep in mind that many birth marks are normal and do not indicate a problem. Ask your doctor to check any birth marks that you have along your spine if you suspect a problem."
    },
    {
      "title": "Feel the spine for fatty lumps, protrusions, or dimples.",
      "content": "Feel the spine for fatty lumps, protrusions, or dimples. There may be a malformation of the bone, fat, or membranes over the spine. This is usually a sign of closed neural tube issues."
    },
    {
      "title": "Look for small clumps of hair along the spine.",
      "content": "Look for small clumps of hair along the spine. When the backbone doesn’t close the way it should, there is sometimes a tuft of hair at the opening. This can be undiagnosed until after birth, as with some other symptoms, because the ultrasound did not show the spine at the correct angle. [3] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Consider potential severe symptoms.",
      "content": "Consider potential severe symptoms. In some cases of spina bifida, there may be some severe symptoms, such as lower body issues, which includes deformities as well as muscle weakness. These may include: Physical and intellectual disabilities. However, most people with spina bifida without hydrocephalus are of normal intelligence. Paralysis. Urinary and bowel control problems. Blindness and/or deafness (rarely). [4] X Research source"
    },
    {
      "title": "Look for an exposed sac of fluid.",
      "content": "Look for an exposed sac of fluid. The sac will be protruding from the spinal column area, which is either the meningocele (no spinal cord connection) or meningomyelocele (spinal cord connection) form of spina bifida. Sometimes there is a thin layer of skin covering the sac that protrudes from the back. Other associated symptoms follow: Partial or total paralysis may occur. Bladder and bowel problems are possible."
    },
    {
      "title": "Look for eating or breathing issues.",
      "content": "Look for eating or breathing issues. A condition called Chiari II malformation is possible, where a portion of the brain protrudes lower into the neck area or spinal canal. This causes various issues, which also includes some upper arm function."
    },
    {
      "title": "Be aware of an abnormally large head.",
      "content": "Be aware of an abnormally large head. A buildup of fluid around the brain, also called hydrocephalus, may occur, creating harmful pressure on the surrounding area. The most common indications of hydrocephalus in babies is an increased head size, but babies can potentially have a litany of symptoms including seizures, drowsiness, grouchiness, lowered eyes, and nausea or vomiting. Babies might develop meningitis, an infection in the tissues surrounding the brain. Meningitis can cause brain injury and threaten the life of the baby. There may be learning disabilities such as short attention span , difficulties with language and reading , and problems with math."
    },
    {
      "title": "Get a spinal column x-ray, MRI, or CT scan.",
      "content": "Get a spinal column x-ray, MRI, or CT scan. Usually this is for spina bifida occulta (SBO), the mildest form of spina bifida, but it can confirm other types as well. The primary method of discovering forms of SBO that may cause problems is an x-ray that can detect a small gap or abnormality of the spine, or less often a spinal cord that is tethered, thickened, contains a fatty lump, is split in two, or connected to skin. This can also be detected using magnetic resonance imaging (MRI), or computed tomography (CT) scan. Most people with SBO don't have any problems. However, there may be some other associated symptoms with SBO, such as: Pain, numbness, or weakness in the back or legs Deformed legs, feet, back Change in bladder or bowel function"
    },
    {
      "title": "Get the maternal serum alpha fetoprotein (MSAFP) test.",
      "content": "Get the maternal serum alpha fetoprotein (MSAFP) test. During the second trimester (it’s not detectable in the first trimester), at roughly 16-18 weeks, spina bifida is typically detected via the MSAFP which measures something called alpha-fetoprotein (AFP). Higher levels of AFP are a potential sign of an uncovered neural tube. Keep in mind that the MSAFP test is not 100% accurate, and further tests may be required."
    },
    {
      "title": "Have an ultrasound.",
      "content": "Have an ultrasound. If your AFP levels are high, then your doctor will probably want to do an ultrasound. An ultrasound can provide images of an unborn baby’s spine and spinal cord, which may enable the doctor to diagnose spina bifida. [5] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Request an amniocentesis.",
      "content": "Request an amniocentesis. During amniocentesis, the doctor extracts some amniotic sac fluid that protects the fetus. Using the fluid, the doctor can screen for high levels of AFP. The one downside to this test, however, is that it is not thorough enough to know the degree to which spina bifida has affected the baby."
    },
    {
      "title": "Ask for an internal scan for spina bifida.",
      "content": "Ask for an internal scan for spina bifida. Scans that are postnatal, after the baby is born, are often the only way milder forms of spina bifida are discovered. An x-ray, MRI, or CT scan examination can be performed. This option is used primarily when the spina bifida symptoms are not clearly visible."
    }
  ]
}