{
  "url": "https://www.wikihow.com/Lower-Ammonia-Levels-in-the-Body",
  "title": "How to Lower Ammonia Levels in the Body",
  "steps": [
    {
      "title": "Consult with your doctor.",
      "content": "Consult with your doctor. Most people that know they need to lower their ammonia levels find this out from their doctors. This problem is usually associated with another health problem, so controlling your ammonia levels will be part of an overall treatment plan. [2] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source High ammonia levels are a common symptom of advanced liver disease (known as cirrhosis), and Reye's syndrome. If you have one of these diseases, it is likely that you will need to work on reducing your ammonia levels."
    },
    {
      "title": "Have your ammonia levels tested.",
      "content": "Have your ammonia levels tested. Before taking medication for high levels of ammonia, you need to verify the problem. Ammonia tests measure the amount of ammonia in the blood, so a blood sample will be required. [3] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Normal ammonia levels range from 15 to 45 µ/dL (11 to 32 µmol/L). [4] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Ammonia levels temporarily rise after exercise, especially strenuous and long-lasting exercise like long-distance running. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Because of this, you should avoid exercise of all kinds as well as smoking before the test. [6] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source"
    },
    {
      "title": "Take Lactulose.",
      "content": "Take Lactulose. Lactulose is a constipation medication that is used to treat high levels of ammonia in the blood. Lactulose works by removing ammonia from the blood and moving it into the colon. Once in the colon, the ammonia is eliminated from the body when you go to the bathroom. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Follow your doctor's instructions for timing and dosage amount for ammonia removal. Typically, two 15 mL (1.0 US tbsp) doses of Lactulose are taken twice a day if you’re an adult. If your doctor has diagnosed you with hepatic encephalopathy, your dosage might be higher (30 to 50 mL (2.0 to 3.4 US tbsp) around 3 times per day). [8] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Lactulose is a liquid typically taken by mouth. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source However, if you have extremely high levels of ammonia and are hospitalized, it may be administered with an enema directly into the digestive system. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Lactulose is sold under a variety of brand names, including Duphalac, Enulose, Generlac, Constulose, and Kristalose. [11] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Manage the side effects.",
      "content": "Manage the side effects. While Lactulose does reduce ammonia in the blood, it also causes several side effects, including diarrhea, gas, and nausea. It was developed to treat constipation, so it pulls water out of the body and into the stool. This causes loose stools and other digestive complications. Talk to your doctor about what you can do to minimize these side effects. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Be sure to hydrate regularly when taking Lactulose. The medication will pull a lot of water out of your body, so you should replace that liquid in order to avoid dehydration. If your side effects are severe and impacting your quality of life, tell your doctor. This could signal that you need your dosage adjusted."
    },
    {
      "title": "Add probiotics",
      "content": "Add probiotics into your diet. Probiotics are beneficial bacteria that help you digest foods and protect you from disease. These bacteria can help your gut to digest and eliminate ammonia more effectively. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Some common foods that add probiotics into your diet include fermented dairy products, such as kefir, and fermented foods, such as sauerkraut. [14] X Research source For example, try to eat a serving of yogurt every day. Yogurt is very high in probiotics and it can help your digestion, as well as your overall health. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Reduce your intake of animal protein.",
      "content": "Reduce your intake of animal protein. Red meat protein is more likely to increase the ammonia in your blood than other types of animal proteins. If you know you have high ammonia levels, it's best to eat other types of meat, such as chicken. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Consider eating a vegetarian diet.",
      "content": "Consider eating a vegetarian diet. Vegetable protein, such as that in beans, digests more slowly than protein that comes from animals. Therefore, your body has more time to dispose of the ammonia created while it is digested. With this in mind, it's best to choose vegetable proteins if you are working to keep your ammonia levels low. Research shows that eating a vegetarian meal could help reduce ammonia levels for people struggling with severe liver disease. [17] X Research source"
    },
    {
      "title": "Limit protein after symptom flareups.",
      "content": "Limit protein after symptom flareups. Ammonia is a byproduct of protein digestion in the body. Because of this, it is important to limit your protein intake if you are experiencing particularly high levels of ammonia in the blood. High levels of ammonia are usually identified due to an increase in symptoms. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For example, if you have liver disease and you are experiencing abnormal brain function, it's a good idea to limit your protein intake as you recover. Confirm with your doctor that a low-protein diet is necessary for your recovery before embarking on one."
    },
    {
      "title": "Take zinc supplements.",
      "content": "Take zinc supplements. Zinc can play an important role in increasing the amount of ammonia that your body is able to excrete. Talk to your doctor about whether a zinc supplement could help your ammonia levels decrease. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Those with liver disease tend to have lower levels of zinc. Since zinc is an important part of normal ammonia disposal, supplementing zinc can help someone with high levels of ammonia get rid of it. [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Talk to your doctor about a multivitamin that you can take.",
      "content": "Talk to your doctor about a multivitamin that you can take. When you have high ammonia levels in the body, it is a signal that your body systems are not working correctly. This can cause a variety of health problems due to lack of essential vitamins and minerals. To offset this risk, talk to your doctor about taking a daily multivitamin that can give you many of the nutrients that you need. Having your doctor approve your exact multivitamin and dosage will minimize the chance of you taking something that could have a negative impact on your liver function and ammonia levels. For instance, vitamin A in very high doses has been known to cause liver toxicity. [21] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Take glutamine supplements.",
      "content": "Take glutamine supplements. Glutamine supplements have been shown to decrease ammonia levels in endurance athletes. Talk to your doctor about whether taking this supplement might help manage your ammonia levels. [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Glutamine supplementation can be dangerous in people with liver failure. It’s important to discuss any supplements with your doctor before taking them. [23] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}