{
  "url": "https://www.wikihow.com/Organize-Spotify-Playlists",
  "title": "How to Organize Spotify Playlists",
  "steps": [
    {
      "title": "Open the Spotify desktop app or web version.",
      "content": "Open the Spotify desktop app or web version. Spotify only allows you to create folders using the desktop app or website. Right-click anywhere in the playlists sidebar. Then click on \"Create folder\". Folders are a great way to organize your playlists into categories. [1] X Research source"
    },
    {
      "title": "Name the folder.",
      "content": "Name the folder. Right-click the new folder you just created (it will appear in the playlists sidebar). Click on “Rename,” type in a title, and press enter on your keyboard. You can name your folders whatever you like. You can create folders based on genre of music, mood, or occasion. Here are some fun examples: Workout, Chill, Party, Indie, Driving Playlists, or Playlists from High School. [2] X Research source"
    },
    {
      "title": "Drag and drop playlists into a folder.",
      "content": "Drag and drop playlists into a folder. Once you have created your folder (or folders), click, drag, and drop a playlist into the folder. This can all be done using the left sidebar. [3] X Research source"
    },
    {
      "title": "Create a folder within a folder.",
      "content": "Create a folder within a folder. If there’s one folder that has a lot of playlists, you may want to create more specific folders within it. To do so, right click the folder in the sidebar and click on “Create folder.” Follow the previous steps for renaming and adding playlists to it."
    },
    {
      "title": "View your folders on mobile (optional).",
      "content": "View your folders on mobile (optional). Even though you can only create folders using the desktop version, you'll still be able to see them on the Spotify mobile app. Simply go to \"Your Library\" and \"Playlists\" on your phone. Scroll through your playlists to see the folders you created. Tap on any folder to view the playlists inside!"
    },
    {
      "title": "Open up a playlist.",
      "content": "Open up a playlist. On the mobile app, go to Your Library” and “Playlists.” Tap on a playlist you want to rearrange."
    },
    {
      "title": "Manually drag and drop tracks to reorder them.",
      "content": "Manually drag and drop tracks to reorder them. First tap on the three dots located underneath the playlist title on an iOS device, or in the top right corner on an Android. Then tap “Edit.” Tap and hold the three lines next to a particular song, dragging it to a new spot within the playlist. Tap “Save” in the top right corner when you’ve finished reorganizing."
    },
    {
      "title": "Alphabetize the playlist by title, artist, or album.",
      "content": "Alphabetize the playlist by title, artist, or album. Do so by swiping down on the playlist's page and tapping the button in the top right corner. On an iOS device, this button is labeled \"Filters.\" On an Android, it appears as three lines. Now tap on “Title,” “Artist,” or “Album” to organize your playlist from A-Z (following the category you specified)."
    },
    {
      "title": "Sort by date added.",
      "content": "Sort by date added. Swipe down again and tap on \"Filters\" or the three lines. Tap \"Recently added\" to organize from least to most recently added."
    },
    {
      "title": "Open up a playlist.",
      "content": "Open up a playlist. On the desktop app or web version, go to “Your Library” and “Playlists.” Click on a playlist you want to rearrange."
    },
    {
      "title": "Manually drag and drop tracks to reorder them.",
      "content": "Manually drag and drop tracks to reorder them. Click, hold, and drag a track to a new spot within the playlist. [4] X Research source"
    },
    {
      "title": "Alphabetize the playlist by title, artist, or album.",
      "content": "Alphabetize the playlist by title, artist, or album. Click the “Custom Order” button to the right of the title. Now click on “Title,” “Artist,” or “Album” to organize your playlist from A-Z. If you click on any of these buttons twice in a row, it will organize from Z-A. To revert back to the original order, simply click on “Custom Order” again. Keep in mind that the title of this button will change to whichever category you’ve most recently chosen (so if you organize by title, it will appear as “Title” instead of “Custom Order”)."
    },
    {
      "title": "Sort by date added or duration.",
      "content": "Sort by date added or duration. Click the “Custom Order” button again and click “Date added” or “Duration.” If you choose \"Date added,\" it will sort by least to most recently added. If you choose \"Duration,\" it will sort by shortest to longest in length. Clicking either button twice in a row will organize it the other way around. [5] X Research source"
    },
    {
      "title": "Go to your playlists.",
      "content": "Go to your playlists. On the desktop app or web version, click on “Your Library” near the top of the left menu. If you aren’t automatically directed to playlists, click the “Playlists” button on the top menu bar. On the mobile app, “Your Library” is located on the bottom right corner of your screen. From here, tap on the “Playlists” button in the top menu bar."
    },
    {
      "title": "Scroll through your playlists.",
      "content": "Scroll through your playlists. Let’s say you run across some playlists that you don’t use or want (perhaps there's one tied to a specific memory you’d rather not keep). Go ahead and delete them!"
    },
    {
      "title": "Right-click on a playlist you want to delete.",
      "content": "Right-click on a playlist you want to delete. Simply click on “Delete” and watch it vanish from your library! If you want to remove a playlist that someone else created, you won’t see “Delete” because you can’t actually delete it. Instead, click on “Remove from Your Library.” [6] X Research source On a mobile device, tap on the playlist. If it’s a playlist you created, tap on the three dots located underneath the title (on iOS devices) or in the top right corner (on Androids). Now tap on “Delete.” If someone else created it, simply tap on the green heart underneath the title to remove it from your library."
    },
    {
      "title": "Archive playlists instead of deleting them (optional).",
      "content": "Archive playlists instead of deleting them (optional). If you don’t want to delete a playlist, you can consider creating a folder titled something like “Archive.” You can put any of your unused playlists here that you don't actively want to view in your library."
    }
  ]
}