{
  "url": "https://www.wikihow.com/Get-Rid-of-the-Fishy-Smell-from-My-Dog",
  "title": "How to Get Rid of the Fishy Smell from My Dog",
  "steps": [
    {
      "title": "Swollen anal sacs.",
      "content": "Swollen anal sacs. Anal sacs release a liquid scent marker whenever your dog poops. (This is why your dog sniffs other dogs’ butts and poop!) This scent marker always has a slightly fishy smell, but here are signs of watch out for if you notice a really fishy odor: [1] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Scooting, licking, and other signs of discomfort . If your dog scoots its butt across the floor, or licks and bites at its anus excessively, it probably has swollen anal sacs. Obvious swelling to the left and right of the anal opening . Dogs have two anal sacs, one on each side of the anal opening. If you see puffed-out bumps just to the left and right of the opening, assume that your dog has swollen anal sacs. Evidence of less common but more serious issues . If you see blood or pus oozing from either anal sac, or if they’re red and noticeably warm to the touch, the sacs may be infected. If either anal sac is swollen and extremely hard to the touch (instead of still slightly squishy), your dog may have a tumor. Take your dog to the vet ASAP in either case. Only a vet can assess whether or not it's due to an infection."
    },
    {
      "title": "Urinary tract infection (UTI).",
      "content": "Urinary tract infection (UTI). This is a strong possibility if your dog’s urine has a fishy odor. But you should also suspect a UTI if your dog’s urine odor has changed significantly, or has become especially pungent (even if not fishy). Contact your vet if you suspect a UTI. [2] X Research source Bladder infections and kidney stones can also occasionally cause a fishy urine odor."
    },
    {
      "title": "Pyometra.",
      "content": "Pyometra. This is an infection of the uterus in female dogs that haven’t been spayed. Along with a fishy odor, watch for symptoms like vaginal discharge, frequent urination, fatigue, abdominal swelling, and reduced appetite. [3] X Research source Get in touch with your vet right away if you suspect pyometra."
    },
    {
      "title": "Periodontal disease.",
      "content": "Periodontal disease. An infection of the gums can give your dog fishy-smelling breath. Improved dental care—like brushing your dog’s teeth—won’t solve the problem on its own, so contact your vet for a proper diagnosis and treatment plan. [4] X Research source While less common, fishy-smelling breath can also indicate kidney disease, digestive problems, or diabetes. So don’t ignore your dog’s stinky breath!"
    },
    {
      "title": "Call your vet if you suspect any type of anal sac problem.",
      "content": "Call your vet if you suspect any type of anal sac problem. While you’re probably dealing with a minor (if smelly) issue that can be easily remedied, there is a chance that you’re dealing with something more serious. Unless your dog’s veterinarian has already instructed you on what to look for and what to do, contact them instead of attempting any at-home treatments. [5] X Research source Ignoring swollen anal sacs can be dangerous for your dog, but improperly treating them can be just as dangerous for your pet."
    },
    {
      "title": "Observe while your vet or groomer “expresses” the swollen sacs.",
      "content": "Observe while your vet or groomer “expresses” the swollen sacs. When you contact your vet and explain the situation, they may have you come to their office or send you to a professional groomer to get the anal sacs “expressed”—that is, gently squeezed out. With the proper know-how, expressing anal sacs is quick, easy, and painless for the dog—but it’s also messy and smelly work! [6] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source The scent marker fluid expressed by the anal glands thickens up inside swollen anal sacs, so it comes out as brown, smelly, paste-like gunk when the sacs are squeezed. If you get queasy easily and have no plans on ever doing this task yourself, stay near your dog’s head and keep your pal calm."
    },
    {
      "title": "Do the job yourself only with your vet’s approval and instruction.",
      "content": "Do the job yourself only with your vet’s approval and instruction. For your dog’s safety, do not try to express the anal sacs without the right training. If this is a recurring problem for your dog, your vet might explain when to express the sacs and show you how to do it properly. [7] X Research source Small dogs are more likely to have recurring anal sac swelling. If you have a small dog, your vet may try to spare you from frequent office visits by showing you how to express the sacs yourself. Once you know what you’re doing, expressing anal sacs is a straightforward pet care task. But it’s definitely okay to leave this gunky, stinky job up to the pros! [8] X Research source"
    },
    {
      "title": "Take healthy steps to prevent recurring anal sac problems.",
      "content": "Take healthy steps to prevent recurring anal sac problems. While some dogs, especially smaller breeds, are simply more likely to have anal sac problems, keeping your dog healthy definitely reduces the odds. No matter your dog’s size or prior history of anal sac issues, take preventative measures like the following: [9] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Feed your dog a high-fiber diet so they pass bulky, fully-formed stools. Adding a tablespoon of pumpkin to your dog's food daily might help with this. Keep your dog hydrated so their stools aren’t rock hard. Exercise your dog regularly to maintain a healthy weight."
    },
    {
      "title": "Treat any diagnosed medical condition(s) causing the odor.",
      "content": "Treat any diagnosed medical condition(s) causing the odor. Swollen anal sacs . See the relevant section of this wikiHow article. Urinary tract infection (UTI) . After proper diagnoses by your vet, give your dog an antibiotic and pain reliever as prescribed. Ask your vet whether dietary changes or supplements might help prevent future UTIs. [10] X Research source Pyometra (uterine infection) . The most common treatment is ovariohysterectomy—surgical removal of the ovaries and uterus. However, other medical treatments may be available, so talk to your vet about your options. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Periodontal (gum) disease . Treatment typically involves a very thorough cleaning of the teeth and gums by your vet, followed by daily oral care instructions and dietary changes for you to manage at home. [12] X Research source"
    },
    {
      "title": "Clean the area around your dog’s butt daily.",
      "content": "Clean the area around your dog’s butt daily. Dampen a soft cloth with warm water and a mild, dog-friendly soap, or buy pre-moistened wipes designed for dogs. Lift your dog’s tail and wipe away any poop residue you can see, along with the fishy-smelling scent marker residue that you can’t see. Pat your pup’s rear end dry with a soft cloth to avoid trapping moisture under its tail. [13] X Research source A healthy dog expresses some scent marker fluid each time it poops, and might also do so when it’s startled or scared. After cleaning the area, consider spraying on a light coating of a product intended to prevent dirt (and poop) from sticking to dog hair."
    },
    {
      "title": "Bathe your dog as often as once per week.",
      "content": "Bathe your dog as often as once per week. The basics of bathing a dog are pretty straightforward: wet down the dog from neck to tail with warm water. Massage in a dog-friendly shampoo (not one meant for people) with your hands. Rinse out the shampoo with warm water, then pat your dog dry and brush through its fur. Wash its face separately with a soft, damp washcloth without soap or shampoo. Don’t bathe your dog more than once a week—except in the occasional emergency bath if it gets really dirty or smelly—unless your vet okays doing so. If they don’t have an odor problem, indoor dogs can go up to a few months between baths."
    },
    {
      "title": "Launder smelly dog bedding at least weekly.",
      "content": "Launder smelly dog bedding at least weekly. Add 1-2 big scoops of baking soda to the washing machine, then add the bedding, doggie towels, and other washer-friendly items. Use your regular detergent and wash cycle, and air dry the items if possible. If the items still smell fishy, try an enzymatic washing machine detergent along with baking soda. [14] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Enzymatic cleaners contain helpful bacteria that release enzymes to break down odor-causing molecules, which can then in turn be gobbled up by the bacteria."
    },
    {
      "title": "Try using baking soda or vinegar to fight fishy smells in your home.",
      "content": "Try using baking soda or vinegar to fight fishy smells in your home. To tackle dog odors on carpets, rugs, and upholstery, sprinkle on a light coating of baking soda, wait 30 minutes, then vacuum it up. Alternatively, mix 1 part apple cider vinegar and 3 parts water in a spray bottle. Mist the smelly areas, then blot away the surface moisture with a clean rag. For solid surfaces, spray on and wipe off the cider vinegar mixture like you would any other household cleaning spray."
    },
    {
      "title": "Use an enzymatic cleaner for lingering household odor.",
      "content": "Use an enzymatic cleaner for lingering household odor. Like enzymatic laundry detergents, enzyme-based odor eliminators use beneficial bacteria to break down and gobble up stink-causing particles. Enzymatic cleaners are safe for most household surfaces, but always follow the instructions for your chosen product. [15] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source You can try a general-purpose enzymatic cleaner, or one that’s designed specifically to combat pet (or even just dog) odors."
    }
  ]
}