{
  "url": "https://www.wikihow.com/Increase-Xbox-One-Download-Speed",
  "title": "How to Increase Xbox One Download Speed",
  "steps": [
    {
      "title": "Running other games can slow down your Xbox’s download speed.",
      "content": "Running other games can slow down your Xbox’s download speed. Playing other games while waiting for your download is fun, but it can also sap a lot of energy! Multiplayer games and video streaming apps especially use up a lot of internet bandwidth. To make your Xbox run faster, go through each of your open games and apps and close them for the duration of the download. [1] X Research source Press the central Xbox button on your controller. Navigate to the game you want to close in the left sidebar that pops up. Once the game is highlighted, press the small Menu button with 3 horizontal lines. Another menu will pop up. Scroll down to the “Quit” option and press A to select it."
    },
    {
      "title": "Suspend a game to increase download speeds without losing progress.",
      "content": "Suspend a game to increase download speeds without losing progress. Sometimes, you might not want to fully quit your game just to speed up a download—and in those cases, suspending your game is the happy medium. You still won’t be able to play games during the download, but once it has finished, you can pick up right where you left off. [2] X Research source To suspend a game: Press the central Xbox button on your controller and scroll to “My games and apps.” Press A to select that option. Navigate to “See all” and press A again to select it. Select “Manage” and highlight the “Queue” on the right. Then, press A to select it. A message will pop up. Highlight the “Suspend my game” option and press A to confirm."
    },
    {
      "title": "Your Xbox works faster when it tackles one download at a time.",
      "content": "Your Xbox works faster when it tackles one download at a time. Sometimes, other game updates will get automatically added to your Xbox’s download queue and start downloading simultaneously. When your Xbox downloads multiple items, it usually takes a lot longer to get done. Go to your download queue, pause any other updates, and save them for later. [3] X Research source Press the central Xbox button on your controller, scroll to “My games and apps,” and press A. Then, highlight “See all” and press A again. Select “Manage” on the left side of the screen and then navigate to “Queue” and select it by pressing A. Highlight a download you want to pause and press the “Menu” button. Scroll down to the “Pause” option and press A."
    },
    {
      "title": "Disconnecting other devices strengthens your Xbox’s Wi-Fi connection.",
      "content": "Disconnecting other devices strengthens your Xbox’s Wi-Fi connection. If you can, disconnect every other device currently using the same Wi-Fi in your home, including computers, tablets, phones, and other consoles. Don’t stream videos using the Wi-Fi or download anything else from another device. Your Xbox will get more Mbps when it’s the only device using Wi-Fi. [4] X Research source Mbps (megabits per second) is the speed at which your Xbox downloads content. When many devices are on the same Wi-FI network, your Xbox can’t get as many Mbps because it has a weaker internet connection."
    },
    {
      "title": "Restarting the download may correct any issues slowing it down.",
      "content": "Restarting the download may correct any issues slowing it down. Open up “My games & apps” select “See all,” and then “Manage.” Then, click “Queue” and highlight the game you’re currently downloading. Press the “Menu” button, navigate to “Cancel,” and press A. Once the download is canceled, you can prompt your Xbox to re-download and install it from scratch. [5] X Research source To re-install, insert the game disc or re-download your game from the Microsoft Store app on your Xbox. Once the download starts, check the speed to see if it has improved!"
    },
    {
      "title": "Make sure your Xbox is properly connected to the internet.",
      "content": "Make sure your Xbox is properly connected to the internet . First, pause all downloads and close any games that are currently running. Then, press the Xbox button to open the guide and select “Profile & system.” Navigate to “Settings,” and from there, go to “General” and then “Network settings.” Select “Test network connection.” [6] X Research source If your Xbox isn’t properly connected, it may have connectivity problems and require a hard restart. It might also mean that your internet router is having an issue and needs rebooting."
    },
    {
      "title": "Restarting can correct a potential Wi-Fi connectivity issue.",
      "content": "Restarting can correct a potential Wi-Fi connectivity issue. You never know when your Xbox might have a minor connectivity issue—but luckily, they’re usually easy to solve. Restart your Xbox completely by pressing the Xbox button and navigating to the “Profile & System” menu. Press A to select “Power,” then navigate to “Restart console” and press A again. [7] X Research source You can also force your Xbox One to do a hard restart by pressing and holding the glowing Xbox logo power button on the console. Keep pressing until the Xbox fully switches off, then wait a few seconds and restart it."
    },
    {
      "title": "Rebooting the router improves its performance—and the Xbox’s speed.",
      "content": "Rebooting the router improves its performance—and the Xbox’s speed. Sometimes slow download speeds on your Xbox are actually due to an issue with your router and not the Xbox. To ensure your router is working properly, disconnect it from the wall to turn it off entirely. Wait for about 10 seconds, and then plug it back in. Once you reset your internet , the Xbox’s download speeds may improve. [8] X Research source"
    },
    {
      "title": "Ethernet cables guarantee a faster and more stable internet connection.",
      "content": "Ethernet cables guarantee a faster and more stable internet connection. Get an ethernet cable and directly connect your router to your Xbox One. You’ll still be using your internet, but the connection will be stronger because of the ethernet cable. Once the cable is connected, try the download again, and you’ll likely get way more Mbps on your Xbox. There’s an ethernet (or LAN) port in the back of your Xbox One. You’ll find the port in the lower right corner of the machine, besides the infrared output slot. The other end of the cable goes into your router’s ethernet port."
    },
    {
      "title": "Sleep Mode saves time by downloading while the console is idle.",
      "content": "Sleep Mode saves time by downloading while the console is idle. First, enable automatic updates on your Xbox One. That means your Xbox will automatically queue and download game updates when they become available. [9] X Research source Then, enable Sleep Mode downloads to get automatic updates when the Xbox is asleep. That way, other downloads won’t get in the way when you need to install a new game. [10] X Research source To enable automatic updates, press the Xbox button and go to “Profile & System.” Press A to select “Settings” and then “System.” Select “Updates” on the right panel. Once you’re in the “Updates” section, check the boxes for “Keep my console up to date” and “Keep my games and apps up to date.” To enable Sleep Mode downloads, press B to navigate to “System” and select “Settings.” Go to the “General” tab and then select “Sleep mode & startup,” which may also appear as “Power mode & startup.” Go to “Power Mode” and choose “Instant On” (which may instead appear as “Standby”) and uncheck both the “Wake up Xbox by saying ‘Xbox On” and “When Xbox is off, turn off storage” boxes."
    },
    {
      "title": "A static IP stabilizes your Xbox’s internet connection permanently.",
      "content": "A static IP stabilizes your Xbox’s internet connection permanently. It’s a fixed number that stays the same each time your console connects to Wi-Fi. If there are other devices connected to the Wi-Fi, your Xbox’s connection will be significantly quicker and stronger regardless—therefore improving download times. You don’t need a static IP address if you have an ethernet cable! Press the Xbox button and navigate to “Profile & systems.” Then go from “Settings” to “General” to “Network Settings” and then to “Advanced Settings.” Write down the IP address, Subnet Mask, and Gateway Address listed. Then, select “IP Settings” and go to “Manual.” Type in the IP address you wrote down, but add 50 to the last digit. For example, if the original IP address’s last digit is “1,” then type “51” as the new final number. Finally, type in the Subnet Mask and Gateway Address exactly as you wrote them down."
    },
    {
      "title": "A public DNS address can increase your Xbox’s internet speeds.",
      "content": "A public DNS address can increase your Xbox’s internet speeds. DNS, or “Domain Name System,” connects you to the websites you want to visit by matching the site’s name and IP address. The stronger the DNS server you’re connected to, the quicker your download speeds will be! Manually set up a public DNS address using a free DNS option like Cloudflare , OpenDNS , Quad9 , or Google . [11] X Research source Go back to “Advanced Settings” and select “DNS Settings,” then “Manual.” Input the primary and secondary DNS values from your public address of choice and test the connection to ensure it works. Cloudflare’s primary DNS is 1.1.1.1, and its secondary is 1.0.0.1. Google’s primary DNS is 8.8.8.8, and its secondary is 8.8.4.4. OpenDNS Home’s primary DNS is 208.67.222.222, and its secondary is 208.67.220.220. Quad9’s primary DNS is 9.9.9.9, and its secondary is 149.112.112.112."
    },
    {
      "title": "Download speed on Xbox improves when fewer people use the online store.",
      "content": "Download speed on Xbox improves when fewer people use the online store. The most popular times to play Xbox are in the afternoon and evening. Due to the sheer number of people downloading games at once, your Xbox’s download speed might get slower. Start downloads in the morning, or leave your Xbox downloading overnight, so it doesn’t compete with everyone else. [12] X Research source"
    }
  ]
}