{
  "url": "https://www.wikihow.com/Come-Down-from-a-High",
  "title": "How to Stop Being High: 10 Tips for Coming Down Faster",
  "steps": [
    {
      "title": "Take a few deep breaths.",
      "content": "Take a few deep breaths. Deep breaths are a fool-proof way to calm yourself down. Sit or lie down somewhere comfortable and close your eyes. [1] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 7 February 2020. Then, place your hand on your stomach and inhale slowly through your nose. Feel your stomach push your hand out as you inhale. Then, slowly exhale through your mouth. Repeat this several times. [2] X Research source"
    },
    {
      "title": "Drink some water.",
      "content": "Drink some water. Feeling dehydrated or thirsty can make a high feel more intense. To hydrate yourself so you feel calmer and centered, fill up a glass with cold water, and slowly sip on it. When you’re finished, assess how you feel and get more water if you’re still thirsty. [3] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 7 February 2020. Avoid drinking sodas, energy drinks, or alcohol or you could end up feeling more dehydrated. It might also help to eat a snack or a small meal. Foods rich in carbohydrates, like crackers or a granola bar, can help make you feel better quickly. [4] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 7 February 2020."
    },
    {
      "title": "Open a window for some fresh air.",
      "content": "Open a window for some fresh air. Sometimes sitting in a dark, stuffy room can make you feel a little on edge. If you’re indoors, try opening a nearby window to let in some fresh air and natural light. If there’s a nice view, sit by the window and look at the scenery — it might help calm you down so you can focus on getting over your high. [5] X Research source"
    },
    {
      "title": "Put on some calming music or a movie.",
      "content": "Put on some calming music or a movie. Having something to listen to or watch can help distract you from any thoughts racing around in your head. If you have somewhere you need to be, leave the music or movie on in the background while you’re getting ready so you have something to listen to. Listen to calm, happy songs that you already know and like. If you decide to put on a movie, go with something lighthearted like a comedy or a nature documentary."
    },
    {
      "title": "Try to go to sleep if you have nowhere you need to be.",
      "content": "Try to go to sleep if you have nowhere you need to be. If you don’t have anywhere to be for the rest of the day, get comfortable in bed and try sleeping off your high. When you wake up, you’ll feel refreshed and you probably won't feel high anymore!"
    },
    {
      "title": "Hop in the shower.",
      "content": "Hop in the shower. Showering can help wake you up so you feel more alert and less high. While a cold shower might wake you up faster, a warm shower should still do the trick. While you’re in the shower, let the water run over your face for a little bit to help wake you up even more."
    },
    {
      "title": "Drink a cup of coffee.",
      "content": "Drink a cup of coffee. If you’re not a morning person, you probably know how much coffee helps when you need to wake up and focus. Make yourself a cup of coffee and sip on it to help clear up any fogginess from your high so you’re more alert. [6] X Research source Keep in mind that the caffeine in coffee can increase your heart rate and make you feel more anxious. If you’re already feeling anxious from your high, you may want to skip out on coffee or wait until you’ve calmed down."
    },
    {
      "title": "Do some light exercising so you feel more awake.",
      "content": "Do some light exercising so you feel more awake. Exercising releases endorphins, which can help alleviate any anxiety you’re feeling and make you more alert. Find a comfortable spot on the floor and do exercises like push-ups, sit-ups, squats, and stretches. If you’re not feeling up for exercising, try doing yoga instead. If you’re feeling really high, avoid exercising with heavy weights or equipment or you could injure yourself."
    },
    {
      "title": "Go for a walk outside.",
      "content": "Go for a walk outside. Like exercising, taking a walk can release endorphins and make you feel more alert. The fresh air and natural light outside might also help lessen the effects of your high. If you’re worried about running into someone while you’re high, take a low-traffic route and avoid walking near large groups of people. [7] X Research source"
    },
    {
      "title": "Put in eye drops if your eyes are feeling groggy.",
      "content": "Put in eye drops if your eyes are feeling groggy. Eye drops can help clear up your eyes and make you feel a little more alert and awake. They'll also help reduce any redness in your eyes from your high."
    }
  ]
}