{
  "url": "https://www.wikihow.com/Discipline-Children-in-the-Classroom",
  "title": "How to Discipline Children in the Classroom",
  "steps": [
    {
      "title": "Understand the difference between punishment and positive discipline.",
      "content": "Understand the difference between punishment and positive discipline. Positive discipline is a type of discipline that uses positive alternatives and non-violent methods to respect and reward children when they behave well and to correct any negative behavior. Unlike punishment, positive discipline does not advocate the use of shame, ridicule, aggression or violence to correct student behavior. This type of discipline argues that students respond better to positive approaches, like choice, negotiation, discussion, and a system of rewards. [3] X Research source As a teacher, you will also have more control over your classroom using positive discipline, as you will be advocating the students to make choices and decisions for themselves, rather than try to force them to act correctly. This type of discipline can also lead to long term peace in the classroom, as students will learn how to self correct and how to come up with solutions or issues among themselves. Focus on redirecting behaviors, rather than punishing them. [4] X Expert Source César de León, M.Ed. Educational Leadership Consultant Expert Interview. 11 November 2020."
    },
    {
      "title": "Note the seven principles of positive discipline.",
      "content": "Note the seven principles of positive discipline. Positive discipline is based on seven key principles, which can act as classroom rules for you in your role as the teacher or leader. The seven principles are: [5] X Research source To respect the child's dignity. To develop pro-social behavior and encourage self-discipline. To maximize the child's participation in class discussion. To respect the child's developmental needs and quality of life. To respect the child's motivation and life views. To assure fairness and justice through equality and non-discrimination. To promote solidarity among students in the classroom."
    },
    {
      "title": "Follow the four steps of positive discipline.",
      "content": "Follow the four steps of positive discipline. Positive discipline is based on a four-step process that recognized appropriate behavior in the classroom and rewards the behavior. You can apply these steps to an individual student or to the classroom as a whole. [6] X Research source First, describe the appropriate behavior you are expecting from the individual or the class. For example, if you are trying to get the class to settle down, you may say: “Class, please quiet down now.” Then, provide reasons why this behavior is appropriate. For example: “We are going to start our English lesson and it is important that you all listen closely to me.” Ask for acknowledgement from the class about the appropriate behavior. For example:“Do you all see why quieting down is so important?” Reinforce the correct behavior with eye contact, a nod or a smile. You can also reinforce the class' good behavior with five extra minutes of play time or another marble in the reward jar. If you are reinforcing individual behavior, you may give extra credit points to the student or put a star by his/her name. Always provide a reward for good behavior immediately and clearly. You want to make the students feel they are on the winning team and to praise individual students for being a good team member."
    },
    {
      "title": "Apply positive discipline in your classroom.",
      "content": "Apply positive discipline in your classroom. When using positive disciple, follow the 4:1 ratio. This means you should try to catch a student or the class doing something correctly four time for every one time you find them doing something inappropriate. Be consistent with this ratio, as this will show your students you are more interested in rewards and acknowledging appropriate actions rather than punishment. [7] X Research source Keep in mind positive discipline can fail is the student or the class is not rewarded quickly enough and clearly enough. Make sure you always follow through with a reward for appropriate behavior. Always emphasize the task, rather than the behavior. Focus on positive tasks like quieting down and being considerate of others, rather than behaviors like no talking or no shouting. For example, you may use an acknowledgment comment like, “It's important that we quiet down so we can be considerate of what others have to say,” rather than an acknowledgement comment like, “It's important that you stop talking and focus.” Don't take behavior outbursts personally. Students aren't robots—they have strong emotions sometimes, and they need to learn how to cope with those. [8] X Expert Source César de León, M.Ed. Educational Leadership Consultant Expert Interview. 11 November 2020."
    },
    {
      "title": "Decide on basic classroom rules.",
      "content": "Decide on basic classroom rules. Choose at least four to five simple rules for the classroom and write them down. You will use these rules to manage the classroom and establish boundaries among your students. [9] X Research source Your rules may include: all students must come to class on time and ready to learn, all students must be prepared to listen and ask questions by raising their hand, and all students must be aware of the consequences of missing class or turning in assignments late. You may also have a rule about playing fair with others in the classroom and listening respectfully to others when they speak. Make sure you have at least one to two rules that directly address discipline and behavior towards others in the classroom."
    },
    {
      "title": "Share these rules and expectations with the class on the first day of school.",
      "content": "Share these rules and expectations with the class on the first day of school. Start the school year on the right foot by printing out the rules and handing them out to all students. You can also post them on the blackboard or put them on the class' online message board so they are readily available throughout the school year. Explain to your students that you expect them to all follow these four to five rules and to enforce these rules among themselves."
    },
    {
      "title": "Discuss the negative consequences and positive consequences of the rules.",
      "content": "Discuss the negative consequences and positive consequences of the rules. You should be clear about the negative consequences of disruptive behavior in class. If a student talks over another student when he/she is speaking, for example, this could be considered disruptive and the consequence could be a reprimand from you. As well, if one student refuses to share an item with another student, this could be considered a violation of the rules and could lead to points deducted from his/her participation grade. Explain possible situations that may be considered disruptive or against the rules of the classroom. [10] X Research source You should also discuss the positive consequences of following the classroom rules, such as verbal praise, or entering a class raffle for a prize. You may also use the star system, where a student who follows the rules receives a gold star beside his/her name or a check mark. Group rewards can be effective, where you put a marble in a jar every time the group interacts well and follows the rules, and when the marbles reach a certain height in the jar, the entire class is allowed to go on a special field trip or event. Once you explain the rules and expectations of the classroom, you should have the class verbally agree to the rules or raise their hands to show they understand the rules. This will act as a commitment to the class rules by everyone in the room."
    },
    {
      "title": "Give a copy of the rules to parents during the first week of school.",
      "content": "Give a copy of the rules to parents during the first week of school. Doing this will ensure parents are aware of your classroom rules and understand how you will discipline your students. Parents may need to be involved in classroom issues if they get out of control, so it will be useful to share the classroom rules in the first week of class. [11] X Research source You can also ask parents to go over the rules with their children at home so the rules are clear. This will also signal to children that their parents approve of the classroom rules."
    },
    {
      "title": "Review the rules on a regular basis.",
      "content": "Review the rules on a regular basis. Children respond to fair, consistent behavior, and will often lead by example. Make sure you review the rules and expectations for the classroom at least once a week so your students can remember them. It is also important that you ask your students if they have any questions or concerns about the rules. Some students may feel a certain rule needs to be more specific or to be adjusted. Be open to a discussion about the classroom rules and allow your students to voice their opinions. Though you may decide not to shift or adjust any rules, this will show students that you respect their opinion and indicate they are thinking critically about the rules."
    },
    {
      "title": "Put the rules into action.",
      "content": "Put the rules into action. In the event of an issue or problem in the classroom, draw on the established rules and expectations for the students. Do not be afraid to be strict about the rules, as this is the only way they will be enforced in the classroom. Be prepared to give out appropriate punishments, but avoid yelling or getting angry at students. Instead, use punishments that encourage self awareness and discussion, rather than humiliation or embarrassment. [12] X Research source You should also try to maintain positive consequences throughout the school year when a student or the class follow the rules. This will remind the class that the rules are made to reward, as well as to discipline."
    },
    {
      "title": "Create an agenda book and a solutions book.",
      "content": "Create an agenda book and a solutions book. Get two blank notebooks and label one the agenda book and one the solutions book. The agenda book will be for any issues or problems in the classroom and the solutions book will be for any solutions or answers to the issues or problems. You will collaborate with the class to address any issues noted in the agenda and work together to write down possible solutions in the solutions book. This form of discipline, known as democratic discipline, will help to reinforce critical thinking in the classroom and get your students actively involved in finding solutions to issues or problems. As the teacher, you will facilitate these discussions and make suggestions, but you will also rely on the students to provide ideas and feedback."
    },
    {
      "title": "Explain the purpose of the agenda to the class on the first day of school.",
      "content": "Explain the purpose of the agenda to the class on the first day of school. On the first day of school, present the two books to the class. Start by explaining that the classroom is going to be a space where all students are respected and their opinions are heard. You can also reinforce that you will be depending on the class to come up with solutions to issues or problems that arise during the school year. You will help to guide these discussions, but you also want the students to feel they can discuss and create solutions on their own. You can then show the class an issue or problem from last year that you wrote down in the agenda book. For example, you may discuss issues that came up during the line up for lunch. In the line up, some students got annoyed or hurt when other students cut them off or pushed them as they tried to get in line."
    },
    {
      "title": "Have the class help you come up with solutions to an example issue.",
      "content": "Have the class help you come up with solutions to an example issue. Ask the class for suggestions on how to line up in a respectful way. As students start to provide possible solutions, write them on the board. Write down every student's solution, even solutions that seem silly or improbable. For example, you may have solutions like calling the students in alphabetical order to line up, allowing boys to line up first, having students run as fast as they can to the front of the line, or calling each table in random order to line up."
    },
    {
      "title": "Analyze the possible solutions.",
      "content": "Analyze the possible solutions. You will then tell the class that because this is your problem, you will analyze the pros and cons of each solution and choose one to try out for a week. Explain to the class that: “whoever has the problem gets to choose the solution.” Analyze each solution out loud so the class can listen to your reasoning. For example, you might begin with: “If I choose the boys before the girls, then the girls will be left out and we don't want that. But if I call the names in alphabetical order, the A's will always be first. Running fast to the line up could lead to injuries or more students getting hurt. So, I think I'll choose the calling each table in random order option.” Use the solution for the following week when the students line up for lunch and ask the class before they line up, “Who remembers our solution for lining up for lunch?” or “Raise your hand if you remember how we decided to line up.” This will reinforce the decision and show the students that you are willing to put the chosen solution into practice."
    },
    {
      "title": "Use the agenda book and the solutions book throughout the school year.",
      "content": "Use the agenda book and the solutions book throughout the school year. Now that you have established how to use the agenda book and the solution book to the students, encourage them to use the books to record any issues and to discuss possible solutions with the class. Check the agenda book every day and address any issues in the book. Ask the student who wrote down the issue to ask the class for possible solutions for the issue. Once the student has three to four possible solutions, guide him/her as he/she decides which solution to try for a week. Acknowledge the solution by asking the class to tell you the agreed upon solution throughout the week and refer to the student who choose the solution by name. At the end of the week, check in with the student and ask him/her to tell the class how well or not so well the solution worked. If he/she discovers the solution works well, you may ask him/her to decide if that is the solution he/she is going to use from now on. If the solution did not work so well, work with him/her to come up with a better solution or to adjust the solution to make it better. This will allow students to create their own solutions and to work through issues using critical thinking and self awareness. It will also allow you to discipline students in an open and productive way, and to get students to see each issue as having several potential solutions."
    }
  ]
}