{
  "url": "https://www.wikihow.com/Exercise-Your-Voice",
  "title": "Best Ways to Warm Up & Exercise Your Vocal Chords",
  "steps": [
    {
      "title": "Trill your lips and tongue to warm them up for singing.",
      "content": "Trill your lips and tongue to warm them up for singing. With your lips closed and relaxed, blow air through them gently. Do this until your lips begin to trill. Practice this for ten seconds. Repeat the exercise two to three more times. [1] X Research source To make the exercise harder, add a pitch, like an “uh” sound, as your lips are trilling. Do this for five seconds. The pitch creates a tickling sensation around your nose, mouth, cheeks, and forehead. Performed the tongue trill by smiling while singing a pitch. Then exhale through your teeth so your tongue flutters against the roof of your mouth. [2] X Research source Slide your pitch up and down for a more advanced option."
    },
    {
      "title": "Use the yawn-sigh technique to relax and improve your range.",
      "content": "Use the yawn-sigh technique to relax and improve your range. Pretend you’re having a big yawn to open the space in your throat and the back of your mouth. Now, do the same thing again while keeping your lips closed. With your mouth still closed, make a sighing sound as you exhale through your nose. [3] X Research source “The best thing to do is to yawn and let out a big sigh. By yawning and sighing, you're opening up your throat. You're relaxing your muscles. The vocal cords are expanding and stretching, and you're getting your breath to be nice and deep,” Voice and Speech Coach Patrick Muñoz says."
    },
    {
      "title": "Sing the “ng” sound to create more vocal resonance.",
      "content": "Sing the “ng” sound to create more vocal resonance. Make the “ng” sound as in the word “sing.” It helps to sing the word “sing” and then hold the end sound with your mouth open. This causes the back of your tongue and the soft palate at the roof of your mouth to come together. Hold this sound for 10 seconds. [4] X Research source Repeat this exercise two to three more times. For a more advanced version, hold the “ng” sound for 10 seconds, then switch to an “ohh” sound."
    },
    {
      "title": "Practice singing “mee-may-mah-moe-moo” to help enunciate vowels.",
      "content": "Practice singing “mee-may-mah-moe-moo” to help enunciate vowels. Vowels are pronounced differently when singing to keep the notes clear and open. Starting low, sing “mee-may-mah-moe-moo” slowly using a monotone voice. Open your mouth wide and clearly enunciate the “M” and vowel sounds. [5] X Research source Repeat this exercise five times, starting higher each time. To make this exercise harder, sing all the sounds in one breath. Keep your voice relaxed while doing this exercise, and don’t push past what’s comfortable."
    },
    {
      "title": "Perform the vocal straw exercise by singing through a straw.",
      "content": "Perform the vocal straw exercise by singing through a straw. Place one end of the straw in your mouth and close your lips around it. Sing through the straw, starting with the lowest note in your register (or the lowest note you can comfortably sing). Then, slowly slide up to the highest note in your range, keeping your tone even. Once you’ve done this a few times, try singing a song through the straw. [6] X Research source Don’t let air escape through your nose. The goal is for you to gently push air through the straw as you sing. If you feel a buzzing or vibration in your head, that means you’re doing it right! This technique is also called straw phonation, and it helps you sing a note with less effort. It puts less stress on the vocal cords to help you practice what healthy singing feels like. [7] X Research source"
    },
    {
      "title": "Hum a familiar song to warm up without stressing your voice.",
      "content": "Hum a familiar song to warm up without stressing your voice. Pick one of your favorite songs or something easy like “Twinkle Twinkle Little Star.” Depending on the length of the song, hum it to yourself two to three times. [8] X Research source Vocal Therapist and Singing Voice Specialist Amy Chapman says that the goal is to stretch your vocal cords and get them pliable so they move in a wave."
    },
    {
      "title": "Make a siren sound for a full-scale workout for your voice.",
      "content": "Make a siren sound for a full-scale workout for your voice. Vocal Coach Tanisha Hall advises, “The quickest way to warm up and stretch your voice is by doing sirens. Start at your lowest note and sing “aaaah” in a gentle, smooth tone up to your highest note, then slide back down to the lowest note. It sounds like a siren, but not a blaring siren! Do this about 5 times, and it will give your vocal cords a gentle stretch.” To warm up your voice , imagine the sound a fire engine makes as it passes by. As you make the siren sound, go up and down your vocal range for five to eight seconds. Your voice may be fatigued if you can’t hit the high and low notes. Stop the exercise and let your voice rest for five minutes."
    },
    {
      "title": "Sing do-re-mi’s up and down the scale to stretch your vocal cords.",
      "content": "Sing do-re-mi’s up and down the scale to stretch your vocal cords. Chapman says, “I like to warm up my voice and get my breath moving by stretching my vocal cords. When stretching your vocal cords, you're essentially going up in pitch and then down in pitch.” Beginning on any note (the middle C on a piano is a good place to start), sing “do re mi fa sol la ti do” up the scale. As you sing, really listen to each pitch. Repeat this exercise five times. The do-re-mi scale (also called solfège, solfeggio, and solfa) is a system used to help musicians learn and read music . It was famously featured in The Sound of Music when Maria teaches the von Trapp children how to sing."
    },
    {
      "title": "Do a two-octave pitch glide to move from your chest to your head voice.",
      "content": "Do a two-octave pitch glide to move from your chest to your head voice. Starting at the highest note you can sing comfortably, use a vowel sound to slide down two octaves in one breath. Then, start at your lowest comfortable note and slide up two octaves. Finally, start at your lowest note and slide up two octaves and down again on one breath. [9] X Research source This stretches your vocal folds and helps you transition from your chest to your head voice without a break. Your chest voice is composed of the lower, warmer tones you sing in the same register you normally use to speak. The head voice is made up of higher notes that feel like they come from your head (but still come from your vocal cords). [10] X Research source"
    },
    {
      "title": "Gain more control of your voice with the vocal slides technique.",
      "content": "Gain more control of your voice with the vocal slides technique. Making an “ohh” sound, sing from one note to another in your range with a slide. This technique is similar to the siren exercise, but you avoid singing all the in-between notes. [11] X Research source Do this by holding the first note and then quickly sliding to the second note and holding it. This technique is a little tricky, but it helps you [[Strengthen-Your-Singing-Voice|strengthen your voice] and develop precise control over the notes you sing. This method is also called portamento which means “to carry” in Italian."
    },
    {
      "title": "Transition from your warmup to singing with a familiar song.",
      "content": "Transition from your warmup to singing with a familiar song. One of the best ways to transition from warmup exercises to singing is to casually sing one of your favorite songs. Pick something you know very well that’s in your range and not too difficult to sing. [12] X Research source The goal is to be relaxed and have a little fun with it, so this isn’t the time to try your hand at the Queen of the Night’s aria from The Magic Flute . A few good songs to pick are: “Hallelujah” by Leonard Cohen \"Born This Way\" by Lady Gaga “Sweet Dreams” by Eurythmics “Back to Black” by Amy Winehouse “Hurt” by Johnny Cash “(Sittin’ On) The Dock of the Bay” by Otis Redding “Heroes” by David Bowie “Young & Beautiful” by Lana del Rey"
    },
    {
      "title": "Warm up your body with stretching, exercise, or a warm shower.",
      "content": "Warm up your body with stretching, exercise, or a warm shower. Chapman says, “I wouldn't just do voice if your body's tired and your body's not feeling ready, your voice is not going to feel ready.” You don’t have to do a whole workout. A quick jog in place or a few simple stretches will get your blood flowing."
    },
    {
      "title": "Breathe deeply from your diaphragm and exhale with a hiss.",
      "content": "Breathe deeply from your diaphragm and exhale with a hiss. Chapman says, “A good way to improve lung capacity is to take a deep breath, filling up your chest, lower back, and the intercostal muscles between your ribs. Fill up with a lot of air, and as slowly as you can, release the breath on an S or a hiss.” Stand up with your back straight and your shoulders back and relaxed. Place both of your hands on your stomach. Breathe in through your nose. Expand your abdomen and lungs/ribs as you breathe in. [13] X Research source Hold your breath and count to ten. Then, slowly exhale. As you exhale, make sure to contract your abdomen as if you are pushing the air out of it. While performing this breathing exercise, Keep your shoulders in place; don’t move them up and down as you breathe. Repeat this exercise two to three more times."
    },
    {
      "title": "Move your tongue around to make it more flexible.",
      "content": "Move your tongue around to make it more flexible. With your mouth slightly open, swish your tongue around and back and forth in your mouth. Do this for five to eight seconds. Repeat this two to three more times. [14] X Research source This exercise will help loosen and relax the muscles at the back of your tongue"
    },
    {
      "title": "Massage your jaw and cheek muscles to release tension.",
      "content": "Massage your jaw and cheek muscles to release tension. Position your palms on the sides of your face. Massage your cheek and jaw muscles with your palms using slow, circular motions. Lower and raise your jaw as you massage to help loosen your jaw muscles . Do this exercise for 20 to 30 seconds, three to five times."
    },
    {
      "title": "Pretend to chew to help relax your jaw muscles.",
      "content": "Pretend to chew to help relax your jaw muscles. Act as if you have gum or food in your mouth. Using your upper and lower jaw muscles, slowly chew for five to eight seconds. Repeat this two to three more times. [15] X Research source This exercise will help loosen and relax your jaw muscles."
    },
    {
      "title": "Roll your neck and shoulders to relieve tension in your muscles.",
      "content": "Roll your neck and shoulders to relieve tension in your muscles. Keeping your shoulders still, slowly rotate your head counterclockwise, then clockwise. Do this ten times. Keeping your neck still, rotate your shoulders backward ten times and forward ten times. [16] X Research source Coupled together, these exercises will help loosen the muscles around your throat and neck."
    },
    {
      "title": "Say “mm-mmm” to warm up your vocal cords.",
      "content": "Say “mm-mmm” to warm up your vocal cords. Do this until you feel the front of your face buzz or vibrate. The vibration may cause the front of your face to tickle a bit, but this means you are doing the exercise correctly. [17] X Research source Repeat this exercise five times."
    },
    {
      "title": "Alternate between “mm-mmm” and “mm-hmm.”",
      "content": "Alternate between “mm-mmm” and “mm-hmm.” Say “mm-mm” as in tummy, and “mm-hmm” as in yes. Alternate between the two mm’s. Repeat this five times. Then, alternate between the two mm’s as you go from low to middle to high and back again with the pitch of your voice. Repeat this ten times. [18] X Research source This exercise helps to develop mask resonance."
    },
    {
      "title": "Repeat “ney ney ney” to help warm up your jaw and voice.",
      "content": "Repeat “ney ney ney” to help warm up your jaw and voice. Going up and down your vocal range, i.e., low to middle to high and back again, say “ney ney ney ney ney.” Say it loudly, but do not yell. [19] X Research source Repeat this exercise ten times."
    },
    {
      "title": "Practice saying tongue twisters to improve articulation.",
      "content": "Practice saying tongue twisters to improve articulation. Say a tongue twister several times fast while keeping the words clear. Start slow, but increase your speed over time. This exercise isolates the muscles in your throat, which helps with articulation. Some tongue twisters to practice with are: [20] X Research source “Three free throws.” “She sells seashells by the seashore.” “The blue bluebird blinks.” “Freshly fried flying fish, freshly fried flesh.” “Peter piper picked a peck of pickled peppers.”"
    },
    {
      "title": "Do these exercises three to five times a week and before performances.",
      "content": "Do these exercises three to five times a week and before performances. Hall says, “Treat it like a job. Set reminders and alerts on your phone and your calendar.” She recommends spending 15-20 minutes doing some type of warm-up to get your body and vocal cords loosened up and flexible. Additionally, go through these exercises 30 minutes before performing or speaking in public. [21] X Research source These warmup exercises are great for beginning singers and more advanced singers who are auditioning or performing."
    },
    {
      "title": "Vocal exercises help keep your voice healthy and prevent damage.",
      "content": "Vocal exercises help keep your voice healthy and prevent damage. Warming up before you sing allows you to sound better and extend your range. It also helps you loosen up your body and relax, which lowers the chance you’ll damage your vocal cords. Regular vocal exercise also prevents deterioration in your vocal muscles that happens as you age. [22] X Research source “Focus on strengthening your body and your support system, first and foremost, and then strengthening your vocal cords themselves to be able to hold a tone and have a constant airflow,” Chapman advises."
    },
    {
      "title": "Protect your voice with healthy vocal habits and good posture.",
      "content": "Protect your voice with healthy vocal habits and good posture. Always run through a vocal warm-up before singing or speaking for long periods of time. As you speak or sing, maintain good posture without slouching or bending over. Don’t try to talk or sing above loud ambient noise. Avoid shouting or screaming and give your voice plenty of rest. [23] X Research source Don’t forget to drink plenty of water and sleep well every night, especially before a performance."
    },
    {
      "title": "After practicing or performing, cool down your voice for 2-3 minutes.",
      "content": "After practicing or performing, cool down your voice for 2-3 minutes. This allows your voice to return to speaking levels and prevents overuse injuries. Keep using your voice, but be gentle. Perform lip flutters or descending slide exercises and drink plenty of water. [24] X Research source If your vocal quality suddenly changes, temporarily stop using your voice for singing, humming, or speaking."
    }
  ]
}