{
  "url": "https://www.wikihow.com/Care-for-Nubian-Goats",
  "title": "How to Care for Nubian Goats",
  "steps": [
    {
      "title": "Prepare some pasture space.",
      "content": "Prepare some pasture space. Before you consider the purchase of one or more Nubian goats, it is important to ensure that you have adequate space for them. These animals require about 200 square feet of pasture space per goat. [2] X Research source Ideally, this space should contain grass, bushes, and other plants the goats can eat. Keep in mind that goats are vocal animals. While Nubian goats are not the loudest of all breeds, they can be vocal, especially during certain times of the year. You may want to consider this in deciding how close to your home you will raise your goats."
    },
    {
      "title": "Build a shelter.",
      "content": "Build a shelter. Nubian goats are a hearty breed that is less sensitive to heat and cold than some other goats. Even so, they'll need a warm, dry, and well ventilated area to protect themselves from the elements. [3] X Research source Your shelter should provide at least 25 square feet of space per goat. There should be plenty of clean, dry straw for bedding. [4] X Research source Dirt floors are preferable to wood. When wood floors get wet, they can be a slipping hazard for goats."
    },
    {
      "title": "Put up a strong fence.",
      "content": "Put up a strong fence. Like most goats, Nubians are natural escape artists. This means you'll need a strong fence to keep them in. [5] X Research source Build your goat paddock with fences at least four feet tall. [6] X Research source Woven wire and \"no climb\" horse fencing work well. Fence material with square holes is not ideal, as goats can sometimes get their heads caught in the fence. [7] X Research source You'll need to walk the fence line regularly to check for damage and holes the goats might start digging to get under the fence. Do not tether your goats. This can cause stress and in some cases fatalities as goats can strangle themselves attempting to escape the tether."
    },
    {
      "title": "Provide entertaining objects.",
      "content": "Provide entertaining objects. Nubian goats are curious and playful. Make sure their space contains objects that they can entertain themselves with. [8] X Research source Good choices include stacks of straw bales they can knock over, old tires, and piles of rocks."
    },
    {
      "title": "Bring your goats home.",
      "content": "Bring your goats home. Once you've prepared an adequate home for your goats, find a breeder or other seller online. Purchase your goat or goats, and bring them home. Make sure you have a trailer or large truck bed with a covered roof to transport your goat safely and securely. There are many breeders of these goats all around the country. Shop around for a good deal on a healthy goat."
    },
    {
      "title": "Keep does and bucks separate.",
      "content": "Keep does and bucks separate. If you have both bucks and does, you'll need to house them separately, due to the bucks' aggressive nature. This is doubly true if you don't want lots of baby goats. Your bucks may also require stronger fencing material to keep them in. Keep in mind also that bucks emit a powerful odor during breeding season that is attractive to Nubian does but unpleasant to most people. If you are keeping bucks, consider keeping them further from your home."
    },
    {
      "title": "Provide a constant source of water.",
      "content": "Provide a constant source of water. A goat's water needs will vary from one season to the next. Be certain that your goats have a source of water at all times. [9] X Research source Use heavy containers for water, as goats have a tendency to knock them over otherwise. You may wish to consider an automatic watering system to reduce waste."
    },
    {
      "title": "Feed your goats browse.",
      "content": "Feed your goats browse. The primary component of a Nubian goat's diet is a class of plants called \"browse.\" Shrubs and bushes are \"browsing\" plants (as opposed to grazing plants such as grass). [10] X Research source If there aren't already browsing plants growing in your goats' area, feed them browse you've gathered from elsewhere. Good choices include: Brambles Blackberry bush Ivy leaves and vines (not the flowers or berries) Nettles Thistles"
    },
    {
      "title": "Feed your goats forage.",
      "content": "Feed your goats forage. In addition to browsing, goats will also need to eat what is sometimes called \"forage,\" i.e. mixed grasses and clover. You can allow your goats to graze naturally in their paddock for grasses (and should do so for at least eight hours a day), but should also feed them high quality hay such as clover and alfalfa. [11] X Research source"
    },
    {
      "title": "Supplement their diet with pellets.",
      "content": "Supplement their diet with pellets. Especially during the winter months when their pasture area may not grow as much wild food, you may wish to supplement your Nubian goats' diets with commercially available goat feed pellets. This is especially important if you are raising your goats for milking. It is easy overfeed with pellets, which can cause your goats to become obese. Feed your goats according to package instructions, and do not overfeed. If you notice your goats gaining weight, consider switching out your pellets for a variety formulated to prevent obesity, such as DuMor."
    },
    {
      "title": "Provide mineral supplements.",
      "content": "Provide mineral supplements. To stay healthy, goats require certain minerals in their diets which are not always available in browse and forage they eat. This is especially true in the winter months. You may need to provide supplements. Goats can develop health problems if they become deficient in selenium or magnesium. You can provide your goats with commercially available mineral blocks that can help them get the nutrients they need. Note that mineral blocks formulated for sheep do not contain copper, which goats do need. [12] X Research source"
    },
    {
      "title": "Avoid poisonous plants.",
      "content": "Avoid poisonous plants. Goats will eat a wide variety of wild plants, but some of these can be poisonous to them. Make sure your goats' pasture areas do not contain any plants that can poison them, such as: Azalea Daisy Rhubarb Daffodil Lilac Laurel Pine Tomato If you believe your goat has eaten something poisonous, call a vet immediately."
    },
    {
      "title": "Keep their area clean.",
      "content": "Keep their area clean. Like any animal, Nubian goats require some cleaning up after. There are two common approaches to this: Daily cleaning. Clean the manure out of your goat enclosure every day. A deep-litter system. Cover the manure with fresh straw on a regular basis, and do one deep-cleaning every summer. This approach is smellier but provides additional heat in the winter as the manure decays and can also reduce flooding inside your barn."
    },
    {
      "title": "Trim their hoofs.",
      "content": "Trim their hoofs. Nubian goats need their hoofs trimmed about four times a year. Don't attempt this yourself until someone has shown you how to do it, or you may injured your goats. [13] X Research source A veterinarian can show you how to carry out this relatively simple procedure using a hoof trimmer, commercially available from most farm stores. [14] X Research source"
    },
    {
      "title": "Vaccinate your goats.",
      "content": "Vaccinate your goats. Nubian goats should be vaccinated against several different common diseases. Among these are rabies, tetanus, and clostridium (CTD). [15] X Research source Talk to your vet about the correct schedule for these vaccinations. The rabies vaccine is particularly hard on goats. Give this vaccine at least a month apart from the others."
    },
    {
      "title": "Handle your goats with care.",
      "content": "Handle your goats with care. When you have to handle your goats (e.g. for vaccination or inspection), do so calmly and gently so as not to spook them. [16] X Research source If need be, you can restrain your goat with a rope harness during handling. Bucks can also be restrained by holding their horns, though this requires a second person."
    },
    {
      "title": "Watch out for common health problems.",
      "content": "Watch out for common health problems. Although Nubian goats are a hearty breed, any goat is susceptible to a variety of illnesses including upper respiratory problems, parasitic infections, bloat, sore mouth, and hoof rot. Keep an eye out for any of the following symptoms: [17] X Research source Loss of appetite and/or sudden weight loss Limping Listlessness Labored breathing Diarrhea Discharge from the eyes or nose Abnormal body temperature Visible abscesses Contact your vet immediately if you note any of these symptoms."
    },
    {
      "title": "Avoid certain foods.",
      "content": "Avoid certain foods. If you are planning to milk your goats, you should avoid feeding them certain foods that can ruin the taste of their milk. Among these are: Alfalfa Turnips Mustards Cabbage Marigolds Kale Ragweed Wild garlic, onions, carrots, and lettuce"
    },
    {
      "title": "Introduce bucks in the fall.",
      "content": "Introduce bucks in the fall. Goats only produce milk after giving birth. The female Nubian goat comes into her mating season in late summer and fall. During this period, introduce bucks to the females. A female will be receptive to male goats when in heat. You will be able to tell a female is in heat because her vulva area will swell slightly, and may leak fluids. She may also become extra affectionate. A female will need to be \"freshened\" annually by becoming pregnant to continue producing milk. A female Nubian goat may go into heat more than once year, depending on the climate in your area. Bucks can be a real handful to transport and care for. If you don't want to keep any yourself, you can often pay to have your female bred to studs owned by someone else."
    },
    {
      "title": "\"Dry off\" pregnant females.",
      "content": "\"Dry off\" pregnant females. If your female goat is already lactating, you will need to stop her milk production after she becomes pregnant so she can dedicate her nutritional resources to the pregnancy. This process is called \"drying off.\" [18] X Research source Drying off is achieved by gradually extending the time between milkings. Start this process about 60 days into the pregnancy. If you are milking every 12 hours, which is typical, extend the time to 13. The next day, extend to 14, then 15 and so on until the female stops lactating."
    },
    {
      "title": "Create a birthing stall.",
      "content": "Create a birthing stall. When the female is very close to birthing, typically in January, put her in a birthing stall. This is a comfortable, private stall she can give birth in without being bothered. Fill the stall with fresh straw and provide a heat lamp so the goat can be warm and comfortable."
    },
    {
      "title": "Separate babies.",
      "content": "Separate babies. The female goat will typically give birth to two to five babies. They should be separated from the mother and fed a diet of pasteurized goat milk to prevent a disease called caprine arthritis encephalitis, or CAE. When the babies are able to fend for themselves, you can introduce them to your herd, or sell them to someone wanting to start their own goat herd."
    },
    {
      "title": "Milk the goats.",
      "content": "Milk the goats. Milking goats is a simple process of rhythmically squeezing the teats from top to bottom to force out the milk. This should be done about every 12 hours. Most goats should be milked for about a minute and a half each time. It may take up to five minutes if you are having trouble getting the milk out. Make sure to milk your goats in a clean, dust-free environment, such a special milking room. You can also milk your goats using a vacuum milking pump."
    }
  ]
}