{
  "url": "https://www.wikihow.com/Resize-a-GIF",
  "title": "How to Resize a GIF",
  "steps": [
    {
      "title": "Do so by clicking on the link or typing \"www.ezgif.com\" in your Web browser.",
      "content": "Do so by clicking on the link or typing \"www.ezgif.com\" in your Web browser."
    },
    {
      "title": "It's near the top of the webpage in the left-center of the toolbar.",
      "content": "It's near the top of the webpage in the left-center of the toolbar. [1] X Research source"
    },
    {
      "title": "Enter the GIF's URL in the \"paste image URL:\"",
      "content": "Enter the GIF's URL in the \"paste image URL:\" field. You can also click on Browse button to upload a GIF from your computer. [2] X Research source"
    },
    {
      "title": "It's the blue button in the \"Animated GIF resizer\" section of the webpage.",
      "content": "It's the blue button in the \"Animated GIF resizer\" section of the webpage."
    },
    {
      "title": "In the fields below your uploaded image, you can either:",
      "content": "In the fields below your uploaded image, you can either: Enter a width and height in the \"New width:\" and \"New height:\" fields (the current width and height are displayed immediately beneath the image); or Enter a percentage by which to increase or reduce the size of the GIF."
    },
    {
      "title": "It's the blue button below the \"new size\" fields.",
      "content": "It's the blue button below the \"new size\" fields. [3] X Research source The resized image will appear below the Resize it! button in the \"Resized image:\" section of the webpage."
    },
    {
      "title": "It's on the right side of the toolbar below the resized image.",
      "content": "It's on the right side of the toolbar below the resized image. Depending on your browser, if asked, choose to click \"Save:\" field at the top of the dialog box. [4] X Research source New resized image will be downloaded and saved to default downloads location on your computer."
    },
    {
      "title": "You'll find the newly resized image at this location.",
      "content": "You'll find the newly resized image at this location. The resized GIF is now available for use on your computer."
    }
  ]
}