{
  "url": "https://www.wikihow.com/Share-a-Zoom-Meeting-Link",
  "title": "2 Easy Ways to Share a Zoom Meeting Link to Invite Others",
  "steps": [
    {
      "title": "Start a Zoom meeting.",
      "content": "Start a Zoom meeting. You can use the Zoom desktop client, mobile app, or go to https://www.zoom.com in a web browser. You must be the host or have proper permissions to share the meeting link. If needed, you can create an account . You can also join a meeting . [1] X Research source"
    },
    {
      "title": "Select Participants.",
      "content": "Select Participants . You can find this in the meeting controls. This icon looks like two overlapping people."
    },
    {
      "title": "Select Invite.",
      "content": "Select Invite . This is at the bottom of the Participants panel. A pop-up window will open with invite options."
    },
    {
      "title": "Select any tab.",
      "content": "Select any tab. You can select Contacts , Zoom Rooms , Desk Phones , Room System , Email , or Call Out or SMS . You can also use any of these options to invite users."
    },
    {
      "title": "Select Copy Invite Link.",
      "content": "Select Copy Invite Link . This will copy the Zoom link for your current meeting. You can also select Copy Invitation to copy the full invitation text with meeting information."
    },
    {
      "title": "Paste the URL.",
      "content": "Paste the URL. You can paste the link in an email, another website, or another app. Press Ctrl + V (Windows) or Cmd + V (Mac) to paste , or right-click the text field and select Paste ."
    },
    {
      "title": "Sign into Zoom.",
      "content": "Sign into Zoom. You can use the Zoom desktop client, mobile app, or go to https://www.zoom.com in a web browser."
    },
    {
      "title": "Select Meetings.",
      "content": "Select Meetings . You'll see this in the vertical menu on the left side of the page (web browser) or in the horizontal menu at the top of the window (desktop client)."
    },
    {
      "title": "Select the meeting you want to share.",
      "content": "Select the meeting you want to share. More options will appear. If you're using the desktop client, hover over the meeting. This will be in the Upcoming tab."
    },
    {
      "title": "Select Copy Invitation.",
      "content": "Select Copy Invitation . It's to the right of the Start button."
    },
    {
      "title": "Share your copied invite.",
      "content": "Share your copied invite. You can paste the link into an email, another website, or another app. Press Ctrl + V (Windows) or Cmd + V (Mac) to paste, or right-click the text field and select Paste ."
    }
  ]
}