{
  "url": "https://www.wikihow.com/Feed-a-Wild-Rabbit",
  "title": "What to Feed a Wild Rabbit in Your Backyard",
  "steps": [
    {
      "title": "Grass & Hay",
      "content": "Grass & Hay Grass and hay are staples of a rabbit’s diet, whether they’re wild or domesticated. Wild rabbits in your yard will have plenty of grass to chew on but may not have ready access to hay. The recommended types for wild rabbits are timothy or oat hay, which is the grassy part of the oat plant. [1] X Research source Visit your local pet store or feed store to purchase the hay or grow hay on your own and let wild rabbits eat the grassy parts. Do not spray pesticides in your yard if you’re feeding wild rabbits. The pesticides could make the wild rabbits very sick. Rabbits can still eat dried grasses, so you don’t have to remove any leftovers if you don’t want to. However, grain grasses may draw rats and mice if you leave them out."
    },
    {
      "title": "Leafy Greens & Vegetables",
      "content": "Leafy Greens & Vegetables Keep fresh vegetables to give to wild rabbits in your yard. Rabbits love leafy green vegetables. Give them a handful of greens per rabbit once a week. Stick with the same few vegetables to avoid causing stomach upset. Rabbits usually won’t eat rotted greens, but it’s best to clear away any leftovers. [2] X Research source Try rabbit-safe vegetables, like: Collard greens Red & green romaine Spinach Bok choy Mustard greens Pea pods (just the pods) Brussels sprouts Swiss chard Carrot tops Garden cress Cow parsley Basil Mint Beet greens Dandelion Cilantro Dill leaves Clover"
    },
    {
      "title": "Commercial Rabbit Pellets",
      "content": "Commercial Rabbit Pellets Commercial rabbit pellets are a tasty treat for rabbits. High-fiber alfalfa pellets can also be a great way to supplement a wild rabbit’s diet during the winter months. Keep in mind that pellets tend to be very nutrient-dense—you don’t need to feed them in large quantities. [3] X Research source The average rabbit ranges from 2-4 pounds (1.17-1.81 kg) and eats up to ⅓ of their body weight per day and stops eating when they are full, so a rabbit weighing 3 pounds (1.36 kg) eats up to 1 pound (0.45 kg) of food a day. [4] X Research source Remember, don’t try to feed a wild rabbit all of the food they should eat in a day. If you feed pellets, keep the amount to a handful per rabbit a week. Avoid “gourmet” pellets with nuts, seeds, or grains which may cause health problems in wild rabbits. Commercial rabbit food can draw pests to your yard, so clear away anything the rabbits don’t eat."
    },
    {
      "title": "Fruits",
      "content": "Fruits Fruits are high in sugar, so only give 1 blueberry-sized piece per rabbit a week for a special treat. Much like us, rabbits have sweet tooths. They like small berries, like blueberries, raspberries, strawberries, and blackberries. Make sure to give them raspberry and blackberry stems and leaves along with the fruit for a more nutritional snack. [5] X Research source Wild rabbits also like apples and pears. Remove the seeds and cut these fruits into ½-inch (1.27 cm) cubes. High glycemic fruits like bananas and grapes are given as occasional treats to pet bunnies but may not be suitable for wild rabbits. Even though carrots aren’t fruits, they are high in sugar so they should also be given sparingly."
    },
    {
      "title": "There are several foods that may be harmful to wild rabbits.",
      "content": "There are several foods that may be harmful to wild rabbits. The good news is that wild rabbits tend to avoid plants that are toxic to them. However, if you continually offer foods that are bad for wild rabbits but not necessarily poisonous, they may start to eat them. For example, broccoli, cauliflower, and cabbage can cause gas or bloating. [6] X Research source Avoid giving wild rabbits foods like: Cooked human food Birdseed Cat or dog food Cow’s milk Grains & bread Nuts Iceberg lettuce Corn"
    },
    {
      "title": "Wild rabbits eat many plants, but their diet is mostly grasses and weeds.",
      "content": "Wild rabbits eat many plants, but their diet is mostly grasses and weeds. Grasses give them the fiber they need to keep their digestive tracts healthy. They also like to eat many plants that humans consider weeds, like chickweed and dandelion, which are packed with vitamins that keep their immune systems strong. [7] X Research source Wild rabbits also like to eat fruits, vegetables, herbs, and flowers they find in the wild or steal from human gardens, but these foods are only a small portion of their diet. They also like to gnaw on things like bark and twigs. Woody plants give them fiber and help keep their teeth clean."
    },
    {
      "title": "Choose a spot at the edge of your yard to place the food.",
      "content": "Choose a spot at the edge of your yard to place the food. If you want wild rabbits to visit your yard, create a place where they can eat safely. Wild rabbits tend to like wooded or shrubby areas on the edges of an open yard or field. Consider creating a small brush pile near the edge of your lawn or garden. In the summer, leave an area of your lawn partially uncut—this allows grass and/or weeds to grow and provides a sheltered area for the wild rabbits to eat. If they feel safe in your yard, don’t be surprised if they stay all day. During the colder months, when rabbits eat more bark and twigs, make a small pile of these items in a corner of your yard. Be aware that placing food in these spots could attract other wild animals."
    },
    {
      "title": "Feeding wild animals (including rabbits) is generally not recommended.",
      "content": "Feeding wild animals (including rabbits) is generally not recommended. When humans start feeding rabbits, the animals may begin to rely on that food instead of foraging for themselves. This can cause overpopulation which may lead to diseases that can be transmitted to other wildlife and people. [8] X Research source When people feed wild animals, the animals may lose their fear of humans and begin to gather where they’ve been fed, which can draw predators. [9] X Research source Instead of feeding wild rabbits, add plants and shrubbery to your landscaping that offers rabbit-friendly food and shelter. Plant roses or other shrubs to create escape routes and places to make cozy nests. Leave “weeds” like grass, goldenrod, clover, and dandelions at the edges of your yard for wild rabbits to eat. [10] X Research source"
    },
    {
      "title": "Determine if the wild rabbit baby is truly an orphan.",
      "content": "Determine if the wild rabbit baby is truly an orphan. If you find a nest of wild rabbits and the mother isn’t around, or you see tiny wild rabbits hopping around on their own, you may think they’re orphans. More often than not, their mother is away from the nest and will return later. It’s always best to make sure the babies are orphans before attempting to feed and care for them. Wild rabbit mothers nurse for short periods at night and early dawn, then leave the nest during the day. [11] X Research source If the babies’ tummies look nice and plump, their mother is probably caring for them. On very young rabbits, a ‘milk line’ is visible through the skin on their belly. The pink belly skin turns white near the bottom of the abdomen. [12] X Research source To check if a mother rabbit is still around, place string in a grid pattern over the nest in the evening. If it’s disturbed when you check in the morning, the mother has returned to the nest. Baby wild rabbits who appear cold, weak, dehydrated (loose skin stays tented when you pinch it), or injured are likely orphaned. [13] X Research source"
    },
    {
      "title": "Contact your local wildlife rehabilitation center as soon as possible.",
      "content": "Contact your local wildlife rehabilitation center as soon as possible. It’s extremely difficult to rehabilitate and care for baby wild rabbits . Calling a wildlife rehabilitation center is the best thing you can do to help them. [14] X Research source Baby rabbits are extremely fragile creatures that require very specific care. Something as simple as a case of diarrhea can be fatal in just a few hours. Wildlife rehabilitators are trained to care for wild animals and then reintroduce them to their natural habitat. Check the National Wildlife Rehabilitators Association website for help finding a rehabilitator in your area or contact your local humane society."
    },
    {
      "title": "Keep the orphaned rabbit babies warm in a lined shoebox.",
      "content": "Keep the orphaned rabbit babies warm in a lined shoebox. If you aren’t able to get in touch with a wildlife rehabilitation center right away, you may need to provide at least initial care (warmth and food) to the orphaned rabbits. If they seem cold, warm them up by placing them in a shoebox lined with a clean, soft cloth. [15] X Research source Set a heating pad on low and place it on a tabletop. Position the shoebox so only half sits on the heating pad—this will allow the babies to move away from the heat if they become too warm. Pick a handful of fresh clover, Queen Anne’s lace, and dandelion greens twice a day to line the box. Babies as young as 3 days may nibble on plants. [16] X Research source"
    },
    {
      "title": "Feed orphaned rabbits goat milk or milk replacers.",
      "content": "Feed orphaned rabbits goat milk or milk replacers. Regular goat milk is frequently recommended for baby wild rabbits. [17] X Research source Look for it at your local grocery store. If it’s unavailable, ask the grocer where you can find it. Kitten milk replacers are also good choices and are easy to find at local pet stores. [18] X Research source Cow’s milk, human baby formula, and Pedialyte are not recommended for feeding baby rabbits. Baby rabbits open their eyes at about 10 days old. If the baby’s eyes are open, place a handful of timothy or oat hay in their box for them to nibble on or use as bedding. [19] X Research source"
    },
    {
      "title": "Feed the baby rabbits small amounts of goat milk with a syringe.",
      "content": "Feed the baby rabbits small amounts of goat milk with a syringe. Knowing what to feed baby wild rabbits is only half the battle—knowing how to feed them is crucial to their survival. Because they’re so small, baby wild rabbits can be fed with a syringe , which is available at your local pharmacy. Eyedroppers are another good option. [20] X Research source The amount you feed baby rabbits is based on their age. Pink, hairless rabbits: ½ cc/mL every 3 hours Rabbits with tightly closed eyes and ears tucked flat: 2 cc/mL every 3 hours Gradually increase the amount you feed and decrease the number of feedings as the rabbit gains weight. Stop formula feeding as the rabbit begins to eat more greens. Do not overfeed a baby rabbit. Stop feeding when their tummy becomes slightly rounded but not tight. [21] X Research source"
    },
    {
      "title": "Hold the rabbit upright with the syringe at the side of their mouth.",
      "content": "Hold the rabbit upright with the syringe at the side of their mouth. One at a time, gently pick up each baby rabbit and hold them loosely but firmly in a soft cloth. Tilt their body so their head is higher than their back end. Place the syringe near the side or bottom of their mouth. This prevents them from accidentally inhaling the liquid into their lungs. [22] X Research source Keep the feeding area quiet to not stress the babies. Make sure to wash your hands before each feeding session."
    },
    {
      "title": "Stroke the rabbit’s anal area to stimulate urination and defecation.",
      "content": "Stroke the rabbit’s anal area to stimulate urination and defecation. After the baby rabbits have finished eating, it is important for them to urinate and defecate to keep their digestive and urinary systems healthy. If they have not yet opened their eyes, use a cotton ball moistened with warm water to stroke the rabbit’s anal area until they urinate and defecate. Continue to stimulate the rabbit until they are no longer releasing urine and stool. [23] X Research source Rabbit babies with open eyes can usually eliminate waste on their own."
    }
  ]
}