{
  "url": "https://www.wikihow.com/Play-Mahjong-Solitaire",
  "title": "How to Play Mahjong Solitaire In Real-Life and Online",
  "steps": [
    {
      "title": "Choose cards or blocks.",
      "content": "Choose cards or blocks. A typical Mahjong game uses blocks with Chinese symbols of them. However, you can play the same rules using a Western deck of playing cards. Mahjong tiles may be purchased online, or from a game's store. While cards may be a reasonable substitute, using the real thing will prove more enjoyable in the long run."
    },
    {
      "title": "Set up your blocks.",
      "content": "Set up your blocks. A traditional Mahjong set-up uses 144 blocks in a rough \"spider\" shape, with three extra layers added on top like a pyramid, making it a 3D puzzle. Although you don't need to adhere to the traditional setup, it's a good idea to give it a try at least once. Place the blocks in a random order. This will offer the game a sense of unpredictability. Mahjong layouts are four layers high, in the rough shape of a pyramid. Although there are no strict layout rules, most traditional Mahjong setups use four jutting arms, fixed facing horizontally on the four corners of the square pyramid. More of these \"arms\" will open up more blocks for use, making the game easier. Templates for Mahjong solitaires are available to look up online. [1] X Research source However, once you become a seasoned player, you should experiment with creating your own formations. Just make sure that the formation has a large base with jutting arms and blocks that are open for removal. If you're using cards, set cards next to one another. Because these cards will take up more space than the small Mahjong blocks, it may be a good idea to add more vertical layers than you would with the blocks."
    },
    {
      "title": "Remove pairs of \"open\" blocks.",
      "content": "Remove pairs of \"open\" blocks. The actual game of Mahjong Solitaire is simple but surprisingly challenging. Find blocks of the same type and remove them. Blocks can only be removed if they are \"open\", meaning they are not covered, nor adjacent to other blocks on their long sides. Keep your eye out for identical blocks and remove them when you see them. The game will end either when all of the blocks are gone, or when you have no more moves available. Because a given block will appear four times in a set, the strategic element is to remove blocks that will open up the greatest number of new blocks, thereby making it easier for you to keep the game going. [2] X Research source"
    },
    {
      "title": "Discard the removed blocks in a side pile.",
      "content": "Discard the removed blocks in a side pile. While you're keeping your eye out for \"open\" pairs, you should place the discarded blocks in a safe pile, away from your game. Try not to lose any of the blocks. If you lose even one, it can ruin the set for you."
    },
    {
      "title": "Shuffle the remaining blocks if the game is unwinnable.",
      "content": "Shuffle the remaining blocks if the game is unwinnable. If you're playing Mahjong Solitaire by hand, there's a chance that the layout you've constructed was unwinnable from the start. If this is the case, you have the option of reshuffling the blocks you currently have left into something new. [3] X Research source From there, hopefully you'll be able to pick out new pairs and keep the game going."
    },
    {
      "title": "Reassemble the layout once the blocks are gone.",
      "content": "Reassemble the layout once the blocks are gone. At a certain point, you should either have all your blocks gone from the layout, or there should be no legal moves left for you to make. If you think you've possibly lost, give it a thorough checking over before you reassemble the layout. Following a game, you can either choose to remake the game in the original layout you were using, or experiment with trying something new."
    },
    {
      "title": "Customize the rules to suit yourself.",
      "content": "Customize the rules to suit yourself. Customization is a natural progression for anyone with significant Mahjong Solitaire experience. Because it's a game you can play at home by yourself, there's nothing stopping you from creating your own versions and recalculating the rules to suit you better. If you feel you've been having too much of an easy time with the core gameplay, try adding new restrictions to \"open\" blocks. Why not take out blocks four at a time? Layouts also radically change the game experience, especially if you maximize the amount of vertical layers. Take care not to make it too challenging for yourself, however. Getting too ambitious with layouts will quickly make the game impossible to play. Look at some permutations of the game that other people have invented. Although many game versions have been created as online browser games, there's no reason why you can't apply those rules to an at-home game of it. Mahjong Solitaire is a fundamentally simple game at heart, so it practically begs to be experimented with."
    },
    {
      "title": "Score your game.",
      "content": "Score your game. If you play Mahjong Solitaire, you have options when it comes to scoring the game. Some players view themselves as \"winning\" only if they get all of the tiles removed. The most accepted manner of scoring Mahjong is by scoring tiles removed based on their type. Depending on the set, certain sets of blocks may have a score of 1 to 7, depending on their rarity. [4] X Research source Refer to the rareness of the pieces in your Mahjong set and give them increasing score counts based on how few of a type there are. Set a stopwatch and time yourself. Adding time into the game will increase the intensity. This is a good move if you are already well-versed in Mahjong and need an increased challenge. Because it's a single-player game, you don't need to score yourself at all if you don't want to."
    },
    {
      "title": "Find an outlet online.",
      "content": "Find an outlet online. Although many think of Mahjong Solitaire as a classical Chinese game, it's more commonly (and easily) performed with a computer. Mahjong Solitaire is a very popular puzzle game for computers, so it's really easy to find a way to play it. Web search the game and you should come up with countless game servers with the game available for play. [5] X Research source You can also download the game as a computer program, or as an app for your phone. For simplicity's sake, you start off playing Mahjong Solitaire online. Helpful things like pre-made layouts, difficulty settings and a \"hints\" toolbar make it perfect for someone who is still learning the ropes."
    },
    {
      "title": "Choose a layout.",
      "content": "Choose a layout. There are hundreds of different kinds of layouts available for Mahjong Solitaire online. [6] X Research source While many will use the classical Chinese \"spider\" layout, different outlets of the game will favour different layouts. A layout will have a major impact on your experience on the game. Depending on the shape, there may be a lot or very few \"open\" tiles to choose from. Try looking for a difficulty gauge on the version of the game you're using. This may have an impact on the type of layout you play with."
    },
    {
      "title": "Remove \"open\" blocks in pairs.",
      "content": "Remove \"open\" blocks in pairs. The basic gameplay of Mahjong Solitaire involves removing pairs periodically from the game board. Although the particulars may vary depending on the specific version you're using, this mechanic applies to all versions of Mahjong Solitaire. Keep your eye open for pairs and remove them at will. Because there are more than two blocks for each potential pairing, strategy is involved. Aim for the blocks you think will open up the most blocks in future turns. The blocks must be considered \"open\" in order to be taken out. This means they're not covered by other blocks on more than one side, and are not covered by a second layer of block. This gameplay mechanic has been mirrored in many other online browser games to date."
    },
    {
      "title": "Use a hints tab.",
      "content": "Use a hints tab. [7] X Research source A hints tab is a perfect aid for someone who is still learning how to play Mahjong Solitaire. While you won't have anyone to tell you whether you have run out of moves in a real-life game, the computer will be able to let you know what moves there are to make with your given set. This is helpful if you're having difficulty identifying blocks apart."
    },
    {
      "title": "Restart the game if you're stuck.",
      "content": "Restart the game if you're stuck. [8] X Research source Unlike a real life game of Mahjong Solitaire, you won't need to wait for your game to reset. What's more, if you want to beat a certain puzzle, you can have the game restart to the exact layout it was at the start. This is helpful if you're deadset on triumphing over a particularly challenging round."
    },
    {
      "title": "Explore different online versions of Mahjong Solitaire.",
      "content": "Explore different online versions of Mahjong Solitaire. Because it's a fundamentally simple game at heart, developers have created countless different versions with extra features to spice up the core gameplay. Certain versions, like Castle Mahjong, will add elements associated with computer gaming (like castle building) into the game. [9] X Research source If you love the puzzle element of Mahjong but want it to resemble more of a game, sites like Mahjong Games will offer many variations all in one place. [10] X Research source http:/www.mahjonggames.com Although all of these games ill use the same core gameplay elements, you'll have to learn new rules specific to each game. This is perfect if you've overplayed the core game too much and are looking for a way to liven up your experience."
    },
    {
      "title": "Review your score.",
      "content": "Review your score. Mahjong Solitaire is scored based on a combination of how many tiles you removed and how fast you played. A bonus is awarded if you're able to get all of the blocks removed. A benefit of playing Mahjong online is that the computer will score it automatically for you. Many online outlets host high score lists. This will give you a potential long-term goal to strive for. Many Mahjong sets award different scores to sets of tiles based on their rarity. Taking account of the rarity of certain sets can help you strategize your game further. [11] X Research source"
    },
    {
      "title": "Think a step ahead.",
      "content": "Think a step ahead. Although Mahjong Solitaire involves careful observation and a trained eye, you will maximize your success by removing your blocks in such a sequence that will open up the most pieces for you in the future. Much like chess, you should make your moves with the next potential moves you'll make taken into consideration."
    },
    {
      "title": "Focus on the top layers first.",
      "content": "Focus on the top layers first. All Mahjong Solitaire games involve four layers on top of one another. Early on in the game, these layered blocks should be your priority. If there are multiple potential combinations, you should choose the ones that will remove these layers. This will free up the most blocks for you later on in the game, and possibly avert a failed game towards the end. [12] X Research source"
    },
    {
      "title": "Prioritize high-value blocks.",
      "content": "Prioritize high-value blocks. If you're playing a version of the game that involves blocks of varying scores, it's a good idea to get these high-value blocks as early as possible. If none are currently available, look for the high-value blocks that you can potentially free up with a block or two. [13] X Research source"
    },
    {
      "title": "Save pairs that don't open anything for you.",
      "content": "Save pairs that don't open anything for you. [14] X Research source Ultimately, your goal in removing blocks should be to open up new blocks for future removal. If you can potentially remove a pair of blocks that won't open up new pairs, you should save it for a backup. Instead, concentrate on the pairs that will maximize your possibilities in future moves."
    },
    {
      "title": "Be patient.",
      "content": "Be patient. If you're playing the game with physical pieces, there won't be any concrete indication to let you know whether there are any blocks left or not. Rather than shuffle up the pieces as soon as you're not sure, take a patient eye to your pieces and look it over again. Especially if you're a beginner to the game, chances are you'll admit defeat while there are still options available to you."
    }
  ]
}