{
  "url": "https://www.wikihow.com/Defer-University-Acceptance",
  "title": "How to Defer University Acceptance",
  "steps": [
    {
      "title": "Pay your enrollment deposit.",
      "content": "Pay your enrollment deposit. Most universities request an enrollment deposit when you initially accept admission to the university. You typically must have this deposit paid before you can request a deferment. [2] X Research source Many schools enable you to defer up to the day the fall semester starts. However, in most cases it's best if you apply for deferment as soon as possible after you become aware of the reasons for your deferment."
    },
    {
      "title": "Contact the university's office of admissions.",
      "content": "Contact the university's office of admissions. As soon as you know that you will need to defer your acceptance, you need to find out the university's policy on deferment and their application process so you can get started. [3] X Research source Typically you must fill out an application and describe the reason you need to defer admission. Some schools only allow you to defer admission for specific reasons that are outside of your control, such as a family emergency or a health crisis. You may have to pay a fee to defer your enrollment. The office of admissions will let you know if there is any money involved."
    },
    {
      "title": "Gather supporting documentation.",
      "content": "Gather supporting documentation. At many universities, decisions on deferments are made by an individual or an admissions panel on a case-by-case basis. An admissions counselor may request documents or information to back up your reasons for deferring your acceptance. [4] X Research source Go ahead and get this information together when you file your application so you'll have it if you're asked for it. Some documents, such as medical reports and forms, may take a little time for you to get."
    },
    {
      "title": "Receive the university's decision.",
      "content": "Receive the university's decision. Once an admissions counselor or a panel has reviewed your application and any supporting documentation, they will make their decision whether to grant or deny your deferment. [5] X Research source If your deferment is granted, follow up with the admissions office regarding any rules you must follow while your admission is deferred, and what you must do when you're ready to return to school. If the university denies your request to defer your acceptance, there may be a process available for you to appeal this decision, typically to the director of admissions. In most cases, if your request for deferment is denied, that would mean you would have to reapply to the school when you were ready to start."
    },
    {
      "title": "Follow the deferral requirements.",
      "content": "Follow the deferral requirements. When a university agrees to defer your acceptance, that deferment typically comes with restrictions. Primarily, you won't be allowed to enroll or take classes at another university while you've deferred admission. [6] X Research source Ask someone in the admissions office for a list of things you aren't allowed to do while you're on deferment. Violating these policies could mean you have to reapply for admission to that university. Pay attention to deadlines, especially towards the end of your deferment. Write them down or set yourself reminders so you won't forget."
    },
    {
      "title": "Find out if the school will allow you to take a gap year.",
      "content": "Find out if the school will allow you to take a gap year. While most European universities have long accepted and encouraged new students to take a \"gap year\" between their high school and university studies, not all American schools support the idea. [7] X Research source You can research online to find out if your school supports gap year programs, or you can ask at the office of admissions. Many schools have specific deadlines and requirements for students deferring their acceptance to take a gap year. You'll typically follow a different process than you would if you wanted to defer your acceptance for another reason."
    },
    {
      "title": "Write to the director of admissions.",
      "content": "Write to the director of admissions. To take a gap year, most American universities require you to send a formal, written letter to the director of admissions requesting permission to defer your acceptance for a year. [8] X Research source Use a traditional business letter format, and proofread carefully. Make a copy of your letter after you've printed and signed it, and then mail it to the director of admissions. Wait a reasonable period of time, at least two weeks, before trying to follow up. If you don't hear anything from the admissions office within that time, call and find out if your letter was received or if there's anything else you need to do."
    },
    {
      "title": "Describe your gap year plans.",
      "content": "Describe your gap year plans. To approve a request for a deferral of acceptance to take a gap year, most schools want a basic outline of your plans for the year and what educational activities you will pursue. [9] X Research source Some schools require a full written proposal with detailed information and contacts. Make sure you have all the information you'll need. You typically must submit a written proposal, and you also may have to present your proposal before an admissions panel."
    },
    {
      "title": "Contact the financial aid office.",
      "content": "Contact the financial aid office. If your university approves deferral of your admission so you can take a gap year, some scholarships and grants may automatically be deferred as well. However, it is your responsibility to make sure your financial aid does not try to pay your tuition while you're not in school. [10] X Research source Make plans to follow up with the financial aid office after school is in session to make sure no money has been received on your account."
    },
    {
      "title": "Contact the admissions office.",
      "content": "Contact the admissions office. When you're ready to start school, let the admissions office know as early as possible before the date the semester is set to start. The earlier you notify them, the more options you'll have – especially if you need on-campus housing. If you had a specific contact when you were applying to have your admission deferred, contact that person directly. They'll be better able to help you since they'll be familiar with the specifics of your situation."
    },
    {
      "title": "Register for orientation.",
      "content": "Register for orientation. If you deferred your initial enrollment, you typically still must complete a first-year orientation program before you can start classes. Orientation gives you a better understanding of the university's services, programs, and activities. Orientation also allows you to familiarize yourself with campus and meet other students."
    },
    {
      "title": "Apply for housing.",
      "content": "Apply for housing. If you plan to live on-campus, you'll need to start the housing application process after you return from your deferment. Start this process as soon as possible to ensure you have the best choices for housing. You may receive information about applying for housing at orientation, or you may have to complete the process before. Someone in the office of admissions can help you figure out what you need to do."
    },
    {
      "title": "Check on your financial aid.",
      "content": "Check on your financial aid. Most financial aid is also deferred when you defer university acceptance, so it should be ready for you when you return from deferment. However, you may have to reapply for some private scholarships. [11] X Research source Talk to someone in the financial aid office as soon as possible after you notify the admissions office that you're ready to start school. That way you'll have the maximum amount of time to take care of any applications or paperwork required to get your financial aid started."
    },
    {
      "title": "Take placement tests if necessary.",
      "content": "Take placement tests if necessary. Test scores for both the ACT and the SAT are only valid for two years. If you took the ACT or SAT for admission, it may be expired by the time your deferment has ended. [12] X Research source If your admissions test scores have expired, the university may require you to take other assessments or placement tests to determine which required classes you must take."
    }
  ]
}