{
  "url": "https://www.wikihow.com/Papyrus-Undertale",
  "title": "A Complete Guide to Win the Papyrus Fight in Undertale",
  "steps": [
    {
      "title": "Papyrus is the second big boss in Undertale.",
      "content": "Papyrus is the second big boss in Undertale. As you enter into the snowy region of Snowdin, you'll be tested by the brothers Papyrus and Sans, who are both skeletons. The various puzzles set in place by Papyrus may look ridiculously difficult, but they always have simple solutions that shock even the character himself."
    },
    {
      "title": "Papyrus is taller and a bit slimmer than Sans.",
      "content": "Papyrus is taller and a bit slimmer than Sans. For most of his appearances in-game, Papyrus wears an orange-red cape, a white chestplate, blue pants, red gloves, and red shoes. If players choose to date Papyrus, he'll put on his \"secret style\" during the hangout, which includes a backwards baseball cap and a \"Cool Dude\" shirt."
    },
    {
      "title": "Papyrus speaks in all capital letters and exclamation points.",
      "content": "Papyrus speaks in all capital letters and exclamation points. This is opposite of his brother. Sans, who speaks in all lowercase letters. Their font styles reflect their names (Papyrus and Comic Sans)."
    },
    {
      "title": "Papyrus' goal is to join the Royal Guard and capture a human.",
      "content": "Papyrus' goal is to join the Royal Guard and capture a human. However, this is solely based on his desire to be respected and recognized by others. While he may seem like an intimidating opponent, you don't have much to worry about. He's surprisingly kind at heart and values friendship—even with humans. This is what makes him a fan favorite and a popular choice for gifts and merchandise . He's the only enemy in Undertale with attacks that never kill the player; at most, the player's HP will be knocked down to 1 HP."
    },
    {
      "title": "Learn the rules.",
      "content": "Learn the rules. In order to spare or defeat Papyrus, you must survive all of his attacks. He will attack using a series of bones scrolling through the movement box (Bullet Board) at the bottom of the screen. Your SOUL will be red for one turn and then change to blue for the rest of the fight. After lowering his HP enough, Papyrus will unleash a \"special attack\" that fails. You'll then need to dodge his basic attacks for a few turns. Afterwards, Papyrus will give up and you'll be able to spare or defeat him."
    },
    {
      "title": "Dodge the bones.",
      "content": "Dodge the bones. Papyrus has a set of attacks that will follow the same order every time. Use this step to familiarize yourself with the attack pattern until you reach the special attack stage. Each hit will take 4 HP, so be careful! The attacks are as follows [1] X Research source : Blue attack : This attack was previously referenced by Sans , though he purposefully misled you. Blue bones will move across the Bullet Board, but you won't be able to dodge it. Let the blue bones pass. Your SOUL will then turn blue for the duration of the fight. Dodge the white bones by jumping. Dodge a few small bones and then a medium-sized bone. Dodge 1 small bone, 3 medium bones, and 3 large bones. This time, the bones will come from the left side. Dodge 1 large bone, 1 large bone (top), 3 small bones, 1 medium bone, and 1 large bone (top). Dodge 3 large bones, 1 blue bone (ignore), and 1 small bone coming fast from the right. Dodge 2 medium bones (jump through the middle), 1 large bone (top) coming from the right, and 8 bones that form an arc. Jump through the middle of 2 bones twice. Ignore the blue bone. Dodge 1 medium bone coming fast from the right. Jump through 2 sets of bones coming from both sides of the screen. A series of bone arcs will come from the right side. Jump to avoid them. Medium bones will scroll from both sides of the screen and overlap. Stay in the middle and jump to avoid them. Small bones will scroll from both sides of the screen and overlap. Stay in the middle and jump to avoid them."
    },
    {
      "title": "Continue to fight.",
      "content": "Continue to fight. You'll need to knock Papyrus' HP down to spare or defeat him. After dodging each bone attack, initiate the fight again. Once you've inflicted enough damage, Papyrus will initiate his special attack . The special attack will be thwarted by a dog and Papyrus will use normal attacks instead. If you want to date Papyrus after the fight, be sure to select Flirt instead of Fight ."
    },
    {
      "title": "Continue to avoid attacks.",
      "content": "Continue to avoid attacks. You'll see a series of quick-moving bones with the same movements as the previous attacks. If the attacks come from both ends, stay in the middle and jump. If the attack is an arc, move to the opposite end and then jump over it. Once you jump over the dog and Cool Dude written in bones, you're nearing the end. Eventually, a large forest of bones will appear. Move the SOUL up on the Bullet Board. You should pass over a giant bone. The Bullet Board should be high enough to cover the lower half of Papyrus' face. The very last attack will be a small, slow-moving bone from the right side. Jump over it."
    },
    {
      "title": "Choose Mercy or Fight.",
      "content": "Choose Mercy or Fight . At this point, Papyrus will grant you mercy and offer to spare you. If you're doing a Pacifist run , you must spare Papyrus. As you continue your route, you'll need to spare all other opponents, such as the Royal Guards and the Greater Dog . If you're doing a neutral or Genocide run , you'll need to choose Fight . This will finish Papyrus off in one move."
    },
    {
      "title": "You can date Papyrus if you spare him during battle.",
      "content": "You can date Papyrus if you spare him during battle. Before the battle, Papyrus will appear with different puzzles or simple dialogue. Make sure to talk to him every time you see him, and solve every puzzle correctly. During the fight, you can choose to \"Flirt\" instead of \"Fight\". If you don't choose \"Flirt\" at least once, the post-battle \"date\" will only be a \"hang out\". After the fight, simply return to his house to begin the date."
    }
  ]
}