{
  "url": "https://www.wikihow.com/Get-a-Learner%27s-Driving-License-in-Bangladesh",
  "title": "How to Get a Learner's Driving License in Bangladesh",
  "steps": [
    {
      "title": "Arrange required documents.",
      "content": "Arrange required documents. Downloaded application form from BRTA website. The form also includes a medical certificate form which is also needed to submit with the application form. 3 copies of stamp sized recent color photos (to attach with application form) and 1 copy of passport sized photo (to attach with medical certificate form) Proof of residence (Electricity bill, House tax bill etc.) Attested photocopy of National ID Card / Birth Certificate / Passport"
    },
    {
      "title": "Submit fee.",
      "content": "Submit fee. The fee must be submitted to one of the BRTA listed Banks in Bangladesh. Detailed about banks which accept the fee are given in BRTA website (www.brta.gov.bd). You need to submit the receipt of payment along with the main application form. For getting license as per today (March, 2015) is TK. 345 for each category. If you apply for two categories in one application then you to pay TK. 518 only. Categories are: Motorcycle Motorcar Motor Rickshaw Light Motorized Vehicles (Cars) Medium Motorized Vehicles(SUVs) Heavy Motorized Vehicles (Trucks)"
    },
    {
      "title": "Arrange approved medical certificate.",
      "content": "Arrange approved medical certificate. Go to a registered doctor and have the l certificate form checked up. He'll sign the report and post his seal on the photo attached with it verifying your physical health. If required, the doctor may check your physical condition like eyesight, color blindness, night blindness and deafness before approval of the medical certificate."
    },
    {
      "title": "Submit documents at BRTA office.",
      "content": "Submit documents at BRTA office. You should submit those documents at BRTA office within your own circle (based on your proof of residence). If you stay at Dhaka then you can go to Mirpur 13. Submit the application form along with payment receipt from the bank and medical certificate from registered doctor to the Help desk at the gate. Then wait for the form to be processed by the front desk. They'll give you an estimated time. Get there after that time."
    },
    {
      "title": "Take the processed form from the counter.",
      "content": "Take the processed form from the counter. Take it back to the Inspector's Building which is building number three. Sign it from the first counter."
    },
    {
      "title": "Take the signed form for verification to the Inspector's room next.",
      "content": "Take the signed form for verification to the Inspector's room next. The Inspector's room is just across the floor. Ask anyone, they'll show you."
    },
    {
      "title": "Submit the signed part to the help desk again.",
      "content": "Submit the signed part to the help desk again. Finally you're done, only you have to submit the signed part to the help desk again (from where you started) . Then take the signed Learners' Driving License from there."
    }
  ]
}