{
  "url": "https://www.wikihow.com/Protect-a-Cracked-Phone-Screen",
  "title": "How to Protect a Cracked Phone Screen",
  "steps": [
    {
      "title": "Keep your current screen protector on if you have one.",
      "content": "Keep your current screen protector on if you have one. If you peel off a screen protector after cracking your phone, the adhesive from the back of your screen protector will lift any loose shards up. This can actually damage your phone’s functionality as well, since removing the protector will pull the weakened screen up away from the phone. Your phone is much more likely to continue working if you leave the old screen protector on. [1] X Research source The exception is if your phone has a crack smaller than 0.5 inches (1.3 cm); these cracks are unlikely to hinder the phone’s usability if you remove the screen protector."
    },
    {
      "title": "Peel off the corner of the protector if you aren’t sure the screen cracked.",
      "content": "Peel off the corner of the protector if you aren’t sure the screen cracked. If you have a “shatter-proof” screen protector, the screen protector may have cracked and your screen may be fine. Hold your phone at a 65- to 85-degree angle away from you and inspect the crack. If it looks like the screen protector is cracked, peel up a corner of the protector to get a closer look. [2] X Research source If the protector is cracked but the screen isn’t, peel off the protector and remove it. If your screen is cracked but you’ve peeled the protector up, do your best to smooth it back down and keep it in place."
    },
    {
      "title": "Use a toothbrush to remove loose glass if you don’t have a protector.",
      "content": "Use a toothbrush to remove loose glass if you don’t have a protector. Grab a clean toothbrush. Do not touch the screen directly to avoid cutting yourself. Instead, lift the phone up by its edges and slide a towel underneath. Then, use a toothbrush to firmly brush the cracked area using back-and-forth strokes. Do this for 20-30 seconds to remove any pieces of the screen that are barely hanging on to the phone. [3] X Research source Shake the towel out over a garbage can to discard the pieces of glass. If you don’t remove the loose pieces of glass, you may accidentally cut yourself while you’re fixing or replacing the screen. Alternatively, you can spray the surface of your screen with some canned air. Keep in mind though, this may send shards of glass flying to the floor if you do it inside."
    },
    {
      "title": "Get a roll of clear packing tape that is wider than the phone’s screen.",
      "content": "Get a roll of clear packing tape that is wider than the phone’s screen. Any clear packing tape will work for this. [4] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. Grab a roll that is thicker than the width of your phone screen. You can pick up wide rolls of packing tape from a moving company or construction supply store. [5] X Research source The packing tape must be completely transparent and have a slick texture when you touch it. [6] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. Rougher and translucent tape may not work with your touchscreen. You can use multiple layers of thinner pieces of tape if you’d like. It may reduce the sensitivity of your screen, though."
    },
    {
      "title": "Pull out a length of tape 2 in (5.1 cm) longer than your screen.",
      "content": "Pull out a length of tape 2 in (5.1 cm) longer than your screen. Set your packing tape down under the bottom of your phone. Peel the lip of the tape up and pull out a piece of tape that is at least 1 in (2.5 cm) longer than your phone on the top and bottom. Rip the piece off using the spikes on the tape dispenser. [7] X Research source If you aren’t using a tape dispenser, use a pair of scissors to cut the tape off from the roll."
    },
    {
      "title": "Press the tape down into the screen and smooth it out by hand.",
      "content": "Press the tape down into the screen and smooth it out by hand. [8] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. Starting at the top of the phone, lower the tape to touch the screen. Smooth the tape down as you lower the rest of the tape to keep air bubbles from forming. Once the tape is completely covering your screen, smooth it out using the pads of your fingers to ensure it sticks evenly to the screen. [9] X Research source Don’t press down hard as you’re lowering the tape. You want to ensure that the tape is applied evenly before you press it down entirely."
    },
    {
      "title": "Smooth air bubbles out using the edge of a credit card as needed.",
      "content": "Smooth air bubbles out using the edge of a credit card as needed. Hold the credit card with the longer side facing out and drag it across the surface of the screen at a 45-degree angle. Use the edge of the credit card to push air bubbles out to the sides of your screen to remove them. Continue doing this until all of the air bubbles are removed. [10] X Research source"
    },
    {
      "title": "Trim the excess tape using scissors or a small utility knife.",
      "content": "Trim the excess tape using scissors or a small utility knife. Once your tape is smoothly in place, grab a pair of scissors. Trim the excess tape off by cutting around the edges of your phone. If you really want to clean the tape up, get a small utility knife and trim the tape around the edges of your phone. [11] X Research source Your touchscreen should work just fine so long as there aren’t any big air bubbles in the tape."
    },
    {
      "title": "Get a screen protector and case to keep cracks from getting worse.",
      "content": "Get a screen protector and case to keep cracks from getting worse. Look online or go to your local phone store and purchase a protector that fits your phone. Peel the adhesive backing off and carefully stick it against your phone’s screen. You can also purchase a case that comes with a built-in screen protector to make things easier and provide additional protection. [12] X Research source Screen protectors are not universal—you have to get a protector that fits your specific brand and model."
    },
    {
      "title": "Purchase a DIY repair kit if you want to replace it yourself.",
      "content": "Purchase a DIY repair kit if you want to replace it yourself. DIY screen repair kits are made by phone manufacturers and cost considerably less than paying to get the phone repaired. Purchase a kit for your specific phone model online. Follow the kit’s instructions to get your old screen off and replace it with the new version. Keep in mind, this process can be pretty complicated, and it may not come out perfect even when you follow the instructions. [13] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Scrubbing your screen with toothpaste and a cotton swab may remove scratches , but there are no reliable tricks or hacks for fixing a cracked screen. This process is different from model to model. You’ll need to rely on the kit’s instructions to determine how to get the screen off and replace it."
    },
    {
      "title": "Get your phone screen repaired by a professional as soon as possible.",
      "content": "Get your phone screen repaired by a professional as soon as possible. [14] X Expert Source Linh Le Certified Mobile Repair Specialist Expert Interview. 10 February 2022. If you can afford it, pay a professional to repair your phone screen. It may cost between $50-200 depending on your phone and the repair company you choose to fix it, but it beats having a cracked screen! Once you get your phone repaired, get a high-quality case and screen protector to prevent the odds you crack your screen in the future. [15] X Research source"
    }
  ]
}