{
  "url": "https://www.wikihow.com/Blanch-Spinach",
  "title": "2 Quick & Easy Ways to Blanch Spinach",
  "steps": [
    {
      "title": "Wash the spinach leaves to remove dirt and debris.",
      "content": "Wash the spinach leaves to remove dirt and debris. Fill a large bowl with cool water and add your spinach. Swirl the leaves around a few times before letting the spinach sit for 5 minutes. [1] X Research source Private chef and food educator Ollie George Ciglianoto recommends washing spinach “at least three times…until [the] water is clear and silt free.” Discard any damaged, mushy, or brown leaves before washing the spinach, as well as any leaves that smell bad or rotten. If you prefer to remove the stems from your spinach, do so at this time. Simply cut them off with a small, sharp knife. Optional step : Chop your spinach into bite-sized pieces after washing it, if you prefer uniform pieces over whole leaves."
    },
    {
      "title": "Boil a large pot of water at high heat.",
      "content": "Boil a large pot of water at high heat. Bring 1 gallon (3.8 L) of water to a boil for every 1 pound (453 g) of spinach you’re blanching. Simply fill up a large pot with water, place it on your stovetop, and set the heat to high. [2] X Research source Optional step : Add 1 to 2 tbsp (14.8-29.6 g) of salt to your water. This seasons the spinach and helps it retain nutrients."
    },
    {
      "title": "Fill a large bowl with ice cubes and cold water.",
      "content": "Fill a large bowl with ice cubes and cold water. As you wait for the water to boil, locate a large glass or plastic bowl and fill it with ice cubes. Then, cover the ice cubes with cold water. [3] X Research source Set the bowl next to your stovetop so you can easily transfer your spinach once it boils."
    },
    {
      "title": "Boil a handful of spinach for 1 to 2 minutes, or until it is bright green.",
      "content": "Boil a handful of spinach for 1 to 2 minutes, or until it is bright green. Grab a handful of spinach and drop it into the water. Then, use a slotted spoon to submerge the spinach in the boiling water. Keep the spinach submerged for 1 to 2 minutes, or until it turns bright green; this is a sign that it’s ready. [4] X Research source Do not overfill the pot with spinach. This can lead to uneven blanching and cause the spinach to not keep as well. Avoid over-blanching or under-blanching your spinach. Over-blanched spinach is dark green and less flavorful and nutritious. Under-blanched spinach is less bright and can spoil faster than un-blanched spinach. [5] X Research source"
    },
    {
      "title": "Submerge your spinach in the bowl of ice water for 1 to 2 minutes.",
      "content": "Submerge your spinach in the bowl of ice water for 1 to 2 minutes. Use the slotted spoon to scoop up the spinach and immediately dunk it into the ice water. Press down on the leaves with your spoon so they are totally submerged. Just keep the spinach in the water for 1 to 2 minutes to cool. [6] X Research source Transfer the spinach to the ice water as soon as you remove it from the boiling water for the best results. The ice water stops the blanching process so your spinach stays tender and retains its nutrients."
    },
    {
      "title": "Place your spinach into a strainer to drain the water.",
      "content": "Place your spinach into a strainer to drain the water. Scoop up the spinach with a slotted spoon and place the leaves in a strainer. Push down on the spinach gently with your spoon to remove the excess water. [7] X Research source Alternatively, pour the ice water and spinach directly into the strainer. If you do this, scoop out the ice from the strainer using a spoon or your fingers."
    },
    {
      "title": "Squeeze out the water from the spinach using your hands.",
      "content": "Squeeze out the water from the spinach using your hands. To get rid of as much water as possible, grab the spinach in your hands and gently squeeze the leaves. Or, place the spinach in a cheesecloth bag and then squeeze it. [8] X Research source If you don’t get rid of the excess water, your recipe or sauce can wind up too wet. Repeat the boiling, cooling, and squeezing steps until all of your spinach is blanched. Spinach reduces in size once it's blanched. A large bag of spinach usually turns into a palm-sized ball."
    },
    {
      "title": "Put the spinach in a microwave-safe bowl and cover it with water.",
      "content": "Put the spinach in a microwave-safe bowl and cover it with water. Place at least 5 oz (147.9 g) of washed spinach inside a microwave-safe bowl. For instance, use a glass, plastic, or ceramic container. Then, pour in enough water to cover the spinach. [9] X Research source To check if your container is safe for the microwave , look at the bottom. Most containers read “Microwave-safe” if you can use them in the microwave. Note : Microwave blanching is not as effective as blanching in boiling water. It doesn’t blanch the spinach as evenly, which can cause the spinach to taste off. [10] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source Blanching 5 oz (147.9 g) of spinach yields about 1 cup of frozen spinach."
    },
    {
      "title": "Microwave the spinach on high heat for 2 minutes.",
      "content": "Microwave the spinach on high heat for 2 minutes. Place the container inside your microwave and select a high heat setting. Then, start the microwave for 2 minutes. [11] X Research source Use caution when removing the spinach as the container may be very hot."
    },
    {
      "title": "Fill up a bowl with ice and cool water as the spinach cooks.",
      "content": "Fill up a bowl with ice and cool water as the spinach cooks. Get out a large bowl and add a few handfuls of ice cubes. Then, cover the ice with cold water. [12] X Trustworthy Source National Center for Home Food Preservation Publicly-funded center dedicated to educating consumers about research-backed safety practices for preserving food Go to source"
    },
    {
      "title": "Place the spinach in the ice water for 1 minute.",
      "content": "Place the spinach in the ice water for 1 minute. When the spinach is done in the microwave, use a slotted spoon to transfer it to the bowl of ice water. This stops the spinach from over-blanching, which helps preserve its bright green color and maximize its flavor and nutrient content. [13] X Research source"
    },
    {
      "title": "Strain and squeeze the spinach to get rid of excess water.",
      "content": "Strain and squeeze the spinach to get rid of excess water. Dump the ice water and spinach into a strainer. Then, use the slotted spoon or your hands to gently press and squeeze the water out of the spinach. [14] X Research source"
    },
    {
      "title": "Freeze blanched spinach and store it for up to 1 year.",
      "content": "Freeze blanched spinach and store it for up to 1 year. Place the blanched spinach into a plastic freezer bag or freezer-safe container. Then, label the container with the date and stick it in the freezer . Just plan to use your spinach within 10 to 12 months. [15] X Research source Vegetables that are blanched before frozen retain significantly more of their nutrients than vegetables frozen without blanching."
    },
    {
      "title": "Refrigerate blanched spinach in an airtight container for 3-5 days.",
      "content": "Refrigerate blanched spinach in an airtight container for 3-5 days. If you’re planning to use your blanched spinach quickly, place it in an airtight food storage container. Then, keep it in the fridge for 3-5 days. [16] X Research source"
    },
    {
      "title": "Use freshly blanched spinach immediately, if desired.",
      "content": "Use freshly blanched spinach immediately, if desired. Registered dietitian and chef Jennifer Lease says, “spinach is so versatile and easy to cook! It can be added to many different dishes in healthy ways.” She recommends sautéing blanched spinach “in a pan with a bit of olive oil, which is a heart-healthy fat.” Or, add the spinach to a salad, mix it with pasta, or eat it plain as a healthy side."
    },
    {
      "title": "Add frozen blanched spinach to soups, casseroles, and smoothies.",
      "content": "Add frozen blanched spinach to soups, casseroles, and smoothies. Personal chef Jason Mayer says to defrost frozen spinach in the fridge overnight before using it. Then, add the blanched spinach to your favorite stews , cook it into hot dishes, or make healthy smoothies . [17] X Research source For instance, make quiche, omelettes , palak paneer, or lasagna with your blanched spinach. Frozen, blanched spinach has a mushy texture, so it’s best not to use it in uncooked dishes, like salads."
    }
  ]
}