{
  "url": "https://www.wikihow.com/Cut-a-Pineapple-Hack",
  "title": "How to Peel a Pineapple without a Knife: A Guide to this Viral Hack",
  "steps": [
    {
      "title": "This cutting hack works best with ripe pineapples.",
      "content": "This cutting hack works best with ripe pineapples. Search for a ripe pineapple that’s more yellow than green with fresh, healthy-looking leaves. Then, press into it to ensure that it’s slightly soft. The riper a pineapple is, the yellower the outside will be and the squishier it’ll feel. [1] X Research source Chef Ed Kuoha says that ripe pineapple has “a firmness but still softness to it…it won't be overly soft.” To make sure pineapple is perfectly ripe, personal chef Randall Chambers recommends pressing the “indentation on the bottom” of the pineapple. He says, “If it has some leeway, you're probably okay.” Providing a similar hack, private chef and food educator Ollie George Cigliano says that “the best way to determine if a pineapple is ripe or not is by pulling out the innermost center leaf. If that leaf removes easily, then the pineapple is ripe.” You can also smell the base of the pineapple to be sure it’s ripe—it should smell sweet and fruity, not funky or vinegary."
    },
    {
      "title": "Although gorgeous, the crown gets in the way of “cutting.”",
      "content": "Although gorgeous, the crown gets in the way of “cutting.” Place one hand near the bottom of the pineapple and the other on the leafy top. Hold onto the crown or leafy top tightly and twist—it’s as simple as that! [2] X Research source The riper your pineapple, the easier this step will be. If you can’t twist the crown off, use a paring knife to cut in between each pineapple ridge. Then, rip off the top. [3] X Research source Don’t throw out the crown and instead use it to grow a pineapple plant ! Let it dry out for a week and then set it in soil or a glass of water to grow roots. [4] X Research source"
    },
    {
      "title": "The first “cut” can’t be made without loosening the pineapple meat.",
      "content": "The first “cut” can’t be made without loosening the pineapple meat. Whack or firmly bang the pineapple onto a cutting board, a counter, or even the ground, keeping the crown end face up. Do this 2 or 3 times to get all those juices moving. [5] X Research source Be careful when whacking the pineapple down on a table. The sudden force could cause the table to wobble."
    },
    {
      "title": "The pineapple meat will “cut” easily if it’s separated from the core.",
      "content": "The pineapple meat will “cut” easily if it’s separated from the core. Lay the pineapple on its side and roll it back and forth with your hands. Think of it like kneading a ball of dough. Some juice may start coming out, but don’t panic! That means the hack is working. [6] X Research source"
    },
    {
      "title": "The pineapple’s scalloped skin becomes a utensil with this cutting hack.",
      "content": "The pineapple’s scalloped skin becomes a utensil with this cutting hack. Now that everything’s all loosened up inside, pinch one of the little leaves on the pineapple’s skin. Pull, tug, and wiggle it until a piece of pineapple slips out with the skin. [7] X Research source If you used a knife to help you out earlier, separate the pineapple pieces by digging your finger into the bottom edge of a section’s exterior and pulling upwards. [8] X Research source The skin or rind will still be attached when you pull out a chunk of pineapple, so make sure to eat only the meat."
    },
    {
      "title": "Refrigerating the leftover pineapple keeps it safe to eat for 3-5 days.",
      "content": "Refrigerating the leftover pineapple keeps it safe to eat for 3-5 days. When you’re done snacking on the pineapple, seal the entire fruit in a plastic bag or storage container. Simply store the pineapple in your fridge for up to 3 to 5 days to keep enjoying the juicy pieces of fruit! [9] X Research source"
    }
  ]
}