{
  "url": "https://www.wikihow.com/Replace-a-Bike-Hub",
  "title": "How to Replace a Bike Hub",
  "steps": [
    {
      "title": "Remove the wheel from the bike.",
      "content": "Remove the wheel from the bike. If you're working on a front wheel, pull the quick-release lever on the axle and lift the wheel out of the socket. If you're working on a rear tire, unloop the chain from the freewheel and then hit the release lever. [1] X Research source If your bike doesn't have a quick-release lever, then you'll have to unscrew the axle nut with a wrench instead. Tighten the wrench around the nut on the side of the axle and turn it counterclockwise. When the nut loosens, unscrew it by hand. Then pull the wheel out of its socket."
    },
    {
      "title": "Remove the nut and spring on the skewer in the middle of the hub.",
      "content": "Remove the nut and spring on the skewer in the middle of the hub. Hold the wheel upright and grab the skewer, which runs through the middle of the wheel, from both sides. Turn the nut on the side of the skewer counterclockwise until it comes off. There is also a spring under the nut, so make sure you get that as well. Then pull the skewer out from the other side. [2] X Research source Put the spring and nut back onto the skewer in the order you removed them in so the whole piece stays together. Then put it somewhere safe while you continue to work. This helps you avoid losing pieces."
    },
    {
      "title": "Remove the freewheel if you’re working on a back tire.",
      "content": "Remove the freewheel if you’re working on a back tire. The freewheel is the piece with the bike gears that holds the chain. Take a freewheel remover and slide it over the nut holding the freewheel on. Use a wrench and turn the tool counterclockwise to free the nut. Then lift off the freewheel and store it safely. [3] X Research source Freewheel removers might come in different sizes, so match the size to your bike. You could also buy a set of removers that should fit most bikes. The freewheel is sometimes called a cassette. There are other ways to remove the freewheel as well. Use could hold the freewheel in place with a chain whip and unscrew the nut with a socket wrench."
    },
    {
      "title": "Remove the lock nut on one side of the axle.",
      "content": "Remove the lock nut on one side of the axle. You’ll need 2 wrenches for this task. Lock one wrench below the nut to hold the axle in place. Use the other to turn the nut counterclockwise until it comes off. [4] X Research source Once the screw loosens, you can unscrew it the rest of the way by hand. This part is much easier if you lock the wheel in place with a vise. Turn the wheel so the nut faces up, and lock the other side of the axle into a vise."
    },
    {
      "title": "Pull the spacer and cone off of the axle.",
      "content": "Pull the spacer and cone off of the axle. There are 2 more pieces on the axle below the nut. The spacer is a metal tube directly after the nut. Pull this off first. Then turn the cone counterclockwise to pull it off. [5] X Research source Keep all of these pieces in a safe place so you don’t loose them."
    },
    {
      "title": "Use a magnet to pull out all the ball bearings.",
      "content": "Use a magnet to pull out all the ball bearings . Once you remove the cone, you’ll expose the ball bearings underneath. These are small metal balls sitting in grease and surrounding the hub opening. Use a magnet and pull them all out. Put them aside in a safe place. [6] X Research source You could also work the bearings out with a screwdriver if you don’t have a magnet. Be careful not to lose track of them. Count how many ball bearings you remove. That way, you’ll know if you lost one when you’re putting them back."
    },
    {
      "title": "Pull the axle out of the hub.",
      "content": "Pull the axle out of the hub. First, put a rag under the wheel to catch any ball bearings on the other side that might fall out. Then pull the axle out of the hub. Use a magnet to take out the ball bearings on the other side of the tire. [7] X Research source"
    },
    {
      "title": "Remove the freehub body with a 10mm Allen key.",
      "content": "Remove the freehub body with a 10mm Allen key. This is the tube that holds the axle and ball bearings. Insert a 10mm Allen key into the slot in the middle of the hub and turn it counterclockwise. Pull it out and place it to the side with the other parts. [8] X Research source"
    },
    {
      "title": "Inspect all of the parts for nicks, dings, or scratches.",
      "content": "Inspect all of the parts for nicks, dings, or scratches. Once you’ve removed all the parts, you can decide if they need a simple cleaning or total replacement. Check the axle, nuts, bearings, hub body, and cones for damage. If they have deep scratches, dings, or other nicks, then replace them with new parts. If they aren’t damaged, then they just need a cleaning. [9] X Research source You can get all of these individual pieces at bike shops. Bring the old parts in so an employee can match them with new parts."
    },
    {
      "title": "Soak all of the old parts in paint thinner.",
      "content": "Soak all of the old parts in paint thinner. Fill a jar or can with basic paint thinner. Then, put all of the parts you removed into the jar and let them soak for about 5 minutes. When you pull the parts out, wipe each one down with a rag to remove any remaining grease. [10] X Research source Paint thinner could irritate your skin. If you get any on your skin, wash it off normally with soap and water. Contact your doctor if you notice any irritation, itching, or burning. [11] X Research source If you have sensitive skin, wear gloves while handling paint thinner. You could also use other degreasing solvents like mineral spirits to clean the parts."
    },
    {
      "title": "Wipe off any grease in the hub with a rag and paint thinner.",
      "content": "Wipe off any grease in the hub with a rag and paint thinner. Inspect the hub for obstructions or damage. In most cases, grease and dirt will be built up inside it. Dip a rag into paint thinner and wipe around the exterior of the hub. Then poke the rag through the hub opening to clean the interior. [12] X Research source If the hub is dented or out of shape, the wheel may need total replacement. Bring it to a bike shop for an assessment."
    },
    {
      "title": "Dry all of the parts with a clean rag.",
      "content": "Dry all of the parts with a clean rag. If any of the parts have paint thinner on them, it’ll dissolve the new grease and prevent it from lubricating the hub. Take a dry rag that you haven’t used for any paint thinner and wipe down all the parts, including the inside of the hub. [13] X Research source"
    },
    {
      "title": "Reinstall the freehub body with a 10mm Allen key.",
      "content": "Reinstall the freehub body with a 10mm Allen key. Slide the freehub body through the hub opening. Then insert a 10mm Allen key into the slot and turn it clockwise to tighten the freehub. [14] X Research source"
    },
    {
      "title": "Apply grease to each side of the hub to house the bearings.",
      "content": "Apply grease to each side of the hub to house the bearings. Use a grease injector and squeeze dabs of grease around the hub opening. Make sure the grease doesn’t go above the hub border. Then, flip the wheel over and apply grease to the other side. [15] X Research source There are several types of bicycle grease available, but lithium-based grease is best to prevent water intrusion and rusting. [16] X Research source"
    },
    {
      "title": "Drop one bearing at a time into the grease.",
      "content": "Drop one bearing at a time into the grease. Take one bearing at a time and press it into the grease. Continue pressing down bearings until you fill all the space around the hub. Then do the same on the other side. [17] X Research source Remember to place the same number of bearings on each side as you removed. That’s why counting them is important. Dropping the bearings in with a pair of tweezers helps you place them more precisely and avoids getting grease on your hands."
    },
    {
      "title": "Rebuild one side of the axle with the cone, spacer, and nut.",
      "content": "Rebuild one side of the axle with the cone, spacer, and nut. Take the axle and first replace the cone. Screw the cone down to the bottom of the threaded part of the axle. Then drop the spacer on. Finish by screwing the nut onto the end. [18] X Research source If you have trouble tightening the pieces by hand, use 2 wrenches. Lock one wrench around the cone and another around the nut, then turn the one around the nut clockwise. This tightens the whole section."
    },
    {
      "title": "Insert the axle into the wheel.",
      "content": "Insert the axle into the wheel. Hold the axle by the end nut and drop it through the hub. Press it into the grease lining the hub so it sticks. [19] X Research source"
    },
    {
      "title": "Replace the parts on the other side of the axle.",
      "content": "Replace the parts on the other side of the axle. Flip the wheel around to expose the other side of the axle. Then replace the cone, spacer, and nut the same way on this side. Tighten up the pieces with a wrench. [20] X Research source Spin the axle after you’ve replaced all the pieces. It should turn smoothly, without any resistance. If the action seems jerky or tight, loosen the nut a bit."
    },
    {
      "title": "Reinstall the freewheel if you were working on a back wheel.",
      "content": "Reinstall the freewheel if you were working on a back wheel. Take the freewheel you removed and spin it onto the wheel clockwise. Then place the freewheel remover back onto the freewheel nut and turn it clockwise this time to tighten the part. [21] X Research source"
    },
    {
      "title": "Slide the skewer back through the axle.",
      "content": "Slide the skewer back through the axle. Take the skewer and remove the same nut and spring that you took off at the beginning. Slide the skewer through the axle until it stops. Then, put the spring back on and screw the nut onto the end. Tighten it up with a wrench so it won't fall off. [22] X Research source Be careful taking the nut off the skewer or the spring could fly out."
    },
    {
      "title": "Put the wheel back on the bike.",
      "content": "Put the wheel back on the bike. Once all the pieces are reattached, press the wheel back into its socket on the bike. Make sure you have a tight fit, then press the quick-release lever down to lock the wheel in place. [23] X Research source If you were working on a rear wheel, loop the chain back around the freewheel. If your bike doesn't have quick-release levers, then press the wheel into the socket and attach a nut to the end of the axle. Tighten it up so the wheel is secure. Alternatively, if you want to buy a bike, think about the purpose for which you are buying it. Think whether you will use the bike for transportation, shopping, or recreational rides for fun and fitness. Consider your budget. Find a bike that is the right size that fits you correctly."
    }
  ]
}