{
  "url": "https://www.wikihow.com/Make-Paneer-(Indian-Cheese)",
  "title": "How to Make Paneer (Indian Cheese)",
  "steps": [
    {
      "title": "Bring the milk to a temperature just below boiling.",
      "content": "Bring the milk to a temperature just below boiling. Then turn off the heat. It should be about 80`C.Temp(176 f)."
    },
    {
      "title": "Add lemon juice or citric acid, 5 milliliters (0.17 fl oz) (one teaspoon) at a time.",
      "content": "Add lemon juice or citric acid, 5 milliliters (0.17 fl oz) (one teaspoon) at a time. Stir the milk after each addition until the milk separates; the solid curds part from the green and watery whey. You’re looking for just the right amount of acid to cause the gently boiling milk to curdle. If milk does not start to curdle immediately, start by adding only one teaspoon of lemon juice at a time in a stepwise manner until the milk curdles. Do not add more lemon juice than necessary; otherwise the paneer will not be soft, as well as will taste sour and bitter. Stirring gently and continuously throughout this step will not only separate the solid whitish-colored curds from the greenish-colored liquid whey, but will also prevent the curds from sticking to the sides and bottom of the pan. You will know that the curdling process is finished once the curds have stopped precipitating from the greenish colored liquid whey."
    },
    {
      "title": "Allow the curds and whey to cool for half of an hour (or until still warm, but at a temperature you can handle).",
      "content": "Allow the curds and whey to cool for half of an hour (or until still warm, but at a temperature you can handle). Then strain the mixture through a cheesecloth in a strainer. Rinse the curds with fresh water. You may wish to save some or all of the whey; it can be used to make your next batch of paneer, producing a slightly more tender cheese than lemon juice."
    },
    {
      "title": "Wrap the cheesecloth around itself in order to squeeze out moisture from the curds.",
      "content": "Wrap the cheesecloth around itself in order to squeeze out moisture from the curds. The more you squeeze, the firmer the resulting paneer shall be."
    },
    {
      "title": "Shape the paneer, into a block and wrap it tightly with the cloth.",
      "content": "Shape the paneer, into a block and wrap it tightly with the cloth. By putting a cutting board or something heavy and flat on top of the paneer, you can force out more moisture, and shape it into a firmer block, suitable for slicing and frying. To get a more rectangular shape, tie a knot and place the cheesecloth bundle in a box without closing it. Place something heavy like a pile of books or a brick on the cheesecloth to press down and give the cheese the box's shape. The longer you press the cheese, the firmer it gets. Not all Indian dishes requires cheese to be made into solid blocks. Stuffed Paneer Naans for example require cheese to be loose. Cut and shape the paneer as desired, depending on the type of dish the paneer will added to. Paneer can be cut and shaped into large circular patties for sandwiches, small cubes for savory gravy or soups, or crumbles for garnishing salads."
    },
    {
      "title": "Soak the block of cheese in chilled water for 2-3 hours.",
      "content": "Soak the block of cheese in chilled water for 2-3 hours. This is optional, as the intention is to improve appearance and texture."
    },
    {
      "title": "Use as directed in your recipe.",
      "content": "Use as directed in your recipe."
    }
  ]
}