{
  "url": "https://www.wikihow.com/Respond-to-a-Court-Petition",
  "title": "How to Respond to a Court Petition",
  "steps": [
    {
      "title": "Check if the other party has a lawyer.",
      "content": "Check if the other party has a lawyer. Once you receive your copy of the petition, look at the signature on the last page. If the petition was signed by a lawyer, then you may need to get a lawyer yourself. [1] X Research source"
    },
    {
      "title": "Determine the importance of the case.",
      "content": "Determine the importance of the case. If you are being sued for a small amount of money, then you might not want or need a lawyer to defend yourself. However, if you are sued for a considerable sum, then you should think about getting expert legal help. Also, you should hire a lawyer if you are dealing with child custody issues or if you have been married for 10 years or more and are involved in a divorce. [2] X Research source You do not want to lose your rights to your children or to important spousal property because you are confused about how to defend yourself in a lawsuit."
    },
    {
      "title": "Contact your state bar association.",
      "content": "Contact your state bar association. Each state has a bar association, which is a private organization of attorneys. Most states also run attorney referral services (or they can point you in the direction of a private referral service). You should contact your bar association and ask for a referral."
    },
    {
      "title": "Schedule a consultation.",
      "content": "Schedule a consultation. Lawyers typically provide a 30 minute consultation. These are often offered at reduced-fee or even for free. The purpose of the consultation is to allow the attorney to hear the facts of your case and advise you about your defenses. Be sure to bring all relevant documents to your consultation. [3] X Research source Specifically, bring the copy of the plaintiff's petition. If the lawsuit involves a contract, then bring a copy of the contract. Be sure to ask about what defenses you might have. Also ask if the lawyer thinks you should settle. Take notes. Even if you don't hire the attorney, he or she could have provided you good legal advice during the consultation. By writing the advice down, you can remember it at a later date."
    },
    {
      "title": "Ask about fees.",
      "content": "Ask about fees. One reason people represent themselves in court is because they can't afford an attorney. You should ask the attorneys you meet with for a consultation to estimate what it would cost to have the lawyer defend you. [4] X Research source You can then use this information to decide whether to hire an attorney or to represent yourself in court. Some lawyers might provide “limited scope representation.” Under this arrangement, a lawyer will only do the tasks that you give him or her. For example, if you need help drafting an Answer, the lawyer can help you with that but do no other work on your case. At the consultation, ask if the lawyer offers this service."
    },
    {
      "title": "Think about what injuries the plaintiff has caused you.",
      "content": "Think about what injuries the plaintiff has caused you. If the plaintiff has caused you harm, then you can countersue by bringing a “counterclaim.” For example, if you were in a car accident and you believe the plaintiff was at fault, then you can bring a counterclaim for injuries that you suffered in the accident. Try to figure out if the plaintiff owes you money or has injured you in any way. If you win your counterclaim, then the amount of money you win may offset any amount the plaintiff wins against you. [5] X Research source For example, if the plaintiff sues you for $1,000 but you bring a counterclaim for $900, then you will owe the plaintiff only $100 if you both win."
    },
    {
      "title": "Determine if your counterclaim is “mandatory” or “permissive.”",
      "content": "Determine if your counterclaim is “mandatory” or “permissive.” You must bring some counterclaims when you file your Answer. Generally, you must file a counterclaim as part of your Answer if the counterclaim arises from the same occurrence or transaction that gave rise to the plaintiff's claim. [6] X Research source For example, in a car accident, both your injuries and the plaintiff's injuries were caused by the same “occurrence” (the accident), so it is a mandatory counterclaim. Permissive counterclaims arise out of a different transaction or occurrence. If you have a permissive counterclaim, then you can bring it now or later. [7] X Research source For example, the plaintiff may sue you for damage you caused when you cut a tree down. If you want to sue the plaintiff for having loud parties at night that are a nuisance, then you have a choice whether to bring it now or at a different time."
    },
    {
      "title": "Gather evidence.",
      "content": "Gather evidence. You can't sue unless you have a good faith belief that you are entitled to recover from the plaintiff. You should gather as much evidence as you can that the plaintiff harmed you. If you file a frivolous counterclaim, the court could fine you. [8] X Research source Think about what evidence you can point to that the plaintiff has caused you harm. In a traffic accident situation, then the proof may be easy: you hit each other head-on and you think that the plaintiff is to blame. However, you can't just make up a counterclaim. You should talk about possible counterclaims when you meet with a lawyer. Also determine the amount of your counterclaim. If you are suing for personal injury, then you can recover for medical expenses as well as lost wages and pain and suffering. [9] X Research source"
    },
    {
      "title": "Understand defenses.",
      "content": "Understand defenses. In addition to counterclaims, you also need to raise any defense that you have to the lawsuit. There are many possible defenses. For example, if the plaintiff has sued you on a debt, then you have a defense if you have already paid. Other common defenses are: [10] X Research source You were too young to form a contract (i.e., under age 18). The law does not allow the plaintiff to sue. The plaintiff has waited too long to sue (i.e., the statute of limitations has run out)."
    },
    {
      "title": "Read your summons.",
      "content": "Read your summons. The summons that came along with the petition should tell you when you must respond. [11] X Research source Mark that date on your calendar. If you fail to respond in time, then the plaintiff could seek a default judgment against you. When you suffer a default judgment, you essentially lose the case without ever getting to tell your side of the story to the judge. Default judgments sometimes can be set aside, but that process is difficult. For this reason, you are well-advised to respond to the plaintiff's petition in a timely manner."
    },
    {
      "title": "Find an Answer form.",
      "content": "Find an Answer form. Many courts now offer printed “fill in the blank” Answer forms that you can use. Ask the court clerk if a form is available. You can also search the court's website for a form."
    },
    {
      "title": "Complete the form.",
      "content": "Complete the form. Type or print neatly using blue or black ink. You want the judge to be able to read your Answer. Although each form will ask for slightly different information, you should prepare to provide the following: what information in the petition you agree with what information you disagree with what information you have insufficient knowledge of to either admit or deny any counterclaims and/or defenses the relief requested (e.g., you want the case dismissed)"
    },
    {
      "title": "Draft an Answer.",
      "content": "Draft an Answer. If your court does not have “fill in the blank” forms for you to use, then you will need to draft your own Answer. If you hire a lawyer, then he or she can prepare this document for you. If you need to create your own, then keep the following in mind: Pull the header information from the plaintiff's petition. Insert it exactly into your document: the name of the court at top, the names of the parties, the case number, and the name of the judge. Title your Answer “Answer to Plaintiff's Petition/Complaint.” Center this title and make it bold. Introduce yourself. In the first paragraph, you should type, “COMES NOW Defendant, [your name], representing herself pro se, answering Plaintiff's Petition, states…” Admit, deny, or claim that you lack sufficient knowledge to admit or deny each of the plaintiff's numbered allegations. For example, “As to paragraph 1, I have insufficient knowledge whether to admit or deny” or “As to paragraph 1, I admit the allegation.” State your defenses under the heading “Affirmative Defenses.” For example, you could type, “Plaintiff's complaint should be dismissed because it has been filed after the expiration of the statute of limitations. In Michigan, contract cases have a six year statute of limitations. Plaintiff filed this lawsuit six years and two months after the alleged contract breach.” List your counterclaims. You can briefly state your counterclaims under the heading “Counterclaims.” If you have more than one, then number them “Counterclaim 1,” Counterclaim 2,” etc. You can type, “Defendant brings a counterclaim for negligence against Plaintiff for personal injuries arising out of the same traffic accident on March 15, 2015.” Then state how much your counterclaim is for."
    },
    {
      "title": "Don't forget your “Certificate of Service.”",
      "content": "Don't forget your “Certificate of Service.” On a separate page, place “Certificate of Service” at the top, centered. Then tell the court how you served a copy of the Answer on the plaintiff. You could write, “I hereby certify that on this 15th day of August, 2016, a copy of the foregoing Answer was delivered on [insert name of plaintiff or plaintiff's attorney], located at [insert address], in the following manner: [certified mail, personal service, fax, etc.].” Then include the date and your signature. If you are using a printed “fill in the blank” Answer form, then the Certificate of Service should be part of the form. Simply fill in the information."
    },
    {
      "title": "File the Answer.",
      "content": "File the Answer. You should take the Answer and copies of any attachments to the court clerk and ask to file. Make several copies of the entire packet and have the court clerk date stamp them all. One copy will be for your records and one copy should be for the plaintiff."
    },
    {
      "title": "Serve notice.",
      "content": "Serve notice. Serve a copy of your Answer on the plaintiff. Courts differ slightly on the methods of service that they allow. Generally, however, you can serve notice on the plaintiff in the following ways: Certified mail, return receipt requested. Hand delivery by someone 18 or older who is not a party to the case. Hand delivery by a private process server. To find process servers, check your phone book under “Process Server.” You will typically have to pay a fee, of around $45-75. [12] X Research source Another method, such as by fax. Ask your court clerk for acceptable methods."
    }
  ]
}