{
  "url": "https://www.wikihow.com/Overcome-Learned-Helplessness",
  "title": "How to Overcome Learned Helplessness",
  "steps": [
    {
      "title": "Look for the source of your learned helplessness.",
      "content": "Look for the source of your learned helplessness. Your learned helplessness may have taken root due to the circumstances of your development. Try to find the root of your learned helplessness. Think back on events in your early life that may have contributed to the way you think today. [1] X Research source For instance, in childhood, you may have been neglected or abused by your parents, and, therefore, learned that you could not expect adults to help. Or, you may have been raised by adults who felt crippled by the system and unable to improve their lives (and had learned helplessness themselves). Reflect on your early experiences to identify the starting point of your beliefs. You may even ask friends or loved ones about your behavior to see if they can spot a common denominator that influenced who you are today."
    },
    {
      "title": "Spot negative beliefs that keep you stuck.",
      "content": "Spot negative beliefs that keep you stuck. Bring awareness to how learned helplessness affects your daily life. You can do this by recognizing the beliefs that influence your behavior. You should also observe your use of self-defeating, helpless language. By identifying this pessimistic language, you can work to change it. [2] X Research source Grab a notebook and write out some of your general beliefs about life. These might sound like “if you’re not born wealthy, you’ll never have wealth” or “good people always finish last.” Take note of your self-talk by writing down thoughts you have along the lines of “I’m a loser,” “I’ll never get that promotion,” or “if I was beautiful, maybe guys would notice me.”"
    },
    {
      "title": "Beware of self-fulfilling prophecies.",
      "content": "Beware of self-fulfilling prophecies. Your thoughts and beliefs have the ability to shape who you are as a person. How you think can influence what goals you set, what career you pursue, and even the kind of people you date. Even though you might want more for your life, your thoughts may have handicapped you into settling. For instance, from the earlier example, you believed “If you’re not born wealthy, you’ll never have wealth.” If you allow this belief to take root, it may unfold just that way in your own life. You might mess up opportunities to make more money or stay in a constant cycle of debt."
    },
    {
      "title": "Perform reality testing against negative self-talk.",
      "content": "Perform reality testing against negative self-talk. If your self-talk is overly negative, it can lead to low self-esteem, depression , or anxiety. Tackle the unhelpful thoughts you have by looking for evidence to support or oppose these thoughts. [3] X Research source For instance, you might think “I’m a loser.” You might seek out evidence for or against this thought. Is this a factual thought? Are you jumping to conclusions? If you have any positive relationships in your life, that automatically discounts the notion that you’re a loser."
    },
    {
      "title": "Try to find alternative explanations for your beliefs.",
      "content": "Try to find alternative explanations for your beliefs. Sometimes, learned helplessness develops because you refuse to see that there are various explanations for life events. By looking for alternative explanations you will feel more empowered to change your situation. You might improve your mood, too. [4] X Research source Let’s say, you were passed up for a promotion at work. You might immediately think, “my boss doesn’t like me.” Take a step back, however, and try to see it another way. Perhaps the other person was simply more qualified. Or, maybe your boss passed you up because you don’t seem ambitious about being promoted."
    },
    {
      "title": "Reframe negative events to focus on effort, not fixed traits.",
      "content": "Reframe negative events to focus on effort, not fixed traits. If you suffer from learned helplessness, you may not give yourself credit for your successes. Yet, you probably blame yourself for all your failures. Learn to reframe negative events by changing your attributions to effort-based contributions instead of fixed personality traits. [5] X Trustworthy Source Edutopia Educational nonprofit organization focused on encouraging and celebrating classroom innovation Go to source Instead of saying “I’m stupid because I screwed up the report” say “I could have tried harder. Next time, I will.” This allows you to base your successes on effort—which can always be enhanced—versus stable traits like stupidity."
    },
    {
      "title": "See yourself as worthy",
      "content": "See yourself as worthy . Generally, people with learned helplessness struggle with poor self-esteem. You may not recognize the power you have in your own life. You see yourself as a puppet when really you are the puppeteer. You must identify your strengths and believe in your potential. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Write out a list of positive characteristics about yourself. Dig deep, using both minor and major traits. These might include “I am financially savvy” or “I am good with details.” Keep this list within reach whenever you start to doubt your worthiness."
    },
    {
      "title": "Get help from a therapist.",
      "content": "Get help from a therapist. Transforming from a helpless outlook to an empowered one is a challenge. The process is only complicated by depression, anxiety, abandonment issues, a history of abuse or extremely low self-esteem . If you are having trouble replacing your old beliefs, you may need to see a trained professional. Locate a therapist in your community who works with people with learned helplessness. Or, explain your circumstances to your primary care physician and ask for a referral."
    },
    {
      "title": "Set objective goals.",
      "content": "Set objective goals. Goal-setting can be a powerful activity for overcoming learned helplessness. The mere suggestion of planning your future can actually help you feel more in control. Start by developing realistic goals. [7] X Research source Try the SMART goal strategy of setting goals that are specific, measurable, attainable, realistic, and time-bound. For instance, you might set a goal to increase your income by 25 percent within the next six months."
    },
    {
      "title": "Pinpoint one small action you can take daily.",
      "content": "Pinpoint one small action you can take daily. Once you have clearly defined goals, focus on one at a time. Complete at least one task each day that pushes you closer to reaching your goals. Small daily actions build momentum and make you feel more in control. A daily action relating to your goal might be searching for side jobs or reducing your expenses to free up more money."
    },
    {
      "title": "Celebrate small wins.",
      "content": "Celebrate small wins. If your goals are spread out over long periods, you can easily become fatigued or bored. Develop small milestones that mark your progress. Then, celebrate as you cross each milestone. It may be nice to connect attractive rewards to each milestone that motivate you to get there. These might include a dinner out with your partner or family or a weekend away."
    },
    {
      "title": "Create positive relationships.",
      "content": "Create positive relationships. The people you surround yourself with influence your beliefs for better or worse. Get distance from others with learned helplessness or negative attitudes. Seek out people who have optimistic, “can-do” attitudes. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You might find such people by joining professional organizations or clubs relating to your interests."
    },
    {
      "title": "Pause and implement self-care when stressed.",
      "content": "Pause and implement self-care when stressed. When negative, stressful events do occur, be gentle with yourself. You might be tempted to fall back into old patterns with negative thinking. Build a toolbox of positive habits that you can turn to instead. [9] X Research source To perform self-care, try including activities like meditation , journaling, napping, or taking warm bubble baths to your routine. You might also enjoy spending time in nature. Or, you can decompress by completing a page of an adult coloring book."
    }
  ]
}