{
  "url": "https://www.wikihow.com/Clean-Sofa-Stains",
  "title": "How to Clean Sofa Stains",
  "steps": [
    {
      "title": "Locate the manufacturer’s care tag on your sofa.",
      "content": "Locate the manufacturer’s care tag on your sofa. Care tags are usually located under one of the cushions or on the underside of the sofa. The care tag will have a cleaning code that tells you how to tackle the stain safely. Not following these instructions could damage the upholstery permanently and void your warranty. [1] X Research source"
    },
    {
      "title": "Use water-based techniques for sofas marked with a “W.",
      "content": "Use water-based techniques for sofas marked with a “W. ” This cleaning code means you can safely use water and gentle, water-based cleaning solutions on the fabric. A mild cleaning solution made with water and dish soap is a great option, or you can try a steam approach to lift the stain. [2] X Research source These are usually the easiest sofas to clean and this cleaning code is the most common one. Solvents can damage this fabric, so steer clear of those. Vacuuming is fine for these sofas."
    },
    {
      "title": "Vacuum sofas that are marked with an “X.",
      "content": "Vacuum sofas that are marked with an “X. ” These fabrics are the most delicate and you shouldn’t use water or solvents at all on them. You can safely vacuum the material, but that’s it. You’ll need to contact a professional upholstery cleaner if your vacuum doesn’t do the trick. [3] X Research source This code is fairly rare; you might see it if your sofa is made of a unique or unusual material."
    },
    {
      "title": "Try solvent-based techniques for sofas marked with an “S.",
      "content": "Try solvent-based techniques for sofas marked with an “S. ” You shouldn’t use water or water-based techniques on these fabrics—they will stain. Special dry-cleaning solvents are the only safe option. If the care tag specifies a particular kind of solvent, don’t deviate from those instructions. Otherwise, you can use an all-purpose solvent cleaner that’s formulated for fabrics. [4] X Research source You can pick up commercial fabric solvents at home supply stores or order them online. [5] X Research source Vacuuming is safe for these sofas."
    },
    {
      "title": "Use a combination approach for sofas marked “WS.",
      "content": "Use a combination approach for sofas marked “WS. ” You can safely use water-based techniques and solvents on this kind of fabric. It’s usually best to try solvents first before moving on to water-based techniques. However, this cleaning code is pretty rare, so you may want to consider consulting a professional. [6] X Research source"
    },
    {
      "title": "Proceed with caution if you can’t find any care tags.",
      "content": "Proceed with caution if you can’t find any care tags. If your sofa is missing the care tags, or if you have a vintage piece, using water-based techniques or solvents can be risky. Start with gentle water-based techniques and go from there. It’s a good idea to spot treat a hidden area before using any cleaning technique. [7] X Research source Vacuuming is safe for materials without care tags. If the fabric is particularly delicate, you may want to adjust the suction to the gentlest setting."
    },
    {
      "title": "Vacuum the stain to remove any loose particles.",
      "content": "Vacuum the stain to remove any loose particles. You can use a hand vacuum or your regular vacuum with a soft brush attachment on the stained area. Vacuuming first will get rid of any loose dirt and debris and sometimes even lighten the stain a bit. [8] X Research source It’s difficult to evaluate the seriousness of a stain without vacuuming it first, so always start by running the hand vac or an attachment over the upholstery."
    },
    {
      "title": "Mix dish soap and cool water to create a cleaning solution.",
      "content": "Mix dish soap and cool water to create a cleaning solution. Add a few drops of a mild dish soap to a bowl or small bucket. Then, add cool water from your tap to create a sudsy solution. You may need to swish your hand around in the water to work up a few suds first. [9] X Research source You can add extra cleaning power to your solution by mixing in a little vinegar. Some professionals recommend using distilled water when cleaning upholstery, since it doesn’t leave behind mineral stains when it dries. If you’re particularly worried about your sofa, or if it’s extremely expensive, you may want to heed this advice—it’s up to you! [10] X Research source"
    },
    {
      "title": "Dampen a microfiber cloth with the solution and blot the stain gently.",
      "content": "Dampen a microfiber cloth with the solution and blot the stain gently. Dip your cloth into the solution and wring it out thoroughly. Blot at the stained area until the stain starts to lift. Keep blotting until the stain disappears. Avoid rubbing the fabric or blotting it too deep, which can cause the stain to set in further. [11] X Research source It’s important not to saturate the fabric, so be sure to use a dampened cloth, not a soaked one. [12] X Research source"
    },
    {
      "title": "Use a fresh cloth dampened with plain water to rinse away the soap mixture.",
      "content": "Use a fresh cloth dampened with plain water to rinse away the soap mixture. Wet a new microfiber cloth with plain water and wring it out thoroughly. Continue blotting at the stained area to remove the soap mixture from the fabric. [13] X Research source If you don’t want to get a new cloth, just be sure to rinse the soapy solution out of your original microfiber cloth before using it for rinsing. If the stain hasn’t lifted completely at this point, you can repeat blotting with the solution and rinsing with clean water until it disappears."
    },
    {
      "title": "Press the spot with a clean cloth or paper towel to dry the area.",
      "content": "Press the spot with a clean cloth or paper towel to dry the area. Gently dab at the wet area with a dry towel to soak up any excess moisture from the fabric. If you need to speed things up, try pointing a box fan at the sofa or turning on the ceiling fan. [14] X Research source Avoid using a hair dryer to dry delicate fabrics, since the heat could possibly damage it. Using the cool setting is probably fine, though!"
    },
    {
      "title": "Apply a foaming fabric or carpet cleaner if soap and water don't work.",
      "content": "Apply a foaming fabric or carpet cleaner if soap and water don't work. Directions may vary, but typically, you cover the stained area thoroughly with the foam cleaner and let it sit for 5-10 minutes. Then, gently blot it up with a microfiber cloth and let the area air dry. It’s best to do a spot test on an inconspicuous area before applying these cleaners to sofa upholstery. You can get these common cleaning products at grocery and home improvement stores."
    },
    {
      "title": "Use a vacuum attachment to remove any loose particles.",
      "content": "Use a vacuum attachment to remove any loose particles. No matter what kind of cleaning code your sofa has, vacuuming is safe and should always be your first step. Use a soft brush attachment or a hand vacuum to suck up any dirt, debris, or loose particles. Vacuuming alone may even completely remove mild stains that haven’t set into the fabric. [15] X Research source The sooner you address the stain, the better your chances are of removing it. Keep in mind that if your couch has an “X” cleaning code, vacuuming is the only type of cleaning you can safely do to remove stains."
    },
    {
      "title": "Blot stains gently with vinegar or vodka if the fabric is water-safe.",
      "content": "Blot stains gently with vinegar or vodka if the fabric is water-safe. Using anything other than a solvent on an “S” sofa could ruin it, but if the fabric is water safe, dab the stained area gently with a microfiber cloth dampened with distilled white vinegar or vodka. Once the stain lifts, let the spot air dry. Don’t worry, the vinegar or alcohol scent will fade as the material dries. Microfiber, suede and leather can usually be cleaned with this technique. If the stain doesn’t lift, you may want to follow up with a water-based soapy solution. [16] X Research source"
    },
    {
      "title": "Use saddle soap or dish soap with warm water for minor leather stains.",
      "content": "Use saddle soap or dish soap with warm water for minor leather stains. For most leather, you can use the soap and water technique that's used for fabrics like cotton and linen. If you're concerned about using dish soap, use a saddle soap made specifically for leather surfaces and follow the same technique. Alternatively, you can use a mixture of 1 ⁄ 2 cup (120 mL) of olive oil and 1 ⁄ 4 cup (59 mL) of white vinegar. Mix them together in a spray bottle, spray the mixture on the stain, and buff it out with a clean cloth."
    },
    {
      "title": "Use rubbing alcohol to spot treat tough stains like ink.",
      "content": "Use rubbing alcohol to spot treat tough stains like ink. Dark stains, like ink stains, won't respond well to soap and water or other liquid-based techniques. Instead, soak the head of a Q-tip with rubbing alcohol and dab at the stain until it lifts. Toss the Q-tip and get a fresh one once the cotton swab starts looking dirty. [17] X Research source Pat the area dry with a clean towel after the stain lifts. This is usually safe for leather, microfiber, and suede sofas. Treat beer or coffee stains with a mixture of 1 teaspoon (4.9 mL) of liquid dish or laundry detergent and a small amount of warm water. Rub the mixture into the stain and blot it out with a paper towel. You can also pre-treat the stain by rubbing it with ice."
    },
    {
      "title": "Soak up grease stains with baking soda.",
      "content": "Soak up grease stains with baking soda. Using water and other liquids on grease stains may just spread the grease around. Instead, cover the stain with baking soda and let it sit for a few hours. The baking soda will draw up the grease from the material. You can then brush it away or vacuum it up. [18] X Research source This is usually safe for leather, microfiber, suede, and water-safe fabrics like cotton and linen."
    },
    {
      "title": "Apply a commercial solvent cleaner for sofas marked “S.",
      "content": "Apply a commercial solvent cleaner for sofas marked “S. ” These commercial solvents are sometimes marketed as dry-cleaning solvents. Application and directions will vary depending on the brand and type of solvent you’re using, so be sure to read the instructions carefully. Typically, you apply the solvent and follow up by drying the area thoroughly with a fan or blow dryer. [19] X Research source Letting the fabric air dry could cause a ring stain around the problem area. These solvents are very strong, so be sure to crack a window and follow any other safety instructions specified by your particular product."
    },
    {
      "title": "Contact a professional upholstery cleaner for stubborn stains.",
      "content": "Contact a professional upholstery cleaner for stubborn stains. If you’ve tried everything and the stain persists, you may be better off just contacting a professional. For “X” cleaning codes, this is definitely what you should do, since vacuuming is your only at-home cleaning option. If you aren’t comfortable working with strong solvents for “S” codes, contact a professional."
    },
    {
      "title": "Run a vacuum attachment over the spot to suck up loose debris.",
      "content": "Run a vacuum attachment over the spot to suck up loose debris. A soft brush attachment is the best choice, or you can use a hand vacuum on the fabric. It’s important to remove dirt and debris before steaming the fabric to prevent embedding the particles deeply into the fabric. Sometimes vacuuming can even lighten the stain a bit! [20] X Research source You may want to crack a window if you’re working in a small area so you don’t get too warm. This will also help to dry the fabric."
    },
    {
      "title": "Add water to the steam cleaner and fit it with an appropriate attachment.",
      "content": "Add water to the steam cleaner and fit it with an appropriate attachment. How and where to add water will vary depending on what kind of steamer you have. Once you locate the water tank, simply fill it with fresh water. Attachments will also vary, but the best options are usually stationary or circling soft brush attachments. Microfiber cloth attachments are also effective for this job. You can add a fabric-safe or upholstery shampoo to the water if your steamer uses it, but plain water should do the trick for most stains. You can buy a handheld steamer for this or rent a larger model at a home improvement store."
    },
    {
      "title": "Turn the steamer on and gently move it over the stained area.",
      "content": "Turn the steamer on and gently move it over the stained area. If you’re dealing with a very large stain, work on small sections at a time for the best results. Keep the steamer moving slowly over the stain rather than hitting one small area with a stationary blast of steam. The stain should start lifting after a few passes with the steamer. If you added soap or upholstery shampoo, you’ll need to repeat the process with plain water to rinse it away before letting the fabric dry."
    },
    {
      "title": "Let the sofa air dry completely.",
      "content": "Let the sofa air dry completely. Cracking a window can speed up the process. If you need to dry the sofa even faster, you can point a fan at the sofa or turn on the ceiling fan in the room. Hair dryers also work if you’re in a bind. Ideally, you should let it air dry, though."
    }
  ]
}