{
  "url": "https://www.wikihow.com/Crochet-a-Baby-Blanket",
  "title": "How to Crochet a Baby Blanket",
  "steps": [
    {
      "title": "Decide on a size.",
      "content": "Decide on a size. Baby blankets come in different sizes. Before you begin, you'll need to decide what size blanket you're going to make. Here are some common sizes for infant and baby blankets. A smaller size makes a nice blanket to lay over a newborn; choose a larger size if you want your blanket to be used for a long time. Receiving blanket - 36\" x 36\" Crib blanket - 36\" x 54\" Toddler blanket - 40\" x 60\""
    },
    {
      "title": "Choose your yarn.",
      "content": "Choose your yarn. Yarns are made in different styles. If you are a beginner, it will be easiest to work with a smooth yarn. Yarn is also categorized by weight, or the thickness of the strand. [1] X Research source A yarn's weight determines how big your stitches will be, how your finished item will look and feel, and what size hook you will need to use. It also determines how long it will take you to finish your project. You will find a yarn's weight printed on the package; they range from 0 - Lace to 6 - Super Bulky. [2] X Research source Here are some recommended yarns to use for a baby blanket. 1- Super Fine or Fingering: good for light, lacy blankets 2 - Fine or Sport Weight: good for light yet cuddly blankets 3 - Light Worsted or DK (Double Knit): good for warmer, yet still light blankets 4 - Worsted Weight: slightly heavier, but very easy to work with"
    },
    {
      "title": "Choose your hook.",
      "content": "Choose your hook. Crochet hooks come in different sizes. In the U.S., sizes are denoted by letters. The higher the letter, the larger the hook - so, a K hook will be larger than an H hook. Generally speaking, the heavier yarn weight you choose, the larger hook you will need. Here are some suggested combinations for yarn and hook. [3] X Research source [4] X Research source Super Fine - B-1 to E-4 hook Sport Weight - E-4 to 7 hook Light Worsted/DK - 7 to I-9 hook Worsted Weight - I-9 to K-10.5 hook"
    },
    {
      "title": "Know the stitches.",
      "content": "Know the stitches. There are dozens of different crochet stitches and techniques, but most of them are built on two basic stitches: the single crochet (sc) and double crochet (dc) Some complex stitches, like the blanket stitch , combine double and single crochet stitches in a sequence, so learning these two stitches can also help you build to more intricate designs."
    },
    {
      "title": "Make a starting chain.",
      "content": "Make a starting chain. A starting chain , also called a foundation chain, is literally the foundation of any crochet project. Every crochet pattern will tell you how many stitches you need in your starting chain. [5] X Research source A chain is made with several chain stitches (ch). To make a starting chain, follow these steps. Make a slip knot and loop it over the crochet hook. Leave at least a 6\" tail on the end of the knot. Hold the crochet hook in your right hand and the yarn in your left. Pass the yarn over the hook from back to front (this is called yarn over or yo) Pull the hook and the wrapped strand of yarn through the original loop on the hook. You have now made one chain, and should have one loop remaining on the hook. Continue this until you have the number of chains you wish, or as specified by the pattern."
    },
    {
      "title": "Learn to single crochet (sc).",
      "content": "Learn to single crochet (sc). Single crochet is the simplest stitch, and creates a tightly woven fabric. To make a single crochet stitch: [6] X Research source Begin with a starting chain. For practice, make a chain of 17. Make sure the front of the chain is facing up. The front of the chain looks like a row of nesting \"V\"s. The back of the chain looks like a row of bumps. Insert the hook from front to back into the second chain from the hook. Yarn over the hook. Pull the hook and the wrapped strand of yarn through the stitch. You should now have two loops remaining on your hook. Yarn over the hook again. Pull the hook and the wrapped strand of yarn through both of the loops on your hook. You should now have one loop remaining on your hook, and have made one single crochet. Moving right to left, continue making single crochets until you reach the end of the chain. You have now made one row of single crochet."
    },
    {
      "title": "Learn to double crochet (dc).",
      "content": "Learn to double crochet (dc). Double crochet is one of the most commonly used and versatile crochet stitches. It makes fabric that is solid, but more flexible and soft than fabric made with single crochet. To make a double crochet stitch: [7] X Research source Being with a starting chain. For practice, make a chain of 19. Make sure the front of the chain is facing up. The front of the chain looks like a row of nesting \"V\"s. The back of the chain looks like a row of bumps. Yarn over the hook. Insert the hook from front to back into the fourth chain from the hook. Pull the hook and the wrapped strand of yarn through the stitch. You should now have three loops on the hook. Yarn over and draw the hook and wrapped strand of yarn through the first two loops. You should now have two loops on the hook. Yarn over again, and draw the hook and wrapped strand of yarn through both loops. You should now have one loop remaining on your hook, and have made one double crochet. Moving right to left, continue making double crochets until you reach the end of the chain. You have now made one row of double crochet."
    },
    {
      "title": "Begin your blanket with a foundation chain.",
      "content": "Begin your blanket with a foundation chain. Using a Worsted Weight yarn and an H hook, make a foundation chain. [8] X Research source While you're working, stop every few stitches and check to make sure your foundation chain isn't twisted. Smooth it out as necessary, always leaving the row of \"V\"s facing up. To make a 36\" x 36\" blanket, chain 150 To make a 36\" x 54\" blanket, chain 150 To make a 40\" x 60\" blanket, chain 175"
    },
    {
      "title": "Crochet the first row.",
      "content": "Crochet the first row. Beginning with the second chain from your hook, work single crochet stitches all along the foundation chain. Try to keep your stitches as even as possible as you work."
    },
    {
      "title": "Make a turning chain.",
      "content": "Make a turning chain . To proceed from the first row to the second row, you will need to make a turning chain. A turning chain is like a vertical bridge or connector between the rows. The length of your turning chain varies depending on the type of stitches you are using for your project. When you get to the end of your first row, make one chain stitch (ch 1). This is your turning chain. The turning chain counts as the first stitch of your next row."
    },
    {
      "title": "Crochet the second row.",
      "content": "Crochet the second row. With your turning chain in place, you can begin the second row. Flip your work over so that the back side of the fabric is facing you, and your crochet hook is at the right. The last stitch of row 1 now becomes the first stitch of row 2. Insert your hook into the first stitch of row 2, and work a single crochet stitch. Continue all the way to the end of the row."
    },
    {
      "title": "Continue crocheting until you have made the desired number of rows.",
      "content": "Continue crocheting until you have made the desired number of rows. The exact number of rows will depend on how tightly you crochet, but here are some guidelines: For a 36\" x 36\" blanket, make 70 rows For a 36\" x 54\" blanket, make 105 rows For a 40\" x 60\" blanket, 110 rows"
    },
    {
      "title": "Check your work as you go.",
      "content": "Check your work as you go. It's a good idea to stop and check your work every so often. Count to make sure you are making the same number of stitches in each row. Check for mistakes. Measure your work with a measuring tape to see how close you are getting to your goal. If you notice a mistake, here's what you can do: Slip your hook out of the yarn loop and pull gently on the end of the yarn. Your work should start to unravel. Keep gently unraveling the yarn until you get to the point of your mistake. Unravel back to one stitch prior to your mistake. Insert your hook into the loop for that stitch, and begin crocheting from that point."
    },
    {
      "title": "Finish the blanket.",
      "content": "Finish the blanket. When your blanket is as long as you want it to be, work all the way to the end of your last row. Then, you can add a border, end off your yarn, and weave in the ends. To make a simple border, flip your fabric over so the right side is facing you, then turn your the fabric 90̊. Ch 1 and insert your hook into the corner of your fabric. Make 3 sc into the corner. Sc all along the edge of your fabric until you reach the next corner, make 3 sc in the corner and continue around in this fashion until you reach your starting point. You can add another row of border in the same manner if you wish. To end off, ch 1 and make a big loop with the yarn. Slip the hook out of the loop and cut your yarn, leaving a long tail. Pull the end of the yarn through the loop and tighten to make a knot. To weave in the ends of the yarn, hold your fabric with the back side facing you. Thread the end of the yarn through a tapestry needle. Insert the needle through the bottom of several stitches (about two inches). Skip the last half of the last stitch, then weave the needle back through the same stitches for about an inch. Pull the yarn through, and clip the end of the yarn close to the fabric."
    },
    {
      "title": "Begin your blanket with a foundation chain.",
      "content": "Begin your blanket with a foundation chain. Using a Worsted Weight yarn and an H hook, make a foundation chain. While you're working, stop every few stitches and check to make sure your foundation chain isn't twisted. Smooth it out as necessary, always leaving the row of \"V\"s facing up. To make a 36\" x 36\" blanket, chain 150 To make a 36\" x 54\" blanket, chain 150 To make a 40\" x 60\" blanket, chain 175"
    },
    {
      "title": "Crochet the first row.",
      "content": "Crochet the first row. Beginning with the fourth chain from your hook, work double crochet stitches all along the foundation chain. Try to keep your stitches as even as possible as you work."
    },
    {
      "title": "Make a turning chain.",
      "content": "Make a turning chain. To proceed from the first row to the second row, you will need to make a turning chain. A turning chain is like a vertical bridge or connector between the rows. [9] X Research source The length of your turning chain varies depending on the type of stitches you are using for your project. When you get to the end of your first row, make three chain stitches (ch 3). This is your turning chain. The turning chain counts as the first stitch of your next row."
    },
    {
      "title": "Crochet the second row.",
      "content": "Crochet the second row. With your turning chain in place, you can begin the second row. Flip your work over so that the back side of the fabric is facing you, and your crochet hook is at the right. The last stitch of row 1 now becomes the first stitch of row 2. Skip the first stitch below your turning chain. Insert your hook into the second stitch of row 1, and make a double crochet in that stitch. Continue all the way to the end of the row."
    },
    {
      "title": "Continue crocheting until you have made the desired number of rows.",
      "content": "Continue crocheting until you have made the desired number of rows. The exact number of rows will depend on how tightly you crochet, but here are some guidelines: For a 36\" x 36\" blanket, make 48 rows For a 36\" x 54\" blanket, make 72 rows For a 40\" x 60\" blanket, 80 rows"
    },
    {
      "title": "Check your work as you go.",
      "content": "Check your work as you go. It's a good idea to stop and check your work every so often. Count to make sure you are making the same number of stitches in each row. Check for mistakes. Measure your work with a measuring tape to see how close you are getting to your goal. If you notice a mistake, here's what you can do: Slip your hook out of the yarn loop and pull gently on the end of the yarn. Your work should start to unravel. Keep gently unraveling the yarn until you get to the point of your mistake. Unravel back to one stitch prior to your mistake. Insert your hook into the loop for that stitch, and begin crocheting from that point."
    },
    {
      "title": "Finish the blanket.",
      "content": "Finish the blanket. When your blanket is as long as you want it to be, work all the way to the end of your last row. Then, you can add a border, end off your yarn, and weave in the ends. To make a simple border, flip your fabric over so the right side is facing you, then turn your the fabric 90̊. Ch 1 and insert your hook into the corner of your fabric. Make 3 sc into the corner. Sc all along the edge of your fabric until you reach the next corner, make 3 sc in the corner and continue around in this fashion until you reach your starting point. You can add another row of border in the same manner if you wish. To end off, ch 1 and make a big loop with the yarn. Slip the hook out of the loop and cut your yarn, leaving a long tail. Pull the end of the yarn through the loop and tighten to make a knot. To weave in the ends of the yarn, hold your fabric with the back side facing you. Thread the end of the yarn through a tapestry needle. Insert the needle through the bottom of several stitches (about two inches). Skip the last half of the last stitch, then weave the needle back through the same stitches for about an inch. Pull the yarn through, and clip the end of the yarn close to the fabric."
    },
    {
      "title": "Understand the design and technique.",
      "content": "Understand the design and technique. A granny square is made up of clusters of double crochet stitches and chain stitches. [10] X Research source It is crocheted in rounds rather than rows. Blankets and many other items can be made up of small granny squares stitched together. However, it's very easy to make a blanket that is essentially one big granny square."
    },
    {
      "title": "Make a starting ring.",
      "content": "Make a starting ring. A granny square starts with a ring of chain stitches joined with a slip stitch. Using worsted weight yarn and an H hook, ch 6. To make a slip stitch, insert your hook into the first chain, yarn over and draw the yarn through. You now have two loops on your hook. Draw the first loop (the loop you just made) through the second loop. You now have a ring of stitches."
    },
    {
      "title": "Make the foundation round.",
      "content": "Make the foundation round. To crochet the foundation round of a granny square, you are going to put your stitches into the center of the ring instead into the chain. Ch 3. (This ch 3 is like a turning chain, and counts as the first stitch in the row.) Then, yo and insert your hook into the center of the ring. Make 2 dc. Ch 2. Make 3 dc in the ring and ch 2. Repeat two more times. Insert your hook into the 3rd chain of your turning chain, and join together with a slip stitch to make a ring. Look at your ring and you will see the that the groups of 3 dcs make the sides of your granny square, and the ch 2s are the corners."
    },
    {
      "title": "Make the second round.",
      "content": "Make the second round. The second round builds and expands on your foundation round. Slip stitch across the top of the first three stitches until you reach your first corner. Working your stitches into the corner, ch 3. Then 2 dc, ch 2, 3 dc. You're now at one of the sides of the granny square. Ch 2 to \"bridge\" over those stitches. In the next corner, work (3 dc, ch 2, 3 dc). Ch 2 again, and continue around until you reach your starting point. Join with a slip stitch in the top of your turning chain."
    },
    {
      "title": "Make the third round.",
      "content": "Make the third round. The third round expands the granny square even further. Slip stitch across the top of the first three stitches until you reach the first corner. Working your stitches into the corner, ch 3. Then 2 dc, ch 2, 3 dc. Skip over the next 3 dc. Now you're at the ch 2 you made in the previous round. Work 3 dc into that space. In the next corner, make 3 dc, ch 2, 3 dc. At the next ch 2 space, make 3 dc. Continue around until you reach your starting point. Join with a slip stitch in the top of your turning chain."
    },
    {
      "title": "Keep making rounds.",
      "content": "Keep making rounds. Repeat the third round over and over again until your blanket reaches the size you like."
    },
    {
      "title": "Finish your blanket.",
      "content": "Finish your blanket. To finish, you can add a simple border, end off and weave in the ends. To make a simple border, ch 1 and insert your hook into the corner of your fabric. Make 3 sc into the corner. Sc all along the edge of your fabric until you reach the next corner, make 3 sc in the corner and continue around in this fashion until you reach your starting point. You can add another row of border in the same manner if you wish. To end off, ch 1 and make a big loop with the yarn. Slip the hook out of the loop and cut your yarn, leaving a long tail. Pull the end of the yarn through the loop and tighten to make a knot. To weave in the ends of the yarn, hold your fabric with the back side facing you. Thread the end of the yarn through a tapestry needle. Insert the needle through the bottom of several stitches (about two inches). Skip the last half of the last stitch, then weave the needle back through the same stitches for about an inch. Pull the yarn through, and clip the end of the yarn close to the fabric."
    },
    {
      "title": "Decorate your blanket with some fun embellishments.",
      "content": "Decorate your blanket with some fun embellishments. Instructions for making a simple border are in each of the methods above, but this section addresses a few more interesting ways add the finishing touch to your blanket."
    },
    {
      "title": "Add fringe.",
      "content": "Add fringe. Fringe is one of the easiest ways to decorate a blanket. Here are instructions for simple fringe. Decide how long you want your fringe, then find a piece of cardboard or something else (a CD case, a book) that is the same size. (E.g., if you want a 3\" fringe, find something that is 3\" wide.) Wrap your yarn several times around the cardboard. With a pair of scissors, cut the yarn in half. You now have several pieces of yarn that are double the desired length of your fringe. Take a crochet hook and insert it into the top of a stitch at the end of your finished blanket. Take two pieces of fringe yarn, hold them together and fold them in half so there is a loop at the top. Insert the crochet hook through the yarn loop and pull the loop through the fabric of your blanket. Remove the hook and pass the ends of the yarn through the loop to make a knot. Tighten gently. Skip two stitches and add another fringe. Continue to the end of your blanket, then add fringe to the other end."
    },
    {
      "title": "Make a border with two colors.",
      "content": "Make a border with two colors. A simple single crochet border is more interesting with two colors. Here's how to do it. Follow the instructions above to make a simple single crochet border all around your blanket. In the last stitch, you will switch colors. To switch colors , work the last single crochet with Color A until you have two loops remaining on the hook. Drop Color A, and pick up Color B. Yarn over with Color B, and pull the hook through the remaining two loops to finish the stitch. Leaving a long tail, clip Color A. Continue sc around the blanket with Color B until you reach the end of the round. Slip stitch into the first stitch, end off and weave in all ends."
    },
    {
      "title": "Add a shell border.",
      "content": "Add a shell border. A shell border is a classic and fun way to finish a baby blanket. To make a shell border, follow these directions. Single crochet all around the edges of your blanket, making 3 sc in the corners. Slip stitch into the first stitch. Skip a stitch, then make 5 dc in the next stitch, then slip stitch into the next stitch. Follow this pattern to the end of the row. When you get to the corner, ch 1, make a slip stitch in the first stitch on the other side, and continue the pattern. Continue around the blanket until you reach your starting point. Slip stitch into your first stitch, end off, and weave in the ends."
    }
  ]
}