{
  "url": "https://www.wikihow.com/Remove-Tempered-Glass",
  "title": "How to Remove Tempered Glass",
  "steps": [
    {
      "title": "Heat the glass with a hair dryer on a low setting for 15 seconds.",
      "content": "Heat the glass with a hair dryer on a low setting for 15 seconds. The heat loosens the adhesive behind the glass, making it easier to remove. However, tempered glass should be heated briefly and only with low heat to avoid damaging any components behind it. Get the glass nice and toasty but not hot to the touch. [1] X Research source If a hair dryer isn’t available, you can try another heat source. Leaving it near a hot stove, open flame, furnace, or in a steamy bathroom may encourage the adhesive to melt."
    },
    {
      "title": "Lift 1 corner of the glass with your fingernails.",
      "content": "Lift 1 corner of the glass with your fingernails. Dig down with your fingernails until you find the bottom of the tempered glass. You should be able to barely get 1 corner away from the surface underneath it. Avoid rushing, however. Lift the corner carefully, but don’t attempt to peel off the rest of the glass. Try all the corners. You can usually find 1 that lifts away from what is underneath it. If none of them come up, heat the glass a second time to loosen the glue. If the glass is cracked near 1 of the corners, choose a different corner to prevent if from breaking into many smaller pieces."
    },
    {
      "title": "Move your fingers underneath the glass.",
      "content": "Move your fingers underneath the glass. As you peel it off, the thin layer of tempered glass will separate from the surface underneath it. The edges of the glass will begin coming up first. Slide your hand underneath these edges to support the glass, preventing it from fragmenting. Do this even if you are removed a small piece of cracked glass to prevent it from breaking further. [2] X Research source Tempered glass is very thin, so it is prone to breaking. Broken glass leaves a lot of individual fragments you have to peel away by hand. The only way to prevent this is to be very cautious."
    },
    {
      "title": "Peel the tempered glass back slowly and evenly.",
      "content": "Peel the tempered glass back slowly and evenly. Peel the glass off in as much of an even layer as possible. Slide your hands along the glass’ loose edges to avoid lifting up 1 side more than another. Continue doing this until the piece of glass is gone, then repeat the process for any remaining pieces. [3] X Research source Any small, splintered pieces of tempered glass can be picked up the same way. Although they can be a little obnoxious, they will be easier to peel back than the main piece."
    },
    {
      "title": "Warm up the glass for 15 seconds with low heat.",
      "content": "Warm up the glass for 15 seconds with low heat. Use a device such as a hair dryer, if you have one. Heat the glass until it feels warm all over but not hot to the touch. This should loosen the glue holding the glass in place. [4] X Research source While you might be able to warm up the glass by holding it close to a match or lighter, you probably won’t be able to get the entire sheet to a consistent temperature and may damage the components beneath it. You can try heating up 1 corner to make it easier to lift."
    },
    {
      "title": "Use the pointed end of a toothpick to pry up 1 corner of the glass.",
      "content": "Use the pointed end of a toothpick to pry up 1 corner of the glass. It’s important to make sure the toothpick is angled correctly so it doesn’t damage whatever is below the tempered glass. Choose 1 corner and hold the toothpick flat beside it. Slide the tip of the toothpick underneath the piece of glass, then pull it up until you are able to slide your fingers underneath it. [5] X Research source Avoid angling a pointy toothpick downwards. If you’re removing tempered glass from a phone, for instance, you will end up scratching the screen beneath it. If you don’t have a toothpick available, you may be able to pry up the glass using another sharp item like a fork or with your fingers."
    },
    {
      "title": "Lift the edges of the glass with your fingers.",
      "content": "Lift the edges of the glass with your fingers. Be very careful, especially if the glass is cracked. Tempered glass is delicate and prone to breaking into bunches of smaller pieces. Slide your finger along the outer edge of the piece of glass you wish to remove. Lift it up enough to fit the edge of a credit card underneath it. [6] X Research source This works for cracked or smaller pieces of glass as well as whole pieces, but avoid pulling the glass up too far in 1 direction. Lift each piece at an even rate to prevent it from turning into a jigsaw of shards."
    },
    {
      "title": "Slide a credit card underneath the glass to peel it off.",
      "content": "Slide a credit card underneath the glass to peel it off. Position the card underneath the glass corner you lifted up. Slowly push the card forward. It should separate the tempered glass from the surface underneath it. Lift the piece of glass up evenly until you are able to remove it, then repeat this with any remaining fragments. [7] X Research source Make sure you use a hard, plastic card, such as a credit card, library card, or ID. You can often use a credit card to remove the entire piece of glass. If the piece of glass is larger than the length of the card, such as on an iPad, use your fingers to help lift the glass at an even rate."
    },
    {
      "title": "Heat the glass for 15 seconds until its adhesive is loosened.",
      "content": "Heat the glass for 15 seconds until its adhesive is loosened. A hair dryer on a low setting or another similar object makes for a good, safe heat source. Get the glass warm but don’t overheat it. It shouldn’t burn your fingers when you touch it. [8] X Research source"
    },
    {
      "title": "Roll a piece of duct tape around 2 of your fingers.",
      "content": "Roll a piece of duct tape around 2 of your fingers. Duct tape seems to have an unlimited number of uses, so it’s hardly surprising you can use it to take off a tough piece of glass. Wrap the tape tightly around your fingers. Make sure the sticky part of the tape faces outwards. [9] X Research source Doing this with your index and middle fingers may be the easiest way, but you can use other fingers if you feel comfortable doing so."
    },
    {
      "title": "Press the tape to a corner of the glass.",
      "content": "Press the tape to a corner of the glass. Choose a corner of the glass to work on. Any corner should do as long as there are no cracks near it. For cracked pieces, select an edge you can reach with the tape. Keep pressing the tape down until the glass sticks to it. If you can’t get a corner to stick, try another corner. Sometimes the corners can be stubborn because the glue underneath them hasn’t loosened enough. If you’re having trouble picking up a corner, heat the glass again. You may wish to choose a corner and focus the heat on it to ensure the adhesive weakens."
    },
    {
      "title": "Roll the tape slowly towards the opposite end of the glass.",
      "content": "Roll the tape slowly towards the opposite end of the glass. Raise your fingers, then move them towards the other end of the glass. The piece of glass should come with you. Be cautious, making sure it separates from the surface underneath it at an even rate. Once you are able to remove the piece of glass, use the tape on any remaining pieces. Sometimes the glass will splinter because 1 side came up faster than another side. This will leave you with some smaller shards you can remove with your fingers or with the tape."
    }
  ]
}