{
  "url": "https://www.wikihow.com/Extend-Rafters",
  "title": "How to Extend Rafters",
  "steps": [
    {
      "title": "Yes, you can nail rafter extensions onto existing rafters.",
      "content": "Yes, you can nail rafter extensions onto existing rafters. Rafter extensions are pieces of lumber that you can install onto the rafters of your roof. They’ll extend the total length of your rafters and allow you to support the weight of a small overhang. [1] X Research source"
    },
    {
      "title": "Remove any fascia or trim that’s covering the rafters.",
      "content": "Remove any fascia or trim that’s covering the rafters. Your roof is covered by external trim and insulation. You’ll need to remove all of the material so you can access the rafters to install your extensions. You should be able to see into your roof from the outside. [2] X Research source"
    },
    {
      "title": "Choose the largest lumber you can fit into your roof.",
      "content": "Choose the largest lumber you can fit into your roof. The amount of space between the roof sheathing and the external plate can vary based on how your home was constructed. So choose the largest-sized lumber you can fit between the space to use as rafter extensions. [3] X Research source"
    },
    {
      "title": "Nail lumber to the rafters so twice the overhang length is in the roof.",
      "content": "Nail lumber to the rafters so twice the overhang length is in the roof. Measure the length you want for your overhang and then double it to find the length of the lumber that you’ll connect to the rafters inside your roof. Cut your lumber to fit your measurements. Then, nail the lumber to your existing rafters so the overhang matches your measurements. [4] X Research source It’s important that your rafter extensions are a ratio of ⅓ external extension, and ⅔ internally connected to your existing rafters."
    },
    {
      "title": "Yes, you can splice rafters together with a fishplate.",
      "content": "Yes, you can splice rafters together with a fishplate. A fishplate is a flat piece of metal that is used to connect materials such as rails on a railroad. They can also be used to join rafters. Use a fishplate that’s at least .75 in (19 mm) thick and connect it to the 2 rafters with 6 large nails on each side of the plate. [5] X Research source"
    },
    {
      "title": "Limit your overhang to no more than 2 feet (0.61 m) without support.",
      "content": "Limit your overhang to no more than 2 feet (0.61 m) without support. Anything past this length can put too much strain on your rafter extensions, especially if you have an overhang installed on them. Keep your extensions below this length if you don’t have additional support to avoid potentially damaging your roof if the overhang collapses under the strain. [6] X Research source"
    },
    {
      "title": "It costs between $50-$85 USD per foot (.6048 m).",
      "content": "It costs between $50-$85 USD per foot (.6048 m). The materials alone cost about $11.50 per foot (.6048 m). If you plan to do the job yourself, you can save on the labor costs that would be included if you have your roof extended by a professional. But a good contractor will also make sure your roof is up to the standards of any local building codes. [7] X Research source"
    }
  ]
}