{
  "url": "https://www.wikihow.com/Clean-a-CD-Player",
  "title": "How to Clean a CD Player",
  "steps": [
    {
      "title": "Confirm there is no CD in the player.",
      "content": "Confirm there is no CD in the player. If the CD drive is tray-loaded, open the tray and disconnect the power cable without switching it off from the power button. This will leave the tray open, allowing you access to the slot."
    },
    {
      "title": "Blow away dust with a handheld air bulb.",
      "content": "Blow away dust with a handheld air bulb. These rubber bulbs are sold as dust blowers in places that stock cameras or jeweler's equipment. Squeeze the bulb to gently blow dust out of the slot and/or tray. A can of compressed air is a risky alternative. Use brief blasts only to avoid excessive force, and check that the spray is completely dry first. Some brands spray a little liquid along with the air, which can destroy your drive. [2] X Research source"
    },
    {
      "title": "Remove the lens cover.",
      "content": "Remove the lens cover. Assuming the dust blower didn't fix the problem, it's time to access the lens. Unless you have a snap-open portable player, you'll need to unscrew the device's outer case first. Once you have access to the tray that holds the CD, look for small catches or screws holding down the plastic cover over the lens assembly. Remove the screws or press on the catches carefully with a small screwdriver. You should see a small, circular lens to one side of the spindle, similar in size to the camera lens on a phone. [3] X Research source This will likely void your warranty."
    },
    {
      "title": "Select a lint-free cleaner.",
      "content": "Select a lint-free cleaner. A clean microfiber cloth is the ideal choice. You can find these at stores that sell electronics or eyeglasses. Special swabs for cleaning electronics will also work. [4] X Research source Use cotton swabs only as a last resort. While they often work fine, there is a risk of scratching the lens."
    },
    {
      "title": "Wipe a small amount of high-strength isopropyl alcohol onto the lens.",
      "content": "Wipe a small amount of high-strength isopropyl alcohol onto the lens. Use isopropyl alcohol with at least 91% concentration (and ideally \"reagent grade\" 99.9%). More diluted alcohol can leave a haze on the lens. Dampen the cloth slightly, without soaking it. Rub the cloth gently over the lens. Keep wiping until the center of the lens is shiny and has a blue tinge. [5] X Research source A little haze around the perimeter is usually not a problem. [6] X Research source You can use a lens cleaning solution instead of alcohol. In rare cases, you'll need deionized water to remove sugar-based residue. [7] X Research source Deep scratches on the lens could make it unusable. If the scratches are barely visible, they are unlikely to be a problem."
    },
    {
      "title": "Let dry before replacing the cover.",
      "content": "Let dry before replacing the cover. Wait a few minutes to avoid trapping any liquid alcohol inside the mechanism. While waiting, you can use the air bulb again to blow out any dust from the interior mechanism. Avoid over-tightening the screws, which can crack the plastic case."
    },
    {
      "title": "Try a lens cleaner disc.",
      "content": "Try a lens cleaner disc. These discs brush the CD drive lightly, removing dust. In most cases, a cleaner disc is less effective than the methods above, and a low-quality disc could even cause more damage. [8] X Research source Try it if nothing else works, or skip to the next step if you're willing to try more complex repairs. Cleaner discs usually run automatically when you insert them, but check the product instructions first. Do not use a CD cleaner disc on a combination CD/DVD player. Cleaner discs made for CD players will scratch a DVD drive. [9] X Research source Check the product label for warnings before buying. Some discs are not compatible with some devices."
    },
    {
      "title": "Consider more involved repairs.",
      "content": "Consider more involved repairs. If your CD player still won't work, you can try to disassemble it even more and examine other parts. This is fairly difficult, and may require the manual for your device. If you are patient and mechanically minded, try the following: [10] X Research source Slowly turn the drive upside down while watching the lens. The lens should move up and down smoothly, without sticking or tilting. If it doesn't behave correctly, you may need to replace the whole pickup unit (or just get a new CD player). Carefully remove components around the lens if possible. If you can access the turning mirror (a small piece of glass), clean it the same way you cleaned the lens. Look for a plastic cogwheel attached to the laser mechanism. Turn this slowly with a swab and watch for moving parts. If any of them seem dirty or sticky, clean them with alcohol, then apply a thin layer of light lubricant suitable for electronics."
    },
    {
      "title": "Update your drive firmware.",
      "content": "Update your drive firmware. You may need to update your firmware to fix a bug, or to allow your computer to play new types of discs. If you know your drive's manufacturer, visit its website and download the latest update. If you don't know the manufacturer, find it using one of these methods: Look for a name printed on the front of your drive. [11] X Research source Look for a numerical code on the drive, then search for it at the FCC database . Open Device Manager and double click the entries underneath \"DVD/CD-ROM Drives.\" [12] X Research source"
    },
    {
      "title": "Use the built-in troubleshooter.",
      "content": "Use the built-in troubleshooter. On Windows 7 and later, you can have your computer attempt to fix problems automatically: [13] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Open Control Panel. Type \"troubleshooting\" in the search bar in the Control Panel. Click \"Troubleshooting\" when it appears in the results. Look under \"Hardware and Sound\" and click \"Configure a device.\" Select your CD drive and follow the onscreen instructions."
    },
    {
      "title": "Reinstall the drive.",
      "content": "Reinstall the drive. Open Device Manager and look at the entries under \"DVD/CD-ROM Drives.\" Right-click those device names and select \"Uninstall.\" [14] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Reboot the computer to reinstall them. This is most likely to work if the name has an X or exclamation mark next to it. [15] X Research source If there are no drives listed, the drive's cables are disconnected or the drive is broken and needs replacement."
    }
  ]
}