{
  "url": "https://www.wikihow.com/Handle-Your-Dog%27s-Remains",
  "title": "How to Handle Your Dog's Remains",
  "steps": [
    {
      "title": "Bury your pet.",
      "content": "Bury your pet. You may decide you want to bury your pet in your yard or on your land. This is a way to deal with your dog's remains while giving you a place to visit and remember them. The burial process can also help you to grieve and let go. [1] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Find out what the laws are about burying your pets on your property. Some areas don't allow it, such as in populated cities. Never bury a pet on public lands, like in a park. This is generally illegal."
    },
    {
      "title": "Choose an appropriate place for the burial.",
      "content": "Choose an appropriate place for the burial. If you want to bury your dog on your land, you should choose a good place to bury them. You want to make sure it is a place that won't be dug up by other pets since this can cause a health hazard. If you want to place them in a pet cemetery, you should buy a burial plot from the cemetery. For example, if you want to be able to walk to the spot but not see it every day, consider placing it somewhere you won't be able to see as you walk to your car or from windows. If you would like to see it often, choose a place you can see easily every day. If your pet had a favorite spot in your yard or on the property, you can choose to bury them there. If you rent your home, you may not want to bury your dog there in case you move."
    },
    {
      "title": "Dig the grave.",
      "content": "Dig the grave. If you have not cremated your dog, you should place a plastic bag or tarp around their body. Measure them so that you can dig a grave that is large enough. If you cremated them, you can simply bury the urn. Dig a grave that is at least 3–4 feet (0.91–1.22 m) deep. [2] X Research source Wait at least a few hours after death before you bury them."
    },
    {
      "title": "Place a marker for the grave.",
      "content": "Place a marker for the grave. After you bury your dog, you may want to place a marker of some sort on top of the grave. This may be a homemade marker, a statue, or even a tree or shrub. Some companies offer headstones for pet graves that you can purchase."
    },
    {
      "title": "Find a pet cemetery.",
      "content": "Find a pet cemetery. If you want to bury your pet but do not have anywhere to bury it, you can try to find a pet cemetery or pet memorial park. These are areas designated specifically for pet burials. You can purchase a plot so you can bury and memorialize your pet. [3] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Ask your vet if they know of any pet cemeteries or memorial parks in your area. You may also want to contact the local humane society or animal control for information of finding one of these places in your area. Most plots cost around $100 for small dogs. You will also need to provide a casket for the dog."
    },
    {
      "title": "Consider pet cremation.",
      "content": "Consider pet cremation. You may choose to have your pet cremated after they have died. There are pet cremation services who can do this for you. When you cremate your pet, you do not have to deal with burying your pet. [4] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Pet cremation may be a good choice if you want to keep the ashes. Pet cremation is also way a to deal with your pet's remains when you cannot bury your pet anywhere."
    },
    {
      "title": "Find a pet crematory.",
      "content": "Find a pet crematory. Pet crematories are available in many cities. Often, the pet crematory will come get the remains of your pet from your home or the veterinarian's office. Many vet offices provide cremation services if the pet died there was euthanized in the office. However, this may come at an additional expense. Search online for a pet crematory service in your area, ask your vet, or contact the local humane society."
    },
    {
      "title": "Choose the type of cremation.",
      "content": "Choose the type of cremation. There are different types of dog cremations. The types include private, semi-private, and communal. The choice depends on whether you want to keep your dog's ashes in an urn and the price you want to pay. [5] X Research source A private cremation means your dog is in a chamber alone. If you want to keep your dog's ashes in an urn, this may be the choice for you. However, this process is the most expensive and can reach up to $400. A semi-private cremation places multiple dogs in the same chamber in different partitions. During this process, the ashes can end up mixing together slightly. Some places advertise this as private cremation, so you may want to discuss what private means when talking to the crematory. The price for this process can reach up to $250. A communal cremation is when they place multiple pets into the same chamber so all of the ashes are combined. You will not receive an urn after this process. This is the cheapest option."
    },
    {
      "title": "Decide what to do with the ashes.",
      "content": "Decide what to do with the ashes. After your dog has been cremated, you have multiple options for what to do with the ashes. You can bury the ashes in your yard. You may decide to spread the ashes somewhere, like in your yard, in the woods, or in water. You can also keep the ashes in your home in a decorative urn. You can find pet urns online and in pet magazines."
    },
    {
      "title": "Find out if the vet will dispose of remains.",
      "content": "Find out if the vet will dispose of remains. If you are unable to dispose of the remains or care more about your pet's spirit than the actual physical remains, you may want to find someone else to deal with the remains. Your vet may offer to handle the remains if the dog dies in the office. [6] X Research source Some vets may charge a small fee if the dog didn't die at their office. This will cover the cost of cremation. Some vets do not charge this fee, however."
    },
    {
      "title": "Get the humane society to help with your dog's remains.",
      "content": "Get the humane society to help with your dog's remains. Your local humane society may take the remains of dead pets. They may come to pick up the remains, or you may have to carry them at the office. This is often offered free of charge. Some humane societies have “drop off” bins for your pet, but many people find these bins to be too impersonal and choose to take them during house so they can hand them off to a person."
    },
    {
      "title": "Contact animal control for help with the remains.",
      "content": "Contact animal control for help with the remains. If your pet has died, you may not have anywhere to bury them, and you may not wish to have them cremated. If this is the case, contact animal control or your local government to ask if someone, like the sanitation department, can pick up the remains. [7] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Never toss your dog's remains on the side of the road, in a dumpster, or in the woods. Always find a way to dispose of them properly. If you are unsure how, contact your local government for help."
    },
    {
      "title": "Decide ahead of time how to handle the remains.",
      "content": "Decide ahead of time how to handle the remains. You never want to think about your beloved dog dying, but deciding what you want to do when the inevitable happens can save you some hardship when it happens. When your dog dies, you may not be prepared to think about what you want to do with their remains. Figuring it out ahead of time can help reduce stress at a difficult time for you. If you've never thought about what to do with your pet's body, you may want to talk with your family about the best way to deal with the remains. For example, if the dog has to be euthanized at the vet, you should think about what you will tell the vet when they ask you what you want to do with your dog's remains."
    },
    {
      "title": "Determine your feelings on the remembrance of your pet.",
      "content": "Determine your feelings on the remembrance of your pet. Part of the decision of what to do with your dog's remains is based on how you want to deal with the death, loss, and memory of your dog. This is different for everyone. You have to decide how you feel most comfortable dealing with your pet's death and memory. For example, if you want a spot to go visit to think about your pet, you may want to bury them in your yard or in a pet cemetery. If you want to preserve the ashes in your home or spread them somewhere, you may want to consider cremation."
    },
    {
      "title": "Talk about what to do with your dog's remains with your family.",
      "content": "Talk about what to do with your dog's remains with your family. Because your pet may not belong only to you but the whole family, make the decision together. This can make sure that all of the needs and beliefs of your family are met during this difficult time. For example, if you don't have strong feelings about your pet's physical remains but your family member wants to honor them, you may choose to bury the dog and have a small memorial service to help your family member cope."
    }
  ]
}