{
  "url": "https://www.wikihow.com/Calculate-Future-Value",
  "title": "How to Calculate the Future Value of an Investment",
  "steps": [
    {
      "title": "Understand how the value of money fluctuates over time.",
      "content": "Understand how the value of money fluctuates over time. The value of $100 is different today than it was five years ago or will be five years from now. When you invest money or deposit it into an interest-bearing account, the value will increase or decrease depending on the rate of return. In addition, inflation affects the value of money. Even though $100 may be enough to purchase an item today, it may not be enough to purchase that same item in the future. [1] X Research source Interest rates cause the value of money in investments or interest-bearing accounts to increase. Inflation causes the value of money to decrease by losing purchasing power."
    },
    {
      "title": "Learn about interest rates.",
      "content": "Learn about interest rates. The interest rate is the cost of borrowing money. It is expressed as an annual percentage of the total amount borrowed. You pay interest on loans and credit cards. But banks, governments and other large companies also need to borrow money. When you invest or make a deposit into an interest-bearing account, you are essentially lending money to that institution. So they pay interest to you. [2] X Research source The rate of return on an investment or deposit account is the amount of interest you are paid divided by the amount of dollars in the account or investment. It is the gain or loss of money over a specific period of time. It is expressed as an annual percentage of the original amount. [3] X Research source"
    },
    {
      "title": "Evaluate the worth of an amount of money today after a given period of time.",
      "content": "Evaluate the worth of an amount of money today after a given period of time. The change in the value of money over time is calculated using information about interest rates and inflation. If you want to evaluate the future value of an investment, you multiply the principal by the given interest rate. If you want to estimate your purchasing power over time, you consider how interest rates are increasing the value of money and how inflation is decreasing it. [4] X Research source The nominal interest rate is the stated interest rate on a loan or rate of return on an investment. The real interest rate is the nominal interest rate minus the rate of inflation. So if you have an investment with annual rate of return of 10 percent, and the rate of inflation is 4 percent, then your real rate of return is 6 percent. [5] X Research source Understand the difference between simple and compound interest. Simple interest is the principal amount multiplied by the interest rate and the number of accounting periods in a loan or investment. Compound interest is calculated in the principal amount plus any accrued interest from previous periods. [6] X Research source Compound interest accrues, or increases, much more quickly than simple interest."
    },
    {
      "title": "Learn the formula for calculating future value with simple interest.",
      "content": "Learn the formula for calculating future value with simple interest. Simple interest is the easiest type of interest to calculate. It is the product of the principal times the interest rate times time. The formula for the future value of money using simple interest is FV = P(1 + rt). [7] X Research source In this formula, FV = the future value, P = the principal amount, r = rate of interest per year (expressed as a decimal) and t = the number of years."
    },
    {
      "title": "Determine how much you need today to achieve a specific financial goal.",
      "content": "Determine how much you need today to achieve a specific financial goal. Suppose you know that you need $20,000 in 18 years to pay for college for your daughter. In this example, you know the future value, $20,000, and you need to solve for P, the principal. If an investment pays 8 percent simple interest per year, determine how much money you need to deposit now to have $20,000 in 18 years. In this example, you know the future value, and you need to solve for P, which is the principal amount. Therefore, FV = $20,000; r = .08 (8 percent interest expressed as a decimal); and t = 18. 20,000 = P(1 + .08*18) 20,000 = P x 2.44 20,000 / 2.44 = P P = $8,196.72 Therefore, you would need to deposit $8,196.72 in the account today in order to have $20,000 in 18 years."
    },
    {
      "title": "Calculate how much your investment will grow.",
      "content": "Calculate how much your investment will grow. If you have a nest egg you plan to invest, then you might want to determine how much it will grow over a specific period of time. For example, you might have $5,000 to invest. If the simple interest is 8 percent and you plan to withdraw the funds in 10 years, you could use the formula to determine the future value, with P = 5,000, r = .08, and t = 10. FV = 5,000(1 +.08*10) FV = 5,000 x1.8 FV = 9,000 In 10 years, you would have $9,000."
    },
    {
      "title": "Learn the formula for calculating future value with compound interest.",
      "content": "Learn the formula for calculating future value with compound interest. The formula for this calculation is more complex. With compound interest, the accumulated interest is added back to the principal each payment period. Then interest for the current year is calculated on the principal plus the accumulated interest. Since the interest grows exponentially, you must use an exponential formula to calculate the future value. [8] X Research source The formula for future value with compound interest is FV = P(1 + r/n)^nt. FV = the future value; P = the principal; r = the annual interest rate expressed as a decimal; n = the number of times interest is paid each year; and t = time in years. Interest can be compounded annually, semiannually, quarterly, monthly or daily. This determines the number of compounding periods in the year."
    },
    {
      "title": "Calculate the future value of money using the formula.",
      "content": "Calculate the future value of money using the formula. Suppose you invested $5,000 in an account that paid 5 percent interest compounded annually for eight years. In this example, since the interest is compounded annually, there is one compounding period. In the equation, P = $5,000; r = .05 (5 percent expressed as a decimal); n = 1; t = 8. FV = 5000(1 + .05/1)^(1*8) = 5000(1.05)^8 = 5000 x 1.48 = 7387.28 At the end of eight years, the investment would be worth $7,387.28."
    },
    {
      "title": "Calculate the future value of the same investment if the interest rate were calculated quarterly.",
      "content": "Calculate the future value of the same investment if the interest rate were calculated quarterly. The annual interest rate and the compounding periods are adjusted for the number of times interest is paid within the year period. In this example, the principal is $5,000, the interest rate is .05 (5 percent expressed as a decimal) and the time is eight years. But the number of compounding periods is four since there are four quarters in a year. FV = 5000(1 + .05/4)^(4*8) = 5000 (1.0125)^32 = 5000 x 1.49 = 7440.65 The future value of the investment would be $7,440.65."
    }
  ]
}