{
  "url": "https://www.wikihow.com/Keep-Pets-Warm-During-a-Power-Outage",
  "title": "How to Keep Pets Warm During a Power Outage",
  "steps": [
    {
      "title": "Lots of bedding keeps indoor pets warm while the power’s out.",
      "content": "Lots of bedding keeps indoor pets warm while the power’s out. Drape plenty of blankets and bedding around your pet’s bed. If you have a smaller, caged pet, like a guinea pig, rabbit, hamster, or gerbil, surround their cage with an extra blanket. [1] X Research source When you insulate your pet’s cage, leave enough space for ventilation. Keep a close eye on your small pets during a power outage. When they get really cold, your pet may start shivering. [2] X Research source"
    },
    {
      "title": "Your pets can get extra cold after being outside in the snow or rain.",
      "content": "Your pets can get extra cold after being outside in the snow or rain. Once they’re inside, dry them off completely with a towel, so they can start to warm up. [3] X Research source Aside from walks and exercise, keep your pets indoors as much as possible during the colder months. [4] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Body heat is a great way to stay warm.",
      "content": "Body heat is a great way to stay warm. When you head to bed, invite your dog or cat to curl up with you. The shared body heat will keep you and your furry friends toasty throughout the night. [5] X Research source Dogs can stay comfortable as long as your home is at least 45 °F (7 °C). If the temperature really starts dropping, your pooch may start shivering or whining. Cats are pretty resilient in cold weather, but they don’t do well in temperatures below 32 °F (0 °C)."
    },
    {
      "title": "You just need an old hoodie or sweater and some scissors.",
      "content": "You just need an old hoodie or sweater and some scissors. Find an old sweater and cut the sleeves off. Then, put your dog’s head through the neck opening (if it’s too tight, you can cut the opening so it’s bigger) and slide their legs through the sleeve holes. Now your dog has a cozy sweater to keep them warm. [6] X Research source This DIY sweater works best for big dogs, but you can still make an easy no-sew sweater if you have a small dog. Just cut one of the sleeves off of an old sweater or hoodie and cut off the wrist-end so the sleeve is the same length as your dog. Then, cut out two half circles, one on each side of the sleeve, to make the holes for your dog’s front legs. Slide the sweater over your dog so their head goes through the narrow end and their front legs go through the small holes. [7] X Research source"
    },
    {
      "title": "Opened curtains and covers create warm, sunny spots in your home.",
      "content": "Opened curtains and covers create warm, sunny spots in your home. During the day, your pets can curl up and stay warm on these sunny patches. [8] X Research source"
    },
    {
      "title": "An extra blanket helps warm your bird during a power outage.",
      "content": "An extra blanket helps warm your bird during a power outage. Surround the cage with a towel or blanket, which will help preserve some warmth. Wrap warm water bottles with towels and place them under your bird’s cage to provide a little extra heat. You can also fill and tie off rubber gloves with warm water if you don’t have any spare bottles. Birds can survive in temperatures between 50 to 59 °F (10 to 15 °C), but they won’t do well below that. If your bird fluffs up its feathers and doesn’t eat, there’s a good chance that it’s cold. [9] X Research source Move your bird’s cage away from any windows in case any drafts blow in. [10] X Research source As an extra precaution, keep your bird cage away from candles, or fireplaces—these can give off smoke, fumes, and vapors that are unpleasant for your bird. When the power comes back on, keep your bird away from any space heaters, as these also create fumes."
    },
    {
      "title": "Place portable hot packs beneath your pet’s habitats.",
      "content": "Place portable hot packs beneath your pet’s habitats. Pick up hot packs from your local pharmacy or big-name retail store. Don’t stick these directly in the terrarium; instead, place them under the habitat so your pet stays warm. [11] X Research source You don’t want your pet to chew or eat the hot packs by mistake. Most reptiles need an environment that’s somewhere between 75 to 85 °F (24 to 29 °C). [12] X Research source"
    },
    {
      "title": "Blankets, sleeping bags, and newspaper can all insulate your fish tank.",
      "content": "Blankets, sleeping bags, and newspaper can all insulate your fish tank. Fish are pretty hardy, and can survive temperature drops below 60 °F (16 °C). However, it’s still a good idea to insulate your fish tank as much as you can. [13] X Research source If the aquarium temperature sinks to around 55 °F (13 °C), pour warm, dechlorinated water into the fish tank. Only change the water temperature by around 10% every 1-2 hours, so you don’t disturb your fish."
    },
    {
      "title": "Propane heaters are a great way to keep your livestock warm.",
      "content": "Propane heaters are a great way to keep your livestock warm. Keep these heaters on hand throughout the year, and set them up in your animals’ barn or living space. [14] X Research source You can buy propane heaters from home improvement or big-name retail stores. These heaters don’t need electricity to run, which makes them super useful during a power outage. Some ranchers feed their livestock more to help them stay warm. [15] X Research source"
    },
    {
      "title": "Bring your pets to a warm, safe place if you have to evacuate.",
      "content": "Bring your pets to a warm, safe place if you have to evacuate. Pet boarding establishments and pet-friendly hotels are great places to keep your pets during an outage. If you’re unable to leave your residence, ask a trusted friend or loved one with power at home to watch your pet for a few days. [16] X Research source"
    }
  ]
}