{
  "url": "https://www.wikihow.com/Fold-a-Suit-for-Travel",
  "title": "How to Fold a Suit for Travel",
  "steps": [
    {
      "title": "Clean and press your suit before you travel.",
      "content": "Clean and press your suit before you travel. While this folding technique will do wonders for preventing wrinkles during the traveling process, it can't do anything for wrinkles or stains that are already there . To ensure your suit jacket is in tip-top shape, send it to the dry cleaner's at least a week before you leave and ensure the cleaner presses the suit in addition to removing any stains. If you're pressed for time, you may want to iron the suit yourself. If you do so, ensure the lapels are well-ironed - it's possible to hide wrinkles elsewhere on the suit, but nearly impossible to hide them on the lapels."
    },
    {
      "title": "Turn the jacket inside out.",
      "content": "Turn the jacket inside out. Turn the fabric of your jacket around so that the lining is on the outside. This protects the actual outer fabric of the jacket - now, if the jacket incurs any wrinkles while traveling, they're likely to be on the inside of the jacket when you wear it."
    },
    {
      "title": "Pop the shoulders inside out.",
      "content": "Pop the shoulders inside out. Next, put your hand inside the coat and push your fist into the shoulders so that the lining of the shoulders \"pops\" out. These inside-out shoulders make the jacket much easier to fold - if you hadn't popped them out, you would have to deal with the awkwardness of inward-facing shoulder pads."
    },
    {
      "title": "Fold the jacket vertically.",
      "content": "Fold the jacket vertically. Gather both shoulders in one hand and use the other to grasp the jacket at the midpoint of its collar. This should have the effect of folding the jacket in half lengthwise. Straighten the material of the jacket out after folding - the liner should still be on the outside."
    },
    {
      "title": "Fold the jacket in half horizontally.",
      "content": "Fold the jacket in half horizontally. Place your forearm horizontally across the middle of the jacket and fold the top of the jacket over. This should create a roughly square \"bundle\" that fits easily in a suitcase."
    },
    {
      "title": "Place the jacket in a plastic bag.",
      "content": "Place the jacket in a plastic bag. To protect your jacket in your luggage, it's a wise idea to place it in a plastic bag separate from other clothing. [1] X Expert Source Caitlin Jaymes Closet Organizer & Fashion Stylist Expert Interview. 16 December 2019. Slide the square, folded \"bundle\" that your jacket is in into a large plastic bag (like a dry cleaning bag or a large ziplock bad). Seal the bag carefully. If you don't have a bag handy, use a sheet of sturdy plastic material. Place the folded jacket in the middle of the sheet and fold the sides in and under the jacket. If you're using a plastic bag, try to trap a little air in the bag with the suit. This protective \"bubble\" can prevent the other clothes in the suitcase from pressing into the jacket, eliminating wrinkles."
    },
    {
      "title": "Lay the wrapped jacket in your suitcase.",
      "content": "Lay the wrapped jacket in your suitcase. Try keep the suit as flat as possible and to avoid compressing it. To minimize wrinkling, place only other flat, folded items of clothing on top of the jacket. Avoid placing hard, awkwardly-shaped items like shoes on top of the jacket."
    },
    {
      "title": "Unfold your jacket at your destination.",
      "content": "Unfold your jacket at your destination. [2] X Expert Source Caitlin Jaymes Closet Organizer & Fashion Stylist Expert Interview. 16 December 2019. When you arrive at your destination, you'll want to essentially do the steps above in reverse. Remove any clothes on top of the jacket, open its bag, undo the horizontal and vertical folds in it, and turn the fabric right-side out. Wrinkling should be minimal - to combat any wrinkles that remain, hang the suit immediately. For persistent wrinkles, try hanging the jacket in the bathroom. When you take a shower, the warmth and steam will loosen the fabric, helping to release any difficult wrinkles."
    },
    {
      "title": "Fold the pants along their pleats.",
      "content": "Fold the pants along their pleats. The simplest option when it comes to folding pants for traveling is to make only vertical, lengthwise folds. This strategy is best for pants with \"pleats\" - vertical folds sewn into the fabric along the waist of the pants. If your pants have pleats, fold vertically along these. This way, even if the fold sets into the pants as a wrinkle, the long, continuous vertical wrinkles will look like the result of ironing. You may also fold the pants in half vertically to further save space."
    },
    {
      "title": "Roll the pants to save space.",
      "content": "Roll the pants to save space. One of the big disadvantages of folding pants only vertically is that many suitcases simply aren't big enough to stretch the entire pant leg out in. If you're pressed for space, try rolling your pants. Fold the pants in half vertically and lay them on a clean, flat surface. Starting at the bottom, roll the pant legs into a tight bundle. This prevents wrinkles by exposing a minimum of the pants' surface area to other items in the suitcase and makes the pants take up relatively little space."
    },
    {
      "title": "Fold horizontally with caution.",
      "content": "Fold horizontally with caution. If you can, you'll want to avoid folding dress pants horizontally, as this can contribute to creases that can't be explained away as the result of ironing. However, if you do fold your pants horizontally (this is usually done after folding the pants once vertically), you can minimize wrinkles by following the same rules as listed above for suit jackets - place only flat, folded items on top of them, place them in a bag if possible, and so on. One great idea for pants folded horizontally is to \"sandwich\" them within the two sides of the folded suit jacket. This provides them the protection of the inside-out jacket fabric as well as the jacket's bag."
    },
    {
      "title": "To begin, button the shirt and lay it face-down on a flat surface.",
      "content": "To begin, button the shirt and lay it face-down on a flat surface. You don't necessarily have to button every button - just enough to keep the front of the shirt closed. Next, lay the shirt face down with its material spread flat and its sleeves stretched out. If you happen to have extra dry cleaning bags, you may want to lay one squarely in the middle of the back of the shirt. This prevents the shirt from pressing against itself while folded, reducing the chance of wrinkles."
    },
    {
      "title": "Fold the edges of the shirt inward.",
      "content": "Fold the edges of the shirt inward. Make two vertical folds along the back of the shirt to bring the edges of the shirt roughly one sleeve-length inward. Straighten the edges of the shirt so that they are uniform and parallel."
    },
    {
      "title": "Fold the sleeves down along the new edges.",
      "content": "Fold the sleeves down along the new edges. Next, take each sleeve and fold it down so that it lines up with the folded edges of the shirt. The edges of the sleeve should be roughly in line with both the new outer edge of the shirt and with the edge of the shirt material that has been folded inward. Make minor adjustments, straightening the fabric as necessary until it lines up perfectly. At this point, a good rule of thumb is that the shirt's shoulders should now be shortened so that only an inch or two of material is left on either side of the collar."
    },
    {
      "title": "Consider packing the shirt as-is.",
      "content": "Consider packing the shirt as-is. Like with dress pants, long, continuous vertical creases look better on dress shirts than horizontal folds do. The former resemble the types of creases that can result from ironing, while the latter generally look like nothing other than what they are. Because of this, if you have room in your suitcase, you may want to place the shirt in now , rather than after the next fold. If you have a bag that's big enough to hold the shirt in its current partly-folded state, use it. If not, you can try bunching up the bottom of the shirt in the bag - since this part of your shirt will be covered by your jacket, it's not as important for it to be 100% wrinkle-free."
    },
    {
      "title": "Fold the shirt horizontally in half.",
      "content": "Fold the shirt horizontally in half. If you don't have enough space to put your shirt in your suitcase halfway-folded or simply aren't worried about wrinkles, continue folding. Grab the bottom edge of the shirt (including the sleeves) and bring it up to the shoulders. Flip the shirt over - it should be a nice, tidy square with the collar and buttons centered in the middle. If you laid a dry cleaning bag in the middle of your shirt at the beginning of this method, it will protect your shirt from pressing against itself at this point. You can also get a similar effect by slipping a flat cardboard insert between the two halves of the folded shirt."
    },
    {
      "title": "Place the shirt in a bag.",
      "content": "Place the shirt in a bag. Place the folded shirt in a dry cleaning bag or a large ziplock bag and seal the bag. As noted above, you may want to trap a small amount of air in the bag along with the shirt to create a protective bubble that can help prevent the other items in the suitcase from pressing on the shirt."
    },
    {
      "title": "Lay the shirt in your suitcase.",
      "content": "Lay the shirt in your suitcase. Ensure the shirt sits face-up in the suitcase and that nothing heavy or hard is packed on top of it. Ideally, the shirt should be surrounded with flat, folded fabric clothing. Upon arrival, unpack your suitcase and inspect your shirt for wrinkles. Hang the shirt immediately or iron. If the shirt has wrinkles, see if where you're staying offers pressing services to help smooth out the fabric again. [3] X Expert Source Caitlin Jaymes Closet Organizer & Fashion Stylist Expert Interview. 16 December 2019."
    }
  ]
}