{
  "url": "https://www.wikihow.com/Bleach-Hair-Without-Damaging-It",
  "title": "How to Safely Bleach Hair at Home",
  "steps": [
    {
      "title": "Apply a deep conditioning mask daily the week before bleaching.",
      "content": "Apply a deep conditioning mask daily the week before bleaching. Bleaching depletes your hair of moisture, so adding extra can help minimize damage. Purchase a deep conditioning mask and coat the entirety of your hair with the treatment. Let it sit for 30 minutes and rinse with cool water to close your hair’s cuticles and make it shiny. [1] X Research source"
    },
    {
      "title": "Test the bleach 48 hours in advance to check for a reaction.",
      "content": "Test the bleach 48 hours in advance to check for a reaction. Mix 1 part bleach powder and 2 parts developer before bleaching your hair. Apply a dab of the bleach on your skin and coat a strand of your hair. Let the bleach sit for 30 minutes, then rinse it off and check your results. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Inspect the bleached strand to get an idea of your hair’s appearance afterward. You can adjust the processing time to get a lighter or darker shade if necessary. If bleach irritates your skin, try shortening the processing time or look for alternatives, like permanent dyes ."
    },
    {
      "title": "Wash your hair 24-48 hours before bleaching to build natural oils.",
      "content": "Wash your hair 24-48 hours before bleaching to build natural oils. Natural oils help protect your scalp from bleach damage. Give your skin time for natural oils to develop by shampooing your hair 24-48 hours before you bleach it. Use a conditioner afterward to moisturize your hair. [3] X Research source"
    },
    {
      "title": "Opt for bleach with nourishing ingredients.",
      "content": "Opt for bleach with nourishing ingredients. When purchasing bleach, opt for high-quality ones that include additives that improve your hair quality while preserving its health. Read the label on your bleach and look for Brazilian Bond Builder , Olaplex , or ceramides . [4] X Research source Avoid bleaches with boosters like ammonium persulfate or potassium persulfate. While they speed up the bleaching process, they can cause more harm. [5] X Research source"
    },
    {
      "title": "Use a 10- or 20-volume developer to minimize damage.",
      "content": "Use a 10- or 20-volume developer to minimize damage. Professional Hair Stylist Brianna Bowling recommends always starting with a 20-volume developer for at-home bleach jobs. [6] X Expert Source Brianna Bowling Hair Stylist Expert Interview. 25 February 2022. Low-volume developers produce weaker bleach, causing less damage. It may take longer to achieve your desired results with a 10- or 20-volume developer , but it'll help minimize the damage. Choose a bleaching kit with a low-volume developer, or purchase your bleach powder and volume developer separately to choose a low-volume developer. [7] X Research source You can find a 10- or 20-volume developer at a beauty supply store or online."
    },
    {
      "title": "Wait 3 weeks in between bleaching sessions for dark hair.",
      "content": "Wait 3 weeks in between bleaching sessions for dark hair. Removing the pigment from dark hair requires multiple bleaching sessions. Give your hair at least 3 weeks to give your hair cuticles enough time to heal, close, and lay flat again. During this time, use a deep conditioner daily to repair your hair. [8] X Research source Repeated bleaching puts your hair at risk of overprocessing and breakage. If you want to speed up the process, seek out the help of a professional hair colorist. Professionals have better bleaching formulas that may cause less damage. Similarly, they can advise you on the best way to get your desired results. [9] X Research source"
    },
    {
      "title": "Use Color Oops and shorten your bleaching time to 30 minutes for dyed hair.",
      "content": "Use Color Oops and shorten your bleaching time to 30 minutes for dyed hair. Unlike natural hair, which can easily be stripped of its color, dyed hair can make it harder for the bleach to lift color. As a result, your hair may look patchy. Use a color stripper, like Color Oops , to remove the dye. Then, go in with the bleach and shorten your processing time to 30 minutes or less to limit the damage. [10] X Research source It’s best to see a professional colorist if you have dyed hair. They can advise you on striping hair dye and cover patches without causing more damage."
    },
    {
      "title": "Protect your skin with an old towel, gloves, and coconut oil.",
      "content": "Protect your skin with an old towel, gloves, and coconut oil. As you apply bleach to your hair, you may drip it onto your clothes and skin. To protect yourself, drape an old towel over your shoulders. [12] X Research source Bleach can irritate your skin and cause chemical burns, so slip on a pair of disposable gloves . Dip a gloved finger in coconut oil to apply along your hairline and ears as a protective barrier. [13] X Research source Use baby oil or argan oil as a substitute. Purchase a hairdresser’s cape if you don’t want to discolor old towels."
    },
    {
      "title": "Add bleach and low-volume developer in a plastic bowl and stir.",
      "content": "Add bleach and low-volume developer in a plastic bowl and stir. Use 1 part bleach and 2 parts low-volume developer to lessen the strength of the bleach. Pour both ingredients into the mixing bowl . You may notice some bubbling as you stir the ingredients with a plastic brush applicator . [14] X Research source 30- or 40-volume developer is recommended for dark brown or black hair. However, it’s best to stick to 20-volume to minimize damage. Opt for blue or purple bleach powder to reduce the risk of brassiness afterward. Always use a plastic bowl when handling bleach because bleach can react with metal."
    },
    {
      "title": "Divide your hair into 4 sections to bleach your entire head evenly.",
      "content": "Divide your hair into 4 sections to bleach your entire head evenly. Split your hair in half vertically, then in half horizontally to create 4 sections. Secure the top sections with plastic clips . Professional Hair Stylist Arthur Sebastian suggests having an adequate separation of each section to coat your hair evenly from tip to root. Apply bleach to one of the bottom sections, working from the ends up to the roots. Repeat the process for each section. [15] X Expert Source Arthur Sebastian Professional Hair Stylist Expert Interview. 29 April 2019. If you have very thick hair, you might create 6 sections to make it easier to apply the bleach evenly. Do your best not to get the bleach on your scalp. The bleach may burn or irritate your scalp if it gets on your skin."
    },
    {
      "title": "Use a highlighting cap to do highlights, optional.",
      "content": "Use a highlighting cap to do highlights , optional. Place a highlighting cap over your hair. Pull your hair through all of the holes or just some of them with a hook or comb, depending on how many highlights you want. Use your applicator brush to cover all of the exposed hair with bleach starting from the tips to the root. [16] X Research source Applying bleach directly on the cap may seep through the holes and onto the rest of your hair, creating splotches."
    },
    {
      "title": "Bleach different sized pieces of hair for a balayage effect, optional.",
      "content": "Bleach different sized pieces of hair for a balayage effect, optional. Clip the top part of your hair and start with the bottom section. Select a thin piece of hair and bring it over your shoulder. Use gloved fingers or an applicator brush to paint the bleach on the tips. Move to the other side of your head, pick up another wispy piece, and repeat. Alternate back and forth to create more natural-looking highlights. It’s okay for the bleached pieces to be different sizes. [17] X Research source Cover the ends with aluminum foil to separate them before proceeding to the top part of your hair. Use the same method of application to complete the look."
    },
    {
      "title": "Cover your hair in plastic wrap for 20 to 45 minutes.",
      "content": "Cover your hair in plastic wrap for 20 to 45 minutes. Bleach starts working immediately, but reaching your desired shade will take some time. Bleach can sit up to 45 minutes before rinsing to avoid overprocessing and breaking your hair. Check the color every 5 to 10 minutes to see how it’s progressing. [18] X Research source Keep in mind bleach will cause less damage if it’s on your hair for the least amount of time. If you’re unhappy with your results after 40 minutes, bleach it again in 3 weeks to avoid damaging your hair. Alternatively, you can speak to a professional colorist for assistance."
    },
    {
      "title": "Rinse your hair with neutralizing shampoo to remove the bleach.",
      "content": "Rinse your hair with neutralizing shampoo to remove the bleach. Rinse out the bleach using cool water. Then, use your fingers to massage a quarter-size amount of mild or neutralizing shampoo to your hair. Use the tips of your fingers to remove any bleach from your scalp. Then, wash it under a stream of warm water. [19] X Research source Make sure you remove all of the bleach from your hair. If necessary, shampoo your hair again to remove all the bleach. Neutralizing shampoo helps balance the pH levels of your hair and scalp after bleaching to ensure your hair remains healthy, shiny, and free of damage. [20] X Research source"
    },
    {
      "title": "Mix a 1:1 ratio of toner and low-volume developer to correct your bleach color.",
      "content": "Mix a 1:1 ratio of toner and low-volume developer to correct your bleach color. If your bleach job has an unwanted yellow or golden tone, use toner to replace warm tones with cool, pure white tones. Combine equal parts toner and low-volume developer in an applicator bottle or mixing bowl. Use an applicator brush and apply it all over the hair. Rub it in and let it sit for 10 minutes. Rinse with water afterward. [21] X Research source"
    },
    {
      "title": "Air dry your hair to avoid additional damage.",
      "content": "Air dry your hair to avoid additional damage. After you bleach your hair, it’s best to avoid heat styling to prevent further damage. Allow your hair to air dry after washing the bleach and apply smoothing cream to minimize frizz. [22] X Research source"
    },
    {
      "title": "Use a deep conditioning mask daily the week after bleaching.",
      "content": "Use a deep conditioning mask daily the week after bleaching. Bleaching your hair removes the moisture, so it’s important to use a deep conditioner to repair it. For best results, coat your hair with a deep conditioning mask, then let it sit for 30 minutes. Rinse with cool water. [23] X Research source Always rinse out conditioner with cool water because it closes your hair shaft, which gives you shinier hair."
    },
    {
      "title": "Apply a bond-repairing treatment weekly to restore your hair.",
      "content": "Apply a bond-repairing treatment weekly to restore your hair. Bond-repairing treatments are designed to repair your hair and leave it shiny. Look for products labeled bond-repairing. Apply a large dollop of the product to your hair, then comb the formula through your strands. Let the treatment set on your hair for at least 30 minutes. Then, shampoo your hair for softer, shinier hair. [24] X Research source It’s best to leave the treatment on for several hours so it has more time to work. For instance, you might leave it on overnight. Just cover your hair with a sleeping cap. Bond-repairing treatments are available over-the-counter and through a salon. While you'll get better results at a salon, home treatments may help you achieve healthier hair."
    },
    {
      "title": "Wash your hair with purple shampoo once a week for blonde hair.",
      "content": "Wash your hair with purple shampoo once a week for blonde hair. It’s normal for blonde hair to get brassy or orange, but purple shampoo can neutralize the discoloration. Pick a purple shampoo designed for your shade of blonde. Use your purple shampoo once a week in place of your regular shampoo and rinse with cool water."
    },
    {
      "title": "Bleach your roots every 4-6 weeks to keep your color consistent.",
      "content": "Bleach your roots every 4-6 weeks to keep your color consistent. It’s best to bleach your roots before they get too long so that you don’t get a noticeable shade difference. If you wait too long, you might need to bleach your entire head of hair to get a consistent blonde. Touch up your hair every 4 weeks if it grows quickly or every 6 weeks if your hair grows slowly. [25] X Research source Try not to let your roots get more than about .75 in (1.9 cm) long."
    },
    {
      "title": "Schedule trims every 4-8 weeks to keep your hair healthy.",
      "content": "Schedule trims every 4-8 weeks to keep your hair healthy. After bleaching your hair, you’ll likely end up with split ends. Leaving your split ends unattended to will cause your hair to continue to break, which means cutting off more inches in the long run. So, stay on top of your hair. Plus, regular trims prompt hair growth which means healthier hair. [26] X Research source"
    }
  ]
}