{
  "url": "https://www.wikihow.com/Defend-Your-House-in-Minecraft",
  "title": "How to Defend Your House in Minecraft",
  "steps": [
    {
      "title": "Light up the place.",
      "content": "Light up the place. Mobs won't spawn when the light level is higher than 7, so place as much light sources as possible in, on, and around your house. You can use torches; Jack o' Lanterns; lanterns; glowstone; and sea lanterns, although they are harder to find."
    },
    {
      "title": "Build a wall or fence around your house.",
      "content": "Build a wall or fence around your house. The wall must be at least three blocks high with one block overhang, a fence must be at least two blocks high with one block overhang. Don't forget to place torches on the wall, so mobs don't spawn on top of it. Cobblestone is the best material for the wall, aside from obsidian, since it has a high blast-resistance."
    },
    {
      "title": "Sleep through the night.",
      "content": "Sleep through the night. The moment you can use a bed, use it. Skipping the night won't give monsters a chance to spawn."
    },
    {
      "title": "Use iron doors, instead of wooden.",
      "content": "Use iron doors, instead of wooden. Though they are a bit more expensive than wooden doors, zombies can't break them, and if you happen to live in a village, villagers won't be able to enter your house either."
    },
    {
      "title": "Dig through the entrance of your house.",
      "content": "Dig through the entrance of your house. Dig a 4 block long, 2 block wide hole starting from your door. The length of the hole depends entirely on how long you want the trap to be. Make the hole 5 blocks deep."
    },
    {
      "title": "Make a base for your sticky pistons.",
      "content": "Make a base for your sticky pistons. In the bottom of your trap hole, make a base for your sticky pistons to rest on. This can be whatever block you want so long as it’s only a block high. Just dig more to the sides if you need some room to work with."
    },
    {
      "title": "Place 8 sticky pistons.",
      "content": "Place 8 sticky pistons. Make the assembly 2 pistons wide and 4 pistons long."
    },
    {
      "title": "Place a redstone repeater behind each of the pistons.",
      "content": "Place a redstone repeater behind each of the pistons."
    },
    {
      "title": "Create a floor for your trap.",
      "content": "Create a floor for your trap. On top of the sticky piston, place whatever block you want as the floor of your trap."
    },
    {
      "title": "Place lava two blocks down from the ground in front of your door.",
      "content": "Place lava two blocks down from the ground in front of your door. How many blocks of lava depend on how long your trap is. The lava block should be 1 block above and 1 block to the left and right of your pistons."
    },
    {
      "title": "Place glass on top of the lava.",
      "content": "Place glass on top of the lava."
    },
    {
      "title": "Place a switch in a convenient place inside of your house, preferably by the door.",
      "content": "Place a switch in a convenient place inside of your house, preferably by the door."
    },
    {
      "title": "Wire the redstone repeaters to the switch with redstone.",
      "content": "Wire the redstone repeaters to the switch with redstone."
    },
    {
      "title": "Cover up the rest of the surface.",
      "content": "Cover up the rest of the surface. Make sure the only hole is the one in front of your door."
    },
    {
      "title": "Attract mobs toward your door at night.",
      "content": "Attract mobs toward your door at night."
    },
    {
      "title": "Enter your house through the front door and wait for the mobs to fall into the hole.",
      "content": "Enter your house through the front door and wait for the mobs to fall into the hole."
    },
    {
      "title": "Release the lava.",
      "content": "Release the lava. When the mobs are all in the hole, flip the switch to release the lava."
    },
    {
      "title": "Watch them burn.",
      "content": "Watch them burn."
    },
    {
      "title": "Flip the switch again to contain the lava and make the hole safe to step on again.",
      "content": "Flip the switch again to contain the lava and make the hole safe to step on again."
    },
    {
      "title": "Dig out a 3x5 hole in the ground.",
      "content": "Dig out a 3x5 hole in the ground."
    },
    {
      "title": "Fill the second-to-bottom layer with TNT.",
      "content": "Fill the second-to-bottom layer with TNT."
    },
    {
      "title": "On the third and second layer, put redstone dust on top of sand.",
      "content": "On the third and second layer, put redstone dust on top of sand."
    },
    {
      "title": "Fill the first layer with sand and then put a pressure plate on the center block.",
      "content": "Fill the first layer with sand and then put a pressure plate on the center block."
    },
    {
      "title": "Repeat.",
      "content": "Repeat. Make more of this around your home."
    },
    {
      "title": "Wait.",
      "content": "Wait. When a mob or player activates the pressure plate the sand will fall, making them fall, and they will be blown up by the TNT."
    },
    {
      "title": "Go along the outside of your base and every 1 block replace the floor with sand and place a cactus.This will hurt Spiders as they try to climb the cacti.",
      "content": "Go along the outside of your base and every 1 block replace the floor with sand and place a cactus.This will hurt Spiders as they try to climb the cacti."
    },
    {
      "title": "Use iron doors.",
      "content": "Use iron doors. Unlike with wooden doors these cannot be broken down by Zombies."
    },
    {
      "title": "Count along 7 blocks and on the first and last place a block with a dispenser ontop of it.",
      "content": "Count along 7 blocks and on the first and last place a block with a dispenser ontop of it. Then fill the dispensers with arrows or fire charges."
    },
    {
      "title": "On the placed blocks put tripwire hooks with string connected.",
      "content": "On the placed blocks put tripwire hooks with string connected."
    },
    {
      "title": "Wait.",
      "content": "Wait. The reason this works so well with Zombies is because they walk slower than the others what causes then to be hit by the arrows more often."
    },
    {
      "title": "In the air or attached to your building, place a piston and activate it with a redstone torch on a block.",
      "content": "In the air or attached to your building, place a piston and activate it with a redstone torch on a block."
    },
    {
      "title": "Have redstone dust going from ontop the block the redstone torch is and then place a lever where you want it.",
      "content": "Have redstone dust going from ontop the block the redstone torch is and then place a lever where you want it."
    },
    {
      "title": "Test.",
      "content": "Test. The way this works is that when you turn on the lever it should turn off the redstone torch and turn off the piston, consequently letting the lava fall."
    },
    {
      "title": "Water moats will cause endermen to teleport away from you.",
      "content": "Water moats will cause endermen to teleport away from you. To make this dig 1 block down around the perimeter of your base and fill it with water."
    },
    {
      "title": "Lava moats damage all mobs.",
      "content": "Lava moats damage all mobs. To make this dig 1 block down around the perimeter of your base and fill it with lava."
    },
    {
      "title": "Build a high building that you could shoot with a bow from with high accuracy.",
      "content": "Build a high building that you could shoot with a bow from with high accuracy. It should have a clear view and preferably you should be able to shoot from all angles."
    },
    {
      "title": "Make one for some Snow Golems too.",
      "content": "Make one for some Snow Golems too. So even if you can't shoot from there for whatever reason someone still can."
    },
    {
      "title": "By far the strongest of the two utility mobs is the Iron Golem.",
      "content": "By far the strongest of the two utility mobs is the Iron Golem. He will spawn if 10 Villagers are in a village or your place 4 iron blocks in a T shape the place a pumpkin on top. This means you will spend 36 iron ingots per Iron Golem."
    },
    {
      "title": "Snow Golems.",
      "content": "Snow Golems. Can only do damage to Blazes and the Ender Dragon and will only push other mobs back. Although they are seemingly useless they can be very good in large numbers, they will keep mobs out until they either die or push a mob to its death. To make these put 2 snow blocks onto each other and a pumpkin."
    },
    {
      "title": "Cats/Ocelots.",
      "content": "Cats/Ocelots. These scare away creepers and can be tamed by feeding them fish."
    },
    {
      "title": "Dogs/Wolves.",
      "content": "Dogs/Wolves. Will fight along side you against anything but creepers. Can be tamed by feeding them bones."
    },
    {
      "title": "Make a loop using two redstone repeaters and two pieces of redstone dust.",
      "content": "Make a loop using two redstone repeaters and two pieces of redstone dust."
    },
    {
      "title": "Place four dispensers in a 2x2 space and then build two blocks behind the dispensers.",
      "content": "Place four dispensers in a 2x2 space and then build two blocks behind the dispensers."
    },
    {
      "title": "Connect the redstone loop with the dispensers and then fill the dispensers with arrows or fire charges ( arrows = machine gun, fire charge = flamethrower ).",
      "content": "Connect the redstone loop with the dispensers and then fill the dispensers with arrows or fire charges ( arrows = machine gun, fire charge = flamethrower )."
    },
    {
      "title": "The best way to quickly power the loop then turn off the power source is by using a button.",
      "content": "The best way to quickly power the loop then turn off the power source is by using a button. This will then cause the activated redstone to turn off and back on rapidly ( because its in a loop ) and will shoot out what's inside the dispensers."
    },
    {
      "title": "Soul sand kills Endermites.",
      "content": "Soul sand kills Endermites. They sink down slightly but this covers a large area of the mob, suffocating them."
    },
    {
      "title": "No mobs can sink under water to reach your base ( except squids ).",
      "content": "No mobs can sink under water to reach your base ( except squids ). A well lit underwater base will be well protected from mobs."
    },
    {
      "title": "Make sure your base has a farm for food.",
      "content": "Make sure your base has a farm for food. Without this you'd have to keep on going to get food, but fishing is always an option if your surrounded in water."
    },
    {
      "title": "Build a tall pillar in your base and make sure it's easy to get to.",
      "content": "Build a tall pillar in your base and make sure it's easy to get to."
    },
    {
      "title": "Get the elytra ( in 1.9 ) and jump off.",
      "content": "Get the elytra ( in 1.9 ) and jump off."
    },
    {
      "title": "This should allow you to escape to safety.",
      "content": "This should allow you to escape to safety. The only bad thing is you would have abandoned your base and anything inside."
    },
    {
      "title": "However if you do not want to abandon your base you can fly around it whilst shooting arrows.",
      "content": "However if you do not want to abandon your base you can fly around it whilst shooting arrows. That way you can kill your attacker but your attacker will struggle to kill you."
    },
    {
      "title": "Travel to the end an bring any thing else you need.",
      "content": "Travel to the end an bring any thing else you need. If you decide on not killing the ender dragon before building your base you may have to seek protection against the ender dragon. However if you kill the Ender Dragon you can go to ender cities and ender ships ( 1.9 ). These are pre-made structures that you could use to you advantage."
    },
    {
      "title": "Consider making a water moat.",
      "content": "Consider making a water moat. The End is teeming with Endermen, the water moat will stop them from getting near your base."
    },
    {
      "title": "Remember that you cannot sleep in The End and that food is scarce.",
      "content": "Remember that you cannot sleep in The End and that food is scarce."
    },
    {
      "title": "The Ender Dragon can't break bedrock or obsidian.",
      "content": "The Ender Dragon can't break bedrock or obsidian. As if these weren't strong enough building resources they can now protect you from this."
    },
    {
      "title": "The Snow Golems can damage the Ender Dragon.",
      "content": "The Snow Golems can damage the Ender Dragon. Keep in mind it's only 4 health points so you'll need a large army of these to hold of the Ender Dragon."
    },
    {
      "title": "Destroy the ender crystals as fast as possible.",
      "content": "Destroy the ender crystals as fast as possible."
    },
    {
      "title": "A arrow deals more damage than a sword in a fight with the Ender Dragon.",
      "content": "A arrow deals more damage than a sword in a fight with the Ender Dragon."
    },
    {
      "title": "Keep potions and golden apples ready.",
      "content": "Keep potions and golden apples ready. At least 4 times out of 10 the Ender Dragon will hit you if you go on the offensive and she can deal a lot of damage."
    },
    {
      "title": "Just keep moving.",
      "content": "Just keep moving. The Ender Dragon doesn't exactly chase you so if you run out of the way you won't get hit."
    },
    {
      "title": "Maybe make a high tower for jumping off with a elytra again.",
      "content": "Maybe make a high tower for jumping off with a elytra again. If your close enough you might be able to fly to help if you came with other people."
    }
  ]
}