{
  "url": "https://www.wikihow.com/Apply-a-Gift-Card-Code-to-Amazon",
  "title": "How to Redeem an Amazon Gift Card Code",
  "steps": [
    {
      "title": "Log in to your Amazon account.",
      "content": "Log in to your Amazon account. Make your way to Amazon's site and click the “Sign In” button in the top right corner (next to the search bar). [1] X Research source You must have an Amazon account in order to redeem a gift card and purchase anything on Amazon. So, if you don’t already have an account, take this time to sign up ."
    },
    {
      "title": "Click the “Your Account” tab.",
      "content": "Click the “Your Account” tab. Once you sign in, this will be in the same spot where the “Sign In” button was: in the upper right-hand corner next to the search bar. You can also hover your cursor over the “Your Account” tab and click “Your Account” at the top of the drop-down menu."
    },
    {
      "title": "Find and click on the “Redeem a Gift Card” option.",
      "content": "Find and click on the “Redeem a Gift Card” option. A series of rectangular icons will appear once you’ve entered your account. Select the icon that says “Gift Cards.” Then, click the option to “Redeem a Gift Card” under “Your Gift Card Balance” at the top of the page. [2] X Research source"
    },
    {
      "title": "Enter your gift card’s claim code in the empty field.",
      "content": "Enter your gift card’s claim code in the empty field. A new screen will load after you select “Redeem a Gift Card Code.” Use the 14- or 15-character code on your Amazon gift card in the field under “Enter claim code (dashes not required),” and click “Apply to your balance.” Amazon will now pull money from this balance at checkout instead of your normal payment method. [3] X Research source If you have a physical card, you may need to gently scratch or peel off the protective coating on the back of the card to reveal the claim code. [4] X Research source If you have a digital code, copy and paste it from your confirmation email into the claim code field. 8-, 12-, or 16-digit promotional codes or vouchers cannot be redeemed this way. Follow the separate instructions on these promotional codes or vouchers."
    },
    {
      "title": "Enter the gift card code when you check out for an alternative option.",
      "content": "Enter the gift card code when you check out for an alternative option. Shop as you normally would and fill up your cart. Then, after clicking “Proceed to checkout,” change your method of payment under “Payment method.” Type or paste your claim code into the empty field under “Enter a gift card, voucher or promotional code” in the “Your available balance” tab. Select “Apply” and finalize your order. [5] X Research source This is a great option if you have a shared family or friends account."
    },
    {
      "title": "Open the app and sign in to your Amazon account.",
      "content": "Open the app and sign in to your Amazon account. If you’re not already signed in on the app, tap the person icon at the bottom of your screen. Select “Sign in” and enter your email and password. [6] X Research source"
    },
    {
      "title": "Go to your “Payments” and tap “Manage gift card balance.”",
      "content": "Go to your “Payments” and tap “Manage gift card balance.” Once you’ve signed in, tap the person icon again and scroll down until you reach the sections titled “Payments.” Select the second menu option named “Manage gift card balance.\""
    },
    {
      "title": "Tap “Redeem another gift card” and enter your claim code.",
      "content": "Tap “Redeem another gift card” and enter your claim code. After selecting “Manage gift card balance,” you’ll be brought to another screen that shows your existing gift card balance. Click the first option under “Manage your balance,” enter your claim code into the empty field, and select “Apply.” [7] X Research source Once the gift card balance is applied to your account, Amazon will use this balance during checkout rather than your usual payment method. Try scanning a physical gift card’s claim code with your camera using the “Scan your claim code” feature to speed up the process. Find your claim code in your digital gift card confirmation email or on the back of a physical gift card."
    },
    {
      "title": "Type or scan your gift card number while checking out.",
      "content": "Type or scan your gift card number while checking out. Alternatively, you can apply your claim code to your order while selecting your payment option during checkout. Simply scan or enter your claim code into the empty field under “Add a gift card, promotion code, or voucher.”"
    },
    {
      "title": "Add money to an existing gift card balance using “Reload Your Balance.”",
      "content": "Add money to an existing gift card balance using “Reload Your Balance.” In the “Gift Cards” tab of your Amazon account, click the yellow icon “Reload Your Balance” under “Your Gift Card Balance.” You’ll be taken to a new screen where you can enter the amount you’d like loaded onto your account or preexisting balance. [8] X Research source Alternatively, you can scroll down to the very bottom of Amazon’s website and select the “Reload Your Balance” option under “Amazon Payment Products.” In the app, go to the “Manage gift card balance” tab and select “Reload your balance.”"
    },
    {
      "title": "Purchase gift cards from the \"Gift Cards\" page.",
      "content": "Purchase gift cards from the \"Gift Cards\" page . Select the “All” menu on Amazon's website in the upper left-hand corner under the Amazon logo. Scroll down to “Programs & Features” and click on the “Gift Cards” option. Choose “All gift cards” to shop physical and digital gift cards or “eGift cards” to view only digital cards. Keep in mind that you can’t use a gift card to purchase other gift cards on Amazon. [9] X Research source"
    },
    {
      "title": "Purchase a physical gift card in stores.",
      "content": "Purchase a physical gift card in stores. If you don’t want to buy a card online, look for an Amazon gift card at your local grocery, convenience, or electronic store. Typically, anywhere that sells gift cards will have an Amazon card available for purchase. [10] X Research source Amazon gift cards are available in quantities of $15, $25, $50, and $100."
    }
  ]
}