{
  "url": "https://www.wikihow.com/Cure-Wounds-5e",
  "title": "Cure Wounds in Dungeons & Dragons 5e: Everything You Need to Know",
  "steps": [
    {
      "title": "Cure Wounds is a 1st-level spell designed to heal its target.",
      "content": "Cure Wounds is a 1st-level spell designed to heal its target. Casting Cure Wounds means spending an action to heal your target. Your player character (PC) must touch the target to heal them. Upon casting Cure Wounds, the target gains hit points equal to 1d8 + your PC’s spellcasting ability modifier. When you cast Cure Wounds at higher levels, targets heal an additional 1d8 for each level above 1st. [1] X Research source Casting time: 1 action Range: Touch Components: Verbal, somatic Duration: Instantaneous School: Evocation For example, if you’re trying to heal an unconscious ally in battle and cast Cure Wounds on them, you’d have to roll a d8 (8-sided dice). Then, take the result and add it to your spellcasting ability modifier. If you roll 5 on your d8 and your PC’s spellcasting modifier is +4, your ally will heal 9 hit points (5 + 4)."
    },
    {
      "title": "Your PC can target anyone, including themselves, with Cure Wounds.",
      "content": "Your PC can target anyone, including themselves, with Cure Wounds. While there’s some confusion about whether you can use spells with a “touch” range on your PC, the answer is yes. So long as your PC is close enough to touch another creature or can touch themselves, you can Cast Cure wounds on any target—including your PC. [2] X Research source For example, if your PC’s wrists are chained to a wall, they can’t touch themselves—and thus can’t benefit from Cure Wounds. Remember that while Cure Wounds is a healing spell, it won’t reverse dismemberment. In other words, if your PC (or an ally) loses a limb, you can’t use Cure Wounds to fix it! You’ll need the 7th-level Regenerate spell for that."
    },
    {
      "title": "Cure Wounds doesn’t work on undead creatures or constructs.",
      "content": "Cure Wounds doesn’t work on undead creatures or constructs. While Cure Wounds can restore any living creature’s hit points, undead and constructs don’t count as “living” in D&D 5e. Undead creatures (like zombies and vampires) are technically dead, while constructs (like golems or Shield Guardians) are manmade and were never alive. Therefore, neither can benefit from Cure Wounds. [3] X Research source It’s also important to remember that Cure Wounds can’t be used to damage undead creatures. Previous editions of D&D stated that healing spells could harm the undead, but that isn’t the case in 5e. Hit points measure a creature’s health and how much damage it can take before falling unconscious. Healing spells (like Cure Wounds) are valuable because they can restore lost hit points—but only for living creatures."
    },
    {
      "title": "You can only add your spellcasting modifier to the spell once.",
      "content": "You can only add your spellcasting modifier to the spell once. When you upcast Cure Wounds at a higher level, you can absolutely give your target more healing than the default level 1 version of the spell would give—but you can only increase the number of dice you roll. Regardless of the level you cast Cure Wounds at, you can’t add your spellcasting modifier to each dice roll; just add up the total of your d8 rolls and then add your spellcasting modifier once. [4] X Research source For example, casting Cure Wounds at level 3 means healing a target and giving them hit points equal to 3d8 + your spellcasting modifier. So, if your spellcasting modifier is +4 and you get 15 after rolling 3d8, the target heals 19 hit points (15 + 4). For each level you upcast Cure Wounds, add 1d8. That means you can heal a target for 2d8 hit points at level 2, 3d8 at level 3, and 4d8 at level 4, up to 9d8 at level 9."
    },
    {
      "title": "Artificers, bards, clerics, druids, paladins, and rangers can cast the spell.",
      "content": "Artificers, bards, clerics, druids, paladins, and rangers can cast the spell. In older editions of D&D, clerics were the primary healers and doctors of the party—but nowadays, several classes can potentially function as healers with the Cure Wounds spell. This includes artificers, bards, clerics, druids, and paladins (who all get the spell at level 1), plus rangers (who can start using it at level 2). [5] X Research source Additionally, sorcerers with the Divine Soul subclass and warlocks with a Celestial patron also have access to Cure Wounds."
    },
    {
      "title": "Cure Wounds is relatively inefficient as a healing spell.",
      "content": "Cure Wounds is relatively inefficient as a healing spell. It takes an action to cast (which is significant because that prevents you from attacking or casting a powerful offensive spell on your turn). Choosing to cast Cure Wounds means spending most of your turn healing an ally with a meager amount of hit points, which might make your turn feel anticlimactic. Beyond that, its “touch” range makes it difficult to cast since you might find yourself too far away to help an ally that needs healing. [6] X Research source Cure Wounds rarely heals faster than enemies can do damage. 1d8 hit points’ worth of healing isn’t very much in the long run, and if an ally is under attack, the enemy hitting them might do even more damage the next turn. Cure Wounds heals an average of 4 hit points per spell level—which means even at higher levels, it’s not strong enough to look past the inconvenient touch range or action casting time. Still, Cure Wounds can be situationally helpful—but mainly when used on unconscious allies. Healing conscious allies in battle with Cure Wounds rarely feels worth it!"
    },
    {
      "title": "The Cure Wounds spell is unnecessary when you’re close to victory.",
      "content": "The Cure Wounds spell is unnecessary when you’re close to victory. If it seems like your party is about to win a fight, it might not matter if you (or an ally) are badly wounded. In fact, it usually makes more sense to direct even more firepower toward enemies—because the quicker you can finish the battle, the sooner you can take a short (or long) rest and heal yourself without expending spell slots. [7] X Research source Consider this: healing a wounded ally near the end of a battle might hurt more than it helps because you’re wasting a turn on a bit of healing when you could use that action to deal much more damage to the enemy attacking them."
    },
    {
      "title": "Revive a nearby unconscious ally with Cure Wounds.",
      "content": "Revive a nearby unconscious ally with Cure Wounds. When a party member is unconscious and making saving throws, getting them back up as quickly as possible is imperative! So, if you have Cure Wounds at your disposal, use it to heal your downed ally (and prevent them from dying, since death saving throws dictate whether an unconscious creature ultimately lives or dies from their wounds). [8] X Research source While Cure Wounds is inconvenient because you have to physically touch a character to heal them, it’s still better than nothing! So, if you’re already close to your downed ally (or it’s the only healing you have), go ahead and use it."
    },
    {
      "title": "Heal allies outside of combat with Cure Wounds.",
      "content": "Heal allies outside of combat with Cure Wounds. Most of the time, you can just take a short rest and roll Hit Die to heal outside of combat. However, if your party is in a hurry and you don’t have time to rest (since a short rest takes 1 hour and a long rest takes 8 hours), Cure Wounds can be a great backup. Plus, since you’re not in the middle of combat, you won’t feel like you’re wasting an action by casting Cure Wounds instead of some other spell. [9] X Research source Theoretically, you can also use Cure Wounds to stop a wounded ally’s bleeding—especially if you’re trying to cover up your tracks and remain undetected."
    },
    {
      "title": "Avoid using Cure Wounds to heal allies during combat.",
      "content": "Avoid using Cure Wounds to heal allies during combat. As mentioned above, Cure Wounds isn’t very effective in battle unless you’re casting it to save an ally on the brink of death. Ultimately, almost every other healing spell and class ability available in 5e is either more efficient than Cure Wounds or heals more hit points—making it pretty unnecessary overall. Your PC could use their turn to do something more impactful than casting Cure Wounds, so focus on picking off enemies instead! [10] X Research source If you can’t kill an enemy immediately, focus on weakening them. Cast spells that reduce the damage they can do, slow them down or stop them from making attacks. Remember: spell slots are limited in D&D 5e. That’s why using your precious spell slots for potent spells capable of devastating enemies or helping allies (more so than Cure Wounds can) is wiser. Not sure which healing spells and abilities to focus on instead? Check out our overview below."
    },
    {
      "title": "Incorporate Cure Wounds into single-player D&D games.",
      "content": "Incorporate Cure Wounds into single-player D&D games. If you like playing D&D as a single player (meaning it’s just you and the Dungeon Master with no other players), Cure Wounds may be a much more appealing spell. Since you’ll only ever need to heal yourself (rather than trying to run and reach wounded allies), the spell’s “touch” range won’t be an issue. Just cast Cure Wounds and heal yourself whenever you need it! [11] X Research source"
    },
    {
      "title": "Healing Word",
      "content": "Healing Word Although Healing Words can’t heal as many hit points per casting as Cure Wounds, it’s significantly more impactful and convenient. When you cast Healing Word, you can target any creature (including yourself) within 60 feet, and your target will gain hit points equal to 1d4 + your spellcasting ability modifier. Upcasting Healing Word at higher levels also targets an additional 1d4 for each level above 1st. [12] X Research source Healing Word’s range makes it a lifesaver—and even better, it only takes a bonus action to cast. That means you can heal an ally from a distance (without putting your PC in danger by getting close to an enemy). Additionally, you can quickly cast Healing Word and still use your PC’s action on the same turn to do something else. Healing Word is a verbal spell, meaning as long as your PC can speak, they can easily cast it. The spell’s duration is instantaneous, meaning it’ll take effect as soon as you cast it. If you’re the party’s healer and trying to keep your allies alive, Healing Word is the more practical spell by a mile!"
    },
    {
      "title": "Mass Cure Wounds",
      "content": "Mass Cure Wounds Mass Cure Wounds is a 5th-level spell, so you won’t be able to cast it until your PC is at a higher level (whereas Cure Wounds is available from level 1 in most cases). However, the Mass Cure Wounds spell has a range of 60 feet, sending a wave of healing energy to 6 allies and giving them hit points equal to 3d8 + your spellcasting modifier. Upcasting the spell adds 1d8 for each spell level above 5th. [13] X Research source Casting Mass Cure Wounds is still a big commitment—it’s a 5th-level spell, and higher-level spell slots are very limited. Nonetheless, Mass Cure Wounds can turn the tide of a battle by bringing multiple unconscious allies back to consciousness (or getting several wounded allies back in fighting condition). Additionally, because this spell has a range of 60 feet, your PC can stay out of harm’s way while casting it."
    },
    {
      "title": "Lay on Hands",
      "content": "Lay on Hands Lay on Hands is a class ability specific to paladins—but if you’re playing a paladin character , using Lay on Hands is likely much easier tactically than casting Cure Wounds. All paladins have a pool of healing power that can replenish a certain number of hit points equal to their paladin level x 5. With Lay on Hands, they can use an action to touch a creature and restore up to the maximum amount of hit points remaining in that pool. [14] X Research source The base number of hit points a paladin can restore is 5 (at level 1) since 1 x 5 = 5. Therefore, paladins can restore 10 hit points at level 2 (2 x 5), 15 hit points at level 3 (3 x 5), and so on, up to 100 hit points at level 20 (20 x 5). While Lay on Hands has a touch range like Cure Wounds, it doesn’t take up a spell slot—so your paladin PC can heal allies without expending spell slots that they could use for powerful offensive spells like Divine Smite."
    }
  ]
}