{
  "url": "https://www.wikihow.com/Fill-Large-Holes-in-Wood",
  "title": "How to Fill Large Holes & Gaps in Wood like a Pro: A Step-By-Step Guide",
  "steps": [
    {
      "title": "Gather your materials.",
      "content": "Gather your materials. Select water-based wood filler, primer, and paint if the item you are repairing is kept indoors, or solvent-based wood filler and oil-based primer and paint if the item will be placed outdoors. You'll also need craft sticks, disposable plates, PVA glue, wood glue, 120-grit sandpaper, and paintbrushes or rollers. [1] X Research source Gather old clothes, rags, a sheet or drop cloth, painter's tape, and a paint stirrer as well."
    },
    {
      "title": "Glue craft sticks together to cover the hole.",
      "content": "Glue craft sticks together to cover the hole. The craft sticks will provide a support for you to apply the wood filler to. Inspect the size of the hole and decide how many craft sticks it would take to cover it. [2] X Research source For example, if a hole can be filled by 3 craft sticks, lay them flat on a work surface side by side. Pour glue over the back of the 3 craft sticks. Place 3 more craft sticks on top of the first 3 to create a strong layer that's stuck together properly. The amount of craft sticks you'll have to use depends on the size of the hole. Give the glue 10 to 15 minutes to dry."
    },
    {
      "title": "Place the craft sticks on the back of the hole and secure them with wood glue.",
      "content": "Place the craft sticks on the back of the hole and secure them with wood glue. Place the glue around the border of the hole in your wood. You should lay the craft sticks on the side they won't be seen from. If you're filling a hole in a cabinet, wall, or a wardrobe, place the craft sticks on the inside of the hole. [3] X Research source If you're covering a hole in a wall or wood that you can't place on a flat surface, you might need to hold the craft sticks for 5 minutes so they stick to the glue."
    },
    {
      "title": "Mix your wood filler using a craft stick and a disposable paper plate.",
      "content": "Mix your wood filler using a craft stick and a disposable paper plate. Follow the directions on the tin of the wood filler you're using. Directions vary depending on the manufacturer. There's no need to mix a large amount of wood filler. A small amount of wood filler on the plate will do the job. [4] X Research source Ensure that the room is well ventilated as wood filler has a very strong smell. The filler is fully mixed when it turns orange-brown in color."
    },
    {
      "title": "Apply the wood filler to the craft sticks to fill the hole.",
      "content": "Apply the wood filler to the craft sticks to fill the hole. Once your wood filler is mixed, use it quickly. Apply the filler to the craft sticks using another craft stick or a putty knife. The craft sticks will act as a support for the wood filler. The filler should be level and even with the surface of the wood. [5] X Expert Source Tanglewood Sue DIY & Upcycling Specialist Expert Interview. 24 March 2021."
    },
    {
      "title": "Let the filler dry for 1 hour before using 120-grit sandpaper on it.",
      "content": "Let the filler dry for 1 hour before using 120-grit sandpaper on it. Once the filler is dry, rub it with 120-grit sandpaper. You will need to use a decent amount of pressure when rubbing the filler with the sandpaper. Keep using the sandpaper until it's level with the rest of the wood. [6] X Expert Source Tanglewood Sue DIY & Upcycling Specialist Expert Interview. 24 March 2021. If you're using a pad sander on the filler, use 220-grit sandpaper instead. Pad sanders are handheld devices that can powerfully sand wood."
    },
    {
      "title": "Use a cloth to clean the wood and remove the dust.",
      "content": "Use a cloth to clean the wood and remove the dust. Hold your cloth under the tap for a couple of seconds and wipe the area of the wood you just filled in. You might need to wipe the area a couple of times if the hole was very large or if you used a lot of filler. [7] X Research source Wiping the area with a cloth is also necessary before you prime the wood."
    },
    {
      "title": "Place a sheet on the floor or on your work surface before you prime.",
      "content": "Place a sheet on the floor or on your work surface before you prime. If you're painting a wooden wall, place a sheet on the floor to catch any drips of paint. If you're painting a wooden cabinet or another item that you can move, place it on top of a sheet to ensure maximum protection for the surrounding area. [8] X Research source Move any furniture away before you paint. If the furniture is too big to move, cover it with another sheet. Cover baseboards, hinges, and other items with painter's tape if you need to."
    },
    {
      "title": "Apply a primer to the wood.",
      "content": "Apply a primer to the wood. Primer makes it easier for the paint to stick to the surface of the item you're painting. If you're painting a wooden wall and you have the paint you used for the rest of the wall when you originally painted it, you'll only need to prime the area you filled in with wood filler. If you want to paint the entire area of the wooden object, you'll need to prime it all. [9] X Research source Use a roller to prime a wall and a paintbrush to prime smaller objects."
    },
    {
      "title": "Give the primer 3 hours to fully dry.",
      "content": "Give the primer 3 hours to fully dry. Primer can dry within 2 hours of being applied to an item. However, if you paint the primer before it's dry, you'll ruin the item you're painting. By giving it 3 hours to fully dry, you allow for the primer to dry completely. Don't paint over the primer before it's completely dry. Primer can feel dry to the touch without being fully dry."
    },
    {
      "title": "Apply the first coat of paint to the wood.",
      "content": "Apply the first coat of paint to the wood. Once the primer has completely dried, use a paintbrush or a roller to apply the first coat to the wood. Rollers will work best on walls and other flat surfaces. Paint other surfaces using a flat or tapered paintbrush. [10] X Research source If you're only painting over the filler, use the same paint you painted the rest of the item with. If you can't find that paint, go to the local paint store and take paint strips. Hold these strips to the wood to find the right color of paint. Don't be afraid to use plenty of paint. It's better to apply too much paint to the item than too little. Make sure you brush the paint so it evenly covers the surface of the item. Use even and measured strokes like you used to apply the primer."
    },
    {
      "title": "Give the first coat 2 to 3 hours to completely dry.",
      "content": "Give the first coat 2 to 3 hours to completely dry. You should give the paint time to properly dry into the wood. This will take 2 hours at the very least. Test if the paint is dry by dabbing it with a tissue. Inspect the tissue after for signs of paint. If there's no paint on the tissue, the paint is dry and you can apply the second coat. [11] X Research source Consider leaving the paint dry overnight to ensure it's completely dry."
    },
    {
      "title": "Apply the second coat of paint to the wood.",
      "content": "Apply the second coat of paint to the wood. After the first coat has fully dried, use even and measured strokes once more to apply the second coat. Once you finish applying the second coat, look at the wood and decide if it needs another coat. If the paint doesn't look right on the wood, it will probably need another coat. [12] X Research source"
    },
    {
      "title": "If you decide to apply another coat, follow the process again.",
      "content": "If you decide to apply another coat, follow the process again. Give the second coat 2 to 3 hours to dry before painting the third coat."
    }
  ]
}