{
  "url": "https://www.wikihow.com/Feed-a-Horse-in-Minecraft",
  "title": "How to give a Horse Food in Minecraft: Easy Step-by-Step Guide",
  "steps": [
    {
      "title": "Gather food for horses.",
      "content": "Gather food for horses. Horses eat very specific foods. Feeding a horse can increase its health, increase a wild horse's temper, and speed up the time it takes a baby horse to grow into an adult. The following are the different food items a horse can eat and the effects they have on the horse: Sugar: Sugar can be crafted from sugar cane using a crafting table . Feeding sugar to a horse increases its health by 1 HP (½ a heart), increases its temper by 3 points, and speeds up the time it takes a baby to mature into an adult by 30 seconds. [1] X Research source Wheat: Wheat can be grown from wheat seeds in tilled soil next to a water source. You can also find wheat in village gardens. Wheat increases a horse's health by 2 HP (1 heart), increases its temper by 3 points, and speeds up the time it takes a baby to mature into an adult by 20 seconds. Apple: Oak and dark oak leaves have a 0.5% chance of dropping an apple when broken or decayed. You can also find apples inside chests in villages, igloos, and strongholds. Feeding an apple to a horse increases its health by 3 hearts, increases its temper by 3 points, and speeds up the time it takes a baby to mature into an adult by 1 minute. [2] X Research source Golden Carrot: Golden carrots can be crafted from 1 carrot and 8 gold bars. Carrots can be found in village gardens, and gold bars can be smelted from gold ore in a furnace . Feeding a golden carrot to a horse increases a horse's health by 4 HP (2 hearts), increases its temper by 5 points, and speeds up the time it takes a baby to mature into an adult by 1 minute. Golden carrots also put horses in love mode so that they can breed . [3] X Research source Golden Apple: A golden apple can be crafted from an apple and 8 gold bars using a crafting table. Feeding a golden apple to a horse increases its health by 10 HP (5 hearts), increases its temper by 10 points, and increases the time it takes a baby to mature into an adult by 4 minutes. Golden apples also put horses in love mode so that they can breed . [4] X Research source Hay Bale: Hay bales can be crafted from 9 wheat using a crafting table. Feeding a bale of hay to a horse increases its health by 20 HP (10 hearts), and increases the time it takes a baby horse to mature into an adult by 3 minutes. Hay bales can only be fed to horses that have already been tamed . [5] X Research source"
    },
    {
      "title": "Find a horse.",
      "content": "Find a horse. Horses spawn naturally in plains and savanna biomes. They spawn in herds of 2 to 6. You can also find tame horses in villages with animal pens and stables ."
    },
    {
      "title": "Feed the horse.",
      "content": "Feed the horse. To feed a horse, place the food item into your hot bar and then select the corresponding hot bar space to equip the food. Stand next to the horse and aim the reticle at the horse. Right-click (or press the left trigger on game consoles) to feed the horse. Horses will only eat if they are hungry. This means that their health is low, or they are a baby. [6] X Research source"
    }
  ]
}