{
  "url": "https://www.wikihow.com/Handle-Being-Made-Fun-Of",
  "title": "An Expert-Approved Guide to Dealing With Bullying",
  "steps": [
    {
      "title": "Disregard the teasing.",
      "content": "Disregard the teasing. Unless it becomes a routine problem, if someone makes fun of you the best way to handle the situation is by ignoring the teasing altogether. By ignoring the bully you are denying them the attention that they are seeking by making fun of you. They are likely to get bored and leave you alone. When someone starts to tease you, don’t give them the attention that they are seeking. Continue to do what you were doing and act like you didn’t hear them."
    },
    {
      "title": "Walk away from the bully.",
      "content": "Walk away from the bully. If ignoring the bully does not work, consider walking away from the situation. While this still denies the bully the attention that they were seeking, it also sends a clear signal that you will not tolerate being teased. This will also prevent you from having to hear what the bully has to say. If someone starts to pick on you while you are at your locker at school, grab the books that you need and go to class. When a co-worker is making fun of you in the office, find something else to do. Go to a different room to work, grab a cup of coffee, or take a trip to the restroom. The bully will likely be back to work by the time you return."
    },
    {
      "title": "Find an outlet.",
      "content": "Find an outlet. If persistent teasing is getting you down consider finding an emotional outlet. Exercise can help you release built up anger and stress. It can also be a great confidence booster. Take up boxing or kung fu to release some built up aggression. Yoga or distance running are great outlets to manage stress and clear your head. Practice mediation and deep breathing to calm yourself down. [1] X Expert Source Nicole Moshfegh, PsyD Licensed Clinical Psychologist Expert Interview. 5 August 2021. Set aside 15-20 minutes to journal about your feelings and process your emotions. [2] X Expert Source Nicole Moshfegh, PsyD Licensed Clinical Psychologist Expert Interview. 5 August 2021."
    },
    {
      "title": "Firmly ask them to stop teasing you.",
      "content": "Firmly ask them to stop teasing you. Sometimes ignoring a bully does not put an end to the bullying. It is important to stand up for yourself when someone is making fun of you. Be sure to make eye contact with your bully while you firmly ask them to stop teasing you. [3] X Research source Make your statements short and to the point. Say something like, “I don’t appreciate you making fun of me. Please stop.” Stay calm when you confront your bully. Being emotional or crying could fuel the bullying."
    },
    {
      "title": "Take a humorous approach.",
      "content": "Take a humorous approach. Most bullying can be hurtful in the moment but really won’t matter of weeks or months. If you understand how insignificant the teasing really is, try to respond to the teasing with humor. [4] X Research source Be witty or exaggerate the bully’s comments."
    },
    {
      "title": "Seek help from an adult.",
      "content": "Seek help from an adult. If you are a child or teenager and need help to stop someone from bullying you, it is okay to ask an adult for help. Bullying is very serious and is not tolerated in most schools. Ask a teacher, coach, parent, or other trusted adult to help you handle the situation. [5] X Research source Most schools have anti-bullying policies and will take disciplinary measures to ensure the safety of each of their students. Be persistent. If one adult does not take your concerns seriously, talk to a different adult. You have the right to feel safe. Be prepared to give specific examples. You want the adult to understand that they are bullying you, and not that you are tattling on them. If the bully is a family member, consider asking another family member to help. They may be able to talk to your bully privately to put an end to the teasing."
    },
    {
      "title": "Increase your circle of friends.",
      "content": "Increase your circle of friends. By increasing your circle of loyal friends you are establishing more people who will stand up for you when someone is making fun of you. If it is your friends that are teasing you, consider finding new friends. Although friends sometimes tease each other, it is never okay for a friend to relentlessly tease you regardless of your requests for them to stop. Friends should not make each other feel bad. Join a club, sport, or other extra curricular activity that interests you in order to find new friends with the same interests and values. Volunteer after work for a local organization. Be a good friend in return. Remember how it feels to be made fun of and never laugh when someone else is being made fun of. Stand up for others who are being bullied."
    },
    {
      "title": "Don’t dwell on the teasing.",
      "content": "Don’t dwell on the teasing. Let go of all of the negativity and focus on positive things. Remind yourself of all the things you are good at and surround yourself with people who make you feel good about yourself. Try to understand that you cannot control the bully but you can control how you react to a bully."
    },
    {
      "title": "Find someone to talk to about the teasing.",
      "content": "Find someone to talk to about the teasing. Continuous bullying can be damaging to someone’s psychological well being. Over time, the victim might feel helpless, worthless, and anxious. This can have a negative effect in school, work, or social life. Seek professional help from a counselor or psychologist if you feel that you need additional emotional support to handle bullying. [6] X Research source Your school’s counselor will be able to give you additional tips to handle bullying. There is no shame in seeing a counselor, therapist, or psychologist. Therapy can help you get more in touch with your emotions. [7] X Expert Source Nicole Moshfegh, PsyD Licensed Clinical Psychologist Expert Interview. 5 August 2021. They may also be able to help improve your social skills to help prevent you from being a target of bullying in the future."
    }
  ]
}