{
  "url": "https://www.wikihow.com/Be-Nice-to-a-Girl-Without-Flirting",
  "title": "How to Be Nice to a Girl Without Flirting",
  "steps": [
    {
      "title": "If you hold the door for her, hold the door for someone else, too.",
      "content": "If you hold the door for her, hold the door for someone else, too. It’s fine to be a chivalrous person, but try to show her that you’re just that way in general. If she sees you being chivalrous to everyone, she won’t automatically assume you’re doing it to flirt with her. [1] X Research source If you pull out her chair at a restaurant, pull out your other friend’s chair, too."
    },
    {
      "title": "Being teasing or playful often comes across as flirtatious.",
      "content": "Being teasing or playful often comes across as flirtatious. If you want to give her a compliment, say it like you would to one of your buddies. Keep your tone flat, and just say something quick and casual. [2] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source For instance, you might say, “Good job on that presentation earlier.” Or, “I really liked that joke you told at dinner earlier.”"
    },
    {
      "title": "If you liked her, you’d probably wait a bit to show you’re not too eager.",
      "content": "If you liked her, you’d probably wait a bit to show you’re not too eager. Although this can seem counterintuitive, texting her back right away lets her know that you’re not playing hard to get (and therefore, you aren’t flirting with her). It’s subtle, but it can actually make a difference in your interactions. [3] X Research source It’s fine if you accidentally miss a text and don’t respond for a while. In general, though, try to respond to her quickly."
    },
    {
      "title": "Tell her all about your buddy who would be a perfect match for her.",
      "content": "Tell her all about your buddy who would be a perfect match for her. She’ll get the message that while you’re not interested, someone else might be. Plus, this is a great way to pair up two of your single friends! [4] X Research source Say something like, “You know who you would really get along with? My friend, Seth. Let me give you his number so you two can hang out sometime.”"
    },
    {
      "title": "Don’t go out to a 5-star restaurant.",
      "content": "Don’t go out to a 5-star restaurant. Instead, meet up at a dive bar or a diner near your house. She’ll get the message that this is a platonic hangout and not a date. Even if you’re celebrating something special, don’t go anywhere you have to dress up unless you’re in a big group of friends."
    },
    {
      "title": "If you and your friends go out, invite her along.",
      "content": "If you and your friends go out, invite her along. Introduce her to the group so she can bop around and chat with everyone. Better yet, tell her to invite a friend along too so she really gets the message that this isn’t romantic. [5] X Research source You could say something like, “Hey! Me and the boys were gonna get together tonight to watch the game. You wanna come over? Bring a friend if you want!”"
    },
    {
      "title": "Pointing out her body is very flirtatious.",
      "content": "Pointing out her body is very flirtatious. Even if you notice that she looks good that day, don’t draw attention to it. Stick to neutral compliments about her personality so she doesn’t get the wrong idea. [6] X Research source If you really want to point something out, stick to something she’s wearing, like her shoes or a necklace. Stay away from anything that clings to her body, like a tight top or a short skirt. For instance, you might say, “You’re so generous. You’re such a good friend to have.”"
    },
    {
      "title": "Sometimes friends like to talk about their latest hookups.",
      "content": "Sometimes friends like to talk about their latest hookups. While it’s fine to do every once in a while, it could send the wrong message to her. If she brings up how good she is at kissing or what she did last night (wink), go ahead and change the topic. [7] X Research source For instance, if she says something like, “All my previous boyfriends have said I’m a great kisser,” you might brush it off with a joke, like, “Well, my girlfriend says I give really great hugs, so I think I win.”"
    },
    {
      "title": "Try not to lean in close or touch her on the arm.",
      "content": "Try not to lean in close or touch her on the arm. Breaking the physical touch barrier is often seen as a clear sign that someone is flirting. When you two hang out, keep your hands to yourself so she doesn’t get the wrong message. [8] X Research source If you’re hugging her hello or goodbye, keep the interaction short, and try not to linger."
    },
    {
      "title": "If you meet a girl while you’re out, she might ask for your number.",
      "content": "If you meet a girl while you’re out, she might ask for your number. Try not to give it to her, since that can send the wrong message. If you do want to keep chatting with her but you don’t want it to be flirtatious, give her your social media handle instead. It’s a little less personal, and she might get the hint that you aren’t into her. [9] X Research source You could also give her your email address."
    },
    {
      "title": "Let her know that you’re in a happy relationship.",
      "content": "Let her know that you’re in a happy relationship. If you have a partner, tell your friend all about them and how well you two are doing. She’ll hopefully get the message that you aren’t trying to flirt with her since you’re in a relationship. [10] X Research source Unfortunately, some people don’t see a relationship as a barrier to flirting. Use this method in conjunction with other things to get the message across."
    }
  ]
}