{
  "url": "https://www.wikihow.com/Know-when-a-Man-Is-Attracted-to-You",
  "title": "How to Know when a Man Is Attracted to You",
  "steps": [
    {
      "title": "He probably enjoys your company so much that it makes him happy.",
      "content": "He probably enjoys your company so much that it makes him happy. Take note of how often he smiles or laughs at one of your jokes, then compare it to how he talks to others. If he’s way happier or excited when he’s with you, there’s a good chance that he’s attracted to you. [1] X Research source Some people just naturally laugh a lot and are quick to smile, which is why it’s important to compare your interactions to other people’s."
    },
    {
      "title": "Complimenting someone indicates a little bit of attraction.",
      "content": "Complimenting someone indicates a little bit of attraction. If every time you see this guy he has another sweet comment for you, that’s a good sign. [2] X Expert Source Alysha Jeney, MA, LMFT Licensed Relationship Therapist Expert Interview. 11 August 2021. It means he’s pointing out the things he likes about you to show that he cares about you. [3] X Research source Some people are just naturally complimentary, however. If you notice that he gives everyone compliments, it might not just be a you thing."
    },
    {
      "title": "When someone is attracted to you, they’ll want to look you in the eyes.",
      "content": "When someone is attracted to you, they’ll want to look you in the eyes. Pay attention to where he’s looking whenever you two chat. Does he glance around the room, or does he lock eyes with you intensely? [4] X Expert Source Alysha Jeney, MA, LMFT Licensed Relationship Therapist Expert Interview. 11 August 2021. If he holds your gaze no matter what, there’s a good chance that he’s attracted to you. [5] X Research source You might also catch him staring at you from across the room. If you happen to catch his eye, he’ll hold eye contact with you and smile."
    },
    {
      "title": "Calm, relaxed posture indicates that he likes you.",
      "content": "Calm, relaxed posture indicates that he likes you. When you see him, he’ll probably have his arms by his side, his shoulders down, and his back relaxed. This is a good sign—it means that he feels totally comfortable around you, and he’s probably happy to see you. [6] X Research source On the flip side, if he has his arms crossed, his shoulders hunched, or his posture rigid, he might not be that into you (or he’s just in a really bad mood)."
    },
    {
      "title": "This may mean that he wants to be near you.",
      "content": "This may mean that he wants to be near you. When you two talk, you’ll probably notice him leaning in toward you, maybe a little closer than he would with someone else. People usually only do this if they like someone, so it’s a good sign! [7] X Research source On the flip side, if he leans back or away from you, that doesn’t necessarily mean he doesn’t like you. Some people are more “relaxed” flirters, meaning that the more they like you, the more comfortable they’ll feel to lean away from you."
    },
    {
      "title": "Breaking the touch barrier shows someone that you’re attracted to them.",
      "content": "Breaking the touch barrier shows someone that you’re attracted to them. If the guy in question can’t stop patting you on the back, touching your hand, or gently brushing your shoulder, then he’s probably into you. He might even make excuses to touch you, like offering a massage. [8] X Research source You can test this theory by “accidentally” brushing your hand against his. If he doesn’t flinch or pull away, he probably likes you."
    },
    {
      "title": "Facing you means he’s making an effort to talk to you.",
      "content": "Facing you means he’s making an effort to talk to you. If you notice that he always has a knack for singling you out in a crowd, this probably isn’t a coincidence. It’s because he’s making an effort to be near you, even when there are a lot of other people around. [9] X Research source If you're hanging out with a group of his friends and you still have his undivided attention, that's a great sign that he's into you. Reader Poll: We asked 651 wikiHow readers and only 13% thought that the strongest sign of a guy liking you is him inviting you into his plans . [Take Poll] So while joining his social plans may not be absolute proof, having his full attention definitely is."
    },
    {
      "title": "When people like each other, they don’t want anything in their way.",
      "content": "When people like each other, they don’t want anything in their way. If you two are sitting at a table with a vase of flowers in between you, he’ll probably scoot them out of the way so you two can chat. Or, if you’re sitting on a couch with a lot of decorative pillows, he’ll push them to the side so he can see you. [10] X Research source The same goes for his cup if he’s drinking something—if he sets it down to the side and not directly in between you two, there’s a good chance he’s attracted to you."
    },
    {
      "title": "People often blush when they’re excited or nervous.",
      "content": "People often blush when they’re excited or nervous. It’s because their body is releasing adrenaline, which can make their cheeks turn pink. If you catch him going pink every time you glance in his direction, that’s a major giveaway that he’s into you. [11] X Research source There are other things that make people blush too, like alcohol and heat. But if you’re both stone cold sober and a little chilly, you’ll probably notice if he’s blushing because of you."
    },
    {
      "title": "He might be nervous around you because he’s attracted to you.",
      "content": "He might be nervous around you because he’s attracted to you. If you walk into the room and notice him fixing his tie or fidgeting with his shirt, take note of that. He might be trying to fix up his clothing so he looks nice for you, or he might just be feeling nervous. [12] X Research source Confident guys probably won’t act super flustered around you. If the guy you’re wondering about tends to be a little cocky, he’ll probably act calm, cool, and collected no matter what."
    },
    {
      "title": "Men sometimes do this to show they’ve let their guard down.",
      "content": "Men sometimes do this to show they’ve let their guard down. If you’ve been talking to this guy for a little while and you notice a change in his voice, it probably means he’s attracted to you. He might also slow down how fast he’s talking or take longer pauses in between sentences. [13] X Research source When people are nervous, their voices sometimes get a little higher. If you notice any change to this guy’s voice, it’s probably a sign that he thinks you’re cute."
    },
    {
      "title": "People make time for the people they’re attracted to.",
      "content": "People make time for the people they’re attracted to. If you send this guy a text and get a reply only minutes later, there’s a good chance he was sitting by the phone waiting for your message. He’ll probably even make time to talk with you if he’s busy or at work—if he does that, you’ll know for sure that he’s into you. [14] X Research source Keep in mind that some people really are super busy, and he might actually not have time to reply to you. If that’s the case, he could still be into you, even if he does take a while to text back."
    },
    {
      "title": "When a guy likes you, he’ll put effort into contacting you.",
      "content": "When a guy likes you, he’ll put effort into contacting you. If you have this guy’s number, he’ll most likely text you long paragraphs. This means that he really enjoys talking to you, and he wants to keep it up, even over text. [15] X Research source On the other hand, if he only texts you one-word answers or short replies, he might not be that into you."
    },
    {
      "title": "He probably wants extra ways to keep in touch with you.",
      "content": "He probably wants extra ways to keep in touch with you. Maybe you gave this guy your name, and he somehow found your Instagram or Facebook. This means that he was doing some sleuthing and found you online, which probably means that he’s into you. [16] X Research source This is especially true if you have a pretty common name, because it means he had to work extra hard to find you. If he DMs you, sends you Snaps, or comments on all your posts, he's into you."
    }
  ]
}