{
  "url": "https://www.wikihow.com/Set-Boundaries-with-a-Baby-and-Your-Mother-in-Law",
  "title": "How to Set Boundaries with a Baby and Your Mother in Law",
  "steps": [
    {
      "title": "Set boundaries now so it doesn’t become a problem later on.",
      "content": "Set boundaries now so it doesn’t become a problem later on. The more you let things go, the more your mother-in-law will assume what she’s doing is okay (even when it’s not). Although it might seem easier to wait a while until your baby is older, that can actually make things worse. [1] X Research source It's best to avoid making assumptions when it comes to setting boundaries. You might think that your mother-in-law should know how you feel without being told, but different people have different boundaries."
    },
    {
      "title": "It’s very important that you and your spouse work as a team.",
      "content": "It’s very important that you and your spouse work as a team. Before you talk with your mother-in-law, sit down and chat with your partner about what’s been going on. Come up with a plan together, and make sure they back you up. It will be much easier to set boundaries with your partner’s support, so do this right away. [2] X Research source It can be a little difficult talking to your partner about their mother, so make sure they know you’re coming from a place of love. You might say something like, “You know I love your mom, but she can be a little overbearing at times. I’d love if we could work together to set some boundaries so we all feel comfortable.”"
    },
    {
      "title": "It will be a much more productive conversation this way.",
      "content": "It will be a much more productive conversation this way. Make sure your mother-in-law is calm, and pick a private place where everyone can talk freely. You want to do this in private to avoid making your mother-in-law feel like you’re attacking her (which you aren’t). [3] X Research source Try taking your mother-in-law out to dinner or inviting her over for coffee or tea."
    },
    {
      "title": "It might be easier for your MIL to hear boundaries from their own child.",
      "content": "It might be easier for your MIL to hear boundaries from their own child. Instead of approaching her yourself, let your partner talk to her first, and be there as backup. That way, she doesn’t get resentful of you, and she knows that you and your partner are on the same page. [4] X Research source You can ask your spouse to do this by saying something like, “When we talk with her, would you mind taking the lead? I don’t want her to feel like I’m attacking her.”"
    },
    {
      "title": "It’s time to let your mother-in-law what’s okay and what isn’t.",
      "content": "It’s time to let your mother-in-law what’s okay and what isn’t. It’s totally valid to be firm about boundaries—as long as you have your baby’s best interests in mind, she should be able to understand eventually. Be kind and respectful, but state your boundaries in no uncertain terms. [5] X Research source You might say, “I really appreciate you taking care of little Ryan, but he needs to keep up with his nap schedule. When he doesn’t take his afternoon nap, he’s cranky all evening, and I have a tough time getting him to bed.” Or, “We love when you come over to help out with the baby, but we need you to call before you start heading over. That way, we can make sure the house is ready, and you won’t have to sit around doing nothing if we’re busy.” Using I-statements and emphasizing your point of view might help your mother-in-law avoid getting defensive or upset."
    },
    {
      "title": "Tell your MIL plainly about the help you like and the help you don’t like.",
      "content": "Tell your MIL plainly about the help you like and the help you don’t like. For instance, if you love it when she makes your baby a bottle but don’t really appreciate the backhanded comments about how often your baby eats, you can say that (in a nice way). That way, there’s no confusion about what she can and can’t do going forward. [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source “It’s really helpful when you go and get Timmy a bottle, but it’s not very helpful when you talk to me about how often he eats. His doctor says he’s in a good weight range, and I only feed him when he’s hungry.” “I love when you come over to help out with the baby, but we just can’t have you coming over unannounced. Maybe we could set up a specific visiting schedule so we’re all on the same page.”"
    },
    {
      "title": "This can help your mother-in-law understand what you’re talking about.",
      "content": "This can help your mother-in-law understand what you’re talking about. Try to think of a few examples where your boundaries have been crossed, and just keep them in your back pocket. If your mother-in-law protests or isn’t sure what you mean, tell her a few examples that you remember to jog her memory. For instance, you might say, “Remember last week when you told me I was coddling her too much? It wasn’t a very helpful comment, and it didn’t really add much to the conversation.”"
    },
    {
      "title": "Your mother-in-law is probably coming from a good place.",
      "content": "Your mother-in-law is probably coming from a good place. When she oversteps her boundaries or seems a little pushy with the baby, it’s because she loves her kids and her grandkids so much. Be sure to sprinkle in a few things about how much you appreciate her, especially if she’s been helping take care of the new baby. [7] X Research source “We really appreciate you taking Debbie in the afternoons so that we can rest. It’s been a huge help.” “This isn’t to say we don’t appreciate you, because we do! We couldn’t have done all this without you.”"
    },
    {
      "title": "Draw attention to her good deeds in the moment so she knows what's helping.",
      "content": "Draw attention to her good deeds in the moment so she knows what's helping. Maybe she brings you food when you’re too busy to cook, or helps you clean up without judgement. You can call them out as she does them to encourage her to keep going. [8] X Research source “I love it when you drop off a casserole or some breakfast for us. It’s saved us more than once!” “Thank you so much for always being willing to babysit. We really need the rest, and we couldn’t get that without you.”"
    },
    {
      "title": "If she’s hurt or offended, she might want some time to herself.",
      "content": "If she’s hurt or offended, she might want some time to herself. Give her some space, and don’t worry if she takes a couple of days to recuperate from your conversation. Encourage your spouse to reach out to her so she knows she’s welcome in your home, even if you needed some things to be changed. Your partner could say something like, “Mom, I really appreciate you having a conversation with us the other day. You were very thoughtful, and I want you to know you’re still welcome over to help out with the baby.”"
    },
    {
      "title": "Your MIL is from a different generation.",
      "content": "Your MIL is from a different generation. She’s probably not doing aggravating things on purpose; rather, she wants to help you and your partner any way she can. As you chat with your mother-in-law about boundaries, remember that she’s coming from a good place, even if it might not always seem like it. [9] X Research source"
    },
    {
      "title": "Your MIL might still overstep sometimes, and that’s okay.",
      "content": "Your MIL might still overstep sometimes, and that’s okay. You won’t be able to correct all of her behaviors, so you should only talk to her about the ones that are affecting you and your baby the most. Otherwise, you might be a little too nitpicky, and your relationship with your mother-in-law could suffer. [10] X Research source For instance, if she keeps feeding your baby juice but you don’t want them to have all that sugar, it’s probably worth talking to her about. But if you like to let your baby fall asleep in the crib and she wants to cuddle them to sleep, you might want to let that one go."
    }
  ]
}