{
  "url": "https://www.wikihow.com/Blorbo-Meaning",
  "title": "What Does “Blorbo” and “Blorbo from My Shows” Mean?",
  "steps": [
    {
      "title": "“Blorbo” refers to your favorite character from a show or fandom.",
      "content": "“Blorbo” refers to your favorite character from a show or fandom. “Blorbo” and “Blorbo from my shows” is a Tumblr-based term that describes a character you find endearing and almost always think about. For instance, you might make Tumblr posts about your Blorbo or tag your Blorbo in other people’s posts that remind you of the character. [1] X Research source “Every song I listen to reminds me of my Blorbo Loki.” “I’m so worried about the Blorbo from my shows! Idk what’s going to happen to Ahsoka in season 2!” A Blorbo can also be a celebrity, like your favorite member of BTS. It’s common to see “Blorbo” on other social media sites like Reddit."
    },
    {
      "title": "“Blorbo” can be used to poke fun at fandoms.",
      "content": "“Blorbo” can be used to poke fun at fandoms. “Blorbo” and “Blorbo from my shows” are popular meme phrases on Tumblr that playfully mock how fandom members constantly reference their favorite characters. There are so many characters and fandoms online, so this nonsense word acts as a catch-all for characters that people don’t know or don’t care about. “I see people saying ‘I love this character’ but all I see is ‘Blorbo from my shows.’” “I checked my tags to see who everyone is crying about and it’s just Blorbo.”"
    },
    {
      "title": "“Blorbo from my shows” comes from a 2021 Tumblr post.",
      "content": "“Blorbo from my shows” comes from a 2021 Tumblr post. On December 24, 2021, Tumblr user thelustiestargonianmaid wrote the post “B*tches will be like ‘prev tags omg’ on my post and I check the preg tags and it's like ‘blorbo from my shows.’” Their post pokes fun at the fact that fandom members often make unrelated posts all about their favorite characters. [2] X Research source As an example of what Tumblr user thelustiestargonianmaid is talking about, someone might make a text post recounting how they tripped and fell in front of their crush. People in fandoms, such as Supernatural, might find the post and tag it with comments like, “This is Sam Winchester coded.”"
    },
    {
      "title": "“Fave,” “Skrunkly,” and “Scrimblo” also refer to characters you love.",
      "content": "“Fave,” “Skrunkly,” and “Scrimblo” also refer to characters you love. If you love a certain character, you might call them your “Fave” or “Favorite.” Lots of people also refer to their beloved character as “Skrunkly,” “Scrimblo,” or “Scrunglo,” which are endearing terms that mean “Cute.” [3] X Research source “Poor little meow meow” is another similar term that specifically describes a favorite character who is problematic, flawed, pathetic, or evil. [4] X Research source"
    },
    {
      "title": "“Scrimblo Bimblo” refers to an obscure video game character.",
      "content": "“Scrimblo Bimblo” refers to an obscure video game character. In 2021, X/Twitter user NemmyArty poked fun at Super Smash Bros. fans for wanting an obscure character to be added to the game by referring to them as “Scrimblo Bimblo.” Like “Blorbo from my shows,” “Scrimblo Bimblo” describes a well-loved character that’s underappreciated or unknown to most other people. [5] X Research source “Scrimblo Bimblo” doesn’t have to refer to a video game character and can describe any fictional character or celebrity."
    },
    {
      "title": "“Glup Shitto” refers to an unknown Star Wars character.",
      "content": "“Glup Shitto” refers to an unknown Star Wars character. In 2020, Tumblr user gomjabbar joked how Star Wars fans go wild when obscure characters return to the franchise, nicknaming these less mainstream characters “Glup Shitto.” So, “Glup Shitto” is similar to “Blorbo from my shows” in that it describes a beloved character no one else knows. [6] X Research source While “Glup Shitto” was coined to make fun of Star Wars names, it can refer to a fictional character or real person from any media. Lots of memes combine “Glup Shitto” and “Blorbo.” For instance, you can say “Glup Shitto is my Blorbo” or “Blorbo from my shows is finally getting along with Glup Shitto.”"
    },
    {
      "title": "“Eeby deeby” refers to an unknown or made-up location.",
      "content": "“Eeby deeby” refers to an unknown or made-up location. This nonsense word comes from a picture of an elevator taking the rider up to “Eeby deeby” instead of a specific floor number. “Eeby deeby” exploded at the same time “Blorbo”, “Scrimblo Bimblo,” and “Glup Shitto” did, so Tumblr users often group the memes together. [7] X Research source For instance, you might say “Blorbo from my shows is finally going to Eeby deeby with Glup Shitto” or “Scrimblo Bimblo got sent to Eeby deeby so Blorbo and Glup Shitto are rescuing them.”"
    }
  ]
}