{
  "url": "https://www.wikihow.com/Humming-Noise-While-Driving",
  "title": "Why Your Vehicle Hums While Driving & How to Repair It",
  "steps": [
    {
      "title": "",
      "content": "Wheel bearings normally support your vehicle’s weight and help your wheels rotate freely without friction. When they get old or faulty, bad wheel bearings sound like a loud hum, rumble, or growling noise while you’re driving straight. [1] X Research source If you’re dealing with a bad bearing, the noise will drastically change pitch when you move the steering wheel from side to side. Other symptoms may include the steering wheel vibrating or pulling in one direction, uneven tire wear, or grinding noises while you’re accelerating. [2] X Research source The Fix: Remove and replace the bad wheel bearing. Because you have to remove the wheel and rotor, leave the repairs to a professional mechanic. Cost: Wheel bearing replacements typically cost around $350 USD per wheel, but may cost more for luxury-brand vehicles. If you do not fix a bad wheel bearing, then it could lead to uneven tire wear, damaged suspension, or potentially the wheel falling off."
    },
    {
      "title": "",
      "content": "When the treads on one tire wear down faster than others (also known as tire cupping), the low spots could create a hum or vibration every time you drive. The noise primarily comes from one side of your vehicle when only one of your tires is worn, but it may be louder if multiple tires have uneven wear. Check the treads on your tires by inserting a penny between them. If you easily see the hair on top of Lincoln’s head, then it means your tires have worn down. [3] X Research source The Fix: Replace any worn or damaged tires with new ones that have proper tread depth. Be sure to rotate your tires every 6 months to keep wear patterns even. Cost: Tire prices vary, but they’ll typically be between $50–150 USD for the cheapest options. Check the air pressure in your tires and fill them to the correct measurement. Lower air pressure may also cause one of your tires to make a humming noise. Leaving uneven tires on your vehicle may cause your tires to skid when you try to stop and increase your fuel consumption."
    },
    {
      "title": "",
      "content": "Your vehicle’s transmission attaches to your engine and allows you to switch gears. If your transmission system is acting up or if there are low fluid levels, then the gears work harder than usual and create a higher-pitched hum or whine. [4] X Research source Other signs of a bad transmission include slipping gears, difficulty shifting, or your vehicle shaking. [5] X Research source The Fix: Add transmission fluid to your engine. Look for the reservoir at the front or back of your engine, and add fluid up to the fill line. If the transmission fluid is already at the correct level, then take it to a mechanic to diagnose the problem. Cost: Transmission fluid costs around $20 USD for a 1 gallon (3.8 L). Prices on more involved transmission repairs could range anywhere from $300 USD for minor fixes or $3,000+ USD for full replacements. Have your vehicle fixed as soon as you suspect transmission problems because they could make your engine stall while you’re driving."
    },
    {
      "title": "",
      "content": "The differential connects to your wheels so they’re able to rotate at different speeds while you’re making a turn. As the differential starts to wear down, it could cause vibrations that make a loud hum from under your vehicle when you’re driving. You may also notice louder clunking or grinding noises as you’re making turns if the differential isn’t properly lubricated. [6] X Research source The Fix: Locate the rectangular differential under your vehicle where the axle connects to the center drive train. Check the differential’s fluid using the circular service port and fill it if the level is low. Otherwise, have a mechanic replace the differential completely. [7] X Research source Cost: A bottle of differential fluid typically costs around $25 USD. A new differential can cost up to $5,000 USD."
    },
    {
      "title": "",
      "content": "The alternator belt, or serpentine belt, runs around multiple components under your vehicle’s hood, like the engine, alternator, air pump, and AC compressor. When the belt gets old, cracked, or damaged, it may slip off the pulleys holding it in place. [8] X Research source Alternator belts may also make a high-pitched chirping sound instead of a loud hum. The Fix: Replace the belt or any misaligned pulleys along the track. Because the alternator belt is involved in multiple components, it’s best to leave the work to a professional mechanic. Cost: Typically, it costs around $100–200 USD to replace an alternator belt. If the alternator belt snaps or slips off, then components in your vehicle like the power steering, AC, and alternator will stop working immediately."
    },
    {
      "title": "",
      "content": "If exhaust escapes somewhere along the length of the pipe, then it could create vibrations that make a humming noise while you’re driving. You may notice the hum or rattle any time you press on the gas, and it may get louder as you accelerate and put more exhaust through the system. Alternatively, a loose pipe could bump against other components on your vehicle to make the sound. [9] X Research source The Fix: Patch the exhaust leak by wrapping the area with exhaust tape or epoxy . If there’s severe damage, then hire a mechanic to replace your exhaust system. Cost: Exhaust tape or epoxy patches usually cost $10 USD or less. Repairing or replacing an exhaust pipe may cost around $150–350 USD at a mechanic. Leaking exhaust increases your fuel consumption, causes engine misfires, and may produce a rotten egg smell."
    },
    {
      "title": "",
      "content": "CV (constant velocity) and universal joints are attached to the drive shaft under your vehicle to transfer power from your vehicle’s transmission to the wheels. As the joints wear down and lose lubrication, they start to vibrate and create a loud humming sound while you’re driving. You may also notice your vehicle makes noises while you’re turning , which are signs the joints are starting to go. [10] X Research source The Fix: Have a mechanic replace any broken CV or universal joints on your vehicle. Stick to having a professional do the work because it can be a bit complex if you don’t have automotive experience. Cost: Universal joint replacements cost around $350–425 USD, but CV joints may be upwards of $1,100 USD. If you don’t replace or fix the joints, then your vehicle may have difficulty accelerating."
    },
    {
      "title": "",
      "content": "When you hear a loud hum any time you run your vehicle’s air conditioning, then there may be an issue with the blower motor found under your glove box. There may be a piece of debris inside of the blower motor causing the vibration, or it may be faulty and need repairs. [11] X Research source If there’s a bad belt on your AC system, it may also make a squeaking or chirping noise. The Fix: Remove the panel underneath your glove box to access the blower motor, which looks like a cylindrical fan attached to a square base. Take any debris out from the motor and reattach it. If the noise persists, visit a mechanic to replace the blower motor or fix an internal belt. Cost: AC belts usually cost $50–125 USD, and full replacements for blower motors typically cost $150–350 USD."
    },
    {
      "title": "",
      "content": "Low oil levels mean your engine and other parts of your transmission aren’t lubricated properly, so they may make noise. If you’re running low on oil, your vehicle may also produce a light tapping or pinging noise while you’re driving. Other symptoms of low oil may be an indicator light on your dashboard, a burning smell while driving, and lower fuel efficiency. [12] X Research source The Fix: Check the oil level in your vehicle using the dipstick next to your engine. If the level is low, add oil up to the max fill line. If the oil looks dark or cloudy, then perform an oil change instead. Cost: Motor oil usually costs around $20 USD for a 5 US qt (4.7 L) bottle. Having an oil change done by a professional typically costs around $50 USD. If you let your oil levels drop or leave old oil in your system, then it could stress your engine or transmission system and cause more severe damage."
    },
    {
      "title": "",
      "content": "Power steering fluid sits inside your steering system so it’s easier to turn your wheels without a lot of effort. When the fluid gets too low, the pump in your steering system starts pulling in air and causes a whirring or humming sound coming from the front of your vehicle. [13] X Research source The Fix: Look for the power steering reservoir near the front of your engine bay, and check the fluid levels. If it’s below the fill line, add more fluid to the reservoir. Cost: Power steering fluid typically costs around $10 USD for a 1 US qt (0.95 L) bottle. Running your vehicle with low power steering fluid could damage the pump and make it more difficult to turn your vehicle."
    },
    {
      "title": "",
      "content": "The fan clutch helps control the airflow between your radiator and engine to prevent it from overheating. When the fan clutch goes bad or has a broken bearing inside, it can create a vibrating noise that gets louder as you rev your engine. You may also test the fan clutch to check if the fan rocks back and forth or if it doesn’t speed up as you accelerate, which are both signs that it’s faulty. [14] X Research source The Fix: Have a professional remove and replace the old fan clutch with a model that works properly. [15] X Research source Cost: Replacement fan clutches usually cost around $300–500 USD. If you leave a bad fan clutch in your vehicle, it could cause your engine to overheat and stall."
    }
  ]
}