{
  "url": "https://www.wikihow.com/Grand-Cross-Astrology",
  "title": "What Does the Grand Cross Mean in Astrology? Fixed, Cardinal, & Mutable",
  "steps": [
    {
      "title": "A grand cross is formed by 4 squared planets.",
      "content": "A grand cross is formed by 4 squared planets. A grand cross, or grand square, is made up of two aspects , the square and the opposition. The square is formed when planets are each spaced 90º away from the other. Each planet is also in “opposition” to (directly across from) another. Oppositions are known as “hard” aspects . When planets are directly across from each other, the angle between them is at its most severe, 180º. [1] X Research source That can put a lot of pressure on a planet! This can manifest itself as an “opposites attract” situation, or as a battle between two sides. Squares are also hard aspects. Planets that are squared from each other are like cars at a stop sign that both think they have the right of way. [2] X Research source If they’re not meeting in the middle to balance each other, they’re fighting for dominance in a situation. Grand crosses can be made up of any astrological body or position—so your sun, moon, planets, ascendant, and nodes can all make up the pattern."
    },
    {
      "title": "Grand crosses are rare and challenging patterns.",
      "content": "Grand crosses are rare and challenging patterns. The grand square is like a table—to keep it from wobbling it has to be perfectly balanced on each leg. If you have this pattern you may feel boxed in, but a challenge isn’t good or bad—it’s just a challenge. When you work to balance a grand square, you may find yourself on a strong foundation instead of in a box."
    },
    {
      "title": "There are three grand squares, one for each modality.",
      "content": "There are three grand squares, one for each modality. Each astrological sign is categorized by a modality , or type: cardinal, fixed, or mutable. Modalities represent the vibe a sign is bringing to the table: fixed signs are steady and persistent, cardinal signs are energetic and ambitious, and mutable signs are adaptable and resourceful. [3] X Research source Each modality characterizes the energy that the grand square exemplifies in your life. Because the cross is made up of an entire modality, each grand cross has one of each element: fire, earth, air, and water."
    },
    {
      "title": "Grand crosses look like plus signs on a natal chart.",
      "content": "Grand crosses look like plus signs on a natal chart. The easiest way to tell if you have a grand square is to create an astrological chart with aspects. The aspects form a big plus sign in the center of your chart if you have a grand cross. You might also see lines connecting each of the squared planets."
    },
    {
      "title": "Having a fixed grand cross can make it feel difficult to move forward.",
      "content": "Having a fixed grand cross can make it feel difficult to move forward. You can feel like you’re stuck in the past, stuck in a routine, or stuck in a habit with no way to change it. [4] X Research source But this “weakness” can be your strength. When you have a fixed grand cross in your chart, that’s a message that you have the ability to stick to the healthy routines that allow you to flourish. Fixed grand crosses are made up of the fixed signs: Leo, Aquarius, Scorpio, and Taurus . To change a routine , replace it with another. If you’re drinking too much coffee, for example, swap it for a different routine, like a morning walk. After a couple of weeks of determination, it’ll become second nature to you."
    },
    {
      "title": "The first opposition in this pattern is Leo/Aquarius.",
      "content": "The first opposition in this pattern is Leo/Aquarius. Leo is a sign that’s all about individuality. It says: “You’re you because you’re special.” Having Aquarius in your chart, however, can make you feel a need to fit in with society. Unbalanced, this aspect can make you feel alienated from those around you or defined by something you can’t change. When it’s balanced, you understand that you’re both unique and share a common humanity with everyone else. To balance this aspect, use your talents to find your niche in your community. Are you a great singer? Join a choir. A pro woodworker? Teach a class at a rec center."
    },
    {
      "title": "The second opposition is Taurus/Scorpio.",
      "content": "The second opposition is Taurus/Scorpio. Taurus can ground a chart and bring a down-to-earth attitude with it, but it can also bog you down in the concrete nature of the world. Scorpio, on the other hand, can get you thinking a little too much about the patterns and signs you might be picking up, but also gives you a healthy imagination. To balance these signs, use your get-it-done Taurus nature to support your abstract Scorpio ideas. Have you come up with a new life philosophy? Read theory that can further your understanding. Have an idea that could revolutionize architecture? Start taking classes and building models."
    },
    {
      "title": "All the signs send antiscion to each other.",
      "content": "All the signs send antiscion to each other. This cross has a special aspect called “antiscion” which none of the others have. Signs send antiscion to each other when their seasons are equidistant to the solstice, aka the beginning of Cancer and Capricorn season. The signs in a fixed grand cross are more tightly bound (and therefore more supportive) to each other. [5] X Research source For example, because the summer solstice starts at the beginning of Cancer season, Cancer and Gemini send antiscion to each other. Only the fixed signs send antiscion to each other. Cardinal signs connect with mutable signs and vice versa."
    },
    {
      "title": "This grand cross is the sturdiest of the three.",
      "content": "This grand cross is the sturdiest of the three. When all of the planets are balanced together, this grand square offers you incredibly strong support. It allows you to live comfortably within yourself and society through a rich understanding of the world around you."
    },
    {
      "title": "A fixed grand cross can be a sign to practice flexibility.",
      "content": "A fixed grand cross can be a sign to practice flexibility. Your birth chart isn’t a life sentence—it’s a tool to understand what aspects of yourself require attention at what time. When you have a fixed grand cross in your birth chart, look at each planet and ask yourself these questions: “What are my routines?” “Are there any habits I want to change?” “Where can I take risks?”"
    },
    {
      "title": "The mutable cross is all about information and change.",
      "content": "The mutable cross is all about information and change. Mutable grand crosses are the most flexible of the three, so they can make it difficult to make decisions and stick with things. [6] X Research source You might find yourself fighting a push and pull of ideas if you have this grand square, but when balanced it gives you a nuanced perspective. The mutable grand cross is made up of Gemini, Virgo, Sagittarius, and Pisces ."
    },
    {
      "title": "The first set of oppositions is Sagittarius/Gemini.",
      "content": "The first set of oppositions is Sagittarius/Gemini. Gemini and Sagittarius are both known for loving information, but from different places. Gemini is associated with the physical, and Sagittarius takes the metaphysical. [7] X Research source The opposition can cause a face-off between a need for truth and a faith-based understanding of the world. To balance these signs, integrate your thoughts on the physical and metaphysical. If you go to a worship area like a church or temple, think about the physical parts of the religious experience. Why do they use incense? Where does your mind go when you’re there? Balancing this aspect gives you the ability to seek and find the truth in all realms of life."
    },
    {
      "title": "The second opposition is between Virgo and Pisces.",
      "content": "The second opposition is between Virgo and Pisces. If the other signs were collecting information, Virgo and Pisces are ruminating on it. Virgo, as a sign, categorizes and separates information to make sense of it. Pisces, on the other hand, is a big-picture thinker only. [8] X Research source To balance Virgo and Pisces, you have to see the forest and the trees. When you’re stuck on a problem, work on pieces of it individually, then take a step back to look at your larger goals. When this balanced opposition is put in conjunction with Sagittarius and Gemini, information can be gathered that takes into account physicality, affect, individuality, and wholeness."
    },
    {
      "title": "A mutable grand cross can be a sign to take a firmer stance in your life.",
      "content": "A mutable grand cross can be a sign to take a firmer stance in your life. A balanced mutable grand square is able to take in all aspects of information in a situation before coming to a decision. But that’s the trick: when you see all the sides, it’s much harder to make a choice. To balance a mutable grand cross, meditate on the following: “What am I passionate about?” “What are my core beliefs?” “What kind of information do I base my decisions on?”"
    },
    {
      "title": "Cardinal crosses represent powerful inciting energy.",
      "content": "Cardinal crosses represent powerful inciting energy. However, they don't necessarily have the energy to carry something to fruition. Each sign in this square starts off a solstice or equinox, so they’ve got the ability to shake things up. However, if you have a cardinal grand cross you might find yourself pulled in many competing directions since each sign is so powerful. [9] X Research source The signs of the cardinal grand cross are Aries, Cancer, Libra, and Capricorn ."
    },
    {
      "title": "The first opposition is between Aries and Libra.",
      "content": "The first opposition is between Aries and Libra. Aries is a fast actor—it starts the zodiac cycle and has a fiery attitude that can make it shoot two steps forward and one step back. Aries is extreme, while Libra, its opposition, is all about balance. Libra sits between the extremes and tries to compromise so it can adjust to any situation. [10] X Research source To balance this aspect, practice taking leadership positions in your life. Use the speed of Aries to drive your project, and your compromising Libra attitude to incorporate everyone’s skills."
    },
    {
      "title": "The second opposition is between Cancer and Capricorn.",
      "content": "The second opposition is between Cancer and Capricorn. Cancer represents your emotional base: how you nurture yourself, how you give and receive love, and how you relate to your inner passions. Capricorn, on the other hand, represents the structure of society within a specific culture. [11] X Research source Capricorn wants to prove themselves in society, and Cancer wants to be internally in touch. To balance Capricorn and Cancer, look for communities you can be vulnerable in. Join local groups where you can share creative projects or work with other people, like in acting troupes and writing circles."
    },
    {
      "title": "When this chart is balanced it’s incredibly powerful.",
      "content": "When this chart is balanced it’s incredibly powerful. Out of all the grand squares, the cardinal has the most drive. When the oppositions and squares work together, you can be in touch with the underlying emotional and structural currents in your society, and can act on them while still taking into account how to balance your desires with other people’s. To balance a cardinal grand cross, ask yourself these questions: “How do I nurture myself?” “How do I relate to other people?” “What projects do I want to follow through on?”"
    }
  ]
}