{
  "url": "https://www.wikihow.com/Replace-Brake-Rotors",
  "title": "An Expert-Approved Guide to Replacing Brake Rotors Like a Pro",
  "steps": [
    {
      "title": "Put on protective gloves.",
      "content": "Put on protective gloves. Before performing any work on your vehicle, as you're gathering all the tools you'll need, it's a wise idea to find a pair of sturdy work gloves. Vehicle maintenance can be a messy job, so you'll want to protect you hands from grease and grime before working on the vehicle. These gloves can also protect your hands in the event of an accident."
    },
    {
      "title": "Raise the vehicle with a lift or jack on solid level ground.",
      "content": "Raise the vehicle with a lift or jack on solid level ground. Loosen the lug nuts a little before lifting a wheel, if using a jack (the ground holds the wheels from turning while using your lug wrench). Block the other wheels to prevent the vehicle from rolling when lifting only one wheel, or only one end of the car, at a time. You may need to release the parking brake for the wheels you are servicing. Using hand tools and a hand-operated jack(s) works fine, but using a power impact wrench and/or a hydraulic car lift such as professionals use is easier. See wikiHow's guide on how to change a tire for more information on lifting a vehicle with a jack. Jack only against a thick and sturdy metal part of the vehicle's undercarriage (if the jack presses into thin metal or a plastic molding, it could punch through, warp/bend or crack such surfaces). Caution: Support the vehicle on heavy duty jack stands after lifted in case a jack were to slip (a hydraulic bottle jack or floor jack might lose pressure and lower unexpectedly). A scissor/accordion jack might bend or break under stress. Danger: A jack or jack stand can amazingly easily be leaned over by pushing (including by hand) on the vehicle, and it can easily fall. You could move a car sideways on purpose by jacking up on side of the car with bottle jacks and pushing until the jacks lean and fall over."
    },
    {
      "title": "Remove the vehicle's wheel.",
      "content": "Remove the vehicle's wheel. The components of the brake, including the rotor, are mounted behind the wheel itself, so, to access them, the wheel must be removed. To do so, simply unscrew the lug nuts and pull/lift the wheel off, exposing the hub, rotor, and calipers. To keep track of the lug nuts (and later, other important nuts and bolts), many mechanics like to remove the vehicle's wheel cover/hub cap and use it as a sort of \"dish\" to contain these small parts. But be careful not to damage the hub cap on the ground."
    },
    {
      "title": "Remove the calipers.",
      "content": "Remove the calipers. The brake calipers are usually held in place by one or two bolts that are threaded in from the rear of the caliper. To reach these bolts, you'll probably need a ratchet with an extension. The bolts may have standard hex heads, or they may be Allen-head/hex-key type bolts. After the bolts and any spring clips holding the caliper in place have been removed, take the caliper off and hang it out of your way with cord or wire, taking care not to put tension on the brake hose. You may need to wedge and pry with a screwdriver or tap with a wood block and hammer to dislodge and remove the caliper from the rotor and caliper bracket. Note that if you remove the caliper from the brake line, the brakes will begin to leak fluid out and get air in the lines, and will need to be bled after the repairs to remove the air."
    },
    {
      "title": "If necessary, loosen and remove the caliper mounting bracket bolts.",
      "content": "If necessary, loosen and remove the caliper mounting bracket bolts. In some vehicles, the brackets that the caliper was secured to can prevent removal of the rotor. If so, use a wrench or ratchet to unscrew this bracket's bolts and remove them. Then, remove the bracket itself. These bolts may have a thread lock cement on them and come out hard."
    },
    {
      "title": "Remove the brake rotor.",
      "content": "Remove the brake rotor. Sometimes, this can be as simple as merely pulling it off. However, if the rotor hasn't been replaced in a long time, it may be stuck by corrosion, dirt and rust to the wheel hub and be difficult to remove. You may need to tap it with a hammer and a wooden block to loosen it. Holding a block of wood against the rotor and hitting the wood, do not strike the rotor directly. Penetrating oil is helpful for loosening the corrosion and rust Also, some wheels will have rotor and hub assemblies where the axle bearing retaining nut and grease-packed bearings must be removed. These are in the center of the hub or knuckle on the axle or spindle. You may, for example, need to remove a metal dust cap, cotter pin or un-clinch a keyed flange and/or castle nut, and bearing to allow the rotor to be removed. Be careful to not get dirt in the bearing. After the rotor is removed, clean the hub surface of any corrosion or debris so the new rotor can sit flush on the hub surface."
    },
    {
      "title": "Inspect grease seals and bearings, if your vehicle has a rotor with a grease packed bearing in the hub assembly, since removing the hub will likely damage the grease seal, and replacing the wheel bearings including bearing races can be insurance against a potential failure later.",
      "content": "Inspect grease seals and bearings, if your vehicle has a rotor with a grease packed bearing in the hub assembly, since removing the hub will likely damage the grease seal, and replacing the wheel bearings including bearing races can be insurance against a potential failure later."
    },
    {
      "title": "Clean off oil or protective coatings from the rotor.",
      "content": "Clean off oil or protective coatings from the rotor. Use a special brake cleaner solvent and a clean dry cloth to wipe any type of residue off the new rotor. Oil, bearing grease, improper solvents or coatings may damage or impair the performance of the brake pads. Do not use or clean dirty brake pads if they are oily or greasy -- they must be replaced."
    },
    {
      "title": "Place the replacement rotor over the wheel studs.",
      "content": "Place the replacement rotor over the wheel studs. Put your new rotor on over the wheel hub. You'll need to thread the wheel studs through the corresponding holes on the rotor. Push the rotor back into its place around the wheel hub. At this point, depending on the exact construction of your wheel, you should replace the castle nut and/or cotter pin on the hub assembly. If you bent the previous cotter pin to remove it, you may need to replace it with a new one — these are very cheap."
    },
    {
      "title": "As necessary, replace the caliper mounting brackets, if you previously removed them.",
      "content": "As necessary, replace the caliper mounting brackets, if you previously removed them. If you disassembled your vehicle's caliper mounting brackets to access the rotor, you'll need to replace them now. Re-align the brackets and secure them in place with the bolts you originally unscrewed. The bolts should have a thread locker put on them if was used in an earlier installation."
    },
    {
      "title": "Use a C-clamp or caliper compressor to compress some caliper pistons.",
      "content": "Use a C-clamp or caliper compressor to compress some caliper pistons. Caution: Some caliper pistons actually screw in and this kind have grooves and notches in their top face to do so. Next, the caliper with pads and spring clips must be put back in its proper spot over the rotor. Unhook or untie the caliper from its out-of-the-way location, then carefully compress the caliper pistons with a C-clamp or a specialized tool called a caliper compressor. When the pistons are completely compressed, the caliper should fit over the rotor. Note that many vehicles may require the bleeder valves to be opened slightly to allow the pistons to compress back into the calipers since forcing brake fluid back through the lines can damage internal check valves or antilock brake mechanisms."
    },
    {
      "title": "Re-install the caliper.",
      "content": "Re-install the caliper. Ensure the caliper slides are cleaned and lubed with caliper slide grease and has suitable brake pads, then place the caliper over the rotor in the position you originally found it in. Line up the bolt holes and reinstall the bolts you removed to take the caliper off of the rotor."
    },
    {
      "title": "Install the vehicle's wheels.",
      "content": "Install the vehicle's wheels. Congratulations, you're nearly done. All that's left is to reinstall the wheel and lower the vehicle to the ground. Carefully lift the wheel back into its original place over the lug bolts. Screw the lug nuts back on over the wheel bolts. Slowly and carefully lower the vehicle to the ground. If you're using a jack, remove it from under the vehicle and put it away. Don't forget to give the lug nuts an extra tightening when the wheel is on the ground. Refill the brake fluid then pump up the brakes using quarter strokes to keep from bottoming out the master cylinder shaft till the brakes are hard. Recheck fluid level and top off as needed. Bleed the brakes if any of the brake lines were opened."
    },
    {
      "title": "Test the rotor before driving.",
      "content": "Test the rotor before driving. It's a wise idea to ensure the new rotor is working properly before driving away. In a safe location, start the vehicle and allow it to roll forward. Pump the brakes a few times. Push down on the brake pedal and let it rise slowly. The brakes should function properly, with no loud squeaking or vibrations — the former is a sign of worn-out brake pads and the latter of a warped rotor. Do a normal road test and brakes should stop normally without any noises or pulsations."
    },
    {
      "title": "Remove brake pads from the caliper after disconnecting it from the rotor.",
      "content": "Remove brake pads from the caliper after disconnecting it from the rotor. If you're not pressed for time, while you're replacing your rotor, you may want to complete some optional brake maintenance. This saves you the time and effort of having to repeat the process of lifting the vehicle, removing the wheel, etc. later. To check the condition of your brake pads, look for a small notch or groove — when this notch is worn down so that the face of the pad is smooth, it's time to replace your pads. To remove your old pads, simply slide them out of the caliper. Note that some types of brake calipers hold the pads in place with a small retaining pin or spring, which will need to be removed before removing the pads themselves."
    },
    {
      "title": "Remove the caliper slide pins.",
      "content": "Remove the caliper slide pins. The slide pins, which sit on the outer edges of the caliper, regulate the movement of the caliper. For smooth, proper brake functioning, it's important to ensure these pins are well-lubricated. Remove the slide pins with a properly-sized ratchet or wrench. You may also need to remove a rubber boot on the slide pin to be able to remove the pin from the caliper. Keep track of these pins — they will soon need to be cleaned and lubricated."
    },
    {
      "title": "Lubricate the backs of the replacement brake pads.",
      "content": "Lubricate the backs of the replacement brake pads. To help prevent the common brake problems of noise and vibration during braking, use a film of sealant often provided with new pads on the pads before installing them. Though it may be obvious, it's important to be clear here — only lubricate the back, not the front of the brake pads. Use only lubricants made especially for brake parts — other lubricants can degrade over time or damage the brakes."
    },
    {
      "title": "Place the replacement brake pads into the caliper mounting bracket.",
      "content": "Place the replacement brake pads into the caliper mounting bracket. Install the new brake pads in the caliper. They should easily slide in, though, if your original brake pads were held in place with a retaining pin, you'll need to replace this at this point. Be sure to wipe away any excess lubricant from the pads."
    },
    {
      "title": "Clean and lubricate the slide pins.",
      "content": "Clean and lubricate the slide pins. Over time, the caliper slide pins can accumulate dust and grime, preventing them from sliding easily. Clean the slide pins with a fresh rag, clearing away any debris, and lubricate them with a silicone-based brake lubricant."
    },
    {
      "title": "Lubricate the sliding plates for the brake pads.",
      "content": "Lubricate the sliding plates for the brake pads. Finally, apply some lubricant to the brake pad plates. This will help them to move easily and decrease noise during braking. Your brake maintenance is complete — your brakes should now function like a \"well-oiled machine.\" You may now proceed to replace your rotor or reinstall the wheel."
    }
  ]
}