{
  "url": "https://www.wikihow.com/Clean-Chocolate-from-a-Carpet",
  "title": "How to Clean Chocolate from a Carpet",
  "steps": [
    {
      "title": "Act quickly.",
      "content": "Act quickly. Take action as soon as possible after the chocolate has been rubbed into the carpet. As with most stains , the longer you leave it, the tougher it will be to remove."
    },
    {
      "title": "Remove excess chocolate.",
      "content": "Remove excess chocolate. You can use a paper towel to blot excess chocolate, or scrape it gently with a dull knife. [1] X Research source If you choose to use a knife, place the removed chocolate onto a paper towel. Wipe the knife frequently to avoid smearing or grinding in the chocolate. If the chocolate is soft, chill it with an ice cube or frozen package to make it easier to chip out with the knife."
    },
    {
      "title": "Check the carpet type.",
      "content": "Check the carpet type. Different carpets react to stain removal techniques in different ways. Using the wrong removal method could cause the stain to become permanent or leave a worse mark than the stain itself. Determine if your carpet is made of natural or synthetic fiber, as this will affect the types of liquid cleaners that are safe to use. If you're in any doubt about your carpet's suitability, contact a professional carpet cleaner."
    },
    {
      "title": "Do a patch test.",
      "content": "Do a patch test. Before trying out any cleaning solutions, test a small amount on a patch of carpet. Wait 20 minutes to ensure the product will not damage your carpet. If your carpet starts to turn brown or lighter in color, immediately rinse the solution with cold water. Stop and call a professional."
    },
    {
      "title": "Put on a pair of rubber gloves.",
      "content": "Put on a pair of rubber gloves. These will protect your hands from the chemicals in the cleaning solutions. You may also want to put on an old t-shirt just in case any other cleaning solutions splashes onto your clothing."
    },
    {
      "title": "Make a detergent solution.",
      "content": "Make a detergent solution. Combine 0.25 tsp (1.2 mL) translucent liquid dishwashing detergent, like Joy or Dawn, with 8 fl oz (240 mL) of lukewarm water. [2] X Research source"
    },
    {
      "title": "Apply the detergent solution.",
      "content": "Apply the detergent solution. Dip a white cloth or paper towel into the detergent solution and blot the stain. Then, press the cloth or paper towel into the stain for several seconds. Wait for 15 minutes as the detergent dissolves the stain, then use a clean, dry white cloth or paper towel to remove excess liquid. Remember to perform a patch test before applying the detergent. You may need to repeat this application a few times for it to be effective."
    },
    {
      "title": "Follow up with a vinegar solution.",
      "content": "Follow up with a vinegar solution. To make a vinegar solution, combine 8 fl oz (240 mL) of white vinegar with 16 fl oz (470 mL) of water. Dip a white cloth or paper towel into the vinegar solution and blot the stain. Then, press the cloth or paper towel into the stain for several seconds. Wait for 15 minutes, then blot the area with lukewarm water to rinse. Allow the area to dry. This step is important in removing residual detergent from your carpet. That way, dirt won’t stick to the treated area. [3] X Research source"
    },
    {
      "title": "Use a heavy object to treat particularly bad stains.",
      "content": "Use a heavy object to treat particularly bad stains. If the stain is especially bad, you might need to apply extra pressure during the drying process. Cover the stain with a 0.5 in (1.3 cm) thick stack of white paper towels or a couple of clean, white rags and a place a heavy object, such as a glass baking dish, on top. Let it sit for 15 minutes. If the weight is coloured or porous, put a plastic bag between it and the paper towel. This will protect the weight and prevent dye from leaking into the carpet."
    },
    {
      "title": "Rinse the area.",
      "content": "Rinse the area. Using a damp paper towel or cloth, moisten the spot and blot. Allow the area to dry."
    },
    {
      "title": "Apply 3% hydrogen peroxide if the stain persists.",
      "content": "Apply 3% hydrogen peroxide if the stain persists. Detergent may not completely remove the stain. If this is the case, dampen the spot with 3% hydrogen peroxide and allow it to sit for 1 hour, then blot. Repeat this process until the stain is removed. Then, cover the stain with kitchen towel and a heavy object and allow the area to dry again. [4] X Research source If you cannot remove the stain, try the next method or consider calling a carpet cleaning company. Keep in mind that hydrogen peroxide can have a bleaching effect on carpets, so make sure to do a spot test on an inconspicuous part of the carpet before you do this. Wait 20 minutes after applying hydrogen peroxide to see the full effects."
    },
    {
      "title": "Blot the stain with cool water.",
      "content": "Blot the stain with cool water. Dampen a sponge with cool water and gently blot the stain several times. [5] X Research source"
    },
    {
      "title": "Make and apply a diluted carpet shampoo solution.",
      "content": "Make and apply a diluted carpet shampoo solution. To make your carpet shampoo solution, mix 1 part liquid carpet shampoo with 4 parts water. Apply the solution to the stain with a brush or a towel. [6] X Research source Again, remember to do a quick patch test to ensure the solution won’t damage your rug."
    },
    {
      "title": "Vacuum.",
      "content": "Vacuum. Allow the area to dry completely, then vacuum to remove the stain. If the stain persists, repeat steps 1-3. [7] X Research source If you cannot remove the stain, consider calling a carpet cleaning company."
    },
    {
      "title": "Make and apply a detergent solution.",
      "content": "Make and apply a detergent solution. Combine 1 tsp (4.9 mL) translucent liquid dishwashing detergent with one cup of lukewarm water. Spray the solution on the stain with spray bottle and blot with a white paper towel or cloth."
    },
    {
      "title": "Follow up with ammonia solution.",
      "content": "Follow up with ammonia solution. Combine one tablespoon of clear, white ammonia with 4 fl oz (120 mL) of lukewarm water. Spray the solution on the stain and blot with a white paper towel or cloth. Before starting, make sure that the room is well ventilated, so that you don't breathe in too much ammonia."
    },
    {
      "title": "Follow up with vinegar solution.",
      "content": "Follow up with vinegar solution. Make a vinegar solution by combining 2 fl oz (59 mL) of white vinegar with 2 fl oz (59 mL) of water. Spray the solution on the stain and blot with a dry, white paper towel or cloth."
    },
    {
      "title": "Re-apply the detergent solution.",
      "content": "Re-apply the detergent solution. Spray the solution on the stain and blot with a dry, white paper towel or cloth."
    },
    {
      "title": "Rinse the area.",
      "content": "Rinse the area. Spray lukewarm water on the stain and blot with a dry, white paper towel or cloth."
    },
    {
      "title": "Repeat.",
      "content": "Repeat. Continue steps 1-4 until the stain has disappeared."
    }
  ]
}