{
  "url": "https://www.wikihow.com/Google-Temporary-Hold",
  "title": "Everything You Need to Know About Google Temporary Holds",
  "steps": [
    {
      "title": "You may see a temporary hold when you add a new card to Google Pay.",
      "content": "You may see a temporary hold when you add a new card to Google Pay. When you add a new card to Google Pay, Google will initiate a small transaction (also called a pre-authorization charge) to that card to make sure it's valid. These transactions are usually $1 to $2, and the transactions are never fully completed—that is, Google essentially cancels the transaction before the money is removed from your account. The temporary hold is placed by your bank, and these holds usually go away after 48 hours. Once the hold falls off, it'll be removed from your card statement, and the money will be returned to your account total."
    },
    {
      "title": "When making a Google purchase, you may see this hold.",
      "content": "When making a Google purchase, you may see this hold. Similar to a pre-authorization charge from Google Pay, when you pay for a Google service (such as a Google Play Store purchase or YouTube Premium), use your Google Wallet , or use Google Chrome auto-fill, you may see a \"GOOGLE *TEMPORARY HOLD\" charge. [1] X Research source This hold also verifies that your card is valid and that you have the funds to complete the purchase. Once again, these holds are placed by your bank, and the hold will go away once the transaction has gone through. Even if you didn't pay Google for something, if you used a card you've saved to Google Chrome auto-fill ], you may see this temporary hold on your account."
    },
    {
      "title": "No, but temporary holds are not actually charging you money.",
      "content": "No, but temporary holds are not actually charging you money. It may appear that you are losing money when you see \"GOOGLE *TEMPORARY HOLD,\" but these holds are transactions that are never completed. The money is returned to your bank account once the hold goes away. If you are concerned about a temporary hold on your account, contact your bank for help. They may be able to remove the hold earlier than normal (which should be about 48 hours, but some cards place holds for up to 7 days). If you notice a Google charge on your account that you don't recall making, you can file a dispute with Google. You should also contact your bank for assistance with a fraudulent charge."
    }
  ]
}