{
  "url": "https://www.wikihow.com/Mac-Gaming-How-to-Show-Fps",
  "title": "Displaying Your Mac’s Frames Per Second (FPS)",
  "steps": [
    {
      "title": "Launch Steam.",
      "content": "Launch Steam. You'll find this program in your Applications folder in Finder. If you don't have the desktop app, you can download and install it for free from https://store.steampowered.com/about/ . You'll be able to use the In-game FPS counter in all your Steam games and maybe non-Steam games. You can add a game you purchased from somewhere else to your Steam library, and the FPS counter may or may not display. [1] X Research source"
    },
    {
      "title": "Click Steam.",
      "content": "Click Steam . You'll see this in the upper left corner of the application window. If a Steam program window is not open, you can right-click (or control-click) the Steam icon in the top menu bar."
    },
    {
      "title": "Click Preferences.",
      "content": "Click Preferences . You'll see this at the bottom of the menu."
    },
    {
      "title": "Click In-Game.",
      "content": "Click In-Game . You'll see this on the left side of the Preferences window."
    },
    {
      "title": "Click to select the drop-down under \"In-game FPS counter.",
      "content": "Click to select the drop-down under \"In-game FPS counter. \" You'll see this in the middle of the window."
    },
    {
      "title": "Click to select a location for the FPS.",
      "content": "Click to select a location for the FPS. You can choose to display the current FPS in the top left, top right, bottom left, or bottom right of your screen."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . The Preferences window will disappear."
    },
    {
      "title": "Restart Steam.",
      "content": "Restart Steam. You want to restart it to apply your changes."
    },
    {
      "title": "Launch a game through Steam.",
      "content": "Launch a game through Steam. You'll now see the FPS displayed in the position you chose earlier. [2] X Research source"
    }
  ]
}