{
  "url": "https://www.wikihow.com/Replace-a-Window-Pane",
  "title": "How to Replace a Window Pane",
  "steps": [
    {
      "title": "Lay a drop cloth or sheet under the window to avoid making a mess.",
      "content": "Lay a drop cloth or sheet under the window to avoid making a mess. Fixing a window pane can be a messy job, and you'll probably get dust, putty, and glass everywhere. Catch all of this debris by setting up a drop cloth before you start working to protect your floors. You might want to put a drop cloth on the other side of the window too, just to be safe."
    },
    {
      "title": "Put on thick gloves and eye protection before starting.",
      "content": "Put on thick gloves and eye protection before starting. Any time you’re working with glass, there’s a risk for breaking a piece and hurting yourself. Always put on a pair of thick gloves to protect your hands, and also goggles or a face shield to protect your eyes. If you’re wearing goggles, make sure they wrap around your eyes to protect them from all sides."
    },
    {
      "title": "Pop off the glazing around the pane with a sharp putty knife.",
      "content": "Pop off the glazing around the pane with a sharp putty knife. Window panes are held in by a putty called glazing, so you’ll have to remove this to get the pane out. Use a putty knife—the sharper the better. Find the line separating the glaze from the wood at any point, and insert the putty knife there. Then push towards the pane to break the glazing off. Continue working your way around the pane and pop off all the glazing holding it in. [1] X Research source If the glazing is tough to get off, try heating it up with a hairdryer or heat gun. This can soften the glazing and make removing it easier. [2] X Research source You could also use a razor or utility knife to get the glazing off."
    },
    {
      "title": "Scrape off any remaining glazing or glue along with border of the pane.",
      "content": "Scrape off any remaining glazing or glue along with border of the pane. When you break off all the big pieces of glazing, there might still be some remnants left over. Scrape your knife around the border of the pane to get rid of any leftovers holding the pane in. [3] X Research source"
    },
    {
      "title": "Tape an X on both sides of the pane with duct tape.",
      "content": "Tape an X on both sides of the pane with duct tape. To get the pane out completely, you’ll have to break it. Prevent glass from flying everywhere by taping off the window first. Make an X across each side of the pane with duct tape so the glass stays together when you break it. [4] X Research source If the pane was already broken, then you might not have to crack it more. If you can get a grip on the pane, then you can just pull it out. If you’re removing a pane in a loose window sash, the wooden part that holds the panes, then you can place it on a workbench, cover the pane with a rag, and hit it with a hammer instead of taping it. [5] X Research source"
    },
    {
      "title": "Break the pane by tapping it with a hammer or similar tool.",
      "content": "Break the pane by tapping it with a hammer or similar tool. Use either a hammer or the handle of a screwdriver and tap the pane until it breaks. Tap in a few different spots so the pane breaks all over. [6] X Research source You’re only trying to crack the pane. You don’t have to smack it hard to try and smash it."
    },
    {
      "title": "Pop the old pane out of position and remove all the glass.",
      "content": "Pop the old pane out of position and remove all the glass. Once the pane is broken, it should come out easily. Grab it in any spot you can get a grip, and pull it out. [7] X Research source Then check along the sash for any leftover glass, and pull or scrape it out before moving on. If there isn’t a spot to grab the pane, then try going to the other side of the window and pushing it out. Even though you taped the glass, some shards might still break free as you remove the pane. Check the floor and pick up any loose pieces. Some windows use hooks or other small metal pieces to keep the panes in place. If you see any of these, pull them out as well."
    },
    {
      "title": "Sand the border of the sash.",
      "content": "Sand the border of the sash. Use coarse sandpaper and sand around the whole rabbet, or the groove where the window sits. Smooth everything down to the bare wood. [8] X Research source Keep your gloves on while you’re sanding. If you missed any glass pieces, you could get a serious cut."
    },
    {
      "title": "Get a replacement glass pane with the same dimensions as the old one.",
      "content": "Get a replacement glass pane with the same dimensions as the old one. You can get replacement glass panes at any hardware store. Measure the length and height of the space, and use those dimensions to buy a new pane that fits into the sash. [9] X Research source Since wood expands, leave a bit of extra room to allow for that. In general, subtracting 1 ⁄ 8 in (0.32 cm) from your measurement leaves enough room. So if your sash space is 12 in (30 cm), get a pane that's 11 7/8 in (29.7 cm) for some extra room. If you can’t get a pane that fits into the sash, you could also get a larger piece of glass and cut it to fit into position. Hardware stores will also cut the pane for you if you bring your measurements in."
    },
    {
      "title": "Run caulk around the border of the sash.",
      "content": "Run caulk around the border of the sash. Use your caulk gun and angle it onto the notch section of the sash. Squeeze a bead of caulking on all 4 sides of the sash. This is important to cushion the glass and weather-seal the window. [10] X Research source Work quickly after this so the caulk doesn’t dry before you put the glass in. In general, silicone or polymer caulk is recommended for windows. These are flexible enough to expand with the window and make a weather-tight seal. You could also use butyl rubber. [11] X Research source"
    },
    {
      "title": "Press the new pane into the caulk.",
      "content": "Press the new pane into the caulk. Hold the new pane firmly and line it up with the sash. Slide it into the sash from the bottom first, then work your way up until the pane is completely in. Press down gently so the glass adheres to the caulk. [12] X Research source Make sure the pane is completely in the sash before letting go of it. If it’s still loose, it could fall out and break. Do your best to line up the pane perfectly the first time. Removing it to reset it will make a mess and could break the glass."
    },
    {
      "title": "Insert a glazer’s point in the center of each side to secure the pane.",
      "content": "Insert a glazer’s point in the center of each side to secure the pane. A glazer’s point is a little metal tab that helps keep the pane in place. Each one has a pointed end and a toothed end. Arrange each one so the pointed side points toward the wood. Then use your putty knife to press it into the wood at the center of the pane. Put one of these on each side of the glass. [13] X Research source You can get glazer’s points at hardware stores. If the pane is 12 in (30 cm) or longer on any side, then put points every 4–6 in (10–15 cm) instead."
    },
    {
      "title": "Knead 4 pieces of putty into 3⁄4 in (1.9 cm) thick strips.",
      "content": "Knead 4 pieces of putty into 3 ⁄ 4 in (1.9 cm) thick strips. Window putty is hard at first, so you need to warm it up. Knead it between your hands to warm and soften it up. Then mold 4 strips that are about 3 ⁄ 4 in (1.9 cm) thick. [14] X Research source Putty usually comes in pre-made ropes. You can get it from the hardware store. Window putty or glazing also comes in a caulking tube. You might find this easier to work with. If you use it, apply it the same way you would apply caulk. [15] X Research source"
    },
    {
      "title": "Lay a strip of putty on each side of the pane.",
      "content": "Lay a strip of putty on each side of the pane. Press the putty firmly along the side of the pane and press it into the wood to make a tight seal. Do this on all 4 sides so the window stays locked in place. [16] X Research source Don’t worry about keeping the putty neat. You can clean up the edges afterward."
    },
    {
      "title": "Smooth out the putty with your knife.",
      "content": "Smooth out the putty with your knife. Start at one of the corners of the window pane. Hold your putty knife at a 45-degree angle with the glass and tilt it to touch the wood on the window sash. Then press the blade down with your finger and pull the knife along that strip of putty to flatten it out. Peel off any excess putty that comes off. Repeat this on all 4 sides of the window. [17] X Research source If any putty gets on the glass, scrape it off with your blade before it dries. If you can see putty sticking out from either side of the window, then there’s a bit too much. Scrape this off as well so the window looks nice and neat."
    },
    {
      "title": "Clean up and let the putty dry for 7-10 days.",
      "content": "Clean up and let the putty dry for 7-10 days. Once all the putty is in place, all that’s left to do is wait. It takes 7-10 days for the putty to cure. In the meantime, clean up the mess and put your tools away while you wait for everything to set properly. [18] X Research source When you’re picking up your drop cloth, fold it up carefully and carry it to a garbage can to dump out. Check carefully for any shards of glass that might have fallen out while you were working."
    },
    {
      "title": "Paint the window sash if you want to.",
      "content": "Paint the window sash if you want to. If you want some extra decoration or to cover up any nicks you made while fixing the window pane, a few coats of paint will do the job. Start by covering the putty with an oil-based primer. When that dries, you can apply a coat or 2 of paint to give you window a fresh new look. [19] X Research source Don’t try to paint until the putty is completely dry. Scrub the window when you’re done to get rid of any excess paint."
    }
  ]
}