{
  "url": "https://www.wikihow.com/Create-Pin-Curls",
  "title": "How to Create Pin Curls",
  "steps": [
    {
      "title": "Wash your hair.",
      "content": "Wash your hair. To create pin curls, you must start with evenly damp hair. Although you can just spray your hair to wet it, washing it will give you a clean slate and your curls will last for longer. Towel dry hair after your wash to remove excess water. If you have very thick hair, give a little time for your hair to air-dry before creating the curls. You may need to mist the ends lightly to get even dampness in this case. The goal is to have your hair completely dry before removing the pins, so if you feel it is too wet let it dry a bit first. This goes even if you hair is not incredibly thick. You can also apply a setting lotion or thin styling gel to help the curls hold."
    },
    {
      "title": "Starting at the front of your head, begin creating curls.",
      "content": "Starting at the front of your head, begin creating curls. Take small sections between ½ -1 inch (2.5 cm) wide, and wrap them between your thumb and forefinger to create a small loop. Continue rolling upwards in a spiral until your reach your head. Use 1-2 bobby pins to pin this spiral to the roots of your hair. Alternatively, you can use pin curl clips. These can be found at beauty supply stores and won’t leave lines. [1] X Research source For regular pin curls, these spirals should lay nearly flat against your head and should not stick out at all. But you can also make “stand-up” pin curls – these have more volume, like curls made with a roller. [2] X Research source If you use strands of hair that are too thick, the bobby pins will leave indentations when you remove them. If you have thick hair, use thinner sections to twirl. Don’t twist your hair into rope-like strands before spiraling it inwards. Think of it more like a ribbon – wind the hair up without twisting. Work from the top down, so that you don’t miss any strands of hair."
    },
    {
      "title": "Pin all of your hair in small, flat spirals.",
      "content": "Pin all of your hair in small, flat spirals. Work your way around your head until all of your hair has been pinned to your scalp. Make sure that there are no loose strands, and that all the bobby pins feel secure. [3] X Research source"
    },
    {
      "title": "Wrap your head in a scarf or bandana.",
      "content": "Wrap your head in a scarf or bandana. This will prevent your hair from becoming frizzy and any of the pins from coming loose. [4] X Research source Try using a cotton scarf or bandana, so that it will absorb some of the moisture from your hair. This will also reduce the static cling created from the friction of the scarf on your hair. If you put your pin curls in at night, sleep with the scarf in. Make sure that it is secure enough that it won’t slip from your head while you snooze."
    },
    {
      "title": "Wait several hours.",
      "content": "Wait several hours. It is easiest to create your pin curls at night before you go to bed and then sleep on them. You can also just sit around and wait for them to dry. Regardless of when you set your curls, be sure that your hair is completely dry before you remove the pins. Avoid using a hair-dryer on your pin-curls, as it will make your hair frizzier and lose its curl. If you’re in a hurry, use a diffuser on your dryer to minimize frizz. Make sure the dryer is on the lowest setting. If your hair is still damp, give it more time to air dry. Test one of your curls to see if it is dry enough. Remove the pins from the single curl, and unravel your hair. Check to verify that the entire strand is dry. If it is, your pin curls are ready."
    },
    {
      "title": "Remove all the pins.",
      "content": "Remove all the pins. Starting from the back and bottom of your hair, take all the pins out and slowly unravel each curl. They may immediately appear too spiral-esque, but don’t fret. When you finish removing all the pins you can style the curls to fit your preferences."
    },
    {
      "title": "Style your curls.",
      "content": "Style your curls. Once all the pins are removed, the curls will need to be lightly brushed through to give that classic pin-curl look. This will also remove the piecey appearance they probably have. [5] X Research source If your hair is very fine or thin, start by simply finger-brushing your hair to break apart strands. For thicker hair or a more vintage look, use a boar-bristle brush to comb out your strands directly. Use a little pomade rubbed between your fingertips to add texture to your hair and reduce frizz. Add hairspray to add extra hold to your hair for the whole day."
    },
    {
      "title": "Wash your hair.",
      "content": "Wash your hair. Your hair must be wet for this style to set, and it is best to start with clean hair by washing it. Towel dry it to remove excess moisture. Let your hair air-dry for a few minutes until it is only damp. If you are in a rush, you can spray hair down with a squirt bottle filled with water. Use a curl enhancer or light setting lotion to keep the moisture even. It should also give you more polished results."
    },
    {
      "title": "Use a straight-edge comb to separate your hair into sections.",
      "content": "Use a straight-edge comb to separate your hair into sections. For bantu knot-out curls, you will be spiraling your hair into little stacks on top of your head. Therefore, you will need sections that are a bit thicker than traditional pin curls. Depending on the thickness and length of your hair, make sections that are between 1–3 inches (2.5–7.6 cm) wide across your scalp. Work from the top and front of your head towards the bottom and rear. If you have time, traditional bantu knot spirals are separated into a pattern on the scalp. Section off your pieces of hair into a square grid, diamond pattern, or small triangles. Use your comb extensively during this process to make neat parts and even sections."
    },
    {
      "title": "Twist each section of hair into a spiral.",
      "content": "Twist each section of hair into a spiral. Working one section at a time, twist the strand of hair into a tight rope-looking strand. Twist each strand as tightly and far as you can manage. The tighter you twist it, the fuller your curls will be. With enough twisting, the strand of hair will want to curl in on itself. Continue with each strand until you reach this point. To vary the direction of the curls, spin some clockwise and others counterclockwise."
    },
    {
      "title": "Wrap each twisted section into a small spiral stack.",
      "content": "Wrap each twisted section into a small spiral stack. These spirals of hair will jut out from your head like little knobs, rather than lying flat like traditional pin curls. Use 1-2 bobby pins to secure the ends of each spiral to the hair at the scalp. If your hair is thick and long, each spiral will likely protrude much further from your head. Be sure that they are firmly pinned in this case."
    },
    {
      "title": "Complete your entire head in this fashion and wait.",
      "content": "Complete your entire head in this fashion and wait. The curls will not be ready until the hair is completely dry, but similar to traditional pin curls, avoid using a blow-dryer and ruining your hard work. It is easiest to place this in your hair at night and to sleep on them, so that they are prepared and ready for you in the morning. Because these curls contain more hair in each spiral than traditional pin curls, they may take longer to dry. Be sure to take this extra time into account. Again, use a diffuser on the lowest heat setting if you’re in a rush. The curls should still be OK if you are careful."
    },
    {
      "title": "Wrap your head in a scarf.",
      "content": "Wrap your head in a scarf. This will help keep your pins and curls in place while you work or sleep. Use a cotton bandana or scarf to absorb excess moisture from you hair, and avoid using any fabric that the pins might get caught in."
    },
    {
      "title": "Remove the pins.",
      "content": "Remove the pins. Once you are certain your hair is dry, remove all the bobby pins beginning at the back and working towards the top and front. Unravel each curl once you finish removing the pins."
    },
    {
      "title": "Style your hair.",
      "content": "Style your hair. Begin by gently finger-brushing apart strands to remove their tight coiled appearance. For fuller curls, use a boar-bristle brush to comb strands into big, luxurious waves. Spread pomade or hair gel between your fingertips and run them through your hair. This will help to reduce frizz and give your hair a natural definition. Top off your style with a bit of hairspray to set the curls."
    },
    {
      "title": "Brush out your hair.",
      "content": "Brush out your hair. Make sure that it smooth and has no tangles or teasing, as this will make your hair more difficult to remove from the headband style. Your hair can be wet or dry for this style and will need several hours to set. If your hair is dry, you’ll need to prep it beforehand with hairspray or some kind of styling product. Avoid styling your hair with heat prior to trying this method of curling. Allow your hair to be in its natural form. Make sure your hair is parted down it’s normal line, so that the curls you create will fall to the correct side."
    },
    {
      "title": "Put a headband over your forehead and around to the back of your head.",
      "content": "Put a headband over your forehead and around to the back of your head. It should be laying over the top of your hair, not under it. Use a headband that is no wider than ½ an inch thick and is elastic. Avoid using a headband that is cylindrical, as this will be more likely to roll off the top of your head. Don’t use a headband with any beading, sequins, or adornment, as your hair will get caught and become incredibly difficult to remove."
    },
    {
      "title": "Begin twisting hair in one inch sections.",
      "content": "Begin twisting hair in one inch sections. Starting at the front of your head, take pieces of hair about one inch thick, and twist them until they become very tight and rope-like. Then, wrap them around the headband towards the back of your head. Try to keep the curl tightly wrapped around the headband in a spiral, so that it does not take up too much of the available space on the headband. Repeat this process from the front, all the way around to the back of your hair. For smaller spiral curls, use thinner strands of hair. For big, bouncy curls, increase the size of the hair sections you wrap."
    },
    {
      "title": "Wait for your hair to set.",
      "content": "Wait for your hair to set. As with most heat-less curling methods, it is easiest to let the curls set overnight. Wait at least six hours before taking off the headband."
    },
    {
      "title": "Remove the headband.",
      "content": "Remove the headband. Once your hair has been given enough time to hold its curl, it is safe to take of the headband. Start by unravelling the strands of hair at the back of your head towards the front. The curls will probably start out very tight, but don’t worry as they will relax over time."
    },
    {
      "title": "Style your hair.",
      "content": "Style your hair. Depending on your desired curl-tightness, you may prefer not to brush out curls too much. To give these curls a more natural appearance, finger-brush them or gently comb them to break apart the strands. Use a texturizing hairspray or pomade to give a natural appearance to the curls. Use hairspray to set the style."
    }
  ]
}