{
  "url": "https://www.wikihow.com/Laugh-Naturally-on-Cue",
  "title": "How to Laugh Naturally on Cue",
  "steps": [
    {
      "title": "Find something that's funny so you're in a lighthearted mindset.",
      "content": "Find something that's funny so you're in a lighthearted mindset. Maybe someone told a funny joke, you're recalling a scene from a hilarious movie, or something just struck you as silly and made you laugh. You could even watch great performances by funny actors for inspiration. Isolate the moment that you found funny so you can remember it on cue. [1] X Research source You may think of an embarrassing memory that's become funny over time or remember a really funny line of a movie you watched recently."
    },
    {
      "title": "People laugh differently depending on the situation.",
      "content": "People laugh differently depending on the situation. Think about it—you might have a deep, belly laugh if a friend's telling a really funny story or you might chuckle a little at something that's kind of amusing. These are different laughs for different settings and figuring out which to use can make your performance more effective. You may want to make notes on the script about how the laughter sounds. [2] X Research source For example, if you're playing a character that's surprised by something funny, you might have a lighter, higher chuckle. If your character is trying to hold back from laughing, it may be a deep, bubbly laugh that escapes. Not sure where to start? Study yourself, a close friend, or a character in a funny movie, and pay attention to all of the laughing styles you hear."
    },
    {
      "title": "Immerse yourself in the situation so you find it easier to laugh.",
      "content": "Immerse yourself in the situation so you find it easier to laugh. Imagine how your character would respond to the scene around you. [3] X Expert Source Ben Whitehair Social Media Expert Expert Interview. 3 June 2021. This makes your laugh more believable because it fits the scene. For instance, if your character is being sarcastic, you may give a short, slow laugh. If your character is genuinely happy and joyful, you might give a big, goofy chuckle that doesn't stop for a minute. [4] X Research source Getting into character may mean that you spend extra time reading the script so you understand your character's personality and what they find humorous. For instance, if they're nervous, they may give a short, strained laugh. Not an actor? No problem—if you're trying to laugh at the end of a friend's joke, just follow the joke a little more closely. This can help you cue in on when to laugh and you might even find something truly funny in the joke."
    },
    {
      "title": "Trick your body into naturally laughing by going, \"huh, huh, huh.\"",
      "content": "Trick your body into naturally laughing by going, \"huh, huh, huh.\" If you have a hard time getting into a funny state of mind, focus on the physical aspect of laughing. Say, \"huh,\" or \"ha,\" while you draw in your stomach. Repeat this, going faster until you're saying \"huh-huh-huh,\" and it turns into realistic-sounding laughter. With a little practice, this is a great way to start laughing on cue. [5] X Research source This is a great laugh to use if your character will be laughing along with others. Once you get started, it's really easy for your body to take over with natural laughter."
    },
    {
      "title": "You can probably spot fake laughter—it doesn't sound natural.",
      "content": "You can probably spot fake laughter—it doesn't sound natural. This is because real laughter uses your lungs and emotions to produce a totally unique sound. To trigger this realistic-sounding laugh, breathe in deeply and let out the air while you're laughing. You'll soon be laughing with your whole body so it's more natural than just making the sound with your vocal cords. [6] X Research source Keep your body loose so it's easy for your lungs to expand and your muscles to relax. Use this breathy laugh for scenes when your character might be reacting to something funny that someone said or did. You've probably seen someone laugh so hard that they've struggled to breathe. While you don't have to gasp while you laugh, the extra breaths do make it look like you're truly laughing."
    },
    {
      "title": "You may have a good fake laugh, but make it more realistic with a smile.",
      "content": "You may have a good fake laugh, but make it more realistic with a smile. Instead of smiling like you're posing for a picture, remember a time when you were really happy or pretend to be joyful during your scene. When you smile, let it spread across your face up to your eyes so you look truly happy. Then, your laugh will seem totally natural. [7] X Research source"
    },
    {
      "title": "You might cover your mouth with your hand or pat your chest.",
      "content": "You might cover your mouth with your hand or pat your chest. These little gestures can make your laughter seem more authentic than if you just stand up straight and laugh on cue. You can pick up on even more movements by watching people in a crowd. [8] X Research source For instance, some people find that raising your eyebrows while smiling can help trigger laughter. Your script might include physical movements that you should do while laughing."
    },
    {
      "title": "You use a lot of muscles when you laugh so give them a workout!",
      "content": "You use a lot of muscles when you laugh so give them a workout! The more you practice laughing on command, the easier it will be since your body will be used to it. You'll also feel more confident as you practice, which will make the laughter seem more authentic. [9] X Research source [10] X Expert Source Ben Whitehair Social Media Expert Expert Interview. 3 June 2021. It can help to practice in front of a mirror so you can see if you're smiling and appearing genuine."
    }
  ]
}