{
  "url": "https://www.wikihow.com/Email-People-on-Craigslist",
  "title": "How to Email People on Craigslist",
  "steps": [
    {
      "title": "Navigate to the Craigslist post you want to reply to.",
      "content": "Navigate to the Craigslist post you want to reply to."
    },
    {
      "title": "Click on “Reply” located at the top-left corner of the Craigslist post.",
      "content": "Click on “Reply” located at the top-left corner of the Craigslist post. A floating menu with a list of email options will display on-screen. If the pop-up menu doesn’t display, it’s possible a third-party browser extension or add-on is preventing the pop-up from displaying properly. If this occurs, disable any unfamiliar add-ons, close and reopen your browser, and try again. In some cases, private browsing or incognito mode may prevent the pop-up menu from displaying. Disable private browsing temporarily if needed to reply to a posting on Craigslist."
    },
    {
      "title": "Click on your preferred email contact method from the list of options provided.",
      "content": "Click on your preferred email contact method from the list of options provided. Click on the link below “Reply by email” to reply using your default email client. Click on “Gmail,” “Yahoo Mail,” “Hotmail/Outlook/Live Mail,” or “AOL Mail” to reply using one of these webmail services. Copy and paste the “reply-to” address provided if you want to use an alternate email program."
    },
    {
      "title": "Wait for your email client to open.",
      "content": "Wait for your email client to open. If you chose to reply using your default email client or webmail service, Craigslist will automatically paste the reply-to address into the “To” field. If you chose to copy and paste the reply-to address into an alternate email program, open your email client and copy/paste the reply-to address into the “To” field."
    },
    {
      "title": "Type your message to the Craigslist user into the “Compose” field of your email client.",
      "content": "Type your message to the Craigslist user into the “Compose” field of your email client."
    },
    {
      "title": "Click on “Send.",
      "content": "Click on “Send. ” Your email will then be sent to the Craigslist user whose posting you replied to. [1] X Research source"
    }
  ]
}