{
  "url": "https://www.wikihow.com/Make-Friends-As-an-Introvert-with-Social-Anxiety",
  "title": "How to Make Friends As an Introvert with Social Anxiety",
  "steps": [
    {
      "title": "Being shy and having social anxiety are two different things.",
      "content": "Being shy and having social anxiety are two different things. Though being shy might prevent you from making friends, social anxiety can feel debilitating at times. It often manifests in physical and emotional symptoms, and it may feel like it's negatively impacting your life. Thankfully, recognizing the symptoms can help you manage and overcome them. You might have social anxiety disorder if you experience these symptoms: [1] X Research source Fear of judgment Intrusive thoughts Low self-esteem Dread before socializing with others Intense loneliness Trouble making eye contact with others Shortness of breath in social situations Panic attacks Nausea and vomiting Tension in your muscles"
    },
    {
      "title": "Quieting your inner monologue can help you remain present.",
      "content": "Quieting your inner monologue can help you remain present. When you have social anxiety, you may second-guess the things you say or assume everyone is judging you. To manage your anxiety and start making friends, try to put those negative thoughts to rest. Replace them with positive thoughts so that you can get back to the conversation at hand and really make a connection. [2] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source Negative thoughts might include things like \"No one cares what I have to say\" or \"Everyone here is cooler than me.\" Replace thoughts like that with more uplifting ones. Try, \"I have a unique perspective that people appreciate\" or \"I'm a really cool person, too.\" It may feel silly at first, but positive thinking can really help you feel better and make connections in the long run."
    },
    {
      "title": "Starting with small challenges can create big results.",
      "content": "Starting with small challenges can create big results. It's okay if you're not ready to go to a massive party by yourself right off the bat. Instead, try making small but meaningful strides forward. First, identify some goals you'd like to hit. Then, push yourself to achieve them each day. The more you face your fears, the more comfortable you'll be talking and making connections with new people. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Things you might try include: Making eye contact and smiling at a stranger Asking a coworker a question about themselves Complimenting an acquaintance on their outfit, music taste, expertise, etc. Making conversation with coworkers before a meeting starts or while you're eating lunch in the breakroom"
    },
    {
      "title": "Try clubs and classes that will help you meet similar people.",
      "content": "Try clubs and classes that will help you meet similar people. First, identify what you're passionate about. Then, check out opportunities related to your interests online and on posters around town. Pursuing your interests will put you in the same room as people that share your passions, which can really boost your chances of making friends. [4] X Research source If you're not sure what you're passionate about, consider what makes you happy. Do you love watching new movies? Check out a film class! Really into comics? Look into the events at your local comic book shop. It's totally normal if you're feeling nervous to join in on a new activity or class. Try to remember that everyone else is probably feeling that way too, especially if you've chosen an activity that other introverts gravitate towards."
    },
    {
      "title": "This can help you turn an acquaintance into a friend.",
      "content": "This can help you turn an acquaintance into a friend. Go ahead and ask the people you're getting to know for their phone number or social media handle. This might be a little nerve-wracking, but it'll show that you're interested in becoming their friend. Nearly everyone will be flattered and happy to share their contact info with you! [5] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Say something like: \"It's been so fun getting to know you. What's your phone number? I'd love to hang sometime!\" \"Hey, do you have Instagram? I'd love to send you a link to that art account we were talking about earlier.\""
    },
    {
      "title": "Try to spend time with people even if it makes you nervous.",
      "content": "Try to spend time with people even if it makes you nervous. It may be tough at first, but making friends requires putting yourself out there a little. If someone invites you to hang out or go to an event and you're at all interested in being their friend, join them! [6] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Try to keep an open mind about new people when first making friends. You might think you don't have anything in common with someone, but they may surprise you once you get to know them. If you're not feeling it or start to get super anxious during the hangout, don't be too hard on yourself. It's okay to politely excuse yourself and thank them for their company. Congratulate yourself for making progress and keep trying!"
    },
    {
      "title": "Show people that you want to get to know them better.",
      "content": "Show people that you want to get to know them better. This is easier said than done, but part of making connections with people involves making plans yourself. You never know, your new acquaintances, coworkers, and classmates may be introverted or anxious as well. They'll love hearing that you want to spend time with them and will be happy to hang out. [7] X Research source For example, ask a coworker you frequently chat with if they want to get lunch together. You might say, \"Hey, I've been meaning to check out that sandwich shop down the street. Wanna grab lunch with me sometime this week?\""
    },
    {
      "title": "Hanging out with likeminded people can ease your anxiety.",
      "content": "Hanging out with likeminded people can ease your anxiety. If big parties and staying out all night really aren't your thing, that's totally okay. Try hanging out with other socially anxious or introverted people. To meet similar people, be open about your interests (like movie marathons at home and staying in on the weekends) and see how they respond. If someone gets excited when you reveal you also don't enjoy going out, they're likely a great match. [8] X Research source Resist the urge to pretend to be someone that you're not when you're meeting new people. You'll attract more likeminded people if you're honest about your interests, hobbies, and the way you spend your time."
    },
    {
      "title": "Pick a weekly activity so you can hang out regularly.",
      "content": "Pick a weekly activity so you can hang out regularly. As an introvert, you may get overwhelmed trying to think of something new to do every time you make plans. Establishing a routine can make the process so much easier. Pick an activity that you and your friends enjoy, and set a date each week. [9] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source If you like horror movies, try a weekly movie night with popcorn and snacks. For creative types, plan a weekly craft night and encourage your friends to bring any art projects they're working on. If you're into coffee and tea, set a weekly date with a few friends at your favorite coffee shop."
    },
    {
      "title": "Focus on what people are saying rather than your own thoughts.",
      "content": "Focus on what people are saying rather than your own thoughts. If you're in the middle of a conversation with a new person, you might start to fall into negative thoughts and self-consciousness. To help you focus on what someone is saying, make eye contact, nod, and repeat their words in your head to mull them over. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Even if you're nervous, avoid thinking about what you'll say in response while someone talks. After they're done talking, it's okay to pause for a moment as you think of a good reply. If you're not sure what to say in response, try asking a question or paraphrasing what they said to make sure you understood them correctly."
    },
    {
      "title": "Deep breathing",
      "content": "Deep breathing can help you relax and stay present. If you're in a social situation and suddenly start to panic, slowly inhale through your nose. As you breathe in, allow your belly to expand as it takes in the air. Then, exhale slowly through your mouth and repeat. Though it may seem small, doing this for a few repetitions in a row can help you feel calm and relaxed in a stressful social situation. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Reader Poll: We asked 841 wikiHow readers who've experienced social anxiety what their preferred relaxation technique is, and 55% of them agreed that the best way to calm down in social situations is to focus on breathing. [Take Poll]"
    },
    {
      "title": "Go easy on social media so you can prioritize in-person connections.",
      "content": "Go easy on social media so you can prioritize in-person connections. As an introvert, social media can be a fun place to bond with other introverted people. Though it can be a great tool to meet new friends, one study found that online connections did not have the same emotional benefits as in-person connections. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Try to strike a balance between online friendships and in-person plans if you're able. That way, you can get the most out of your social life. Try your best not to compare yourself to people you see on social media, too. Follow accounts that make you feel good about yourself, and if you catch yourself comparing, consider taking a break."
    },
    {
      "title": "Take time to rest and recharge.",
      "content": "Take time to rest and recharge. Putting yourself out there and making friends is hard work. Make sure you give yourself time to unwind and relax. Get at least 8 hours of sleep each night, eat healthy meals, exercise, and get some fresh air. All of these things can leave you feeling rejuvenated and ready to keep trying. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source As an introvert, it's okay to still want alone time sometimes. If you're feeling overwhelmed, enjoy some solo time by watching your favorite movie and eating a healthy snack. Part of practicing self-care is having compassion for yourself. If it's taking longer than you expected to make friends, try not to beat yourself up. Making lasting connections takes time and you're making some very meaningful strides. Try to get in the habit of practicing gratitude! That way, you can stay open to what's available in your life."
    },
    {
      "title": "You'll be able to keep trying if you avoid taking it personally.",
      "content": "You'll be able to keep trying if you avoid taking it personally. If someone isn't interested in hanging out, it's totally understandable to be disappointed or hurt. Try your best not to blame yourself, though, as it likely has nothing to do with you. Keep your head up and don't let it stop you from making plans with new people that would love to hang out! [14] X Research source It may help to remember that everyone has experienced rejection at some point, no matter how confident or social. Celebrate the fact that you put yourself out there and keep trying."
    },
    {
      "title": "A therapist can identify your triggers and provide extra help.",
      "content": "A therapist can identify your triggers and provide extra help. Dealing with social anxiety is not easy, and there's no shame in getting some help from a mental health professional. If you've followed these tips and are still struggling, consider talking to a therapist or a counselor that specializes in social anxiety. If you're interested, get a referral from your doctor or look online for a professional in your area. [15] X Research source A mental health professional can give you extra tools and advice on how to manage your social anxiety symptoms."
    }
  ]
}