{
  "url": "https://www.wikihow.com/Divide-in-Adobe-Illustrator",
  "title": "How to Divide a Circle Evenly in Adobe Illustrator",
  "steps": [
    {
      "title": "Create a new document.",
      "content": "Create a new document. Go to File > New or Ctrl + N and set the size of the document to a vertical letter-sized canvas. You can add guides by creating a rectangle using the rectangle tool (W:8.5in, H:11in). Then drag the guides onto each center of the bounding box. Finish by right clicking over your ruler to change your document measurements to pixels."
    },
    {
      "title": "Create a circle by using the ellipse tool.",
      "content": "Create a circle by using the ellipse tool. Set the circle’s measurements to 500 x 500 pixels."
    },
    {
      "title": "Make a line by clicking on the line tool.",
      "content": "Make a line by clicking on the line tool. To make the line straight hold down the shift tool on your keyboard."
    },
    {
      "title": "Rotate the line at 25 degree angle.",
      "content": "Rotate the line at 25 degree angle. You can rotate the line by selecting line > right click > transform > rotate. Once you've done that, you can set the angle to 25 and click copy."
    },
    {
      "title": "Once you've rotated and copied the line, you'll need to rotate and copy it again five more times.",
      "content": "Once you've rotated and copied the line, you'll need to rotate and copy it again five more times. This will produce an array of lines on top of the circle."
    },
    {
      "title": "Now go to window > pathfinder for your pathfinders window.",
      "content": "Now go to window > pathfinder for your pathfinders window. Select all the objects (or you can simply choose Ctrl + A), and then click “Divide” on your pathfinders window. Automatically the circle will be divided by 14 individual triangles all grouped together. At this point you can click and collapse to delete unnecessary extra shapes."
    },
    {
      "title": "Ungroup the triangular pie pieces.",
      "content": "Ungroup the triangular pie pieces. This needs to be done before you can add color. To ungroup, select the group > right click > ungroup."
    },
    {
      "title": "Now that the shapes are ungrouped, you can click the individual triangles and add color to the triangle’s fills.",
      "content": "Now that the shapes are ungrouped, you can click the individual triangles and add color to the triangle’s fills. Add color by following these combinations: Red: C=0.08, M=99.65, Y=97.42, K=0.19 ; Orange: C=0,M=40.09, Y=95.65, K=0 ; Yellow: C=4.69, M=0, Y=88.69, K=0 ; Green: C=74.6, M=0, Y=99.46, K=0 ; Blue: C=78.34, M=30.95, Y=0, K=0 ; Indigo: C=85.27, M=99.91, Y=3.03, K=0.5 ; Violet: C=60.31, M=99.58, Y=1.62, K=0.44"
    },
    {
      "title": "After you've added color to the triangles fills, you can group them all together again.",
      "content": "After you've added color to the triangles fills, you can group them all together again. Do this by selecting all or Ctrl + A > right click > group."
    },
    {
      "title": "After grouping the triangles all together, take out their black stroke for a cleaner finish on your artwork.",
      "content": "After grouping the triangles all together, take out their black stroke for a cleaner finish on your artwork. You now have a circle divided into smaller individual triangles."
    }
  ]
}