{
  "url": "https://www.wikihow.com/Defeat-Xigbar-in-Kingdom-Hearts-2",
  "title": "How to Defeat Xigbar in Kingdom Hearts 2",
  "steps": [
    {
      "title": "Find Xigbar in the Hall of Empty Melodies.",
      "content": "Find Xigbar in the Hall of Empty Melodies. He is not missable since he's a story boss, and you're probably not here because you need help finding him anyway!"
    },
    {
      "title": "Make sure you have the right abilities and items.",
      "content": "Make sure you have the right abilities and items. As with any boss, these are essential and make the fight many times easier: Equip higher-level healing Items such as Elixirs or any of the Mega-Items on each party member, or just Sora if you don't trust Donald or Goofy to use them wisely. In terms of Abilities, Horizontal Slash is a particularly useful attack for dealing damage and is superior to Sora's normal air attacks, while any Air Combo Boost + Air Combo Plus add to the damage of Sora's full combo whenever you successfully land the finisher(s). By extension, Hero's Crest is the best Keyblade for this fight; you can never go wrong with a second Air Combo Boost versus an airborne boss! Guard and Reflect magic are a priority if you want to actually hit Xigbar in the first place. Finally, Once More and Second Chance are absolutely necessary if you want to survive his more powerful attacks."
    },
    {
      "title": "Let the battle begin.",
      "content": "Let the battle begin. As it does, Xigbar teleports to the balcony above and tries to snipe Sora, forcing the camera through his scope. Firing strings of bullets, if he gets a lock-on, Xigbar will fire one fast-moving shot that can't be dodged, and will send Sora flying if it hits. To bring him back down to the arena, the Reaction Command \"Warp Snipe\" must be used against it."
    },
    {
      "title": "Look for opportunities to counter.",
      "content": "Look for opportunities to counter. Once he comes back, the real fight starts. He'll teleport around the arena and pelt Sora with shot-after-shot. Running around trying to hit him with no real strategy is exactly the mentality the boss fight is designed to shut down; Xigbar fires his clip and frequently teleports away out of Sora's attack range. At higher difficulty levels, this inevitably leads to a lot of avoidable Game Overs. Even if you do reach Xigbar, there's a good chance he won't stagger to attacks while he's firing shots, meaning he can even teleport away before you can finish your combo. To truly get him open to attacks, Guard or Reflect should be used to send the shots back at him. Counter enough bullets, and he'll be left stunned for a long period of time, giving a good chance to damage him. Alternatively, Xigbar is open when he needs to reload after exhausting his clip; he'll taunt Sora while doing so."
    },
    {
      "title": "Watch out, since Xigbar is even capable of changing the battle arena, making it difficult to reach him.",
      "content": "Watch out, since Xigbar is even capable of changing the battle arena, making it difficult to reach him. When this happens, you must reach the spot he returns to after he attacks and hit him with a finisher to revert the stage. Be sure to reflect his shots back at him for a chance to get a better opening."
    },
    {
      "title": "Look for a change in attack as Xigbar gets weaker.",
      "content": "Look for a change in attack as Xigbar gets weaker. When brought down to 4 health bars, he will attack faster and more unpredictably, and now teleports after every volley to make himself even harder to hit. Xigbar also has a new attack where he charges and unleashes a large blue shot that bounces around the arena, honing in on Sora to knock him defenseless into the air where he is likely to get peppered by more shots. Either use Reflect to stop it in its tracks, or the \"Warp Snipe\" Reaction Command to send it back at Xigbar for a little damage."
    },
    {
      "title": "Get ready for things to heat up towards the end.",
      "content": "Get ready for things to heat up towards the end. When you bring him down to just below 3 HP bars, he will now unleash his desperate, ultimate attack! You'll hear Xigbar exclaim \"Okay, now we're talking!\", which is the audio cue that he has now entered his final phase. When unleashing his ultimate attack, he begins by teleporting Sora and crew into a small square version of the arena. He will then become invincible while glowing bright blue. Xigbar starts in the middle of the square arena and unleashes shots in a 360-degree clockwise motion around him; jump over the stream. He will then rapidly teleport around the outside of the platform to fire in rounds; avoid his line of fire by steadily following him around the edge and keeping away from the center, since he always moves around in a counter-clockwise pattern. As his final, most powerful move, he will float above the platform and proceed to use his complete control over space to barrage Sora with countless bullets from all sides. Get snagged by a single shot, and Sora will be at the mercy of the rest of the bullets raining down on him! Without Once More, this attack is liable to spell instant defeat for anyone not playing on Beginner Mode. To evade this infamous portion of the attack, you have to move in circles around him without stopping, making sure to not run too close to him or turn too sharply to properly avoid every single shot."
    },
    {
      "title": "Stay the course until you can finish him off.",
      "content": "Stay the course until you can finish him off. Xigbar will now use his full arsenal of attacks, even periodically unleashing his ultimate attack again. Not only will he attempt to snipe Sora again, he is able send out two charged shots in a row. He is also more aggressive than before, and will retaliate against attacks by teleporting and firing shots from directly above Sora where you can't normally Guard against them. Just remember to reflect his bullets back at him to stun him and use any opening of attack to whittle him down and deal a finishing blow!"
    }
  ]
}