{
  "url": "https://www.wikihow.com/Cleanse-Fluorite",
  "title": "How to Cleanse Fluorite",
  "steps": [
    {
      "title": "Moonlight is a pure form of energy that both cleanses and charges fluorite.",
      "content": "Moonlight is a pure form of energy that both cleanses and charges fluorite . Lay your fluorite on a windowsill or patio where it can absorb direct, cleansing moonlight and leave it all night. Make sure it’s in a safe spot where it won’t roll to the ground. A full moon will provide the most powerful cleansing. [1] X Research source Consider the phase of the moon during your cleanse. For example, cleanse fluorite under a new moon to help with a new project, or during a waxing moon to build momentum towards a goal."
    },
    {
      "title": "Sunlight cleanses fluorite with rich, vibrant positive energy.",
      "content": "Sunlight cleanses fluorite with rich, vibrant positive energy. Set your crystal down on a windowsill or outdoor space where it can absorb direct sunlight and warmth. Sunlight works fast, so bring your fluorite inside after an hour (this will also prevent the crystal’s color from fading in the sun). [2] X Research source Lay your fluorite out during dawn or dusk so it can absorb the healing energies of the sun and moon at the same time. If you have self-cleansing crystals (like selenite or citrine) that are charged with sunlight, lay your fluorite on top of them to share in the sun cleanse."
    },
    {
      "title": "Selenite is a self-cleansing crystal that can clear other stones.",
      "content": "Selenite is a self-cleansing crystal that can clear other stones. Place your fluorite on a selenite slab or in a bowl of selenite for a few hours or until you sense its energy has been restored. A smaller piece of selenite works too as long as it’s making contact with the fluorite. [3] X Research source For an extra powerful cleanse, put your selenite and fluorite in sunlight or moonlight together. Selenite is also known to cleanse the air and spiritual energy of your home in addition to other stones and crystals."
    },
    {
      "title": "Crystals come from the earth, so they're naturally healed and charged by it.",
      "content": "Crystals come from the earth, so they're naturally healed and charged by it. Dig a small hole and completely cover your fluorite in earth. If this is your first cleanse or the fluorite has absorbed some major bad energy, let it rest for 3 days. For regular maintenance cleansing, 24 hours or overnight is sufficient. [4] X Research source Mark where you buried your fluorite so you can easily find it when it's time to unearth it. Try to bury it in a spot surrounded with lots of plant life and nature. Avoid mud or wet spots since fluorite should not get wet. After you dig it up, brush off any loose or clingy earth with a clean cloth. Like fluorite, earth has strong healing energy. Opt to cleanse your fluorite this way if you plan on using it for a healing session soon."
    },
    {
      "title": "Brown rice is an easy, natural way to suck bad energy out of fluorite.",
      "content": "Brown rice is an easy, natural way to suck bad energy out of fluorite. Simply fill a bowl with uncooked brown rice and your fluorite crystal, making sure it’s covered completely. Let it rest in the bowl for up to 24 hours, or until you feel that the negative energy has dissipated. [5] X Research source Use a clean cloth to wipe away any rice dust on the crystal afterward. Throw away the rice after cleansing—it will be saturated with negative energy, so don’t use or eat it."
    },
    {
      "title": "Pure Himalayan salt draws negative energy out of fluorite crystals.",
      "content": "Pure Himalayan salt draws negative energy out of fluorite crystals. Bury the fluorite with Himalayan salt in a small bowl and let it sit until it’s cleansed of bad vibes. This usually only takes a few hours, but could take as long as 24 hours. [6] X Research source Use dry salt only. Some crystals thrive in saltwater, but fluorite becomes brittle and fragile when it’s in water for too long. [7] X Research source"
    },
    {
      "title": "Sound waves help restore fluorite’s vibrational frequency.",
      "content": "Sound waves help restore fluorite’s vibrational frequency. Lay the fluorite down and generate a constant pitch with a tuning fork , a singing bowl , or a bell . You can even sing or chant if you don’t have these objects on hand. Sound bathing usually only takes about 10 minutes. [8] X Research source Sound cleansing is perfect for large stones that are hard to move or for cleansing big collections of crystals all at once."
    },
    {
      "title": "Sage",
      "content": "Sage has been used for spiritual cleansing by various cultures for millennia. Light one end of a sage stick until it begins smoking, then place it in a heat-safe bowl. Grab your fluorite and slowly move it around in the sage smoke while you visualize its negative energy drifting away into the air. Waft the smoke over the stone until you sense that its positive energy has returned. This usually only takes a few minutes. Cleanse crystals with sage outside if possible. If you’re indoors, open some windows to ventilate your space. The process of cleansing with the smoke of ritualistic herbs is called “smudging.”"
    },
    {
      "title": "Incense",
      "content": "Incense cleanses crystals as well as your home or ritual space. Light an incense stick and place it in an incense holder when it starts smoking. Move your fluorite back and forth through the smoke and imagine the bad energy fading away into the air, just like the smoke. [9] X Research source This cleansing ritual typically only takes a few minutes. Keep wafting the fluorite until you feel that it's full of clean, positive energy. If possible, use incense made from herbs native to where you’re from to deepen your bond with your fluorite. Try using incense that aids your intention for using fluorite. For example, cedar or sandalwood will bolster your fluorite's healing powers."
    },
    {
      "title": "Your breath will cleanse and deepen your bond with your fluorite.",
      "content": "Your breath will cleanse and deepen your bond with your fluorite. Simply hold it in your hand a blow on it for several minutes while you focus on your intention. Visualize a cloud of negative energy flowing away from the stone with each breath. [10] X Research source Set an intention for purity, healing, and growth to empower your crystal and open yourself up to its restorative abilities. Meditate on your intention beforehand so your cleansing thoughts are fully aligned with your breath action. Ask the universe or whichever higher power you believe in to aid you in removing stagnant energy from your fluorite."
    },
    {
      "title": "With practice, your mind is enough to clear fluorite of spiritual impurities.",
      "content": "With practice, your mind is enough to clear fluorite of spiritual impurities. Hold the fluorite in your dominant hand a picture a pure, white, cleansing light emanating from the crystal. Visualize the light getting stronger and stronger until you feel that the stone is fully restored. [11] X Research source Meditate on your intention before and during your visualization to hone your thoughts and focus on connecting with the fluorite’s energy. As you get more experienced with visualization, you’ll be able to cleanse the fluorite faster and faster. Eventually, it may only take you a minute or so to do."
    }
  ]
}