{
  "url": "https://www.wikihow.com/I%27m-Him-Meaning",
  "title": "What Does \"I'm Him\" Mean?",
  "steps": [
    {
      "title": "“I’m him” is another way to assert your confidence and dominance.",
      "content": "“I’m him” is another way to assert your confidence and dominance. “I’m him” is a show of confidence and bravado. It means that you’re declaring yourself top dog. Saying “I’m him” is like saying, “I’m that guy.” Who’s that guy? He’s the one to watch out for, the biggest threat, the greatest player on the court, the one who all the cameras are focusing on, the moment. [1] X Research source The phrase is often used to celebrate one’s own success, like after a victory or a win. Example: “Who scored the winning dunk in the last 5 seconds of the championship? That’s right. I’m him.” Example: “Did you hear my new diss track? Totally dominated. I’m him.”"
    },
    {
      "title": "“I’m Him” was likely popularized by rapper Kevin Gates.",
      "content": "“I’m Him” was likely popularized by rapper Kevin Gates. The phrase has its roots in AAVE (African American Vernacular English), but most likely jumped into the mainstream with the release of rapper Kevin Gates’ album of the same name in 2019. [2] X Research source The album’s title of “I’m Him” is Gates’ way of asserting himself in the rap scene, and here is actually meant to stand for “His Imperial Majesty,” doubling down on the bravado. The album went gold in 2020, and platinum in 22, selling over 1 million copies. [3] X Research source"
    },
    {
      "title": "The phrase has been used as a taunt online for some years.",
      "content": "The phrase has been used as a taunt online for some years. Internet users and sports fans have been saying, “He thinks he’s him,” and similar variations as a way to taunt rival fans, or players themselves. Used this way, the phrase means, “You think you’re something special.” It’s a facetious and playful jab at someone who may be a bit too full of themselves. Some say the phrase was popularized online in a 2022 clip by YouTuber JiDion, where, during a confrontation with a woman in a bowling alley, he says, “I’m him,” and the woman responds, “You are not him.” The clip went viral on TikTok."
    },
    {
      "title": "Some attribute the phrase’s popularity to the Lakers’ Austin Reeves.",
      "content": "Some attribute the phrase’s popularity to the Lakers’ Austin Reeves. Reeves is a basketball guard whose breakout moment in the sport was during the 2023 playoffs. After he scored a key basket, he famously screamed “I’m him,” a moment that caught quite the media buzz. [4] X Research source Of course, athletes had been using the phrase long before Reeves, but Reeves’ bombastic celebration caught a bit more attention than usual."
    },
    {
      "title": "Use “I’m him” to gloat over a victory.",
      "content": "Use “I’m him” to gloat over a victory. “I’m him” is best used after proving yourself, be it on the court, in an argument, or online. You might say “I’m him” after scoring a clutch basket or a game-saving goal, or even after dominating in a multiplayer video game. Put some stress on that “him,” and put your chest into it. Example: “See the way I sink them from the 3-point line? I’m him .” Example: “Of course I got the best grade on the test. I’m Him.”"
    },
    {
      "title": "Say “I’m him” to express your confidence or swagger.",
      "content": "Say “I’m him” to express your confidence or swagger. If you need to remind those around you that they’re dealing with certified, grade-A medal material, drop a cheeky and confident “I’m him” to make the hierarchy clear. Just be sure you can back up the claim with results. Example: “Of course I can 1v5 them, dude. I’m him.” Example: “Watch me be best-dressed at the party tonight. Everyone knows I’m him.”"
    },
    {
      "title": "Use the phrase to express admiration for someone else.",
      "content": "Use the phrase to express admiration for someone else. Even if you’re not “him,” someone else probably is, and you’ll probably want to tell other people as much. Say, “He’s him” about an athlete, musician, or any other skilled person to praise them and give them their flowers while signaling to others that you think they’re the greatest. Example: “Who else could break through their defense and sprint 100 yards to a touchdown 3 times in one game? I’m telling you, he’s him.” Example: “He can act circles around most other celebs. He’s him.”"
    },
    {
      "title": "Athletes and celebrities alike have started saying “I’m him.”",
      "content": "Athletes and celebrities alike have started saying “I’m him.” You’ll usually hear “I’m him” when watching sports, and basketball in particular. It’s become something of a cultural phenomenon on the court and in interviews, and is especially common from players who just performed exceptionally well. For example: In a 2022 interview, LeBron James said, “I don’t give a f*** what nobody think. I’m him,” while talking about shaking off his naysayers. [5] X Research source In 2022, Memphis Grizzlies player Ja Morant stanced up to the fans and said, “I’m him” after scoring. [6] X Research source In 2022, Miami Dolphins cornerback Jalen Ramsey shouted , “I’m him! I love it when they count me out!” after scoring a touchdown. [7] X Research source In 2023, Amadou Onana , a soccer player who plays for Everton, mouthed “I’m him” to the camera after scoring against Southampton. [8] X Research source In 2023, Bengals quarterback Joe Burrow was recorded declaring, “I’m him,” after throwing a touchdown pass."
    },
    {
      "title": "Bro thinks he’s him",
      "content": "Bro thinks he’s him A taunt used when someone seems to think they’re impressive or all that, but you want to knock their confidence down a peg. They think they’re him, but they’re not really anybody. Example: “Look at the way he’s yelling and doing laps after that free throw. Bro thinks he’s him.”"
    },
    {
      "title": "Himothy",
      "content": "Himothy A sillier variant of the “him” in “I’m him” that combines “him” with the name Timothy for no apparent reason other than comedic value. It’s more tongue-in-cheek and playful than “I’m him” or “He thinks he’s him.” Example: “She dodged him and nearly broke his ankles with that fake-out. She’s Himothy.”"
    },
    {
      "title": "GOAT",
      "content": "GOAT An acronym that stands for Greatest of All Time. It’s usually used as a reverential title for people who are undeniable icons in their field, perhaps the best to ever perform in their given sport, genre, or any other field of expertise. Example: “We get a new album from the GOAT tomorrow. I just know rap will never be the same thanks to him.”"
    }
  ]
}