{
  "url": "https://www.wikihow.com/Fix-a-Treadmill",
  "title": "How to Fix a Treadmill",
  "steps": [
    {
      "title": "Check for problems at the connection to the power source.",
      "content": "Check for problems at the connection to the power source. The easiest problem to fix, and probably the most common, is a that your treadmill is just not plugged in. Make sure your treadmill is plugged into an electrified electrical outlet and that the prongs on the treadmill's power plug are not bent or distorted in any way."
    },
    {
      "title": "Check that the outlet your treadmill is plugged into is actually electrified.",
      "content": "Check that the outlet your treadmill is plugged into is actually electrified. Plug the treadmill into a different outlet to eliminate the first outlet as the issue. If you do not have another outlet nearby, plug another device, such as an easily movable lamp, into the treadmill's outlet to see if it works. If you know which outlets are on separate circuits, try using an outlet that is powered by another circuit. If you don't have any power at the outlet, reset the circuit breaker or replace the fuse and try to turn your treadmill on again."
    },
    {
      "title": "Check the connections between your power adaptor and the equipment.",
      "content": "Check the connections between your power adaptor and the equipment. Some treadmill models need the power supply to be adjusted before it gets to the motor. Make sure that this adaptor is in place and plugged in properly. Some models may need to be opened to complete this step. If this is the case, be sure to unplug your treadmill before opening any electrical boxes."
    },
    {
      "title": "Unplug the treadmill from its electrical source.",
      "content": "Unplug the treadmill from its electrical source. In order to check for other problems, you will need to unplug the treadmill for safety."
    },
    {
      "title": "Check your treadmill fuses.",
      "content": "Check your treadmill fuses. If the fuses are blown, your treadmill will not start. Luckily a blown fuse is usually a quick and easy fix. You can check your fuses with a multi-meter or take them to a local electronics store for testing. [1] X Research source If your fuses are blown, be sure to replace them with fuses that are that have the same amperage rating. [2] X Research source"
    },
    {
      "title": "Determine whether the problem is at the display.",
      "content": "Determine whether the problem is at the display. If your machine won't turn on, it may just be that the screen of your treadmill is not working. Make sure that all of the wires between the treadmill and the display are secure. Also check that you are getting power to the display. You can check this by using your multi-meter at the connection points between the power coming in and the display. [3] X Research source"
    },
    {
      "title": "Consult a professional repair person.",
      "content": "Consult a professional repair person. If you are unable to find the problem with the previous steps, you may need to consult a professional. If available, contact the manufacturer for information on further diagnostics to perform and for a list of qualified repair shops in your area."
    },
    {
      "title": "Troubleshoot running belt issues.",
      "content": "Troubleshoot running belt issues. Determine whether the problem is with the belt itself or a mechanical issue with the belt drivers. Making this determination will help you make your next step. If the problem is with the belt itself, you may be able to make repairs relatively easily yourself. Motor or mechanical issues may be more difficult to fix at home."
    },
    {
      "title": "Unplug your treadmill.",
      "content": "Unplug your treadmill. When making repairs on your treadmill, it is very important to make sure it is unplugged so that it does not accidentally get turned on and injure you."
    },
    {
      "title": "Clean the surface of the treadmill belt.",
      "content": "Clean the surface of the treadmill belt. Spray a towel with a cleaning solution and wipe down the belt. Dirt and debris can collect on the belt, which can slow it down. Debris can also drop from the belt into the interior of the treadmill, causing operating problems. Begin cleaning at the top of the belt and tug the belt firmly to move it downward until you have cleaned the entire surface. Be sure to let the surface get really dry before you use the machine. A wet belt could cause you to slip and injure yourself."
    },
    {
      "title": "Center the treadmill belt.",
      "content": "Center the treadmill belt. Adjust the belt so that it is centered in the machine. Belts can stretch and begin to lean to one side after frequent use. You can try repositioning the belt from the outside of the treadmill by pulling gently away from the slanted side. If the problem is severe, a technician should look at the issue."
    },
    {
      "title": "Lubricate the belt.",
      "content": "Lubricate the belt. If the belt on your treadmill hesitates when you step on it, you may need to lubricate it. This reduces belt friction and can lengthen the life of the belt. Buy treadmill belt lubricant or any silicone lubricant. Spray lubricant in a thin layer between the belt and the treadmill deck. [4] X Research source For more information on how to lubricate your treadmill's belt see: How to Lubricate the Deck of a Treadmill."
    },
    {
      "title": "Check the speed sensor.",
      "content": "Check the speed sensor. The speed sensor helps to move the belt. If the belt is jerking or not increasing in speed, the sensor might be dirty or have become detached. The sensor is usually in the interior of the treadmill's bulk, near the belt. Consult your owner's manual for the exact location on your machine."
    },
    {
      "title": "Replace the belt.",
      "content": "Replace the belt. If previous steps do not eliminate the problems you are having with your treadmill belt, you may want to replace it. Order a replacement from the manufacturer if you want to do the repair yourself. Make sure it is the correct model for your treadmill. You may want to take your treadmill to a professional repair person to replace your treadmill belt."
    },
    {
      "title": "Eliminate the possibility of other problems.",
      "content": "Eliminate the possibility of other problems. Failure of the motor can be one of the most expensive problems with a treadmill, so make sure to eliminate all other problems before diving into motor repairs. [5] X Research source"
    },
    {
      "title": "Check any error codes flashing on the display in the owner's manual.",
      "content": "Check any error codes flashing on the display in the owner's manual. This should tell you what kind of problems are occurring with your treadmill motor. The manual may also tell you whether or not the problem can be fixed by you or needs to be fixed by a professional."
    },
    {
      "title": "Open the treadmill according to the manufacturer's instructions with a screwdriver.",
      "content": "Open the treadmill according to the manufacturer's instructions with a screwdriver. Inspect the motor's connections. For non-experts, inspecting a motor might be fruitless. If nothing strikes you as being obviously wrong, you might need to consult a professional. Be warned, opening up your treadmill's motor is likely to void any warranties you may have on the treadmill. If your treadmill is still under warranty, it may be best to forgo any home repairs and go directly to a professional repair person."
    },
    {
      "title": "Replace the motor.",
      "content": "Replace the motor. This step should only be undertaken if you have a lot of knowledge about motors and can easily read an electronics schematic. Treadmill motors can be purchased at exercise equipment outlets both online and in physical stores."
    }
  ]
}