{
  "url": "https://www.wikihow.com/Discipline-Your-Cat-or-Kitten",
  "title": "How to Discipline Your Cat or Kitten",
  "steps": [
    {
      "title": "Learn the medical reasons why cats demonstrate unwanted behavior.",
      "content": "Learn the medical reasons why cats demonstrate unwanted behavior. As much you might want to think that your cat is doing something bad simply out of spite, there may be a medical or behavioral reason why she’s doing what you don’t want her to do. For example, your cat may be going outside of the litter box because of a urinary problem (urinary tract infection, kidney disease) that keeps her from making it to the litter box in time. Your veterinarian will be able to determine if a medical problem is the root cause of the undesirable behavior. But also remember your cat may have a anxiety problem. [1] X Research source Pica is a medical issue that involves eating or chewing on inedible objects, like plastic or cardboard. If your cat is chewing on or eating unusual things, it may be a sign of dental or gastrointestinal disease. [2] X Research source Dementia could be causing your cat to cry at night. [3] X Research source Medical issues should be ruled out before behavioral issues are considered."
    },
    {
      "title": "Learn the behavioral issues that could be causing your cat’s bad behavior.",
      "content": "Learn the behavioral issues that could be causing your cat’s bad behavior. If your veterinarian has been able to rule out medical causes of bad behavior, then it is time to start looking more closely at your cat’s behavior. One behavioral cause of bad behavior in cats is stress. Cats do not adjust well to change (new house, new pet, new baby), so changes in their environment can easily stress them out, causing them to scratch furniture, spray urine, etc. [4] X Research source Your cat may be acting out if she’s bored. [5] X Research source If your cat does not have enough toys to play with or doesn’t get the attention she wants from you, she may find other things to do out of boredom, like tearing up toilet paper. Keep in mind that she probably does not realize that the behavior is wrong; she’s simply doing something to keep her busy. Your cat may misbehave if she hasn’t been properly trained. [6] X Research source Although cats are typically very smart, they still need to be trained to do the right thing. If she has not been trained, she will not know what’s right and what’s wrong and will essentially do as she pleases. Cat aggression usually comes from a place of feeling stressed or anxious, being new to the household, or having an illness. [7] X Expert Source Rita Reimers Cat Behaviorist Expert Interview. 22 June 2021."
    },
    {
      "title": "Understand that your cat may not actually be misbehaving.",
      "content": "Understand that your cat may not actually be misbehaving. Keep in mind that behaviors you may consider acting out — such as scratching furniture, just to sharpen their claws — are simply a normal part of cat behavior. Instead of punishment, you might think about ways to provide the cat with a more appropriate outlet for that behavior, such as providing multiple scratch posts. Make sure you are providing your cat with an interesting, enriching environment. Puzzle feeders, scratch posts, toys, climbing towers, and engaging in active play every day are all ways your cat can redirect the behavior."
    },
    {
      "title": "Familiarize yourself with how cats learn.",
      "content": "Familiarize yourself with how cats learn. How cats learn is a simple concept: they repeat experiences that are good and avoid the experiences that are bad. [8] X Research source It is very important to remember that cats do not learn by punishment. Instead of teaching her that what she is doing is wrong, punishment will leave your cat feeling confused and fearful. [9] X Research source Jessica Char. Cat &amp; Dog Behaviorist. She will probably want to avoid you, which will weaken your bond with her. [10] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Learn what disciplinary actions will not work.",
      "content": "Learn what disciplinary actions will not work. As just mentioned, punishment will not get your cat to stop the bad behavior. Yelling and hitting your cat are forms of punishment that you should never use to discipline her. [11] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source [12] X Expert Source Rita Reimers Cat Behaviorist Expert Interview. 22 June 2021. In addition, using a spray water bottle is generally frowned upon as a way to discipline cats, although many cat owners use it. Although you may think that spraying water on your cat will deter her from the bad behavior, she is actually learning to perform that behavior when you are not around. [13] X Research source Jessica Char. Cat &amp; Dog Behaviorist. Use of the spray bottle can also make her fearful and wary of you. [14] X Research source Also, your cat will start to associate you with the water bottle, which will make her afraid of you. [15] X Expert Source Rita Reimers Cat Behaviorist Expert Interview. 22 June 2021. Rubbing your cat’s nose in her urine if she goes outside of her litterbox is an ineffective disciplinary method. It actually reminds her of a good spot to go to the bathroom. Scruffing should not be used as punishment. It can be a method to disrupt bad behavior, but is not an effective method to punish your cat. [16] X Research source"
    },
    {
      "title": "Bond with your cat in fun and rewarding ways.",
      "content": "Bond with your cat in fun and rewarding ways. It may not seem like bonding with your cat will help stop her bad behavior, but the extra attention and playtime may divert your cat’s energy away from misbehaving. [17] X Research source Jessica Char. Cat &amp; Dog Behaviorist. One of the goals of increasing your bonding time is to decrease the negative reprimands and punishments that you may be giving her. [18] X Research source The more that she enjoys your company and trusts you, the less likely she will misbehave because of stress or boredom. In addition to playing with her more, you can also try giving her massages. [19] X Research source"
    },
    {
      "title": "Make the bad behavior undesirable or impossible.",
      "content": "Make the bad behavior undesirable or impossible. Since cats learn by avoiding an experience that has a negative result, you want to attach a negative association to whichever bad behavior she is doing. For example, if she is scratching your sofa, you would discipline her by making the sofa difficult to scratch. Putting double-sided tape or aluminum foil on the sofa are helpful deterrents. Making aspects of her environment undesirable when you are not around is called ‘environmental punishment.’ [20] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If your cat likes to jump on the countertops or table, try balancing a cookie sheet or baking sheet on the edge of those surfaces. When she jumps up, the baking or cookie sheet will fall to the floor and make a loud noise. She won’t like the loud noise, and landing on an uneven surface will throw off her balance. Eventually, she will learn not to jump up where she’s not supposed to. [21] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source If your cat keeps on eating your plants or urinating in the soil, make the plant undesirable by spraying bitter apple or bitter orange on the plant leaves. You can also cover the dirt with aluminum foil or gravel. Commercially available deterrent devices can also make bad behavior undesirable. Examples of these devices include upside-down mousetraps that spring into the air when touched and motion-activated devices that spray a blast of compressed air. These devices are available at your local pet store and are useful to keep your cat from going into areas where she is not allowed. [22] X Research source Cats are social and like to spend time with you. If your cat is being aggressive, you could put her in a separate room and give her time to cool off. [23] X Expert Source Rita Reimers Cat Behaviorist Expert Interview. 22 June 2021."
    },
    {
      "title": "Make the good behavior extremely rewarding.",
      "content": "Make the good behavior extremely rewarding. The more positive reinforcement your give your cat for doing the right thing, the more likely she is to repeat the good behavior. [24] X Research source For example, when you see her using her scratching post instead of scratching your furniture, reward her with extra playtime, verbal praise or edible treats. [25] X Research source Jessica Char. Cat &amp; Dog Behaviorist. Make sure to reward her while she is doing the good behavior, rather than afterwards, or she may not understand what she is being rewarded for."
    }
  ]
}