{
  "url": "https://www.wikihow.com/How-Long-to-Hold-a-Plank-As-a-Beginner",
  "title": "A Beginner's Guide to Planking: Learn How to Plank Longer and Strengthen Your Abs",
  "steps": [
    {
      "title": "Aim for 10 to 30 seconds at a time.",
      "content": "Aim for 10 to 30 seconds at a time. When you first start out, you might only be able to hold a plank for 5 to 10 seconds, and that’s okay! As you get stronger and your body gets used to the position, try holding it for longer and longer. [1] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Hold a plank for 2 minutes maximum.",
      "content": "Hold a plank for 2 minutes maximum. Experts note that after 2 minutes, you’ve reached the maximum benefits that the plank can give you. If you can hold it for 2 minutes straight without wavering, you’re building muscles and burning calories to reach your fitness goals. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you want to test your core strength, lie on a Bosu Ball with your tailbone in the middle of it. Hold the entire body suspended on the Bosu Ball parallel to the ground. If you cannot hold this position for at least 10 seconds, the core needs some work! [3] X Expert Source Dean Theriot Personal Trainer Expert Interview. 22 January 2021."
    },
    {
      "title": "Balance on your forearms and your toes with your body off the ground.",
      "content": "Balance on your forearms and your toes with your body off the ground. Start by lying on your stomach with your forearms underneath you. Keep your elbows directly underneath your shoulders with your palms down. Engage your abs and your torso to rise up onto your toes, keeping your hips and stomach off the ground. Squeeze your legs and your glutes to keep your body in a straight line. [4] X Research source Holding the plank only works if you’re in the right formation. If you have to sway your back or raise your rear end to hold the plank, it’s time to drop down and take a rest."
    },
    {
      "title": "Try doing 1 to 6 reps every day.",
      "content": "Try doing 1 to 6 reps every day. When you first start out, you may only be able to hold one plank a day, which is fine! As you build strength, you can work your way up to 2 planks, then 3, and so on. [5] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you can’t do all 6 planks in a row, that’s totally fine. It might be easier to space them out throughout the day."
    },
    {
      "title": "Yes, especially for a beginner!",
      "content": "Yes, especially for a beginner! Half a minute is a great amount of time to hold a plank, especially if you’ve never done it before. If you can’t reach 30 seconds right away, don’t sweat it—just keep trying until you can. [6] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "You’ll strengthen your core.",
      "content": "You’ll strengthen your core. Planks are a great full body workout that target your abs and your core muscles. If you do planks every day, you’ll probably notice that your core muscles are stronger, which is great for balancing and holding your form during other exercises. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "You’ll also strengthen your legs.",
      "content": "You’ll also strengthen your legs. In the plank, your glutes, quads, and hamstrings are also getting a workout. Squeeze your legs tightly in the plank position to get the full effect of this exercise. [8] X Research source"
    },
    {
      "title": "Yes, the plank gets easier the more often you do it.",
      "content": "Yes, the plank gets easier the more often you do it. When you first start out, you might feel shaky or weak as you hold the position. Keep squeezing your legs and your abs, and try to hold a plank for longer periods every time you do it. [9] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you’re struggling to hold the plank position, keep your arms in place but drop down to your knees. You’ll still work your abs and your core, but your legs won’t have to work quite as hard. [10] X Research source"
    },
    {
      "title": "Planks are mostly a strength-building exercise.",
      "content": "Planks are mostly a strength-building exercise. Since you’re holding a static position and flexing your muscles the entire time, you’re working on building muscular strength. If you’d like to add some cardio to your plank exercises, try modifying them with hip touches or up and down planks. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Hip touches: Start in a standard plank with your body in a straight line. Slowly rotate your right hip down to the floor, raising your left hip in the air. Keep your body in a straight line as you gently touch your right hip on the ground. Then, rotate your left hip to the left side. [12] X Research source Up and downs: Start in a standard plank position with your forearms on the floor. Press up with your right hand so you’re balancing with your right palm flat on the floor. Then, press up with your left hand so you have both palms flat on the floor. Quickly lower back down to your right forearm, then your left forearm. Keep your abs engaged and your body in a straight line the entire time. [13] X Research source"
    }
  ]
}