{
  "url": "https://www.wikihow.com/Respond-to-Threatening-Texts",
  "title": "How to Respond to Threatening Texts: Staying Safe & Getting Help",
  "steps": [
    {
      "title": "Warn them that their behavior is potentially illegal.",
      "content": "Warn them that their behavior is potentially illegal. [1] X Research source Send a short, brief note naming their threatening behavior as harassment and letting them know that you’re willing to take whatever actions are necessary to stop it. If you do want to eventually take legal action, this message will prove that you tried to cut off contact. Write something like: “This message is harassment. I will be cutting off communication with you. If you continue to try and harass me, I’ll be taking legal action.” “It is unacceptable for you to threaten me over text. I’m blocking this number—try to reach me again and I’ll alert the authorities.”"
    },
    {
      "title": "Once you give them a warning, end all contact.",
      "content": "Once you give them a warning, end all contact. If someone has been threatening you over text, there is no good reason to continue normal kinds of communication with them. For your own safety, cut off this avenue for them to make contact. [2] X Research source If they continue finding ways to contact you you’ll have more evidence to prove that they’re harassing you to a court or other authorities. [3] X Research source"
    },
    {
      "title": "Keep them from harassing you on other platforms.",
      "content": "Keep them from harassing you on other platforms. When you block someone on text, they might try to reach you through social media to continue harassing you. Be proactive by unfriending and blocking them on your different social media platforms. It is also a good idea to change your privacy settings to private so that they can’t interact with you through any public profiles. [4] X Research source"
    },
    {
      "title": "Document your interactions in case you need to take legal action.",
      "content": "Document your interactions in case you need to take legal action. Take screenshots of any threatening messages, and be sure to include timestamps for when each of these interactions occurred. The best way to protect yourself is to have clear evidence of threats made against you, so that you can prove to the proper authorities that you’ve been experiencing harassment. [5] X Research source"
    },
    {
      "title": "Start a log of all attempts to contact you as legal evidence.",
      "content": "Start a log of all attempts to contact you as legal evidence. In this log, you should include the date and time during which any threatening behavior occurred. If you have witnesses that can attest to other incidents during which the person harassing you has acted in a threatening way, collect their contact information as well. That way, you can create a timeline of this behavior for courts or other authorities to use as evidence. [6] X Trustworthy Source WomensLaw.org Site associated with the National Network to End Domestic Violence aimed at providing free legal resources and aid to survivors of domestic violence. Go to source"
    },
    {
      "title": "If you don’t know who is threatening you, your phone company can help.",
      "content": "If you don’t know who is threatening you, your phone company can help. If you’ve been receiving frequent threatening texts, or if the threats of bodily harm have been made against you or your family, your phone company will act immediately. Call them to see if they can set up a “trap” to identify the texter. [7] X Research source Some phone companies will require you to file a complaint with the police first. Contact your company to find out more information."
    },
    {
      "title": "Your HR department or school administration can help you.",
      "content": "Your HR department or school administration can help you. If the person texting you is affiliated with your workplace or school, reaching out to the proper authorities can help you end the threats and connect you to resources to help you. Don’t try to deal with these threats by yourself—by getting more people involved, you can keep yourself safe. [8] X Research source By alerting your HR department or school about the threats, you may be able to get them to ban your harasser from entering your workplace or school."
    },
    {
      "title": "File a complaint with the police if you’re worried that you’re in danger.",
      "content": "File a complaint with the police if you’re worried that you’re in danger. Call or visit your local police station in order to file a complaint that you’re being harassed. Presenting the police with screenshots and other evidence of your harassment can help them process your complaint as easily as possible. [9] X Trustworthy Source Federal Communications Commission Independent U.S. government agency responsible for regulating radio, television, and satellite, and phone communications Go to source If you’re being threatened with immediate bodily harm over text, call 911 as soon as possible. Take threats seriously—your safety depends on it."
    },
    {
      "title": "If you’ve been threatened more than once, a restraining order can protect you.",
      "content": "If you’ve been threatened more than once, a restraining order can protect you. Filing a restraining order allows a judge to order your harasser to stop contacting you, with legal penalties if they fail to do so. After filing a restraining order, a clerk will have the police serve your harasser with papers demanding their appearance in court. [10] X Research source In order to get a restraining order, you’ll have to demonstrate that there has been a repeated pattern of this person harassing you over text or verbally, or committing serious violations of your boundaries by following you, hanging around your home or workplace, or damaging your property."
    },
    {
      "title": "Harassment might lead you to explore ways to defend yourself.",
      "content": "Harassment might lead you to explore ways to defend yourself. Hopefully, you’ll never be placed in a position where you would have to use any self-defense skills. However, taking a self-defense class could help you feel more secure and safe after an incident like this. Keeping your home and property secure by updating your locks and any electronic security systems you have can also keep your mind at ease. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "A therapist can help you unpack this experience.",
      "content": "A therapist can help you unpack this experience. Receiving threats of any kind can be unsettling and stressful, and it’s a good idea to talk to a mental health professional to go through what happened. [12] X Expert Source Catherine Boswell, PhD Licensed Psychologist Expert Interview. 29 December 2020. They can offer you advice and guidance as you work on recovering your sense of safety and security. [13] X Research source Your workplace or school may be able to connect you to a therapist if you’re having trouble finding one. You can also use this website from the American Psychological Association to locate one in your area: https://locator.apa.org/?_ga=2.152634425.142319692.1643333542-2064004528.1635971872 If you’ve been subject to threats at your workplace, your HR department may be able to connect you to free counseling resources. Ask if this is possible—that way, you won’t have to tap into your insurance funds or other financial resources for therapy."
    }
  ]
}