{
  "url": "https://www.wikihow.com/Clean-a-Dryer-Vent-on-the-Roof",
  "title": "How to Clean a Dryer Vent on the Roof",
  "steps": [
    {
      "title": "Vacuum on the ground floor.",
      "content": "Vacuum on the ground floor. You will need to use a vacuum to clean out the length of the vent and, unless you have access to an industrial vacuum, it is unlikely that you’ll be able to do this from the roof. Before climbing up to the roof, get behind the dryer to vacuum out the vent. [1] X Research source There should be clamps that connect the exhaust pipe of the dryer to the vent. Use a screwdriver to release these so that you can vacuum. You can put the tube of the vacuum directly up the vent. However, there are special attachments that can be clamped onto the end of the tube that are designed to pick up lint from a vent. These can help vacuum the vent. [2] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Peel back shingles that obstruct the vent on the roof.",
      "content": "Peel back shingles that obstruct the vent on the roof. Once you have safely ascended onto the roof, examine the area around the vent guard. If any shingles are covering the vent, or the screws that attach to the guard, peel back the shingles. If they are held in place with tar, use a utility knife to cut around the shingles and secure access to the vent. [3] X Research source"
    },
    {
      "title": "Remove the guard to the dryer vent on the roof.",
      "content": "Remove the guard to the dryer vent on the roof. When you get on the roof, you should find that the vent is covered by a guard. If you can, remove it. You might find that there are gobs of lint stuck on in. You can remove some of this with your hands. [4] X Research source If the guard is secured in place by nails, place a cat’s paw pry bar under the head of the nail and hit the pry bar with a hammer to release the nails. After you have removed the nails, hold on to them so that you can reinstall them later. [5] X Research source After the nails have been removed, pull up on the guard to remove it. You might need to twist it as you pull to dislodge it."
    },
    {
      "title": "Use a vent brush to clean the surface.",
      "content": "Use a vent brush to clean the surface. You can purchase a vent trap cleaner separately or a kit with attachments to your vacuum. Use it to gently remove lint from the guard and other exterior surfaces. [6] X Research source"
    },
    {
      "title": "Put the vent brush inside the vent.",
      "content": "Put the vent brush inside the vent. Push the brush inside the vent and then twist it. This will get lint trapped in the brush. Then pull the brush out to remove the lint. Repeat until you are no longer picking up lint. [7] X Research source Because much of the lint concentrates near the ends of the vent tube, this basic cleaning and the vacuuming on the ground floor should remove most of the lint. If you can see significant amounts of lint that remain beyond your reach, call a professional."
    },
    {
      "title": "Reinstall the guard.",
      "content": "Reinstall the guard. If you removed the guard, put it back into place. Be sure that it is intact so that no animals or debris can enter the vent. If you find that the guard is not intact, call a professional to have it replaced. Debris falling into the vent could seriously compromise your dryer. [8] X Research source Installing a guard would also help prevent birds and mice from entering the vent."
    },
    {
      "title": "Call an expert for slate and tile roofs.",
      "content": "Call an expert for slate and tile roofs. Slate and tile can easily slip. This can damage the roof or even cause you to fall. Only experts should climb on top of slate or tile roofs. [9] X Research source"
    },
    {
      "title": "Do roof work on a clear day.",
      "content": "Do roof work on a clear day. Rain will significantly increase the likelihood of you slipping and hurting yourself. Even a strong wind can destabilize you or the ladder when you least want it to. [10] X Research source"
    },
    {
      "title": "Place ladder on a solid, level surface.",
      "content": "Place ladder on a solid, level surface. If the ground is soft or slanted the ladder could slip out from underneath you. Do not place the ladder on a slanted driveway."
    },
    {
      "title": "Wear safety equipment.",
      "content": "Wear safety equipment. You should wear a helmet in case you fall. Wear shoes, like soft-soled boots, that will have good traction on the roof. You can also consider investing in a safety harness that will catch you if you fall. Safety harnesses can cost about $300, which is more than the cost of having a professional clean your vent, which is about $120. However, if you do a lot of work around the house, a safety harness could be a good long-term investment. [11] X Research source"
    },
    {
      "title": "Extend the ladder three feet past the roof.",
      "content": "Extend the ladder three feet past the roof. This will give you space to safely transfer from the ladder to the roof. If the ladder is not tall enough or requires an extremely steep angle to reach this height, buy a taller ladder. [12] X Research source"
    },
    {
      "title": "Keep the ladder at a 4:1 angle.",
      "content": "Keep the ladder at a 4:1 angle. This means that your ladder should extend one foot out from the house for every four feet that it extends up. This ensures that the angle is gentle enough that you will be able to climb safely. For example, if you know your roof is 21 feet tall and that you want the ladder to extend 3 feet past the roof, then the bottom the ladder should be planted 6 feet from the roof. [13] X Research source"
    },
    {
      "title": "Recruit an assistant to watch the ladder.",
      "content": "Recruit an assistant to watch the ladder. You should have someone to hold the ladder secure as you climb up. They should also watch for anything that might disturb the ladder. Keep pets and children away from the ladder."
    },
    {
      "title": "Keep two hands on the top rung of the ladder when you step onto the roof.",
      "content": "Keep two hands on the top rung of the ladder when you step onto the roof. To stay secure during the transition, keep both hands on the ladder when you initially step onto the roof. This technique requires that the ladder is positioned so as to extend well past the roof. [14] X Research source"
    }
  ]
}