{
  "url": "https://www.wikihow.com/Convert-Feet-to-Meters",
  "title": "How to Convert Feet to Meters",
  "steps": [
    {
      "title": "Take a measurement in feet.",
      "content": "Take a measurement in feet. This step is simple—just use a tape measure, ruler, yardstick, or other measuring device to determine the length you want to measure in feet. In many situations, such as in schoolwork, you'll already know the length in feet that you need to convert or this information will be given to you. In these cases, you don't need to measure anything, as you can use the measurement you've been given."
    },
    {
      "title": "Multiply or divide your measurement by a conversion factor.",
      "content": "Multiply or divide your measurement by a conversion factor. Because there are 3.28 feet in a meter, take your measurement (in feet) and divide it by 3.28 to convert to meters. You can also multiply your measurement in feet by 0.3048 to get the exact same answer because there are 0.3048 meters in a foot. [1] X Research source For instance, let's say we want to know how tall we are in meters. If we're exactly 6 feet tall, we would divide 6/3.28 = 1.83 meters. Note that 6 × 0.3048 gives the same answer. Don't forget to label your new answer in meters. For rough, on-the-fly calculations, you may want to round your conversion factors to 3.3, 0.3, etc. to make mental math much easier. Use caution, though as these rough values will cause inaccuracies in your results."
    },
    {
      "title": "Don't forget to account for inch-measurements.",
      "content": "Don't forget to account for inch-measurements. In the real world, it's fairly common that you'll hear distances described not as a whole number foot value (1 foot, 2 feet, 3 feet, etc.), but as some combination of feet and inches (20 feet and 11 inches, etc.). In cases where you must convert a distance in feet and inches to meters, simply divide the inches provided by 12 to find the equivalent number of feet (for fewer that 12 inches, this number will be less than 1.) Then, add this to your foot value and convert to meters as you normally would. [2] X Research source Let's say that we want to convert our height to meters, but we're not 6 feet tall this time. Instead, we're 5 feet 10 inches. We would solve as follows: 10 / 12 = .84 5 + .84 = 5.84 feet total 5.84 / 3.28 = 1.78 meters You can also account for inches by turning your foot value into a fraction. 5 feet and 10 inches can be though of as 5 10/12 feet because there are 12 inches in 1 foot. Simply multiply 5 by the denominator (12) and add it to the numerator (10) to get one tidy fraction: 5 10/12 ((5 × 12) + 10) / 12 = 70/12 feet. Note that 70/12 = 5.84 - the same value as obtained above. So 70/12 × 0.3048 = 1.78 meters as well."
    },
    {
      "title": "Create a conversion equation.",
      "content": "Create a conversion equation. In \"show your work\" type problems, you're often not allowed to convert directly from feet into meters because the conversion factor between feet and meters is not well-known. Luckily, it's fairly simple to set up a unit-conversion equation that uses the commonly-known conversions between inches and centimeters and centimeters and meters to get an answer. Set up a system of conversions as shown below, leaving your value for feet blank for now: [3] X Research source ____ ft * 12 in 1 ft * 2.54 cm 1 in * 1 m 100 cm = ? m Your conversion equation should account for every unit conversion you make on the way from feet to meters. It should also have one of every type of unit appear once in a numerator and once in a denominator, except for meters, which should only appear once, in a numerator."
    },
    {
      "title": "Make sure your units cancel.",
      "content": "Make sure your units cancel. If your equation is set up as described above, all of your units (except for meters) should cancel. Remember that if a unit appears both in the numerator and the denominator of a fraction (or of two fractions being multiplied), it can be removed. A good way to remember this is to think of the fraction line as meaning \"per.\" That is, the \"per\" in \"12 inches per 1 foot\", \"2.54 cm per 1 in\", and \"1 m per 100 cm\". When you think of your conversion equation in this way, it's easy to see how and why the units cancel out - you're simply taking an initial value in feet through a string of operations, changing it into inches, then centimeters, until you're finally left with meters."
    },
    {
      "title": "Plug in your value for feet, then solve.",
      "content": "Plug in your value for feet, then solve. Insert your value for feet at the beginning of the equation. Then, using a calculator, perform the calculations listed to get the end result, which will be in meters. Let's say we want to convert 20 feet to meters. We would solve as follows: 20 ft × (12 in/1 ft) × (2.54 cm/1 in) × (1 m/100 cm) = 240 in × (2.54 cm/1 in) × (1 m/100 cm) = 609.6 cm × (1 m/100 cm) = 6.096 m."
    }
  ]
}