{
  "url": "https://www.wikihow.com/Manually-Recover-Music-from-Your-iPod",
  "title": "How to Manually Recover Music from Your iPod",
  "steps": [
    {
      "title": "Make sure iTunes is installed on your computer.",
      "content": "Make sure iTunes is installed on your computer."
    },
    {
      "title": "Open the iTunes folder (located in your \"My Music\" folder) and delete everything except the \"iTunes Music\" folder.",
      "content": "Open the iTunes folder (located in your \"My Music\" folder) and delete everything except the \"iTunes Music\" folder. This will prevent iTunes from erasing any songs on your iPod that are not listed in iTunes."
    },
    {
      "title": "Connect your iPod to your computer and open iTunes.",
      "content": "Connect your iPod to your computer and open iTunes."
    },
    {
      "title": "When the message asking if you want to erase everything on your iPod and synchronize with the new library, click \"Cancel\".",
      "content": "When the message asking if you want to erase everything on your iPod and synchronize with the new library, click \"Cancel\"."
    },
    {
      "title": "Enable disk use by checking the \"Enable disk use\" box on the iPod preferences page.",
      "content": "Enable disk use by checking the \"Enable disk use\" box on the iPod preferences page."
    },
    {
      "title": "Open \"My Computer\" and double-click your iPod.",
      "content": "Open \"My Computer\" and double-click your iPod."
    },
    {
      "title": "Enable hidden folders by performing the following steps:",
      "content": "Enable hidden folders by performing the following steps: Open the \"Tools\" menu and select \"Folder Options\" (if you are using Windows Vista, the menu may be hidden - pressing the \"Alt\" key will open it) Click the \"View\" tab Select the \"Show hidden files and folders\" option, then click \"OK\""
    },
    {
      "title": "You should now see a folder called \"iPod_Control\" - open it",
      "content": "You should now see a folder called \"iPod_Control\" - open it"
    },
    {
      "title": "Make sure iTunes is open, press \"Ctrl+,\" or \"Ctrl ,\" depending on your computer, to open the iTunes preferences screen, then click the \"Advanced\" tab",
      "content": "Make sure iTunes is open, press \"Ctrl+,\" or \"Ctrl ,\" depending on your computer, to open the iTunes preferences screen, then click the \"Advanced\" tab"
    },
    {
      "title": "Select the \"Keep iTunes music folder organized\" and \"Copy files when added to iTunes library\" options, then click \"OK\"",
      "content": "Select the \"Keep iTunes music folder organized\" and \"Copy files when added to iTunes library\" options, then click \"OK\""
    },
    {
      "title": "In the iPod_Control folder, right-click the \"Music\" folder and uncheck the \"Hidden\" box.",
      "content": "In the iPod_Control folder, right-click the \"Music\" folder and uncheck the \"Hidden\" box. The next step won't work if the folder is hidden. Click \"OK\" when done."
    },
    {
      "title": "Click \"Music\" in the left-hand pane of iTunes.",
      "content": "Click \"Music\" in the left-hand pane of iTunes."
    },
    {
      "title": "This is the fun part!",
      "content": "This is the fun part! Drag the music folder to the iTunes button on your task bar and position it inside the iTunes window, then release the mouse button. Your music is now being copied to your iTunes library. If you find that all of your music file or album names are gibberish, close iTunes, repeat step 2, then... open iTunes, create a new (empty) library when prompted, and add your iTunes music folder back to your library (under the iTunes 'File' menu.. see step 15)."
    },
    {
      "title": "Turn off hidden folders if you don't want to see them.",
      "content": "Turn off hidden folders if you don't want to see them."
    },
    {
      "title": "If you have any songs in your iTunes Music folder that are not on your iPod, use the \"File -> Add Folder to Library\" option to add them to your music library.",
      "content": "If you have any songs in your iTunes Music folder that are not on your iPod, use the \"File -> Add Folder to Library\" option to add them to your music library."
    },
    {
      "title": "Select your iPod in the left pane, then click the \"Sync\" button.",
      "content": "Select your iPod in the left pane, then click the \"Sync\" button. Selecting \"Erase and Sync\" will erase all the songs on your iPod and replace them with the ones on your computer."
    }
  ]
}