{
  "url": "https://www.wikihow.com/Add-Font-in-Microsoft-Word",
  "title": "How to Install and Add a Font in Microsoft Word",
  "steps": [
    {
      "title": "Download a font from a trusted website.",
      "content": "Download a font from a trusted website. Fonts are a common way to transmit viruses, so take care to only download fonts from trusted sources. Avoid any fonts that come in EXE format, as fonts typically come packed into ZIP files or in TTF (TrueType Font) or OTF (OpenType Font) format. A few popular font sites include the following: https://www.dafont.com https://www.fontspace.com https://www.fontsquirrel.com https://www.1001freefonts.com https://fonts.google.com"
    },
    {
      "title": "Extract the font file if necessary.",
      "content": "Extract the font file if necessary. If your font is in a ZIP folder, right-click the ZIP file and select Extract All… . Follow the instructions in the unzip wizard that pops up. If the wizard asks where you want to extract the files, select a location you can find again easily (such as your Downloads folder). Skip this step if the font is in TTF or OTF format, not in a ZIP folder."
    },
    {
      "title": "Right-click the font file and select Install.",
      "content": "Right-click the font file and select Install . It's at the bottom of the contextual menu, and it has the Windows administrator shield icon next to the option."
    },
    {
      "title": "Click Yes if prompted.",
      "content": "Click Yes if prompted. Since installing a font requires administrator permissions, you may be prompted to confirm this step. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you aren't on an administrator account, you can't install a font."
    },
    {
      "title": "Wait for the font to install.",
      "content": "Wait for the font to install. This will usually only take a few seconds. Once the font is installed on your computer, it will be accessible by any programs which use system fonts, including Microsoft Word."
    },
    {
      "title": "Download a font from a trusted website.",
      "content": "Download a font from a trusted website. Fonts are a common way to transmit viruses, so take care to only download fonts from trusted sources. Avoid any fonts that come in EXE or DMG format, as fonts typically come packed into ZIP files or in TTF/OTF format. A few popular font sites include the following: https://www.dafont.com https://www.fontspace.com https://www.fontsquirrel.com https://www.1001freefonts.com https://fonts.google.com"
    },
    {
      "title": "Extract the font file if necessary.",
      "content": "Extract the font file if necessary. Since most font files download in a ZIP folder, you'll need to unzip the folder by double-clicking it and waiting for the extracted folder to open. If you aren't sure how to unzip a ZIP file on Mac, check out this wikiHow article. Skip this step if your font downloads as a TTF or OTF file, not a ZIP folder."
    },
    {
      "title": "Double-click the font file.",
      "content": "Double-click the font file. Doing so will bring up a preview window."
    },
    {
      "title": "Click Install Font.",
      "content": "Click Install Font . It's at the top of the preview window. This will install your font for all text-based programs on your Mac, thus making it usable with Microsoft Word. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Open Word and click Blank document.",
      "content": "Open Word and click Blank document . You'll find this option in the upper-left side of the launch page. Doing so opens a new Word document. If Word was open when you installed your font, close the program and restart it. Your custom font won't show up until Word is restarted."
    },
    {
      "title": "Click the dropdown next to the font name in the Home tab.",
      "content": "Click the dropdown next to the font name in the Home tab. The font dropdown is in the upper-left corner of the Font section of the Home tab, directly above the buttons to bold, italicize, or underline your text."
    },
    {
      "title": "Find your new font.",
      "content": "Find your new font. Scroll through the drop-down menu until you find your font's name. If you don't remember your font's name, check your Downloads folder."
    },
    {
      "title": "Test the font.",
      "content": "Test the font. Click the font's name, then try typing using the font. You may need to adjust the size of the font in order for it to be legible."
    }
  ]
}