{
  "url": "https://www.wikihow.com/Encourage-a-Friend",
  "title": "How to Encourage a Friend",
  "steps": [
    {
      "title": "Make contact.",
      "content": "Make contact. When you find out that someone is going through a crisis, whether it's a divorce or break-up or an illness or the death of a loved one, get in contact with them as soon as possible. People who are in a difficult or crisis situation tend to feel isolated. If the person is across the country or far away, make a phone call, send an email, or text them. You don't have to mention that you know they're having a difficult time. Just being there for them, asking them how they're doing, offering your support can be a huge boon to someone who's struggling with life. While you shouldn't just drop in on someone unannounced, it can be a good thing to visit someone in person. This is especially important if they're dealing with an illness that makes it difficult to leave the house."
    },
    {
      "title": "Listen to them without judgment.",
      "content": "Listen to them without judgment. People need to tell their stories in their own time, especially if they're going through a crisis. [1] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. Of course you're going to have opinions about their situation, but it isn't always necessary to share that advice, especially unsolicited. [2] X Research source Focus on your friend, and focus on giving them someone to confide in, so they work through the healing process. If you have been through a similar situation as your friend, then you should use your past experiences to grant advice. You can ask if they would like your advice, but don't be surprised if that isn't what they're really after."
    },
    {
      "title": "Offer practical help.",
      "content": "Offer practical help. Instead of offering advice, what you can offer is some actual help. This can make a huge difference for someone who is struggling to cope with a difficult situation. Even doing some little things can make a difference. Help them out with some chores like doing their grocery shopping for them, helping clean their house, take their dog for a walk. These basics tasks are usually the first to fall by the wayside when someone's life is coming apart."
    },
    {
      "title": "Let your friend deal with their emotions in their own time.",
      "content": "Let your friend deal with their emotions in their own time. Emotions involved in difficult life changes (illness, death of a loved one, divorce or break-up) tend to come in waves. One day your friend might be coping okay with the change and the next day they're completely falling apart. Never say something like \"It seemed like you were doing okay, what happened,\" or \"Haven't you grieved enough?\" Tamp down on your own discomfort in the face of their emotions. Sure, strong emotions especially from someone you care about can be hard to face. Remember though, this isn't about you. This is about your friend and the difficult time they're going through. Make sure they feel comfortable enough to express their feelings around you."
    },
    {
      "title": "Offer to be a support buddy.",
      "content": "Offer to be a support buddy. Make sure that your friend knows that you are here to help them and support them. While it's best to have more than one support buddy for your friend so the burden doesn't fall entirely to you, make a point of being one of those buddies for your friend. [3] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. Let your friend know they're not burdening you. Say something like \"Call me anytime you are feeling upset or overwhelmed! I want to help you deal with this difficult situation.\" This is especially important when it comes to breakups or divorces. The support buddy is the person that they call when they want to call their ex. Share with them what you see as their value and unique qualities. [4] X Expert Source Hyungbum Kang, MA, MSW, LCSW, MAC Licensed Clinical Social Worker Expert Interview. 22 July 2021."
    },
    {
      "title": "Encourage your friend to keep up with the basics.",
      "content": "Encourage your friend to keep up with the basics. When someone is going through a difficult life event, the basic functions of life tend to get forgotten. This why people who are going through an illness or grieving a death and so on tend to forget to eat, stop caring for their physical appearance, and are less likely to leave the house. Remind them to do things like shower, and exercise. The best way to do this is to offer to go on a walk with them, or to take them out for coffee so they have to put a little effort into their appearance. To get them to eat, it's good to bring over food so that they don't have to do the cooking and the washing up afterwards. Or you can take them out to eat (or order in if they aren't up to much human interaction)."
    },
    {
      "title": "Don't take over their life.",
      "content": "Don't take over their life. While many people have totally good intentions when it comes to helping someone having a tough time, you can overwhelm someone with your help. You can also take away the power from them. Times of divorce or illness, or the death of a loved one can have feelings of powerlessness. Offer options. Don't just take your friend to dinner, ask them where they want to dine and when they want to dine. Letting them make decisions, even if they're small decisions can go long way towards reclaiming their power. Don't spend lots of money on them. Taking them to their nails done for cheap is one thing, but spending too much money on them will make them feel like they owe you and will make them feel like they can't care for themselves."
    },
    {
      "title": "Take care of yourself.",
      "content": "Take care of yourself. When there's a crisis in a friend's life it has a tendency to drag up all kinds of emotions in you, as well. This is especially true if you've experienced something similar to what they're going through. Set boundaries. Even though you want to keep up with your friend as they struggle through their problems, you need to make sure that your life doesn't start to revolve around them. Know what behaviors and situations trigger you. If you're dealing with a friend who has recently escaped an abusive home, and that's something you've had to deal with, you might need to back off a little."
    },
    {
      "title": "Continue to check in.",
      "content": "Continue to check in. People have a tendency to be very solicitous towards someone immediately after their life falls apart, but fall away as time goes on. Make sure you don't do this. Make sure your friend knows that they can call on you if they need to, and that you keep up with how they're doing."
    },
    {
      "title": "Recognize the symptoms of depression.",
      "content": "Recognize the symptoms of depression. Sometimes people aren't necessarily depressed, they're simply going through a difficult time of life. However, if a friend shows signs of depression, you may need to pay close attention to make sure that it doesn't get worse. Do they exhibit persistent sad, anxious, or empty moods? Do they present feelings of hopelessness or pessimism (nothing will ever get better; life is terrible)? Do they have lots of feelings of guilt, worthlessness, or helplessness? Are they fatigued, have decreased energy? Do they have difficulty concentrating on things, remembering things, or making decisions? Have you noticed insomnia, or oversleeping? Have they lost or gained significant weight? Are they restless and irritable? Have they mentioned or talked about thinking about death or suicide? Have they made or talked about making a suicide attempt? This could show by them saying something about how the world world be a better place if they weren't in it."
    },
    {
      "title": "Validate their pain, but don't stay there.",
      "content": "Validate their pain, but don't stay there. Remember that their pain and feelings of hopelessness and helplessness are real. [5] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. Validate the fact that they feel these negative feelings and then do your best to turn their attention elsewhere. [6] X Research source Depressed people may respond to distractions. You don't have to make the distraction super obvious. If you're taking a walk, for example, pointing out the beauty of the light on the water, or the color of the sky can turn the conversation. Going over the same negative feelings again and again can actually make things worse, because it encourages a depressed person to remain in that negative place. Reader Poll: We asked 349 wikiHow readers, and 51% of them agreed that the symptoms of depression they find the most challenging to deal with are intense feelings of sadness and despair . [Take Poll] Supporting your friend and offering a distraction can help them feel better."
    },
    {
      "title": "Avoid taking their depression personally.",
      "content": "Avoid taking their depression personally. When someone is depressed they often have difficulty connecting to anyone on an emotional level, because of what they are going through. Taking it personally will mean that they will have a more difficult time reaching out. A depressed person might lash out by saying something hurtful or angry towards you. Remember that this is the depression not the friend who is saying those things. This doesn't mean that you need to take abuse from them. If your friend is becoming abusive, as well as depressed, then they need the help of a therapist. You're probably not going to be able to help them except by assuring them that you'll be there for them when they stop hurting you."
    },
    {
      "title": "Don't underestimate how serious depression can be.",
      "content": "Don't underestimate how serious depression can be. Depression is often linked to a chemical imbalance in someone's brain. It is much more than simply being sad, or being unhappy. It can feel, to the depressed person, like they're being swallowed by despair or by emptiness. Never do things like tell someone to “get over it” or that they could be happy if they'd only “do yoga” “lose weight” “get out more” etc. This will simply make them not trust you and will make them feel worse and guilty about what they're going through."
    },
    {
      "title": "Offer to help with small things.",
      "content": "Offer to help with small things. Depression can make it incredibly difficult to do anything, including clean the house, wash dishes, go to work. Doing little things to lighten their burden can make a huge difference. People who are dealing with depression spend most of their energy struggling against and being swallowed up by their mental disorder. That doesn't leave much energy for doing household tasks. Occasionally bring by a nice cooked dinner, or offer to help them clean their house. Ask if you can take their dog for a walk with them."
    },
    {
      "title": "Be a compassionate listener.",
      "content": "Be a compassionate listener. Depression is not something that you can simply fix. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Offering a listening ear to someone can be more helpful than giving lots of advice or opinions about what they're going through. [8] X Expert Source Michelle Joy, MA, MFT Licensed Marriage & Family Therapist Expert Interview. 26 June 2020. Some ways to help start the conversation might be: \"I have been feeling concerned about you lately\" or \" I wanted to check in with you because you have seemed pretty down lately.\" If they're having difficulty with expressing their feelings or opening up you can ask some questions to help: \" Did something happen that made you start feeling this way?\" or \"When did you begin feeling like this?\" Some good things to say: \"You are not alone in this. I'm here for you,\" and \"I care about you and I want to help you through this difficult time,\" and \"You are so important to me. Your life is so important to me.\""
    },
    {
      "title": "Remember that you aren't their therapist.",
      "content": "Remember that you aren't their therapist. Even if you are a trained therapist, you shouldn't be practicing on a friend, especially if it's outside of your working hours. Being there for someone going through depression and listening to them does not mean that you get to take responsibility for their mental state. If your friend is consistently calling you in the middle of the night when you need your sleep, or talks about committing suicide, or seems to be stuck in the same horrible place for months or years, they need to talk to a therapist rather than you."
    },
    {
      "title": "Encourage your friend to seek professional help.",
      "content": "Encourage your friend to seek professional help. While you can offer encouragement and support for a friend, you can't give them the professional help they need, and you can't make the depression go away through sheer force of will. This can be a difficult conversation to have, but if you care about your friend, it's important to have. Ask them if they've ever considered or gone to a professional for help. Recommend helping resources, or if you know of a good professional, recommend them."
    },
    {
      "title": "Know that depression can come and go.",
      "content": "Know that depression can come and go. Depression isn't something that comes once and then is gone once you've taken a little medication (this isn't the chicken pox). It can be a lifelong struggle even if your friend finds the right medication. Don't give up on them. Depression can be incredibly lonely and isolating and it can make someone feel like they're crazy. Having people who support them can make all the difference."
    },
    {
      "title": "Set your own boundaries.",
      "content": "Set your own boundaries. Your friend is important to you, of course, and you want to do everything in your power to encourage their healing. You can't lose sight of yourself while you're offering your support. Make sure that you're taking care of yourself. Take breaks from the depressed person. Spend time with people who aren't depressed and don't need your support. Remember, that if you aren't getting (or haven't had) a reciprocal relationship with this friend then the relationship could end up abusive and one-sided. Don't get sucked into that type of situation."
    },
    {
      "title": "Don't tell them they need to lose weight.",
      "content": "Don't tell them they need to lose weight. You are not the boss of anyone but yourself and telling a friend they need to lose weight is rude and can lose you their friendship. People are going to make their own decisions and at a certain point they need to be allowed to decide what they need for themselves. [9] X Research source This is true even if their weight has become a health problem. Chances are they recognize that it's a problem and if they want to do something about it, they will."
    },
    {
      "title": "Become an active part of their weight-loss program.",
      "content": "Become an active part of their weight-loss program. When a friend is committed to losing weight they will need the support from their friends. If they're willing to share with you, find out as much as you can about the diet and exercise regime they're undergoing. [10] X Research source Commit to exercising with them. Tell them that you'll bike to work with them, or go for a run in the evenings every day. Go to the gym with them and offer encouragement. Eat the dishes that they prepare, or some of their diet food with them so that they don't feel so isolated in their food choices."
    },
    {
      "title": "Focus on what they're doing right.",
      "content": "Focus on what they're doing right. It isn't your job to monitor how they're doing. Unless they specifically ask you to do this, don't focus on how they're doing, what they're eating, when the screw up, and so on. You aren't the diet police. You're here to support and encourage them, not take them to task. Cheer on the little victories and the things they accomplish. Avoid criticizing when they fail to do something right. If they eat the wrong foods or go a little slack on their exercising, that isn't your job to tell them to shape up."
    },
    {
      "title": "Celebrate achievements along the way.",
      "content": "Celebrate achievements along the way. When they've lost some weight, or when they've managed to step up their exercise program, make sure you celebrate that. Make sure that these celebrations don't focus on and aren't centered around food. Take them out to a movie, or buy them a pedicure, or that lovely new book they've been craving."
    },
    {
      "title": "Care about the person, not the diet.",
      "content": "Care about the person, not the diet. When you talk to them, don't focus on the diet, on what they've accomplished or where they've fallen short. Instead, ask how they've been doing (them as a person), how their dog is doing, how their schooling is going, and what the new changes are at the job. Remember: whether they succeed or fail with losing weight, this is your friend. Their life shouldn't have to revolve around weight-loss and how much they weigh."
    },
    {
      "title": "Avoid going overboard with helpfulness.",
      "content": "Avoid going overboard with helpfulness. It's tempting to show someone how much you're there for them by giving them lots of \"helpful\" ideas for how to do things better, or giving them exercise plans and weight-loss books. Don't do this. It's better to ask what they need, and simply be there for them, than to push in where you're not wanted."
    }
  ]
}