{
  "url": "https://www.wikihow.com/Identify-a-Pomeranian",
  "title": "How to Identify a Pomeranian",
  "steps": [
    {
      "title": "Check the dog's size.",
      "content": "Check the dog's size. Pomeranians are very tiny dogs. They are only 6–7 inches (15–18 cm) tall and weigh 3–7 pounds (1.4–3.2 kg). [3] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Examine the eyes.",
      "content": "Examine the eyes. The eyes of a Pomeranian are dark and bright. They are almond-shaped and medium in size. [6] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Locate the ears.",
      "content": "Locate the ears. Pomeranians have small ears. The ears are carried erect and mounted high. [7] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Notice the muzzle.",
      "content": "Notice the muzzle. A Pomeranian's muzzle is short and straight, usually with a scissors bite and a black nose, though the nose may be self-colored in chocolate, beaver, and blue dogs. [8] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The muzzle and face are often called \"fox-like\". [9] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Find the tail.",
      "content": "Find the tail. Pomeranians have tails that lie flat and straight on the back. [10] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source The tails are heavily plumed and set high. [11] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Look at the overall structure of the dog.",
      "content": "Look at the overall structure of the dog. The build of a Pomeranian is compact and sturdy. Pomeranians are medium-boned, short-backed, and moderately muscled. [12] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source They have a brisk, smooth, balanced gait. [13] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Check how the coat appears and feels.",
      "content": "Check how the coat appears and feels. Pomeranians have double coats. This includes a short, dense undercoat and a long, harsh-haired outer coat. [14] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Pomeranians have ruffs around their necks that frame the head and extend over the chest and shoulders, along with feathered forelegs, heavily coated thighs and hind legs, and plumed tails. [15] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Identify the coat color.",
      "content": "Identify the coat color. Pomeranians have a very wide range of coat colors and patterns. Coat colors are broken down into three classifications: red, orange, cream, and sable; black, brown, and blue; and any other color, pattern, or variation. [16] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source Patterns include brindle, parti, piebald, extreme piebald, Irish, and tan points (which are seen above the eyes, inside the ears, on the muzzle, throat, forechest, legs, feet, and the underside of the tail). [17] X Trustworthy Source American Kennel Club Expert knowledge, resources and advice for all things dog-related. Go to source"
    },
    {
      "title": "Notice the \"cut\".",
      "content": "Notice the \"cut\". Some people choose to give their Pomeranians specific haircuts rather than keeping the traditional cut. Some of these cuts may include the Teddy Bear cut, Lion cut, Show cut, and Puppy cut. [18] X Research source The Teddy Bear cut is seen as somewhat short fur with a circular clip around the head. [19] X Research source The Lion cut appears as shaving most of the fur while keeping the fur around the head, chest, and legs long. [20] X Research source The Show cut is cutting to meet dog show standards, such as trimming the fur so it appears long and fluffy. [21] X Research source The Puppy cut is seen as trimming the cost to a short, consistent length. [22] X Research source"
    },
    {
      "title": "Watch for affection.",
      "content": "Watch for affection. Pomeranians are very friendly, affectionate, and loyal. They enjoy spending every second with their families. [23] X Research source"
    },
    {
      "title": "Notice boldness.",
      "content": "Notice boldness. Despite their small size, Pomeranians are very bold. They are confident and may be prone to expecting that they're in charge. [24] X Research source"
    },
    {
      "title": "Look for curiosity.",
      "content": "Look for curiosity. Pomeranians are inquisitive about the world around them. You may see a Pomeranian walking around while sniffing the ground or exploring the area. [25] X Research source"
    },
    {
      "title": "Pay attention to how social the dog is.",
      "content": "Pay attention to how social the dog is. Overall, Pomeranians are sociable dogs. They are usually quick to get along with other animals. [26] X Research source"
    },
    {
      "title": "See if the dog is alert.",
      "content": "See if the dog is alert. The Pomeranian is an alert and intelligent breed. Anticipate barking from a Pomeranian, and see if their alertness enables them to be a good watchdog. [27] X Research source"
    }
  ]
}