{
  "url": "https://www.wikihow.com/Calculate-Range",
  "title": "How to Calculate Range",
  "steps": [
    {
      "title": "List the elements of your data set.",
      "content": "List the elements of your data set. To find the range of a set, you'll need to list all of the elements of the set so that you can identify the highest and lowest numbers. Write down all of the elements. The numbers in this set are: 20, 24, 25,19, 24, 28 and 14. [1] X Expert Source David Jia Academic Tutor Expert Interview. 14 January 2021. It can be easier to identify the highest and lowest number in the set if you list the numbers in ascending order. In this example, the set would be rearranged like this: 14, 19, 20, 24, 24, 25, 28. [2] X Research source Listing the elements of the set in order can also help you make other calculations, such as finding the mode, mean, or median of the set. [3] X Research source"
    },
    {
      "title": "Identify the highest and lowest numbers in the set.",
      "content": "Identify the highest and lowest numbers in the set. [4] X Research source In this case, the lowest number in the set is 14 and the highest number is 28. [5] X Expert Source David Jia Academic Tutor Expert Interview. 14 January 2021."
    },
    {
      "title": "Subtract",
      "content": "Subtract the smallest number in your data set from the largest number. Now that you've identified the smallest and largest numbers in the set, all you have to do is subtract them from each other. [6] X Research source Subtract 14 from 28 (28 - 14) to get 14, the range of the set. [7] X Expert Source David Jia Academic Tutor Expert Interview. 14 January 2021."
    },
    {
      "title": "Label the range clearly.",
      "content": "Label the range clearly. Once you've found the range, label it clearly. This will help you avoid confusing it with any other statistical calculations that you may need to make for the set, such as finding the median, mode, or mean. [8] X Research source"
    }
  ]
}