{
  "url": "https://www.wikihow.com/Comfort-Someone-Physically",
  "title": "How to Comfort Someone Physically",
  "steps": [
    {
      "title": "Yes, most people tend to crave physical touch when they’re upset.",
      "content": "Yes, most people tend to crave physical touch when they’re upset. There’s a reason babies often stop crying when their parents pick them up. People are hardwired to desire physical contact, and something as small as a hug can dramatically improve the way someone feels. Physical touch can even release the chemical in your brain responsible for feelings of love! If someone is having a rough time, physical affection can be a phenomenal way to make them feel better. [2] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Touch can also soothe someone’s fight or flight response. If you’ve ever seen someone get so angry they want to fight, they often calm down when a friend holds them back and gives them a bear hug. [3] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "However, some people dislike physical affection when they’re sad.",
      "content": "However, some people dislike physical affection when they’re sad. While most folks really appreciate a well-timed hug or pat on the shoulder, some people just don’t grow up associating physical touch with comfort. If a person has a tendency to shy away from physical touch when they aren’t upset, they probably won’t crave contact when they’re upset. [4] X Research source This is often the case for people who grow up with parents who relied more on verbal praise or gifts as rewards or comfort. If parents don’t communicate the idea that a hug means you love someone, they may not grow up craving physical contact."
    },
    {
      "title": "If you normally hug and get touchy when things are good, go ahead.",
      "content": "If you normally hug and get touchy when things are good, go ahead. If this is a close friend or family member you would usually hug or put your arm around when the two of you are hanging out, it’s okay to comfort them physically when they’re going through a rough time. They’ll understand you’re just trying to be kind and supportive. [5] X Research source If they’re in your immediate family, you’re dating, or you’ve been good friends for a while, it’s safe to assume you can touch them. Keep in mind, the person could go from needing physical comfort to not wanting to be touched in a matter of seconds, so be prepared to stop if they need some space. If you two don’t normally hug, slap each other’s backs, or playfully touch one another, it probably isn’t appropriate to start touching them now."
    },
    {
      "title": "Ask if you can comfort them physically if you aren’t sure it’s appropriate.",
      "content": "Ask if you can comfort them physically if you aren’t sure it’s appropriate. [6] X Expert Source Sarah Schewitz, PsyD Licensed Psychologist Expert Interview. 15 April 2019. In fact, asking may make them feel really supported and loved—even if they end up declining your offer. Let them finish whatever they’re saying if they’re talking, or simply ask them out of nowhere when they’re clearly feeling down. [7] X Research source “Can I give you a hug?” or, “Do you want a hug?” “What can I do to make you feel better?” “I’m totally here if you need a shoulder to cry on.” “Do you mind if I just sit here for a minute and put my arm around you?”"
    },
    {
      "title": "If you don’t have a touchy relationship and they’re venting, hold off.",
      "content": "If you don’t have a touchy relationship and they’re venting, hold off. The fact that they’re speaking means they want you to listen. If you go in for a hug now, it may come off the wrong way. Hear them out , talk to them, and be as supportive as you can. If they ask for a hug or something, give it to them if you’re comfortable with that. [8] X Research source Witness their feelings. Just hear them. A lot of people need someone to listen to them when they’re going through something difficult and that’s it. Tell them you’re sorry for what they’re going through. You might say, “I really wish there was something I could do, I know you’re going through a lot.” Only offer advice if they solicit it from you. Giving your perspective when they’re trying to share their feelings is often unhelpful."
    },
    {
      "title": "Pat them on the back or shoulder for a super friendly way to show love.",
      "content": "Pat them on the back or shoulder for a super friendly way to show love. [9] X Expert Source Sarah Schewitz, PsyD Licensed Psychologist Expert Interview. 15 April 2019. If you’re a little uncomfortable getting super-physical with a hug or steady hand on the back, the hand pat is a move that doesn’t involve a ton of touching. It’s also unlikely to be misinterpreted as anything other than a platonic gesture. Just pat them a few times on the shoulder or upper back and they may feel better. [10] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Place your open palm on their back to show them support.",
      "content": "Place your open palm on their back to show them support. The hand on the back is a classic sign of support. It’s friendly, and warm, and it communicates that you’ve got their back (figuratively speaking). You can move your hand back and forth to soothe them or keep it still to let them know you’re there for them. [11] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source As a rule of thumb, keep your hand up high. A hand on the lower back can be interpreted as a romantic move."
    },
    {
      "title": "If you’re sitting side-by-side, put your arm around their shoulder.",
      "content": "If you’re sitting side-by-side, put your arm around their shoulder. Loop your nearest arm over their shoulders. You can either pull them into you for a kind of side hug or just hold your arm still. A little back rub can add a nice touch. This is an expressive way to show support and it’s not super invasive or too intimate if you’re worried about coming on too strong. If they’re hunched over, looking at the ground, they may really appreciate someone showing them some support like this."
    },
    {
      "title": "For a friendly, playful sign of support on the go, link your arms together.",
      "content": "For a friendly, playful sign of support on the go, link your arms together. Are you walking somewhere with a friend and they’re telling you about how tough of a time they’re having, wrap your arm around their arm as you walk. It’s a little thing, but it can really signal to someone that they’ve got a friend in you. [12] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source This is a little too playful if they’re going through something truly serious, but if they’re just annoyed or feeling a little blue, it’s a fun way to show your support."
    },
    {
      "title": "A big bear hug is a great way to help someone in crisis.",
      "content": "A big bear hug is a great way to help someone in crisis. If they’re crying their eyes out and it’s clear they’re really struggling, a hug is a great way to say, “I am here for you.” Wrap your arms around them, pull them tight to your chest, and hold them as long as you’re comfortable with. [13] X Research source If you aren’t super close, aim to let go after about three seconds, which is the standard length of time for a hug. [14] X Research source"
    },
    {
      "title": "Offer them a shoulder to cry on so they don’t feel so alone.",
      "content": "Offer them a shoulder to cry on so they don’t feel so alone. If they’re crying, they may appreciate the physical support as they get it out. Sit next to them, put your arm around them, and let them cry it out on your shoulder. It’s a lot like crying into a pillow if you’re having a rough time, and it could be just what they need at the moment to start feeling better. [15] X Research source"
    },
    {
      "title": "If it’s your partner or a very close friend, hold them to soothe them.",
      "content": "If it’s your partner or a very close friend, hold them to soothe them. The hug doesn’t have to end if this is someone very close to you. Simply hold on to them and let them cry it out, shout, or continue to complain. Holding someone like this can be extremely soothing, and it can even lower cortisol levels—that’s the hormone responsible for stress! [16] X Research source Keep holding them like this until they pull away, or either of you is no longer comfortable."
    },
    {
      "title": "The handhold is an intimate, meaningful way to support a partner.",
      "content": "The handhold is an intimate, meaningful way to support a partner. If your romantic partner is having a rough time, pick their hand up in yours and hold it. [17] X Expert Source Sarah Schewitz, PsyD Licensed Psychologist Expert Interview. 15 April 2019. Put one hand underneath, palm to palm, and the other hand on top so they feel your warmth. Alternatively, you can just hold their palm the same way you would when you’re walking together. This is a good way to express love and support while the two of you talk. [18] X Research source You can absolutely hold someone’s hand if they’re a family member or platonic friend, but most people are likely to be a little confused. This is generally a very intimate move reserved for couples."
    }
  ]
}