{
  "url": "https://www.wikihow.com/Delete-Games-on-Nintendo-Switch",
  "title": "How to Delete and Uninstall Games on Nintendo Switch",
  "steps": [
    {
      "title": "Power on your Nintendo Switch.",
      "content": "Power on your Nintendo Switch. If you have not already turned on your Switch, do so now. You can delete a game while using your Switch in either handheld or TV mode."
    },
    {
      "title": "Navigate to your Settings.",
      "content": "Navigate to your Settings. It is represented by the gear icon in the menu located along the bottom of your screen."
    },
    {
      "title": "Navigate to the Data Management section.",
      "content": "Navigate to the Data Management section. You can find it listed among the options on the lefthand side of your screen."
    },
    {
      "title": "Select \"Software\".",
      "content": "Select \"Software\". From the Data Management menu, tap Software to view all software downloaded to your Switch."
    },
    {
      "title": "Tap on the game you want to delete.",
      "content": "Tap on the game you want to delete. You will see a full list of all the games on your Switch, as well as how much storage each game is taking up. Select the game you want to delete to open its info page. Deleting a game will not impact your save data. Because your save data is tied to your Nintendo account, your progress will be restored if you ever redownload the game. [1] X Research source If you do not want to delete the data, consider moving it to a microSD card instead."
    },
    {
      "title": "Tap \"Delete Software\".",
      "content": "Tap \"Delete Software\". Then, confirm that you want to delete the game by selecting Delete in the pop-up. [2] X Research source The game's icon will be removed from your Switch's homepage as well. If your Switch is running the latest system version, you will also be able to select Archive Software instead. This deletes it from your system but keeps the icon stored on your homepage for easy access if you choose to redownload."
    }
  ]
}