{
  "url": "https://www.wikihow.com/Fix-Quiet-Airpods",
  "title": "10 Easy Ways to Fix the Low Volume on Your AirPods",
  "steps": [
    {
      "title": "This may sound obvious, but the volume may have been turned down.",
      "content": "This may sound obvious, but the volume may have been turned down. You can check the volume with Siri (\"Hey Siri, what's the volume?\") or by pressing either volume button on your iPhone or iPad. [1] X Research source"
    },
    {
      "title": "If your AirPods are low on battery power, the volume may decrease.",
      "content": "If your AirPods are low on battery power , the volume may decrease. Give your AirPods a full charge to see if that improves the issue. You can check the volume by placing your AirPods inside the charging case and opening its lid near your iPhone or iPad. If you're using a Mac, click the Bluetooth icon in the menu bar, hold the mouse cursor over the AirPods on the menu to see the battery level. [2] X Research source"
    },
    {
      "title": "Your AirPods spend a lot of time in your ears, which can lead to waxy buildup.",
      "content": "Your AirPods spend a lot of time in your ears, which can lead to waxy buildup. Even a small amount of buildup over the speakers inside of your AirPods can significantly lower the volume. Apple recommends cleaning the delicate speaker mesh inside of your AirPods with a dry cotton swab, as liquids can damage your AirPods. [3] X Research source Gently swab away any buildup, but be careful not to push too hard on the speaker mesh. For more difficult jobs, try a soft bristle toothbrush or a high-quality electronics gel putty. If you still see buildup on the speakers and you have a steady hand, you can use a SIM removal tool, tweezers, or a tiny screwdriver to gently work the buildup out of the holes. This isn't recommended by Apple, so try it at your own risk! Be very careful not to push the wax deeper into the speaker mesh—just scrape gently across the holes and around the edges until the gunk is gone. One you've pried away the gunk, use a dry, lint-free cloth to wipe away the remaining debris. You can also slightly dampen the cloth or cotton swab with isopropyl alcohol and give the AirPods a good wipe-down to disinfect them. Another alternative is to take your air pods to a Apple shop and have them professionally cleaned."
    },
    {
      "title": "If one of your AirPods is quieter than the other, the audio balance may be off-center.",
      "content": "If one of your AirPods is quieter than the other, the audio balance may be off-center. You'll find your audio balance settings in your iPhone or iPad's Accessibility options: [4] X Research source Open the Settings app and tap Accessibility' . Tap Audio/Visual . Move the \"Balance\" slider to the center position so the volume is equal in both the Left and Right earpieces."
    },
    {
      "title": "If you're using an iPhone or iPad in Low Power Mode to conserve battery power, your volume may be lower than usual.",
      "content": "If you're using an iPhone or iPad in Low Power Mode to conserve battery power, your volume may be lower than usual. This is true even if your AirPods are fully charged. To turn off lower power mode: Open the Control Center by swiping down from the top-corner of the Home screen (if your iPhone has Face ID) or swiping up from the bottom of the Home screen (if your iPhone has Touch ID). If the battery icon is yellow on a white background, tap it to turn it off. If you don't see a battery icon, go to Settings > Battery and disable Low Power Mode there. [5] X Research source"
    },
    {
      "title": "If you're using an iPhone or iPad, your iPhone may be regulating the volume of your headphones.",
      "content": "If you're using an iPhone or iPad, your iPhone may be regulating the volume of your headphones. While Apple's volume regulation is meant to protect your hearing, it doesn't work for everyone. [6] X Research source Open your iPhone's Settings. Tap Sounds & Haptics . Tap Headphone Safety . To prevent your iPhone from automatically decreasing your AirPods volume if you exceed a certain volume, tap the \"Headphone Notifications\" switch to turn it off (gray). If \"Reduce Loud Sounds\" is enabled, your AirPods will not play music louder than what's specified on the slider. You can toggle the switch Off to play all loud sounds, or adjust the toggle switch to allow louder sounds to come through while still protecting your ears from the highest decibel sounds. Some Apple and Reddit forum users say that enabling Reduce Loud Sounds and dragging the slider all the way to \"100 decibels\" actually results in louder volume than disabling Reduce Loud Sounds completely. In some regions, these features are enabled permanently and you won't be able to turn them off. [7] X Research source"
    },
    {
      "title": "If the volume is still too quiet, check out the Headphone Accessibility options.",
      "content": "If the volume is still too quiet, check out the Headphone Accessibility options. There are several accessibility features that can help boost the volume of certain sounds in audio and on phone calls: [8] X Research source Open the Settings app and tap Accessibility . Tap Audio/Visual . Toggle the \"Headphone Accommodations\" switch to the On position. At the bottom of the screen, choose whether to apply these changes to Phone (which also applies to FaceTime and other video calling apps), Media (for music, movies, podcasts, Siri, and other media), or both. [9] X Research source Tap one of the options under \"Tune Audio For\" to choose an optimization profile. You may want to play a song while doing this so you can hear the change in real time. You can also tap Custom Audio Setup to listen to audio samples and choose the ones that sound best to you."
    },
    {
      "title": "If you often switch between devices, such as your Mac and iPhone, your AirPods might be confused.",
      "content": "If you often switch between devices, such as your Mac and iPhone, your AirPods might be confused. This recalibration trick might help: With your AirPods paired to any of your devices, start playing some music. Turn the volume all the way down to 0 with the music still playing. Open your Bluetooth settings and disconnect your AirPods—don't \"forget\" them, just disconnect them for now by turning off Bluetooth for a moment. Keep your AirPods in your ears. Continue playing music on your device, but keep the volume at 0. If the volume increased when you disconnected the AirPods, reduce the volume all the way back to 0 again. Reconnect your AirPods to Bluetooth and then turn the volume back up."
    },
    {
      "title": "If you're using the Music app, you can change the EQ for a louder sound.",
      "content": "If you're using the Music app, you can change the EQ for a louder sound. There are lots of audio settings to choose from, but some are louder than others. [10] X Research source To change the EQ: Start playing any song in the Music app. Open the Settings app and tap Music . Tap EQ . Try the different EQ settings until you find one that sounds good. The Late Night setting seems to be the loudest of the group, but you might find better results with a different setting. Despite its name, the \"Loudness\" EQ setting actually decreases the loudest sounds."
    },
    {
      "title": "Noise Cancellation Mode",
      "content": "Noise Cancellation Mode blocks out background noise so you can only hear the audio in your AirPods. If you're using AirPods Pro or AirPods Max and switched to a different mode, such as Transparency Mode (which lets outside noises in) or disabled both modes completely, your music and phone calls may seem quieter when there's a lot of background noise. [11] X Research source On your iPhone or iPad, swipe down from the top-right of the Home screen (if you have Face ID) or swipe up from the bottom (if you have Touch ID), press and hold the volume control, tap Noise Control , and select Noise Cancellation . [12] X Research source On a Mac, click the AirPods icon in the menu bar and select Noise Cancellation . If you're using AirPods Pro, you can also press and hold either of the Force Sensors on the stem of your AirPods until you hear a chime. Each time you do this, you switch between Noise Cancellation and Transparency Modes. If you have AirPods Max, press the noise control button on the top of the right headphone to switch between modes."
    }
  ]
}