{
  "url": "https://www.wikihow.com/Log-Out-of-Hotmail",
  "title": "How to Log Out of Hotmail",
  "steps": [
    {
      "title": "Open the Outlook app on your phone or tablet.",
      "content": "Open the Outlook app on your phone or tablet. It's the icon that looks like a calendar and envelope with an \"O\" on it. This method will only log you out of the current session. If you are logged in on another computer, phone, or tablet, you'll remain logged in there unless you log out of all locations ."
    },
    {
      "title": "Tap your profile photo.",
      "content": "Tap your profile photo. It's at the top-left corner. If you don't have a profile photo set, you'll see an outline of a person's head and shoulders there instead."
    },
    {
      "title": "Tap the gear icon.",
      "content": "Tap the gear icon. It's at the bottom-left corner."
    },
    {
      "title": "Tap the account you want to sign out from.",
      "content": "Tap the account you want to sign out from. Any signed-in accounts appear below the \"Mail Accounts\" header. If you have more than one account signed in, you'll need to sign out from each separately."
    },
    {
      "title": "Tap Delete Account.",
      "content": "Tap Delete Account . It's at the bottom. Don't worry, this won't permanently delete your Hotmail/Outlook account—it'll just remove it from the app on your phone or tablet. You can always add it back at any time. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Tap Delete to confirm.",
      "content": "Tap Delete to confirm. You are now signed out of this account on this phone or tablet. To sign back in, just re-open the app, select Add Account , and enter your login information as prompted."
    },
    {
      "title": "Go to https://www.outlook.com in your web browser.",
      "content": "Go to https://www.outlook.com in your web browser. This displays your Hotmail inbox if you're logged in. This method will only log you out of the current session. If you are logged in on another computer, phone, or tablet, you'll remain logged in there unless you log out of all locations ."
    },
    {
      "title": "Click your initials or profile photo.",
      "content": "Click your initials or profile photo. You'll find this in the top-right corner of your inbox. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Sign Out.",
      "content": "Click Sign Out . It's at the top-right corner of the menu. This signs you out on this computer. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Go to https://account.microsoft.com/security in a web browser.",
      "content": "Go to https://account.microsoft.com/security in a web browser. As of 2021, Microsoft has implemented a feature that allows you to log out of Outlook (formerly Hotmail) everywhere else that you're signed in. Unfortunately, it can take up to 24 hours for the remote devices to be logged out. [4] X Research source You can use this feature on a computer, phone, or tablet."
    },
    {
      "title": "Click Advanced security options.",
      "content": "Click Advanced security options . It's the tile with a lockbox, key, and padlock inside."
    },
    {
      "title": "Click Sign me out.",
      "content": "Click Sign me out . It's the blue link below the \"Additional security\" section. A confirmation message will appear, telling you the setting should take effect within 24 hours."
    },
    {
      "title": "Click Sign me out to confirm.",
      "content": "Click Sign me out to confirm. You will be signed out of your Hotmail/Outlook account everywhere you are signed in within the next 24 hours. [5] X Research source If you are worried that someone else has access to your Hotmail/Outlook account, change your password as soon as possible . This ensures that nobody can reconnect to your account after you've signed them out remotely. Turn on two-factor authentication to add an extra layer of security to your account."
    }
  ]
}