{
  "url": "https://www.wikihow.com/Select-All-Photos-on-Mac",
  "title": "How to Select All Photos on Mac",
  "steps": [
    {
      "title": "Open the Photos app.",
      "content": "Open the Photos app. On your Mac, click on the photos application within your dock. This looks like a square with a rainbow icon inside."
    },
    {
      "title": "Click Library.",
      "content": "Click Library . This is located at the top of the left menu. You may already be directed here after opening the app. If that’s the case, you can skip this step. If you only want to select photos from a particular album, refer to Step 4 instead."
    },
    {
      "title": "Select all photos.",
      "content": "Select all photos. On your keyboard, press “Command” + “A.” All of your photos should now be selected. [1] X Research source You can also click on the first photo, hold the \"Shift\" key and click on the last one. [2] X Research source If you want to deselect specific photos, hold the \"Command\" key and click on them. [3] X Research source"
    },
    {
      "title": "Go to a specific album.",
      "content": "Go to a specific album. You may want to only select photos in a specific photo album. If that’s the case, click on a particular album or category in the left menu. Feel free to click on any option."
    },
    {
      "title": "Select all photos in a specific album.",
      "content": "Select all photos in a specific album. Once you’ve navigated to an album, press “Command” + “A” on your keyboard. All of your photos in that album should now be selected."
    },
    {
      "title": "Delete all photos (optional).",
      "content": "Delete all photos (optional). You may want to delete the photos after you’ve selected all of them. If this is the case, simply press “Delete” on your keyboard. Then click the blue Delete button on your screen. Use this same method to delete all photos in a particular album."
    },
    {
      "title": "Drag all photos somewhere else (optional).",
      "content": "Drag all photos somewhere else (optional). Perhaps you want to drag all your selected photos somewhere else. This could be to your desktop, Google Drive, or another application. To do so, click and hold your mouse over any photo (it doesn’t matter which one). Now drag your cursor to the desired location and release. [4] X Research source Dragging your photos somewhere else will not delete them in the Photos app. Rather, they will just duplicate wherever you drag them."
    }
  ]
}