{
  "url": "https://www.wikihow.com/Renumber-a-PDF-Document",
  "title": "2 Easy Ways to Renumber a PDF: Adobe Acrobat & Mac Preview",
  "steps": [
    {
      "title": "Click the Page Thumbnails icon.",
      "content": "Click the Page Thumbnails icon. This icon looks like two pages overlapping each other and is usually the first icon on the menu on the left side of your screen. Clicking this will open the Page Thumbnails panel so you can see the thumbnails of the pages in your document. If you don't have Adobe Acrobat, you can download it from https://www.adobe.com/acrobat/acrobat-pro.html . You'll need to have the paid version of Acrobat to use this method. It's not possible to renumber PDFs in the free Adobe Acrobat Reader . If you don't have Acrobat Pro, you can download a free trial. This method only changes the page numbers internally. For example, if you search for \"Page 3\", you'll be redirected to the internal page 3, however, you still will see the marked \"Page 3\" if the PDF is marked that way. To get rid of those, use the redaction tool to delete the marked page numbers and then add headers or footers to create new page numbers ."
    },
    {
      "title": "Click a range of pages that you'd like to renumber.",
      "content": "Click a range of pages that you'd like to renumber. For example, if the PDF displays i-iv, you want the program to show that you're on pages i-iv instead of 1-4."
    },
    {
      "title": "Click the Options menu and select Page Labels.",
      "content": "Click the Options menu and select Page Labels . The Options icon looks like a rectangle with different options inside it and is the icon to the left of the trashcan."
    },
    {
      "title": "Change the page numbers in the \"Page Numbering\" box and click OK.",
      "content": "Change the page numbers in the \"Page Numbering\" box and click OK . Since you have the range selected, choose Selected and select your preferred numbering style (e.g., lower-case Roman numerals) from the drop-down under \"Begin new section\" and \"Style.\" If you don't have a range selected, enter the digital page numbers here. Ignore the numbers on the physical PDF pages for the \"From - To\" range as those aren't the same pages the program thinks you are trying to change. If you merged files , you'll most likely want to continue the page numbering between PDFs, so click \"Extend Numbering Used in Preceding Section To Selected Pages.\" Repeat these steps until you've labeled all the pages correctly and your program's page numbering matches your PDF. [2] X Research source"
    },
    {
      "title": "Open your PDF in Preview.",
      "content": "Open your PDF in Preview. You'll notice that the PDF's numbering does not match the numbered pages when you try the \"Go to Page\" command, but renumbering the pages will fix that confusion."
    },
    {
      "title": "Open your Settings.",
      "content": "Open your Settings. To do this, click the Preview\" menu and select Settings ."
    },
    {
      "title": "Click PDF.",
      "content": "Click PDF . This will allow you to change the settings for all PDFs you open in Preview."
    },
    {
      "title": "Select Use logical page numbers.",
      "content": "Select Use logical page numbers . Now, Preview will match the numbering of the PDF. For example, if you use the \"Go to\" command to go to Page 6, you'll get the 6th page in the PDF, even if it's numbered \"vi.\" [3] X Research source"
    }
  ]
}