{
  "url": "https://www.wikihow.com/Create-a-Photography-Portfolio",
  "title": "How to Create a Photography Portfolio",
  "steps": [
    {
      "title": "Decide what you want your portfolio to do and who you want it to reach.",
      "content": "Decide what you want your portfolio to do and who you want it to reach. Are you just starting out as a freelance photographer, or are you applying for an official photography job? It’s super important to figure out who your ideal client is so you can organize your portfolio in the most effective, eye-catching way possible. [1] X Research source For instance, the portfolio of a freelance real estate photographer will look a lot different from a portfolio of a photographer applying at a portrait studio. Your portfolio represents who you are as a photographer and what you can offer clients, so it’s really important to decide what your portfolio will be accomplishing."
    },
    {
      "title": "A collection of photos without a defined theme won't paint a clear picture for your client.",
      "content": "A collection of photos without a defined theme won't paint a clear picture for your client. Imagine that you’re hiring someone to take photos of your pets. You go to the pet photographer’s portfolio website, only to find pictures of outdoor landscapes. Without any pet photos on their site, you wouldn’t feel that comfortable hiring them as your photographer, right? The same logic applies when you’re planning out your portfolio—your content has to fit the niche you’re advertising yourself for. [2] X Research source If you’re a portrait photographer, you’d include high-quality portraits you’ve taken of kids, adults, and seniors, so clients get a sense of your range. If you’re a wildlife photographer, your portfolio could include a variety of wild animals in different outdoor settings."
    },
    {
      "title": "Focus on how they organize their site and showcase their photos.",
      "content": "Focus on how they organize their site and showcase their photos. Open up a web browser and search for existing portfolio sites that fit within your photography niche. What types of photos do these photographers feature on their sites? This type of research can help you nail down what your client might possibly like, and what types of photos work well on a live website. [3] X Research source Search terms like “wedding photographer site example” or “beautiful wildlife photography portfolio” can bring up helpful results."
    },
    {
      "title": "Your portfolio pictures need to exemplify your skills as a photographer.",
      "content": "Your portfolio pictures need to exemplify your skills as a photographer. Bookmark the highest quality photos that match your portfolio niche in a separate folder on your computer. It’s okay if you end up setting aside lots of photos—you can always whittle down your options later. [4] X Research source Make sure that your bookmarked photos fit your niche as closely as possible. For example, if you’re a pet photographer who specializes in cat photos, you wouldn’t want to feature a lot of dog pics in your portfolio."
    },
    {
      "title": "Website builders take a lot of time and hassle out of your website prep.",
      "content": "Website builders take a lot of time and hassle out of your website prep. Many of these website builders have preset themes and formats to choose from, so you don’t need any coding know-how to get your site set up. You can make a completely free website if you’re willing to have the name of the website builder in the URL, or you can have your very own domain name for a monthly or yearly fee. [5] X Research source Here are a few popular options to choose from: Wix Squarespace Weebly GoDaddy"
    },
    {
      "title": "Your theme needs to present your pics in a stylish but accessible way.",
      "content": "Your theme needs to present your pics in a stylish but accessible way. Don’t pick out a theme with a distracting background—after all, your photos need to be the star of the show! Instead, pick a theme that meshes well with the aesthetic and purpose of your photography portfolio. [6] X Research source Here are a few examples for different photography niches: Wedding: A dark background and white font offset with bright, colorful wedding pictures Portrait: A high-quality portrait used as the main backdrop for your site Documentary: A plain, white background to complement the photo’s complex colors and subject matter"
    },
    {
      "title": "Fancy fonts are no good if your clients can’t read them.",
      "content": "Fancy fonts are no good if your clients can’t read them. Stick with plain, easy-to-read fonts that don’t have a huge size difference between caps and lower case letters. Take a peek at Google’s Web Font directory if you’re thinking about mixing and matching different font styles together. [7] X Research source You can check out Google’s font site here: https://fonts.google.com/ It’s hard to go wrong with classic options like Helvetica, Helvetica Neue, Univers, and Avenir. [8] X Research source"
    },
    {
      "title": "Too many photos can really clutter up your portfolio’s layout.",
      "content": "Too many photos can really clutter up your portfolio’s layout. Pull up the folder of high-quality photos that you set aside earlier. Take a really close look at each one—is it the best possible representation of your photography skills, or is there any possible room for improvement? Remove any lower-quality photos from consideration until you have about 8-12 photos leftover. [9] X Research source Ask a trusted friend or mentor for help if you’re having trouble deciding which pictures to use. [10] X Research source"
    },
    {
      "title": "This format works well on both desktop and mobile.",
      "content": "This format works well on both desktop and mobile. Use your website builder’s interface to arrange your photos in a horizontal line, rather than in a vertical line or grid. This way, the user can click or swipe through your pictures and see how each photo connects to the next one. [11] X Research source This isn’t to say that other formatting options, like grids, are bad. It really depends on what kind of story you’d like to tell on your website. Most website builders provide plenty of design and layout options that you can play around with."
    },
    {
      "title": "Each photo needs to have something stylistic in common with the next one.",
      "content": "Each photo needs to have something stylistic in common with the next one. This doesn’t mean that your photos all have to come from the same set or series (though they can if you want!). Instead, make sure all of your neighboring pictures have a similar color palette. Depending on your portfolio niche, you can even organize your photos by mood to create a narrative for the viewer. [12] X Research source Some photographers like organizing their photos by composition. In a wedding photo portfolio, you might take a zoomed-in shot of the bride followed by a zoomed-out shot of the bride and groom together."
    },
    {
      "title": "Captions and alt text help with your website’s search engine optimization (SEO).",
      "content": "Captions and alt text help with your website’s search engine optimization (SEO). SEO is all about boosting your portfolio site’s ranking on search engine result pages (SERP). Image captions and alt text not only make your site more accessible, but they also give search engines more helpful information about your site—this helps it rank higher on the SERP. Make sure to include captions and alt text for each photo on your portfolio site so it’s more likely to show up in Google searches. [13] X Research source Alt text is a short description embedded into a photo that’s automatically read out loud to visually-impaired users. [14] X Research source Most website builders have built-in features that let you easily add it to photos. A portfolio picture of an open beach might have alt text that reads “New Jersey beach at sunrise.”"
    },
    {
      "title": "Let potential clients know what makes you special as a photographer.",
      "content": "Let potential clients know what makes you special as a photographer. Include a professional headshot on the page, and explain what photography means to you. If you’d like, give a little background on how you started as a photographer, and explain how you have the experience and skill to bring their vision to life. [15] X Research source You might write: “I graduated from Brigham Young University in 2017 with a BFA in Photography, but my passion for capturing the world around me started much earlier on.” “To me, photography isn’t about freezing a moment in time—it’s about capturing a story on film for years to come. I want to help bring your story to life.”"
    },
    {
      "title": "Potential clients don’t want to dig around to find your rates.",
      "content": "Potential clients don’t want to dig around to find your rates. Label a page on your website as “Prices,” and include what you usually charge for your photography sessions. If you haven’t quite settled on a price yet, check out other photographers’ rates. As a reference point, the median hourly rate for a photographer is $20. [16] X Trustworthy Source US Bureau of Labor Statistics U.S. government agency that collects and reports labor-related information Go to source"
    },
    {
      "title": "Include your email, phone number, and any other important details.",
      "content": "Include your email, phone number, and any other important details. Create another page on your website labeled as “Contact.” List out your professional email, phone number, and address, if you work at a specific location. Many website builders let you build a contact form into your website, which gives site users another way to reach you."
    },
    {
      "title": "Make sure it works on computers, phones, and different web browsers.",
      "content": "Make sure it works on computers, phones, and different web browsers. Are the photos easy to access and view, and is it simple to switch between tabs/pages? There’s a good chance that clients will find your portfolio site from both their computers and phones, so it’s important that your site is mobile-friendly. [17] X Research source Most website builders have a preview function, so you can inspect it before it goes live."
    },
    {
      "title": "Promote your site online and give the URL to potential clients.",
      "content": "Promote your site online and give the URL to potential clients. Post the link on social media, and invite your friends, loved ones, and acquaintances to share it around. To get more client traffic, include the link on your business cards and other promotional materials. [18] X Research source"
    }
  ]
}