{
  "url": "https://www.wikihow.com/Clean-Revlon-Hair-Dryer-Brush",
  "title": "A Step-by-Step Guide to Cleaning a Revlon Hair Dryer Brush",
  "steps": [
    {
      "title": "Lift hair away from the brush with your fingers or a comb.",
      "content": "Lift hair away from the brush with your fingers or a comb. Before cleaning your brush, always unplug it from the electrical outlet (to prevent electric shock). Revlon brushes have stiff bristles that can trap shed hair, so use your fingers to pull off as many strands as possible. For larger chunks of tangled hair, slide the pointed end of a rattail comb in between the bristles to help loosen and remove the hair. [1] X Research source Alternatively, use a forked hairbrush cleaning tool to rake through the bristles and remove hair from your brush ."
    },
    {
      "title": "Cut stubborn strands with scissors.",
      "content": "Cut stubborn strands with scissors. If your brush is full of knots or clumps, slide the pointed end of a rattail comb underneath the trapped hair to lift it up. Use a sharp pair of scissors to carefully snip through the hair in the brush, making sure to avoid the bristles. Then, turn the brush to the side and continue loosening and cutting the hair until most of it is gone. Keep the blades of the scissors parallel to the rows of bristles on the brush to ensure you don’t accidentally cut through the bristles. If you don’t have a rattail comb, use a pen, chopstick, or any other pointy object. [2] X Research source"
    },
    {
      "title": "Use a vacuum to remove dust and lint from the air intake.",
      "content": "Use a vacuum to remove dust and lint from the air intake. With a handheld vacuum (or regular vacuum with an attachment), suck out any dirt, lint, and dust from the air intake—the vented area near the bottom of the brush. If the air intake gets clogged with debris, it blocks air from being pushed out of your hair brush, overheating the brush and damaging the engine. [3] X Research source Since you can’t remove the air vent cover on the Revlon hair dryer brush, use a pair of tweezers to pluck larger chunks of debris that cannot be vacuumed out."
    },
    {
      "title": "Scrub hard-to-reach spots with a soft-bristled toothbrush.",
      "content": "Scrub hard-to-reach spots with a soft-bristled toothbrush . To deal with stubborn dirt and grime, use a dry toothbrush to gently scrub the vents near the bottom of your hair brush. If you see any product build-up on the head of your brush, dampen the toothbrush in warm water and clean between the bristles using small, circular motions. Pay extra attention to the areas around the base of each bristle, which usually carries the most dirt and grime. [4] X Research source If you use a damp toothbrush, dry your hair brush with a clean towel to prevent water damage."
    },
    {
      "title": "Use alcohol wipes to remove product build-up and sanitize the bristles.",
      "content": "Use alcohol wipes to remove product build-up and sanitize the bristles. Once you remove all visible bits of hair and debris from your brush, wipe the brush head and handle with alcohol pads , without pressing the bristles too firmly. This eliminates bacteria and germs from your styling products, as well as any hair flakes and oils that may build-up over time. [5] X Research source Alternatively, spray your hair dryer brush with white vinegar to clean and disinfect it. Clean your brush while it’s still warm to help product build-up come off more quickly and easily, but be careful not to burn yourself!"
    },
    {
      "title": "Wipe the exterior of the brush with a damp microfiber cloth.",
      "content": "Wipe the exterior of the brush with a damp microfiber cloth. To remove any remaining hair and product build-up on your brush, take a microfiber cloth and dip it in warm water. Wring out the cloth to remove excess water, then gently rub it over the brush head, handle, and power cord, avoiding the plug and air intake (so you don’t get water inside of the unit). After wiping down the brush, dry any damp areas with a clean towel to minimize lint and dust. [6] X Research source Even if your brush is extremely dirty, do not submerge it in water, as it can damage the electrical components. Stick with water when cleaning your brush, since soap and detergent can clog the engine and cause more build-up."
    },
    {
      "title": "Clean your hair brush once a week if you use it daily.",
      "content": "Clean your hair brush once a week if you use it daily. To maintain the performance of your brush, deep clean the head, bristles, and air intake at least once a week, and remove trapped hair immediately after each use. A dirty dryer brush is more likely to overheat, and this can pose a serious fire hazard. Cleaning your hair brush ensures the engine runs properly, extending its lifespan and preventing damage to your hair. [7] X Research source If you use your brush 2-3 times a week or less, once or twice a month is sufficient. A dirty hair brush can negatively impact the health of your hair, even leading to scalp infections."
    },
    {
      "title": "Store your hair brush in a safe and dry environment.",
      "content": "Store your hair brush in a safe and dry environment. Before storing your brush, allow the bristles to cool down so they don’t become misshapen, and avoid wrapping the cord around the brush, which can loosen the connection and cause fraying. Keep your brush away from potential fire hazards like curtains, clothes, and paper, and store it in a heat-resistant holder to prevent dust and dirt from accumulating. [8] X Research source Storing your hair brush in a damp or humid place can prompt mold growth and corrosion, so hang your brush on an over-the-door shoe organizer inside a cabinet or place it in your bathroom drawer."
    },
    {
      "title": "Avoid applying sticky products before using your brush.",
      "content": "Avoid applying sticky products before using your brush. Products like mousse, gel, leave-in conditioner, and texturizing spray can build up on the bristles of your hair brush, clogging the brush and reducing its efficiency. Aside from heat protectant spray, apply your styling products after using your brush to minimize product transfer. [9] X Research source If you have to use sticky products beforehand, clean your brush with an alcohol pad immediately after using it."
    }
  ]
}