{
  "url": "https://www.wikihow.com/Enable-Screen-Mirroring-on-a-Samsung-Galaxy-Device",
  "title": "How to Enable Screen Mirroring on a Samsung Galaxy Device",
  "steps": [
    {
      "title": "Turn on your HDTV.",
      "content": "Turn on your HDTV. In order to mirror your Samsung Galaxy's screen, you'll need either a Samsung smart TV or a Samsung All-Share Cast hub."
    },
    {
      "title": "Change your TV's input accordingly.",
      "content": "Change your TV's input accordingly. Depending on the type of TV you have, your process here will vary: [1] X Research source For a smart TV, select the \"Screen Mirroring\" option using your remote's Source button. For an All-Share hub, change your TV's input to whichever one is using the All-Share HDMI cable (for example, Video 6)."
    },
    {
      "title": "Unlock your Samsung Galaxy device.",
      "content": "Unlock your Samsung Galaxy device. If you have a passcode enabled, you'll need to enter it in order to do this."
    },
    {
      "title": "Swipe down from the top of your screen using two fingers.",
      "content": "Swipe down from the top of your screen using two fingers."
    },
    {
      "title": "Tap Edit.",
      "content": "Tap Edit . This is in the top right corner of your screen. This may also be a pencil icon on some phones."
    },
    {
      "title": "Select Screen Mirroring.",
      "content": "Select Screen Mirroring . You may have to swipe left or right to view this option. On some phones, this option may be called Smart View ."
    },
    {
      "title": "Select the name of a mirroring device.",
      "content": "Select the name of a mirroring device. For example, you might tap your TV's name here."
    },
    {
      "title": "Select Connect using PIN.",
      "content": "Select Connect using PIN . If you're connecting to a Samsung smart TV with no All-Share hub, your S6 will connect automatically without entering a PIN. [2] X Research source"
    },
    {
      "title": "Type in the PIN displayed on your TV.",
      "content": "Type in the PIN displayed on your TV. As long as the PINs match, your Samsung Galaxy S6's screen should now be mirrored on your TV."
    },
    {
      "title": "Turn on your HDTV.",
      "content": "Turn on your HDTV. In order to mirror your Samsung Galaxy's screen, you'll need either a Samsung smart TV or a Samsung All-Share Cast hub."
    },
    {
      "title": "Change your TV's input accordingly.",
      "content": "Change your TV's input accordingly. Depending on the type of TV you have, your process here will vary: [3] X Research source For a smart TV, select the \"Screen Mirroring\" option using your remote's Source button. For an All-Share hub, change your TV's input to whichever one is using the All-Share HDMI cable (for example, Video 6)."
    },
    {
      "title": "Unlock your Samsung Galaxy device.",
      "content": "Unlock your Samsung Galaxy device. If you have a passcode enabled, you'll need to enter it in order to do this."
    },
    {
      "title": "Open your Android's settings.",
      "content": "Open your Android's settings. This is the gear-shaped icon on one of your home screens (or in your app drawer)."
    },
    {
      "title": "Scroll down to the \"Connect and Share\" heading and select Screen Mirroring.",
      "content": "Scroll down to the \"Connect and Share\" heading and select Screen Mirroring . [4] X Research source"
    },
    {
      "title": "Slide the Screen Mirroring switch right to the \"On\" position.",
      "content": "Slide the Screen Mirroring switch right to the \"On\" position. It should turn green."
    },
    {
      "title": "Select your TV's name.",
      "content": "Select your TV's name. It should appear beneath the Screen Mirroring button. Unless you have multiple devices with screen mirroring enabled, you should only see your TV listed here."
    },
    {
      "title": "Type in the PIN displayed on your TV.",
      "content": "Type in the PIN displayed on your TV. As long as the PIN you enter on your device matches the one on your TV, your screen should be mirrored. If you're using a smart TV, your phone should connect without a PIN."
    }
  ]
}