{
  "url": "https://www.wikihow.com/Set-Time-Limits-on-Snapchat",
  "title": "How to Use the Snapchat Time Limit Feature on Your Photos",
  "steps": [
    {
      "title": "",
      "content": "Look for the yellow app that contains a ghost logo on your device. Enter your username and password if you're not automatically logged in."
    },
    {
      "title": "",
      "content": "Select the camera icon at the bottom of the screen. Tap the larger, open circle at the bottom center of the screen to take the picture. The length of videos is controlled by how long you hold down the button. Snapchat videos can be up to 10 seconds long, or you can hold it down to send longer clips in 10-second chunks."
    },
    {
      "title": "",
      "content": "Look for the clock-shaped icon along the right side of the screen near the bottom. If you do not see the Timer option, tap the small arrow on the right side of the screen to show the additional icons. In older versions of Snapchat, the Timer icon is in the lower-left corner of the screen."
    },
    {
      "title": "",
      "content": "Scroll through the timer selections, choosing a time between 1 and 10 seconds. You may also choose an infinite time setting so it only disappears when the person taps the image again. The duration you choose is the length of time your photo will appear on screen to the recipient of your Snap or viewers of your Story."
    },
    {
      "title": "",
      "content": "Your chosen duration will appear in the center of the timer icon. Tap the editing tools in the upper right corner to add text, pictures, and other features to your image before you send it."
    },
    {
      "title": "",
      "content": "Click the button in the lower-right corner of the screen. Now, whether you send it to a friend or add it to your Story, it will be visible for the number of seconds you indicated on the timer. A Snap, the picture or short video you just took, can be sent to individuals, and will disappear after it's opened, or added to your Story. Your Story is a collection of the Snaps that you've taken and added to your Story over the last 24 hours. Snaps added to your Story disappear after 24 hours."
    }
  ]
}