{
  "url": "https://www.wikihow.com/Humor-Me-Meaning",
  "title": "What Does the Expression “Humor Me” Mean?",
  "steps": [
    {
      "title": "“Humor me” means to listen to or play along with something you’re saying, even if the person you’re speaking to finds it pointless or uninteresting.",
      "content": "“Humor me” means to listen to or play along with something you’re saying, even if the person you’re speaking to finds it pointless or uninteresting. [1] X Research source Essentially, it’s a playful way to say “Indulge me” or “Bear with me”; you know the person you’re talking to might find what you’re saying or suggesting to be too silly, obvious, or uninteresting to sit through, but you’re asking them to do so in order to make you feel heard, to keep your mood up, or because you feel you can convince them to see things your way. “I know you’ve shut this down before, but humor me while I explain why we should get a dog again.” Them: “There’s no way we’re going to Bermuda.” You: “Just humor me for a minute! It would be so fun.” Tone tip: “Humor me” is considered playful, lighthearted, or sarcastic. If you urgently need someone to listen to you or you have important information, be more insistent and direct when you ask someone to hear you out."
    },
    {
      "title": "Ask someone to hear you out or tolerate what you have to say.",
      "content": "Ask someone to hear you out or tolerate what you have to say. If you know someone’s not likely to listen to you—like if they think the idea you have is ridiculous or they’re uninterested in your hobbies—say “Humor me” before asking them to hear you out or explain yourself. It’s like you’re saying, “I know you think what I’m about to say is pointless, but let me talk about it.” [2] X Research source Them: “I do not want to hear another one of your crazy prank ideas!” You: “OK, just humor me though: Water guns attached to drones.” “OK, I know you said we couldn’t afford a vacation this year, but just humor me. Imagine if I found us some super cheap flights to Belize…”"
    },
    {
      "title": "Encourage someone to play along or go with your plans.",
      "content": "Encourage someone to play along or go with your plans. Sometimes, you may want someone to do more than just listen to you. If you need someone to do you a small favor or help you with something they don’t want to do (like retracing your steps through the house to find your lost keys again, for example), ask them to humor you and help, even if they find the task pointless or dull. Them: “There’s no way your car keys are in the garden.” You: “Just humor me and help me look, OK? I was supposed to leave 15 minutes ago!” “Will you humor me and take a listen to some new jokes I wrote?”"
    },
    {
      "title": "Ask someone to tell you something anyway, even if they don’t see a point to it.",
      "content": "Ask someone to tell you something anyway, even if they don’t see a point to it. Maybe you want to hear a story from your partner’s childhood but they don’t feel like telling it again, or maybe a friend is working on a complex project they feel is too difficult to explain. Say “humor me” as a lighthearted way to get them to say or explain something in a way you can understand in order to keep you happy. [3] X Research source It’s like a charming way of saying “tell me anyway.” You: “What are you reading about?” Them: “It’s the results of a new experiment at the Large Hadron Collider. You’re probably not interested.” You: “Humor me! What’d they discover?” You: “Will you sing me the song that was playing during our first date?” Them: “Trust me, you do not want to hear me sing.” You: “Aw, humor me!”"
    },
    {
      "title": "“Humor me” is an expression with a lot of synonyms in English.",
      "content": "“Humor me” is an expression with a lot of synonyms in English. If you find yourself saying “humor me” a lot and want to mix it up, check out this list of alternate phrases that mean the same thing. Some are more formal or polite while some are more casual: [4] X Research source Phrases that lean more formal: “Indulge me” “Bear with me” “Be patient with me” “Do me the courtesy of…” “Do me the favor of…” Phrases that lean more casual: “Just hear me out” “Go along with me for a second” “Do me a favor” “Do me a solid” “Play along”"
    },
    {
      "title": "Sit back and listen thoughtfully if someone is requesting you hear them out.",
      "content": "Sit back and listen thoughtfully if someone is requesting you hear them out. When someone says “Humor me,” they’re likely already assuming you don’t have an interest in what they’re about to say. Show that you care about them and value their perspective by listening—even if you totally disagree with what they’re saying. To show you’re an active listener: Ask open-ended questions to let the speaker expand on their initial ideas. [5] X Research source Paraphrase their words every once in a while to show you’re understanding what they’re saying. Reflect their feelings to show empathy. Make frequent but nonaggressive eye contact. Face them with open, relaxed posture or body language."
    },
    {
      "title": "Do or say what someone is requesting of you if they ask you to humor them.",
      "content": "Do or say what someone is requesting of you if they ask you to humor them. If a person is asking for a small or silly favor with “humor me,” chances are they’re being at least a little bit playful with you. So, go along with their idea to be playful in return! Doing something silly or helpful, like a menial task or singing a song at someone’s request, is a great way to laugh together, and laughing can lead to stronger bonds and deeper relationships. [6] X Research source Of course, don’t do anything you’re uncomfortable with or object to just because someone says “humor me.” It’s your choice how you follow through."
    },
    {
      "title": "As a verb, “to humor” means “to agree to someone’s wishes in order to help improve their mood or to avoid upsetting them.”",
      "content": "As a verb, “to humor” means “to agree to someone’s wishes in order to help improve their mood or to avoid upsetting them.” [7] X Research source This means that the phrase “humor me” really has nothing to do with being funny or making jokes; instead, it’s all about soothing or placating someone to keep their spirits (or the overall vibe of the room) up. Here are some ways you might see or use “humor” to reference boosting someone’s mood : “The substitute teacher is really strict, so humor them when they ask you to do something.” “Grandma’s been repeating the same old stories all day today. Just humor her and pretend they're new.”"
    }
  ]
}