{
  "url": "https://www.wikihow.com/Hide-a-Piercing",
  "title": "How to Hide a Piercing",
  "steps": [
    {
      "title": "Buy clear or flesh-coloured jewellery for the piercing.",
      "content": "Buy clear or flesh-coloured jewellery for the piercing. This option is likely more useful for piercing on your face that can easily be seen if they aren't taken out. Instead of using colourful or even metal jewellery, buy clear or flesh-coloured jewellery that will almost disappear when in your piercing. [2] X Research source Clear jewellery, in this case, can include jewellery made of glass or jewellery made with clear-coloured stones like quartz."
    },
    {
      "title": "Get the smallest jewellery possible so that the piercing isn't noticeable.",
      "content": "Get the smallest jewellery possible so that the piercing isn't noticeable. If you want to hide a piercing with jewellery, one way would be to buy very tiny and discrete-sized jewellery. Something that’s so small, someone would have to stare at you to know it was there. This would work particularly well for nose or lip piercings where tiny jewellery might simply look like a freckle. [3] X Research source In this case, the tinier the better. But keep in mind that if you just got your piercing, and you opt to use a tiny piece of jewellery in the hole, you may not be able to use a larger piece of jewellery later without getting it re-pierced."
    },
    {
      "title": "Use only the stem portion of the jewellery to keep the hole open.",
      "content": "Use only the stem portion of the jewellery to keep the hole open. Most types of piercings allow for some sort of stud to be used. Essentially, a stud is a thin (usually) metal bar with a decorative end and a removable back or end. The decorative end is what you usually want people to see. But instead, cut it off. Simply use a stud insert without the decorative side. [4] X Research source Inexpensive stud jewellery with a simple decorative end is probably the best option here, as you won’t be able to repair them later. You may need to use wire cutters to remove the decorative end from the metal bar."
    },
    {
      "title": "Use a retainer to easily disguise your piercing.",
      "content": "Use a retainer to easily disguise your piercing. A retainer is a piercing insert that is either clear or flesh-coloured but is also specifically designed to hide the piercing. Unlike clear or flesh-coloured jewellery, retainers won’t have decorative portions that may be visible. However, retainers are not entirely invisible and may be seen if someone looks really close. [5] X Research source Try to avoid wearing plastic retainers for long periods of time, for example, every workday. If you need to wear something frequently, get a retainer that’s made of hypoallergenic materials like glass, metal, or silicon. Retainers for septum piercings are the exception, as they’re usually tucked up inside your nose and not visible from the outside."
    },
    {
      "title": "Select a hairstyle that covers your ears to hide pierced ears.",
      "content": "Select a hairstyle that covers your ears to hide pierced ears. If you’re trying to cover up earrings, try wearing your hair down and not tucked behind your ears. Use your hair to cover your ears and your earrings. Even try styling your hair in such a way that sections go over your ears. [6] X Research source For men, letting your hair down includes growing your facial hair. Lip and nose piercings can easily be covered with facial hair. [7] X Research source"
    },
    {
      "title": "Wear a hat or a scarf to hide ear or face piercings.",
      "content": "Wear a hat or a scarf to hide ear or face piercings. This option might work best for earrings, but if your outside in the winter, this could also work for lip and nose piercings. Consider wearing a hat that can be pulled down over your ears, or a scarf that goes high enough to cover your ears. [8] X Research source You could also consider wearing a scarf around your head and over your ears, tied nicely in the back or side."
    },
    {
      "title": "Use a long top to hide your navel piercing.",
      "content": "Use a long top to hide your navel piercing. Navel piercings are really only visible if your navel is also showing. Therefore, the best way to hide a navel piercing is to make sure you wear a top long enough to cover your navel, even when you reach upwards. Alternatively, you could also try layering your shirts, where the outer layer is shorter than the inner layer. Or the inner layer is tucked into your pants. [9] X Research source If you’re wearing a button-up top that’s long enough to cover your navel, also make sure the bottom buttons are buttoned or your shirt is tucked in."
    },
    {
      "title": "Bundle up in a thick sweater or shirt to hide body piercings.",
      "content": "Bundle up in a thick sweater or shirt to hide body piercings. Sweaters, shirts, or jackets made of thick material like wool, fleece, or flannel are great options to use when trying to cover up any type of body piercing on your torso. The thickness of the material, even if it’s white, won’t allow anyone to see what may be underneath. [10] X Research source Jackets or blazers, on their own, are also a great option, even if they’re made of a thinner material. But this will only work if you keep the jacket or blazer closed."
    },
    {
      "title": "Choose shirts with loud patterns to obscure any piercings under the material.",
      "content": "Choose shirts with loud patterns to obscure any piercings under the material. In some cases, the pattern of the shirt you wear will do a better job of hiding a body piercing than a darker coloured shirt, especially if the fabric is thin or the shirt is tight. The boldness of the pattern will distract the eye and prevent someone from being able to see any bumps or jewellery that may be underneath the shirt. [11] X Research source Animal prints, snakeskin prints, florals, paisley, plaid, and abstract-style fabric would all be loud and bold enough to draw someone’s attention away from a piercing and focus their eye on your clothing instead."
    },
    {
      "title": "Wear a padded bra to hide a nipple piercing.",
      "content": "Wear a padded bra to hide a nipple piercing. Padded bras are great for many reasons, but in this case, the padding in the bra will help hide any nipple piercings you may have. When wearing a padded bra, you’ll be able to wear any type of shirt. [12] X Research source Alternatively, if you don’t have a padded bra, you could try wearing pasties under your non-padded bra or on their own."
    },
    {
      "title": "Keep your mouth closed as much as possible if your tongue is pierced.",
      "content": "Keep your mouth closed as much as possible if your tongue is pierced. Obviously, any type of piercing inside your mouth can only really be seen if your mouth is open. If you want to hide piercings in your mouth, simply be careful of when and how wide you open your mouth. This includes not just talking, but eating and laughing. [13] X Research source Remember to cover your mouth with your hand when you yawn or cough. If you have a habit of playing with your mouth piercings, you may need to re-train yourself to leave it alone in certain situations."
    },
    {
      "title": "Do not take your piercing out too early to prevent it from closing up.",
      "content": "Do not take your piercing out too early to prevent it from closing up. Most types of piercings have to stay in place for at least 6 weeks so that the pierced hole stays open. If you’ve had your piercing for less than the required amount of time, do not take it out for long periods of time. Instead, conceal your piercing with the jewellery in place while it heals. [14] X Research source Ask the person who gave you your piercing for exact instructions on how long your piercing should stay in and how to care for a new piercing on a daily basis."
    },
    {
      "title": "Remove all jewellery in your piercings to make it undetectable.",
      "content": "Remove all jewellery in your piercings to make it undetectable. The easiest way to hide a piercing really is to remove it. The hole itself might still be visible, but the jewellery will be gone. For certain workplaces, you may be required to remove your piercings for hygienic or safety reasons, but you may not be required to remove all evidence that a piercing existed. [15] X Research source Ask your supervisor or read your employee handbook to determine your workplace’s minimum requirements for piercings. In some workplaces, you may be asked to remove piercings so they do not get caught in machinery. In cases like this, leaving the holes visible would be perfectly okay."
    },
    {
      "title": "Use concealer or foundation to hide piercing holes.",
      "content": "Use concealer or foundation to hide piercing holes. One of the easiest ways to hide the hole of a piercing, especially one on your face, is to apply make-up. Use concealer or foundation that’s the colour of your skin to hide the hole and blend the area into the skin around the piercing hole. [16] X Research source If the hole is too big to hide with concealer, consider using an eyebrow pencil to turn the hole into a small freckle. You can even buy special make-up designed to fill-in piercing holes and hide them."
    },
    {
      "title": "Attach a small, round bandage to the piercing hole.",
      "content": "Attach a small, round bandage to the piercing hole. This option would work for both piercings with the jewellery left in and for just covering up the holes. Since it’s a relatively small area you’re trying to cover, using a small round band aid (usually designed for blisters) may work best. And of course, buy ones that are flesh-coloured. [17] X Research source Unlike some of the other options, bandaids are definitely not invisible. But if you’re trying to hide your piercing due to a policy at work, you may not care if something is visible, just that the piercing isn’t showing."
    }
  ]
}