{
  "url": "https://www.wikihow.com/Clean-a-Concrete-Balcony",
  "title": "How to Clean a Concrete Balcony",
  "steps": [
    {
      "title": "You’ll clean more thoroughly if you start in an empty space.",
      "content": "You’ll clean more thoroughly if you start in an empty space. Bring all of your things inside or put them in your yard. If you have any heavy furniture, ask a friend to help out so you don’t hurt yourself. Also make sure you move potted plants since the cleaning solutions could damage them. [1] X Research source You may want to clean off any furniture before bringing inside so your home stays clean."
    },
    {
      "title": "Use a stiff-bristled broom for the best results.",
      "content": "Use a stiff-bristled broom for the best results. Start near the edges of your balcony and work towards the center, collecting the dirt in a couple of spots. Be sure to reach all the tight corners of your balcony since that’s where dirt builds up the most. Once you’ve swept up as much as you can, collect it all in a dustpan and throw it away. [2] X Research source Always use smaller and shorter strokes. Not only will these be more precise, but they also won’t make a mess in the process of sweeping. If possible, make small dirt piles, as you don’t want to try and move dirt too far around the room. Having many small piles will typically be more effective than trying to create one big pile. If something is really stuck to the concrete, try loosening it with a plastic scraper. If you have trouble reaching tight spaces with your broom, try using a vacuum with a hose attachment."
    },
    {
      "title": "The water helps break apart stubborn dirt your broom couldn’t reach.",
      "content": "The water helps break apart stubborn dirt your broom couldn’t reach. Fill a bucket with warm water and mix in a little bit of mopping solution or detergent. Use your sponge to wipe down the walls or railings around your balcony. Then, mop the floor with your cleaning solution working from the edges of your balcony toward the center. [3] X Research source You can use your sponge on the balcony floor if you don’t have a mop. For more scrubbing power, use a stiff-bristled brush to scrub off the dirt. Always be mindful of anyone who has a balcony directly underneath yours since water running off could drip down and get their balcony dirty. Always wring out your mop or sponge before you start so there isn’t as much excess water."
    },
    {
      "title": "Pick a detergent with baking soda for more cleaning power.",
      "content": "Pick a detergent with baking soda for more cleaning power. Apply the detergent onto a stiff-bristled brush and work it into the rust stain. After rubbing in the detergent, leave it on the stain for about an hour. Mist the detergent with water throughout so it doesn’t dry. Then, scrub the stain again with a wire brush and rinse it off with water. [4] X Research source You may need to try this 2–3 times to completely lift the stain."
    },
    {
      "title": "Scrub the detergent onto the stains with a stiff-bristle brush.",
      "content": "Scrub the detergent onto the stains with a stiff-bristle brush. If you have brown stains from old leaves, combine about 1 ⁄ 2 cup (120 ml) of liquid dish soap into a bucket with 3 gallons (11 L) of water. Pour the solution on top of the stains and work it into the concrete until the stains break apart. Rinse the solution off with clean water to finish up. [5] X Research source For a little extra cleaning power, try sprinkling powdered laundry detergent on the stain after rinsing it off and scrubbing it with your brush again. Detergent that says it’s effective against food stains works the best."
    },
    {
      "title": "Any degreaser from the hardware store will work on concrete.",
      "content": "Any degreaser from the hardware store will work on concrete. Spray the degreaser onto your concrete so it thoroughly coats the stain and let it soak in for a couple of minutes. After that, scrub the stain with a stiff-bristled brush. [6] X Research source Products like Organic Orange or Goof Off are good picks for degreasers."
    },
    {
      "title": "Make a paste with this chemical to draw the oil out of the concrete.",
      "content": "Make a paste with this chemical to draw the oil out of the concrete. Trisodium phosphate (TSP) is a liquid cleaner you can buy from your local hardware store. Mix 1 part TSP with 6 parts water. Add in calcium carbonate or cornstarch until the mixture forms a thick paste. [7] X Research source Spread the paste over the stain and let it dry for 24 hours. Then, scrub the surface with a stiff-bristle brush and clean water. [8] X Research source You can buy calcium carbonate or talc powder from your local hardware store as well."
    },
    {
      "title": "Bleach kills mold on contact and prevents it from coming back.",
      "content": "Bleach kills mold on contact and prevents it from coming back. Put on a pair of gloves, mask, and safety glasses to protect yourself from the bleach. Add equal parts of bleach and water into a spray bottle or bucket. Spread the solution over the stain and let it sit for 10 minutes. After that, use a stiff-bristled brush to lift up the stains. [9] X Research source Since bleach could discolor your concrete, spot-test it in an inconspicuous area of your balcony before using it on the stains. Only use as much bleach solution as you need since the runoff could kill plants or flowers."
    },
    {
      "title": "Only use muriatic acid if other cleaners don’t work.",
      "content": "Only use muriatic acid if other cleaners don’t work. Get some muriatic acid from a hardware store. Put on some long gloves and protective eyewear before pouring 1 ⁄ 2 cup (120 ml) of the acid into 2 cups (470 ml) of cold water. Carefully pour the acid onto the rust stains and work it in with a stiff-bristle brush. Let the acid sit for a few minutes and then rinse it off with clean water. [10] X Research source You may need to try 2 or 3 treatments for heavy rust stains."
    },
    {
      "title": "Pressure washers",
      "content": "Pressure washers break apart stubborn debris, but require a hose. You can rent a pressure washer from a hardware store or buy your own. Connect the pressure washer to a hose and set the machine to around 3,500 PSI. Hold the washer hose about 8 inches (20 cm) off the ground and turn on the pressure washer. Work in back and forth strokes across the concrete to remove deep-set stains and debris. [11] X Research source Pressure washers aren’t the best choice if someone has a balcony underneath yours since the water will leak and spill down onto it. If you do plan on cleaning your balcony, let anyone who lives directly below you know so they can move their items."
    },
    {
      "title": "This helps remove all of the leftover cleaner and dirt.",
      "content": "This helps remove all of the leftover cleaner and dirt. If you have access to a hose, just spray your balcony down to rinse it. If you don’t have a hose near your balcony, then fill a bucket with some clean water and wipe the floor clean with your mop. [12] X Research source If someone has an apartment below yours, then stick to using a mop and bucket. Wring out the mop before you use it so water doesn’t drip down to the lower balcony."
    },
    {
      "title": "Spray the sealant onto your concrete when it’s dry.",
      "content": "Spray the sealant onto your concrete when it’s dry. You can buy concrete sealant from a hardware store. Use a garden sprayer or a paint roller to apply a thin layer of the sealant onto the concrete. Let the sealant dry and cure before using your balcony again so you don’t risk any future stains. [13] X Research source Read the instructions on the sealant thoroughly since brands may have different curing times."
    }
  ]
}