{
  "url": "https://www.wikihow.com/Get-Rid-of-Love-Bugs",
  "title": "13 Ways to Get Rid of Love Bugs",
  "steps": [
    {
      "title": "Insect sprays will discourage the love bugs from entering your home.",
      "content": "Insect sprays will discourage the love bugs from entering your home. Pick up an insect spray from the hardware store, and spray it around all your entrances, including your windows and your doors. Look for an insect spray that contains citrus, clove, or rosemary oil, since love bugs really dislike those scents. [1] X Research source Unfortunately, love bugs aren’t deterred by insect repellents that contain DEET or citronella. [2] X Research source Love bug season usually happens twice a year: first between April and May, and then again between August and September. These critters have black bodies and red heads, and they’re pretty small: only 6 to 9 mm in length."
    },
    {
      "title": "Creating your own spray is easy, and you can use food-safe ingredients.",
      "content": "Creating your own spray is easy, and you can use food-safe ingredients. If you don’t want to blast your yard or home with chemicals, you can create your own insect spray out of products you might already own. Fill up a spray bottle with water, then add a few drops of citrus-scented dish soap and a splash of mouthwash (for the minty smell). Mix it up and then use the spray in your home or on your plants. [3] X Research source Reapply the spray once a day during love bug season. This bug spray is safe to use on your skin, so you can spritz yourself with it as an insect repellant if you need to."
    },
    {
      "title": "Fans discourage love bugs from landing on surfaces.",
      "content": "Fans discourage love bugs from landing on surfaces. While it isn’t a perfect solution, running a fan on high is sometimes enough to blow love bugs away and keep them from landing on things. Use a ceiling or standing fan to circulate the air in your home to encourage love bugs to find a new place to land. [4] X Research source Try pointing the fan at walls and shelves where love bugs are most likely to land. This can help deal with infestations inside of your home."
    },
    {
      "title": "Love bugs lay eggs in tall grass, so mow it short.",
      "content": "Love bugs lay eggs in tall grass, so mow it short. Your grass tends to grow faster in the warmer months, so mow your lawn at least once a week. [5] X Research source This will keep your lawn short enough so that the love bugs have a tough time laying eggs in it. If you have a garden, water it every day—the water makes it harder for love bugs to lay their eggs. Try to keep any vegetation at least 1 ft (30 cm) away from your home, too. This prevents pests from getting easy access to your residence."
    },
    {
      "title": "Love bugs are attracted to the heat from idling engines.",
      "content": "Love bugs are attracted to the heat from idling engines. When you get home, try not to leave your car idling in the driveway—instead, turn it off so the engine can start cooling down. Do the same thing with your mower as well, since the heat from its engine might attract a swarm. [6] X Research source Love bugs are also attracted to the exhaust fumes that come out of your car."
    },
    {
      "title": "The insects are attracted to dead leaves and grass.",
      "content": "The insects are attracted to dead leaves and grass. If you’re doing yard work, rake up any yard debris and dispose of it in your yard debris bin. The warm, decomposing matter is the perfect material for love bugs to lay their eggs in, so don’t give them the chance. [7] X Research source"
    },
    {
      "title": "These insects seem to gravitate toward lighter colors, so avoid them if you can.",
      "content": "These insects seem to gravitate toward lighter colors, so avoid them if you can. When you head out during love bug season, throw on a dark-colored shirt and pants to keep the bugs away from you. They’re more attracted to light colors, so wearing dark ones might let you fly under their radar. [8] X Research source"
    },
    {
      "title": "Screens and netting",
      "content": "Screens and netting help protect your car from love bugs. Since love bugs are attracted to cars, they may get sucked into your car’s radiator, which can lead to overheating issues. Attach a grill screen or netting to the front of your car to keep the love bugs out of there during the love bug season. [9] X Research source"
    },
    {
      "title": "Washing your car",
      "content": "Washing your car ensures love bugs don’t damage your paint. If you’ve just driven through a love bug swarm, you probably notice their bodies or their eggs all over the front of your car. Try soaking the front of your car in water for 10 to 15 minutes, then scrubbing your car with soap and water. [10] X Research source Love bugs are mildly acidic, meaning their dead bodies can eat through your car’s paint if left there for too long."
    },
    {
      "title": "Waxing your car",
      "content": "Waxing your car makes it easier to wash love bugs off. While the wax won’t do much to deter love bugs, it will make the cleanup much easier. Head to a car wash and get a waxing service before love bug season starts to help their dead bodies slide right off. [11] X Research source Wax also helps protect your car’s paint from damage."
    },
    {
      "title": "Love bugs are attracted to fresh, wet paint.",
      "content": "Love bugs are attracted to fresh, wet paint. While no one is quite sure why, love bugs absolutely love when people paint their homes. If you can, try to hold off on any painting projects until love bug season is over. [12] X Research source If you absolutely have to paint, try to stick to darker colors. Love bugs are more attracted to light colors, especially white."
    },
    {
      "title": "Love bugs are most active during the day, so you can avoid them.",
      "content": "Love bugs are most active during the day, so you can avoid them. [13] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source If you’re planning on hosting a garden party or a BBQ, wait until the sun sets to avoid love bugs entirely. These pesky critters sleep at night, so you’re much less likely to encounter them in the evening."
    },
    {
      "title": "Professional exterminators can use foggers to kill adult love bugs.",
      "content": "Professional exterminators can use foggers to kill adult love bugs. However, keep in mind that typically, repeat treatments will be needed to keep love bugs at bay for the entire season. If your home or your yard is overrun with love bugs, call a professional to come and assess your home. [14] X Research source Love bugs aren’t dangerous to humans or animals, so they’re more of a nuisance. If you want to avoid using insecticides in your home, you can always just wait for love bug season to end."
    }
  ]
}