{
  "url": "https://www.wikihow.com/Make-a-Large-Christmas-Star",
  "title": "How to Make a Large Christmas Star",
  "steps": [
    {
      "title": "Gather the parts.",
      "content": "Gather the parts. You will need: 3 - 10' sections of 1/2\" plastic conduit, 10 - 1/4\" X 3\" galvanized bolts, 10 1/4\" galvanized fender washers, 10 1/4\" lock washers, 10 1/4\" galvanized nuts, 2 strings or more of 100 count mini lights, plastic ties or electrical tape."
    },
    {
      "title": "Cut the conduit in half so you have 6–5 feet (1.8–1.5 m) tubes.",
      "content": "Cut the conduit in half so you have 6–5 feet (1.8–1.5 m) tubes."
    },
    {
      "title": "Drill a 3/8\" hole through one end of 5 pieces of conduit 1\" from one end",
      "content": "Drill a 3/8\" hole through one end of 5 pieces of conduit 1\" from one end"
    },
    {
      "title": "Bolt two pieces of conduit together using the 3\" bolt.",
      "content": "Bolt two pieces of conduit together using the 3\" bolt. With the bolt through the conduit slide the fender washer on followed by the lock washer then the nut. Finger tighten."
    },
    {
      "title": "Lay this \"V\" onto the ground and lay the drilled end of another 5 feet (1.5 m) section on the one end of the \"V\".",
      "content": "Lay this \"V\" onto the ground and lay the drilled end of another 5 feet (1.5 m) section on the one end of the \"V\". You are now forming the star. Drill through the pre-drilled conduit into the undrilled conduit. You do it this way to make sure the holes line up and the bolt will fit through. With the bolt through the conduit slide the fender washer on followed by the lock washer then the nut. Finger tighten."
    },
    {
      "title": "Continue with the remaining 2 pieces of conduit until you have bolted all five corners of the star together.",
      "content": "Continue with the remaining 2 pieces of conduit until you have bolted all five corners of the star together. The star will have play in it so shape the star until you are happy with the way it looks."
    },
    {
      "title": "Notice that you have 5 points inside the star where the conduit crosses.",
      "content": "Notice that you have 5 points inside the star where the conduit crosses. Drill these spots and bolt them one by one so that your star holds its shape."
    },
    {
      "title": "Wrap the star with the lights.",
      "content": "Wrap the star with the lights. Keep in mind that there are 10 pieces of the star that need to be wrapped. (5 on each side) if you put Twenty lights on each side, your star will be uniformly lit. Attached the lights using electrical tape and/or plastic tie wraps."
    },
    {
      "title": "To gain height, you can put a 10 feet (3.0 m) 1/2\" metal conduit a foot inside a 10 feet (3.0 m) 3/4\" metal conduit.",
      "content": "To gain height, you can put a 10 feet (3.0 m) 1/2\" metal conduit a foot inside a 10 feet (3.0 m) 3/4\" metal conduit. Drill a hole though both pieces of conduit and secure with a cotter pin. Your pole should now be about 19 feet (5.8 m) long. Drill another hole one inch down from the end of the 1/2\" conduit. Replace the top bolt on the star with a 4.5\" bolt and run the bolt through the conduit to secure it in place. Mount the pole to a chimney, tree, playhouse, wall or whatever you have to put your star in the sky! Have fun!"
    }
  ]
}