{
  "url": "https://www.wikihow.com/Make-Jello-Shots",
  "title": "How to Make Jello Shots",
  "steps": [
    {
      "title": "Gather your ingredients.",
      "content": "Gather your ingredients. To make approximately 32 1-ounce (30 ml) shots, all you'll need is: 1 6-oz. package of Jello (170 grams) Approximately 3 cups of water Approximately 1 cup of chilled alcohol of your choice"
    },
    {
      "title": "Mix the water and alcohol to make 2 cups.",
      "content": "Mix the water and alcohol to make 2 cups. The proportions will depend on the proof of the alcohol you use. Use the following ratios to ensure that the shots will set: 13 oz. (26 tbsp., 390 ml) of 30 to 50 (~20%) proof alcohol with 3 oz. (6 tbsp., 90 ml) water 10 oz. (20 tbsp., 300 ml) 80 to 100 (~45%) proof alcohol with 6 oz. (12 tbsp., 180 ml) water 6 oz. (12 tbsp., 180 ml) 150 to 200 proof alcohol with 10 oz (20 tbsp., 300 ml) water"
    },
    {
      "title": "Put the mixture in the refrigerator to chill.",
      "content": "Put the mixture in the refrigerator to chill. Wait until the mixture is completely chilled before moving onto the next step. This is important because the temperature at which alcohol evaporates (the boiling point) is 78.6 degrees C (173°F). Later you will mix the alcohol with a water that was just boiled at 100 degrees C (212°F). If the alcohol isn't cold, it might exceed its boiling point when mixed, and some of the alcohol will evaporate. This will make your shots less potent."
    },
    {
      "title": "Bring more than 1 cup of water to a boil.",
      "content": "Bring more than 1 cup of water to a boil. You'll need exactly 1 cup of boiling water, so put a little more than that in the pot or kettle since some will evaporate."
    },
    {
      "title": "Measure out 1 cup of boiling water and mix it with the powdered Jello.",
      "content": "Measure out 1 cup of boiling water and mix it with the powdered Jello. Stir constantly until the powder is completely dissolved."
    },
    {
      "title": "Stir in the chilled water and alcohol mixture.",
      "content": "Stir in the chilled water and alcohol mixture."
    },
    {
      "title": "Spray the inside of the cups with cooking spray so the Jello easily slides out later.",
      "content": "Spray the inside of the cups with cooking spray so the Jello easily slides out later. Adding small plastic spoons or Popsicle sticks can help, too."
    },
    {
      "title": "Pour the mixture into the cups.",
      "content": "Pour the mixture into the cups."
    },
    {
      "title": "Place the shots on a tray in refrigerator (not the freezer).",
      "content": "Place the shots on a tray in refrigerator (not the freezer). Chill them until they become firm (approximately 2 to 4 hours). Refrigerate until served and make sure to serve them cold."
    },
    {
      "title": "Cut oranges in half.",
      "content": "Cut oranges in half."
    },
    {
      "title": "Use a spoon to remove the pulp, leaving just the rind of half an orange.",
      "content": "Use a spoon to remove the pulp, leaving just the rind of half an orange."
    },
    {
      "title": "Fill the halves with Jello mixture.",
      "content": "Fill the halves with Jello mixture."
    },
    {
      "title": "Refrigerate the filled orange halves overnight.",
      "content": "Refrigerate the filled orange halves overnight. Even though they'll set in a few hours, the extra time chilling helps them firm up even more so that they don't fall apart when you cut them."
    },
    {
      "title": "Cut orange halves into thirds.",
      "content": "Cut orange halves into thirds. See How to Make Jello Shots in an Orange for more information."
    },
    {
      "title": "Get three 3-ounce (85 g) packages of Jello, each of a different color.",
      "content": "Get three 3-ounce (85 g) packages of Jello, each of a different color."
    },
    {
      "title": "Make a Jello shot mixture from one package by cutting the recipe given earlier in half.",
      "content": "Make a Jello shot mixture from one package by cutting the recipe given earlier in half."
    },
    {
      "title": "Fill all the cups 1/3 of the way with the first batch of Jello.",
      "content": "Fill all the cups 1/3 of the way with the first batch of Jello."
    },
    {
      "title": "Allow the Jello to set completely.",
      "content": "Allow the Jello to set completely."
    },
    {
      "title": "Repeat the same process for the second color.",
      "content": "Repeat the same process for the second color. Pour the second batch into the same set of cups as the first. This will be your second layer of color. Your cups should be 2/3 of the way full now."
    },
    {
      "title": "Allow the two layers of Jello to set completely.",
      "content": "Allow the two layers of Jello to set completely."
    },
    {
      "title": "Make a third batch and use that to fill all the cups.",
      "content": "Make a third batch and use that to fill all the cups. This will be your third (top) layer of color."
    },
    {
      "title": "Allow the three layers to set completely before serving.",
      "content": "Allow the three layers to set completely before serving."
    },
    {
      "title": "Make normal Jello shots with yellow Jello.",
      "content": "Make normal Jello shots with yellow Jello."
    },
    {
      "title": "Before pouring the Jello into the cups, add green and/or blue food coloring to make the Jello green.",
      "content": "Before pouring the Jello into the cups, add green and/or blue food coloring to make the Jello green. You can make multiple batches with varying shades of green if you want!"
    },
    {
      "title": "Serve.",
      "content": "Serve. These are especially great for St. Patrick's Day or Earth Day."
    },
    {
      "title": "Start with a 3-ounce (85 g) package of Jello.",
      "content": "Start with a 3-ounce (85 g) package of Jello. Lime and orange flavors are ideal, as they will taste similar to vodka-based mixed drinks. Cherry may leave your Jello with a flavor reminiscent of cough syrup. Berry blue and grape are not recommended either."
    },
    {
      "title": "Mix the powder with 1/2 cup of boiling water.",
      "content": "Mix the powder with 1/2 cup of boiling water. Don't skimp on this step—the water needs to be actually boiling to effectively dissolve the powder, and the mixture won't set if you use less than 4 oz."
    },
    {
      "title": "Stir the mixture until the powder is completely dissolved.",
      "content": "Stir the mixture until the powder is completely dissolved."
    },
    {
      "title": "Add 1-3/4 cup of 80-proof vodka to the mixture.",
      "content": "Add 1-3/4 cup of 80-proof vodka to the mixture. You can actually add up to 2-1/4 cups of 80-proof vodka and the Jello will still set. However, anything more than 1-3/4 cups will cause the gelatin to get soft and slimy, and the liquor will overwhelm all of the other flavors."
    },
    {
      "title": "Pour the mixture into cups.",
      "content": "Pour the mixture into cups. If you used 1-3/4 cups of vodka, you will be able to make eighteen 1-oz. (30 ml) shots, or nine 2-oz. (60 ml) shots."
    },
    {
      "title": "Add 1 packet of Jellobah shot mix to 200 milliliters (6.8 fl oz) of water.",
      "content": "Add 1 packet of Jellobah shot mix to 200 milliliters (6.8 fl oz) of water. Mix till dissolved."
    },
    {
      "title": "Add 200ml of your favourite alcohol or 100 milliliters (3.4 fl oz) of alcohol and 100ml of your mixer.",
      "content": "Add 200ml of your favourite alcohol or 100 milliliters (3.4 fl oz) of alcohol and 100ml of your mixer."
    },
    {
      "title": "Pour into shot glasses.",
      "content": "Pour into shot glasses."
    },
    {
      "title": "Wait 5 to 10 minutes.",
      "content": "Wait 5 to 10 minutes."
    },
    {
      "title": "Bam!",
      "content": "Bam! Instant Jello shot. No refrigeration required. Serve."
    },
    {
      "title": "Make some classic cocktail Jello shots.",
      "content": "Make some classic cocktail Jello shots . This is a great way to put a new spin on your favorite drink!"
    },
    {
      "title": "Try festive Jello shots for the holidays.",
      "content": "Try festive Jello shots for the holidays. If you're planning on having a holiday party, whip up a couple holiday-themed shots to set the mood."
    },
    {
      "title": "Treat yourself to no bake dessert Jello shots.",
      "content": "Treat yourself to no bake dessert Jello shots . Sometimes it's hard to find the time to bake an entire cake or batch of cookies. Keep the taste but ditch the baking by creating Jello shots inspired by your favorite dessert!"
    },
    {
      "title": "Try some fruity Jello shots.",
      "content": "Try some fruity Jello shots . These shots, which can be fruity only in taste or may contain actual pieces of fruit, are an awesome refreshment on any hot summer day."
    },
    {
      "title": "Show team spirit with game day Jello shots.",
      "content": "Show team spirit with game day Jello shots . These Jello shots will put a spirited twist on the traditional beer during game day."
    }
  ]
}