{
  "url": "https://www.wikihow.com/Make-a-Leave-in-Hair-Conditioner",
  "title": "How to Make a Leave in Hair Conditioner",
  "steps": [
    {
      "title": "Mix up a simple sprayable conditioner with water and conditioner.",
      "content": "Mix up a simple sprayable conditioner with water and conditioner. Fill a spray bottle with 1¼ cups (300 milliliters) distilled water. Add 3 tablespoons (45 milliliters) of your usual conditioner. Close the bottle, then shake it to mix everything together. [2] X Research source For something more moisturizing, mix equal parts of conditioner and water. If the mixture is too thick to spray, then add a little more water."
    },
    {
      "title": "Create a moisturizing conditioner by adding water and oil.",
      "content": "Create a moisturizing conditioner by adding water and oil. Combine the ingredients listed below in a spray bottle; if you are adding essential oils, be sure to use a glass spray bottle. Close the bottle and shake it to combine the ingredients. Apply the conditioner to dry or damp hair to soften or detangle your hair. [3] X Research source 4 ounces (120 milliliters) distilled water 1 ounce (30 milliliters) silicone-free conditioner 1 ounce (30 milliliters) almond, avocado, fractionated coconut, jojoba, or olive oil (optional)"
    },
    {
      "title": "Add some aloe vera and coconut oil if you want something moisturizing.",
      "content": "Add some aloe vera and coconut oil if you want something moisturizing. Pour the ingredients listed below into a spray bottle. Close the bottle and shake it until the conditioner and aloe vera dissolve. Apply the conditioner to damp hair to add moisture and shine. If you have curly hair, this will help define those curls. [4] X Research source 8 ounces (250 milliliters) light conditioner 5 ounces (150 milliliters) distilled water 3 ounces (90 milliliters) aloe vera juice or aloe vera gel 1 to 2 ounces (30 to 60 milliliters) fractionated coconut oil"
    },
    {
      "title": "Make an extra-moisturizing conditioner by adding oil and glycerin.",
      "content": "Make an extra-moisturizing conditioner by adding oil and glycerin. Mix together the ingredients listed below in a spray bottle. If you are adding essential oil, be sure to use a glass spray bottle instead. Close the bottle, then shake it to combine the ingredients. 2 ounces (60 milliliters) light conditioner 1½ ounces (45 milliliters) distilled water 1 ounce (30 milliliters) avocado, coconut, or olive oil ½ ounce (15 milliliters) vegetable glycerin 1 teaspoon silk peptide powder (optional) 2 to 3 drops essential oil (optional)"
    },
    {
      "title": "Repair dry, brittle hair with coconut oil.",
      "content": "Repair dry, brittle hair with coconut oil. Pour the aloe vera gel and water into a spray bottle, and shake it to mix. In a separate container, combine the coconut oil and the avocado oil. Add the oil mixture into the spray bottle, and shake it to mix it again. Apply the conditioner to damp hair. 1 ounce (30 grams) coconut oil 1 teaspoon avocado oil 2 ounces (60 milliliters) aloe vera gel ⅓ cup (80 milliliters) distilled water"
    },
    {
      "title": "Hydrate your hair and prevent dandruff with aloe vera and jojoba oil.",
      "content": "Hydrate your hair and prevent dandruff with aloe vera and jojoba oil. Combine all of the ingredients listed below into a spray bottle, preferably a glass one. Close the bottle and shake it to combine the ingredients. Apply the conditioner to damp hair; you will need to shake the bottle before each use. 1½ cups (350 milliliters) aloe vera juice 2 cups (475 milliliters) coconut water 2 teaspoons jojoba oil"
    },
    {
      "title": "Lock in moisture with jojoba and lavender oil.",
      "content": "Lock in moisture with jojoba and lavender oil. Melt the shea butter first, then stir it into the coconut milk. Mix in the jojoba oil and the lavender essential oil. Pour the mixture into a glass spray bottle. Warm the conditioner up before applying it to your hair. This conditioner may also help stimulate growth and scalp sooth irritations. ½ cup (120 milliliters) coconut milk 3 teaspoons shea butter 2 teaspoons jojoba oil 5 drops lavender essential oil"
    },
    {
      "title": "Make a detangling conditioner with aloe vera, glycerin, and essential oils.",
      "content": "Make a detangling conditioner with aloe vera, glycerin, and essential oils. Pour the ingredients from the list below into a glass spray bottle, then shake it until the aloe vera gel dissolves. Spray the detangler onto damp hair, wait 1 minute, then gently comb your hair with a wide toothed comb. Detangle the ends first and then work towards the roots. [5] X Research source This may also help relieve dandruff and dryness as well. 5 tablespoons (75 milliliters) distilled water 1 tablespoon (15 milliliters) aloe vera gel ½ to 1 tablespoon (7.5 to 15 milliliters) vegetable glycerin 10 drops rosemary or lavender essential oil"
    },
    {
      "title": "Control oil, remove build-up, and soften hair with apple cider vinegar.",
      "content": "Control oil, remove build-up, and soften hair with apple cider vinegar. Pour the distilled water into an 8-ounce (240-milliliter) glass spray bottle. Add the apple cider vinegar and the lemon essential oil (to reduce the smell of the vinegar). Close the bottle and shake it to combine the ingredients. Spray the conditioner onto damp hair to detangle it, remove build-up, and add shine. [6] X Research source ⅔ cup (160 milliliters) distilled water 2 teaspoons apple cider vinegar 7 drops lemon essential oil"
    },
    {
      "title": "Soften your hair, reduce frizz, and prevent breakage with ylang-ylang oil.",
      "content": "Soften your hair, reduce frizz, and prevent breakage with ylang-ylang oil. Mix together the aloe vera and coconut water in a glass spray bottle. Stir in the distilled water and the honey. Melt the coconut oil in a separate jar, then stir in the ylang-ylang oil and essential oil. Stir the oil mixture into the aloe vera mixture. 2 teaspoons aloe vera juice or gel 2 teaspoons coconut water 4 ounces (120 milliliters) distilled water 2 teaspoons honey 2 teaspoons coconut oil 2 teaspoons ylang-ylang oil 6 drops essential oil"
    },
    {
      "title": "Make a simple, creamy conditioner with coconut oil.",
      "content": "Make a simple, creamy conditioner with coconut oil. Whip the ingredients listed below using a mixer. Transfer the mixture into a glass jar. Apply the conditioner to damp, dry, or wet hair. Store the mixture in a cool, dry place. 2 ounces (60 milliliters) aloe vera gel 1 ounce (30 grams) coconut oil, softened 1 teaspoon avocado oil"
    },
    {
      "title": "Use honey and shea butter to make a hydrating conditioner.",
      "content": "Use honey and shea butter to make a hydrating conditioner. Melt the shea butter and coconut oil in a double-boiler or in the microwave. Stir in the honey and the essential oil. Pour the mixture into a small, glass jar. Allow it to solidify before using it in your hair. 1 ounce (30 grams) shea butter 1 ounce (30 grams) coconut oil 1 teaspoon honey 2 to 3 drops lavender essential oil"
    },
    {
      "title": "Use tea tree oil to treat scalp conditions, such as psoriasis.",
      "content": "Use tea tree oil to treat scalp conditions, such as psoriasis. Melt the shea butter, then stir in the coconut milk, aloe vera, jojoba oil, and tea tree oil. Pour the mixture into a small, glass jar. Allow it to solidify, then use it in your hair as desired. 4 ounces (115 grams) shea butter 4 ounces (120 milliliters) coconut milk 2 tablespoons (30 milliliters) aloe vera gel 2 teaspoons jojoba oil 2 teaspoons tea tree oil"
    },
    {
      "title": "Treat dandruff and frizz with hibiscus powder.",
      "content": "Treat dandruff and frizz with hibiscus powder. Melt the shea butter first, then stir in the distilled water and aloe vera gel. Add in the lavender essential oil and the grapefruit seed extract. Stir in the hibiscus powder, then pour the mixture into a glass jar. Allow it to solidify before using it. 4 ounces (115 grams) shea butter 8 ounces (240 milliliters) distilled water 2 ounces (60 milliliters) aloe vera gel 1 teaspoon lavender essential oil 1 teaspoon grapefruit seed extract 1 tablespoon (14 grams) hibiscus powder"
    },
    {
      "title": "Treat your scalp and stimulate hair growth with avocado oil.",
      "content": "Treat your scalp and stimulate hair growth with avocado oil. Melt the shea butter, then stir in the avocado oil and rosemary essential oil. Pour the mixture into a glass jar, then refrigerate it until it solidifies. You can apply the conditioner to your hair for overall conditioning. You can also massage it into your scalp to maintain its health. 4 ounces (115 grams) shea butter 2 teaspoons avocado oil 6 drops of rosemary essential oil"
    }
  ]
}