{
  "url": "https://www.wikihow.com/Identify-Honey-Bees",
  "title": "How to Identify Honey Bees",
  "steps": [
    {
      "title": "Identify the body shape of the insect.",
      "content": "Identify the body shape of the insect. The easiest way to differentiate a honey bee from other types of bees or wasps is to look at the shape of their thorax and abdomen. Honey bees have a distinctive barrel-shaped body and don't have a thin middle section between the thorax and abdomen like other insects. [1] X Research source Wasps tend to have a very thin middle section and distinct thorax and abdomen. Honey bees have a thorax and abdomen that look like one complete piece."
    },
    {
      "title": "Look for hair on the body and head.",
      "content": "Look for hair on the body and head. Honey bees are generally covered in small hairs that make them look fuzzy all over. Honey bees, unlike bumble bees, tend to have shorter hairs that are only visible when looking at them up close. [2] X Research source These tiny hairs are how the honey bee gathers pollen and transports it to other flowers, so the hair is very important for the survival of the bee!"
    },
    {
      "title": "Follow the bee's flight path to tell the difference between bees and wasps.",
      "content": "Follow the bee's flight path to tell the difference between bees and wasps. Honey bees are pollinators and will be flying between flowers and their nest to provide pollen and nectar to the colony. Wasps are carnivores, and will be travelling to locations where there are other insects to eat. Wasps and other carnivorous insects will also be attracted to human food, like your picnic. Honey bees normally won't come around human food but may be attracted by nearby flowers or other sweet scents. As such, you can take a number of steps to keep away from bees and wasps when you're eating outside. Other bees, such as orchid bees, will also fly between flowers to pollinate. This method is only good for differentiating between bees and wasps."
    },
    {
      "title": "Use a magnifying glass to look at the eyes.",
      "content": "Use a magnifying glass to look at the eyes. Honey bees have hairy eyes to collect pollen from flowers and transport it over long distances. Honey bees will have two larger eyes on either side of their head, and then three small eyes in a triangle shape in the center of the head, which is a distinguishing trait of honey bees. [3] X Research source Male and female honey bees have eyes that are slightly different sizes and shapes, but they are both still hairy."
    },
    {
      "title": "Search for a nest inside hollow trees and other protected structures.",
      "content": "Search for a nest inside hollow trees and other protected structures. Honey bee nests are easy to spot because they have the distinctive “honeycomb” structure in either white or yellow color. They won't build nests hanging from tree branches, like other types of bees, because the nest and honey would be unprotected. Instead, look inside of hollow trees or manmade structures. Honey bees will never make a nest in the ground. If you see insects have nested in holes, they are likely Yellow Jacket wasps, which are very dangerous and can sting. Honey bee nests never have a protective or paper-like coating around them. They are open to the air and can appear shiny due to the nectar and honey being produced."
    },
    {
      "title": "Measure the size of the bee.",
      "content": "Measure the size of the bee. Male honey bees tend to be around 2 centimetres (0.79 in) long, which is slightly larger than female honey bees, which are normally 1.25 centimetres (0.49 in). The small size of the female bees, which are also known as worker bees, allow them to move quickly from flower to flower to pollinate and collect food for the nest. Males tend to have bodies that are more rounded than females, making them less agile while in flight. The largest honey bee in the colony is the female queen bee, but it will only emerge from the nest when it's time to swarm. It's very unlikely that you will spot a queen bee outside of the nest!"
    },
    {
      "title": "Use a magnifying glass to carefully inspect the eyes of the bee.",
      "content": "Use a magnifying glass to carefully inspect the eyes of the bee. Female honey bees have smaller eyes on either side of their head that are proportional to their bodies. Male bees have very large eyes that make it easier for them to spot the queen as she is moving about. [4] X Research source The female bee's small, separated eyes help to locate flowers and plants to pollinate while in flight. The male bee's eyes will appear to touch at the top of the head, giving them a circular shape."
    },
    {
      "title": "Make note of where you found the bee in relation to the location of the nest.",
      "content": "Make note of where you found the bee in relation to the location of the nest. Most honey bees seen pollinating are female worker bees. The large male, or drone, bees can normally be found in the area near the nest. Male bees won't venture too far from the location of the nest and the queen bee. Male bees will sometimes fly away from the nest in large groups to mate with other queens."
    }
  ]
}