{
  "url": "https://www.wikihow.com/Avoid-Guys-Hitting-on-You",
  "title": "How to Avoid Guys Hitting on You",
  "steps": [
    {
      "title": "Sometimes honesty is the best policy.",
      "content": "Sometimes honesty is the best policy. If a guy asks you out, tell him that you’re just not interested. You don’t have to be rude, but you can be firm about your decision. Say something like: [1] X Research source “Sorry, I’m not looking for a relationship right now.” “I’m flattered, but I have a boyfriend.” “I’m just here to have fun, not to flirt with anyone. Thanks though.”"
    },
    {
      "title": "He should get the message that you’re not available.",
      "content": "He should get the message that you’re not available. If you don’t have a significant other, feel free to make one up. Talk about what they do for work, where they are tonight, or how you two met. [2] X Research source If you’re out with a group of friends and you really want to sell it, you could grab one of your friends and ask them to pose as your partner."
    },
    {
      "title": "Guys are less likely to approach you if you’re with friends.",
      "content": "Guys are less likely to approach you if you’re with friends. If you’re heading out to a bar or a club, try to stay near your friends at all times. This isn’t a foolproof method (some dudes are willing to approach an entire friend group at once), but it might help! [3] X Research source This is a good rule to follow in general on a night out. There’s safety in numbers."
    },
    {
      "title": "He’ll get the message that you aren’t interested.",
      "content": "He’ll get the message that you aren’t interested. Start talking about how cute another boy is, ask him to set you up with one of his friends, or simply tell him how much his friendship means to you. If you two have known each other for a little while, he should get the message right away. [4] X Research source This strategy might not work as well for total strangers, but it’s worth a shot on acquaintances or friends of friends."
    },
    {
      "title": "The weather, sports, and current events are all fair game.",
      "content": "The weather, sports, and current events are all fair game. If he starts steering the conversation into a sexual or flirty topic, quickly change the subject. If you block his advances, he won’t be able to hit on you for long. For example, if he compliments what you’re wearing, say something like, “Thanks, I wore it because it’s so hot out today. Have you noticed how sunny it’s been lately?”"
    },
    {
      "title": "Talk about how cute he’d look with one of your friends.",
      "content": "Talk about how cute he’d look with one of your friends. If you’re out with a group, you could actually pull one of your friends aside to chat with him (as long as the friend is willing). If you’re by yourself, just talk about how well he and your friend would match up in the future. [5] X Research source For example, you could say, “Oh wow, you roller skate? You should meet my friend Marsha, she loves roller skating!” If the guy is being creepy or aggressive, it’s best not to pull one of your friends into it. Just try to leave the area and get somewhere safe."
    },
    {
      "title": "You can’t abandon your friends!",
      "content": "You can’t abandon your friends! Extract yourself from the conversation by saying you need to get back to your group across the bar. If you’re by yourself, tell the guy that you’re meeting a friend in 10 minutes so you have to get going. If he insists, offer to take his number and text him later (but don’t actually text him). [6] X Research source Say something like, “Well, it’s been nice talking to you, but I think my friends are getting ready to leave.” Or, “It was nice to meet you, but I have plans with a friend so I’ve gotta run.”"
    },
    {
      "title": "It can be tough to extract yourself from a conversation on your own.",
      "content": "It can be tough to extract yourself from a conversation on your own. Signal to a friend across the room to come over and help you out. They’ll probably have better success getting you away from a guy than you would on your own. [7] X Research source Your friend could say something like, “Hey, we’re all about to do shots over here. Are you coming?” Or, “We’re getting ready to head out. Here’s your coat.”"
    },
    {
      "title": "It might not be your first choice, so use this as a last resort.",
      "content": "It might not be your first choice, so use this as a last resort. Burp, sneeze, or hock a loogie to make the guy run away. It might not work 100% of the time (some guys are into that kind of thing), but it’s worth a shot! [8] X Research source The goal is to make yourself unattractive to him. If you can do that, he’ll probably leave on his own."
    },
    {
      "title": "If you don’t engage, he can’t keep hitting on you.",
      "content": "If you don’t engage, he can’t keep hitting on you. If a man approaches you in public, you don’t have to respond. If you want to, you can even get up and walk away. [9] X Research source This is the best way to get rid of someone who’s being persistent. If he’s not catching any of your hints (or he doesn't want to), it means he’s not going to give up."
    },
    {
      "title": "You never have to stick around to be hit on.",
      "content": "You never have to stick around to be hit on. Don’t worry about being polite—if you get a bad feeling, simply walk away. If you’re by yourself and you feel threatened, head to a populated area or call for emergency services. Your instincts are probably right, so you should listen to your gut. If a guy ever follows you around or demands your contact info, that’s a red flag. Head to a populated area to surround yourself with help."
    }
  ]
}