{
  "url": "https://www.wikihow.com/Car-Jerks-when-Braking",
  "title": "How to Diagnose Car Jerking when Braking",
  "steps": [
    {
      "title": "Worn-out brake pads",
      "content": "Worn-out brake pads The brake pads grind against the rotors when you press the brake pedal to force the tires to slow down. But if the brake pads are worn down too far, it may feel like your vehicle is stuttering or shaking when you brake— especially if you brake hard at low speeds. [1] X Research source Other Symptoms: A loud screeching noise coming from your tires when you brake. You may also notice you have to press harder on the brake pedal to get a response. On modern vehicles, you may also see a brake light indicator on your dashboard. The Solution: See a mechanic to have your brake pads replaced. Expect to spend around $150-300 per axle."
    },
    {
      "title": "Bad brake rotors",
      "content": "Bad brake rotors The rotors are the metal discs behind each tire that the brake pads rub against to slow the vehicle’s tires down. If the rotors are on the older side and you’ve experienced brake problems in the past, it’s possible that the rotors are worn down in an uneven pattern and that’s causing your car to lurch forward when you brake in a certain way. [2] X Research source Other Symptoms: You may notice grinding noises or squeaking. You’re also likely to feel your steering wheel shaking when you brake at high speeds . The Solution: The rotors must be replaced, so see a mechanic. It shouldn’t cost more than $150-200 per rotor."
    },
    {
      "title": "Caliper issues",
      "content": "Caliper issues The caliper is the housing that holds the brake pad. When you press the brake pedal, the caliper is the part that actually pushes the pad into the rotor. But if the caliper isn’t calibrated correctly or the caliper was damaged somehow, it may not be applying the brake pad evenly, which can cause jerking. [3] X Research source Other Symptoms: Noise comes from one tire, your vehicle pulls to one side when you brake, or your brake fluid leaks. The Solution: The calipers need to be replaced and/or reassembled. You’ll likely need to spend around $800 for new calipers and realignment."
    },
    {
      "title": "Low brake fluid levels",
      "content": "Low brake fluid levels Brake fluid is the liquid inside of your hydraulic lines. When you press the pedal, the fluid is compressed and this pressure pushes the brake pads and calipers into the rotors. If you’ve got a leak (or the brake fluid hasn’t been changed in years), the brake pad won’t engage the rotor all the way and your car may stutter. [4] X Research source Other Symptoms: There are leaks under your vehicle when you drive after being parked, your car feels like it’s not slowing down until you press harder than normal on the brakes, your brake pedal moves with no resistance, or you get a “brake fluid” indicator on the dashboard. The Solution: See a mechanic to have leaks ruled out or fixed. Then, have the brake fluid flushed and replaced. Expect to spend roughly $200-500."
    },
    {
      "title": "Air in the brake lines",
      "content": "Air in the brake lines If you recently had work done on your brakes and the repair or maintenance wasn’t properly carried out, air may have entered your brake lines. This can mess with the pressurized fluid’s ability to properly push the calipers against the rotors. As a result, the car may jerk erratically when you press the pedal. [5] X Research source Other Symptoms: Your brake pedal fluctuates between being too sensitive, too loose, or just generally ineffective. The Solution: See a mechanic to have your brake lines tested, bled, and refilled as needed. This shouldn’t cost more than $100-200."
    },
    {
      "title": "Dirty brakes",
      "content": "Dirty brakes If your brakes and rotors are extremely dirty, it can manifest as jerking when you brake. If the sides of your cars are caked in mud or your rotors are covered in rust from months of sitting out in the driveway, this is probably the culprit. [6] X Research source Other Symptoms: Your rotors and wheels look dirty, your brakes make a little bit of noise, and the jerking isn’t especially pronounced. The Solution: If you drive around the block a few times and any noises or jerking go away, you likely wore the rust or dirt off from braking a few times. If that doesn’t work, see a mechanic to have them take a look."
    },
    {
      "title": "Damaged ABS",
      "content": "Damaged ABS The anti-lock braking system (ABS) is designed to automatically kick in when your vehicle is about to hydroplane to prevent your vehicle from sliding. It does this by automatically braking and not braking to generate friction. If the ABS isn’t operating correctly though, it may cause your vehicle to kick forward whenever it turns on. [7] X Research source Other Symptoms: You only notice the jerking when it’s raining or the roads are wet. You may also notice the ABS light on your dashboard pops on when it’s not supposed to (or vice versa). The Solution: The ABS module likely needs to be replaced or reconfigured. The cost depends on the make and model, but expect to spend roughly $100-300."
    },
    {
      "title": "Worn-out or unbalanced tires",
      "content": "Worn-out or unbalanced tires Tires that have worn out unevenly or tires that are not aligned properly will cause your vehicle to vibrate when you brake abruptly. Any minor differential between your tires will cause vibrations, but that shaking will be much more noticeable when you brake. [8] X Research source Other Symptoms: Your steering wheel feels “off,” your steering wheel vibrates, any shaking gets worse the faster you go , or your car hydroplanes more often than normal. The Solution: See a mechanic to have your tires replaced and realigned. This will likely cost between $100-800 depending on whether you need to replace any tires or not."
    },
    {
      "title": "Transmission problems",
      "content": "Transmission problems The transmission is responsible for converting your engine’s power into the rotational energy for your tires. If the transmission isn’t working correctly though, your vehicle may rattle when you brake as the transmission struggles to slow down alongside the engine. [9] X Research source Other Symptoms: Your car also jerks when you accelerate or change gears, your car slides in and out of gear, you have transmission fluid leaks, and your check engine light comes and stays on. The Solution: See a mechanic. The transmission is one of the more complex components for your vehicle, so it could be a variety of issues causing the problem. The cost may simply be a $100 minor adjustment, or up to $3,0000 for a brand-new transmission."
    },
    {
      "title": "No, you must be able to brake safely to drive your vehicle.",
      "content": "No, you must be able to brake safely to drive your vehicle. It’s okay to drive your vehicle to the mechanic if you can adequately control your vehicle, you go slow, and you leave plenty of room to brake. If you feel like your ability to stop is impacted though, get a tow truck to have your vehicle taken to an auto shop. Because the issues here are impacting your brakes, it’s not safe to make any DIY repairs. Leave the brake system to the professionals—it’s just not worth the risk."
    }
  ]
}