{
  "url": "https://www.wikihow.com/Check-Your-YouTube-Channel%27s-Copyright-Status",
  "title": "How to Check Your YouTube Channel's Copyright Status: Complete Guide",
  "steps": [
    {
      "title": "Go to https://www.youtube.com in your web browser.",
      "content": "Go to https://www.youtube.com in your web browser. You can use any web browser on your desktop computer. If you are not logged in automatically, click Log In in the upper-right corner and sign in with the username and password associated with your Google account. [2] X Research source"
    },
    {
      "title": "Click ☰.",
      "content": "Click ☰ . If you don't see the menu bar to the left, click the icon with three horizontal lines in the upper-left corner of the screen."
    },
    {
      "title": "Click your Your Videos.",
      "content": "Click your Your Videos . It's in the menu bar to the left. This displays a list of your videos in YouTube Studio. Alternatively, you can click your profile icon in the upper-right corner and then click YouTube Studio . If your YouTube account has any copyright strikes or Content ID claims, they will be displayed in a window in the upper-left corner. To see a list of all your videos in YouTube Studio, click Content in the menu bar to the left. [3] X Research source"
    },
    {
      "title": "Click Filter.",
      "content": "Click Filter . It's at the top of your list of videos. It's next to an icon that resembles three lines with different lengths. This allows you to filter your videos by different categories, including copyright claims."
    },
    {
      "title": "Click Copyright claims.",
      "content": "Click Copyright claims . It's in the list of categories that appear when you click the Filters icon. This displays all videos that have copyright strikes and Content ID claims on them."
    },
    {
      "title": "Hover over the \"Restrictions\" column in the video list.",
      "content": "Hover over the \"Restrictions\" column in the video list. This displays a pop-up with an explanation of the copyright claim against the video."
    },
    {
      "title": "Click Show Details.",
      "content": "Click Show Details . This displays a detailed explanation of the copyright claim. The three boxes at the top tell you how the copyright claim affects your channel, whether or not the video is still visible on your channel, and whether or not it can be monetized. In the bottom row, you will see an explanation of the copyright content that was used, the content type, the time it was used in the video, the impact it has on the video, and who the copyright owner is. [4] X Research source"
    },
    {
      "title": "Click Select Action.",
      "content": "Click Select Action . It's in the second row on the right side. This displays a list of actions you can take to resolve the copyright claim. Actions may include replacing the audio with a different song, muting a copyrighted song, contacting the copyright claimant to resolve the claim, submitting a counter-notification, or disputing the claim."
    },
    {
      "title": "Select an action.",
      "content": "Select an action. This displays instructions on the action you selected. Follow the instructions to take action and resolve the claim. [5] X Research source Deleting a video that has a copyright strike will not resolve the claim."
    },
    {
      "title": "Go to https://www.youtube.com in your web browser.",
      "content": "Go to https://www.youtube.com in your web browser. You can use any web browser on your desktop computer. If you are not logged in automatically, click Log In in the upper-right corner and sign in with the username and password associated with your Google account. [6] X Research source"
    },
    {
      "title": "Click your profile icon in the upper-right corner.",
      "content": "Click your profile icon in the upper-right corner. It's the icon containing your profile image in the upper-right corner. If you have not uploaded a profile image to your Google account, it will display a colored circle with your initial in the middle. This displays your account menu."
    },
    {
      "title": "Tap YouTube Studio.",
      "content": "Tap YouTube Studio . This opens YouTube Studio where you can manage your content, monetization, and request copyright takedowns."
    },
    {
      "title": "Click Copyright.",
      "content": "Click Copyright . It's in the menu bar to the right. This displays a list of all your copyright removal requests and the status of each. [7] X Research source If you don't have any copyright removal requests, click New Removal Request in the upper-right corner. Fill out the form to submit a copyright removal request. [8] X Research source"
    }
  ]
}