{
  "url": "https://www.wikihow.com/Hang-a-Door-Mirror",
  "title": "How to Hang a Door Mirror",
  "steps": [
    {
      "title": "Hold the mirror at the approximate height you want it on the door.",
      "content": "Hold the mirror at the approximate height you want it on the door. Look in the mirror while holding it to make sure you can see all the parts of yourself that are important to you. Remember that you’ll likely be able to step back from the mirror to see your shoes. [1] X Research source Choose a door that gets good light if you plan to do your make up in the mirror. If possible, have a friend hold the mirror, so you can double check that the height works for you."
    },
    {
      "title": "Use a pencil to mark where the top of the mirror hits on the door.",
      "content": "Use a pencil to mark where the top of the mirror hits on the door. Holding the mirror in place, create a small pencil mark along the top edge. This will give you a reference point to work from as you center the mirror on the door. [2] X Research source It’s not important to mark the edges of the mirror. This mark is just to get an approximate feel for where you’d like to hang the mirror."
    },
    {
      "title": "Measure the door to find the center.",
      "content": "Measure the door to find the center. Use a measuring tape to measure the width of the door from edge to edge. Divide that number in half to get the precise center of the door’s width. On your height line, mark this true center of the door with a dark pencil mark. [3] X Research source If your door has decorative imprints or panels, measure only the center of the thick, central panel of the door. Decorative areas of interior doors are often hollow and not strong enough to hold a mirror."
    },
    {
      "title": "Find the center of the mirror by measuring.",
      "content": "Find the center of the mirror by measuring. Measure the width of the mirror using a measuring tape. Divide this measurement in half to get the precise center of the mirror. Create a light pencil mark at this measurement on the top of the mirror. [4] X Research source If there’s not a rough edge to mark the center of the mirror, use a small piece of painter’s tape to mark the center."
    },
    {
      "title": "Have a friend hold the mirror in its final, centralized position.",
      "content": "Have a friend hold the mirror in its final, centralized position. Ask your friend to align the center mark on your mirror and the center mark on your door’s height line. With the mirror in this ideal position, mark the center of the bottom edge of the mirror. [5] X Research source You will use this bottom mark as a guide to hang mirror clips, which will secure your mirror to the door."
    },
    {
      "title": "Screw 2 plastic mirror clips along the bottom edge line.",
      "content": "Screw 2 plastic mirror clips along the bottom edge line. Space these clips evenly from the center point of the mirror you marked while remaining only in the thick, center panel of the door (if it has panels). Screw these halfway in. [6] X Research source Do not set the screws wider than the width of your mirror. Your mirror will be most secure with these bottom screws at least 1 inch (2.5 cm) from the corner of the mirror on each side. If necessary, rotate the plastic face of the clip up so it is facing the top edge of the door. It will be prone to spinning until you place the mirror in the groove, since it is only half screwed in. You can buy mirror clips at your local hardware or home improvement store."
    },
    {
      "title": "Have a friend hold the mirror in place against the bottom clips.",
      "content": "Have a friend hold the mirror in place against the bottom clips. Slide the bottom edge of the mirror down into the groove of the 2 plastic clips you’ve half screwed into the door. Doing this will support the weight of the mirror from the bottom, but your friend will need to hold the top of the mirror against the door to keep it from falling. [7] X Research source If you have trouble fitting the bottom edge of the mirror into the groove, unscrew the bottom clips slightly to create more room."
    },
    {
      "title": "Using a level, create 2 marks, one on either long side of the mirror.",
      "content": "Using a level, create 2 marks, one on either long side of the mirror. About halfway up the mirror, mark 1 point on each side of the mirror at the same height. They appear like a matched pair. While your friend holds the mirror in place, screw a plastic mirror clip into each point to fully secure the sides of the mirror to the door. [8] X Research source The plastic face of the clip should rest against the front side of the mirror. It will hold the weight of the mirror, and your friend should be able to let go. If positioning your side clips halfway up the mirror would mean screwing them into a decorative portion of the door, adjust your clips up or down as a pair. Screw them into the solid center of the door so they can adequately support the weight of the mirror. It’s okay if your side clips are a third or two-thirds of the way down the door, for example. It won’t affect their weight-bearing capabilities."
    },
    {
      "title": "With the mirror now secured on the bottom and the sides, screw the bottom mirror clips all the way in.",
      "content": "With the mirror now secured on the bottom and the sides, screw the bottom mirror clips all the way in. Tighten all the clips so they are holding the mirror firmly against the door. Have your friend let go of the mirror. [9] X Research source"
    },
    {
      "title": "Secure the top edge of the mirror.",
      "content": "Secure the top edge of the mirror. Use two more plastic mirror clips to attach the top edge of your mirror to the door. Space these clips evenly from the center point of the mirror you marked at the beginning when measuring. Screw these only into the thick, center panel of the door (if it is decorative). [10] X Research source Place these top mirror clips no closer to the mirror’s corners than 1 inch (2.5 cm). That’s it! Your mirror is screwed in and ready to go."
    },
    {
      "title": "Choose a door that is not hard to close already.",
      "content": "Choose a door that is not hard to close already. Open and close a few potential doors for your mirror to see which close without any resistance. A hook will add width to your door and make an already snug fit even tighter. [11] X Research source If you have to press hard on a door to close it, that door is not a good candidate for an over-the-door mirror."
    },
    {
      "title": "Look for slim, low-profile hooks to keep from damaging your door frame.",
      "content": "Look for slim, low-profile hooks to keep from damaging your door frame. [12] X Expert Source Angelica Savard Home Stager, Realtor, & Interior Designer Expert Interview. 30 April 2020. Choose thin, flat hooks that closely mimic the shape of your door’s top edge. The more closely your hooks fit the door, the less they will rub and discolor your door frame. [13] X Research source"
    },
    {
      "title": "Choose hooks in your door’s paint color for an invisible look.",
      "content": "Choose hooks in your door’s paint color for an invisible look. To help your over-the-door mirror appear mounted, choose a mirror whose frame and hooks match your door. For a high-contrast look, choose a frame and hook color that pop against the color of your door. [14] X Research source There is no right color for a mirror frame, just pick the look that appeals to you most."
    },
    {
      "title": "Open the door.",
      "content": "Open the door. When you’re ready to hang the mirror, open the door wide. Remove any packaging on the mirror, which could potentially scratch the door."
    },
    {
      "title": "Slide the open side of the hooks over the top of the door.",
      "content": "Slide the open side of the hooks over the top of the door. Holding the sides of the mirror with your hands, lift the mirror up and place the hooks gently over the door. Depending on how tightly the hooks fit your door, you may need to open the mouths of them slightly so they can slip over the top."
    },
    {
      "title": "Move your mirror to the center of the door.",
      "content": "Move your mirror to the center of the door. Let go of your mirror once it is over the door. To center the mirror, slide the hooks gently in the direction you’d like to move it. You’re now ready to use the mirror for all your dressing needs."
    }
  ]
}