{
  "url": "https://www.wikihow.com/Do-a-Forward-Flip-in-the-Water",
  "title": "How to Do a Forward Flip in the Water",
  "steps": [
    {
      "title": "Lay out.",
      "content": "Lay out. Begin by laying out on your stomach in the water. Keep your legs straight and as far out as the water as possible (if you would like to look nice while doing it)."
    },
    {
      "title": "Take a breath.",
      "content": "Take a breath. Turn your head to the side and take a deep breath in, before you begin your forward roll. [1] X Research source"
    },
    {
      "title": "Tuck your knees in.",
      "content": "Tuck your knees in. Pull your knees in towards your chest and tuck your head in. The most desirable roll would include your nose touching your knees. If you would like to look nice, point your toes. Remember to hold this position for the rest of your roll. [2] X Research source"
    },
    {
      "title": "Begin moving your arms.",
      "content": "Begin moving your arms. Move your arms in a circular motion forward. Pull the water through and behind you to propel yourself upside down, all while keeping your body tucked in, knees to nose. [3] X Research source"
    },
    {
      "title": "Bring yourself up.",
      "content": "Bring yourself up. Once you're upside down, push the rest of the water up around you to spin back up right. Continue all the way around until you are vertical once again, but still in tucked into a ball. [4] X Research source"
    },
    {
      "title": "Leave the tucked in position.",
      "content": "Leave the tucked in position. Uncurl your body, straightening your legs and move your head so you are looking straight in front of you."
    },
    {
      "title": "Kick to the surface.",
      "content": "Kick to the surface. Using the flutter kick, propel yourself back to the surface of the water. It is best to stay as close to the surface of the water as you can. It will look prettier and seem more impressive. If you would like to do the roll deeper though, this will still work. [5] X Research source"
    },
    {
      "title": "Emerge from the water.",
      "content": "Emerge from the water. Come up and enjoy a nice breath of air that you may have been craving throughout the roll. Be careful not to breathe in to early though, or you may inhale a big gulp of water."
    },
    {
      "title": "For a tumble turn, use the same method for this forward roll, but, once you have finished the roll, stay under the water, go onto your back, push the wall with your feet and turn back over onto your stomach.",
      "content": "For a tumble turn, use the same method for this forward roll, but, once you have finished the roll, stay under the water, go onto your back, push the wall with your feet and turn back over onto your stomach."
    }
  ]
}