{
  "url": "https://www.wikihow.com/Do-Russian-Pushups",
  "title": "How to Do Russian Push-ups for an Intense Upper Body Workout",
  "steps": [
    {
      "title": "This variation combines a standard pushup and a forearm plank.",
      "content": "This variation combines a standard pushup and a forearm plank. Normally when you do a pushup , you lower yourself to the ground and push your hands down to lift your body back up again. During a Russian pushup, you’ll quickly transition into a plank at the bottom of your rep before returning to your starting position. [1] X Research source Even though pushups and planks are pretty standard exercises, combining them takes a lot more energy and burns more calories. [2] X Expert Source Kyle Kenny Master Trainer & Certified Personal Trainer Expert Interview. 2 November 2021."
    },
    {
      "title": "Get into a pushup position.",
      "content": "Get into a pushup position. Kneel down on an exercise mat and plant your hands flat on the ground with your hands just wider than shoulder-width. Walk your feet backward until your legs form a straight line with your back. [3] X Expert Source Kyle Kenny Master Trainer & Certified Personal Trainer Expert Interview. 2 November 2021. Engage your core muscles to keep your hips level with the rest of your body. [4] X Research source Be careful not to raise your hips higher than your back since you won’t be in proper form. Look straight down so your head and neck stay in line with the rest of your spine."
    },
    {
      "title": "Lower your body to the ground.",
      "content": "Lower your body to the ground. Whenever you’re ready to start your rep, Slowly drop your elbows to bring your body closer to the ground. [5] X Expert Source Kyle Kenny Master Trainer & Certified Personal Trainer Expert Interview. 2 November 2021. Keep your core engaged so your back and legs stay straight. Try to get your body as low as you can without actually resting on the ground. [6] X Research source Be careful not to let your back or hips sag during your exercise."
    },
    {
      "title": "Transition into a forearm plank.",
      "content": "Transition into a forearm plank. As soon as you get into the lowest position of your pushup, push your body backward until your forearm lies flat on the ground. Keep your elbows close to your sides and your back straight throughout the entire movement. Hold your body a few inches off the ground without letting your hips sag. [7] X Research source It can take a few tries to master this movement for Russian pushups. Take it slow the first few times you try so you don’t injure yourself."
    },
    {
      "title": "Push yourself back to your starting position.",
      "content": "Push yourself back to your starting position. Plant your toes into the ground and flex your ankles to move your entire body forward. As you’re moving, lift your forearms off of the ground and support your weight with your hands again. Straighten your arms to lift your body back up to where you started. [8] X Research source It may help to hop forward with your feet when you return to pushup position."
    },
    {
      "title": "Keep your core and glutes engaged so you don’t sag.",
      "content": "Keep your core and glutes engaged so you don’t sag. Tighten your abs and squeeze your glutes together to help you maintain your form throughout the entire exercise. Make sure you keep your bum in line with your back and legs so your body makes a straight line, or else you won’t get as good of a workout. [9] X Research source If you don’t keep your lower back flat, your pushups will be more difficult to complete."
    },
    {
      "title": "Look down and keep your body straight the entire time.",
      "content": "Look down and keep your body straight the entire time. Avoid raising or dropping your hips since it will be more difficult to hold your position. Instead, keep your spine and legs in a straight line so you feel the burn in your core muscles. Stare straight down rather than up or ahead of you so your neck stays in line with your back. If you have trouble arching your back during the exercise, try positioning your arms slightly wider on the ground to open up your shoulders and activate your core."
    },
    {
      "title": "Aim for 5 reps, but do as many as you can before feeling tired.",
      "content": "Aim for 5 reps, but do as many as you can before feeling tired. Russian pushups can be pretty challenging and tiring, so you may not be able to do as many reps as you would with standard pushups. When you first start doing the exercise, keep track of how many you complete until you physically can’t finish a rep. Try to do at least 5 repetitions, but don’t feel discouraged if you don’t reach it right away. [10] X Research source As you get more comfortable doing the exercise, try adding 5 reps to your routine to keep building muscle."
    },
    {
      "title": "Focus more on your form rather than quantity.",
      "content": "Focus more on your form rather than quantity. Russian pushups have a lot of dynamic movements, so they can cause some muscle strain if you do them incorrectly. Take the exercise slowly at first and focus on mastering the basic form. Once you can easily complete a rep with controlled movements, try increasing how many you do during your workout. [11] X Research source"
    },
    {
      "title": "The pushup portion works your arms, chest, and shoulders.",
      "content": "The pushup portion works your arms, chest, and shoulders. As you raise and lower your body, you’ll really feel the burn in your shoulders, pecs, biceps, and triceps. Since you’re lifting your bodyweight each time, you’ll be able to build a lot of muscle without using any special equipment. [12] X Research source"
    },
    {
      "title": "Planks during Russian pushups activate your core.",
      "content": "Planks during Russian pushups activate your core. As soon as you push your weight onto your forearms, your core takes over and supports your bodyweight. [13] X Expert Source Kyle Kenny Master Trainer & Certified Personal Trainer Expert Interview. 2 November 2021. Even just transitioning into planks and holding it for a few seconds gets tiring and builds your abs. [14] X Research source"
    }
  ]
}