{
  "url": "https://www.wikihow.com/Overcome-a-Superiority-Complex",
  "title": "How to Overcome a Superiority Complex",
  "steps": [
    {
      "title": "Understand the definition of a superiority complex.",
      "content": "Understand the definition of a superiority complex. This is a condition where individuals project an exaggerated feeling of being better than others. [1] X Research source In contrast to the inferiority complex, those with a superiority complex have an exaggerated opinion of themselves, to the point of being haughty and lording their importance over others. There are also published definitions of superiority complex stating the condition is an attitude concealing one's deep rooted feelings of inferiority and failure. [2] X Research source When comparing the two definitions, it becomes clear how much self confidence has to do with both conditions."
    },
    {
      "title": "Consider the traits associated with a superiority complex.",
      "content": "Consider the traits associated with a superiority complex. Those with a superiority complex put on an air of exuberance and arrogance, ordering people around with a tone of dominance. Profound vanity in their appearance, incessant bragging and snobbery are all signs of this complex. They do not take other's feelings or opinions into consideration, unaware of the negative impact this has on themselves or those around them. [3] X Research source It has been suggested that the superiority complex evolved as a result of humanity's effort to resolve feelings of inferiority. Feeling superior to others is a coping mechanism for some, who are actually feeling depressed or inferior to others. [4] X Research source"
    },
    {
      "title": "Observe the signs.",
      "content": "Observe the signs. There does not seem to be a particular age when a superiority complex develops; however, there does seem to be a lot more literature on the internet about childhood and teenage afflictions. Not everyone that exhibits outlandish and domineering behavior will be suffering from a superiority complex. There are signs, however, that you can be aware of: Arrogance: A person will display signs of haughty superiority, feeling that they rate above those they deem beneath them. Being a braggart: The superior person enjoys telling outlandish tales that put them in the spot light. They also are very proud of material possessions and will happily brag to anyone who will listen. Interrupting: The superior person will have an opinion about every topic, whether they are knowledgeable on the subject or not. As they feel they have such important offerings, they feel interrupting is their right. Thinking they are always right/you are always wrong: It does not matter the situation, the argument, or the logic, they are always right. Anyone that does not agree with them, or heaven forbid, vocally disagrees with them, is an idiot. Lacking empathy: People with this complex do not have the ability to feel empathy; they tend to be cold hearted. They do not possess the ability to feel the pain of another. Mood swings: Feeling that they are all knowing and great at all they do, the superior person is subject to overthinking and problems resolving issues internally. This facade leads to poor judgement, and emotional outbursts. Fearful and insecure: Most people with a positive self-image and self-esteem carry themselves positively, without fear or insecurity. People with a superiority complex usually have a subconscious belief that they are actually not good enough and not superior. Anxiety issues: With the image they project, and the truth of who they are, a person with a superiority complex suffers great anxiety keeping everything straight in their minds. Dealing with dual personalities make this condition even more difficult to manage."
    },
    {
      "title": "Consider whether an inferiority complex is involved as well.",
      "content": "Consider whether an inferiority complex is involved as well. A deeply rooted inferiority complex could explain the outlandish behavior of superiority complex, in some cases: [5] X Research source A person with an inferiority complex feels inadequate in comparison to their peers. A person with a superiority complex feels they are above or out-rank their peers. A person with an inferiority complex is constantly self-doubting. A person with superiority complex is overly confident. A person with an inferiority complex can hide his/her insecurities by using the mask of a superiority complex. Ultimately this means they likely have deep-rooted feelings of depression and sadness."
    },
    {
      "title": "Overcome the superior tendencies.",
      "content": "Overcome the superior tendencies. Change is never easy. When a person has a high opinion of themselves, this can be detrimental to relationships. This attitude can turn people off and actually cause the loss of friendships. Ironically, a person with a superiority complex will never admit that they are the reason why friendships disappear. Below, some tips to help control the feelings of superiority: [6] X Research source Do not take appreciation so seriously: It is wonderful and everyone enjoys feeling appreciated. What is most important is how one feels about themselves . Though it feels great to receive a compliment, it is integral to not let it inflate one's opinion of themselves. Acknowledge the remark with simple thank you , and carry on with the general conversation. Resist being the know-it-all: The superior person may find themselves in familiar situations, where they know the best way to complete a task. They must resist taking charge. Let others voice their opinions. Work collectively as a group, giving others the opportunity to learn. Practice gratitude: Practicing gratitude is one of the best ways to alleviate a negative mindset. Being appreciative of the simple joys around you, the people in your life who love you, and the things you love to do can take your mind away from negative actions such as judging and comparing, can lift your mood, improve your self-esteem, and shift your mindset. Stop being judgmental: A person with a superiority complex must realize that their opinion is just that; it is their opinion . Not everyone may agree, which is their right. Every person is entitled to their own opinion . To facilitate change, reign in the tendency to be the know-it-all . Be open to listening and accepting of the opinion of others and never take part in gossip ! Understand that everyone has strengths and weaknesses: Those having a superiority complex may have one of a kind qualities and be exceptional in certain areas of life. They may be very intelligent academically, and, rightfully so, be proud of their accomplishments. Remember, however, that there are smarter people, more exceptional people in the world. It is very important to possess humility . Acknowledge others and their accomplishments. Learning to show support of others is important in order for them to be accepted by their peers."
    },
    {
      "title": "Realize what is important.",
      "content": "Realize what is important. While feeling powerful and prosperous may be feelings they enjoy, these feelings are only superficial and may even be temporary. In order to control a person's feeling of superiority, and to be truly happy and successful, one needs to have a good friend(s), that can be there through good times and bad."
    },
    {
      "title": "Ask for help when needed.",
      "content": "Ask for help when needed. Typically, one suffering a superiority complex does not need psychiatric help, unless the complex completely takes over their personality. The complex can be passed down through heritage; however, it can also be the result of interactions at, for example, school, place of employment, social functions. This is why it is so important for one suffering from this complex, to maintain friendships, especially close friendships, with those they trust. When trying to battle superiority complex, it helps to have someone that can help them stay focused on their goal."
    }
  ]
}