{
  "url": "https://www.wikihow.com/Clean-Lampshades",
  "title": "The Best Ways to Clean Any Type of Lampshade",
  "steps": [
    {
      "title": "Dust your lampshade with a microfiber cloth or lint roller.",
      "content": "Dust your lampshade with a microfiber cloth or lint roller . Take your lampshade off of your lamp so it’s easier to clean. Start wiping from the top of the lampshade and work toward the bottom so dust falls off of the fabric. Alternatively, run a lint roller over the surface to catch the loose dust. [1] X Research source Work slowly if your lampshade is made of thin, delicate fabric because it could stick to a lint roller and tear the material. Try using a soft-bristled paintbrush to get rid of dust stuck between pleated fabric lampshades."
    },
    {
      "title": "Vacuum very dusty lampshades with a soft brush attachment.",
      "content": "Vacuum very dusty lampshades with a soft brush attachment. Put the attachment onto your vacuum and gently clean the shade. Work from the top of the lampshade to the bottom so you don’t re-spread any dust or dirt. [2] X Research source Vacuums work great for pleated fabric lampshades where dust and dirt can build up between the folds. If you’re working with loose or delicate fabrics, avoid using a vacuum because you could damage your lampshade."
    },
    {
      "title": "Wipe your lampshade with a damp soapy cloth.",
      "content": "Wipe your lampshade with a damp soapy cloth. Wet a microfiber cloth with water and wring it out. Add a drop or two of gentle detergent or dish soap, and gently wipe the sides of the shades. After that, wet a clean cloth with plain water and wipe off the soap residue. [3] X Research source Make sure to wipe the entire lampshade with water so you don’t leave behind any water spots or discoloration. [4] X Research source If you’re cleaning a vintage or silk lampshade, avoid getting it wet because you could leave streaks behind. If there are spots or stains, take the lampshade to a professional dry cleaner instead. [5] X Research source"
    },
    {
      "title": "Remove stains or spots with a soft-bristled toothbrush.",
      "content": "Remove stains or spots with a soft-bristled toothbrush . Wet a toothbrush into warm soapy water and dab it onto the stained section of your lampshade. Gently scrub the stain with the toothbrush, working from the edges toward the center. Wipe off any soapy residue with a clean, damp cloth. [6] X Research source"
    },
    {
      "title": "Remove grime with a vinegar solution.",
      "content": "Remove grime with a vinegar solution. Fill a spray bottle with a solution that’s half water and half distilled white vinegar. Mist the spray onto your lampshade and gently wipe or blot at the marks to lift them. [7] X Research source Test the solution in an inconspicuous spot first to make sure it doesn’t cause any discoloration or ruin the fabric."
    },
    {
      "title": "Soak lampshades in soapy water to remove the toughest stains.",
      "content": "Soak lampshades in soapy water to remove the toughest stains. Fill your bathtub or a large container with enough water to fully submerge your lampshade. Add a few drops of gentle detergent or dish soap and place your lampshade in the water. Let it sit for about 15 minutes before gently wiping it with a microfiber cloth. [8] X Research source When you’re finished, rinse the shade in clean lukewarm water. Shake off excess water and pat the lampshade dry with a towel. Then, leave it in a well-ventilated area with a fan to air-dry completely. Only soak your lampshade if the pieces are stitched together. Soaking lampshades that are held together by glue can damage them."
    },
    {
      "title": "Wear gloves whenever you clean paper lampshades.",
      "content": "Wear gloves whenever you clean paper lampshades. Oil from your skin could get onto the paper and leave discoloration behind. Put on a clean pair of gloves so you don’t accidentally stain your lampshade. [9] X Research source"
    },
    {
      "title": "Wipe the lampshade off with a dry microfiber cloth.",
      "content": "Wipe the lampshade off with a dry microfiber cloth. Take your lampshade off of your lamp so it’s easier to clean. Wipe from the top of the lampshade toward the bottom to brush off the loose dust. Be sure to wipe the inside of the shade as well. [10] X Research source Alternatively, run a lint roller over the lamp shade to pick up stray dust and debris on the surface. Just be careful that the adhesive doesn’t rip the paper."
    },
    {
      "title": "Rub stains away with an art gum eraser.",
      "content": "Rub stains away with an art gum eraser . Gently rub the marks on your lampshade with the eraser to lift them up from the surface. If one part of the eraser gets dirty, then switch to a clean part so you don’t spread any residue. [11] X Research source Some people have had similar results using a piece of white bread without the crust. Just gently rub the bread against the stains to lift them. [12] X Research source Alternatively, try using a magic eraser sponge to gently scrub the stains. Avoid using water or any wet cleaners on a paper lampshade because it could eat through the material and leave noticeable damage."
    },
    {
      "title": "Dust the surface with a microfiber cloth.",
      "content": "Dust the surface with a microfiber cloth. Turn off your lamp and take off the lampshade once it’s cool. Wipe the lampshade from the top to the bottom to remove the loose dust that’s built up. [13] X Research source Microfiber cloths prevent you from accidentally scratching your lampshade. [14] X Research source"
    },
    {
      "title": "Remove greasy spots from your lampshade with a vinegar solution.",
      "content": "Remove greasy spots from your lampshade with a vinegar solution. Make a solution that’s equal parts distilled white vinegar and warm water. Gently wipe the solution onto the surface with a damp cloth until the grease is completely removed. [15] X Research source"
    },
    {
      "title": "Wash the lampshade with soapy water and a soft-bristled brush.",
      "content": "Wash the lampshade with soapy water and a soft-bristled brush . Place your glass or plastic lampshade in the tub or a large container. Mix a few drops of gentle detergent or dish soap into a bowl of warm water and wet a cleaning brush. Gently scrub the surface of your lampshade with the brush to remove any buildup. [16] X Research source Rinse off the soapy water with a clean, damp cloth. Dry your lampshade with a towel right away so you don’t leave any streaks on the surface. For glass lampshades, try wiping marks off with a dedicated glass cleaner ."
    },
    {
      "title": "Dust your lampshades once a week to keep them clean.",
      "content": "Dust your lampshades once a week to keep them clean. Make dusting your lampshades part of your regular cleaning routine so dirt and debris don’t build up on the surface. Be sure to dust the inside and outside of the lampshade, as well as the lamp’s base. [17] X Research source"
    },
    {
      "title": "Deep-clean your lampshades about 4 times a year.",
      "content": "Deep-clean your lampshades about 4 times a year. Every few months, use a vacuum or duster to clean off any dust or debris that’s built up on your lampshade. At least once a year, wipe down the surface with a solution made from 1 gallon (3.8 L) of water and 1 ⁄ 4 cup (59 ml) of rubbing alcohol. [18] X Research source"
    },
    {
      "title": "Get a new lampshade if yours is discolored or damaged.",
      "content": "Get a new lampshade if yours is discolored or damaged. While lampshades will last for a long time when you take care of them, they can start to discolor or look worn out after a while. If you notice any damage, yellowing glue, or stains that won’t go away, get a new shade instead. Measure a lampshade before purchasing it to ensure that it will fit your lamp properly. Choose a shade that’s about a third of the lamp’s total height and 2 times wider than the lamp’s base. [19] X Research source Alternatively, try recovering your lampshade with new fabric to refresh its look."
    }
  ]
}