{
  "url": "https://www.wikihow.com/Be-Big-and-Still-Get-a-Girl",
  "title": "How to Be Big and Still Get a Girl: What You Need to Know",
  "steps": [
    {
      "title": "Find your self-confidence.",
      "content": "Find your self-confidence . Most people are attracted to someone who has healthy self-esteem. If you believe you're the shiz, you'll act like you're the shiz and girls will believe you're the shiz and want to find out why you're the shiz. [1] X Research source Don't try to become confident by getting the attention of girls. Not only will this never truly give you faith in yourself as a person, you're setting yourself up for a fall. Even the most handsome guy will go through dry patches but, if their confidence is founded on something stronger than their attractiveness, the rest of their life won't suffer and they'll come out the other side fighting."
    },
    {
      "title": "Believe that you are physically attractive.",
      "content": "Believe that you are physically attractive. Yes, you don't have a six pack but you might have great skin, hair, eyes or height. Never underestimate the power of such details. [2] X Research source Remember that you may not think of yourself as the most handsome man to walk the earth but there will always be several guys who would give their right arm to look like you. They are not always the people you would expect either. You're pretty unlikely to be the heaviest man around. Guess what? There have been guys and girls much bigger than you that have found flings and true love."
    },
    {
      "title": "Manage your expectations.",
      "content": "Manage your expectations. You have to cut potential girls a little leeway. Go for someone you find attractive, definitely, but accept that they might not always be a 10 . Look past the physical and into the character and soul of the girl you're trying to get. Not only will your insistence on finding someone beautiful inside and out make you more attractive to girls, it will make sure that you find someone truly special and worthy of you. This goes for every guy and girl you'll ever meet and everyone realises it, sooner or later. It has nothing to do with your size or level of attractiveness."
    },
    {
      "title": "Dress to impress",
      "content": "Dress to impress . Wear clothes that highlight your best features and that make you feel attractive and suave. [3] X Research source"
    },
    {
      "title": "Show off your personality.",
      "content": "Show off your personality. Whatever the size of your clothes, the key to having someone fall head over heels in love with you is a great personality. Be funny. Humor is a huge part of love and a trait many girls find very attractive. Self-deprecating humor is great but make sure not to go overboard and risk losing her respect. If all she ever hears about you is how clumsy/foolish/unintelligent/greedy/awkward you are, she'll believe it. Be kind and sensitive towards others. Swoon!"
    },
    {
      "title": "Have healthy looking skin, face and body.",
      "content": "Have healthy looking skin, face and body. All healthy skin tones are fine. If you're very pale, you might like to get a little bit of a tan. If your skin tone is a bit uneven, you might try a new skin care regimen to improve it. Removing palid, blotchy or rough skin it will fatty pounds off you and highlight your muscles - the very reason so many partygoers and bodybuilders maintain a tan/healthy skin."
    },
    {
      "title": "Manage your weight.",
      "content": "Manage your weight. If you're reading this article, you clearly feel that your size is holding you back. Your doctor may advise you to change your diet and/or take some light exercise. However, only attempt to lose weight under the guidance of a healthcare professional. Feeling in control of your weight will give you a big confidence boost. Girls will be attracted to someone who has the \"guts\" to tackle such an obstacle. It develops and shows a strength of character that will stand you in good stead in many parts of life, not least the romantic side of it."
    },
    {
      "title": "Maintain good oral hygiene and breath.",
      "content": "Maintain good oral hygiene and breath. Keep some mints with you. [4] X Research source"
    },
    {
      "title": "Try not to get on top of anyone, it creeps people out.",
      "content": "Try not to get on top of anyone, it creeps people out."
    },
    {
      "title": "Make sure your girl knows you care about her.",
      "content": "Make sure your girl knows you care about her. [5] X Research source"
    },
    {
      "title": "Kiss with sensitivity.",
      "content": "Kiss with sensitivity. If and when you kiss, don't smush your face into hers. It's gross."
    }
  ]
}