{
  "url": "https://www.wikihow.com/Find-Out-Fake-Photo-in-Facebook",
  "title": "How to Find Out Fake Photo in Facebook",
  "steps": [
    {
      "title": "Sign into your Facebook account.",
      "content": "Sign into your Facebook account. Having an account yourself makes it much easier to investigate and find more information about other accounts."
    },
    {
      "title": "Think about why you might be suspicious of another account.",
      "content": "Think about why you might be suspicious of another account. For example, if you get a friend request from someone whom you don't know, think about - or even ask - why that person might want to be friends with you. Thinking about this and investigating an account can help clarify your suspicions and ease the process of figuring out whether a photo is fake."
    },
    {
      "title": "Save the url of the photo which you want to check.",
      "content": "Save the url of the photo which you want to check. Sometimes, you'll need to be friends with the person who posted the photo in order to be able to see it and retrieve the url. To get the url, right click on the photo and select \"Copy Image URL.\""
    },
    {
      "title": "Open the url in a new tab.",
      "content": "Open the url in a new tab. The picture you want to check should be displayed on the screen."
    },
    {
      "title": "In a new tab, navigate to Google Images.",
      "content": "In a new tab, navigate to Google Images . On the right hand side of the search bar, you will see a camera icon. Click this to search by image, rather than by text."
    },
    {
      "title": "Enter the image you want to check.",
      "content": "Enter the image you want to check. You can simply enter the url that you copied earlier. Or, if you've saved the image to your computer, you can upload it using the \"Upload an Image\" option. Once you've entered the image, click Search to perform the search."
    },
    {
      "title": "Look through the search results.",
      "content": "Look through the search results. Look for the same image posted on a website, especially if it's clearly a picture of someone else, like a celebrity. With common images and images of popular people, this search is likely to return quite a few results which will prove useful to you."
    },
    {
      "title": "Report the image on Facebook.",
      "content": "Report the image on Facebook. If you've determined that the image is spam or abusive content, report it on Facebook using the drop down menu at the top right of the toolbar, available when you log in."
    }
  ]
}