{
  "url": "https://www.wikihow.com/Do-a-Seated-Cable-Row",
  "title": "How to Do Seated Cable Row Exercises: Tips & Techniques",
  "steps": [
    {
      "title": "Start with an amount of weight you can fully pull.",
      "content": "Start with an amount of weight you can fully pull. A seated cable row is a pulling exercise that targets your \"lats.\" To perform a seated cable row, use a weighted horizontal cable machine with a bench. If you're just starting out, put the weight on the lowest setting. If you’re more experienced with upper body exercises and are sure you’re ready for more weight, move the pulley to a higher weight. [1] X Research source It’s perfectly okay to start at a low weight because you’ll actually avoid injuring yourself. As you develop more upper body strength, you can work up to more weight. Remember to be especially careful if you've had a shoulder or lower back injury in the past—consult a doctor to see how much weight is best for you."
    },
    {
      "title": "Sit down in front of the cable machine.",
      "content": "Sit down in front of the cable machine. When you lower yourself down on the cable machine and sit on its bench, make sure that you're facing the cable machine's weight stack and cabled handle. [2] X Research source Some horizontal cable machines come without a bench, so you'll sit on the floor with a straight back and slightly bent knees instead. If you use one of these machines, you'll achieve the maximum muscle stimulation for your back and lats. [3] X Research source"
    },
    {
      "title": "Bend your knees and place your feet on the pads.",
      "content": "Bend your knees and place your feet on the pads. To brace your feet while pulling the cable, position them flat on the pads in front of you. If your machine just has a base instead of pads, brace both your heels on it. [4] X Research source Bend your knees slightly so you can keep your center of gravity and balance, both of which will help you focus on your posture and your upper body movements. If the machine you’re using doesn’t have pads or a base where you can brace your feet, just improvise with a step platform . Prop your feet on the side of the step platform to brace your feet while you perform a seated cable row."
    },
    {
      "title": "Grab the cable machine’s handle and then straighten out your back.",
      "content": "Grab the cable machine’s handle and then straighten out your back. Lean over to grab the handle, then sit up tall and straighten out your posture. Since the handle is typically a V-grip bar double grip handle , hold onto both bar grips. [5] X Research source A V-grip bar is popular for beginners because you can hold it with both hands and don't need to stretch your arms out. It targets your inner back, including your rhomboids and traps. If you use a long straight bar , which requires you to use a wide grip and targets your lats, grab it with either an overhand or underhand grip. If you’d like an adjustment that’s easier on your shoulders, use an underhand grip. In order to sit up completely straight, make sure to extend your arms."
    },
    {
      "title": "Push your shoulders together once your back is straight.",
      "content": "Push your shoulders together once your back is straight. Thrust your chest out and draw your shoulder blades together—begin to activate these muscles since you’ll use them to work out your upper and middle back. [6] X Research source Even though you're keeping your back straight and your torso in one place, you can flex your hips a little if that helps you do a seated cable row. Keep your core muscles engaged so that your upper body stays steady once you try your seated cable rows."
    },
    {
      "title": "Pull the cable back toward your torso.",
      "content": "Pull the cable back toward your torso. As you row by tugging the handle of the cable machine, keep your elbows at your sides and push them back. Bring the cable attachment as far back as you can, stopping at your torso if possible. [7] X Research source Exhale as you pull the cable toward you."
    },
    {
      "title": "Squeeze your shoulders and pause.",
      "content": "Squeeze your shoulders and pause. Hold the position for a few seconds. Once you pull all the way back, stay in that position for 3-5 seconds. As you hold yourself in place, make sure you squeeze your shoulders together. [8] X Research source"
    },
    {
      "title": "Stretch your arms out to return the weight to the machine's weight stack.",
      "content": "Stretch your arms out to return the weight to the machine's weight stack. Extend your arms slowly to return to your starting position. Gradually work against the tension instead of quickly forcing your arms forward—that way, you’ll get the most out of your seated cable row, from the start to the finish of your workout. [9] X Research source Inhale as you release the cable back to the starting position. When you work against the tension, you should be able to softly place the weights back down. If you hear the weights clank down on the cable machine, it’s likely that you moved back too quickly."
    },
    {
      "title": "Complete enough reps of seated cable rows to feel \"the burn.\"",
      "content": "Complete enough reps of seated cable rows to feel \"the burn.\" Focus on doing the exercise correctly by performing just enough reps to feel some tension and fatigue in your muscles. As a beginner, start with 8-12 reps and then rest for 30 seconds. Try 2-3 sets of your reps. Later, you can work up to more reps and sets to build muscle in your upper body and to increase your endurance. [10] X Research source"
    },
    {
      "title": "Avoid common mistakes to achieve the best form for a seated cable row.",
      "content": "Avoid common mistakes to achieve the best form for a seated cable row. Before you try either a traditional seated cable row or a modified version of the exercise, watch out for these body movements that can reduce the effectiveness of your workout: Placing your elbows outward will engage your biceps instead of your back. Shrugging your shoulders will put too much pressure on your traps. Swinging your shoulders will prevent you from activating your back muscles. Using rapid movements will keep you from fully completing your row. Locking your knees will put a lot of stress on your joints."
    },
    {
      "title": "Perform the exercise with 1 arm so both your sides get in a workout.",
      "content": "Perform the exercise with 1 arm so both your sides get in a workout. As you pull back on the bar with 1 hand, place your other hand on your hip. When you sit up straight and hold yourself in place, you’ll work your lower and middle back, upper back, and the backs of your shoulders, also known as your lats, traps, and rear delts. [11] X Research source When you focus on 1-arm cable rows, you’ll train both the dominant and the non-dominant side of your body—this is especially helpful if you notice that you have any physical imbalance. Use a V-grip bar for 1-arm cable rows so you can easily grab the grip with one hand."
    },
    {
      "title": "Try a seated face pull to focus on working out your upper back.",
      "content": "Try a seated face pull to focus on working out your upper back. Change out the bar for a 2-rope handle . Sit up straight with your knees slightly bent and fully stretch out your arms to grab one rope in each hand. Exhale and bend your elbows to pull the rope toward your neck. Hold your position for 2 seconds. To finish your seated face pull, inhale and slowly extend your arms to return the weight back to the machine's weight stack. [12] X Research source When you bend your elbows, make sure your upper arms are parallel to the floor."
    },
    {
      "title": "Opt for a V-grip attachment to work your inner back muscles.",
      "content": "Opt for a V-grip attachment to work your inner back muscles. To work out your rhomboids and traps, clip a V-grip attachment onto the cable of your cable machine. To use the V-grip attachment, grip onto either side with each of your hands and perform a traditional seated cable row by sitting up straight and pulling the cable back as you squeeze your shoulders. [13] X Research source The V-grip attachment is extremely popular and is usually the go-to option for most cable machines in local or home gyms."
    },
    {
      "title": "Grab a lat bar to work your outer back and shoulders.",
      "content": "Grab a lat bar to work your outer back and shoulders. Grasp a lat bar at the ends for the best workout for your shoulders as well as your middle and lower back. Make sure your feet are firmly planted on the foot rest of your cable machine. Hold onto the bar so your fists are slightly more than shoulder-width apart. Exhale and pull back while keeping your elbows tucked in. Squeeze your shoulders and pull until your elbows are behind your back. [14] X Research source Inhale and slowly stretch your arms out in front of you to return to your starting position and return the weight to the weight stack. A lat bar is used for both seated cable rows and pulldowns—it looks like a wide bar and has ends that curve downward."
    },
    {
      "title": "Use an EZ bar to give your arms a workout while you row.",
      "content": "Use an EZ bar to give your arms a workout while you row. Grab both ends of the EZ bar with an underhand grip. Check that your fists are slightly more than shoulder-width apart. Sit up straight, tighten your abs and glutes, and pull the EZ bar toward your abs. As you row, pull your elbows as close to your sides as possible. Row until the bar touches your abs and pause for 1-2 seconds. [15] X Research source To complete the workout, inhale and reverse your movement by slowly extending your arms in front of you. Finish by returning the weight to the weight stack. When you attach an EZ bar to your cable machine to perform a seated cable row, you’ll mainly work out your shoulders and lats—however, you’ll also give your biceps extra exercise."
    },
    {
      "title": "Use a light weight and low reps to make a seated cable row easier.",
      "content": "Use a light weight and low reps to make a seated cable row easier. If you're straining yourself to pull a certain amount of weight, then it's probably too heavy. In order to focus on proper seated row form, stick to a lighter weight. As you start off, do fewer reps so you can avoid fatigue and perfect your technique. [16] X Research source"
    },
    {
      "title": "A seated cable row is a great workout for your back and core.",
      "content": "A seated cable row is a great workout for your back and core. This pulling exercise will not only target many muscle groups in your back, but it will also help you sit up straight, keep your core strong, and partially activate your biceps and triceps. If you train with a seated cable row, you can: [17] X Research source Build muscle density in your back Enhance your pulling strength Fatigue your muscles to promote \"hypertrophy,\" the growth of muscle cells Develop your lower back to reduce any stress put on it Improve your posture"
    }
  ]
}