{
  "url": "https://www.wikihow.com/Paint-Plastic-Models",
  "title": "How to Paint Plastic Models",
  "steps": [
    {
      "title": "Opt for acrylic modelling paint to make the painting process easier.",
      "content": "Opt for acrylic modelling paint to make the painting process easier. Acrylic modelling paint is the standard paint of choice for most model enthusiasts. It’s easy to work with and can easily be thinned by mixing it with water. However, acrylic paint is not as durable as spray paint or enamel. Use acrylic paint unless you have a special need for durability. It’s easy to touch up acrylic paint if it ever fades or smears. You can use water to clean up acrylic paint if you ever spill it. If it dries before you have time to clean it up, use dish soap and water to scrub it off. Purchase acrylic modelling paint at a standard arts and crafts store."
    },
    {
      "title": "Use enamel modelling paint if you really need a durable finish.",
      "content": "Use enamel modelling paint if you really need a durable finish. Enamel modelling paint is a thicker, stronger option that will leave a stronger coat behind when it is applied. Enamel paints require a few drops of enamel thinner to soften the texture, and you can’t clean it without the use of an acidic solvent, like paint thinner. Choose enamel paints if you want to achieve a permanent finish that won’t easily wear away. The amount of thinner that you need to soften the texture depends entirely on the type of finish that you’re trying to achieve. Using a small amount of thinner will result in a thicker coat, while creating a mixture of 1-part enamel and 1-part thinner will create a nearly-translucent color."
    },
    {
      "title": "Stick with synthetic brushes to avoid fraying your bristles.",
      "content": "Stick with synthetic brushes to avoid fraying your bristles. Cheap natural or plastic brushes tend to fray when they’re used over a long period of time. On the other hand, high-quality synthetic brushes tend to hold their shape quite well. Smaller synthetic brushes are also less likely to split when you’re making smaller brush strokes, which is a common requirement for painting plastic models. Get a set of synthetic brushes in a variety of sizes to make the painting process easier. Synthetic sable or fox hair brushes are excellent choices for painting plastic models. You can use high-end natural hair brushes if you prefer, but these brushes tend to be extremely expensive. You also won’t notice much of a benefit unless you’re a veteran model painter."
    },
    {
      "title": "Skip primer unless you’re painting a model made of multiple materials.",
      "content": "Skip primer unless you’re painting a model made of multiple materials. Primer helps paint adhere to a model, but it can fill in intricate engravings and make your model thicker. In addition, you won’t need the extra protection if you aren’t handling your models regularly. Skip the primer unless you plan on touching your model regularly, or your model is made out of a combination of plastic, wood, or metal. If your model is made out of a variety of materials, primer will help produce a uniform color. Use a white, spray primer if you need to prime a surface. Hold the can 10–12 in (25–30 cm) away from the model and spray in quick, even strokes until you’ve covered the entire model. Wait 24 hours for the primer to settle."
    },
    {
      "title": "Mix your paint thoroughly before pouring it on to a palette.",
      "content": "Mix your paint thoroughly before pouring it on to a palette. Enamel and acrylic modeling paints tend to separate when they’re sitting in their bottle for a long period of time. Before you paint, always use a mixing stick or spare brush to mix the paint in the container. Mix it for 20-30 seconds before pouring it on to your palette or easel. For smaller miniatures, use a dropper to add small amounts of paint. Mixing the paint ensures that your colors come out evenly. If you don’t mix a red paint for example, some of the red may be darker or lighter than the color is supposed to be."
    },
    {
      "title": "Clean your models with water and soap before painting them.",
      "content": "Clean your models with water and soap before painting them. Before you paint your model, clean it to ensure that dust particles or contaminants don’t get sealed into your paint job. Fill a bowl with warm water and add 1–2 teaspoons (4.9–9.9 mL) of dish soap. Mix the water and soap together before submerging your model. Brush it by hand using a clean toothbrush for 1-2 minutes. Then, rinse your model under water and dry it with a clean cloth. Many plastic models are coated in a resin or chemical agents to help the model keep its shape while it was manufactured. These resins and agents are no longer necessary, and brushing them off gives your model a better finish in the end. You can submerge your model in isopropyl alcohol before rinsing and cleaning it if you prefer."
    },
    {
      "title": "Paint your base coats using as few strokes as possible.",
      "content": "Paint your base coats using as few strokes as possible. To start painting a smaller or intricate model, grab the color that you’re going to use for the base of your model. Load your brush with your base color and wipe it back and forth on your easel or palette to remove the excess paint. Apply your base coat over the areas that you want to paint using as few strokes as possible. Hold your brush at a slight angle and make each brush stroke as large as you can without brushing a part of the model that you aren’t trying to cover. For larger surfaces, use a flat brush. The tip of the brush must be smaller than the surface that you’re painting. For models smaller than 1 foot (30 cm), a 1–2 in (2.5–5.1 cm) brush is appropriate. The size of the brush is largely a matter of personal preference, though. If your base coat is a lighter color, feel free to paint the entire model. The other paints will easily cover the surfaces you’ve painted. If the base coat is a darker color, like a black or blue, try to avoid painting other surfaces of the model. It will take multiple coats to cover a darker base coat. To figure out what your base coat’s color is, determine what color will cover the highest percentage of your model’s surface. This is the color of your base coat. Some models have instructions for which colors you should use, but you can always pick your colors out yourself. There are no right or wrong choices when it comes to picking colors. It’s totally up to you!"
    },
    {
      "title": "Overlap your brush strokes to ensure an even coat of color.",
      "content": "Overlap your brush strokes to ensure an even coat of color. When painting your model, overlap each brush stroke to avoid leaving gaps between them. If you try to place each brush stroke perfectly against one another, you’ll naturally miss small areas in between the paint strokes. Overlap each stroke to ensure that your colors come out evenly. This will also prevent smearing, since you’ll be spreading the paint out before it has an opportunity to start drying. If you have to go in and add paint to spaces that you’ve missed, you’ll have to wait for the coat to dry entirely before you can add more color."
    },
    {
      "title": "Wait 24-72 hours in between coats to let them dry.",
      "content": "Wait 24-72 hours in between coats to let them dry. After you finish your base coat, wait 24-72 hours to give the paint time to settle. Acrylic paint will dry closer to the 24-48 hour range, while enamel usually takes 48-72 hours to dry. The thickness of your coat will also impact the amount of time it takes for your paint to dry. If you’re trying to blend colors, feel free to continue painting while your paint is wet."
    },
    {
      "title": "Work your way down to the smaller layers after painting the base coat.",
      "content": "Work your way down to the smaller layers after painting the base coat. Once you finish your base coat, add your next biggest layer of color. Work from larger layers to smaller layers to avoid having to work around smaller brushstrokes. Use a smaller brush to cover smaller layers, and continue to use as few brush strokes as possible. Overlap each application of color to ensure that the coat comes out evenly. For example, if you’re painting a model police officer, your base layer is probably the blue uniform. The next biggest section of color will be the skin tone, followed by the silver buckle and buttons and the black details on the uniform."
    },
    {
      "title": "Apply details with your thinner brushes by using short strokes.",
      "content": "Apply details with your thinner brushes by using short strokes. Once you’ve added your key layers of paint, start adding your details. Use the thinnest brush that you have to carefully apply small lines, textures, or shadows. Use a short, flicking motion and only load the tip of your brush to avoid adding too much paint. Work slowly and be careful to avoid putting paint where it doesn’t belong. [1] X Research source For some people, it’s easier to keep their hand steady if they brace it on a table or small stack of books. Maintaining a steady hand is the best way to ensure that you don’t miss a stroke. Don’t be too hard on yourself. It can take a lot of practice to develop the skills required to paint small details. The more you practice though, the better you’ll get at it. For smaller miniatures, use a 0, 00, or 000 round brush. These brushes are smaller than 1 ⁄ 32 in (0.079 cm). For larger models, details may be painted with a 1 or 2 brush, which are only slightly larger than 1 ⁄ 32 in (0.079 cm)."
    },
    {
      "title": "Thin your paint before applying textures or translucent colors.",
      "content": "Thin your paint before applying textures or translucent colors. If you want to add dirt, blood, dust, or some other texture, thin your paint before applying it. Acrylic paint is thinned with water, while enamel requires a special modelling solvent. Start with a drop or two of thinner when mixing your paint. Continue to add thinner until you’ve achieved the opacity and look that you desire. Test your mixed paint on a blank sheet of paper to see how it looks. If you don’t like the texture, add paint or thinner to change the opacity as desired. Use droppers to mix small amounts if you’re painting a smaller model. You usually don’t need more than a drop or two to adequately thin out paint for a texture."
    },
    {
      "title": "Use a toothpick to carve grooves or add tiny details.",
      "content": "Use a toothpick to carve grooves or add tiny details. For extremely intricate details, grab a toothpick with a sharp point. Use the toothpick to carefully remove small sections of paint and add details. You can also dip the tip of your toothpick into paint to apply small specks of color where you want them. If you’re trying to add shadows, use a cotton swab instead of a toothpick. This usually produces a shadowy effect without adding too much paint."
    },
    {
      "title": "Clean your brushes as soon as you’re done painting.",
      "content": "Clean your brushes as soon as you’re done painting. When you’ve finished painting, fill a cup with 2–3 in (5.1–7.6 cm) of your cleaning solution. Use water to clean your acrylic brushes and use paint thinner or enamel cleaner for enamel brushes. Wipe your bristles against the side of the cup repeatedly to remove the majority of the paint. Once most of the paint is gone, rinse your enamel or acrylic brushes under a stream of warm water. Never push your bristles directly into the bottom of the cup. This can damage your brushes by fraying the bristles. After you’ve dried your brushes, you can rub petroleum jelly on the bristles to preserve them. If you don’t clean your brushes, you’re going to waste a lot of money replacing them."
    },
    {
      "title": "Use spray paint to create uniform base coats before brush painting.",
      "content": "Use spray paint to create uniform base coats before brush painting. If you have a model that you’re planning on mostly painting a single color, use spray paint to produce a uniform texture for your key base coat. You can brush paint details or additional coats after the paint dries, and spray paint is the easiest way to cover a large surface area with a uniform color. [2] X Research source You can use standard spray paint to paint your plastic models. Just read a can carefully to ensure that it isn’t designed specifically for wood, metal, or surfaces other than plastic. Most models that are larger than 6 inches (15 cm) use a combination of spray paint and brush painting to complete them."
    },
    {
      "title": "Work in a well-ventilated area, preferably outside.",
      "content": "Work in a well-ventilated area, preferably outside. Spray paint can be noxious if you inhale too much of it, so take your model outdoors. If you can’t take it outdoors, open all of the windows in the room, turn a fan on, and grab a dust mask or respirator. [3] X Research source You don’t need a respirator or dust mask if you’re working outside. Spray paint really only works if you need to apply large sections of color or add your base coat. Brush painting is the most common model-painting method, although spray paint is a great way to cover larger models with monochromatic paint jobs. Common examples include model planes, boats, cars, or ships—all of which are typically 1-2 colors. Wear rubber gloves if you want to keep your fingers clean. Spray paint has a tendency to splatter from the nozzle."
    },
    {
      "title": "Set your pieces out on a large sheet of paper or cardboard.",
      "content": "Set your pieces out on a large sheet of paper or cardboard. Lay down a large sheet of paper or cardboard. Place your model on top of the paper or cardboard. If your model isn’t assembled yet, place the pieces in the center with 1–2 in (2.5–5.1 cm) between each piece. This will keep the spray paint from splattering on to your floor, yard, or table. [4] X Research source Paint details after you’ve assembled your item. Feel free to add base coats before painting, though. In fact, painting your base coat before assembly ensures that you don’t leave any gaps in between the pieces."
    },
    {
      "title": "Use painter’s tape to cover any sections that you want to keep clear.",
      "content": "Use painter’s tape to cover any sections that you want to keep clear. This is near-impossible on smaller models, but if your model is larger than 7–8 inches (18–20 cm), you can use painter’s tape to keep larger sections of your model unpainted. Use multiple strips of tape to layer them on top of one another. Smooth each strip down as you apply it to the surface to ensure there are no gaps or air bubbles in the paint. For example, if you’re painting a model car, use painter’s tape to cover both sides of the windshield. This will keep it clear while you’re spray painting the body."
    },
    {
      "title": "Shake your can and test the spray in the air or a scrap piece of paper.",
      "content": "Shake your can and test the spray in the air or a scrap piece of paper. Before you paint, shake your can of spray paint back and forth until you hear the ball inside of the can rattle around. Then, hold your can upside down and press the nozzle for 2-3 seconds to remove any excess air. Turn your can over and spray it into the air or on a scrap piece of paper to ensure that the spray is even. [5] X Research source Dry paint particles can harden inside of the nozzle. This causes the paint to splatter. Testing it first ensures that your coat remains even and beautiful when you apply it."
    },
    {
      "title": "Hold the can 10–12 in (25–30 cm) away from the pieces.",
      "content": "Hold the can 10–12 in (25–30 cm) away from the pieces. Angle your can at a 45-degree angle towards your model or the pieces. Hold the nozzle 10–12 inches (25–30 cm) away from the item. If you’re too close, you’ll cause drips. If you’re too far away, you won’t cover the surface evenly. As you’re applying the paint, adjust your distance from the model based on whether or not you’re happy with the coverage of your spray paint."
    },
    {
      "title": "Spray in quick, smooth patterns across the surface of your model.",
      "content": "Spray in quick, smooth patterns across the surface of your model. Press down on the nozzle and move the can across the surface of the model. Do this quickly to avoid causing drips or adding your color unevenly. Repeat this process by moving the can in the opposite direction and then back again. Using a sequence of quick, short bursts of spray ensures that your coat comes out evenly. [6] X Research source Work your way around the model to paint it from every side. You can use multiple colors to produce textured effects, like camouflage, dust, or dirty paint. Continue spraying until the model’s color matches the hue and texture that you’re going for."
    },
    {
      "title": "Wait at least 1 hour before you apply additional coats.",
      "content": "Wait at least 1 hour before you apply additional coats. Read the label on your can of spray paint to see how long it will take to dry. Typically, spray paint settles in 30 minutes and completely dries in 1 hour. Wait the full hour before applying any additional coats of paint or turning the model over to paint the other side. Paint the other side of your model using the same number of sprays to maintain uniformity in the coat and the color."
    },
    {
      "title": "Wait 24 hours before brush painting or handling your model.",
      "content": "Wait 24 hours before brush painting or handling your model. Even though spray paint settles in 1 hour, it is prone to absorbing fingerprints if you handle it immediately after the hour is up. To be on the safe side, wait 24 hours before brush painting or moving your model."
    },
    {
      "title": "Use an airbrush to spray smaller areas of your model.",
      "content": "Use an airbrush to spray smaller areas of your model. You can use an airbrush instead of spray paint if you want to recreate the look of spray paint on a smaller scale. To use an airbrush, get an airbrush kit and thin your paint with enamel thinner or water until it’s soupy and thin. Pour 10-15 drops into the cup at the top of the gun and hold the nozzle 4–8 inches (10–20 cm) away from the surface. Pull the trigger to release your paint. Wear a respirator when using an airbrush. [7] X Research source Use water to thin out acrylic paints and enamel thinner to dilute enamel paint. You can adjust the pressure settings on an airbrush. For most models, you’ll need a lot of control, so use a lower psi. A setting of 2-6 psi is usually appropriate."
    }
  ]
}