{
  "url": "https://www.wikihow.com/Daughters-Who-Blame-Their-Mothers-for-Everything",
  "title": "Why Does Your Daughter Always Blame You? Plus, What to Do",
  "steps": [
    {
      "title": "She has low self-esteem.",
      "content": "She has low self-esteem. Your daughter may be projecting her negative feelings about herself onto you. Lots of teen girls struggle with poor mental health due to low self-esteem, but many adult women do as well. This may compel her to put the blame on you for her perceived shortcomings, even if you absolutely aren't responsible for them. Peer pressure, academic expectations, and her changing body could all contribute to major self-esteem issues, which can lead to pretty severe depression. [1] X Research source It may help to look for other signs that she’s suffering from poor mental health, such as irritability, fatigue, difficulty sleeping, loss of interest in hobbies or friends, and changes in appetite or weight, including a possible eating disorder. [2] X Trustworthy Source National Institute of Mental Health Informational website from U.S. government focused on the understanding and treatment of mental illness. Go to source"
    },
    {
      "title": "She's dealing with trauma.",
      "content": "She's dealing with trauma. If your daughter has experienced some sort of traumatic event (like an abusive relationship), shock, shame, or fear may keep her from opening up about what happened, even to the people she trusts most. These pent-up emotions may come out in the form of aggression toward you, even though you're not responsible for what happened to her. If your daughter’s blaming only recently began, consider if it’s possible she may have experienced a traumatic experience and isn’t sure how to talk about it. Examples of trauma might include sexual, emotional, or physical abuse, neglect, the effects of poverty, bullying, natural disasters or accidents, and the like. [3] X Trustworthy Source Child Welfare Information Gateway Online portal managed by the U.S. Children's Bureau providing resources related to childcare and abuse prevention Go to source If you’re aware of your daughter’s trauma, she may still blame you. It's completely understandable if you feel responsible, as most parents feel responsible for their kids’ well-being, but it's important to practice self-compassion and remind yourself that you can't always be in control."
    },
    {
      "title": "She feels like she's being invalidated.",
      "content": "She feels like she's being invalidated. If your daughter feels as if she isn’t being heard or taken seriously, it’s very possible she’ll escalate her behavior or blame you for things. Take a closer look at your interactions and see if you ever brush off her problems as “not a big deal” or feel a little on-edge when she tries to talk to you about something you may have done to hurt her. [4] X Research source Invalidating your daughter’s feelings can also potentially lead to feelings of resentment. [5] X Research source Reader Poll: We asked 2374 wikiHow readers, and 64% of them agreed that a common sign that your child is growing resentful is by avoiding spending time with you . [Take Poll]"
    },
    {
      "title": "You’re both victims of gender role stereotypes.",
      "content": "You’re both victims of gender role stereotypes. Women and girls, mothers and daughters—all are socialized to be unflaggingly kind, submissive, maternal, and hardworking, without much wiggle room for error. Consider if you’re both struggling under the pressure to meet society’s unreasonably high standards—and perhaps, subconsciously, projecting these standards onto one another. If your daughter feels she is not measuring up to society’s standards for what a girl or woman “ought” to be, it’s possible she’ll project her insecurity onto you, especially if she’s still young. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Girls are socialized from a young age to present as emotionally mature “little ladies” while sons often get more time to “be boys.” This social perception may persist in adulthood, where, as mothers, they are frequently expected to perform the bulk of child-rearing and are often blamed for being “selfish” or a “bad mother” if anything goes wrong in a child’s life, while fathers are often treated like mere babysitters."
    },
    {
      "title": "She's being influenced by someone else.",
      "content": "She's being influenced by someone else. If your daughter’s behavior changes seemingly out of the blue, there’s a possibility she’s being influenced by another person. This could be a romantic partner who may be threatened by her relationship with you or who may want to divide you so she’s easier to manipulate. The “other person” may also be her other parent, in the event that you're divorced or separated. Some parents seek—consciously or not—to pit their children against their exes, but even if your ex isn’t doing this, your daughter may feel anger towards you for “letting” your relationship end (even though it's not your fault). [7] X Research source"
    },
    {
      "title": "Consider her motives.",
      "content": "Consider her motives. It can be really difficult to stay patient and neutral when your child is hurling accusations at you, but pausing to consider where her anger might be coming from can help you both resolve the situation more smoothly. Who does she hang out with regularly? What is her day like? What outside factors may contribute to her mood? [8] X Research source This is a helpful step to take whether your daughter is a child or an adult. Let go of pride and consider that her accusations against you may be valid. Parenting is really hard—and no parent out there is perfect. It's possible you did make mistakes, but that doesn't mean that you're a \"bad\" parent. [9] X Research source"
    },
    {
      "title": "Validate her feelings.",
      "content": "Validate her feelings. When a person feels as if they aren’t being heard, they may try to make up for it by becoming louder or more aggressive—which may, in turn, cause the listener to minimize their feelings as dramatic or overly emotional. Or, the listener might panic and work overtime to defend themselves against the speaker’s accusations. If your daughter feels she’s not being really listened to, she may become hostile towards you. Although it's not always easy, practice validating her feelings more often and see if she lashes out at you less. [10] X Research source Try to let go of any nostalgic and idealized images you’re holding onto of your daughter as an innocent and perfect toddler. One reason some children feel invalidated by their parents as they grow up is that their parents still see them as “babies” when they’re not. [11] X Research source"
    },
    {
      "title": "Resist the urge to defend yourself.",
      "content": "Resist the urge to defend yourself. When your daughter is hurling accusations at you, you rightfully want to speak up and defend yourself. But if she’s angry at you, she probably already figures you aren’t really listening to her, and defending yourself—thus making the conversation about you—may solidify that perception for her. Instead, focus on pausing, listening to her grievances, and validating her feelings rather than defending yourself and potentially making her feel guilty. Try to stay neutral. Offer responses that validate her feelings without defending your actions: “I’m so sorry you’re hurting. I completely understand your feelings and I would probably feel the same way in your shoes.” [12] X Research source If your daughter is an adult, you may eventually get the opportunity to explain your side of things as equals. If your daughter is still a child, though, realize defending yourself or shifting the focus of the conversation to your pain or frustration effectively takes you out of your caregiving role and lays the responsibility for your feelings on your daughter."
    },
    {
      "title": "Model healthy emotional sharing.",
      "content": "Model healthy emotional sharing. If your daughter is young, she may not understand how to express or deal with her emotions in a healthy way. [13] X Research source Feel free to combat this by modeling healthy emotional sharing—rather than telling her how to behave when she's upset, take a moment to show her what it looks like to be tired or angry or to feel badly about yourself, and then show her what it looks like to deal with those emotions. For instance, instead of telling her to love herself, show her how you love yourself : say kind things about yourself and avoid putting yourself down in front of her. When you’re tired, tell her calmly how you’re feeling, and then invite her to participate in a relaxing self-care activity with you. (She may turn down your offer, which is totally OK.)"
    },
    {
      "title": "Ask her what she needs.",
      "content": "Ask her what she needs. If your daughter feels you're responsible for her unhappiness or as if you aren't validating her feelings, asking her what she needs may be a great way to help her feel more seen and loved. She may say she needs to talk, or she may even say she doesn't know. Asking her, though, is another great way of modeling conflict resolution for her. Consider saying, \"I hear you and I'm so sorry you're feeling this way. Is there anything you'd like me to do? Anything you need from me to feel more supported?\""
    },
    {
      "title": "Give her space.",
      "content": "Give her space. Your daughter’s aggression towards you may just mean she needs some alone time to rest and reflect. She might have had a rough day or not gotten enough sleep, or she may be frustrated with you and need time to cool off. Either way, offering to give her some space may help her collect herself and feel differently about things. She may return and still feel like you’ve done something blameworthy, but it’s likely both of your emotions won’t be running as high, so you can have a more productive discussion. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You might say, “I can see you’re in so much pain. I want to talk about this and listen to everything you have to say, but I wonder if it would help to take some space for a bit to cool down.” If you have a tendency to hover over her, try backing off. This can be super hard to do, especially if she’s young or living a life you don’t entirely approve of, but it’s integral to maintaining a healthy bond with your child. [15] X Research source"
    },
    {
      "title": "Find your own support system.",
      "content": "Find your own support system. Whether your daughter is a child or a grownup, dealing with constant blaming can be mentally and emotionally exhausting. It’s super important that you take care of yourself by having a support system in place to turn to when you need it, whether it’s friends, your spouse, or a therapist. [16] X Research source Fighting with your child can take a toll on your mental health, but many young daughters grow up and realize their mother isn’t the source of all their problems. If your daughter is an adult and she still blames you for everything, it might be time to put some boundaries in place: [17] X Research source Consider visiting less, and don’t respond to any texts blaming you. Rescind financial support if she is financially dependent on you. If she starts blaming you, leave the room. Tell her you won’t abide any emotional abuse."
    },
    {
      "title": "Seek family therapy.",
      "content": "Seek family therapy. Getting personal therapy may be beneficial to maintaining your own mental health, but it’s also worth checking out family therapy for you and your daughter. A family therapist will help you analyze your dynamic and what might be causing so much friction between you. You may also consider putting your daughter in individual therapy (or advising her to go, if she’s an adult). It’s possible she’s struggling with more than you realize, and a trained therapist may be able to help her unpack what’s really bothering her."
    },
    {
      "title": "\"To blame\" means \"to hold responsible,\" but the blame isn’t always rooted in logic.",
      "content": "\"To blame\" means \"to hold responsible,\" but the blame isn’t always rooted in logic. Your daughter may have pain she doesn’t know what to do with, and she may project it onto you as a “safe” vessel for her blame. [18] X Research source There may not be any logic to her blame beyond the fact that you’re her caretaker and therefore, technically, responsible for her general well-being—even though that doesn’t mean she won’t be hurt or unhappy from time to time. The problem with assigning blame to the wrong person is sometimes it’s hard to shake the feeling that that person actually does deserve that blame."
    },
    {
      "title": "People who believe they’re being blamed may actually just feel guilty.",
      "content": "People who believe they’re being blamed may actually just feel guilty. Being blamed is sometimes a subjective experience. In other words, your daughter may complain about the same problems to a friend, and they may simply take it as her venting. But to you, her complaints signify a failure on your part—a failure to keep her happy and safe. [19] X Research source Ask yourself if it’s possible she’s not actually blaming you, but simply trying to express how she feels and receive support. It might help to translate her words into feelings, especially if she’s young. For instance, if she says, “I hate you for leaving Dad. If he were here, my life wouldn’t be a mess,” you might translate that as, “I’m so sad and hurt that you split up, and I don’t know what to do about it.” The first sentence may understandably make you feel defensive, but if you look for the emotions underneath, you might see your daughter isn’t actually blaming you in this scenario. She’s feeling defensive herself and doesn’t know quite how to verbalize her emotions."
    },
    {
      "title": "Daughters who blame their moms are usually reaching out for support.",
      "content": "Daughters who blame their moms are usually reaching out for support. All anybody—especially kids—wants is to be immediately understood and seen by the person who loves them best. Part of your daughter's frustration may be due to the fact that you can't always immediately sense what's wrong because, despite what she may have believed when she was a toddler, you aren't actually a superhero who can read minds: you're just human. But validating her feelings is the first step toward real communication and healing. No matter the circumstance, simply listening to her and letting her know you're there to comfort and help in whatever way you can is sure to go a long way."
    }
  ]
}