{
  "url": "https://www.wikihow.com/Make-a-Guy-Regret-Ghosting-You",
  "title": "The 12 Best Ways to Make a Guy Regret Ghosting You",
  "steps": [
    {
      "title": "Ghosters sometimes come back around to keep you on the hook.",
      "content": "Ghosters sometimes come back around to keep you on the hook. Just when you’ve started to move on, they’ll pop up in your inbox with a “Heyyy” or “How’ve you been?” This is called “breadcrumbing” because they’re giving you little morsels to keep you going. [1] X Research source Shut down this nonsense because you deserve something real. Unfollow his social media accounts so you won’t be tempted to talk to him. Additionally, you don’t need to see what he’s up to. Let him pine after you. In general, it’s best to just move on, unless you’ve been dating for a month or longer. In that case, you might send him a quick text saying, “Hey, I’m not sure what happened between us to make you go silent, but I’d really appreciate a quick conversation so I can have closure.”"
    },
    {
      "title": "Keep walking if you see Casper haunting your local bar or supermarket.",
      "content": "Keep walking if you see Casper haunting your local bar or supermarket. Ghosters love to know you’re still thinking about them, so show him you’ve already moved on. Just go about your business like he’s not even there. If he tries to talk to you, shrug and say something like: “Oh, I didn’t notice you there. I gotta go, though, so take care!” “Oh, yeah! I forgot we went out. I’ve just been so busy lately. Have a good one.” “What was your name again? That's right! Have a nice one, Toby.”"
    },
    {
      "title": "Take great care of yourself so you’re positively glowing.",
      "content": "Take great care of yourself so you’re positively glowing. Now’s the time to get a good night’s sleep , eat well , exercise , and drink lots of water so you feel good from the inside out. Additionally, spend a little extra time getting ready in the morning. [2] X Research source You’ll feel amazing, and he’ll regret losing someone as fabulous as you. Practicing self-care is a great way to show him that you have the great potential to be a good partner—but he lost out."
    },
    {
      "title": "Rock your favorite outfits so you look amazing.",
      "content": "Rock your favorite outfits so you look amazing. What you choose to wear tells people a lot about you, and you want that message to say: “I’m attractive, self-assured, and a great catch.” [3] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Post your stylish looks on your social media and strut around with confidence. You look fab! Have a friend come over and help you shop your closet for your best looks. Just be yourself. You don’t need to buy new clothes or dress like a celebrity to show off how hot you are, make use of what you have, try new styles."
    },
    {
      "title": "Confidence makes you look more attractive to other people.",
      "content": "Confidence makes you look more attractive to other people. You can become more confident by listing your strengths, celebrating your successes, and smiling more. [4] X Research source Additionally, maintain good posture and speak assertively when you talk. Not only will you feel good, but you’ll also show him what he’s missing. It’s okay if you don’t feel confident all of the time because no one does. Just do your best to fake it, and everyone will think you really are confident."
    },
    {
      "title": "As they say, being happy is the best revenge.",
      "content": "As they say, being happy is the best revenge. He’ll go nuts watching you have fun and live your best life without him in it. Go out with friends, spend time with your family, and engage in your hobbies. [5] X Research source Then, post about how much fun you’re having on social media so he sees it. Have a fun night out on the town with your friends. Go to a fancy restaurant with your bestie. Take a weekend trip. Record a video of you playing a song on guitar. Bake the best cookies you’ve ever tasted. Go for an amazing hike."
    },
    {
      "title": "Exploring something new is always a great way to mend your heart.",
      "content": "Exploring something new is always a great way to mend your heart. Even a short relationship can hurt when it ends, so make some exciting new memories. [6] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Make a list of things you’ve always wanted to try, and then start checking them off. Don’t forget to document it all on your social! Start a new hobby. Eat at a new restaurant. Make a new friend . Attend a meetup.com event. Take an art class. Test drive a car. Make bath bombs . Audition for a play."
    },
    {
      "title": "You almost never get closure from a ghost.",
      "content": "You almost never get closure from a ghost. In many cases, the whole reason they ghosted is so they wouldn’t have to have uncomfortable conversations. You’re probably not going to get a reason for why he ghosted you, but that’s okay. Just know that better things are on the horizon, and this guy wasn’t worth your time. [7] X Research source The most common reasons people ghost have to do with convenience or avoidance. It’s easiest to just stop texting you, and they may think it’s somehow hurting your feelings less. [8] X Research source"
    },
    {
      "title": "Process any negative feelings you might have about being ghosted.",
      "content": "Process any negative feelings you might have about being ghosted. Even though it’s super common, it can really hurt your feelings. Chances are, talking to a friend will make you feel a lot better. If not, chat with a therapist so you can get some professional advice. [9] X Research source Swapping dating stories with your friend group can be a big help. It’s likely that some of them have been ghosted, too, so you won’t feel alone. You can find a therapist easily on BetterHelp ."
    },
    {
      "title": "Forget about him and move on to bigger and better things.",
      "content": "Forget about him and move on to bigger and better things. It’s really tempting to creep on his social media to see what he’s doing or to reread old messages to look for clues about why he ghosted. But you have much better things to do with your time, so cut him off completely if that’s best for you. After you block him, he won’t be able to see your social media posts. If you want him to see what he’s missing, you might just block his phone number but leave him on your Insta or Snapchat."
    },
    {
      "title": "With the ghost in your rearview, you can focus on someone new.",
      "content": "With the ghost in your rearview, you can focus on someone new. As soon as it feels right, start looking for love again. See what else is out there by talking to some new people or going on a few dates. [10] X Research source When the ghoster sees you’ve moved on, he’ll be kicking himself. Take things slow and just focus on making a connection. It’s okay to talk to a few people at the same time at first. You’re not exclusive until you agree to only date each other."
    }
  ]
}