{
  "url": "https://www.wikihow.com/Schedule-a-Salvation-Army-Donations-Pickup-Online",
  "title": "How to Schedule a Salvation Army Donations Pickup Online",
  "steps": [
    {
      "title": "Package the items but keep track of the items you are packing.",
      "content": "Package the items but keep track of the items you are packing. You will need this information as you schedule."
    },
    {
      "title": "Open the Salvation Army Truck webpage.",
      "content": "Open the Salvation Army Truck webpage . The scheduling pickup tool isn't on their main page but can be found via search engine search, which the Salvation Army tracks and manages."
    },
    {
      "title": "Type in your zip code into the \"ZIP Code\" box underneath the \"Schedule a pickup\" label, then click the attached \"Go\" button directly to its right.",
      "content": "Type in your zip code into the \"ZIP Code\" box underneath the \"Schedule a pickup\" label, then click the attached \"Go\" button directly to its right. Typing in your zipcode starts things and finds out if there's a close location with a truck that handles your area. There are other boxes there, where you can find a drop-off location, a Salvation Army to drop off cars and one to find your local Salvation Army Thrift Store. On the mobile version of the same website, tapping the Schedule a Free Pickup button to begin the scheduling will present you with the zip code box."
    },
    {
      "title": "Look over the list of items and tell the salvation army what's being donated.",
      "content": "Look over the list of items and tell the salvation army what's being donated. Click the + and - signs to the right of these options to suggest what these items are. Your options include clothes, books, misc items, household items, chair, and couch (of which the first four they mention should be either in a bag or box. There's also a miscellaneous drop-down option for more-potent items that may require additional information for additional care upon pickup. If it's still not on the list, there's an option \"My item doesn't appear on this list\" directly below the list."
    },
    {
      "title": "Click the \"Next\" button at the bottom of the screen after you complete the list.",
      "content": "Click the \"Next\" button at the bottom of the screen after you complete the list."
    },
    {
      "title": "Schedule the date of pickup.",
      "content": "Schedule the date of pickup. Depending on the availability of the truck, it may either be a day or two or many weeks out before the truck can pick up your items. On the calendar, the circled date with the black filling is the earliest date they can pick up your items. The white-filled is the next business day the store is planning to be open. If you have special circumstances where you need the truck to pick it up sooner, the page says you should drop it off by the \"Drop-Off\" button below the calendar."
    },
    {
      "title": "Leave additional instructions for the driver - if necessary.",
      "content": "Leave additional instructions for the driver - if necessary. The \"Special Instructions to driver\" is a text box you can leave notes about your pickup. If possible, you can also select a common instruction from the list below. From the common instructions list below, you'll find \"Please leave a receipt\", \"Private Home/No Gate Number on Mail Box\", \"In Front marked SA Driveway, Porch, Garage, etc\", \"Knock / ring at Front Door\" and \"All Items are at Driver and Dispatch Discretion."
    },
    {
      "title": "Submit the optional 1-question survey of where you heard about this \"SA Truck.org website\".",
      "content": "Submit the optional 1-question survey of where you heard about this \"SA Truck.org website\". Options include: \"Allied Van Lines\", \"Local Realtor or Title Company\", \"Unknown (Not Listed)\", \"Automated Phone Call\", \"Newspaper\", \"Postcard Mailing\", \"Radio\", \"Salvation Army Website\", \"Social Media\" or \"Television\"."
    },
    {
      "title": "Click the \"Save\" button at the very bottom of the page.",
      "content": "Click the \"Save\" button at the very bottom of the page."
    },
    {
      "title": "Tell the site whether or not you have a Salvation Army account.",
      "content": "Tell the site whether or not you have a Salvation Army account. This is used to supply your name, address, and contact details with the driver. You have choices such \"Yes\" (login), \"No\" (create an account), or \"Not Sure\" (do the research with a few additional pieces of information."
    },
    {
      "title": "Fill in the blanks.",
      "content": "Fill in the blanks. If you said yes, login and make sure all the information is up-to-date. If you said no, create your own account with the best information you have. If you said not sure, you'll need to do the research using their two text-box search tool (Home Phone Number and Last Name) - but for each, you'll finish with clicking/tapping \"Submit\" at the bottom of the page."
    }
  ]
}