{
  "url": "https://www.wikihow.com/Bind-Keys-on-Windows",
  "title": "How to Bind Keys on Windows",
  "steps": [
    {
      "title": "Download SharpKeys from https://github.com/randyrants/sharpkeys/releases.",
      "content": "Download SharpKeys from https://github.com/randyrants/sharpkeys/releases . SharpKeys is an open-source software that allows you to reassign your keyboard buttons on Windows. Click the latest ZIP file download of SharpKeys (e.g., sharpkeys394.zip ) to download the file. Once downloaded, unzip the file ."
    },
    {
      "title": "Double-click SharpKeys.exe in the extracted folder and accept the terms.",
      "content": "Double-click SharpKeys.exe in the extracted folder and accept the terms. This launches SharpKeys for the first time."
    },
    {
      "title": "Click Add at the bottom-left corner of SharpKeys.",
      "content": "Click Add at the bottom-left corner of SharpKeys. This will allow you to add a new keyboard button configuration."
    },
    {
      "title": "In the left column, click the key you want to reassign.",
      "content": "In the left column, click the key you want to reassign. For example, if you want to change your keyboard's Caps Lock button to Space, find and select Caps Lock on the left list."
    },
    {
      "title": "Select a new function from the right column.",
      "content": "Select a new function from the right column. The new functions appear in the \"To this key\" column. For example, if you're changing your Caps Lock button to Space, find and select Space on the right list."
    },
    {
      "title": "Click the OK button.",
      "content": "Click the OK button. Now that you've made this change, your configuration is saved. However, you'll still need to make a change to your registry."
    },
    {
      "title": "Click Write to Registry at the lower-right corner.",
      "content": "Click Write to Registry at the lower-right corner. You'll probably need to click OK to give admin permission to the app before it can write to the registry. Once written, you'll still have one more step to complete."
    },
    {
      "title": "The new key configuration won't work until you reboot your computer.",
      "content": "The new key configuration won't work until you reboot your computer. Once your computer comes back up, the key will be remapped."
    }
  ]
}