{
  "url": "https://www.wikihow.com/Chrome-Plate",
  "title": "How to Chrome Plate",
  "steps": [
    {
      "title": "Rinse and wipe your object with water and a clean cloth.",
      "content": "Rinse and wipe your object with water and a clean cloth. Start by washing the metal object that you’re going to work on. Run the object under a stream of cold water and rotate it in your hand to get the entire item wet. Use a cloth to wipe the surface clean and remove any surface stains, dirt, or grime. If the object that you’re working with is greasy or oily, skip this step. [1] X Research source"
    },
    {
      "title": "Put on a pair of rubber gloves and wear protective eyewear.",
      "content": "Put on a pair of rubber gloves and wear protective eyewear. Most commercial degreasers are skin and eye irritants. To avoid harming your skin or eyes, wear long sleeves and put on a pair of protective goggles. Grab a clean pair of rubber gloves and throw them on to avoid harming or irritating your skin. [2] X Research source"
    },
    {
      "title": "Use a degreaser to remove any oils or grease.",
      "content": "Use a degreaser to remove any oils or grease. Get a commercial degreaser designed for kitchen, bicycle, or metal cleaning. Spray your degreaser over the surface of your object and give the degreaser 3-5 minutes to soak into your item. Then, take a clean cloth and scrub the degreaser into the item and remove any oily substances. Pick up a degreaser at your local cleaning supply or home goods store. If you want to create your own degreaser, mix 3 tablespoons (43 g) of baking soda with 1 cup (240 mL) of warm water."
    },
    {
      "title": "Buff the surface of metal objects with a scouring pad.",
      "content": "Buff the surface of metal objects with a scouring pad. Grab a dry, thick, scouring pad. Scrub your item using firm, circular strokes. Cover each section of your object 3-4 times to ensure that you’ve scrubbed any residual impurities away. Then, rinse and dry the item. [3] X Research source Don’t use a scouring pad on plastics that you’re planning on spray painting. Simply rinse the item under water and wipe them dry."
    },
    {
      "title": "Purchase a chrome spray paint from a home supply or auto parts store.",
      "content": "Purchase a chrome spray paint from a home supply or auto parts store. Go to a home supply, construction, or auto parts store. Look for a can of spray paint that is labeled “chrome” or “chrome plating.” Check the label carefully to see if it contains VMP (vacuum metalized pigments), which are chrome-plated paint pigments. Avoid cans of paint that simply say “silver” or “gold” to get an authentic color that actually replicates the color of chrome plating. These spray paints are often marketed as “metallic” spray paint. This is the best option if you have an inexpensive object, like a cheap necklace or vase, that you want to turn chrome for decorative purposes. Spray painting something chrome isn’t technically chrome plating. However, spray painting is the easiest method to get a chrome finish, and it’s safer than the other methods."
    },
    {
      "title": "Take your item outside and lay a drop cloth underneath it.",
      "content": "Take your item outside and lay a drop cloth underneath it. Aerosol paint can become a lung irritant if you aren’t working in a well-ventilated area. To stay safe, take the object that you’re painting outside. Lay a drop cloth down underneath it to avoid accidentally painting the ground or walls around your item. [4] X Research source You can throw on a respirator or dust mask if you want, but it’s not required if you’re working outside. Put on a pair of rubber gloves if you want to keep your hands clean. Wear long sleeves and pants to keep paint particles from getting on to your skin."
    },
    {
      "title": "Hold the can of spray paint 8–16 in (20–41 cm) away from the item.",
      "content": "Hold the can of spray paint 8–16 in (20–41 cm) away from the item. Take your can of spray paint and shake it for 20-25 seconds until you hear the ball inside rattling around. Point the nozzle down at your item and hold the can 8–16 in (20–41 cm) away from the surface of your item. [5] X Research source You cannot spray paint while holding the can upside-down."
    },
    {
      "title": "Spray your item using smooth, back-and-forth strokes to apply the paint.",
      "content": "Spray your item using smooth, back-and-forth strokes to apply the paint. Start at the top of your plastic or metal object. Press your finger down to release the spray paint. Move the can back and forth along the top of your item, working down towards the bottom as you spray. Avoid holding the can in one location for too long to prevent drips from forming on the surface of your item. [6] X Research source Spray painting can feel kind of odd if you’ve never done it before. If this is your first time using spray paint, try practicing on an item you don’t care about first, like a cardboard box or empty milk carton."
    },
    {
      "title": "Wait 2-3 hours for the item to dry and flip it over.",
      "content": "Wait 2-3 hours for the item to dry and flip it over. Once you’ve covered one side of your item, wait 2-3 hours for the paint to dry completely. Once the item has air dried, flip it over to expose any unpainted areas that you haven’t covered yet. Normally, spray paint can dry in 15-30 minutes. VMP spray paint tends to take a little longer to dry. Waiting a few hours is a good way to play it safe and ensure that the paint is completely absorbed by the metal or plastic."
    },
    {
      "title": "Paint the remaining sections of your item and let it air dry.",
      "content": "Paint the remaining sections of your item and let it air dry. Paint the unpainted sections of your metal or plastic item using the same process you used on the first side. Hold the can roughly 8–16 in (20–41 cm) away from the item and use a smooth back-and-forth stroke to completely cover the object. Wait another 2-3 hours for the paint to dry. The chrome paint should hold up for 6-8 months before it starts to erode."
    },
    {
      "title": "Repeat this process to add additional layers if you want a shinier finish.",
      "content": "Repeat this process to add additional layers if you want a shinier finish. Once you’ve let your first layer dry, you can stop if you’re happy with the color and sheen of your chrome paint. If you’d like a brighter finish or a more evenly-textured look, feel free to apply additional layers of paint using the same process you used to paint the object the first time. Apply an additional 2-4 coats of paint to brighten the color and improve the finish."
    },
    {
      "title": "Buy a chrome plating spray kit from a chrome plating supply company.",
      "content": "Buy a chrome plating spray kit from a chrome plating supply company. Chrome plating spray kits are DIY kits that uses a variety of chemicals to apply a chrome finish to a metal object. These kits typically cost between $150-500, and can only be purchased from companies that specialize in chrome plating. The finish is more durable than standard spray paint, but utilizes dangerous and abrasive chemicals. [7] X Research source Spray kits will not only give your items a beautiful shine, but they’ll protect metals from rust and erosion! Unless you have a ton of objects that you’re trying to chrome plate, it’s usually cheaper to simply take your item to a shop that offers chrome plating services. You can use a chrome plating spray kit on durable plastic or metal including steel, brass, copper, and aluminum."
    },
    {
      "title": "Put on long sleeves, a hood, a respirator, goggles, and gloves.",
      "content": "Put on long sleeves, a hood, a respirator, goggles, and gloves. It’s incredibly important that you avoid coming in contact with any of the chemicals you’re going to use to turn your item chrome. Wear a long-sleeved sweater with a hood and drawstrings. Put on thick rubber gloves and protective eyewear. Grab a pair of thick pants to stay safe while you’re spraying your item. Put on a respirator and tie it tight. [8] X Trustworthy Source US Occupational Safety and Health Administration U.S. government agency responsible for setting and enforcing workplace safety standards Go to source A dust mask won’t offer enough protection for most spray chrome kits."
    },
    {
      "title": "Set your item up in a well-ventilated area.",
      "content": "Set your item up in a well-ventilated area. Take your materials outside to avoid exposure to any of the chrome plating chemicals. If you’re only plating one side of an item, put a thick drop cloth down underneath your item to ensure that you’re only spraying your object. You can also set the object up on a stand or stable work surface if you want to spray your entire item at once. [9] X Research source Do not do this on a windy day when the chemicals are going to be blown all over the place."
    },
    {
      "title": "Cover the object in your activating solution spray.",
      "content": "Cover the object in your activating solution spray. Hold your activator 6–8 inches (15–20 cm) away from the surface of your object. Pull the trigger on your bottle to cover your object in the activating solution. Spray 10-20 times across every section of the surface to completely cover it in the activating solution. Your item must be dripping with the activating solution by the time you’re done. [10] X Research source The activator coats the object in a solution that will bind your chrome spray to the material of the item. Some kits will refer to the activator as a primer. Every spray kit is different. If your instructions tell you to do something before applying an activator, or don’t mention an activator at all, go ahead and skip this step."
    },
    {
      "title": "Mix your chroming solution with deionized water.",
      "content": "Mix your chroming solution with deionized water. Read your specific kit’s instructions to determine how your chrome spray solution should be mixed. Most kits provide the deionized water, so you simply have to combine 2-3 bottles into a single spray bottle and shake it up. Some kits will only require a deionized water rinse before the chroming solution is applied. [11] X Research source If you need to make deionized water yourself, run tap or spring water through a DI system. DI systems can be purchased from a chemical engineering company, water purification company, or online retailer. Deionized water is essentially water that has had all of the minerals, contaminants, and additives removed."
    },
    {
      "title": "Spray your item with the chroming solution.",
      "content": "Spray your item with the chroming solution. Take the spray bottle filled with the chroming solution and hold it 6–10 inches (15–25 cm) away from your item. Pull the trigger on the bottle to spray your item 10-15 times, starting at the top of the object and working your way to the bottom. Allow the solution to drip off of your item and on to your work surface or drop cloth. Work your way around the entire item if you’re chroming the entire thing. [12] X Research source If you can adjust the nozzle setting on your spray bottle, use a medium nozzle setting to avoid ricochets. If you use a wider nozzle setting, the thinner application may result in an uneven coat. You should see your item changing color almost immediately as the activator, water, and chrome spray bind to the object’s surface. Depending on your specific kit, you may have to apply multiple coats of different-density chrome solutions to complete the process."
    },
    {
      "title": "Apply your sealant by spraying it on.",
      "content": "Apply your sealant by spraying it on. Either apply your sealant immediately or wait for your chroming solution to dry based on your specific kit’s instructions. Spray your sealant all over the item that you’re spraying. Use the same method that you used for the chroming solution, spraying the object by holding the bottle 6–10 inches (15–25 cm) away from the surface. Spray it with the sealant until you’ve covered the entire item on every side. [13] X Research source The sealant will protect your chrome from fading for at least 1 year."
    },
    {
      "title": "Blow dry your item to complete the process.",
      "content": "Blow dry your item to complete the process. Use a blow dryer on the coolest setting or grab an air gun. Blow your object dry by moving the hose or blow dryer back and forth across the surface of your item. Work in back-and-forth strokes and start from the top before working your way down. Once your object is totally dry, you’ve finished applying your chrome! [14] X Research source Every chrome spray kit is different. Follow the specific instructions of your spray kit to get the best possible finish for your item. Chrome plating that has been applied with a spray kit lasts anywhere from 1-5 years."
    }
  ]
}