{
  "url": "https://www.wikihow.com/Share-an-Apple-Calendar-on-iPhone-or-iPad",
  "title": "How to Share an iCloud Calendar on iOS in 6 Easy Steps",
  "steps": [
    {
      "title": "Open the Calendar app and tap Calendars.",
      "content": "Open the Calendar app and tap Calendars . Once you open the Calendar app, you'll find the Calendars option at the bottom-center part of the screen."
    },
    {
      "title": "Tap the “i” in a circle next to the calendar you want to share.",
      "content": "Tap the “i” in a circle next to the calendar you want to share. You will only be able to share calendars that appear under the \"ICLOUD\" header. Other types of calendars will not give you the option to share them with other people. You won't be able to share other synced calendars, such as your Google or Outlook calendar. If you have both an iPhone and an iPad, you can easily sync your calendar across all of your devices using iCloud."
    },
    {
      "title": "Tap Add Person under the “SHARED WITH” header.",
      "content": "Tap Add Person under the “SHARED WITH” header. Now you can add the email address of the person you want to share the calendar with."
    },
    {
      "title": "Enter the recipient(s) and tap Add.",
      "content": "Enter the recipient(s) and tap Add . You can select one or more contacts to share this calendar with. Tap the To: field to bring open the keyboard. Type the person's email address or tap + to select a contact. You'll only be able to share a calendar with a contact if their email address is listed in the Contacts app. Tap Add . Repeat for anyone else you want to share with. If you want the calendar to be public, you can slide the \"Public Calendar\" switch to the On position as well."
    },
    {
      "title": "Change permissions for the calendar (optional).",
      "content": "Change permissions for the calendar (optional). By default, the person you're sharing with can make changes to the calendar. If you want to turn off this access: Tap the name of the person you're sharing with. Tap the Allow Editing switch to toggle the feature off. This way, the person you're sharing with can only view, but not edit, the shared calendar. [1] X Research source Tap the back button when you're finished."
    },
    {
      "title": "Tap Done at the top-right to save your changes.",
      "content": "Tap Done at the top-right to save your changes. A link to your calendar will be sent to the selected recipient(s). The person or people you're sharing with will be able to view your events and other calendar details in their own Calendar app."
    }
  ]
}