{
  "url": "https://www.wikihow.com/Open-PDF-Files",
  "title": "Opening PDF Files on Multiple Platforms with Troubleshooting Tips",
  "steps": [
    {
      "title": "Download an app that supports PDF files.",
      "content": "Download an app that supports PDF files. While Android does not have \"built-in\" support for reading PDF files, there are a large number of free apps that will easily open your PDF files. You may even have one of these already installed: Google Drive Kindle Adobe Reader [1] X Research source Open your app drawer and search for one of these apps to see if you already have one before you download another."
    },
    {
      "title": "Find the PDF file you want to open.",
      "content": "Find the PDF file you want to open. Typically, when you download a PDF file, you can open it from your Notification bar by tapping the completed download. If you need to open the PDF file later, you can do so from your Downloads folder. Open the \"My Files\" or \"File Manager\" app on your device. If you don't have a file manager, you can download one for free from the Google Play store. Open the Downloads folder. This is the default location where any downloaded files will be stored in."
    },
    {
      "title": "Tap the PDF file to open it.",
      "content": "Tap the PDF file to open it. If you've chosen a default app, it will open automatically. If you just installed an app to open PDF files, or you have more than one app installed that can read PDFs, you will be prompted to choose the app you want to use."
    },
    {
      "title": "Tap the PDF that you want to open.",
      "content": "Tap the PDF that you want to open. iOS has a built-in PDF reader that can be used to open PDF attachments in emails or PDFs that you find online."
    },
    {
      "title": "Tap the open PDF to open the menu.",
      "content": "Tap the open PDF to open the menu. This will allow you to select another app to handle the PDF."
    },
    {
      "title": "Tap \"Open in...\" or the Share button.",
      "content": "Tap \"Open in...\" or the Share button. If you are viewing the PDF in your Mail app, you will use the Share button. If you are viewing the PDF in Safari, you will use the \"Open in...\" button. This will display a list of apps that support PDF."
    },
    {
      "title": "Select the app that you want to use.",
      "content": "Select the app that you want to use. You can add your PDF files to iBooks, or open it in Adobe Reader or any other PDF application you have installed on your iOS device. [2] X Research source The PDF will open immediately in your selected app."
    },
    {
      "title": "Double-click the PDF.",
      "content": "Double-click the PDF. All Windows computers have a browser that can act as a PDF reader, like Microsoft Edge or Chrome, so you don't have to download anything if you don't want to do more than read or view the PDF. If you want to open a PDF to fill out or sign a form, you can install Adobe Acrobat Reader ."
    },
    {
      "title": "Change the program that your computer opens PDFs in.",
      "content": "Change the program that your computer opens PDFs in. If you don't want to use a web browser, like Edge, you can set it so all PDFs open in a different program. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Go to Control Panel > Programs (click the header) > Default Programs (click the header) > Set your default programs > Choose defaults by file type (at the very bottom) > .pdf (scroll down in the menu on the left side of the window) > click the browser icon (it's usually defaults to Microsoft Edge) and click the program you want to use."
    },
    {
      "title": "Double-click the PDF.",
      "content": "Double-click the PDF. All Macs come with Preview, a tool that opens a wide variety of files, including PDF files. Preview allows you to read PDF files, but not edit them. To learn how to edit PDF files, click here ."
    },
    {
      "title": "Change the program that Mac uses to open PDFs.",
      "content": "Change the program that Mac uses to open PDFs. If you have a different PDF program and no longer want to use Preview, you can set all PDF files to open with the new program. [4] X Research source Select a PDF file in Finder but don't open it. Click the File menu and select \"Get Info\". Expand the \"Open with\" section. Select the application you want to use in the drop-down menu. Click Change All..."
    },
    {
      "title": "Download Adobe Reader.",
      "content": "Download Adobe Reader. This is a free program that can open PDF files so that you can read them. Adobe Reader can be downloaded from https://get.adobe.com/reader/?promoid=TTGWL47M . You cannot use it to edit or create PDF files. Your web browser will identify your operating system and present you with a Mac or Windows appropriate download. To learn how to edit PDF files, click here . You can edit PDF files online also. You can download Adobe Reader from the website for Macs and Windows, but you can also find it in the App Store or Google Play Store for iPhone, iPad, and Android."
    },
    {
      "title": "Decline the optional offers.",
      "content": "Decline the optional offers. Scroll down below the \"Included with your download\" and uncheck the box next to \"Install McAfee Security Scan Plus\" and \"Install McAfee Safe Connect\". If you don't want the Chrome extension installed, uncheck the box next to \"Install Acrobat for Google Chrome.\""
    },
    {
      "title": "Click Download Acrobat Reader.",
      "content": "Click Download Acrobat Reader . The page will change to show you what was included in the file and how to proceed. Double-click the .exe program (in your Downloads folder) to install the program (Windows only). [5] X Research source If you're using a Mac, drag and drop the Adobe app icon into your Applications folder."
    },
    {
      "title": "Double-click a PDF file after installing Adobe Reader.",
      "content": "Double-click a PDF file after installing Adobe Reader. For most users, Reader should open automatically, displaying your PDF file."
    },
    {
      "title": "Transfer the PDF file to your Kindle.",
      "content": "Transfer the PDF file to your Kindle. There are a couple of different ways that you can do this, including emailing the PDF to your Kindle email and connecting the two with USB ."
    },
    {
      "title": "Open the file on your Kindle.",
      "content": "Open the file on your Kindle. Once the PDF file has been transferred, you can select it from your Kindle's library. There aren't many options for interacting with the PDF on a Kindle, as you can't add additional functionality with other apps."
    },
    {
      "title": "PDF requires a password.",
      "content": "PDF requires a password. If the PDF file requires a password and you don't have it, the only way to open it will be to ask the creator for the password or to use a password cracking program. If the password is strong, a cracking program could take hours or even days to recover the password."
    },
    {
      "title": "PDF won't open for compliance reasons.",
      "content": "PDF won't open for compliance reasons. Adobe may refuse to open a PDF for not complying with PDF standards. This is most often the case for PDFs created with non-Adobe software, or if you are opening a really old PDF with a newer version of Reader. [6] X Research source Try installing a third-party PDF reader. There are a variety of PDF readers, with Foxit Reader being one of the more popular options. You can also try opening the PDF in your web browser, like Edge or Chrome. Upload the PDF to Google Drive . You may lose some of the formatting, but there's a better chance that you will be able to open it."
    }
  ]
}