{
  "url": "https://www.wikihow.com/Charge-Your-iPhone-without-a-Charging-Block",
  "title": "10 Ways to Charge Your iPhone Without a Charging Block",
  "steps": [
    {
      "title": "Use the USB port on your laptop or computer.",
      "content": "Use the USB port on your laptop or computer. If your computer is on, you can plug your iPhone's charging cable into the USB (or USB-C) port. Then, plug the other end into your iPhone. As long as the computer is on, your iPhone will charge. You may be prompted to Allow the connection between your iPhone and computer. When your iPhone is connected , you can also transfer your iPhone data, back it up , or update your iOS ."
    },
    {
      "title": "Use a car charger.",
      "content": "Use a car charger. Newer cars may have built-in USBs. If your car doesn't have this, you can purchase an adapter for your car's cigarette lighter port. Then, plug your iPhone's charger cable into the USB port on the back of the charger. You should be able to find these chargers in most retail stores that have tech departments. Many of these chargers include two USB ports, making it easy for you to charge multiple items."
    },
    {
      "title": "Look for a USB port built into a wall outlet.",
      "content": "Look for a USB port built into a wall outlet. Some wall outlets come with a USB port. This can charge your iPhone without the block—just plug it in! Be sure not to use any built-in USB wall ports in public areas, such as airports. This can be a way to steal your phone data."
    },
    {
      "title": "Find a wireless charging mat.",
      "content": "Find a wireless charging mat. Apple supports wireless charging on iPhone 8 or newer. These wireless chargers must be Qi-certified, and many can be found in cafes, hotels, and other public locations. [1] X Research source Wireless chargers can cause items like credit cards to stop working properly. If you keep your card(s) in the back of your iPhone, make sure you remove them before placing the iPhone on the charger."
    },
    {
      "title": "Try public recharging stations if you're traveling.",
      "content": "Try public recharging stations if you're traveling. This poses the same risks as the built-in wall port in public areas—hackers may steal your data through this method. However, if it's an emergency, try to use a station next to an employee or security."
    },
    {
      "title": "Buy a portable battery pack.",
      "content": "Buy a portable battery pack. Battery packs (also known as power banks) can be charged ahead of time and then used with a USB cable (e.g., your iPhone's charger cable) to charge a mobile item to 100 percent multiple times. Make sure the battery pack is iPhone-compatible before purchasing it. If the packaging doesn't explicitly state that it will work with iPhones, it probably isn't iPhone-compatible. Most battery packs come pre-charged, so you can typically walk into a store, buy the pack, and charge in minutes."
    },
    {
      "title": "Try a wind- or solar-powered charger.",
      "content": "Try a wind- or solar-powered charger. You can find such chargers in outdoor supply stores and online. Most wind and solar chargers work the same way: you set up the charger to store power (either by spinning a wind turbine or receiving sunlight) and then plug your iPhone into the charger once its battery is full. Both wind and solar power are conditional, but if you live in an area with inconsistent power, they offer a viable alternative. Some wind and solar chargers will only charge your iPhone as they receive power, so check your charger's documentation before attempting to charge it. Neither of these chargers offers a speedy charge, but you'll be able to charge your iPhone's battery to 100 percent within a few hours."
    },
    {
      "title": "Invest in a hand crank charger.",
      "content": "Invest in a hand crank charger. Like wind- and solar-powered chargers, hand crank chargers can be purchased online or in some tech department stores. The premise is fairly straightforward: you plug your iPhone into the hand crank via its charger cable and then start cranking away. Naturally, using a hand crank to charge your iPhone will take significantly longer than wall socket charging. This is a good option if you're hiking or otherwise removed from a reliable source of power."
    },
    {
      "title": "Use a campfire charger.",
      "content": "Use a campfire charger. There are several chargers that can attach to your camping pots and pans that absorb heat from your campfire and turn it into energy. You can set the pot on the campfire and plug the cable into your iPhone, thus charging it while you cook dinner. Outdoor supply shops may stock these chargers, though your best bet is to search online. Be warned that using this method places your iPhone at a greater risk of being damaged due to overheating."
    },
    {
      "title": "Create a lemon battery",
      "content": "Create a lemon battery . If you're feeling experimental, you can make your own battery out of a lemon. Keep in mind the voltage will be low, but you should still use gloves and caution when trying this experiment. You'll need 12 lemons, 12 zinc nails, 12 copper screws, and copper wire."
    }
  ]
}