{
  "url": "https://www.wikihow.com/Play-Monopoly-With-Electronic-Banking",
  "title": "How to Play Monopoly With Electronic Banking",
  "steps": [
    {
      "title": "Start the banker unit.",
      "content": "Start the banker unit. Make sure that it has batteries inserted. Press any key to start the unit. Enter each player’s card into the unit. Their beginning balance should be 15 million dollars. [1] X Research source"
    },
    {
      "title": "Familiarize yourself with the banker unit.",
      "content": "Familiarize yourself with the banker unit. The unit is very similar to a calculator, but has some buttons and symbols you may be unfamiliar with. There are also slots on the left and right sides of the unit marked with “+” and “-.” These are where you insert a player’s card to add and subtract funds in their account. Make sure that you understand what each symbol represents before you begin playing. [2] X Research source Since you can only view 5 numbers on the display screen, you will need to use the denomination buttons “M” and “K,” which stand for million (M) and thousand (K). ”C” is the clear or cancel button. To restart a game, you will want to use this to adjust the balances on the player cards back to the beginning amount of $15M. You can do this by holding the “C” button until you hear a beep. The arrow button is used when a player passes “GO.” Insert their card in the left side of the unit and press this button to increase their balance by $2M. The numbers are pretty obvious, and the “.” is a decimal point, but the “.” button can also be used to adjust the volume on the banker unit."
    },
    {
      "title": "Add and subtract money from player accounts.",
      "content": "Add and subtract money from player accounts. As the game progresses, the banker is responsible for adding to and subtracting from each player’s balance using their card and the banking unit. [3] X Research source Add money by inserting the player card in the slot on the left hand of the banker unit. This is marked with a “+” symbol. Type the amount you wish to deposit to the player’s account. Remove the card once you see the increase in the player’s balance. Subtract funds from a player’s account by inserting their card into the slot on the right side of the banker unit, which is marked with a “-“ symbol. Type in the amount the player owes the bank. Remove the card after you see the amount deducted from their balance."
    },
    {
      "title": "Transfer money from one player’s account to another.",
      "content": "Transfer money from one player’s account to another. When one player is purchasing something or owes money to another player, the banker will subtract from one player’s account and deposit that amount in the other player’s account. [4] X Research source Insert the paying player’s card in the slot on the right of the banker unit. The card for the player receiving the payment should be placed in the slot on the left of the unit. Leaving both cards in place, enter the amount of the purchase. The balance which was displayed belongs to the payer. Once this balance is reduced by the purchase price, both cards can be removed from the device and returned to the players."
    },
    {
      "title": "Hold auctions.",
      "content": "Hold auctions. Auctions are held on properties not bought by the player who lands on them, or returned to the bank after bankruptcy. If a player chooses not to purchase the property they land on at purchase price, and the property is currently not owned, hold an auction to sell it at the price players are willing to pay. [5] X Research source The starting price is set by the first player to make an offer. Issue the title deed to the player who wins the auction."
    },
    {
      "title": "Pay players for passing “GO.”",
      "content": "Pay players for passing “GO.” Each time a player passes “GO,” insert their card in the left slot of the unit. Press the arrow symbol to deposit $2 million dollars into their account. [6] X Research source"
    },
    {
      "title": "Assign tokens.",
      "content": "Assign tokens. Tokens have been updated from the original monopoly board game to reflect the new age of electronic banking. Options include a space shuttle, Segway and flat screen television. Each player can choose whichever token appeals to them."
    },
    {
      "title": "Roll the dice.",
      "content": "Roll the dice. Roll to determine who goes first. Every player should roll both dice and add the amount shown on each die to total their roll. The player with the highest total starts the game. [7] X Research source Roll again to determine the number of spaces you move your token on the board. If you roll a double (the same number on both dice), complete your turn and roll again for a second turn. If you roll another double you get a third turn. If you roll three doubles in a row, though, you go to jail."
    },
    {
      "title": "Move tokens around the board.",
      "content": "Move tokens around the board. Move the number of spaces which you roll on the dice. Perform the function required according to the spot where you land. [8] X Research source Pay rent. Pay taxes. Draw a card from the community chest. Go to jail. Purchase the property."
    },
    {
      "title": "Collect $2 million dollars.",
      "content": "Collect $2 million dollars. Each time you complete a pass of the board and move beyond “Go,” you will receive $2 million dollars from the bank. [9] X Research source"
    },
    {
      "title": "Draw a card from the community chest.",
      "content": "Draw a card from the community chest. When you land on the community chest, you must draw the first card in the stack and follow the directs listed on the card, then place it face down, back on the bottom of the deck. [10] X Research source Move to the space instructed on the card in the direction indicated by the arrow. Collect $2 million dollars if you move forward past “Go,” but not if you move backward. If you draw a “Get out of jail free” card, you can sell it to another player at a price you both agree on, or save it for later."
    },
    {
      "title": "Take a break at free parking.",
      "content": "Take a break at free parking. This space allows you to complete any transactions on your turn, while not owing anything to another player or drawing a card. [11] X Research source"
    },
    {
      "title": "Get out of jail.",
      "content": "Get out of jail. There are several ways you can be sent to jail. Get out of jail by paying your bond, rolling doubles, or using a “Get out of jail free” card. [12] X Research source You can be sent to jail by landing on the “Go to jail” space, drawing a “Go to jail” card from the community chest, or rolling three sets of doubles in a row. Your turn is over once you go to jail. On your next turn, you can try 3 times to roll doubles. If you fail, you owe the bank $500 thousand dollars to get out of jail. Once you pay, move your token according to the total of your final roll. Use a “Get out of jail free” card if you have one or offer to buy one from another player. You can still collect rent while in jail. If you simply land on the jail space, you are just visiting and there is no penalty."
    },
    {
      "title": "Purchase a property.",
      "content": "Purchase a property. When you land on the space, you may choose to purchase the property at the price listed on the card. Pay that cost to the banker or the owner of the property. [13] X Research source If you do not purchase the property, and it is not currently owned by another player, the banker will hold an auction. You can participate in the auction even though you chose not to buy it at the purchase price. Once you own all of the site properties of one color, you have a monopoly and can build on them. You can charge rent from other players who land on your property."
    },
    {
      "title": "Own utilities.",
      "content": "Own utilities. When you own utilities, you can charge usage fees. Players who land on your utility will owe you rent based on a dice roll. Owning both the phone and internet utilities will greatly increase your income from other players. [14] X Research source A player who lands on your utility will owe rent determined by the amount they roll on the dice multiplied by 4, then multiplied again by 10,000. If you own both utilities, the rent owed is the player’s dice roll multiplied by 10, then 10,000."
    },
    {
      "title": "Buy airports.",
      "content": "Buy airports. Airports allow you to collect fees from other players. Each time a player lands on one of your airports, they will owe you the amount shown on the Title Deed card. [15] X Research source"
    },
    {
      "title": "Sell property to other players at an agreed upon price.",
      "content": "Sell property to other players at an agreed upon price. This can be any number you negotiate together. [16] X Research source If you have any buildings on properties of the same color, you cannot sell the property until you sell all of the buildings on that same color."
    },
    {
      "title": "Sell houses to the bank.",
      "content": "Sell houses to the bank. You will receive half of the purchase price listed on the deed card when you sell the house back to the bank. You can sell on your turn or between other player’s turns. You must sell houses in even numbers the same way they were bought."
    },
    {
      "title": "Sell hotels to the bank.",
      "content": "Sell hotels to the bank. You can receive half go the deed price for the hotel or trade it in for houses equaling the same value. For instance a hotel can be sold to the bank and you can receive 4 houses from the bank to put on that property."
    },
    {
      "title": "Sell property to other players.",
      "content": "Sell property to other players. You can sell sites, airports and utilities to other players to gain money. The price they pay you is any amount agreed on by both parties. [17] X Research source Sites can’t be sold if there are buildings on any of the sites in that color group. You must first sell those properties to the bank. You cannot sell houses or hotels to other players, only the bank."
    },
    {
      "title": "Buy the first house.",
      "content": "Buy the first house. You can build your first house on a property once you own all of the site properties of one color. Buy the house according to the price on the deed card. [18] X Research source Houses can be bought on your turn or between other player’s turns. You must build evenly and can’t add houses to one site until you have built on every site property of that color."
    },
    {
      "title": "Add houses to your property.",
      "content": "Add houses to your property. Once you have built houses on all of the sites of one color, you can add houses to these site properties. [19] X Research source You must continue to build evenly across the sites in that color. No houses can be built on sites of a color where another house is mortgaged on any other site of the same color."
    },
    {
      "title": "Exchange houses for hotels.",
      "content": "Exchange houses for hotels. Once you have 4 houses on every site of a single color group, you can exchange those houses for a hotel. Return the houses to the banker and pay the title deed price for the hotel you would like to build. [20] X Research source Only one hotel is allowed on each property site."
    },
    {
      "title": "Mortgage a property.",
      "content": "Mortgage a property. Once you have sold all of the buildings on a color group, you may choose to mortgage a property for money from the bank. [21] X Research source Turn the property card upside down. This symbolizes that it has been mortgaged. The amount of the mortgage is on the back of the card. You cannot collect rent on a property when it is mortgaged."
    },
    {
      "title": "Repay a mortgage.",
      "content": "Repay a mortgage. To reinstate your property and begin collecting rent again, you must repay the mortgage to the bank plus interest. [22] X Research source Flip the card back over once the mortgage is paid to make the property active again. The mortgage must be paid plus interest of 10% rounded up to the nearest $10,000."
    },
    {
      "title": "Sell a mortgaged property.",
      "content": "Sell a mortgaged property. Agree on a sale price with another player and sell them your mortgaged property to gain money and get out of paying interest. The interest is now the responsibility of the player who bought the property. [23] X Research source The new owner can take over the 10% interest, or pay it right away to get the property out of mortgage status."
    },
    {
      "title": "Go bankrupt.",
      "content": "Go bankrupt. When the money you owe to the bank or another player reaches a higher amount than you have in your own savings and assets, you have officially gone bankrupt and are out of the game. [24] X Research source If you owe the bank, the banker take your deeds and auctions any properties you may have had left. Return any “Get out of jail free” cards in your hand to the bottom of the community chest deck. If you end owing another player, they receive your deeds, any “Get out of jail free” cards you have, and the money left on your card."
    },
    {
      "title": "Survive until the end.",
      "content": "Survive until the end. Take over the properties and charge the other players until they go bankrupt. The last player left in the game is the winner."
    }
  ]
}