{
  "url": "https://www.wikihow.com/Grave-Cleric-5e",
  "title": "Everything You Need to Know to Build a Grave Domain Cleric in D&D 5e",
  "steps": [
    {
      "title": "The Grave domain is a cleric subclass available at level 1.",
      "content": "The Grave domain is a cleric subclass available at level 1. Grave domain clerics are divine spellcasters loyal to a god of death; they guard and protect the line between life and death. They believe that undeath is abhorrent, striving to respect the dead, put restless spirits to sleep, destroy the undead, and ease the suffering of those who are dying (or save them from death altogether). [1] X Research source Grave clerics tend to worship deities associated with death and the grave, including the Raven Queen, Kelemvor, Wee Jas, Hades, Anubis, and Osiris. However, you can design your Grave cleric however you like—which means you can decide what deity they worship and why. The Grave domain subclass can be found in the 5e sourcebook Xanathar’s Guide to Everything ."
    },
    {
      "title": "Domain Spells",
      "content": "Domain Spells Every cleric domain subclass gets its own list of domain spells; those spells are always prepared and don’t count against the number of spells a cleric can prepare each day—although it’ll still cost a spell slot to cast any spell, including domain spells. The Grave domain’s spells include: [2] X Research source 1st level: Bane and False Life 3rd level: Gentle Repose and Ray of Enfeeblement 5th level: Revivify and Vampiric Touch 7th level: Blight and Death Ward 9th level: Antilife Shell and Raise Dead"
    },
    {
      "title": "Circle of Mortality",
      "content": "Circle of Mortality Grave clerics gain some control over life and death. At level one, when your grave cleric casts a spell to heal a creature with 0 hit points, you can use the highest number possible for each die (instead of rolling it like you normally would). Your Grave cleric also learns the Spare the Dying cantrip; it has a 30-foot range and can be cast as a bonus action. [3] X Research source For example, if you cast Cure Wounds at level 1, it would normally require you to roll 1d8—but with a Grave cleric, you could simply use 8 since it’s the highest number you can roll on a d8. Spare the Dying usually takes an action to cast and must be cast by touching the target, so this adjustment makes it a much more appealing (and handy) cantrip."
    },
    {
      "title": "Eyes of the Grave",
      "content": "Eyes of the Grave Grave clerics consider undeath to be an insult to natural life—so, at level 1, they can sometimes sense undead creatures. They can use an action to activate this awareness—and, until the end of their next turn, your Grave cleric can sense the location of any undead within 60 feet so long as they aren’t behind full cover or protected from divine magic. [4] X Research source However, this ability doesn’t give you any insight into what the undead creature is or its abilities. You can use this ability a number of times equal to your Grave cleric’s Wisdom modifier, with a minimum of once (even if their modifier is less than +1). All uses of this ability are replenished when your Grave cleric finishes a long rest."
    },
    {
      "title": "Channel Divinity: Path to the Grave",
      "content": "Channel Divinity: Path to the Grave All clerics get the Channel Divinity feature, which enables them to channel power directly from their patron deity, and each subclass gets a unique type of Channel Divinity that reflects their chosen domain. At level 2, Grave clerics can use an action to mark a creature within 30 feet, cursing it with vulnerability against the next attack from either your cleric or an ally. [5] X Research source An affected creature is only cursed until after the first attack that hits it or until the end of your cleric’s next turn (whichever comes first). After getting hit with an attack, the curse ends. Vulnerability means that damage against the creature is doubled. So, if you hit a vulnerable creature with an attack that would normally deal 10 (2d6) fire damage, you’d actually deal 20 points of fire damage. This ability is especially potent when paired with attacks that deal massive damage, like a rogue’s Sneak Attack or a spellcaster’s Inflict Wounds."
    },
    {
      "title": "Sentinel at Death’s Door",
      "content": "Sentinel at Death’s Door Grave clerics can repel death itself. At the 6th level, your Grave cleric can use a reaction to turn a critical hit into a normal hit, so long as they can see the attack and it occurs within 30 feet. They can use this ability on themselves or to protect an ally—and any effects triggered by the critical hit are also canceled. [6] X Research source Similarly to Eyes of the Grave, your cleric can use this ability a number of times equal to their Wisdom modifier (with a minimum of once) and regains all expended uses after a long rest. Critical hits can be devastating, especially when an ally is already unconscious or close to unconsciousness—so this can be a super helpful ability."
    },
    {
      "title": "Potent Spellcasting",
      "content": "Potent Spellcasting At the 8th level, your Grave cleric’s cantrips become stronger and capable of dealing more damage. You can add your cleric’s Wisdom modifier to the damage you deal with any cleric cantrip. [7] X Research source For example, Sacred Flame is a cleric cantrip that normally deals 1d8 radiant damage. If your cleric’s Wisdom modifier is a +4, you’d deal 1d8 + 4 radiant damage with this feature."
    },
    {
      "title": "Keeper of Souls",
      "content": "Keeper of Souls Grave clerics can use the essence of dying souls to heal living creatures. At the 17th level, you can automatically choose to heal either your own cleric or an ally within 30 feet when you see an enemy die (also within 30 feet). The chosen creature immediately regains hit points equal to the enemy’s number of hit dice. [8] X Research source This ability is unique among other cleric subclasses (and classes) because it heals without resources, actions, reactions, or spell slots, which is incredibly valuable. This feature can only be used when your Grave cleric isn’t incapacitated—and once used, it can’t be triggered again until the start of your cleric’s next turn."
    },
    {
      "title": "Prioritize Wisdom, Constitution, and Dexterity for Grave clerics.",
      "content": "Prioritize Wisdom, Constitution, and Dexterity for Grave clerics. Cleric spellcasting relies on Wisdom (WIS), so it’s the most vital stat for a Grave cleric (as they heavily rely on spells). The 2nd-highest stat should be Constitution (CON), which helps with overall health and concentration. Dexterity (DEX) should be 3rd since it can boost armor class. Strength (STR), Charisma (CHA), and Intelligence (INT) are the least important for Grave clerics. [9] X Research source Example (Standard Array): STR 10, CON 14, DEX 13, INT 8, WIS 15, CHA 12 Example (Manual Rolled): STR 10, CON 15, DEX 13, INT 12, WIS 17, CHA 8 Example (Point Buy): STR 8, CON 15, DEX 14, INT 8, WIS 15, CHA 10"
    },
    {
      "title": "Variant humans, shadar-kai, and fairies are solid races for a Grave cleric.",
      "content": "Variant humans, shadar-kai, and fairies are solid races for a Grave cleric. Generally, variant human is always a wise choice for any class because it comes with a free feat and additional skill at level 1. Beyond that, shadar-kai (elves dwelling in the Shadowfell) and fairies (tiny fey creatures with innate magic) make excellent Grave clerics as well. [10] X Research source Shadar-kai have a natural affiliation with death and, by association, the Grave domain, because they worship the Raven Queen. Shadar-kai also have innate abilities that work well with the Grave domain, including the Blessing of the Raven Queen (which is a short-range teleport ability), proficiency in Perception checks, and resistance to necrotic damage. Fairies have a natural flying speed, which is useful for any class and adds to a Grave cleric’s mobility. They also have innate fairy magic that isn’t normally available to clerics. However, fairies can’t wear heavy armor—so if you choose this route, give your fairy grave cleric a little extra Dexterity to make up for the lack of heavy armor."
    },
    {
      "title": "The best Grave cleric backgrounds should buff their Wisdom skills.",
      "content": "The best Grave cleric backgrounds should buff their Wisdom skills. Similarly, Intelligence proficiencies (especially Religion) can also help clerics since they’re holy warriors and spellcasters with divine powers. Backgrounds determine the cleric’s past and what they did before becoming an adventurer; the following backgrounds work well for Grave clerics: [11] X Research source Acolyte . This offers proficiencies in Insight and Religion, which are usually key skills for a cleric. It also lets your cleric learn two languages. Faction Agent . This comes with Insight proficiency and a Wisdom, Intelligence, or Charisma skill proficiency of your choice. This can help your cleric get as many Wisdom skills (like Perception or Survival) as possible. Hermit . This grants proficiency in Medicine and Religion, which are Wisdom and Intelligence-based skills that can be useful for clerics."
    },
    {
      "title": "Certain feats can make Grave clerics even more powerful.",
      "content": "Certain feats can make Grave clerics even more powerful. In D&D 5e, feats are optional abilities you can give your character when they level up. When it comes to Grave domain clerics, there are plenty of feats that can play into the abilities they already have and amplify their strength, making them more formidable both in and out of battle. For example: [12] X Research source Fey-Touched. This feat grants a free Misty Step spell (which gives Grave clerics a short-range teleportation they wouldn’t otherwise have) and a free 1st-level divination or enchantment spell. Consider taking this feat early at level 4. Telekinetic. This feat grants you utility abilities (a ranged shove and the mage hand cantrip) that don’t require a spell slot and a +1 Intelligence, Wisdom, or Charisma increase. This could also be a useful early feat at level 4. Ability Score Improvement. By level 8, consider foregoing a formal “feat” and simply bumping up your cleric’s Wisdom score by +2 (ideally capping their Wisdom at 20 total). If you do this again (at level 19, for example), consider giving your cleric a +2 bonus to Constitution (or add more to their Wisdom if possible). Resilient: Constitution. This feat gives Grave clerics an extra buff to their concentration spells (since concentration relies on Constitution) while improving their hit point total. Aim to take this feat by level 12. War Caster. The War Caster feat lets you swap opportunity attacks for spells and grants advantage on concentration checks, which are both very handy for a Grave cleric. Try taking this feat by level 16."
    },
    {
      "title": "Grave clerics should have a mix of healing, combat, and utility spells.",
      "content": "Grave clerics should have a mix of healing, combat, and utility spells. Some cleric subclasses are better suited for a mix of melee combat and spellcasting, but Grave clerics generally excel at spellcasting alone. So, giving them a wide range of spells (especially healing spells, since they specialize in healing) as well as damage-dealing spells and buffs for allies makes Grave clerics especially effective. [13] X Research source Healing spells: Healing Word, Aura of Vitality, Aid, Mass Healing Word, Mass Cure Wounds, and Heal Damage-dealing spells: Toll the Dead, Spiritual Weapon, Spirit Guardians, Harm, and Fire Storm Buff and utility spells: Guidance, Bless, Enhance Ability, Scrying, and Holy Weapon"
    },
    {
      "title": "Scale mail and half-plate are ideal armor types for a Grave cleric.",
      "content": "Scale mail and half-plate are ideal armor types for a Grave cleric. Half-plate is decent medium armor, which makes it ideal for Grave clerics; it raises their base armor class to 15 while letting them get a bonus from their Dexterity modifier. However, you’re unlikely to get half-plate at level 1, so consider taking scale mail (another medium armor) to start with and getting half-plate as soon as possible. [14] X Research source Grave clerics don’t need to worry about weapons much because they’re a spellcasting-focused subclass. All clerics are proficient with simple weapons (maces, spears, quarterstaffs, daggers, light hammers, and so on). So long as you equip your cleric with 1 simple weapon, that should be enough for them!"
    },
    {
      "title": "Grave clerics are strong enough that they don’t need to multiclass.",
      "content": "Grave clerics are strong enough that they don’t need to multiclass. If you’re just looking to optimize your Grave cleric, multiclassing may not help with that; multiclassing (which means taking additional levels in other classes) can actually block access to a Grave cleric’s most powerful spells. However, if you want to multiclass for the fun of it, that’s your choice—so go for it! [15] X Research source For example, if you think it’d be cool to give your cleric a little extra firepower in melee combat, you could take two levels in fighter for proficiency in Constitution saves, heavy armor, and the Action Surge ability."
    },
    {
      "title": "Yes, the Grave domain is especially useful for its healing abilities.",
      "content": "Yes, the Grave domain is especially useful for its healing abilities. If you’re looking to play a spellcasting-focused cleric who specializes in ranged spells and healing abilities that can pull any ally from the brink of death, the Grave domain might be a great choice for you. It’s not the strongest cleric subclass altogether, but its healing and spellcasting abilities make it formidable nonetheless. [16] X Research source"
    }
  ]
}