{
  "url": "https://www.wikihow.com/Predict-Height",
  "title": "How to Predict Height",
  "steps": [
    {
      "title": "Use the Gray Method for unborn children and children up to age four.",
      "content": "Use the Gray Method for unborn children and children up to age four. It involves combining the parents’ heights, adjusting for child gender (the Mid-Parent Rule), and dividing by two. This method derives from a 1948 article by Horace Gray in the journal Child Development, [1] X Research source Gray H. “Prediction of Adult Stature.” Child Development 1948; 19, 3: 167-75. and is still in widespread use today. The margin of error is +/- 4 inches (10.2 cm), which may seem like a large amount (consider the difference of ending up either 5'2\" or 5'10\"), but is indicative of the difficulty of accurately predicting height in the face of so many variables."
    },
    {
      "title": "Measure the heights of the father and mother.",
      "content": "Measure the heights of the father and mother. The method works in either inches or centimeters."
    },
    {
      "title": "For a female child, reduce the father's height by one-thirteenth (12/13 of actual height).",
      "content": "For a female child, reduce the father's height by one-thirteenth (12/13 of actual height). For a male child, increase the mother's height by one-twelfth (13/12 of actual height). [2] X Research source For instance, if the father of a female child is 69 inches (180 cm), multiply by 12, then divide by 13, for an adjusted result of 63.7 inches. Likewise, if the mother of a male child is 63 inches (160 cm), multiply by 13, then divide by 12, for an adjusted result of 68.3 inches."
    },
    {
      "title": "Add the adjusted height of one parent to the non-adjusted height of the other.",
      "content": "Add the adjusted height of one parent to the non-adjusted height of the other. In the instance of a female child, with a father at 69 inches (180 cm) (adjusted to 63.7) and a mother at 63 inches (160 cm), the sum is 126.7 inches. For a male child, the sum is 69 in. (father) + 68.3 in. (adjusted mother) = 137.3 inches (348.7 cm)."
    },
    {
      "title": "Divide the sum by two to estimate the child's final height.",
      "content": "Divide the sum by two to estimate the child's final height. Using the examples in the last step, example 1 (female child) is 126.7 / 2 = 63.4 inches (161 cm), and example 2 (male child) is 137.3 / 2 = 68.7 inches (174.5 cm)."
    },
    {
      "title": "Put it all together.",
      "content": "Put it all together. Thus, a female child whose father is 69 inches (180 cm) tall and mother is 63 inches (160 cm) tall is predicted to reach 63.4 inches (161 cm) (5'3\"). Likewise, a male child with parents the same height is predicted to reach 68.7 inches (174.5 cm) (5'9\"). The formulas: ((69 x 12 / 13) + 63) / 2 = 63.3 [female child]; (69 + (63 x 13 / 12)) / 2 = 68.7 [male child]. There are also websites that will do the calculations for you if you enter the required heights. Remember that with the range of accuracy in this method, the female child in the example above could reasonably expect to reach between 59.3 and 67.3 inches, based on assorted genetic and environmental factors."
    },
    {
      "title": "Use simpler variations, if preferred.",
      "content": "Use simpler variations, if preferred. There are variations to the Gray Method that skip the 12/13 adjustment and simply add then divide by 2 the parents' heights, then add 3 or 5 inches (7.6 or 13 cm) for a male child or subtract 3 or 5 inches (7.6 or 13 cm) for a female child. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The results end up roughly similar to the original method. Thus, for a female child, ((69 + 63) / 2) - 3 = 63 inches (160 cm), or ((69 +63) / 2) -5 = 61 inches. Or, for a male child, ((69 + 63) / 2) + 3 = 69 inches (180 cm), or ((69 + 63) / 2) + 5 = 71 inches."
    },
    {
      "title": "Double the height of a female child at 18 months or a male at 2 years.",
      "content": "Double the height of a female child at 18 months or a male at 2 years. This is probably the simplest method possible, based strictly on the child’s height at an early age. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For instance, a female child who is 32 inches (81.3 cm) at 18 months would be predicted to reach 64 inches (160 cm) (5’4”), while a male child who is 36 inches (91.4 cm) at 2 years would be predicted to reach 72 inches (180 cm) (6'). The +/- 4 inch (10.2 cm) margin of error stands for this method as well."
    },
    {
      "title": "Employ the Khamis-Roche Method.",
      "content": "Employ the Khamis-Roche Method. This method derives from a 1994 journal article, [5] X Research source Khamis HJ, Roche AF. “Predicting Adult Stature Without Using Skeletal Age: the Khamis-Roche Method.” Pediatrics 1994; 94: 504-7. and relies on a more complex scaling of equations based on six factors: sex of the child; mother’s height; father’s height; child’s height; child’s weight; and child’s age. This method is recommended for children ages 4 and above. Unless you really want to test your math skills, rely on a website calculator to make this determination. For example, a 40-inch, 45-pound, 4-year old female child, with a mother at 63 inches (160 cm) and father at 69 inches, is predicted to reach 63 inches (160 cm) (5’3”). The 90% margin of error for this method is approximately 2 inches (5.1 cm), meaning 90% of children with the above criteria would reach between 61 and 65 inches."
    },
    {
      "title": "Have the child’s “bone age” determined by x-ray.",
      "content": "Have the child’s “bone age” determined by x-ray. This method originated in 1959, [6] X Research source Greulich WW, Pyle SI. Radiographic Atlas of Skeletal Development of the Hand and Wrist, 2nd edition. Stanford, CA: Stanford University Press, 1959. and has been updated several times. It involves taking an x-ray of the child’s left hand, fingers, and wrist, and using a comparison of bone age to chronological age. This one is obviously not a do-at-home prediction method. Discuss your interest in this method with your child’s physician. This method is considered somewhat (but not substantially) more accurate than the Khamis-Roche Method."
    },
    {
      "title": "Use what is sometimes called the “Lauren Method” for females age 8-16 and males age 9-18.",
      "content": "Use what is sometimes called the “Lauren Method” for females age 8-16 and males age 9-18. [7] X Research source Khamis-Roche and bone age methods can also be used for children in this age range. Released in 2005, [8] X Research source this method utilizes the child’s sex, date of birth, date of test, height, sitting height, and weight. There are online calculators for this method as well. For example, a female child born May 5, 2003; tested May 5, 2015; height 63 inches (160 cm); sitting height 49 inches; weight 120 pounds; can expect to reach 64.7 inches (164.3 cm) (5’5”)."
    },
    {
      "title": "Temper your expectations, even for older children.",
      "content": "Temper your expectations, even for older children. Even these methods used on teenagers who are nearing their final heights retain a margin of error. There are so many factors in final height that no prediction method can be entirely accurate. Growth spurts vary in occurrence and duration, environmental factors can change, and so on. The only way to know for sure is to wait and see."
    }
  ]
}