{
  "url": "https://www.wikihow.com/Midnight-Carp-Stardew",
  "title": "How to Catch Midnight Carp in Stardew Valley: Location Guide",
  "steps": [
    {
      "title": "Midnight Carp can be found in the mountain lake, 10 PM to 2 AM, in Fall and Winter.",
      "content": "Midnight Carp can be found in the mountain lake, 10 PM to 2 AM, in Fall and Winter. You can also catch this fish in the Cindersap Forest, Forest Farms, Riverland Farms, Wilderness Farms, and Four Corners Farms. Just cast your fishing rod in the water during this time for a chance to reel one in. [1] X Research source Midnight Carp may be found randomly in the Traveling Cart or gifted by a pet cat with max friendship. If you have Ginger Island unlocked, you can catch Midnight Carp from 10 PM to 2 AM in the North or West (freshwater) parts of the island. You can also use Magic Bait to catch Midnight Carp in any weather, time, and season. Note that the Midnight Carp is not needed to complete the Community Center ."
    },
    {
      "title": "Midnight Carp can be gifted to villagers.",
      "content": "Midnight Carp can be gifted to villagers. Since no villagers love or like this gift, it's not recommended. However, you can give Midnight Carp as a neutral gift to Demetrius, Elliott, Leo, Linus, Pam, Sebastian, and Willy. Neutral gifts give 20 friendship points on a normal day, 100 points during the Winter Star Festival, and 160 points during birthdays."
    },
    {
      "title": "Use Midnight Carp to cook recipes.",
      "content": "Use Midnight Carp to cook recipes. There are four cooking recipes total that can use Midnight Carp: Maki Roll Quality Fertilizer Sashimi Seafoam Pudding"
    },
    {
      "title": "Midnight Carp can be used in a Fish Pond.",
      "content": "Midnight Carp can be used in a Fish Pond. When the capacity is increased to 10, the primary output will be Midnight Carp Roe, with a small chance of River Jelly."
    },
    {
      "title": "Use Midnight Carp to make a Fishing Vest.",
      "content": "Use Midnight Carp to make a Fishing Vest. You can use the Sewing Machine in Emily's and Haley's house along with some Cloth . Midnight Carp can also be used as an iridium dye."
    },
    {
      "title": "Midnight Carp is used in two quests.",
      "content": "Midnight Carp is used in two quests. These quests can be found at the \"Help Wanted\" board outside of Pierre's store or at the Special Orders board near the Lewis' house."
    }
  ]
}