{
  "url": "https://www.wikihow.com/Burn-Trash",
  "title": "How to Burn Trash",
  "steps": [
    {
      "title": "Separate your recyclables from the rest of your trash.",
      "content": "Separate your recyclables from the rest of your trash. Sort through your trash and remove anything that can be recycled. Recycling services are becoming more widespread than ever. There are many resources that can help you find a recycling facility, or a drop-off location, to recycle everything from plastics to electronics. The following items should be recycled instead of burned: [1] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Cardboard Glass Plastic bottles and bottle caps Plastic jugs Paper printed with standard ink Electronics Metal beverage cans Scrap metal"
    },
    {
      "title": "Remove anything that will create toxic smoke from your trash.",
      "content": "Remove anything that will create toxic smoke from your trash. There are things that may be in your trash that would be extremely toxic or dangerous to burn. These materials are harmful to you and are harmful to the environment. Never burn the following materials: Toxic chemicals (drop-off instead) Plastic and rubber. Burning plastic and rubber releases many chemicals, including dioxins, which are toxic to humans and harmful to the environment. [2] X Research source Magazines. The ink used in magazines is toxic when burned. Aerosol cans. Aerosol cans are highly pressurized, and can explode when exposed to high temperatures. [3] X Research source Coated, painted, and pressure-treated wood. A wide variety of chemicals are used when painting or treating wood, and many of them are toxic."
    },
    {
      "title": "Burn untreated paper and yard trimmings safely.",
      "content": "Burn untreated paper and yard trimmings safely. There are some items of trash that you can burn without exposing yourself or your environment to excessively toxic smoke. The following items burn easily, and do so without producing excessively dangerous smoke: Non-recyclable cardboard. Cardboard that has been coated with wax generally cannot be recycled unless specific recycling facilities explicitly accept them. Do not burn plastic-coated paper — make sure you know what the paper is coated with. Non-recyclable paper. [4] X Research source Yard debris. Dried grass, tree branches, and dead leaves can all burn safely. [5] X Research source Alternatively, compost them."
    },
    {
      "title": "Research your local laws about backyard burning.",
      "content": "Research your local laws about backyard burning. Many states and municipalities have passed laws about what, how, and when you can burn your trash. Other places have banned it outright. Refer to your state and local governments or reach out to local fire departments and learn what restricts on backyard burning exist in your area. You should also learn what penalties you may face for breaking those restrictions."
    },
    {
      "title": "Select a spot in a clearing.",
      "content": "Select a spot in a clearing. Pick a place to burn your trash where the space above you is clear of any tree limbs, buildings, vehicles, or power and phone lines. Ashes and sparks from your fire may fly up and ignite whatever is above your fire. [6] X Research source"
    },
    {
      "title": "Utilize a burn barrel if you want to control your fire's smoke.",
      "content": "Utilize a burn barrel if you want to control your fire's smoke. Burn barrels, a type of backyard incinerator, are easy to set up, and help control the amount of smoke and ash that a fire produces. They also provide a place to store ashes and debris after you burn your trash. To set up a burn barrel, turn 2 cinder blocks on their side, and place a 55 gallons (210 L) steel drum on top. To allow airflow into the drum, drill at least 20 1 inch (2.5 cm) wide holes around the entire drum, spacing them evenly around the height and circumference of the barrel. If you’re going to leave your burn barrel in place for a while, you may want to drill a few holes into the bottom to let rainfall run out. [7] X Research source Burning plastics is already dangerous, but you should never burn plastic in burn barrels. Burn barrels and other backyard incinerators trap the dioxins produced by burning plastic in the immediate area around the fire. This means you and others are more likely to breathe them in. [8] X Research source"
    },
    {
      "title": "Build a fire pit to contain your fire without a burn barrel.",
      "content": "Build a fire pit to contain your fire without a burn barrel. If you don't want to use a burn barrel, you can set up a fire pit instead. Fire pits are small areas in your yard where you’ve cleared away any grass, twigs and branches, and other materials that might catch on fire unintentionally. Burning your trash is a fire pit is an easy way to watch the fire and control its size. Clear a space at least 3 feet (0.91 m) in diameter of all flammable materials. Use a rake, hoe, or shovel to clear away the grass. Make an 8 to 10 inches (20 to 25 cm)wide depression in the middle of your pit. This will help any coals or embers stay near the center of your fire. Line the outside of your fire pit with rocks. The rocks will help retain the heat of the fire, and will provide a safe place for any ashes or embers to land. [9] X Research source"
    },
    {
      "title": "Wait for calm, wet weather to burn your trash.",
      "content": "Wait for calm, wet weather to burn your trash. Do not burn trash in windy conditions or while your area is under a drought. This increases the chances of a stray ember from your fire igniting the trees or grass around you. [10] X Research source Never burn trash if the weather forecast is predicting 20 miles (32 km) per hour gusts of wind. [11] X Research source"
    },
    {
      "title": "Plan to burn your trash when the air quality is good.",
      "content": "Plan to burn your trash when the air quality is good. If the air in your region is unsafe to breathe, you do not want to add more smoke to the atmosphere. Check your local weather forecast to see if the local air quality is good before burning your trash. [12] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source The EPA has created a scale to monitor air quality, with 6 different stages ranging from \"good\" as the best quality to \"hazardous\" as the worst quality. You should only burn trash when the air quality is considered good. [13] X Research source"
    },
    {
      "title": "Keep a fire extinguisher at your side.",
      "content": "Keep a fire extinguisher at your side. Before you start to burn your trash, make sure you will be able to put the fire out in an emergency. Keep a large fire extinguisher at your side, or burn your trash within reach of your garden hose. If nothing else, have several large buckets of water ready. [14] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Set up your burn pile.",
      "content": "Set up your burn pile. Place your trash in your burn barrel, or fire pit. Unless you are burning a very small amount of trash, you should not burn it all at once. In a burn barrel, you can safely burn 1 full trash bag at a time. [15] X Research source In a fire pit, you want to keep your piles of burning material small, no more than 2 feet (0.61 m) high, and keep the pile centered in the middle of your fire pit. [16] X Research source If you have a lot of trash to burn, save some to add to the fire later."
    },
    {
      "title": "Light the fire.",
      "content": "Light the fire. Once you have placed your trash in your burn barrel or fire pit, set some kindling at the base of your pile. Pick a spot where it can easily catch the rest of the trash on fire. Use a fireplace match or a utility butane lighter, the kind with a long neck, to ignite the kindling while keeping your hands at a safe distance. Paper towel rolls filled with dryer lint, and cardboard or newspapers soaked in candle wax make excellent kindling. [17] X Research source Do not use a chemical accelerant to help start your fire. [18] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source"
    },
    {
      "title": "Do not leave the fire unattended.",
      "content": "Do not leave the fire unattended. Stay near your burn barrel or fire pit as long as the fire is still active. Watch the fire and pay attention to the direction that the smoke is traveling. If it looks like the wind is getting faster, or if the smoke keeps carrying sparks and ashes towards your house, trees, or any other fire hazard, you should let your fire die out, even if there is trash left over."
    },
    {
      "title": "Add more of your trash to the fire as it cools down.",
      "content": "Add more of your trash to the fire as it cools down. If you still have trash to burn, and if conditions are still safe, add the trash to the burn pile after the fire has dwindled, and when the flames have cooled down. Stand back, and gently toss or drop pieces of trash onto the pile. Be prepared for additional smoke, ashes, and sparks to fly out of the fire. If you can't tell if a fire has cooled just by feeling the heat, then you can tell by the color of the flames. Blue, white, and reddish-white flames are hotter than dark red and orange flames. [19] X Research source If you're burning trash in a fire pit, you can place the trash onto the ground and push it towards the fire with a metal shovel or rake. You should always be in control of your fire. [20] X Research source"
    },
    {
      "title": "Extinguish the fire once it has reduced down to ashes.",
      "content": "Extinguish the fire once it has reduced down to ashes. Once all of your trash has been burned, wait for the fire to die down. Even small fires can be reignited with a gust of wind, so you will need to make sure the fire is completely out before you leave. Once all that's left of the fire is glowing ashes, douse or smother the fire. To put out a fire in a burn barrel, slowly pour water onto the ashes. With a large stick, or with a metal shovel or rake, mix the ashes with the water. Add more water, and mix again. Keep adding water until you’re certain all of the embers have gone out. [21] X Research source To put out a fire in a fire pit, you can extinguish it with water. Alternatively, you can use a large stick, or a metal shovel or rake to mix the ashes and coals in with the dirt at the bottom of the fire pit. [22] X Research source"
    }
  ]
}