{
  "url": "https://www.wikihow.com/Reset-a-GE-Dishwasher",
  "title": "How to Reset a GE Dishwasher",
  "steps": [
    {
      "title": "Press the Start/Reset button to cancel the cycle.",
      "content": "Press the Start/Reset button to cancel the cycle. If your machine is malfunctioning mid-cycle or you forgot to add a dish, you’ll need to reset the cycle. For front-control washers, press the Start/Reset button. If you have a top-control washer, carefully open up the top of the dishwasher door and press Start/Reset, then close the door. [1] X Research source Dishes can be added at any point up until the main wash."
    },
    {
      "title": "Wait 2 minutes while the water pumps out.",
      "content": "Wait 2 minutes while the water pumps out. Make sure to wait before opening the machine and adding dishes. During this time, you may see a blinking light, which means that the machine is resetting. Make sure the light has stopped blinking before starting up the machine again. [2] X Research source"
    },
    {
      "title": "Unlatch the door carefully and load any additional dishes.",
      "content": "Unlatch the door carefully and load any additional dishes. Be careful of any hot steam or water. Place any extra dishes in the dishwasher and start a new cycle by pressing the Start button again and push the door closed until it latches. [3] X Research source"
    },
    {
      "title": "Use the reboot as a last resort.",
      "content": "Use the reboot as a last resort. Since this is a hard reset, you shouldn’t perform a reboot on your machine too regularly. Always try the Start/Reset button first. If that does not work and the machine will not reset, try rebooting the dishwasher."
    },
    {
      "title": "Unplug the unit to cut the power.",
      "content": "Unplug the unit to cut the power. If you can access the cord, carefully unplug it from the power source. This will completely reboot the unit and should fix any problems with the machine. [4] X Research source"
    },
    {
      "title": "Turn off the unit’s power from your home’s circuit breaker or fuse box.",
      "content": "Turn off the unit’s power from your home’s circuit breaker or fuse box. If you don’t have easy access to the machine’s cord, you can also cut power from the main power control. If your circuit breaker or fuse box isn’t close by, this may require some walking back and forth. Make sure to only cut power to that outlet, not other areas of your house. [5] X Research source"
    },
    {
      "title": "Wait for 30 seconds to 10 minutes before turning the power back on.",
      "content": "Wait for 30 seconds to 10 minutes before turning the power back on. While GE suggests that you wait only 30 seconds before plugging it in or turning the power on again, sometimes your machine may need a longer break. [6] X Research source Keep the power off for up to 10 minutes, then restore power. Your machine should be back to normal. [7] X Research source"
    }
  ]
}