{
  "url": "https://www.wikihow.com/Erase-Your-Nintendogs-Game",
  "title": "How to Erase Your Nintendogs Game",
  "steps": [
    {
      "title": "Put your Nintendogs game into your DS.",
      "content": "Put your Nintendogs game into your DS. Turn on your DS and click on your Nintendogs game above (or if you set your DS to auto mode, skip this step)."
    },
    {
      "title": "Hold down the buttons L, R, A, B, Y, X when the white Nintendo screen appears.",
      "content": "Hold down the buttons L, R, A, B, Y, X when the white Nintendo screen appears. If the game loads before you press the buttons, this will not work. The buttons must all be held down simultaneously to reset the game. Try using the sides of your fingers if you're having trouble holding them all down at the same time."
    },
    {
      "title": "Select \"Yes\" when it asks if you want to delete your current Nintendogs game.",
      "content": "Select \"Yes\" when it asks if you want to delete your current Nintendogs game. Remember that once you delete the game, you will lose your dogs, trainer points, and money. Once the file has been deleted, there is no way to get these things back. Make sure you really want to lose all your progress. Click \"Yes\" and your game will be deleted. You can now begin a brand new game, as though you just took it out of the box. If you change your mind, just click \"No\" and you can continue your game."
    },
    {
      "title": "Remove the Micro SD card from the R4 card.",
      "content": "Remove the Micro SD card from the R4 card. The Micro SD card is the smaller card that is inserted into the upper left corner of the R4 card."
    },
    {
      "title": "Insert the Micro SD card into the Micro SD card reader.",
      "content": "Insert the Micro SD card into the Micro SD card reader. The card reader looks like a regular USB drive that connects to your computer, only it has a port for your Micro SD card on one end. This should have come in the package with your R4 card."
    },
    {
      "title": "Plug the Micro SD card reader into the USB port of your computer.",
      "content": "Plug the Micro SD card reader into the USB port of your computer. A window will pop up with different options--select \"Open folder.\" From there, open the \"Games\" folder and find the nintendogs sav. file."
    },
    {
      "title": "Drag the sav.",
      "content": "Drag the sav. file into the trash to erase your game. You will lose all your saved progress--your dogs, money, trainer points, and items you have purchased. Make sure you really want to lose all those things before deleting the file!"
    },
    {
      "title": "Eject the USB drive and replace your Micro SD card in the R4 card.",
      "content": "Eject the USB drive and replace your Micro SD card in the R4 card. Return the R4 to your DS and open Nintendogs. Your game will be gone and you can start all over."
    }
  ]
}