{
  "url": "https://www.wikihow.com/Connect-Outlook-to-Hotmail",
  "title": "How to Connect Outlook to Hotmail",
  "steps": [
    {
      "title": "Click on Start.",
      "content": "Click on Start . This is the Windows orb located at the lower left of the task bar. It is the windows icon inside a blue circular orb."
    },
    {
      "title": "Type in “Microsoft Outlook” in the search bar below (without the quotes).",
      "content": "Type in “Microsoft Outlook” in the search bar below (without the quotes)."
    },
    {
      "title": "Click on Microsoft Outlook from the results to launch it.",
      "content": "Click on Microsoft Outlook from the results to launch it."
    },
    {
      "title": "Start the start-up wizard.",
      "content": "Start the start-up wizard. When launching Outlook, the start-up wizard should start. Click on the “Next” button at the lower right of the start-up window."
    },
    {
      "title": "Tick the circle beside “Yes” on the next screen.",
      "content": "Tick the circle beside “Yes” on the next screen. Do this when Outlook asks you if you want to configure an e-mail account. Then click “Next” again."
    },
    {
      "title": "Tick on “Manually configure server settings” check box at the lower left of the next screen.",
      "content": "Tick on “Manually configure server settings” check box at the lower left of the next screen. Then click “Next.”"
    },
    {
      "title": "Click on “Other.",
      "content": "Click on “Other. ” Then select “Microsoft Office Outlook Connector” and click “Next.” This should let you configure the e-mail account you want; in your case, it is Hotmail."
    },
    {
      "title": "Enter your Hotmail e-mail address in the first address field.",
      "content": "Enter your Hotmail e-mail address in the first address field."
    },
    {
      "title": "Key in your password for Hotmail.",
      "content": "Key in your password for Hotmail."
    },
    {
      "title": "Type in the name you want to assign for the Hotmail account.",
      "content": "Type in the name you want to assign for the Hotmail account. For example, “Marketing,” “School,” etc. Make sure “Remember my password” is checked because it will make logging in again later automatic."
    },
    {
      "title": "Click the “Okay” button.",
      "content": "Click the “Okay” button. Then click “OK” again when Outlook informs you that it will only apply when Outlook is restarted. At this point, the setup will have been completed."
    },
    {
      "title": "Upgrade the Outlook Connector.",
      "content": "Upgrade the Outlook Connector. Outlook will then inform you if the Connector needs to be upgraded. Having an upgraded connector ensures that you have the most recent features available on the Outlook connector. You can select “Remind me later” if you want to use Outlook right away. If you choose to upgrade later, Outlook will then remind you at a later time. You can still read, send, and receive e-mails on your Hotmail account through Outlook without upgrading, but you will be missing out on new features if your connector isn't up-to-date. If you choose to upgrade, an installation wizard will appear, and it will guide you through the setup process. Click “OK” when Outlook prompts you that it will close to begin the upgrade process."
    },
    {
      "title": "Click on “I accept the terms” tick box.",
      "content": "Click on “I accept the terms” tick box. This will activate the “Install” button below it."
    },
    {
      "title": "Click “Install” to begin the upgrade.",
      "content": "Click “Install” to begin the upgrade. Press “Next” on the following screens as these are all default configurations that you shouldn't worry about. During the installation, you will see a progress bar; just wait for the installation to finish."
    },
    {
      "title": "Press “Finish” to wrap up the installation.",
      "content": "Press “Finish” to wrap up the installation."
    },
    {
      "title": "Repeat steps in launching Microsoft Outlook to restart the program.",
      "content": "Repeat steps in launching Microsoft Outlook to restart the program. At this time, the Hotmail account name you set earlier should appear in the Outlook inbox, which is under “All Mail” items at the left panel."
    },
    {
      "title": "Click on “Mail” at the left panel.",
      "content": "Click on “Mail” at the left panel. The Outlook Calendar alone should appear. On the left panel, a tick box should be under Outlook Calendar with the name of the Hotmail account you set and its calendar. Tick the box, and your Hotmail calendar should appear beside the Outlook calendar tab."
    }
  ]
}