{
  "url": "https://www.wikihow.com/Add-a-Spouse-to-Health-Insurance",
  "title": "Adding Your Spouse to Your Health Insurance Plan",
  "steps": [
    {
      "title": "Understand what consolidating health insurance means.",
      "content": "Understand what consolidating health insurance means. Most health insurance offered by employers allows the employee to add coverage for a spouse (and/or dependent child). Extra premiums are usually involved, some of which may be paid for by the employer. If both you and your spouse work, and you both have health insurance, it may be worth consolidating your health coverage via only one employer."
    },
    {
      "title": "Know what to compare between plans.",
      "content": "Know what to compare between plans. Before selecting one health insurance plan over another, compare several specific factors about both plans to determine which plan is the least expensive AND most valuable. When comparing plans, compare the combined costs of the two plans you pay for now (plan A and planB) to the increased costs of either plan with a spouse added (planA+spouse and planB+spouse). For example, compare planA+planB to plan A+spouse, and compare planA+planB to planB+spouse. Whichever of the three options is the least expensive, but provides the most coverage, is the option you should choose. Some of the specific factors to consider are: The out-of-pocket expenses that each plan could generate for you. The level and types of services and coverages offered by the plan. Coverage for dependent children, if applicable."
    },
    {
      "title": "Compare out-of-pocket expenses between plans.",
      "content": "Compare out-of-pocket expenses between plans. Out-of-pocket expenses are any costs YOU would have to pay somehow. These are the costs not covered by either your employer or the plan yourself. Every health insurance plan has some out-of-pocket expenses to consider. Premiums — Some premiums are covered entirely or partly by the employer. Compare the actual premium costs you have to pay between the plans. In some cases your employer may pay the employee's premiums, but not the additional spousal premiums. Deductibles — Deductibles are any of the partial costs you have to pay for a specific service before the insurance company will reimburse you the rest. For example, your insurance may only cover 80% of your prescription costs, therefore 20% of those costs are out-of-pocket. Plan Maximums — Each portion of every health insurance plan usually has an annual and lifetime maximum you can be reimbursed for. For example, your insurance plan may cover massage therapy up to $1,000 per year. If you plan to go above the maximum of any portion of your plan, take that into account as an out-of-pocket expense. Co-payments — Co-payments are similar to deductibles. They are the out-of-pocket expenses you have to pay up front to see a doctor or specialist. Some health insurance plans have different levels of co-pays based on who the coverage is for (e.g. employee vs. spouse), how many times you've been so far that plan year, and if it's a family doctor versus a specialist. Spousal Surcharges — Some employers have added a surcharge to their health insurance plans when a spouse, who already has health insurance, wants to be added to the plan. Therefore, if your spouse already has health insurance through their employer, it may cost extra to add them to your plan."
    },
    {
      "title": "Look at the levels of coverage provided by both plans.",
      "content": "Look at the levels of coverage provided by both plans. In addition to the costs associated with each option, you should consider the actual coverage offered by each option. One option might be more expensive, but may offer significantly more coverage. Be sure to review what choices you have for doctors and hospitals under each plan, including whether you're able to see an out-of-plan doctor if you so choose (if this is allowed, the co-pay is likely higher). Look at what the minimum level of coverage is for hospital visits (e.g. private room vs. ward, etc.). Compare therapeutic items that are and are not covered by each plan. If you know you have to go to physiotherapy for 6 months, and it isn't covered by one option, take that into account. Determine what types of prescription and non-prescription medications are covered. Some plans only cover generic drugs, others will cover the cost of brand name drugs. Some plans have a limit on the pharmacy service charge they'll cover. Some plans will cover non-prescription drugs."
    },
    {
      "title": "Determine how and if dependent children are covered.",
      "content": "Determine how and if dependent children are covered. Even if you do not have dependent children at the moment, take into consideration if you're planning to have children in the future. While a new baby is usually one of the reasons you're allowed to change your health insurance coverage mid-year, if you can take care of it now, you may save yourself some time in the future. Also take into account what sort of pregnancy and maternity items are covered by both plans if you're planning to get pregnant in the near future."
    },
    {
      "title": "Know your rights.",
      "content": "Know your rights. The United States government has made it law that health insurance companies must allow a special enrollment period when qualifying life events have occurred. These life events can include getting married and losing other insurance coverage (among other things). If you, as the employee, get married, you are allowed a special enrollment period so you can add your spouse to your employer health insurance plan. If your spouse, who is not the employee, has lost a job or another type of health insurance coverage, you are allowed a special enrollment period so you can add your spouse to your employer's health insurance plan. In situations like this, you're also permitted the opportunity to change your coverage, or your spouse's existing coverage, on your plan."
    },
    {
      "title": "Look up specific details regarding your plan.",
      "content": "Look up specific details regarding your plan. While employers and health insurance companies must follow government guidelines for their health insurance plans, the processes and procedures can differ between employers, insurers and plans. Determine what the specific process is for your employer and insurance plan. You can find all the details about your specific health insurance plan via your employer's Human Resources department. Most employers or health insurance companies also provide detailed information about their plans on websites. Some of these websites may require a login ID and password in order to access, and it is most likely also the same website where you signed up for your health benefits in the first place. Pay special attention to the period of time you have after your qualifying life event that you have to add your spouse to your insurance plan. You will likely have a minimum of 30 days to submit the change, but some plans will allow up to 90 days. If you miss this time period, you'll have to wait for annual enrollment before you can add your spouse."
    },
    {
      "title": "Obtain required documentation.",
      "content": "Obtain required documentation. Review your employer's or health insurance company's requirements for making changes due to getting married or the loss of other insurance coverage. At the very least they most likely require one or more forms to be completed. Gather all the required documentation and complete all forms as indicated. This documentation will usually include an enrollment change form where you'll select what type of coverage you want for your spouse. You will be able to change your medical (or dental) coverage to include your spouse, but you may also be allowed to add spousal life insurance. Adding life insurance may require a separate form. For a new marriage, you will most likely be required to submit a copy of your marriage license or certificate. For the loss of your spouse's health insurance coverage, you may have to submit a letter from your spouse's employer outlining when coverage was reduced or ended. This may include a termination letter if that was the reason why coverage was lost. Once you have all the required documentation completed, submit it to your employer or insurance company for processing."
    },
    {
      "title": "Be aware of when coverage takes effect.",
      "content": "Be aware of when coverage takes effect. Coverage for your spouse under your employer's health insurance plan doesn't start immediately. Normally coverage will begin on the first day of the month following your change request. [1] X Research source Be aware that some insurance plans will not cover a spouse who is already in a hospital, nursing home, or other treatment facility until they're discharged. This means there may be a period of time where you will have to pay for their treatment 100% out of your pocket. The only exception to this rule is a newborn baby, who is covered immediately upon birth."
    },
    {
      "title": "Determine if you qualify for the Health Insurance Marketplace.",
      "content": "Determine if you qualify for the Health Insurance Marketplace. The Health Insurance Marketplace, which is also known as the 'exchange' or the 'Obamacare exchange' is where you can shop and sign-up for health insurance if you do not have employer coverage. Only people without employer coverage, Medicaid, Medicare, or Children's Health Insurance Program (CHIP) are able to purchase insurance via the Marketplace. [2] X Research source If you have an employer health insurance plan, but that plan doesn't meet certain minimum requirements, you may be able to purchase health insurance via the Marketplace, but you will have to pay full price."
    },
    {
      "title": "Add a spouse during open enrollment.",
      "content": "Add a spouse during open enrollment. Open enrollment for the Marketplace normally starts November 1st of each year. If you enrol before December 15th, your coverage will begin on January 1st of the following year. If you enrol by January 15th, your coverage will begin February 1st. If you enrol by January 31st, your coverage will begin March 1st. Open enrollment ends on January 31st. [3] X Research source You can only add a spouse after open enrollment has finished if you qualify for a special enrollment period. During open enrollment you'll be asked a number of questions about your income and your household. The income questions are asked to determine how much you will be asked to pay for your plan (those with lower incomes will pay less than those with higher incomes). While the household questions are asked to determine who needs to be covered by the plan. A household is considered someone who is the 'tax filer' plus their spouse and other dependents (if they have any). In order to qualify your spouse under the Marketplace plans, you must be legally married. In order to qualify for any of the cost savings, you and your spouse must file your taxes jointly."
    },
    {
      "title": "Enroll your spouse during a special enrollment period.",
      "content": "Enroll your spouse during a special enrollment period. If you want to add your spouse to your Marketplace plan outside of the open enrollment period, a qualifying life event must have taken place. These events can include getting married or your spouse losing some or all of their health insurance via their employer. [4] X Research source If you have a qualifying life event, you have 60 days from the date of that event to make changes to your Marketplace plan. If you already have a Marketplace plan, and you want to add your spouse, you simply update your existing application. To do this, you'll need to log into your Marketplace online account and select 'Report a life change.' You will then be able to update your application to include new members of your household and change to your insurance coverage. Note that adding a new member of your household may change your eligibility regarding cost savings (if your spouse also has an income). If you do not already have a Marketplace plan, you can start a new application on the Marketplace website to determine if you qualify for a plan. This process will be similar to open enrollment, except that it is happening in the middle of the plan year."
    }
  ]
}