{
  "url": "https://www.wikihow.com/Clean-Ping-Pong-Paddle-Rubber",
  "title": "How to Clean Ping Pong Paddle Rubber",
  "steps": [
    {
      "title": "Clean your paddle after every playing session.",
      "content": "Clean your paddle after every playing session. The ping pong paddle picks up dust, oil, and other residue from your fingers and the ping pong ball as you play. Wipe your paddle with a damp cloth or sponge after every playing session to keep the oil and dirt from building up. This will ensure that the rubber keeps its texture and prevent your paddle from wearing out. [1] X Research source"
    },
    {
      "title": "Dip a sponge or cloth into a bowl of room-temperature water.",
      "content": "Dip a sponge or cloth into a bowl of room-temperature water. Pour 1–2 cups (240–470 mL) of distilled or bottled water into a small bowl. If you use a cloth, opt for a clean cloth made out of a soft fabric. If you’re using a sponge, use a fresh sponge that hasn’t been used for anything else. [2] X Research source You can use regular tap water if you want, but the minerals in tap water may soak into the rubber and change the way it feels over time. Cold water can make your paddle rubber harden and hot water can wear down the rubber, so use room-temperature water to avoid damaging your paddle."
    },
    {
      "title": "Wipe both sides of the paddle away from the handle.",
      "content": "Wipe both sides of the paddle away from the handle. Grip the paddle with the flat side facing up. Place the tip of your sponge or cloth at the bottom of your rubber. Wipe up and away from the handle. Then, lift the sponge or cloth up and make another parallel wipe. Continue doing this until you wipe every portion of the rubber and repeat this process on the other side. [3] X Research source Wiping away from you in a set of parallel strokes will brush any dust or dirt away from the paddle. If you wipe back and forth into the rubber like you’re washing a window or plate, you may trap residue in the rubber. You don’t need to press extremely hard into the rubber to clean it. A gentle wipe is enough."
    },
    {
      "title": "Run a dry cloth over the handle to remove any sweat or oil.",
      "content": "Run a dry cloth over the handle to remove any sweat or oil. You don’t usually need to use abrasive cleaners or water to clean the handle. Grab a clean microfiber cloth and wrap it around the handle. Squeeze the cloth and rub it back and forth around the handle to remove any sweat or oil from your hands. If the handle still feels dirty, use a baby wipe instead of a microfiber cloth."
    },
    {
      "title": "Let your racket air-dry completely before putting it away.",
      "content": "Let your racket air-dry completely before putting it away. Set your racket down on a clean surface and let it air dry. It will typically take 30-60 minutes for the rubber to dry out completely. Once it’s no longer wet, your paddle is clean and ready for the next round of table tennis! [4] X Research source Rubber is pretty resilient when it comes to keeping water out. You don’t need to worry about the water soaking through into your paddle’s wood."
    },
    {
      "title": "Spot clean oily stains with dish soap and water.",
      "content": "Spot clean oily stains with dish soap and water. Pour 1–2 cups (240–470 mL) of water into a small bowl and add a pea-sized drop of dish soap. Mix the water and soap with a spoon. Dip the cloth or sponge into the mixture and rub your oily stain in a soft, circular motion. Then, rub the paddle down with a damp cloth to remove any residue from the soap. [5] X Research source The natural oils in your skin can brush off on the rubber when you handle your paddle. They don’t damage the rubber, but they can make your paddle feel slicker than it should. This changes the way the ball bounces off of your paddle. This is particularly important if you rest 2-3 fingers on the back of your paddle rubber when you’re playing. This style of grip tends to leave a lot of oil on the rubber."
    },
    {
      "title": "Use diluted alcohol to remove larger stains and sticky residue.",
      "content": "Use diluted alcohol to remove larger stains and sticky residue. Fill a small bowl with 2 parts room-temperature water and 1 part rubbing alcohol. Mix the solution together with a spoon to combine the ingredients. Dip a clean cloth into the water and rubbing alcohol. Softly wipe the rubber with the tip of your wet cloth to wipe away any sticky stains or tougher contaminants that won’t easily come out. Let the paddle air dry before putting it away. Do this sparingly. Using a large amount of rubbing alcohol to frequently clean your paddle will dry the rubber out. This may lead to cracking over time. [6] X Research source"
    },
    {
      "title": "Opt for a special rubber cleaner to recondition the rubber’s tack.",
      "content": "Opt for a special rubber cleaner to recondition the rubber’s tack. Get any foam or liquid rubber cleaner designed for vehicles. Spray a quarter-sized dollop of liquid or foam cleaner on your paddle and rub it into the rubber with a clean cloth. Repeat this process on the other side and let your paddle air dry. This will recondition the rubber and restore the tack on the paddle. This is extremely important if you play competitively, since a strong tack is necessary for spins and strong serves. [7] X Research source Tack refers to the rubber’s stickiness. The stickier the rubber is, the harder it will grip the ball. If the paddle is too smooth, you won’t be able to spin the ball or control your serves. Only do this when the tack needs to be restored. You can test the tack on your paddle by laying it flat on a table. Hold a ping pong ball 3–4 inches (7.6–10.2 cm) above the paddle and drop it. If it doesn’t bounce or it only bounces once, the tack is fine. If it bounces 4-5 times before settling down, you need to restore the rubber."
    },
    {
      "title": "Keep the paddle in a protective case when you aren’t using it.",
      "content": "Keep the paddle in a protective case when you aren’t using it. There are protective cases lined with plush, microfiber cloth that are designed specifically for ping pong paddles. Pick up a case for your paddle online or at a sporting goods store. Whenever you aren’t using your paddle, keep it in the protective case, especially if you’re carrying it in a backpack or bag. This will keep dust from building up on the surface of your rubber. [8] X Research source Most higher-end paddles come with a protective case when you buy them."
    },
    {
      "title": "Clean your ping pong table regularly to keep dirt and dust off.",
      "content": "Clean your ping pong table regularly to keep dirt and dust off. After every playing session, wipe the table down with a dry cloth. Every 2-3 months, remove the net by unscrewing it from the table. Mix 2–3 cups (470–710 mL) of water with 1 ⁄ 3 cup (79 mL) of white vinegar. Dip a soft cloth in the water and vinegar and wipe your table down thoroughly. Soak the net in your water and vinegar for 15 minutes before air drying it on a flat surface. Once it’s dry, reinstall it on your table. [9] X Research source Keep your table covered with a protective cloth when you aren’t using it."
    }
  ]
}