{
  "url": "https://www.wikihow.com/Adjust-Eye-Glasses",
  "title": "How to Fix Crooked Glasses and Tighten Your Spectacles",
  "steps": [
    {
      "title": "Stand in front of a mirror and look straight ahead.",
      "content": "Stand in front of a mirror and look straight ahead. Position the eyeglasses so the middle of the lenses are located in the center of your eyes. This is the optical center and the ideal location for your eyeglasses . All adjustments to your eyeglasses should be made to achieve this optimal position. If you have a bifocal lens, the line should sit at the lower eyelid. If you have a trifocal lens, the top line should sit at the bottom of the pupil."
    },
    {
      "title": "Look for issues with the temple arms.",
      "content": "Look for issues with the temple arms. If your glasses look crooked or tilted heavily to one side, it is likely the result of crooked temple arms. One way to test the temple arms is to lay your eyeglasses upside down on a flat surface. Both of the temple arms should rest evenly on the flat surface. If they do not, you will need to adjust them. [1] X Research source If your eyeglasses appear level on your face but sit crooked when resting on a flat surface, this may mean that one of your ears is higher than the other. The temple arms should be bent to accommodate any differences in ear height."
    },
    {
      "title": "Identify nosepiece problems.",
      "content": "Identify nosepiece problems. Look for the height at which your eyeglasses rest when on your face. If the lenses rest too high up or too low down, it is likely a problem with the nosepiece and you will need to make an adjustment to this part of your glasses. [2] X Research source"
    },
    {
      "title": "Check for squeezing or slipping.",
      "content": "Check for squeezing or slipping. Your glasses may sit centered on your face and at the correct height, but still feel a little bit loose or a little bit tight. You can adjust the tightness/looseness of your glasses by bowing the earpieces outwards or inwards, depending on your needs. The ideal place to make this adjustment is right at the hinge. Bowing the earpieces of the glasses outwards will relieve any unnecessary pressure to the sides of your head or temples while bowing earpieces inwards will help them fit more snugly to the side of your head. [3] X Research source"
    },
    {
      "title": "Look for slippage.",
      "content": "Look for slippage. You may find that, despite everything else looking well-fitted, your glasses are still sliding down your face. If this is the case, you can simply make adjustments to the screws that attach the arms to the lenses of the glasses. [4] X Research source"
    },
    {
      "title": "Level the temple arms.",
      "content": "Level the temple arms. The temple arms extend over and around the ears and hold the frame in place. After determining what adjustments need to be made, you will need to consider the style of glasses you wear, as correcting the problem differs from plastic to wire frames. [5] X Research source For wire frames, gently bend the arms with small pliers until they are straight. Put the glasses on and observe in the mirror to see if they are correct. Do not use wire cutters. You must use padded pliers or the frames will likely be damaged. For plastic frames, the plastic on the lower arm must be heated by a warm air source, such as a hair dryer , to make the plastic pliable. Slowly move the plastic upward with your hands until it is in the desired position. Be careful using the hair dryer as you could melt the plastic. Another way to bend plastic frames is to run them under hot water for 15 to 25 seconds before trying to make adjustments. The arm should become pliable enough to adjust, but be careful. The plastic can snap even when heated."
    },
    {
      "title": "Adjust the earpieces.",
      "content": "Adjust the earpieces. Check the curvature of the earpieces. If the eyeglasses are pinching or digging into your ears or the side of your head, bend the earpiece section of the arms outward. If the glasses are too loose and the glasses are slipping down off your nose, twist the earpieces inwards towards the head. Again, how you achieve this depends on the type of frame you have. [6] X Research source For wire frames, this adjustment can be made with pliers, or even your bare hands. For plastic frames, you will need to make the plastic pliable using either heated water or air, before bending the earpiece section of the frames."
    },
    {
      "title": "Tighten the screws on each side of the temple.",
      "content": "Tighten the screws on each side of the temple. Doing this will fix glasses that are sliding down your nose and will keep the lenses secure within the frames. This fix will require a very small screwdriver. These small screwdrivers are usually found in standard eyeglass cleaning and repair kits. [7] X Research source Take care not to over tighten the screws, or you risk damaging the plastic or metal that they are holding in place."
    },
    {
      "title": "Fix the nose pads for comfort.",
      "content": "Fix the nose pads for comfort. If the eyeglasses sit too high on your face, the nose pads need to be moved further apart. If the eyeglasses sit too low, then pinch the nose pads closer together. Try to make sure you bend each of the nose pieces together or apart at equal distances to keep the symmetry of your glasses. [8] X Research source"
    },
    {
      "title": "Make minor adjustments.",
      "content": "Make minor adjustments. Never make huge, drastic adjustments to your glasses all at once. It can often be harder to bend eyeglasses back into a proper position after a repair than it is to make the original adjustment. Make minor adjustments, check the glasses, and continue making minor adjustments until they are corrected. [9] X Research source"
    },
    {
      "title": "Avoid snapping.",
      "content": "Avoid snapping. When making repairs to plastic frames, always apply the least amount of pressure possible to make the necessary adjustments to the glasses. Exerting too much force to heated plastic can cause the frames to snap. Then your glasses will be permanently destroyed. [10] X Research source"
    },
    {
      "title": "Take precautions.",
      "content": "Take precautions. When using pliers to make adjustments to your eyeglass frames, wrap the ends of the pliers in tape. This will help you avoid permanently scratching the frames of the glasses. There is no way to fix these scratches, so while your glasses may fit properly, they will look like a dog chewed them up."
    },
    {
      "title": "Learn about your frames.",
      "content": "Learn about your frames. There are some styles of eyeglasses that are made with materials that can’t be adjusted. Frames made of titanium , memory plastic or aluminum alloy are made so that the frame is resistant to bending, manipulation or adjustment."
    },
    {
      "title": "Know when to give up.",
      "content": "Know when to give up. While simple adjustments to make your eyeglasses fit better can be carried out at home, there may come a time when it is prudent to simply buy new glasses. If you have made multiple adjustments to the frame, nose or earpieces, and the glasses still don’t feel right, it is probably time to bite the bullet and buy some new glasses. After years of use, some glasses simply can’t be saved. On a side note, it is suggested that you get your eyes checked at least on a yearly basis to make sure the prescription in your lenses is still ideal for your vision ."
    }
  ]
}