{
  "url": "https://www.wikihow.com/Burn-a-CD-Using-Mac-OS-X",
  "title": "Simple Ways to Create & Burn a CD Using macOS X",
  "steps": [
    {
      "title": "Open Music.",
      "content": "Open Music. In macOS Catalina (10.15) and later, you can use the Music app to quickly and easily burn audio CDs. Get started by launching the Music . The icon looks like a pair of musical notes on a dark pink background. You’ll be making a playlist of the music you want to put on your CD. [1] X Research source If you’re using an older version of macOS (Mojave or earlier), you’ll need to do this in iTunes instead."
    },
    {
      "title": "Make a playlist of the songs you want to burn.",
      "content": "Make a playlist of the songs you want to burn. Create a new playlist by clicking File , then hovering the mouse over New . Select Playlist from the menu that appears. [2] X Research source You’ll be prompted to add a title, description, and cover image for your playlist. Fill out any of those optional fields and click Create . In macOS 13 and earlier, you’ll only be prompted to give your playlist a name."
    },
    {
      "title": "Add songs to your playlist.",
      "content": "Add songs to your playlist. In the sidebar on the left side of the Music window, select Listen Now , Browse , or any option below the Library header. Click and drag the desired songs from any of those categories onto the playlist. You can also Ctrl-click a song and select Add to Playlist , then choose your new playlist from the menu. Add an entire album at once by clicking and dragging its cover image, or by hovering over it, clicking •••, and selecting Add to Playlist . If you’re using macOS 14 or later, you can also open the playlist, scroll down, and click the + button next to Suggested Songs to generate a list of suggested tracks. A standard audio CD can accommodate a max of 80 minutes of playback, meaning that your playlist should run at around 1.2 or 1.3 hours maximum. (This can be found at the bottom of the window.) Since this is an imprecise way of measuring, some 1.3-hr playlists will be shorter than 80 minutes and some will be longer. (You will find out for sure when you try to burn.)"
    },
    {
      "title": "Rearrange the playlist order",
      "content": "Rearrange the playlist order if desired. To do this, click View > Sort By and select Playlist Order . Then, drag and drop the songs into the desired order in the list."
    },
    {
      "title": "Double-check that all the songs you want are selected.",
      "content": "Double-check that all the songs you want are selected. Once you’ve made your list, select View > as Songs and make sure there’s a checkmark next to each song on the list. If you don’t see any checkboxes on the playlist, go to Music > Settings > General and select Songs list checkboxes . [3] X Research source"
    },
    {
      "title": "Insert a blank CD.",
      "content": "Insert a blank CD. Since most newer Macs don’t have CD drives, you may need to connect an external drive. You usually need to use a CD rather than a DVD for audio discs. There are DVD audio players, but they are quite rare."
    },
    {
      "title": "Click File, then select Burn Playlist to Disc.",
      "content": "Click File , then select Burn Playlist to Disc . Make sure the playlist is selected. If the playlist is too long, you will be given the option to spread it across multiple discs. You can do this if desired or cancel the burn and modify the playlist. If you don’t see the option to burn the playlist to a disc, this might be due to usage restrictions on some of the songs in the playlist."
    },
    {
      "title": "Choose your disc format and burn settings.",
      "content": "Choose your disc format and burn settings. If you’re making a music CD, the best format option is Audio CD. Once you select that, you’ll see some additional options: You can adjust the burn speed. Higher is faster, but very high speeds may cause disc errors on older systems or cheap CDs. You can choose whether or not to place a gap between songs, and choose the length of the gap. Select Use Sound Check if you want to make sure all the tracks on the CD play at the same volume. Choose Include CD Text so that track titles can be displayed on CD players with that capability."
    },
    {
      "title": "Click Burn when you’re ready.",
      "content": "Click Burn when you’re ready. The Music display will show the progress of the CD burn. Music will play an alert sound when the burn process is complete. If you want to stop the burn, click the Cancel button. If your playlist is too long to burn onto a single CD, you’ll be prompted to insert a second one partway through the burn. Track information (title, artist, album, etc.) will only be displayed on the final disc of the series if this happens."
    },
    {
      "title": "Insert a blank CD-R or CD-RW into the CD drive.",
      "content": "Insert a blank CD-R or CD-RW into the CD drive. A CD-R can be written to once, and then becomes read-only. A CD-RW can have data added and deleted. These steps work for burning data DVDs as well as CDs, as long as your computer supports burning DVDs."
    },
    {
      "title": "Choose the Open Finder option.",
      "content": "Choose the Open Finder option. When you insert a blank disc, you are typically asked how you would like to handle it on the computer. This option will open the Finder so you can easily drag and drop files when you select the CD. [4] X Research source If you want your Mac to do this action every time you put in a CD, check the box that says Make this action the default ."
    },
    {
      "title": "Find the icon of the blank CD on your desktop.",
      "content": "Find the icon of the blank CD on your desktop. It will be labeled “Untitled CD.” Double-click it to open the CD Finder window. If you want, you can rename the CD now. Click the icon and press Return , then type in the desired name. [5] X Research source"
    },
    {
      "title": "Drag and drop the desired folders and files onto the CD.",
      "content": "Drag and drop the desired folders and files onto the CD. Rename any files or folders that you want before you start the burn process. Once they are burned to the CD, you cannot change the names. The locations of the various files and folders on the CD will also be set once you burn the disc, so arrange them the way you want now. The original files and folders will remain on your Mac when you drag them onto the CD. The versions on the disc are copies, also called “aliases.”"
    },
    {
      "title": "Initiate the burn.",
      "content": "Initiate the burn. Click File and then select Burn [disc name] . You will be given the opportunity to name the CD if you haven’t already. This name will appear whenever the CD is inserted into a computer."
    },
    {
      "title": "Click Burn after naming the CD.",
      "content": "Click Burn after naming the CD. The files will then be saved onto the CD. This process can take anywhere from a minute to almost an hour depending on the size of the files you want to burn. To reuse a CD-RW disc, erase all of the data on the disc and then repeat the burn process."
    },
    {
      "title": "Create the Disc Image file if you haven’t already.",
      "content": "Create the Disc Image file if you haven’t already. A Disc Image (DMG) is a file that acts like a mountable disc (such as a CD, USB drive, or hard drive). If you don’t already have a Disc Image file to burn onto your CD, make one now . [6] X Research source For more detailed information on how to create and format a DMG file, check out this article from Apple Support . Make sure to fill in a name for the disc in the Name field."
    },
    {
      "title": "Insert a blank CD-R or CD-RW into your disc drive.",
      "content": "Insert a blank CD-R or CD-RW into your disc drive. The icon will appear on your desktop."
    },
    {
      "title": "Control-click the DMG file and select Burn Disc Image to Disc.",
      "content": "Control-click the DMG file and select Burn Disc Image to Disc . When you ctrl-click the DMG file on your desktop or in Finder, a menu will pop up. Choose Burn Disc Image [disc name] to Disc from the list of options. [7] X Research source"
    },
    {
      "title": "Follow the prompts on the screen.",
      "content": "Follow the prompts on the screen. The instructions on the screen will guide you through the process of burning your DMG file to the CD."
    }
  ]
}