{
  "url": "https://www.wikihow.com/Keep-Your-Fwb-Interested",
  "title": "How to Keep Your FWB Interested in You",
  "steps": [
    {
      "title": "A casual, no-strings-attached dynamic is key to a FWB relationship.",
      "content": "A casual, no-strings-attached dynamic is key to a FWB relationship. If you can, try to keep your emotions in check, and keep things platonic with your partner. [1] X Research source If you do start developing feelings for them, talk to them about it to see if they feel the same way. A friends with benefits situation can be tricky, and they aren’t for everyone. If you’re finding that you attach a lot of emotions to sex, this dynamic might just not be for you (and that’s okay)."
    },
    {
      "title": "Different positions and toys can spice up your hookups.",
      "content": "Different positions and toys can spice up your hookups. If you think your FWB might be getting a little tired of the routine, ask them if they’re comfortable trying something new. Or, see if they have anything new they want to try. This will keep them interested in you long-term, and it’s fun for you, too. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source You never have to do anything that you don’t want to, but try to keep an open mind. If you’ve never tried something before, you might just like it!"
    },
    {
      "title": "Being clingy might send the wrong message to your FWB.",
      "content": "Being clingy might send the wrong message to your FWB. Since you’re not in a relationship with them, you probably won’t be in constant contact. Try to keep your texts and calls to a minimum, and reach out if you want to set up a hookup time or make a plan to hang out. [3] X Research source Don’t be alarmed if you don’t hear from your FWB for a while. People get busy, and they might have other things going on, like work or school. If you find yourself wanting to talk to them more and more every day, you could be developing feelings for them. If that’s the case, talk to your FWB to see what their feelings are and what you might do about your relationship."
    },
    {
      "title": "Taking your FWB as a plus-one can blur the lines of your relationship.",
      "content": "Taking your FWB as a plus-one can blur the lines of your relationship. While it might seem like a fun idea to grab your friend and take them to a party or a family gathering, this can start to move more into relationship territory. If you want to keep things strictly platonic, hang out with your FWB alone, not with other people. [4] X Research source You can talk to your friends about your FWB, but don’t mention them to your parents or relatives. They’ll probably assume that you two are dating, which can be tricky to deal with."
    },
    {
      "title": "Your friendship will ultimately keep you two together.",
      "content": "Your friendship will ultimately keep you two together. While your relationship might be mostly about having sex, you can also be a friend to your hookup partner. Ask them about their day, offer advice, and be a listening ear when they need one. [5] X Research source This will help avoid feeling too transactional. If you can talk to each other like friends, you’ll probably have a better sex life, too."
    },
    {
      "title": "Hang out with your FWB like you would with a friend.",
      "content": "Hang out with your FWB like you would with a friend. This means going out to eat, watching movies together, and just generally hanging out platonically. What you don’t want to do is anything romantic: candlelit dinners or nighttime stargazing sessions are a no-go. That way, you’ll keep the boundaries of the relationship clear while still having fun together. [6] X Research source Try inviting your hookup out to breakfast the next day as a fun way to connect without a sexual component."
    },
    {
      "title": "Cuddling is fun, but it’s more of a serious relationship activity.",
      "content": "Cuddling is fun, but it’s more of a serious relationship activity. After you and your FWB have sex, feel free to lounge around with each other and enjoy each other’s company. However, try not to cuddle too much or fall asleep cuddling, since that could lead to developing feelings for each other. [7] X Research source In general, you don’t want to ask your FWB to spend the night unless you two have just had sex. Sex-less sleepovers are usually reserved for couples who are dating, not friends with benefits. Your main priority here is preserving your friendship at all costs. If you blur the boundaries of your relationship too much, your friendship could suffer."
    },
    {
      "title": "Keep yourself clean to make sex enjoyable for the both of you.",
      "content": "Keep yourself clean to make sex enjoyable for the both of you. Before you invite your FWB over, spend a few minutes in the shower. If you have a vagina, use warm water to gently cleanse your vulva . [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have a penis, use soap and warm water to gently clean it . [9] X Research source The better you smell and look, the better your sex life will be. Shaving is optional, but some people have a preference for it. If you aren’t sure, you can ask your partner what they like."
    },
    {
      "title": "Set clear guidelines about the relationship to avoid hurt feelings.",
      "content": "Set clear guidelines about the relationship to avoid hurt feelings. Some people in a FWB situation are completely exclusive, and they don’t date other people. Others are fine with seeing other people, and don’t mind if their partner dates around. Talk to your FWB before you start the relationship to see what they’re comfortable with, and tell them what you’re okay with, too. “Are you planning to date other people? I don’t mind if you do—since I’m not looking for anything exclusive right now, I was probably going to keep dating other people, too.” “Even though we’re just friends with benefits, I’d feel more comfortable if we weren’t sleeping with other people. It just helps me to know that we’re having safe sex.”"
    },
    {
      "title": "Being safe shows your FWB that you’re a reliable sexual partner.",
      "content": "Being safe shows your FWB that you’re a reliable sexual partner. Not only will this keep them interested in you, but it keeps you both safe, too. Be sure to talk about protection, like using condoms or dental dams, to protect yourself from STDs. [10] X Research source This is especially important if you two aren’t exclusive, since having multiple sexual partners can lead to a higher risk of STDs and STIs. Talking about safe sex can feel a little awkward, but it’s an important conversation to have. Start it off by saying something like: “Could we talk really quick about what we’re gonna use for protection? I’m on birth control, but I’d like to use condoms as well, just to be safe.” “I know we’re exclusive, but I’d feel more comfortable if we used condoms and dental dams, at least at first.”"
    },
    {
      "title": "A FWB situation can’t continue forever, and that’s okay.",
      "content": "A FWB situation can’t continue forever, and that’s okay. Talk with your FWB about when the relationship might end: is it when one of you finds a new partner? Is this just a summer fling? Knowing when to end the relationship will keep your boundaries in place, and it will make you both feel more secure in the situation you have now. [11] X Research source “I’m having a ton of fun with you right now, but I am still looking for a serious relationship elsewhere. I want you to know that if I find someone I could see a future with, I’ll probably end our situation.” “I really like what we’ve got going on right now, but it’s probably just a summer thing for me. I just want you to be prepared for that.”"
    }
  ]
}