{
  "url": "https://www.wikihow.com/Install-Carpet",
  "title": "How to Install Carpet",
  "steps": [
    {
      "title": "Vacuum and mop the floor clean.",
      "content": "Vacuum and mop the floor clean. Now is a good time to make sure the floor under your carpet is clean. Vacuum or sweep up any debris in the area, and then go over it with a mop. Let it dry at least an hour before continuing, as you don't want water under your carpet. [1] X Research source If you are putting carpet on a hardwood floor where you didn't need to remove carpet, you'll just need to do this step."
    },
    {
      "title": "Measure the length and width of your room.",
      "content": "Measure the length and width of your room. To buy enough padding and carpet, you need to know the square footage (meterage) of your room. Start by measuring your room on the longest side and writing the number down. Do the same going the other direction and write that number down. [2] X Research source For instance, your room may be 13 by 10 feet (4.0 by 3.0 m) If your room isn't perfectly rectangular, divide it into rectangles and measure the length and width of each one. Alternatively, force the room to be roughly rectangular and add a bit extra to your estimate. For example, if one wall has a small part that dips out, measure the 2 walls and then increase your estimate by 1 foot (0.30 m) on that wall."
    },
    {
      "title": "Multiply length times width to get the square footage.",
      "content": "Multiply length times width to get the square footage. To get the area of a rectangle, you multiply the length (1 side) by the width (the other side). You do the same with your room measurements, and that gives you the square footage of the room. [3] X Research source For example, if your room was 13 by 10 feet (4.0 by 3.0 m), then you multiply 13 by 10 to get 130 square feet (12 m 2 )."
    },
    {
      "title": "Add 10-20% to your estimate.",
      "content": "Add 10-20% to your estimate. You're going to make mistakes when putting in the carpet. Plus, you may have issues with getting cut pieces to fit in the areas you have left to cover after the main pieces are down. It's always better to have more than you need than to run back to the store because you ran out of padding or carpet. [4] X Research source"
    },
    {
      "title": "Buy carpet and padding based on your area measurements.",
      "content": "Buy carpet and padding based on your area measurements. When buying these supplies, they'll be listed in square feet or meters. Therefore, all you need to do is compare the square footage or meterage you found with what's being offered in the store."
    },
    {
      "title": "Determine how much tack strip you'll need.",
      "content": "Determine how much tack strip you'll need. If you're using existing tack strip, just measure what you removed because it was damaged. If you're not using existing tack strip, just use your length and width measurements multiplied by 2, plus 10%. The tack strip will need to go around the whole border of the room. When deciding on tack strips, opt for the widest you can find. [5] X Research source"
    },
    {
      "title": "Nail the tack strips into place as needed.",
      "content": "Nail the tack strips into place as needed. Place the tack strips about 0.25 to 0.5 inches (0.64 to 1.27 cm) from the wall in a straight line. Make sure the tacks are pointed toward the wall, not the center of the room. Use 2 nails for each strip, nailing it into the wood below. Some tack strips come with the nails already in place, and you just hit them in. [6] X Research source If you need to cut a strip to size, slice through it with a handsaw. On concrete, you may be able to just pound it in the same way if the concrete is soft enough. If not, drill holes where the nails go using a concrete bit of the same size and then pound aluminum nails in. You'll also need tacking strips around things like floor vents."
    },
    {
      "title": "Lay out the padding on the floor.",
      "content": "Lay out the padding on the floor. Roll out the padding, starting from one side of the room and moving to the other. Slice it off with a box cutter when you get to the other wall, making sure you have enough on both ends. Cut it just on the inside of the tack strips. Roll out the next set of padding right next to the first. [7] X Research source Make sure you're matching up the seams evenly so that you don't have hills and valleys on the floor."
    },
    {
      "title": "Staple the padding into place with a staple gun.",
      "content": "Staple the padding into place with a staple gun. Walk across the floor and press staples into place every 2 feet (0.61 m) or so. Also, make sure to staple the padding along the inside edge of the tacking strip to hold it in place against the strip. With concrete, you need to put padding glue down underneath the padding instead. In that case, just lift up one side at a time to apply the glue in an even layer."
    },
    {
      "title": "Duct tape the seams together.",
      "content": "Duct tape the seams together. After you've rolled and cut the whole floor, use a long piece of duct tape down each seam. You may need to use more than 1 strip, but the duct tape will help keep the seams together. Smooth it out with your hands to make sure it won't come up."
    },
    {
      "title": "Let the carpet sit for 24 hours in your home.",
      "content": "Let the carpet sit for 24 hours in your home. It needs this time to adjust to the temperature and humidity in your home. That's because it may expand or shrink based on these conditions, so you want to make sure it's through with that process before you put it down. [8] X Research source You can leave it rolled up during this time."
    },
    {
      "title": "Cut the carpet to size if you don't have space to do it in the room.",
      "content": "Cut the carpet to size if you don't have space to do it in the room. If your room is small, you may not have enough floor space to bring the carpet in and cut it. Use the measurements you took earlier for the room to cut the carpet to size. Make sure to leave some extra on either end so you don't end up with a piece that's too short. While there are specialty tools designed for this purpose, a standard utility knife is surprisingly efficient at cutting carpet."
    },
    {
      "title": "Roll the carpet out.",
      "content": "Roll the carpet out. Start in one corner of the room. Leave 3 to 4 inches (7.6 to 10.2 cm) of excess on each side of the carpet up against the wall. Unroll the carpet roll, covering the floor and tack strips as you do. Line up carpet edges as needed to make seams and cover the whole floor. Check the texture of the carpet to make sure it's going the direction you want."
    },
    {
      "title": "Place seaming tape underneath seams.",
      "content": "Place seaming tape underneath seams. When you come to a seam, lay seaming tape down on the floor. The sticky part should be facing up. Place the carpet seam over the tape, making sure both edges are covered. [9] X Research source If possible, try to place seams in inconspicuous, low-traffic areas."
    },
    {
      "title": "Heat the tape with a seaming iron.",
      "content": "Heat the tape with a seaming iron. Set your seaming iron to 2 or 3. Lift up the carpet on both sides so you can slide the seaming iron underneath the carpet and on top of the tape. Leave it in place for 8-10 seconds until the adhesive melts, then move it down. Press down on the part of the seam you just heated so the carpet sticks to the tape. [10] X Research source ."
    },
    {
      "title": "Seal the seam with a carpet roller.",
      "content": "Seal the seam with a carpet roller. Run your thumbs over the very center of the seam to make sure it's in place. Then, use a carpet roller to go over it several times, running it back and forth along the seam. Do this as you heat each section, not at the very end. [11] X Research source A carpet roller is a small roller that looks a little like a painting roller. Wait 20 minutes after doing seams before tacking and stretching it. Keep moving down the seam this way until it's stuck in place"
    },
    {
      "title": "Tack the carpet into place on one wall with a knee kicker.",
      "content": "Tack the carpet into place on one wall with a knee kicker. Place the tooth edge of the knee kicker on the carpet near the wall in a corner. Put it about 3 inches (7.6 cm) out from the wall. Hit the flat, vertical part sticking out on the other end with your knee, making sure to apply some force. When you hit it, it tacks the carpet on to the strip. Move along the wall, hitting the knee kicker every 1 foot (0.30 m) or so. [12] X Research source You may want to use knee pads for this process! You will have carpet sticking up over the trim. A knee kicker is a solid metal tool that's about 1.5 inches (3.8 cm) long with \"teeth\" that will grip the carpet on one end and a heavily padded \"butt\" on the other. It stretches the carpet over the tack strip. The tacks grab the carpet and hold it firmly in place."
    },
    {
      "title": "Stretch the carpet across the room and tack it on the other side.",
      "content": "Stretch the carpet across the room and tack it on the other side. Using as much strength as you can, pull the carpet so it's taut across the room. Use the knee kicker to tack it onto that wall, too. [13] X Research source Make sure all the lumps are out of the carpet. You can use a carpet stretcher for this process, which is a good idea if you have a large room. To use one, place the flat end against the wall you tacked on first, then place the flat part on the floor. It has a lever that gives you leverage and the head pushes the carpet across the floor to stretch it. [14] X Research source"
    },
    {
      "title": "Secure the rest of the room with the knee kicker.",
      "content": "Secure the rest of the room with the knee kicker. Tack the other edges of the room with the knee kicker, stretching the carpet as tight as you can while moving around the room. Remember, you'll have excess carpet on each side that you can trim off in a minute. [15] X Research source"
    },
    {
      "title": "Run a carpet trimming tool along the edge.",
      "content": "Run a carpet trimming tool along the edge. The carpet tool has a flat metal runner on the bottom, a handle on the top, and a blade on one edge. Press the tool flat against the carpet and right up against the baseboard on the sharp side. Push it along the wall, applying pressure as you do. You can use a box cutter for this purpose, but it must have a new, sharp blade. Run it underneath the baseboard to cut the carpet. If it starts getting dull, replace the blade. Also, use a box cutter to cut out spaces for your floor vents."
    },
    {
      "title": "Check that you cut cleanly through the carpet before taking the strip off.",
      "content": "Check that you cut cleanly through the carpet before taking the strip off. Look along the edge of the strip you cut off. Make sure no strings are connecting the strip to the main carpet, then pull it up and away from the carpet. If you yank up the strip without checking, you might pull fibers from the carpet that cause a run."
    },
    {
      "title": "Press the edge of the carpet under the baseboard with a carpet chisel.",
      "content": "Press the edge of the carpet under the baseboard with a carpet chisel. This tool has a wide, dull blade that lets you press the carpet in place. Use it to wedge the carpet under the baseboard by pressing into the carpet until it settles in place."
    },
    {
      "title": "Return any hardware you removed.",
      "content": "Return any hardware you removed. If you took doors off, put them back in place. Put the door stops back. If you took up floor vents, screw them back in place. Move your furniture and belongings back in place, and you're done!"
    }
  ]
}