{
  "url": "https://www.wikihow.com/Keep-a-Stray-Cat-Away-from-Your-Cat",
  "title": "How to Keep a Stray Cat Away from Your Cat",
  "steps": [
    {
      "title": "Locate any bird feeders in your yard.",
      "content": "Locate any bird feeders in your yard. Bird feeders can be as popular for stray cats as they are for birds. [1] X Research source A stray cat may see those bird feeders as a way to attack readily available prey. If you have multiple bird feeders, you may be attracting more than one stray cat to your yard, which could be very distressing to your cat."
    },
    {
      "title": "Identify potential food sources.",
      "content": "Identify potential food sources. If your cat is exclusively outdoors and you feed him outside, you could be attracting stray cats to your yard. Not only would the stray cat want to keep coming back for the food, he would likely fight your cat for access to the food, which could place your cat at risk of serious injury and illness. Additionally, if you grow catnip in your yard, you could be making your yard very attractive to a stray cat. [2] X Research source"
    },
    {
      "title": "Verify the reproductive status of your cat.",
      "content": "Verify the reproductive status of your cat. If you have a female cat that has not been spayed, she could be attracting intact male cats to your yard. [3] X Research source Your female cat would be giving off pheromones that an intact male cat would be able to smell. If you know that your female cat is not spayed, and you notice that male stray cats are on the prowl in your yard, schedule an appointment to have your cat spayed as soon as possible. If your intact female cat comes into contact with an intact male stray cat, your cat could become pregnant."
    },
    {
      "title": "Observe the stray cat.",
      "content": "Observe the stray cat. The stray cat may frequent a particular area of your yard, such as a garden or sandbox. He may also like to go to an area under your house that is warm and safe. If you can identify where the stray cat likes to go, then you can start coming up with ways to keep him out of those particular areas. If keeping an eye out on the stray cat is not practical for your schedule, you could also observe how your cat is acting. If your cat starts to spray inside your house, either at the window or on the wall near the opposite window, it is likely that a stray cat is visiting your yard. [4] X Research source Take notice if your cat becomes increasingly aggressive at you or other pets in your home (called ‘redirected aggression’) if he cannot actually get to the stray cat outside. [5] X Research source Your cat may also become fearful inside your home if a stray cat is outside. Even though you know that the stray cat has no chance of entering your home, your cat does not know that and may resort to hiding inside the house. [6] X Research source"
    },
    {
      "title": "Keep your cat indoors.",
      "content": "Keep your cat indoors. If the stray cat comes to your yard because he knows that your cat is in the yard as well, you should keep your cat indoors. Stray cats tend not to be fully vaccinated and can carry a variety of diseases (e.g., feline immunodeficiency virus, feline leukemia virus) that could make your cat very sick, so it is primarily for safety and health reasons that you should keep your cat inside. [7] X Research source [8] X Research source Keep in mind that the stray may continue to come to your yard, since he knows your cat is somewhere in the vicinity. If your cat is used to being outdoors, provide him with plenty of toys inside your home that will keep him busy and mentally stimulated. [9] X Research source If your cat is outdoors, the techniques needed to keep a stray cat away from your cat may startle and disturb your cat. This is another reason why you should keep your cat indoors, at least until you are confident that the stray cat will not come back."
    },
    {
      "title": "Place a motion-activated sprinkler in your yard.",
      "content": "Place a motion-activated sprinkler in your yard. One of the best ways to keep a stray cat away from your cat is to make your yard as undesirable as possible to him. A motion-activated sprinklers are available that are specifically designed to deter animals. The sprinkler will spray water on the stray cat when he walks near it. You could place the sprinkler where you usually see the stray enter your yard. After a few of days of getting splashed on unexpectedly, the stray cat will probably stay away from your property. You can remove the sprinkler or spray after you notice that the stray cat is no longer coming to your yard. You should put the motion-activated devices back in your yard if he returns or if you see a different stray cat in your yard."
    },
    {
      "title": "Use an ultrasonic device to keep the stray cat away.",
      "content": "Use an ultrasonic device to keep the stray cat away. Outdoor ultrasonic devices work in a similar way to a motion-activated sprinkler or spray. When the stray cat steps near it, the device will emit a high frequency sound that will you will not be able to hear, but will be very irritating to him. He may be more annoyed than startled at the sound, but the sound may be irritating enough to keep him out of your yard. If you notice that the ultrasound device is bothersome to your own cat, consider using another type of deterrent device or another method to keep the stray cat away."
    },
    {
      "title": "Use natural deterrents to make your garden undesirable.",
      "content": "Use natural deterrents to make your garden undesirable. A stray cat may treat your garden like a litter box. If you do not want to spend money on deterrent devices to keep him out of your garden, you can use what you already have at home to keep him out. To make your garden undesirable, you can put chicken wire or prickly pinecones in it to make it more difficult for the stray cat to walk through or dig in. The chicken wire can be placed either on top of the soil or just below the surface. If you use chicken wire, make sure to cut holes in the wire that are large enough for your plants to continue growing. [10] X Research source Cats do not like the smell of citrus, so you could also place lemon or orange peels in your garden. However, the peels could attract other wild animals to your garden, so you might end up replacing one animal problem by another. [11] X Research source You can also sprinkle ground pepper (black pepper plus chili pepper) or coffee grounds on your annuals or perennials to keep a stray cat out of your garden. Try planting ‘cat-repellent’ plants, such as Coleus canina, in your garden. These plants produce a foul odor that will keep the stray cat out of your garden. Inquire about these types of plants at your local gardening store to find out if the smell is also bothersome to people. You could also make your own cat repellent ."
    },
    {
      "title": "Cover up the sandbox.",
      "content": "Cover up the sandbox. If you have a sandbox in your yard, you should cover it securely to keep the stray cat from using it as a litter box. [12] X Research source Make sure to use a covering that the stray cat cannot easily scratch or tear through, such as tarp. Visit your local home improvement store to purchase a durable material with which to cover the sandbox."
    },
    {
      "title": "Block access to areas under your house.",
      "content": "Block access to areas under your house. A stray cat may keep coming back to your yard because he has found a safe area under your porch or deck where he could comfortably hide. Installing chicken wire or latticework could be very effective in preventing the stray cat from making a home under your house. If you do not have already have these materials at home, you can purchase them at your local home improvement store."
    },
    {
      "title": "Remove any potential food sources from your yard.",
      "content": "Remove any potential food sources from your yard. Bird feeders and catnip can attract stray cats to your yard. [13] X Research source If you really enjoy having birds come to your yard but do not want to remove the bird feeders, you may have to invest in a fence to keep stray cats and other animals in your yard. This could be a very expensive and time-consuming endeavor, so removing the bird feeders would be the easier and less expensive solution."
    },
    {
      "title": "Trap the stray cat.",
      "content": "Trap the stray cat. Before attempting to trap the stray cat, try approaching him to if he is safe to get near and physically handle. If he is approachable, then you can purchase a humane trap at your local animal store and set it up in a part of your yard that has plenty of shade. Even with the stray cat being approachable, you should still contact your local animal control or feline rescue organization for instructions on how to safely trap him. [14] X Research source Do not attempt to trap the stray cat if you cannot safely approach him. If you cannot get near him without him trying to attack you, contact your local animal control or feline rescue organization to remove him from your yard. A terrified stray cat can inflict serious injury on you, so you do not want to put yourself in danger. [15] X Research source If you are going to trap him yourself, make sure that you are wearing thick gloves and long sleeves. [16] X Research source If you do not have thick gloves already, you can purchase them at your local hardware store or home improvement store. When the stray cat is trapped in the cage, immediately take him to your local animal control center. If you are not comfortable picking up the cage, contact the local animal control to pick it up for you. Placing the cage in the shade would keep the stray cat out of direct sunlight, in case a long period of time passes between him being trapped and being transported to the animal control center."
    },
    {
      "title": "Look for the stray cat's identification.",
      "content": "Look for the stray cat's identification. If you are able to approach the stray cat, check to see if he has a collar. If he has one, check the identification tag for the owner’s name and contact information. If you are able to touch him, check to see if has a microchip, [17] X Research source which is another way to identify and contact his owner."
    }
  ]
}