{
  "url": "https://www.wikihow.com/Hook-Up-a-DVD-Player",
  "title": "How to Hook Up a DVD Player",
  "steps": [
    {
      "title": "Plug in the DVD player and make sure it turns on.",
      "content": "Plug in the DVD player and make sure it turns on. Before trying to hook up your player, make sure it is plugged in and turns on when you press the \"power\" button. Usually, a small light or welcome message appears when the DVD player is working correctly."
    },
    {
      "title": "Determine what type of connection you need.",
      "content": "Determine what type of connection you need. There are at three common ways to connect a DVD player, and each needs a different cable to work. Your DVD player should come with all of the appropriate cords, but you need to check which connections your TV accepts as well. Look into your owner's manuals or check the TV and DVD Player yourself to see what connections you can use. The three most common are. HDMI: The most modern connection, HDMI resembles a longer, thinner USB cord. HDMI connections are the highest quality connections and you only need one cord for both the audio and video. A/V Cables (Three-Prong): Standing for Audio/Visual cables, this is the most common connection for DVDs. There are three prongs at either end-- red, yellow, and white -- and they match up to corresponding colored inputs on both the TV and DVD player. Component Cables: Sporting better quality than A/V cables but less than HDMI, component cables are a set of five colored prongs attaching to five matching inputs on both the TV and the DVD player."
    },
    {
      "title": "Find the appropriate cable for your connection.",
      "content": "Find the appropriate cable for your connection. Once you know what connection you will use, locate the cable and make sure it is not torn or frayed. If you need a new cable, or are missing one, take a picture of the input you want and bring it to your local electronics store to find a replacement. If possible, use an HDMI cable, as they are the easiest to install and have the best quality video."
    },
    {
      "title": "Place the DVD player close to the television.",
      "content": "Place the DVD player close to the television. Once you know what connection you will need, make sure you put the DVD player close enough to the TV so that you can reach the appropriate cables to the back. Do not stack different electronic equipment on top of one another -- they can quickly heat up when in use and damage the electronics."
    },
    {
      "title": "Turn off the DVD player and TV before you connected them.",
      "content": "Turn off the DVD player and TV before you connected them. This prevents the likelihood of electric shocks and protects the equipment."
    },
    {
      "title": "Know that the same procedures work for a projector.",
      "content": "Know that the same procedures work for a projector. Most projectors have the same set of inputs as TVs, so don't be intimidated if you want to hook up a projector instead. Some projectors use a \"DVI Input\" instead of the three connections listed above. If so, follow the same procedure as \"Connecting with an HDMI Cable,\" substituting a DVi cable for an HDMI. [1] X Research source"
    },
    {
      "title": "Plug the first end of the cable into the HDMI socket on the DVD player.",
      "content": "Plug the first end of the cable into the HDMI socket on the DVD player. Look for the \"HDMI\" or \"HDMI Out\" label and fit the cable securely into the socket. This is the highest quality connection for audio and video and is typically found only on modern DVD players."
    },
    {
      "title": "Plug the second end of the cable into the HDMI socket on the TV.",
      "content": "Plug the second end of the cable into the HDMI socket on the TV. Just like DVD players, only newer TVs have HDMI sockets. There may be multiple sockets available. Each HDMI socket will be labeled \"HDMI\" or \"HDMI In\" along with a potential input number. If there is an input number, like \"HDMI 1,\" remember it for later. This is the setting your TV must be set at to see your movies."
    },
    {
      "title": "Make sure that both HDMI connections are secure.",
      "content": "Make sure that both HDMI connections are secure. An HDMI connection only requires one cable that carries both audio and video signal, and it does not matter which end goes where. But if the cable is pulled too tightly, or one of the connections is loose, you may not get a good signal. There are a lot of different HDMI cords available, but unless you want a pristine, perfect picture then any length and type of cord will work just fine as long as it reaches. [2] X Research source"
    },
    {
      "title": "Power on the DVD player and TV.",
      "content": "Power on the DVD player and TV. Insert a DVD so that you can test both the picture and the audio."
    },
    {
      "title": "Switch the TV to the correct input using the \"source\" button on your TV or Remote.",
      "content": "Switch the TV to the correct input using the \"source\" button on your TV or Remote. Sometimes labeled \"input,\" this button allows you to switch where your TV gets the video and sound information. The input you choose on the TV should match the input you used for the cables. If there is no label or you don't know what input to use, leave the DVD player on and test each input for 5-10 seconds to see where the video appears."
    },
    {
      "title": "Plug in one end of the A/V Cables to the Output sockets on the DVD player.",
      "content": "Plug in one end of the A/V Cables to the Output sockets on the DVD player. The sockets are color-coded to match the cable (Red, White, and Yellow). Look for the \"Output\" or \"Out\" group. The Red and White sockets (Audio) may be separated from the Yellow one (Video). The set of sockets are typically grouped together with a border or line indicating the included sockets."
    },
    {
      "title": "Plug in the other end to the matching input sockets on the TV.",
      "content": "Plug in the other end to the matching input sockets on the TV. Like on the DVD player, these will be color-coded to match the cable and grouped into input groups. Look for the \"Input\" or \"In\" designation. A/V inputs are typically numbered to indicate which input you will need to select on the TV. The input sockets are usually grouped together, and are often marked by a border or a line separating the group from the other Inputs. The Red and White sockets (Audio) may be separated from the Yellow one (Video). The labels should indicate which socket goes with which Input."
    },
    {
      "title": "Make sure your connections are snug and matched to the right color.",
      "content": "Make sure your connections are snug and matched to the right color. Match the colored plugs on the cable to the colored sockets on both the DVD player and TV. The Yellow video plug may be a separate cable from the Red and White audio cable."
    },
    {
      "title": "Power on the DVD player and TV.",
      "content": "Power on the DVD player and TV. Insert a DVD so that you can test both the picture and the audio."
    },
    {
      "title": "Switch the TV to the correct input using the \"source\" button on your TV or Remote.",
      "content": "Switch the TV to the correct input using the \"source\" button on your TV or Remote. Sometimes labeled \"input,\" this button allows you to switch where your TV gets the video and sound information. The input you choose on the TV should match the input you used for the cables. If there is no label or you don't know what input to use, leave the DVD player on and test each input for 5-10 seconds to see where the video appears"
    },
    {
      "title": "Ensure that A/V or cables are plugged in correctly.",
      "content": "Ensure that A/V or cables are plugged in correctly. If you are only getting video or only getting audio, or you aren't getting any signal at all, your cable may be plugged in incorrectly. Check to make sure that each colored plug is attached to the correctly colored socket. If the video is not showing up, ensure that the Yellow plug is connected to the correct Input on the TV and Output on the DVD player. If the audio is not coming through, ensure that the Red and White cables are plugged into the correct Input on the TV and the correct Output on the DVD player."
    },
    {
      "title": "Plug all five cords on one end into the corresponding sockets on the DVD player.",
      "content": "Plug all five cords on one end into the corresponding sockets on the DVD player. The sockets are color-coded to match the cable (Green, Blue, Red, White, Red) and are typically grouped and labeled. Look for the \"Output\" or \"Out\" group. The Green, Blue, and Red sockets (Video) may be separated from the Red and White pair (Audio), so make sure all five cords are plugged in. You will notice that a component cable has two Red plugs, which can make things confusing. To figure out which is which, lay the cable out flat so that all of the prongs line up. The order of colors should be Green, Blue, Red (video), White, Red (audio). Some component cables only have the Green, Blue, and Red video plugs. You will need a separate Red and White plug audio cable in order to hear your DVDs, like the one found in the A/V section above."
    },
    {
      "title": "Plug the other side of the cables into the input sockets on the TV.",
      "content": "Plug the other side of the cables into the input sockets on the TV. Like on the DVD player, these will be color-coded to match the cable and grouped into Input groups. Look for the \"Input\" or \"In\" group. They are typically numbered to indicate which Input you select on the TV."
    },
    {
      "title": "Make sure your connections are snug and matched to the right color.",
      "content": "Make sure your connections are snug and matched to the right color. Match the colored plugs on the cable to the colored sockets on both the DVD player and TV."
    },
    {
      "title": "Power on the DVD player and TV.",
      "content": "Power on the DVD player and TV. Insert a DVD so that you can test both the picture and the audio."
    },
    {
      "title": "Switch the TV to the correct input using the \"source\" button on your TV or Remote.",
      "content": "Switch the TV to the correct input using the \"source\" button on your TV or Remote. Sometimes labeled \"input,\" this button allows you to switch where your TV gets the video and sound information. The input you choose on the TV should match the input you used for the cables. If there is not a label or you don't know what input to use, leave the DVD player on and test each input for 5-10 seconds to see where the video appears"
    },
    {
      "title": "Ensure that your component cable is plugged in correctly.",
      "content": "Ensure that your component cable is plugged in correctly. If you are only getting video or only getting audio, or you aren't getting any signal at all, your cable may be plugged in incorrectly. If the video is not showing up, make sure that the Green, Blue, and Red video cables are plugged into the correct Input on the TV and the correct Output on the DVD player. If the audio is not coming through, ensure that the Red and White cables are plugged into the correct Input on the TV and the correct Output on the DVD player. Double check that the Red cables are plugged into the correct sockets. If they are in the wrong ones, both the audio and video will be messed up."
    },
    {
      "title": "Make sure that the DVD player is plugged into a power outlet.",
      "content": "Make sure that the DVD player is plugged into a power outlet. DVD players need a power source in order to work, so double-check that the player is plugged into the wall or a power strip."
    },
    {
      "title": "Check all of the Input or Auxiliary channels.",
      "content": "Check all of the Input or Auxiliary channels. DVD players will display on one of the Input or Auxiliary channels. They will not show up on Channel 3 or 4 like some VCRs. Some TVs will label the Input channels based on the type of input, such as \"HDMI\", \"AV\", and \"COMPONENT.\" Refer back to Method one if you have a question about which input type you are using."
    },
    {
      "title": "Try a different cable.",
      "content": "Try a different cable. Sometimes, old cables can become frayed and the plugs can start coming loose. This can lead to a poor or nonworking connection. Try a new cable to see if your problem can be fixed. Note: There are a lot of companies that market extremely expensive cables. For the most part, you will not see any significant difference using high-end cables. This is especially true for HDMI, where a $5 cable will perform the same as an $80 cable. [3] X Research source"
    }
  ]
}