{
  "url": "https://www.wikihow.com/Do-Well-in-College-Algebra",
  "title": "How to Do Well in College Algebra",
  "steps": [
    {
      "title": "Take the math placement test at your school before the semester starts.",
      "content": "Take the math placement test at your school before the semester starts. The placement test helps you decide whether or not an algebra class is right for you. Maybe you don't need algebra, or maybe you need to take a different math class to prepare you for algebra. Usually, a placement test is free and comes with an appointment with the academic counselor; they will be able to tell you about your specific situation."
    },
    {
      "title": "Choose your professor carefully.",
      "content": "Choose your professor carefully. When registering for a college course, you can choose your own professor. Ask around and find out about the different professors. Choose a section taught by a quality professor that you think would fit with your learning style. Choose a section that also fits with your schedule allowing you to attend every class. Use websites that have reviews from students have taken the course with that professor to find out who would be a good fit for you."
    },
    {
      "title": "Sign up for a course that allows you take exams in a testing center.",
      "content": "Sign up for a course that allows you take exams in a testing center. Many community colleges have testing centers that allow you to schedule your exams to be taken outside of the classroom. This can allow for flexibility in case you need a few more days of study. You also may be given more time to finish the exam than you would during a normally scheduled class period. Speak with your professor at the beginning of the course about scheduling exams outside the classroom."
    },
    {
      "title": "Schedule the course during your optimal learning time of day.",
      "content": "Schedule the course during your optimal learning time of day. If this course is essential to you continuing on to the next course, make it the highest priority when you’re choosing your schedule. If you are a morning person, choose a section that meets in the morning when you are awake and ready to learn. If the best section fills up before you can schedule it, try speaking directly to the professor and explaining why it’s important for you to attend class at that particular time. Many people tend to lose focus after lunch time so if you’re not a morning person choose a section between 10am and 12pm or after 3pm."
    },
    {
      "title": "Take the class over the summer as your only course.",
      "content": "Take the class over the summer as your only course. If you have the opportunity to do so, taking the class on its own allows you to spend all of your time and energy on truly understanding algebra. Not having to split your attention between multiple courses lets you focus specifically on the task at hand. If you really want to succeed at a four-year college, take college algebra at a community college the summer before to gain a solid foundation in math."
    },
    {
      "title": "Know how homework, quizzes, and exams contribute to your grade.",
      "content": "Know how homework, quizzes, and exams contribute to your grade. Homework, quizzes, and exams will likely have different point values associated with them. Knowing what percentage each contributes to your grade can help you further in the course if you are struggling. Avoid falling behind because you didn’t put in the time to do the homework properly! Determine how much time you will need to spend each week to really master the course. Make sure to set aside this time by scheduling it into your day."
    },
    {
      "title": "Master pre-algebra before the first day of class.",
      "content": "Master pre-algebra before the first day of class. Pre-algebra includes addition, subtraction, multiplication, division, fractions, and decimals. These concepts are essential for understanding the more complicated algebraic concepts. Find online tutorials that have quizzes associated with them to ensure your mastery of this material."
    },
    {
      "title": "Buy the books and supplies a month before class.",
      "content": "Buy the books and supplies a month before class. Give yourself a head start on the material by looking through the book before the course begins. If you have time, work through some of the concepts and identify the ones that are particularly difficult for you. By getting ahead in your College Algebra (or any other math) studies you will have already worked through some problems and you will have intelligent questions to ask your teacher about the material. If your bookstore stocks them, buy a copy of the student solution manual. This will make your homework sessions much easier."
    },
    {
      "title": "Read the syllabus.",
      "content": "Read the syllabus. Your professor didn’t spend all of that time putting together a syllabus for no reason. The syllabus is a roadmap to the entire course, telling you what material will be covered each class, when homework is due, and when quizzes and exams will be. Write down all class times, study sessions, quizzes, exams, and project due dates in your planner. This helps you keep track of when everything is due and helps you make academics a priority. Pay special attention to exam study sessions and exams that fall outside of your normal schedule and/or class location. Make sure you have enough time to take algebra. A good rule of thumb is to schedule two hours of homework and studying for every hour of class. If you do not have enough time to take this class due to other commitments in your life, either make time for this class or wait until you do have the time."
    },
    {
      "title": "Read the textbook before class.",
      "content": "Read the textbook before class. Refer back to your syllabus to see what part of the textbook will be covered during your next class. Read that section and work some of the problems to check your understanding. Take some notes during your reading to refer back to while studying for quizzes and exams. [1] X Research source Come to class prepared to ask questions about the parts that you didn’t understand."
    },
    {
      "title": "Go to all of the classes, even the optional ones.",
      "content": "Go to all of the classes, even the optional ones. If you don't go to class, it's much harder to learn on your own. Math is a cumulative subject, so if you don't know the foundation, it's difficult to grasp later concepts. [2] X Research source Just going to class is not enough, you also need to actively pay attention. Pay special attention during demonstrations. Some algebra concepts are best when demonstrated. It is hard to use words to describe how a circle, an ellipse, a parabola and a hyperbola can come from the same cone, but when the professor takes out a model and shows you how to \"cut\" the cone, conic sections are much easier to understand."
    },
    {
      "title": "Listen and take notes in class.",
      "content": "Listen and take notes in class. [3] X Expert Source Daron Cam Academic Tutor Expert Interview. 29 May 2020. Write down or draw everything your professor presents on the board as well as any verbal hints they give. Write or draw everything the exact same way the professor writes or draws it on the board. This will help you study your notes later. If the professor asks a question in class, think about it and answer it if you know it. Ask questions if you are confused. It is likely that other students have the same question you do. Review your notes frequently to solidify your comprehension of the material. If there is something you can’t quite grasp, ask your professor for help."
    },
    {
      "title": "Do the homework",
      "content": "Do the homework . Do all of the homework, even if it is not collected or graded. Homework is practice for exams. When you do your homework, you study for the test at the same time. Just reading your notes may be enough for other courses, but it is not enough to help you pass algebra. [4] X Research source Ask questions on the homework. Write a list of problems that you had while doing the homework and take it to the next class. Make sure you give the questions a good try first; you may be able to solve them yourself."
    },
    {
      "title": "Invest in and learn how to use a graphing calculator.",
      "content": "Invest in and learn how to use a graphing calculator. Your math professor may show your class how to use a specific calculator or computer program. Learn the program or instrument inside out. If you have been out of school for even a few years since your last math class, make sure you know how to use the most recent calculators or programs. Find an online tutorial for more practice."
    },
    {
      "title": "Use graph paper for graphs.",
      "content": "Use graph paper for graphs. Understanding how to represent functions of a graph is key to understanding algebra. With graph paper, you can learn important graphing and visualization skills. These skills will help you in algebra and any higher math class."
    },
    {
      "title": "Attend office hours.",
      "content": "Attend office hours. Office hours are time set aside specifically by your professor to help you if you have questions. Take advantage of this one-on-one time if there is a concept you are really struggling with. Try to figure out exactly what it is you don’t understand instead of just walking in and saying, “I don’t get it”. [5] X Research source Alternatively, you can use the math lab if your school has one. Visit it to find help when you need it. If you are afraid of asking the staff members in the lab, ask the student workers (if they are available); almost every student math lab worker has taken algebra. Try to come in during times of less traffic so that you don't have to wait for help."
    },
    {
      "title": "Take advantage of free tutoring.",
      "content": "Take advantage of free tutoring. Many community colleges and universities have a certain number of free tutoring hours offered to students. Find a time that works best for you and attend a session. If you’re struggling with a particular topic, focus on that until it makes sense. Find out about your college’s policy at the beginning of the year. You may lose the tutoring privileges if you don’t use them in the first semester."
    },
    {
      "title": "Start a study group.",
      "content": "Start a study group. If you have the time and the capacity, a study group is a great way to stay on top of the material. Study groups are also good for working through homework and complex concepts. Someone in your group may understand something really well and be able to explain it to you in a way that clarifies the concept for you. Set up a weekly or every other week meeting time."
    },
    {
      "title": "Pay for additional tutoring if you need it.",
      "content": "Pay for additional tutoring if you need it. [6] X Expert Source Daron Cam Academic Tutor Expert Interview. 29 May 2020. A short one-on-one tutoring session can be more beneficial to you than hours of group work in class because it allows you to focus specifically on what doesn’t make sense. Although it may seem expensive, it is usually cheaper to pay for tutoring than to pay for retaking the course later. Find a tutor that fits and understands your learning style. If you start with one tutor and it isn’t working for you, don’t hesitate to find another one."
    },
    {
      "title": "Get sample tests with answers.",
      "content": "Get sample tests with answers. Using a test from a previous year is a great way to get more practice for the exam. It will give you an idea of the format of the exam and the difficulty of the questions. Work the test questions and then check your answers. What you got wrong is your lesson plan for concepts to work on."
    },
    {
      "title": "Review your quizzes and homework.",
      "content": "Review your quizzes and homework. Not only do the quizzes and homework count for a grade, but they are also good practice for the final exam. When you get a quiz or homework back, check to see what you did wrong. Do the problems again for practice and make sure you don't make the same mistakes again. [7] X Research source A good quiz average may also help you pass if your test grades are on the pass/fail fence. You’ll be less likely to make the same mistake a second time if you’ve reworked the problems."
    },
    {
      "title": "Complete any and all reviews offered by your professor.",
      "content": "Complete any and all reviews offered by your professor. Before an exam, most professors will put together a review assignment that covers all of the topics that you will see on the test. Completing the review will give you an idea of the topics you really understand and the ones you might need to study a little more before exam day. Use all the resources you have available to you to finish the review and study. Refer to your notes, textbook, previous homework assignments, and online help if necessary."
    },
    {
      "title": "Show all of your work.",
      "content": "Show all of your work. [8] X Research source Partial credit is a great way to gain points on quizzes and tests. If you don’t show the work of how you arrived at an answer, you are at risk of getting the whole question wrong even if you just added the last two numbers at the end incorrectly. Showing your work lets the professor know that you understand the concept, you may have just made a small arithmetic error."
    },
    {
      "title": "Answer the easy questions first.",
      "content": "Answer the easy questions first. [9] X Research source When taking the exam, work on the easiest questions first. If you come across a problem that you are unsure of, skip it and move on. You can always go back to those problems at the end of the test and focus on them once you’ve answered everything else. Don’t forget that you can also ask questions during the exam. Your professor may not be able to answer it, but it doesn’t hurt to ask."
    },
    {
      "title": "Get enough sleep the night before the exam.",
      "content": "Get enough sleep the night before the exam. [10] X Expert Source Daron Cam Academic Tutor Expert Interview. 29 May 2020. Cramming late into the night is not going to help you during the exam as much as a good night’s sleep will. If you have stayed on a consistent study schedule, you won’t need to cram because you will have been reviewing everything all along. Make sure you aren’t hungry during the test, either."
    }
  ]
}