{
  "url": "https://www.wikihow.com/Obtain-a-Police-Report",
  "title": "How to Obtain a Police Report",
  "steps": [
    {
      "title": "Determine which law enforcement agency to request the report from.",
      "content": "Determine which law enforcement agency to request the report from. In general, you request a police report from the law enforcement agency for the city where the incident took place. Find the contact information for the appropriate police department online. Depending on the jurisdiction, you may only be able to request the report if you were directly involved in the incident. However, some areas allow anyone to file a report, including lawyers, agents, and family members."
    },
    {
      "title": "Determine whether that city provides police reports by mail or online.",
      "content": "Determine whether that city provides police reports by mail or online. Some cities ask you to request police reports in person at the police station. However, you might be working with a department that lets you file a request either by mail or on the internet. Visit the website for department you're working with. Search for an online form or a downloadable pdf that you can mail back to them. If you can't find what you're looking for, call the department and ask if they allow mailed requests."
    },
    {
      "title": "Download Adobe Reader if necessary.",
      "content": "Download Adobe Reader if necessary. [1] X Research source If your local police department allows you to download a copy of its police report request form, there's a good chance it will be a pdf. Although some computers come equipped with pdf-reading software, not all do. Adobe Reader is a free product that will enable you to open, read, and print the form from your home computer."
    },
    {
      "title": "Familiarize yourself with the form.",
      "content": "Familiarize yourself with the form. Once you have it, read through the form to make sure you can provide all the information it asks for. Although the form may vary from city to city, there's a good chance it will ask for the following information [2] X Research source : The names and address(es) of the parties/victim(s) involved The date and location of the incident The report or incident number, if available An insurance policy number and/or claim number. Note: this is required only if the person requesting the report works for an insurance company A release form from the victim, if an attorney is filing the request The type of incident — was it a robbery, assault, automobile accident, etc. Proof of relationship for parents of minor victims or the spouses/relatives of deceased victims You can view a pdf of the San Francisco PD's request form to familiarize yourself with what documents of this sort look like."
    },
    {
      "title": "Fill the form out accurately.",
      "content": "Fill the form out accurately. Double check all the information on the form before you submit it to the police department. Any little mistake might make it more difficult for the department to respond to your request. For example, make sure you don't swap two numbers in a report number or misspell the name of one of the involved parties."
    },
    {
      "title": "Include an SASE if mailing the request.",
      "content": "Include an SASE if mailing the request. If you are submitting your form by mail, you should include an SASE — self-addressed, stamped envelope. This both puts the cost of the postage on your shoulders, and ensures that the department sends the police report to the right address."
    },
    {
      "title": "Check the hours for police report requests.",
      "content": "Check the hours for police report requests. Some law enforcement agencies only entertain requests for police reports on certain days. Call the department you're working with or visit their website for that information. For example, the City of San Diego Police Department only allows in-person requests on Wednesdays between 8:00 a.m. and 3:30 p.m. [3] X Research source"
    },
    {
      "title": "Visit the appropriate law enforcement agency.",
      "content": "Visit the appropriate law enforcement agency. Even if the department allows online or mailed requests, going in person will help the process move more quickly. While you're there, the officers can answer any questions you may have and provide further directions."
    },
    {
      "title": "Locate the information desk or records division.",
      "content": "Locate the information desk or records division. Ask for directions to the desk that will to help you with your request. The officers there will provide you with paperwork to fill out, and also answer any questions you have about the process. The request form will ask for contact information and identifying details about the incident. See Method 1 above for a detailed list of information you may be required to provide. You may have to provide a current photo ID to verify your identity and address before they can process the request. The officers might make a copy of your photo ID for their records. The waiting period will depend on the individual police department you're working with. Usually, police reports take 1-5 days to be found, processed and copied, but ask the officers helping you for an estimate."
    },
    {
      "title": "Pay the fee, if required.",
      "content": "Pay the fee, if required. Not all law enforcement agencies have one, but the one you're working with might charge a fee for each report you request. This fee covers the department's cost in copying and handling the report. The amount will vary from agency to agency. Call ahead to find out the cost so you bring enough money to the department."
    },
    {
      "title": "Pick up the police report.",
      "content": "Pick up the police report. The police department will contact you when your report is ready. If they asked you to provide a stamped, self-addressed envelope when you submitted the request, you'll just receive the report in the mail. You may not receive your copy of the police report within the time frame the department provided. If that's the case, call them to ask about its status."
    }
  ]
}