{
  "url": "https://www.wikihow.com/Remove-a-Broken-Key-from-a-Car-Lock",
  "title": "How to Remove a Broken Key from a Car Lock",
  "steps": [
    {
      "title": "Look at the lock to see how much of the key is sticking out.",
      "content": "Look at the lock to see how much of the key is sticking out. The removal technique you use depends on how much of the key visible. If some of the key is jutting out of the lock, you’re in luck! You can remove the broken key with a pair of needle nose pliers. [1] X Research source If none of the key is sticking out of the lock, use a broken key extractor tool to get it out. The rest of this article will explain how to do it."
    },
    {
      "title": "Rotate the lock back to the insert position, if needed.",
      "content": "Rotate the lock back to the insert position, if needed. If the lock is rotated out of position, use your thumb or a small stiff object to rotate the lock to the insert position. The “insert” position is the position the lock is normally in when you insert your car key. [2] X Research source"
    },
    {
      "title": "Grab the protruding key with tweezers or pliers and pull it out.",
      "content": "Grab the protruding key with tweezers or pliers and pull it out. Grip the key with the pliers and pull it straight out. Resist the urge to turn the key with the pliers as you're pulling it out. You might break the key off inside the lock. [3] X Research source As long as there’s enough key protruding to grip with pliers, this should work. If the key isn't budging, try spraying WD-40 into the lock mechanism to loosen it up. [4] X Research source If you accidentally break the key off inside the lock, follow the remaining steps to remove it."
    },
    {
      "title": "Rotate the lock to the insert position.",
      "content": "Rotate the lock to the insert position. If the lock is rotated into some position between the key insertion and operate positions, use your thumb or a small stiff object to rotate the lock to the insert position. [5] X Research source The “insert” position is the position the lock is normally in when you insert the key."
    },
    {
      "title": "Spray lubricant inside the lock cylinder.",
      "content": "Spray lubricant inside the lock cylinder. A lubricant like WD-40 should do the trick, but you can use special lock lubricant if you happen to have that on hand. Be sure to spray the lubricant liberally and at all angles so it really gets in there and saturates the mechanism. [6] X Research source"
    },
    {
      "title": "Pick up a narrow key extractor tool with a hooked end.",
      "content": "Pick up a narrow key extractor tool with a hooked end. Choose a tool that is narrow enough to slip into the lock “key way,” which is the straight opening in the lock that extends down from the key opening itself. Make sure the tool you buy has 1 or more hooks on the end that extend upwards to grab the key teeth. [7] X Research source You can buy this tool at hardware and automobile parts stores."
    },
    {
      "title": "Slide the tool into the lock cylinder with the hook end pointed sideways.",
      "content": "Slide the tool into the lock cylinder with the hook end pointed sideways. Gently insert the key removal tool into the lock “key way.” Turn the hook or hooks sideways while inserting the tool so that they do not catch on the teeth of the key during insertion. Gently jiggle the tool until it won't go in any further. [8] X Research source"
    },
    {
      "title": "Turn the tool so the hook or hooks are facing the key.",
      "content": "Turn the tool so the hook or hooks are facing the key. Slowly and gently pull the tool back, jiggling the tool if necessary, so the hook or hooks engage or grab onto one or more of the key’s teeth."
    },
    {
      "title": "Pull the tool back slowly until a small part of the key peeks out.",
      "content": "Pull the tool back slowly until a small part of the key peeks out. Use a slow, straight, and smooth motion to pull the tool back. If the key doesn't start coming out of the lock, the hook or hooks didn't catch the teeth properly. [9] X Research source If this happens to you, simply pull out the tool and reinsert it into the cylinder just like you did before. Get the hook around the key's teeth and gently pull."
    },
    {
      "title": "Pull the key all the way out with your fingers or pliers.",
      "content": "Pull the key all the way out with your fingers or pliers. Once enough key is sticking out enough for you to grab it with your fingers or pliers, go ahead and pull it all the way out. [10] X Research source"
    }
  ]
}