{
  "url": "https://www.wikihow.com/Dimension-Door-5e",
  "title": "Dimension Door Explained for D&D 5e: Rules, How the Spell Works & More",
  "steps": [
    {
      "title": "Dimension Door is a 4th-level conjuration and teleportation spell.",
      "content": "Dimension Door is a 4th-level conjuration and teleportation spell. There are several spells that allow you to teleport various distances in D&D 5e, and Dimension Door is one of them. When you cast Dimension Door, your PC (player character) can teleport themselves from their current location to any spot within range—and appear in the exact spot they choose. [1] X Research source Casting time : 1 action Range : 500 feet Target : Self (and up to one willing creature) Components : Verbal Duration : Instantaneous"
    },
    {
      "title": "You can teleport up to 500 feet away in any direction.",
      "content": "You can teleport up to 500 feet away in any direction. The spell’s range is 500 feet, meaning that’s the distance you can teleport with it. However, you don’t have to teleport exactly 500 feet; you can teleport anywhere, as long as it’s 500 feet away or less. That means you can use the spell to go up and down floors, escape buildings, vanish from (or appear on) battlefields, and more. [2] X Research source However, if you teleport to a spot that’s already occupied by an object or creature, your PC (and any creature with them) will take 4d6 damage, and the spell will fail. You can use the squares of a battle mat to determine how far your PC can go. If there’s no map, it’s up to your DM to determine the size of the area and where 500 feet will get you. The spell doesn’t create (or require) a literal door when cast; “Dimension Door” is simply the name of the magical effect."
    },
    {
      "title": "You must be able to see, visualize, or describe your destination.",
      "content": "You must be able to see, visualize, or describe your destination. Unlike some spells, which require a line of sight to work, you don’t need to be able to see your destination to use Dimension Door. However, if you can’t see your target spot and don’t know what it looks like, you’ll have to describe the distance and direction you plan to travel instead. [3] X Research source For example, you might say, “I’m using Dimension Door to teleport 300 feet straight up,” or “I’m teleporting southeast at a 60-degree angle, 450 feet away.” If you have the time for it, you can use a spell like Scrying or Clairvoyance to get a visual of an area before you try teleporting there."
    },
    {
      "title": "You can bring objects and a single willing creature with you.",
      "content": "You can bring objects and a single willing creature with you. When casting Dimension Door, you can bring objects as long as they don’t weigh more than your PC can carry. Additionally, you can teleport with one creature, as long as they’re willing and your PC’s size or smaller. That creature also can’t be carrying more than their carrying capacity and must be within 5 feet of you. [4] X Research source Size in D&D is relative, and all creatures are sorted into size categories: tiny, small, medium, large, huge, or gargantuan. Most D&D PCs are medium, with a few exceptions (like gnomes and halflings, who are small). So, if your PC is medium, that means they can Dimension Door with a creature whose size is medium, small, or tiny."
    },
    {
      "title": "The spell doesn’t need somatic or material components.",
      "content": "The spell doesn’t need somatic or material components. There are 3 types of components in 5e: verbal (spoken words), somatic (hand gestures), and material (physical ingredients or objects needed for the spell). Many spells require a combination of components—but Dimension Door is only verbal. That means your PC only needs to be able to speak to cast the spell. [5] X Research source This is important because it means Dimension Door is still accessible even if your PC is restrained or unable to move their hands to perform somatic components of spells."
    },
    {
      "title": "Escape dangerous enemies with Dimension Door.",
      "content": "Escape dangerous enemies with Dimension Door. If you’re in a tight spot and need to make a quick getaway, Dimension Door can help you put a significant amount of distance between yourself and any enemies who are threatening you. After all, few creatures can travel 500 feet in a single round—so you’ll also get a head start if you need to run away. For example: [6] X Research source If a group of angry gnolls corners your PC in a cave, you could use Dimension Door to teleport right out of the cave and get away. If you’re trying to negotiate with a corrupt lord and things go sour, you could teleport to a safer spot with Dimension Door. If your PC gets wounded in a fight with a rampaging devil, you could get out of range (without provoking an opportunity attack) with Dimension Door."
    },
    {
      "title": "Teleport around traps, dangerous terrain, and other obstacles.",
      "content": "Teleport around traps, dangerous terrain, and other obstacles. Because it allows you to teleport one other creature, Dimension Door is ideal for navigating obstacles you and your other party members might otherwise struggle with. Even if the DM tries to trip you up with tricky puzzles and traps, Dimension Door is a loophole that’ll make your life a little easier. [7] X Research source For example, if you can’t pick or break down a locked door, you can Dimension Door to the other side. If you’re trying to cross an unstable stretch of land riddled with magma, quicksand, or a dungeon floor covered in traps, Dimension Door can get you to the other side in a flash. Keep in mind that you can't augment Dimension Door by twinning it with the sorcerer's metamagic feature (since you can only twin spells that target creatures)."
    },
    {
      "title": "Sneak in and out of dangerous areas without getting caught.",
      "content": "Sneak in and out of dangerous areas without getting caught. Sometimes, a little magic is the key to a successful D&D heist. Whether you’re trying to steal something important, rescue someone, or scout out an area, you can easily Dimension Door in and out to get what you need fast, without being detected (or having to fight your way out, even if you’re seen). [8] X Research source For example, if a friendly NPC (non-player character) gets locked in a prison cell, you could Dimension Door into the cell, grab them, and teleport right back out. If you need to retrieve a valuable artifact from a bandit camp, you could wait until most bandits are asleep, Dimension Door to the area with the artifact, pick it up, and teleport away."
    },
    {
      "title": "Maneuver into better positions in battle with Dimension Door.",
      "content": "Maneuver into better positions in battle with Dimension Door. Even if you’re not trying to get out of a battle, Dimension Door can still be an incredibly handy spell in combat. Need to get an ally closer to a certain enemy or reposition yourself on the battlefield to get a line of sight on an enemy so you can target them? Dimension Door is the spell to use. [9] X Research source For example, you could Dimension Door the party’s fighter up to the top of a balcony or cliff where an enemy spellcaster is stationed. You could also teleport the party barbarian onto the back of a dragon that’s trying to flee so they can stop it in its tracks. Some players might also try to use Dimension Door to halt their momentum or teleport to a safe spot (when falling from a great height, for example) and avoid taking damage. Since the rulebook doesn't discuss momentum, it's definitely possible to use Dimension Door this way—but ultimately, it's up to the DM if they allow this maneuver."
    },
    {
      "title": "Dimension Door is a very useful spell, especially in combat.",
      "content": "Dimension Door is a very useful spell, especially in combat. Although some spells go further than 500 feet, they’re not available until higher levels—so Dimension Door is the farthest-reaching teleportation spell of the 4th-level spells and below. It’s also one of the few spells with only verbal components that lets you teleport without seeing your destination, making it versatile and convenient. [10] X Research source The main drawback is that it takes an action to cast (meaning you likely won’t be able to attack or cast a damage-dealing spell in a round if you use it). For small races (like gnomes and halflings), Dimension Door may not be worth having unless most of the party is small, too (since they can’t Dimension Door with medium-sized creatures and up). To make Dimension Door even stronger as a spell, you could take the Metamagic Adept feat (or play a sorcerer to gain the Metamagic class feature). Metamagic allows you to augment spells; you could use Quickened Spell to cast Dimension Door as a bonus action or Subtle Spell to cast it without any components (even verbal)."
    },
    {
      "title": "Bards, sorcerers, warlocks, and wizards can use Dimension Door.",
      "content": "Bards, sorcerers, warlocks, and wizards can use Dimension Door. If you’re playing a PC with any of the aforementioned classes, you can simply have your PC learn Dimension Door when they gain the ability to cast 4th-level spells. However, a few subclasses can also cast Dimension Door, even if the overall class can’t. These include: [11] X Research source Eldritch Knight (Fighter subclass) . They learn from the wizard spell list and can get DImension Door at the 20th level. Oath of Vengeance (Paladin subclass) . They get Dimension Door at the 13th level as part of a subclass feature. Fey Wanderer (Ranger subclass) . They get Dimension Door at the 13th level as part of a subclass feature. Arcane Trickster (Rogue subclass) . They learn from the wizard spell list and can get Dimension Door at the 20th level. Trickery Domain (Cleric subclass) . They get Dimension Door as a domain spell at the 9th level."
    }
  ]
}