{
  "url": "https://www.wikihow.com/Break-in-High-Heel-Shoes",
  "title": "How to Break in High Heel Shoes",
  "steps": [
    {
      "title": "You can break them in while you watch TV, fold laundry, or do chores.",
      "content": "You can break them in while you watch TV, fold laundry, or do chores. The more time you spend wearing your heels, the more they will stretch. As they do so, they will conform to the shape of your feet. If they’re too uncomfortable to wear all day, consider wearing them for a few hours at a time. [1] X Research source As they get more comfortable, try wearing them when you’re out and about! Take your heels to work and wear them while you sit at your desk. Once you feel comfortable wearing and walking short distances in your heels, take them out. Wear them on a short trip to the grocery store or to your local bank."
    },
    {
      "title": "Socks can speed things up if you need to break them in fast.",
      "content": "Socks can speed things up if you need to break them in fast. It may be a fashion faux pas, but no one has to know! Slip on a pair of socks and put on your high heels. Wear them around your house as you do household chores, work from home, or hang out watching TV. After a few days, your shoes will start to mold to the shape of your feet and stretch slightly due to the extra padding of the socks. [2] X Research source For your socks to stretch your shoes properly, they can't be too thin or too thick. Try a simple athletic sock! The protective cushion of the socks also helps your feet stay blister-free!"
    },
    {
      "title": "Push down on the back of each heel with the palm of your hand.",
      "content": "Push down on the back of each heel with the palm of your hand. Gently bend and twist the heel as you apply pressure. Make sure you avoid pushing too hard on your shoes or forcing them into a position that they shouldn't be making. Doing so could damage the shoes or weaken them in places that should remain sturdy. [3] X Research source After trying out this method, slip on your heels to test out their comfier fit!"
    },
    {
      "title": "Run a blow dryer on low to medium heat for 1-2 minutes.",
      "content": "Run a blow dryer on low to medium heat for 1-2 minutes. Though this method is safe to use on leather shoes, make sure to avoid overheating them. Blast the heat throughout instead of lingering too long on one part of the shoe and stop immediately if your shoes are getting dangerously hot. [4] X Research source After 1-2 minutes, bend and twist your heels while they’re still warm. [5] X Research source Alternatively, wait until the shoes have cooled and put them on with a pair of socks to stretch them out like before!"
    },
    {
      "title": "As the water freezes, it will expand inside the shoe and stretch them out.",
      "content": "As the water freezes, it will expand inside the shoe and stretch them out. Fill a freezer bag halfway with water. Squeeze the air out of the bag and close it. Gently stuff the bag inside the shoe until it fills all of the empty space down to the toe. Next, put the shoes into the freezer and keep them there until the water freezes completely. Once the water is frozen, remove the bags and try on your shoes. [6] X Research source Repeat the process if the shoes still feel too tight!"
    },
    {
      "title": "Stick moleskin on the backs of your heels and sides of your toes.",
      "content": "Stick moleskin on the backs of your heels and sides of your toes. Moleskin helps prevent blisters and pain, as the fabric provides a layer of protection as your feet rub against your heels throughout the day. Cut individual pieces of moleskin and apply them directly to your feet before putting on your heels for the day. [7] X Research source The material will adhere to your skin like a bandage."
    },
    {
      "title": "Apply bandaids to the back of your heels and the tops of your toes.",
      "content": "Apply bandaids to the back of your heels and the tops of your toes. These give you a protective barrier between your skin and your new heels. They may also be easier to find around your house than moleskin. [8] X Research source Purchase small bandages so that they fit inside your shoe and don't peak out of your heels while you wear them!"
    },
    {
      "title": "Reducing sweating prevents moisture from causing your shoes to slide.",
      "content": "Reducing sweating prevents moisture from causing your shoes to slide. Less friction between your skin and your new heels means fewer blisters! Rub a stick of deodorant on the back of your heels, the top of your toes, the sides of your feet, and other blister-prone areas. [9] X Research source You can also try an anti-blister stick for the same effect. [10] X Research source"
    },
    {
      "title": "Stick the inserts to the inside of each shoe.",
      "content": "Stick the inserts to the inside of each shoe. For the best protection, apply the inserts to the back of the heel and the bottom of the shoe near the toe. These will prevent your feet from sliding and even add a comfy cushion to your heels. [11] X Research source You can purchase gel inserts at shoe stores and most drugstores."
    },
    {
      "title": "This will give the surface of your new shoes more traction.",
      "content": "This will give the surface of your new shoes more traction. New high heels tend to have smoother bottoms, which causes them to slip as you walk. Rub a sheet of sandpaper on the bottoms for a minute or two, or until the bottoms feel noticeably rougher. Walking in high heels is a lot easier and safer if they're not sliding around all over the place! [12] X Research source"
    },
    {
      "title": "This keeps your shoes from shrinking when they aren't being worn.",
      "content": "This keeps your shoes from shrinking when they aren't being worn. Since don't want all of your efforts to break in your shoes to be in vain, keep them stuffed when you're not wearing them. Mold newspaper into the shape of the shoe and store them in your closet! [13] X Research source If you don’t have any newspaper around your house, rags work just as well! If your shoes come with a shoe rod, use that instead."
    },
    {
      "title": "Silica gel absorbs moisture and keeps your shoes from shrinking.",
      "content": "Silica gel absorbs moisture and keeps your shoes from shrinking. Check the shoe box your shoes came in for a little white packet containing silica gel. Stick the packets in your shoes when you're not wearing them. This will help prevent your shoes from losing their stretch! [14] X Research source You can ask a shoe store associate for extras, if necessary."
    },
    {
      "title": "This may seem unusual, but it can help stretch out your heels quickly.",
      "content": "This may seem unusual, but it can help stretch out your heels quickly. First, select two potatoes large enough to puff up your shoes once inserted. Peel the potatoes first. Doing so will allow the moisture of the potatoes’ juices to soften the material inside your shoes. This will make the shoes stretch out even more! Next, stuff the potatoes into your shoes overnight. [15] X Research source Wipe your shoes clean before wearing them to get rid of any potato residue."
    },
    {
      "title": "Use this tool to stretch the width and length of your heels.",
      "content": "Use this tool to stretch the width and length of your heels. Insert the shoe stretcher into your shoes. Twist the stretching knob until the knob becomes tight and you can feel tension at the sides of the shoe. Let the shoe sit with the shoe stretcher inside overnight. [16] X Research source Be careful not to overstretch or damage the shoe. If you find the shoe coming loose from the sole, stop stretching your shoe! This tool comes in a variety of models, but they are most often made of wood or plastic."
    },
    {
      "title": "Visit a shoe repair shop for this method.",
      "content": "Visit a shoe repair shop for this method. If trying to break in your high heel shoes doesn't seem to be working or you don't have the time to try these DIY methods, a professional can use a shoe stretching machine for a quick fix. The machine applies the same techniques as common home remedies, like using pressure and heat, to stretch your show quickly. [17] X Expert Source Kathi Burns, CPO® Board Certified Professional Organizer Expert Interview. 31 December 2019. Many shoe stores will stretch shoes for you before you purchase them to help them fit better."
    }
  ]
}