{
  "url": "https://www.wikihow.com/Keep-Ribbon-from-Fraying",
  "title": "How to Keep Ribbon from Fraying",
  "steps": [
    {
      "title": "Find extremely sharp fabric scissors.",
      "content": "Find extremely sharp fabric scissors. The sharper the scissors, the better the edge of the ribbon will be."
    },
    {
      "title": "Measure the length of your ribbon.",
      "content": "Measure the length of your ribbon. Snip the edge at a 45-degree angle, or cut it in an inverted “v” shape to discourage fraying."
    },
    {
      "title": "Purchase clear nail polish.",
      "content": "Purchase clear nail polish. Use a good quality, trusted brand that you know encourages long wear."
    },
    {
      "title": "Dip the nail polish brush into the nail polish.",
      "content": "Dip the nail polish brush into the nail polish. Wipe the brush on the top of the bottle to remove excess polish."
    },
    {
      "title": "Apply a thin layer to the edges of the ribbon.",
      "content": "Apply a thin layer to the edges of the ribbon. You can either hold the ribbon in your hand and paint it at the very edge or lay it flat and paint one side, and then flip it and paint the other side."
    },
    {
      "title": "Pick it up and hold it to ensure it doesn’t adhere to a surface.",
      "content": "Pick it up and hold it to ensure it doesn’t adhere to a surface."
    },
    {
      "title": "Repeat an additional time for extra hold.",
      "content": "Repeat an additional time for extra hold. Try not to apply it in a thick coat or past the edge. It can make the ribbon look dark and wet if applied too heavily. For best results test a piece of ribbon before you start to make sure it doesn’t ruin the surface."
    },
    {
      "title": "Purchase an anti-fraying spray or liquid at a craft store or online.",
      "content": "Purchase an anti-fraying spray or liquid at a craft store or online. If you plan to wash your ribbons frequently, this is the best option. Opt for clear craft glue if you can’t find anti-fray liquid."
    },
    {
      "title": "Cut your ribbon at a 45-degree angle or in an inverted “v” shape if possible.",
      "content": "Cut your ribbon at a 45-degree angle or in an inverted “v” shape if possible. [1] X Research source"
    },
    {
      "title": "Squeeze a small amount of strong, clear glue or anti-fraying liquid out of the bottle.",
      "content": "Squeeze a small amount of strong, clear glue or anti-fraying liquid out of the bottle. [2] X Research source"
    },
    {
      "title": "Dab it with a cotton swab.",
      "content": "Dab it with a cotton swab. Swirl the tip against a paper towel to remove excess liquid."
    },
    {
      "title": "Drag the cotton swab against the very edge of the ribbon on either side.",
      "content": "Drag the cotton swab against the very edge of the ribbon on either side."
    },
    {
      "title": "Hold it aloft until it is fairly dry or hang it from a clothesline to ensure it doesn’t stick to a surface.",
      "content": "Hold it aloft until it is fairly dry or hang it from a clothesline to ensure it doesn’t stick to a surface."
    },
    {
      "title": "Ensure that the ribbon you want to seal is synthetic.",
      "content": "Ensure that the ribbon you want to seal is synthetic. Most satin and grosgrain ribbons sold at craft stores are synthetic. Burlap and cotton ribbons can’t be heat-sealed."
    },
    {
      "title": "Light a candle near a sink or bucket of water.",
      "content": "Light a candle near a sink or bucket of water. Throw the ribbon in the water if it catches fire. Open a window."
    },
    {
      "title": "Cut your ribbon with fabric scissors at a 45-degree angle to discourage fraying.",
      "content": "Cut your ribbon with fabric scissors at a 45-degree angle to discourage fraying. [3] X Research source"
    },
    {
      "title": "Hold the edge of the ribbon between your thumb and forefinger.",
      "content": "Hold the edge of the ribbon between your thumb and forefinger. Your fingers should be as far away as possible, while allowing the ribbon to be stiff on its side."
    },
    {
      "title": "Drag the very edge of the ribbon next to the flame.",
      "content": "Drag the very edge of the ribbon next to the flame. In most cases it does not need to be inside the edge of the flame to burn the edge. Move quickly and steadily across the edge. [4] X Research source"
    },
    {
      "title": "Hold it between your fingers to let it cool.",
      "content": "Hold it between your fingers to let it cool. Swipe your finger along the edge after 30 seconds. It should feel hard where it has sealed. Repeat the process again, moving the ribbon closer to the flame if the edge does not feel different."
    }
  ]
}