{
  "url": "https://www.wikihow.com/Break-the-%22Nice-Guy%22-Stereotype",
  "title": "How to Break the \"Nice Guy\" Stereotype",
  "steps": [
    {
      "title": "Know the signs of being a \"Nice Guy\".",
      "content": "Know the signs of being a \"Nice Guy\". They believe that if they are good, giving, and caring, that they will get happiness, love and fulfillment in return. They offer to do things for a girl they hardly know that they wouldn’t normally do for just anybody else they know. They avoid conflict by withholding their opinions or even become agreeable with her when they don’t actually agree. They try to fix and take care of her problems, they are drawn to trying to help. They seek approval from others. They try to hide their perceived flaws and mistakes. They are always looking for the “right” way to do things. They tend to analyze rather than feel. They have difficulty making their needs a priority. They are often emotionally dependent on their partner."
    },
    {
      "title": "Stop agreeing with everyone and everything.",
      "content": "Stop agreeing with everyone and everything. That doesn't mean that you should disagree or argue for its own sake, but you're your own person with your own opinions and preferences. If you find yourself agreeing with everyone, you might be undercutting your individuality. Think for yourself and speak up . Not every disagreement is an argument, and a difference of opinion can sometimes lead to interesting discussion in which you learn a great deal about how a person thinks and how they feel about a lot of things."
    },
    {
      "title": "Stop being a people pleaser",
      "content": "Stop being a people pleaser . Don't bend over backwards to accommodate everyone except yourself. [1] X Expert Source Michael Dickerson, PsyD Licensed Clinical Psychologist Expert Interview. 3 August 2021. If you identify with the \"nice guy\" dilemma, you're probably a kind person who loves to help people, and that's wonderful . But don't be so humble that you become a slave to everyone else's needs and expectations. It's healthy to have your own needs and goals, and to fulfill them and help others at the same time, without putting someone else's priorities way above yours. Avoid \"parasitic\" relationships where you give, give, give and never get. Strive to form mutually beneficial relationships. Learn to say no . When people ask you to do something that you don't feel comfortable doing, for whatever reason, you have every right to decline. If you find yourself saying yes without considering your time or desire to help, get in the habit of saying, \"Let me check my schedule and get back with you.\" This will give you a chance to reflect on your availability and rehearse how you will tell them \"no\". There are manipulative people in the world who will make you feel guilty (in a very subtle way). Learn how to recognize a controlling or manipulative relationship and break the pattern. Ask your friends and family for support to help them feel like they're important in your life too. [2] X Expert Source Michael Dickerson, PsyD Licensed Clinical Psychologist Expert Interview. 3 August 2021. Use nonviolent communication to convey your discomfort, concerns or needs. Some people are taught that it's not nice to say anything negative, but the fact is that there are conflicts in life and they need to be addressed in order to be resolved so we can have healthy, balanced and happy relationships. By learning gentle communication skills, such as giving a feedback sandwich , you'll feel much better about discussing topics that you would normally avoid."
    },
    {
      "title": "Draw the line.",
      "content": "Draw the line. Don't allow people to disrespect or ignore you. Stand up for yourself. If a co-worker steals your idea and passes it off as his own, you're not being nice by letting it slide. You're being a coward. If your date doesn't show up, and doesn't even bother to call beforehand or afterwards to explain, you're not being nice by overlooking a lack of consideration. You're being a doormat."
    },
    {
      "title": "Pace yourself.",
      "content": "Pace yourself. Be patient with yourself and with others. At work, this means not biting off more than you can chew. In dating, it means not getting too attached too quickly. Don't give someone everything they want, all at once, and expect nothing in return. Every relationship is a two-way street. At work, do you regularly stay late without being asked? Do you volunteer to help more than others, or pick up the slack for your co-workers? By doing this, you're communicating to your boss and co-workers that your time is not valuable; you give it away frequently and without being asked, and you never indicate that there's anything else you'd like to do with your time, and they might even be convinced that you enjoy staying late and working extra hard. To bring some balance back into the situation, there are a few things you can do: If your boss is giving you all the extra work because you do a better job than your co-workers, then ask for a raise or promotion. Ask your boss about hiring another staff person, or rotating who stays late until the work load subsides. Ask your boss how long he or she estimates the late nights will be necessary. There are plenty of people out there that rather than do the assignment themselves they will pass it on to you, or even volunteer you to take over a particular project, without even asking you if you're busy or not. Don't accept it. Tell them you need to review your workload first. Also let that person know that they should have been considerate to ask you before hand. If you do get dumped on (and you accept) then by all means don't take on the whole project by yourself. You would be setting yourself up for failure or worse. If you do a great job then it'll be your assignment for all eternity. Ask for an assistant or two. That way down the road you can come up with your own excuse to back out and leave it in their hands. When dating, don't shower a romantic interest with flowers, stuffed animals, jewelry, expensive dinners, a cruise, etc. in the very beginning. You're in the courtship phase and might feel like you need to show how worthy you are, but this person needs to show worthiness of being your mate as well. Does this person meet your standards? Save the bulk of your affection and gifts for someone who already supports you and shows appreciation. Wait for a love-interest to reach out to you once in a while. How could you really be certain that this person wants to spend time with you, if you're always the one calling and suggesting it? Continue spending time with your friends and pursuing your interests even when you're dating. Don't allow a romantic prospect to consume your life."
    },
    {
      "title": "Remember that you don't need anyone to be happy.",
      "content": "Remember that you don't need anyone to be happy. Once you feel you \"need\" something, as in you want it so badly that you'd do almost anything to get it, and it's something that only someone else can give to you (i.e. someone else's approval, regard, or affection) you essentially put your happiness completely in someone else's control. In other words, you give that person all the power, making yourself appear weak and \"needy\". Instead, base your self-worth on your own actions and efforts, rather than on how others perceive you. Rejection and criticism is difficult to deal with, but sometimes it's undeserved. Don't spend your whole life trying to keep other people from thinking negatively of you. Do what you feel is right , no matter what anyone else thinks. [3] X Expert Source Michael Dickerson, PsyD Licensed Clinical Psychologist Expert Interview. 3 August 2021. All you need to be happy, ultimately, is self-respect."
    },
    {
      "title": "Continue being nice.",
      "content": "Continue being nice. The niceness isn't what gets the stereotypical nice guy into trouble. You can be a gentleman without being a pushover. You can be sweet without being suffocating. You can be humble without being self-deprecating. It's all about finding a good balance. Surround yourself with nice people who will consider you as much as you consider them, and do your best to teach others how they can be nice to you and in general."
    }
  ]
}