{
  "url": "https://www.wikihow.com/Make-a-Narcissist-Addicted-to-You",
  "title": "8 Ways to Make a Narcissist Addicted to You",
  "steps": [
    {
      "title": "Make them work for the attention they crave.",
      "content": "Make them work for the attention they crave. When they walk into the room, don’t immediately run up and say hello—instead, wait for them to come to you. When they text you, wait a couple of hours before giving them a response. This waiting game is sure to make them squirm, and they won’t be able to resist trying to grab your attention. [2] X Research source Don’t ignore them completely—just let them know that they aren’t going to get your attention immediately or all of the time."
    },
    {
      "title": "They’ll be drawn to you if you're sure of yourself.",
      "content": "They’ll be drawn to you if you're sure of yourself. When you walk into a room, keep your head held high and look other people in the eye. Go up to people first and introduce yourself to command the room. Even if you don’t feel totally confident, you can fake it until you make it. Everyone is drawn to people with high self-esteem—especially those with narcissistic tendencies. Though they may seem like they have a high opinion of themselves, they usually struggle with deep-seated insecurity. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Keep in mind that they may attempt to make you feel “less than” in an effort to make themselves feel better. Just remember that it has nothing to do with you, and everything to do with their lack of self-esteem."
    },
    {
      "title": "Devoting your time to other people will make them want you more.",
      "content": "Devoting your time to other people will make them want you more. In relationships, self-absorbed people usually want to be the only person you’re spending time with. [4] X Research source They may even expect you to ditch your friends for them. Instead, make it a point to hang out with others, then tell them all about it. They’ll probably feel jealous and a little protective, and they’ll work even harder for your attention. Try taking pictures with your friends and posting them on social media for an easy way to show off how much fun you’re having."
    },
    {
      "title": "Confuse them by changing your behavior day by day.",
      "content": "Confuse them by changing your behavior day by day. If they like to be in control, turning the tables will keep them on their toes: compliment them and fawn over them one day, then be a bit distant the next. They’ll likely feel confused yet intrigued about your behavior. [5] X Research source For instance, you could meet them for a chat one day and then be too busy to talk to them the next. Or, you could text them back quickly one day and then leave their messages on read the next."
    },
    {
      "title": "Be spontaneous so they don't have all the power.",
      "content": "Be spontaneous so they don't have all the power. People with narcissistic tendencies like to have control, and they may even change plans with you at the last second to retain power. [6] X Research source You can give them a taste of their own medicine by changing the plans yourself so that you have the control. Not only will this frustrate them, but it might even impress them a little. “I know we had reservations at 7, but I called and canceled them. Let’s go to the food carts instead.” “Actually, I don’t want to go to the beach today. Let’s just stay in and be lazy.”"
    },
    {
      "title": "If they feed off of drama, play into that!",
      "content": "If they feed off of drama, play into that! If they have a hard time feeling empathy for others, they might even revel in drama, as long as it’s not happening to them. To make them addicted to you, try feeding into their love of drama by sharing stories from your friend group or talking about something crazy that happened at work. Even if they can’t participate in it, they’ll love hearing about it. [7] X Research source"
    },
    {
      "title": "They may appreciate being with someone who makes them look good.",
      "content": "They may appreciate being with someone who makes them look good. You don’t have to change up your look completely, but try to dress with current fashion trends in mind. Put on makeup if you wear it, make sure your hair looks nice, and keep your head held high. The better you look, the more they will want you. [8] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source People who are obsessed with their image and how they appear to others often consider it important to have an attractive partner."
    },
    {
      "title": "Point out their bad behavior to change them in positive ways.",
      "content": "Point out their bad behavior to change them in positive ways . Try pointing out the things they might do to become a better person to encourage them to change their ways. [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source This might make them feel insecure, but it might also make them work a little harder to please you. “I didn’t like it when you yelled at me earlier. It made me feel pretty bad.” “When you call me names, it makes me feel belittled.”"
    }
  ]
}