{
  "url": "https://www.wikihow.com/Improve-Reaction-Speed",
  "title": "How to Improve Reaction Speed",
  "steps": [
    {
      "title": "Get a game console and some action video games and play for 30 minutes a day.",
      "content": "Get a game console and some action video games and play for 30 minutes a day. The fast-paced nature of the gaming can increase your brain’s ability to process information. The gaming environment may also force you to get used to making quick decisions based on limited information. [1] X Research source In case you needed even more motivation to play video games, studies say that people who play action video games show an up to 25 percent speed increase in decision making when compared to people who do not play."
    },
    {
      "title": "There are a number of sites online that offer brain training.",
      "content": "There are a number of sites online that offer brain training. Mix it up to avoid training the same way over and over again, or your mind will adapt, and you’ll lose your edge. Instead, try some “old-fashioned” brain training methods, such as playing cards or a computer game. [2] X Research source You can also look at a sequence of numbers and try to memorize them. Then, see how long you can remember the numbers and write them back down correctly. Pick your friends’ and family members’ phone numbers so you can work on your reflexes and memorize their contact information at the same time."
    },
    {
      "title": "In your everyday life, try to consciously speed up your decision making.",
      "content": "In your everyday life, try to consciously speed up your decision making. If you feel yourself delaying or taking too much time, tell yourself, “faster, faster,” until you make a final move. Repeating this process will also help you to get used to the stress associated with quick decisions and learn how to keep your cool under pressure, a good skill no matter how fast your reflexes get to be. [3] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Try playing some online games where you have to make quick decisions. The timer in these games will force you to think faster in order to maintain a high score."
    },
    {
      "title": "This one almost feels like a game:",
      "content": "This one almost feels like a game: time yourself as you read single pages to see how long it takes to make it through. Then, see if you can cut down the seconds while still comprehending the material. Do this with a variety of types of reading to keep your mind flexible. You can also take a speed reading course online or at a local college. Soon you’ll be cutting down on both your reaction times and your study sessions. [4] X Research source Another way to practice speed reading is to glance through a page and mark out a single letter at a time. So, take a pencil and cross out every “a” on a single page. Do the same with other letters until you feel your speed increasing. Remember to erase the marks when you’re done if others want to enjoy the book!"
    },
    {
      "title": "Get a pack of gum and chew it when you know you need to be quick.",
      "content": "Get a pack of gum and chew it when you know you need to be quick. Or, grab a handful of sunflower seeds. It has been suggested that chewing stimulates the muscles in your mouth and jaw, which then send additional blood and activity up to your brain. You only need to chew for 10 seconds for an initial effect to occur, and you’ll get a boost for at least 15 minutes. Enjoy the burst of flavor, too! The benefits of this step are often not viewable to the naked eye and are measured in milliseconds of difference. However, for athletes in particular, shaving down even small amounts of time can have a positive effect."
    },
    {
      "title": "As coaches always say:",
      "content": "As coaches always say: get your head in the game! Sit and think about how you need to be fast and accurate in your upcoming task. It helps to visualize the task at hand before you begin and mentally go through all of the preparations that you have done. Approaching a task in a calm, precise manner can help you to harness your stress nerves and put them to good use. [5] X Research source Reminding yourself that you are in control can also lower the possibility of mistakes born out of nervousness, such as jumping the starting line."
    },
    {
      "title": "If you are working on something that requires concentration and speed, try to eliminate all other things that might grab your attention.",
      "content": "If you are working on something that requires concentration and speed, try to eliminate all other things that might grab your attention. For example, if you are driving in bad conditions and need to react quickly, turn off the radio and talk less with the car’s passengers. They won’t mind the quiet if they know their driver is taking good care of them. You can also combine this with other speed exercises too. For example, if you are playing a video game, minimize the distractions in your room so that you can focus."
    },
    {
      "title": "Sometimes it’s not your body that’s lagging--it’s your eyes!",
      "content": "Sometimes it’s not your body that’s lagging--it’s your eyes! To get them up to speed, choose two similar objects and place one nearby and another at a distance. Rotate between the two, trying to read each of them. You can also ask your eye doctor for other exercises. [6] X Research source You can also discuss eye agility training with a sports vision specialist. To find a doctor near you, go to the American Optometric Association’s website and do a doctor search. [7] X Research source"
    },
    {
      "title": "Cut a piece of cardstock so that it’s about 8 inches (20 cm) long and 2 inches (5.1 cm) wide.",
      "content": "Cut a piece of cardstock so that it’s about 8 inches (20 cm) long and 2 inches (5.1 cm) wide. Ask a friend to hold it vertically by the top. Line up your fingers with the bottom edge of the card and ask your friend to drop the card without warning. When the card is dropped, grab the card with your fingers as quickly as you can. This will show you how quickly you’re able to react. If you grab the card near the bottom, you likely have good reaction speed. If you grab the card near the top or miss it completely, you may have poor reaction speed. [8] X Research source"
    },
    {
      "title": "If you are practicing for a sport, this is a great way to work your athletic skills and reflexes at the same time.",
      "content": "If you are practicing for a sport, this is a great way to work your athletic skills and reflexes at the same time. Play a game of catch, kick around a soccer ball, or practice another sport-related drill. You could also get creative and use the ball for a different sport. Add more partners to make for an extra challenge. For example, if you are a baseball catcher, have your partner throw the ball behind you and then see how fast you can turn around and retrieve it. [9] X Research source [10] X Expert Source Peter Fryer Tennis Coach Expert Interview. 5 July 2019. Give juggling a try. The balls flying through the air forces you to think and act quickly to catch them. Practicing regularly can decrease your response time and increase your speed, and give you a great party trick too. [11] X Research source You can also use a reaction ball. This small, six-sided ball will move in unpredictable ways when bounced or thrown."
    },
    {
      "title": "Place a few cones at a distance apart and run between them as fast as you can.",
      "content": "Place a few cones at a distance apart and run between them as fast as you can. Switch up the position of the cones or run in a different way to mix things up. If you are playing a sport, ask your coach to suggest some specific agility drills that you can do. They’ll be impressed with your dedication, and even more impressed with the results. [12] X Expert Source Peter Fryer Tennis Coach Expert Interview. 5 July 2019. For example, try weaving through the spaces between each cone on your first run. In your second run, weave through every other space."
    },
    {
      "title": "Improving your balance can help to improve your reflexes.",
      "content": "Improving your balance can help to improve your reflexes. Try sitting on a yoga ball with just one foot on the floor, standing on one leg and hopping to the other leg, or passing a ball from hand to hand while standing on one leg. These exercises will all strengthen your balancing abilities. You can also try balancing things on your head or your fingertip. This will train you to continuously adjust your balance so that you don't drop the item."
    },
    {
      "title": "To stay mentally and physically quick, you must take care of yourself.",
      "content": "To stay mentally and physically quick, you must take care of yourself. Exercise at least 3 times a week, or more if possible. Exercise increases blood flow to your entire body, including your brain. Your body will thank you with speedier reaction times and plenty of endorphins. [13] X Research source If you are not used to exercising, work your way up with shorter simpler exercises. Start with a 15 to 30-minute walk, then move on to jogging or swimming."
    },
    {
      "title": "Eat healthy, balanced, and consistent meals.",
      "content": "Eat healthy, balanced, and consistent meals. Eating right gives your body the fuel needed to perform at its best. Work some eggs and spinach into your diet; they’re super foods for the brain, both containing the amino acid tyrosine, which has been shown to increase reaction speeds. [14] X Research source Conversely, drinking alcohol or using illegal substances can slow your reaction speeds down."
    },
    {
      "title": "If you are tired, you’ll respond sluggishly no matter how well you eat or exercise.",
      "content": "If you are tired, you’ll respond sluggishly no matter how well you eat or exercise. Make sure to get at least 8 hours of good, solid, undisturbed sleep a night. This will allow you to stay alert for longer periods. [15] X Research source How much sleep you need will depend on your personal needs. Typically, this will be between 7 and 9 hours. Don't get too much sleep either. If you wake up early, then go and start your day. Sleeping in can make your body and mind sluggish."
    },
    {
      "title": "It is very tempting to down a cup of coffee whenever you need speed and focus on a task.",
      "content": "It is very tempting to down a cup of coffee whenever you need speed and focus on a task. Be careful, though, because this one can backfire! Control your caffeine consumption so it boosts your response times without making you fidgety and scatter-brained. Stick to just 1 cup prior to working on a task requiring quick responses so you don’t get jittery and lose focused. [16] X Research source This also goes for energy drinks as well. Don't ditch the coffee only to replace it with a canned energy drink."
    },
    {
      "title": "Some medications can slow down your response time and reflexes.",
      "content": "Some medications can slow down your response time and reflexes. Or, you may even experience dizziness or blurred vision. If you need a high reaction speed, make sure to talk to your pharmacist or your doctor about how your medications might impact your abilities. This is an especially important step to follow if you are about to drive a motor vehicle. Even in good conditions, you’ll want to have sharp reflexes. Don’t get discouraged if you can’t change your medications at all. By working on your mental and physical agility, you can still improve your reflexes."
    }
  ]
}