{
  "url": "https://www.wikihow.com/Adjust-Valves-on-an-Aircooled-Volkswagon-(VW)--Beetle",
  "title": "How to Adjust Valves on an Aircooled Volkswagon (VW) Beetle",
  "steps": [
    {
      "title": "Determine valve clearance based on year:",
      "content": "Determine valve clearance based on year: [1] X Research source 1954 ~ 1960 (36HP) (Intake - .004\") (Exhaust - .004\") 1961 ~ 1965 (40HP) (Intake - .008\") (Exhaust - .012\") 1966 & Up (Intake - .006\") (Exhaust - .006\")"
    },
    {
      "title": "Assemble the required items:",
      "content": "Assemble the required items: [2] X Research source 19mm / 21mm wrench 13mm wrench Medium sized flat bladed screwdriver. feeler gauge (see above) 2 new valve cover gaskets"
    },
    {
      "title": "Remove both valve covers by placing the screwdriver under the center of the valve cover bails (wire clips holding on the valve covers) and prying downward.",
      "content": "Remove both valve covers by placing the screwdriver under the center of the valve cover bails (wire clips holding on the valve covers) and prying downward. If you have AC, you may need to slip a shop rag through the bail and give both ends a sharp snap downward to get the bail loose. [3] X Research source The bail will move downward releasing the tension on the cover and you'll be able to work the cover off. Some oil will drip down at this point, don't worry, it will be a small amount. Once it finishes dripping, use a rag to clean it off the heat exchangers."
    },
    {
      "title": "Remove the distributor cap.",
      "content": "Remove the distributor cap. The cap is held on by 2 clips, insert the screwdriver toward the top of the clip between the clip and the cap, gently pry outward and the clip will pop off the notches in the cap. Don't remove the wires or the rotor inside the cap, just pull the cap up off the distributor and place it to the side suspended by the spark plug wires."
    },
    {
      "title": "Use the 19mm or 21mm wrench to turn the engine over by the generator / alternator pulley bolt (bolt holding the upper fan belt pulley on).",
      "content": "Use the 19mm or 21mm wrench to turn the engine over by the generator / alternator pulley bolt (bolt holding the upper fan belt pulley on). If the belt is loose, it may slip as you turn the bolt, when this happens, grab both sides of the belt as it enters and exits the upper pulley and squeeze them together with one hand. Use the wrench to turn the pulley with the other, this will increase the tension enough to turn the engine over by this method."
    },
    {
      "title": "Start the valve adjustment with cylinder #1, the forward most cylinder located on the passenger side of the vehicle.",
      "content": "Start the valve adjustment with cylinder #1, the forward most cylinder located on the passenger side of the vehicle."
    },
    {
      "title": "Place #1 cylinder at top dead center (TDC).",
      "content": "Place #1 cylinder at top dead center (TDC). Do this by watching the distributor rotor. [4] X Research source There is a small notch (oriented at about 4 o'clock) cut into the top edge of the distributor where the cap meets the metal distributor body. Rotate the engine until the rotor is pointing directly at the notch. When it is lined up, look down at the crankshaft pulley (large pulley at the lower end of the fan belt). There will be a notch cut on the inside edge of the pulley that lines up with the split in the center of the engine case. It's a good idea to paint the notch with a small amount of visible paint (whiteout works for this but doesn't last). Line the notch up with the split, your engine is now at TDC for cylinder #1."
    },
    {
      "title": "Using the feeler gauge, measure the gap between the adjusting screw and the top of the valve for both the intake and exhaust.",
      "content": "Using the feeler gauge, measure the gap between the adjusting screw and the top of the valve for both the intake and exhaust. [5] X Research source Sometimes the gauge won't fit between the adjuster and the valve stem, in that case break the lock nut loose on the adjustment screw, loosen the screw one turn and insert the feeler gauge. If it requires more than one turn to get the gauge inserted, double-check TDC."
    },
    {
      "title": "Once the gauge is inserted in to the gap, tighten the adjusting screw gradually while sliding the gauge back and forth until there is a noticeable “drag\".",
      "content": "Once the gauge is inserted in to the gap, tighten the adjusting screw gradually while sliding the gauge back and forth until there is a noticeable “drag\"."
    },
    {
      "title": "Hold the screw in its location with a screwdriver and tighten the nut with the 13mm wrench.",
      "content": "Hold the screw in its location with a screwdriver and tighten the nut with the 13mm wrench. Do not over tighten the lock nut. It should be tight, not overly tight."
    },
    {
      "title": "Once you have completed both the intake and exhaust valves for cylinder #1, you are ready to move to the next cylinder.",
      "content": "Once you have completed both the intake and exhaust valves for cylinder #1, you are ready to move to the next cylinder."
    },
    {
      "title": "You must relocate each cylinder to TDC point.",
      "content": "You must relocate each cylinder to TDC point. At the rear of the car using the 19mm or 21mm wrench, turn the engine counter-clockwise so the crankshaft (large) pulley turns 1/2 turn or 180 degrees. [6] X Research source There will be another notch on the pulley exactly 180 degrees or halfway around from #1's TDC point. Line the notch up with the split, your engine is now at TDC for cylinder #2."
    },
    {
      "title": "Repeat the adjustment procedure on cylinder # 2.",
      "content": "Repeat the adjustment procedure on cylinder # 2. [7] X Research source"
    },
    {
      "title": "Rotate the crankshaft another 1/2 turn counter-clockwise until the original notch is lined up with the split in the case, adjust cylinder #3.",
      "content": "Rotate the crankshaft another 1/2 turn counter-clockwise until the original notch is lined up with the split in the case, adjust cylinder #3."
    },
    {
      "title": "Repeat the adjustment procedure on cylinder # 3.",
      "content": "Repeat the adjustment procedure on cylinder # 3. [8] X Research source"
    },
    {
      "title": "Rotate the crankshaft another 1/2 turn counter-clockwise and adjust cylinder #4.",
      "content": "Rotate the crankshaft another 1/2 turn counter-clockwise and adjust cylinder #4. [9] X Research source"
    },
    {
      "title": "Replace the distributor cap, ensure the cap clicks into the locating notch in the distributor housing, and set the hold down clips.",
      "content": "Replace the distributor cap, ensure the cap clicks into the locating notch in the distributor housing, and set the hold down clips. [10] X Research source"
    },
    {
      "title": "[[Image:Adjust Valves on an Aircooled Volkswagon (VW) Beetle Step 18.jpg||center Remove any traces of the valve cover gasket from the head and valve covers.",
      "content": "[[Image:Adjust Valves on an Aircooled Volkswagon (VW) Beetle Step 18.jpg||center Remove any traces of the valve cover gasket from the head and valve covers. Place the new gasket into a valve covers and place the cover on the head. Lift up the bale till it clicks into the notch in the valve cover, A screwdriver may be required to get it the last of the way on."
    },
    {
      "title": "Clean the bottom of the engine, remove all oil residue and recheck the oil, add as necessary.",
      "content": "Clean the bottom of the engine, remove all oil residue and recheck the oil, add as necessary."
    },
    {
      "title": "Start the engine and listen for loud tappet noise (clicking at idle).",
      "content": "Start the engine and listen for loud tappet noise (clicking at idle). If it is present, you may have mis-adjusted one of the valves."
    },
    {
      "title": "Check for oil leaks.",
      "content": "Check for oil leaks."
    }
  ]
}