{
  "url": "https://www.wikihow.com/Get-Highlighter-Out-of-Clothes",
  "title": "How to Remove Highlighter Stains From Clothes",
  "steps": [
    {
      "title": "Rubbing alcohol helps break down and lift the highlighter ink.",
      "content": "Rubbing alcohol helps break down and lift the highlighter ink. First, place paper towels or a rag behind the stained part of the fabric, so that no ink bleeds onto other parts of the clothing. Next, dip a clean rag or sponge into regular rubbing alcohol , and dab it all over the area surrounding the stain, then on the stain itself. [1] X Expert Source Susan Stocker Professional Cleaner Expert Interview. 8 November 2019. Make sure to apply a generous amount of rubbing alcohol to the area. The goal is to flush the highlighter ink out of the fabric and onto the paper towels behind it. [2] X Research source Once the stain is mostly gone, spray the area with the stain remover of your choice, such as Shout or Oxiclean . Finally, wash the clothing item as you normally would. If possible, wash the item on its own to prevent any leftover ink from transferring to other clothes. [3] X Research source Check the item before putting it into the dryer. If the stain is still there, repeat the whole process one more time before drying."
    },
    {
      "title": "Hairspray contains alcohol, which breaks down the highlighter ink.",
      "content": "Hairspray contains alcohol, which breaks down the highlighter ink. First, blot the stain with a clean cloth to soak up any excess liquid. Next, spray a generous amount of aerosol hairspray directly onto the stained area. While the stain is still wet from the hairspray, place the item in the washing machine and wash it with your regular laundry detergent. [4] X Research source Check to make sure the stain is fully removed before drying. If it’s still there, repeat the process one more time. [5] X Research source"
    },
    {
      "title": "Stain removers like Shout or Oxiclean work well to remove most stains.",
      "content": "Stain removers like Shout or Oxiclean work well to remove most stains. Start by blotting at the stain with a clean cloth to pick up any excess ink. Don’t wipe or scrub the stain, as this can push the stain further into the fabric. Next, spray the stain remover of your choice onto the area. [6] X Research source Some stain removers need to sit on the stain for a period of time, while others can be washed out right away. Be sure to follow the specific instructions listed on the product you’re using. After soaking the stain according to the product’s instructions, place the item in the washing machine and wash as normal. [7] X Research source"
    },
    {
      "title": "Your regular laundry detergent also works as a pre-treatment for stains.",
      "content": "Your regular laundry detergent also works as a pre-treatment for stains. Just apply a small bit of the detergent directly to the stained area, and let it sit for a few minutes. This lifts the stain more effectively than washing alone would. [8] X Research source Next, toss the clothing item in the washing machine and wash as usual."
    },
    {
      "title": "Regular dish soap is a great spot-treatment for stains.",
      "content": "Regular dish soap is a great spot-treatment for stains. Apply a small dollop of dish soap directly to the stain, and gently rub it in with your fingers. Next, wash the clothing item in the washing machine as you normally would. [9] X Research source Before trying this method, spot-test the dish soap on a small, hard-to-see area of your clothing to make sure it won’t cause any damage or discoloration to the fabric. [10] X Research source"
    },
    {
      "title": "Vinegar is a great natural stain remover.",
      "content": "Vinegar is a great natural stain remover. Just mix equal parts water and white vinegar , then apply the solution directly to the stained area. Let the mixture sit on the stain for about ten minutes, then use a soft scrub brush or toothbrush to gently scrub the ink stain. Finally, rinse out the vinegar, then wash the item in the washing machine as usual. [11] X Research source"
    },
    {
      "title": "A DIY baking soda paste can soak up stubborn highlighter ink stains.",
      "content": "A DIY baking soda paste can soak up stubborn highlighter ink stains. To start, mix equal parts baking soda and vinegar. [12] X Research source If you don’t have vinegar, plain water will also work. Apply the paste to the stain, and let it sit for several minutes. Next, scrub the area with a soft scrub brush or toothbrush, then rinse out the paste with water. Finally, wash the item as you normally would. [13] X Research source If you notice that the stain hasn’t fully lifted, repeat the process one more time before placing the clothing item in the washing machine. [14] X Research source You can also allow the paste to sit on the clothing overnight if the stain is particularly severe."
    },
    {
      "title": "The citric acid in lemon juice is great at breaking down stains.",
      "content": "The citric acid in lemon juice is great at breaking down stains. Just mix 1 ⁄ 3 cup (79 mL) lemon juice with 2 ⁄ 3 cup (160 mL) water, and apply the solution to the stain. Let it soak for about 15 minutes before rinsing out, then place the clothing item in the washing machine as usual. [15] X Research source Since lemon juice is a natural bleach alternative, it can cause damage to certain fabrics. [16] X Research source If you’re worried about how lemon juice will affect your clothing item, do a test on a small, unnoticeable patch of the garment before trying this method."
    },
    {
      "title": "A stain-removal pen or wipe can quickly target a fresh stain.",
      "content": "A stain-removal pen or wipe can quickly target a fresh stain. There are several options available, like Tide to Go pens or Shout stain removal wipes . [17] X Research source For most of these products, you’ll simply need to apply the detergent directly to the stain, rub it in, then let it dry. [18] X Research source"
    },
    {
      "title": "The alcohol in hand sanitizer breaks down highlighter stains quickly.",
      "content": "The alcohol in hand sanitizer breaks down highlighter stains quickly. This is a great option if you’re out and about, and you don’t have time to go home to use another stain treatment. [19] X Research source Just apply a small amount of hand sanitizer onto a paper towel and dab it on the stain. The highlighter ink should lift onto the paper towel, making the stain less noticeable."
    },
    {
      "title": "Start by lifting as much product as possible from the clothing item.",
      "content": "Start by lifting as much product as possible from the clothing item. Dab a piece of tape over the area to pick up any loose powder, or gently press a makeup remover wipe onto the stain if you spilled liquid highlighter. [20] X Research source Once you’ve removed the excess powder or liquid, apply color-free shaving cream to the area and let it sit for 10 minutes. [21] X Research source After 10 minutes, rinse the area with cool water, then wash the item as you normally would. Just avoid using this method on fabrics that are dry clean only. [22] X Expert Source Susan Stocker Professional Cleaner Expert Interview. 8 November 2019."
    }
  ]
}