{
  "url": "https://www.wikihow.com/Clean-New-Balance-Shoes",
  "title": "3 Ways to Clean Leather, Mesh, & Suede New Balances",
  "steps": [
    {
      "title": "Brush off loose dirt and debris with a soft bristle brush.",
      "content": "Brush off loose dirt and debris with a soft bristle brush . Move forward and backward, paying extra attention to any creases or stubborn areas. This will remove the outer layer of dirt to make cleaning easier. [1] X Research source Remove the laces during this stage if you’d like. You can purchase new laces or toss them into the wash in a mesh mag. You can also knock the shoes against each other to remove debris."
    },
    {
      "title": "Dip the brush into a mixture of mild detergent and warm water.",
      "content": "Dip the brush into a mixture of mild detergent and warm water. Designer Shoe and Bag Repair Specialist Rio Jongsae Kim recommends opting for a dye-free dish soap or laundry detergent to avoid staining your white, grey, or other light-colored shoes. Use a 1:1 ratio of water and detergent, stirring the solution to create a soapy mixture. Dip the brush and start scrubbing in circular motions. [2] X Research source You may need to switch to a medium brush for stubborn spots. You can also use a toothbrush for areas requiring more precision, such as seams or grooves. Before coating the shoes with the mixture, test a small amount of detergent on the back or sole of the shoe to ensure it doesn’t stain. [3] X Research source"
    },
    {
      "title": "Wipe off the shoes with a microfiber cloth.",
      "content": "Wipe off the shoes with a microfiber cloth . Remove the soapy residue with your cloth and look for any remaining dirt or stains. If your white New Balances are really dirty, you may need to do a second or third scrub to ensure you didn’t miss a spot. [4] X Research source Allow your shoes to air dry for 24 hours before wearing them."
    },
    {
      "title": "Avoid putting New Balances in the washing machine or dryer.",
      "content": "Avoid putting New Balances in the washing machine or dryer. These sneakers are made primarily with leather and recycled polyester, which cannot be exposed to high heat. [5] X Research source However, for mesh New Balances like the 990s or Fresh Foams, you may be able to run them through the washing machine on a cold cycle. Do so at your own discretion and place them in a mesh wash bag to keep them safe. [6] X Research source"
    },
    {
      "title": "Stuff the inside of the shoes with a microfiber cloth.",
      "content": "Stuff the inside of the shoes with a microfiber cloth. Mesh shoes have plenty of air holes, making them ideal for athletic use. To prevent the insides of your shoes from getting completely soaked, stuff a microfiber cloth or paper towel inside to absorb excess water and limit any odors. [7] X Research source You can also go in with a shoe deodorizer to eliminate and prevent any smells while it dries."
    },
    {
      "title": "Apply toothpaste with a toothbrush, rubbing in circular motions.",
      "content": "Apply toothpaste with a toothbrush, rubbing in circular motions. First, dampen the mesh using a wet soft bristle toothbrush or another cloth. Apply white toothpaste to the shoe once the mesh is damp and rub in circular motions until you see suds. [8] X Research source Mesh has multiple layers, so seeing suds may take some time. The more suds, the better. Keep the shoe damp and reapply toothpaste as needed. Only use white toothpaste to avoid staining white or light-colored shoes. If you’re working with a dark material, like black, navy blue, or brown shoes, you could try a different color of toothpaste. Test a spot before proceeding."
    },
    {
      "title": "Rinse and repeat until the shoes are clean.",
      "content": "Rinse and repeat until the shoes are clean. Continue to apply white toothpaste to the surface of your shoes, rubbing in circular motions until the suds no longer have dirt in them. Once satisfied, remove the towel inside the shoe with a fresh one and let it air dry for 24 hours."
    },
    {
      "title": "Prep the shoes by removing debris with a suede brush.",
      "content": "Prep the shoes by removing debris with a suede brush. Unlace your shoes to reach all of the nooks and crannies. Combine water and dish soap in a separate bowl to soak the laces. Then, go in with a suede brush to remove the outer layer of grime. [9] X Research source A soft bristle brush may be too delicate to remove debris, while a medium or hard brush can damage the material."
    },
    {
      "title": "Use a suede eraser to remove stains from the shoe.",
      "content": "Use a suede eraser to remove stains from the shoe. Designer Shoe Specialist Rio Jongsae Kim suggests applying firm pressure as you move forward and back with a suede eraser. Work on one section at a time, using the suede brush to remove the eraser fibers. This is an important step, as only erasing can send the dirt back into the fibers of the shoe, making the stains worse. Don't get suede wet, as it will damage the material. However, if you’re dealing with mud or deep stains, use a suede cleaner , instead. The eraser can be used on other shoe surfaces, including the sole. If you have deep stains, like permanent market, Kim recommends using suede gum to remove them."
    },
    {
      "title": "Blot the stain with rubbing alcohol.",
      "content": "Blot the stain with rubbing alcohol. If you have ink stains, for example, gently blot the stain with a microfiber cloth dipped in rubbing alcohol. Blotting is recommended to avoid spreading the stain around. Repeat until the stain has lifted, then go in with mild detergent and water. [10] X Research source"
    },
    {
      "title": "Use baking soda to remove oil stains.",
      "content": "Use baking soda to remove oil stains. Baking soda is abrasive, giving it enough grit to remove surface stains. Mix it with enough water to make a thick paste and apply it to the stain. Let it sit briefly before taking a soft bristle brush to the surface. Gently scrape the baking soda off and clean the area with soap and water. [11] X Research source"
    },
    {
      "title": "Apply a protectant spray to the surface.",
      "content": "Apply a protectant spray to the surface. Spray 7 inches (20 cm) away from the shoe, using a continuous motion. Start from the top of the shoe and work down. Let it air dry for 10 minutes, then add a second coat using the same steps. [12] X Research source These sprays are typically stain and water-resistant. Ensure you’re purchasing a spray suitable for the shoe's material."
    },
    {
      "title": "Regularly brush your shoes to remove dirt and debris.",
      "content": "Regularly brush your shoes to remove dirt and debris. Use a soft or medium bristle brush once a week to remove any lingering dirt and debris. If this is too much, you can knock your shoes together after each use to get into the habit."
    },
    {
      "title": "Use shoe trees to maintain the shape.",
      "content": "Use shoe trees to maintain the shape. Shoe trees are inserts that are recommended for leather shoes to maintain its shape. Shoe trees are shaped like a foot to avoid creases in the leather. Similarly, some are built to absorb moisture and fight odors."
    }
  ]
}