{
  "url": "https://www.wikihow.com/Diagnose-Polycythemia-Vera",
  "title": "How to Diagnose Polycythemia Vera",
  "steps": [
    {
      "title": "Document your symptoms in a journal.",
      "content": "Document your symptoms in a journal. Write down any symptoms that you experience. Then see if any of the symptoms you are experiencing are associated with polycythemia vera. Looking over your list of symptoms, circle any of the symptoms that match the following symptoms of polycythemia vera: [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Headache Bleeding or bruising Itchiness after bathing or showering Feeling dizzy Feeling weak or tired Sweating excessively Pain and swelling in one of your joints, such as a big toe Shortness of breath Bloating in your upper left abdomen Numbness of your limbs Tingling or burning sensations in your limbs Burning feeling in your feet Having a hard time breathing when you are lying down Ringing in your ears or tinnitus Chest pain Pain in your calf muscles"
    },
    {
      "title": "Make a doctor appointment.",
      "content": "Make a doctor appointment. If you find a match between any of your symptoms and common symptoms of polycythemia vera, you should make an appointment with your doctor. Bring your diary or health journal and show your doctor the symptoms you have listed. Ask your doctor whether you may have polycythemia vera and what actions you can take: [3] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source “Do you think I have polycythemia vera?” “Are there any tests that can be done to determine whether I have this disease?”"
    },
    {
      "title": "Seek emergency medical attention if you have any stroke symptoms.",
      "content": "Seek emergency medical attention if you have any stroke symptoms. If you have polycythemia vera, your blood flow slows down and your blood thickens. As a result, you are more likely to get blood clots. If you get a blood clot in your head, you can have a stroke. So, you should get emergency medical attention if you have any of the following symptoms of a stroke: [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Aphasia, or a hard time speaking or understanding speech Numbness of your face, arm or legs on one side of the body Weakness or paralysis of your face, arms or legs Blurred vision Double vision Decreased vision Severe or unusual headache Stiff neck and facial pain Vomiting and altered consciousness Onset of confusion Difficulty remembering things Spatial disorientation and lack of perception"
    },
    {
      "title": "Recognize if you are in an at-risk demographic.",
      "content": "Recognize if you are in an at-risk demographic. Polycythemia vera is more common among adults over the age of 60. If you are over the age of 60, you should be aware that you are in the at-risk demographic and tell friends and family members who are close to your or otherwise involved in your medical care. [5] X Trustworthy Source National Heart, Lung, and Blood Institute Research and education center within the National Institutes of Health Go to source"
    },
    {
      "title": "Notice any blood or bleeding problems.",
      "content": "Notice any blood or bleeding problems. These pose one of the complications associated with polycythemia vera. If you experience a lot of nosebleeds, for example, this could be from polycythemia vera. Similarly, if you have bleeding gums, bruise a lot, or experience bleeding in your gut, you may be experiencing some of the complications of polycythemia vera. [6] X Research source Too many red blood cells can also result in other problems like peptic ulcers and gout. [7] X Research source Polycythemia vera can also lead to acute leukemia. [8] X Research source"
    },
    {
      "title": "Observe any itchy or tingling skin.",
      "content": "Observe any itchy or tingling skin. Polycythemia vera can lead to red and itchy skin on your arms, hands, feet or legs. If your skin feels very itchy in a warm bed or after a shower, you may be experiencing one of the complications of this disease. [9] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Maintain awareness of blood clots and risk of heart attack.",
      "content": "Maintain awareness of blood clots and risk of heart attack. If you have this disease, your blood will thicken and slow down which can cause clotting. In turn, blood clots can induce serious health concerns such as heart attack. If you experience any of the symptoms of a heart attack, you should contact emergency medical help. [10] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Common symptoms of a heart attack include pain or tightness in your chest, aches in your chest and arms, pressure in your neck or jaw, nausea, indigestion, heartburn, cold sweat, quick breathing, lightheadedness and fatigue."
    },
    {
      "title": "Notice symptoms of an enlarged spleen.",
      "content": "Notice symptoms of an enlarged spleen. If you have polycythemia vera, your spleen may be working extra hard and may become enlarged. In your diary or health journal, write down any pain or discomfort you are feeling. See if these symptoms match the common symptoms for an enlarged spleen: [11] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Not being able to finish a meal Feelings of discomfort or pain on the upper left side of the abdomen Feeling of fullness on the upper left side of the abdomen Pain or discomfort on your left shoulder"
    },
    {
      "title": "Ask your doctor for blood tests.",
      "content": "Ask your doctor for blood tests. Blood tests are one of the common ways of diagnosing this disease. The blood count changes often occur slowly — polycythemia vera is actually most commonly diagnosed when a patient is receiving blood testing for other reasons. Your doctor may do a complete blood count in order to figure out whether you have an excessive number of red blood cells. They may also do blood tests to figure out whether your hemoglobin or hematocrit counts are high, which is another indicator of polycythemia vera. To figure out which type of polycythemia vera you have, your doctor may also test your levels of erythropoietin hormone. [12] X Research source Ask your doctor: “Can you do a blood test to determine whether I have polycythemia vera?” “What should I do to prepare for the blood test?”"
    },
    {
      "title": "Review the blood test results with your doctor.",
      "content": "Review the blood test results with your doctor. You should ask your doctor about the results of your blood test, which they may inform you about in person or over the phone. You should be aware of the test results that would indicate a positive diagnosis of polycythemia vera: [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Increased number of red blood cells More platelets or white blood cells Higher hematocrit measurement Higher hemoglobin levels Low levels of erythropoietin"
    },
    {
      "title": "Get a bone marrow biopsy.",
      "content": "Get a bone marrow biopsy. You should ask your doctor whether a bone marrow biopsy or aspiration would be appropriate. Your doctor will take a sample of your bone marrow material. If they do an aspiration, they will take out a liquid part of your bone marrow. Once they finish the tests, ask your doctor whether the tests showed that your marrow is overproducing blood cells. [14] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source You could ask: “Are the results of my test back?” “Is my bone marrow producing too many blood cells?” “Does the biopsy indicate that I have polycythemia vera?”"
    },
    {
      "title": "Ask your doctor whether test results indicate a gene mutation.",
      "content": "Ask your doctor whether test results indicate a gene mutation. Bone marrow or blood test results may also indicate the presence or absence of the gene mutation that is associated with polycythemia vera. You should inquire with your doctor about this gene mutation: [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source “Do the test results indicate the presence of the gene mutation associated with polycythemia vera?” “Do the test results show the gene mutation JAK2 V617F?”"
    },
    {
      "title": "Ask your doctor if there are any other tests you could take.",
      "content": "Ask your doctor if there are any other tests you could take. Your doctor may try some other tests such as looking at your vitamin B12 level, the oxygen saturation of your blood or a comprehensive metabolic panel test. Alongside your blood tests, these tests can help your doctor determine whether you have the disease. [16] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Talk to your doctor about next steps.",
      "content": "Talk to your doctor about next steps. If you were positively diagnosed with polycythemia vera, you should talk to your doctor about treatment options. Unfortunately, the disease cannot be completely cured and will be treated more as a chronic condition, with your doctor monitoring your health for complications. Treatment will focus on decreasing the signs, symptoms and complications associated with the disease. For example, your doctor may prescribe low-dose aspirin, a procedure called phlebotomy, medications like hydroxyurea and therapies to reduce itchy skin. [17] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Inquire with your doctor about treatment options: “How can we tackle this disease?” “What are the best medications available for treating polycythemia vera?” “Will I have to undergo the phlebotomy procedure?”"
    }
  ]
}