{
  "url": "https://www.wikihow.com/How-Long-Can-You-Screen-Record-on-iPhone",
  "title": "How Long Can You Screen Record on an iPhone?",
  "steps": [
    {
      "title": "You can screen record as long as your device has free space.",
      "content": "You can screen record as long as your device has free space. While there's no one limit to how long you can record your iPhone screen, you must factor in your device's model and how much capacity it has to save the video. Different screen sizes and iOS version can change the default quality in which Screen Recordings record. Different quality means different video sizes. As long as you have available space, you'll be able to Screen Record. You can free up space by using iCloud to store photos and videos."
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. This is the grey cog icon."
    },
    {
      "title": "Tap General.",
      "content": "Tap General . You can find this in the middle of the page, above Control Center ."
    },
    {
      "title": "Tap About.",
      "content": "Tap About . This will be at the very top."
    },
    {
      "title": "Search for Available.",
      "content": "Search for Available . This will be towards the middle of the page, underneath Capacity . You'll see your available space in GB to the right of Available ."
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. This is the grey cog icon. Use this method to add Screen Recording to the Command Center if you don't have it already. You must do this to record your iPhone screen ."
    },
    {
      "title": "Tap Control Center.",
      "content": "Tap Control Center . You can find this in the middle of the page, below General . You'll see a list of apps currently added to your Control Center and a list of available apps to add."
    },
    {
      "title": "Tap + next to \"Screen Recording\".",
      "content": "Tap + next to \"Screen Recording\". This will add Screen Recording to your Control Center . If you want to move its position, tap and drag the three lines icon."
    },
    {
      "title": "Unlock your phone.",
      "content": "Unlock your phone. Use your passcode or Face ID to open your iPhone. [1] X Research source Make sure to update your iPhone ."
    },
    {
      "title": "Open the Control Center.",
      "content": "Open the Control Center. This will vary depending on your device. [2] X Research source On iPhone X and later: swipe down on the top-right corner of the screen. On iPhone SE, iPhone 8, and earlier: swipe up from the bottom edge of the screen."
    },
    {
      "title": "Tap the Screen Recording icon.",
      "content": "Tap the Screen Recording icon. This looks like a filled circle inside of a circle outline. You'll see a 3-second countdown on the Screen Recording icon. You can use this time to navigate to a different screen, homepage, or app."
    },
    {
      "title": "Begin Screen Recording.",
      "content": "Begin Screen Recording. You'll see a red circle over the current time in the top-left corner of the screen. This shows you that there is an active Screen Recording."
    },
    {
      "title": "Stop Screen Recording.",
      "content": "Stop Screen Recording. Tap the red circle in the top-left corner, then tap Stop . Alternatively, open the Control Center again and tap the Screen Recording icon. Screen Recordings will automatically be saved to your Photos. To free up more space for more Screen Recordings, you can upload new videos to iCloud and delete them on your iPhone."
    }
  ]
}