{
  "url": "https://www.wikihow.com/Add-Admin-Commands-to-Your-Roblox-Place",
  "title": "How to Add Admin Commands to Your Roblox Place",
  "steps": [
    {
      "title": "Open up the Roblox library and navigate to HD Admin.",
      "content": "Open up the Roblox library and navigate to HD Admin. You can use other admins such as Adonis and Kuros. We are using HD Admin as it's open-source and the most up-to-date admin (as of 2019)."
    },
    {
      "title": "Take a copy of the model by clicking the green Get button.",
      "content": "Take a copy of the model by clicking the green Get button. Doing so will add the admin to your inventory."
    },
    {
      "title": "Head to the Create page (at the top-left of your screen).",
      "content": "Head to the Create page (at the top-left of your screen). This will open up a list of your Games."
    },
    {
      "title": "Find the place for which you want to add admin commands.",
      "content": "Find the place for which you want to add admin commands. If you do not have a place, click Create New Game and create your place."
    },
    {
      "title": "Click the Edit on the right-side of the game.",
      "content": "Click the Edit on the right-side of the game. This will open up Roblox Studio for that game."
    },
    {
      "title": "In the topbar, click VIEW and load up the Explorer and Toolbox.",
      "content": "In the topbar, click VIEW and load up the Explorer and Toolbox."
    },
    {
      "title": "In the Toolbox, navigate to Inventory.",
      "content": "In the Toolbox, navigate to Inventory . This will load up the inventory we added the admin to."
    },
    {
      "title": "Click and drag HD Admin into your place.",
      "content": "Click and drag HD Admin into your place. This will add the admin to your Explorer."
    },
    {
      "title": "Click FILE (in the upper-left corner of the window).",
      "content": "Click FILE (in the upper-left corner of the window). A drop-down menu will appear."
    },
    {
      "title": "Select Publish to Roblox.",
      "content": "Select Publish to Roblox . This will save the changes to your game."
    },
    {
      "title": "On your game's home page, press the green ► button.",
      "content": "On your game's home page, press the green ► button."
    },
    {
      "title": "You now have admin commands in your game!",
      "content": "You now have admin commands in your game! Type ;cmds (or :cmds if not HD Admin) to view the commands list. You can execute commands in-game by chatting. For example, ;explode me ."
    }
  ]
}