{
  "url": "https://www.wikihow.com/Get-Rid-of-Yellow-Teeth",
  "title": "How to Get Rid of Yellow Teeth",
  "steps": [
    {
      "title": "Brush your teeth for at least 2 minutes, twice a day.",
      "content": "Brush your teeth for at least 2 minutes, twice a day. Brush first thing in the morning when you get out of bed, and last thing at night before you go to sleep. Use a small dollop of toothpaste and brush in gentle, smooth circular motions and vertical strokes. Spend at least 2 minutes brushing each time you do it and avoid brushing too hard. This is the best way to protect your teeth’s enamel and keep your mouth healthy and clean. [1] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. Give your tongue a few brushes or use a tongue scraper to clean your tongue after you’re done with your teeth. Regular toothbrushes are fine, but electric toothbrushes can make it easier to maintain a proper brushing technique. They won’t make your teeth cleaner or anything, but they don’t require as much effort to use correctly. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Brushing more than twice a day can actually wear the enamel on your teeth down. Your teeth won’t get cleaner if you brush too hard or too often."
    },
    {
      "title": "Use fluoridated toothpaste to keep your enamel healthy.",
      "content": "Use fluoridated toothpaste to keep your enamel healthy. There is no good replacement for fluoridated toothpaste. Fluoride strengthens the enamel naturally and helps remove stains, which is essential if you’re looking for a beautiful, white smile. While some naturalists worry about fluoride’s effect on the body, there’s no evidence that fluoridated toothpaste is dangerous to use. [3] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. While you can’t replace enamel, fluoride can help strengthen weakened enamel. This will make your teeth whiter, even though you aren’t technically bringing any enamel back. [4] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. If you have sensitive teeth, feel free to opt for a fluoridated toothpaste designed specifically for sensitive teeth. When it comes to the flavor, style, and texture of the toothpaste, it’s entirely a matter of personal preference. None of these qualities impact the toothpaste’s ability to clean your teeth so long as the toothpaste has fluoride in it. There isn’t much evidence that whitening toothpaste is particularly productive. There’s nothing wrong with using it, but don’t get upset if you don’t see major results. [5] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source"
    },
    {
      "title": "Floss at least once a day to keep the gaps in your teeth clean.",
      "content": "Floss at least once a day to keep the gaps in your teeth clean. Pull out a 12–18 in (30–46 cm) length of floss. Wrap the floss around a tooth and slide it back and forth gently while moving it up and down the tooth. Do this for 20-30 seconds and repeat the process with each of your teeth. Floss at least once a day to keep food and plaque from building up in the gaps between your teeth, since food particles and plaque can erode enamel. [6] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. A lot of people think flossing is optional, but it’s not. Flossing is essential when it comes to protecting your teeth and keeping them shiny and white! If your gums bleed when you floss, it means your gums are inflamed. This is basically a form of gum disease, but it may go away on its own with regular flossing and brushing. If you keep bleeding every time you floss, contact your dentist and go in to have them look at your gums."
    },
    {
      "title": "Rinse your mouth with mouthwash before and after brushing.",
      "content": "Rinse your mouth with mouthwash before and after brushing. Use mouthwash twice every time you brush. Swig a capful of mouthwash around in your mouth before brushing to loosen up any food debris in your mouth. Swig another capful after brushing to rinse the toothpaste out and keep your breath fresh. [7] X Research source Mouthwash comes in two styles: cosmetic and therapeutic. Cosmetic mouthwash has hydrogen peroxide to help whiten teeth, but there isn’t a lot of evidence that it helps with this. Therapeutic mouthwashes are designed to curb bad breath. Either option is fine. Mouthwash will help your teeth stay healthy and clean, but it isn’t a replacement for brushing or flossing. If your mouth has a tendency to dry out over the course of the day, mouthwash may help with this."
    },
    {
      "title": "Purchase whitening strips to brighten your smile at home.",
      "content": "Purchase whitening strips to brighten your smile at home. While they aren’t going to solve your problems overnight, the whitening strips will help remove yellowing stains. Pick up some whitening strips to make your teeth a shade or two lighter without visiting the dentist. Keep in mind, you cannot use whitening strips if you’ve had any restorative work done, since the strips may damage the repair. [8] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. The strips won’t whiten restorative work anyway, so any crowns or implants will stand out more if you use whitening strips."
    },
    {
      "title": "Stick the strips to your teeth for 5-45 minutes to use them.",
      "content": "Stick the strips to your teeth for 5-45 minutes to use them. Brush your teeth before applying the strips. [9] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. Then, peel the adhesive backing off of the first strip and line it up with your gum line. Press the strip against your teeth and wrap the bottom around the backside of your teeth. Repeat this process with the second strip on your bottom row of teeth. Follow the directions on the box regarding how long you leave the strips on for. [10] X Research source Depending on the brand and style of whitening strips you use, you’ll need to leave them on for anywhere from 5 to 45 minutes. Some brands of whitening strips need to be reapplied every day for up to a week."
    },
    {
      "title": "Avoid DIY teeth whitening treatments using household ingredients.",
      "content": "Avoid DIY teeth whitening treatments using household ingredients. In your research, you may stumble across a variety of teeth whitening methods involving baking soda, hydrogen peroxide, lemon juice, turmeric, or coconut oil. Avoid all of these treatments. While some of them may make your teeth whiter, they can damage your gums or wear away tooth enamel. Talk to your dentist before using any of these whitening tricks. [11] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Anything involving citrus is going to eat away at your natural enamel, which can weaken your teeth over time. Strawberries are a popular whitening method, but they don’t actually do anything. [12] X Research source Hydrogen peroxide can irritate your gums and damage the roots of your teeth. Dentists do use peroxide for whitening treatments, but it’s a very unique concentration and formula that you can’t mix at home. Turmeric probably won’t harm anything, but there’s not a lot of evidence that it does anything for the whiteness of your teeth. There’s no evidence that coconut oil or oil pulling have any impact on the whiteness of teeth. [13] X Trustworthy Source Nature Respected Multidisciplinary Scientific Journal Go to source"
    },
    {
      "title": "Drink everything through a straw to protect your natural enamel.",
      "content": "Drink everything through a straw to protect your natural enamel. Yes, you should even throw a straw in your hot coffee or tea! It may feel silly drinking everything through a straw, but this is a seriously helpful way to protect your teeth and keep them clean. By using a straw, you keep liquids from coating your teeth, which will protect your enamel. [14] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. The one exception is water. Water naturally has trace amounts of fluoride in it, which is good for your teeth."
    },
    {
      "title": "Limit your coffee, red wine, and citrus intake to prevent staining.",
      "content": "Limit your coffee, red wine, and citrus intake to prevent staining. Anything that will stain your carpet will stain your teeth, so try to cut back on your coffee and red wine consumption. Anything high in citrus is also bad for your teeth, since citric acid will eat away your enamel if you consume too much of it. Swap out that lemonade for an ice water the next time you’re cooling off on a hot summer day. [15] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source You can dilute coffee with cream or milk to reduce the odds that it stains your teeth. Drinking rosé or white wine instead of red wine will help for similar reasons. Soy sauce, curry, and tomato sauce will also cause teeth to stain. These things are fine in moderation, but you may want to rinse your mouth out after eating anything with one of these ingredients in it. [16] X Research source"
    },
    {
      "title": "Chew sugarless gum 20 minutes after eating a meal.",
      "content": "Chew sugarless gum 20 minutes after eating a meal. Sugarless gum helps stimulate saliva production, which can help wash out any food particles that are stuck in your teeth. Roughly 20 minutes after your meal, any food particles stuck in your teeth are probably staying there. Throw in a piece of sugarless gum and chew on it for a few minutes. This will help clean your mouth and keep whatever you ate from damaging your teeth. [17] X Research source If you use gum with sugar in it, the sugar can wear away your teeth’s enamel which can further expose the yellow dentin underneath."
    },
    {
      "title": "Stop smoking if you’re a regular tobacco user.",
      "content": "Stop smoking if you’re a regular tobacco user. Tobacco will stain your teeth over time and it will make your teeth turn yellow or brown with prolonged use. Smoking also dramatically increases your risk for lung and oral cancer, so talk to your doctor about how you can quit smoking if you’re a regular tobacco user. [18] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source There are prescription medications, nicotine patches, nicotine gum, and other options available. Quitting is hard, but it’s well worth it if you want your fabulous smile back!"
    },
    {
      "title": "See your dentist every 6 months to get a regular cleaning.",
      "content": "See your dentist every 6 months to get a regular cleaning. Keep a regular schedule with your dentist and see them at least twice a year to get a cleaning and have your teeth examined. There’s no replacement for a good dental cleaning from a professional, and your dentist will catch potential problems ahead of time before they get out of hand. [19] X Expert Source Tu Anh Vu, DMD Board Certified Dentist Expert Interview. 10 April 2020. At a dental cleaning, your dentist or hygienist will physically remove any plaque, tartar, and food debris. Then, they’ll polish your teeth and remove any stains. This process is painless, and there’s no good substitute, so don’t skip your dental appointments!"
    },
    {
      "title": "Ask your dentist about coming in for whitening treatments.",
      "content": "Ask your dentist about coming in for whitening treatments. At your next cleaning, ask your dentist about a whitening treatment. Depending on the condition of your teeth, a dentist can apply a mixture of hydrogen peroxide and other whitening agents to remove deep stains and brighten your teeth. They may also give you a mouth guard that fits your teeth and prescribe a whitening gel for you to do this at home. After a few treatments, your teeth will be a few shades brighter. [20] X Research source This is always going to be more effective than using at-home whitening strips since a dentist will be able to oversee the treatment and customize it for your teeth. Unfortunately, dental insurance rarely covers whitening procedures since they’re cosmetic."
    },
    {
      "title": "Get a mouth guard made if you grind your teeth at night.",
      "content": "Get a mouth guard made if you grind your teeth at night. If your enamel is wearing away because you grind your teeth at night, ask your dentist for a protective mouth guard. They’ll take a mold of your teeth and have a custom mouth guard made to keep your teeth safe while you snooze. When you go to bed, put the mouth guard in to protect your teeth. [21] X Research source At first, it may feel a little weird wearing a mouth guard at night. Stick with it, though! You’ll get used to it after a few nights."
    },
    {
      "title": "Schedule an appointment to get veneers for a permanent solution.",
      "content": "Schedule an appointment to get veneers for a permanent solution. Ask your dentist if porcelain veneers are a good idea. This is the best way to get rid of yellow teeth and restore your smile, but it can be an expensive procedure. To get veneers, your dentist will take a mold of your teeth and have a custom cover built for your teeth. Then, they’ll bind the veneer to your enamel to permanently cover it in a layer of shiny, white porcelain. [22] X Research source Veneers can cost $400-4,000 a tooth depending on the specific type of material you choose and the dentist performing the work. [23] X Research source"
    }
  ]
}