{
  "url": "https://www.wikihow.com/Handle-a-Fair-Weather-Friendship",
  "title": "How to Handle a Fair Weather Friendship",
  "steps": [
    {
      "title": "Ask yourself whether or not they stick around during tough times.",
      "content": "Ask yourself whether or not they stick around during tough times. They may be down to join for fun activities, like dancing or drinks, but are never there when you need support. Maybe you went through a breakup, struggled with mental health, or lost your job, and this friend was nowhere in sight. These friends often make the people around them feel abandoned. [1] X Research source Does it feel like the support you provide this pal is never really reciprocated? If so, you may be dealing with a fair weather friend."
    },
    {
      "title": "Consider if they put as much energy into the friendship as you do.",
      "content": "Consider if they put as much energy into the friendship as you do. Maybe they're happy to hang out when you offer to come to them. But when plans are at your place, their interest seems to vanish. They’re excited to hang when it’s their choice of activity, but not when you have your own ideas. [2] X Research source Think about the time, energy, and effort this friend is willing to put into your relationship. Do they prioritize you like you prioritize them? If they don't seem to care much about seeing you, this could be a fair weather friend."
    },
    {
      "title": "Decide whether or not they're looking for a genuine connection.",
      "content": "Decide whether or not they're looking for a genuine connection. This doesn’t mean that they’re always in your friendship for the wrong reasons, because sometimes a fair weather friend may just be a bit flighty and looking for fun. But lots of fair weather friends do have insincere motives: your looks, money, popularity, or your other connections, for example. [3] X Research source Does this friend seem more interested in you when you’re with your cool friends? Or, do they only seem to be happy when you pick up the tab? If you’re getting the sense that this friend cares more about what you can offer them than your companionship, this could be a fair weather friend."
    },
    {
      "title": "Determine whether this friendship is worth the emotional toll it takes.",
      "content": "Determine whether this friendship is worth the emotional toll it takes. You’re the only person who can decide whether or not this relationship can work for you. There are so many potential avenues a friendship can take, and you can consider each of them: close pals, casual friends, or simple acquaintances. Try to understand what will make you happiest in the long term by asking yourself some thoughtful questions: [4] X Research source Am I okay with a casual relationship, knowing that they’re a fair weather friend? If not, do I think there’s any chance they’ll change their behavior if I speak to them about it? If they can’t change, are the good times with this friend worth the occasional hurt feelings?"
    },
    {
      "title": "Stay friends if you decide the relationship is worth some extra work.",
      "content": "Stay friends if you decide the relationship is worth some extra work. When you want a friend to change, honesty is always the very best option. You never know; this friend may have something going on in their life that’s affecting their behavior, or maybe they’re not aware they’re hurting you. [5] X Research source While you’re explaining yourself, try to use statements that begin with, “I feel.” Try to give your friend the benefit of the doubt and avoid name-calling. You may need to be prepared to listen respectfully if your friend has something to say. This is great news; they care enough about you to engage. Finally, explain that you want a genuine relationship. Now you two can talk through mutual expectations going forward."
    },
    {
      "title": "Set boundaries and limits if this person is a relative.",
      "content": "Set boundaries and limits if this person is a relative. Sometimes, with family, it may be easier to manage an unbalanced relationship than it is to end it entirely. That’s okay! It’s important to set boundaries in any relationship, and that can help you protect your needs going forward. [6] X Research source Try to enjoy the positive parts of the relationship. Maybe they take board games as seriously as you, and you love that. Enjoying playing a round. Make sure you don't let this fair weather relative drain you. It's great to help people you love, but you've got to take care of yourself first. Remember, you don't need to feel guilty if you decide you can't maintain contact with a relative. You deserve respect in your relationships, even with family."
    },
    {
      "title": "Enjoy a casual friendship by altering your expectations.",
      "content": "Enjoy a casual friendship by altering your expectations. Maybe you just decide that this won’t be a person you reach out to in difficult moments. That doesn’t mean you can’t have fun with them in the meantime. Say they really make you laugh or are the best dance partner you’ve ever had; feel free to keep them in your life. [7] X Research source Just make sure this new arrangement really does add to your life, instead of causing unnecessary stress. It can be hard to shake expectations for others. Ensure you’re not continuing to give more to the friendship than you’re receiving. Protect your own energy and emotional reserves. Avoid dropping everything to support a relationship that has drained you in the past."
    },
    {
      "title": "End the friendship if you're not getting what you need.",
      "content": "End the friendship if you're not getting what you need. Take some time to reflect on whether or not this relationship has the potential to add something to your life or otherwise, change. You may decide that, no, this person isn't likely to adjust their behavior to make this relationship more fulfilling to me. You may also realize that as much as you may like your fair weather friend, the emotional toll just isn't worth the good times in between. This means it's time to end the friendship. [8] X Research source Sometimes, getting validation from people around you can help a decision like this feel more digestible. Talk to a close friend or family member who can help. If you're not sure about how you feel just yet, try spending 5 minutes on a quick journaling session. This can help you untangle any big or conflicting feelings."
    },
    {
      "title": "Understand that ending a friendship is completely normal.",
      "content": "Understand that ending a friendship is completely normal. You may feel confused or guilty about your choice. But it’s so important to understand that people walk away from all kinds of relationships, all the time. If a relationship is draining one or both people who are involved, then it’s not healthy to continue. You don’t need to feel ashamed for recognizing that a friendship should end. [9] X Research source"
    },
    {
      "title": "Avoid making plans to gradually let the relationship taper off.",
      "content": "Avoid making plans to gradually let the relationship taper off. Lots of people don’t like confrontation. Luckily, a fair weather friend is unlikely to put in lots of effort to keep seeing you, so this should be easy to pull off. If you’re ready to let this friend go, simply stop making plans. [10] X Research source If they make plans with you, you can be direct. Or, you can accept the invitation, but not make new ones. Things with a fair weather friend will likely peter out."
    },
    {
      "title": "Explain your thoughts on the friendship to end it directly.",
      "content": "Explain your thoughts on the friendship to end it directly. If you feel comfortable, you can explain why the friendship isn’t working for you. This way, you get to know that you were truthful with them even when it was hard. They also may surprise you; if you’re gentle, they may want to fix their behavior on their own. [11] X Research source Focus on being honest, but fair. Avoid name-calling, blame, and give them the benefit of the doubt when you can. This way, you get to leave things on a kind note. If you genuinely do, you could even wish them well. \"I think you're great to hang out with. But I noticed that we have different expectations in this friendship, and that hurts my feelings sometimes. I think I need to move on for my own happiness.\""
    },
    {
      "title": "Send a letter if you fear confrontation but still want to be truthful.",
      "content": "Send a letter if you fear confrontation but still want to be truthful. A letter or email is the perfect solution here. In order to give your friend the benefit of the doubt and leave things on a positive note, use kind, empathetic language. You can definitely wish them well if that’s how you feel, too. [12] X Research source \"At this point, it just feels like I'm always going to put in more effort than you are, and that doesn't feel good.\" \"I love hanging out with you, and that's why it took me so long to take steps to cut off a friendship that wasn't giving me what I needed.\" \"I definitely still wish the best for you. This relationship just isn't working for me. I'd be happy to answer questions if you have them.\""
    },
    {
      "title": "Remove your fair weather friend on social media.",
      "content": "Remove your fair weather friend on social media. If you want a clean break, you may not want to see their posts anymore. Sometimes, when a person isn’t in your life anymore, you may miss them, feel confused, or still feel angry, even though you don’t want to. Having constant, unsolicited reminders of them may be the last thing you want. In that case, feel free to take them off of your feeds. [13] X Research source You may feel like blocking, unfollowing, or deleting this fair weather friend may be too much. Most social media sites give you ways to block someone’s content without them knowing, like Instagram’s “mute” feature."
    },
    {
      "title": "Keep your cool and avoid lashing out.",
      "content": "Keep your cool and avoid lashing out. Hurt feelings can make people act in ways that they go on to regret. It’s definitely fine to leave a relationship that wasn’t working for you, just like it’s appropriate to be honest about how you were feeling. You probably won’t feel great about adding in any insults and jabs though, so try your best to hold those in. [14] X Research source When someone you care about disappoints you, it can really sting. It would make sense if this friend’s behavior left you feeling majorly upset. But you’ll feel better about yourself if you walk away with your head held high. Instead, turn your focus towards your other awesome relationships."
    }
  ]
}