{
  "url": "https://www.wikihow.com/Get-Bamboo-in-Animal-Crossing",
  "title": "5 Ways to Find & Use Bamboo in Animal Crossing: New Horizons",
  "steps": [
    {
      "title": "Go on a Mystery Island Tour.",
      "content": "Go on a Mystery Island Tour. For 2,000 miles, you can purchase a Nook Miles Ticket from the Nook stop. Use this ticket at the airport to go on a Mystery Island Tour, where Orville will take you to a random island full of items and materials. [1] X Research source There's about a 10% chance you will get a bamboo island. [2] X Research source Use an axe on each bamboo plant three times to get bamboo pieces. These pieces are used in various crafting recipes, most notably in the Bamboo Series. [3] X Research source If you chop bamboo in the springtime, you will also get young spring bamboo. Young spring bamboo is much rarer than normal bamboo pieces and is also used to craft certain recipes in the Bamboo Series. Dig up the dig spots around the bamboo plants to get a bamboo shoot, which can be planted to grow more bamboo and create your perfect island . [4] X Research source Note that if you use fruit to dig up an entire bamboo plant and replant it on your island, it won't produce bamboo shoots once replanted. [5] X Research source"
    },
    {
      "title": "Go on a boat tour with Kapp'n.",
      "content": "Go on a boat tour with Kapp'n. In the 2.0 Free Update, boat tours to Mystery Islands were introduced. Talk to Kapp'n at the dock and pay 1,000 miles to go on a mystery boat tour. You can do one mystery boat tour per day, and one of the islands you can get is a bamboo island. Just like the Mystery Island Tour version of this island, you can get bamboo pieces and bamboo shoots. But since the island is set in the summer season, you cannot get young spring bamboo. [6] X Research source"
    },
    {
      "title": "Get bamboo shoots from Daisy Mae.",
      "content": "Get bamboo shoots from Daisy Mae. While this method takes some time, you can get bamboo shoots from Daisy Mae if you buy a total of 100 turnips from her over three different times. After you do this, she will mail you three bamboo shoots the next day after you make any purchase. [7] X Research source"
    },
    {
      "title": "Get bamboo materials from another player.",
      "content": "Get bamboo materials from another player. You can get bamboo, young spring bamboo, and bamboo shoots from another player if they have them on their island. Simply travel to another player's island via the airport and collect bamboo, bamboo shoots, and young spring bamboo if it's springtime. Make sure you ask the other player if you're allowed to take their bamboo materials before doing so."
    },
    {
      "title": "Get bamboo shoots from villagers.",
      "content": "Get bamboo shoots from villagers. If you do a favor for your villager, they may reward you with a bamboo shoot. This isn't a very reliable way to get bamboo shoots, though, due to how random and unpredictable it can be."
    },
    {
      "title": "Bamboo pieces are used in 23 separate recipes.",
      "content": "Bamboo pieces are used in 23 separate recipes . Some of these recipes are part of the Bamboo Series, but not all. In total, you'll need 132 bamboo pieces to craft every recipe that uses them. Most of the craftable items made with bamboo are furnishings, but wallpaper, flooring, rugs, and fences are also available."
    },
    {
      "title": "Young spring bamboo is used in 12 separate recipes.",
      "content": "Young spring bamboo is used in 12 separate recipes. You'll need 62 pieces of young spring bamboo in total to craft all the recipes that use it. [8] X Research source Young spring bamboo is used mostly in interior items, such as walls and rugs, but it's also used in a few furnishing items as well. You can also make a basket pack backpack and a bamboo wand out of young spring bamboo."
    },
    {
      "title": "Bamboo shoots are used in 4 separate recipes.",
      "content": "Bamboo shoots are used in 4 separate recipes. You'll need just 13 bamboo shoots to craft the recipes that use them, which leaves you plenty of chances to get bamboo shoots for planting. Bamboo shoots are used to make the bamboo-shoot lamp and bamboo-grove wall, as well as to cook two DIYs : bamboo-shoot soup and jarred bamboo shoots."
    }
  ]
}