{
  "url": "https://www.wikihow.com/Install-Baseboard-Heating-(Electric)",
  "title": "How to Install Baseboard Heating (Electric)",
  "steps": [
    {
      "title": "Determine room size in square feet by multiplying length by width in feet.",
      "content": "Determine room size in square feet by multiplying length by width in feet."
    },
    {
      "title": "Determine window type and number.",
      "content": "Determine window type and number. Older single pane windows transmit (lose) heat more quickly than newer double or triple glazed windows which are far better at isolating different air temperatures on either side."
    },
    {
      "title": "Determine number of walls of the space that are exterior walls.",
      "content": "Determine number of walls of the space that are exterior walls."
    },
    {
      "title": "Determine if the exterior walls and space directly above and below the room are insulated.",
      "content": "Determine if the exterior walls and space directly above and below the room are insulated. A space below an attic with insulated floors or located above a basement are considered insulated."
    },
    {
      "title": "Determine if any doors open to the outdoors from this room.",
      "content": "Determine if any doors open to the outdoors from this room."
    },
    {
      "title": "Calculate a baseline for total watts of electric heat required to heat the space.",
      "content": "Calculate a baseline for total watts of electric heat required to heat the space. Most spaces require 10 watts per square foot of space for homes built since the 1970s. A 12 foot (3.7 m) by 12 foot (3.7 m) room has 144 sq/ft. Assuming a ceiling height less than 8 feet (2.4 m), this room should be heated comfortably with 1500 watts of heat. 1500 watts of heat is a total of 6 feet (1.8 m) of heat, assuming \"standard density\" baseboard heaters are selected for installation. Standard density heat is rated at 250 watts per foot. There is one other type of heat called \"high density\" (HD). HD heat has more than the 250 watts per foot that the standard density heat has, but does not heat quicker nor is operated for any less. HD merely provides more heat with a smaller footprint."
    },
    {
      "title": "Determine how much (if any) more watts of heat over the baseline watts to install.",
      "content": "Determine how much (if any) more watts of heat over the baseline watts to install. All of the considerations above (windows type and number, insulation, etc.) will come into play when purchasing heaters. The baseline wattage should be increased by up to 100% if the room suffers from all of the considerations. It is important to note that adding additional heaters will not increase the cost of operation. Additional heaters allow the room to maintain desired temperature during the colder days, as opposed to having the minimum heat (or baseline) installed. If only the baseline calculated amount of heat were installed, it would not be able to replace the heat as quickly as it was lost due to lack of insulation, single pane windows, etc. A room that ideally requires 1500 watts of heat might need as much as 3000 watts if it suffers from all the issues listed above. This applies to ALL types of heat (and cooling in the summer for that matter), regardless of fuel type or technology. Insulation is inexpensive over the long run."
    },
    {
      "title": "Decide if / or how to break up the heaters.",
      "content": "Decide if / or how to break up the heaters. The heat can be installed one of two ways. In the example room, install (1) 1500 watt heater or install 2 or more heaters totaling 1500 watts. The latter method can be employed for rooms at the corners of a building - having 2 exterior walls. Typically, heaters are installed below windows, where most of the heat loss occurs. Adding more watts of heat will allow the room to reach the desired temperature faster than if no additional watts of heat were installed."
    },
    {
      "title": "Determine size and number of circuits required to serve the heating load.",
      "content": "Determine size and number of circuits required to serve the heating load. Installing 240 volt heaters is best as wire sizes and number of circuits are significantly reduced. The National Electrical Code allows a 15 amp circuit to carry up to 12 amps, and a 20 amp circuit may carry up to 16 amps. The total watts allowed to be connected can be determined simply by multiplying volts by amps only because this is a purely resistive AC circuit (AC wattage calculations are much more complex for inductive and capacitive reactant circuits that exist in appliances and electronics). The 15 amp circuit is 240 x 12 = 2880 watts. The 20 amp circuit is 240 x 16 = 3840 watts. This is a maximum of 14 and 19 feet of 240 volt, standard density heat, respectively."
    },
    {
      "title": "Determine a location for the thermostat.",
      "content": "Determine a location for the thermostat. The thermostat should be located on an interior wall. It should never be located above a heater or other heat source, or in a dead air space such as behind a door."
    },
    {
      "title": "Trace a switch box on the wall at 60 inches (152.4 cm) up from the floor for the thermostat where there are no framing members, etc.",
      "content": "Trace a switch box on the wall at 60 inches (152.4 cm) up from the floor for the thermostat where there are no framing members, etc. Cut the wall open with knife or hand saw."
    },
    {
      "title": "Provide a 2 wire circuit (#14 for 15 amp circuit or #12 for 20 amp circuit) of NM type (Romex) or similar cable from the electrical panel to the thermostat location.",
      "content": "Provide a 2 wire circuit (#14 for 15 amp circuit or #12 for 20 amp circuit) of NM type (Romex) or similar cable from the electrical panel to the thermostat location. This may require fishing or snaking of the cable between the points, and will probably be most time consuming. For this reason, many times a single heater sized to heat the entire space is often selected so that fishing or snaking is minimized. Indicate this cable as the \"LINE\" so it can be determined as such after it has been installed in the box for the thermostat."
    },
    {
      "title": "Unpack the heater(s).",
      "content": "Unpack the heater(s). Examine the heater(s) and remove BOTH front covers from both ends of each heater. Place the heater(s) against the wall at the desired location."
    },
    {
      "title": "The two ends are wiring compartments.",
      "content": "The two ends are wiring compartments. Because they are provided, no box(es) need be installed in the wall. Simply create a small hole in the wall for the cable from which to emerge and pass through appropriate connectors at the back of one of the compartments to allow the cables to enter. Connections are to be made in the compartments. This is detailed below."
    },
    {
      "title": "Provide another 2 wire cable the same size as the one installed earlier between the panel and thermostat, between the thermostat and the baseboard heater.",
      "content": "Provide another 2 wire cable the same size as the one installed earlier between the panel and thermostat, between the thermostat and the baseboard heater. Indicate this cable as the \"LOAD\" so it can be determined as such after it has been installed in the box for the thermostat."
    },
    {
      "title": "Install an additional 2 wire cable between the first heater and next heater.",
      "content": "Install an additional 2 wire cable between the first heater and next heater. Continue to daisy-chain between successive heaters as needed."
    },
    {
      "title": "Install the appropriate cable connector in the desired end of the heater(s).",
      "content": "Install the appropriate cable connector in the desired end of the heater(s)."
    },
    {
      "title": "Strip 8 inches (20.3 cm) of jacket from the cable(s) and install into the connector.",
      "content": "Strip 8 inches (20.3 cm) of jacket from the cable(s) and install into the connector. Push the cable into the connector until 1 ⁄ 2 inch (1.3 cm) of the jacket is inside the wiring compartment."
    },
    {
      "title": "Remove the wirenut from the heater wires in the compartment that the cables entered, and separate the wires.",
      "content": "Remove the wirenut from the heater wires in the compartment that the cables entered, and separate the wires."
    },
    {
      "title": "Connect the black wires of the cables you installed together if two cables were installed.",
      "content": "Connect the black wires of the cables you installed together if two cables were installed."
    },
    {
      "title": "Connect the white wires of the cables you installed together if two cables were installed.",
      "content": "Connect the white wires of the cables you installed together if two cables were installed."
    },
    {
      "title": "Connect the bare wires of the cables you installed together if two cables were installed.",
      "content": "Connect the bare wires of the cables you installed together if two cables were installed."
    },
    {
      "title": "Connect the bare wire(s) to the green screw of the heater or, if provided, to the green or bare wire that is connected to the heater case by crimp or screw.",
      "content": "Connect the bare wire(s) to the green screw of the heater or, if provided, to the green or bare wire that is connected to the heater case by crimp or screw."
    },
    {
      "title": "Connect one of the loose heater wires (does not matter which) to the black wire(s).",
      "content": "Connect one of the loose heater wires (does not matter which) to the black wire(s)."
    },
    {
      "title": "Connect the remaining loose heater wire to the white wire(s).",
      "content": "Connect the remaining loose heater wire to the white wire(s)."
    },
    {
      "title": "Make sure the wirenut in the wiring compartment at the opposite end of the heater has the wires tightly connected together.",
      "content": "Make sure the wirenut in the wiring compartment at the opposite end of the heater has the wires tightly connected together."
    },
    {
      "title": "Secure the heater to the wall.",
      "content": "Secure the heater to the wall."
    },
    {
      "title": "Secure the wiring compartment covers.",
      "content": "Secure the wiring compartment covers."
    },
    {
      "title": "Repeat for each heater.",
      "content": "Repeat for each heater."
    },
    {
      "title": "Wire the thermostat.",
      "content": "Wire the thermostat. Connect ALL the bare and any green wires together with a wirenut. Install a short piece (8\") of bare wire between the bare and green wires to the green screw on the thermostat if it is not already connected."
    },
    {
      "title": "The thermostat has (4) wires or terminals.",
      "content": "The thermostat has (4) wires or terminals. Carefully inspect the thermostat for \"LINE\" and/or \"LOAD\" markings."
    },
    {
      "title": "Connect LINE side to the black and white wires of the cable that was indicated as \"feed\" earlier.",
      "content": "Connect LINE side to the black and white wires of the cable that was indicated as \"feed\" earlier. Each of the black and white wires from the panel must connect to one LINE wire or terminal. Under no circumstances should the black and white wire from the panel be connected together."
    },
    {
      "title": "Connect the remaining cable to the LOAD side of the thermostat.",
      "content": "Connect the remaining cable to the LOAD side of the thermostat. Connect it in the same manner as the LINE side."
    },
    {
      "title": "Coil the wires, never fold, into the back of the box and secure the thermostat.",
      "content": "Coil the wires, never fold, into the back of the box and secure the thermostat."
    }
  ]
}