{
  "url": "https://www.wikihow.com/Do-Triple-H%27s-Entrance",
  "title": "How to Do Triple H's Entrance",
  "steps": [
    {
      "title": "Have some water in your mouth before you start the entrance.",
      "content": "Have some water in your mouth before you start the entrance. Not a full mouthful, but a little is fine."
    },
    {
      "title": "Start either the music \"King of Kings\" or \"The Game\" by Motörhead.",
      "content": "Start either the music \"King of Kings\" or \"The Game\" by Motörhead. After the first couple words (right as the actual music starts), come out and stand at the entrance with a water bottle . Stay there as you look at the ground, then slowly look up straight ahead. You can look around if you wish."
    },
    {
      "title": "Start walking down the aisle or ramp.",
      "content": "Start walking down the aisle or ramp. Take a few steps and spray out the water while shaking your head. The spraying may take a few times to perfect if you tend to stream it out."
    },
    {
      "title": "Walk up to the ring and stop.",
      "content": "Walk up to the ring and stop. Look around to the \"crowd\" and proceed to walk towards the right hand side of the ring (your right)."
    },
    {
      "title": "Take another sip of water (don't swallow it all) and toss the water bottle.",
      "content": "Take another sip of water (don't swallow it all) and toss the water bottle . If the ring is indoors, especially on carpet, be sure the cap is closed."
    },
    {
      "title": "Get onto the apron on the outside of the ring and face the crowd.",
      "content": "Get onto the apron on the outside of the ring and face the crowd. Place your right hand (thumb out) on the top rope and your left hand at your side. Stare around for a few seconds. Then look as if you're flexing your muscles in a downwards position and put your head down. Flare up your arms and head while bending backward towards the ring rope. As soon as you flare up, spray out the water again. You didn't swallow that last sip, did you?"
    },
    {
      "title": "Step into the ring and go on one of the corner turnbuckles to Pose (for Girls) for the crowd.",
      "content": "Step into the ring and go on one of the corner turnbuckles to Pose (for Girls) for the crowd."
    }
  ]
}