{
  "url": "https://www.wikihow.com/Get-Permanent-Marker-Stain-out-of-Hardwood-Flooring",
  "title": "How to Get Permanent Marker Stain out of Hardwood Flooring",
  "steps": [
    {
      "title": "Test the isopropyl alcohol on a small hidden area.",
      "content": "Test the isopropyl alcohol on a small hidden area. To prevent further damage to the stained area, apply a small amount of isopropyl alcohol to a hidden area of your floor. Select a spot under a rug or covered by a piece of furniture. [1] X Research source Pour ¼ teaspoon of isopropyl alcohol onto a rag. Wipe the test spot with the saturated rag. Allow it to sit for 3 to 5 minutes. Wipe the surface clean and assess the results. If the product has removed the finish on your floor or left behind a stain, choose a different method of stain removal. [2] X Research source"
    },
    {
      "title": "Apply the isopropyl alcohol to the stain with a rag.",
      "content": "Apply the isopropyl alcohol to the stain with a rag. Pour 1 teaspoon of isopropyl alcohol onto a clean rag. Run the saturated rag over the permanent marker stain. Allow the product to sit on the stain for 3 to 5 minutes. [3] X Research source"
    },
    {
      "title": "Clean the area with a fresh, damp rag or sponge.",
      "content": "Clean the area with a fresh, damp rag or sponge. Run a clean rag or sponge under the tap or dip it in a bucket of clean water. Use the saturated rag or sponge to scrub the stained area thoroughly in an effort to remove the stain. [4] X Research source"
    },
    {
      "title": "Repeat the process if needed.",
      "content": "Repeat the process if needed. If the product removed part of the stain, apply more isopropyl alcohol to the area. Allow it to sit for 3 to 5 minutes before scrubbing the area with a wet rag. [5] X Research source"
    },
    {
      "title": "Make a paste out of 1 part toothpaste and 1 part baking soda.",
      "content": "Make a paste out of 1 part toothpaste and 1 part baking soda. In a small dish, combine white toothpaste—do not use the gel toothpaste—with baking soda at a ratio of 1:1. Use a spoon to mix the products thoroughly. [6] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 12 July 2021."
    },
    {
      "title": "Apply the mixture to the stain with a clean rag.",
      "content": "Apply the mixture to the stain with a clean rag. Spoon a portion of the mixture onto a clean rag. Use the rag to apply the baking soda-toothpaste mix to the stained area. [7] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 12 July 2021."
    },
    {
      "title": "Scrub the stained area in small circular motions.",
      "content": "Scrub the stained area in small circular motions. Move the rag in small circles in an effort to remove the stain. Apply more baking soda-toothpaste mixture to the rag as needed. Continue to scrub the area until the stain has vanished. [8] X Research source Be patient. It may take a while!"
    },
    {
      "title": "Clean the area with a wet, soapy rag.",
      "content": "Clean the area with a wet, soapy rag. Fill a small bucket with warm water and soap. Dip a clean rag into the soapy water and wring it out. Use the wet rag to remove the baking-soda toothpaste mixture from the floor. [9] X Research source"
    },
    {
      "title": "Test the nail polish remover on a small hidden area.",
      "content": "Test the nail polish remover on a small hidden area. To prevent further damage to the stained area, test the product on a hidden area of your floor before applying it to the stain. Select a spot under a rug, beneath a coffee table, or covered by a chair. [10] X Research source Pour ¼ teaspoon of nail polish remover onto a clean cloth. Rub the saturated rag onto the test spot and allow it to sit on the hardwood for 3 to 5 minutes. Wipe the surface clean with a wet rag. Look at the test spot and determine if the product has removed the finish on your floor or left behind a stain. If the test spot is damaged, choose a different method of stain removal. [11] X Research source"
    },
    {
      "title": "Apply the nail polish remover to the permanent marker stain with a clean cloth.",
      "content": "Apply the nail polish remover to the permanent marker stain with a clean cloth. Pour 1 teaspoon of nail polish remover onto a clean rag. Wipe and scrub the permanent marker stain with the saturated rag. Allow the product to sit on the stain for 3 to 5 minutes. [12] X Research source"
    },
    {
      "title": "Wipe the area with a clean, damp rag.",
      "content": "Wipe the area with a clean, damp rag. Run a clean cloth under the tap or dip it in a bucket of clean water. Use the wet cloth to scrub the stained area. Scrub the stain using small circular motions in an effort to remove the permanent marker and clean up the nail polish remover. [13] X Research source"
    },
    {
      "title": "Repeat the process if needed.",
      "content": "Repeat the process if needed. If the product only removed part of the stain or caused it to fade, apply more nail polish remover to the stain. Allow it to sit for 3 to 5 minutes before scrubbing the area with a wet rag. [14] X Research source"
    },
    {
      "title": "Draw over the permanent marker stain with a dry erase marker.",
      "content": "Draw over the permanent marker stain with a dry erase marker. Remove the cap from a dry erase marker. Carefully color over the permanent marker stain with the dry erase marker. Let it sit for 1 minute. [15] X Research source"
    },
    {
      "title": "Wipe the stained area with a dry, clean cloth.",
      "content": "Wipe the stained area with a dry, clean cloth. Use a dry, clean rag to wipe the stained area. As you wipe off the dry erase marker, the permanent marker stain should come off too. [16] X Research source"
    },
    {
      "title": "Repeat if needed or try a different method.",
      "content": "Repeat if needed or try a different method. If the dry erase marker only removed part of the stain or caused the permanent marker stan to fade, repeat the process. If this did not work, try a different method. [17] X Research source"
    },
    {
      "title": "Dampen the magic eraser.",
      "content": "Dampen the magic eraser. Remove the magic eraser from its packaging. Submerge the magic eraser into a bucket of water or run it under the tap. Wring out the magic eraser. [18] X Research source"
    },
    {
      "title": "Scrub the permanent marker stain with the magic eraser.",
      "content": "Scrub the permanent marker stain with the magic eraser. Use the damp magic eraser to scrub the stained area. Move the magic eraser in small circular motions. [19] X Research source"
    },
    {
      "title": "Continue scrubbing until the stain is removed.",
      "content": "Continue scrubbing until the stain is removed. Removing the stain with the magic eraser may take a while. Continue to scrub the stained area until the stain has lifted. Re-wet and wring out the sponge as needed. [20] X Research source"
    },
    {
      "title": "Dry the area with a clean rag.",
      "content": "Dry the area with a clean rag. After removing the stain, grab a dry, clean rag. Use the cloth to wipe up any moisture remaining on the floor. [21] X Research source"
    },
    {
      "title": "Test the WD-40 on a small hidden area.",
      "content": "Test the WD-40 on a small hidden area. To prevent further damage to the stained area, test the product on a hidden area of your floor before applying it to the stain. Select a spot beneath a coffee table or covered by a couch. [22] X Research source Spray the WD-40 directly onto the test spot. Allow it to sit on the hardwood for 3 to 5 minutes. Remove the product with a clean, wet rag. Spray the test area with a stain remover to get rid of any greasy residue. Wipe up the spray with a damp sponge. Look at the test spot and determine if the product has removed the finish on your floor or left behind a stain. If the test spot is damaged, choose a different method of stain removal. [23] X Research source"
    },
    {
      "title": "Spray the stained area with WD-40.",
      "content": "Spray the stained area with WD-40. Apply the WD-40 directly to the stain. Allow the product to sit for 3 to 5 minutes. [24] X Research source You may also spray some WD-40 onto a clean cloth and apply it to the stained area."
    },
    {
      "title": "Remove the product with a damp cloth.",
      "content": "Remove the product with a damp cloth. Run a clean cloth under the tap or dip it in a small bucket of fresh water. Wring out the rag. Remove the WD-40 from the surface. [25] X Research source If the stain remains, re-apply the WD-40. Allow it to sit for 5 to 7 minutes before wiping the surface with a damp rag."
    },
    {
      "title": "Clean off the greasy residue with a stain remover.",
      "content": "Clean off the greasy residue with a stain remover. Spray the treated area with a stain remover. This will remove any greasy residue left behind by the WD-40. Wipe the area with a damp sponge or cloth. Once the stain remover is cleaned up, run over the area with a dry cloth to pick up any remaining moisture. [26] X Research source"
    },
    {
      "title": "Decide if you will do-it-yourself.",
      "content": "Decide if you will do-it-yourself. Replacing a board is time consuming and a little tricky. Before embarking on the project, look into services in your area that would replace the board for you. After researching services, receiving quotes, and studying the process, decide if you will replace the board yourself or pay a handyman to do it. [27] X Research source If the stain extends across several boards, individually replacing each board may not be worth the effort."
    },
    {
      "title": "Measure the depth of the floorboard and set up your circular saw.",
      "content": "Measure the depth of the floorboard and set up your circular saw. Measure the depth of the board you are removing. Set your circular saw to cut 1/16 inch deeper than the measured depth of the board. [28] X Research source The majority of hardwood floor boards are ¾ inch thick."
    },
    {
      "title": "Saw a set a parallel lines down the length of the floor board.",
      "content": "Saw a set a parallel lines down the length of the floor board. Use the circular saw to cut 1 line down the length of the floorboard. Stop the saw before reaching the end of the damaged board. Move the saw over 1 inch and cut a second line down the length of the floorboard. Stop before you reach the end of the damaged floorboard. [29] X Research source"
    },
    {
      "title": "Score the damaged board with a utility knife.",
      "content": "Score the damaged board with a utility knife. Carefully score each end of the damaged board with a utility knife. Do not score the surrounding, undamaged boards. [30] X Research source"
    },
    {
      "title": "Chisel the scored lines.",
      "content": "Chisel the scored lines. Place the chisel in one of the score lines at a 30° angle. Tap a chisel along the scored line with a hammer. Repeat on the other scored line. [31] X Research source"
    },
    {
      "title": "Remove the board with a pry bar.",
      "content": "Remove the board with a pry bar. Insert a pry bar into the gap at one end of the damaged board. Push down on the pry bar to lift up the damaged board. Remove the damaged board with your hand. [32] X Research source"
    },
    {
      "title": "Clean up any debris with a shop vac.",
      "content": "Clean up any debris with a shop vac. Plug in a shop vac. Suction up any debris from the area. You may also use a hand broom and dustpan to sweep up the debris. [33] X Research source"
    },
    {
      "title": "Measure and mark the length and width of the replacement board.",
      "content": "Measure and mark the length and width of the replacement board. Use a measuring tape to determine the width and length of the damaged board. Use these measurements to determine the size of the replacement board. Mark the length and width with a pencil on the replacement board. [34] X Research source"
    },
    {
      "title": "Cut the replacement board with a table saw.",
      "content": "Cut the replacement board with a table saw. Remove the bottom grooves from the replacement board. Cut the replacement board to the appropriate length and width. Use the pencil marks as your guide. [35] X Research source"
    },
    {
      "title": "Insert the replacement board into the floor and secure it in place with a nail gun.",
      "content": "Insert the replacement board into the floor and secure it in place with a nail gun. Tap the replacement board into place with a rubber mallet. Make sure the replacement board is flush with the floor. Use a nail gun to insert 1 finish nail into each end of the board."
    },
    {
      "title": "Cover the nail holes with wood putty and sand the replacement board.",
      "content": "Cover the nail holes with wood putty and sand the replacement board. Use a putty knife to fill the nail holes with a small amount of wood putty. Once dry, sand the replacement board with 220-grit sandpaper along the grain. Clean up any dust with a damp rag. [36] X Research source"
    },
    {
      "title": "Stain the replacement board.",
      "content": "Stain the replacement board. Apply a matching stain to the replacement board with a rag. Remove any excess stain with a clean rag. Allow the stain to dry."
    },
    {
      "title": "Apply the varnish and sand between each coat.",
      "content": "Apply the varnish and sand between each coat. Apply the first coat of varnish with a lambs wool applicator. Once dry, sand the area with 220-grit sandpaper. Remove any dust with a damp rag or shop vac. Apply 3 coats of oil-based finish or 4 coats of water-based finish. Sand between each coat and clean up any dust."
    }
  ]
}