{
  "url": "https://www.wikihow.com/Polish-Plexiglass",
  "title": "How to Polish and Remove Scratches from Plexiglass",
  "steps": [
    {
      "title": "Clean the surface with water and a clean cloth.",
      "content": "Clean the surface with water and a clean cloth. It is important to remove and dirt and large debris that might be on the surface of your plexiglass. Use a clean and damp washcloth or towel to gently wipe the entire surface of your plexiglass. [1] X Research source Cleaning your plexiglass will also help you see what is actually scratched and what was just dirt."
    },
    {
      "title": "Pour a spoonful of water over the scratches.",
      "content": "Pour a spoonful of water over the scratches. It is important to be gentle when polishing your plexiglass so that you don’t damage it further. Pouring some water over the scratched area before you start using sandpaper will create a buffer and protect your plexiglass. You don’t need to pour a ton of water over the area, but it should cover the entirety of wherever you are polishing. [2] X Research source You can keep a bucket or bowl of water near you in case you need more throughout this process."
    },
    {
      "title": "Sand the area with a 400 grit sandpaper in a circular motion until it is smooth.",
      "content": "Sand the area with a 400 grit sandpaper in a circular motion until it is smooth. Rub your sandpaper in a circular motion on top of the scratches, applying gentle pressure. You should do this for about 1 minute and then check if the surface feels smooth. [3] X Research source You can find sandpaper at most home improvement or hardware stores."
    },
    {
      "title": "Rinse the area with water.",
      "content": "Rinse the area with water. The sandpaper may have made the surface of your plexiglass look cloudy. Rinse it with water to see how well your sandpaper worked and to clean your surface off."
    },
    {
      "title": "Use a smaller grit sandpaper if your plexiglass does not feel smooth.",
      "content": "Use a smaller grit sandpaper if your plexiglass does not feel smooth. If you plexiglass still feels like it is scratched, put more water on it and use a smaller grit sandpaper in a circular motion. Your sandpaper can go up to 1000 grit, and you can do this 2 to 3 more times using a finer grit each time. [4] X Research source"
    },
    {
      "title": "Spread a light film of buffing compound over the plexiglass.",
      "content": "Spread a light film of buffing compound over the plexiglass. A buffing compound will help to fill in any scratches that are left and make your plexiglass look shiny. Spread a thin layer of your buffing compound over the area that has been sandpapered with a cloth or towel. Spread it in a circular motion, similar to how you used the sandpaper. Start with a dime sized drop and add more if you need to. [5] X Research source You can buy buffing compounds at most hardware stores."
    },
    {
      "title": "Use a rotary polisher on the lowest speed in a circular motion.",
      "content": "Use a rotary polisher on the lowest speed in a circular motion. Buff in your buffing compound with a rotary polisher that is set to the lowest speed. Apply a slight amount of pressure so that you don’t damage your plexiglass. Use your polisher until you can’t see the layer of buffing compound on top of the plexiglass anymore. This usually takes 2 to 3 minutes. [6] X Research source"
    },
    {
      "title": "Wipe the area you polished off with a dry cloth.",
      "content": "Wipe the area you polished off with a dry cloth. Once your buffing compound has been rubbed into the area, you can wipe off of your plexiglass with a clean, dry cloth. Gently wipe your plexiglass until it looks shiny and free of streaks or marks. [8] X Research source"
    },
    {
      "title": "Set your plexiglass on a foam block with one of the edges facing upwards.",
      "content": "Set your plexiglass on a foam block with one of the edges facing upwards. It will be much easier to work on the edge of your plexiglass piece if it is raised and facing you. Set up a foam block on a flat surface, like a table or workbench, and place your plexiglass piece diagonally on the foam block with one edge upward and facing you. [9] X Research source You can buy foam blocks at most home improvement stores."
    },
    {
      "title": "Turn on your propane torch by opening the chamber and lighting the gas.",
      "content": "Turn on your propane torch by opening the chamber and lighting the gas. To ignite your propane torch, open up the chamber near the top of the torch so that gas is coming out. Then, take a lighter and light the gases. Always use caution when you use a propane torch. [10] X Research source Many hardware stores will rent out propane torches by the day or even by the hour."
    },
    {
      "title": "Pass the torch over the edge of the plexiglass.",
      "content": "Pass the torch over the edge of the plexiglass. Holding your torch steady, pass the flame quickly over the edge that you are polishing. Don’t let your flame linger, or you could melt the glass. Passing your flame over the edge should take 2 seconds at the most. [11] X Research source"
    },
    {
      "title": "Let the edge cool for 1 minute to see how it looks.",
      "content": "Let the edge cool for 1 minute to see how it looks. You will be able to tell if the edge is smooth after it is cool. Don’t touch or pass your flame over the edge again for another minute to give the plexiglass a chance to settle and harden again. [12] X Research source"
    },
    {
      "title": "Pass your torch over the edge again if it is not smooth.",
      "content": "Pass your torch over the edge again if it is not smooth. If your plexiglass is not smooth after one pass of your torch, you can do it 2 to 3 more times until it is. Your plexiglass will look shiny and smooth once it is finished. [13] X Research source"
    }
  ]
}