{
  "url": "https://www.wikihow.com/Create-a-Network-Documentation",
  "title": "How to Create a Network Documentation",
  "steps": [
    {
      "title": "Ask for help.",
      "content": "Ask for help. Common sense will tell that if you are a new employee and you need to understand how the network works you can ask for a documentation from your new colleagues. If you don't find such a documentation maybe you are lucky to find a colleague that wants to give you details. You can have the surprise to find people that don't want to share information with the rest of the team: sad situation but real."
    },
    {
      "title": "Work out the format.",
      "content": "Work out the format. If you want to create yourself a network documentation from scratch you probably understand the necessity and usability. You need to establish the format in which you will store the documentation and other aspects such as people who will work and access and update it."
    },
    {
      "title": "Think what information you need to collect in that documentation; suggestions could be:",
      "content": "Think what information you need to collect in that documentation; suggestions could be: number of physical locations (where your company works), how those locations are connected (wireless, wired), number of routers, switches, firewalls, servers in each location (with passwords, types of operating systems, update management, types of hardware, types of RAID, period of guarantee offered by vendors for hardware and software, rules in firewall), a contact list with people responsible with administration, help desk, a contact list with companies that offers support for hardware and software, documented and tested procedures for disaster / recovery scenarios, places to store backups (on site and off site), procedures for trial restores. You must understand how your network works in order to establish what information you will need to help you when trouble arise."
    },
    {
      "title": "Make it as simple or as complex as you need.",
      "content": "Make it as simple or as complex as you need. If you want something simple, you can download a network documentation software from the internet and you need to make sure that you have the proper access to install the software and to access the servers and subnets on the network. After you will run the software you will gain a drawing which will have a scheme of servers, computers and other network devices connected. Key words for this step could be: proper rights and permissions to install / run this network documentation software."
    },
    {
      "title": "Analyze that drawing and see if you are satisfied with the details for each device.",
      "content": "Analyze that drawing and see if you are satisfied with the details for each device. If you work in a network with many servers and other network devices you can use this software, but if you have a simpler and smaller network it's good to create some schemes yourself."
    },
    {
      "title": "Have a picture of how devices are connected, but also know exactly how to reach physically each device.",
      "content": "Have a picture of how devices are connected, but also know exactly how to reach physically each device. That's necessary because let's say a server is down and you don't know the reason for that and one reason could be that after applying some updates (for example) something goes not quite well. You can also have hardware failures (other example) and of course one can find a list of other reasons for that."
    },
    {
      "title": "Improve compliance.",
      "content": "Improve compliance. If you have a good network diagram you can prove compliance with policies, security standard and that will help not only you but by proving compliance with policies your managers will be much more confident in the IT department."
    }
  ]
}