{
  "url": "https://www.wikihow.com/Cope-if-You-Want-to-Become-Anorexic",
  "title": "How to Cope if You Want to Become Anorexic",
  "steps": [
    {
      "title": "Recognize that anorexia is often the result of other negative emotions.",
      "content": "Recognize that anorexia is often the result of other negative emotions. The desire to be thin may be a result of anxiety and destructive thinking. It sometimes is hereditary, but it's important to recognize that these thoughts will damage your body image and your body. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Negative emotions that you might experience may include sadness, anger, nervousness, insecurity, and others. You might have noticed that you have an intense fear of gaining weight and an intense desire to lose weight. These feelings are symptoms of anorexia. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Try to remind yourself that these thoughts are from the condition."
    },
    {
      "title": "Stop yourself from comparing your body to other people’s bodies.",
      "content": "Stop yourself from comparing your body to other people’s bodies. When you find yourself admiring other people’s bodies and comparing their bodies to yours, try to stop and think about what you’re doing. [4] X Research source By doing this, you are acting on an impulse driven by insecurity and anxiety.. Recognize it for what it is: disrupted thoughts and feelings fueled by an anorexic thought process. When you catch yourself judging other people’s bodies or comparing your body to theirs, force yourself to stop. Instead remind yourself you should accept others, no matter what their body type, and to accept yourself as you are. Think about your friends and family. They come in all shapes and sizes and you love and care about them all. Your love for them does not have anything to do with their size and neither does their love for you. [5] X Research source"
    },
    {
      "title": "Steer clear of internet content that encourages bad body image and unhealthy eating habits.",
      "content": "Steer clear of internet content that encourages bad body image and unhealthy eating habits. The internet can be an excellent source of accurate information, resources, and support for those with eating disorders. But it also contains unhealthy, damaging, and triggering content that can reinforce poor body image and drive unrealistic expectations. Avoid these unhealthy sources to help yourself cope with your feelings. [6] X Research source Even your social media outlets may contribute to your feelings. You may want to reduce your exposure or avoid social media altogether for a while. You may also want to avoid visiting fitness websites and applications because these can also be triggers for some people."
    },
    {
      "title": "Identify the things that are making you want to become anorexic.",
      "content": "Identify the things that are making you want to become anorexic. You may be tempted to become anorexic or engage in behaviors that lead to anorexia because of unhealthy images of body types, eating habits, and situations that promote extreme thinness. [7] X Research source Learning what makes you want to become anorexic is essential to learning which situations you need to avoid. Some questions that may help you figure out what is causing you to want to become anorexic include: Do you have a group of friends who obsess over how many calories they consume? If so, these friends may be influencing you. Try to spend less time with them or ask them not to talk about calories so much since peer influence can have a large effect on your eating habits. [8] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Does a family member often make comments about your body or your weight? Or did they make comments to you while you were growing up? Comments like these and any bullying you experienced is important to identify and discuss with a counselor. You may also want to talk to them about it and explain how it makes/made you feel. You should also let another family member know about this so you have someone on your side. [9] X Research source Are you constantly reading fashion magazines or watching shows that focus on thinness? [10] X Research source If so, take a break from these images for a while. Keep in mind that most of these images have been Photoshopped and these models do not look like that in real life."
    },
    {
      "title": "Seek out friends with a healthy body image and diet.",
      "content": "Seek out friends with a healthy body image and diet. Your friends’ attitudes toward food and their bodies can impact your eating habits and body image. Try to find people who have positive self-images and healthy attitudes toward food and weight and spend more time with them. [11] X Research source Loved ones can also help reframe your attitudes about food and your body. If a loved one voices a concern that you are too thin or unhealthy-looking, then you should listen and take it seriously."
    },
    {
      "title": "Try to avoid situations that trigger your urges.",
      "content": "Try to avoid situations that trigger your urges. Try to limit your exposure to unhealthy situations, and think about how you can spend your newfound time. If you are involved in a hobby or routine or exposed to an environment that is making your anorexic behaviors worse, then it might be time for a change. Choose to do something that is positive for you instead. [12] X Research source Consider stopping gymnastics, modeling, or any hobby that focuses on your size. Avoid weighing yourself or checking the mirror too much. Frequent weight checks and constant attention to your physical appearance can reinforce negative behavior patterns that many anorexic individuals share. Avoid friends who always talk about how much they weigh and compare themselves to others or ask to change the subject. Avoid websites, TV shows, and other outlets that portray unrealistic body types."
    },
    {
      "title": "Relax",
      "content": "Relax . If you have anorexic tendencies, then you probably have a high level of cortisol, which is a stress hormone. [13] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source When you are anorexic, you may be obsessed with being perfect, having control, or hiding insecurities. Being obsessed with these things causes significant amounts of stress. To help counteract stress, take some time to relax every day. Pamper yourself. Get a manicure and pedicure, go for a massage, or spend a spa night at home. Try yoga or meditation . Both of these activities have shown to reduce stress."
    },
    {
      "title": "Realize that \"fat\" is not a feeling.",
      "content": "Realize that \"fat\" is not a feeling. When you feel “fat,” you may be dealing with another emotion that you have associated with feeling fat. It's that emotion that you need to tune into. [14] X Research source The next time you get that “fat feeling” for no good reason, take a step back. What emotions are you feeling? What situation made you feel this negative way? Who were you with? Try writing out your answers to these questions as often as possible to look for patterns. For example, you might notice this feeling whenever you spend time with a certain person or when you are having a bad day. Use this information to look for patterns and change your environment to see if that helps you feel better about yourself. [15] X Research source"
    },
    {
      "title": "Remember that no diet can control your emotions.",
      "content": "Remember that no diet can control your emotions. Anorexia isn't just a severely restricted diet. It's an attempt to combat a larger problem. Following a strict diet may make you feel like you are more in control and this may give you a sense of accomplishment like “overcoming hunger.” [16] X Research source But any happiness you feel by limiting your food intake is masking a deeper problem. Look for more constructive ways to gain control of your life. For example, you can cut back on stressful activities or responsibilities, work on managing your time more efficiently, and get help for things you don't understand. Try to find other ways to feel happy. Do things that make you happy such as engaging in your hobbies and spending time with friends. Try to look in the mirror and compliment yourself every day. For example, you could look at yourself in the mirror and say something like, “Your hair looks really pretty today.”"
    },
    {
      "title": "Challenge your negative thoughts",
      "content": "Challenge your negative thoughts . Get into the habit of replacing negative thoughts with positive ones. Every time you notice that you are thinking something negative about yourself, try to turn it into something positive. For example, if you notice that you are having negative thoughts about the way that you look, think about something you are grateful for. This can be as simple as being grateful to be alive, having a place to call home, or being loved by your family and friends. [17] X Research source You can also make a list of your good qualities. Include as many items as you can think of, such as your talents, skills, achievements, and your unique interests."
    },
    {
      "title": "Be realistic about what anorexia will do to your body.",
      "content": "Be realistic about what anorexia will do to your body. Another way to get your mind off of wanting to become anorexic is to take a look at what happens to people who become anorexic. Between 5% and 20% of people with anorexia die. [18] X Research source If you become significantly underweight, you may: [19] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Develop osteoporosis (brittle bones that break easily) Be at risk of heart failure due to the damage caused to your heart Be at risk of kidney failure due to dehydration Experience spells of fainting, fatigue, and weakness Lose the hair on your head Develop bruises all over your body Have fertility problems Lose your sex drive Have a weakened immune system"
    },
    {
      "title": "Seek help no matter what.",
      "content": "Seek help no matter what. Anorexia looks different for different people. You may restrict your calories, purge, or do both. No matter what your anorexia looks like, it's important to talk to a professional. The problem isn't likely to go away on its own. [20] X Research source [21] X Expert Source Amy Chow Registered Dietitian Expert Interview. 22 October 2020. Even if you just find the idea of anorexia somewhat attractive, seek help now. A physician, psychologist or even a mentor can talk you through this. Anorexia isn't healthy or at all desirable. If you are suffering from anorexia, seek hospitalization or therapy. You'll get professional help to get over this and make it through. [22] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Talk to a role model.",
      "content": "Talk to a role model. Although you might be tempted to keep your attraction to anorexia or anorexic behavior secret, you must tell a trusted friend or family member, preferably someone older. Turn to someone in your circle who does not criticize his or her body and does not follow a strict diet. [23] X Research source Sometimes an outside perspective can make all the difference. Discussing your concerns about your body weight and self-image with a loved one can help you work toward improving your expectations for a healthy body and weight. This makes your battle less isolating and keeps you committed to making progress against anorexic tendencies. Research shows that incorporating family into your treatment plan can be very effective, especially for adolescents. [24] X Trustworthy Source National Institute of Mental Health Informational website from U.S. government focused on the understanding and treatment of mental illness. Go to source"
    },
    {
      "title": "Discuss your concerns with a health professional",
      "content": "Discuss your concerns with a health professional . Request a physical or ask to discuss your weight and body image with a doctor or nurse practitioner. Inform him or her of your intense thoughts about restricting food intake and losing weight and ask for advice and help as you navigate through eating more. [25] X Research source Select a practitioner who is committed to helping you avoid or beat anorexia. If your first attempt at finding a helpful practitioner fails, search for someone who will remain involved and help you develop a treatment plan, such as a cognitive behavioral therapy (CBT) or specialist supportive clinical management (SSCM) plan. [26] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source In some cases, dietitians may be excellent resources and may have more time to discuss your progress than regular physicians. Stick to your treatment plan and track your progress and discuss any deviations you may make from the treatment with your healthcare provider."
    },
    {
      "title": "Ask about therapeutic methods to avoid behavior that leads to anorexia.",
      "content": "Ask about therapeutic methods to avoid behavior that leads to anorexia. If you have already begun eating habits that lead to anorexia, you may require vitamin and mineral supplementation or intravenous nutrition. Discuss counseling, support groups, exercise and anti-anxiety strategies, and proper meal planning with your healthcare provider. [27] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source A mental health professional can be good for this, too. Not only will they be able to talk you through what you're going through now, but they can help you fight the reasons for the urges in the first place. They may also be able to prescribe medication. Discuss an appropriate weight range for your age, sex, and height. Everyone is unique, but your healthcare provider can offer advice for a healthy and realistic weight range for someone with your characteristics."
    },
    {
      "title": "Create a structured plan to avoid anorexia and build a better body image.",
      "content": "Create a structured plan to avoid anorexia and build a better body image. Your doctor or psychologist can help with this, too. Consider taking up art , journaling , yoga, meditation, nature photography, volunteering, or another daily activity to regularly commit to focusing less on food or losing weight and more on well-rounded health and your well-being. [28] X Research source Try choosing a mantra that reinforces a healthy body image and realistic expectations based on your size and body type. Write this mantra in your journal and recite it to yourself every morning. For example, you may want to choose something like “Food nourishes my body and makes me strong.” Commit to an eating plan, too. Promise yourself (and your doctor) that you'll eat three healthy meals a day. If you don't do this, you'll be letting yourself and your doctor down. Have a reward set up for yourself when you eat right. You may also want to always plan to eat with someone and have a conversation with them during your meal to distract you and help to reduce your anxiety. Start small, such as just sitting at the table and drinking a glass of water, and take incremental steps toward full meals. [29] X Research source Track your progress and get regular support or feedback. Take note of the success you achieve in learning new things, trying new activities, overcoming your negative self-image and learning to appreciate and recognize healthy body types."
    },
    {
      "title": "Call an eating disorder hotline.",
      "content": "Call an eating disorder hotline. If you do not have access to a health professional or if you prefer to first discuss your concerns over the phone, contact a national helpline. Here are a few useful numbers that can put you into contact with someone who can help: KidsHealth for Parents, Children, and Teens : www.kidshealth.org or 1-904-697-4100 Mental Health America : https://mhanational.org or [tel:18009696642 1-800-969-6642 National Association of Anorexia Nervosa and Associated Disorders : www.anad.org or 1-630-577-1330 National Eating Disorders Association : www.nationaleatingdisorders.org or 1-800-931-2237 Beat - Beating Eating Disorders : https://www.beateatingdisorders.org.uk or 0845-634-1414"
    }
  ]
}