{
  "url": "https://www.wikihow.com/Harvest-Cashews",
  "title": "How to Harvest Cashews",
  "steps": [
    {
      "title": "Keep the area below the cashew trees well raked and clear of weeds.",
      "content": "Keep the area below the cashew trees well raked and clear of weeds. This is so that you don't miss any of the cashew apples beginning to fall, which is when the nuts are ready for harvest. They will be less susceptible to rot or insects this way too. [1] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source"
    },
    {
      "title": "Wait to harvest the cashews until the apples begin to fall off the tree.",
      "content": "Wait to harvest the cashews until the apples begin to fall off the tree. The cashew nut is attached to the end of a bell pepper shaped fruit called the cashew apple. The cashew apple will turn from green to yellow, pink, or red, and the nut will become a dull grey, when starting to reach maturity. When the cashew apples begin to drop from the tree onto the ground, this indicates that full maturity has been reached, and this is the perfect time to harvest them. [2] X Research source Cashew trees take three years from planting to begin producing fruit. They will start to flower in the dry season (winter), and the fruit will take around two months to ripen."
    },
    {
      "title": "Collect the cashew apples and nuts.",
      "content": "Collect the cashew apples and nuts. Once the cashew apples have started falling, scour the ground below the trees, and collect the cashew apples and nuts. A basket or a sack is ideal to hold the cashew apples and nuts while harvesting. [3] X Research source The cashew apples are edible and juicy, and can be eaten in a variety of ways. However once they have fallen off the tree, they only keep for 24 hours and are highly perishable. If you are planning to eat these too, it's important to check the trees daily, and refrigerate or consume the cashew apples as soon as possible. [4] X Research source"
    },
    {
      "title": "Separate the cashew nuts from the apples by hand for efficiency.",
      "content": "Separate the cashew nuts from the apples by hand for efficiency. Simply twist the cashew nut firmly, and it will detach from the cashew apple into your hand. Sort the cashew nuts from the apples into two separate piles. [5] X Research source"
    },
    {
      "title": "Use string to separate the nuts from the apples for a clean break.",
      "content": "Use string to separate the nuts from the apples for a clean break. Tie a piece of string tight around where the cashew apple and nut meet, which will cleanly split them in two. Using string for separating the nut from the apple is especially important if you are wanting to use the cashew apple too. [6] X Research source Less juice from the cashew apple is lost with a clean break, which means that the apple will keep longer."
    },
    {
      "title": "Leave the detached cashews in sun to dry.",
      "content": "Leave the detached cashews in sun to dry. Spread the cashews out and place them on trays in direct sunlight. Leave them drying for three days, and cover them during the night with a tarpaulin. [7] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source You will know that the nuts are ready when they make a rattling noise if you drop them."
    },
    {
      "title": "Store the cashews somewhere cool and dry.",
      "content": "Store the cashews somewhere cool and dry. The cashew nuts in their shells will keep for up to two years, provided that they are stored away from sunlight and moisture. Since processing cashews is quite a big ordeal, waiting until you have a decent harvest to work with can be more efficient. [8] X Research source"
    },
    {
      "title": "Keep the cashews in the freezer if you are worried about insect pests.",
      "content": "Keep the cashews in the freezer if you are worried about insect pests. Ants, grain weevils, and meal moths all enjoy cashews too. Storing the cashews in the freezer eliminates the chance of insects finding a way into your cashew stash. [9] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source Freezing the cashews is also one way to begin to process them too."
    },
    {
      "title": "Use an airtight container to store the cashews.",
      "content": "Use an airtight container to store the cashews. Regardless of if you choose to store your harvested cashews in the pantry or freezer, a glass or plastic container with a lid is the best choice. The lid must always be tight and secure. [10] X Trustworthy Source Food and Agricultural Organization of the United Nations Specialized agency of the United Nations responsible for leading international efforts to end world hunger and improve nutrition Go to source The space where the cashew container is kept should be dry, dark, and out of direct sunlight."
    }
  ]
}