{
  "url": "https://www.wikihow.com/Make-Gelatin",
  "title": "How to Make Gelatin",
  "steps": [
    {
      "title": "Purchase some powdered gelatin packets.",
      "content": "Purchase some powdered gelatin packets. Each packet contains about 1 tablespoon of gelatin. This is enough to set 2 cups (450 milliliters) of water. [1] X Research source If you cannot find powdered gelatin, you can use gelatin sheets instead. To learn how to use those, click here ."
    },
    {
      "title": "Pour ½ cup (112.50 milliliters) of cold water into a large bowl.",
      "content": "Pour ½ cup (112.50 milliliters) of cold water into a large bowl. You will be adding 1 ½ more cups (337.5 milliliters) of water into the bowl later, so make sure that it is big enough. Do not use hot or warm water for this step."
    },
    {
      "title": "Tear open the packet and pour the gelatin over the water.",
      "content": "Tear open the packet and pour the gelatin over the water. Try to sprinkle the gelatin as evenly as possible over the water; any clumps will prevent the gelatin from absorbing the water. After a few minutes, the gelatin will start to expand. This step is known as \"blooming.\" If a recipe asks you to \"bloom\" gelatin, this is what it means. [2] X Research source It will take about 5 to 10 minutes for the gelatin to finish blooming."
    },
    {
      "title": "Bring 1 ½ cups (337.5 milliliters) of water to a simmer.",
      "content": "Bring 1 ½ cups (337.5 milliliters) of water to a simmer. Pour the water into a saucepan, and place the saucepan on the stove. Heat the water over medium heat until it begins to simmer."
    },
    {
      "title": "Pour the hot water into the gelatin.",
      "content": "Pour the hot water into the gelatin. Do not use boiling water, as this will ruin the gelatin."
    },
    {
      "title": "Stir until the gelatin dissolves.",
      "content": "Stir until the gelatin dissolves. You can use a spoon, fork, or whisk. Lift the spoon out of the gelatin from time to time to see if the powder has melted. If you see any specks or granules on the spoon, keep stirring until you don't see anymore granules."
    },
    {
      "title": "Pour the gelatin into some molds.",
      "content": "Pour the gelatin into some molds. You can use shaped molds, cups, or small bowls. You may want to lightly grease the inside of each mold with a flavorless oil; this will make it easier to remove later on."
    },
    {
      "title": "Let the set in the refrigerator for 4 hours before serving.",
      "content": "Let the set in the refrigerator for 4 hours before serving. Once the gelatin is firm, you can either take it out of the mold, or serve it in the cups or bowls."
    },
    {
      "title": "Purchase a package of gelatin sheets.",
      "content": "Purchase a package of gelatin sheets. You will need about 4 sheets of gelatin. This is equal to 1 tablespoon of powdered gelatin. [3] X Research source You may also find these labeled as \"leaf gelatin\" or \"gelatine.\""
    },
    {
      "title": "Place the sheets into large, flat dish.",
      "content": "Place the sheets into large, flat dish. Something like a casserole dish or a baking pan will work great. May sure that the sheets are separated, and sitting right next to each other. You will be pouring water over them. If you don't separate them, they will stick together and not dissolve properly."
    },
    {
      "title": "Pour enough cold water to cover the sheets.",
      "content": "Pour enough cold water to cover the sheets. You will need about 1 cup (225 milliliters) of water. Don't worry about making the measurement exact; you will be pouring this water away later."
    },
    {
      "title": "Wait until the gelatin sheets \"bloom.\"",
      "content": "Wait until the gelatin sheets \"bloom.\" They will expand slightly and become wrinkly. This will take about five to six minutes. Avoid leaving the sheets in the water for too long, or they will break down."
    },
    {
      "title": "Prepare 2 cups (450 milliliters) of warm water while you wait.",
      "content": "Prepare 2 cups (450 milliliters) of warm water while you wait. Bring the water to a simmer in a pot. Have this water ready and close by. You will be adding the gelatin sheets to it once they bloom."
    },
    {
      "title": "Lift the sheets out of the water and remove any excess moisture.",
      "content": "Lift the sheets out of the water and remove any excess moisture. You can do this by gently squeezing the sheets in your fist. [4] X Research source Be careful not to break them."
    },
    {
      "title": "Add the gelatin sheets to the hot water and stir until the dissolve.",
      "content": "Add the gelatin sheets to the hot water and stir until the dissolve. A spoon would work best for this, as the sheets may get caught in a fork or whisk."
    },
    {
      "title": "Pour the gelatin into a mold.",
      "content": "Pour the gelatin into a mold. You can also pour it into some cups or small bowls instead. If you are using a mold, you can lightly grease the inside with some flavorless oil. This will make it easier to take the gelatin out o the mold."
    },
    {
      "title": "Leave the gelatin in the refrigerator until it sets.",
      "content": "Leave the gelatin in the refrigerator until it sets. It will take about 4 hours for it to become firm."
    },
    {
      "title": "Try using Agar instead if you are vegan or vegetarian.",
      "content": "Try using Agar instead if you are vegan or vegetarian. Stir 2 teaspoons of powdered Agar per into 2 cups (450 milliliters) of water. Bring the mixture to a boil over medium heat. Keep stirring with a whisk until the Agar dissolves. At this point, you can sweeten it with 2 tablespoons of sugar. Cook it for 2 minutes, then remove it from heat and pour into some molds, cups, or small bowls. It will set in about an hour, but you can speed up the process by putting it into the fridge for 20 minutes. [5] X Research source You can also use 1 tablespoon of Agar flakes instead. Soak the Agar flakes in water for 30 minutes first. Drain the water and squeeze the extra moisture out of the flakes. Add the flakes to 2 cups (450 milliliters) of water and cook for 2 minutes. Agar is made from seaweed. You may also find it labeled as: Agar-Agar, China grass, or kanten. [6] X Research source"
    },
    {
      "title": "Make panna cotta with cream instead of water.",
      "content": "Make panna cotta with cream instead of water. Sprinkle 2 tablespoons of gelatin powder over 6tablespoons of cold water and set aside to bloom, about 5 to 10 minutes. Meanwhile, heat 4 cups (1 liter) of heavy cream and ½ cup (100 grams) of sugar in a saucepan over a stove. When the sugar dissolves, stir in 2 teaspoons of vanilla extract. Pour the mixture over the bloomed gelatin, and stir with a spoon to mix. Pour the panna cotta into cups or molds, and let set in the fridge for at least 4 hours. [7] X Research source You can also use half-and-half instead of heavy cream. This will give you a lighter panna cotta. Keep in mind that gelatin made with dairy may take longer to set."
    },
    {
      "title": "Make fruit-flavored gelatin by using fruit juice instead of water.",
      "content": "Make fruit-flavored gelatin by using fruit juice instead of water. Pour two packets of unflavored gelatin over 1 cup (225 milliliters) of juice. Boil 3 cups (675 milliliters) of juice, then pour it over the gelatin-juice. Stir until the gelatin is dissolved and everything is combined. Pour the gelatin into molds. You can also use cups or small bowls. Refrigerate for about 4 hours, or until the gelatin becomes firm. [8] X Research source"
    },
    {
      "title": "Make lemon-flavored dessert gelatin.",
      "content": "Make lemon-flavored dessert gelatin. Sprinkle 1 tablespoon of gelatin over ½ cup (112.50 milliliters) of cold water and set aside to bloom. Dissolve 1/3 cup (75 grams) sugar in 1 cup (225 milliliters) of hot water. Add in the bloomed gelatin and 3 tablespoons of lemon juice. Stir until everything has dissolved. Pour into molds and leave in refrigerator until it sets."
    },
    {
      "title": "Consider adding fruit.",
      "content": "Consider adding fruit. You can place pieces of fruit into the bottom of the mold before you pour in the gelatin. You can also suspend pieces of fruit in the gelatin. To do this, leave the gelatin into the refrigerator until it is almost set. Once it feels like a soft gel, stir the cut pieces of fruit in. Put the gelatin back into the fridge so that it can finish setting. [9] X Research source Be careful when adding topical fruits, such as figs, ginger, kiwi, papaya pineapple, and prickly pears. The enzymes in these fruits will keep the gelatin from setting. [10] X Research source If you want to use these fruits (with the exception of kiwi) in gelatin, you will need to peel, cut, and boil them for five minutes before adding them to the gelatin. Kiwi should not be used in gelatin. Even peeling and boiling it will not get rid of the enzyme."
    },
    {
      "title": "Create different flavors of gelatin and panna cotta to create a layered dessert.",
      "content": "Create different flavors of gelatin and panna cotta to create a layered dessert. Let each layer of gelatin almost set before adding the next layer. You want the consistency to be soft and gel-like. If you add the layers too late, they won't stick together. If you add them too soon, they may melt together. [11] X Research source"
    },
    {
      "title": "Pour gelatin into fun-shaped molds to create shaped gelatin.",
      "content": "Pour gelatin into fun-shaped molds to create shaped gelatin. Once you have the gelatin in the mold, let it set in the fridge for about 4 hours. To take the gelatin out of the mold, stick the mold into a bowl of very hot water. Be careful not to get any water onto the gelatin. After a few seconds, pull the mold out and jiggle it. Hold a plate over the top of the mold and flip everything over. Put the plate on a table and lift the mold off. The gelatin should be sitting on the plate now. If it's not, repeat the hot water soak. [12] X Research source Try chilling the mold in the fridge for a few hours until you are ready to use it; this will help the gelatin set even faster."
    }
  ]
}