{
  "url": "https://www.wikihow.com/Questions-to-Ask-a-Psychic",
  "title": "78 Questions to Ask a Psychic or Medium",
  "steps": [
    {
      "title": "Focus on questions about opening yourself up to love.",
      "content": "Focus on questions about opening yourself up to love. A love reading is a great way to put your finger on the pulse of your romantic life, whether you’re in a relationship, single, or just curious about love in your future. [1] X Research source Rather than asking questions like, “When will I meet my true love?” ask questions that’ll help you be the best partner you can be when that person does come along (if they haven’t already), so that you’re prepared to take them into your arms. How can I better show my love for my partner? What can you tell me about the energy of my relationship? How will I know if my partner is right for me? What sort of relationship obstacles do you see in my future, and how can I overcome them? How can I open my heart and soul to help me find my soulmate? Have I already met my soulmate? How can I regain power in a controlling relationship? How can I improve my sex life ? What can I do to find a meaningful relationship? How can I move on from past romantic wounds ? How can I stop thinking about my ex ? How can I stop self-sabotaging my relationships? How can I tell if I should get back together with my ex?"
    },
    {
      "title": "Ask questions about how to keep your family relationships strong.",
      "content": "Ask questions about how to keep your family relationships strong. Your family ties are some of the most important connections you may ever form, but that doesn’t mean you should take them for granted. Even our family relationships need some guidance now and then. [2] X Research source Ask your psychic questions focused on maintaining and improving those relationships, and focus on finding ways to enhance your family life . How can I help my family members in trouble? Why does my family seem distant from me? How do I heal broken bonds in my family? How can I improve communication in my family? What can I do to reconnect with estranged family members? How do I cultivate love in my family? How can I forgive my family for past wounds? How can I get closer to my children? How can I learn to get along with my siblings? What sort of messages do my late family members have for me?"
    },
    {
      "title": "Get more insight about the people you surround yourself with.",
      "content": "Get more insight about the people you surround yourself with. Friendships are just as important as any other relationship—they enrich your everyday life, help you through tough times, and teach you about yourself. [3] X Research source It’s important to know how to surround yourself with good people so that you grow into the best version of you. Ask some of these questions to help you build and maintain strong and healthy friendships: How can I find new friends ? Why do I feel a rift between me and my friend? What can I do to be a better friend ? How can I ask my friends to help me be a better person? How can I show my support for my friends ? How do I know if a friend isn’t really a friend? How do I let go of relationships that no longer serve me? What can I do to ease conflicts in my friend group?"
    },
    {
      "title": "Ask the psychic questions about your own career satisfaction and path.",
      "content": "Ask the psychic questions about your own career satisfaction and path. A psychic can help you find clarity on how you feel about your own job and career. [4] X Research source You might feel stuck or trapped in a dead-end job, or unsure of where to turn to look for work that fulfills your passion. Or, you might be worried about managing your money. Asking a psychic the following questions may provide some much-needed inspiration and reveal a path forward: What new opportunities does my professional future hold? What sort of challenges should I be aware of at work? When would be the best time for me to make my career change? How can I find a job that best suits my passions? When should I get a promotion or ask for a raise ? How can I excel in my career field? How can I find a career that feeds and nurtures my soul? How can I be better at saving money? What investments should I make, and which should I avoid? How can I achieve my financial goals? How can I earn some extra income? How should I manage my current financial situation? What should I consider before making a large purchase? How can I get money that someone owes me? How should I handle a large sum of money that I recently received?"
    },
    {
      "title": "Focus on life questions that provide motivation and inspiration.",
      "content": "Focus on life questions that provide motivation and inspiration. Your psychic or medium is a great source of inspiration when it comes to exploring the purpose of your own life. [5] X Research source They can help you identify what makes you happy and how to chase that happiness to make a fulfilling life. How can I find my life’s purpose ? How will I know when I’ve found my purpose? What should I do to find people who will help me achieve my purpose? What sort of messages does the universe have for me? How can I overcome obstacles that are blocking me from achieving my purpose? What can I do right now to take a step closer to my destiny? What lessons do I have to teach others? What lessons do I need to be taught? What can you tell me about my past lives?"
    },
    {
      "title": "Ask your psychic questions focused on your happiness and mood.",
      "content": "Ask your psychic questions focused on your happiness and mood. When it comes to more pressing matters of your physical and mental health, it’s best to consult a doctor for advice. [6] X Research source That said, a psychic can help you explore your own mental landscape and figure out what you’re feeling and why, which in turn may help you get a better understanding of your mental health and find next steps, like talking to a therapist . How can I change negative thoughts into positive thoughts? What can I do to improve my own health? How can I protect my physical and mental energy? How can I reduce my stress and anxiety? Why do I feel negatively about my body, and how can I feel more positively? How will I know when I’m ready to be pregnant? How can I ask my partner if they’re ready for children? What sort of health changes do you see in my future?"
    },
    {
      "title": "Work with your psychic to fine-tune your spiritual feelings and beliefs.",
      "content": "Work with your psychic to fine-tune your spiritual feelings and beliefs. Psychics and mediums have special spiritual connections, channeling energy through their own thoughts, feelings, and even inanimate objects. They’re an obvious choice when looking for a spiritual mentor, and asking them some of these questions is a great way to illuminate new facets of your own spirituality. What sort of message does my spirit guide have for me? How can I connect with my spirit guides ? How can I heal my inner child ? Why do I feel lost on my spiritual journey? How can I find my spiritual path? How will I know when I’m on the right spiritual path? How can I be more sensitive to the spiritual world around me? What steps do I need to take to obtain spiritual growth? How can I develop my own psychic gifts?"
    },
    {
      "title": "Ask your psychic about how you can better care for your pets.",
      "content": "Ask your psychic about how you can better care for your pets. Pet psychics are special kinds of psychics who are in-tune with the energy of animals, both living and deceased. [7] X Research source Ask your psychic some of the following questions to get more insight into your animal companion and to learn how you can show them even more appreciation and comfort. How can I be a better caretaker for my pets? What do my pets wish I did better? What sort of messages are my pets trying to send me? How can I know if my pets are happy, in this life and the next? How can I show my pets that I love them? How will I know when I’m ready for a new pet?"
    },
    {
      "title": "Ask open-ended “how,” “what,” and “why” questions.",
      "content": "Ask open-ended “how,” “what,” and “why” questions. Formulating a good question for a psychic is all about balance. You’re not guaranteed an answer for questions that are too specific, but if your questions are too vague, your psychic may get other signals and go down a path you weren’t hoping for. Rather than asking yes-or-no questions, ask questions about the how, what, and why. [8] X Research source This helps you gain the most insight with the most efficient line of questioning. For example, instead of, “Will I find love soon?” you might ask, “How can I find love in the future?” Instead of “Is my family member angry with me?” ask, “Why might my family be frustrated with me?”"
    },
    {
      "title": "Avoid questions about self-doubt.",
      "content": "Avoid questions about self-doubt. Psychics tend to get a lot of “reassurance” questions, or questions clients ask just to make themselves feel better. These are questions like, “Am I a bad person?” or, “Did I do the right thing?” Your psychic is there to help you become the best version of yourself, not to tell you that you’re unworthy of being that person. So focus on questions that will help you improve and grow rather than questions about who you are (or aren’t) at the moment. Instead of asking the psychic qualitative questions about yourself (“Am I…”), ask them for ways you might achieve what you want. Instead of, “Am I talented enough for this job?” ask, “How can I get the skills I need for this job?” or, “How can I land this job with my current skills?”"
    },
    {
      "title": "Have a specific intention in mind for your psychic reading.",
      "content": "Have a specific intention in mind for your psychic reading. It’s totally fine to go in with no expectations, but centering your time with a psychic on a specific topic or intention helps you get the best answers. [9] X Research source For example, you might decide that this reading will be all about the future of your love life, or that you’ll only ask questions about your family relationships. Keeping a narrower focus intensifies the message and yields more helpful and specific answers."
    }
  ]
}