{
  "url": "https://www.wikihow.com/Align-Tracks-in-Audacity",
  "title": "How to Align Tracks in Audacity",
  "steps": [
    {
      "title": "Open the Audacity program.",
      "content": "Open the Audacity program. You should see the main screen, with colored controls at the top and gray space for available tracks underneath."
    },
    {
      "title": "Record your original track.",
      "content": "Record your original track. You will see the track populate with lines that represent sound modulation, directly under the controls. Use your initial track as a marker for rhythm and timing. Many musicians record an initial track as an \"orienting track,\" where they then align additional tracks with the first one. This track often includes percussion, a static beat or any element that will well represent time for the entire song or project."
    },
    {
      "title": "Input additional tracks as necessary.",
      "content": "Input additional tracks as necessary. Get these by inputting them directly through microphones, or using prerecorded samples to beef up your final sound composition."
    },
    {
      "title": "Select your additional tracks to align them with your initial track.",
      "content": "Select your additional tracks to align them with your initial track. Experts recommend using the \"select\" tool available in the tools menu. An alternative method is to simply click on the whole track to select it."
    },
    {
      "title": "Use an align command to effectively move your selected track.",
      "content": "Use an align command to effectively move your selected track. A variety of commands in Audacity help you to align sound pieces. Try an \"align with zero\" command. The \"align with zero\" command allows you to align all tracks with the beginning of the overall time for the project. Use an \"align with cursor\" command. You can effectively move sound portions to where you want them by placing your cursor in the spot where you want the alignment to take place and using an \"align with cursor\" command. Additional options include using a \"selection start\" or \"selection end\" command for alignment."
    },
    {
      "title": "Play back the track and make sure your sounds are placed correctly.",
      "content": "Play back the track and make sure your sounds are placed correctly. If not, edit them as necessary."
    }
  ]
}