{
  "url": "https://www.wikihow.com/Make-Your-Fingers-Hard-for-Guitar",
  "title": "How to Make Your Fingers Hard for Guitar",
  "steps": [
    {
      "title": "Play for at least 15 minutes a day to gradually toughen your fingers.",
      "content": "Play for at least 15 minutes a day to gradually toughen your fingers. Be consistent with your practice routine to harden and maintain your calluses. As your fingers start hurting less, aim for 3–4 daily practice sessions that are each 15 minutes long. [1] X Research source If you don’t feel sore after finishing a session, switch over to a single 45- to 60-minute practice and see how you feel. Put your guitar down and rest if you feel an intense or stinging pain in your fingers. Avoid taking days- or weeks-long breaks from playing your guitar , or your fingertips will start to soften."
    },
    {
      "title": "You’ll develop harder fingertips playing on bigger strings.",
      "content": "You’ll develop harder fingertips playing on bigger strings. Remove the old guitar strings from your guitar and replace them with new ones labeled “medium” or “heavy.” Since the new strings are wider, they’ll press against your fingertips more and form calluses faster. [2] X Research source You can buy guitar strings online or at your local music store. If you're a beginner, thicker strings may make playing chords a little more difficult. Avoid playing on thin or light strings since they’re more likely to cut your skin if you don’t have calluses built up."
    },
    {
      "title": "The thick steel strings on an acoustic guitar toughen your hands faster.",
      "content": "The thick steel strings on an acoustic guitar toughen your hands faster. Since they use larger strings higher off the frets, acoustic guitars make you press down a little harder than you would on an electric. The thickness and friction of the strings, plus the added pressure from holding them down, makes your fingers harder. [3] X Research source Even if you normally play or perform with an electric guitar, use an acoustic for practice. Acoustic guitar is actually more difficult to play, so you’ll feel a lot more comfortable when you switch back to an electric guitar. If you notice pain in your wrist or elbow while you’re practicing, slightly loosen your grip on the strings."
    },
    {
      "title": "Mimic the pressure of guitar strings even when you’re not playing.",
      "content": "Mimic the pressure of guitar strings even when you’re not playing. Press your fingernails or the edge of a credit card into your fingertips. Mimic where the guitar strings press into your fingers. Push hard enough so your skin indents but not so much that it causes pain. [4] X Research source You can do this anytime—while waiting in line, sitting in class or a meeting, or watching TV. Buy a finger strengthener tool online or from your local music store. These tools have spring-loaded buttons to help you develop calluses and finger strength."
    },
    {
      "title": "Long nails prevent calluses from forming.",
      "content": "Long nails prevent calluses from forming. Cut your fingernails short with a pair of nail clippers. Press down on your guitar strings and see if your fingernails scrape the surface of your fretboard. If your nails touch the fretboard, trim them shorter. [5] X Research source Keeping your nails short also prevents you from scratching your fretboard or damaging your nails when you slide your hand."
    },
    {
      "title": "Rubbing alcohol dries out your fingers and helps harden calluses.",
      "content": "Rubbing alcohol dries out your fingers and helps harden calluses. Rubbing alcohol may also relieve some of the soreness you feel from playing guitar. Soak a cotton swab in rubbing alcohol and wipe your fingertips with it. Repeat this process 3-4 times a day. [6] X Research source Even Eric Clapton used this trick before he played!"
    },
    {
      "title": "Apple cider vinegar strengthens your calluses.",
      "content": "Apple cider vinegar strengthens your calluses. The vinegar dries out and toughens up your fingers so that the calluses will develop more quickly. Pour some apple cider vinegar into a small bowl and leave your fingers in it for at least 30 seconds. Do this 30-second dip before and after you practice, but make sure your fingers are completely dry before playing. [7] X Research source Apple cider vinegar also helps alleviate pain and soreness in your fingertips. You can use the same apple cider vinegar that you would use in your kitchen."
    },
    {
      "title": "Moisturizers and soaps soften your calluses and make them disappear.",
      "content": "Moisturizers and soaps soften your calluses and make them disappear. While you can moisturize the rest of your hand, avoid applying lotion or any skin conditioner onto your fingertips. Even calluses you’ve been building up for months could go away and get rid of all the work you’ve done. [8] X Research source A lot of hand soaps have skin softeners as well. If you can, try washing your hands with a waterless sanitizer instead. Protect your hands and calluses by wearing gloves whenever you have to do something that will soak your hands, such as washing your hair or doing dishes."
    },
    {
      "title": "Calluses wear away when your fingertips are wet or overhydrated.",
      "content": "Calluses wear away when your fingertips are wet or overhydrated. Wait one hour after washing your hands before practicing your guitar. Make sure your skin is completely dry. [9] X Research source Playing guitar with wet fingertips may also be more painful, as the skin on your fingers is more delicate when wet."
    },
    {
      "title": "Avoid scratching at your calluses or picking off loose skin.",
      "content": "Avoid scratching at your calluses or picking off loose skin. If you pick your calluses off, you’ll have to start building them up again. Let your fingertips keep hardening over time so you don’t lose them. Otherwise, it will be painful to play guitar again. [10] X Research source"
    }
  ]
}