{
  "url": "https://www.wikihow.com/Be-Blessed-(Christianity)",
  "title": "How to Be Blessed (Christianity)",
  "steps": [
    {
      "title": "Humble yourself as Jesus said:",
      "content": "Humble yourself as Jesus said: \"Blessed are the 'poor in spirit': for theirs is the Kingdom of Heaven.\" (Matthew 5:3) Read this and the other eight blessings for you as they were explained by Jesus, in Matthew 5, which are keys to unlocking such personal blessings. Jesus promises that the poor in spirit can enter His Kingdom in this life! The Kingdom of God , Jesus said, \"is within you\" as Christ \"lives there\" -- as his presence, his Spirit, can be vital to you. Jesus said that \"I must go to my Father\"... [and shall] \"send you another comforter to abide with you forever.\" The words \"poor in spirit\" mean not finding special pleasure in yourself/your-life, and though you have been taught to be self-sufficient and proud of your reasoning and independence: still you may become smaller in your own eyes. If you are ready to depend on God's will for your blessings -- not ignoring God and not managing your own life and not making your choices all alone , not to be merely limited by \"self\", then you are ready to be blessed. When you admit your limitations to Him--then you are humble, and God can then move in you and move you into his presence -- in the Kingdom of Heaven -- and begin blessing your life."
    },
    {
      "title": "Repent, be sorry for your bad deeds, accept responsibility, and be willing to change for the better.",
      "content": "Repent, be sorry for your bad deeds , accept responsibility, and be willing to change for the better. \"Blessed are they that mourn: for they shall be comforted.\" (Matthew 5:4) In this beatitude Jesus puts value on grief and repentance evidently that would be helping the suffering of others and grief for your own flaws . So mourn and--in the first beatitude--you were told to become humble, \"smaller\" in your own eyes, and rely on God. Ordinary activities of life do not bring real joy, not like faith, hope and God's Love do. Daily life may leave you thinking: \"If only I had ____\" (fill in the blank); it leaves you feeling your regrets, for what has been lost: lost peace, joy, hope -- and you may find yourself with \"a broken spirit\" -- a hurting attitude about life. Regret your past sins, such as your damages to others -- and the time that you may have been against or ignoring and lacking God's blessing. Forgiving others removes selfishness and the guilt of \"self-centered\" life. So He lets you accept forgiveness. Your guilt is removed through God's grace. You are blessed, and you know God is real."
    },
    {
      "title": "Be unassuming, non-egotistical.",
      "content": "Be unassuming , non-egotistical. \"Blessed are the meek: for they shall inherit the earth.\" (Matthew 5:5) Here in the third beatitude (again) there is a word that gives some negative feelings: Meek may imply weak --as in lacking spirit or courage . No! Be strong but not violent, and be able to endure problems with patience-- not resenting other people or God, made possible by receiving Christ's Spirit in you. Jesus described himself as: \" I am meek and gentle. \" He was able to handle conflicts, insults, crisis without egotism as in: \"He's got it all together\". So He said that the non-aggressors would \" inherit the earth \"; eventually you receive the unearned gift of being a sister or brother of The King in The Kingdom of Jesus. The recipient of the gift is an heir who, without personal effort, takes control and ownership of property -- your environment -- as you yield control of your existence in Christ to God's ways. Man was to have dominion over the Earth. God will dwell with you, in harmony and will control the path set in front of you to make it acceptable to God, productive and satisfying in Christ as you follow the path set by The Lord. Remember God will not deny any good thing, but not everything is expedient (some personal ventures might not follow the Lord's path)."
    },
    {
      "title": "Seek right ways with an appetite for good.",
      "content": "Seek right ways with an appetite for good. \"Blessed are those who hunger and thirst for righteousness, for they shall be satisfied.\" (Matthew 5:6) Most people imagine themselves pure. You have never heard, \"I did that to be mean and foolish.\" Doing any angry or revengeful act is embarrassing when your mistakes become public. You need to make righteous choices for your own sake. It makes life easier. The apostle Paul spoke of a dilemma, \"I do not fully control my actions. I do not do what I want, but do what I would not do.\" Guilt and human nature makes your soul \"hunger and thirst\" for right choices and habitual righteousness; just like when you say, \"I need something to eat and drink, now!\" Also, built into you is a hunger to be right. You want to be seen as right. Righteousness is the food and drink of your spiritual health: free from guilt, shame and sin: depend on God's promise to grow his righteousness in you."
    },
    {
      "title": "Show mercy.",
      "content": "Show mercy. \"Blessed are the merciful: for they shall obtain mercy.\" (Matthew 5:7) You do not need to use complete sentences in your prayers -- just say \"Thank You Lord!\"; \"Mercy...\", or simply talk to Him, \"God...\" or something like, \"Oh, God...\". Just be merciful so that He will hear you when you ask for mercy. God is merciful and \"will have mercy on whom he will have mercy\" (compassion). Inhumanity of man against others has always been a force in history. So that the past history reveals selfish, inconsiderate , and cruel -- oppressing habits that cause poverty, slavery, being disinterested in social unrest, not working these things out with generous mercy, but with great indifference instead, not seeing the needs of the hurting. Jesus tied your receiving God's mercy with your giving mercy to others. The more mercy you give out, the more you will receive -- \"as you sow, so shall you reap .\" You see that your mercy brings reward."
    },
    {
      "title": "Be pure through faith.",
      "content": "Be pure through faith. \"Blessed are the pure in heart: for they shall see God.\" (Matthew 5:8) Are there any popular radio, TV, talk shows, movies that consider purity and chastity as entertainment? Purity is found by concentrating on and dedicating to and seeking to right what is wrong, first in your own life, by God's will and purpose. But realize that Jesus said, \"You hypocrite, first take the plank out of your own eye, and then you will see clearly to remove the speck from your brother's eye.\" (Matthew 7:5) -- which points out that one has to not judge others' behaviors, or be a hypocrite. Your loving God will reward you in his presence by spiritual means. So it lets you \"see\" God, free from the pollution of mixed up desires in thoughts, words and deeds. \"Cleanse your mind ; clean up your act\" and in the fullest sense as God himself removes your desire for impure thinking and impure ways of acting. God purifies your being from the inside. \"Seeing\" God: knowing him as your Father (by being in His presence) is the blessing promised in this beatitude."
    },
    {
      "title": "Be a peacemaker",
      "content": "Be a peacemaker and be especially blessed!. \"Blessed are the peacemakers: for they shall be called 'the children' of God.\" (Matthew 5:9) Peace is a nice idea, as long as you get your way, but it's more than that. It starts at home: Love your wife... -- and have personal peace and love in Jesus. That starts by not returning evil for evil. He said, Turn the other cheek. Do what is asked of you and forgive each other . Love unconditionally--treating the other as one would like to be treated, if the two roles were suddenly reversed: So, be kind to your enemy. Never overreact--just let revenge stop now! Hostility stops with you -- impossible? No! He empowers you. Peace may be found by doing something as simple as giving a difficult person a nice new pencil, a package of chips or a coupon for a free sandwich, if that makes sense. His grace is sufficient; pass it on. God \"walks\" with you, overseeing your life as you walk in his path, handling difficulties for you (\"Bless and curse not!\") in His own way, and protecting your person, even through the valley of the shadow of death. He continuously sends blessing, both spiritually and materially. Your Father in Heaven can give you what your heart/core desires (deep, right feeling), fulfilling real needs by his grace and through your faith. Peacemaking brings God with His peace and harmony into your life."
    },
    {
      "title": "Accept persecution.",
      "content": "Accept persecution . \"Blessed are they which are persecuted for righteousness sake, for theirs is the kingdom of heaven.\" (Matthew 5:10) Some bad news--\"persecutions,\" if you are righteous -- but don't worry! You will be blessed with the benefits of the Kingdom of Heaven, if you are harassed because your life is in Christ and his newness of life is in you. Well, you are different -- if you are in Christ. This threatens those who don't understand life's basis: spiritual life. You have put God first, and so your outlook seems to be crazy to others, who do not agree. You are just \" crazy enough\" to have the best in this life and in the life to come."
    },
    {
      "title": "Accept persecution (meant for Him).",
      "content": "Accept persecution (meant for Him). \" Blessed are you, when men shall revile you, and persecute you, and shall say all manner of evil against you 'falsely,' for my sake. \"(Matthew 5: 11) This is like people harshly criticizing (reviling) you because of your calling Jesus Christ the Lord . No persecution is not the end of this thought; there is still the blessing. There is so much more blessing than the negative part... there is the rejoicing and being very glad ."
    },
    {
      "title": "\"Rejoice, and be exceedingly glad:",
      "content": "\"Rejoice, and be exceedingly glad: for great is your reward in Heaven: for so persecuted they the prophets which were before you.\"(Matthew 5: 12) Yes, He says you should rejoice because of the fact that you endure problems and troubles with people because you believe and live in His life. So, rejoice through your troubles and through your weakness--for in Him you are made strong (that's another blessing), and you have a great reward in Heaven."
    }
  ]
}