{
  "url": "https://www.wikihow.com/Remove-a-Toothpaste-Stain",
  "title": "How to Remove a Toothpaste Stain",
  "steps": [
    {
      "title": "Use a clean cloth to remove any crusty patches.",
      "content": "Use a clean cloth to remove any crusty patches. Moisten the area of the stain with a clean cloth. Rub the cloth back and forth over the area until the crusty top layer of the stain is gone. This will make it easier for the detergent to penetrate the stain underneath. [1] X Research source If the stain is on delicate fabric that is easily damaged by friction, avoid rubbing the area, and just moisten it instead. This method also works for cleaning rugs."
    },
    {
      "title": "Mix 2 cups (470 mL) of water with 1 tablespoon (15 mL) of liquid detergent.",
      "content": "Mix 2 cups (470 mL) of water with 1 tablespoon (15 mL) of liquid detergent. [2] X Expert Source Francesca Ortega Cleaning & Organization Expert Expert Interview. 3 March 2022. Measure the water and detergent into a small bowl. Use liquid dishwashing or clothes washing detergent -- either will work. Stir the water and detergent until they are just combined. [3] X Research source Avoid using a whitening or bleaching detergent as this can damage the fabric that you are trying to clean."
    },
    {
      "title": "Rub the detergent and water solution into the stain with a clean cloth.",
      "content": "Rub the detergent and water solution into the stain with a clean cloth. Dunk a cloth into the cleaning solution and wring out any excess liquid. Gently rub the cloth back and forth over the stain. Continue to rub the area until the stain disappears. [4] X Research source Use a white cloth to avoid any colour from the cloth leaking onto the fabric. Cotton or microfibre cloths work well for removing stains."
    },
    {
      "title": "Dry the area with a towel.",
      "content": "Dry the area with a towel. Leaving wet patches on the fabric can cause mould to grow. Place a towel over the wet area and press down on it to absorb the water. Continue to blot the area until the fabric is dry to touch. [5] X Research source If you are having trouble removing all the liquid from the fabric, place a fan in front of the area to remove the remaining liquid. [6] X Research source"
    },
    {
      "title": "Dampen the stain with a wet cloth.",
      "content": "Dampen the stain with a wet cloth. Saturate a cloth in cold water and then squeeze it tightly to wring out any excess water. Moisten the marked area with the cloth and rub off any crusty toothpaste residue that is sitting on the surface of the fabric. Cotton cloths or face cloths work well for removing stains from clothes."
    },
    {
      "title": "Rub laundry detergent into the stain with a toothbrush.",
      "content": "Rub laundry detergent into the stain with a toothbrush. Wet a clean toothbrush with cold water and then dip it into laundry detergent. Gently scrub the stained area to agitate and dissolve any toothpaste that is stuck in the fibres of the fabric. Continue to scrub the stain until you can’t see any toothpaste residue left in the fabric. If the fabric pills easily, rub the stain very gently to avoid damaging it. If the clothing is made from silk or suede, don’t rub the detergent into the fabric, just let it sit on top."
    },
    {
      "title": "Launder the item as usual.",
      "content": "Launder the item as usual. This helps to remove any remaining residue from the fabric and helps to prevent water marks forming. [7] X Expert Source Francesca Ortega Cleaning & Organization Expert Expert Interview. 3 March 2022. Read the label on the inside of the clothing to find the washing instructions. Add laundry detergent to the washing machine and then press start. [8] X Research source If you can’t find the instructions on the label, set the machine to a cold and gentle cycle. If the stain is on silk or suede fabric, set the wash to a slow and gentle cycle."
    },
    {
      "title": "Wipe the stain up with a damp cloth immediately, if possible.",
      "content": "Wipe the stain up with a damp cloth immediately, if possible. Toothpaste stains are easiest to clean up when they are fresh. If you notice the stain when it is fresh, rub a damp cloth back and forth over the area until all the toothpaste residue is gone. [9] X Research source If the cloth is smearing the stain, rinse it with water and then try again. Microfibre and cotton cloths work well for rubbing stains."
    },
    {
      "title": "Spray a surface cleaner over the stain and leave it to sit for 4 minutes.",
      "content": "Spray a surface cleaner over the stain and leave it to sit for 4 minutes. Choose a spray-on surface cleaner that is designed for the bathroom or for removing surface stains. Spray the cleaner liberally over the stain and leave it to dissolve the toothpaste residue. [10] X Research source Purchase a spray-on surface cleaner from the cleaning aisle of the supermarket. Make sure that the product is suitable for the material for your sink. For example, if you sink is ceramic, look for a surface cleaner that says that it is “ceramic-friendly.” Set a timer to remind you to finish cleaning the stain. If you want a more natural option, look for a surface cleaner that has baking soda in it."
    },
    {
      "title": "Wipe the stain away with a paper towel.",
      "content": "Wipe the stain away with a paper towel. [11] X Expert Source Francesca Ortega Cleaning & Organization Expert Expert Interview. 3 March 2022. This absorbs the surface cleaner and helps to agitate any remaining toothpaste residue off the sink. If necessary, apply pressure and rub the area back and forth with a paper towel to remove any remaining remnants of the stain. [12] X Research source If you don’t have paper towels, use a cleaning cloth instead."
    },
    {
      "title": "Rub scouring gel over the stain, if necessary.",
      "content": "Rub scouring gel over the stain, if necessary. If the toothpaste stain remains on the sink after using a surface cleaner, use scouring gel to grind the stain off. This gel has a thick and gritty texture that helps to remove the stain. Pour the gel over the area and use a cotton cloth rub to it into the stain. Continue to rub the area until the stain is completely removed. [13] X Research source Purchase a scouring gel from a cleaning or home store. Look for a non-abrasive scouring cleaner as this won’t damage the surface of your sink."
    }
  ]
}