{
  "url": "https://www.wikihow.com/Play-Apples-to-Apples",
  "title": "The Ultimate Guide to Playing & Winning at Apples to Apples",
  "steps": [
    {
      "title": "Gather a group of 4 to 10 players.",
      "content": "Gather a group of 4 to 10 players. Apples to Apples works best with 4-10 players (although certain versions of the game can be played with more). Have all the players gather around a table or arrange themselves in a circle on the floor. Keep in mind that the fewer players there are, the faster-paced the game will be, which can increase the hilarity! [1] X Research source A deluxe “Party” version of Apples to Apples can be played by 12 or more people. [2] X Research source"
    },
    {
      "title": "Shuffle the red and green apple card packs.",
      "content": "Shuffle the red and green apple card packs. Inside the box, you’ll find two decks of cards: one red and one green. Both decks must be shuffled thoroughly to ensure that cards are drawn randomly throughout the game since cards from each deck will be used during every round of play. Keep the decks separate—red and green cards shouldn’t be mixed within a deck. [3] X Research source Inside the box, you’ll find: 749 red apple cards with people, places, events, and things printed on them. 249 green apple cards with characteristics of people, places, events, and things printed on them. Blank red and green apple cards where you can write your own prompts. A pair of card trays and the rulebook. After shuffling , place the green cards inside the two shallow wells on the card trays. Similarly, place the red cards in the four deeper wells on the card trays."
    },
    {
      "title": "Pick a judge for the first round.",
      "content": "Pick a judge for the first round. The judge is responsible for deciding who has the best match and, therefore, which player wins each round. Every player will get a chance to be the judge, as the position is handed off to the player on the left after each consecutive round. For the first round of the game, however, it’s up to you (and the other players) to select the judge. [4] X Research source Judges may pick the winning red card for any reason. One might choose the strongest direct match (like a red card with “Scissors” and a green card with “Sharp”), while another might prefer ironic or humorous combinations. The different styles of judging card pairings are what make the game exciting!"
    },
    {
      "title": "Deal 7 red cards to each player.",
      "content": "Deal 7 red cards to each player. The judge also acts as the card dealer. Have the judge for the first round deal 7 red cards to each player around the table. You’ll all replenish your red cards after every round, meaning each player should always have 7 red cards at the start of a new round. The game is ready to begin when each player has 7 cards in their hand. [5] X Research source Keep an eye on your red cards to make sure you have 7 at all times. Otherwise, you might be limiting your playable options."
    },
    {
      "title": "Have the judge turn over the top green card.",
      "content": "Have the judge turn over the top green card. Once the judge flips the card at the top of the green deck, they must call it out to the group. Green cards have descriptive phrases; the goal is for players to match those phrases to the people, objects, places, or events on their red cards. The green card in play might read “cute,” “harmful,” or “patriotic,” which are terms designed to describe the red cards in play. [6] X Research source With the sheer number of red and green cards included in the base game, there are enough matches for hours and hours of fun!"
    },
    {
      "title": "Lay down a red card to match the green card (as a player).",
      "content": "Lay down a red card to match the green card (as a player). Players must pick one of their 7 red cards to associate with the word on the green card. For example, a player might play a red card reading “babies” to match a green card reading “cute.” There are endless possible combinations of red and green cards, so get creative! [7] X Research source Tip : Don’t worry about choosing the most accurate card every time. Some judges prefer creative or humorous responses, so just do your best. Try to choose a red card quickly to keep the game moving, and play each red card face-down beside the green card. The judge is the only player who won’t lay down a red card. Remember, the judge changes every round, giving everyone an equal chance to play."
    },
    {
      "title": "Mix up the player’s cards (as the judge).",
      "content": "Mix up the player’s cards (as the judge). After every player has laid down a red card, the judge must shuffle the stack of played cards. This ensures the judge won’t know who played each card. Leave all the cards face-down as they’re rearranged. [8] X Research source Tip : Try playing a red card that you think will appeal to the specific judge that round. You can often win more green cards this way! There’s no need to shuffle extensively; just reorganize the red cards until they’re out of the order in which they were laid down."
    },
    {
      "title": "Decide who has the best match (as the judge).",
      "content": "Decide who has the best match (as the judge). The judge must turn each card over, read them, and decide which is the best match for the green card currently in play. The chosen card wins the round! Have the winning player identify themselves and collect the green card that round; from there, the player to the left of the judge becomes the new judge, and all players get a card from the red deck to replenish their hand. [9] X Research source Tip : Feel free to root for a particular card and try to convince the judge to pick a certain one (whether it’s your card or your favorite card that was played). Once a round is resolved by picking a winner and replenishing the cards in each player’s hand, gameplay continues with a new round. Have the judge for the round collect all played red cards and discard them in the bottom of the game’s box. Then, pass the card tray to the new judge."
    },
    {
      "title": "Keep score and decide how many green cards are needed to win.",
      "content": "Keep score and decide how many green cards are needed to win. The number of green cards gathered by the end of the game ultimately determines the winner! Simply have all players keep the green cards they win on the table, so it’s easy to see how many cards each player has. The number of green cards needed to win is up to you, though Apples to Apples rules recommend the following: [10] X Research source 4 players: 8 green cards to win 5 players: 7 green cards to win 6 players: 6 green cards to win 7 players: 5 green cards to win 8-10 players: 4 green cards to win However, feel free to modify these numbers. For instance, you might play for 10 green cards to keep the game going longer, or do a “sudden death” game and see who can win 3 cards the fastest. You might also have players replace their red cards with green ones for a winning outcome. To do this, a player will add the green cards they’ve won to their deck after each round, meaning they’ll have fewer red cards to use. Once a player reaches 7 green cards in their deck, they’re the winner."
    },
    {
      "title": "Discard all cards and reshuffle both decks to play the game again.",
      "content": "Discard all cards and reshuffle both decks to play the game again. If the game ends and you and your friends decide to play a second one, the setup is simple. First, discard all the red and green cards you’ve used in the last game, shuffle them, and put them at the bottom of the red and green card stacks. Then, choose a new judge and have them give each player a new hand of 7 cards, and begin! [11] X Research source Reshuffling cards after a game is important because it ensures the same cards aren’t dealt and played in the next game."
    },
    {
      "title": "Crab Apples",
      "content": "Crab Apples Rather than finding the strongest match for each card, switch gears and play the “Crab Apple” version of the game, which requires players to play red cards that are the opposite of the green card in play. If the green card reads “Scary,” you might try to win with cards like “Kitten” or “Love.” Choose carefully: coming up with the right combination can be trickier than you expect! [12] X Research source [13] X Research source Playing \"Crab Apple\" effectively doubles the number of possible card associations. Variant versions of Apples to Apples force you to think more carefully about your card choices, breaking up the monotony of the standard games."
    },
    {
      "title": "Apple Potpourri",
      "content": "Apple Potpourri For a more challenging and hilarious experience, “Apple Potpourri” is when players choose a red card to play before the green card is revealed. The judge chooses the best match as usual, but the player gives up control over their card associations, and the results are random. \"Apple Potpourri\" can be fun in large groups, with more options for the judge to choose from. [14] X Research source [15] X Research source \"Apple Potpourri\" is a perfect alternative for groups where the judges tend to choose the most entertaining card combinations."
    },
    {
      "title": "2-for-1 Apples",
      "content": "2-for-1 Apples Make each round count double to give the game higher stakes. The judge turns over two green cards instead of just one, and players have to choose a red card that is best described by both terms on the green cards. This variation forces players to think more carefully about each play, as red cards have to be associated with two different terms, and rounds are worth two green cards. [16] X Research source [17] X Research source In this version, you can decide whether the same number of cards is needed to win (resulting in a quicker-paced game) or whether to double the number of green cards needed and increase the difficulty of each round."
    },
    {
      "title": "Big Apples",
      "content": "Big Apples Do you and your friends like making wagers on the outcome of a game? Try “Big Apples,” where 2 or more players must wager a green card on the claim that the judge will choose their card that round. When a player wins the wager, with the judge picking their red card, they win the green card for the round and green cards from every player who wagered. [18] X Research source On the other hand, if several players wager and the judge doesn’t pick any of their cards, all wagered cards must be forfeited and discarded at the bottom of the deck."
    },
    {
      "title": "Quick Pick for Four",
      "content": "Quick Pick for Four This variation requires 4 players. During each turn, players can choose to select 1 or 2 red cards to play, but 2 red cards have to be placed on the table one at a time. Then, only the first 4 cards that get played can be judged—so this variation challenges you to think fast (and move fast, too). [19] X Research source"
    },
    {
      "title": "Apple Turnovers",
      "content": "Apple Turnovers Deal 5 green cards to each player instead of red ones. Then, have the judge pick a red card from the top of the deck; players then try to choose a green card from their hand that best matches the word on the red card. The rest works much like the traditional game: the judge chooses whichever green card they think is best, and the winner that round is awarded the red card. [20] X Research source"
    }
  ]
}