{
  "url": "https://www.wikihow.com/Fix-Cat-Scratches-in-Leather",
  "title": "How to Easily Repair Cat Scratches On Leather",
  "steps": [
    {
      "title": "Clean the scratched area with a leather wipe.",
      "content": "Clean the scratched area with a leather wipe. Use a leather cleaning wipe or apply leather cleaner to a dry rag. Use small, circular motions to clean the leather surface of any dust or dirt."
    },
    {
      "title": "Trim any loose fibers with scissors or a lighter.",
      "content": "Trim any loose fibers with scissors or a lighter. Use a pair of scissors to snip off any loose strands around the scratches. Get as close to the base of the pilling fabric as possible, but be careful not to further cut or puncture the leather. [1] X Research source You can also use a lighter on the scratched area, as the heat of the flame will loosen the scratched leather. [2] X Research source If using a lighter, be careful not to get the flame too close to the sensitive leather."
    },
    {
      "title": "Apply leather binding glue in 7 light layers.",
      "content": "Apply leather binding glue in 7 light layers. Pour a coin-sized amount of leather binding glue to the sponge. Dip a sponge into the leather glue and spread a thin layer onto the leather. Let each layer of glue dry completely before you apply another one. For the best results, apply at least 7 layers of glue to the scratched leather. Leather glue helps seal parts of the leather that were punctured by the cat scratches. [3] X Research source"
    },
    {
      "title": "Gently sand the scratched area with a fine sandpaper.",
      "content": "Gently sand the scratched area with a fine sandpaper. Use a soft, 1200-grit sandpaper . Use smooth and circular strokes to sand down the area where you applied the glue. [4] X Research source Apply very gentle pressure as you sand the leather so as not to rough up the material. You want the surface to be as smooth as possible so that the leather filler won’t look lumpy when you apply it. Use your leather cleaning wipe or a clean rag to wipe away any leftover dust from the sandpaper."
    },
    {
      "title": "Apply heavy leather filler with a palette knife and let it dry.",
      "content": "Apply heavy leather filler with a palette knife and let it dry. Dip a palette knife into the leather filler and spread a thin layer onto the cat scratches. Allow the filler to dry for at least 25 minutes. [5] X Research source You may have to wait several hours for the filler to dry before proceeding to the next step, especially if you’re working in an environment with a lot of humidity. Inspect the scratched area and apply an additional layer if any punctures, holes, or deep scratches remain uncovered. Spread the filler as smoothly as possible so that the leather doesn’t look messy or rough. For a more precise application, dip a sewing needle in the filler cream and apply it gently to the surface. Use the side of the needle to smooth out the cream. [6] X Expert Source Mallika Sharma Certified Leather Care Technician Expert Interview. 14 December 2020."
    },
    {
      "title": "Sand the damaged area again.",
      "content": "Sand the damaged area again. Use another piece of gentle (1200-grit) sandpaper to smooth and buff out any inconsistencies on the filler’s surface. This helps to keep the surface of your leather as smooth as possible, so the finished repair looks natural and authentic. [7] X Research source Apply the leather cleaning solution again to remove any sandpaper residue. This step is crucial so that the colorant can adhere to the leather."
    },
    {
      "title": "Apply liquid leather colorant.",
      "content": "Apply liquid leather colorant. Pour a coin-sized amount of the liquid leather colorant onto a sponge. Use small, gentle motions to sponge a thin layer of colorant over the dried filler. [8] X Expert Source Mallika Sharma Certified Leather Care Technician Expert Interview. 14 December 2020. Let the colorant dry completely before moving on to the next step. Use a hair dryer at a low heat setting to speed up the drying process. This recoloring process can sometimes reveal more scratches that need repair. If you find more cat scratches that you want to fix, apply another coat of filler, sand it down, then reapply the colorant."
    },
    {
      "title": "Apply leather color spray to the treated area.",
      "content": "Apply leather color spray to the treated area. Spray the spray-on colorant over the scratched area in single layers. Apply at least 4-5 thin layers of spray-on colorant to get a full, vibrant color on your treated leather area. Let each layer dry completely before you add the next one. Check the directions on your colorant bottle to find a specific estimate on how long it will take to dry. Leather color spray enhances the initial layer of liquid colorant that you added. If your leather is multiple colors, layer different shades of colorant to reach your desired shade. [9] X Research source"
    },
    {
      "title": "Apply leather sealant with a clean sponge or airbrush.",
      "content": "Apply leather sealant with a clean sponge or airbrush. Paint at least 2-3 layers of leather sealant onto the scratched surface. Let each layer dry completely before adding the next layer. The sealant will protect and increase the vibrancy of the leather colorant."
    },
    {
      "title": "Apply a leather finishing product.",
      "content": "Apply a leather finishing product. Place a coin-sized amount of leather finisher onto a clean sponge before rubbing it on top of the leather. Use short, circular motions to achieve a smooth and even finish. Apply 4-5 thin coats of finish to build up an adequate protective layer. Ensure that each layer of finish has dried before you add another one."
    },
    {
      "title": "Use a leather recoloring balm for shallow scratches.",
      "content": "Use a leather recoloring balm for shallow scratches. Apply leather recoloring balm on top of the scratches and blend it in with the rest of the leather. Let the balm dry for a few minutes before wiping away the excess with a dry rag. Let it sit for one hour to dry—if it’s still patchy or streaky, apply another coat (or two). [10] X Research source The recoloring balm will hide the light discoloration caused by the scratches. Choose a leather recoloring balm that most closely matches the color of your leather sofa or other damaged item. This method only works if the scratches are solely on the surface of the leather and haven’t cut through it. If your cat’s swipe has cut through the leather, you’ll need to hire a leather care professional to completely repair the cat scratches in your leather."
    },
    {
      "title": "Place your cat scratcher near your leather furniture.",
      "content": "Place your cat scratcher near your leather furniture. A scratching post will redirect your cat’s attention from your leather sofa. Your cat will be more inclined to use the scratcher if you place it near where you (or your family) hangs out. [11] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source If they seem disinterested, get your cat to use the scratching post by running your nails over it while they’re watching you."
    },
    {
      "title": "Trim your cat’s nails frequently.",
      "content": "Trim your cat’s nails frequently. Use nail clippers specifically made for cats to trim your cat’s nails . Lean your cat’s back against your stomach with its rear end on your lap. Hold the clippers in one hand and your cat’s paw in the other. [12] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source Gently squeeze your cat’s paw on the joint behind the claw. Cut the tip of the nail and be careful not to cut the quick, which is a small, pink triangle inside the nail. Cutting your cat’s nails every 2-3 weeks can prevent new cat scratches on your leather furniture."
    },
    {
      "title": "Spray your leather couch with a cat repellent.",
      "content": "Spray your leather couch with a cat repellent. Purchase spray-on cat pheromones and follow package directions to apply them to your leather furniture. [13] X Research source Read the warning label on the repellent to make sure it doesn’t damage leather materials. For a DIY spray to keep cats from scratching a leather couch, mix a solution of water with vinegar, essential citrus oils , garlic, or peppermint. [14] X Research source Mist your homemade cat repellent spray over your furniture every few days. Cats dislike these scents, but they won’t damage your leather furniture. Eventually, you’ll have trained your cat not to scratch the furniture and you’ll no longer need the spray."
    },
    {
      "title": "Lay a blanket on your leather couch.",
      "content": "Lay a blanket on your leather couch. Cover your furniture with a thick blanket that you don’t care too much about. This blanket can create a barrier between the leather and your cat’s claws."
    },
    {
      "title": "Treat your leather with a general maintenance kit.",
      "content": "Treat your leather with a general maintenance kit. Many other things can damage your leather sofa besides cat scratches, such as pet dander, flea and tick medications, or cat spray. By habitually caring for your leather with a leather maintenance kit and keeping it in good shape, your furniture will last longer and be more resistant to damage."
    }
  ]
}