{
  "url": "https://www.wikihow.com/Reduce-Heat-Inside-Your-HP-Laptop-to-Prevent-Overheating",
  "title": "How to Reduce Heat Inside Your HP Laptop to Prevent Overheating",
  "steps": [
    {
      "title": "Turn off the laptop.",
      "content": "Turn off the laptop. Disconnect the power cord."
    },
    {
      "title": "Clear away any obstructions around the laptop.",
      "content": "Clear away any obstructions around the laptop."
    },
    {
      "title": "Locate the vents.",
      "content": "Locate the vents. These are typically found underneath and on the sides of the laptop."
    },
    {
      "title": "Use canned air to remove dust and debris from vents.",
      "content": "Use canned air to remove dust and debris from vents."
    },
    {
      "title": "Allow the laptop to cool down.",
      "content": "Allow the laptop to cool down. Let it cool down for five to ten minutes before reconnecting the power cord and powering it back on."
    },
    {
      "title": "Listen for proper fan operation.",
      "content": "Listen for proper fan operation. If the fans seem to be working correctly, place the laptop on a hard, level surface, such as a desk or table, and then try to increase the efficiency of your computer to reduce heat. If a fan is making a loud growling noise or not moving, there is an issue with the fan."
    },
    {
      "title": "Change which applications run when Windows starts.",
      "content": "Change which applications run when Windows starts. The computer works harder and generates more heat when multiple applications are open simultaneously, or while playing graphically intense video games. Use the Startup tab in Task Manager to change which applications run at start."
    },
    {
      "title": "Close applications when you are done using them.",
      "content": "Close applications when you are done using them."
    },
    {
      "title": "Close the internet browser when you are not using it.",
      "content": "Close the internet browser when you are not using it."
    },
    {
      "title": "Lower the game resolution and decrease the graphics settings if the computer becomes warmer than usual while playing.",
      "content": "Lower the game resolution and decrease the graphics settings if the computer becomes warmer than usual while playing."
    },
    {
      "title": "Make sure that the fans in your computer can ventilate properly.",
      "content": "Make sure that the fans in your computer can ventilate properly. Keep the computer upright and on a sturdy, level surface."
    },
    {
      "title": "Provide at least 15.25 cm (6 in) of clearance around each vent.",
      "content": "Provide at least 15.25 cm (6 in) of clearance around each vent."
    },
    {
      "title": "If the computer is being used at high altitudes, above 1500 m (5000 ft), take extra care to keep the computer cool.",
      "content": "If the computer is being used at high altitudes, above 1500 m (5000 ft), take extra care to keep the computer cool. When moving the computer to a higher altitude, the temperature inside the computer decreases by approximately 1ยบ C ( 34ยบ F) every 300 m (1000 ft) of altitude."
    },
    {
      "title": "Use HP CoolSense Technology to regulate internal temperature.",
      "content": "Use HP CoolSense Technology to regulate internal temperature. When you enable HP CoolSense in Windows, a motion sensor inside the laptop automatically adjusts the computer performance and fan speed to keep the computer cool. In Windows, search for HP CoolSense. If HP CoolSense displays in the list, select it. Click the HP CoolSense icon in the taskbar, and then select On. If HP CoolSense does not display in the list, the feature is not available on your computer."
    },
    {
      "title": "Use HP Command Center to reduce heat by changing the thermal profile.",
      "content": "Use HP Command Center to reduce heat by changing the thermal profile. On select HP notebook computers, you can use HP Command Center to manage the temperature inside your computer, along with other thermal control options. In Windows, search for HP Command Center. If HP Command Center displays in the list, select Thermal Profile, and then select the Cool mode option to turn on the feature. If HP Command Center does not display on the list, the feature is not available on your computer. If your computer does not support either feature, or if the issue persists, you might need to change the system performance settings (select products only) or update the BIOS."
    },
    {
      "title": "Adjust the PC system performance.",
      "content": "Adjust the PC system performance. If your laptop is an HP Spectre 13 or HP x360, you can adjust the PC system performance to decrease power consumption, which can reduce strain on the fans and help decrease the internal temperature."
    },
    {
      "title": "In Windows, search for and open Control Panel.",
      "content": "In Windows, search for and open Control Panel."
    },
    {
      "title": "In the Control Panel search field, type \"cool control\".",
      "content": "In the Control Panel search field, type \"cool control\". If HP Cool Control displays in the list, select HP Cool Control, and then select On from the pop-up menu. If the issue persists, continue to the next step. If HP Cool Control does not display in the list, the application is not available on your laptop. Turn off the computer, and then continue with the remainder of these steps."
    },
    {
      "title": "Turn the computer on.",
      "content": "Turn the computer on. Repeatedly press F10 to open the BIOS."
    },
    {
      "title": "Navigate to System Configuration.",
      "content": "Navigate to System Configuration. On the BIOS menu, navigate to the System Configuration tab, and then select System Power Scheme."
    },
    {
      "title": "Select Balance Press F10 to save your settings and exit the BIOS.",
      "content": "Select Balance Press F10 to save your settings and exit the BIOS. If the issue persists, you might try updating the BIOS, testing for hardware failures, or contacting HP Customer Support."
    },
    {
      "title": "Use HP Support Assistant to find and install updates, including BIOS updates.",
      "content": "Use HP Support Assistant to find and install updates, including BIOS updates. In Windows, search for and open HP Support Assistant. If the app is not installed on your computer, download the latest version from the HP Support Assistant website."
    },
    {
      "title": "Wait for analysis.",
      "content": "Wait for analysis. Wait while HP Support Assistant analyzes the system."
    },
    {
      "title": "Download and install updates.",
      "content": "Download and install updates. After the analysis completes, select the listed updates, download and install the updates, and then follow any on-screen instructions."
    },
    {
      "title": "Restart.",
      "content": "Restart. If prompted, restart the computer, then close the tool."
    }
  ]
}