{
  "url": "https://www.wikihow.com/Power-a-Car-Amplifier-Using-a-Computer-Power-Supply",
  "title": "How to Power a Car Amplifier Using a Computer Power Supply",
  "steps": [
    {
      "title": "Get an ATX power supply that outputs at least 12 DC volts and 30 amps.",
      "content": "Get an ATX power supply that outputs at least 12 DC volts and 30 amps. An advanced technology extended (ATX) power supply is the most common kind, and it looks like a small box with multiple wires sticking out from it and a fan on the inside. Check the specifications of the power supply on the package and make sure it can output enough voltage and current in order to power your car amplifier, which usually needs a minimum of 12 DC volts and a 30-amp current. Purchase a power supply that’s in your budget. You can buy a computer power supply from an electronics store or online. Check the specifications on your car amplifier to see if it requires a different voltage or amperage input. Power supplies usually cost around $60 USD, but they tend to be more expensive if they output higher amperage and voltage."
    },
    {
      "title": "Check the colors for the PS-ON and COM wires on the power supply’s guide.",
      "content": "Check the colors for the PS-ON and COM wires on the power supply’s guide. Look for a numbered table that lists the main wire outputs printed on the side of the power supply or in its manual. Find the sections that are labeled “PS-ON” and “COM” since they are the wires you need to connect. Typically, the PS-ON wire will be green and the COM wires will be black, but it may vary based on your power supply. [1] X Research source The PS-ON wire controls the power supply and allows it to stay on when it’s plugged in. The COM wires may also be labeled “GND” or “Ground.” If the power supply doesn’t list the colors in a table, you may see a pinout diagram of colored boxes with labels next to them. The color inside each box is the color of the corresponding wire on the connector."
    },
    {
      "title": "Find the matching wires on the power supply’s motherboard connector.",
      "content": "Find the matching wires on the power supply’s motherboard connector. Look for a long, box-shaped plastic connector that has 20 or 24 wires attached to the back it coming out from the power supply. Locate the PS-ON wire first, which is usually found near the middle of the connector. Typically, there will be a COM wire directly above or below the PS-ON wire so they’re easy to connect. There will be multiple COM wires attached to the connector. You can use whichever one you want for powering the car amp."
    },
    {
      "title": "Cut and strip 2 pieces of 18-gauge wire so they’re 2 inches (5.1 cm) long.",
      "content": "Cut and strip 2 pieces of 18-gauge wire so they’re 2 inches (5.1 cm) long. Get a wire that has different colored insulation that the other wires so you don’t confuse them. Use a pair of wire cutters to cut off 2 sections of wire that are 2 inches (5.1 cm) each. Clamp the ends of the wires in a pair of wire strippers and pull it forward to remove the insulation. You can buy 18-gauge wire from your local hardware or electronics store."
    },
    {
      "title": "Connect the PS-ON and a COM pin with one of the wire pieces.",
      "content": "Connect the PS-ON and a COM pin with one of the wire pieces. The pins are the ports on the back side of the connector that line up with the wires on the other sides. Hold the connector so the wires point down and the ports face up. Push the exposed end of one of the wires you just cut into the port that lines up with the PS-ON pin on the other side. Place the other end of the wire into the pin for the COM wire to make your bridge. You can also cut the wires and wrap the exposed ends around one another to splice them . Put a wire cap over the splice so they ends aren’t exposed. You won’t be able to use the power supply for a computer in the future. Wrap electrical tape around the wire and end of the connector if you’re worried about it falling out."
    },
    {
      "title": "Turn on the computer power supply to make sure the fan runs.",
      "content": "Turn on the computer power supply to make sure the fan runs. Plug the power supply into the wall and turn the switch to the On position if there is one. Watch the fan on the power supply to see if it starts spinning. If it does, then your power supply works properly. If it doesn’t work, check which pins you connected with the wire to ensure you placed it correctly. [2] X Research source If the fan still doesn’t work after checking the wires, then the power supply may be faulty."
    },
    {
      "title": "Cut a 12 V+ and COM wire off a 4-pin peripheral cable from the power supply.",
      "content": "Cut a 12 V+ and COM wire off a 4-pin peripheral cable from the power supply. Be sure to unplug the power supply before you cut any wires, or else you could get shocked. Take one of the boxy plastic connectors that has 4 wires attached to one side and 4 pins you can plug into on the other side. Refer to the power supply’s chart to find out the color of the 12 V+ wire. Use a pair of wire cutters to snip the wire right next to the connector. Repeat the process with one of the COM wires as well. [3] X Research source Usually, the 12 V+ wire is yellow or red, but it may vary depending on your power supply. You can choose any 4-pin peripheral connector to use for your amplifier. Tug on the cords lightly to make sure they connect directly back to the power supply since some wires attach to other peripherals."
    },
    {
      "title": "Strip 1⁄2 in (1.3 cm) of insulation off of the wires.",
      "content": "Strip 1 ⁄ 2 in (1.3 cm) of insulation off of the wires. Clamp the end of the first wire in a pair of wire strippers, and squeeze the handles tightly together. Pull the wire strippers toward the end of the wire to remove the insulation. Repeat the process with the second wire so the ends are exposed. [4] X Research source If you don’t have wire strippers, you can also slice the insulation off with a utility knife."
    },
    {
      "title": "Place the end of the 12 V+ wire in the matching port on the amplifier.",
      "content": "Place the end of the 12 V+ wire in the matching port on the amplifier. Look on the back or side of the car amplifier and locate the metal port with a screw that’s labeled “12 V.” Slide the exposed end of the wire underneath the screw and hold it in place. Tighten the screw with a screwdriver so the wire doesn’t fall out when you lightly tug on it. [5] X Research source"
    },
    {
      "title": "Secure the COM wire to the amplifier’s ground port.",
      "content": "Secure the COM wire to the amplifier’s ground port. Look for the port with a screw on the back of the amplifier labeled “GROUND” or “COM,” which is usually right next to the 12 V port. Push the exposed wire underneath the screw, and use a screwdriver to tighten it down. Make sure the wire doesn’t slip or pull out if you likely tug on it. [6] X Research source Cut the COM wires from 2 other 4-pin peripherals and secure them in the ground port if you plan on using the amplifier for more than 30 minutes at a time."
    },
    {
      "title": "Connect the 12 V+ and remote ports on the amp with the 2 in (5.1 cm) wire.",
      "content": "Connect the 12 V+ and remote ports on the amp with the 2 in (5.1 cm) wire. The remote port on the amplifier allows it to turn on when you start your vehicle, but the remote port needs a 12 V wire attached to it if you use a computer power supply. Use the second 2 in (5.1 cm) piece of 18-gauge wire you cut earlier to connect to the remote port. Slide one end of the wire under the screw on the 12 V port and retighten it with your screwdriver. Feed the other end of the wire underneath the screw labeled “REMOTE” and secure it in place. [7] X Research source The amplifier will not start if you don’t connect power to the remote port. You can also use another COM wire if you want, but you will need to cut it off of another peripheral connector."
    },
    {
      "title": "Attach speakers to the amplifier with speaker wire.",
      "content": "Attach speakers to the amplifier with speaker wire. You can use any type of speaker with your car amplifier. Plug 1 end of the speaker wire into one of the speaker ports along the back of the amplifier, which are usually labeled “Speaker Output.” Tighten the screw holding the wire in place so it doesn’t pull out. Run the other end of the wire to your speaker’s input port, which will either be a clip or screw on the back. Slide the end of the wire under the screw or into the clip, and tighten it so it’s secure. [8] X Research source You can attach multiple speakers to the amplifier, but the power supply may not provide enough electricity for them to work to their full potential."
    },
    {
      "title": "Plug in the power supply to run the amplifier.",
      "content": "Plug in the power supply to run the amplifier. Reconnect the power supply to your wall outlet and turn on the power switch. Check the amplifier to see if the power light turns on so you know it’s working properly. Try playing music through the speakers with your phone or another audio device to see how well it works. When you’re finished, turn off the power supply. [9] X Research source If the amplifier doesn’t turn on, check your wire connections to make sure they’re plugged in properly. If it still doesn’t work, then the amp or power supply may be faulty."
    }
  ]
}