{
  "url": "https://www.wikihow.com/Delete-an-Item-on-OfferUp-on-Android",
  "title": "How to Delete an Item on OfferUp on Android",
  "steps": [
    {
      "title": "Open OfferUp on your Android.",
      "content": "Open OfferUp on your Android. It’s the blue and white icon with a pricetag that says ″OfferUp.″ You’ll usually find it on the home screen or in the app drawer. This method removes a listing from the public view without deleting its contents. Though the listing will no longer be visible to others, the item and all associated messages will be stored for you in the Archive folder."
    },
    {
      "title": "Tap the Offers button.",
      "content": "Tap the Offers button. It’s the pricetag icon at the bottom of the screen."
    },
    {
      "title": "Tap the Selling tab.",
      "content": "Tap the Selling tab. It’s near the top-left corner of the screen."
    },
    {
      "title": "Tap the photo of the item.",
      "content": "Tap the photo of the item. A menu will appear."
    },
    {
      "title": "Tap Archive.",
      "content": "Tap Archive . A confirmation message will appear."
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . The item and all associated messages and offers will be moved to the Archive folder, and the listing will be removed. To view your archived items, tap Archive at the top-left corner of the Offers tab."
    },
    {
      "title": "Open OfferUp on your Android.",
      "content": "Open OfferUp on your Android. It’s the blue and white icon with a pricetag that says ″OfferUp.″ You’ll usually find it on the home screen or in the app drawer. Use this method to remove an item you added to your personal OfferUp Board."
    },
    {
      "title": "Tap the Offers button.",
      "content": "Tap the Offers button. It’s the pricetag icon at the bottom of the screen."
    },
    {
      "title": "Tap the Boards tab.",
      "content": "Tap the Boards tab. A list of your boards will appear."
    },
    {
      "title": "Tap the board to which you saved the item.",
      "content": "Tap the board to which you saved the item."
    },
    {
      "title": "Tap the item you want to remove.",
      "content": "Tap the item you want to remove."
    },
    {
      "title": "Tap the red heart icon.",
      "content": "Tap the red heart icon. It’s at the top-right corner of the item. A pop-up menu will appear."
    },
    {
      "title": "Tap the board from which you want to remove the item.",
      "content": "Tap the board from which you want to remove the item. The item is now deleted from the board. The heart on the item will no longer be filled in red. If you shared the board with others, they will no longer see this item."
    }
  ]
}