{
  "url": "https://www.wikihow.com/Crochet-Crop-Tops",
  "title": "How to Crochet Crop Tops",
  "steps": [
    {
      "title": "Choose a skein of worsted weight yarn in any color.",
      "content": "Choose a skein of worsted weight yarn in any color. Get out a skein of yarn that's 4.5 ounces (127.5 g) or 227 yards (208 m) long. You can use any type of yarn you like, but pick yarn that's soft so your crop top is comfortable to wear. Keep in mind that you won't use all of the skein. [1] X Research source Avoid using 100% cotton yarn since it will shrink if you toss it in the dryer. If you'd like a soft, cotton crop top, choose a cotton-synthetic blend so it holds its shape."
    },
    {
      "title": "Make a slip knot and slide it onto a US size H-8 (5 mm) crochet hook.",
      "content": "Make a slip knot and slide it onto a US size H-8 (5 mm) crochet hook. Pull about 6 inches (15 cm) of yarn from the skein and wrap it around 2 of your fingers. Pinch this loop so the working yarn hangs behind it. Push your crochet hook into the loop and grab the working yarn with the hook. Then, pull so the slip knot slides onto the hook. [2] X Research source Feel free to use a slightly smaller or larger hook if you usually crochet tightly or loosely. Keep in mind that loose stitches make the crop top see-through, so you'd want to wear something underneath the top."
    },
    {
      "title": "Stretch the measuring tape across your torso from 1 side to the other.",
      "content": "Stretch the measuring tape across your torso from 1 side to the other. Hold the end of a measuring tape on the side of your ribcage where you'd like the crop top to fall and stretch it to the opposite side of your ribcage. Write this number down so you know how long to make your foundation chain for the bottom of the crop top. [3] X Research source If you don't want to keep holding the piece up to you as you crochet, you can also measure from the ribcage to your neckline. Then, refer to this measurement as you crochet the body. Don't twist the measuring tape or your foundation row will be too long. If you're having trouble measuring, ask a friend to help you!"
    },
    {
      "title": "Make a foundation chain that's as long as your measurement.",
      "content": "Make a foundation chain that's as long as your measurement. To make a chain, wrap your yarn around the hook and pull the hook through the loop. Since there's no need to count chains, but you do need to stop and measure the chain as you work. Keep making chains until the foundation chain is as long as the measurement you just took. Hold the foundation chain across your torso from 1 side of your ribcage to the other. This helps you check if the bottom of the halter covers your torso the way you want. For example, you may need to chain 19 inches (48 cm) for your crop top foundation. This would make a medium-sized crop top."
    },
    {
      "title": "Single crochet into every chain of your foundation row.",
      "content": "Single crochet into every chain of your foundation row. To make a single crochet (SC) stitch, put your hook into the chain that's closest to your hook. Grab the working yarn with your hook and pull it onto the hook. Then, wrap the yarn around the hook and pull it through both of the loops. Continue to make a single crochet stitch into each of the chains on the row. [4] X Research source This forms the bottom of your crop top."
    },
    {
      "title": "Make 1 chain and turn your work.",
      "content": "Make 1 chain and turn your work. When you reach the end of the first row, wrap the yarn around your hook and pull up the loop to make a chain. Then, flip the piece of crocheted fabric over so you can start crocheting the next row. [5] X Research source You'll work back and forth across the row to make the band before decreasing rows for the crop top body."
    },
    {
      "title": "Work single crochet stitches across the row until the band is the size you want.",
      "content": "Work single crochet stitches across the row until the band is the size you want. Keep making 1 SC into each stitch and crocheting 1 chain when you reach the end of a row. Then, stop once this band covers as much of your torso as you like. To tell when to stop, hold the band piece directly below your breasts. You can make this portion of the crop top as long or short as you like. [6] X Research source To make a short crop top, crochet around 3 rows. For a longer crop top band, work up to about 10 rows."
    },
    {
      "title": "Make the first decreasing row to begin the halter portion.",
      "content": "Make the first decreasing row to begin the halter portion. Don't chain a stitch when you reach the end of the row. Instead, turn the work and skip the first stitch. Then, single crochet in every stitch across the row. The decreasing stitches make diagonal sides that form the halter-style top. [7] X Research source If you'd like to make a V-neck crop top, you'll need to crochet 2 triangular pieces that cover your breasts. Then, you can attach them to the band that you just finished."
    },
    {
      "title": "Turn the work and crochet decreasing rows until you've finished the neckline.",
      "content": "Turn the work and crochet decreasing rows until you've finished the neckline. Continue to skip the first stitch of every row and make a single crochet into the rest of the stitches for the row. This creates the halter portion that covers your breasts and becomes the neckline. Keep doing this until the neckline is as high as you want. To help you get an idea of the size, hold the piece up against your torso frequently."
    },
    {
      "title": "Make a strap that's 120 to 150 chains long.",
      "content": "Make a strap that's 120 to 150 chains long. Don't cut the yarn when you finish crocheting the body. When you reach the end of your last row, which is the neckline, start making a long chain that you'll use to wrap and wear the crop top. [8] X Research source If you're making a small crop top, crochet around 120 chains. For a larger size, work closer to 150 chains."
    },
    {
      "title": "Slip stitch back through each of the chains to create a thicker strap.",
      "content": "Slip stitch back through each of the chains to create a thicker strap. To make the strap sturdier and more comfortable, insert your hook back through the last chain you made. Wrap your yarn around the hook and pull it through the loops to make a slip stitch. Keep slip stitching through each of the chains until you reach the neckline where you started the strap. [9] X Research source"
    },
    {
      "title": "Single crochet across the neckline to reach the end of the row.",
      "content": "Single crochet across the neckline to reach the end of the row. Instead of cutting the yarn to begin another strap, just make 1 single crochet stitch into every stitch across the neckline. [10] X Research source Now, your hook and yarn are positioned to make the opposite strap."
    },
    {
      "title": "Crochet an identical strap.",
      "content": "Crochet an identical strap. Chain up another strap that's the same length as the opposite one you made. Then, slip stitch back through it as you did with the other one. Remember to make the same number of chains so the straps are even. [11] X Research source"
    },
    {
      "title": "Pull each strap through the bottom at the opposite corner.",
      "content": "Pull each strap through the bottom at the opposite corner. Lay the crop top so it's face down and take 1 of the straps. Pull it diagonally across the crop top. Repeat this for the other strap so they both form an X shape. Then, push your hook from the underside of the top through the bottom corner and grab a strap. Pull the strap through and repeat this for the other side. [12] X Research source Now, you can put on the crop top and tie the straps behind your back."
    }
  ]
}