{
  "url": "https://www.wikihow.com/Peel-a-Pomelo",
  "title": "How to Cut and Peel a Pomelo",
  "steps": [
    {
      "title": "Cut a \"cap\" off of one end of the pomelo.",
      "content": "Cut a \"cap\" off of one end of the pomelo. The knife should cut about 1/2 an inch into the rind. [2] X Research source"
    },
    {
      "title": "Cut vertical slices down the sides of the pomelo.",
      "content": "Cut vertical slices down the sides of the pomelo. Again, cut about 1/2 an inch into the rind. Pull the slices off the fruit. Dig your fingers underneath the slice at the top (where you cut the cap) and pull each one firmly away. It feels almost like working with styrofoam. [3] X Research source"
    },
    {
      "title": "Pull the bottom of the \"rind flower\" off of the fruit.",
      "content": "Pull the bottom of the \"rind flower\" off of the fruit. You'll be left with a much smaller fruit, covered in white membrane. [4] X Research source If you have a compost pile , throw the rind in there. Or, you can make a marmalade from it, or it can be candied."
    },
    {
      "title": "Find the end of the pomelo with the dimple.",
      "content": "Find the end of the pomelo with the dimple."
    },
    {
      "title": "Put your fingers in the hole and pull the fruit apart.",
      "content": "Put your fingers in the hole and pull the fruit apart. It should start breaking into slices. Some force (prying) is required. You can make this easier by cutting away some of the tough membrane surrounding the fruit, but this isn't necessary, and you risk cutting into the flesh (which is not good if you want neat slices). [5] X Research source"
    },
    {
      "title": "Pull away the membrane that surrounds each slice.",
      "content": "Pull away the membrane that surrounds each slice. It helps a lot to cut the membrane that runs along the center of the fruit, and the membrane at each end--that way, all you have left are \"flaps\" between each slice. [6] X Research source The membrane along the bottom of the slice (exterior of the fruit) will be hard to remove, and is better left on the flesh if you want the slices to stay intact. Otherwise, pull the flesh away from the membrane in chunks and direct those chunks into your mouth, or Make Thai Pomelo Salad With Grilled Prawns."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}