{
  "url": "https://www.wikihow.com/Find-Straight-Talk-Account-Number",
  "title": "3 Easy Ways to Obtain Your Straight Talk Account Number",
  "steps": [
    {
      "title": "Log into https://www.straighttalk.com/ in a web browser.",
      "content": "Log into https://www.straighttalk.com/ in a web browser. You can find your account number on the Straight Talk website, under your account."
    },
    {
      "title": "Click the user button in the top-right.",
      "content": "Click the user button in the top-right. It looks like an icon of a person."
    },
    {
      "title": "Select Account and Payment.",
      "content": "Select Account and Payment ."
    },
    {
      "title": "Select Manage Lines on the right side of the screen.",
      "content": "Select Manage Lines on the right side of the screen. A number of tabs should be present after selecting this option."
    },
    {
      "title": "Select the Device tab.",
      "content": "Select the Device tab. The devices on your Straight Talk account should be visible."
    },
    {
      "title": "Look for the \"SIM Serial Number\".",
      "content": "Look for the \"SIM Serial Number\". This is your account number. If the number is longer than 15 digits, the last 15 digits of this number are your account number."
    },
    {
      "title": "Text FOUR to 611611.",
      "content": "Text FOUR to 611611. This will prompt Straight Talk to send you the last four digits of your account number. It should match with the number you got from the website."
    },
    {
      "title": "Determine if you need to find your IMEI or ICCID.",
      "content": "Determine if you need to find your IMEI or ICCID. If you purchased a phone from Straight Talk , your phone's IMEI is the account number. If you brought your own phone, your account number is your SIM card's ICCID (sometimes incorrectly called a SIM IMEI). If the number is longer than 15 digits, the last 15 digits are your account number. If you need to find the IMEI , you can find this in your settings. On an iPhone, go to Settings > General > About and scroll down until you see the IMEI number. On an Android, go to Settings > About phone and your IMEI should be near the top. [1] X Research source [2] X Research source [3] X Research source If you need to find the ICCID, on an iPhone you can find this in your settings. Go to Settings > General > About and scroll down until you see the ICCID number. On Android you may find your ICCID by going to Settings > About phone > SIM status . If you can't find your ICCID on your phone, you can get it by removing your SIM card as the ICCID is printed on the card."
    },
    {
      "title": "Text FOUR to 611611.",
      "content": "Text FOUR to 611611. This will prompt Straight Talk to send you the last four digits of your account number. It should match with the number you got from your device. If you've changed devices/SIM cards since joining Straight Talk, your account number may have changed. If the four numbers you got from texting 611611 don't match your IMEI/ICCID, you may want to try checking for your account number on Straight Talk's website."
    },
    {
      "title": "Contact Straight Talk customer service.",
      "content": "Contact Straight Talk customer service. If nothing else works, you may want to contact customer service . You can live chat with Straight Talk customer service on their website or call them at 1-877-430-CELL(2355)."
    }
  ]
}