{
  "url": "https://www.wikihow.com/Grow-Facial-Hair",
  "title": "How to Grow Facial Hair Faster and Thicker: The Ultimate Guide",
  "steps": [
    {
      "title": "Take good care of your skin.",
      "content": "Take good care of your skin. Caring for your skin is one of the most effective ways to help grow fuller facial hair. Develop a good skincare routine to keep your face healthy, and exfoliate to remove dirt and dead skin cells that may be clogging your hair follicles. [1] X Expert Source Timmy Yanchun Professional Barber Expert Interview. 22 January 2020. Wash your face and use a toner and moisturizer in the morning and before you go to bed at night. Use hair-healthy grooming products with a vitamin B complex. Massage your face to improve circulation. By stimulating blood flow, you may help your follicles produce thicker hair. [2] X Research source"
    },
    {
      "title": "Moisturize your face daily.",
      "content": "Moisturize your face daily. When you start growing out a beard, your skin can get dry and become itchy and uncomfortable, so moisturize every day with a fragrance free moisturizer . If you use an astringent on your face, make sure it doesn’t have alcohol, and moisturize your skin after every time you shave. [3] X Expert Source Timmy Yanchun Professional Barber Expert Interview. 22 January 2020. Over-the-counter steroid creams like hydrocortisone can also help with itching. However, there can be side effects from extended use, such as blistering, skin weakness, and skin damage. Stop using the cream if you develop these symptoms. [4] X Research source"
    },
    {
      "title": "Wait 1-2 months before shaving.",
      "content": "Wait 1-2 months before shaving. It can take up to two months for a beard to start taking shape, and once it does, you may find it doesn’t look that patchy after all. [5] X Research source It can be tempting to start shaping your beard earlier, but you may take off more than you intended and have to start over. As your hair grows, comb it in the direction you want it to grow. This helps it to turn out looking the way you want. Expert barber Timmy Yanchun suggests that “once [your beard] has grown to a decent length…go to a barber and [have them shape it up for you] then you can…just do the upkeep.” [6] X Expert Source Timmy Yanchun Professional Barber Expert Interview. 22 January 2020. You can start your beard growing process by shaving, just to get a clean slate, but contrary to popular belief, shaving doesn’t make your hair grow back thicker. [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use beard oil when your hair gets longer.",
      "content": "Use beard oil when your hair gets longer. Yachun recommends using beard oil whenever “your beard feels dry…[s]o you're always moisturizing that hair and keeping it healthy…Massage the beard oil from the root of the hair to the tip” to protect the shaft and make your beard look fuller. [8] X Expert Source Timmy Yanchun Professional Barber Expert Interview. 22 January 2020. Beard oil doesn’t necessarily increase your hair’s growth, but its moisturizing properties can help give your beard a fuller look if you have less hair than you’d like. Brush your beard to distribute the oil. Beard brushing does not stimulate growth, but it can make your beard look longer and fuller by training the hair to grow in the direction you want. [9] X Research source Get the oil on your face, as well, to moisturize the skin under your beard. [10] X Expert Source Timmy Yanchun Professional Barber Expert Interview. 22 January 2020."
    },
    {
      "title": "Try microneedling with a derma roller.",
      "content": "Try microneedling with a derma roller. Derma rollers and microneedling are used to stimulate cell regeneration on many parts of the body. While needles that are 1mm and longer are reserved for estheticians, microneedling your face with a .5mm roller up to 3 times a week may help stimulate hair growth. [11] X Research source Microneedling should not be painful. If you’re experiencing pain or bleeding, stop using the derma roller. Consider going to a spa or salon to get microneedling done."
    },
    {
      "title": "Try growing a mustache or goatee if your hair is patchy.",
      "content": "Try growing a mustache or goatee if your hair is patchy. Many people find their facial hair doesn’t grow as consistently as they’d like it to. Luckily, beard styles like the goatee, Van Dyke, and mustache help give patchy beards a more polished look. [12] X Research source Shave a goatee by removing the hair on your cheeks and sideburns, then experimenting with the circle of hair left behind around your mouth. You can have one with or without a mustache and either have it line just your chin or go up to the underside of your lower lip. Grow a Van Dyke by shaving your sideburns and cheeks until you have a circle of hair around your mouth. Then, shave under either side of your lower lip to make a rectangular strip, and shave under your mustache so it isn’t connected to the hair on your chin. Yachun says one of the most common mistakes people make while trimming their beard is “not using a guard or comb [and instead] just [using] the motion of their wrist.” This can lead to accidentally taking off more of your facial hair than you want since it's less controlled. [13] X Expert Source Timmy Yanchun Professional Barber Expert Interview. 22 January 2020."
    },
    {
      "title": "Eat a balanced diet full of nutrient rich foods.",
      "content": "Eat a balanced diet full of nutrient rich foods. Having enough iron and vitamins D and C has been shown to improve hair growth. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Vitamins A, B, B-12, E, and biotin, zinc, and folate may positively impact hair growth, but there isn’t enough conclusive evidence to say for sure. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Generally, having a healthy diet is enough to promote hair growth, but you may want to try supplements, too. Meat, seafood, legumes, and green leafy vegetables are all good sources of iron. If you’re getting your iron from non-meat sources, eat foods that are high in vitamin C (like citrus) to help absorb the iron. [16] X Trustworthy Source Red Cross Blood Donation Services Website run by the Red Cross Organization providing information about how and where to donate blood safely Go to source Vitamin D is absorbed through sunlight. Spend 5-30 minutes outside each day without sunblock to get an adequate amount of vitamin D. You can also take supplements, but they are not FDA regulated. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can find vitamin A in eggs, meat, cheese, liver, carrots, pumpkin, broccoli, and dark green leafy vegetables. [18] X Research source Foods rich in vitamin E include oils, leafy vegetables, nuts, and beans. Most people get plenty of vitamin E when eating a normal diet. [19] X Research source Vitamin B not only helps the body use fats and proteins necessary for healthy hair but also has been reported to help reduce stress—which can inhibit hair growth. Vitamin B5 occurs naturally in brewer's yeast, broccoli, avocado, egg yolks, organ meats, duck, milk, lobster, whole-grain bread, and more."
    },
    {
      "title": "Work out four times a week, if possible.",
      "content": "Work out four times a week, if possible. Raising your testosterone levels naturally through weight training and increasing circulation through cardio exercises may help improve hair growth. [20] X Research source If your schedule doesn’t allow you to regularly work out, try making small changes like taking the stairs instead of an elevator. If you like sports, organize a weekly game of basketball or soccer with your friends. Involving others makes you more likely to stick to your exercise plans."
    },
    {
      "title": "Get at least eight hours of sleep a night.",
      "content": "Get at least eight hours of sleep a night. Lack of sleep can cause hair loss, especially in facial hair. [21] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Plan your schedule so that you are giving your body enough time to function properly and grow your hair. Try to go to bed and wake up at the same time each day. This can be hard on the weekends when it is tempting to sleep in. But having a regular sleep schedule is great for your overall health."
    },
    {
      "title": "Manage your stress.",
      "content": "Manage your stress. One of the noted side effects of stress is alopecia areata, which can cause bald patches on the scalp and face. [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source There are several techniques you can use to lower your stress . Try meditating or talking to a friend or family member. Focus on your breathing. Taking several deep breaths in and out during a stressful situation is a great way to calm your heart rate and clear your mind. Be patient. Remember that not everyone's facial hair grows at the same rate. Worrying doesn’t help and can make the situation worse. Try to focus on other things throughout the day."
    },
    {
      "title": "Try using Rogaine.",
      "content": "Try using Rogaine. Minoxidil ( Rogaine ) helps to stimulate fresh hair growth, and has been shown to improve beard hair growth. [23] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It’s intended to be used on the scalp, however, and is poisonous when ingested, so be careful and consider consulting with your doctor before using. In studies done on head hair, Rogaine was even more effective when paired with microneedling. [24] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You may experience side effects such as eye burning or irritation, dandruff, or itchy skin."
    },
    {
      "title": "Ask your doctor about testosterone therapy.",
      "content": "Ask your doctor about testosterone therapy. If you have low testosterone or are assigned female at birth and wish to grow facial hair, getting a testosterone prescription can help you grow facial hair, although it may take up to a year to work. [25] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you have low testosterone, there will likely be other symptoms, such as erectile dysfunction and decreased muscle mass. Have your doctor run tests to make sure your levels are actually low. Don't count on a prescription based solely on your hair growth. If you have a normal testosterone levels, taking more doesn't cause you to grow more facial hair."
    },
    {
      "title": "Consult with a plastic surgeon.",
      "content": "Consult with a plastic surgeon. For some, growing facial hair just isn’t in their genes. When all else fails, a plastic surgeon can help by transplanting hair follicles from your scalp into your face. Hair transplants can be very effective, but they can also be costly, in terms of time and money. This is generally done on an outpatient basis and will result in some mild skin irritation. It can also take quite a long time—one to two years—for the procedure to deliver the results you want. [26] X Research source Ask your general physician to recommend someone they trust to perform the transplants. Make sure you have a consultation beforehand, and ask plenty of questions about the procedure."
    }
  ]
}