{
  "url": "https://www.wikihow.com/Change-a-Sanitary-Pad",
  "title": "How to Change a Sanitary Pad",
  "steps": [
    {
      "title": "Bring a fresh pad to the bathroom.",
      "content": "Bring a fresh pad to the bathroom. The bathroom will provide plenty of privacy, plus a hand-washing sink and toilet paper should you need it. You can change in another private place (like your bedroom), but the bathroom is the most convenient. [1] X Research source Wash your hands before you change the pad. You want your hands to be clean when you handle the new pad. You should change your pad every three to four hours unless your period is heavy. In that case, you should change your pad more frequently. Your pad can begin to smell if you don't change it promptly. A heavily saturated pad that is worn too long can also cause chaffing or a rash, and the build up of bacteria can potentially cause an infection."
    },
    {
      "title": "Pull down your pants or skirt and your underwear and sit or squat over the toilet.",
      "content": "Pull down your pants or skirt and your underwear and sit or squat over the toilet. Menstrual fluid may continue to flow out of your body while you're changing your pad, and allowing it to fall into the toilet will keep you and your clothing clean. Make sure your underwear and pants aren't touching the outside of the toilet when you pull them down around your legs."
    },
    {
      "title": "Remove the pad by gripping a clean edge between your fingers and peeling it off your underwear.",
      "content": "Remove the pad by gripping a clean edge between your fingers and peeling it off your underwear. If your pad has wings, you'll want to pull those off first. It's easiest to grab the front or back edge of the pad and simply pull it--it should separate from your underwear easily."
    },
    {
      "title": "Roll the pad so that the adhesive side is on the outside and the soiled part is on the inside.",
      "content": "Roll the pad so that the adhesive side is on the outside and the soiled part is on the inside. The adhesive should cause the pad to stick to itself so that it will stay rolled up. Roll it up the way you might roll up a sleeping bag, but not tightly! You don't want to squeeze out any blood. [2] X Research source"
    },
    {
      "title": "Unwrap the new pad and use the wrapper to hold your old pad.",
      "content": "Unwrap the new pad and use the wrapper to hold your old pad. This reduces waste and is a great way to wrap up your old pad. You can also wrap your old pad in toilet paper. This should keep it from unrolling and is also a courtesy to whoever empties the trash or enters the bathroom after you. [3] X Research source"
    },
    {
      "title": "Throw out your pad in the trash--never, ever flush it down the toilet.",
      "content": "Throw out your pad in the trash--never, ever flush it down the toilet. Pads don't break down like toilet paper, and they are too thick and absorbent to flush down the toilet. If you flush a pad, chances are very high you will clog your plumbing and have a big, expensive, and embarrassing mess on your hands. [4] X Research source If there is not a trash receptacle in the bathroom stall (there is usually a little bin on the floor or built into the side of the wall, just bring the pad out with you and throw it out as soon as possible. There's probably a trash can in the bathroom by the sink. If you have pets at home, make sure you always throw out your pad in a garbage can with a lid. Animals can be attracted to the smell and might take your pad out of an open trash can. They may rip it up and cause a mess, or they may consume parts of the pad, which can endanger their lives."
    },
    {
      "title": "Make sure you're using the right pad.",
      "content": "Make sure you're using the right pad. There are many different types of pads available for women to use. The amount of blood on your soiled pad should give you an indication of your flow--is it heavy, regular, or light? Also, consider what you are about to do. Are you about to go to bed? Are you going to be sitting in class or playing basketball? Some pads accommodate all of these things. [5] X Research source Use an overnight pad if you are going to sleep. They have maximum absorbency and are often extra long to prevent leaking if you sleep on your back. Pads with wings will give you more security--they will keep your pad in place and are especially great if you plan to do something active. If you are near the end of your period, and you have a very light flow, consider pantyliners, which are very slim and protect your underwear from spotting."
    },
    {
      "title": "Remove the paper strip on the back of the pad.",
      "content": "Remove the paper strip on the back of the pad. This will expose the sticky side of the pad that will stick to your underwear. If your pad has wings, wait to remove the paper until you have placed the pad in your underwear."
    },
    {
      "title": "Press the pad into the middle of your underwear, making sure it is centered, and the glue is stuck firmly to the fabric.",
      "content": "Press the pad into the middle of your underwear, making sure it is centered, and the glue is stuck firmly to the fabric. In general, you don't want your pad to be too far forward or back in your underwear. The center of the pad should be in line with your vaginal opening. The shape of the pad should give you an idea of how it should fit onto your panties. [6] X Research source If your pad has wings, remove the paper to expose the adhesive glue and wrap them around the fabric of your underwear. If you are sitting or laying on your back, you may want to slide the pad backward slightly, toward your butt. You may have a few leaks at first, but as you get more used to wearing pads and your period, you will have a better idea of the best placement."
    },
    {
      "title": "Stand up, pull up your pants, and check the fit.",
      "content": "Stand up, pull up your pants, and check the fit. Make sure you feel comfortable and that the pad isn't too far forward or back. If it feels uncomfortable, you might want to refasten the pad or try again with a new one. Before you pull up your pants, you probably want to wipe with toilet paper or a baby wipe so feel fresh and clean."
    },
    {
      "title": "Wash your hands before leaving the bathroom.",
      "content": "Wash your hands before leaving the bathroom. You may have come into contact with bacteria while changing your pad or wiping, so make sure you wash your hands with soap and hot water afterwards."
    }
  ]
}