{
  "url": "https://www.wikihow.com/Get-Big-Arms",
  "title": "The 6 Best Exercises to Build Bigger Arms",
  "steps": [
    {
      "title": "Perform bicep curls",
      "content": "Perform bicep curls . Bicep curls work out the muscles in your upper arm. Hold a dumbbell in each hand with your arms straight. Curl the dumbbells up towards your shoulders. Pause briefly and lower them again. Do two or three sets of 8-12 repetitions."
    },
    {
      "title": "Do triceps dumbbell extensions to bulk up your triceps.",
      "content": "Do triceps dumbbell extensions to bulk up your triceps. Stand with your feet shoulder-width apart and hold dumbbells over your head with your wrists facing inward. Lower the dumbbells behind your head so that your elbows point up in the air, then raise the dumbbells above your head and straighten your elbows again. [2] X Research source Do between 8 and 12 reps, and 3 to 5 sets."
    },
    {
      "title": "Do wrist curls to work out your forearms.",
      "content": "Do wrist curls to work out your forearms. It is important that you do not neglect your forearms. Wrist curls can help strengthen your wrists and forearms, which will improve your lifting ability overall. To do wrist curls, sit and grasp a dumbbell in each hand. Rest your arms against your thighs with your wrists hanging off the edge of your knees. Curl your wrists up and back down, keeping your forearms still. [3] X Research source Repeat 8-12 times. Do two or three sets total."
    },
    {
      "title": "Do bicep curls to shoulder press to build your biceps and shoulders.",
      "content": "Do bicep curls to shoulder press to build your biceps and shoulders. [4] X Research source Your biceps are one of the main muscle groups in your arms, and working out your shoulders will help increase your overall body strength. Stand with your feet shoulder-width apart and hold the dumbbells at your sides with your arms fully extended and your palms turned inwards, curl the dumbbells to your chest, then press them over your head before reversing the dumbbells to the starting position. Do between 8 and 12 reps, and 3 to 5 sets. Rest for about 45 seconds between sets. This exercise may also be performed with a kettle bell or barbells."
    },
    {
      "title": "Do chin-ups",
      "content": "Do chin-ups to work out your biceps and back. The primary muscles that chin ups engage are in the back, but this exercise also helps strengthen your biceps. Grip a fixed bar with your hands shoulder-width apart and your palms facing you. Use your arms to lift your body, until your chin is higher than the bar then slowly lower yourself back to the starting position. [5] X Research source Do between 8 and 12 reps, and 4 to 5 sets."
    },
    {
      "title": "Perform push-ups.",
      "content": "Perform push-ups. Push-ups are a great exercise because they target the chest, back, and ab muscles while also working out the arms. [6] X Research source To do a push up, put your hands below your body and slightly outside your shoulders. The rest of your body should extend straight back. Lower yourself by bending your elbows until you are just above the ground. Raise yourself back up until your arms are straight. Do as many push ups as you can while still maintaining proper form."
    },
    {
      "title": "Don't eat too many calories.",
      "content": "Don't eat too many calories. You may think that to bulk up your muscles, you should eat more calories than you usually would. Eating more calories doesn't translate into building bigger muscles. Rather, the calories increase body fat, which obscures muscle definition. The key is to eat a diet that enables you to be lean, so your big muscles become more apparent. Eat balanced meals with plenty of fruits and vegetables, whole grains, healthy fats, and lean meats. Avoid white sugar and flour, fried foods, and other high-calorie foods that may cause you to gain fat."
    },
    {
      "title": "Eat plenty of protein.",
      "content": "Eat plenty of protein. Protein helps build muscles, so when you're trying to bulk up, it should be a mainstay of your diet. Try to increase your daily intake of protein to help build more muscle. Choose fish, chicken, lean beef, pork, and other types of meat to supply yourself with protein. Eggs are also a great source of protein. Beans, nuts, and other vegetables are good vegetarian protein sources. Dairy, such as milk, cottage cheese, and yogurt, is another great source of protein."
    },
    {
      "title": "Take rest seriously.",
      "content": "Take rest seriously. When it comes to building muscles, resting periods are as important as workout periods. Get between 7 and 9 hours of sleep on the days when you work out, and avoid overdoing it with other activities that require use of your arm muscles. You're probably working out your muscles enough if they burn while you're at the gym. However, if your arms keep burning long after you leave, that's a sign you're stressing your muscles too much, which can actually slow down the process of your arm muscles growing. [7] X Expert Source Steve Horney PT, MPT, MTC, CSCS Licensed Physical Therapist Expert Interview. 20 March 2020."
    },
    {
      "title": "Work out",
      "content": "Work out your whole body. It's healthier to strengthen all of your muscles with compound exercises than to focus only on building arm mass. If you want to be able to lift heavy objects and weights, you also need to work on your shoulders, chest, and back. If you don't work out your legs and core, you'll end up with big arms and a lower body that isn't as muscular. [8] X Research source Do compound exercises that bulk up your arms while also toning other muscles. Chin-ups and push-ups, for example, strengthen your abs at the same time they are strengthening your arms. Reader Poll: We asked 590 wikiHow readers what type of exercise they enjoy the most during arm workouts, and 72% said weightlifting. [Take Poll]"
    },
    {
      "title": "Train two times per week.",
      "content": "Train two times per week. Many people think that working out every day builds bigger muscles, but muscle mass is actually built during resting days between workout sessions. Your muscles grow stronger as they recover between lifting sessions, enabling you to gradually lift more and more weight. If you don't give your muscles time to rest, particularly your arm muscles, you risk overtraining them and delaying the results you want to achieve."
    },
    {
      "title": "Train in 30-minute sessions.",
      "content": "Train in 30-minute sessions. For the same reason, you should only train one or two times per week and each training session should only last about half an hour. Training for over half an hour per session greatly increases the risk that you will injure your ligaments, joints, and tendons. Short, intense training sessions are your best bet for building arm mass."
    },
    {
      "title": "Train as hard as you can.",
      "content": "Train as hard as you can. Choose heavy weights that you are able to pick up, and make your training sessions as high-intensity as possible. Muscle-builders call this \"training to failure,\" because it means lifting weights that are heavy enough to cause you to \"fail,\" or be unable to complete the exercise after five to eight reps. As your arms grow stronger, and you find that the weight you've been lifting is no longer as difficult, add more weight. If you are new to lifting weights , you may want to work with lower weights first before working your way up to heavier weights. Do not start off with the heaviest weights you can lift. Instead, find a lighter weight that you can do at least 8-12 reps with. Find your \"train to failure\" weight by experimenting with different weights until you find one you can lift several times before breaking a sweat and feeling you can't lift it again. If you can complete 10 or 12 reps without sweating or feeling much of a burn, you should be lifting more weight. If you can't complete five or six reps before giving up, decrease the weight. While extreme discomfort is part of building muscle mass, you shouldn't be lifting so much weight that you feel you're going to be sick or pass out. There's no shame in starting at a lower weight. Start lifting a weight you can handle, and soon you'll build up the strength required to lift heavier weights ."
    },
    {
      "title": "Do high-volume workouts, low-intensity workouts.",
      "content": "Do high-volume workouts, low-intensity workouts. Instead of doing exercises with the maximum amount of weight you can handle for a few repetitions, choose a smaller weight and do more repetitions. High-volume workouts are associated with more muscle growth and are used by bodybuilders to gain muscle mass quickly. [9] X Expert Source Steve Horney PT, MPT, MTC, CSCS Licensed Physical Therapist Expert Interview. 20 March 2020. For example, you could do 8 dumbbell curls at 50% of your maximum weight. This would be one rep. Then you could repeat this 5 or 6 times in a workout."
    },
    {
      "title": "Use proper form.",
      "content": "Use proper form. Get the maximum benefit from your workouts and avoid injury by using the correct form when you lift weights. In addition, to lifting the appropriate amount of weight for your level of fitness, keep the following tips in mind when you're lifting weights: Lift with controlled movements, rather than using momentum to move the weights. Be sure you are able to complete each full exercise for at least 6-8 reps. If you cannot do this many, the weights you are using may be too heavy."
    }
  ]
}