{
  "url": "https://www.wikihow.com/Clean-Whirlpool-Dishwasher",
  "title": "The Best Ways to Clean Your Whirlpool Dishwasher Inside and Out",
  "steps": [
    {
      "title": "Put a bowl of distilled white vinegar in the dishwasher’s bottom rack.",
      "content": "Put a bowl of distilled white vinegar in the dishwasher’s bottom rack. James Sears, a home cleaning professional, says that non-toxic cleaners like vinegar are best for your dishwasher instead of using bleach. Just put 1 cup (240 ml) of vinegar in a dishwasher-safe bowl, and place it upright in the bottom rack. [1] X Research source Avoid loading other dishes into your dishwasher while you’re using vinegar to clean it. While Whirlpool officially recommends putting the vinegar in the bottom rack, Sears suggests putting it on the top rack works just as well. Professional home cleaner Chris Willatt explains that cleaning with vinegar works because it's acidic, which helps break down and dissolve mineral deposits inside of your dishwasher. Alternatively, Willatt says “you can usually fill the basin up with about a quarter inch of vinegar” to clean out your dishwasher."
    },
    {
      "title": "Run a wash cycle without the heat dry setting.",
      "content": "Run a wash cycle without the heat dry setting. Turn off any heated dry cycles on your dishwasher before starting a normal wash cycle. Let the cycle run completely so the vinegar can work through your entire dishwasher to clean out any buildup or residue. [2] X Research source Avoid using any detergent when you’re cleaning with vinegar. Using a high heat setting on your dishwasher when you clean with vinegar may damage parts inside the machine, so always double-check that you turned it off."
    },
    {
      "title": "Sprinkle baking soda in the dishwasher and run a rinse cycle.",
      "content": "Sprinkle baking soda in the dishwasher and run a rinse cycle. Once the wash cycle finishes, spread 1 cup (272 g) of baking soda under the dishwasher’s bottom rack. Sears says, “do a rinse cycle with hot water afterwards…so that the acidic vinegar does not corrode the plastic gaskets.” Baking soda will also help remove any leftover marks and neutralize remaining odors inside your dishwasher."
    },
    {
      "title": "Place an Affresh cleaning tablet in the detergent compartment.",
      "content": "Place an Affresh cleaning tablet in the detergent compartment. Whirlpool officially recommends using the Affresh brand cleaner, but any dishwasher cleaning tablet will work fine. Place the tablet inside the detergent compartment and close the door. [3] X Research source Affresh cleaning tablets work great for removing built-up calcium deposits and limescale that vinegar wasn’t able to remove. If your dishwasher is looking extra dirty, then toss a second Affresh tablet in the bottom of the machine. Unlike vinegar, cleaning tablets are safe to use during a normal wash cycle with dishes. Load your detergent normally and put the tablet in the bottom of the dishwasher instead."
    },
    {
      "title": "Run a normal wash cycle.",
      "content": "Run a normal wash cycle. Use the standard wash and dry cycle you would regularly use. As the machine runs, the cleaning tablet will dissolve and break apart the mineral deposits inside of your dishwasher. Let the cycle run through completely, and your dishwasher will be sanitized and deodorized. [4] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If you still notice buildup after using a cleaning tablet, try running another cleaning cycle."
    },
    {
      "title": "Remove the filter from the bottom of your dishwasher.",
      "content": "Remove the filter from the bottom of your dishwasher. Remove the lower dish rack from your dishwasher, and look for the circular filter near the front. Twist the filter counter-clockwise by a quarter-turn and slowly lift it out. Once you have the filter assembly out, separate the cylinder from the larger lower piece. [5] X Research source While it’s not common, some Whirlpool dishwashers don’t have a removable filter. If you’re not able to remove yours, consult your appliance’s manual for specific cleaning instructions."
    },
    {
      "title": "Rinse the filter out under running water.",
      "content": "Rinse the filter out under running water. Ashley Matuska, a professional cleaner, says to clean the filter in your sink and run it under cold or hot water to remove debris. Try to get as much debris out as you can with the running water. [6] X Research source If your dishwasher filter looks really dirty, soak it in soapy water for about 1 hour to break apart the buildup inside. [7] X Research source"
    },
    {
      "title": "Scrape out food and debris lightly with a cleaning brush.",
      "content": "Scrape out food and debris lightly with a cleaning brush . Wet the brush and gently scrub the mesh filter material to remove any clogs. Rinse the mesh after you scrub it and use the brush again if you still notice residue. [8] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Be careful not to scrub the filter pieces too hard because you could damage them."
    },
    {
      "title": "Reinstall the filter in your machine.",
      "content": "Reinstall the filter in your machine. Start by sliding the lower filter piece into the bottom of your dishwasher. Then, slide the upper filter cylinder through the hole in the lower piece and rotate it clockwise until it stops turning. [9] X Research source Avoid running your dishwasher when you have the filter removed because debris and food particles could get caught in the drain pipes and form a clog."
    },
    {
      "title": "Wipe the exterior with a soapy cloth when it looks dirty.",
      "content": "Wipe the exterior with a soapy cloth when it looks dirty. Wet a clean towel or sponge with water and add a few drops of mild dish soap. Gently wipe the surfaces of the dishwasher to remove any marks or smudges. [10] X Research source If your dishwasher has a stainless steel exterior, then use a stainless steel cleaner to help restore its shine."
    },
    {
      "title": "Scrub the dishwasher’s seal with a damp, soapy cloth.",
      "content": "Scrub the dishwasher’s seal with a damp, soapy cloth. The rubber seal goes around the outer edge of the door to prevent leaks, but it can also build up mildew. Wet a cloth in warm water and lather in some dish soap. Gently scrub the seal until it looks completely clean. [11] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If the seal looks damaged or cracked, replace it to prevent your dishwasher from leaking."
    },
    {
      "title": "Unclog holes in the sprayer arms with a toothpick.",
      "content": "Unclog holes in the sprayer arms with a toothpick. The sprayer arm is the spinning piece at the bottom of your dishwasher. Look for a screw in the center of the sprayer arm to remove it. Otherwise, it will pull off with a gentle tug. Check the holes on the arm and pick out any clogs you find with a toothpick. When you’re finished, reattach the sprayer arm. [12] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If the sprayer arm looks dirty, then gently scrub it with a damp soapy cloth."
    },
    {
      "title": "Clean the vent and vent cover if your dishwasher door has one.",
      "content": "Clean the vent and vent cover if your dishwasher door has one. The vent and vent cover allow steam and moisture to escape throughout the wash cycle. Turn the vent cover counter-clockwise until it pops off. Wipe out the inside of the vent with a clean towel. Then, wash the vent cover with soapy water before reinstalling it. [13] X Research source Not all Whirlpool dishwashers have vents."
    },
    {
      "title": "Run a brush through the dishwasher’s air gap.",
      "content": "Run a brush through the dishwasher’s air gap. Look for the air gap cylinder near your kitchen sink faucet and remove the cover. Insert the brush, and work it up and down to dislodge any buildup. Every so often, pull the brush completely out and wipe it on a paper towel. [14] X Research source The air gap is a hose that connects your dishwasher to the sink drain and prevents dirty water from flowing into the machine."
    },
    {
      "title": "Deep-clean your dishwasher once a month.",
      "content": "Deep-clean your dishwasher once a month. Whirlpool recommends cleaning out your dishwasher monthly to prevent buildup from forming inside. If you notice any other stains or marks in between cleanings, you may always try to wipe them away or just run a cleaning cycle early. Willatt says that if you don’t use your dishwasher frequently, cleaning it every 6 months works well."
    },
    {
      "title": "Clean out the filter every 3 months.",
      "content": "Clean out the filter every 3 months. Matuska recommends removing and checking the filter every couple of months to make sure there’s no food or buildup inside. If you leave more food scraps on your dishes when you wash them, then check your filter monthly to make sure it doesn’t clog or get smelly. [15] X Research source"
    },
    {
      "title": "Scrape food residue off your dishes before loading them.",
      "content": "Scrape food residue off your dishes before loading them. Get rid of any large pieces of food or hard objects like bones or toothpicks so they don’t clog the bottom of your dishwasher. [16] X Research source You don’t need to rinse all the food completely off your dishes. The detergent will break down anything you leave behind."
    },
    {
      "title": "Leave room between your dishes for the best clean.",
      "content": "Leave room between your dishes for the best clean. When you load your dishwasher , make sure you don’t overfill the racks with dishes. Be careful not to overlap any dishes or crowd them tightly together because they won’t get as clean. [17] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Run your dishwasher with hot water.",
      "content": "Run your dishwasher with hot water. Before you start your dishwasher, run your kitchen sink faucet until the water turns hot. That way, you ensure only hot water goes into your dishwasher. [18] X Research source Hot water helps sterilize your dishes and gives you the best clean."
    },
    {
      "title": "Fill your dishwasher’s water softener if you have hard water.",
      "content": "Fill your dishwasher’s water softener if you have hard water. Check for hard water from your kitchen sink using a hardness test strip . If you have hard water, some dishwashers have a built-in water softener that can help reduce mineral deposits and buildup even more. [19] X Research source Press and hold the Tableware and Cancel buttons for 3 seconds until the lights or display begin to flash. This varies depending on your dishwasher model. Use the buttons to change the water softener setting depending on the test strip results. Open the water softener valve at the bottom of the dishwasher and fill it with dishwasher salt . If it’s your first time adding salt, then also fill the valve with water."
    }
  ]
}