{
  "url": "https://www.wikihow.com/Make-a-Crocheted-Rag-Rug",
  "title": "How to Make a Crocheted Rag Rug",
  "steps": [
    {
      "title": "Find suitable cotton fabric for making the rug.",
      "content": "Find suitable cotton fabric for making the rug. Old t-shirts, tops, bed linen, tablecloths, etc. can all be suitable sources of fabric, as well as your fabric stash."
    },
    {
      "title": "Launder all fabrics to be used.",
      "content": "Launder all fabrics to be used."
    },
    {
      "title": "Cut the fabric into strips according to the size of your crochet hook.",
      "content": "Cut the fabric into strips according to the size of your crochet hook. Generally, 1.5 - 2 inches (3.8cm to 5cm) wide is a good width."
    },
    {
      "title": "Sew the strips end to end.",
      "content": "Sew the strips end to end. Iron the seams if desired––it looks neater in the end result."
    },
    {
      "title": "Roll the \"yarn\" into a ball.",
      "content": "Roll the \"yarn\" into a ball."
    },
    {
      "title": "Begin to crochet \"in the round\" as usual, by chaining 6 and slip stitching them together in a loop.",
      "content": "Begin to crochet \" in the round \" as usual, by chaining 6 and slip stitching them together in a loop. Double Crochet 6 and slip stitch the ends together. Increases start on the second round. An increase is made by making 2 dc in a same stitch."
    },
    {
      "title": "Work 2 dc in every dc around the circle, in the second round.",
      "content": "Work 2 dc in every dc around the circle, in the second round."
    },
    {
      "title": "Make an increase on every other stitch in the third round.",
      "content": "Make an increase on every other stitch in the third round. (dc in one, two dc in the next, etc.). As the rounds become wider, there are more stitches in between each increase."
    },
    {
      "title": "Crochet two DC stitches between each increase in round 4.",
      "content": "Crochet two DC stitches between each increase in round 4."
    },
    {
      "title": "Crochet three DC stitches between each increase in round 5.",
      "content": "Crochet three DC stitches between each increase in round 5."
    },
    {
      "title": "Follow the pattern for each remaining round until your rug reaches the desired size.",
      "content": "Follow the pattern for each remaining round until your rug reaches the desired size."
    }
  ]
}