{
  "url": "https://www.wikihow.com/Install-Vinyl-Siding",
  "title": "How to Install Vinyl Siding",
  "steps": [
    {
      "title": "Think about why you want to install vinyl siding.",
      "content": "Think about why you want to install vinyl siding. Vinyl siding is a good option for homeowners who like the look of siding, but don't want the expense that accompanies cedar and concrete composite products. It is also a favorite for homeowners who don't want the hassle of repainting the outside of their house periodically. Before you decide to install vinyl siding on your own home, visit some vinyl sided houses and inspect them thoroughly to make sure you like what you see. Ask a local realtor about how installing vinyl siding on your home might affect the value of the house -- although it will have a positive effect in most places, if your house is the only one with vinyl siding in a neighborhood of restored Victorian homes, it could bring the value down. Decide what type of vinyl you want -- vinyl siding comes in textured or smooth, high gloss or low gloss finishes. It also comes in a wide array of colors, some with grain-like patterns which closely resemble real wood."
    },
    {
      "title": "Consider hiring a contractor.",
      "content": "Consider hiring a contractor. Although installing vinyl siding by yourself might save you a lot of money, you should definitely consider hiring a contractor if you've never installed vinyl siding before. Installing vinyl siding is an involved process which requires a lot of time and skill. In fact, the quality of the installation can have a huge effect the finished result and even determine how long the siding lasts. Even the highest quality siding will buckle and warp if not installed correctly. If you choose to get a contractor, gather a list of names in your local area and request a price estimate from each of them. Also take the time to inspect some of their previous work and talk to previous clients to make sure they are satisfied with the work done."
    },
    {
      "title": "Gather your tools and materials.",
      "content": "Gather your tools and materials. [1] X Research source If you decide to go ahead and complete the project yourself, you will need quite an extensive array of tools and materials. Use the following list as a guideline. In terms of tools, you will need: a folding ruler, a metal square, a claw hammer, a snap-lock punch, tin snips, a power saw, a chalk line, a measuring tape, a level, a utility knife, a pliers, a nail slot punch, a carpenter's saw, a hacksaw, a stepladder, sawhorses and a pry bar. In terms of materials, you will need: lengths of J-channel, flashing, building paper, corrosion-resistant nails and enough vinyl siding to cover your home. You will also need vinyl corners and trim for windows and doors, as well as a termination trim for where you meet other surfaces such as soffits and masonry work."
    },
    {
      "title": "Prepare the outside of your home for the installation.",
      "content": "Prepare the outside of your home for the installation. Before you begin, you will need to properly prepare the outside of your home for the siding installation. One of the major issues with vinyl siding is that it masks moisture problems and other structural defects. Therefore it's important to fix any existing issues before you install the siding. Tighten any loose boards and replace any rotting ones. Scrape away any old caulk from around doors and windows. Clear your work area by removing any fixtures such as exterior lights, down-spouts, moulding, mailboxes and house numbering. Also tie back any plants, trees or flowers from the exterior of the house to give you more room and prevent them from becoming damaged."
    },
    {
      "title": "Remove any siding or exterior finish that isn't compatible with vinyl siding, and make sure the walls are sheathed with a substrate to receive the siding.",
      "content": "Remove any siding or exterior finish that isn't compatible with vinyl siding, and make sure the walls are sheathed with a substrate to receive the siding. 1 ⁄ 2 inch (1.3 cm) plywood or OSB are common substrates, and these are generally covered with roofing felt or another moisture barrier prior to siding the walls."
    },
    {
      "title": "Understand the fitting and nailing rules.",
      "content": "Understand the fitting and nailing rules. When installing vinyl siding, there are a number of important rules to follow with regards to fitting and nailing. Vinyl siding expands and contracts with temperature changes, therefore it is important to allow extra room for expansion in order to prevent the siding from buckling. Leave an extra 1 ⁄ 4 inch (0.6 cm) gap between siding panels and any accessories. You should also refrain from driving the nails too tightly, restricting the movement of the panels.You should leave about 1 ⁄ 16 inch (0.2 cm) between the nail head and the siding, to allow for movement and prevent waves from forming in the panels. In addition, you need to center each nail in the appropriate slot, making sure to drive the nails in straight rather than crooked. You should never face nail (drive nails through the panels) when installing siding, as this may cause the panels to buckle."
    },
    {
      "title": "Nail J-channel pieces under the fascia.",
      "content": "Nail J-channel pieces under the fascia. [2] X Research source Install lengths of J-channel along the inner edge of the fascia. The J-channel will conceal the cut edges of the soffit lengths and will provide a watertight seal. Your nails should be centered in the channel slots and the nail heads should remain 1/32-to-1/16 inches (0.7938-to-1.6 mm) out. Boxed-type soffits will need a second J Channel strip, running from the fascia to the edge of the house."
    },
    {
      "title": "Understand how to deal with wrap-around soffit.",
      "content": "Understand how to deal with wrap-around soffit. [3] X Research source If the soffit on your house wraps around a corner, you will need to make provisions for the change of direction. You can do this by installing two J-channels diagonally where the corners of the roof and house meet. You will have to cut a number of soffit and vent pieces at an angle to accommodate the diagonal pieces of J-channel."
    },
    {
      "title": "Measure and cut the soffit pieces.",
      "content": "Measure and cut the soffit pieces. Vinyl siding usually comes in 12-foot (3.66-meter) lengths. [4] X Research source Therefore, you will need to cut these long pieces of siding to fit the measurements of your soffit. Keep in mind that the soffit pieces should measure 1 ⁄ 4 inch (0.6 cm) (6.35 mm) shorter than the actual length of the soffit. This 1 ⁄ 4 inch (0.6 cm) gap allows for the expansion of vinyl siding in warm weather. [5] X Research source"
    },
    {
      "title": "Push each panel into the J-channel.",
      "content": "Push each panel into the J-channel. Once the J-channel is installed and the soffit pieces are cut, you will be able install them. You can do this by pressing the soffit pieces into the channel, bending them to fit if necessary (vinyl siding is quite flexible). If you're having difficulty just pressing them in, you may need to pull the channel lip back with a pry bar or locking tool to get the siding panels to fit ."
    },
    {
      "title": "Slide in the fascia siding pieces.",
      "content": "Slide in the fascia siding pieces. Once the soffit pieces are installed, remove the gutter/downspout and slide the lengths of fascia siding under the gutter apron. Secure the top edge of the fascia pieces with galvanized or painted nails placed every couple of feet. Reattach the gutters."
    },
    {
      "title": "Measure the walls.",
      "content": "Measure the walls. Measure the length of the walls from the eaves to the bottom of any existing siding. This will help you to figure out how many panels of siding you'll need per wall. Divide the length of each wall by 8 inches (20.3 cm) (the width of a piece of siding). If the result is a whole number, you're in luck: you'll be able to install the pieces of siding without leaving any gaps or needing to cut any pieces to size. But if the result is not a whole number, you will need to cut the final piece of siding (lengthwise) in order to fill in the remaining space. If you have to cut the last row of siding, you'll need to use a length of J-channel on the top edge of the siding (instead of utility trim). You will also need to nail a strip of 1/2-inch (12.7-mm) plywood, 3 inches (76.2 mm) wide to the channel to support it. [6] X Research source"
    },
    {
      "title": "Install a starter strip.",
      "content": "Install a starter strip. [7] X Research source Once you've decided where you want the siding to begin, drive a nail through a point on your chosen starting height and snap a chalk line around the perimeter of the house. Nail a piece of plywood about 3.5 inches (89 mm) thick along the top of the chalk line -- this will hold out the bottom of the first row of siding. Attach the starter strip to the plywood, but don't nail it so tightly that it will restrict the strip's movement. Remember to leave 1 ⁄ 4 inch (0.6 cm) between each starter strip to allow room for expansion."
    },
    {
      "title": "Install the corner posts.",
      "content": "Install the corner posts. Install 1/2-inch (12.7 mm) foam sheathing strips on both sides of each corner, then install your corner siding pieces to these strips. The corner posts should run from 3 ⁄ 4 inch (1.9 cm) below the bottom of the starter strip to just beneath the eaves, after the soffit pieces have been installed. Make sure the corner siding pieces are completely straight before you secure them. Once you're satisfied, nail them to the adjoining walls, working from top to bottom."
    },
    {
      "title": "Install J-channel around windows and doors.",
      "content": "Install J-channel around windows and doors. The next step is to install J-channel around all four sides of exterior doors and windows. Place the J-channel snugly against the casing and nail it to the wall -- remembering not to nail too tightly, to allow for movement."
    },
    {
      "title": "Begin installing the wall siding.",
      "content": "Begin installing the wall siding. Apply any necessary insulation materials to the walls before you begin to install the siding. Start at the bottom of the wall and work your way up. Make sure each piece is level using a centering laser. Measure and cut the lengths of siding, so that each panel ends 1/4 inch (12.7 mm) shy of the vertical trim pieces, to allow for expansion. If you are installing the siding in freezing conditions, you should leave 3 ⁄ 8 inch (1.0 cm) instead. Slide the bottom row of panels into place, making sure to hook the bottom lip of each panel under the starting strip. Secure the panels with a nail every 16 inches (40.6 cm) or so -- remembering to center the nail in slot and leave 1/16 of the nail head above the vinyl siding, to allow for movement and expansion."
    },
    {
      "title": "Overlap adjoining panels.",
      "content": "Overlap adjoining panels. When joining two lengths of siding together, overlap them by about 1 inch (3 cm) (25.40 mm). When deciding which side to overlap on, choose the side that will be least obvious from the front or most used area of your house. For example, if your driveway is located to the right of your house, then a right over left overlap will be least noticeable."
    },
    {
      "title": "Install siding around windows.",
      "content": "Install siding around windows. When you get to a window, you will need to cut sections from the panels directly above and below it to fit. Measure the width of the piece you need to cut by holding the length of siding against the window and marking the edge points on the panel with a pencil. Leave on extra 1 ⁄ 4 inch (0.6 cm) of clearance on either side of these marks. Measure the height of the piece you need to cut by butting a scrap piece of siding beneath (and above) the window and marking the necessary height, leaving an additional 1 ⁄ 4 inch (0.6 cm) of clearance. Transfer this measurement onto the piece of siding. Make the vertical cuts on the siding panel with a saw and make the horizontal cut with a utility knife, then snap out the piece. Install the cut pieces of siding above and below the windows, as normal. You can use a tool to clip vinyl siding. Go slow and make nice cuts. Do not try to cut it quickly. The cuts need not be perfect because they will be covered with jig channels later. The way you attach the siding depends on what you have as your base. So you either have the zip sheathing system or the Tyvek home wrap. Before you buy siding, make sure it's sealed properly. When you install the siding, start from the bottom and go up."
    },
    {
      "title": "Install the top row of siding.",
      "content": "Install the top row of siding. When you reach the top row of siding, you will need to measure and cut it to fit. To determine how much you will need to cut from the top of the panel, measure the distance between the top of the under-sill trim and the lock on the next panel down, then subtract 1 ⁄ 4 inch (0.6 cm). When you cut the top siding panel to the appropriate height you will be removing the nailing strip. Use a snap-lock punch tool to punch the top edge of the panel along 6 inch (15.2 cm) intervals, making sure the raised material is on the outside. Slot the bottom edge of the panel into the panel below and slide the top edge under the under-sill trim. The raised slots you made with the snap-lock punch will catch onto the trim and hold the top siding panel firmly in place -- so there is no need to face nail it to secure."
    }
  ]
}