{
  "url": "https://www.wikihow.com/Create-a-Facebook-Profile",
  "title": "How to Make a Facebook Profile on Computer or Mobile",
  "steps": [
    {
      "title": "Open the Facebook app and tap Create New Facebook Account.",
      "content": "Open the Facebook app and tap Create New Facebook Account . Once you download and install the app, open it, tap Create New Facebook Account at the bottom, and then tap Get Started . When you create a Facebook account , you automatically create a profile. If you are already logged into another Facebook account and want to create a new one, log out first. To do so, tap your profile icon in the upper-right or lower-right corner, scroll to the bottom, and tap Log out . If you want to keep your existing Facebook account and add a new profile for another purpose, such as for work or school, see adding additional profiles ."
    },
    {
      "title": "Enter your personal information.",
      "content": "Enter your personal information. The first few pages of the Facebook sign-in process ask you to enter information about yourself, including your full name, birthdate, and gender. Enter the correct information and tap Next on each page. The name you use should follow Facebook's name policy, which requires you to use your actual name or nickname that people call you in your day-to-day life. [2] X Research source If you select Custom as your gender, you can select pronouns or choose not to enter. If you are asked to allow Facebook to access your contacts, tap Allow or Don't allow if you'd rather not."
    },
    {
      "title": "Enter your phone number or email address and tap Next.",
      "content": "Enter your phone number or email address and tap Next . Enter a valid phone number, preferably the one for the phone you are using to sign up. If you would rather sign up with an email address, tap Sign up with email and then enter a valid email address. Tap Next when you are done."
    },
    {
      "title": "Enter a password for your Facebook account and tap Next.",
      "content": "Enter a password for your Facebook account and tap Next . Use a strong password that contains various upper and lowercase letters, numbers, and special characters."
    },
    {
      "title": "Agree to Facebook's Terms and Policies and confirm your account.",
      "content": "Agree to Facebook's Terms and Policies and confirm your account. To do so, tap any of the blue links you want to read and then tap I agree at the bottom of the page. Then, you will need to either check your text messages or the inbox of the email address you used to sign up. Retrieve the confirmation code from the message that Facebook sent you and enter it into the mobile app. Then tap Next ."
    },
    {
      "title": "Select a profile picture (optional).",
      "content": "Select a profile picture (optional). Your profile picture is a square image that represents you. It will be displayed next to all your Facebook posts, comments, videos, and pictures. To select a picture, tap Add picture and then tap the option to select a photo from the Gallery or Camera Roll or take a picture with your camera. Tap Done when you are finished, or tap Skip if you don't want to add a profile pic now."
    },
    {
      "title": "Turn on optional features.",
      "content": "Turn on optional features. The next few pages will ask if you want to turn on various optional features. Those features are as follows: Contact uploading: This uploads your contacts so that you can find them on Facebook and add them as friends. Notifications: Notifications can inform you when you get friend requests, replies, likes, and more."
    },
    {
      "title": "Go to the Edit Profile page.",
      "content": "Go to the Edit Profile page. This page allows you to edit your profile and add additional information. Tap your profile icon in the upper or lower-right corner. Tap your name. Tap the icon with three dots ( ⋯ ) below your banner image. Tap Edit ."
    },
    {
      "title": "Edit your profile pictures.",
      "content": "Edit your profile pictures. The Edit Profile page allows you to edit your profile picture and cover photo. If you want to change either, tap Edit next to \"Profile Picture\" or \"Cover photo\" and select a photo or take a picture with your camera. Edit your avatar: Facebook allows you to create a custom cartoon avatar of yourself that you can use in various posts. If you want to create an avatar, tap Edit next to \"Avatar.\" Use the tools to customize your avatar tap Save in the upper-right corner. Your cover image is a rectangle-shaped image displayed at the top of your Facebook profile when people click on your Facebook profile. For best results, select a rectangular image that is about 851 by 315 pixels."
    },
    {
      "title": "Add information about yourself.",
      "content": "Add information about yourself. To do so, tap Edit your about info at the bottom of the page, then tap Edit next to one of the categories, or tap the option to add a new item below one of the category headers. You can add your contact information, website, and other social media platforms. You can also add your work history and education history."
    },
    {
      "title": "Go to https://www.facebook.com/ in web browser and click Create new account.",
      "content": "Go to https://www.facebook.com/ in web browser and click Create new account . You can use any web browser on your PC, Mac, or Chromebook. When you create a new account , you automatically create a personal Facebook profile."
    },
    {
      "title": "Enter your personal information and click Sign Up.",
      "content": "Enter your personal information and click Sign Up . You will need to enter your first and last name, a valid email address or phone number, password, birthday, and gender. When you are finished, click Sign Up at the bottom of the form. The name you use should be your actual name or nickname that people call you in your day-to-day life. Make sure you select a strong password that contains a combination of upper and lowercase letters, numbers, and special characters. If you don't want to select \"Male\" or \"Female\" as your gender, select Custom , select your pronoun, and enter your chosen gender."
    },
    {
      "title": "Verify your account.",
      "content": "Verify your account. A verification code will be sent to the email or phone number you used to create your account. Check your email or text messages, enter the verification code, and click Continue . From now on, you can sign in to Facebook by going to https://www.facebook.com/ in a web browser. If you are not logged in automatically, enter the password associated with your Facebook account."
    },
    {
      "title": "Go to your profile and click Edit.",
      "content": "Go to your profile and click Edit . To do so, click your profile image in the upper-right corner, click your name, and then click Edit below your cover photo. If you have not uploaded a profile picture yet, the image will resemble a person's silhouette."
    },
    {
      "title": "Upload a profile image and cover image.",
      "content": "Upload a profile image and cover image. Your profile picture is a small image that represents you and is displayed next to all your Facebook posts, comments, videos, and pictures. The cover photo is the wide image at the top of your Facebook profile. Click Edit next to \"Profile picture\" or \"Cover photo\" to select images for your profile. Facebook also allows you to create a custom cartoon avatar of yourself that you can use in various posts. If you want to create an avatar, click Edit next to \"Avatar,\" and use the tools to customize your avatar."
    },
    {
      "title": "Click Edit Your About Info.",
      "content": "Click Edit Your About Info . It's the blue button at the bottom of the page."
    },
    {
      "title": "Add details about yourself.",
      "content": "Add details about yourself. To edit information about yourself, click one of the categories in the \"About\" menu to the left, then click the option to add a new item to the list. Fill out the form to add a new item and then click Save . Work and Education: This is where you can enter where you work, places you previously worked, and where you've attended school. Places lived: This is where you can add your current location and previous cities or regions you've lived in. Contact and basic info: Here, you can add or change your email address and phone number, links to websites and other social media accounts, add languages you speak, and change your birthdate and gender. Privacy and legal info: If you live in a country that requires you to add an Impressum or statement of ownership to your profile, this is where you can do it. Family and relationships: This is where you can add family members and spouses. Details about you: You can add a brief bio about yourself, a name pronunciation, a nickname or birthname, and a favorite quote."
    },
    {
      "title": "Log in to your main Facebook account.",
      "content": "Log in to your main Facebook account. Recently, Facebook has begun allowing you to create multiple profiles in addition to your main profile. You can use this to create different profiles for different parts of your life, such as a work or business profile or a profile for your hobbies. Open the Facebook app and make sure you are logged into your main Facebook account . Additional profiles you create are still linked to your main Facebook profile. Other users can find your users can find your main profile and your identity."
    },
    {
      "title": "Create a new profile.",
      "content": "Create a new profile. Here's how: [3] X Research source Tap your profile icon in the upper-right or lower-right corner. Tap your name to display your profile. Tap your name at the top to display a drop-down menu. Tap Create in the upper-right corner. Select Personal profile . Tap Next . Tap Get Started ."
    },
    {
      "title": "Enter a profile name and tap Continue.",
      "content": "Enter a profile name and tap Continue . This doesn't have to be your real name. Tap Continue when you are done."
    },
    {
      "title": "Add a profile picture and cover photo.",
      "content": "Add a profile picture and cover photo. To do so, tap the camera next to the person icon to upload a profile picture or next to the gray box to upload a cover photo. This page also allows you to change your username, generated automatically based on your profile name. You can adjust your profile name, but it needs to be unique and not used by any other profile."
    },
    {
      "title": "Tap Create Profile.",
      "content": "Tap Create Profile . It's the blue button at the bottom of the page. This will create your new profile. [4] X Research source"
    },
    {
      "title": "Switch between profiles.",
      "content": "Switch between profiles. To switch between Facebook profiles, tap your profile picture in the upper-right or lower-right corner and the icon resembling a bracket pointing down next to your name at the top, then tap the profile you want to edit."
    },
    {
      "title": "Edit your profile.",
      "content": "Edit your profile. Use the following steps to edit your profile: Tap your profile image in the upper-right or lower-right corner. Tap your name at the top. Tap Edit below your cover photo."
    },
    {
      "title": "Add information about yourself.",
      "content": "Add information about yourself. Tap Edit your about info at the bottom of the page, then tap Edit next to one of the categories, or tap the option to add a new item below one of the category headers. Fill out the form and tap Save . You can add your contact information, website, and other social media platforms. You can also add your work history and education history."
    },
    {
      "title": "Log in to your main Facebook account.",
      "content": "Log in to your main Facebook account. . Recently, Facebook has begun allowing you to create multiple profiles in addition to your main profile. You can use this to create different profiles for different parts of your life, such as a work or business profile, or a profile for your hobbies. To do this, you will need to log in to your main account at https://www.facebook.com . Be aware that additional profiles you create are still linked to your main Facebook profile. Other users can find your users can find your main profile and your identity."
    },
    {
      "title": "Create a new profile.",
      "content": "Create a new profile. To create a new blank profile page. Click your profile icon in the upper-right corner. Click See all profiles . Click Create new profile or Page at the bottom. Select Personal profile Click Next . Click Get Started ."
    },
    {
      "title": "Enter a profile name and username.",
      "content": "Enter a profile name and username. You can use your real name or get creative and enter whatever name you want for your username. Your username is a unique name used to identify your new profile, and it will be generated automatically based on your profile name. You can edit your username, but it must be a unique name that no other profile uses."
    },
    {
      "title": "Select a cover photo and profile picture.",
      "content": "Select a cover photo and profile picture. To do so, click Add photo in the boxes labeled \"Cover photo\" or \"Profile picture\" in the column to the left. Then, select a picture you want to use as your cover photo and profile picture."
    },
    {
      "title": "Review the information and click Create Profile.",
      "content": "Review the information and click Create Profile . The information in the column to the left informs you that the privacy settings will be reset to the default, and you can change them once the profile is created. It also informs you that people can still find out your profile is linked to your main profile, so be careful what you post. Click Create Profile at the bottom of the column to the left to continue."
    },
    {
      "title": "Find friends, pages, and groups to join or follow.",
      "content": "Find friends, pages, and groups to join or follow. The next few pages will list friends, pages, and friends for you to follow. Tap Add friend , Join , or Follow next to each person, page, or group to add them. You can also use the search bar at the top. Tap Next on each page when you are ready to continue."
    },
    {
      "title": "Click Finish or Manage Settings.",
      "content": "Click Finish or Manage Settings . If you want to finish creating your new profile and start using it, click Finish at the bottom. If you want to Manage-Facebook-Privacy-Settings|Manage your privacy settings]], click Manage Settings instead."
    },
    {
      "title": "Switch profiles.",
      "content": "Switch profiles. If you want to switch between your main profile and any additional profiles you use, click your profile icon in the upper-right corner and click See all profiles . Then click the profile you want to use."
    },
    {
      "title": "Edit your profile.",
      "content": "Edit your profile. To edit your profile, switch to the profile you want to edit, click your profile icon in the upper-right corner, then click your name. You can click Edit profile and then click Edit your About info or scroll down to where it says \"Intro\" and use this section to add more details to your profile. Bio: Write a brief biography about yourself. Details: Use this page to add information about your work and education history, location, relationship status, gender identity, pronouns, and more. Featured: You can add a featured photo and posts."
    }
  ]
}