{
  "url": "https://www.wikihow.com/Heal-a-Nose-Ring-and-Take-Care-of-Infections",
  "title": "How to Heal a Nose Piercing Faster & Treat Infections",
  "steps": [
    {
      "title": "Touch your piercing as little as possible.",
      "content": "Touch your piercing as little as possible. It’s normal for nose piercing to have a white or yellowish discharge that forms a crusty residue, but avoid picking at it. Leave your piercing alone, and be careful not to catch your piercing on clothes, towels, or sheets. Accidentally moving your piercing can cause pain or prolong your healing time, so try your best to keep it safe. [1] X Research source"
    },
    {
      "title": "Wash your hands with antibacterial soap before touching your piercing.",
      "content": "Wash your hands with antibacterial soap before touching your piercing. Body oils and bacteria on your hands could get inside your piercing if you touch it. Lather antibacterial soap on your hands and rinse it off anytime you touch and handle your piercing. [2] X Expert Source Stephanie Anders Piercing Specialist Expert Interview. 4 December 2019."
    },
    {
      "title": "Clean your piercing twice a day with saline solution.",
      "content": "Clean your piercing twice a day with saline solution . Soak a cotton ball or cotton swab in the saline solution, and hold it against your nose piercing for a few minutes. After cleaning your nose piercing with the saline solution, rinse your nose with fresh, clean water to remove any solution and residue. Gently work your jewelry back and forth to clean the inside of your piercing as well. When you’re finished, pat the piercing dry with a clean paper towel. Try to clean your piercing in the morning and evening to prevent infections and promote faster healing. [3] X Research source Bath towels can harbor bacteria, so avoid using them to dry your piercing site. To make your own saline solution , mix ¼ teaspoon (5.6 g) of sea salt and 1 cup (240 ml) of warm distilled or bottled water. Avoid using a stronger saline solution or washing your nose piercing more frequently because it may dry out the piercing site and prolong your healing time."
    },
    {
      "title": "Leave your jewelry in for the entire time your piercing is healing.",
      "content": "Leave your jewelry in for the entire time your piercing is healing. Once you get your nose pierced , keep the same jewelry in while the piercing heals. Even when your piercing looks healed on the outside, it may still be internally healing, and removing the jewelry could cause skin damage. Refrain from taking out or changing your jewelry until you’re able to tell if your piercing has healed . [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source We’ll cover how long different nose piercings take to heal later in the article, but it may take anywhere from 2–12 months depending on what area you got pierced."
    },
    {
      "title": "Put a clean T-shirt over your pillow when you sleep.",
      "content": "Put a clean T-shirt over your pillow when you sleep. Rather than having to change your pillowcase every night to keep bacteria out of your piercing, slip a fresh T-shirt onto your pillow. The next night, flip the T-shirt over so it has a clean surface. Then, turn the shirt inside-out so you’re able to sleep on it for 2 more nights. [5] X Research source"
    },
    {
      "title": "Keep makeup and lotions away from the piercing site.",
      "content": "Keep makeup and lotions away from the piercing site. Cosmetics like makeup, lotions, or any other harsh soaps can build up inside your piercing and prevent air from circulating around it, which may increase your chances of an infection. If you’re applying cosmetics, keep them away from your nose so you don’t risk them clogging the piercing site. [6] X Research source If you do get any products in the piercing, rinse the piercing with warm salt water or a saline solution."
    },
    {
      "title": "Avoid swimming or submerging your piercing during the healing process.",
      "content": "Avoid swimming or submerging your piercing during the healing process. Water sources like lakes, public or private swimming pools, and hot tubs are all areas that could contain bacteria and may cause an infection. Stay out of these bodies of water in the meantime so your nose piercing heals faster. [7] X Research source Stick to taking showers instead of baths while your piercing is healing so the water runs over the piercing instead of submerging it completely."
    },
    {
      "title": "Watch for swelling, redness, pain, or smelly discharge from your piercing.",
      "content": "Watch for swelling, redness, pain, or smelly discharge from your piercing. If bacteria gets inside of your piercing, then there’s a chance that it may develop into an infection. It’s normal for your piercing to have initial bleeding, swelling around the piercing site, sensitivity, bruising, itchy irritation, and whitish-yellow discharge (which is not pus) when you first get pierced. However, if your symptoms are more severe, then it may be a sign of a more serious problem. Some of the most common signs that your nose piercing is infected are: [8] X Research source Swelling and redness that gets worse around the piercing site Severe burning or throbbing sensations near your piercing Increased tenderness or pain when you touch your piercing Yellow-green or bad-smelling pus discharging from the piercing"
    },
    {
      "title": "Leave your jewelry in your piercing.",
      "content": "Leave your jewelry in your piercing. If you suspect that your piercing is infected, taking out your body jewelry may cause the hole to close and trap the bacteria inside your skin. This can actually prolong your healing time or cause a more severe reaction, so keep your jewelry in. [9] X Research source"
    },
    {
      "title": "Continue washing your piercing with saline solution.",
      "content": "Continue washing your piercing with saline solution. As soon as you notice an infection, maintain your normal cleaning routine with your saline solution to wash out the bacteria. Clean your piercing twice a day and avoid touching it in between cleanings so you don’t cause more irritation or introduce more bacteria. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Avoid using any harsh soaps to treat an infected piercing because they may cause more irritation. Avoid cleaning your piercing more than 2 times per day because it could dry out your skin and prolong the healing process."
    },
    {
      "title": "Take over-the-counter pain medication to reduce pain and swelling.",
      "content": "Take over-the-counter pain medication to reduce pain and swelling. Manage any pain or swelling using non-steroidal anti-inflammatory drugs (NSAIDs), like ibuprofen, aspirin, or acetaminophen. Follow the dosage instructions listed on the package for some relief while your nose piercing continues to heal. [11] X Research source"
    },
    {
      "title": "Apply a cold compress to bring down inflammation.",
      "content": "Apply a cold compress to bring down inflammation. Use an ice pack or a clean washcloth soaked with cold water and hold it against the piercing site for a few minutes at a time. The cool temperatures will help bring down swelling and soothe any discomfort that you’re having from the infection. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Alternatively, a warm saline compress can help promote blood flow to the infected piercing, which can promote quicker healing. [13] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Avoid using chemical cleaners or healing ointments.",
      "content": "Avoid using chemical cleaners or healing ointments. Steer clear from using substances like rubbing alcohol, hydrogen peroxide, Betadine, Hibiclens, Neosporin, petroleum jelly, and any other ointments to treat your nose piercing. These ointments and cleaners can cause more irritation or build up inside your piercing and prevent it from healing properly. [14] X Research source Strong chemicals may also kill off the good cells trying to fight the infection, which can make the piercing take longer to heal."
    },
    {
      "title": "Contact a doctor if your symptoms don’t change or get worse.",
      "content": "Contact a doctor if your symptoms don’t change or get worse. If your infection doesn't clear up or get any better within a week or if you notice that the symptoms get worse, reach out to your doctor and explain your symptoms to them. Dermatologists and general-practice physicians are your best choice; however, if you can't afford to visit a doctor's office or clinic, speaking to the person who did your piercing is your next best choice. [15] X Research source If you notice a bump by your piercing that doesn’t go away, scar tissue may have developed into a keloid. To get rid of a keloid from a piercing, visit a dermatologist to find out the next steps, which may involve corticosteroid injections or surgery to remove it. [16] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "It may take 2–12 months to heal depending on the piercing you received.",
      "content": "It may take 2–12 months to heal depending on the piercing you received. How fast your piercing heals depends on a lot of factors, such as your age, overall health, aftercare, and the thickness of the tissue that you got pierced. [17] X Research source Standard nose piercings and their average healing times are: Nostril: 3–6 months [18] X Research source Septum: 2–3 months [19] X Research source Bridge: 2–4 months [20] X Research source Nasallang: 12 months [21] X Research source Rhino: 6–12 months [22] X Research source"
    }
  ]
}