{
  "url": "https://www.wikihow.com/Is-Sea-of-Thieves-Cross-Platform",
  "title": "How to Use Sea of Thieves Crossplay: All Supported Consoles",
  "steps": [
    {
      "title": "Yes, Sea of Thieves supports crossplay for PS5, Xbox, and PC players.",
      "content": "Yes, Sea of Thieves supports crossplay for PS5, Xbox, and PC players. You'll need either a PlayStation 5 or Xbox console, Microsoft account (PC), or Steam account (PC) to play Sea of Thieves with friends online. If you're playing on a PC without a Steam account, you'll need an Xbox Live account . [1] X Research source"
    },
    {
      "title": "Launch Sea of Thieves.",
      "content": "Launch Sea of Thieves. Sea of Thieves is available for PlayStation 5, Xbox Series X and S, Windows, and Steam. [2] X Research source To use crossplay in Sea of Thieves, you'll just need to add your friends through your platform's menus and invite them to your lobby."
    },
    {
      "title": "Add your friend to your friend list.",
      "content": "Add your friend to your friend list. This will vary depending on the platform. Xbox App on Windows : Open the Xbox app. Select the Friends tab. Enter their gamertag. Right-click the profile and select Open Profile . Select Add Friend . Steam : Open the Steam application. Hover over your username. Click Friends . Click Add a Friend . Enter their 8-digit Steam Friend Code or name. Click Add as Friend . Xbox : Press the Xbox button. Scroll to the People tab. Select Find someone . Enter their gamertag. Select the user. Select Add friend . Select Friend and select Submit . [3] X Research source PlayStation 5 : Press the PS button. Select Game Base . Select the Friends tab. Select Search for players . Enter the online ID. Select the player's profile. Select Add Friend . [4] X Research source"
    },
    {
      "title": "Start a new session.",
      "content": "Start a new session. Select the settings for the session and select Confirm and Assemble Crew ."
    },
    {
      "title": "Select Invite a friend.",
      "content": "Select Invite a friend . A new window will open with your platform's friend list."
    },
    {
      "title": "Select your friend.",
      "content": "Select your friend. An invitation will be sent to them. When they accept, they'll join your lobby."
    }
  ]
}