{
  "url": "https://www.wikihow.com/Grow-Garlic-Indoors-in-a-Pot",
  "title": "Growing Garlic Indoors: Best Containers, Care Instructions & More",
  "steps": [
    {
      "title": "Choose a container that is at least 8 inches (20 cm) deep.",
      "content": "Choose a container that is at least 8 inches (20 cm) deep. The container needs to be deep enough to allow the roots of the garlic to grow into the growing medium so they can produce green leaves and the bulbs can expand. Choose containers that are deep enough and wide enough to fit all of the cloves you want to plant. [1] X Research source Whether you choose to use a flower pot, a wooden crate, or any other type of container to grow your garlic indoors, it needs to be deep enough to allow the roots of the garlic to grow. To plant 3 cloves of garlic, make sure the container is at least 12 inches (30 cm) wide so you can space them out far enough to allow them to grow. Look for containers at garden supply stores, home improvement stores, and online. You can also check out your local craft supply stores to find interesting planting containers."
    },
    {
      "title": "Make sure the container has drainage holes at the bottom.",
      "content": "Make sure the container has drainage holes at the bottom. Check underneath the container to see if there are holes that will allow for drainage. If there aren’t drainage holes, you need to make them so the excess water can run off from the soil and your garlic cloves won’t rot. [2] X Research source Most plastic or terracotta pots and planting containers have drainage holes at the bottom. For plastic containers, use a sharp knife to cut out a drainage hole in the center of the bottom. Drill small holes in glass or clay containers with an electric drill and a bit made for drilling glass and tile."
    },
    {
      "title": "Fill the container with a soil-less potting mix to promote drainage.",
      "content": "Fill the container with a soil-less potting mix to promote drainage. A soil-less potting mix will allow excess water to drain easily and prevent the garlic cloves from rotting. Use a high-quality soil-less potting mix made of vermiculite or perlite and contains coconut fiber or peat so it retains enough moisture to help your garlic grow. Fill the container to within about 2 inches (5.1 cm) of the rim. [3] X Research source Garlic is highly susceptible to fungal root diseases, so you need to plant them in a medium that will allow excess water to drain easily. You can find soil-less potting mixes at garden supply stores, home improvement stores, and online. Make your own soil-less potting mix by using vermiculite or pearlite and mixing in some coconut fibers or peat to help retain moisture."
    },
    {
      "title": "Water the potting mix in the container to help settle it down.",
      "content": "Water the potting mix in the container to help settle it down. Before you plant your garlic cloves in the container, give it a good watering so it can settle down the material and you can make sure the container is draining properly. Use a watering can or fill a glass with about 8 fluid ounces (240 mL) of water and gently pour it over the mixture. [4] X Research source Watch the drainage holes at the bottom to make sure excess water is running through it."
    },
    {
      "title": "Purchase organic garlic bulbs from a gardening store or online.",
      "content": "Purchase organic garlic bulbs from a gardening store or online . Most of the garlic bulbs you see at your local supermarket have been chemically treated so they last longer, and won’t sprout if you try to plant them. Buy your garlic bulbs from a local plant nursery, gardening store, or from an online retailer. [5] X Research source Some grocery stores may sell organically grown garlic bulbs, which may not have been treated, so they’ll sprout if you plant them. Ask your local nursery if they have organically grown garlic bulbs. Look online for organic garlic bulbs that you can have delivered to your home."
    },
    {
      "title": "Break apart the bulb, but keep the husks on the cloves.",
      "content": "Break apart the bulb, but keep the husks on the cloves. Use your hands to break open the bulb of garlic so you can see the individual cloves. Choose the largest cloves to plant because they’ll have the best chance of sprouting. Do not pull or take the individual cloves out of their protective husks. [6] X Research source Separate the cloves 1-2 days before you plant them. They’ll dry out and won’t be able to sprout if you break them apart earlier. The husks keep the garlic itself protected and they won’t sprout if you remove them!"
    },
    {
      "title": "Make holes 2–3 inches (5.1–7.6 cm) deep and 5 inches (13 cm) apart.",
      "content": "Make holes 2–3 inches (5.1–7.6 cm) deep and 5 inches (13 cm) apart. Use your finger or a stick to create a hole for each clove of garlic you plan to plant in the container. Make sure they’re deep enough and are spaced far enough apart to allow the roots to grow unobstructed. [7] X Research source Make the holes wide enough to fit the cloves."
    },
    {
      "title": "Bury the cloves so they’re covered with 1 inch (2.5 cm) of potting mixture.",
      "content": "Bury the cloves so they’re covered with 1 inch (2.5 cm) of potting mixture. Place 1 clove into each of the holes with the flat end facing down. Then cover them with the potting mixture on top so they’re buried in the hole. [8] X Research source Place 1 clove for each of the holes you make. Gently pat the potting mixture on top of the garlic to settle it down."
    },
    {
      "title": "Place the container somewhere that gets 6-8 hours of sun.",
      "content": "Place the container somewhere that gets 6-8 hours of sun. A south or west-facing window that gets lots of sunlight will help your garlic grow and thrive. Set the container on or near a windowsill so it’s exposed to at least 6 hours of sunlight a day. [9] X Research source If you don’t have a sunny window, you can place the container under a fluorescent light to help them grow indoors."
    },
    {
      "title": "Water",
      "content": "Water the garlic until you see the excess run out of the drainage holes. Water the mixture regularly so it settles on top of the garlic cloves and so the cloves themselves are hydrated. The moisture will help the sprouts break through the protective husk of the cloves. Slowly pour water into the container until you see it running out of the drainage holes at the bottom. [10] X Research source Don’t overwater or soak the garlic."
    },
    {
      "title": "Fertilize the garlic every 3 weeks with a liquid fertilizer.",
      "content": "Fertilize the garlic every 3 weeks with a liquid fertilizer. Use a diluted organic fertilizer and add it to the water you give to your garlic plants. Once a month or every 3 weeks is an adequate amount of time in between fertilizing. [11] X Research source Read the instructions on the packaging about how to dilute the fertilizer in water. You can find organic liquid fertilizer at garden supply stores, at department stores, and online."
    },
    {
      "title": "Keep the growing medium damp but not soaked.",
      "content": "Keep the growing medium damp but not soaked. How often you need to water your garlic plants will vary based on the temperature of your home, the amount of sunlight they get, and the humidity in the air. Water your garlic plants regularly, but don’t oversaturate them. Add enough water until you can see the excess drain through the holes at the bottom of the container. [12] X Research source In warm and sunny climates, you may need to water your garlic plants 2-3 times a week to keep them happy."
    },
    {
      "title": "Look for pests on your plants and rodents nibbling on them.",
      "content": "Look for pests on your plants and rodents nibbling on them. Mice can be attracted to the smell of the garlic plants, and may nibble on the green shoots, or even pull them out of the pot, so keep an eye out for bite marks on your plants. Small insects like aphids and mites can also be attracted to your garlic plants and can potentially kill them, so get rid of pests as soon as you see them. [13] X Research source Get rid of mice by trapping them if you find bite marks on your garlic leaves. Make a natural insecticide to get rid of pests on your garlic so they’re still safe to consume when you harvest them."
    },
    {
      "title": "Wait until the greens are about 6 inches (15 cm) tall to harvest them.",
      "content": "Wait until the greens are about 6 inches (15 cm) tall to harvest them. You can eat the garlic greens once they’ve grown tall enough to harvest without damaging the garlic plant. The longer you wait, the healthier the plant will be, and you’ll be able to continuously harvest fresh garlic greens. [14] X Research source For the first 6 months, the garlic plant will keep growing green leaves."
    },
    {
      "title": "Cut the greens with scissors and leave 1 inch (2.5 cm) of growth.",
      "content": "Cut the greens with scissors and leave 1 inch (2.5 cm) of growth. Trim the greens at the base of the plant but leave enough growth so the plant can recover and continue to grow. Cutting the green leaves also allows the garlic plant to put more energy into growing the bulb. [15] X Research source"
    },
    {
      "title": "Chop up the greens and use them as a flavorful garnish.",
      "content": "Chop up the greens and use them as a flavorful garnish. Use a sharp knife to cut the greens into small pieces. You can use them as a seasoning or as a light and tasty garnish on a plate. [16] X Research source Use the fresh greens in soups to add a bit of garlicky goodness! Sprinkle freshly chopped greens on top of a finished dish to add a fresh and sharp flavor."
    },
    {
      "title": "Pull the cloves out of the container after 10 months and let them cure.",
      "content": "Pull the cloves out of the container after 10 months and let them cure. After about 8-10 months, the green leaves will start to brown and die off, which means the garlic cloves are ready to be harvested. Pull the cloves out of the soil and brush off the potting mixture. Then, hang them in a dry location with good air circulation until they’re completely dry. You can then use the garlic however you want! [17] X Research source The cloves can take up to 2 weeks to fully cure, or dry."
    }
  ]
}