{
  "url": "https://www.wikihow.com/Make-a-Cartoon-Movie",
  "title": "How to Make a Cartoon Movie",
  "steps": [
    {
      "title": "Write a plot summary.",
      "content": "Write a plot summary. To help you get a better sense of your story idea, you should write out a rough plot summary or a synopsis of your film. Your plot summary should identify the film’s protagonist, the film’s antagonist, and the goal of the film, or the call to action for your characters. [1] X Expert Source Travis Page Brand & Product Specialist Expert Interview. 27 June 2019. For example, the synopsis of Toy Story is: This 3D animated feature tells the story of a pull-string cowboy doll named Woody, who is the leader of the toys until the latest action figure, astronaut Buzz Lightyear, is added to the toy box. When Woody and Buzz are separated from their owner, they are forced to set aside their differences and work together to defeat a mean kid and return to the boy they both love. [2] X Research source This synopsis is strong because it identifies the protagonists of the film (the cowboy and the astronaut), it identifies their antagonist or conflict (separation from their owner), and it discusses their goal (getting back to their owner by working together)."
    },
    {
      "title": "Write a screenplay",
      "content": "Write a screenplay for your film. Once you have a strong plot summary, you will need to sit down and write out a rough draft of a screenplay for your film. The length of your screenplay will depend on how long you are planning to make your film. Most feature films are 100-120 pages long and are broken into three main acts. If you are planning to write a short film, it may be 40-50 pages long, depending on the desired length of the film. [3] X Expert Source Travis Page Brand & Product Specialist Expert Interview. 27 June 2019. As you write your screenplay, you should keep in mind the goals of your characters and the overall meaning of the film. Many script writers will create an initial flash draft, or first attempt, to get their ideas down and sketch out scenes. They will then go back and revise the script, cutting any drawn-out scenes and adding in any necessary scenes to flesh out the story."
    },
    {
      "title": "Break down each scene into a series of shots.",
      "content": "Break down each scene into a series of shots. It can be overwhelming to try to take a long script and turn it into a film. Make the storyboard process easier by focusing on one scene at a time, breaking down each scene into a series of shots. A shot is when the camera turns on to cover an event or action until it is turned off, so it is considered continuous footage with no cuts. You should evaluate each shot so you know what is required for each shot before you start to make the film. [4] X Research source Consider the location setting for the shot. Is the scene all going to shot in one location or are their multiple locations for the scene? What will be in the shot in terms of setting? You should also think about how many actors are required for the shot and if you need any props in the shot. Because you will be creating an animated film, you should list any props or effects you will need to build during the animation process. Think about the type of shot you are going to use, such as a close-up, an establishing shot, or a wide-shot. You should also think about the angle of the shot, or where the camera is shooting from in the setting. Maybe you will use a high angle shot for a dramatic establishing shot or a low angle shot for a close shot of a character. Consider how the camera is going to move in the shot, will it follow the actor or the props in the shot?"
    },
    {
      "title": "Make a shot list.",
      "content": "Make a shot list. A shot list will help you get a better sense of what is required for each shot and make it easier for you to translate them into separate storyboard panels. Your shot list should cover the major shots for each scene and identify all characters, locations, and props for each shot. Your shot list will likely change or shift as you start to build the film so do not get too attached to it. But you should still create a detailed shot list as a guide as you start to build your film."
    },
    {
      "title": "Create storyboard panels based on your shot list.",
      "content": "Create storyboard panels based on your shot list. Storyboard panels look like boxes on a blank sheet of paper that you can then fill with a drawing of each shot on your shot list. You can buy pads of storyboard panels at your local art store or draw out your own panels. You should have four to six boxes per 8 ½ x 11 piece of white paper, with enough space between each panel so they are easy to read and follow. [5] X Expert Source Travis Page Brand & Product Specialist Expert Interview. 27 June 2019. When drawing storyboards for an animated film, it is important that you try to think in a 3-D perspective. This will give your storyboard drawings more depth and as a result, give the shots in your film more depth. You can create a grid floor on the storyboard panels to help give the drawings more depth and perspective. Try to add in as much detail as possible in your storyboards, especially for major shots or scenes. Use all areas of the panel, including the foreground, background, and mid-ground. If you have more than one character in a shot, try to group them together and label them so they are easy to identify. You should also make sure all your characters are easy to recognize on the storyboard panels, whether it is with a label, a physical marker, or an arrow with their name. This will help you remember which character is in each shot when you sit down to build your film."
    },
    {
      "title": "Use a computer animation program.",
      "content": "Use a computer animation program. There are many computer animation programs you can use online, with prices varying from very inexpensive to more expensive. Many programs do not require extensive knowledge about computer animation and are designed to help beginners learn how to make their own cartoon movies. You can also design your characters and add props to shots with a few clicks of a mouse, making it easy and fast to build your movie. A list of the top seven computer animation programs can be found here: http://www.freemake.com/blog/5-best-sites-to-make-animated-video-trouble-free/ . They are rated based on their accessibility, their price, and their range of options."
    },
    {
      "title": "Design your characters and props.",
      "content": "Design your characters and props. You can use the computer animation program to design each character in your cartoon and any props you may need for your movie. Many programs will provide models that you can edit and add to, adjusting them to fit the look of your characters. Most programs come with a library of props that you can access for your movie. You may also be able to build your own props if it is not a very common or well known prop, i.e. a magic wand or a special sword."
    },
    {
      "title": "Place the characters and props in the settings provided by the computer program.",
      "content": "Place the characters and props in the settings provided by the computer program. Most computer animation programs come with several standard settings that you can use for your movie. Once you have designed your characters and props, you can start to place them in the settings to see how they look. If you are making a movie about a boy wizard in medieval times, for example, you may choose a castle setting or a rural farm setting. You may then place your boy wizard in the setting with props like a magic wand, a sorcerer's hat, and maybe even a fire breathing dragon."
    },
    {
      "title": "Animate the movie based on your storyboards.",
      "content": "Animate the movie based on your storyboards. Use your carefully drawn storyboards as a guide for animating the movie. Focus on creating the movie one scene at a time, moving your characters and props in different settings within the computer animation program. [6] X Expert Source Travis Page Brand & Product Specialist Expert Interview. 27 June 2019. Once you finish animating the rough cut of the movie, you should watch it from beginning to end, noting any scenes that appear underdeveloped or confusing and checking that the pace of the movie is appropriate to the content. If you are making an action packed movie about a boy wizard and his quest to save the world, for example, the pace should be brisk and quick. If you are making a mode meditative film on the death of the family pet, the pace of the movie may be a bit slower and drawn out."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. To do stop motion animation at home, you will need several basic home supplies such as: A laptop or computer that can process video data. A webcam that is detached from your laptop or computer. A flat, stable surface like a desk. Masking tape. Basic animation software."
    },
    {
      "title": "Set up a home movie studio.",
      "content": "Set up a home movie studio. To create the stop motion animation, you will need to capture each frame of the animation so they create a complete animation when you edit them together. To do this, you will draw one frame of the animation, capture it, and then change the animation a little bit, and then capture the next frame. You will do this until you have animated the entire movie. You can use your storyboards as a guide for each animation you will be drawing. Start by attaching a sheet of paper to the table with masking tape all the way around the paper. This will ensure that you place all the sheets of paper in exactly the same position so the animation appears smooth and fluid. Place the webcam on another surface so it is looking down on the paper. Tape the webcam to a surface so it is at the perfect angle. Try taping the webcam to the side of the desk lamp and then positioning the desk lamp so it shines right on the paper. This will ensure your light source and the webcam are always facing the paper. Plug the webcam into your computer so the captured images are uploaded to the animation program on your computer."
    },
    {
      "title": "Draw and capture each scene of the movie.",
      "content": "Draw and capture each scene of the movie. Once you have set up your home movie studio, you can begin to draw and capture your movie. Draw your first picture and capture four identical frames so you have enough video during the editing process. As well, adding extra time at the beginning of the animation will make it look smoother when you play it back and edit it. Add to the existing drawing and capture two more frames. Continue to add to the drawing and capture two frames of every change. If you need to start a new scene or make a big change to the drawing, you can start the drawing on a new sheet of paper. Place the new sheet on top of the first piece of paper and trace around any elements in the first sheet of paper that you are going to use in your next frame. Then, remove the first piece of paper and replace it with the new piece of paper. Continue to add to the drawing or add a new drawing, capturing each change in two frames, until you have completed the movie."
    },
    {
      "title": "Edit the cartoon movie to make a final cut.",
      "content": "Edit the cartoon movie to make a final cut. [7] X Expert Source Travis Page Brand & Product Specialist Expert Interview. 27 June 2019. Once you have put together a rough version of your cartoon film, you should watch it from start to finish. Take notes as you watch it, marking down any scenes that feel too long or unnecessary to the story. You should also make sure there is continuity in every scene of the film, where all the props used are consistent from shot to shot. You may need to reshoot certain shots or scenes by re drawing them or taking an existing drawing and changing it. You should always shoot two frames of your edited drawings so you have enough footage to add into the final draft of the movie."
    }
  ]
}