{
  "url": "https://www.wikihow.com/Play-Bagpipes",
  "title": "How to Play Bagpipes",
  "steps": [
    {
      "title": "Hold the bagpipes with the bass drone over your nondominant shoulder.",
      "content": "Hold the bagpipes with the bass drone over your nondominant shoulder. Loop your left arm underneath the bagpipes and lift it with both hands underneath. Tilt the bass drone, which is the longest pipe on the top of the bag, behind you. Rest it in the pocket where your shoulder blade meets your neck. Keep the bagpipes pinched between your left arm and left side, using the gravity from the tip of your bass drone and your hips to keep the bagpipes still. [1] X Research source You should keep your shoulders as straight as possible when you play the bagpipes. There is no volume control on bagpipes. Keep this in mind before you purchase a set if you live in an apartment or have roommates. [2] X Research source"
    },
    {
      "title": "Inflate the bagpipes by blowing into the blowstick.",
      "content": "Inflate the bagpipes by blowing into the blowstick. The blow-stick is the thin, plastic piece with an opening at the top. It sits next to the bass drone. Blow firmly into the blowstick to fill the bag with air and inflate it. When you blow into the bag, it will naturally stay inflated for 5-25 seconds as air begins to escape out of the drones. You need to repeatedly blow into the blowstick to keep the bag consistently inflated. [3] X Research source There is a valve inside the blowstick that allows air to travel into the bag without letting the air come back out. If you feel air coming out of the blowstick after you blow, you may need a new blowstick."
    },
    {
      "title": "Keep the bag inflated to emit sound from the drones.",
      "content": "Keep the bag inflated to emit sound from the drones. The 3 big pipes that stick out the top of the bagpipes are the drones. There are 2 tenor drones and 1 bass drone. The drones function sort of like pedals on a piano by providing a continuous note that carries as you play. Each drone will naturally produce a humming noise when you play the bagpipes, as air travels through them and out of the top of the drones. [4] X Research source When you hold a set of bagpipes, the bass drone is the large one that rests over your nondominant shoulder. The 2 other pipes are tenor drones. Both tenor drones are tuned to be 1 octave higher than the bass drone. There are small plastic pieces wrapped around the middle of each drone. These are called tuning slides, and are used to adjust the note coming out of a reed. To raise the pitch on a drone’s note, slide it up. To lower the note, slide it down."
    },
    {
      "title": "Hold the chanter with both hands to begin playing.",
      "content": "Hold the chanter with both hands to begin playing. The remaining stick that hangs off of the bagpipes on the opposite side is called the chanter. It is used to play specific notes on the bagpipes as you inflate it. Hold the chanter with your right hand on the bottom half of the chanter and your left hand on top. [5] X Research source Even if you are left-handed, you should still place your right hand on the bottom half. It’s hard to learn the bagpipes with your hands reversed. There are 4 reeds inside the bag. As you play the bagpipes, air blows through the bag, causing the reeds to vibrate and make sound. The drones cause 3 of the reeds to play a continuous note while the chanter controls the fourth reed."
    },
    {
      "title": "Put your fingers over the corresponding notes from top to bottom.",
      "content": "Put your fingers over the corresponding notes from top to bottom. There are 8 holes used to produce 9 notes on a bagpipe. The holes represent the notes high-A, high-G, F, E, D, C, B, and low-A, and are arranged with the highest note at the top of the chanter (high-A) and all subsequent notes going down towards the tip of the chanter. Place your hands with your left hand covering the top 4 notes and your right hand covering the bottom 4. [6] X Research source The ninth note that doesn’t have a hole is low-G. This is played by blowing while covering all of the holes at the same time. The 2 fingers that aren’t used are the right thumb, which wraps around the chanter to hold it steady, and the left pinky, which hangs off of the chanter for balance. Your left thumb covers high-A on the backside of the chanter. Keep your fingers at a 90-degree angle on top of the holes to fully cover each opening."
    },
    {
      "title": "Lift a finger off a note while blowing to play it.",
      "content": "Lift a finger off a note while blowing to play it. To play a specific note, lift the corresponding finger off of the note that it’s covering. For example, your right index finger covers the D hole. Keep all other holes covered while blowing and raise your right index off of the chanter to play a D note. When you raise a finger to play a note, lift it approximately 1–2 inches (2.5–5.1 cm) off of the chanter. [7] X Research source Don’t use the tips of your fingers to cover the holes. Instead, use the thicker pads on fingers that are closer to your palm. This will ensure that each hole is covered completely."
    },
    {
      "title": "Adjust the pitch of a note by controlling your breath.",
      "content": "Adjust the pitch of a note by controlling your breath. If you blow harder while playing a note, you’ll raise the note’s pitch. If you blow softer while playing a note, you’ll lower a note’s pitch. Pitch can also be modified by the amount of pressure that you place on the bag with your arm. Pressing will raise the pitch while releasing the bag will lower it. Put pressure on the side of the bag while you’re blowing lightly to compensate for the change in pressure while you catch your breath. [8] X Research source Mastering the relationship between pressure from your arm and input from the blowstick is essential to maintaining the continuous sound in the drones."
    },
    {
      "title": "Raise multiple fingers to play chords and unnatural notes.",
      "content": "Raise multiple fingers to play chords and unnatural notes. While the bagpipes only have 9 natural notes, their sounds can be manipulated to play chords and unnatural notes by lifting multiple fingers at the same time. Usually, lifting multiple fingers produces a variety on a single note since there’s still only 1 reed in the chanter. To produce chords, sheet music will often require you to place a single high-A or low-G in the middle of a continuous sound to make it seem like a chord is being played (these are called grace notes). [9] X Research source For example, lifting your left thumb, left index, left ring finger and right pinky at the same time plays an A sharp, but if you play a grace note in between, it may sound like multiple notes are being played. If you’re just starting out, don’t worry about learning how to manipulate the chanter to play chords or unnatural notes. Start out with the basics and then build from there."
    },
    {
      "title": "Get a practice chanter to commit notes to memory.",
      "content": "Get a practice chanter to commit notes to memory. Practice chanters are smaller versions of a bagpipe chanter. They are designed to produce sound on their own so that you can practice playing the notes on a bagpipe. Learning on a practice chanter will let you see your fingers on the chanter while blowing, which will make it easier to memorize the movements required to play certain notes. [10] X Research source There are electronic practice chanters that can digitally shut off certain notes or pitches to make practicing easier. To get used to the notes and the sounds that they make, start practicing by playing the notes in order from high-A to low-A."
    },
    {
      "title": "Memorize some simple tunes to practice playing.",
      "content": "Memorize some simple tunes to practice playing. Songs are typically played on bagpipes from memory, since playing the instrument requires using both hands at the same time while they’re underneath the bag. This makes it near-impossible to play the bagpipes while looking at the finger board, reading music, and blowing at the same time. Practice memorizing a song on a practice chanter before trying to play a song. [11] X Research source ”Amazing Grace” is a famous bagpipe song, and a good starting point once you’ve mastered the notes. It is a good song to learn early on because it’s immediately recognizable and doesn’t require any complicated or quick hand movements."
    },
    {
      "title": "Perform the 2-minute trick to practice breath control.",
      "content": "Perform the 2-minute trick to practice breath control. Hold the bag by the bass drone where it meets the bag. With no pressure being placed on the bag by your arm, inflate the bag with the blowstick so that the drones make noise. Try to blow and keep the bag inflated so that it plays the same continuous pitch for 2 minutes. This exercise will help you practice breath control while getting used to the rate at which the bag naturally deflates. [12] X Research source If this is too difficult for you, put corks inside of the tenor drones and chanter so that you’re only blowing a bass note."
    }
  ]
}