{
  "url": "https://www.wikihow.com/Report-Noise-Complaints",
  "title": "How to Report Noise Complaints",
  "steps": [
    {
      "title": "Find out who is responsible for the noise.",
      "content": "Find out who is responsible for the noise. In some situations, it may be blatantly obvious where the noise is coming from. However, it's still worth doing a little detective work to confirm the exact source of the noise. You don't want to accuse the wrong person. Take a walk down the hall and check floors above and below you. If you live in a house, walk to the end of your driveway or down the street a little ways. For example, if you live in an apartment building, you may think that the loud music is coming from your upstairs neighbor's apartment, when in fact it is coming from the apartment next door to your upstairs neighbor."
    },
    {
      "title": "Make a recording of the noise from inside your house, if possible.",
      "content": "Make a recording of the noise from inside your house, if possible. A recording on your smartphone or other electronic device can help the person responsible for the noise understand the disturbance they're causing. Adding a reference sound that can be measured can also help them understand how loud it is. A video is better than an audio recording because they can see the reference sound. For example, you might turn your TV up to a certain volume on the video, or demonstrate how much you have to turn your TV up to drown out the noise. Try to include the date and time in the recording, however possible – especially if it's late at night, when noise can be more disruptive or potentially illegal, depending on local noise ordinances where you live."
    },
    {
      "title": "Talk to other neighbors about the noise.",
      "content": "Talk to other neighbors about the noise. If the person's noise is bothering you, it may also be bothering some of your other neighbors. The person may be more likely to listen to you if several of you have the same complaint. [1] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source For example, if your next-door neighbor plays loud music at night that keeps you up, you might talk to the people who live in any other apartments that also neighbor that apartment. Find out if anybody else has had the same problem. Your purpose in doing this is not to gang up on the person. Rather, you want to be able to show them that the issue is affecting others too – not just you."
    },
    {
      "title": "Approach the person responsible for the noise when things are relatively calm.",
      "content": "Approach the person responsible for the noise when things are relatively calm. While it may be tempting to bang on the person's door and yell at them to quiet down, you'll typically get better results if you wait until things have calmed down and approach the person in a neutral way. If you have a basic understanding of your neighbor's comings and goings, you can probably figure out when some good times to approach them would be. [2] X Research source Try not to approach the person when they are on their way to work or school – they may be running late, or under stress. Either way, they won't be likely to give you a fair hearing. If you're not sure when would be a good time to talk, you might ask them. For example, if you see them in the morning and you know they're going to work, you might say \"Hi, neighbor! I know you're headed out to work. When would be a good time to talk to you about a community-related issue?\""
    },
    {
      "title": "Speak to the noisemaker in a friendly, non-confrontational way.",
      "content": "Speak to the noisemaker in a friendly, non-confrontational way. The person may not be aware that their activities are bothering anyone. If you confront them aggressively, you'll likely put them on the defensive. Instead, treat the situation as a considerate, neighborly thing to do. [3] X Research source For example, you might say \"Hi there, neighbor! Quick favor – would you mind terribly turning your music down at night, or maybe wearing headphones? I go into work early and your music wakes me up.\" If there is a specific reason their noise disturbs you, you can tell them – but you don't have to. It's up to you whether you want to let them know anything about your life or not. It should be enough that they are disturbing you."
    },
    {
      "title": "Send the person a letter if speaking to them face-to-face makes you anxious.",
      "content": "Send the person a letter if speaking to them face-to-face makes you anxious. If you're afraid of face-to-face confrontation, you don't have to talk to the person directly. Simply write them a note and stick it in their door. Explain your problem briefly. You might also let them know when you'll be available if they would like to discuss the situation with you further. [4] X Research source This letter doesn't have to be fancy or formal. For example, you might simply write a note that says: \"Hi neighbor! This is Sally over in Unit 13. I understand you're a DJ – that's awesome! But could you turn down the volume a bit after 10 p.m.? Your bass vibrates my entire apartment and makes it hard to sleep. Thank you so much!\""
    },
    {
      "title": "Give your landlord a call if you need an immediate response.",
      "content": "Give your landlord a call if you need an immediate response. If you live in an apartment building or complex and the noise disturbance occurs during office hours, give management a call. They'll usually have someone go to the apartment and talk to the noisemaker. Since noise problems more typically happen late at night, this may not be an option for you. However, it may still be possible to email your management office, or call and leave a voicemail explaining the situation. They can get to it in the morning when the office is open."
    },
    {
      "title": "Find out who the person is renting from.",
      "content": "Find out who the person is renting from. If the noisemaker lives in an apartment, condominium, or house that is owned by someone else, you can complain to their landlord and try to get the situation resolved. You can typically figure out who this is by looking for the owner in real estate or property records. When you find the owner of the property, contact them and ask if they're currently renting the property. They may have hired a property management company to handle the rental. If so, you would need to talk to them about the noisy neighbor."
    },
    {
      "title": "Write a letter to the landlord about the noisy neighbor.",
      "content": "Write a letter to the landlord about the noisy neighbor. Use formal business letter format and keep your letter brief and professional. Include specific facts, such as the dates and times when the noise has taken place. Then, detail the steps you have taken so far to attempt to remedy the problem. [5] X Research source Let the landlord know what you would like to see happen – essentially, what an ideal resolution to the problem would be from your standpoint."
    },
    {
      "title": "Give the landlord a deadline to address your complaint.",
      "content": "Give the landlord a deadline to address your complaint. Close your letter by setting a date, maybe 2 or 3 weeks from the date the landlord receives the letter. Let the landlord know that you will follow up with them again if the problem continues after that date. [6] X Research source Provide contact information, including a phone number or email address, in case the landlord wants to get in touch with you and discuss the issue further."
    },
    {
      "title": "Finalize your letter and deliver it to the landlord.",
      "content": "Finalize your letter and deliver it to the landlord. Once you've finished your letter, proofread it carefully before you print it. Sign it, then make a copy of the signed letter for your records. Use certified or registered mail with return receipt requested to send the letter, so you'll know when the landlord receives it. [7] X Research source When you get the notice that your letter has been received, put that notice with your copy of the letter. Mark the date of receipt and the date of the deadline on a calendar, or set a reminder on your smartphone."
    },
    {
      "title": "Send another letter if the problem is not resolved.",
      "content": "Send another letter if the problem is not resolved. If the date of your deadline comes and goes and the noise continues, give the landlord one more chance to remedy the situation. With this letter, you can take a somewhat harsher tone than you did in the first letter, although you should still be polite and professional. [8] X Research source Start your letter by reminding the landlord of the letter you previously sent. Then explain that the problem has not gone away, or that it went away briefly and then returned, whichever is applicable to your situation. Provide the landlord with a deadline, just as you did in the first letter. Make a copy of the signed letter for your records and use certified or registered mail so you'll know when they received it."
    },
    {
      "title": "Ask if you can move to a different unit.",
      "content": "Ask if you can move to a different unit. If you and the noisemaker have the same landlord, you may be able to move to a different unit in the same building or complex to get away from the noise. As long as a unit comparable to your own is available, most landlords will allow you to do this without breaking your lease. Even if a comparable unit is available, it may not be feasible for you to move. If that's the case, let your landlord know and they can try to come up with a different option. Maybe they could ask your noisy neighbor to move to the comparable unit."
    },
    {
      "title": "Call the non-emergency number for your local precinct.",
      "content": "Call the non-emergency number for your local precinct. Look up the non-emergency number online and tell the dispatcher that you'd like to make a noise complaint. Give them details about the situation, including your location and the location where the noise is coming from. No matter how loud and disruptive, a noise complaint is never an emergency. Calling the emergency number ties up law enforcement resources unnecessarily, and you could be hit with a fine or even jail time for calling the emergency number."
    },
    {
      "title": "Wait for an officer to come and issue a warning.",
      "content": "Wait for an officer to come and issue a warning. The dispatcher will send any available officer who isn't responding to other calls to issue a warning to your noisy neighbor. They may want to stop by and talk to you as well. In some situations, the officer may come to your location before going to the source of the noise. They may want to verify how loud the noise is where you are to determine whether it violates local noise ordinances."
    },
    {
      "title": "Call again if the noise continues after the warning.",
      "content": "Call again if the noise continues after the warning. If the noisemaker starts up again after the officer leaves, call the police back – again using the non-emergency number. Explain that the noisemaker violated a previous warning and that you want contact from an officer. If the noise is found to be in violation of civil or criminal noise ordinances, your noisy neighbor may be fined. You may have to testify at a court hearing."
    }
  ]
}