{
  "url": "https://www.wikihow.com/Draw-Anime-Wings",
  "title": "How to Draw Anime Wings",
  "steps": [
    {
      "title": "Draw a circle",
      "content": "Draw a circle at a slightly tilted angle to form the face. Add a rectangular shape for the body form."
    },
    {
      "title": "Pencil in the top level of the wings.",
      "content": "Pencil in the top level of the wings. They are leaf shaped and should be placed at angles as shown in the accompanying image. Keep them simple at this point."
    },
    {
      "title": "Draw more lines to create the lower level of the wings.",
      "content": "Draw more lines to create the lower level of the wings ."
    },
    {
      "title": "Create the shapes for the arms.",
      "content": "Create the shapes for the arms. In this drawing, the arms are extended away from the body. To achieve this look, draw three oval shapes within the boundary of the rectangular shape, as shown. Add two drawing guidelines inside of the circle. This denotes the positioning of the eyes on the face, to be added in the next step."
    },
    {
      "title": "Focus on the face and hair.",
      "content": "Focus on the face and hair. Sharpen the facial line by changing the circle guideline into a more pointed, heart base shape. Draw in small ovals for the eyes. Around the face, draw in the lines for the hair as shown, assuming you want long hair for your character. By all means make it shorter if preferred. At the base of the rectangular body form, pencil in the top of the character's legs, using half squares."
    },
    {
      "title": "Begin refining some of the features as follows:",
      "content": "Begin refining some of the features as follows: Add jagged bangs for the hair sitting over the face. Add small nose and mouth features. Draw in fingers as shown. Begin shaping the rectangle into a dress hugging the character's figure."
    },
    {
      "title": "Continue adding in more details:",
      "content": "Continue adding in more details: Draw the nimbus over the head. Refine the wings by drawing in feather tips and rounding the overall wing shape as shown. This part might take a bit of time and erasing and trying again; take it slowly until the desired wing form emerges. Shape the eyes slightly. Continue shaping the dress and include the crossover ribbons at the chest level."
    },
    {
      "title": "Erase all the unnecessary lines.",
      "content": "Erase all the unnecessary lines."
    },
    {
      "title": "Color the drawing.",
      "content": "Color the drawing. While this drawing has used pink and blue colors in the main, you're free to choose any colors you'd like. For the wings, focus on shading in a jagged manner, to try to keep the idea of feathering and lightness. It's also a good idea to match the wing color with the nimbus color, to carry through the idea of radiance and an aura."
    },
    {
      "title": "Try your hand at some other anime wing ideas.",
      "content": "Try your hand at some other anime wing ideas. Once you're comfortable shaping and shading the wings, the possibilities are endless, including rainbow wings, steel wings, soft or hard wings, shiny wings, etc."
    }
  ]
}