{
  "url": "https://www.wikihow.com/Enable-IP-Routing",
  "title": "How to Enable IP Routing",
  "steps": [
    {
      "title": "Start the registry editor, which is a tool that allows you to make changes to Windows programs.",
      "content": "Start the registry editor, which is a tool that allows you to make changes to Windows programs. Open the start menu, and type REGEDT32.EXE into the search box. Hit enter, and select the correct name from the list. You can also click on \"Run,\" and type REGEDT32.EXE to open it."
    },
    {
      "title": "Find the registry key that reads:",
      "content": "Find the registry key that reads: HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Tcpip\\Parameters, and then choose \"Add Value.\""
    },
    {
      "title": "Enter the following values into the corresponding locations in order to enable IP routing through Windows NT:",
      "content": "Enter the following values into the corresponding locations in order to enable IP routing through Windows NT: Value Name: IpEnableRouter Data Type: REG_DWORD Value: 1"
    },
    {
      "title": "Exit the program, and then restart your computer and Windows NT.",
      "content": "Exit the program, and then restart your computer and Windows NT."
    },
    {
      "title": "Start the registry editor.",
      "content": "Start the registry editor. Select the start menu, and enter REGEDIT.EXE into either the \"Run\" program or the search box. The run program will be available for Windows XP operating systems and the search box will be used for Vista and Windows 7 operating systems."
    },
    {
      "title": "Find the sub key that reads:",
      "content": "Find the sub key that reads: HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Tcpip\\Parameters. Scroll down or by use the search option to locate it. Make sure that you select the right one, especially if you haven't backed up your registry recently."
    },
    {
      "title": "Set the registry values into the corresponding section to enable IP routing in Windows XP:",
      "content": "Set the registry values into the corresponding section to enable IP routing in Windows XP: Value Name: IpEnableRouter Value Type: REG_DWORD Value Data: 1. This will enable transmission control protocol and IP forwarding, also called TCP/IP forwarding, for all of the connections installed on your computer. TCP/IP forwarding is essentially the same thing as IP routing."
    },
    {
      "title": "Exit the registry editor to complete IP routing in Windows XP and other Windows operating systems.",
      "content": "Exit the registry editor to complete IP routing in Windows XP and other Windows operating systems."
    },
    {
      "title": "Go to Run type \"services.msc\" without quotes",
      "content": "Go to Run type \"services.msc\" without quotes"
    },
    {
      "title": "Search the service \"Routing and Remote Access\", it will be disable by default.",
      "content": "Search the service \"Routing and Remote Access\" , it will be disable by default."
    },
    {
      "title": "To enable it right click on it and then select properties and change the \"Startup Type\" to",
      "content": "To enable it right click on it and then select properties and change the \"Startup Type\" to \"Manual\" if you want to start it when you require or \"Automatic\" to start it whenever computer boots on else \"Automatic delayed\" if you want it to initiate a little bit later after the other services in your computer are started at boot time."
    },
    {
      "title": "Now apply and press ok",
      "content": "Now apply and press ok"
    },
    {
      "title": "Now right click the Routing and Remote access service and press start and let the progress bar complete.",
      "content": "Now right click the Routing and Remote access service and press start and let the progress bar complete."
    },
    {
      "title": "Now go to run and type \"cmd\" to get command prompt and type \"ipconfig /all\"",
      "content": "Now go to run and type \"cmd\" to get command prompt and type \"ipconfig /all\" . and you should see this line \"IP Routing Enabled. . . . . . . . : Yes\" which will be the third line. This means Routing has been enabled. You can disable by changing the startup type to disabled and check \"ipconfig /all\" to see the status."
    },
    {
      "title": "Note:",
      "content": "Note: The services method was tried in Win 7 Ultimate Other versions may not have that service listed This also works on Windows Server 2012 R2 Datacenter"
    }
  ]
}