{
  "url": "https://www.wikihow.com/Check-if-a-Function-Is-Continuous",
  "title": "How to Check if a Function Is Continuous: Precalculus Review",
  "steps": [
    {
      "title": "Look for a point discontinuity.",
      "content": "Look for a point discontinuity. This is also called a removable discontinuity. Discontinuities indicate that your function is not continuous. Point discontinuities occur when a point on a curve differs from the typical path of the function. [1] X Research source You’ll see a hole in the curve where the point discontinuity is. This usually looks like an unfilled circle. The point will be somewhere above or below the hole. For example, if you have the function f(x) = x, you expect a straight, diagonal line crossing through the origin. However, if there’s a hole in the curve at x = 3, and a point at (3, 10), the function is discontinuous."
    },
    {
      "title": "Check for a jump discontinuity.",
      "content": "Check for a jump discontinuity. This is when the curve suddenly jumps to another disconnected curve. For example, for f(x) = x, let’s say at x = 4, the f(x) = x curve ends with a hole. Then, at x = 4, a second curve of f(x) = x + 5 begins. This second line is disconnected and above the first line."
    },
    {
      "title": "Identify an asymptotic discontinuity.",
      "content": "Identify an asymptotic discontinuity. These discontinuous functions have an asymptote that causes the parts of the function to tend toward an x value without reaching it."
    },
    {
      "title": "Trace the curve left to right.",
      "content": "Trace the curve left to right. As a general rule, a function is discontinuous if you need to pick up your pencil as you trace the curve. The next section will cover how to check continuity using limits."
    },
    {
      "title": "Take the limit of f(x) = f(c) for x approaches c.",
      "content": "Take the limit of f(x) = f(c) for x approaches c. This limit checks both sides of a curve at a point to see if the correct f(c) value is being approached. If f(c) differs from the f(x) value you would expect at c, the function is not continuous. [2] X Research source Where: f(x) is a function f(c) is the function value at x = c c is a given x value"
    },
    {
      "title": "Trace the curve f(x) from a to b.",
      "content": "Trace the curve f(x) from a to b. For an open interval (a, b), check for discontinuity by tracing along the curve, not including a and b. If you needed to pick up your pen during the trace (e.g. for a point discontinuity), the curve is not continuous over the interval. [3] X Research source"
    },
    {
      "title": "Check the limits for a and b.",
      "content": "Check the limits for a and b. For a closed interval [a, b] you’ll need to check two limits. This is to check for holes (discontinuity) at either end of the curve. Take the limit of f(x) = f(a) for x approaches a+ (a from the right). Take the limit of f(x) = f(b) from x approaches b- (b from the left)."
    }
  ]
}