{
  "url": "https://www.wikihow.com/Find-the-Equation-of-a-Perpendicular-Line-Given-an-Equation-and-Point",
  "title": "How to Find the Equation of a Perpendicular Line Given an Equation and Point",
  "steps": [
    {
      "title": "Identify the equation's slope.",
      "content": "Identify the equation's slope. In this guide, the slope would be m in slope-intercept form (y=mx+b). [1] X Expert Source Grace Imson, MA Math Instructor, City College of San Francisco Expert Interview. 1 November 2019. The photo above identifies 2/3 as the slope. The slope does not have to be fraction; it can be a whole number."
    },
    {
      "title": "Change the slope.",
      "content": "Change the slope. To change the slope, you must convert the value into its opposite sign (positive to negative or negative to positive). Plus, it must be put into its reciprocal version. The order in which the conversion is done does not matter. Refer to the example above. 2/3 becomes -2/3. This makes the slope opposite. -2/3 becomes -3/2. This makes the slope both opposite and reciprocal. Thus, the slope has been converted."
    },
    {
      "title": "Write the new equation in slope-intercept form.",
      "content": "Write the new equation in slope-intercept form. Replace the old slope with the new slope. Replace the y-intercept's value with a variable (b)."
    },
    {
      "title": "Plug in the point's x- and y-values.",
      "content": "Plug in the point's x- and y-values. This will make the equation ready to be solved. Solving it will lead to the y-intercept's value being found. [2] X Expert Source Grace Imson, MA Math Instructor, City College of San Francisco Expert Interview. 1 November 2019."
    },
    {
      "title": "Solve the equation.",
      "content": "Solve the equation. Multiply the new slope with the x-value. Then, cancel out the product (make it become 0) with either addition or subtraction. Don't forget to add or subtract the y-value too. In the end, you should get the y-intercept."
    },
    {
      "title": "Write the perpendicular line's equation.",
      "content": "Write the perpendicular line's equation. Still using slope-intercept form, use the new slope and the new y-intercept's value. This is the final answer."
    },
    {
      "title": "(Optional) Check whether or not your answer is correct.",
      "content": "(Optional) Check whether or not your answer is correct. Graph the two equations and measure one of the angles that forms; according to the definition of a perpendicular line, all four angles have to measure 90 degrees. If the lines are horizontal and vertical, then they are perpendicular due to the \"squares\" of the coordinate grid."
    }
  ]
}