{
  "url": "https://www.wikihow.com/Delete-a-Slide-in-PowerPoint",
  "title": "2 Simple Ways to Move or Delete a Slide in PowerPoint",
  "steps": [
    {
      "title": "Open a presentation in PowerPoint.",
      "content": "Open a presentation in PowerPoint. This could be a new or existing project. PowerPoint is available to download on Windows and Mac. You can also use PowerPoint at https://www.office.com/ ."
    },
    {
      "title": "Select the slide(s) you want to delete.",
      "content": "Select the slide(s) you want to delete. If you need to delete only a single slide, click it. To select multiple slides next to each other, click the first slide. Hold Shift , and then click the last side of the sequence. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source To select multiple slides spread out, hold Ctrl and click each slide."
    },
    {
      "title": "Right-click the slide(s) and click Delete Slide.",
      "content": "Right-click the slide(s) and click Delete Slide . This is in the pop-up menu, underneath Duplicate Slide . On Mac, use a control-click . The selected slide(s) will be deleted. You can also press Del or Backspace on your keyboard to delete slides. To undo this action, press Ctrl + Z (Windows) or Cmd + Z (Mac)."
    },
    {
      "title": "Open the PowerPoint app.",
      "content": "Open the PowerPoint app. This looks like an orange pie chart with a P in the front. You must have a Office 365 subscription to use PowerPoint. Make sure you're logged into your Microsoft account. If you don't already have a project open, tap one now."
    },
    {
      "title": "Long-press on a slide.",
      "content": "Long-press on a slide. You'll see the thumbnail pane at the bottom of the screen. A pop-up menu will open."
    },
    {
      "title": "Tap Delete.",
      "content": "Tap Delete . This will delete the slide. If you don't see Delete , tap the right arrow to scroll through more options."
    }
  ]
}