{
  "url": "https://www.wikihow.com/Clean-a-Wedding-Gown",
  "title": "How to Properly Clean and Preserve Your Wedding Dress",
  "steps": [
    {
      "title": "Perform a thorough inspection of your dress.",
      "content": "Perform a thorough inspection of your dress. Look over the dress for any stains, taking into account what the stain consists of. Make sure you have the cleaning supplies you will need. Take a good look at the hemline. Unless you lifted your skirt and carried your train everywhere you went on your wedding day, your train will be dirty. Wedding dress trains are like great big dry mops that clean the floors of churches and reception centers! Inspect the different layers. Wedding dresses can consist of more than one layer of fabric, so it's a good idea to look over each layer for any stains. Inspecting every element of your dress will help you recognize what needs to be cleaned so you can plan accordingly."
    },
    {
      "title": "Test the spot cleaner.",
      "content": "Test the spot cleaner. Use a heavy stain remover (e.g., Stain RX) as soon as possible, but before you use it on your wedding gown, be sure to test it on a small area to ensure it doesn't ruin the fabric. Pick out a spot that is not noticeable and test it on that area. [1] X Research source"
    },
    {
      "title": "Separate your layers with a paper towel.",
      "content": "Separate your layers with a paper towel. While cleaning a stain on one layer, place a piece of paper towel underneath so the stain doesn't transfer to that layer. The paper towel should absorb the stain so it doesn't transfer onto another part of your dress. [2] X Research source"
    },
    {
      "title": "Pat the stain out with the stain remover.",
      "content": "Pat the stain out with the stain remover. Don't rub the stain remover into the dress because your dress is fragile and may tear. Instead, apply the stain remover then use a wet towel to gently push away from the stain. Apply this method to the edges of the stain. [3] X Research source"
    },
    {
      "title": "Dry your dress.",
      "content": "Dry your dress. Use a hair dryer to dry the water off the dress. Leaving it to air dry may create water rings in the dress."
    },
    {
      "title": "Soak the dirty hem in a bathtub.",
      "content": "Soak the dirty hem in a bathtub. Keep the body of the dress out of the water while following this step. Make sure the bathtub is clean and use warm, sudsy water to soak your hem for a couple of hours. Working your way around the dress, use a toothbrush and the liquid detergent to \"massage\" the hemline clean. Be careful not to scrub too vigorously on lace or trims, and clean the underside of the hem and dress lining, as well. Rinse the hem thoroughly when you are finished cleaning it."
    },
    {
      "title": "Clean the bodice.",
      "content": "Clean the bodice. Turn the dress bodice inside out, and spray the lining of the bodice area (the part that fits on your upper body) with a dish soap and water solution. Use the toothbrush and the detergent to clean perspiration stains that may appear in the underarm area."
    },
    {
      "title": "Clean the separate layers.",
      "content": "Clean the separate layers. If your dress has many layers of lining in the skirt, be sure to look over all of them and clean all the stains you find with a spot-cleaner. This is where inspecting every area of the dress comes in handy."
    },
    {
      "title": "Spot clean the outer layer.",
      "content": "Spot clean the outer layer. Spray any stains on the outside of your dress with your spray solution using the toothbrush if necessary. Be very gentle and carefully blot the fabric. Be particularly careful of laces and trims."
    },
    {
      "title": "Try a stronger stain remover.",
      "content": "Try a stronger stain remover. If soap and water do not remove the stains, mix up a solution of a stain remover, such as OxyClean®, and water. Place the stained area in the solution to soak until the stain disappears. Do not use chlorine bleach, such as Clorox, as it leaves a film that is very difficult to remove."
    },
    {
      "title": "Rinse your dress.",
      "content": "Rinse your dress. When you are satisfied with the cleaning of your dress, fill the bathtub with warm water and place the whole dress carefully in the tub. Swish the dress around in the water as soaps from the cleaning process are rinsed out. Let the water drain and then fill the tub again and repeat the process. Follow this procedure several times until the water is very clear without any soap bubbles. It is critical to get all soap and cleaning solutions rinsed out of the dress to avoid potential damage from chemicals."
    },
    {
      "title": "Dry your gown.",
      "content": "Dry your gown. The dress should be \"line\" dried, but not by hanging it on a hanger because the weight of the wet dress could damage it. Line dry it safely by placing a fold-up drying rack (vinyl coated) in the bathtub and hanging the dress over it. Place the dress so the weight is equally distributed over the rack. You can also place a clean towel over a shower enclosure, and then place the dress over the towel. If you do this, be sure to place some towels on the floor underneath the dripping dress to protect the floor. Do not place the dress on bare wood."
    },
    {
      "title": "Hang your dress after it's dry.",
      "content": "Hang your dress after it's dry. After the dress has dried for several hours and the bulk of the water has dripped away, it may be possible to hang the dress to finish drying it. Carefully spread any layers of tulle in the skirt or lining and smooth out all wrinkles in the dress as much as possible. This will make the pressing process easier."
    },
    {
      "title": "Protect your work area.",
      "content": "Protect your work area. Spread a clean sheet on the floor of your working area to protect the dress as you press it. It is best if you use a clean press cloth of white cotton sheeting or muslin unless you are using a brand new or freshly cleaned iron."
    },
    {
      "title": "Press it.",
      "content": "Press it. Start at the back and bottom of the train until you feel comfortable with the pressing. Take your time and use caution. When it is finished you are ready to preserve your gown. We recommend that you first wash and dry your ironing board cover to remove any dirt, starch, or sizing. Where possible, press the dress from the inside. If you have a thick, cushy, ironing board cover, the sequins and beads can press into it. Start at a low temperature, and increase it gradually. If it starts to stick, reduce the heat immediately."
    },
    {
      "title": "Store your dress.",
      "content": "Store your dress. Loosely fold your wedding gown before storing it, and store it away from sunlight because direct sunlight will cause it to yellow. Protect it from light in an acid-free chest covering it in acid-free tissue paper. Don't store the dress in plastic or hang it up."
    },
    {
      "title": "Store the box.",
      "content": "Store the box. Put your box in your closet or under your bed away from the light and far from any areas with mold or mildew. Now you can take it out and admire it whenever you want to look back on your wedding day. [4] X Research source"
    }
  ]
}