{
  "url": "https://www.wikihow.com/Check-Telus-Voicemail-from-Another-Phone",
  "title": "How to Check Telus Voicemail from Another Phone",
  "steps": [
    {
      "title": "If you're checking your voicemail from a smartphone, follow these steps.",
      "content": "If you're checking your voicemail from a smartphone, follow these steps. Dial 1 + your ten-digit phone number. Press Send. You may be prompted to enter your password. From there, follow the voice commands."
    },
    {
      "title": "If you are checking your voicemail from a landline, the steps are a little different:",
      "content": "If you are checking your voicemail from a landline, the steps are a little different: Dial your ten-digit phone number. If you are calling from a long distance, enter 1 before your phone number. Press * to interrupt the greeting. Enter your password. From there, follow the voice commands."
    },
    {
      "title": "Once you’ve accessed your mailbox, you can start listening to your voicemail.",
      "content": "Once you’ve accessed your mailbox, you can start listening to your voicemail. [1] X Research source In the menu, use your keypad to navigate your options: Press 1 to listen to your messages. Press 2 to send a message. Press 3 to access your voicemail’s pre-recorded Greetings. You can record a personal greeting, initial an extended absence greeting, and manage your current greetings. Press 4 to access Personal Options. These include Group Lists, Pager Notifications, the ability to change your password, your voicemail’s language, and your recorded name. Press 1 or 9 to recover deleted and expired messages. Exit your voicemail by pressing **."
    },
    {
      "title": "Once you’ve selected a message to listen to, you can do a couple of things while listening.",
      "content": "Once you’ve selected a message to listen to, you can do a couple of things while listening. [2] X Research source Use this key to navigate your message. Press 1 to rewind a message for 10 seconds. Press 2 to pause or resume the message. Press 3 to fast forward 10 seconds. Press 5 to hear the message time and date. Press 7 to delete the message. Press 9 to save the message. Press the # symbol to keep the message as new. Press the * symbol to return to the main menu."
    },
    {
      "title": "If you’ve finished listening to a message, you have a couple of choices.",
      "content": "If you’ve finished listening to a message, you have a couple of choices. [3] X Research source Press 1 to replay the message. Press 5 to hear the message’s time and date. Press 6 to forward a copy of the message. Press 7 to delete the message. Press 9 to save the message. Press the # symbol to keep the message as new. Press the * symbol to return to the main menu."
    }
  ]
}