{
  "url": "https://www.wikihow.com/Create-a-Microsoft-Account",
  "title": "How to Create a Microsoft Account",
  "steps": [
    {
      "title": "Access the Microsoft sign-up page.",
      "content": "Access the Microsoft sign-up page. Open any your web browser on your computer, and type “signup.live.com” on the address bar. You will be redirected to the Microsoft sign-up page."
    },
    {
      "title": "Click on “Sign up now.”",
      "content": "Click on “Sign up now.” This will be on the right of the sign-up page. You will be redirected to the form where you fill in the details for the account."
    },
    {
      "title": "Enter your full name and then select a username.",
      "content": "Enter your full name and then select a username. First, it will ask for your first and last name, and then for a username. If you have a Gmail or Yahoo account, you can use that as a username for the Microsoft sign-in."
    },
    {
      "title": "Create a password next.",
      "content": "Create a password next. Make sure your Microsoft account password is at least 8 characters long and contains at least two of the following: uppercase letters, lowercase letters, numbers, and symbols. Reenter the password for confirmation when you’re done."
    },
    {
      "title": "Enter your country, birthdate, and gender last.",
      "content": "Enter your country, birthdate, and gender last. The fields for these three pieces of information are drop-down options. Just click the down arrow to the right of the text boxes and select the country, date, and gender."
    },
    {
      "title": "Verify the information given.",
      "content": "Verify the information given. Select your country code from the drop-down option below Gender and enter your phone number in the box below that. You will receive a text verification code or an audio call to verify that you’re a real person and not a bot. Check out the characters you see in the box below the phone number. This is a Captcha. Enter it in the “Enter the characters you see” field. This is also to ensure that you are a real person."
    },
    {
      "title": "Click “Create Account” at the bottom.",
      "content": "Click “Create Account” at the bottom. You have just set up your Microsoft account, but before you can use Microsoft services, you must verify the email address (username) you entered. Open the email sent to the email address you registered as username and click the link given to confirm. Your account has been created and verified. You can now use Microsoft services with the account."
    },
    {
      "title": "Visit OneDrive.",
      "content": "Visit OneDrive. OneDrive is the cloud service of Microsoft, which you can access on your mobile device or on the PC. Each OneDrive user has 15GB free of cloud storage, so if you want to use OneDrive to store your files, you will need a Microsoft account first. Open a new web browser tab or window and type “onedrive.live.com” on the address bar. Hit Enter and you will be taken to the OneDrive website."
    },
    {
      "title": "Begin creating a Microsoft account.",
      "content": "Begin creating a Microsoft account. Click “Sign up” at the top right of the page, and on the pop-up that appears, select “Create a Microsoft account.” You will be redirected to the Create an Account page of Microsoft."
    },
    {
      "title": "Enter your full name and then select a username.",
      "content": "Enter your full name and then select a username. The first two lines of the sign-up form will ask for your first and last name, and then for a username. Enter them there. If you have a Gmail or Yahoo account, you can use that as a username for the Microsoft sign-in."
    },
    {
      "title": "Create a password.",
      "content": "Create a password. Make sure your Microsoft account password is at least 8 characters long and contains at least two of the following: uppercase letters, lowercase letters, numbers, and symbols. Reenter the password for confirmation when you’re done."
    },
    {
      "title": "Enter your country, birthdate, and gender last.",
      "content": "Enter your country, birthdate, and gender last. The fields for these three pieces of information are drop-down options. Just click the down arrow to the right of the text boxes and select the country, date, and gender."
    },
    {
      "title": "Verify the information given.",
      "content": "Verify the information given. Select your country code from the drop-down option below Gender and enter your phone number in the box below that. You will receive a text verification code or an audio call to verify that you’re a real person and not a bot. Check out the characters you see in the box below the phone number. This is a Captcha. Enter it in the “Enter the characters you see” field. This is also to ensure that you are a real person."
    },
    {
      "title": "Click “Create Account” at the bottom.",
      "content": "Click “Create Account” at the bottom. You have just set up your Microsoft account, but before you can use Microsoft services, you must verify the email address (username) you entered. Open the email sent to the email address you registered as username and click the link given to confirm. Your account has been created and verified. You can now use Microsoft services with the account."
    },
    {
      "title": "Access Xbox.",
      "content": "Access Xbox. Scroll down the home screen of your Windows phone until you find the green Xbox tile. Tap it to open the Xbox Game screen."
    },
    {
      "title": "Swipe the screen to the left.",
      "content": "Swipe the screen to the left. You will be shown two options: “Join Xbox or sign in” and “Can’t see your Xbox account?”"
    },
    {
      "title": "Begin creating an account.",
      "content": "Begin creating an account. Tap “Join Xbox or sign in,” and you will then be informed that you will need a Microsoft account to sign in. Tap “Sign in” at the bottom of the message. The next message will ask you to sign in or create an account. Tap “Create one” to proceed."
    },
    {
      "title": "Enter a Microsoft email address you want.",
      "content": "Enter a Microsoft email address you want. The next screen will have one text field where you should enter the email address you want for your Microsoft account. The address will be like this: example@live.com, where you replace “example” with whatever you want for your email address. When you’re done, tap “Next” at the bottom to continue."
    },
    {
      "title": "Create a password.",
      "content": "Create a password. In the first field of the next screen, enter a password. Note that the password is case-sensitive. Reenter the password in the second field to verify, and tap “Next” at the bottom to proceed."
    },
    {
      "title": "Enter an alternate email address.",
      "content": "Enter an alternate email address. Do this in the field at the top of the new screen. This alternate email address will be used for recovery purposes, in the event you forget your Microsoft account password."
    },
    {
      "title": "Add your birthdate.",
      "content": "Add your birthdate. Do this by tapping “Choose date” below the alternate email address field, and then entering the month, day, and year. When you’re done, tap the checkmark at the bottom."
    },
    {
      "title": "Enter your postal code.",
      "content": "Enter your postal code. The last box on the screen is for your postal code. Tap it and enter your postal code. When you’re done, tap “Next” to proceed. The Windows phone will now begin creating your Microsoft account."
    },
    {
      "title": "Back up your Windows phone.",
      "content": "Back up your Windows phone. As an option, you will be asked if you want to back up the data of your Windows phone onto your Microsoft account. Tap “Yes” if you want to back up your phone, or “Not now.” You have just created a Microsoft account on your Windows phone. Continue with the setup on your phone’s screen to set up a Gamertag for Xbox games, if you want."
    }
  ]
}