{
  "url": "https://www.wikihow.com/Make-Olive-Juice",
  "title": "How to Make Olive Juice",
  "steps": [
    {
      "title": "Select a jar of brine-cured or lye-cured olives.",
      "content": "Select a jar of brine-cured or lye-cured olives. Cured olives work best because they are relatively easy to come by and can be preserved longer than fresh olives. Water-cured olives can be used if you want a fresher flavor, but these olives tend to be considerably bitterer and do not last quite as long as brine-cured olives. You could use fresh olives during harvest season, which falls out around late September through mid November, but fresh olives have a very bitter taste that may make the juice less palatable. Dried olives should be avoided, since they do not contain enough juice to extract. Use whole or pitted olives. Avoid olives that are stuffed with other ingredients."
    },
    {
      "title": "Wash the olives to remove the brine.",
      "content": "Wash the olives to remove the brine. Clean the olives under running water to rinse off any brine or dirt that may be on the surface. Even though you will end up placing the olives in a salty, brine-like solution later on, it is important that you wash off any old brine to avoid contaminating the solution you use with additional salt."
    },
    {
      "title": "Pierce each olive with a toothpick or needle.",
      "content": "Pierce each olive with a toothpick or needle. Make two or three small holes in each olive. Piercing the olive allows the juices inside to soak into the liquid you will eventually sit your olives in. Crushing the olives beforehand may release too much of the juice too early, causing you to lose it. If you do not pierce the olives, however, the juice may struggle to break through the skin and reach the liquid."
    },
    {
      "title": "Place each pierced olive into a glass jar.",
      "content": "Place each pierced olive into a glass jar. The olives should fill the jar about halfway."
    },
    {
      "title": "Mix water, salt, and vinegar in a separate bowl.",
      "content": "Mix water, salt, and vinegar in a separate bowl. Blend the ingredients together with a spoon. The liquid should have a murky appearance. If it still seems clear, you may need to add another 1 teaspoon (4.8 grams) of salt."
    },
    {
      "title": "Pour the liquid solution into the glass jar.",
      "content": "Pour the liquid solution into the glass jar. Do not fill the jar to the top. Instead, leave about 4 inches (10 centimeters) of empty space in between the surface of the water and the brim of the jar."
    },
    {
      "title": "Add the twig of peppermint to the jar.",
      "content": "Add the twig of peppermint to the jar. Push it down so that it sits beneath the surface of the water. This step is only optional, but peppermint does add a dimension of freshness to the olive juice."
    },
    {
      "title": "Seal and shake the jar.",
      "content": "Seal and shake the jar. Make sure that the lid is securely held in place and will not loosen or come undone accidentally. Then, give the jar a vigorous shake to loosen the juice inside the olives and mix it with the other ingredients."
    },
    {
      "title": "Place the jar of olives in the refrigerator.",
      "content": "Place the jar of olives in the refrigerator. The juice needs time to blend into the water and other ingredients. Leave the olives inside the refrigerator for a minimum of 30 minutes or overnight."
    },
    {
      "title": "Shake the jar once you pull it out of the refrigerator.",
      "content": "Shake the jar once you pull it out of the refrigerator. Shaking it again gives the ingredients one last time to mix together."
    },
    {
      "title": "Pour the liquid into a second, smaller glass jar.",
      "content": "Pour the liquid into a second, smaller glass jar. Strain out the olives and the sprig of mint. Set the olives on a glass or plastic cutting board and discard the mint."
    },
    {
      "title": "Crush the olives.",
      "content": "Crush the olives. Use the bottom of your larger, now empty glass jar. Press the bottom of the jar over each olive, crushing the olive and releasing additional juice. Note that it is also important to use a plastic or glass cutting board. If you crush the olives on a wooden board, some of the juice may end up getting absorbed into the wood. You may also find it helpful to use a plate or bowl. Many cutting boards do not have lips, so some of the juices could run off. If you crush the olives inside a bowl, however, the juices will remain."
    },
    {
      "title": "Drain the pressed juice into the olive juice mixture.",
      "content": "Drain the pressed juice into the olive juice mixture. You may need to strain the juice out by scraping or dumping your pile of crushed olives into a strainer."
    },
    {
      "title": "Seal and shake the jar of juice.",
      "content": "Seal and shake the jar of juice. Give the jar a vigorous shake to combine the new juice you added to the existing juice solution."
    },
    {
      "title": "Store your olive juice in the refrigerator until ready to use.",
      "content": "Store your olive juice in the refrigerator until ready to use. Shake the jar before each use to make sure that none of the ingredients have settled or separated."
    }
  ]
}