{
  "url": "https://www.wikihow.com/Get-Acrylic-Paint-Out-of-Jeans",
  "title": "How to Get Acrylic Paint Out of Jeans",
  "steps": [
    {
      "title": "Scoop up any excess paint with a table knife or other tool.",
      "content": "Scoop up any excess paint with a table knife or other tool. Try to get as much paint off the jeans as you can. If you have a huge dollop, run a table knife or other smooth tool over the area to pull the extra paint off. [1] X Research source"
    },
    {
      "title": "Use running water to get the wet paint out.",
      "content": "Use running water to get the wet paint out. Turn your jeans inside out so the stain is on the inside. [2] X Research source Hold your jeans up to the faucet and let the water run through the fabric. This should clean out the majority of the wet paint. Use your fingers to rub at the paint while flushing it with warm water. [3] X Research source You can also flush the spot with warm water using a sponge if you can't place the spot under running water. Get it very wet with water and sponge at the stain. However, flushing it under running will get out more of the paint."
    },
    {
      "title": "Blot at the stain with a mixture of warm water and dishwashing soap.",
      "content": "Blot at the stain with a mixture of warm water and dishwashing soap. Pour an equal amount of warm water and dishwashing soap into a cup. Stir the soap in and then dip an old rag in it. Rub it into the stain, dipping the rag into the water again as the stain absorbs it. [4] X Research source"
    },
    {
      "title": "Flush the stain and wash the jeans as you normally would.",
      "content": "Flush the stain and wash the jeans as you normally would. Place the area under running water to rinse out the paint and the soap. If there's still a stain, try the method again or pick another technique. If the paint is gone, throw your jeans in the wash for a normal cycle. [5] X Research source"
    },
    {
      "title": "Scratch across the paint with a butter knife.",
      "content": "Scratch across the paint with a butter knife. Scrape it back and forth over the stain to work off the excess paint. Don't gouge the fabric, though, as that could lead to a divot or hole in your jeans. [6] X Research source"
    },
    {
      "title": "Wash the area off with water.",
      "content": "Wash the area off with water. Turn the jeans inside out and hold them under warm running water. This may not do much if the paint is dried, but it can loosen some chunks that aren't well adhered to the surface. [7] X Research source"
    },
    {
      "title": "Scrub the stain with rubbing alcohol.",
      "content": "Scrub the stain with rubbing alcohol. Flip the jeans right-side out. Dampen a toothbrush, clean rag, or cotton ball in rubbing alcohol, then rub it across the dried paint. Keep scrubbing back and forth, dipping into the rubbing alcohol as needed. [8] X Research source If you're using a toothbrush, wipe it off with rubbing alcohol and a paper towel when it gets covered with paint. If you're using rags or cotton balls, just switch to a new one."
    },
    {
      "title": "Rinse the stain and put your jeans in the wash.",
      "content": "Rinse the stain and put your jeans in the wash. Turn the jeans inside-out again. Hold the area under running water until all the paint is gone. If you still see a little stain, try adding detergent to the area to pretreat it before putting it in the wash. Run a small load for your jeans. [9] X Research source Always wash stained clothing by itself to make sure the paint doesn't get on anything else."
    },
    {
      "title": "Scrape off the excess dried paint with a butter knife.",
      "content": "Scrape off the excess dried paint with a butter knife. Rub the edge of the butter knife over the paint. As you do, any extra paint should flake off. Throw the flakes away as they come off, but don't rub too hard, as you could damage the fabric. [10] X Research source"
    },
    {
      "title": "Flip your jeans inside out so that the paint is on the inside.",
      "content": "Flip your jeans inside out so that the paint is on the inside. That way, you can flush the stain out from the back. Don't try to rinse the stain out with water now, as that will just dilute the paint remover. [11] X Research source You may want to put on gloves at this point to protect your hands."
    },
    {
      "title": "Put some paper towels underneath the stain to catch the excess fluid.",
      "content": "Put some paper towels underneath the stain to catch the excess fluid. You can also use old rags you don't mind throwing away. Either way, you need something behind the stain so paint remover and paint don't go everywhere. [12] X Research source"
    },
    {
      "title": "Blot at the stain with turpentine or paint thinner.",
      "content": "Blot at the stain with turpentine or paint thinner. Pour the chemical into a throwaway container, such as a yogurt container or an old can. Dip cotton balls or an old rag in the solution and dab at the back of the stain. [13] X Research source If you're getting paint on your rag or the towels underneath, move the rag or towels around so you're working with a clean area. You can also switch out cotton balls or paper towels if you need to."
    },
    {
      "title": "Scrub the area with a toothbrush if the stain doesn't want to come out.",
      "content": "Scrub the area with a toothbrush if the stain doesn't want to come out. [14] X Research source Pour some of the chemical right on the stain, making sure you have a good padding of paper towels behind the stain. Rub the brush back and forth over the stain on both sides, using a circular motion. [15] X Research source If your brush becomes too caked with paint, use some of the removal agent and an old rag or paper towel to clean it off."
    },
    {
      "title": "Soak up the chemical with paper towels.",
      "content": "Soak up the chemical with paper towels. Put new paper towels behind the stain. Dab at the stain to pick up as much of the chemical as you can. Change out your paper towels if they become too soaked with the chemical to pick up any more. [16] X Research source"
    },
    {
      "title": "Wash your jeans as you normally would.",
      "content": "Wash your jeans as you normally would. Once the paint is gone, scrub the area with a little laundry detergent. Then, throw your jeans in the washing machine and run them through a cycle before drying them. [17] X Research source Alternatively, you can take it to a professional and get it cleaned with an oil-based stain remover known as POG, which is for cleaning paint, oil, and grease. [18] X Expert Source Robert Shapiro Laundry Specialist Expert Interview. 24 August 2021."
    }
  ]
}