{
  "url": "https://www.wikihow.com/Fix-a-Leaky-Washer",
  "title": "How to Fix a Leaky Washer",
  "steps": [
    {
      "title": "Make sure your washing machine is on a level surface.",
      "content": "Make sure your washing machine is on a level surface. To determine where the washer is leaking, you'll need to look at where the water is pooling and try to figure out where it's coming out of the machine. If the washing machine is not level, the water will run and it will be more difficult to know where the leak is occurring. [1] X Research source"
    },
    {
      "title": "Check for common quick fixes.",
      "content": "Check for common quick fixes. Before you decide to replace hoses and gaskets, determine whether the leak is stemming from an issue that can be corrected more easily. Check the machine manufacturer's instructions to make sure you're using it properly. Here are a few common easily fixable problems: [2] X Research source An overloaded or unbalanced washer. If you're trying to load up the washer with too many clothes, that can cause water to leak out. Leaking issues can also happen if the washer has been loaded so that heavier clothes are on one side, causing an imbalance that shakes the washer during the spin cycle. A tendency to interrupt the rinse cycle to add more time. If your rinse cycle has a spray rinse function, adding more time while it's spraying can cause the spray to go on for longer than it's supposed to, leading to leakage. Make sure the manufacturer's drain plug is removed. If your washing machine is brand new, it comes with a drain plug that needs to be removed before you hook up the drain hose. If you run the cycle without removing the plug the washer won't drain properly. Make sure the drain hose is properly secured in the drainpipe. If it's not attached properly, that could be the source of the leak. Make sure the drain isn't clogged. It might seem like the washer is leaking when in reality your drain is backed up. Make sure it's clear before trying to do repairs."
    },
    {
      "title": "See if oversudsing could be the problem.",
      "content": "See if oversudsing could be the problem. When the soap you put in your washer produces too many suds, it can cause overflow problems and lead to leaks. This is a common issue in households with water softeners, which make soap suds up more easily. If you have a water softener, you don't need to use as much soap to get the job done. [3] X Research source To see if oversudsing is the issue, do a load of laundry as you normally would. When you take the load out of the washer, put an article of clothing in a bowl of water and swish it around a bit. If the water gets sudsy, your clothes still have soap in them, and you're probably using too much soap."
    },
    {
      "title": "Run a cycle and watch where the water leaks.",
      "content": "Run a cycle and watch where the water leaks. Do a load of laundry the same way you normally would and check to see where the washing machine seems to be dripping. Often you can find out what the problem is just by looking for the spot where the water leaks from the machine. [4] X Research source Leaks at the front of the washer are often caused by a clogged overflow tube or an improperly-fitted old seal (in a front-loading washer). Leaks at the back of the washer are often caused by loose or damaged supply hoses. Leaks under the washer are often caused by a hole in the water pump or leaky internal hoses."
    },
    {
      "title": "Methodically replace the most common leaky parts.",
      "content": "Methodically replace the most common leaky parts. If you can't pin down the exact cause of the leak, and you have an older washing machine, replacing or repairing the hoses and fixing the other most likely culprits is your best bet. Over time washing machine parts can get clogged or lose elasticity, leading to leaks. They'll need to be replaced eventually, so you might as well do it now and try to catch the leak! [5] X Research source If you don't want to make all the repairs at once, start with the first most common repair, run your machine to see if it still leaks, and make the next repair on the list. Keep doing this until you've fixed the leaky part. If after making all the common repairs your washing machine still leaks, call your machine manufacturer to see if they can help you assess the problem. It might be time to bite the bullet and call a washing machine repair person to come over and finish the job."
    },
    {
      "title": "Turn off the power supply.",
      "content": "Turn off the power supply. Make sure your washing machine's power supply is off before you try to make any repairs. Making repairs while the power supply is on could cause injury."
    },
    {
      "title": "Check and repair the supply hoses.",
      "content": "Check and repair the supply hoses. These are located at the back of the machine, and they feed water into the machine during the wash cycle. Old or damaged supply hoses are a common cause of leaks located at the back of the machine. If you have a supply hose leak, the leak will continuously drip throughout the wash cycle. Here's how to repair water supply hoses: [6] X Research source Turn off the water main or shutoff valve. Unscrew the supply hoses with pliers. Examine the hoses. If they look old and corroded, replace the hoses with no-burst hoses and new washers. [7] X Research source If the hoses are still in good shape, replace the internal washers. Old washers lose elasticity and don't fit as tightly. Make sure all of the connections are tight and secure before using the washer again."
    },
    {
      "title": "Check and repair the internal hoses.",
      "content": "Check and repair the internal hoses. The hoses inside the machine can also get corroded and worn out, and they need to be replaced from time to time. To access the internal hoses, you'll need to open the washing machine's cabinet or the panel behind which the hoses lie by unscrewing the bolts. Look for old, corroded or ripped hoses and rusty hose clamps. To remove a hose, use pliers to squeeze the hose clamp and slide it down the hose, then remove the hose. Replace the old hoses and hose clamps with new parts. [8] X Research source"
    },
    {
      "title": "Determine if the pump is leaky.",
      "content": "Determine if the pump is leaky. The pump moves the water from the tub of the washing machine to the drain. It's made with internal seals that can get worn out over time, leading to leaks. [9] X Research source If you see signs that the pump is leaking - evidence of staining or rust - it will need to be replaced. [10] X Research source By the correct replacement pump for your machine. Open your washing machine's cabinet. Loosen the motor mounting bolts. Disconnect the pump hoses and unscrew it, then remove it from the machine. Replace it with the new pump. For detailed instructions on replacing a washing machine pump, see How to Replace a Washing Machine Water Pump."
    }
  ]
}