{
  "url": "https://www.wikihow.com/Play-Scavenger-Hunt",
  "title": "How to Plan and Hold a Scavenger Hunt",
  "steps": [
    {
      "title": "Pick a theme for your scavenger hunt to add a personal touch.",
      "content": "Pick a theme for your scavenger hunt to add a personal touch. A theme is a great way to add a little flavor and excitement to your scavenger hunt. Use any theme you’d like, such as a pirate treasure hunt or an Easter-themed egg hunt. Your theme will help you choose other things, like where to hold the hunt and what the items to find will be. [1] X Research source If you’re planning a birthday party , match the theme of the scavenger hunt to the theme of the party. Other themes include things like zoo animals, Earth Day, autumn, Halloween, books—anything goes!"
    },
    {
      "title": "Pick a safe location with lots of hiding spots to hold the hunt.",
      "content": "Pick a safe location with lots of hiding spots to hold the hunt. You can hold a scavenger hunt just about anywhere—outdoors, indoors, at a park, at the zoo. Pick a place that matches your theme, if you have one, and make sure it’s both safe and allowed by the location’s owner. If you can, choose a place with a lot of small hiding spaces or nooks and crannies where you can hide items easily. Great places for scavenger hunts include your backyard or a local state park, for instance. If you’re planning a scavenger hunt for children, ensure there is adult supervision throughout the area."
    },
    {
      "title": "Collect or identify items to hide, and add them to a list.",
      "content": "Collect or identify items to hide, and add them to a list. Pick 5-15 or so objects you want the players to find throughout the scavenger hunt—ideally things matched to your theme. These can be any household items, like a spoon, action figure, or markers, for example. Or, they can be items already in the area, like a yellow leaf, bronze statue, or black park bench. Write down all of the objects to keep track of the items players find and what items are still missing. [2] X Research source For instance, if you’re planning a pirate scavenger hunt, hide things like plastic gold coins, a ship in a bottle, a stuffed parrot toy, or a small treasure box. Your objects can also be landmarks or miscellaneous things throughout the world for players to spot—they don’t necessarily have to collect them to find them."
    },
    {
      "title": "Write out your clues on paper for each player or team.",
      "content": "Write out your clues on paper for each player or team. Your clues give your players hints about where to find the objects. [3] X Research source Clues can be as specific or as vague as you like—the trick is making them vague enough to be a challenge, but not so vague they’re impossible to figure out. Use both words and images to make them more engaging. Make sure you have a clue sheet for each player or team. For example, if you’re hiding a fake gold coin, write something like, “Fill your treasure box with me to bask in the riches of the sea!” You can also draw a piggy bank or detail the area where you hid the item. You might also write out clues on individual postcards and hide them along with the items, so players get a new clue every time they find an item."
    },
    {
      "title": "Hide your items in a variety of places just before the game.",
      "content": "Hide your items in a variety of places just before the game. Once you write out the clues, place each of the items in their hiding spots throughout the area. Aim to hide some items in easy-to-find spots, while making other items a little more challenging, for variety. For some easy hiding spots, try placing the item at the bottom of a bushy shrub, behind a lawn decoration, or under a doormat. For more difficult hiding places, place the item high in a tree branch, inside of a dog house, or on top of a bird feeder."
    },
    {
      "title": "Pick out a prize for the winning team before you play.",
      "content": "Pick out a prize for the winning team before you play. Use anything you’d like as the prize, but it’s helpful to consider the age of the players when you make your decision. Some common ideas include candy, cash, or gift certificates. Or, coordinate your prizes to the theme of the hunt. You might even let players keep the items they’ve found as prizes. For example, if you’re playing scavenger with a group of kids, offer a small toy or sweet treat as the prize. If you’re playing with teenagers, consider offering movie tickets for the group as the prize. If you’re playing with adults, you might give out gift baskets or vouchers to local restaurants."
    },
    {
      "title": "Split your group into teams with about 3-4 players each.",
      "content": "Split your group into teams with about 3-4 players each. Gather your group of scavengers, and divide the players into teams of equal players. Do your best to balance the teams—if you’re playing with young children, put a couple older kids and a few younger kids on the same team, so they can work together throughout the scavenger hunt. [4] X Research source"
    },
    {
      "title": "Set a time limit for the scavengers to complete the game.",
      "content": "Set a time limit for the scavengers to complete the game. The time limit can be as long as you’d like. Tell the players to search for clues for 30 minutes or 60 minutes, for instance, while keeping their own time on their phones or watches. When you’re ready to play, set a timer to help you keep track of the time. The players’ objective is to find the most clues in the shortest amount of time."
    },
    {
      "title": "Give each team the first clue, or the clue sheet, to start the game.",
      "content": "Give each team the first clue, or the clue sheet, to start the game. When you’re ready to start the game, hand the teams the list of clues. Or, if you’re playing 1 clue at a time, give each their first clue. This begins the game, and the players are free to roam about the space in search of the first item. [5] X Research source It’s important that none of the players know where the items are located before the game begins."
    },
    {
      "title": "Encourage the players to work as a team to find the items.",
      "content": "Encourage the players to work as a team to find the items. When playing scavenger hunt, the players should read over the clue as a group and use their creativity and critical thinking skills to figure out where the items are. Encourage teams to stick together and include each player, so everyone is involved. For example, if 1 player finds a key hidden in a jungle gym with a note attached, they might say something like, \"Hey team, I found one!\" and gather the group together, rather than rushing to the next clue. Tell players to keep the items in their pockets, a basket, or a paper bag as they find them."
    },
    {
      "title": "Count up the total objects found by each team when time runs out.",
      "content": "Count up the total objects found by each team when time runs out. When your timer is done, gather all the players back at the start. Let them present what they found, and tally how many items each team discovered. Then, grant prizes for first, second, and third place, plus participation prizes. If the players are looking for items they can't collect, have them take photos of each one they find. If you’re playing in a large space, you might blow a whistle to designate the end of the game. Tell the players to listen for the whistle before you start. Also, reveal which items have yet to be found, if any, and let the whole group work together to find them."
    },
    {
      "title": "Play an alphabet scavenger hunt with popsicle sticks.",
      "content": "Play an alphabet scavenger hunt with popsicle sticks. Recreation and pickleball expert Jeremiah Thomas recommends this letter-based game. To play, write each letter of the alphabet on a separate popsicle stick, then hide them throughout the area. Write hints as to where the next letter is hidden on the back of the popsicle stick, and have players try to find all 26 letters. This is a great scavenger hunt for young kids still learning their letters."
    },
    {
      "title": "Play an Oregon Trail-themed scavenger hunt.",
      "content": "Play an Oregon Trail-themed scavenger hunt. Thomas also suggests an old-timey scavenger hunt, where players have to find certain obstacles to overcome. For example, they might have to find a rope bridge, then swing across the bridge to the other side, where the next clue is hidden. At the end, there might be a big prize all the players can share, like a picnic lunch."
    },
    {
      "title": "Add events or activities to the scavenger hunt.",
      "content": "Add events or activities to the scavenger hunt. Like the Oregon Trail hunt, don’t hesitate to add little activities that go with each object. For example, players might need to find a spoon, then an egg, then, before they win the scavenger hunt, they may need to play a game where they have to race against each other while balancing the egg on the spoon. Get creative and challenge your players! You might also add things like hopscotch, jumprope, or relay races to your scavenger hunt to get players moving and active."
    },
    {
      "title": "Plan a snapshot scavenger hunt played with phone cameras.",
      "content": "Plan a snapshot scavenger hunt played with phone cameras. If you don’t want to go to the trouble of buying and hiding objects, make a scavenger hunt where players have to find everyday objects and snap a photo of them with their phones. Your clues might be things like statues or certain plants or common animals. Then, players can share and compare their photos after. For added fun, make the clues vague enough for players to interpret themselves. For example, for a clue like, “Photograph something tall and purple,” players might photograph a slender purple flower, or a purple kite on a string, and both would be valid."
    },
    {
      "title": "Play a scavenger hunt where players have to do good deeds.",
      "content": "Play a scavenger hunt where players have to do good deeds. This is a great idea if you want to teach kids the importance of kindness. Instead of finding objects, make your clues into “challenges” where players have to perform something nice. For example, players might have to give a stranger a compliment or pick up a piece of litter to complete certain clues. Just be sure each group is supervised and helped along by an adult."
    },
    {
      "title": "Give each team a different list of clues.",
      "content": "Give each team a different list of clues. If you want to make things a little less competitive and a little more casual, give each team a list of their own objects to find. This makes it so that every team has a chance to figure out the clues themselves, without having to race other teams to do so, or without having things spoiled by another team figuring out a clue first."
    }
  ]
}