{
  "url": "https://www.wikihow.com/Match-Rev-Downshift-a-Motorcycle",
  "title": "How to Match Rev Downshift a Motorcycle",
  "steps": [
    {
      "title": "You will have to be used to using the front brake with only one or two fingers in order to downshift this way.",
      "content": "You will have to be used to using the front brake with only one or two fingers in order to downshift this way. It is best to use your index and middle fingers to brake while keeping your ring and pinky fingers on the throttle. [1] X Research source"
    },
    {
      "title": "After you begin braking, pull in the clutch and select the next gear like you would normally.",
      "content": "After you begin braking, pull in the clutch and select the next gear like you would normally."
    },
    {
      "title": "Here is the tricky part.",
      "content": "Here is the tricky part. Still holding the clutch in, use the palm of your hand and/or your ring and pinky fingers to rev the engine slightly. [2] X Research source"
    },
    {
      "title": "Remember to keep braking smoothly with your index and middle fingers.",
      "content": "Remember to keep braking smoothly with your index and middle fingers. [3] X Research source"
    },
    {
      "title": "When the engine is revved up slightly, let the clutch back out to engage the next gear.",
      "content": "When the engine is revved up slightly, let the clutch back out to engage the next gear. The goal here is to match the revolutions of the engine to what they need to be to travel the same speed in the lower gear. This smooths the transition between gears and eliminates the need to slip the clutch quite as much. [4] X Research source"
    },
    {
      "title": "If the bike jerks forward when you let the clutch out the engine was turning too fast.",
      "content": "If the bike jerks forward when you let the clutch out the engine was turning too fast. Don't rev it as much next time."
    },
    {
      "title": "If the bike rapidly slows, the engine wasn't turning fast enough so you need to rev it more before releasing the clutch.",
      "content": "If the bike rapidly slows, the engine wasn't turning fast enough so you need to rev it more before releasing the clutch."
    },
    {
      "title": "Repeat each time you shift down a gear.",
      "content": "Repeat each time you shift down a gear. This technique is especially useful in the lower gears, which generally have a wider gap between gear ratios."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}