{
  "url": "https://www.wikihow.com/Cancel-an-Amazon-Order-After-It-Ships-Using-the-App",
  "title": "How to Cancel an Amazon Order After It Ships Using the App",
  "steps": [
    {
      "title": "Open your Amazon app.",
      "content": "Open your Amazon app. You can cancel an Amazon order that has already been shipped straight from your mobile device. Open your Amazon app to get started."
    },
    {
      "title": "Visit the \"Your Orders\" section of the app.",
      "content": "Visit the \"Your Orders\" section of the app. Tap the profile icon on the bottom of your screen, represented by an image of a person. Then, tap \"Your Orders\" at the top your screen."
    },
    {
      "title": "Select the item you want to cancel.",
      "content": "Select the item you want to cancel. The \"Your Orders\" screen offers a list of all your Amazon orders, both pending and delivered. Choose the order that you want to cancel (in this case, one that has already been shipped) and click on it."
    },
    {
      "title": "Tap \"Request cancellation.\"",
      "content": "Tap \"Request cancellation.\" If your order has already been dispatched, you cannot automatically cancel it. Instead, you must request cancellation. While Amazon does not technically guarantee that your request will be approved, you are likely to receive a refund as long as you provide a reason for your request. If you are attempting to cancel an order that has not yet shipped, you will be offered \"Cancel Item\" as an option, and can simply tap that to complete your cancellation and receive a refund. [1] X Research source"
    },
    {
      "title": "Choose a cancellation reason from the drop-down menu.",
      "content": "Choose a cancellation reason from the drop-down menu. Amazon does not require a reason for cancellation, but providing a reason ensures that your request will be approved. Amazon's menu of options covers just about every reason you might want to cancel, such as an incorrect shipping address or the item being too expensive. The \"Request cancellation\" list will include any incomplete orders, so be sure to check the box next to any items for which you want to request cancellation. [2] X Research source"
    },
    {
      "title": "Confirm your request for cancellation.",
      "content": "Confirm your request for cancellation. Once you have chosen a reason for cancellation, you can click the big yellow Request cancellation button beneath it."
    },
    {
      "title": "Wait for your refund.",
      "content": "Wait for your refund. Amazon will make a decision on your request almost immediately, and will refund the cost of your order to your original form of payment. The processing speed of your reimbursement depends upon what form of payment you used. If you still receive your order in the mail, be sure to refuse it. If you still accept the order, Amazon may not approve your request. If you ordered an item on Amazon from a third-party seller, your request for cancellation may take a bit longer to review. The decision to accept the cancellation must be made by the seller, and not Amazon. [3] X Research source"
    }
  ]
}