{
  "url": "https://www.wikihow.com/Remove-Blood-Stains-from-Wood",
  "title": "4 Methods for Getting Blood Stains Out of Wood for Good",
  "steps": [
    {
      "title": "Dab up any excess blood with a damp sponge.",
      "content": "Dab up any excess blood with a damp sponge. Wring out a wet, clean sponge and dab it on the spill. Don’t rub the spot or it could get even more embedded. Press the sponge along the grain to absorb the most blood possible. [1] X Research source Varnished wood includes any floors, furniture, or objects coated in polyurethane, lacquer, or shellac."
    },
    {
      "title": "Rinse the sponge and repeat.",
      "content": "Rinse the sponge and repeat. Run the sponge under cold water and squeeze it out until all the blood is gone. Keep blotting out the stain until there’s no blood left. [2] X Research source"
    },
    {
      "title": "Rinse the area thoroughly using a damp cloth.",
      "content": "Rinse the area thoroughly using a damp cloth. Wet and wring out a cloth, then wipe down the whole area to remove any leftover blood. [3] X Research source"
    },
    {
      "title": "Dry the wood using a towel or cloth.",
      "content": "Dry the wood using a towel or cloth. Don’t let the water sit for too long, or the wood could stain."
    },
    {
      "title": "Buff the stained area with a cloth dipped in mineral spirits.",
      "content": "Buff the stained area with a cloth dipped in mineral spirits. Lightly rub mineral spirits into the grain of the wood with a soft cloth. [4] X Research source Mineral spirits is an irritant, so wear gloves. If you’re working in an unventilated area, like on a wood floor inside, wear a respirator , too."
    },
    {
      "title": "Wood floors and furniture are typically varnished with polyurethane, shellac, or lacquer.",
      "content": "Wood floors and furniture are typically varnished with polyurethane, shellac, or lacquer."
    },
    {
      "title": "Wipe the area with a clean, wet cloth.",
      "content": "Wipe the area with a clean, wet cloth. Get rid of the mineral spirit residue by wiping the surface down with a damp cloth. [5] X Research source This is especially important if you’re working on a floor in a home with pets or young children."
    },
    {
      "title": "Rub stubborn stains with mineral spirits and steel wool.",
      "content": "Rub stubborn stains with mineral spirits and steel wool. Take superfine 0000 steel wool and dip it in mineral spirits. Lightly go over the stained area with the steel wool, rubbing with the grain of the wood. After each pass, check to see if the stain is still there. It could take as little as one go-over to get rid of it. [6] X Research source"
    },
    {
      "title": "Wipe the surface clean with a soft cloth.",
      "content": "Wipe the surface clean with a soft cloth. Clean off all of the mineral spirit residue with a soft, clean cloth."
    },
    {
      "title": "Refinish the affected area after 24 hours, if needed.",
      "content": "Refinish the affected area after 24 hours, if needed. If you had to take off too much of the varnish in a visible area, refinish the wood with the right color varnish. If you’re dealing with a blood stain that covers a large area, like on a floor or deck, consider refinishing the whole thing."
    },
    {
      "title": "Blot up any excess blood.",
      "content": "Blot up any excess blood. If your bloodstain is fresh, get up as much as you can by dabbing it with a paper towel. Don’t rub the stain—that works the blood deeper into the wood. [7] X Research source"
    },
    {
      "title": "Cover the blood stain with baking soda.",
      "content": "Cover the blood stain with baking soda. Spread an even layer of baking soda all over the stain. [8] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 27 September 2021. Gently rub it into the area with a soft, dry washcloth."
    },
    {
      "title": "Scrub the stained area with a vinegar-soaked brush.",
      "content": "Scrub the stained area with a vinegar-soaked brush. Dip your brush in white vinegar, then vigorously scrub the stain. The vinegar-baking soda acid-base reaction is what makes this method work, so don’t let the chemicals touch each other beforehand. [9] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 27 September 2021."
    },
    {
      "title": "Wipe the vinegar and baking soda off with a dry clean cloth.",
      "content": "Wipe the vinegar and baking soda off with a dry clean cloth. Once you stop seeing a bubbly reaction, thoroughly wipe down the area. [10] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 27 September 2021."
    },
    {
      "title": "Repeat the process until the stain is removed.",
      "content": "Repeat the process until the stain is removed. Make sure the area is totally dry before adding more baking soda or the residual vinegar will make it react too soon. Keep reapplying and scrubbing until the stain is gone."
    },
    {
      "title": "Rinse off the wood with cold water.",
      "content": "Rinse off the wood with cold water. Finally, wash everything off with cold water (warm water could make missed blood clump up and stick to the wood). [11] X Research source"
    },
    {
      "title": "Use superfine steel wool on tougher stains.",
      "content": "Use superfine steel wool on tougher stains. If the stain still isn’t coming out, that means it’s stuck down in the wood. To get rid of it, take 0000 superfine steel wool and rub it over the surface of the stain. [12] X Research source Check to see if it’s still there after each pass. When you’re done, wipe the surface down with a soft cloth to get rid of the wood shavings."
    },
    {
      "title": "Use a clean cloth to blot the excess blood.",
      "content": "Use a clean cloth to blot the excess blood. Dab, don’t scrub, or you could end up making the stain more difficult to remove. Some wooden floors and furniture are waxed or polished instead of varnished. Use your fingernail to lightly scrape an inconspicuous area. If you make a small scratch or the finish comes off, it's likely wax."
    },
    {
      "title": "Make a cleaning solution out of dish detergent and water.",
      "content": "Make a cleaning solution out of dish detergent and water. Mix 1 tablespoon (15 mL) of liquid dish-washing detergent into 8 fluid ounces (240 mL) of cold water to make your cleaner. [13] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 27 September 2021."
    },
    {
      "title": "Dip a cloth in the solution and wipe down the stain.",
      "content": "Dip a cloth in the solution and wipe down the stain. Use a soft cloth dipped in the detergent to rub away the rest of the blood stain. [14] X Expert Source Guy Peters House Cleaning Professional Expert Interview. 27 September 2021."
    },
    {
      "title": "Rinse and dry the area with another soft cloth.",
      "content": "Rinse and dry the area with another soft cloth. Remove any residue from the wood by wiping it with a damp cloth, then drying it off."
    },
    {
      "title": "Rub stuck stains with superfine steel wool.",
      "content": "Rub stuck stains with superfine steel wool. If the stain isn’t coming out with chemicals, remove the topmost layer of the wood. Use superfine 0000 steel wool to lightly rub the surface of the stain. [15] X Research source Check the wood after each pass—1 or 2 may be enough to remove it."
    },
    {
      "title": "Wipe the wood down and add polish or wax as needed.",
      "content": "Wipe the wood down and add polish or wax as needed. If the wax , polish , or stain fully came off the wood, wipe the area down and reapply your stain or wax. Buff the area after, then rub it with a damp cloth and dry it again. [16] X Research source If the blood stain was in a large area, like on your floor, now would be a good time to do a deep clean."
    }
  ]
}