{
  "url": "https://www.wikihow.com/Convert-Mph-to-Kph",
  "title": "How to Convert MPH to KPH",
  "steps": [
    {
      "title": "Learn the length of a mile.",
      "content": "Learn the length of a mile. The mile is a unit of length actually based on the Roman “mille passus” or “thousand paces.” [1] X Research source Though the exact length of the unit varied over time, it is now set at 5,280 feet. [2] X Research source"
    },
    {
      "title": "Learn the length of a kilometer.",
      "content": "Learn the length of a kilometer. A kilometer is a common unit of measurement for length in the metric system. The metric system is a system of measurements in which each unit is a multiple of ten from the previous unit. The meter is the base unit, and a kilometer is equivalent to 1,000 meters. [3] X Research source"
    },
    {
      "title": "Understand the distances over time.",
      "content": "Understand the distances over time. Each unit of distance doesn’t mean anything by itself. In order to calculate each distance as a speed, there must be a time component added. The most common way of measuring miles and kilometers as speeds is in how many miles or kilometers an object travels in one hour—hence per hour, which is the equivalent of saying X number of miles or kilometers divided by one hour. [4] X Research source"
    },
    {
      "title": "Convert a mile to a kilometer.",
      "content": "Convert a mile to a kilometer. Since miles and kilometers are two separate units of measurement, one must first convert one mile of distance to one kilometer of distance before converting them as a distance over time. 1 mile = 1.6093440 kilometers. [5] X Research source Alternatively, if you want to convert kilometers to miles, you would need the inverse. 1 kilometer = 0.6214 miles. [6] X Research source"
    },
    {
      "title": "Get the speed in MPH.",
      "content": "Get the speed in MPH. Now that you know the basics of the distances, you’re ready to convert them as speeds. The only other piece of information you need is the MPH speed that you want to convert. [7] X Research source For example, let’s say it’s 95MPH."
    },
    {
      "title": "Multiply by 1.60934 (the kilometer equivalent).",
      "content": "Multiply by 1.60934 (the kilometer equivalent). Once you have the correct speed in miles per hour, you can convert it to kilometers by multiplying it by 1.60934. [8] X Research source For the example of 95MPH, 95 x 1.60934 = 152.887KPH. If you are making the conversion for KPH to MPH, then you would instead use the opposite distance conversion (1km = 0.6214 miles) and multiply the KPH x 0.6214. For the previous example, if you take 152.887KPH, 152.887 x 0.6214 = 95MPH."
    }
  ]
}