{
  "url": "https://www.wikihow.com/Remember-Electrical-Resistor-Color-Codes",
  "title": "How to Remember Electrical Resistor Color Codes",
  "steps": [
    {
      "title": "Here's one mnemonic \"Bright Boys Rave Over Young Girls But Veto Getting Wed.",
      "content": "Here's one mnemonic \"Bright Boys Rave Over Young Girls But Veto Getting Wed. Black, Brown, Red, Orange, Yellow, Green, Blue, Violet, Grey, White <=> 0, 1, 2, 3, 4, 5, 6, 7, 8, 9."
    },
    {
      "title": "Best method to memorize is - B.B.",
      "content": "Best method to memorize is - B.B. Roy of Great Britain Veto getting wed. Alternatively, most of the colors are those from the traditional rainbow. Black is 0 (as in 'nothing'), Brown is 1, then Red through Violet, and finally Gray and White are 8 and 9. In Russian language, you can use the following phrase: \"Четыре коровы красят ржавый железный забор синтетической формулой, содержащей белок\" - чёрный, коричневый, красный, рыжий, жёлтый, зелёный, синий, фиолетовый, серый, белый. By the way, the phrase is translated as \"Four cows paint a rusty iron fence with a synthetic formula containing protein\"."
    },
    {
      "title": "The multiplier band goes by the same code and can be read as \"followed by N zeros\", plus Gold for \"divide by 10\" and Silver for \"divide by 100\".",
      "content": "The multiplier band goes by the same code and can be read as \"followed by N zeros\", plus Gold for \"divide by 10\" and Silver for \"divide by 100\"."
    },
    {
      "title": "Tolerances are something of a mess:",
      "content": "Tolerances are something of a mess: Brown and Red are 1% and 2% (you usually spot them because they have an extra significant digit), Gold and Silver are 5% and 10%, and 20% doesn't even get a tolerance band (you will rarely, if ever, come across one of these)."
    },
    {
      "title": "To read the whole thing, put the tolerance band at your right, and go like this:",
      "content": "To read the whole thing, put the tolerance band at your right, and go like this: \"green-brown-red-gold = 5-1-00-5% = 5.1K 5%\". You'll get used soon enough, and a bit later you'll be spotting what you want at once. It's also easy to classify them by decade: red is Ks, orange is 10Ks ..."
    }
  ]
}