{
  "url": "https://www.wikihow.com/Activate-a-Credit-Card",
  "title": "The Ultimate Guide to Activating Your Credit Card",
  "steps": [
    {
      "title": "Find the phone number.",
      "content": "Find the phone number. Like the website, the phone number to activate the credit card will likely be on the card. It may also be in the paperwork with the card."
    },
    {
      "title": "Have your information ready.",
      "content": "Have your information ready. You'll likely need your credit card number, your account number, and the security code on the back of the card. The account number should be with the information that came with the card. You may also need your Social Security number or your date of birth. You may be asked to give your full name. [1] X Research source"
    },
    {
      "title": "Call the number.",
      "content": "Call the number. Once you dial the number, you will likely reach a recorded service. Follow the directions given by the system. You may have to input information with the keypad, such as your credit card number or security code. [2] X Expert Source Priya Malani Financial Advisor Expert Interview. 23 March 2020."
    },
    {
      "title": "Complete the process.",
      "content": "Complete the process. Finish giving the system your information. Once you've given all the information, your card will be activated."
    },
    {
      "title": "Take off the sticker, and sign the card.",
      "content": "Take off the sticker, and sign the card. Peel the sticker back from the card with the activation information on it. Add your signature to the back of the card."
    },
    {
      "title": "Find the activation information on your card.",
      "content": "Find the activation information on your card. Your card should have a website where you can activate your card. Often, it is on a sticker on the card, but it may also be in the packet of information that came with the card. [3] X Research source"
    },
    {
      "title": "Enter the information on the bank or credit company's website to activate your card.",
      "content": "Enter the information on the bank or credit company's website to activate your card. You'll need information such as your credit card number, your name, and the security code, which you can find on the back of the card. You also may need your Social Security number and your date of birth. [4] X Expert Source Priya Malani Financial Advisor Expert Interview. 23 March 2020."
    },
    {
      "title": "Submit the information.",
      "content": "Submit the information. Once you've entered the information, review it to make sure it is correct. Hit the submit or the activate button, and your card will be activated. [5] X Research source After you've activated the card online, browse the website a bit to find out if there are any special offers available for new activations. Many companies provide benefits to new cardholders. [6] X Expert Source Priya Malani Financial Advisor Expert Interview. 23 March 2020."
    },
    {
      "title": "Confirm that you have activated your credit card online.",
      "content": "Confirm that you have activated your credit card online. Financial institutions will call you or send you an email to verify the activation. If you don't receive an email, you can contact the company to verify that your card was activated."
    },
    {
      "title": "Remove the sticker, and sign the card.",
      "content": "Remove the sticker, and sign the card. Take the sticker off the card that had the activation information on it. Sign the back of the card with your name."
    },
    {
      "title": "If needed, set up or log into an online account with your bank.",
      "content": "If needed, set up or log into an online account with your bank. You will likely need an online account with the company after activating your card. [7] X Research source To set up an account, you'll need information like your date of birth, your Social Security number, an email address, a password, and an account number. You may also need to set up a username that is separate from your email. [8] X Research source Some websites do not require you to have an online an account to activate your card. Check to see if yours does by visiting the activation website listed on the card. [9] X Research source If you already have an account, enter your new username and password to access your account. [10] X Research source"
    }
  ]
}