{
  "url": "https://www.wikihow.com/Date-a-Scorpio",
  "title": "How to Date a Scorpio",
  "steps": [
    {
      "title": "Play the game on their terms.",
      "content": "Play the game on their terms. Since Scorpios love to be in control, maintain your own control of the situation by playing to their expectations. As hunters, they love the thrill of the chase, so think of yourself as prey for them to hunt. Present yourself as a prize who is truly worth hunting. [1] X Expert Source Jessica Lanyadoo Astrologer & Psychic Medium Expert Interview. 12 November 2019."
    },
    {
      "title": "Get their attention.",
      "content": "Get their attention. Scorpios love to hunt, but they need something to go after. Initiate contact. Flirt a little to taunt them into chasing you, or let them catching you sneaking peeks at them from across the room. Keep it subtle. Spark their interest by indicating your own without throwing yourself at them."
    },
    {
      "title": "Make them chase you.",
      "content": "Make them chase you. Once they go for the bait, pull back a little and make them work for it. Act a little aloof, but no so much that you come across as cold, bored, or distant. Engage in conversation to show you’re interested in them, but hold your best bits back at first to maintain a sense of mystery about yourself."
    },
    {
      "title": "Nix the small talk.",
      "content": "Nix the small talk. Even if you have a million things to say about the weather, use the less-is-more tactic. Whether or not they’re right, Scorpios might view your nonstop small talk as the sum total of all you have to say. If and when you do have to resort to small talk, keep steady eye contact and lean in close to indicate that the topic at hand is really just an excuse for you to talk to them."
    },
    {
      "title": "Keep flattery to an absolute minimum.",
      "content": "Keep flattery to an absolute minimum. Avoid coming across as easy prey. Even if you already think the world of them, keep that to yourself for now. Scorpios love challenges, so make them think they have a way to go in order to impress you."
    },
    {
      "title": "Argue your points.",
      "content": "Argue your points. If you happen to disagree with something they say, say so. Be provocative by challenging what they believe. Keep it friendly, though. Frame your arguments by saying, “Well, I believe …” or “I just think …” instead of stoking their competitive streak too much by flat-out declaring, “You’re wrong.”"
    },
    {
      "title": "Create an air of intimacy.",
      "content": "Create an air of intimacy. Scorpios crave real connections and strong chemistry, so improve your chances by making each moment about the two of you and no one else. Either plan ahead to have a one-on-one encounter, or draw them into a private corner if you find yourselves at larger gatherings. Prove yourself to be secure enough to forego the safety net of other people’s company. Stroke their ego by showing them that you would rather be alone with them. [2] X Expert Source Jessica Lanyadoo Astrologer & Psychic Medium Expert Interview. 12 November 2019."
    },
    {
      "title": "Create a private bubble around yourselves.",
      "content": "Create a private bubble around yourselves. Scorpios value privacy, so speak in low tones that no one else can overhear. When you decide it’s time to make a move, whether it’s simply holding hands or something more intense, do so furtively and out of view of other people. If you want to be their love interest, that means you want to be part of their private inner life, so keep the public displays of affection tasteful and to a minimum. [3] X Expert Source Jessica Lanyadoo Astrologer & Psychic Medium Expert Interview. 12 November 2019."
    },
    {
      "title": "Communicate physically.",
      "content": "Communicate physically. Let your body do the talking, especially whenever you have to fall back on small talk to flirt with them in the beginning. Lock eyes with them and don’t let go. Stand a step closer to them than you would with anybody else. Touch their hand to draw their attention or emphasize a point that you're making."
    },
    {
      "title": "Anticipate their needs.",
      "content": "Anticipate their needs. Show how tuned you are to them by helping them out before they even think to ask. If you’re sharing a pitcher and you see that they’ve almost finished their glass, pour them another drink. If you notice that they seem to feel too hot or too cold, ask them if they want to relocate to somewhere more comfortable. Scorpios respond to chemistry, and nothing says chemistry better than knowing what the other person wants before they do."
    },
    {
      "title": "Refrain from comparing them to anybody else.",
      "content": "Refrain from comparing them to anybody else. If they strike you as being exactly like your best friend from school years ago, stay mum on the subject. If they make a comment that you heard someone else make just the other day, zip your lips. Maintain the air of intimacy by keeping the focus on the two of you without bringing anyone else into the conversation, even if the comparison is favorable."
    },
    {
      "title": "Resist prying.",
      "content": "Resist prying. Scorpios have a tough time sharing their inner private lives, so don’t scare them off by coming across as someone who likes to snoop or blab. [4] X Research source Since they love to be in control, simply follow their line of conversation. Steer clear of topics that they might consider taboo or otherwise find uncomfortable. If they receive a phone call or text, or if a friend of theirs walks up and whispers in their ear, leave it unmentioned. [5] X Expert Source Jessica Lanyadoo Astrologer & Psychic Medium Expert Interview. 12 November 2019."
    },
    {
      "title": "Keep negative comments to yourself.",
      "content": "Keep negative comments to yourself. Avoid speaking ill of others, especially if they’re family or friends. Even if you have a valid complaint about your sister or a buddy, remember that your Scorpio will wonder why you shared it with them. Avoid leaving the impression that you're just as likely to speak negatively of them behind their back, too."
    },
    {
      "title": "Concede some control.",
      "content": "Concede some control. Expect your Scorpio to want to dictate their own lives and, to an extent, yours. Adapt yourself as best as you can to their vision of how things should be. As you both share your wants, needs, and dreams, judge theirs versus your own to see if they’re compatible. The less compatible they are, the more likely that you should probably end things rather than waste time by asking them to change for you. [6] X Research source"
    },
    {
      "title": "Talk about the future.",
      "content": "Talk about the future. Ask them what their goals in life are: where do they want to live; what do they want to do for a career; etc. Compare them with your own. If the two of you can each accomplish your respective five-year plans without any great sacrifice, you’re good to go. But if you want to open a bakery in your hometown while they want to jet all over the globe as an archaeologist, it’s probably best to walk away now, because they’re not going to settle."
    },
    {
      "title": "Talk about their expectations of you.",
      "content": "Talk about their expectations of you. Scorpios like to dictate the nature of their relationships as well as everything else. [7] X Research source Suss out what they expect out of you as a partner. If you fit their idea of an ideal mate, congrats. If the person they describe doesn’t sound a thing like you, call it quits, because they will probably expect you to be this person regardless."
    },
    {
      "title": "Stand your ground when needed.",
      "content": "Stand your ground when needed. Although you’ll have to adapt a bit in order to make things work, don’t be afraid to draw lines. Adapt where you’re willing to, but stay true to yourself when their demands are too much. Earn their respect by refusing to be a pushover, while ensuring that they treat you how you wish to be treated."
    },
    {
      "title": "Maintain trust.",
      "content": "Maintain trust. Scorpios have a lot of issues regarding trust, so make earning and keeping their trust a top priority. At the same time, accept that they will probably never share everything with you. Respect their right to keep some private matters to themselves, while proving to them that they’re safe in sharing everything else with you. [8] X Research source"
    },
    {
      "title": "Resist snooping.",
      "content": "Resist snooping. Stay out of their sock drawer. Leave their cellphones and other devices alone unless they invite you to use them. Even then, refrain from checking their histories to see what your Scorpio’s been up to."
    },
    {
      "title": "Be honest.",
      "content": "Be honest. Never lie to them. Scorpios resent being deceived, so if you’re uncomfortable with sharing something, it’s better to simply keep it to yourself rather than build a wall of lies to hide whatever it is. [9] X Research source Consider yourself as equally entitled to a private inner life as your Scorpio considers their self to be."
    },
    {
      "title": "Show your loyalty.",
      "content": "Show your loyalty. If a Scorpio decides to seriously date you, know that they’ll take your relationship very, very seriously. Expect them to judge you on how devoted you are to being their partner. Defend your partner when they're falsely accused or otherwise attacked by others. Take your partner’s side and consider the aggressor as an unwelcome person in your life, even if they used to be your friend."
    },
    {
      "title": "Avoid flirting with anyone else.",
      "content": "Avoid flirting with anyone else. Even if you have zero interest in someone who decides to hit on you, don’t engage or otherwise humor them. Your Scorpio might misinterpret \"being polite\" with \"being interested.\" Also, say goodbye to your exes. If you’re still on good terms with them, wish them the best in life, but let them know it’s time for you to move on for good. [10] X Research source"
    },
    {
      "title": "Keep their sense of adventure alive.",
      "content": "Keep their sense of adventure alive. Remember: Scorpios love the thrill of the chase, so now that they’ve caught you, they need something new to chase after. Avoid falling into predictable routines. Stimulate their love of life and pursuit."
    },
    {
      "title": "Conquer new challenges together.",
      "content": "Conquer new challenges together. Propose new activities for the both of you to do. Go wall- or rock-climbing. Find a local polar-bear swim and take a midwinter dive into icy waters. Try skydiving. Whatever you choose, it doesn’t need to be death-defying or a lifelong pursuit–just something new and exciting."
    },
    {
      "title": "Explore intellectual pursuits as a couple.",
      "content": "Explore intellectual pursuits as a couple. Join an art program and learn how to paint or sculpt together. Take a walking tour to learn about local history. Go to lectures and museums or even a murder-mystery dinner. Put your brains together and expand your knowledge."
    },
    {
      "title": "Spice up your love life.",
      "content": "Spice up your love life. If you’re going to share your fantasies with anyone, a Scorpio is an ideal partner. Any way you can think of to switch things up, they’ll probably be game for. However, ease into this, rather than daring them right from the get-go. Coming on too strong too fast may turn them off if they still haven’t come to trust you yet. [11] X Research source"
    },
    {
      "title": "Define your relationship in clear terms.",
      "content": "Define your relationship in clear terms. Whether you’re interested in a serious romance or a more casual fling, let them know what you want in no uncertain terms. Although Scorpios are eager to meet their soulmate, they will often accept chemistry as they find it, whether it be with a longterm partner or a friend with benefits. Avoid confusion and hurt feelings by asking them exactly what they’re seeking from you and by stating your own expectations."
    },
    {
      "title": "Find out why they \"turn off.\"",
      "content": "Find out why they \"turn off.\" If they seem to lose interest after the first date or two (or fail to respond to your signals to begin with), they may have genuinely lost interest, or they may be so interested that they’ve backed off to rethink their strategy, especially if you’re already friends with a risk of losing you altogether if things don’t work out. If it’s the former, accept it, because there’s not much you can do to change their mind. If it’s the latter, assure them that you really do want to move forward."
    },
    {
      "title": "Weather the storm.",
      "content": "Weather the storm. Scorpios are prone to mood swings, so brace yourself. When something’s wrong, expect them to fly off the handle one minute and freeze you out the next. Stay calm and collected, because what they need is someone who’s more grounded. Avoid mirroring their behavior and making things worse."
    },
    {
      "title": "Pursue their silences.",
      "content": "Pursue their silences. When they shut you out, gently probe for the reason why. Scorpios expect such a strong connection between the two of you, they think you should be able to figure out what’s wrong on your own. If you have no idea what’s up, ask them what’s wrong. The longer you let silences grow, the more they might resent your inability to suss out what’s wrong on top of whatever was bothering them in the first place."
    },
    {
      "title": "Keep calm.",
      "content": "Keep calm. When they rage out, bite your tongue. You don’t have to accept what they say or let them win the fight, but ensure that you’ll be heard by remaining calm. Avoid being drawn into a screaming match and escalating the situation. Let them get it all out, and then reply with calm, measured responses."
    },
    {
      "title": "Know when to call it quits.",
      "content": "Know when to call it quits. Scorpios love to be in control and tend to be jealous and possessive. [12] X Research source If this causes them to cross a line, call them out on it. The best ones may be conscious of their behavior and admit when they’re unreasonable. If not, walk away if these qualities are too much for you to handle, because your Scorpio isn’t likely to change any time soon. At their worst, Scorpios may become physically and/or verbally abusive in their quest for control. Pay attention to how they treat you when you fight or disagree. If they handle you roughly (beyond a playful manner), insult you, or ignore your hurt feelings, take it as a warning sign that they care more about control than about you."
    }
  ]
}