{
  "url": "https://www.wikihow.com/Make-a-Narcissist-Obsessed-with-You",
  "title": "How to Make a Narcissist Totally Obsessed with You",
  "steps": [
    {
      "title": "If they’re hyper-focused on appearances, catch their eye by looking hot.",
      "content": "If they’re hyper-focused on appearances, catch their eye by looking hot. Egotistical people often like to be seen with someone who takes pride in their looks. If you want this person to really obsess over you, try to look as good as or better than they do. Put a lot of thought into your clothes and be well-groomed . [1] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Always look your best no matter how casual the situation is. They’ll see that you always look attractive and they'll want to be seen with you. They might appreciate it if you reflect their personal style. Choose outfits with matching colors or styles, so your looks are complementary."
    },
    {
      "title": "Keep them on their toes so they’ll want to chase you.",
      "content": "Keep them on their toes so they’ll want to chase you. To catch their eye, be flirty to signal your interest. You might laugh at their jokes, touch their shoulder, or offer big smiles . Appear eager to hang out with them. Once the person enjoys your attention, start ignoring them . They’ll be craving your company, so they'll reach out to you. [2] X Research source Ignoring them can seem harsh, but they may value you even more because you're not always available."
    },
    {
      "title": "If they’ve got a fragile ego, they’ll crave your attention.",
      "content": "If they’ve got a fragile ego, they’ll crave your attention. Some people seem to have an excess of self-esteem, but they really suffer from exceptionally low self-worth and are therefore drawn to people who exude confidence. Nothing attracts this sort of person like walking into the room with your head held high commanding everyone's attention. They’ll want your attention and approval. [3] X Research source Some people see confident people as a challenge. Your crush may try to break your spirit by luring you in with compliments, only to reject you. Don't fall for it."
    },
    {
      "title": "Flaunt your status or influence to make them want you.",
      "content": "Flaunt your status or influence to make them want you. Unfortunately, some people ultimately see others as \"less than\" them. To keep them hooked, remind them that you're high value. Maybe you have a high-status job, a large social circle, or a talent that makes you sought after. If they're always thinking what a catch you are, they'll be obsessed with keeping you. Really vain people think it reflects well on them to have someone special, skilled, or capable interested in them."
    },
    {
      "title": "Give them the chance to be stronger or better than you in some way.",
      "content": "Give them the chance to be stronger or better than you in some way. Vain people have to feel valued or they won't be interested. They'll be overjoyed if they feel like they earned your attention because you were a little hard to get . They're also more likely to stick around if they think they helped you in some way. [4] X Research source For instance, you're getting hit on at a bar and you're clearly not into it, this sort of person would love to swoop in and rescue you. It feeds their ego and they'll want to be around you. To make them chase you, turn them down a few times when they ask you out. Then, say yes, so they feel like they earned it."
    },
    {
      "title": "Show them you have a life of your own, so they want to be part of it.",
      "content": "Show them you have a life of your own, so they want to be part of it. If they think that you're giving your attention and energy to other relationships, they may get jealous or protective. Make a point of spending time with other people or doing your own hobbies, and let this person know about it. They’ll see that you're not committed to the relationship, so you'll seem like a challenge. [5] X Research source Watch out for controlling behaviors. It's not alright for them to restrict your access to friends or family. If you try to have a serious relationship with someone who’s really vain, you may find that they move on to someone else when they get bored with the routine. By avoiding a relationship rut, you’ll ensure they will continue to look for your approval and attention."
    },
    {
      "title": "They may grow bored if they know you like them.",
      "content": "They may grow bored if they know you like them. So, keep your nice thoughts about them to yourself. [6] X Research source If you start laying on the praise, they'll just take you for granted. They may fish for compliments. For instance, if they say something nice about how you look, don't give a compliment right back. Instead, say something flirty like, \"Oh, thanks. I know I look great.\""
    },
    {
      "title": "They want you to care about them, so keep your distance.",
      "content": "They want you to care about them, so keep your distance. Egotistical people love to—surprise!—feed their ego. They want you to love them and fawn over them because it makes them feel important. Withhold your emotions, and it will drive them crazy. People who struggle to have empathy or who suffer from low self-esteem are sometimes less responsive to affection, so emotionally withdrawing from them may be more effective than declaring your love for them."
    },
    {
      "title": "If they thrive on chaos, create a little drama to lure them in.",
      "content": "If they thrive on chaos, create a little drama to lure them in. [7] X Research source When you do spend time with them, make a point of being edgy , exciting, or argumentative. Drama-prone folks love being around someone who's unpredictable, especially if they get to be in the spotlight. For instance, you might fight with them over something minor—maybe they showed up late for something. Call them out on it! They'll love that you noticed and that you were seemingly upset."
    },
    {
      "title": "Narcissistic people prefer to initiate a breakup so they feel in control.",
      "content": "Narcissistic people prefer to initiate a breakup so they feel in control. If you want to make them miserable, lure them in—and then break things off with them. Ideally, you’d cut off contact while they’re still in the love-bombing stage of your relationship, where they overwhelm you with displays of affection. They’ll obsess over why you left and how they can get you back. This is pretty petty and unkind behavior, and even if they hurt you first, it may not make you feel better to seek revenge. To truly get over them, continue no contact and make positive changes in your life, so you can move forward ."
    }
  ]
}