{
  "url": "https://www.wikihow.com/Encourage-Your-Child-to-Be-a-Doctor-when-Grown-up",
  "title": "How to Encourage Your Child to Be a Doctor when Grown up",
  "steps": [
    {
      "title": "Consider whether this is what your child wants to do.",
      "content": "Consider whether this is what your child wants to do. While the idea of having a doctor in the family may be appealing, it is a challenging career that is not for everyone. Reflect on what your child has expressed to you about his or her interests before you encourage him or her to pursue this career path. Some questions you might consider include: Has your child ever expressed an interest in becoming a doctor? Does your child have an aptitude for math and science? What are your motivations for encouraging your child to be a doctor? Does your child have other passions that might lead to a career?"
    },
    {
      "title": "Nurture your child's interest in medicine.",
      "content": "Nurture your child's interest in medicine. If you have determined that your child already has an interest in becoming a doctor, then the best thing you can do is nurture that interest. There are many ways you can nurture your child's interest in medicine, such as: Buying your children literature about doctors and medicine. Some doctors write and produce comic books for young children. Consider buying some for your kid. Getting medical related toys. A toy doctor kit may help to nurture your child's interest in becoming a doctor. Watching medical shows on television. If your child can relate to a character who is a doctor, he or she may become more excited about the profession."
    },
    {
      "title": "Take advantage of career programs in your child's school.",
      "content": "Take advantage of career programs in your child's school. Your child's school may provide programs that help your child explore future careers. Make an appointment with your child's teacher or principal to ask about career programs in your school. Some schools have children take a career test. If your child takes one, take this as an opportunity to have a natural conversation about what you child wants to be when he or she grows up. You can encourage your child to consider medicine as a career. On parents' night at your school, a career adviser may come speak to parents. Ask this adviser about encouraging your child's interest in medicine and science. The adviser may have input on how to help your child learn about becoming a doctor."
    },
    {
      "title": "Job shadow a doctor.",
      "content": "Job shadow a doctor. Call local hospitals and see if they have any job shadowing programs in place. A hospital may do workshops for children and parents in which doctors talk to kids about medicine. Even if a hospital does not have an official job shadowing program in place, a doctor may be willing to allow your child to shadow him or her for a day. [1] X Research source [2] X Research source A child may become interested and excited about medicine by interacting with a doctor. Your child can see what it's like to work in a hospital and learn the benefits of a medical career. Your child will be able to see what a doctor actually does. He or she will be able to watch a doctor interact with patients, deal with medicine, and tackle other challenges of the career."
    },
    {
      "title": "Attend career fairs with your child.",
      "content": "Attend career fairs with your child. These are great places to encourage your child's interests. Keep an eye out for career fairs in your community or in your child's school. At a career fair, you can steer your child towards the medical booths. Have your child talk to doctors, nurses, and other people in the medical community. If booths are giving away any pamphlets, have your child take one. This will give him or her the chance to explore the medical field at home. If there is a career fair at your child's school, offer to chaperone. That way, you can encourage your child to explore the medical booths during school hours."
    },
    {
      "title": "Talk about the positive characteristics of doctors.",
      "content": "Talk about the positive characteristics of doctors. You want your child to look up to doctors. If a child sees doctors as role models, this may make the career path seem enticing. Focus on how doctors help others. [3] X Research source Doctors develop qualities like confidence, empathy, and self-motivation. Talk about these qualities when your child visits a doctor. Say something like, \"Isn't Dr. Munro kind? She really understands what you're going through.\" You should also teach your child to value hard work. It takes a lot of work to become a doctor, so talk up a doctor's work ethic. Try saying something like, \"Dr. Munro worked hard to become a doctor and many people respect her for that. If you work hard in school, you could be a doctor just like her.\""
    },
    {
      "title": "Look for science and math in everyday life.",
      "content": "Look for science and math in everyday life. As science and math are vital to a career in medicine, encourage your child to develop a curiosity about the subjects. You can find a lot of moments in daily life related to science and math. [4] X Research source Science and math are found virtually everywhere, so point out examples whenever possible. If your child loves sports, for example, talk about the anatomy of an athlete. What muscles and bones does a hockey player need to develop? Talk about math in terms of everyday things like cooking. You can try doubling a cookie recipe, for example, and have your child figure out how to convert the measurements."
    },
    {
      "title": "Encourage your child to see challenges as positive.",
      "content": "Encourage your child to see challenges as positive. Many children may protest doing science and math homework because it's \"too hard.\" Rather than trying to argue with this, acknowledge that the subjects are hard. Explain to your child that challenges can be fun and exciting. Tell your child a hard problem is not impossible. Say something like, \"Yes, these problems are hard, but think of how exciting it will be to really master this subject. Don't you want to understand how chemistry works?\" You should also let your child know being wrong is not a bad thing. Many children develop anxiety over answering a question wrong. To this, say something like, \"A lot of scientists came up with wrong answers to questions for years. Part of the scientific process is being wrong sometimes.\" A wrong answer should be seen as a learning opportunity rather than a failure."
    },
    {
      "title": "Take advantage of informal learning opportunities.",
      "content": "Take advantage of informal learning opportunities. There are probably many places in your community where your child could learn about math and science. Make a point of visiting these places with your child over the summer and on the weekends. [5] X Research source Take your child to a local museum, aquarium, planetarium, zoo, and science center. Your child will have fun, while being exposed to math and science as subjects. Programs like 4-H, the Girl Scouts, and Boys and Girls Club may sometimes have community events. Some of these events may be aimed at teaching children about math and science. Try taking your child to one of these events."
    },
    {
      "title": "Avoid negative statements about math and science.",
      "content": "Avoid negative statements about math and science. You may not have loved math and science yourself as a child. That's okay. However, speaking negatively about the subjects may discourage your child's interests. [6] X Research source Do not say things like, \"I was never interested in math as a kid\" or \"I got the worst grades in these subjects.\" This may make your child see failure or disinterest as inevitable. Help your child understand he or she can succeed in these subjects, even if they're hard. Try saying something like, \"I struggled with math as a kid, but I'm so glad I stuck it out and got better.\""
    },
    {
      "title": "Allow your child to develop his or her own interests.",
      "content": "Allow your child to develop his or her own interests. You cannot completely control a child's development. While you may want to push math, science, and medicine, your child needs some independence. Try to be accepting and understanding of your child's interests, even if they deviate from the path you have planned. For example, you may want your child to spend the summer at a science camp hosted by a local museum. Your child says he or she wants to attend art camp instead. Art camp may not be part of your plan, but remember your child is an individual. Encouraging his or her interests and success is important, but you need to let your child have some independence. If you double down and insist on science camp, you're not letting your child explore his or her own interests. Try to reach a compromise. Let your child attend art camp, but encourage him or her to explore science on the side. Remember, you have to think about what your child wants rather than what you want. You may envision a certain future for your son or daughter. However, you need to give your child a chance to do what will ultimately make him or her happy."
    },
    {
      "title": "Look into the math and science curriculum in your school.",
      "content": "Look into the math and science curriculum in your school. You want your child enrolled in as many math and science courses as possible. This will help him or her start developing the proper skill set for a career in medicine. [7] X Research source [8] X Research source Look into any advanced placement classes your school offers. See if you can enroll your child in an advanced track that focuses on math and science. See if your school offers summer programs. Your child could take some additional math and science courses over summer break. If your school does not have summer courses, ask teachers and school officials for suggestions. They may know of local summer programs offered to children in your area."
    },
    {
      "title": "Have your child participate in STEM related extracurriculars.",
      "content": "Have your child participate in STEM related extracurriculars. STEM stands for science, technology, engineering, and math. These areas are important if your child wants a career in medicine. See what extracurriculars are offered at your school. Ask your child, other parents, and teachers for lists of extracurriculars. Look for extracurriculars that focus on math and science. If your school has a science club, for example, this would be an excellent place for your child to develop his or her skill set as a doctor."
    },
    {
      "title": "Hire a tutor if necessary.",
      "content": "Hire a tutor if necessary. Your child may struggle with certain subjects. As you want to make sure your child has an outstanding academic record, a private tutor can help. One-on-one attention can allow your child to succeed academically in all areas. [9] X Trustworthy Source Reading Rockets Online resource supported by PBS providing research-based strategies for assisting children to become confident readers Go to source Figure out what type of tutor you need. Make sure the tutor you choose has experience teaching your child's grade level. If you're looking for a tutor in a specific subject, check a potential tutor's credentials in that subject. You can find tutors online, through friends, through your child's school, or through local branches of programs like Sylvan and Kumon. Meet with a variety of tutors before selecting one. You want to ask a variety of questions to make sure a tutor is a good match for your child."
    },
    {
      "title": "Help your child manage stress.",
      "content": "Help your child manage stress. It can be stressful to pursue a career in medicine. The academic requirements are strict, so your child may frequently feel overwhelmed in school. Work on helping your child with basic stress management techniques. [10] X Research source Pay attention to how you talk to your child. You do not want to phrase anything in terms that encourage anxiety. Do not say, \"If you don't get good grades, you will not get into a good school.\" This will stress your child out. Instead, say, \"Good grades can help you succeed.\" Help your child manage his or her emotions. Allow your child to feel what he or she feels. Explain it's okay to feel angry, scared, or frustrated. Let your child know that he or she has a choice regarding how these emotions affect him or her. Try to give your child healthy means of expressing frustration and fear. Model good behavior. Try to manage stress effectively in your own life. Your child will learn a lot of good coping techniques by watching you."
    }
  ]
}