{
  "url": "https://www.wikihow.com/Bake-a-Ham-Shank",
  "title": "How to Bake a Ham Shank",
  "steps": [
    {
      "title": "Preheat your oven to 160 °C (320 °F).",
      "content": "Preheat your oven to 160 °C (320 °F). Before you begin preparing the ham shank, set the to oven to heat so that it will be ready when it's time to bake the shank."
    },
    {
      "title": "Season the ham shank with your herbs of choice.",
      "content": "Season the ham shank with your herbs of choice. Lay the entirety of the ham shank out on a chopping board and season with the herbs of your choice. If you're not sure which herbs to use, try a healthy covering of salt, pepper, rosemary, and a minced garlic clove. [1] X Research source A pinch of salt, pepper, rosemary, and one minced garlic clove will be enough for a 1 kilogram (2.2 lb) to 2 kilograms (4.4 lb) ham shank. Seasoning is a great way to experiment in a dish. If you've made a ham shank before, try adding different seasonings on at this stage to get a different taste. For example, add Chinese 5 spice for a pungent and fruity flavor. {[convert|1|tsp|cup|}} of the spice will suffice for a typical {[convert|1|kg|lb|}} to {[convert|2|kg|lb|}} ham shank."
    },
    {
      "title": "Heat olive oil in an oven-safe pot.",
      "content": "Heat olive oil in an oven-safe pot. Put an oven-safe pot over your stove at a medium heat and add 4 tablespoons (0.25) of olive oil into the pot for every 450 grams (0.99 lb) of ham shank. Heat the oil until it runs like water. [2] X Research source"
    },
    {
      "title": "Brown the ham shank for 15 minutes on all sides.",
      "content": "Brown the ham shank for 15 minutes on all sides. Put the entirety of the seasoned ham shank into the pot and brown on all sides. This will usually take about 15 minutes. Turn it around on all sides with a pair of tongs. Cover the shank in the oil to cook it evenly. [3] X Research source"
    },
    {
      "title": "Chop 1 carrot and 1 onion, then add them to the pot.",
      "content": "Chop 1 carrot and 1 onion, then add them to the pot. Chop a carrot with a sharp knife and add it to the pot. Peel the outside layer of the onion and chop the flesh into small pieces, adding it to the pot as well. Push the ham shank to one side so the vegetables can cook faster. [4] X Research source Sizzle the carrots and onions on a medium heat for 10 minutes. The onions will have browned. Arrange the vegetables evenly around the pork shank. This is so more flavor will spread during the baking process."
    },
    {
      "title": "Add your liquid of choice to the pot.",
      "content": "Add your liquid of choice to the pot. For every 450 grams (0.99 lb) of ham shank in the pot, add 470 millilitres (2.0 c) of your chosen liquid. This can be your favorite beer, wine, broth, stock, water, or a combination. [5] X Research source The ingredients you add with the ham shank can drastically change the flavor. If you don't want to mess with the flavor of the shank, add water. However, the liquid you add can add lot of depth to the flavor. For example, add a pinch of coriander to a ham shank boiling in beer."
    },
    {
      "title": "Put the lid on the pot and put it in the oven to bake for 90 minutes.",
      "content": "Put the lid on the pot and put it in the oven to bake for 90 minutes. Put a tight-fitting lid onto the pot, then slide the entire pot into a preheated oven at 160 °C (320 °F). Don't open the oven during the cooking process as you will lose heat. If you don't have a lid for the pot, you can use tight fitting aluminum foil instead."
    },
    {
      "title": "Remove the pot after 90 minutes and turn the ingredients.",
      "content": "Remove the pot after 90 minutes and turn the ingredients. After 90 minutes have passed, bring the entire pot out of the oven. Using a pair of tongs, turn over all the vegetables and the meat so that the other sides can cook. Then, put the pot back in the oven for another 90 minutes. [6] X Research source"
    },
    {
      "title": "Remove the meat when its internal temperature reads as 65 °C (149 °F).",
      "content": "Remove the meat when its internal temperature reads as 65 °C (149 °F). After 3 hours, pierce the meat at its thickest side with a meat thermometer. If the temperature reads as 65 °C (149 °F), the meat is ready. Remove the pot from the oven, peel the meat from the bone and serve it hot on a plate. [7] X Research source If the meat hasn't reached the desired internal temperature, return it to the oven. Put the lid back on tight and be patient. It's best to slow cook a ham shank. Keep checking the temperature every 30 minutes. Leftover ham shank should be easy to peel off the bone and into tupperware. Store leftovers in the fridge for up to a week as a tasty filling for sandwiches, or as a protein in a salad."
    },
    {
      "title": "Preheat your oven to 165 °C (329 °F).",
      "content": "Preheat your oven to 165 °C (329 °F). If you preheat the oven before preparing the shank, the oven should be at the correct temperature once it is time to bake it."
    },
    {
      "title": "Confirm that the ham shank is fully cooked.",
      "content": "Confirm that the ham shank is fully cooked. Some ham shanks will come from the butchers fully cooked. This means that the bones will have been discarded already. Check the outer labeling on the ham shank to confirm whether it is fully cooked. [8] X Research source"
    },
    {
      "title": "Remove the wrapping and place the ham shank in a roasting pan.",
      "content": "Remove the wrapping and place the ham shank in a roasting pan. Carefully remove the plastic wrapping from the ham shank. Be careful that none of the plastic sticks to the meat. Then, once the ham shank is unwrapped, place it into a roasting pan. [9] X Research source"
    },
    {
      "title": "Place the large end face down, then glaze with mustard.",
      "content": "Place the large end face down, then glaze with mustard. Turn the ham shank in the roasting pan so that the larger side is face down in the pan. Then, apply a healthy coating of mustard on the ham shank. Smother the ham in mustard until the outer side of the ham shank has a thin, constant coating. Different mustards will have different tastes, so feel free to experiment. [10] X Research source If you need to, flip the ham shank around so that you can cover all the sides including the meat side that is face down. The mustard is used to glaze the meat. There will be a very slight taste of mustard at the end. The mustard won't overpower the flavors at the end of the recipe. This glaze should be fine for those who don't like mustard. Around 5 tablespoons (0.4c) of mustard should be more than enough to cover a typical 1 kilogram (2.2 lb) to 2 kilograms (4.4 lb) ham shank."
    },
    {
      "title": "Rub in 300 grams (0.66 lb) of brown sugar.",
      "content": "Rub in 300 grams (0.66 lb) of brown sugar. Rub 300 grams (0.66 lb) of brown sugar onto the side of the meat. It will dissolve in the mustard. Keep rubbing it in until all the sides of the ham shank appear browned. All the sugar should have dissolved. Once it's completely covered, place the shank back in the roasting pan with the large side face down. [11] X Research source"
    },
    {
      "title": "Wrap the roasting pan in aluminum foil.",
      "content": "Wrap the roasting pan in aluminum foil. Wrap the entirety of the roasting pan with good quality aluminum foil so that the ham shank is completely covered. Aluminum foil will provide a healthy internal sizzle. You can also put on a tight-fitting roasting pan lid, but the glaze may take longer to crystallize. [12] X Research source"
    },
    {
      "title": "Bake the ham shank for 20 minutes per 450 grams (0.99 lb) of meat.",
      "content": "Bake the ham shank for 20 minutes per 450 grams (0.99 lb) of meat. The time it takes to bake a fully cooked ham shank varies depending on how heavy it is. Place the entire ham shank in the oven at 165 °C (329 °F) for 20 minutes per 450 grams (0.99 lb) of meat. [13] X Research source"
    },
    {
      "title": "Measure internal heat with a meat thermometer.",
      "content": "Measure internal heat with a meat thermometer. Bring the ham shank out of the oven and measure the internal heat with a heat thermometer. The heat at the thickest part of the meat should measure around 75 °C (167 °F). If the shank hasn't reached this temperature yet, put it back in the oven and measure its temperature every 30 minutes."
    },
    {
      "title": "Baste the shank with its own juices.",
      "content": "Baste the shank with its own juices. Once the shank hits the desired heat, use a spoon to baste the ham in its own juices. Then, cook it for another 10 minutes so the shank will completely brown. [14] X Research source"
    },
    {
      "title": "Let the meat rest for 15 minutes before serving the shank.",
      "content": "Let the meat rest for 15 minutes before serving the shank. Put the covered roasting pan out onto a heat-safe surface to let the meat rest for 15 minutes. After it's finished resting, slice up the ham and serve it. [15] X Research source The meat should fall straight off the bone. Chill the meat in tupperware boxes in the fridge. The meat will be good to eat for around a week. Use it as a filling for sandwiches, or as part of a healthy salad."
    }
  ]
}