{
  "url": "https://www.wikihow.com/Cute-Things-to-Do-for-Your-Boyfriend",
  "title": "Things to Do for Your Boyfriend: 62 Sweet Ideas to Make Him Feel Special",
  "steps": [
    {
      "title": "Send a sweet letter to your lover.",
      "content": "Send a sweet letter to your lover. Who wouldn’t like receiving an old-fashioned handwritten letter from the one they love? Write in your love letter about one of your favorite memories with him, the things you love about him, how your life has changed since meeting with him, and your future together."
    },
    {
      "title": "Fill a jar with all the reasons why he’s your special someone.",
      "content": "Fill a jar with all the reasons why he’s your special someone. Write down a few of the things you love about your boyfriend on separate scraps of paper, and stuff them inside a mason jar. Decorate the outside with construction paper, stickers, and wrap the top with a colorful ribbon. [1] X Research source If you’re looking for a great Valentine’s Day or anniversary gift, write 365 little notes so he can open a new one each day."
    },
    {
      "title": "Surprise him a beautiful bouquet.",
      "content": "Surprise him a beautiful bouquet. If your guy is hard to shop for, flowers might be the perfect gift to show your love for him. If you’re on the fence about whether a full bouquet of flowers would make him smile, swap it out with a live plant. Plus, you could decorate the pot with paint markers to make it extra special. [2] X Research source"
    },
    {
      "title": "Send him a care package.",
      "content": "Send him a care package. A great way to show your guy you’re thinking about him (especially if you’re long-distance) is to send him a little cardboard box full of cute little things he loves. Decorate the edges of the box with construction paper hearts and stickers and fill it with things he likes. They don’t have to be expensive—send him a few of his favorite snacks, a couple of photos of the two of you together, or something silly that reminds you of him."
    },
    {
      "title": "Serve him a delicious breakfast or brunch in bed.",
      "content": "Serve him a delicious breakfast or brunch in bed. What better way to surprise your boyfriend than give him the mouthwatering gift of food? Tailor the menu to fit his likes, or try a new recipe you think he’ll enjoy. Keep it simple, and prepare what you can in advance so you don’t have to wake up extra early. [3] X Research source"
    },
    {
      "title": "Pamper your boyfriend with a relaxing spa day together.",
      "content": "Pamper your boyfriend with a relaxing spa day together. Choose his favorite scented candles, make your own face masks, give him an Epsom-salt bath , eat chocolate-dipped strawberries, and enjoy a relaxing night together."
    },
    {
      "title": "Give your partner a soothing massage.",
      "content": "Give your partner a soothing massage. Give your boyfriend a full-length massage , from his back to his legs, chest, neck, and feet. If you’re feeling saucy, consider ending the massage with a sexy surprise. [4] X Research source"
    },
    {
      "title": "Prep a romantic candlelit dinner at home.",
      "content": "Prep a romantic candlelit dinner at home. Make a delicious meal or order in! Break out the tablecloth, light a couple of candles, dim the lights, and play some slow music, perfect for a romantic night at home. [5] X Research source Have a dinner spot you’ve both been eyeing for a while? Call in to make a reservation, get all dressed up, and enjoy a beautiful night on the town."
    },
    {
      "title": "Dial him up just to ask him how his day is going.",
      "content": "Dial him up just to ask him how his day is going. If calling isn’t your thing, you can also text him and let him know that he’s on your mind. Try not to call him all the time—instead, use the phone as a place to remind him you’re thinking about him and set up the next time to meet up in person."
    },
    {
      "title": "Consider giving him a cute nickname to make him feel special.",
      "content": "Consider giving him a cute nickname to make him feel special. A fun little pet name for your significant other can show him how much you adore and appreciate him. Try a classic one, like “honey,” “babe,” or “lover boy,” or create one that’s unique and references something specific to him or your relationship. [6] X Research source"
    },
    {
      "title": "Post little notes around his locker or bedroom.",
      "content": "Post little notes around his locker or bedroom. Using sticky notes to show your love can be a great way to surprise him with a shower of compliments. Write 15 to 20 little encouragements and things you love about him, and post them in places where he’ll be most likely to see them—on the bathroom mirror, in his work bag, on his lunch, in his locker… the possibilities are endless! [7] X Research source"
    },
    {
      "title": "Set aside time to fulfill one of your boyfriend’s dreams.",
      "content": "Set aside time to fulfill one of your boyfriend’s dreams. If your guy has a bucket list full of things he wants to do in the future, why not get a head start? Do something he’s always wanted to do, whether it’s skydiving, joining a parade, or learning to play chess together."
    },
    {
      "title": "Plan an elaborate scavenger hunt to find a special prize.",
      "content": "Plan an elaborate scavenger hunt to find a special prize. Create scavenger hunt clues to guide him to locations that are already special or romantic, like the window to watch a sunset or the table where the two of you had your first date. At the finish line, give him a personal gift, whether it’s a handmade scrapbook, an activity the two of you will love, or a romantic dinner for two."
    },
    {
      "title": "Make your boyfriend a hot, candlelit bath.",
      "content": "Make your boyfriend a hot, candlelit bath. Fill a bath with hot water, and create a little tray with snacks, a special drink, his favorite book, or a handheld video game. Light candles and dim the lights for a calming, spa feeling. If you want, you can use bubbles, bath bombs, or rose petals to create an extra relaxing atmosphere. [8] X Research source"
    },
    {
      "title": "Surprise him with a video or board game night at home.",
      "content": "Surprise him with a video or board game night at home. Light candles, put on some music, dim the lights and break out his favorite game to play together. Don’t forget the snacks!"
    },
    {
      "title": "Take him to his favorite store and buy him whatever he wants.",
      "content": "Take him to his favorite store and buy him whatever he wants. We all need a little retail therapy sometimes! Take him to his favorite shop, visit a farmer’s market, or take a walk down a street full of local businesses and offer to get him something he normally holds himself back from buying."
    },
    {
      "title": "Use the power of poetry to make him feel loved.",
      "content": "Use the power of poetry to make him feel loved. There’s nothing quite like using the written word to declare your love for your partner. Poetry can be great for letting you communicate your feelings, even if you think that you’re not particularly great with words yourself. Choose a love poem that perfectly expresses your love for your boyfriend, or write one yourself ."
    },
    {
      "title": "Prepare his favorite meal and eat it together.",
      "content": "Prepare his favorite meal and eat it together. Everyone knows the best way to get to a guy’s heart is through his stomach. Putting all your love into food you make yourself can be a great way to show him how much you care about him. [9] X Research source"
    },
    {
      "title": "Take him on a delicious picnic at a local park.",
      "content": "Take him on a delicious picnic at a local park. Pack sandwiches, a charcuterie board, or pick up lunch from your favorite local restaurant, spread out a comfy blanket, and soak up the sun with your boyfriend."
    },
    {
      "title": "Enjoy lounging around the house together.",
      "content": "Enjoy lounging around the house together. If your boyfriend works all the time, book a day for the two of you to do absolutely nothing productive. Watch movies, read books, lie in bed, or sit around, just enjoying each other’s company."
    },
    {
      "title": "Kiss him everywhere.",
      "content": "Kiss him everywhere. If your boyfriend has been feeling down lately, what better way to cheer him up and show him you love him than showering him with love and affection wherever the two of you are?"
    },
    {
      "title": "Take dancing lessons or dance in the kitchen together.",
      "content": "Take dancing lessons or dance in the kitchen together. Dancing is one of the oldest, most romantic couple activities there is. Dancing with your partner can be the best feeling in the world, even if you’re worried about being uncoordinated—sometimes it’s just fun to be clumsy together! If there’s a song playing that the two of you love, boogie down together, whether you’re at home or in public."
    },
    {
      "title": "Spruce up his vehicle inside and out.",
      "content": "Spruce up his vehicle inside and out. If your boyfriend drives a ton, or if he just loves his car, a great way to show you love him is to give it a fresh new look. If you’d like to go the extra mile, you could also take it to a detailer to have it cleaned professionally for you. [10] X Research source"
    },
    {
      "title": "Tell him you love him out of the blue.",
      "content": "Tell him you love him out of the blue. If you’re ready to take the next step in your relationship, consider telling him how you feel about him . If you’re not ready yet, don’t worry! You can also show him how you feel by doing small things for him, like giving him gifts, doing something nice for him, or just spending time together."
    },
    {
      "title": "Hit the road and find all the hidden travel spots.",
      "content": "Hit the road and find all the hidden travel spots. Got the travel bug? Take your boyfriend on a romantic road trip to a place you’ve both been wanting to visit. Don’t forget to stop and enjoy the cheesy tourist traps along the way! [11] X Research source"
    },
    {
      "title": "Text him a sexy selfie to show him you miss him.",
      "content": "Text him a sexy selfie to show him you miss him. If you want to let him know you’re thinking about him, send him a flirty pic of yourself . It doesn’t have to be completely nude, but if that’s something you’d like to try, go for it! Be confident and wear what makes you feel good."
    },
    {
      "title": "If your boyfriend is passionate about a cause, sign up to volunteer.",
      "content": "If your boyfriend is passionate about a cause, sign up to volunteer. Take off the day and go with him to help out an important non-profit organization, like a homeless shelter or an animal shelter, or participate in an environmental cleanup."
    },
    {
      "title": "Give him a monthly subscription to a service or an activity.",
      "content": "Give him a monthly subscription to a service or an activity. Whether it’s a gym membership, a subscription box, or a membership for his favorite video game, buy him an activity he can look forward to and engage in over a long period of time."
    },
    {
      "title": "Gift him a book of “coupons” to show your love.",
      "content": "Gift him a book of “coupons” to show your love. Make a romantic coupon book full of activities you want to do together and romantic gestures to make him feel special. Include specific coupons like a free breakfast in bed, a round of bowling together, or one date at the arcade where the two of you first met."
    },
    {
      "title": "Buy or make 5 small gifts, each one catering to one of the body’s senses.",
      "content": "Buy or make 5 small gifts, each one catering to one of the body’s senses. For smell, you could get him a candle or a box of incense. For hearing, an album by one of his favorite bands or new headphones… use your creativity and get him a few small things that will remind him of you."
    },
    {
      "title": "Share a video, a meme, or a TikTok that reminds you of him.",
      "content": "Share a video, a meme, or a TikTok that reminds you of him. Ever see those memes where two cats are cuddling, labeled “me” and “him?” Send him a couple that make you happy about your relationship together to show him how much you love him."
    },
    {
      "title": "Show him he’s the only one for you by wearing a shirt with his face on it.",
      "content": "Show him he’s the only one for you by wearing a shirt with his face on it. If the two of you joke around a lot together, he might find this both hilarious and heart-warming. Bonus points if you surprise him by wearing it on a date!"
    },
    {
      "title": "If your boyfriend has a sweet tooth, bake something for him to enjoy.",
      "content": "If your boyfriend has a sweet tooth, bake something for him to enjoy. If you love baking, this could be a great way to engage in something you're passionate about and show your boyfriend you appreciate him."
    },
    {
      "title": "Shoot him a text when you wake up or before you sleep.",
      "content": "Shoot him a text when you wake up or before you sleep. Good morning and good night texts can be a great way to show your boyfriend that you’re thinking about him, especially if the two of you are long-distance. It doesn’t have to be long or complicated—just tell him you miss him and hope he enjoys his day! Reader Poll: We asked 405 wikiHow readers how often they text their boyfriend goodnight, and 61% of them agreed that they text every night, no matter what . [Take Poll]"
    },
    {
      "title": "Put a kind note under his pillow that he’ll find when he goes to bed.",
      "content": "Put a kind note under his pillow that he’ll find when he goes to bed. Slip a cute note under his pillow, on his car, or in his work bag as a small reminder that you love and miss him before he sleeps or goes about his day."
    },
    {
      "title": "Surprise your boyfriend with a hug from behind.",
      "content": "Surprise your boyfriend with a hug from behind. If your boyfriend has been feeling stressed, a hug from behind can be the perfect way to show him you’re thinking about him and relieve some of his anxiety. Hugging from behind can be especially romantic because you both can stay physically close while admiring the same view. [12] X Research source"
    },
    {
      "title": "If you can, bring your boyfriend lunch one day at his workplace.",
      "content": "If you can, bring your boyfriend lunch one day at his workplace. This can be the perfect thing to do for your boyfriend if you don’t normally see each other at lunch. Wear something cute and visit him at his workplace with a delicious meal the two of you can enjoy together."
    },
    {
      "title": "Set aside a day to watch all his favorite movies or shows.",
      "content": "Set aside a day to watch all his favorite movies or shows. If your boyfriend loves a series of movies, this can be a great time to watch all of them in a row. Make sure to bring lots of popcorn and candy!"
    },
    {
      "title": "If you have tons of photos of the two of you, create a video compilation.",
      "content": "If you have tons of photos of the two of you, create a video compilation. Dedicate the video to your relationship by including a playlist of your favorite songs and tons of pictures of the two of you together, from the first day you met to all your recent adventures. [13] X Research source"
    },
    {
      "title": "Book a weekend in a mountain cabin or a beach house.",
      "content": "Book a weekend in a mountain cabin or a beach house. Travel to a place you’ve never been, or just rent a hotel for a couple of nights to relax and recharge. Plan a couple of activities to do while you’re there, or just stay in and have a little romantic spa day."
    },
    {
      "title": "Get one of his cherished collections professionally framed.",
      "content": "Get one of his cherished collections professionally framed. If your boyfriend collects concert tickets, matchbooks, playbills, or any other little memory scraps, mount them and hang them in a frame so he can display all his treasures. Just make sure to ask for permission first!"
    },
    {
      "title": "Create a love den out of pillows and blankets.",
      "content": "Create a love den out of pillows and blankets. Set it up in your living room and basement, and fill it with pillows and blankets so the two of you can have a cozy romantic movie night. Remember to take some snacks! [14] X Research source"
    },
    {
      "title": "Craft a card he’ll cherish forever.",
      "content": "Craft a card he’ll cherish forever. Cards don’t have to be just for holidays or special occasions! Use your creativity to put all of your love and care into making a beautiful handmade card he can read over and over."
    },
    {
      "title": "Call his family members up or invite them over one weekend.",
      "content": "Call his family members up or invite them over one weekend. If your boyfriend loves his family, it can mean a lot if you keep up with them and ask how they’re doing once in a while. Wish them well on special occasions, or invite them over for a cookout at your place to show your boyfriend that you love his family as much as your own."
    },
    {
      "title": "Give your boyfriend a gift that reminds him of his childhood.",
      "content": "Give your boyfriend a gift that reminds him of his childhood. Gift him his favorite childhood book, or a toy he remembered loving. You could also give him a gift that reminds the two of you of your favorite memories together—revisit the restaurant you had your first date in, bring a picnic to the first place you kissed, or give him a memento of your relationship you might have kept over the years."
    },
    {
      "title": "Stick a note or write in one of his favorite books so he can find it later.",
      "content": "Stick a note or write in one of his favorite books so he can find it later. If your boyfriend is a big reader, a great way to remind him that you love him is to put a small note into one of his books. Alternatively, you could also buy one of his favorite books and annotate it as you read so he gets to know all of your thoughts about the story as he rereads it again."
    },
    {
      "title": "Highlight the top hits of your relationship.",
      "content": "Highlight the top hits of your relationship. Let your love live on in a playlist full of both of your favorite songs. Include songs that remind you of him or that throwback to a couple of your best dates. [15] X Research source"
    },
    {
      "title": "Frame a photo he can bring to work or put on his bedside table.",
      "content": "Frame a photo he can bring to work or put on his bedside table. Make a wonderful reminder of your love and care for him by framing the perfect picture of the two of you together. That way, he can take you with him to work, put you by his bedside, or display your relationship on the wall for everyone to see."
    },
    {
      "title": "Show him you love him by replicating the first date you went on.",
      "content": "Show him you love him by replicating the first date you went on. Do the same activity, eat at the same restaurant, and reminisce on the memories of that night and the beginning of your relationship."
    },
    {
      "title": "Use photos and other mementos to create a romantic collage.",
      "content": "Use photos and other mementos to create a romantic collage. Print out pictures of the two of you together, use items that remind you of him, and put them all on a pretty poster so you can display how much he means to you."
    },
    {
      "title": "Invest time and energy into whatever he’s passionate about.",
      "content": "Invest time and energy into whatever he’s passionate about. Does your boyfriend like sports, leatherworking, cooking, baking, knitting, woodworking? Whatever he spends his free time doing, ask if you can join him. Let him show you all the ropes—even if whatever he likes isn’t your thing, it’ll show him you care and maybe you’ll learn more about him in the process."
    },
    {
      "title": "Set up a fire pit or light the fireplace for a romantic night in.",
      "content": "Set up a fire pit or light the fireplace for a romantic night in. This is the perfect date idea for any season and can show your boyfriend how much you love spending time with him. If you really want to create that cozy camping feel, bring some hot dogs or marshmallows to make delicious s'mores with. [16] X Research source"
    },
    {
      "title": "Buy a ticket to your boyfriend’s favorite concert or see his team play.",
      "content": "Buy a ticket to your boyfriend’s favorite concert or see his team play. If your partner is an avid concert-goer or sports super-fan, buy the two of you tickets and make it a date night. End the night with dinner at his favorite restaurant, or get ice cream on your way home."
    },
    {
      "title": "Get gussied up to impress your partner.",
      "content": "Get gussied up to impress your partner. Go on a dinner date to a fancy restaurant or stay home and pretend you’re at a private event. Put on a dress you’ve been wanting to wear for a while, put on makeup, or buy a sexy new outfit to show your guy you love him."
    },
    {
      "title": "Buy tickets to an event that he can go to with his friends.",
      "content": "Buy tickets to an event that he can go to with his friends. If your boyfriend works really hard or never goes out with his friends, show him you’re looking out for him. Buy him and his friends tickets to a concert or game, or invite them over to have fun while you go have some you-time."
    },
    {
      "title": "Get him something he’s been putting off buying.",
      "content": "Get him something he’s been putting off buying. Does your boyfriend need a new chair, a better steering wheel cover, new shoes, or a better hat? Buying him something he wouldn’t buy himself can show him that you love him and care about his well-being. [17] X Research source"
    },
    {
      "title": "Figure out what your boyfriend’s love language is.",
      "content": "Figure out what your boyfriend’s love language is. According to research, romantic partners who express their love in their partner's love language have greater relationship satisfaction. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If his love language is words of affirmation, shower him with compliments and describe your feelings for him in detail. If it’s physical touch, give him lots of forehead kisses and make time for cuddling, and so on! If you’re not sure what his love language is, have him take our love language quiz!"
    },
    {
      "title": "Hold his hand, whether you’re in public or at home.",
      "content": "Hold his hand, whether you’re in public or at home. Not only can it be a great way to show how much you love him, but holding hands can also reduce stress and lower your heart rate. [19] X Research source"
    },
    {
      "title": "Shower him with compliments.",
      "content": "Shower him with compliments. Almost everyone loves compliments, and they can be a wonderful way to show the ones you love how much you appreciate their company. Tell your boyfriend you love his hair, that he’s handsome, or that you enjoy hanging out with him. [20] X Research source"
    },
    {
      "title": "Check in on him and support him during difficult times.",
      "content": "Check in on him and support him during difficult times. If your boyfriend is having trouble at home, at work, or in school, show how much you love and support him by asking how you can help and engaging in small, sweet gestures like offering to do things for him. [21] X Research source If your partner wants space, try to respect his alone time and understand why he might need space."
    },
    {
      "title": "Revealing your secrets and wishes can show him you trust him.",
      "content": "Revealing your secrets and wishes can show him you trust him. If you have fears, worries, or doubts that you haven’t told anybody, sharing them with your partner can not only allow him to support you emotionally and practically, but it can show him that you trust him enough to share the deepest parts of your soul with him. [22] X Research source"
    },
    {
      "title": "Actively listen to his wants and needs.",
      "content": "Actively listen to his wants and needs. Focus on what your boyfriend says and practice active listening to hear what he needs or wants from you. Listening to your partner can be a relationship game-changer because it can open you up to hearing what your boyfriend would like his relationship with you to look like. [23] X Research source"
    }
  ]
}