{
  "url": "https://www.wikihow.com/Account-for-Donated-Assets",
  "title": "Accounting for Donated Assets: Recording Transactions & More",
  "steps": [
    {
      "title": "Understand the definition of fair market value.",
      "content": "Understand the definition of fair market value. In the case of donated assets, fair market value is defined as,\"the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date,\" according to generally accepted accounting principles (GAAP). Basically, this means that you should record any donated assets for the value that they would fetch if you turned around and sold them immediately. This is also referred to as the \"exit price.\""
    },
    {
      "title": "Research the market to determine the \"exit price.\"",
      "content": "Research the market to determine the \"exit price.\" In the past, nonprofits depended on the donor to specify a value for the donated asset. However, modern accounting standards now require that the organization determine a value for the asset based on prices of identical or similar assets. This means that you'll have to seek out the market prices of items identical or very similar to those that have been given to your organization. Market research of prices should be based on where and to who you could actually sell the items. For example, if a donor donates one chair, you should value that chair at its market price at a furniture store. However, if a donor donates 100 chairs, you should value them at their wholesale price. The same applies to any items received in bulk."
    },
    {
      "title": "Estimate a fair market value.",
      "content": "Estimate a fair market value. If you can't find an item in the market identical to your donated asset, you can estimate it's value based on similar ones. This is mainly useful for large assets like land or buildings. Research the market to find several similar assets and use those values to estimate the value of your asset. This is allowed by GAAP but is not preferred as strongly as finding an identical asset to compare to. For example, if a donor donates a building to your organization, it's unlikely that you would be able to find an identical building to price by. In this case, research the price per square foot of similar buildings nearby or in similar locations and apply this value to your building to estimate a price. Use IRS publication 561 (Determining the Value of Donated Property) as a guideline for making your estimates. You can find the publication here: https://www.irs.gov/uac/about-publication-561"
    },
    {
      "title": "Value the asset using a donor-supplied price.",
      "content": "Value the asset using a donor-supplied price. If you are unable to find identical or similar assets or value the donation in any other reasonable way, it is acceptable to use the fair value given by the donor. The donor will have recorded the donation in their own books using a certain value, so simply ask them for this amount. This method is the least preferred of three valuation methods provided by GAAP, but sometimes there's no way around it. It is also advisable to have this type of item appraised by a professional appraiser if it is over $5,000 in value. [1] X Research source"
    },
    {
      "title": "Determine whether the transaction is a contribution or an exchange.",
      "content": "Determine whether the transaction is a contribution or an exchange. Accounting principles treat contributions and exchanges as different transactions and record them differently, even though we may think of both as donations. A contribution here is defined as \"unconditional,\" meaning that the donor doesn't get anything in return for their donation. An exchange is a situation in which a donor would receive a gift in exchange for their donation. The type defined here will be important later in recording the transaction. For example, imagine a donor makes a $1000 donation to a charity concert. If they receive nothing in return, the $1000 is recorded as contribution. However, if they receive a number of tickets to the concert or other benefits, part or all of the donation should be recorded as an exchange. In this case, imagine the donor receives 50 tickets for their donation, each with a fair market value of $20. Because the value of the benefits (50 tickets x $20) is equal to the donation, this would be recorded entirely as an exchange. If, however, the donor received 25 tickets, half of the donation would be recorded as an exchange and half as a contribution."
    },
    {
      "title": "Record the transaction properly if multiple organizations are involved.",
      "content": "Record the transaction properly if multiple organizations are involved. In many cases, items donated to a charity may pass through other charities or organizations on their way to the their final destination. In theory, it makes sense that every middle-man should report the items transferred through them. However, only the original recipient of the item and the \"end-user\" (the charity that uses the item or gives it to those in need) should record the item transaction. If you are just passing assets through to another organization, you should only record your expense in doing so, not the value of the assets themselves. The exception to this rule is if a \"middle-man\" organization makes a significant improvement or change to the asset. This can be anything from organizing and repackaging wholesale items to restoring furniture or other large assets. In this case, the organization doing the improvement can recognize the fair market value of the assets."
    },
    {
      "title": "Determine whether or not to record donated services.",
      "content": "Determine whether or not to record donated services. Generally, donated services are not recorded as donated assets. This means that while you should record donations of items like toys and clothing, you wouldn't necessarily record donated services or any donated use of facilities. However, if the services meet certain conditions, they must be recorded. Specifically, these requirements are that the donated services either: Create or enhance non-financial assets (like construction services), or Require specialized skills and would usually need to be purchased if they weren't donated (like legal counsel, accounting services, or medical services). These types services will be recorded in the same way as donated assets."
    },
    {
      "title": "Know the basic recording process.",
      "content": "Know the basic recording process. In recording this transaction, use the market value obtained earlier in this process. Like any transaction, recording a donated asset requires making two entries. For a generalized donated asset transaction, use the following entries: Debit an asset account (cash, inventory, buildings, land, etc.) Credit \"contribution revenue\" (for a for-profit company) or \"contributions\" (for a nonprofit company)."
    },
    {
      "title": "Recording an exchange.",
      "content": "Recording an exchange. If a donation is in whole or in part an exchange, like in the above example with the concert tickets, the amount that is a contribution is still recorded in the standard way. However, the amount that is an exchange should be recorded differently, depending on the type of exchange. Generally, it would be recorded the same way as a sale of whatever the donor gets in return. In the concert ticket example, the transfer of $1000 worth of tickets for the $1000 cash donation would simply be recorded as a debit to the cash account and a credit to revenues."
    },
    {
      "title": "Record a transaction if assets are passed to another organization.",
      "content": "Record a transaction if assets are passed to another organization. If you are simply a \"middle-man\" organization that doesn't receive donations directly from donors or give the assets out to their intended recipients, you must record the transaction differently. In this case, you would record the expenses incurred in transporting the assets and the contributions as follows: Debit the market value amount under \"Expense.\" Credit the market value amount under \"Unrestricted Contributions.\""
    }
  ]
}