{
  "url": "https://www.wikihow.com/Chat-on-TikTok-on-Android",
  "title": "How to Send Direct Messages on TikTok Using Android",
  "steps": [
    {
      "title": "Open the TikTok app.",
      "content": "Open the TikTok app. The icon looks like a black square with a white music note on it. You can download TikTok from the Google Play Store . If you aren't already logged into your TikTok account , do so now."
    },
    {
      "title": "Tap Inbox.",
      "content": "Tap Inbox . This is the tab on the right of the + ."
    },
    {
      "title": "Tap a name.",
      "content": "Tap a name. This will open the chat. [1] X Research source To message someone you don't follow, navigate to their profile and tap Message . You can send one message (or 3 if they have their settings set to Everyone ) until the user accepts your message request. If you don't see the option to send a message, the user has direct messages disabled in their privacy settings."
    },
    {
      "title": "Send a message.",
      "content": "Send a message. You can send text, stickers, or even share videos. To add a sticker set, tap the sticker icon and select Add . Once it's added, tap Use to select a sticker. To create a video sticker, tap the Emoji icon and tap Create Sticker . Select a video, edit it, and then tap Next . Select a privacy setting and tap Create sticker . When you're finished, tap Send ."
    },
    {
      "title": "Navigate to a video.",
      "content": "Navigate to a video. You can find a video on your For You page, or you can search for a video by tapping the magnifying glass in the top-right corner."
    },
    {
      "title": "Tap the Share icon.",
      "content": "Tap the Share icon. This is the right-facing arrow."
    },
    {
      "title": "Tap a user.",
      "content": "Tap a user. This will send the video to the user."
    },
    {
      "title": "Tap Inbox.",
      "content": "Tap Inbox . This is the tab on the right of the + ."
    },
    {
      "title": "Tap +.",
      "content": "Tap + . This is at the top-left corner. The New Chat page will open."
    },
    {
      "title": "Select the friends you want to include.",
      "content": "Select the friends you want to include. These can only be friends you follow and who follow you back."
    },
    {
      "title": "Tap Start group chat.",
      "content": "Tap Start group chat . This will create a new group chat. You can now send messages, stickers, and videos."
    },
    {
      "title": "Tap Profile.",
      "content": "Tap Profile . This is in the bottom-right corner."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . You can find this in the top-right corner."
    },
    {
      "title": "Tap Settings and privacy.",
      "content": "Tap Settings and privacy . A new page will open."
    },
    {
      "title": "Tap Privacy.",
      "content": "Tap Privacy . This is under the Account header."
    },
    {
      "title": "Tap Direct messages.",
      "content": "Tap Direct messages . You can find this under the Interactions header."
    },
    {
      "title": "Tap Allow direct messages from.",
      "content": "Tap Allow direct messages from . This is at the top. Optional: you can toggle on/off Filtered requests and Read status on this page."
    },
    {
      "title": "Select a new setting.",
      "content": "Select a new setting. You can select Everyone , Suggested friends , Friends , or No One . If you select No One , you can't send or receive any new direct messages."
    }
  ]
}