{
  "url": "https://www.wikihow.com/Cook-Hemp-Seeds-for-Eating",
  "title": "How to Cook Hemp Seeds for Eating",
  "steps": [
    {
      "title": "Purchase shelled hemp seeds from a natural food store.",
      "content": "Purchase shelled hemp seeds from a natural food store. Hemp is rich in omega fatty acids, which break down and spoil very easily when exposed to light. For the freshest tasting product, make sure you purchase hemp seeds that come in completely opaque packaging.You should not be able to see the seeds inside the package. [1] X Research source"
    },
    {
      "title": "Heat up a cast iron skillet on low-medium heat.",
      "content": "Heat up a cast iron skillet on low-medium heat. When hot, toss in the seeds. When they start to pop, they are ready. No oil is necessary, as the hemp seeds are naturally rich in healthy oils. Toasting hemp seeds brings out their natural nutty flavor, making them a nutrient-rich substitute for people with nut allergies. [2] X Research source"
    },
    {
      "title": "Sprinkle the toasted hemp seeds on top of your favorite foods.",
      "content": "Sprinkle the toasted hemp seeds on top of your favorite foods. Toasted hemp seeds are very diverse and taste great on a range of different foods. Try sprinkling yours on yogurt, oatmeal, ice cream, dinner salads and more. They provide a satisfying nutty crunch."
    },
    {
      "title": "Use them as a substitute for breadcrumbs.",
      "content": "Use them as a substitute for breadcrumbs. Incorporate toasted hemp seeds when breading items, such as when you're making a crust for baked chicken or fish. This is especially great for people with gluten sensitivity; hemp seeds allow them to enjoy breaded foods that they usually have to avoid. [3] X Research source"
    },
    {
      "title": "Grind hemp seeds.",
      "content": "Grind hemp seeds. Throw your hemp seeds into a clean coffee grinder. Pulse until the hemp seeds are ground into a powder. Since hemp seeds are so small, you don't have to grind them into a powder for your baked goods. Using them whole will create a nutty and crunchy texture. It's up to you!"
    },
    {
      "title": "Toss the powder into the batter when making baked goods.",
      "content": "Toss the powder into the batter when making baked goods. The next time you're preparing muffins, bread, a cake, cookies or cinnamon rolls, try tossing in a handful of hemp powder (or the whole seeds) into the batter. The hemp seeds add a rich and nutty flavor to these recipes. [4] X Research source"
    },
    {
      "title": "Sprinkle over the top of the wet glaze.",
      "content": "Sprinkle over the top of the wet glaze. It is best to avoid heating hemp seeds in the oven, because they will be less nutritious. If you're baking something with a glaze, whether it's meat or a baked item, sprinkle the hemp powder or seeds on top of the glaze right before serving the dish."
    },
    {
      "title": "Add the powder to a smoothie or sprinkle it over your cereal.",
      "content": "Add the powder to a smoothie or sprinkle it over your cereal. It can also be added to porridge or oatmeal to increase the fiber and fatty acids. You won’t get them stuck in your teeth like you might with whole seeds. [5] X Research source"
    },
    {
      "title": "Put hemp seeds in a food processor with sauce ingredients.",
      "content": "Put hemp seeds in a food processor with sauce ingredients. The next time you're making a dressing or pasta sauce that involves chopping the vegetables in a food processor, toss a handful of hemp seeds in. This will combine them well with the other ingredients."
    },
    {
      "title": "Add hemp seeds to homemade salad dressing recipes.",
      "content": "Add hemp seeds to homemade salad dressing recipes. When mixing up a homemade dressing, toss a handful of hemp seeds into the food processor with the ingredients. Pulse until full incorporated. Pour the dressing over grains or a vegetable salad. [6] X Research source"
    },
    {
      "title": "Sprinkle additional seeds on top.",
      "content": "Sprinkle additional seeds on top. Before serving your salad or pasta, sprinkle hemp seeds on top, along with cheese and whatever other toppings you enjoy. This will create a more enhanced nutty flavor and provide a nice crunch to the dishes."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}