{
  "url": "https://www.wikihow.com/Make-Basic-Terrain-in-SketchUp",
  "title": "How to Make Basic Terrain in SketchUp",
  "steps": [
    {
      "title": "Open SketchUp, click on Windows >> Preferences and then select the Extensions.",
      "content": "Open SketchUp, click on Windows >> Preferences and then select the Extensions."
    },
    {
      "title": "Look at the upper left part of your screen.",
      "content": "Look at the upper left part of your screen. You will see the Sandbox tools."
    },
    {
      "title": "Select the icon, second from left (Start from Scratch) and click on your starting point and drag to the ending point.",
      "content": "Select the icon, second from left (Start from Scratch) and click on your starting point and drag to the ending point. In this screenshot, you will see very light green points on the green axis. Click on the end point of where you want it to be."
    },
    {
      "title": "Draw in the direction that you want your terrain to be.",
      "content": "Draw in the direction that you want your terrain to be. You don't have to hold down the mouse button to do so."
    },
    {
      "title": "Select the terrain in making, right click and select Explode.",
      "content": "Select the terrain in making, right click and select Explode. After you explode it, click on the Smoove icon and 'Smoove' it."
    },
    {
      "title": "Click on the select option and select somewhere off of the terrain being built.",
      "content": "Click on the select option and select somewhere off of the terrain being built. This will return it back to the way it originally looked."
    },
    {
      "title": "Select the center of where you want to create a hill.",
      "content": "Select the center of where you want to create a hill. Click on the smoove icon and pull it up."
    },
    {
      "title": "Click another square for the area that you want to sink.",
      "content": "Click another square for the area that you want to sink. Keep doing this until your terrain is close to how you want it."
    },
    {
      "title": "Select the entire terrain.",
      "content": "Select the entire terrain. Click on Edit >> ***Entities >> Soften/Smooth Edges. (The entities change depending on the size of your terrain.)"
    },
    {
      "title": "Click on the Paint Bucket icon and choose Vegetation from the options.",
      "content": "Click on the Paint Bucket icon and choose Vegetation from the options. (Assuming you want grass on your terrain.) Choose the one you want and paint it on the terrain."
    }
  ]
}