{
  "url": "https://www.wikihow.com/Download-Microsoft-Publisher",
  "title": "How To Download Microsoft Publisher: Free Trial & Purchase",
  "steps": [
    {
      "title": "Go to the Microsoft website.",
      "content": "Go to the Microsoft website. To access the free trial of Microsoft Publisher, find it on the company’s website here: https://www.microsoft.com/en-us/microsoft-365/publisher"
    },
    {
      "title": "Hover over Try Now.",
      "content": "Hover over Try Now . In the middle of the page, you will see a Try Now button that is white with green text and border."
    },
    {
      "title": "Click For home or For business.",
      "content": "Click For home or For business . Select the option that makes the most sense for your situation. Most users will probably want the software for home use."
    },
    {
      "title": "Click Try 1-Month Free.",
      "content": "Click Try 1-Month Free . Microsoft Publisher is included in a trial of Office 365, which also includes Word, Excel, PowerPoint, Outlook, and Access. Click on the green button to proceed with the free trial."
    },
    {
      "title": "Sign in to your Microsoft account.",
      "content": "Sign in to your Microsoft account. Enter the email address and password associated with your account to sign in. If you don’t have an account, click the Create one! button and set up an account. You will be asked for an email address, password, and your name."
    },
    {
      "title": "Click Get started! Add a way to pay.",
      "content": "Click Get started! Add a way to pay . Even though this is a free trial, Microsoft needs a credit card on file. Clicking on this button will bring up three payment options: Credit or debit card, bank account, PayPal. Select your preferred payment option and enter the required information. Please note that you must cancel this free trial before your month is up, or you will be charged $99.99 for the yearly subscription model. You can cancel your free trial immediately after subscribing and continue to have access for the rest of the trial period."
    },
    {
      "title": "Add your address.",
      "content": "Add your address. Click the Add profile address button to add your address to the account, then click Next . You will then have to confirm your address and click Save when you’re done."
    },
    {
      "title": "Click Subscribe.",
      "content": "Click Subscribe . You will now see an overview of your free trial and the subscription in place after the free trial is up. Make sure you understand what you’re agreeing to before you click Subscribe ."
    },
    {
      "title": "Click Install Office.",
      "content": "Click Install Office . You will now be taken to a page titled Office 365 Home . You’ll see an option to install Microsoft Office, which includes Publisher."
    },
    {
      "title": "Click on Install.",
      "content": "Click on Install . You’ll see a pop up with a blue Install button that you’ll have to click to initiate the download process."
    },
    {
      "title": "Go to the Microsoft website.",
      "content": "Go to the Microsoft website. To purchase Microsoft Publisher, visit the company’s website here: https://www.microsoft.com/en-us/microsoft-365/publisher"
    },
    {
      "title": "Hover over Buy Now.",
      "content": "Hover over Buy Now . In the middle of the page, you will see a Buy Now button that is green with white text."
    },
    {
      "title": "Click For home or For business.",
      "content": "Click For home or For business . Select the option that makes the most sense for your situation. Most users will probably want the software for home use."
    },
    {
      "title": "Click Buy Now.",
      "content": "Click Buy Now . There are three purchase options to choose from: Office 365 Home at $99.99 per year (for up to 6 users), Office 365 Personal at $69.99 per year, and Office Home & Student for $149.99 (one-time purchase). However, Office Home & Student does not include Microsoft Publisher, so make sure not to purchase this option. Review the options and the services included in each option and choose the one that works best for you. The Office 365 Home and Office 365 Personal options also offer monthly subscriptions instead of yearly. Simply click the monthly payment option instead if this is your preference."
    },
    {
      "title": "Sign in to your Microsoft account.",
      "content": "Sign in to your Microsoft account. Enter the email address and password associated with your account to sign in. If you don’t have an account, you can set one up by clicking the Create one! button. You will be asked for an email address, password, and your name."
    },
    {
      "title": "Add a payment option (if necessary).",
      "content": "Add a payment option (if necessary). If you don’t already have a payment option set up with your Microsoft account, you will be prompted to do so now. You can choose from three options: credit/debit card, bank account, or PayPal. Click on your preferred payment method and enter the necessary information."
    },
    {
      "title": "Click Checkout.",
      "content": "Click Checkout . Review the order summary and make sure all the information is correct. Then, click the blue Checkout button to complete the purchase."
    },
    {
      "title": "Click Install Office.",
      "content": "Click Install Office . You will now be taken to a dashboard page for your account. You’ll see an option to install Microsoft Office, which includes Publisher."
    },
    {
      "title": "Click on Install.",
      "content": "Click on Install . You’ll see a pop up with a blue Install button that you’ll have to click to initiate the download process."
    }
  ]
}