{
  "url": "https://www.wikihow.com/Infp-Cognitive-Functions",
  "title": "What Are an INFP’s Cognitive Functions?",
  "steps": [
    {
      "title": "Dominant: Introverted Feeling (Fi)",
      "content": "Dominant: Introverted Feeling (Fi) INFPs process their emotions and thoughts internally or inside their heads. Those with the Feeling (F) trait subconsciously follow their heart and emotions. [1] X Research source As introverts, INFPs are more reserved than most and are rather shy. They feel strongly about connecting their core values with the world around them, but they can have a hard time articulating these feelings. Because of this, they’re extremely empathetic and sensitive. [2] X Research source The dominant process is the first cognitive function you develop and is the one that feels the most comfortable and natural for you. It controls your motivations and interests. [3] X Research source"
    },
    {
      "title": "Auxiliary: Extraverted Intuition (Ne)",
      "content": "Auxiliary: Extraverted Intuition (Ne) INFPs are very imaginative and love dreaming up ideas and possibilities for all situations. Those with an Intuitive (N) trait process information through associations and patterns. [4] X Research source INFPs tend to look at the bigger purpose of life and how decisions can change their environment. They ask themselves “Why?” and “What if?” to make informed decisions. [5] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source The auxiliary process is like the front seat passenger in a car. It gives you directions but doesn’t control the wheel. This function works alongside your dominant process to help you make balanced decisions. [6] X Research source"
    },
    {
      "title": "Tertiary: Introverted Sensing (Si)",
      "content": "Tertiary: Introverted Sensing (Si) Those with the Sensing (S) trait process information by using their 5 senses: sight, sound, touch, taste, and smell. [7] X Research source INFPs have extraordinary memories and can revisit outward experiences in their mind with ease. They use their recollection and senses to relive, process, and reflect on their choices. [8] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source The tertiary process is less dependent and conscious than the previous functions. It’s often subconsciously activated in stressful situations. [9] X Research source"
    },
    {
      "title": "Inferior: Extraverted Thinking (Te)",
      "content": "Inferior: Extraverted Thinking (Te) INFPs are detail-oriented and are more objective than emotional. Those with a Thinking (T) trait use logical analysis to process information and are task-oriented. [10] X Research source Because of this, INFPs unconsciously favor logical details and data over emotional experiences and are objective problem solvers. [11] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source The inferior process is the least developed and conscious function. It’s the hardest for you to control. This function usually develops in later life and can be the source of stress and personal growth. [12] X Research source"
    },
    {
      "title": "INFPs value close relationships.",
      "content": "INFPs value close relationships. While INFPs tend to be quiet and shy, they care deeply about their relationships. They hold their friends close and are very selective about who they let in their inner circle. [13] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source If you’re an INFP, you most likely have a handful of super close friends you can always count on."
    },
    {
      "title": "INFPs are passionate.",
      "content": "INFPs are passionate. INFPs are reflective and have a desire to live a fulfilling and purposeful life. Because of this, they’re extremely passionate about whatever they do and often have intense internal emotional responses. [14] X Research source If you’re an INFP, you likely put your all into everything you do. You’re dedicated and driven—your passion motivates you to be your best!"
    },
    {
      "title": "INFPs are open-minded.",
      "content": "INFPs are open-minded. INFPs strive to positively impact the world and help others grow. They’re willing to encourage anyone and hear every side of a story. [15] X Research source If you’re an INFP, you probably enjoy listening to podcasts or news stories highlighting other people’s lives."
    },
    {
      "title": "INFPs have a hard time opening up.",
      "content": "INFPs have a hard time opening up. Because they’re a bit reserved, INFPs can struggle to be themselves around other people (especially those they don’t know well). Socializing can be draining for them, and they may put on a mask to protect their feelings. [16] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source If you’re an INFP, don’t be afraid to let your true self shine! You’re amazing inside and out, and the best way to make meaningful and lasting relationships is to be yourself right off the bat."
    },
    {
      "title": "INFPs can be self-critical.",
      "content": "INFPs can be self-critical. INFPs are exceptionally talented and creative, which can be their greatest downfall. They’re perfectionists at heart, and they may struggle if things don’t go exactly how they planned or envisioned. [17] X Research source If you’re an INFP, try to let go of perfectionism . Remember, everyone makes mistakes and has moments of failure—even your biggest heroes!"
    },
    {
      "title": "INFPs are often people pleasers.",
      "content": "INFPs are often people pleasers. INFPs are incredibly empathetic and highly sensitive to other people’s emotions. While they’re perceptive, they also seek acceptance and validation from others. [18] X Research source If you’re an INFP, focus on what you need to fill your cup rather than worrying about those around you. We know it’s hard, but remember that you can’t help others if you don’t help yourself."
    },
    {
      "title": "Being introverted, INFP may struggle to make friends.",
      "content": "Being introverted, INFP may struggle to make friends. Getting close to an INFP personality type can be a bit difficult because they’re naturally introverted; however, it’s not impossible. INFPs have deep friendships with a handful of select people they trust and value. With time and patience, INFPs can break out of their shell and make lasting connections. [19] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source Despite their introverted nature, they can easily become lonely. [20] X Research source If you’re an INFP, know it’s okay to open up to people. While you don’t have to spill all your secrets, it’s totally cool to let people know a little about yourself when you first meet. If you’re a friend of an INFP, don’t push them to open up right away. Instead, follow their lead and go slow. Start by asking them a few ice-breaker questions and letting the relationship grow from there."
    },
    {
      "title": "INFPs crave loyalty and commitment in a romantic partner.",
      "content": "INFPs crave loyalty and commitment in a romantic partner. In romantic relationships, an INFP can struggle to open up, but when they do, they’re loyal and honest—they’re hopeless romantics! [21] X Research source They look for a partner who holds their same values and is committed to the relationship as much as they are. [22] X Trustworthy Source Simply Psychology Popular site for evidence-based psychology information Go to source If you’re an INFP, try to rein back your fantasies when it comes to a partner. Your vision of a romantic partner may lead you to your love, but know that they may not immediately meet those expectations. If you’re dating an INFP, be patient and understanding with your partner. Give them plenty of space to be independent and make their own choices."
    },
    {
      "title": "The best careers for an INFP allow them to be creative and strategic.",
      "content": "The best careers for an INFP allow them to be creative and strategic. INFPs value empathy and have a passion for helping others. They’re also strong communicators, are future-oriented, and are super cooperative. INFPs see things through a creative, collaborative lens, so a job that allows them to be flexible and curious is ideal. With these characteristics in mind, INFPs thrive in these careers: [23] X Research source Actor Architect Clinical Psychologist Composer Editor Interior Designer Journalist Librarian Social Worker Translator"
    }
  ]
}