{
  "url": "https://www.wikihow.com/Clean-a-Revolver",
  "title": "How to Clean a Revolver",
  "steps": [
    {
      "title": "Make sure the gun is unloaded.",
      "content": "Make sure the gun is unloaded. With the gun pointed in a safe direction and with your finger off the trigger, hold the gun by the grip. Using your thumb, push the cylinder release to open it up. With your other hand, reach over the top of the gun and push the cylinder out. Check to see that there are no cartridges in the cylinder or the chamber. Push out and set aside any bullets. [1] X Research source"
    },
    {
      "title": "Lay the gun and supplies on a workspace with a clean, lint-free blanket.",
      "content": "Lay the gun and supplies on a workspace with a clean, lint-free blanket. Keep all of your supplies close by. You don't want to be walking around, dirtying your hands, or constantly pick up new things that may bring unwanted dirty near your gun. Wash and dry your hands once you have everything ready to work. If you've never cleaned a revolver, check out this list of necessary cleaning supplies. You can also purchase pre-made cleaning sets at most gun stores, usually for around $50. [2] X Research source"
    },
    {
      "title": "(optional) Cover up the rear cylinder opening with a sock.",
      "content": "(optional) Cover up the rear cylinder opening with a sock. The rear cylinder is the part above the trigger, where the hammer hits the chamber to fire a shot. Wrap an old, long sock around this opening to prevent cleaning brushes from getting in and ruining the revolver."
    },
    {
      "title": "Dip the right size bore brush into your cleaning solvent.",
      "content": "Dip the right size bore brush into your cleaning solvent. Bronze bristle brushes are less aggressive and are fine for removing powder residue. Steel brushes are more aggressive and can wear on the barrel, but may be useful in situations with old, caked-on, and hard deposits. Stick with bronze unless you have a reason to use steel. Nylon brushes are also available, but bronze is a good compromise in most cases. [3] X Research source If you are shooting jacketed bullets, you will have some copper-colored gilding metal in the bore. To remove copper (gilding metal), you will need to use a solvent designed to remove copper. Your gun dealer can guide you in selecting this. Copper solvent will eventually dissolve the bronze bristles on your brush. In that case, you can use a steel brush (sparingly) or a nylon brush while you are using copper solvents. If you are shooting non-jacketed bullets, you may have lead in the bore. Your gun dealer can guide you in selecting a product to help remove lead. [4] X Research source"
    },
    {
      "title": "Slide the brush into the barrel, letting it twist naturally with the gun.",
      "content": "Slide the brush into the barrel, letting it twist naturally with the gun. Revolvers are twisted inside, which spins the bullet for greater accuracy. You want to follow these grooves naturally with the brush to clean deep inside of them. Push all the way through the barrel, then pull the brush back through the other way. [5] X Research source Keep the brush in the center of the barrel, only applying light pressure. [6] X Research source Sometimes bore brushes are simply called wire brushes. Give the revolver a minute to soak if the rifle is extra dirty."
    },
    {
      "title": "Remove the brush and attach a clean lubricated patch to the patch tip.",
      "content": "Remove the brush and attach a clean lubricated patch to the patch tip. After the bore brush, get out your cleaning rod and attach a clean patch. If it isn't lubricated, dip it in cleaning solvent and run it through the barrel gently. If it comes out very dirty, get a new patch and repeat."
    },
    {
      "title": "Use 2-3 dry cleaning patches to dry out the barrel and remove any last grime.",
      "content": "Use 2-3 dry cleaning patches to dry out the barrel and remove any last grime. Once you've finished with the solvent, get as much out of the barrel as possible. That said, remember that you still need to be gentle, going with the flow of the barrel instead of forcing it down. [7] X Research source"
    },
    {
      "title": "Remove the sock and clean the muzzle and rear cylinder.",
      "content": "Remove the sock and clean the muzzle and rear cylinder. If you don't have a cleaning kit, a rag or toothbrush with some cleaning solvent will be perfect. Lightly scrub away the outside of the revolver -- hitting the in and outside of the cylinders, the trigger, the muzzle, and rear cylinder. Pull the extractor rod out of the center of the cylinder and clean that out as well."
    },
    {
      "title": "Use your bore brush and some solvent to clean up and down each cylinder.",
      "content": "Use your bore brush and some solvent to clean up and down each cylinder. Push all the way through, then pull the bore brush back. Make sure you go through all the way, taking your time. Hold the gun so that it rests on the muzzle, allowing the solvent to drip harmlessly to the floor. Add a little more solvent for each cylinder. [8] X Research source"
    },
    {
      "title": "Use the cleaning patches -- one with solvent, 2-3 dry -- to clean the cylinders just like the barrel.",
      "content": "Use the cleaning patches -- one with solvent, 2-3 dry -- to clean the cylinders just like the barrel. Remember to replace them, and use extra patches if they still come out dirty. When done, make sure your unlubricated patches get everything dry."
    },
    {
      "title": "Put a small amount of gun oil on a clean cloth and wipe down all metal surfaces.",
      "content": "Put a small amount of gun oil on a clean cloth and wipe down all metal surfaces. Rub down the entire exterior of the gun with a small amount of gun oil. Avoid the hand grips as well as inside the barrels and cylinders. Wipe in small circles, adding more oil when necessary. [9] X Research source"
    },
    {
      "title": "Wipe off all excess oil with another clean rag.",
      "content": "Wipe off all excess oil with another clean rag. You want it to be shiny, not oily or greasy. When done, you can finish the cleaning with a silicone gun cloth, which will leave the rifle as shiny as new. [10] X Research source"
    }
  ]
}