{
  "url": "https://www.wikihow.com/Fly-in-Your-Dreams",
  "title": "How to Fly in Your Dreams",
  "steps": [
    {
      "title": "Learn to go directly into a dream.",
      "content": "Learn to go directly into a dream. If you have practiced lucid dreaming, are good at remembering your dreams, and are used to checking reality, you might be able to do a rarer form of lucid dreaming called wake-initiated lucid dreaming (WILD). This is when you fall asleep with the intention of going directly into a lucid dream. When going into a WILD, you attempt to stay relaxed and attentive enough to remain aware of the process of falling asleep. Flying is typical in all lucid dreams, but it is even more typical in WILDs, which are often compared to out of body experiences. [1] X Research source"
    },
    {
      "title": "Wake early and take a nap.",
      "content": "Wake early and take a nap. Set an alarm to wake you up 90 minutes before your normal wake time. Go to bed at your normal time, and get up when your alarm rings. If you had a dream, write it down. Stay up for another 90 minutes, then go back to bed. You can read your dream journal or read other texts about lucid dreaming during this time, if you wish. [2] X Research source In bed, lie in a comfortable position and relax yourself with deep, slow breaths. [3] X Research source Repeat your goal. \"I am going to go right into a dream,\" or some variation. Imagine a recent dream. If you woke up from a dream, try to go back to it. Morning naps of this kind are the most reliable trigger for wake initiated lucid dreams."
    },
    {
      "title": "Feel yourself fall back asleep.",
      "content": "Feel yourself fall back asleep. Stay attentive to each part of the process of falling asleep, but don't try to rush it or control it. Keep your eyes lightly closed. Watch for any images that may appear, and play with them if you can. Feel your limbs grow heavy and your heart slow down. [4] X Research source"
    },
    {
      "title": "Fly out of sleep paralysis.",
      "content": "Fly out of sleep paralysis. Sleep paralysis happens when your body is starting to fall asleep, and causes you to feel as if you are awake, in your own bed, but unable to move. Recognize the first signs of sleep paralysis to avoid becoming frightened when it occurs. Sleep paralysis can be unpleasant, but it's actually a helpful jumping off point for lucid dreams, if used correctly. You might dream a scary presence into your room during sleep paralysis. Remind yourself that you are dreaming, and send it away. [5] X Research source If you want to get out of the sleep paralysis, persistently move your fingers and toes. Float out of your body. If you go into a WILD from sleep paralysis, you can fly around your own room."
    },
    {
      "title": "Fly right away.",
      "content": "Fly right away. You might enter a WILD just from watching the images that run across your eyelids. As you lie there watching your mind form pictures, start looking for details. If you see a scene, put yourself in the middle of it. Start flying or walking, touch things, and tell yourself you are dreaming. [6] X Research source If you start waking up, just tell yourself that you can keep flying. It's your dream."
    },
    {
      "title": "Realize you are dreaming.",
      "content": "Realize you are dreaming. The key component of lucid dreaming is realizing that you are dreaming. Look around you for signs of dream strangeness. Do a reality check, such as looking at your watch or trying to float. Are you dreaming? If your reality check fails, tell yourself you are dreaming. Don't get overexcited, or you might wake up. [7] X Research source You might wake up very quickly after the first few times you become lucid in a dream. Practice staying in the dream by focusing on actions in the dream, such as swimming or, yes, flying."
    },
    {
      "title": "Get grounded in the dream.",
      "content": "Get grounded in the dream. Notice where you are, and try moving through it. Doing something active is a good way of increasing lucidity, because you notice physical sensations. Try interacting with the landscape. Ride a bike, run, and try smelling and touching and moving things. [8] X Research source"
    },
    {
      "title": "Practice floating.",
      "content": "Practice floating. Jump up in the air and see if you float. You can try jumping off things and flying away. Once you can float, try moving left, right, and in different postures. The trick is to expect it to work. Your first few lucid dreams, you might have trouble believing in your \"ability\" to fly. [9] X Research source You might even float a little and then sink. This crisis of confidence is not unusual when you are not fully lucid. Remind yourself that it is a dream, and that you can fly because it's your dream. Don't be discouraged if the effort to stay lucid makes you wake up. A first lucid dream is a great sign of future flights to come."
    },
    {
      "title": "Fly.",
      "content": "Fly. Once you are fully lucid (sure that you are dreaming, able to interact with the landscape, convinced you are able to fly), you should be able to fly however you want. Push off the ground toward the sky, or take a running start. If you are in a room, fly around the room and then go out the window. Try for outer space if you are feeling ambitious. [10] X Research source You may run into repeated obstacles, such as trees or power lines. Each time you do, practice floating around them, or just go through them. [11] X Research source If you start to fall, remind yourself that you can fly in your dream. Remember, you might wake up, but you can't be hurt. It's a dream."
    },
    {
      "title": "Stay in the dream.",
      "content": "Stay in the dream. To stay lucid, focus on your flight and on the landscape. If your mind wanders, so will your dream. Keep your eye on the earth or sea beneath you, or the stars all around you. Try to challenge yourself to notice everything you can about flying: how does it feel, what is the temperature, what color is the landscape, what does it feel like when you fly through a cloud?"
    },
    {
      "title": "Make a goal.",
      "content": "Make a goal. Once you have practiced visualization, remembering dreams, and checking reality, you can start focusing on a particular kind of flight. If you have flown before in your dreams, you might try to replicate that way of flying. Have you soared like an eagle? Floated like a bubble? Swum through the air? Imagine how you are going to fly, and where. Don't set a timeline for your goal. It can take anywhere from a few days of to a few months to have your first lucid dream. Once you start trying, proceed calmly, and try one method at a time."
    },
    {
      "title": "State your goal before sleeping.",
      "content": "State your goal before sleeping. If your goal is to float, to fly, or to soar in your sleep, repeat that to yourself after you have gotten in bed. Say \"I am going to fly in my dream\" or \"when I dream I will notice, when I notice I'll fly.\" Recite your goal in your head, calmly and firmly. Alternate with visualization."
    },
    {
      "title": "Fantasize your desired dream.",
      "content": "Fantasize your desired dream. Imagine yourself falling asleep and having a dream. Visualize yourself realizing that you are dreaming, perhaps by doing a reality check or noticing something strange in the landscape. Picture yourself flying, then, and imagine every detail you would see. Try going back and forth between picturing your lucid flying dreams and reciting your goal. If you fall asleep doing this, you may increase your chances of having a lucid dream."
    },
    {
      "title": "Visualize flight.",
      "content": "Visualize flight. Surround yourself with images of flight. Watch films of different kinds of flying: superhero-style flying, birds flying, and people flying with devices. Look at aerial-view images, and imagine you are flying over the scenes depicted. Look at images of space, and try to imagine flying effortlessly through complete emptiness. Close your eyes and try to picture yourself soaring over the landscape beneath you. Spend a few minutes every day imagining sensations related to flight. Imagine bouncing on a trampoline, rushing upwards on a roller coaster, and leaping from a diving board. Play video games in which your character can fly. Playing video games might help you have lucid dreams, and even if not, the visuals will give you ideas for your flying dreams. [12] X Research source"
    },
    {
      "title": "Write your dreams in a journal.",
      "content": "Write your dreams in a journal. Remembering your dreams will help you build an awareness of them, which in turn will help you control them. As soon as you wake up from a dream, spend a few minutes remembering it and writing it down. Read your journal every few days, and take note of repeated themes. When you visualize flying, try to visualize flying over the scenes you most frequently dream. Start in a position common in your dreams, and imagine floating or leaping into the air."
    },
    {
      "title": "Check to see if you're dreaming.",
      "content": "Check to see if you're dreaming. During the day, whenever it occurs to you, check to make sure you are really awake. It may feel obvious that you are, but practicing the check while awake will help you perform it in dreams. You can only be fully lucid in a dream, if you are sure you are dreaming. Check by trying to float, or fly. [13] X Research source Other checks could be looking at a watch twice within a minute. The time rarely shows the same twice in dreams. If you haven't succeeded in floating yet, check to see if you can do something else physically impossible, such as pushing your fingers through a pillow."
    }
  ]
}