{
  "url": "https://www.wikihow.com/Get-Pregnant-if-Your-Partner-Had-a-Vasectomy",
  "title": "How to Get Pregnant if Your Partner Had a Vasectomy",
  "steps": [
    {
      "title": "Discuss why they had the vasectomy in the past.",
      "content": "Discuss why they had the vasectomy in the past. Many people who have had a vasectomy were quite clear at that point in their lives that they did not want to have children. [3] X Research source It is important to take the time to discuss with your partner why they had the procedure, and how their thoughts might have changed since then."
    },
    {
      "title": "Talk about reasons for wanting to get pregnant.",
      "content": "Talk about reasons for wanting to get pregnant. Make sure both of you are on the same page about it, and that they are not simply compromising to keep you happy. [4] X Research source Remember that when you are planning to become parents together, it is important to have both people on board and fully committed. Otherwise, it may have a negative toll on the relationship, as well as for your baby. If your partner is not fully committed, it might take some soul-searching to determine whether having a baby is really the best idea. You may find couple counseling helpful as you discuss this, as it is a very significant life decision and your partner no doubt had strong feelings about it in the past, or they would not have had a vasectomy."
    },
    {
      "title": "Decide how far you are willing to go.",
      "content": "Decide how far you are willing to go. It is important to talk about things such as cost with your partner, and the effort and monetary investment you are willing to make, prior to becoming pregnant. Certain procedures (such as in vitro fertilization) can be very expensive, so it is important to know how far you and your partner are willing to go in order to become pregnant. [5] X Research source"
    },
    {
      "title": "Have your partner see a urologist.",
      "content": "Have your partner see a urologist. This is a doctor who specializes in the male reproductive system. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source The urologist can take a detailed medical history and perform a physical exam to determine what course of action is best to help you and your partner become pregnant. The urologist can also assess your partner to see if they have any specific fertility problems, other than the vasectomy. It is advisable for you, to also consult your OB/GYN and to make sure you have no fertility problems that could hold you back from becoming pregnant."
    },
    {
      "title": "Book time off to take your partner to their vasectomy reversal.",
      "content": "Book time off to take your partner to their vasectomy reversal. It is a procedure that can be done directly in the doctor's office, with only local freezing (anesthetic) to numb the scrotal area, and it is relatively quick (around 30 minutes). Some people find it helpful to have a partner or friend there as moral support. It is also recommended to drive your partner home after the procedure as they will likely experience some pain and discomfort."
    },
    {
      "title": "Allow the doctor to perform the procedure.",
      "content": "Allow the doctor to perform the procedure. Sperm is produced in the testicles, and it then goes to the epididymis to mature. From the epididymis it travels through the vas deferens and eventually joins the urethra for ejaculation. The initial vasectomy procedure cut through the vas deferens to prevent sperm transport during ejaculation. The vasectomy reversal can be done in two ways. The first way is reattaching the two cut ends of the vas deferens (called a vasovasostomy). This is the more common procedure. [7] X Research source The second way is reattaching the vas deferens directly to the epididymis (called a vasoepididymostomy). This is used when a vasovasostomy is not possible. [8] X Research source"
    },
    {
      "title": "Help your partner recover from their vasectomy reversal.",
      "content": "Help your partner recover from their vasectomy reversal. Recovery from this procedure usually does not take more than a few days. [9] X Research source They may have some pain in their scrotal area, and this can be treated with over-the-counter pain medications such as acetaminophen (Tylenol) or an NSAID (nonsteroidal anti-inflammatory drug), such as ibuprofen (Advil, Motrin), naproxen (Aleve), or aspirin. Most patients are fine with over-the-counter pain medications and do not need anything stronger; however, it is an option to receive prescription pain medication from the doctor if your partner needs it."
    },
    {
      "title": "Refrain from sexual activity until at least one week after the procedure.",
      "content": "Refrain from sexual activity until at least one week after the procedure. Sometimes couples will hold off on sex for up to a few weeks after the procedure, as some people experience discomfort (and occasionally some blood) with ejaculation. [10] X Research source If this occurs for your partner, it should resolve on its own with time (within a few weeks). If the bleeding is severe or the pain and discomfort are not improving, seek additional help from your doctor."
    },
    {
      "title": "Ensure your partner attends follow-up appointments.",
      "content": "Ensure your partner attends follow-up appointments. The urologist will likely ask for follow-up appointments to check your partner's sperm counts, and to assess whether or not the procedure was successful. Note that success rates of vasectomy reversal are approximately 60%. It partly depends upon the number of years the person had the vasectomy for. A shorter duration equates to a greater success rate. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Understand that if your partner's vasectomy is successfully reversed, you will be able to get pregnant as any other couple would.",
      "content": "Understand that if your partner's vasectomy is successfully reversed, you will be able to get pregnant as any other couple would. In other words, when you have sexual intercourse after the vasectomy is reversed, you will have the same chance as any other couple of conceiving a baby. [12] X Research source Note that this also means that the person is no longer \"sterile\" (that is, the vasectomy is no longer functioning as birth control), so the two of you will need to discuss alternate methods for contraception after the pregnancy is over."
    },
    {
      "title": "Talk to your doctor about in vitro fertilization.",
      "content": "Talk to your doctor about in vitro fertilization. This is the route many couples go when the person has had a vasectomy and their partner wants to get pregnant. [13] X Research source It is important to talk to a doctor who specializes in this area and who can provide additional information (as well as expected cost) for your case. The cost and complexity of the procedure can vary greatly between couples. [14] X Research source One of the main reasons that IVF is chosen is that the vasectomy reversal was unsuccessful, and the couple is still determined to have biological children of their own. Success rates of the procedure vary greatly depending upon the reason for receiving it, as well as fertility factors for both the man and the woman. [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "See if your partner has frozen sperm stored.",
      "content": "See if your partner has frozen sperm stored. If they had their sperm frozen in the past, this can be used for the procedure. [16] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source If they have not, another option is to collect sperm directly from the vas deferens (the portion of the tube that is still intact and was not cut by surgery) and to use this for in vitro fertilization."
    },
    {
      "title": "Have your doctor combine the sperm sample with one or more eggs from your ovaries.",
      "content": "Have your doctor combine the sperm sample with one or more eggs from your ovaries. This is a procedure done in specialty medical labs. [17] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Normally more than one egg is taken in order to maximize the chances of a successful embryo forming in the lab."
    },
    {
      "title": "Allow the embryo from the medical lab to be implanted into the uterus.",
      "content": "Allow the embryo from the medical lab to be implanted into the uterus. Often more than one embryo will be implanted in order to maximize success rates of the conception (in hopes that at least one of the embryos will successfully survive and grow once placed in the uterus). [18] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source A complication of IVF, for this reason, is the risk of having multiples (twins, triplets, or more). Speak to your doctor about how many embryos they recommend to have implanted in your specific case. It depends upon a number of factors specific to each couple, including cost (as if the procedure \"fails\" and has to be done again, that gets expensive), as well as other \"fertility factors\" that can be assessed by your doctor. [19] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Compare the advantages and disadvantages of the procedure.",
      "content": "Compare the advantages and disadvantages of the procedure. Like any medical procedure, IVF has advantages and disadvantages. The advantages of IVF include: the vasectomy still exists as permanent birth control after your child is conceived. it is an easier procedure for the person assigned male at birth (compared to undergoing surgery to have their vasectomy reversed). conception can often occur within a faster time-frame (as compared with vasectomy reversal). The disadvantages of IVF include: cost (quite expensive) [20] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source it is a more arduous procedure for the person assigned female at birth. the procedure may have to be repeated if you wanted additional children. This is not always the case, as sometimes extra embryos can be created that can be frozen for future pregnancies. it may result in more than one child. Oftentimes more than one embryo is inserted into the uterus, to increase the success rate of one surviving. However, this can result in more than one baby for some couples, so it is important to consider the possibility of having multiples. [21] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    }
  ]
}