{
  "url": "https://www.wikihow.com/Get-the-Courage-to-Text-Your-Crush",
  "title": "How to Get the Courage to Text Your Crush",
  "steps": [
    {
      "title": "If you’re feeling a little self-conscious, remind yourself of your best qualities.",
      "content": "If you’re feeling a little self-conscious, remind yourself of your best qualities. You can either grab a pen and paper and start writing, or just talk out loud to yourself. Start with something small that you really like about yourself and then work your way up to the big things that you’re really proud of. Remembering what makes you special will put you in a better head state to text your crush. [1] X Research source You might start with something small and physical, like your hair or your height. Then, you might consider skills or talents, like your ability to write or your mastery of a certain sport. Finally, remind yourself of all of the great things that make you, you . Your compassion, your kindness, your ingenuity, etc. If nothing immediately comes to mind, ask your best friend or parent about what they like about you. Sometimes, it really helps to hear it come out of someone else’s mouth!"
    },
    {
      "title": "For a quick dose of confidence, try posing in a mirror.",
      "content": "For a quick dose of confidence, try posing in a mirror. It sounds totally silly, but striking a quick pose in the mirror will literally make you more confident. Take that shirt off, flex your biceps, throw your arms in the air like you just won a marathon, or hold your fists up like you’re about to get into a fight and let out a guttural growl. Feel goofy? Probably. But science says you’re going to be way more courageous than you were before! [2] X Research source Even standing up straight with your head held high can help you feel better as you’re typing out that text. [3] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019."
    },
    {
      "title": "If you’re anxious, channel your inner Buddha with some breathing exercises.",
      "content": "If you’re anxious, channel your inner Buddha with some breathing exercises. Controlled breathing is a great option if you just need to settle your mind before you try and lay down some game. [4] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019. There are a lot of ways to do this, but the easiest is to simply breathe in through your nose, feel the air expand in your lungs and belly, and then breath out slowly through your mouth. Repeat as needed until you’re feeling as cool as a cucumber. [5] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you’re more of a “pump some iron to calm down” kind of person, feel free to just exercise however you normally would. This is another great way to calm down and get some stress off. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "If you make this into a big thing, it’ll be a lot harder to actually do it.",
      "content": "If you make this into a big thing, it’ll be a lot harder to actually do it. Think about it this way; all you’re really doing is typing out a few words and hitting the send button, right? Remind yourself that this isn’t all that deep, even if it really feels like it right now. If you can just trick your heart into listening to your head, this will be so much easier. [7] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019. A lot of people are way too tense when they talk to their crush. If you’re going to seal the deal, you want to come off as smooth, genuine, and laid-back. You can’t be any of those things if you keep thinking this is super serious!"
    },
    {
      "title": "Getting out for a few minutes can help you clear your head.",
      "content": "Getting out for a few minutes can help you clear your head. If you’re just sitting at home going over all of the potential outcomes in your head, you may be psyching yourself out. A change of scenery might bring you some serenity. Throw your shoes on and just go for a stroll. If you’ve got a dog, take them on a long walk with you. You may come back feeling much better about sending that text. [8] X Expert Source Christina Jay, NLP Dating & Relationship Coach Expert Interview. 3 March 2021."
    },
    {
      "title": "Before you text, go accomplish something to feel good about yourself.",
      "content": "Before you text, go accomplish something to feel good about yourself. Even if it’s something as small as rearranging your room the way you’d been meaning to, or beating a tough boss in a video game, go do it. Pick something small that you can easily cross off of your to-do list and get to work. Not only will you feel better in the moment, but you’ll get a big dose of confidence to get your courage up for the big text message. [9] X Research source If you really want to build some momentum, accomplish 3 small goals over the course of the next 3 days, then text your crush. You’ll have more than enough courage to do it by then!"
    },
    {
      "title": "If you’re nervous or anxious, remember there’s no rush here.",
      "content": "If you’re nervous or anxious, remember there’s no rush here. There’s no need to force yourself to do this right now (or even today) if you aren’t ready. If you’re not in the most confident, courageous state of mind, no worries. Take a deep breath and relax. If you need to do something else to wind down right now, go for it. You’ve got all the time in the world. [10] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019. One of the worst mistakes people make when talking to their crush is that they try too hard. You want to be your genuine, authentic self. If you aren’t feeling particularly like you right now, don’t push yourself to say something you might regret. [11] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019."
    },
    {
      "title": "If calming down isn’t working, go in the other direction!",
      "content": "If calming down isn’t working, go in the other direction! Some people respond to anxiety best by leaning into it. If trying to relax just really isn’t working, forget all of that. Focus on how exciting this is! What if they say they like you out of nowhere and the two of you end up dating? What if everything goes perfectly? Use those nerves to your advantage and get amped up. When your heart is racing, draft out your message. [12] X Research source Throwing on some heavy metal or intense hip-hop music might be a great way to get the nerves pumping while you draft your text."
    },
    {
      "title": "If this is the first time you’re texting them, short is sweet.",
      "content": "If this is the first time you’re texting them, short is sweet. Aim for something a little more interesting than “hey,” but don’t write a huge paragraph if you’re just getting to know one another. Aim to shoot them a text when you know they’re probably up and able to chat. Remember, your goal here may be to simply get the conversation started. [13] X Research source You might say: “Hey, this is Sarah from calculus. I know we haven’t talked much, but did you do the homework? I’m really struggling.” From there, get some “help” and then just ask them how their day was to try and establish a friendship. “Hey Stacey! This is Nick, from the party. How are you?” Then, just chat and get to know them. If you’ve already chatted in real life, you could even open with a random funny gif, or a meme that you think they’d like."
    },
    {
      "title": "If you’re trying to move things further, try flirting a bit.",
      "content": "If you’re trying to move things further, try flirting a bit. The moment you move just from casual chatting to flirting can feel like a momentous occasion. Remember, they don’t know you’re trying to flirt, so there’s no need to be tense! You could aim to lean into a shared interest and bond over that, or pay them a compliment that implies you’ve been thinking about them. [14] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019. You might try: “Have you seen this new Batman movie yet? It looks interesting and I know you love comics as much as I do. We should see it sometime!” If things go well, you might say, “It’s a date!” if they seem a little hesitant, you can always back off and just say you should hang out as friends. If the two of you both love The Office , lean into it with something like, “You and I should team up like Jim and Pam to prank my annoying coworker. I’ve had such a long day at work, how are you?” “I loved that dress you wore today. Super cute stuff. Where do you get your sense of style?” Throw a flirty emoji in there with your message. The raised eyebrow emoji or the hearts-for-eyes face are great ways to build some romantic tension. [15] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019."
    },
    {
      "title": "If you’ve been flirting or chatting back and forth, profess your crush.",
      "content": "If you’ve been flirting or chatting back and forth, profess your crush. If you’ve worked up the courage to finally tell them how you feel, congratulations! This takes guts, but you’ve got this! Draft your message and scan it a few times to make sure you’re happy with the way it reads. Try to keep this low-key and don’t put any pressure on them. [16] X Research source You could try: “Hey, I’m sorry if this is a lot, but I’m going to kick myself if I don’t say it. I think you’re neat and I’d love to take you out some time!” “I really hope this isn’t too out of nowhere, but I’ve developed feelings for you. Would you be interested in going out sometime?” “Okay, I’m just going to say. You’re cute, I’m cute, we should go out.”"
    },
    {
      "title": "If you need some encouragement, here it is.",
      "content": "If you need some encouragement, here it is. Read the text once or twice and then just hit send. It’s no big deal, so just take the shot. What’s the worst that happens? They don’t respond? No harm, no foul. You move on and find someone else. They just want to be friends? Sweet, you just made a new pal. There’s no need to freak out over this one, and if you’re just looking for some reassurance, here it is: You got this! [17] X Expert Source Imad Jbara Dating Coach Expert Interview. 5 November 2019."
    },
    {
      "title": "Don’t freak out if they don’t respond right away.",
      "content": "Don’t freak out if they don’t respond right away. It’s possible that they’re busy when you texted them, or maybe they’re just thinking about what to say. It’s even possible they like you and they’re just going to play a little hard to get. In any case, put the phone down if they don’t respond right away and relax. Once they respond, keep the conversation moving organically and stay cool. [18] X Expert Source Cher Gopman Dating Coach Expert Interview. 17 May 2019. If you send multiple texts after you’ve texted them once, no good is going to come of it. They’re either going to feel like you’re overwhelming them, or they’re going to get annoyed that their phone keeps going off while they’re busy. Remember, play it cool!"
    }
  ]
}