{
  "url": "https://www.wikihow.com/Build-a-Water-Pump",
  "title": "How to Build a Water Pump at Home",
  "steps": [
    {
      "title": "Fit a PVC pipe into 1 of the branches of a PVC tee socket.",
      "content": "Fit a PVC pipe into 1 of the branches of a PVC tee socket. Take a 10 in (25 cm) long, 1 inch (2.5 cm) diameter PVC pipe and slide it into 1 of the branch openings of a 1 inch (2.5 cm) diameter PVC tee socket, leaving the other end open. Push the pipe far enough into the tee socket to hold it securely without blocking the run opening, which is the single opening that branches into 2. [1] X Research source You may need to warm up the end of the PVC pipe in hot water to soften it enough to fit into the tee socket. Look for PVC pipes and PVC tee sockets at hardware stores, home improvement stores, department stores, and online."
    },
    {
      "title": "Insert a 3 in (7.6 cm) long PVC pipe into the run of the tee socket.",
      "content": "Insert a 3 in (7.6 cm) long PVC pipe into the run of the tee socket. Once the longer PVC pipe has been fitted into 1 of the branch openings of the tee socket, take a smaller length of pipe and slide it into the run opening. Push it far enough into the tee socket to be held in place, but not so far that it’s flush against the back wall of the tee socket. [2] X Research source If you insert the pipe too far into the tee socket, the water won’t be able to flow through it."
    },
    {
      "title": "Cut sheet metal to fit the diameter of the pipe for the impeller blade.",
      "content": "Cut sheet metal to fit the diameter of the pipe for the impeller blade. Take a strip of sheet metal about 1 ⁄ 8 inch (0.32 cm) thick and place it on top of the PVC pipe. Use a marker to trace the size of the inside of the pipe over the piece of metal. Take a pair of tin snips or wire cutters to trim the sheet metal to size. [3] X Research source Slide the piece of metal in and out of the pipe to make sure it fits. The sheet metal will serve as the impeller that rotates and drives water through the pump."
    },
    {
      "title": "Clip the outer edges of the metal to form a propeller shape.",
      "content": "Clip the outer edges of the metal to form a propeller shape. Take a pair of tin snips or wire cutters and clip the outer edges of the piece of metal about 1 ⁄ 4 inch (0.64 cm) in toward the center. Make 6 cuts around the metal, then pry the edges up slightly so they form a raised, propeller-like shape. [4] X Research source Use your fingers or the tin snips or wire cutters to pry the edges up slightly."
    },
    {
      "title": "Insert a bicycle spoke through the center of the metal and solder it.",
      "content": "Insert a bicycle spoke through the center of the metal and solder it. Find the center of the piece of sheet metal and punch a hole through it with a centerpunch, nail, or another sharp object. Slide a 10 in (25 cm) bicycle spoke through the hole so the sheet metal is on the end of the spoke. Take a soldering iron and apply solder to the top and bottom of the sheet metal to bond it to the spoke. [5] X Research source If you aren’t used to it, practice soldering first before you attach the sheet metal to the bicycle spoke. You can find soldering irons at craft supply stores and online. Look for bicycle spokes at bicycle repair shops, department stores, and online."
    },
    {
      "title": "Solder a rotor to the other end of the bicycle spoke.",
      "content": "Solder a rotor to the other end of the bicycle spoke. Take a rotor that fits onto a 12V DC motor and connect it to the other end of the bicycle spoke. Use a soldering iron to solder the rotor onto the end of the spoke so it’s firmly connected. Allow the solder to cool completely and wiggle the rotor to make sure it’s securely attached. [6] X Research source If the bicycle spoke is curved at the end, use a pair of wire cutters to clip off the curve so it’s straight. You can find a rotor for a 12V DC motor at hobby shops that sell parts for remote-controlled airplanes and vehicles, as well as online."
    },
    {
      "title": "Drill a hole through a piece of plastic to fit the rotor end of the motor.",
      "content": "Drill a hole through a piece of plastic to fit the rotor end of the motor. Place the end of the 12V DC motor with the small rod that the rotor fits onto against a sheet of plastic at least 1 ⁄ 8 inch (0.32 cm) thick and trace the outline of it with a marker. Take a power drill and attach a bit that matches the size of the outline on the plastic. Drill through the plastic to create an opening that fits your motor. [7] X Research source The motor needs to fit snugly into the piece of plastic to create a tighter seal. You can find thin squares of plastic at hardware stores, home improvement stores, and online."
    },
    {
      "title": "Slide the rotor end of the motor into the slot and seal it with hot glue.",
      "content": "Slide the rotor end of the motor into the slot and seal it with hot glue. Fit the motor into the opening you drilled in the plastic and use a glue gun to apply hot glue where the motor connects to the plastic. Apply pressure to the motor to hold it in place for about 10 seconds so the glue can harden enough to remain attached. [8] X Research source The glue will also help keep water from getting onto the motor when the pump is working. Look for hot glue and hot glue guns at craft supply stores, department stores, and online."
    },
    {
      "title": "Insert the motor into the opening on the rotor to connect it.",
      "content": "Insert the motor into the opening on the rotor to connect it. Slide the small rod sticking out of the rotor end of the motor into the opening on the rotor that’s connected to the bicycle spoke. Push them together or rotate the rotor to tighten it so they’re securely connected. [9] X Research source Some rotors may click or snap into place on the motor."
    },
    {
      "title": "Fit the impeller into the open branch of the tee socket and seal it with glue.",
      "content": "Fit the impeller into the open branch of the tee socket and seal it with glue. Once the glue is dry, slide the end of the bicycle spoke with the impeller on it into the open branch of the tee socket. Apply hot glue to the top of the branch socket and press the plastic sheet with the motor attached to it against it. Hold it in place for about 10 seconds so it sticks. Allow the glue to dry for about 10 minutes. [10] X Research source Keep pressure on the motor and the tee joint so the glue creates a tight seal."
    },
    {
      "title": "Connect the red and black wires on the motor to a 12V battery.",
      "content": "Connect the red and black wires on the motor to a 12V battery. Locate the 2 wires on the back of your 12V DC motor. Connect the red wire to the positive terminal on a 12V battery, which will have a plus sign (+) on it. Then, connect the black wire to the negative terminal, which will have a minus symbol (-) on it. The motor will start turning the impeller blade in the PVC pipe. [11] X Research source"
    },
    {
      "title": "Place the end of the pipe across from the motor into water to pump it.",
      "content": "Place the end of the pipe across from the motor into water to pump it. Once the pump has power from the battery, stick the end of the PVC pipe with the impeller blade into a body of water. The pressure created by the blade will pull the water out and push it through the run opening of the tee socket. Hold the pump in the water for as long as you want to pump it out. [12] X Research source Use a small swimming pool or a bucket of water to test out your pump. Do not submerge the motor. Disconnect the black wire first, then the red wire to deactivate the pump."
    }
  ]
}