{
  "url": "https://www.wikihow.com/Install-an-Aux-in-a-2003%E2%80%902007-Honda-Accord",
  "title": "How to Install an Aux in a 2003‐2007 Honda Accord",
  "steps": [
    {
      "title": "Get everything ready.",
      "content": "Get everything ready. Make sure the vehicle is off and parked with the emergency brake up and in use. [1] X Research source Gather all the items and tools you will need. Refer to the Things You'll Need section at the end of article."
    },
    {
      "title": "Move the shift knob back all the way.",
      "content": "Move the shift knob back all the way. Use the flat-blade screwdriver to remove the small plastic cap piece next to the shift knob. Then, use the flat-blade screwdriver to press down and hold the inside of the uncapped piece and pull the shift knob back all the way."
    },
    {
      "title": "Remove the plastic cover surrounding the shift knob.",
      "content": "Remove the plastic cover surrounding the shift knob. The cover is attached tightly in 6 locations. There are 2 in the back corners, 2 on the sides, and 2 in the front corners by the park \"P\" symbol. Remove it by lodging the flat-blade screwdriver between the plastic cover and rectangular area and pulling up to pop the cover out of place. The cover is easiest to remove by popping out the front corners located by the park \"P\" symbol and one of the sides. Once at least 3 locations are out of place, the cover can be removed by just pulling it with some force. However, be careful as this bezel can easily crack if one side is pulled farther than the other."
    },
    {
      "title": "Remove the 2 corner screws located near the rectangular area of the shift knob.",
      "content": "Remove the 2 corner screws located near the rectangular area of the shift knob. [2] X Research source Unscrew the 2 screws by the front corners using the phillips screwdriver and use the long-nose pliers to remove the screws without them falling into the wiring section. If the screws do fall into the wiring section, refer to Tips at the end of the article."
    },
    {
      "title": "Open the left compartment and remove the rubber tray.",
      "content": "Open the left compartment and remove the rubber tray. Do this using the flat-blade screwdriver and lodging it in the seam until it is well underneath the tray and pushing the tray out from underneath as shown in the image below."
    },
    {
      "title": "Remove the next set of 2 screws and remove the compartment.",
      "content": "Remove the next set of 2 screws and remove the compartment. [3] X Research source Find the 2 screws in the back that need to be removed. (They are circled in the image above.) Use the Phillips screwdriver and the long-nose pliers to remove the 2 screws. Then, use your hand to grip the 2 sectioned compartment and pull to pop it out of place."
    },
    {
      "title": "Remove the power outlet wire and remove the last set of 2 corner screws.",
      "content": "Remove the power outlet wire and remove the last set of 2 corner screws. Remove the wire connected to the power outlet by pressing down on the button on the back of the wire and pulling. Now, the 2 sectioned compartment can be set aside in order to remove the next compartment, which is the largest one. Next, remove the 2 screws at the bottom corners of the large compartment which are circled in the image above. Use the phillips screwdriver and the long-nose pliers to remove the screws."
    },
    {
      "title": "Remove the largest compartment.",
      "content": "Remove the largest compartment. [4] X Research source In order to remove the large compartment, press down and hold at the bottom of the large compartment door in order to reveal the seam between the top of the compartment and the bottom of the stereo. Lodge the flat-blade screwdriver in the seam and push the screwdriver away from you while using your other hand to grip the bottom of the compartment and pop it out of place. The compartment has to pop out of place towards you; therefore, you should pull with your hand from underneath and push away with the screwdriver in order to have this affect. Once the compartment is out of place, pull it out of the area by making sure the compartment door is closed and the bottom of the compartment is removed first. After the compartment is removed, you have access to the wiring of the stereo."
    },
    {
      "title": "Attach the auxiliary system.",
      "content": "Attach the auxiliary system. Attach the auxiliary box to the side of the centered compartments by the passenger seat using Command adhesive products. Also, place the auxiliary box someplace low and a little towards the back in order for the wire to have enough length to reach the wiring section underneath the stereo."
    },
    {
      "title": "Pass the auxiliary wire behind the glove compartment and into the wiring section.",
      "content": "Pass the auxiliary wire behind the glove compartment and into the wiring section. Open and empty out the glove compartment. Then, push in the flexible sides of the open glove compartment so that it slides off the corner hooks holding it open. Once doing so, the glove compartment will be open all the way and touch the mats. This will allow you to have access behind the glove compartment in order to pass the wire behind the glove compartment and through the hole shown in the image below."
    },
    {
      "title": "Connect the wire to the white piece underneath the stereo.",
      "content": "Connect the wire to the white piece underneath the stereo. [5] X Research source Grab the wire passed through the hole and pull it through until you can see it in the wiring section underneath the stereo. Then, connect the wire to its extension which is one of the adjacent ends of the Y cable of colorful wires. Next, attach the opposing end of the Y cable, not the adjacent end, to the white piece underneath the stereo that can be seen if you peek into the wiring section and look up. Use scissors and electrical tape to tape the wires of the Y cable to the wall in order to prevent the compartments to interfere with them as shown in the image below."
    },
    {
      "title": "Check to see if the auxiliary works.",
      "content": "Check to see if the auxiliary works. After the connection is made, turn the car radio on and press the Aux button on the stereo. The CD-C display should appear. [6] X Research source"
    },
    {
      "title": "Put everything back in order using the following steps.",
      "content": "Put everything back in order using the following steps. First, close the glove compartment. Then, put back the largest compartment and screw it in. Place the largest compartment into place by pushing it until it clicks into place. If it is fitting correctly it should not move and the compartment door should be working perfectly. Screw in the 2 screws that were removed in step 7 which are at the bottom corners of the large compartment. Next, put the 2 sectioned compartment back into place and screw it in. Reattach the wire from step 7 to the power outlet in the 2 section compartment and push that down into place. Screw in the 2 screws from step 6 which are in the back of the 2 sectioned compartment. Place the rubber tray back into place by just pushing it down. Screw in the final 2 screws and place the plastic cover. Screw in the final 2 screws from step 4 which are the corners of where the park \"P\" symbol is. Place the plastic cover into place surrounding the shift knob. Finally, put the shift knob back into park \"P\" and cap the small piece next to park \"P\". No screwdriver is required for this, since the shift knob is already not in park. You will be able to do this by just pressing the button on the shift knob and moving it. Then, cap the small piece next the park \"P\" symbol and turn the car off. You're done! Now you can enjoy music from your hand held device in your 2003-2007 Honda Accord."
    }
  ]
}