{
  "url": "https://www.wikihow.com/Ask-God-for-Forgiveness-(Christianity)",
  "title": "How to Ask God for Forgiveness (Christianity)",
  "steps": [
    {
      "title": "Name and admit the thing you’ve done.",
      "content": "Name and admit the thing you’ve done. Before asking forgiveness, you must specifically state the thing you did wrong and admit that you did it. If you’re feeling guilty, you may be tempted to make excuses or deny that you did anything wrong. Forgiveness is impossible if you don’t admit you did something wrong. [1] X Research source You may think, “I guess maybe I shouldn’t have lied, but I had a really good reason and it was a small lie.” You are trying to justify what you did rather than admitting to it. Begin by praying, “Father, I took $5 from my brother without asking him for it.” You have named the sin (stealing) and you have taken responsibility for it without making an excuse. Reader Poll: We asked 1373 wikiHow readers how they would cope with infidelity, and 73% said they would turn to God. [Take Poll]"
    },
    {
      "title": "Tell God that you know what you did was wrong.",
      "content": "Tell God that you know what you did was wrong. Once you have named your action, it’s important to recognize that it was wrong. It’s possible to say what you’ve done but to not believe that you were wrong to do it. Admitting you did it is pointless if you do not admit that you know it was wrong. [2] X Research source You will not receive forgiveness if you say, “I’ve been sleeping with my co-worker even though I’m married, but I don’t see anything wrong with it.” You must recognize what you did as sin, something God is unhappy about."
    },
    {
      "title": "Say that you are sorry for what you did.",
      "content": "Say that you are sorry for what you did. It is not enough to admit that you did something wrong. Now you must apologize for it. Feel sincerely sorry for the wrong, and let that regret come through in what you say to God. It’s important that you are actually remorseful when you say you are sorry. [3] X Research source Asking forgiveness from God is not like when you say sorry to a brother but you really don’t mean it. It must be sincerely from your heart. Say something like, “I know that what I did was wrong, and I feel bad for it. I’m sorry that I broke our relationship. I’m sorry for sinning against you.”"
    },
    {
      "title": "Pray about what you’re feeling.",
      "content": "Pray about what you’re feeling. You must always be honest when you ask for forgiveness. If you believe that God knows your heart anyway, there is no sense in lying to him. Tell Him the guilt you feel for your sin, and that being separated from Him has made you sad. Say, “God, I feel sick to my stomach because I know I have caused you pain.” It can be good to pray aloud to God so that you are saying specifically what is on your mind as opposed to only thinking it."
    },
    {
      "title": "Use scripture in your prayer.",
      "content": "Use scripture in your prayer. God’s word is powerful, and he encourages you to use it when you speak to him. Since the words in the Bible come from God, they show a model for how to talk to God. Search your Bible, or online, to find scriptures about asking for forgiveness. Use those to make your prayer meaningful. Look these scriptures up and pray them in your prayer: Romans 6:23, John 3:16, 1 John 2:2. These scriptures talk about forgiveness. The New Testament is full of truth about forgiveness. Search on your own and find scriptures that speak to you about the forgiveness you’re seeking. You can repeat the scripture verbatim or paraphrase it so it means more to you."
    },
    {
      "title": "Ask God to forgive you for what you’ve done.",
      "content": "Ask God to forgive you for what you’ve done. Just as you would with other people, after saying you are sorry you must ask to be forgiven. There is no special prayer you have to pray to earn forgiveness from God. All you have to do is ask him to forgive you, through Jesus Christ, and believe that he will forgive you. [4] X Research source Say to God, “I denied knowing you to my friend. It was wrong and cowardly for me to do that. I’m sorry I didn’t tell him about your love for us. Please forgive me for my weakness in that moment.\" You do not need to plead, beg, or repeat yourself over and over. Asking God one time, with a genuine heart, is all you have to do."
    },
    {
      "title": "Tell God that you believe He has forgiven you.",
      "content": "Tell God that you believe He has forgiven you. Belief and forgiveness go hand in hand. It’s no good to ask for forgiveness but not believe God will forgive you. God says that when you ask Him to forgive you with a sincere heart, He will forgive. Tell yourself you believe Him and tell God you believe Him. [5] X Research source 1 John 1:9 tells you that, “If we confess our sins, he is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.” Say this scripture to God and believe it. It’s important to remember that forgiven sins are forgotten. Hebrews 8:12 says, \"For I will be merciful to their unrighteousness, and their sins and their lawless deeds I will remember no more.”"
    },
    {
      "title": "Seek forgiveness from people you hurt by what you did.",
      "content": "Seek forgiveness from people you hurt by what you did. Although sin ultimately breaks relationship with God, other people are often hurt, too. When you know that God has forgiven you, it’s important to seek forgiveness from others. Tell the person you are sorry you hurt them and ask them to forgive you. [6] X Research source Remember that you can’t make someone forgive you, and you can’t earn it from them. They will either accept that you are sorry for what you did and forgive you, or they won’t. Don’t pester them if they refuse to forgive. You can’t make them change. Once you have apologized and asked for someone’s forgiveness, you must release yourself from the guilt. Even if they don’t forgive you, you’ve done your part in seeking to make amends."
    },
    {
      "title": "Repent of the wrong behavior.",
      "content": "Repent of the wrong behavior. Once you are forgiven by God for your sin and by others for any hurt you caused, you must turn away from that sin. Make a conscious decision that you will not purposefully commit the same sin again after being forgiven. [7] X Research source You must remember that you will always sin again, but it’s important to say in the moment that you are turning away. The only way to get further from habitual sin is to tell yourself you are not going to do it again. Acts 2:38 is helpful in this process. It says, \"Repent, and let every one of you be baptized in the name of Jesus Christ for the remission of sins; and you shall receive the gift of the Holy Spirit.” Forgiveness is an important step, but walking away from sin is necessary, too, to remain close to God."
    },
    {
      "title": "Work to keep from doing the same wrong thing again.",
      "content": "Work to keep from doing the same wrong thing again. Part of your goal in following Christ is to move further from sin, and this takes committed work. You won’t stop sinning immediately, but if you work on it, you will grow stronger. In Matthew 5:48, God calls you to become perfect, as he is perfect. It’s a goal that you must work toward. [8] X Research source Find people who can help you avoid repeated sins. Learn scripture to combat temptation. Remember that sin only harms and you don’t need it. Spending time reading your Bible, praying to God, and talking with other Christians are all vitally important to living a life that is free of sin."
    }
  ]
}