{
  "url": "https://www.wikihow.com/Fake-Death",
  "title": "Everything You Need to Know About Faking Your Death",
  "steps": [
    {
      "title": "Not technically, but it's hard to fake your death without doing something illegal.",
      "content": "Not technically, but it's hard to fake your death without doing something illegal. On paper, there's nothing stopping someone from faking their own death and vanishing off the face of the earth. Unfortunately, faked deaths and fraud go hand in hand, especially when it comes to things like life insurance payouts. [1] X Research source Faking your death also gets you in trouble in terms of your taxes and long-term payments (like a mortgage or car payment)."
    },
    {
      "title": "Plan the event.",
      "content": "Plan the event. Decide how you want to fake it. Map out the event on paper to better flush out your ideas for the prank. Plan to “die” in front of people you know can handle it. Gather any supplies like fake blood or a trick dagger from a local costume shop. ”Dying” in front of someone will take a lot of convincing and dedication from you. Be prepared to go the extra mile in selling your “death\" to your peers. Try to decide a good location to “die.” You probably don't want to be somewhere too public or else a bystander could call an ambulance. Night is a good time because there won't be as much light on the scene."
    },
    {
      "title": "Plant the seed.",
      "content": "Plant the seed. Pick out one or a group of your friends to witness your faux death. Begin telling them clues that you aren't doing so well. Decide if you want to “die” from an injury or disease. If you're planning a disease induced “death,” tell them about your failing health. Be dramatic to the point of them believing you. Choose symptoms like headache, nausea, jittering limbs, or fainting. If you are planning to “die” from an injury, make up a person who is angry with you. Build up a story about how someone shady is anxious for you to pay them."
    },
    {
      "title": "Enact a sudden death.",
      "content": "Enact a sudden death. Pretend to be in extreme, sudden pain. Fall to the ground holding your side. Place an open packet of ketchup in your mouth so that once you hit the floor it looks like blood is oozing out of your mouth. Make yourself as limp as possible after having a brief convulsion. Control your breathing. Don't let them see your chest rise and fall. Having too much of a spasm can give away your act. Do everything in subtlety when it comes to tricking your friends or the camera. Lay there until people start to get scared. Never let a “trick” get taken out of context. Come forward if the audience becomes too distraught."
    },
    {
      "title": "Prepare your appearance as being injured.",
      "content": "Prepare your appearance as being injured. You can do this in several different scenarios and most of which can happen out of sight from your audience. You could have gotten into a car accident or been severely beaten while being mugged. Roughen up some of your clothes to appear as though you were severely injured. Add blood smears and tears to parts of your outfit. Apply charcoal to parts of your face to look like you've been beaten up. Break an old pair of glasses for an added effect."
    },
    {
      "title": "\"Die” from an injury.",
      "content": "\"Die” from an injury. It's best to have a set time of meeting and show up late for dramatic effect. Make sure your audience is in the location you planned them to be at. Wear the clothes and makeup from your “injury.” Limp onto the scene and begin to mutter audibly what happened like, “a . . . a . . . car crash” or “he sa. . .sa. . . said give me the ma. . .money.” Collapse just before you reach your audience. As mentioned earlier, have an opened packet of ketchup in your mouth for when you fall. Once you hit the ground, bite down on the ketchup and allow it to ooze out of your mouth. Once they start shaking you, asking you if you are alright, say, “gotcha!”"
    },
    {
      "title": "Contemplate your decision.",
      "content": "Contemplate your decision. Some people will view this as going overboard. Before you go through with getting your own obituary published, re-think your reasons and desires for doing so. If this is for a practical joke, it could be over-the-top and funny for that reason. If you are doing this for spite or legal reasons, do not go through with this. While planning this, contact any family members that may read the obituary and tell them the truth before they begin grieving."
    },
    {
      "title": "Write your obituary.",
      "content": "Write your obituary. Obituaries can be as long and detailed as you wish. It is best to keep them brief and too the point. Write in short, but clear sentences. A good start could be: ”O'Neill, Eric B. age 28 of California passed away April 20, 2016. Eric's greatest joy was caring for his hamster, Button Boy. “ Many newspapers charge by the line and have packaged deals for the number of lines like four lines for $40 and 40 lines for $400. [2] X Research source"
    },
    {
      "title": "Prep the information.",
      "content": "Prep the information. To successfully publish an obituary, you'll need to provide to the newspaper a name, address, and phone number for the person paying for the obituary. On top of that information, you'll need the name and phone number of the mortuary or cremation provider. This record is usually kept confidential unless consent is provided by you. If in doubt you can coerce the newspaper with a fake name and use a willing friend's phone number. [3] X Research source"
    },
    {
      "title": "Send in the application.",
      "content": "Send in the application. Once you finish the application, you're ready to send in the obituary and payment. These days newspapers will accept obituary notices via phone, email, fax, or mail. Look into the requirements of your local newspaper before applying. [4] X Research source"
    },
    {
      "title": "Create a fake Facebook account.",
      "content": "Create a fake Facebook account. You'll need to create an additional account on Facebook to take over your account once Facebook deems you “dead.” You'll also need to deem someone as your legacy contact if you are trying to trick the internet. Change the relationship status. Make the fake Facebook account a sibling of yours via Facebook's family setting. This will make it easier to convince Facebook that your “death” is legitimate. Add several friends of yours on the fake account."
    },
    {
      "title": "Choose a legacy contact.",
      "content": "Choose a legacy contact. From your current Facebook profile, set your legacy contact in your settings as your “fake” sibling (which you just created). Facebook will give you a template that you can expand or detract from. You can find the legacy contact in the security section which is found in the settings menu."
    },
    {
      "title": "Get a few willing friends.",
      "content": "Get a few willing friends. You'll need at least a couple of friends to write “RIP” on your Facebook wall. This will help curb any suspicions from the Facebook team responsible for memorializing accounts. Ask a small network of friends. You might be able to get the request accepted without the help of your friends, but it doesn't hurt your chances."
    },
    {
      "title": "Send in a memorialization request.",
      "content": "Send in a memorialization request. From the fake account fill out a memorialization request for yourself. It helps if you are good with an image editing software in order to generate a fake article about your death. If there is anything you can use, submit it through the memorization request. The additional obituary or newspaper article is only optional as it says on Facebook."
    },
    {
      "title": "Wait for the confirmation.",
      "content": "Wait for the confirmation. It should take a couple of days for Facebook to review your request. Once they do they will send either a confirmation or denial to your fake account. Try not to log into your real Facebook account until you received a confirmation from Facebook. Once they memorialize your account, you will have complete control of your “old” Facebook through the fake account."
    }
  ]
}