{
  "url": "https://www.wikihow.com/Create-a-Mail.com-Email-Account",
  "title": "How to Open a Free Mail.com Email Account",
  "steps": [
    {
      "title": "Go to Mail.com.",
      "content": "Go to Mail.com . Go to your local search engine and search 'Mail.com'. You'll see a search result that says Free email accounts | Register today at mail.com ."
    },
    {
      "title": "Click on the Create an account button.",
      "content": "Click on the Create an account button. It's in the upper-right corner with an icon of a person."
    },
    {
      "title": "Select an email address.",
      "content": "Select an email address. You can enter the first half your email in the text box, and you can select what domain your email is at in the drop down. You must have a unique email address name to sign up, so click the blue Check button to make sure the email is available."
    },
    {
      "title": "Click your gender.",
      "content": "Click your gender. The options are Ms (female), Mr (male), or Other."
    },
    {
      "title": "Fill in your name.",
      "content": "Fill in your name. Enter your first and last names in the respective text boxes."
    },
    {
      "title": "Add your location.",
      "content": "Add your location. Choose the country you are from by scrolling through the list and clicking on your country. Type in what state you live in (if applicable) in the appropriate text box."
    },
    {
      "title": "Put in your date of birth.",
      "content": "Put in your date of birth. Fill in your date of birth by stating the month, date, and year you were born in."
    },
    {
      "title": "Choose a secure password.",
      "content": "Choose a secure password. Choose a desired password and fill it in the box. After you choose a password and write it, retype it again in the next box to ensure this is the password you want. Pick a password that has more than eight characters has a mix of letters and numbers, includes capital letters, and has symbols. Choosing a good password keeps it safe and secure."
    },
    {
      "title": "Add a recovery phone number.",
      "content": "Add a recovery phone number. This will allow you to get back in to your email inbox if you forget your username or password."
    },
    {
      "title": "Complete the reCAPTCHA.",
      "content": "Complete the reCAPTCHA. Simply check the box and complete the security prompt to register."
    },
    {
      "title": "Click I agree. Create an email account now.",
      "content": "Click I agree. Create an email account now . Read the Privacy Policy and Terms and Conditions, linked on the sign up page, if you desire. This will create your Mail.com email inbox."
    },
    {
      "title": "Go to your inbox.",
      "content": "Go to your inbox. After checking your information, you can start using your account by clicking the below button that is blue and says, Continue to inbox ."
    },
    {
      "title": "Decide if you'd like to go premium.",
      "content": "Decide if you'd like to go premium. When you click Continue to inbox , a page will appear asking if you'd like to get the premium membership. The premium member provides more features to your email client and keeps your inbox ad-free. You can choose to go premium by clicking the big blue button that says, Go Premium or you can continue with the free account and click No thanks, go to inbox"
    },
    {
      "title": "Enjoy using Mail.com!",
      "content": "Enjoy using Mail.com! Once you've created your account, you can start composing and receiving emails."
    }
  ]
}