{
  "url": "https://www.wikihow.com/Finish-Live-Edge-Slabs",
  "title": "How to Finish Live Edge Slabs",
  "steps": [
    {
      "title": "Purchase the slab from a store if you want to minimize your work.",
      "content": "Purchase the slab from a store if you want to minimize your work. You can find pre-cut and pre-dried slabs in lumber stores and stores that specialize in woodworking supplies. Online stores are a great place to purchase unique slabs made from rare varieties of wood as well. Look for slabs that are at least 2 inches (5.1 cm) thick. [1] X Research source You can cut the slab from a piece of felled lumber, or have a lumber mill do it for you. Choose wood that was felled during the summer. It will be easier to remove the bark later on. Knots, burls, and limbs often reveal surprising patterns and textures. Take these into consideration when picking your slab."
    },
    {
      "title": "Wait 1 to 2 weeks for store-bought slabs to acclimate.",
      "content": "Wait 1 to 2 weeks for store-bought slabs to acclimate. If you choose to buy a slab from the store, you need to wait 1 to 2 weeks before you use this. This will give the wood enough time to adjust to the humidity of your home. [2] X Research source If you cut the slab yourself, or had a saw mill do it for you, air-dry or kiln-dry the slab first."
    },
    {
      "title": "Cut the slab down to the right length, if needed.",
      "content": "Cut the slab down to the right length, if needed. Secure the slab to your workbench with hand screws. Add a MDF (medium density fiberboard) strip if you need a straightening guide. Cut the slab to the length you need with a 7 1/4-inch (18-cm) circular saw ."
    },
    {
      "title": "Remove the bark in sections with a rounded chisel.",
      "content": "Remove the bark in sections with a rounded chisel. Even though bark can look beautiful, it is difficult to maintain and keep clean. In some cases, it can fall off and make a mess on the floor. Wedge a rounded chisel under the bark, then use it to peel the bark off in 6 to 8-inch (15 to 20-cm) sections. [3] X Research source Work your way along the edge of the slab. If you work across it, you may gouge the surface and leave marks. Scrape the fibers off with a nylon or wire brush."
    },
    {
      "title": "Sand the edge with a rotary tool and a sanding flap wheel.",
      "content": "Sand the edge with a rotary tool and a sanding flap wheel. A rotary tool comes with many different attachments. Get the attachment that looks like a bunch of pieces of sandpaper bound together to form a wheel. Start with a 120-grit wheel, then work your way up to 180- and 220-grit. You are only sanding the edge that had the bark on it for now. [4] X Research source The flaps typically only have sandpaper on 1 side. Make sure that you are moving your rotary tool with these flaps facing forward. Don't move the tool back-and-forth. How much you sand the edge is up to you. Lots of woods often have worm holes under the bark. You can sand these off or leave them on for a cool effect."
    },
    {
      "title": "Sand the sharp edges on the ends of the slab, if needed.",
      "content": "Sand the sharp edges on the ends of the slab, if needed. Live edge slabs usually have bark on 2 sides; the other 2 sides are sometimes jagged from where they were cut. If this is the case with your slab, sand the roughness away with 120-grit sandpaper. Work your way to 150-, 180-, 220-, and 320-grit. [5] X Research source If you have a round slab, or a slab with bark on all 4 sides, you can skip this step."
    },
    {
      "title": "Decide how much you want to flatten and smooth the surface.",
      "content": "Decide how much you want to flatten and smooth the surface. A slab with an uneven face (top surface) would work great for a rustic side table. A slab that is going to be used as a writing desk will need a smoother finish and perfectly-flat face. [6] X Research source You don't need to finish sanding both the top and bottom faces."
    },
    {
      "title": "Flatten the face with a plunge router to your desired smoothness.",
      "content": "Flatten the face with a plunge router to your desired smoothness. Build a jig to fit your slab first. Use a power sander with a 60- or 80-grit to smooth the face down. Keep sanding until you get marks, but don't sand it smooth yet. [7] X Research source You can flatten the bottom of the slab too for a nicer finish."
    },
    {
      "title": "Stabilize any splits in the face with butterfly keys.",
      "content": "Stabilize any splits in the face with butterfly keys. Trace the keys onto the wood with a marking knife. Lift them away, then carve the shapes out with a chisel. Glue the keys into the holes with clear 2-part epoxy. Let the epoxy cure, trim the keys until they are flush with the face, then sand them smooth. [8] X Research source Butterfly keys are blocks of wood shaped like bowties. Use a block plane or a powder sander to trim the keys. Use a sanding block or sandpaper to sand the eyes. If there is a split in the underside of the slab, you should install butterfly keys too."
    },
    {
      "title": "Clean out any loose bark trapped within the wood.",
      "content": "Clean out any loose bark trapped within the wood. Sometimes, small pieces of bark will get trapped within the wood as the tree grows. You should scrape these inclusions out. You can leave resulting voids hollow for a rustic finish, or you can fill them in with a clear or tinted epoxy; do not use an opaque epoxy, however, or it won't look natural. [9] X Research source You are doing this after you sand the faces because some pieces of trapped bark may not get revealed until after you sand them."
    },
    {
      "title": "Check the slab for voids, then tape off the sides, if needed.",
      "content": "Check the slab for voids, then tape off the sides, if needed. Voids are holes in the surface of the wood. If they are in the middle of the wood, you don't need to tape off anything. If the holes extend to the edges of the slab, however, you need to cover the edge in that area with masking tape. The tape will act like a dam and prevent the epoxy from leaking out. [10] X Research source You can also use plumber's putty for this, but it can be difficult to remove--a quick blast from an air compressor hose ought to do the trick, however. If you choose to leave the voids hollow for a rustic look, skip past this entire section."
    },
    {
      "title": "Prepare a 2-part clear epoxy.",
      "content": "Prepare a 2-part clear epoxy. How you prepare it depends on the brand that you are using. In most cases, you will need to mix equal amounts of Parts A and B, then mix them in a disposable cup. If you want to, you can tint the epoxy using a clear resin dye. [11] X Research source Test your epoxy on the voids on the underside of the slab. If you plan on tinting the epoxy, coat the wood with shellac first. This will prevent the epoxy from soaking into the wood and forming a \"halo\" of color."
    },
    {
      "title": "Pour the epoxy into the voids.",
      "content": "Pour the epoxy into the voids. You want to work quickly, but you also want to pour slowly. Don't leave the epoxy sitting on the table. As soon as you have it mixed together, pick the cup up and slowly pour it into the voids. You want to pour slowly because if you pour too fast, you may get bubbles. If you have a lot of voids, it's best to work in small batches, otherwise the epoxy will cure before you finish. Use enough epoxy so that it is level with the surface of the wood."
    },
    {
      "title": "Allow the epoxy to cure, then remove the tape.",
      "content": "Allow the epoxy to cure, then remove the tape. How long this takes depends on what brand you are using. Some types of epoxy cure within minutes, while others can take an hour or so. Once the epoxy has cured, you can remove the masking tape or plumber's putty."
    },
    {
      "title": "Use a card scrapper to remove excess epoxy.",
      "content": "Use a card scrapper to remove excess epoxy. Sometimes, a small amount of will still leak out from under the tape or putty dam. If that happened, simply use a card scrapper to pick it off."
    },
    {
      "title": "Sand the surface until you get the smoothness you want.",
      "content": "Sand the surface until you get the smoothness you want. Start with 80-grit sandpaper, then work your way up to 220-grit. How much you sand is really up to you; the more you sand, the smoother the finish will be."
    },
    {
      "title": "Vacuum your workspace to get rid of any dust.",
      "content": "Vacuum your workspace to get rid of any dust. This is very important, as any dust left behind from sanding can get trapped in your finish. This can lead to a messy, unprofessional finish. [12] X Research source"
    },
    {
      "title": "Seal the surface with polyurethane if you want to keep things simple.",
      "content": "Seal the surface with polyurethane if you want to keep things simple. Apply a coat of polyurethane coating with a sponge brush. Wait for the coat to dry, then sand it with 500-grit sandpaper. Do this 2 more times, then wipe the surface down with mineral spirits. Wet-sand the surface with a 2000-grit sanding pad. Wipe the residue off, then allow it to dry overnight. [13] X Research source"
    },
    {
      "title": "Use shellac and lacquer for a natural, glossy finish.",
      "content": "Use shellac and lacquer for a natural, glossy finish. Apply 1 coat of shellac, then let it dry. Sand it with 400-grit sandpaper. Repeat this 2 more times for a total of 3 coats. Allow the shellac to dry completely. Finish off with a spray of lacquer for extra-durability. [14] X Research source"
    },
    {
      "title": "Apply wood oil, butter, and wax if you want bring out the natural grain.",
      "content": "Apply wood oil, butter, and wax if you want bring out the natural grain. Rub 1 coat of wood oil into the wood with a cotton rag. Let it dry, then wipe the rest off. Do this 1 to 2 more times. Follow up with 2 coats of wood butter using the same technique. Finish off with 1 coat of wood wax. Let it set, then buff the excess off. Let it cure overnight before applying a second coat. Allow the wax to cure for 3 days, then buff it."
    },
    {
      "title": "Allow the finish to cure before you use the slab.",
      "content": "Allow the finish to cure before you use the slab. How long the slab needs to cure for depends on what type of finish you used. Some finishes need only a few hours to cure while others need a couple of days. Check the instructions on the label of the jar or bottle. Once the finish has cured, you can turn your slab into a bench, table, headboard, etc."
    }
  ]
}