{
  "url": "https://www.wikihow.com/Get-Iron-in-Animal-Crossing",
  "title": "How to Mine Iron Nuggets in Animal Crossing: New Horizons",
  "steps": [
    {
      "title": "Craft a shovel or an axe.",
      "content": "Craft a shovel or an axe. You'll need the recipe to craft both of these items. You can get both soon after arriving at your island by following Tom Nook's instructions and completing his free workshop. You can use the workbench inside the Resident's Services tent to craft tools. Use one of the following steps to get the recipe and craft a flimsy axe or a flimsy shovel: [1] X Research source Filmsy Axe: When you get to your island, Tom Nook will ask you to catch a few bugs or fish . Follow his instructions and give him a couple of bugs or fish after catching them. He will give you the flimsy axe recipe as a reward. A flimsy axe requires 5 tree branches and 1 stone to craft. [2] X Research source Flimsy Shovel: Continue collecting bugs and fish for Tom Nook. Once you give him 5 specimens, he will invite Blathers, the museum curator, to the island. Talk to Blathers to get a recipe for crafting a vaulting pole, and a flimsy shovel. A flimsy shovel can be crafted from 5 pieces of hardwood, which can be gathered by hitting trees with an axe."
    },
    {
      "title": "Locate a large rock.",
      "content": "Locate a large rock. There are 6 large rocks scattered across your island. They are placed at random. Search your island to find all the large rocks."
    },
    {
      "title": "Hit the rock with an axe or a shovel.",
      "content": "Hit the rock with an axe or a shovel. Go ahead and equip an axe or a shovel. Begin hitting the large rock. Rocks randomly drop stone, clay, iron nuggets, Bells, and on rare occasions, gold nuggets when struck with an axe or a shovel. Once it is first struck, you have 10 seconds to get as many materials from the rock as possible. When you strike a rock, you will bounce back a step. This costs precious time needed to gather as many materials as possible. To prevent bouncing back, dig a hole behind where you stand as you face the rock and strike it. Once the 10 seconds are up, you will not be able to gather any more materials from the rock. If you still need more iron rocks after exhausting all the rocks on your island, you can either wait for them to respawn the next day, or you can travel to another island and mine more materials from the rocks on that island. You need to purchase Nook Miles from the Nook Stop to travel to a new island, or you can visit a friend's island online. Rocks have about a 30% chance of dropping an iron nugget each time they are struck. On rare occasions, you can get iron nuggets by popping balloons with a slingshot, or by talking to other residents, who will give you iron nuggets as a gift."
    },
    {
      "title": "Build Nook's Cranny.",
      "content": "Build Nook's Cranny. After you unlock the museum and pay off your first loan, you can talk to Timmy and Tommy about building the Nook's Cranny . Nook's Cranny is a store that has many items, including tools, wallpapers, floors, furniture, DIY recipes, flower seeds, tree saplings, and more. [3] X Research source You will need 30 iron nuggets, 30 wood pieces, 30 softwood pieces, and 30 hardwood pieces to build Nook's Cranny. [4] X Research source"
    },
    {
      "title": "Upgrade your tools.",
      "content": "Upgrade your tools. When you first start out in Animal Crossing, you get access to the flimsy tools. These have a limited number of uses (about 40 uses). With 1 iron nugget, you can upgrade your flimsy axe, shovel, fishing rod, watering can, or net, to a regular and more sturdy tool. All you need is a flimsy tool, an iron nugget, and a workbench."
    },
    {
      "title": "Craft furniture.",
      "content": "Craft furniture. Many furniture recipes require iron nuggets in order to craft."
    },
    {
      "title": "Sell for Bells.",
      "content": "Sell for Bells. If you have an excess of iron nuggets, you can sell them at Nook's Cranny for Bells."
    }
  ]
}