{
  "url": "https://www.wikihow.com/Defend-a-Punch",
  "title": "How to Defend a Punch",
  "steps": [
    {
      "title": "Turn your body so 1 shoulder is pointed at your attacker.",
      "content": "Turn your body so 1 shoulder is pointed at your attacker. This will create a smaller target for your attacker. You would have more vulnerable areas to defend if you faced your attacker straight on. If your dominant hand is your right hand, your left shoulder will be pointing towards your attacker. The opposite applies if your left hand is dominant. The stance should feel natural, and not uncomfortable or forced."
    },
    {
      "title": "Pivot 1 foot towards the attacker, and turn the other out behind you.",
      "content": "Pivot 1 foot towards the attacker, and turn the other out behind you. This will not only ground you, but it will also allow you to move quickly in any direction without losing your balance. Your feet should be about shoulder with apart, but if it feels more natural to widen your stance, you can."
    },
    {
      "title": "Keep your distance.",
      "content": "Keep your distance. You want to have an approximate distance of 2 or 3 times the attacker’s arm length between you. It is much easier to evade a punch that is reaching for you than it is to evade a punch in close proximity to you. Just make sure not to back yourself up against a wall."
    },
    {
      "title": "Watch the shoulder of the attacker to predict a punch.",
      "content": "Watch the shoulder of the attacker to predict a punch. The punching motion starts in the shoulder muscles. The muscles around the shoulder will flex, and the shoulder will rise slightly before pulling back into a punch. So by watching the shoulder of your attacker, you will be able to see when the attacker is going to punch before they even swing. [1] X Research source You'll react much faster if you study this in advance. Try looking at yourself in the mirror, and watch your shoulder as you pull back your arm to fake a punch. You will learn the signs of an incoming punch quicker this way, but know that even a partially successful dodge can turn a brutal blow into a glancing one. [2] X Research source"
    },
    {
      "title": "Step out of the direct line of the punch.",
      "content": "Step out of the direct line of the punch. You will have a better chance of evading the punch by shifting to the left or to the right than you would by backing up. Walking backwards tends to feel like an unnatural movement, and might cause you to trip and fall. [3] X Research source"
    },
    {
      "title": "Swing your shoulder back to pull your torso away.",
      "content": "Swing your shoulder back to pull your torso away. If you are not able to step sideways, then opt for just twisting your body out of the direct line of the punch. This will allow you to evade the incoming punch, but also give you time to move out of the way from any additional punches. While the attacker is approaching, it should always be your goal to be ready to predict and dodge the next attack."
    },
    {
      "title": "Turn your head out of the punch’s path.",
      "content": "Turn your head out of the punch’s path. You want to protect your head at all costs, so keep your head away from the center of the attacker’s body. This will set you up to evade any additional punches."
    },
    {
      "title": "Step aside from the attacker’s advancement.",
      "content": "Step aside from the attacker’s advancement. You want to create enough distance between you and the attacker so you don’t get hit, but also stay close enough to be able to reach out and deflect the punch. Try and stay just outside of the attacker’s arm length. [4] X Research source To quickly step aside, start by having your body angled with your non-dominant shoulder pointing towards your attacker, and your feet shoulder width apart."
    },
    {
      "title": "Sweep 1 arm outward to deflect your attacker’s outstretched arm.",
      "content": "Sweep 1 arm outward to deflect your attacker’s outstretched arm. Your goal is to strike the attacker’s forearm with the outside of your own, deflecting it away. Make sure to only use 1 arm to deflect; you want to keep your other hand free to block a punch from the attacker’s other fist. [5] X Research source This is most successful against a big, swinging punch. For a big, swinging punch, the attacker’s body weight will shift backwards, and the attacker’s shoulder will rise significantly before advancing. Deflecting a fast, direct punch, where the attacker gives minimal signals other than in the small rise and flex of the shoulder muscles, will take considerable skill. You will be more successful dodging the fast, direct punches than deflecting them. [6] X Research source"
    },
    {
      "title": "Run away if your attacker is caught off balance.",
      "content": "Run away if your attacker is caught off balance. If you use enough force behind the push, then this may even knock your opponent off balance and give you an opportunity to run away . [7] X Research source"
    },
    {
      "title": "Push high punches upward.",
      "content": "Push high punches upward. If the punch is aimed at your face, then point your wrist outward and throw your arm up against the incoming arm, pushing it upward. This will defect the punch aimed at your face. Just remember to step aside and turn away from the attacker if possible. You want to be able to take any opportunity to run away from your attacker. [8] X Research source"
    },
    {
      "title": "Sidestep out of the direct line of the punch.",
      "content": "Sidestep out of the direct line of the punch. You want to be able to create distance between you and the outstretched arm but to also leave yourself enough space to grab the attacker’s wrist. Position yourself just outside of the attacker’s arm length. [9] X Research source When doing this, it is best to have your body angled, pointing your non-dominant shoulder to the attacker, and having your feet shoulder width apart. This stance will allow you to evade or advance quickly."
    },
    {
      "title": "Turn your arm and grab the attacker’s wrist.",
      "content": "Turn your arm and grab the attacker’s wrist. If you are unable to get away after successfully deflecting a punch, then this action, though difficult to execute, may be your best follow-up option. After grabbing the attacker’s wrist, you do, however, have options on how you want to proceed."
    },
    {
      "title": "Throw your weight against the attacker’s arm and pull them forward.",
      "content": "Throw your weight against the attacker’s arm and pull them forward. If you use enough force, your attacker will either fall over or lose their balance long enough for you to run away."
    },
    {
      "title": "Strike your other forearm against the attacker’s elbow in dire situations.",
      "content": "Strike your other forearm against the attacker’s elbow in dire situations. This motion should hyperextend or break the attacker’s outstretched arm. You should only do this if you are in a serious situation and feel that you are unable to use your weight against your attacker to get away. [10] X Research source"
    },
    {
      "title": "Disorient your attacker by hitting a vulnerable area.",
      "content": "Disorient your attacker by hitting a vulnerable area. If the arm-grabbing maneuver does not seem within your ability, then fight back with a direct attack to a vulnerable area instead. A hard blow or gouge may disorient the attacker long enough for you to escape. Ideally, you want to aim for the eyes, groin (if the attacker is male), stomach, temples, or the point of the chin."
    },
    {
      "title": "Turn your body so the punch lands on your shoulder, arm, hip, or thigh.",
      "content": "Turn your body so the punch lands on your shoulder, arm, hip, or thigh. This will still be painful, but you have a much lower chance of serious injury than a blow to the abdomen or face."
    },
    {
      "title": "Cover the sides of your head with your forearms.",
      "content": "Cover the sides of your head with your forearms. Your forearms should be covering your ears to protect your temples, and your wrists should be behind your head with your elbows pointing outwards by your face. If done correctly, then your forearms will be parallel with the ground."
    },
    {
      "title": "Interlock your fingers so that your hands grip the back of your head.",
      "content": "Interlock your fingers so that your hands grip the back of your head. This will lock in the cradle, or helmet guard, position so you can properly protect the most vulnerable parts of your head. Just make sure that your arms are pulled inward so that they are flush against the sides of your head. The technique will not be as effective in absorbing the punch otherwise."
    },
    {
      "title": "Turn slightly away from the punch without exposing your back.",
      "content": "Turn slightly away from the punch without exposing your back. You don’t want to turn so much that the punch lands squarely on your spine or neck, as this can cause serious injuries. Instead, pivot your body slightly, so that the punch will land on your cradled arms."
    },
    {
      "title": "Clench your teeth and push your tongue against the roof of your mouth.",
      "content": "Clench your teeth and push your tongue against the roof of your mouth. Being punched, even if you are properly absorbing it, can still be jarring for your body. So while protecting the outside of your head, you also need to think about the inside as well. [11] X Research source Clenching your teeth will keep you from cracking or breaking them. Pushing your tongue to the roof of your mouth will keep you from accidentally biting your tongue. Think of this as an impromptu mouth guard. [12] X Research source"
    }
  ]
}