{
  "url": "https://www.wikihow.com/Distinguish-Mennonites-from-Amish",
  "title": "How to Distinguish Mennonites from Amish",
  "steps": [
    {
      "title": "Originally there were no Mennonites or Amish; there were only Anabaptists.",
      "content": "Originally there were no Mennonites or Amish; there were only Anabaptists. However, in sixteenth-century Holland, a man named Menno Simons joined the Anabaptists and became prominent among them. About a century after Simons, a Swiss Anabaptist named Jacob Ammon began to preach that the Anabaptists were not following their founding principles closely enough. Thus followers of his ideas became known as Amish and separated from the Anabaptists. The remaining Anabaptists became known as Mennonites after Menno Simons. [2] X Research source"
    },
    {
      "title": "The Amish and Mennonites both came from a common root, the Anabaptists, a Protestant religious group that first appeared in the 1500s.",
      "content": "The Amish and Mennonites both came from a common root, the Anabaptists, a Protestant religious group that first appeared in the 1500s. The Amish split off from the Mennonites in the late 1600s because they believed that the other Anabaptists were not following Anabaptist beliefs closely enough. [3] X Research source The basic ideas of Anabaptism are: [4] X Research source Religion is a choice for adults to make (as opposed to the custom of infant baptism in Catholicism) Devotion to God Shunning secularism (ex: pop culture, non-religious media)."
    },
    {
      "title": "The Amish dress plainly in solid colors.",
      "content": "The Amish dress plainly in solid colors. Men wear black pants and shirts of a number of colors, along with straw hats, while women wear dresses and aprons with bonnets. Men typically have beards but no mustache, and often have a bowl haircut, while women usually wear their hair in a bun. [5] X Research source Most Mennonites, however, have mainstream clothes and hairstyles, and are often indistinguishable from anyone else."
    },
    {
      "title": "The Amish separate themselves from modern society.",
      "content": "The Amish separate themselves from modern society. They don't drive cars or have electricity in their homes. They usually don't go on to higher education. Typically, the men hold jobs such as farming or woodworking. They hold religious meetings in their homes or barns and often live in small farming communities. They don't want their photos taken, so please do not try. Mennonites are typically more integrated with modern society. [6] X Research source"
    },
    {
      "title": "While the Amish technically avoid modern technology, they often have telephones at the edge of their properties and other modern conveniences close at hand.",
      "content": "While the Amish technically avoid modern technology, they often have telephones at the edge of their properties and other modern conveniences close at hand. Some, the New Order Amish, are near-fully integrated with mainstream society. And then there are the Old Order Mennonites, who dress plainly and reject modern technologies. If all of this seems confusing to you, don't be embarrassed. [7] X Research source"
    },
    {
      "title": "If all else fails, just ask.",
      "content": "If all else fails, just ask. Be polite and respectful, and the person in question will likely be glad to tell you."
    }
  ]
}