{
  "url": "https://www.wikihow.com/Force-Steam-Deck-Resolution",
  "title": "How to Change Display Resolution on a Steam Deck",
  "steps": [
    {
      "title": "Place the Steam Deck in its Dock.",
      "content": "Place the Steam Deck in its Dock. You can only change the Steam Deck's resolution when it is docked. It is not possible to alter the resolution while in handheld mode. Note that the Dock for the Steam Deck is sold separately."
    },
    {
      "title": "Press the STEAM button.",
      "content": "Press the STEAM button. It is the small button located on the left side of your Steam Deck."
    },
    {
      "title": "Navigate to Settings > Display.",
      "content": "Navigate to Settings > Display. Comb through your Steam Deck settings until you reach the Display subsection."
    },
    {
      "title": "Set your preferred resolution.",
      "content": "Set your preferred resolution. Steam allows you to select just about any resolution up to the maximum of 3840x2160. However, the Steam Deck may struggle to run most games above 1080p, so we suggest maxing out at 1920x1080 to avoid any drops in frame rate. You can also select Default to use the default setting for each game you run, or Native to stick to the Steam Deck's native resolution of 720p. You can also force your Steam Deck to run a different resolution for certain games by following this method."
    },
    {
      "title": "Open the page for a specific game.",
      "content": "Open the page for a specific game. You can set unique resolution preferences for each individual game on your Steam Deck. [1] X Research source Open a game's page in your Steam Library to get started. Make sure you have updated your Steam Deck before continuing. Forcing resolution is only available on Steam Decks that are up-to-date."
    },
    {
      "title": "Click the gear icon.",
      "content": "Click the gear icon. This will open a drop-down menu."
    },
    {
      "title": "Select \"Properties\".",
      "content": "Select \"Properties\". This will open a separate menu, where you can update various preferences related to this specific game."
    },
    {
      "title": "Select a new resolution.",
      "content": "Select a new resolution. Navigate to the General subsection and then Game Resolution . Select a new resolution. You may select any resolution, but we recommend maxing out at 1920x1080, as 1080p is the best your Steam Deck can run before risking any drops in frame rate. You can also select Default to use the default setting for each game you run, or Native to stick to the Steam Deck's native resolution of 720p."
    },
    {
      "title": "Upscale gaming resolutions with FSR.",
      "content": "Upscale gaming resolutions with FSR. Steam Deck supports FSR, or FidelityFX Super Resolution. FSR uses machine learning to upscale gaming resolutions without hindering performance. FSR is a great way to improve upon the Steam Deck's limitations and experience higher-res gaming even with a more limited resolution setting. To use FSR: Start playing a game. Boot up a game on your Steam Deck and begin playing. Hit the Quick Access Button ... . This will pause your game and open an options menu. Navigate to the Performance tab. It is represented by a battery icon. Then, select Advanced . Scroll down to the Scaling Filter slider and select FSR. Move the slider to the far right end, labeled FSR . Adjust the FSR Sharpness. The scale runs from 0-5, with a 5 representing the sharpest adjustment FSR can make on your Steam Deck's current resolution. Drop your in-game resolution even lower to improve performance. Continue tinkering with the FSR and resolution settings until you find a combination you are comfortable with."
    },
    {
      "title": "Adjust your Scaling Filter slider to increase graphics or performance.",
      "content": "Adjust your Scaling Filter slider to increase graphics or performance. In addition to FSR, the Scaling Filter includes three other options: Linear - Normal scaling, can be a bit blurry. Nearest - Scales to avoid blurriness, but can become pixelated instead. Integer - Maximizes scaling to produce a flawless image, but can only run in a window that fills up to half the screen."
    },
    {
      "title": "The Steam Deck's default resolution is 1280x800.",
      "content": "The Steam Deck's default resolution is 1280x800. That is roughly equivalent to 720p. That's not a bad resolution, but gamers accustomed to 4K gaming may be expecting a little more from their rig. The Steam Deck's 1280x800 resolution results in a unique 16:10 aspect ratio, which differs from the more common 16:9 ratio that gamers have come to expect. Some games may not support 16:10, and will therefore display with black bars on the side. The Steam Deck is built to run games up to 720p, so it may struggle to run games with higher resolutions or refresh rates."
    },
    {
      "title": "When docked, the Steam Deck supports resolutions up to 3840x2160.",
      "content": "When docked, the Steam Deck supports resolutions up to 3840x2160. This resolution allows for 4K gaming via an external monitor or TV. The Steam Deck Dock is sold separately from the portable gaming device, but you can use the Dock to connect your Deck's display to an external monitor or TV via HDMI 2.0. Your Steam Deck's resolution will automatically adjust to match that of your external display."
    }
  ]
}