{
  "url": "https://www.wikihow.com/Protect-Your-Braids-at-Night",
  "title": "How to Protect Box Braids and Cornrows at Night",
  "steps": [
    {
      "title": "Wrap a silk or satin scarf around your braids",
      "content": "Wrap a silk or satin scarf around your braids to keep your braids from moving. Use a large, 40 by 40 in (1.0 by 1.0 m) piece of fabric to completely cover your braids to prevent unwanted friction and frizziness overnight. [1] X Expert Source Ndeye Anta Niang Professional Hair Stylist & Master Braider Expert Interview. 10 January 2020. Simply fold a silk or satin head scarf into a triangle and drape it over your head, with the larger point against the back of your hair. Make sure the scarf covers the edges of your braids. Take each end of the scarf back around your head to the opposite side, so they criss-cross in the back. Bring the ends up to the top of your head and tie a knot to secure the scarf in place. [2] X Research source A “sock-style” scarf is an alternative option that goes over your braids like a sock or pillowcase. For this type of scarf, it’s easier to tie your braids up with an elastic before sliding the scarf into place. [3] X Research source Some people prefer tying their braids up in a bun or knot before wrapping them with a scarf to help them stay in place. If you’d like to do this, aim for a looser updo that doesn’t strain the edges of your braids. [4] X Research source If you have shorter braids, try using a silk bonnet . Simply place the bonnet on your head like a hat and tuck your braids inside."
    },
    {
      "title": "Use a special bandana wrap if your braids are thick and long.",
      "content": "Use a special bandana wrap if your braids are thick and long. If you have 5 to 6 long, coiled braids, it may hurt and put strain on your scalp to tie them up in a traditional silk scarf. Instead, use a large, square silk scarf with 2 long ties . Place the large square of silk along the back of your neck on top of your braids, then secure the 2 ties on top of your head. This keeps the edges of your braids nice and smooth even as you sleep. [5] X Research source If you’re unsure about the best way to cover your hair, ask your hairstylist for recommendations."
    },
    {
      "title": "Sleep on a satin pillowcase to minimize frizz and prevent breakage.",
      "content": "Sleep on a satin pillowcase to minimize frizz and prevent breakage. Visit your local home goods store or search online for a satin pillowcase to use instead of a typical cotton one. When your braids rub against a cotton pillowcase overnight, they may look frizzy in the morning. Switching to satin helps keep your braids looking fresh and beautiful each morning. [6] X Research source Silk pillowcases can give you the same anti-frizz benefits as satin, but they’re often more expensive."
    },
    {
      "title": "Blot nourishing oils along your braid line before bed.",
      "content": "Blot nourishing oils along your braid line before bed. [7] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. Mix 2 to 3 drops of grapeseed oil , Jamaican black castor oil , and tea tree oil in a small cup. Mix the oils together, then dip your finger into the mixture. Dab it along your hairline where your scalp is exposed, as well as between your braids. As a finishing touch, apply the oil to any visible sections of your scalp beneath your braids. Try to do this nightly to keep your scalp extra nourished and protected! Grapeseed oil helps lock in moisture. [8] X Research source Castor oil helps strengthen hair while combatting dryness. Tea tree oil helps nourish roots and unclog hair follicles. Ask your hairstylist if they have any product recommendations for your specific hair type. [9] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019."
    },
    {
      "title": "Put a cleanser on your scalp for at least 5 minutes before heading to bed.",
      "content": "Put a cleanser on your scalp for at least 5 minutes before heading to bed. Pour a grape-sized amount of scalp or shampoo cleanser onto a cotton ball, then blot the shampoo onto your scalp. Let the cleanser sit for 5 to 10 minutes, then wipe it away with a clean cotton ball soaked in warm water. Try to do this every 3 days to keep your braids as strong and healthy as possible. [10] X Research source If you are unsure what product to use, talk to your hairstylist about the best shampoo for your specific hair type. [11] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019."
    },
    {
      "title": "Dab some anti-itch oil on your scalp every 2 days.",
      "content": "Dab some anti-itch oil on your scalp every 2 days. Soak the surface of a clean cotton ball with anti-itch scalp oil . Dab the mixture onto any exposed areas of your scalp, especially in areas that are irritated or itchy. Try to do this every 2 days to keep your scalp feeling soft and soothed before bed. [12] X Research source This also prevents you from scratching or picking at your braids, which can damage them. Avoid drenching your braids in the oil. Ideally, you want to coat your scalp without soaking your braids."
    },
    {
      "title": "Spray the surface of your braids with a soothing, anti-itch conditioner.",
      "content": "Spray the surface of your braids with a soothing, anti-itch conditioner . This product helps reduce the temptation to scratch or pick at your braids while easing any potential frizz. For extra protection, spritz this product over your scalp, as well. Feel free to use this spray whenever your braids feel a bit dry. [13] X Research source"
    }
  ]
}