{
  "url": "https://www.wikihow.com/Exit-Dfu-Mode-on-iPhone-8",
  "title": "How to Enter and Exit DFU Mode on iPhone 8",
  "steps": [
    {
      "title": "Press and release the \"Volume Up\" button.",
      "content": "Press and release the \"Volume Up\" button. It's on the left side of your phone. [1] X Research source"
    },
    {
      "title": "Press and release the \"Volume Down\" button.",
      "content": "Press and release the \"Volume Down\" button. It's on the left side of your phone. [2] X Research source"
    },
    {
      "title": "Press and hold the side button until you see the Apple logo.",
      "content": "Press and hold the side button until you see the Apple logo. You'll find this button on the right side of your phone. It's the button that puts your phone to sleep or wakes it up. [3] X Research source"
    },
    {
      "title": "Connect your iPhone to your computer.",
      "content": "Connect your iPhone to your computer. You can use either a Mac (newer OS versions will use Finder instead of iTunes) or a Windows computer with iTunes. [4] X Research source You can use the lightning-to-USB cable that your phone came shipped with."
    },
    {
      "title": "Press and release the \"Volume Up\" button.",
      "content": "Press and release the \"Volume Up\" button. It's on the left side of your phone. [5] X Research source"
    },
    {
      "title": "Press and release the \"Volume Down\" button.",
      "content": "Press and release the \"Volume Down\" button. It's on the left side of your phone. [6] X Research source"
    },
    {
      "title": "Press and hold the side button, then wait for 10 seconds.",
      "content": "Press and hold the side button, then wait for 10 seconds. You'll find this button on the right side of your phone. It's the button that puts your phone to sleep or wakes it up. [7] X Research source Once you press down on the side button, start counting to 10 as you will continue to the next step and add another button."
    },
    {
      "title": "Press and hold the \"Volume Down\" button again while holding the side button.",
      "content": "Press and hold the \"Volume Down\" button again while holding the side button. After you've held the side button for 10 seconds, press and hold the \"Volume Down\" button as well. [8] X Research source After you've pressed down the \"Volume Down\" button, start counting to five."
    },
    {
      "title": "Release the side button after five seconds.",
      "content": "Release the side button after five seconds. You still have the \"Volume Down\" button pressed. If the Apple logo appears, you held the side button down too long and will need to try again. The screen of your iPhone will remain black and display nothing when it's in DFU mode. The only way to tell it's in DFU mode is that \"Restore iPhone\" is the only option available in iTunes."
    }
  ]
}