{
  "url": "https://www.wikihow.com/Green-Line-Test",
  "title": "The Green Line Test for Couples: What It Is & Whether or Not It Works",
  "steps": [
    {
      "title": "The test supposedly shows who is “in power” in a relationship.",
      "content": "The test supposedly shows who is “in power” in a relationship. The green line test is based on a theory that you can tell who is more dominant and in charge in a relationship based on how each person stands when they take photos together. Basically, whoever leans in towards the other person is the less dominant partner, and whoever stands up straight is really in charge. [1] X Research source If both partners stand up perfectly straight, then they’re supposedly true equals in the relationship."
    },
    {
      "title": "The green line test went viral on TikTok after a Twitter post.",
      "content": "The green line test went viral on TikTok after a Twitter post. A user on Twitter posted photos of celebrity couples with the green lines demonstrating who was or wasn’t a dominant male. Part of the internet thought it was hilarious, while another part of the internet thought it was incredibly deep and insightful. The debate went to TikTok where it blew up as a viral trend. [2] X Research source The green line test got a renewed dose of interest after Will Smith and Chris Rock got into it at the Oscars in 2022. TikTokers realized that Will Smith was leaning in towards Jada Pinkett Smith in every photo they took, and this renewed the debate on the green line test’s validity."
    },
    {
      "title": "Take a photo of a couple and draw a line through the center of each of them.",
      "content": "Take a photo of a couple and draw a line through the center of each of them. You can use any photo of any two people in theory, but the green line test is most commonly applied to couples. Once you’ve got the image, draw a vertical green line going from each person’s neck to the base of their booty. This should give you two green lines to compare. [3] X Research source The lines don’t actually have to be green—the color is technically irrelevant—but Twitter and TikTok users just use green because the original posts used green."
    },
    {
      "title": "Compare the angles of each green line to find who’s in charge.",
      "content": "Compare the angles of each green line to find who’s in charge. With each line drawn, ask yourself, “Who is leaning in towards whom?” Alternatively, are both people in the photo standing up straight, or maybe even leaning away from one another? According to the green line test believers, you now know who’s in charge. [4] X Research source If both people are standing up straight, the relationship is supposedly equitable and both people are dominant personalities. If one person is leaning in, they’re worried about losing their partner and they may be “whipped,” less commanding, or more insecure."
    },
    {
      "title": "No, there’s no evidence leaning in for a photo means anything.",
      "content": "No, there’s no evidence leaning in for a photo means anything. The way people stand up has more to do with comfort and photogenics than anything else. People just sort of naturally pose in a way that they feel comfy and attractive, but leaning one way or another doesn’t reveal anything about how dominant your personality is. [5] X Research source A lot of men lean in when they take photos with their girlfriend or wife because they’re taller. It’s natural for tall people to occasionally lean downward to include themselves in a photo. Some people just aren’t all that great at taking photos. If someone tends to look a little schlubby or they have bad posture in photos, it doesn’t mean they aren’t confident or secure."
    },
    {
      "title": "The concept of the green line test relies on a faulty premise.",
      "content": "The concept of the green line test relies on a faulty premise. The entire idea of the green line test assumes that there’s something wrong with not being dominant in a relationship. Relationships aren’t competitions, and the vast majority of long-term relationships are built on a foundation of trust and mutual respect. It’s not like every relationship secretly has someone in charge. [6] X Research source A lot of the green line test discourse also implies that there’s something wrong with a woman being “in charge” of a relationship, which is kind of silly."
    },
    {
      "title": "It was an attractive test for the “alpha male” crowd online.",
      "content": "It was an attractive test for the “alpha male” crowd online. There’s a small subset of guys out there who are heavily invested in ranking men based on how dominant they are. For these folks, the green line test represents a more tangible and “scientific” way of ranking people based on how dominant they are. [7] X Research source This isn’t to say there’s anything wrong with doing a green line test analysis. So long as you aren’t putting anyone down and you’re just doing it for fun, there’s no problem."
    },
    {
      "title": "It became a meme when people realized how silly it was.",
      "content": "It became a meme when people realized how silly it was. Most of the internet now uses the green line test as a bit of a joke. Like, if there’s news that Dwayne Johnson is going to star in a movie about tap dancers, you might post a photo of Dwayne Johnson and draw a green line through his back. It’s just a fun way of poking fun at someone’s masculinity or authority. [8] X Research source"
    }
  ]
}