{
  "url": "https://www.wikihow.com/Jailbreak-an-iPad-2",
  "title": "How to Jailbreak an iPad 2",
  "steps": [
    {
      "title": "Navigate to the jailbreak wizard page.",
      "content": "Navigate to the jailbreak wizard page. This page allows you to identify which jailbreak software is needed to jailbreak your iPad 2."
    },
    {
      "title": "Select “iPad” under the iDevice dropdown menu.",
      "content": "Select “iPad” under the iDevice dropdown menu."
    },
    {
      "title": "Select “2” under the Model dropdown menu.",
      "content": "Select “2” under the Model dropdown menu."
    },
    {
      "title": "Select the iOS version for your iPad 2 from the iOS dropdown menu.",
      "content": "Select the iOS version for your iPad 2 from the iOS dropdown menu. The iOS version can be found under the “About” menu in Settings. Tap on “Settings,” select “General,” then tap “About” to find the iOS version of your iPad 2."
    },
    {
      "title": "Select your computer’s operating system from the Platform dropdown menu.",
      "content": "Select your computer’s operating system from the Platform dropdown menu."
    },
    {
      "title": "Click on “Check your iDevice.",
      "content": "Click on “Check your iDevice. ” The jailbreak wizard will display the name of the software needed to jailbreak your iPad 2. For example, if you have an iPad 2 running iOS 6.1.3 and you have a Windows computer, your device can be jailbroken using p0sixspwn version 1.0.8."
    },
    {
      "title": "Navigate to the jailbreak tools downloads page on Redsn0w’s site.",
      "content": "Navigate to the jailbreak tools downloads page on Redsn0w’s site. This page offers download links for all jailbreak software."
    },
    {
      "title": "Select your operating system, jailbreak software, and software version from the dropdown menus.",
      "content": "Select your operating system, jailbreak software, and software version from the dropdown menus. If the jailbreak software you need isn’t listed, navigate to the developer’s official site using your search engine."
    },
    {
      "title": "Click on “Download Selected Tool.",
      "content": "Click on “Download Selected Tool. ” The jailbreak software will automatically start downloading to your computer."
    },
    {
      "title": "Open the jailbreak software installation file, then select the option to “Run” or install the software on your computer.",
      "content": "Open the jailbreak software installation file, then select the option to “Run” or install the software on your computer."
    },
    {
      "title": "Back up your iPad 2 to iCloud or iTunes",
      "content": "Back up your iPad 2 to iCloud or iTunes . Some jailbreak software will erase all personal data from your device."
    },
    {
      "title": "Connect the iPad 2 to your computer using a USB cable.",
      "content": "Connect the iPad 2 to your computer using a USB cable. Your computer and the jailbreak software will take a few moments to recognize your device."
    },
    {
      "title": "Follow the on-screen instructions provided by the jailbreak software to jailbreak your iPad 2.",
      "content": "Follow the on-screen instructions provided by the jailbreak software to jailbreak your iPad 2. The software will guide you through the entire process from start to finish, and may ask you to disable certain features on your iPad, such as the passcode lock. Your tablet may reboot several times throughout the process."
    },
    {
      "title": "Wait for the jailbreak software to inform you jailbreaking is complete.",
      "content": "Wait for the jailbreak software to inform you jailbreaking is complete."
    },
    {
      "title": "Disconnect your iPad 2 from the computer.",
      "content": "Disconnect your iPad 2 from the computer. Cydia will now be displayed on the Springboard."
    },
    {
      "title": "Launch the Cydia app.",
      "content": "Launch the Cydia app. You can now browse and install jailbroken apps, themes, and more on your jailbroken iPad 2."
    },
    {
      "title": "Try using a different jailbreak tool supplied by the jailbreak wizard if the first tool you use fails to jailbreak your iPad 2.",
      "content": "Try using a different jailbreak tool supplied by the jailbreak wizard if the first tool you use fails to jailbreak your iPad 2. Jailbreak tools are developed by third parties independent of Apple, and are not guaranteed to work at all times."
    },
    {
      "title": "Use a different USB cable or USB port on your computer if the computer or jailbreaking software fails to detect your device.",
      "content": "Use a different USB cable or USB port on your computer if the computer or jailbreaking software fails to detect your device. This can help rule out problems associated with faulty hardware."
    },
    {
      "title": "Install all required software and firmware updates on your iPad 2 and computer if jailbreaking results in one or more error messages.",
      "content": "Install all required software and firmware updates on your iPad 2 and computer if jailbreaking results in one or more error messages. Outdated software can sometimes cause incompatibility problems with jailbreaking software."
    },
    {
      "title": "Restore your iPad 2 using iTunes",
      "content": "Restore your iPad 2 using iTunes on a computer if jailbreaking fails to work or results in software problems on your device. This process will reverse jailbreaking and restore the original factory settings on your iPad."
    },
    {
      "title": "Try uninstalling and reinstalling jailbreak software to rule out errors and problems that occur on behalf of a corrupt install.",
      "content": "Try uninstalling and reinstalling jailbreak software to rule out errors and problems that occur on behalf of a corrupt install. A faulty installation can prevent jailbreaking software from working efficiently. [1] X Research source"
    }
  ]
}