{
  "url": "https://www.wikihow.com/Draw-a-Regular-Hexagon-with-Only-a-Ruler",
  "title": "How to Draw a Regular Hexagon with Only a Ruler",
  "steps": [
    {
      "title": "Plot the center point of your hexagon and decide how long you want each side to be.",
      "content": "Plot the center point of your hexagon and decide how long you want each side to be. Label this length \"S\". [1] X Research source"
    },
    {
      "title": "Plot 2 points on the vertical axis, S distance away from the center point.",
      "content": "Plot 2 points on the vertical axis, S distance away from the center point. These points can be \"A\" and \"B\". [2] X Research source"
    },
    {
      "title": "Find the points halfway between the center point and A and the center point and B.",
      "content": "Find the points halfway between the center point and A and the center point and B. There, plot perpendicular guide lines. (You'll erase these later, so don't make them dark.) As a side note, the distance between the two guide lines is also equal to S."
    },
    {
      "title": "Draw 2 more guide lines that are equal to the length of 2S, or line AB, from each perpendicular line to the other so that they run through the center point.",
      "content": "Draw 2 more guide lines that are equal to the length of 2S, or line AB, from each perpendicular line to the other so that they run through the center point. The point where the guide lines intersect are the last 4 points of the hexagon. (These can be called CD and EF.)"
    },
    {
      "title": "Connect the dots between the points and erase the guide lines.",
      "content": "Connect the dots between the points and erase the guide lines. Congrats!"
    },
    {
      "title": "Draw and measure one line.",
      "content": "Draw and measure one line. This will be the first side (and S length)."
    },
    {
      "title": "Draw 2 perpendicular guide lines at each end of the side extending in the direction you want your hexagon by at least 2S.",
      "content": "Draw 2 perpendicular guide lines at each end of the side extending in the direction you want your hexagon by at least 2S."
    },
    {
      "title": "Draw 2 more guide lines, each the length of 2S, from the end points of your first side to the perpendicular guide line of the opposing point.",
      "content": "Draw 2 more guide lines, each the length of 2S, from the end points of your first side to the perpendicular guide line of the opposing point. Draw a line between the points where they intersect. This is your second side."
    },
    {
      "title": "Find the point halfway between these 2 sides.",
      "content": "Find the point halfway between these 2 sides. Draw one last guide line parallel to the sides."
    },
    {
      "title": "Mark where the center point between the horizontal guide lines is, on the vertical guide line.",
      "content": "Mark where the center point between the horizontal guide lines is, on the vertical guide line. Then mark the line S length away from it to the top and bottom."
    },
    {
      "title": "Connect these points to the ends of the drawn sides.",
      "content": "Connect these points to the ends of the drawn sides. Erase the guide lines. Congrats!"
    }
  ]
}