{
  "url": "https://www.wikihow.com/Change-a-Hubcap",
  "title": "How to Change a Hubcap",
  "steps": [
    {
      "title": "Pull up the e-brake and park the car somewhere flat and level.",
      "content": "Pull up the e-brake and park the car somewhere flat and level. You're going to be right down by the wheels, so make sure that they can't roll!"
    },
    {
      "title": "Turn one lug nut counterclockwise with a lug wrench to loosen it.",
      "content": "Turn one lug nut counterclockwise with a lug wrench to loosen it. [1] X Research source Lugnuts are the small, hexagonal screws holding the tire onto the car. This may take some effort if the lug nuts are tight. Once loose, you can unscrew them by hand. If you're really struggling, you can apply pressure to the wrench with your foot to really get them off. A lug wrench looks like a crowbar with a circular hole in it. It should be in your trunk with the car, but make sure you have one if not. They are also needed to change a tire."
    },
    {
      "title": "Take three of the lug nuts off the hubcap, keeping two nuts on opposite sides on the tire.",
      "content": "Take three of the lug nuts off the hubcap, keeping two nuts on opposite sides on the tire. Lugnuts hold both the wheel and the hubcap on, and you don't want the whole wheel coming off. [2] X Research source Take care to put the lug nuts somewhere safe so you do not lose them. If you have five total lugnuts, take off two that are next to each other and one on the opposite side."
    },
    {
      "title": "Remove the plastic washers from the lugnuts.",
      "content": "Remove the plastic washers from the lugnuts. These are what keep the hubcaps on, not just the lug nuts. Set them aside somewhere safe -- you'll need them."
    },
    {
      "title": "Reattach the three lug nuts, tightening them lightly.",
      "content": "Reattach the three lug nuts, tightening them lightly. You don't need to completely tighten them on, just to hand tightness. Then use the lug wrench to tighten them just a quarter turn more or so. These three will keep the tire in place as you remove the other two washers."
    },
    {
      "title": "Unscrew the other two lugnuts to remove the hubcap.",
      "content": "Unscrew the other two lugnuts to remove the hubcap. Without the washers, the hubcap should slide right off."
    },
    {
      "title": "Place the new hubcap onto the bolts and replace the two lug nuts.",
      "content": "Place the new hubcap onto the bolts and replace the two lug nuts. There will be a small cut out that needs to fit over the valve of the tire. Line this up, then slide the new hubcap on and tighten on the two nuts. Just tighten them by hand for now -- don't worry about full tightness."
    },
    {
      "title": "Remove the first three lug nuts, put the washers back on, and screw them in.",
      "content": "Remove the first three lug nuts, put the washers back on, and screw them in. Tighten them back on by hand so that your tire is back where it started. You can also slip the washers over the section"
    },
    {
      "title": "Tighten the lug nuts with the crowbar to ensure a tight fit.",
      "content": "Tighten the lug nuts with the crowbar to ensure a tight fit. Tighten them all by hand at first. Then, working in a circle, tighten them each one quarter-turn at a time until they don't want to move too much. Never tighten one screw completely before moving on to the others -- this can bend or warp the hubcap. [3] X Research source"
    },
    {
      "title": "Set the car in park on level ground and pull the e-brake.",
      "content": "Set the car in park on level ground and pull the e-brake. This is a simple, easy safety measure that should not be ignored. Don't be working on the wheels or under the care without making sure that the car can't move."
    },
    {
      "title": "Locate the screw on the hubcap you need to remove.",
      "content": "Locate the screw on the hubcap you need to remove. If it is not immediately visible, it could be under a plastic piece. Use a screwdriver to pry this small cover off carefully."
    },
    {
      "title": "Unscrew the screw and remove the old hubcap.",
      "content": "Unscrew the screw and remove the old hubcap. Take care to place the screw somewhere safe so it will not roll away or get lost."
    },
    {
      "title": "Attach the new hubcap to the wheel and replace the screw.",
      "content": "Attach the new hubcap to the wheel and replace the screw. Thread it in by hand to start, then grab the screwdriver afterward."
    },
    {
      "title": "Screw tightly with a screwdriver, being careful not to over-tighten the screw.",
      "content": "Screw tightly with a screwdriver, being careful not to over-tighten the screw. Tighten it enough that it doesn't move, but don't feel like you need to break your back turning it."
    },
    {
      "title": "Park the car on flat ground and pull the e-brake.",
      "content": "Park the car on flat ground and pull the e-brake. You want to be 100% that the car is unable to move before you start working."
    },
    {
      "title": "Pry around the rim of the old hubcap with a screwdriver to loosen it.",
      "content": "Pry around the rim of the old hubcap with a screwdriver to loosen it. Use a flat-head screwdriver and lightly pull at certain spots until you feel the cap wiggle loose. If something feels like it will break or snap, stop and move to another spot. You may have to loosen a few areas to get it off."
    },
    {
      "title": "Remove the hubcap.",
      "content": "Remove the hubcap. Keep prying to pop the old hubcap off. [4] X Research source"
    },
    {
      "title": "Place the new hubcap onto the wheel.",
      "content": "Place the new hubcap onto the wheel. Line it up with the old one, noting where the little whole or cutaway is for the valve stem."
    },
    {
      "title": "Tap the rim all the way around until it the hubcap stays on.",
      "content": "Tap the rim all the way around until it the hubcap stays on. It will not be secure yet."
    },
    {
      "title": "Hit the hubcap with a rubber mallet very carefully around the rim to make the hubcap secure.",
      "content": "Hit the hubcap with a rubber mallet very carefully around the rim to make the hubcap secure. Lightly tap it into place, working all the way around the rim to perfect it. You should here light \"clicks\" as it pops in."
    }
  ]
}