{
  "url": "https://www.wikihow.com/Play-RAR-Files",
  "title": "How to Play RAR Files with WinRAR and Dziobas RAR Player",
  "steps": [
    {
      "title": "Go to the AfterDawn website to download and install WinRAR on your computer.",
      "content": "Go to the AfterDawn website to download and install WinRAR on your computer."
    },
    {
      "title": "Double-click on the RAR file stored on your computer.",
      "content": "Double-click on the RAR file stored on your computer. This will open the file in WinRAR."
    },
    {
      "title": "Press the \"Extract To\" button in the taskbar at the top.",
      "content": "Press the \"Extract To\" button in the taskbar at the top."
    },
    {
      "title": "Choose the destination path using the file browser at the top of the General tab.",
      "content": "Choose the destination path using the file browser at the top of the General tab. The destination path is the location of the folder where you want the extracted file to be saved."
    },
    {
      "title": "Hit the OK button at the bottom.",
      "content": "Hit the OK button at the bottom. The compressed files will be extracted to your designated folder."
    },
    {
      "title": "Browse to the folder where the extracted files are saved.",
      "content": "Browse to the folder where the extracted files are saved. Since these files are no longer compressed, you should be able to play using your regular media player such as Windows Media Player."
    },
    {
      "title": "Download the Dziobas player from the AfterDawn website.",
      "content": "Download the Dziobas player from the AfterDawn website."
    },
    {
      "title": "Run the downloaded installer to install the player on your computer.",
      "content": "Run the downloaded installer to install the player on your computer."
    },
    {
      "title": "Open the Dziobas player by going to \"All Programs\" from your start menu and selecting the software from the list of programs.",
      "content": "Open the Dziobas player by going to \"All Programs\" from your start menu and selecting the software from the list of programs."
    },
    {
      "title": "Click on \"File\" in the top-right corner and select \"Open RAR (rewind).\"",
      "content": "Click on \"File\" in the top-right corner and select \"Open RAR (rewind).\""
    },
    {
      "title": "Use the \"Open\" window that pops up to browse to the RAR file.",
      "content": "Use the \"Open\" window that pops up to browse to the RAR file."
    },
    {
      "title": "Select the name of the RAR file and press the \"Open\" button.",
      "content": "Select the name of the RAR file and press the \"Open\" button. Dziobas will temporarily decompress the file that is in RAR format and begin playing it."
    }
  ]
}