{
  "url": "https://www.wikihow.com/Find-Titanium-Ore",
  "title": "How to Find Titanium Ore",
  "steps": [
    {
      "title": "Reach the Hardmode level in your game.",
      "content": "Reach the Hardmode level in your game. Continue playing Terraria until you successfully beat the Wall of Flesh boss. After you accomplish this, your save file will automatically switch to Hardmode, which makes titanium ore available. If you haven’t defeated this boss yet, you unfortunately won’t have any luck finding this type of ore. [1] X Research source Hardmode is separate from the Expert and Master levels of the game, as the change in game mode happens during gameplay."
    },
    {
      "title": "Break down altars with a Pwnhammer.",
      "content": "Break down altars with a Pwnhammer. Take the Pwnhammer, a special weapon you received after beating the Wall of Flesh boss, and destroy any Crimson or Demon Altars that you stumble across in the game. While the loot you get is random, there’s a chance for you to pick up some titanium ore as a reward. [2] X Research source"
    },
    {
      "title": "Travel directly above the “Hell” region in the game to search for ore.",
      "content": "Travel directly above the “Hell” region in the game to search for ore. Jump underground, traveling far down into the “Hell” level, a cavern-like area that contains a lot of valuable ore. [3] X Research source Use a spelunker glowstick to peruse the top of this cavern, keeping your eyes peeled for the ore. [4] X Research source This can be a bit time-consuming, but it’s a good way to find more ore at once."
    },
    {
      "title": "Check the map size to get an idea when the titanium ore will spawn.",
      "content": "Check the map size to get an idea when the titanium ore will spawn. The spawn location of titanium ore depends on the size of the map that you’re exploring. On a smaller map, you’ll notice titanium ore start to appear 700 tiles beneath the surface. On medium maps, titanium ore will start spawning 1,015 tiles down, and on big maps, the ore will show up after you’re 1,465 tiles deep. [5] X Research source If you can’t find titanium ore on a large map, you may not be looking far enough down."
    },
    {
      "title": "Look for gray ore with specks of pink and green.",
      "content": "Look for gray ore with specks of pink and green. Identify in-game ore as having a dark gray base, with dark green and light pink spots floating through it. Double-check for these color specks before you mine anything, as it can be pretty easy to mix up titanium ore with platinum and silver. [6] X Research source Silver and platinum also have a dark gray base, like titanium."
    },
    {
      "title": "Search the Dravanian Forelands for ore in Final Fantasy XIV.",
      "content": "Search the Dravanian Forelands for ore in Final Fantasy XIV . Load up your game and travel to the Dravanian Forelands, which connects with the Churning Mists, the Dravanian Hinterlands, and the Coerthas Western Highlands. This is the only location in the game where you can find titanium ore, so try to focus your mining efforts there! [7] X Research source You can also find raw star sapphire and raw star ruby in this area. You’ll need to have a gathering level of 55 to mine titanium ore successfully."
    },
    {
      "title": "Look for a brown and silver rock in the game.",
      "content": "Look for a brown and silver rock in the game. Keep in mind that titanium ore is found in a rusty silver stone. If you break open this rock, you may find titanium ore. [8] X Research source This ore can only be found in the Dravanian Forelands."
    },
    {
      "title": "Transform your ore into nuggets or ingots.",
      "content": "Transform your ore into nuggets or ingots. Check your recipes and see if you can craft a titanium nugget, titanbronze nugget, or titanbronze ingot. Note that these recipes have a recipe level higher than 50, so you won’t be able to craft them if you’re just starting the game. [9] X Research source You’ll need both titancopper sand and titanium ore to make titanbronze nuggets or ingots."
    },
    {
      "title": "Visit specific maps for titanium ore in World of Warcraft.",
      "content": "Visit specific maps for titanium ore in World of Warcraft . Start up your game and visit the Sholazar Basin map, the Wintergrasp map, or the Icecrown map. These are the only places where you can find titanium ore, so try narrowing your search there. [10] X Research source"
    },
    {
      "title": "Look for ore in a titanium vein.",
      "content": "Look for ore in a titanium vein. Search for a titanium vein, which is a sparkly, bright blue rock. Typically, you can find some out in the open, sticking out of a rock. It might take a bit of time before you can find some, so don’t give up! [11] X Research source You can find titanium veins near trees and waterfalls."
    },
    {
      "title": "Craft new items with your titanium ore.",
      "content": "Craft new items with your titanium ore. Make titanium bars with your leftover ore, or create some titan steel bars instead. Keep in mind that you need a high mining skill to be able to make these items. [12] X Research source For instance, you’ll need a mining level of 75 to create a smelt titansteel bar."
    },
    {
      "title": "Search the Somber Marsh Abandoned Ruins for Ore.",
      "content": "Search the Somber Marsh Abandoned Ruins for Ore. Pay 600 units to get into the ruins for the week. Look for a blue-gray stone in this area, similar in color to asphalt. Once you find this stone, mine it to pick up some titanium ore. [13] X Research source Once mined, titanium ore looks like a gray rock with blue splotches."
    },
    {
      "title": "Check out Dana’s Mining Company if you’re at least level 3.",
      "content": "Check out Dana’s Mining Company if you’re at least level 3. Check your in-game level—if you’re 3 or higher, you can visit Dana’s Mining Company, where she sometimes sells the ore. You’ll need to pay 12 units for each individual piece of ore. Unfortunately, this item won’t always be in stock, so keep this in mind before you head over to her shop. [14] X Research source Titanium ore only sells for 3 units."
    },
    {
      "title": "Craft your titanium ore into other items.",
      "content": "Craft your titanium ore into other items. Check your inventory to see how much titanium ore you have on hand. You can forge 1 titanium bar with 5 pieces of ore and 2 crystals. To make titanium plates, you’ll need to forge 15 pieces of ore, 6 crystals, and 1 sapphire. [15] X Research source"
    }
  ]
}