{
  "url": "https://www.wikihow.com/Play-as-Alucard-in-Mobile-Legends:-Bang-Bang",
  "title": "How to Play as Alucard in Mobile Legends: Bang Bang",
  "steps": [
    {
      "title": "Note alternatives to Alucard.",
      "content": "Note alternatives to Alucard. While not a Meta Hero at best, it's best to note alternatives just in case. To copy his Chase abilities, choose Chou, Lapu-Lapu, or Thamuz to kill enemies at best. For his Damage abilities, use Alpha, Khaleed, or Zillong."
    },
    {
      "title": "Take note of his passive (Pursuit).",
      "content": "Take note of his passive (Pursuit). When Alucard uses a skill where it damages an enemy, he deals 50% more damage. His basic attack is subsequently enhanced, and he jumps to the target while dealing 20% more physical damage. He additionally has 50% of his physical lifesteal as Spell Vamp. [1] X Research source His passive is the cornerstone of being an Assassin - you can use one of his skills, and you can continuously deal damage while blinking to the enemy immediately!"
    },
    {
      "title": "Use his 1st Skill (Groundsplitter).",
      "content": "Use his 1st Skill (Groundsplitter). Alucard jumps to a designated location for the enemy. He also slows enemies down by 40% for two seconds while dealing up to 350 physical damage. [2] X Research source When initiating an attack, use this skill first. Groundsplitter can take an enemy by surprise!"
    },
    {
      "title": "Manage his 2nd Skill (Whirling Smash).",
      "content": "Manage his 2nd Skill (Whirling Smash). Alucard slashes and spins his sword to nearby enemies, dealing up to 400 physical damage. [3] X Research source While a simple skill, you can combine Whirling Smash with his other skills. You can also use this skill to clear minion waves swiftly. This is an essential damage source for Alucard, and it's advisable to upgrade this skill before Groundsplitter. Additionally, it closes the gap to engage in enemies."
    },
    {
      "title": "Utilize his Ult (Fission Wave).",
      "content": "Utilize his Ult (Fission Wave). While increasing his Physical Lifesteal by 60% (at max level), he marks and absorbs the enemies in the designated area while slowing them down by 40% for 4 seconds. In eight seconds, he can activate his passive and re-use Fission Wave to deal a powerful shockwave forward, dealing up to 700 physical damage to enemies. [4] X Research source Fission Wave gives burst damage to enemies and enhances his ability to continue attacking in team fights thanks to the increase of Physical Lifesteal - allowing you to stave off HP!"
    },
    {
      "title": "Choose his equipment.",
      "content": "Choose his equipment. For his equipment, start by buying Warrior/Tough Boots to build on either Physical/Magic Defense (depending on the enemy lineup), and purchase Endless Battle (to increase his lifesteal), Blade of Despair (to maximize his Physical Attack), War Axe (to stay longer in team fights and deal extra damage), Blade of the Heptaseas (to deal enhanced damage while earning extra HP), and Queen's Wings (to reduce incoming damage). For alternatives, select Immortality, Windtalker, an extra Blade of Despair (if needed), Brute Force Breastplate, and Twilight Armor. [5] X Research source [6] X Research source As for his battle spell, select Retribution (recommended as he does not bode well outside of jungling), Execute (to kill enemies when his skills don't do the job), and Vengeance (to sustain damage)."
    },
    {
      "title": "Select his emblem.",
      "content": "Select his emblem. Alucard benefits from the Assassin Emblem. Choose Agility to upgrade his movement speed and Invasion to up his Physical Penetration and finish it off with Killing Spree (where killing enemies increases his HP/movement speed temporarily - mostly during team fights). [7] X Research source"
    },
    {
      "title": "Combo his skills.",
      "content": "Combo his skills. The main combo for Alucard is Groundsplitter + Whirling Smash + Fission Wave + Whirling Smash + Fission Wave (second phase). In between using his skills, add his basic attack. Use Groundsplitter to suddenly appear near enemies, and utilize Whirling Smash to deal extra damage while marking/increasing his lifesteal with Fission Wave. Before re-using Fission Wave, pommel the enemy further with Whirling Smash, then use the shockwave from Fission Wave. [8] X Research source This combo can be used while ganking the backline (Marksmen/Mages) or for major team fights. It can swindle the match in an instant!"
    },
    {
      "title": "Focus on team objectives early on.",
      "content": "Focus on team objectives early on. Alucard is known as a strong hero in the early game - but before starting, jungle with the creeps early on (including the Turtle) before you roam around the map to assist allies. Once you reach mid-game, kill turrets after ganking enemies and continue to roam. [9] X Research source While ganking, know your positioning. Concentrate on the mage/marksman preferably before going for the other enemies, as they can deal damage without you knowing. Focus on camping while you are roaming around the map. When enemies go to your bush, that's the opportunity you need to kill the enemy with your skills (unless if it is a tank)."
    },
    {
      "title": "Kill core enemy heroes during team fights.",
      "content": "Kill core enemy heroes during team fights. During team fights, your best bet is to eliminate the backline as soon as possible. Before you attack, your tank needs to initiate the fight before jumping in. While your allies focus on other enemy heroes, your task is to kill the Mage/Marksman when they are attacking from behind. [10] X Research source Note that Alucard is vulnerable to Crowd Control skills. It's best to wait for all of the CC skills to be used before you deal with the damage dealer."
    }
  ]
}