{
  "url": "https://www.wikihow.com/Repair-a-Sliding-Window",
  "title": "How to Repair a Sliding Window",
  "steps": [
    {
      "title": "Open and lift the sliding sash out from your window sill.",
      "content": "Open and lift the sliding sash out from your window sill. The sliding sash is the part of your window that moves when you open and close it. Unlock your window and slide the sash open as far as you can. Hold onto both sides of the window firmly and lift it up so it comes off of the track. Tilt the bottom of the sash toward you and carefully pull the top of the window out from the frame. Set it down on a sturdy work surface. [1] X Research source Window Repair Technician Michael Fox recommends you \"measure and weigh the sash, so you can get the length and weight for that window\" and order the correct replacement parts. If you can’t hold onto the window on your own, ask someone to help you lift and carry it. Be careful not to drop the sash, or else you could accidentally break the glass and need to replace it completely. Some sliding windows might have release buttons at the top of the sliding portion. When you open the window, press the buttons down and tilt the window toward you. When you’re removing a vertical window , first remove the sash stops and pry open the removal clips. Then open your window up to the top of the frame to pull it out. [2] X Research source"
    },
    {
      "title": "Pull back the bottom track to remove it.",
      "content": "Pull back the bottom track to remove it. The track is the long plastic or metal piece along the bottom of the window frame that the sliding sash rolls on. Grab onto the raised rail on the track with your fingers and gently pull it toward you to pop it out of place. [3] X Research source Pry the track up with a putty knife if you aren’t able to pop it out by hand. You will not be able to remove the bottom or side tracks if your window opens vertically. If you have an aluminum or metal track, you may need to unscrew it or you might not be able to remove it at all. That’s okay since you’ll still be able to clean it."
    },
    {
      "title": "Suck up the loose debris with a vacuum.",
      "content": "Suck up the loose debris with a vacuum. Use the hose attachment on your vacuum so it’s easier to reach your window. Suck up any dirt that was on or under the track since it could cause the window to grind or scrape when you try sliding it. Try to pick up as much debris as you can with your vacuum. [4] X Research source You can also use a handheld vacuum if it’s more convenient for you. Try using the brush attachment to help loosen dirt that’s really stuck on the frame or track. When you’re cleaning a window that opens vertically, vacuum the side tracks from the top to the bottom."
    },
    {
      "title": "Wipe the tracks and window frame with water and mild dish soap.",
      "content": "Wipe the tracks and window frame with water and mild dish soap. Put a squirt of dish soap onto a paper towel or non-abrasive cleaning cloth and get it damp. Wipe the bottom of the window frame and tracks on the sides to get any dirt that you missed with your vacuum. Then clean off the track piece you removed so it doesn’t have any residue left on the surface. [5] X Research source If you want a more powerful cleaning solution, sprinkle baking soda on the track and spray it with white vinegar. Let it sit for 5–10 minutes before wiping it off. [6] X Research source"
    },
    {
      "title": "Wipe vertical tracks with a clean paper towel to remove buildup.",
      "content": "Wipe vertical tracks with a clean paper towel to remove buildup. If your window opens vertically, there might be some debris getting caught in the tracks along the side of the window frame. Press a paper towel into the track at the top of the window frame and wipe down toward the bottom. Then use a fresh paper towel on the opposite side of the window to clean out the residue. [7] X Research source If you still notice buildup, spray the track again with some white vinegar and baking powder. You can also try breaking apart gunk in corners with a butter knife wrapped in a clean rag."
    },
    {
      "title": "Spray the window rollers with silicone lubricant.",
      "content": "Spray the window rollers with silicone lubricant. Dirt and gunk can get trapped on the rollers and make it difficult for your window to open and close. Turn the sliding sash upside-down so you can see the sets of rollers on the bottom. Point the lubricant nozzle directly at the rollers and give each one a short burst. [8] X Research source Wipe any excess lubricant off the rollers with a paper towel. Windows that open vertically won’t have rollers."
    },
    {
      "title": "Replace the track and sash to see if your window operates smoothly.",
      "content": "Replace the track and sash to see if your window operates smoothly. Line the track back up with the bottom of the window frame and push it down until it snaps back into place. Position the top of the sash back into the frame and push it up. Move the bottom of the sliding piece back into the frame and set it down on the track. Try moving the window back and forth to see if it moves smoothly. [9] X Research source If your window still doesn't slide easily, then you might still have some problems with the track or rollers."
    },
    {
      "title": "Take the sliding sash out from the window sill.",
      "content": "Take the sliding sash out from the window sill. Unlock your window and slide it open as much as you can. Grab onto the sides of the sash and lift it off of the track. Guide the bottom out of the frame so you can easily slide the top out. Set the sash aside while you’re working so it doesn’t get damaged. [10] X Research source Some windows have a guard block on top that prevents you from lifting the window out when it’s closed. If you have trouble lifting it out, try opening it further past the block and it should come out easily. [11] X Research source"
    },
    {
      "title": "Try pushing the track down to ensure it’s properly seated.",
      "content": "Try pushing the track down to ensure it’s properly seated. If the track was incorrectly installed, it might be raised in some areas and brush against your window as you try to open it. Apply firm pressure along the entire length of the track so it clicks into place. [12] X Research source This only works on plastic or acrylic tracks. If you aren’t able to push the track in by hand, set a narrow piece of wood on top of it. Then tap on the wood with a hammer to force the track into the frame. [13] X Research source"
    },
    {
      "title": "Straighten a metal track by tapping it with a piece of wood and a mallet.",
      "content": "Straighten a metal track by tapping it with a piece of wood and a mallet. When an aluminum track gets bent or warped, you can try to shape it back into place. Take a straight, narrow piece of wood and position it just behind the track. Press the straight edge of the wood tightly against the metal that bows in toward the middle of the track. Lightly tap on the metal track until it’s straight against the side of the wood. [14] X Research source Avoid hitting the track without a piece of wood as support, or else your window sash could fall out from the frame."
    },
    {
      "title": "Install a new sill track if the one in your window is broken or damaged.",
      "content": "Install a new sill track if the one in your window is broken or damaged. If there’s unfixable damage to your track, you may need to replace it entirely. Measure the length of the old track so you know the length you need for the new one. Make sure you buy a track that’s the same brand and model for your window. Position the new track inside of the frame and press it into place to secure it. [15] X Research source If you’re replacing a metal track, you can install the new rail over the first one. Just apply a thin line of caulk in the rail’s opening and press it over the old track. You may be able to buy replacement tracks or rails from a home improvement store. If you aren’t able to find them on your own, you may need to call a professional window repair service."
    },
    {
      "title": "Remove the sliding sash from your window.",
      "content": "Remove the sliding sash from your window. If you’ve cleaned the rollers and they still don’t operate smoothly, you may need to replace them. [16] X Research source Open your window as far as you can, or else you won’t be able to lift it out of the frame. Hold onto the sides and carefully lift it off of the track. Tilt the bottom of the sash toward your body and guide the top out of the frame. Bring it over to your work area so you can access the rollers on the bottom. [17] X Research source [18] X Research source Be very careful when you’re transporting the sash since you break the window pane."
    },
    {
      "title": "Unscrew or pop out damaged roller wheels on the bottom of the window.",
      "content": "Unscrew or pop out damaged roller wheels on the bottom of the window. Turn the sliding sash upside down so you see the sets of rollers running along the bottom. Look for a screw holding the assembly in place and use a Phillips head screwdriver to remove it. If you don’t see a screw, then you can simply pry the wheels out of the assembly using a flathead screwdriver. [19] X Research source There are usually 2 roller assemblies that each have 2 rollers, but they may vary depending on the size and brand of your window."
    },
    {
      "title": "Buy new roller wheels that match the model of your window.",
      "content": "Buy new roller wheels that match the model of your window. Check the brand listed on your window and write it down so you know which rollers to get. Bring the old rollers or assemblies with you when you buy the new ones to ensure they’re the same style. Buy enough replacement rollers or assemblies to fit in your window. [20] X Research source [21] X Research source You can buy roller replacements online or from home improvement stores."
    },
    {
      "title": "Screw in or insert the new rollers into the assembly.",
      "content": "Screw in or insert the new rollers into the assembly. If you removed the entire assemblies, slide the new ones into the slots and use the same screws to reattach them. If you only popped out the rollers, then simply push them back into the slots on the old assemblies. [22] X Research source If your assembly has multiple slots to install the rollers, use the same slots you removed the old rollers from."
    },
    {
      "title": "Reattach the sash to your window to test the rollers.",
      "content": "Reattach the sash to your window to test the rollers. Flip the sliding sash right-side-up and guide the top back into the channel at the top of the window frame. Lift the window up and position the bottom on the track. Try rolling the sash back and forth over the track to see if it runs smoothly. If it works, then you’re finished with your repairs! [23] X Research source If your window still doesn’t open or close, call a professional service to find the problem with your window."
    },
    {
      "title": "Flip the removal clips open on the sides of the window.",
      "content": "Flip the removal clips open on the sides of the window. You’ll usually find metal removal clips on the sides of your frame near the top of the window. Pry the clips open by hand or with a flathead screwdriver so they poke out from the frame. Flip the clips out on each side to catch the balancing system that’s hidden inside of the window. [24] X Research source If your window has removal buttons on top of the sliding section, then it will not have any clips."
    },
    {
      "title": "Take the sliding sash out from your frame.",
      "content": "Take the sliding sash out from your frame. Unlock your window and lift the sliding section up. If your window has removal clips, lift your window all the way up until you feel tension. Slowly slide the window horizontally to pop it out of the frame. On a window that tilts open, press the buttons on top of the sash and tilt it toward you to pull it out from your window. Some windows may have plastic guards at the top of the frame that prevent you from removing the window. Pop them out by hand or unscrew them with your screwdriver."
    },
    {
      "title": "Replace the balance springs if your window gets stuck.",
      "content": "Replace the balance springs if your window gets stuck. Window Repair Technician Michael Fox explains, \"when your vinyl window [gets stuck], you'd want to check the balances to make sure [they] are either hooked up or operational. [...] Almost all windows have broken balances; [the balance] wears out over time.\" Hold onto the top of the long metal cover and slowly tilt the bottom of the balance spring away from the side. You’ll feel the balance spring come loose so you can unhook it from the frame. Then, remove the spring from the other side of the window. Hook your new balance springs in the holes and tilt them back against the sides until they click into the removal clips. [25] X Research source The balance springs are long metal pieces that run along the side of the window so it’s easier to open and close. If there is a stamp on the balance check the stamp's weight and number in order to reorder the same balance. Depending on the brand and model of your window, you may need to unscrew the balance spring with a Phillips screwdriver."
    },
    {
      "title": "Raise the balance shoes if you popped your window out of the track.",
      "content": "Raise the balance shoes if you popped your window out of the track. Balance shoes are small pieces in the tracks that support the weight of the window. Insert a flathead screwdriver into the horseshoe-shaped hole and turn it 90 degrees clockwise. Lift the shoe up about 3–5 inches (7.6–12.7 cm) above the bottom of the frame. Turn the horseshoe 90 degrees counterclockwise so the opening points up to lock the shoe in place. Then repeat the process on the other side so they’re raised to the same height. [26] X Research source Sometimes, your window might pop out of the shoes if you try to tilt it in before you raise it."
    },
    {
      "title": "Reinstall the sliding sash to check if your window works again.",
      "content": "Reinstall the sliding sash to check if your window works again. On a window with balance springs, position the sash in the frame 2–3 in (5.1–7.6 cm) above the removal clips. Slowly lower the window down so the springs lock back into the window. If your window has balance shoes, place the bottom pins of the sash into the horseshoe-shaped holes and tilt the window back into the frame. [27] X Research source If your window still doesn’t function properly, call a professional service to repair it."
    }
  ]
}