{
  "url": "https://www.wikihow.com/Get-Rid-of-Gingivitis",
  "title": "How to Get Rid of Gingivitis",
  "steps": [
    {
      "title": "Know the symptoms of gingivitis.",
      "content": "Know the symptoms of gingivitis. Gingivitis can progress through its early stages with few visible symptoms. When gingivitis worsens and advances into full-blown periodontitis, the symptoms are usually: [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Bleeding from the gums after brushing teeth, or even spontaneously Gums that are tender, swollen and redder than usual Persistent bad breath (halitosis). [2] X Research source Receding gum lines (this will make your teeth look bigger) Deep pockets filled with pus between teeth and gums, causing loose teeth"
    },
    {
      "title": "Understand how plaque causes problems.",
      "content": "Understand how plaque causes problems. Food trapped under the gums combines with bacteria to create plaque, a “toxic stew” that irritates the gums and makes them bleed. Bleeding is your body's way of trying to clear out the toxic material from your gums. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This colorless film of sticky material containing food particles, bacteria, and saliva attaches itself to the tooth above and below the gum line, encouraging advanced gum disease and tooth decay. Then plaque, the “toxic stew,” hardens into tartar (calculus) in just 24 hours. By then the damage is done — only a dentist can remove tartar. Each day this “contaminated crust” grows and inflames the gums, as it is a non-stop source of bacteria. For this reason, you need to remove plaque every day, no matter what, to avoid advanced gum disease. But brushing alone does not remove the plaque."
    },
    {
      "title": "Know the non-surgical dental options.",
      "content": "Know the non-surgical dental options. Most treatments for gum disease involve the dentist, although keeping the disease at bay in at least half of the problem. If you have mild gingivitis, consider these non-surgical treatments: Professional cleaning. Your dentist may recommend that you get your teeth and gums professionally cleaned twice a year you are prone to gingivitis. The dentist administering the cleaning will remove both plaque and tartar above and below the gum line. [4] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Scaling and root planing. Like professional cleaning, this method is administered under a local anesthetic. The patient's plaque and tartar is scraped away (scaling) and rough spots are smoothed away (planing). This procedure is usually done if the dentist determines that plaque and tartar underneath the gum line needs to be removed. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Know the surgical dental options.",
      "content": "Know the surgical dental options. Advanced gum disease or periodontitis may need to be attacked with dental surgery. These surgeries include: [6] X Research source Flap surgery and pocket reduction. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This surgery reduces the space between the gum and the tooth by lifting the gum flaps up, removing plaque and tartar, and placing the gums snugly against the tooth again. This procedure will stop the bone recession and can even stabilize the loosening teeth. Soft tissue grafts. Tissue, taken mostly from the roof of the mouth is grafted onto the gums in order to reinforce receding gums or fill in places where gums are thin. This can help reduce sensitivity and can also improve the appearance of your teeth. Bone grafts/surgery. Bone grafts give your old, diseased bone a new platform on which to regrow itself, adding stability to teeth. Bone grafts can either be your own bone, donated bone, or synthetic bone. Bone surgery involves smoothing out holes and craters in existing bone, usually after flap surgery. Bone surgery makes it more difficult for bacteria to lodge themselves in the bone, causing further deterioration. Tissue regeneration. If the bone supporting your teeth has been completely eroded by gum disease, this procedure will help support both bone and tissue regeneration by surgically installing a piece of mesh-like fabric between the bone and gum tissue. This procedure is usually done in tandem with flap surgery."
    },
    {
      "title": "Help yourself.",
      "content": "Help yourself. Regardless of what happens in the dental chair, it’s what happens in your bathroom that determines the success or failure of your gum disease treatment. [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Note that most home remedies such as salves and creams merely treat the inflammation symptoms and don’t remove the bits of food or the plaque build up that ultimately leads to gingivitis and periodontitis. Reversing and preventing gum disease is all about daily plaque control. That means, in most cases, stopping the plaque in your mouth is really in your own hands. Brushing every day is a good start, but it is not enough."
    },
    {
      "title": "Use oral irrigation",
      "content": "Use oral irrigation . It is an effective gum disease treatment that dental professionals recommend for daily plaque control. An oral irrigator is attached to a water source such as a sink tap or shower head. They flood the mouth and gum pockets with a jet of water under pressure to flush offending food particles and bacteria from below the gum line. Research at the UNMC College of Dentistry indicates “that when combined with brushing, oral irrigation is an effective alternative to brushing and flossing for reducing bleeding, gingival inflammation, and plaque removal.” [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can buy an oral irrigator, like a WaterPik, which creates enough pressure to eliminate any bacteria left in between teeth or underneath the gum line. You can add some mouthwash to the water reservoir for enhanced protection against plaque. There are many different types of oral irrigators with different features. Most are compact enough to sit on your sink or bathroom counter. Fairly new on the market are irrigators that attach to your showerhead or your sink faucet. Irrigating is a pleasant experience you will want to repeat every day (some people may find flossing to be uncomfortable). And it takes only 15 seconds."
    },
    {
      "title": "Know the limitations of home remedies.",
      "content": "Know the limitations of home remedies. Many home remedies rely on anecdotal evidence, meaning someone's personal experience, and not scientific evidence. Be aware that many home remedies have no scientific backing that they are effective in treating gingivitis. This is why it is important to still visit your dentist and only combine home remedies with dentist-recommended advice. Do not use home remedies solely as a substitute for dental treatment."
    },
    {
      "title": "Try oral probiotics.",
      "content": "Try oral probiotics. Oral probiotics contain \"good\" bacteria that assist in restoring the natural balance of bacteria in the mouth after use of oral antiseptics found in mouthwashes and toothpastes. [10] X Research source Some oral probiotics (such as ProDentis) contain a bacteria called Lactobacillus reuteri , which is naturally found in breast milk and saliva. This bacteria is recommended especially during non-surgical therapy while maintaining other gingivitis treatments. [11] X Research source Ask your doctor for a brand recommendation."
    },
    {
      "title": "Try ubiquinone.",
      "content": "Try ubiquinone. Ubiquinone, also known as Coenzyme Q10, may help convert fats and sugars into energy. In addition to being used to treat diabetes and congestive heart failure, ubiquinone may be used to treat gum disease. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The FDA, however, has not cleared ubiquinone as medically-appropriate to treat any disease, so ubiquinone should not be used solely to treat gum disease."
    },
    {
      "title": "Try a peroxide oral rinse.",
      "content": "Try a peroxide oral rinse. An oral rinse that contains hydrogen peroxide, such as Colgate Peroxyl, is an antiseptic and antibacterial that may help treat infection and relieve inflammation when it comes in contact with an enzyme in the mouth. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Use this rinse no more than twice a week for three weeks in a row as it can cause tooth sensitivity."
    },
    {
      "title": "Use corsodyl spray.",
      "content": "Use corsodyl spray. Corsodyl spray is a powerful spray that contains chlorhexidine gluconate, which has antibacterial and antiplaque properties. Corsodyl spray may be used to treat any pain or discomfort associated with mouth ulcers, inflammation and infections of the mouth. [14] X Research source Corsodyl spray can be used when brushing the teeth becomes difficult and/or painful, such as after surgery. Be sure to keep spray out of ears and eyes."
    },
    {
      "title": "Try Gengigel gel.",
      "content": "Try Gengigel gel. This gel contains hyaluronic acid, which is naturally found in the body and may be used to heal certain wounds and stimulate the production of new tissue. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source For best results, apply at night before going to sleep."
    }
  ]
}