{
  "url": "https://www.wikihow.com/Death-Saves-5e",
  "title": "Everything D&D Players Need To Know About Death Saving Throws",
  "steps": [
    {
      "title": "Death saving throws determine whether a character lives or dies.",
      "content": "Death saving throws determine whether a character lives or dies. In D&D 5e, PCs (player characters) that fall unconscious after taking damage have to make death saving throws (also called death saves). Death saves essentially measure your PC’s ability to cling to life; passing death saves means your PC will live, while failing them brings your PC closer to death. [1] X Research source Most saving throws are tied to ability scores, meaning you can add your ability score modifiers to those saves and potentially have a higher chance of passing them. However, death saves are totally independent of all ability scores—so unless you have spells or features to improve your chances, death saves are totally random."
    },
    {
      "title": "PCs make death saving throws after dropping to 0 hit points.",
      "content": "PCs make death saving throws after dropping to 0 hit points. Hit points (HP) represent your PC’s hardiness and the amount of damage they can take. The stronger they are, the more HP they’ll have. However, when your PC gets hit by an enemy’s attack or takes damage, they’ll lose HP—and when they drop to 0 HP, they’ll fall unconscious and start making death saves. [2] X Research source Any kind of damage—whether from a beholder’s rays, a dragon’s breath, or a bandit’s sword—can drain a PC of hit points and, eventually, drop them to 0 HP. The amount of HP your character has before taking damage is their hit point maximum. The more HP your character loses (and the closer they get to 0), the more wounded they get. Every creature in D&D 5e has hit points, and your PC’s attacks can take away an enemy’s hit points just as theirs can damage your PC. Unconsciousness is a condition that typically applies to characters who drop to 0 HP. Unconscious characters can’t move, speak, or take actions."
    },
    {
      "title": "Roll a d20 at the start of your turn after falling unconscious.",
      "content": "Roll a d20 at the start of your turn after falling unconscious. When your PC falls unconscious, you can’t take actions or move them anymore; instead, on their turn, roll a single death save using a d20 (20-sided die). If you roll a 10 or higher, it’s a success—and if you roll any lower, it’s a failure. Mark the success or failure on your PC’s character sheet, then wait for your next turn. [3] X Research source Keep in mind that there are special rules for rolling a 1 (also called a critical failure) or a 20 (a critical success). If you roll a 1 on a death save, it’ll count as 2 failures. If you roll a 20, your PC will instantly become conscious once more with 1 hit point."
    },
    {
      "title": "Add any active bonuses or spells that affect saving throws to the roll.",
      "content": "Add any active bonuses or spells that affect saving throws to the roll. Since there are no innate bonuses associated with death saves, the outcome of a death save normally comes down to the luck of the roll. However, abilities and spells that affect saving throws can absolutely be used to increase your chances of succeeding on a death save, so don’t forget to factor them in! [4] X Research source For example, Bless is a spell that lets you add 1d4 to your saving throws—so if an ally casts it on your PC, be sure to roll that d4. If your PC has the Lucky feat (which is an optional feature that you can choose to give them), you can also reroll a death save up to 3 times."
    },
    {
      "title": "Keep rolling death saves until you get 3 successes or failures.",
      "content": "Keep rolling death saves until you get 3 successes or failures. Your goal when rolling death saves is to get 3 successes! At 3 successes, your PC becomes stable (no longer dying). Unless they’re healed, they’ll remain unconscious for 1d4 hours and wake with 1 HP. However, if they take damage while unconscious, they must make death saves again. And, if you fail 3 death saves, your PC dies. [5] X Research source You don’t have to roll 3 successes in a row to count them. As long as you get 3 successes before you get 3 failures, your PC will stabilize. There’s no such thing as negative hit points in D&D 5e—so once your character gets healed, they’ll regain consciousness and their death saves will reset. Some players use “Meat Grinder Mode” (which uses rules from the Tomb of Annihilation adventure). In this game mode, the DC for death saves becomes 15—making successes significantly more difficult to get."
    },
    {
      "title": "Unconscious PCs who take damage automatically fail a death save.",
      "content": "Unconscious PCs who take damage automatically fail a death save. Unfortunately, taking damage while already unconscious at 0 HP is the equivalent of making and failing a death saving throw. If it happens, mark a single failure on your PC’s character sheet (even though you didn’t roll for it). [6] X Research source Furthermore, if your PC takes damage from a critical hit, that counts as 2 death save failures."
    },
    {
      "title": "Instant death occurs when a PC takes damage equal to their HP total.",
      "content": "Instant death occurs when a PC takes damage equal to their HP total. Say your PC takes damage, and their hit points are reduced to 0 as a result. If there’s still damage left over after that, and it equals (or exceeds) your PC’s total hit points, that’s called “massive damage,” and it means your PC would die immediately—with no chance to make death saves. [7] X Research source For example, say your PC has 20 HP in total. If a dragon’s acid breath dealt 42 points of damage to your PC, it’d kill them (since 20 damage is enough to bring them to 0, and the remaining 22 exceeds their HP maximum). Instant death can also be caused by other effects, like spells such as Disintegrate (which reduces creatures to dust if it brings them to 0 HP) or Power Word Kill (which kills any creature with less than 100 HP immediately). Additionally, your PC can die instantly if their strength score is reduced to 0 from a shadow’s Strength Drain attack."
    },
    {
      "title": "PCs make death saves, but most monsters and NPCs don’t.",
      "content": "PCs make death saves, but most monsters and NPCs don’t. If you’re a player with a PC, you can expect to make death saves when your PC drops to 0 HP and falls unconscious. However, PCs are generally the only characters in a D&D campaign that make death saves; most monsters, NPCs (non-player characters), and other enemies simply die when reduced to 0 HP. [8] X Research source However, some DMs choose to have enemies and NPCs who are particularly powerful (or important to the plot) make death saves as well. It depends on your DM’s style and preferences!"
    },
    {
      "title": "Stabilizing or healing a character can prevent them from dying.",
      "content": "Stabilizing or healing a character can prevent them from dying. Just because a character falls unconscious doesn’t mean their fate is at the mercy of the dice! Help a downed ally by making a Medicine check; on a 10 or higher, they’ll be stabilized (meaning they’re unconscious but don’t have to make death saves). Otherwise, use a healing spell or item to help an ally. This includes: [9] X Research source Spare the Dying. Healing Word is a 1st-level spell available to bards, clerics, and druids. It can heal targets for HP equal to 1d4 + your PC’s spellcasting modifier. Cure Wounds is a 1st-level spell available to bards, clerics, druids, paladins, and rangers. It can heal a target for HP equal to 1d8 + your PC’s spellcasting modifier. Healing Spirit, a 2nd-level spell available to druids and rangers, summons a nature spirit that can heal targets for 1d6 HP. Goodberry is a 1st-level spell available to druids and rangers; it allows you to create magical berries that heal 1 HP when eaten. Aid is a 2nd-level spell available to clerics and paladins; it can increase a creature’s maximum and temporary HP by 5 for the spell’s duration. Life Transference is a 3rd-level spell available to clerics and wizards. Upon casting the spell, your PC takes 4d8 necrotic damage—but your target heals twice that amount of damage. Heal is a 6th-level spell available to clerics and druids that heals targets for 70 hit points. Healer’s kits can be used to stabilize creatures without making a medicine check. Healing potions can be self-administered or given to allies in battle. Aside from the basic potion, there are also greater, superior, and supreme healing potions (which are progressively more powerful)."
    },
    {
      "title": "Dead PCs are out of the game, although it isn’t always permanent.",
      "content": "Dead PCs are out of the game, although it isn’t always permanent. When a character dies, they can’t be healed, and they’re unable to act, speak, or do anything. They’re essentially gone from the game—but depending on your preferences, you can still play that character again so long as they’re brought back to life somehow. [10] X Research source Tip: Talk to your DM before a campaign about your expectations surrounding PC death and resurrection. For example, some players are open to the idea of their PC dying permanently, but others aren’t and want to play the same PC for the entire campaign. Both play styles are totally valid! Some DMs like to challenge players and make death (and resurrection) a real challenge, while others prefer to make returning to life easier and more accessible. A good DM will listen to your preferences and respect them. So, if you’re okay with PC death but ultimately want them to return to life, let your DM know so they can plan accordingly."
    },
    {
      "title": "Resurrection spells can bring a fallen creature back to life.",
      "content": "Resurrection spells can bring a fallen creature back to life. If your PC (or one of their allies) dies during a campaign, don’t lose hope—because you can always use a resurrection spell. Resurrection spells are expensive to cast, and most have time limits (meaning the creature must be dead for less than a certain amount of time). The higher the spell’s level, the stronger it is. This includes: [11] X Research source Revivify is a 3rd-level artificer, cleric, paladin, wildfire or witherbloom druid, divine soul sorcerer, and celestial or witherbloom warlock spell. It resurrects creatures, but only if they died within the last minute. Raise Dead is a 5th-level bard, cleric, paladin, alchemist artificer, divine soul sorcerer, and wildfire druid spell that resurrects any creature that died in the last 10 days. Resurrection is a 7th-level bard, cleric, and divine soul sorcerer spell that revives creatures that died up to 100 years ago. Reincarnate is a 7th-level druid spell that returns any creature that died in the last 10 days to life in a new body. Clone is an 8th-level wizard and arcana cleric spell that creates a duplicate of a creature, and if that creature dies, the soul transfers to the duplicate. True Resurrection is the strongest resurrection spell available to clerics, druids, and divine soul sorcerers. It restores creatures to life, even if they’ve been gone for up to 200 years or no longer have a body. Wish is an incredibly powerful level 9 spell available to wizards, sorcerers, arcana clerics, and genie warlocks. With it, you can undo recent events (including the moment an ally died)."
    },
    {
      "title": "Players can choose to make a new PC if their old one dies.",
      "content": "Players can choose to make a new PC if their old one dies. You might be one of those players who enjoys the stakes that come with permanent PC deaths—in which case, you might want to skip the resurrections entirely and just make a new character to replace one that gets killed. If that sounds like you, try creating a backup character to have ready if anything happens to your current PC! [12] X Research source Your DM might also have rules about what level to make your new character, so be sure to ask. Some DMs might want you to make your new PC the same level as everyone else’s characters, while others might want you to start from scratch at level 1. Some DMs might even prefer you to bring your old character back if they’ve already tied that PC into the campaign story, so be sure to get on the same page before making any big decisions either way."
    }
  ]
}