{
  "url": "https://www.wikihow.com/Get-Rid-of-Period-Cramps",
  "title": "How to Get Rid of Period Cramps",
  "steps": [
    {
      "title": "Use ibuprofen (Advil, Motrin IB) or naproxen sodium (Aleve).",
      "content": "Use ibuprofen (Advil, Motrin IB) or naproxen sodium (Aleve). For best results, start taking a regular dose the day before you anticipate cramping will start. Having a base level of the drug in your system helps them work better. Keep taking a regular dose throughout your period following the instructions on the label. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you don't get enough pain relief, talk to your doctor. They might approve a larger dose or prescribe a stronger pain medication that will work better for you."
    },
    {
      "title": "Place the heating pad on your tummy or lower back to ease cramps.",
      "content": "Place the heating pad on your tummy or lower back to ease cramps. Heat also improves blood flow, which can help with cramping. [3] X Research source For some people, heat is even more effective than an over-the-counter pain reliever. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can also soak in a hot bath, which can be relaxing for your body and your mind."
    },
    {
      "title": "Lie on your side with your knees pulled up toward your chest.",
      "content": "Lie on your side with your knees pulled up toward your chest. This works well to relieve pressure on your lower back, which can be intense when you're having cramps. You might put a pillow between your knees as well or lay flat on your back with a pillow under your knees. [5] X Research source You might find it even more comfortable to place a heating pad on your abdomen or cover yourself with a weighted blanket."
    },
    {
      "title": "Getting plenty of fluids can ease cramps and bloating.",
      "content": "Getting plenty of fluids can ease cramps and bloating. As your period draws near, you're more likely to retain water (bloating), which in and of itself can be painful. Simply drinking more water can reduce the severity of your cramps and might even shorten your period. Drink 6 to 8 glasses of water each day. [6] X Research source"
    },
    {
      "title": "Deep breathing exercises can reduce the intensity of cramps.",
      "content": "Deep breathing exercises can reduce the intensity of cramps. For an easy breathing exercise, sit in a comfortable position and turn your thoughts to your breath. Inhale slowly through your nose and imagine your lungs filling with air from the bottom to the top. Pause, then exhale through your mouth, releasing the air just as slowly as you brought it in. Repeat for 5-10 breath cycles. [7] X Research source Similarly, doing yoga can also be effective in reducing pain from menstrual cramps. [8] X Research source"
    },
    {
      "title": "Chamomile tea eases mental stress and calms tense muscles.",
      "content": "Chamomile tea eases mental stress and calms tense muscles. You can find this herbal tea at any grocery store. Brewing a cup before going to bed will help you relax and can improve your sleep quality as well. [9] X Research source"
    },
    {
      "title": "These alternative therapies reduce cramps for many people.",
      "content": "These alternative therapies reduce cramps for many people. While these alternative therapies aren't government-regulated and haven't been studied extensively, they are considered safe. If you've tried other remedies and weren't happy with the results, they're worth a try. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You might also try physical therapy that aims to reduce pressure at certain trigger points associated with menstrual cramps. Nerve stimulation therapy can also help. [11] X Trustworthy Source American College of Obstetricians and Gynecologists Professional association of OB/GYNs focused on education and public outreat initiatives Go to source Keep in mind that many of these alternative therapies can be costly, and they typically aren't covered by health insurance."
    },
    {
      "title": "Cardiovascular exercise improves blood flow to make cramping less intense.",
      "content": "Cardiovascular exercise improves blood flow to make cramping less intense. Make exercise a part of your routine and aim for 20-30 minutes of moderate-intensity exercise on most days of the week. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This can be as simple as going for a walk. Choose an activity you enjoy so you'll be motivated to get out there and move around. [13] X Research source During PMS, exercise is also helpful—if you can get yourself moving. Sometimes you might not feel up to it, but if you can manage even a short walk, it'll get those endorphins pumping and you might find you start to feel a little better. [14] X Research source"
    },
    {
      "title": "Fruits, vegetables, and whole grains help cramping over time.",
      "content": "Fruits, vegetables, and whole grains help cramping over time. This won't help you much if you only do this when your cramps set in—this is a lifestyle change. Make adjustments gradually, replacing refined grains like white bread and pasta with whole grains and eliminating processed and fried foods. [15] X Research source You might also notice less cramping if you avoid animal products entirely, especially meat and dairy. This is an easier change to make if you get your family and friends involved—it's hard to change your way of eating on your own. Make the change slowly, eliminating one food at a time over the course of several weeks. Talk to your doctor or work with a nutritionist to come up with food options that will leave you feeling full and provide you with the nutrition you need."
    },
    {
      "title": "Sugar and caffeine make period cramps worse.",
      "content": "Sugar and caffeine make period cramps worse. Sugar is highly inflammatory and caffeine can restrict blood flow. If you’re experiencing cravings, reach for a decaf coffee if you must, or have a small piece of dark chocolate. [16] X Research source If you're having a hard time with sugar cravings, try a cup of hibiscus tea, which can help naturally calm the urge for something sweet. [17] X Research source"
    },
    {
      "title": "Omega-3 and magnesium supplements might ease cramps.",
      "content": "Omega-3 and magnesium supplements might ease cramps. Vitamins E, B-1 (thiamin), and B-6 also help some people reduce the intensity of their cramps. Talk to your doctor before taking any nutritional supplements, especially if you're taking medication for other conditions. [18] X Research source Like changing your diet, supplements are more of a lifestyle change. If you only take these supplements during your period, you likely won't notice much effect. However, if you take them for a month or two, you might start to see a difference."
    },
    {
      "title": "Hormonal birth control can help treat painful periods.",
      "content": "Hormonal birth control can help treat painful periods. Birth control methods that contain estrogen and progestin, which may come as a pill, patch, or vaginal ring, tend to work best. However, methods that only contain progestin might also work. Talk to your doctor about options that will best suit you and your lifestyle. [19] X Trustworthy Source American College of Obstetricians and Gynecologists Professional association of OB/GYNs focused on education and public outreat initiatives Go to source You can also get a hormonal intrauterine device (IUD) implanted to help with menstrual cramps. The IUD frequently results in a lighter menstrual flow, which makes the whole experience less intense. Over time, you might even stop bleeding completely."
    },
    {
      "title": "Severe cramps might be a sign of something more serious.",
      "content": "Severe cramps might be a sign of something more serious. If your period pain is so bad that it's hard for you to do everyday activities, or if nothing seems to make it better, make an appointment with a gynecologist. Tell them about your menstrual history, your lifestyle, and any drugs you're taking for other medical conditions. All of this information will help them figure out what might be making your cramps so bad and what they can do to help. Possibilities include: [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Pelvic inflammatory disease: An infection of your reproductive organs Endometriosis: The lining of your uterus grows outside your uterus, leading to severe pain Adenomyosis: Your uterine lining grows into the muscle wall of your uterus Uterine fibroids: Non-cancerous growths that cause severe cramping unless removed"
    }
  ]
}