{
  "url": "https://www.wikihow.com/Make-a-Timeline-in-PowerPoint",
  "title": "10 Easy Steps to Make a Timeline in Microsoft PowerPoint",
  "steps": [
    {
      "title": "Make a list of all your timeline events.",
      "content": "Make a list of all your timeline events. Each should contain a time marker and a title; some may require a brief description. Try to keep all the text as succinct as possible allowing the presenter to provide more information. Timelines are traditionally presented in one of three ways; horizontal, vertical, and free flowing. Each has its strength. It’s important to pick the right format for your information. Two factors will determine the best layout – the number of events in your timeline and the amount of text required to describe each event. Horizontal timelines work best with up to 8 points with short descriptions. Vertical timelines work best for timelines with fewer points and more text. Free-flowing timelines are appropriate if you have lots of points and a horizontal timeline won’t give you the space you need."
    },
    {
      "title": "Open a project in Microsoft PowerPoint.",
      "content": "Open a project in Microsoft PowerPoint. This looks like a P on top of an orange circle. Microsoft PowerPoint is available to install for Windows and Mac . [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Adding a colorful timeline can help you make a great presentation. You must have a subscription to Microsoft 365 to use the desktop version of PowerPoint. If you don't have the PowerPoint app on your computer, you can use PowerPoint on the web to create your timeline. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click the page where you want your timeline.",
      "content": "Click the page where you want your timeline. You can add it to an existing slide, or click New Slide in the Home tab to create a new one."
    },
    {
      "title": "Click Insert.",
      "content": "Click Insert . This will be in the top toolbar, between Home and Design ."
    },
    {
      "title": "Click SmartArt.",
      "content": "Click SmartArt . You can find this in the Illustrations section, next to 3D Models . A new window will open. On Mac, a drop-down menu will open."
    },
    {
      "title": "Click Process.",
      "content": "Click Process . This will be in the left panel. On Mac, this will be underneath List in the drop-down menu."
    },
    {
      "title": "Select a timeline layout and click OK.",
      "content": "Select a timeline layout and click OK . Scroll up and down to view the default options. You'll be able to customize the color and size later. The timeline will be added to your slide. Make sure it's selected before proceeding to the next step."
    },
    {
      "title": "Enter your timeline data in the field.",
      "content": "Enter your timeline data in the field. If you don't see the panel on the left side of the timeline, click Text Pane at the top, in the \"Create Graphic\" section of the SmartArt Design tab. Click the [Text] field to enter a date or milestone for your timeline. Repeat this for all data."
    },
    {
      "title": "Add more data slots.",
      "content": "Add more data slots. If you need to add more fields for your data, select the timeline and click Add Shape . You can find this in the Create Graphic section of the SmartArt Design tab. Click the newly added bullet points in the Text Pane to input your additional data."
    },
    {
      "title": "Change the color.",
      "content": "Change the color. In the SmartArt Design tab, click Change Colors . This will be underneath the palette icon. Select from the default palettes to change the theme. To manually change the color, double-click an element on your timeline. The Format Shape panel will open on the right. Click the drop-down menu for Color and select a color."
    },
    {
      "title": "Resize the timeline.",
      "content": "Resize the timeline. Select the timeline. You'll see the sizing handles appear in a box around the timeline. Click one corner of the timeline and drag it outwards to make it bigger. Alternatively, drag it inwards to make it smaller. To move the entire timeline, click and hold any section of the sizing box. Drag the timeline to where you want it. Timelines can also be created in Microsoft Excel or Microsoft Word ."
    },
    {
      "title": "Open up a fresh slide in PowerPoint and in the Insert tab, navigate to Shapes, then insert a new Line.",
      "content": "Open up a fresh slide in PowerPoint and in the Insert tab, navigate to Shapes, then insert a new Line. Hold Shift to lock the line horizontally and drag your line across the slide and up against your left and rightmost guides. You can give the line a bit of life by thickening it up, changing the color, and adding an end arrow to show the progression of time. You can do all this in the Format Shape window (Right Click > Format Shape)."
    },
    {
      "title": "Add the events.",
      "content": "Add the events. As you have already prepared your data, you know how many intervals you need. First, measure your timeline. Select the line and navigate to the Shape Format tab. Under Size, it will tell you the width. If your line is 31.28cm across and you have 6 events you'll need to divide the width by 6. Before you do this, subtract a small amount off the width so that there is some breathing room between each event – let’s say 0.5cm between each. So, subtract 2.5cm from 31.28cm (28.78cm), then divide that by 6, leaving you with 4.8cm. Go back to your Insert tab, navigate to Shapes, and insert a new rectangle. Back in the Shape Format Tab enter the final figure as the width – e.g. 4.8cm."
    },
    {
      "title": "Drag this shape over your slide so the left edge butts up against the start of your timeline, then Copy & Paste the rectangle so you have a total of six.",
      "content": "Drag this shape over your slide so the left edge butts up against the start of your timeline, then Copy & Paste the rectangle so you have a total of six. Place one of these so the right edge butts up against the end of the timeline. Select all six and click Align Objects Middle, then Distribute Horizontally. All 6 event containers should now be perfectly aligned and distributed on your slide."
    },
    {
      "title": "Type your prepared titles into each box, then change the shape fill to No Fill in the Format Shape tab.",
      "content": "Type your prepared titles into each box, then change the shape fill to No Fill in the Format Shape tab. In the Size & Properties section, you can also tick Resize Shape to Fit Text, trimming down the boxes to size."
    },
    {
      "title": "Select all your boxes, hold Ctrl + Shift, and drag them down vertically to duplicate all 6.",
      "content": "Select all your boxes, hold Ctrl + Shift, and drag them down vertically to duplicate all 6. Insert your descriptions in these boxes. Be sure to shrink the font size slightly so the titles pop."
    },
    {
      "title": "Connect the timeline events to the line itself.",
      "content": "Connect the timeline events to the line itself. Insert a new Circle (Insert > Shapes > Circle) and drag to resize (holding Shift while dragging to draw a perfectly round circle). Select the circle, and holding Ctrl, drag the shape anywhere on the slide to make a duplicate. Repeat until you have one circle per timeline event. Align one circle on the timeline above your first event and another at the end one, then select all of the circles and use the Distribute Horizontally tool, followed by Align Objects Middle. To change the look of the circles you can dive back into the Format Shape tab."
    },
    {
      "title": "Add a date or time marker above each event.",
      "content": "Add a date or time marker above each event. Duplicate your title text boxes again (hold Ctrl to duplicate, and Shift to lock movement vertically, then drag the boxes upwards). Change the text to your dates, then change the Text Alignment to Bottom (Home > Align Text > Bottom) so the text sits close to the PowerPoint timeline at the bottom of the text boxes."
    },
    {
      "title": "Place icons above the dates to give the slide a splash of color.",
      "content": "Place icons above the dates to give the slide a splash of color."
    }
  ]
}