{
  "url": "https://www.wikihow.com/Say-%22Excuse-Me%22-in-Spanish",
  "title": "How Do You Say “Excuse Me” in Spanish?",
  "steps": [
    {
      "title": "Disculpe (dees-COOL-pay)",
      "content": "Disculpe (dees-COOL-pay) While disculpe is a way of saying “I’m sorry,” it’s also used as the Spanish equivalent of “excuse me.” Just like we might say “excuse me” in English to get the attention of a clerk at a store or a waiter at a restaurant, you can use “disculpe” in the same way when speaking Spanish. [1] X Research source “¡Disculpe! Quiero ordenar un café.” (dees-COOL-pay KYE-ro ord-en-AR oon kaf-AY): “Excuse me! I want to order a coffee.” “Disculpe, ¿cómo llego a mi hotel?” (dees-COOL-pay KO-mo YEG-oh ah me OH-tel): “Excuse me, how do I get to my hotel?” Informal version: Use disculpa (dees-COOL-pah) with someone your age or younger, or with older people when you are on familiar terms with them. [2] X Research source Perdón (per-DOAN) is also appropriate to get someone’s attention politely and used identically to disculpe ."
    },
    {
      "title": "Discúlpeme (dees-COOL-pay-may)",
      "content": "Discúlpeme (dees-COOL-pay-may) This variation comes across as somewhat more apologetic, and is therefore a good option if you’re getting the attention of someone while they’re in the middle of something else. “Discúlpame, no quiero molestarte, pero necesito tu ayuda.” (dees-COOL-pa-may no KYE-ro mo-less-TAR-tay PE-ro ne-sess-EE-to too ay-OO-da): “Forgive me, I don’t want to bother you, but I need your help.” “Discúlpeme, sé que está ocupado.” (dees-COOL-pay-may say kay ess-TA o-coo-PA-do): “Forgive me, I know you’re busy.” Informal version: If you’re speaking with someone your age or younger, or with whom you’re on familiar terms, you can instead say discúlpame (dees-COOL-pah-may). Perdóneme (per-DOAN-eh-may) is used identically to discúlpeme to politely interject."
    },
    {
      "title": "Perdón (per-DOAN)",
      "content": "Perdón (per-DOAN) If you’re somewhere like a crowded metro stop, you can use perdón to be polite when you ask someone to move for you. It has a slightly apologetic connotation, meaning it’s useful when you want to make a minor apology for an inconvenience. [3] X Research source “Perdón, aquí me bajo.” (per-DOAN a-KEY may BA-ho): “Excuse me, I’m getting down here.” “Perdón, tengo que salir.” (per-DOAN TEN-go kay SAL-eer): “Excuse me, I need to leave.” Informal version: Try perdona (per-DOAN-ah) when talking to someone who seems to be your age or younger, or someone with whom you’re on familiar terms. [4] X Research source More formal version: When you want to be especially formal, like if you’re talking to an authority figure, you can also say perdóneme (per-DOAN-ay-may)."
    },
    {
      "title": "Permiso (per-MEE-so)",
      "content": "Permiso (per-MEE-so) Use this phase to say “May I?” or ask for permission. For example, if you want to pass by someone else in a crowd, you can say permiso (“permission”) or con permiso (“with permission”) in order to politely ask for space. You could also use this expression when reaching across the dinner table for food. This expression literally means, “with (your) permission.” [5] X Research source Con permiso is especially popular in Latin America, but you can also use it in Spain without any trouble. Use con permiso or con su permiso (“with your permission”) in more formal or polite settings. For a more casual exchange, go with a plain permiso . Formal version: Use permíteme (per-MEE-tay-may), meaning “permit me” or “allow me,” to excuse yourself in very formal settings like banquets. “Permiso, tengo que entrar.” (per-MEE-so TEN-go KAY EN-trar): “Excuse me, I have to come in.” “Con su permiso, quiero más arroz.” (con soo per-MEE-so KYE-ro mahs ar-ROSE): “Excuse me, I want more rice.”"
    },
    {
      "title": "Con permiso (con per-MEE-so)",
      "content": "Con permiso (con per-MEE-so) Just like you might use the English expression “If you’ll excuse me” to exit a meeting with your boss, you can use this Spanish phrase in similar situations to end an interaction politely. “Con permiso, necesito llamar a mi esposa.” (con per-MEE-so ness-ess-EE-to YAM-ar ah me ess-POS-ah): “If you’ll excuse me, I need to call my wife.” “Con permiso, voy a trabajar.” (con per-MEE-so voy a tra-BA-har): “If you’ll excuse me, I’m going to work.”"
    },
    {
      "title": "Un momento (oon moh-MEN-toh)",
      "content": "Un momento (oon moh-MEN-toh) If someone is saying something false or you need to interrupt them to defend yourself, use un momento . It literally means “one moment” and is similar to saying “Now wait just a second!” in English when you need to correct someone to tell them to pause. “Un momento, eso no es correcto.” (oon moh-MEN-toh AY-so no ess koh-REK-toh): “Excuse me, that is not correct.” “¡Un momento, por favor!” (oon moh-MEN-toh poor fah-VOHR): “Excuse me, please!” Informal version: If you’re speaking to friends or family members, try espere (es-PAIR-ay) instead. It means “wait” and is a more casual and direct way of telling someone to pause."
    },
    {
      "title": "¿Cómo? (KO-mo) or ¿Cómo fue? (KO-mo fway)",
      "content": "¿Cómo? (KO-mo) or ¿Cómo fue? (KO-mo fway) In English, you might say “Excuse me?” if you didn’t catch what someone said and want them to repeat themselves. Both ¿Cómo? (“What?” or “Come again?”) and ¿Cómo fue? (“What was that?”) can be used the same way. It’s a polite prompt for the other person to restate what they said. [6] X Research source “¿Cómo? No puedo escucharte.” (KO-mo? no PWAY-doh es-coo-CHAR-tay): “What? I can’t hear you.” “¿Cómo fue? Hay mucho ruido aquí.” (KO-mo fway? Ai MOO-cho roo-EE-doh ah-KEE): “What was that? It’s very loud in here.” In Mexico, ¿mande? (MAHN-day) is a colloquial saying that means and is used the same way as ¿cómo? It’s considered very casual, so use it with close friends or family."
    },
    {
      "title": "Perdón or Lo siento (loh see-EN-toh)",
      "content": "Perdón or Lo siento (loh see-EN-toh) Just as you might say “excuse me” or “pardon me” to apologize for accidentally bumping into someone, you can use perdón or lo siento in the same way. However, lo siento translates to “I’m sorry” and expresses more sorrow, whereas perdón is more of a polite formality for when you make a small blunder. [7] X Research source “Perdón, no te había visto.” (per-DOAN no tay ab-EE-ah VEES-to): “Pardon me, I hadn’t seen you.” “Lo siento, no quise decir eso.” (loh see-En-toh no KEY-say DESS-eer ESS-oh): “Forgive me, I didn’t mean to say that.”"
    },
    {
      "title": "Excúsame (ek-SCOO-sah-may)",
      "content": "Excúsame (ek-SCOO-sah-may) You might think excúsame would just mean a polite “excuse me” in any scenario, but in Spanish, it’s used specifically to mean “I’m sorry” or to make an apology or excuse for a negative outcome you caused. [8] X Research source “Excúsame, yo cometí un error.” (ek-SCOO-sah-may, yo coh-may-TEE un air-ROAR): “Excuse me, I made a mistake.” “Excúsame, lo que hice estuvo mal.” (ek-SCOO-sah-may, loh kay EE-say es-TOO-voh mahl): “Forgive me, what I did was wrong.”"
    },
    {
      "title": "Me apena (may ah-PAY-nah), Lamento (lah-MEN-toh)",
      "content": "Me apena (may ah-PAY-nah), Lamento (lah-MEN-toh) Similar to lo siento or excúsame , me apnea (“I regret” or “I’m saddened”) or lamento (“I lament”) both express sorrow or deep remorse for doing something wrong or causing a major inconvenience. [9] X Research source While they can be used to mean “excuse me,” save these terms for extreme situations where you have some big explaining to do (like if you were at fault for a fender bender, for example). “¡Me apena! No te vi en la intersección.” (may ah-PAY-nah no tay vee en lah in-ter-sek-see-OHN): “I’m sorry! I didn’t see you in the intersection.” ¡Lamento! Le dije tu secreto.” (lah-MEN-toh lay DEE-hay too say-CRAY-toh): “I’m sorry! I told your secret.”"
    },
    {
      "title": "Use formal commands with your elders, in places of business or law, or to show special respect.",
      "content": "Use formal commands with your elders, in places of business or law, or to show special respect. In Spanish, phrases like discúlpeme or permíteme are considered commands (largely just in terms of grammar; it’s not like you’re ordering someone to excuse you in reality). Use formal commands with anyone you would call usted (the formal word for “you”). These include people you don’t know well who are older than you, people you know well but who are much older than you, people working in formal contexts like in court or a business, or anyone you want to show extra respect to, like a police officer. [10] X Research source On the other hand, use informal commands for anyone you’d call tú (the informal word for “you”). These are people you know well or who are your same age or younger. For example, you’d say discúlpeme (formal) to your boss, but discúlpame (informal) to your friend after work. “Commands” are not considered as harsh or direct in Spanish as they seem in English."
    }
  ]
}