{
  "url": "https://www.wikihow.com/Disable-Facebook-Chat",
  "title": "How to Disable Facebook Chat",
  "steps": [
    {
      "title": "Log into Facebook on your computer.",
      "content": "Log into Facebook on your computer. Go to the Facebook website using your preferred web browser. On Facebook’s home page, enter your email address and password at the top right corner, and click “Sign in” to continue."
    },
    {
      "title": "Click the Gear icon at the lower right corner of your screen, on the chat box.",
      "content": "Click the Gear icon at the lower right corner of your screen, on the chat box. This will open the Chat Settings menu. [1] X Research source"
    },
    {
      "title": "Select “Turn off chat.",
      "content": "Select “Turn off chat. ” A menu of various chat settings options to choose from will open; just click on the option you prefer. [2] X Research source Turn off chat for all friends — This will disable all chat notifications on your Facebook. Turn off chat for all friends except — If you want to turn off chat for all except a few select friends, choose this option. You will then be asked to choose which friends you want to keep chat enabled. Turn off chat for only some friends — This option allows you to turn off chat for selected friends only."
    },
    {
      "title": "Launch the Facebook app.",
      "content": "Launch the Facebook app. Tap the app’s icon on your home screen or app drawer to launch it. [3] X Research source"
    },
    {
      "title": "Log into your Facebook app.",
      "content": "Log into your Facebook app. Type in your email address and password on the space provided and hit the “Log in” button"
    },
    {
      "title": "Tap on the more icon.",
      "content": "Tap on the more icon. This is the 3 vertical bars next to the globe icon near the top header. It will display all menu options. ."
    },
    {
      "title": "Select “Chat.",
      "content": "Select “Chat. ” The panel on the right will widen."
    },
    {
      "title": "Tap the gear located at the upper right corner of the panel.",
      "content": "Tap the gear located at the upper right corner of the panel. The Chat sub-menu will appear. [4] X Research source"
    },
    {
      "title": "Uncheck the “On” button by tapping on it.",
      "content": "Uncheck the “On” button by tapping on it. This will turn off the Facebook app chat. [5] X Research source"
    },
    {
      "title": "Launch the Facebook app.",
      "content": "Launch the Facebook app. Tap the app’s icon on your home screen or app drawer to launch it. [6] X Research source"
    },
    {
      "title": "Log into your Facebook app.",
      "content": "Log into your Facebook app. Type in your email address and password on the space provided and hit the “Log in” button"
    },
    {
      "title": "Tap on the more icon.",
      "content": "Tap on the more icon. This is the 3 vertical bars next to the globe icon near the top header. It will display all menu options."
    },
    {
      "title": "Tap on “App Settings.",
      "content": "Tap on “App Settings. ” You will have to scroll down a bit to find this option."
    },
    {
      "title": "Uncheck “Facebook chat.",
      "content": "Uncheck “Facebook chat. ” Under the General settings, “Facebook chat” will be the first option. If it is enabled, you’ll see a checkmark to the right. To disable, just tap on the option, and the checkmark should disappear. [7] X Research source"
    }
  ]
}