{
  "url": "https://www.wikihow.com/Organize-Yourself-Using-Microsoft-Outlook",
  "title": "How to Organize Yourself Using Microsoft Outlook",
  "steps": [
    {
      "title": "The first thing that needs to be done is to turn off new email notification.",
      "content": "The first thing that needs to be done is to turn off new email notification. To do this, Pull down the File menu, select Tools, then select Options. The options window will open. On the Preferences Tab click on the \"E-mail Options\" button. In the options window that opens, click on the \"Advanced E-mail Options\" button. In the options window that opens, look in the \"When new items arrive in my inbox\" section. De-select all the options."
    },
    {
      "title": "Make the calendar your default view in Outlook.",
      "content": "Make the calendar your default view in Outlook. It will provide you with a view of scheduled work for the day. To set calendar as your default view, pull down the File menu, select Tools, and then select Options. In the Options window, select the \"Other\" tab, then click the \"Advanced Options\" button. In the \"Advanced options\" window, looking in the \"General settings\" section and click on browse. The select folder will open. In the \"Select Folder\" window, select \"Calendar\" and click OK three times."
    },
    {
      "title": "To include your tasks in the default window, pull down the File menu and select View, then select Task pad.",
      "content": "To include your tasks in the default window, pull down the File menu and select View, then select Task pad."
    },
    {
      "title": "To view only tasks due today, pull down the File menu and select View, then select \"Task pad view\", then select \"Today's tasks\".",
      "content": "To view only tasks due today, pull down the File menu and select View, then select \"Task pad view\", then select \"Today's tasks\"."
    },
    {
      "title": "Schedule a specific time each day to view your emails.",
      "content": "Schedule a specific time each day to view your emails. Set 2 to 3 times a day to work with your emails, and don't look at them at any other time. Emails are a distraction and keep you from getting real work done."
    },
    {
      "title": "Whenever you read emails, always clear out your Inbox.",
      "content": "Whenever you read emails, always clear out your Inbox. There should never be anything left at the end of the email session. To clear out your inbox, you must decide what to do with each email. You have four choices: Delete, defer, delegate, or do."
    },
    {
      "title": "If you have dealt with the email, delete it.",
      "content": "If you have dealt with the email, delete it."
    },
    {
      "title": "To defer an e-mail, create a task by dragging the email onto the task button in the bottom left corner of Outlook.",
      "content": "To defer an e-mail, create a task by dragging the email onto the task button in the bottom left corner of Outlook. A task will automatically be created; select a start date and time, and a due date and time, then save it."
    },
    {
      "title": "To delegate an email, create a task and assign the task to another individual or forward the email to another individual.",
      "content": "To delegate an email, create a task and assign the task to another individual or forward the email to another individual."
    },
    {
      "title": "The last choice is do whatever the task is that the email requires.",
      "content": "The last choice is do whatever the task is that the email requires. If you do it, delete it from your inbox or move it to a personal folder where you keep old dealt-with emails."
    },
    {
      "title": "To block off time in your calendar, drag and drop an email onto the calendar button in the bottom left corner of Outlook.",
      "content": "To block off time in your calendar, drag and drop an email onto the calendar button in the bottom left corner of Outlook. A meeting notice will open. Enter the time and date you want to block off, then save it. A copy of the email will be included with the meeting notice. Delete the email from the inbox or move to a personal folder."
    }
  ]
}