{
  "url": "https://www.wikihow.com/Measure-Centimeters",
  "title": "How to Measure Centimeters",
  "steps": [
    {
      "title": "Locate the centimeters on the ruler.",
      "content": "Locate the centimeters on the ruler. Many rulers have two sets of numbers. You are looking for the metric set of numbers. This side of the ruler will be labeled c m {\\displaystyle cm} , the abbreviation for centimeters. [1] X Research source It might also be labeled m m {\\displaystyle mm} , the abbreviation for millimeters. Millimeters are the smaller metric units shown on the ruler by the shorter lines in between the centimeters. [2] X Research source The other side of the ruler is the standard side of the ruler. It will show inches , which is the standard U.S. unit."
    },
    {
      "title": "Understand the relationship between a millimeter and a centimeter.",
      "content": "Understand the relationship between a millimeter and a centimeter. If you look closely at your ruler, you will see that each centimeter is divided into 10 parts by the shorter lines. A millimeter is one-tenth of a centimeter. [3] X Research source Note that 1 mm = 0.1 cm."
    },
    {
      "title": "Align the edge of the object with the first centimeter line on the ruler.",
      "content": "Align the edge of the object with the first centimeter line on the ruler. Note that the edge of the physical ruler often does not align with the beginning of the first centimeter. So take care to align the object to the first line, not to the edge of the ruler. [4] X Research source Keep the ruler as flat against the measured side of the object as possible."
    },
    {
      "title": "Find the length in whole centimeters.",
      "content": "Find the length in whole centimeters. Look at the other edge of the object. Identify the nearest mark to that edge. This mark will tell you how long the object is. If the edge falls on a longer centimeter line marked with a whole number, the object is that many centimeters long. For example, if the edge of an eraser ends at the line marked 7, the eraser is 7 cm long. If you are measuring to the nearest centimeter, look for the nearest line to the edge of the object that is marked with a number. This mark will tell you the nearest centimeter. For example, an eraser might fall less than halfway between the 7 and 8 cm marks. Since the eraser ends closer to the 7 cm mark, you would say that, to the nearest centimeter, the eraser is 7 centimeters long."
    },
    {
      "title": "Find the length to the nearest tenth of a centimeter.",
      "content": "Find the length to the nearest tenth of a centimeter. Look at the last whole centimeter the edge of the object passes. Then, count the number of millimeters past the last whole centimeter that the object’s edge goes. Each millimeter is one-tenth of a centimeter. So, to find the length, combine the number of whole centimeters and tenths of a centimeter. [5] X Research source For example, if the edge of an eraser ends 1 millimeter past 7 centimeters, the eraser is 7.1 centimeters long."
    },
    {
      "title": "Note a few objects that are roughly 1 cm wide.",
      "content": "Note a few objects that are roughly 1 cm wide. If you do not have a ruler but you need a rough estimate of an object's length in centimeters, you can use any object that is known to have a width that roughly equals one centimeter. The easiest objects to use are a standard pencil, pen, or highlighter. The width of a pencil is close to 1 cm. Other options include the length of a staple, the width of five CDs or DVDs stacked together, the thickness of a standard notepad, and the radius of a U.S. penny. [6] X Research source"
    },
    {
      "title": "Place the object you are measuring on a sheet of paper.",
      "content": "Place the object you are measuring on a sheet of paper. Make sure that the entire item fits on the paper. Mark its starting edge with a pencil or pen. The paper needs to be light in color so that you can clearly see the marks being made."
    },
    {
      "title": "Place the measuring object at the starting edge.",
      "content": "Place the measuring object at the starting edge. Line up one edge of your measuring object with the starting edge of the item you are measuring. For example, if you are using the width of a pencil to estimate centimeters, place the pencil perpendicular to the item being measured, so that its eraser or unsharpened point lies flat against the edge being measured. One side of the pencil should be flush against the starting edge of the measured item."
    },
    {
      "title": "Mark the opposite edge of the measuring object.",
      "content": "Mark the opposite edge of the measuring object. Being careful not to move it, make a small mark against the inside edge of the measuring object with a pencil or pen."
    },
    {
      "title": "Shift the position of the measuring object.",
      "content": "Shift the position of the measuring object. Pick up the measuring object and re-position it so that its opposite edge now lies on the mark previously created. Make another mark on the inside edge of the measuring object. Make sure that the measuring object is flat against the side of the item being measured each time you shift its position. The item being measured must remain in the same position the entire time."
    },
    {
      "title": "Repeat this process.",
      "content": "Repeat this process. Keep marking the inside edge of the measuring object until you reach the end of the item being measured. Also make sure that the ending edge is marked."
    },
    {
      "title": "Count the gaps.",
      "content": "Count the gaps. When finished, lift away the measuring object and the item being measured. Count the number of gaps or spaces in between your marks. This number is a rough estimate of the number of centimeters your measured item equals. It is important that you count the gaps and not the lines/marks."
    },
    {
      "title": "Convert millimeters to centimeters.",
      "content": "Convert millimeters to centimeters. There are 10 millimeters in 1 centimeter. To convert millimeters to centimeters, you need to divide the number of millimeters by 10. [7] X Research source For example, to convert 583 millimeters to centimeters, you would calculate 583 10 = 58.3 {\\displaystyle {\\frac {583}{10}}=58.3} . So, 583 millimeters converts to 58.3 centimeters."
    },
    {
      "title": "Convert meters to centimeters.",
      "content": "Convert meters to centimeters. There are 100 centimeters in 1 meter. To convert meters to centimeters, multiply the number of meters by 100. [8] X Research source For example, to convert 5.1 meters to centimeters, you would calculate 5.1 × 100 = 510 {\\displaystyle 5.1\\times 100=510} So, 5.1 meters = 510 centimeters."
    },
    {
      "title": "Convert kilometers to centimeters.",
      "content": "Convert kilometers to centimeters. There are 100,000 centimeters in a kilometer. [9] X Research source To convert kilometers to centimeters, multiply the original measurement by 100,000. For example, to convert 2.78 kilometers to centimeters, you would calculate 2.78 × 100 , 000 = 278 , 000 {\\displaystyle 2.78\\times 100,000=278,000} . So, 2.78 kilometers is the same distance as 278,000 centimeters."
    },
    {
      "title": "Convert",
      "content": "Convert inches to centimeters. In 1 inch there are 2.54 centimeters. [10] X Research source To convert inches to centimeters, multiply the number of inches by 2.54. For example, to convert 9.41 inches to centimeters, you would calculate 9.41 × 2.54 = 23.9 {\\displaystyle 9.41\\times 2.54=23.9} . Thus, 9.41 inches is the same length as 23.9 centimeters."
    },
    {
      "title": "Convert feet to centimeters.",
      "content": "Convert feet to centimeters. In 1 foot there are 30.48 centimeters. So, to convert feet to centimeters, multiply the number of feet by 30.48. [11] X Research source For example, to convert 7.2 feet to centimeters, you would calculate 7.2 × 30.48 = 219.46 {\\displaystyle 7.2\\times 30.48=219.46} . So, 7.2 feet is equivalent to 219.46 centimeters."
    },
    {
      "title": "Convert yards to centimeters.",
      "content": "Convert yards to centimeters. A yard is 3 feet. Since there are 30.48 centimeters in 1 foot, the amount of centimeters in a yard is triple that: 91.44. To convert yards to centimeters, multiply the number of yards by 91.44. [12] X Research source For example, to convert 3.51 yards to centimeters, you would calculate 3.51 × 91.44 = 320.96 {\\displaystyle 3.51\\times 91.44=320.96} . So, 3.51 yards is the same length as 320.96 centimeters."
    }
  ]
}