{
  "url": "https://www.wikihow.com/Get-Rid-of-Dark-Circles-Under-Your-Eyes-Without-Makeup",
  "title": "How to Get Rid of Dark Circles Under Your Eyes Without Makeup",
  "steps": [
    {
      "title": "Use tea bags as eye compresses.",
      "content": "Use tea bags as eye compresses. The caffeine in tea can help reduce swelling and darkness under the eyes. After you’ve brewed some tea, remove the bags and squeeze out the excess water. Refrigerate the bags for 10 minutes, and then lay down with the bags over your eyes for at least 15 minutes. [1] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Chilling the bags ensures that they’re not too hot to place over your eyes. The cold temperature also helps reduce any swelling under the eyes when you use the bags as compresses. Be sure to use caffeinated tea bags."
    },
    {
      "title": "Apply caffeinated eye cream.",
      "content": "Apply caffeinated eye cream. If you aren’t a tea drinker, an eye cream that contains caffeine can have similar effects. The caffeine helps constrict the blood vessels to eliminate puffiness and discoloration. Dab a small amount of the cream under each eye and pat it in gently until it’s absorbed. [2] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source To improve the benefits of the eye cream, store it in your refrigerator. The cold temperature will further help reduce the swelling under your eyes that can cause dark circles."
    },
    {
      "title": "Press a cold spoon to your under your eye.",
      "content": "Press a cold spoon to your under your eye. If you don’t have teabags or caffeinated eye cream on hand, cold spoons can help get lessen the look of your dark circles. Dip two clean metal spoons in water, and then chill them in the freezer for at least 10 minutes. When they’re properly chilled, place the rounded side of the spoons against your eyes for 5 to 10 minutes. [3] X Research source If you plan to wear eye makeup, make sure to use the cold spoons before you apply your eye shadow, liner, and mascara."
    },
    {
      "title": "Take an antihistamine for allergies.",
      "content": "Take an antihistamine for allergies. If you have allergies, the histamines released by your immune system in response to your triggers may cause swelling and broken capillaries under the eyes that leave you with dark circles. Use an oral antihistamine to help limit your reaction and keep your under eyes bright. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Be sure to talk to your doctor or pharmacist before taking any over-the-counter pills to ensure that they won’t cause a reaction with any other medications that you’re taking. Itchy eyes are also common with allergies. Rubbing your eyes frequently can cause the pigmentation under your eyes to darken. An antihistamine can usually relieve the itchiness, but try to avoid rubbing your eyes in general. When your sinuses are congested, fluid can build up under your eyes that causes swelling and darkness. Using a neti pot to flush out your sinuses may help alleviate your dark circles. [5] X Research source"
    },
    {
      "title": "Wear sunscreen daily.",
      "content": "Wear sunscreen daily. The skin under your eyes is extremely thin, so it’s vulnerable to sun damage that can cause hyperpigmentation. To keep your under eyes bright, apply a broad-spectrum sunscreen with an SPF of 30 or higher all over your face, including your under eye area, every day as part of your skincare routine. [6] X Research source Avoid getting any of the sunscreen in your eyes. It can be extremely irritating. To avoid having the sunscreen run into your eyes, you may want to use a stick formula. Natural sunscreens that use minerals such as zinc oxide and titanium dioxide tend to be less irritating for the eyes."
    },
    {
      "title": "Use a retinol eye cream in the evening.",
      "content": "Use a retinol eye cream in the evening. You can help reduce discoloration and swelling under eyes by incorporating a retinol eye cream in your evening skincare routine. Retinol is a derivative of vitamin A that helps fade hyperpigmentation and smooth fine lines, so it’s an ideal ingredient in an eye cream. Dab a small amount of the cream under your eyes, and pat gently until it’s fully absorbed into the skin. [7] X Research source Retinoids make your skin more vulnerable to sun damage, which is why it’s important to use your retinol eye cream at night and wear sunscreen during the day. Retinol is a potent ingredient that can sometimes irritate the skin when you first begin using it. To avoid dry, flaky skin, you may want to start by using the eye cream every other night until your skin is used to it."
    },
    {
      "title": "Get a good night’s sleep.",
      "content": "Get a good night’s sleep. You may notice that your dark circles are more obvious on nights when you get little sleep. That’s because a lack of sleep usually makes your skin paler so the darkness under your eyes stands out more. Make an effort to get enough sleep every night to minimize the look of dark circles. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Adults typically need between 7 and 9 hours of sleep a night. Teenagers typically need between 8 and 10 hours of sleep a night."
    },
    {
      "title": "Avoid foods that can lead to puffiness.",
      "content": "Avoid foods that can lead to puffiness. Certain foods can cause puffiness and bloating that lead to dark circles under the eyes. It’s best to stay away from overly salty foods, alcohol, and carbonated drinks if you want to get rid of your dark circles. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Staying hydrated by drinking plenty of water can help reduce puffiness and bloating too. Aim for about 8 glasses of water a day. Certain foods also improve blood flow to the skin, which can help reduce dark circles. Try to incorporate foods that are rich in omega-3 fatty acids, such as walnuts, salmon, soybeans, and spinach, in your diet. [10] X Research source"
    },
    {
      "title": "Keep your head elevated while you sleep.",
      "content": "Keep your head elevated while you sleep. When you lie down at night, fluids can accumulate under your eyes and make the area appear darker. By elevating your head slightly as you sleep, you can keep those fluids from building up. Add an extra pillow to your bed to help prop up your head as you sleep. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use your ring finger to apply eye creams.",
      "content": "Use your ring finger to apply eye creams. When you apply eye cream or concealer under your eyes, you probably use your finger. But if you apply too much pressure, you’ll increase the amount of friction, which can cause your skin’s pigmentation to dark. Apply products under your eye with your ring finger because it’s the weakest of your fingers so it will be the most gentle. [12] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Using your ring finger can also help reduce fine lines and wrinkles under the eyes because you won’t be tugging on the skin as much."
    }
  ]
}