{
  "url": "https://www.wikihow.com/Chatgpt-PPT-Maker-Prompt",
  "title": "ChatGPT PPT Maker Prompt: 4 Customizable Inputs for Slides",
  "steps": [
    {
      "title": "Start a new conversation in ChatGPT.",
      "content": "Start a new conversation in ChatGPT . You can use the desktop website at https://chat.openai.com/ or the mobile app for iOS and Android. If you aren't already logged in, enter your account information to do so now. Use this method to create the information and data for a presentation in text only. This does not include any design elements."
    },
    {
      "title": "Create the outline for the slides.",
      "content": "Create the outline for the slides. Before ChatGPT can create a complete PPT presentation, it needs to start with an outline. Make sure the prompt is clear and concise. Use the following prompt or a variation of the prompt: Write an outline for a PowerPoint presentation about the following topics: [topic 1], [topic 2], [topic 3]... It must be [#] slides. ChatGPT will generate a presentation outline with the above parameters. If you approve of the topics and order, proceed. Otherwise, generate the prompt again."
    },
    {
      "title": "Expand the outline topics.",
      "content": "Expand the outline topics. Once the outline is created, you can ask ChatGPT to generate more content for each individual slide. Use the following prompt or variation of the prompt: Expand on the topics in the outline you provided. Tell me more about the important facts and key takeaways from the topics. Include supporting examples and extra details that will help the audience better understand the topic. ChatGPT will generate more details on each topic, separated by slide. If you approve of the added content, proceed. Otherwise, generate the prompt again."
    },
    {
      "title": "Reformat the slide information.",
      "content": "Reformat the slide information. If you don't want paragraphs of text in your PowerPoint or Google Slides presentation, you can ask ChatGPT to change the format of the information. You can also ask to add more information. Use the following prompt: Reformat the previous information into bullet points. Add more detail."
    },
    {
      "title": "Transfer the data.",
      "content": "Transfer the data. Open Microsoft PowerPoint or Google Slides. You'll need to copy and paste the text data into your new presentation. Use PowerPoint or Google Slides to add design elements, such as color, images, videos, graphs, and more."
    },
    {
      "title": "Start a new conversation in ChatGPT.",
      "content": "Start a new conversation in ChatGPT. You can use the desktop website at https://chat.openai.com/ or the mobile app for iOS and Android. Use this method to generate codes that can be inputted in PowerPoint. You'll need to enable the Developer tab in PowerPoint to use these codes. Keep in mind that a full PowerPoint presentation in VBA code may be too long for ChatGPT to generate, so you may only receive snippets for a general template you can modify."
    },
    {
      "title": "Enter the prompt.",
      "content": "Enter the prompt. Use the following prompt or a variation of the prompt: Write me the VBA code to create a PowerPoint presentation for [topic]. It must be [#] slides. Write me the VBA code to create a PowerPoint slide for [smaller topic]."
    },
    {
      "title": "Copy",
      "content": "Copy the code. ChatGPT will generate a block of code that can be entered in PowerPoint."
    },
    {
      "title": "Open the Visual Basic Editor.",
      "content": "Open the Visual Basic Editor. You must have Developer mode enabled on PowerPoint to see this option. On Windows, click the Developer tab and click View Basics . On Mac, click Tools → Macro → Visual Basic Editor . If you don't have Developer mode enabled, go to Files → Options → Customize Ribbon → Main Tabs → check the box for Developer ."
    },
    {
      "title": "Paste the code in the editor.",
      "content": "Paste the code in the editor. Click Insert Module and input ChatGPT's provided code."
    },
    {
      "title": "Click the \"Play\" button.",
      "content": "Click the \"Play\" button. This is in the top toolbar. PowerPoint will create a presentation based on the code. It will be text-based, so you'll need to add design elements to spruce it up."
    },
    {
      "title": "Use PowerPoint Designer (optional).",
      "content": "Use PowerPoint Designer (optional). PowerPoint Designer automatically generates slide layouts using your existing text. This is available only for Microsoft 365 subscribers. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Click Design at the top. Click Designer on the ribbon. Scroll through the right panel to view generated designs. Click a design to select it."
    },
    {
      "title": "Download AIPRM for ChatGPT on Google Chrome.",
      "content": "Download AIPRM for ChatGPT on Google Chrome. This extension adds a list of curated prompt templates to ChatGPT, saving you brainstorming time. To add an extension , do the following: Visit the AIPRM download page . Click Add to Chrome at the top. Click Add extension to confirm."
    },
    {
      "title": "Go to https://chat.openai.com/.",
      "content": "Go to https://chat.openai.com/ . If you aren't logged in, enter your account information to do so now. With the extension downloaded, ChatGPT's interface will look a bit different."
    },
    {
      "title": "Type powerpoint into the search bar.",
      "content": "Type powerpoint into the search bar. This will pull up all PowerPoint-related prompts in AIPRM."
    },
    {
      "title": "Generate the provided prompt.",
      "content": "Generate the provided prompt. Use AIPRM's provided prompt and edit it to fit your specific needs. You'll see the output similar to method two , and you'll still need to paste it into the Visual Basic Editor to create a presentation."
    },
    {
      "title": "Sign up for a text-to-art generator tool.",
      "content": "Sign up for a text-to-art generator tool. This can be Midjourney, Dall-E, Stable Diffusion, or another generator. ChatGPT can only provide text-based information. If you need image suggestions, you'll need to combine ChatGPT with another tool."
    },
    {
      "title": "Create your slide text.",
      "content": "Create your slide text. Use any of the previous methods to generate the text for your slides. You'll need this to generate the image suggestions on the text-to-art generator tool. You can also ask ChatGPT to include the prompt for your text-to-art generator tool. Add the following prompt: Make sure to provide the [Midjourney] prompts for the suggested images."
    },
    {
      "title": "Open the text-to-art generator tool.",
      "content": "Open the text-to-art generator tool. Some tools require a valid email address for sign-up while others are free-to-use."
    },
    {
      "title": "Input ChatGPT's text.",
      "content": "Input ChatGPT's text. Use ChatGPT's generated text to prompt the text-to-art generator tool. This process will differ based on the tool."
    },
    {
      "title": "Combine the text and photo.",
      "content": "Combine the text and photo. In the PowerPoint presentation, copy and paste both ChatGPT's slide text and the generated art. If needed, use the built-in tools to adjust the color, placement, crop, or another element."
    }
  ]
}