{
  "url": "https://www.wikihow.com/Burn-Fat-by-Running",
  "title": "How to Burn Fat by Running",
  "steps": [
    {
      "title": "Develop a running plan.",
      "content": "Develop a running plan. No matter if you’re a beginner or experienced runner, if you want to burn fat by running it’s a good idea to have a plan how you’ll accomplish the goal. It doesn’t matter if you run fast or slow, just that you are running. You will likely get faster the longer you stick to your program. [2] X Research source Write out a weekly plan for yourself. For example, you could write, “Monday: run 2 miles; Tuesday: run ½ hour; Wednesday: run 1.5 miles; Thursday: run ½ hour; Friday: rest day; Saturday: run 3 miles; Sunday: rest day.” Stick to a flat running surface to start. Start slowly. Try to gradually build up to half an hour of running by adding three to five minutes to your runs each week. Even if you can only run for a few minutes to start, that’s better than nothing. Set out to run ½ hour five to six days a week and add three to five minutes of running every week until you reach your goal time. You can also set a specific mileage to start, such as two or three miles, or even a mixture of time and distance. Mix shorter distances and times with one long run and a day or two of rest every week. Or, another option is to increase the intensity of your runs, such as by trying to run faster or incorporating a hill or two into your route. Do your runs any place you feel comfortable. It could be on the road, trails, or even a treadmill. No matter what surface you choose, you’ll get the benefits of burning fat and calories."
    },
    {
      "title": "Warm up before runs.",
      "content": "Warm up before runs. Starting out a run too quickly is a recipe for injury or getting yourself into a pace that is too fast or you can’t sustain. Gradually easing into your run with a gentle warm up can prevent injury and help you run longer. [3] X Research source Do an easy walk for three to five minutes, which loosens your muscles, tendons and joints and prepares them to run. Afterward, jog easily for another three to five minutes before starting to run your usual pace."
    },
    {
      "title": "Go the distance.",
      "content": "Go the distance. Once you’ve started your run, stick to your plan of running a specific time or distance. A good rule of thumb to get you through any run is, “you can always run too fast, but you can never run too slow.” Keeping this in mind can help you stay at your pace and focus on getting done. Take walk breaks if necessary. There is nothing wrong with being too tired or winded, especially if you are just starting out. In fact, walking for a minute or even five in between may help you run for a longer time or distance. Keep in mind that a big part of running is your mentality. Breaking longer runs down into manageable sections or playing games with your mind to go the distance can help you get through any run. [4] X Research source For example, say to yourself, “just make it to the next electric pole and if you feel miserable, take a walk break. If your legs are good, run to the next pole.”"
    },
    {
      "title": "Maintain a steady pace.",
      "content": "Maintain a steady pace. You’re most likely to burn fat when you run slowly at a steady pace. You can always add elements such as intervals or hills to boost fat burning, but keeping it slow during most of your runs will help you burn fat over time and keep it off. [5] X Research source Figure out your steady pace by running a mile hard. This is your “race pace.” Train at a pace two to three minutes slower than this. If you want to run faster, you’ll also need to train faster. [6] X Research source Remember that the longer you run, the slower you should go. A good rule of thumb is that you should be able to carry a comfortable conversation while running. This will help you get into the fat burning zone."
    },
    {
      "title": "Keep yourself hydrated.",
      "content": "Keep yourself hydrated. Having enough water to drink is an important part of staying healthy, but it can also boost your ability to run for longer. This is especially true in hot weather. Taking some water with you on a run can keep you hydrated and may help you go the distance. [7] X Research source Make sure to drink 8 to 16 ounces of water one or two hours before your run. If you’re running for an hour or less, drink 3 to 6 ounces every 15 to 20 minutes. For someone running one to four hours, drink 3 to 6 ounces every 15 to 20 minutes. Keep in mind that water is enough to keep you hydrated, but you can mix water and a sports drink to replenish any sodium or electrolytes you lose. This is an especially effective tactic if you’re running longer than one hour. Try to get a sports drink that isn’t loaded with sugar, which can upset the delicate balance in your system. Have 8 to 24 ounces post-run to replace fluids."
    },
    {
      "title": "Cool down.",
      "content": "Cool down. Just as a warm up and quality run are important to keeping yourself healthy while burning fat, so is a good cool down. This can help shift your blood flow to resting patterns, prevent dizziness, and help your muscles recover. [8] X Research source Slow down your run towards the end, aiming to get about five to 10 minutes of slow running or jogging. Then switch to a three to five minute brisk and gentle walk. Consider adding elements such as a cold water bath, foam rolling, or stretching and yoga moves to help your body further recover. These are especially useful if you are doing longer or harder effort runs."
    },
    {
      "title": "Stick to your plan, but listen to your body.",
      "content": "Stick to your plan, but listen to your body. It’s important to finish your runs and get in the number of runs you set every week. The frequency and intensity with which you run will help you burn fat. [9] X Research source However, if you’re sick or feeling worn out, consider a shorter run or even giving yourself a rest day. From here adjust your running schedule so that you can stick to your plan and continue burning fat. [10] X Research source Keep in mind that not listening to your body can lead to injuries, especially if you’re experiencing pain. Just giving yourself a couple of days of rest can be the difference between continuing your training or needing to see a doctor. Consider doing easy cross-training on days you’re feeling sluggish or sick. Swimming, biking, rowing, or using the elliptical can keep your endurance level and fat burning potential at their peak. [11] X Research source"
    },
    {
      "title": "Be patient.",
      "content": "Be patient. Remember that sensible and healthy weight loss and fat burning takes time. In addition, no one became a marathon runner overnight. Sticking to your plan and being patient with results can keep you from getting discouraged if you don’t see the fat coming off in two weeks. As long as you’re comfortable and making even small progress at your runs, you’re doing exactly what you need to burn fat. [12] X Research source"
    },
    {
      "title": "Add intervals.",
      "content": "Add intervals. Adding just a few high intensity intervals to your runs every week can help boost your fat burning potential. You can dedicate one workout every week to doing high intensity intervals or add some intervals at the end of your runs two to three days a week. In addition, intervals can help you get faster over time. Schedule one speed workout every week on a day that is not close to your long run. For example, you could do a speed workout on a Wednesday or Thursday if your long run is Saturday. For this, do your normal workout and then run between four to eight 400 meters, or one loop of a track, intervals at your race pace. Add five to 10 minutes of intervals at the end of your runs two or three days a week. Run or jog at your normal pace for 60 seconds and then up your intensity for 30 seconds. You could also do shuttle runs as a part of your interval training."
    },
    {
      "title": "Hit the hills.",
      "content": "Hit the hills. Running hills can boost your calorie burning potential by up to 50%. It not only can help you burn more fat and get stronger, but also increase your endurance. Add some hills to one or two workouts per week to help yourself burn more fat. Consider doing one hill workout every week for increased fat burning benefit. You can also do hill intervals or repeats at the end of a workout or two each week. You may need to play with hill workouts a bit before figuring out which works best for you. Set the treadmill at a 5% incline if you’re at the gym or live someplace flat. You can reset in between intervals if you want."
    },
    {
      "title": "Step up your run.",
      "content": "Step up your run. Similar to hills, running stairs can blast calories and fat. In fact, it’s one of the best fat burning and overall conditioning exercises you can do. Choose to either run physical stairs—such as at a stadium—or use a stair machine at your gym. Add this to any running workout or replace one run a week with a stair run. Run up the stairs at a fast pace and then down them at slow jog or trot to recover. If you’re using a stair machine, try running up the stairs at a hard pace for a minute and then giving yourself a minute of easy stair running. Be careful when running stairs to ensure that you don’t fall and hurt yourself."
    },
    {
      "title": "Tackle an obstacle course.",
      "content": "Tackle an obstacle course. Some people may find running alone a bit tedious. If this is the case, consider adding some obstacles to your daily run. This can help to keep your heart rate high while you work at building smaller muscles groups. [13] X Research source Obstacle courses require short bursts of explosive power for jumping and lots of coordination, so be sure to do them only when you are fresh and rested, such as after your warmup. Use natural obstacles if you are running outside. Trails are especially great—you can jump over creeks and logs and swivel around boulders. See if there are any obstacle courses available to the public in your local area. Some features that might appeal to runners are: a cargo net to climb, a rope climb up a nearly vertical wall, leaping through tires, running through a concrete tunnel, a mud pit through which you have to crawl. Build your own obstacle course at home to do at the beginning of your run. Incorporate items you have around the house such as garbage cans over which to jump, small cones around which you can run, and ladders you can climb."
    },
    {
      "title": "Run on an empty stomach.",
      "content": "Run on an empty stomach. If you feel able, go for a slow, pre-breakfast run. Doing your run on an empty stomach can boost your fat burning potential. Make sure to take a banana or something small on your run in case you get lightheaded. Over time, you may notice that your body gets used to running without breakfast, which draws on your body’s fat stores—and not carbohydrates—for fuel. Have a normal, healthy breakfast of whole foods and water within 15 to 30 minutes of finishing your run. This can help stabilize blood sugar levels and promote recovery. For example, you could have a bowl of steel cut oatmeal with fresh fruit, some Greek yogurt, a glass of water, and a cup of coffee with skim milk. [14] X Research source"
    },
    {
      "title": "Do a little strength training.",
      "content": "Do a little strength training. Adding even a simple strength training routine to your weekly runs can boost your fat burning potential. Resistance exercises build your overall strength, and they can also help to increase your running speed. Doing two to three strength training sessions per week in addition to your runs may increase your strength by 50%. In turn, more muscle will help you more effectively burn fat. [15] X Expert Source Shira Tsvi Personal Trainer & Fitness Instructor Expert Interview. 7 January 2020. Try two sets of 15 reps of the following moves to build strength: Squats. Lunges. Leg extension. Leg curls. Pull ups. Push ups. Bicep curls. Tricep extensions. Chest press. One arm row. Flyes. Planks. (Hold this exercise for 30 to 60 seconds and repeat two or three times.)"
    }
  ]
}