{
  "url": "https://www.wikihow.com/Connect-Switch-to-TV-Without-Dock",
  "title": "Connecting a Switch to a TV Without a Dock: How-to (with pictures)",
  "steps": [
    {
      "title": "Purchase a USB-C to HDMI adapter.",
      "content": "Purchase a USB-C to HDMI adapter. Not every HDMI adapter is suitable for your Switch. The two most reliable adapters are the RREAKA USB Type C to HDMI Digital AV Multiport Hub and the Switch HDMI Adapter Hub Dock. [1] X Research source This adapter must have a USB-C power input, HDMI output, and USB-C connector to attach to the Switch. With a USB-C power input, you can connect your Switch to a charger you don't drain your battery while docked!"
    },
    {
      "title": "Connect the USB-C and HDMI cables to the ports on your adapter.",
      "content": "Connect the USB-C and HDMI cables to the ports on your adapter. You can either use the original cables that are attached to your Dock, or you can purchase new ones. [2] X Research source Fortunately, USB-C and HDMI cables run pretty cheap and are available at almost any retailer."
    },
    {
      "title": "Connect the adapter's USB-C cable to your Switch.",
      "content": "Connect the adapter's USB-C cable to your Switch. That should be the USB-C cable that came with the adapter. [3] X Research source"
    },
    {
      "title": "Connect the HDMI cable to your TV.",
      "content": "Connect the HDMI cable to your TV. This cable is on the other end of the adapter. [4] X Research source"
    },
    {
      "title": "Prop your Switch up so it's not lying flat.",
      "content": "Prop your Switch up so it's not lying flat. Letting it lie flat will block the air vents that prevent it from overheating. You could use a book to prop your Switch up from the desk. The air vents are on the bottom, so you can even hang it off the side of a table."
    },
    {
      "title": "Turn on your TV and Switch.",
      "content": "Turn on your TV and Switch. You'll need to select the appropriate HDMI input to see your Switch on the screen . [5] X Research source Your Switch should charge while it's connected like this! If your adapter has a USB 2 or 3 port, you might be able to plug in a controller ."
    },
    {
      "title": "There are a few requirements that HDMI adapters need to meet.",
      "content": "There are a few requirements that HDMI adapters need to meet. They include: [6] X Research source USB-C power input HDMI output USB-C output"
    },
    {
      "title": "What these features mean:",
      "content": "What these features mean: that your Switch will charge while you play it, so you don't have to worry about a low battery warning in the middle of a boss fight."
    },
    {
      "title": "You have only one option:",
      "content": "You have only one option: Genki ShadowCast , which is a crowdfunded campaign. There aren't any ways that you can stream wirelessly from your Switch to your TV, and this is the closest you can get even though you still need to purchase the components. [7] X Research source Yes, you can use AirPlay on iPhone , or cast with Chromecast , but none of these features are built-in on the Switch so you need to purchase the items in the crowd-funded campaign to stream without wires."
    }
  ]
}