{
  "url": "https://www.wikihow.com/Run-a-USSD-Code",
  "title": "How to Run a USSD Code",
  "steps": [
    {
      "title": "Open the phone app.",
      "content": "Open the phone app. This app can be found on your home screen, on the \"All Apps\" screen, or, on simpler cell phones, on the lock screen."
    },
    {
      "title": "Dial the USSD code.",
      "content": "Dial the USSD code. Some start with *, others #, and others *#."
    },
    {
      "title": "Dial #.",
      "content": "Dial #. Make the phone call. When the code is running, you will see \"Please wait...\" (iPhone) or USSD code running... (Android) or something similar on the phone screen. If the code is invalid, you will get an error."
    },
    {
      "title": "Check your IMEI.",
      "content": "Check your IMEI . The most common reason why USSD codes are useful is because you can check crucial information about your phone. To check your IMEI, dial *#06# and the IMEI will automatically pop up on your screen."
    },
    {
      "title": "Change your SIM PIN.",
      "content": "Change your SIM PIN. Dial **04* followed by the old PIN, then *, followed by the new PIN, then *, followed by the new PIN again, then #. For example, to change the PIN from 1234 to 4321, dial **04*1234*4321*4321#."
    },
    {
      "title": "Check information about your carrier, such as how much data you have left.",
      "content": "Check information about your carrier, such as how much data you have left. This code will vary from carrier to carrier. On AT&T, the code for checking how much data you have left is *3282# (*DATA#)."
    },
    {
      "title": "Enter field test mode on iPhone.",
      "content": "Enter field test mode on iPhone. To do that, dial *3001#12345#* and call the number. Here, you can view information about your SIM card and your phone."
    },
    {
      "title": "Learn about other USSD codes.",
      "content": "Learn about other USSD codes. Read the Wikipedia article on it, as well as conduct research on your carrier's website fo USSD codes that pertain specifically to it."
    }
  ]
}