{
  "url": "https://www.wikihow.com/Instagram-Story-Dimensions",
  "title": "Instagram Story Size: Everything You Need to Know",
  "steps": [
    {
      "title": "Instagram Stories are 1080 (width) x 1920 (height).",
      "content": "Instagram Stories are 1080 (width) x 1920 (height). This 9:16 ratio means you need a vertical video (a video that is taller than it is wide) to take up the entire screen. If you record a video with your phone, it will usually be 1080 x 1920 by default. People usually watch Stories on their phones in portrait orientation, so keep that in mind when uploading your Story. If your Story is not 1080px by 1920px, Instagram will zoom or crop it, which will either make it blurry or cut off important parts of your visuals. Keep at least 250px at the top and 340px at the bottom free of text or other important elements since the caption, audio information, and your profile picture most likely block this area. Video files can be a maximum size of 30MB and must be in the MP4 or MOV format. Photos should be in the .jpg or .png format for best results. [1] X Research source"
    },
    {
      "title": "Capture high-resolution photos and video.",
      "content": "Capture high-resolution photos and video. Since Instagram compresses images and videos as you upload them, poor-quality photos and videos will look worse in Stories than on your device. To compensate for compression, start with a high-quality resolution. For example, make sure your photos are at least 72ppi resolution before you add them to your Story."
    },
    {
      "title": "Use the right shape, size, and aspect ratio for your Story.",
      "content": "Use the right shape, size, and aspect ratio for your Story. Instagram will zoom into images that are too small or have an incorrect aspect ratio. If they're too large, it will crop them to force them to fit into a 9:16 aspect ratio. This can cut off important parts of your photo or video. Avoid uploading the wrong size photos using photo-editing apps to resize your images , like Preview on Mac , Photoshop , or Paint on Windows . If you're using your phone, apps like Canva will help you resize your image for Instagram."
    },
    {
      "title": "Upload in Portrait Orientation.",
      "content": "Upload in Portrait Orientation. A vertical video is the most common video orientation on Instagram Stories. If your video isn't suitable for vertical viewing, consider uploading it as a normal post instead."
    },
    {
      "title": "Don't post lots of long Stories.",
      "content": "Don't post lots of long Stories. Your viewers will get bored quickly if all your Stories are 1-minute long , so add some variety by uploading shorter Stories. You don't want the person watching your video to swipe away!"
    },
    {
      "title": "Add polls to your Stories.",
      "content": "Add polls to your Stories. People love to interact with the content they consume, so add a poll to boost engagement! You can also use the poll answers as free market research to gauge your audience's likes and dislikes. [2] X Research source"
    },
    {
      "title": "Offer sneak peeks or behind-the-scenes footage.",
      "content": "Offer sneak peeks or behind-the-scenes footage. Teasers like this are a great way to create engaging content to get more buzz for your business or organization. Check out Instagram Story Game Ideas: Have Fun with Your Followers for more tips on engaging followers!"
    }
  ]
}