{
  "url": "https://www.wikihow.com/Change-Level-on-Character-Sheet",
  "title": "How to Level Up D&D Characters (D&D Beyond, Roll20 & More)",
  "steps": [
    {
      "title": "Click “Manage” then “Manage Character & Levels”.",
      "content": "Click “Manage” then “Manage Character & Levels”. If you’re using D&D Beyond to keep track of your character, changing your character’s level on their character sheet is a simple process! Once you click “Manage” next to their name near the top of the character sheet screen, a sidebar will pop up. Click the “Manage Character & Levels” option; from there, you’ll be taken to the Character Builder. [1] X Research source"
    },
    {
      "title": "Select your character’s new level.",
      "content": "Select your character’s new level. In the Character Builder, click on the number next to the “Level” label on the right side of the page and increase your character’s level by 1 (or to whichever level your DM tells you). For example, if your character increases from level 6 to 7, you’ll see a 6 next to the bold “Level” label. Click on the 6 and select 7 instead, thus setting your character to their new level. [2] X Research source Once your new level is selected, D&D Beyond will continue walking you through the leveling-up process. It automatically calculates your character’s hit points and proficiency bonus and prompts you to choose any feats or ability options that become available. Scroll down the page to see your character’s level progression. If there’s a choice you need to make to finalize the leveling-up process, you’ll see a blue exclamation point over the corresponding skill or ability. From there, simply navigate back to your character sheet. With all choices made, the new level should reflect on the sheet!"
    },
    {
      "title": "Click on the “Journal” tab then your character's name to level up manually.",
      "content": "Click on the “Journal” tab then your character's name to level up manually. While playing a D&D campaign in Roll20 , navigate to the sidebar on the right side of the computer screen. Select the “Journal” tab (which is the 3rd tab) and then select your character’s name from the list that drops. From there, you’ll see their existing character sheet, which you can change to reflect their new level. [3] X Research source Alternatively, click on your character’s thumbnail photo on the battle map and select the “Settings” icon (which looks like a small gear). Then, click “Open Character Sheet” to view and edit their character sheet."
    },
    {
      "title": "Launch the Charactermancer to update your level with Roll20’s engine.",
      "content": "Launch the Charactermancer to update your level with Roll20’s engine. If you’d rather not manually enter all the new level information, Roll20 has a program for that! On your PC’s character sheet, click on the small gear symbol (located next to the “Spells” tab on the far right). Then, scroll down to the bottom of the character sheet and click the icon next to “Launch Level+ Charactermancer.” This will bring you to Roll20’s Charactermancer program, which will guide you through the leveling-up process and calculate hit points for you. [4] X Research source The Charactermancer will automatically show you the class features and abilities you’ve unlocked at the new level. If you’re playing spellcasting class, the Charactermancer will also show you which new spells you can choose from and prompt you to select them. When you’re done, click “Apply Changes” to close the Charactermancer and show the updated level on your character sheet."
    },
    {
      "title": "Navigate to “Class Levels” in the top section of the Features tab.",
      "content": "Navigate to “Class Levels” in the top section of the Features tab. First, open your character sheet in Foundry VTT (which you can find by clicking your character’s name in the righthand sidebar on the list of creatures currently on the battle map). Then, click on the “Features” tab, right-click the class you want to level up in, select “Edit,” and manually type in your character’s new level. Finally, hit “Enter” on your keyboard to apply the new level to your character sheet! [5] X Research source For example, if your PC is currently level 4 and needs to level up, then simply change the number 4 to 5 in the “Edit” window. Once you’ve entered the new level, remember to drag and drop any new feats or abilities into the “Feats” tab on your character sheet. Leveling up in Foundry will automatically update your character’s hit points and proficiency bonus!"
    },
    {
      "title": "Have your DM decide whether to use XP or Milestone leveling.",
      "content": "Have your DM decide whether to use XP or Milestone leveling. Before your character (PC) can level up, your Dungeon Master (DM) must decide which leveling system to use. XP (Experience Point) leveling means awarding players XP whenever they defeat creatures in battle, as each creature has a specific XP value. Milestone leveling means the DM awards XP based on achieving an important goal or reaching a key destination in the campaign (rather than combat victories). [6] X Research source Another form of leveling up, sometimes confused with Milestone, is called “Advancement without XP.” This means the DM is entirely in charge of choosing when players level up and informing them. Advancement without XP can be based on any value the DM deems suitable, whether it’s completing important milestones or points in the campaign narrative or defeating powerful enemies. If you do use some form of XP leveling, check the 5e Basic Rules to see how much XP you’ll need in order to level up. Level 2 requires 300 XP, level 3 requires 900 XP, level 4 requires 2,700 XP, and so on. To reach level 20, you’ll need a whopping 355,000 XP!"
    },
    {
      "title": "Choose a class to gain a new level in.",
      "content": "Choose a class to gain a new level in. Typically, this means selecting another level of whatever your PC’s current class is—but you can also decide to multiclass and choose a second class for your character to gain a level in. Classes essentially determine your PC’s function and skillset; classes in 5e include wizard, druid, cleric, fighter, rogue, and barbarian. Check the 5e Player’s Handbook to see whether you get any new class abilities when your PC levels up. [7] X Research source Not all players choose to multiclass their characters, and it’s completely up to you whether you want a character who only has 1 class or eventually branches out into others. For example, you might start a D&D campaign as a level 1 sorcerer and go all the way to the end of that campaign as a level 20 sorcerer. Alternatively, you might decide to multiclass into the bard class and end the campaign as a level 12 sorcerer and level 8 bard. Remember, you’ll have to make these decisions (and change your character’s sheet to reflect their new level) regardless of whether you use an online platform or play D&D the old-fashioned way with a pencil and paper!"
    },
    {
      "title": "Calculate your character’s new hit point total.",
      "content": "Calculate your character’s new hit point total. Hit points determine the amount of damage your PC can absorb in combat—and their hit point (HP) total increases with every new level. To do this, find how many hit points your PC will gain as they level up by rolling a Hit Die and adding the result to your PC’s Constitution modifier. Then, add that total to your PC’s current hit point total (written on their character sheet). [8] X Research source Say your PC is a wizard with 42 hit points, a d6 Hit Die, and a Constitution modifier of +2. To calculate how many hit points your wizard will gain when they level up, roll a d6 and add +2. For example: say you roll a 4 on your d6 Hit Die. Since the formula is 1 Hit Die + CON modifier, you’d simply add 4 + 2, meaning your wizard gains 6 hit points. Then, take that 6 HP and add it to your wizard’s hit point total (which is 42). Since 6 + 42 equals 48, that means your wizard PC now has 48 hit points. Hit Die are dice that determine how many hit points your PC gains when they level up. Every class has a specific Hit Die; for example, barbarians roll a d12 (12-sided dice) for Hit Die rolls, while wizards roll a d6 (6-sided dice). Check the Basic Rules if you’re unsure what dice to roll! Your PC’s Constitution (CON) modifier is a value based on their Constitution ability score (which measures their health and vitality). You can find it next to their CON score on the character sheet."
    },
    {
      "title": "Select a feat or ability score improvement (if applicable).",
      "content": "Select a feat or ability score improvement (if applicable). When leveling up, PCs periodically get either a new feat (an additional skill or perk) or an ability score improvement (meaning you can increase up to 2 of their ability scores). Keep in mind that this doesn’t happen every time you level up; most classes get feats or ability score improvements at levels 4, 8, 12, 16, and 19, although some classes (like rogues and fighters) have a different progression. Either way, make a note on your character sheet when you gain a new feat or your ability scores change. [9] X Research source If you choose the ability score increase, you can choose to either increase one ability score by 2 or increase 2 ability scores by 1. Increasing ability scores also improves your PC’s bonus for any corresponding skills. For example, Persuasion is affected by the Charisma ability score—so if your PC’s Charisma increased, their Persuasion bonus would as well. Remember: you can’t increase any ability score over 20 while leveling up. If you’re using an online program like D&D Beyond, it’ll tell you if your character is eligible for a feat or ability score upgrade."
    },
    {
      "title": "Increase your character’s proficiency bonus (if applicable).",
      "content": "Increase your character’s proficiency bonus (if applicable). When your PC is “proficient” in a certain skill, tool, weapon, or item, you can add their proficiency bonus to associated skill checks and rolls. The starting proficiency bonus for all PCs at level 1 is +2, and it continues to increase periodically—so make a note on your character sheet each time your PC’s proficiency bonus changes! [10] X Research source From levels 1 through 20, PC proficiency bonus values are: Levels 1 - 4: +2 Levels 5 - 8: +3 Levels 9 - 12: +4 Levels 13 - 16: +5 Levels 17 - 20: +6"
    },
    {
      "title": "Choose new spells or class feature options as they become available.",
      "content": "Choose new spells or class feature options as they become available. Most of the time, leveling up means gaining access to more powerful spells or class abilities as well—but the specific abilities you get are entirely dependent on your PC’s class and subclass. Check the Basic Rules or Player’s Handbook if you need to know which new skills your PC is getting access to, and be sure to write them down on your character sheet! [11] X Research source Not all PCs get access to spells—but if your PC has a spellcasting class (like wizard, sorcerer, bard, druid, cleric, or warlock), odds are they’ll get additional spell slots when they level up. Class features are additional abilities related to your character’s class that automatically unlock when they reach a high enough level. For example, at level 2, fighters automatically unlock the Action Surge ability, which lets them take 1 extra action in combat per short or long rest."
    },
    {
      "title": "Write down your PC’s new level if you have a paper character sheet.",
      "content": "Write down your PC’s new level if you have a paper character sheet. Now that you’ve picked a class, calculated hit points, and chosen any additional feats, spells, or ability score bonuses for your PC, simply make a note of those changes on their character sheet. It’s a good idea to keep track of your PC’s sheet with a pencil—that way, you can simply erase the old information when they level up (like their previous level and hit point total) and write the new values in. If you’re using an online character sheet, remember that most digital platforms automatically update the character sheet after you change your PC’s level to reflect their new hit point total, proficiency bonus, and class skills. Therefore, all you have to do is update their level, choose the class, and, if applicable, pick new feats!"
    }
  ]
}