{
  "url": "https://www.wikihow.com/Draft-a-Contract-Clause-Dealing-With-Delay-in-Performance",
  "title": "How to Draft a Contract Clause Dealing With Delay in Performance",
  "steps": [
    {
      "title": "Specify deadlines for performance of all stages of the agreement.",
      "content": "Specify deadlines for performance of all stages of the agreement. Many courts won’t award damages for delay if your contract doesn’t have a specified end date, or particular deadlines for each phase of the project. [1] X Research source In the absence of specific dates of completion, contract law requires work to be completed in a reasonable amount of time. However, what is considered “reasonable” could vary widely from person to person. For each deadline, you should detail exactly what you expect to be finished by that date. For example, suppose you’re building your dream home and have hired a contractor. His first deadline is to clear and grade the lot and pour the foundation. He must be finished by May 30 because the materials for the framing of the house are being delivered June 1. Sometimes it is not necessary for a phase to be completely finished before another begins, but it needs to be mostly completed. If this is the case, make sure you define exactly what constitutes substantial completion for the purposes of your contract. [2] X Research source For example, your contractor needs to have the plumbing and electricity completed before the interior doors and trim are installed. However, he doesn’t have to be 100 percent finished because he can finish up his work on the first floor while the doors and trim are installed on the second floor. When you have a project with multiple phases, the most important thing is to make sure that later phases aren’t pushed back because an early phase takes too long to complete. You might also consider including a sentence requiring the contractor use specific scheduling methods to track his progress and ensure the deadlines of all phases are met, or to provide weekly or monthly status reports. [3] X Research source"
    },
    {
      "title": "State that delays at any stage constitute a material breach of the contract.",
      "content": "State that delays at any stage constitute a material breach of the contract. A material breach goes to the very core of the contract, meaning if the schedule isn't met the contract might as well not even exist. This sort of clause typically is called a \"time is of the essence\" clause. By saying time is of the essence, you’re saying that the deadlines and schedules included in the contract are of absolute importance to its existence. Absent any other clause regarding a delay in performance, if you include a provision that time is of the essence, the contractor will be liable for all damages resulting from a delay, even if the delay was not his fault."
    },
    {
      "title": "Define what sorts of delays are included under the clause.",
      "content": "Define what sorts of delays are included under the clause. Generally speaking, you don’t want to include delays that are caused by third parties, by events outside the control of either the owner or the contractor, or delays that happen because the owner changes his mind regarding something like a schedule of events or a type of material. A “time is of the essence” provision typically states that all delays are included unless excluded elsewhere in the contract. This way you can draft other clauses to deal more specifically with various types of delays that may come up over the course of the contract. \"Time is of the essence\" clauses don't have to be complex. For example, your clause might simply say: \"Time is of the essence with respect to all provisions within this Agreement. Any delay in performance by either party shall constitute a material breach of this Agreement.\""
    },
    {
      "title": "Decide whose performance falls under the clause.",
      "content": "Decide whose performance falls under the clause. A “time is of the essence” clause can apply solely to the contractor, or can apply to the owner’s responsibility to provide the contractor with timely payments and materials as well."
    },
    {
      "title": "Require as much advance notice as possible in the event of a delay.",
      "content": "Require as much advance notice as possible in the event of a delay. All parties should be required to notify each other if even an excusable delay occurs. How much notice should be provided may depend on the reason for the delay or the length of the delay. For example, if the contractor learns key building materials have been back-ordered and won't be delivered for three weeks, he should alert the owner as soon as he finds that out rather than waiting to see what happens. The owner may want to pull the order or find a different supplier, and he needs as much time as possible to pursue alternatives. On the other hand, if severe thunderstorms mean the contractor has to suspend work for an afternoon but plans to return the next morning, a phone call to the owner as he sends the workers home is probably sufficient. Contractors may forfeit any damages or right to ask for an extension of time under the contract if they fail to give the owner proper notice. If the owner’s actions have caused the delay, a court may refuse to award the contractor damages unless the contractor gave the owner proper notice. Without notice, it’s possible the owner didn’t realize that he was causing a delay, and in any event he hasn’t been given the opportunity to correct the problem. [4] X Research source Contractors should keep a daily log of project conditions and events so they can notify the owner of any potential for delay as soon as possible."
    },
    {
      "title": "List the types of events included in a “force majeure” clause.",
      "content": "List the types of events included in a “force majeure” clause. This clause excuses performance if a major event occurs that completely transforms the circumstances of the agreement in a way neither party could possibly have anticipated. Force majeure events typically include natural disasters such as hurricanes, earthquakes, or tornadoes, and political events such as wars, riots, government orders, or trade embargoes. Strikes and labor shortages also may fall into a force majeure clause. Typically, the events listed have catastrophic and unavoidable consequences that would make performance under the contract impossible. In some states such as Virginia, force majeure clauses are required in all construction contracts. For example, your force majeure clause might state \"A party shall not be liable for any failure of or delay in the performance of this Agreement for the period that such failure or delay is due to causes beyond its reasonable control, including but not limited to acts of God, war, strikes or labor disputes, embargoes, government orders or any other force majeure event.\""
    },
    {
      "title": "Decide what will happen if one of these events occurs.",
      "content": "Decide what will happen if one of these events occurs. Typically, the contractor won’t need to pay the owner any damages for the delay, and may be entitled to a reasonable extension of time to complete the project. [5] X Research source Without a force majeure clause, the parties are left at the mercy of common law rules that only excuse performance rarely under a narrow set of circumstances."
    },
    {
      "title": "Consider including other excusable delays.",
      "content": "Consider including other excusable delays. While they may not rise to the “force majeure” level, you might want to include provision for delays that occur through no fault of the contractor. If the contract mentions nothing specifically, courts will only consider a delay excusable if it was caused by circumstances beyond anyone’s control and was unforeseeable by the parties at the time the contract was made. [6] X Research source Examples of excusable delays include unforeseen weather events that don’t rise to the level of a catastrophe, strikes, design errors, or material shortages. If the delay results from something in the control of the owner, such as an error in the design or architectural plans, it may be appropriate for the owner to compensate the contractor for any costs he incurred as a result."
    },
    {
      "title": "Provide for cancellation of the contract without penalty if the event continues beyond a specified period of time.",
      "content": "Provide for cancellation of the contract without penalty if the event continues beyond a specified period of time. For example, a hurricane that only impacts a small coastal area near your build site may only cause a brief delay in construction. However, a massive hurricane resulting in the area being flooded for months would render performance impossible. If a force majeure event renders performance impossible, the clause should allow the parties essentially to walk away from the contract as though it never happened."
    },
    {
      "title": "Include a clause that allows performance to be accelerated to meet the schedule despite delays.",
      "content": "Include a clause that allows performance to be accelerated to meet the schedule despite delays. If the contractor’s fault or neglect causes the delay, this clause would allow you to require the contractor to work more hours to complete the project on time. [7] X Research source If an owner forces a contractor to complete a project despite excusable delays for which the contractor was entitled to a time extension, the contractor may be able to sue the owner for damages if the acceleration caused additional cost. For example, the contractor may have needed to hire two more laborers to help complete the last phase of the project in a shorter time period. [8] X Research source"
    },
    {
      "title": "Provide for liquidated damages in the event performance is delayed and deadlines aren’t met.",
      "content": "Provide for liquidated damages in the event performance is delayed and deadlines aren’t met. Because it’s difficult to predict when drafting a contract what damages might be caused by delays during the project, many construction contracts include a clause providing for liquidated or pre-set damages for delays. [9] X Research source Damages for delay, in particular, are difficult to prove, and for this reason a liquidated damages clause is often favored. Some contractors believe they are not liable for damages for delay unless there is a liquidated damages clause. However, they still may be liable for actual damages caused by a delay that was reasonably foreseeable when the agreement was made. [10] X Research source For example, if an apartment building was supposed to be completed in 500 days, but it took the contractor 600 days due to rain, the contractor would be liable to the building owner for actual damages caused by his delay. It wouldn’t be reasonable for him to believe that it wouldn’t rain for 500 days. Liquidated damages clauses are only enforceable if actual damages would be difficult or impossible to estimate. The amount set forth in the clause must be a reasonable estimate of what actual damages might be, and can’t be intended to punish the other party for delaying. [11] X Research source For example, a restaurateur may hire a contractor to build a new restaurant by a certain date. The restaurateur and the contractor have no idea how much business the new restaurant might have after it opens, so liquidated damages for any delay would be appropriate in this instance. [12] X Research source An owner cannot recover both actual damages and liquidated damages from a contractor who delays his performance. [13] X Research source Liquidated damages can be escalated to reflect the increasing costs of a delay that lasts for an extended period of time. For example, a liquidated damages clause might say: \"If the Contractor fails to complete the work within the contract time, the Contractor agrees to pay the Owner $300 per day as liquidated damages to cover losses, expenses and damages, not to exceed $10,000.\""
    },
    {
      "title": "Allow a party to terminate the agreement if there are excessive delays.",
      "content": "Allow a party to terminate the agreement if there are excessive delays. Drafting a contract involves planning for all contingencies, so consider including a clause that allows the owner to escape the contract in a worst-case scenario where the contractor is responsible for repeated and significant inexcusable delays. [14] X Research source"
    },
    {
      "title": "Allow the owner to suspend or delay work without paying compensation through a “suspension of work” clause.",
      "content": "Allow the owner to suspend or delay work without paying compensation through a “suspension of work” clause. If delays are anticipated for business or other economic reasons, a suspension-of-work clause allows the owner to temporarily pause construction. Typically suspension-of-work clauses provide for some payment to the contractor during the down time, or some adjustment of the final contract price depending on how long construction is put on hold. For example, a suspension-of-work clause might say: \"The Owner may, without cause, order the Contractor in writing to suspend, delay or interrupt the Work in whole or in part for such period of time as the Owner may determine.\" That clause would be followed by any adjustments made to the payment or the schedule as a result of the delay."
    },
    {
      "title": "Check to make sure a “no damage for delay” clause is enforceable in your state.",
      "content": "Check to make sure a “no damage for delay” clause is enforceable in your state. Some states, such as California and Virginia, have laws limiting the enforceability of these clauses, and Ohio has banned them entirely. Even in states where these clauses are not banned, courts dislike them and give little latitude to the party seeking to enforce them. Courts typically decline to enforce them if the cause for the delay was unforeseeable when the contract was made, or if the owner’s intentional acts caused the delay. Courts often throw out a “no damage for delay” clause if your contract also includes a “time is of the essence” clause. If an owner requires a contractor to complete a project as quickly as possible, the reasoning goes, he shouldn’t also be able to deny liability for expenses the contractor incurs because of his own actions. [15] X Research source"
    },
    {
      "title": "Include a statement that the contractor cannot file a claim for additional costs if actions by the owner cause the project to be delayed.",
      "content": "Include a statement that the contractor cannot file a claim for additional costs if actions by the owner cause the project to be delayed. Typically this statement will include a requirement that the contractor provide notice to the owner that his progress is being hindered and request more time to complete the job. Contractors can still get around these clauses and sue the owner for costs incurred if the owner causes delays through actions that are particularly malicious or done in bad faith. [16] X Research source"
    }
  ]
}