{
  "url": "https://www.wikihow.com/Dye-Hair-With-Jell-O",
  "title": "How to Dye Hair With Jell O",
  "steps": [
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. Dying your hair with Jello is simple, and much safer than using regular hair color. Here's what you will need: [1] X Research source 1-2 boxes of Jello Shower cap or aluminum foil (for streaks) Hair conditioner Old towel Petroleum jelly (recommended) 1 bowl per color being used Latex or vinyl gloves"
    },
    {
      "title": "Know what to expect.",
      "content": "Know what to expect. This dye is not permanent, and will go away after several washes. Also, the dye will not be as intense as Kool Aid or store-bought punk dyes. This is because Jello is less-pigmented. It also may not be effective on all hair types; some people's hair is more porous and accepts dye more readily than others'. Coloring your hair at home with heavy 20 or 30 volume bleach and store-bought dyes might get a little tricky, anyway—lots of people who try that end up going to the salon to correct the shade. Jello gives you a way to experiment and have fun without any risks."
    },
    {
      "title": "Consider bleaching your hair if it is very dark.",
      "content": "Consider bleaching your hair if it is very dark. If you don't bleach your hair first, then the color may not show. If you are a child, or if you are going to color a child's hair, do not use bleach. Try using hair chalk instead. It will show up on dark-colored hair, but it is much gentler. Bleaching can burn a child's scalp. To learn how to bleach dark hair in preparation for Jello dying, click here ."
    },
    {
      "title": "Use your fingers to apply some petroleum jelly around your forehead, neck, and ears.",
      "content": "Use your fingers to apply some petroleum jelly around your forehead, neck, and ears. You don't need a lot of it. A thin coating will be enough. This will keep the skin from getting stained. It will also make cleaning up easier."
    },
    {
      "title": "Drape an old towel over your shoulders like a cape.",
      "content": "Drape an old towel over your shoulders like a cape. This will protect your clothes from getting dirty. Secure the front of your towel-cape with a clip or safety pin so that it does not fall off."
    },
    {
      "title": "Put some gloves on your hands so that they don't get stained.",
      "content": "Put some gloves on your hands so that they don't get stained. You can use either vinyl or latex gloves."
    },
    {
      "title": "Tear open a packet of Jello and pour the powder into a bowl.",
      "content": "Tear open a packet of Jello and pour the powder into a bowl. If you have really long or very thick hair, then use two packets instead. If you want to use more than one color, then pour each color into a separate bowl."
    },
    {
      "title": "Add just enough hair conditioner to make a smooth, paste-like consistency.",
      "content": "Add just enough hair conditioner to make a smooth, paste-like consistency. The conditioner will make the dye easier to apply. It will also condition your hair and keep it soft."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. Besides a bleaching kit, you will also need a few extra supplies. Some bleaching kits may already include some of these, such as the gloves. Here is a complete list of what you will need: [2] X Research source Bleaching kit Vinyl or latex loves Tint brush Bowl Spoon or spatula Old towel"
    },
    {
      "title": "Choose the right strength or volume when buying your bleach kit.",
      "content": "Choose the right strength or volume when buying your bleach kit. When you purchase a bleaching kit, you will get a bleaching powder and developer. The kit will also say \"10 volume,\" \"20 volume,\" and so forth. The lower the number is, the weaker the bleach is. The higher the number, the stronger the bleach is and the lighter your hair will be. Here are some guidelines for choosing the right strength: If you have very fine and delicate hair, use a 10 volume. If you have dark or coarse hair, use a 30 or 40 volume. If you have normal hair, or can't decide, stick with a 20 volume."
    },
    {
      "title": "Deep-condition your hair three days before you bleach it.",
      "content": "Deep-condition your hair three days before you bleach it. [3] X Research source Don't wash your hair just before you bleach your hair. This will give your hair to naturally build up oils, which will give it some protection from the harsh bleach."
    },
    {
      "title": "Consider performing a strand test first.",
      "content": "Consider performing a strand test first. Simply follow the directions in this method, but only on a thin strand of hair (about 1 inch/2.54 centimeters wide). This will allow you determine how long and how much bleach to use. It will also give you an idea of what to expect. Try to use a strand from the underside of your hair; it will be less noticeable."
    },
    {
      "title": "Put on the gloves and drape the towel across your shoulder.",
      "content": "Put on the gloves and drape the towel across your shoulder. They will protect your hands and clothes from getting stained."
    },
    {
      "title": "Prepare the bleach according to the instructions on the package.",
      "content": "Prepare the bleach according to the instructions on the package. Every brand will be a little different, but most will ask you to use 1 part bleaching powder to 1 part developer. The longer or thicker your hair is, the more bleaching powder and developer you will need. Mix everything together in the bowl with a spoon or spatula until you get a thick, creamy paste. [4] X Research source"
    },
    {
      "title": "Divide your hair into four parts to make it easier to work.",
      "content": "Divide your hair into four parts to make it easier to work. Start by dividing your hair straight down the middle, as though you are going to make two braids. Divide each section again horizontally right above the ear. Secure each section with a hair tie or a claw clip."
    },
    {
      "title": "Start bleaching your hair from the back of your head and move your way up towards the top.",
      "content": "Start bleaching your hair from the back of your head and move your way up towards the top. Undo the bottom left section of your hair. Use the tint brush to apply some bleach to a thin strand of hair, starting from the ends, and moving your way up to the roots. When you are done, repeat the process for the bottom right section, then the top left and the top right sections. [5] X Research source Your roots will always lighten faster than the rest of your hair. This is because your roots are the closest to your scalp, which is very warm. Consider using a low-volume developer, such as a 10, on your roots. You can also skip using bleach on your roots. [6] X Research source Consider covering the bleached sections with plastic wrap. This will keep the bleach from drying out. If the bleach dries out, it will become difficult to work with."
    },
    {
      "title": "Wait 30 minutes, or however long the manufacturer recommends.",
      "content": "Wait 30 minutes, or however long the manufacturer recommends. Be sure to check back on your hair often. Your hair might finish bleaching before the 30 minutes (or the recommended time) are up. If your scalp starts to burn at any time, wash the bleach off. Do not leave the bleach on for too long. The longer you leave the bleach on, the more ruined your hair will get."
    },
    {
      "title": "Rinse the bleach out and follow up with shampoo and conditioner.",
      "content": "Rinse the bleach out and follow up with shampoo and conditioner. This is important, as bleach can be very drying. The shampoo and conditioner will help make your hair soft again. Consider using a purple tinted shampoo to get rid of any orange tints."
    },
    {
      "title": "Dry your hair with a towel.",
      "content": "Dry your hair with a towel. Try not to use heat to dry your hair. You hair will be sensitive after bleaching, and any heat will damage it further."
    },
    {
      "title": "Divide your hair into four sections to make it more manageable.",
      "content": "Divide your hair into four sections to make it more manageable. Start by dividing your hair down the middle, as though you are going to braid it. Then, split each section in half, right above the ear. Secure each section with a hair tie or a claw clip. You should end up with four pigtails."
    },
    {
      "title": "Undo the bottom left section and apply the dye to it.",
      "content": "Undo the bottom left section and apply the dye to it. Take a strand that is about 1 inch (2.54 centimeters) wide, and apply the dye. Start from the ends of your hair, and work your way up to the roots. You can apply the dye using your fingers, or a tint brush, which you can find in a beauty shop. If you want a dip-dyed or ombre look, click here . If you want to streak-dye your hair, click here ."
    },
    {
      "title": "Roll the dyed section into a bun and secure it with a hair tie or clip.",
      "content": "Roll the dyed section into a bun and secure it with a hair tie or clip. This will help keep the hair from drying out too quickly. It will also keep the dyed hair out of the way."
    },
    {
      "title": "Repeat the process for the other three sections.",
      "content": "Repeat the process for the other three sections. Start from the bottom right section, then do the top left and top right sections next. Be sure to roll each section into a mini bun before moving onto the next."
    },
    {
      "title": "Put a shower cap over your head.",
      "content": "Put a shower cap over your head. The cap will trap the heat from your scalp, which will help the dye set. It will also keep your hair from drying out too soon."
    },
    {
      "title": "Leave the shower cap on for at least one hour.",
      "content": "Leave the shower cap on for at least one hour. The longer you leave the dye in your hair, the stronger the color will be."
    },
    {
      "title": "Rinse your hair using lukewarm water after the time is up.",
      "content": "Rinse your hair using lukewarm water after the time is up. Once you have left the dye on long enough, take the shower cap off and undo the buns. Rinse your hair using lukewarm water. Do not use any shampoo or conditioner. The conditioner that you used to make the dye out of will be enough."
    },
    {
      "title": "Dry your hair.",
      "content": "Dry your hair. You can dry it using a hairdryer or a towel. If you are using a towel, you might want to use an old on, in case some of the dye transfers onto it."
    },
    {
      "title": "Divide your hair into four sections to make it easier to work with.",
      "content": "Divide your hair into four sections to make it easier to work with. Start by splitting your hair down the middle, just like you are going to braid it. Next, divide each section in half, just above the ear. Secure each section with a hair tie or a claw clip. You will end up with four mini pigtails."
    },
    {
      "title": "Undo the bottom left pigtail and start applying the dye.",
      "content": "Undo the bottom left pigtail and start applying the dye. Take an inch (2.54 centimeters) wide strand and apply the dye using your fingers or a tint brush. How far you apply the dye depends on how far you want the dip-dye effect to go. Keep doing this until the entire section is dyed."
    },
    {
      "title": "Twist the dyed hair into a rope.",
      "content": "Twist the dyed hair into a rope. This will help the dyed part blend into your natural color. You won't get a sharp line this way."
    },
    {
      "title": "Wrap a piece of tin foil around the dyed part.",
      "content": "Wrap a piece of tin foil around the dyed part. This will keep the dye from getting onto the un-dyed hair. It will also keep the hair damp."
    },
    {
      "title": "Repeat the process for the other three sections.",
      "content": "Repeat the process for the other three sections. Start from the bottom right section, then do the top left and top right sections next. Be sure to wrap each section with tin foil before moving onto the next one."
    },
    {
      "title": "Wait at least one hour before moving onto the next step.",
      "content": "Wait at least one hour before moving onto the next step. The longer you leave the dye in your hair, the stronger the color will be."
    },
    {
      "title": "Rinse your hair with some lukewarm water once the time is up.",
      "content": "Rinse your hair with some lukewarm water once the time is up. Do not use shampoo or conditioner. You already put conditioner into the dye, and any shampoo might take the dye out."
    },
    {
      "title": "Dry your hair with a hairdryer or a towel.",
      "content": "Dry your hair with a hairdryer or a towel. If you are using a towel, make sure that it is an old one you don't care about, in case the dye transfers onto it."
    },
    {
      "title": "Make your hair easier to work with by dividing it into four sections.",
      "content": "Make your hair easier to work with by dividing it into four sections. Part your hair down the middle, as though you are going to braid it. Next, divide each section in half, just above the ear. Wrap a hair tie around each section to keep it in place. You can also use a claw clip instead."
    },
    {
      "title": "Undo the bottom left section and start applying the dye.",
      "content": "Undo the bottom left section and start applying the dye. Take a strand that is about 1 inch (2.54 centimeters) wide, and apply the dye. Start from the ends of your hair, and work your way up to the roots. You can apply the dye using your fingers, or a tint brush, which you can find in a beauty shop."
    },
    {
      "title": "Wrap a sheet of tin foil around each strand before moving onto the next one.",
      "content": "Wrap a sheet of tin foil around each strand before moving onto the next one. You can dye as many or as few inch-wide sections as you want."
    },
    {
      "title": "Repeat the process for the other three sections.",
      "content": "Repeat the process for the other three sections. Once you have all the hair you want dyed and covered with foil, move onto the next section. Do the bottom right section first, then the top left and top right sections."
    },
    {
      "title": "Leave the foil and dye in your hair for at least one hour.",
      "content": "Leave the foil and dye in your hair for at least one hour. The longer you leave the dye in your hair, the stronger the color will be."
    },
    {
      "title": "Rinse your hair with lukewarm water.",
      "content": "Rinse your hair with lukewarm water. Do not use any shampoo or conditioner. If you use shampoo, you may end up washing all that dye out."
    },
    {
      "title": "Dry your hair using a hairdryer or a towel.",
      "content": "Dry your hair using a hairdryer or a towel. If you decide to use a towel, it might be a good idea to use an old on, in case some of the dye transfers onto it."
    }
  ]
}