{
  "url": "https://www.wikihow.com/Repair-Vertical-Blinds",
  "title": "How to Repair Vertical Blinds",
  "steps": [
    {
      "title": "Adjust blinds that won't turn.",
      "content": "Adjust blinds that won't turn. If your blinds aren't closing, or if one or two won't close, this is usually a simple fix. Check each blind individually. It's likely one or two blinds are backwards and simply need to be twisted into the right position. Blinds may also be overlapping, in which case you can use your hands to gently push them apart. [1] X Research source"
    },
    {
      "title": "Patch up holes with a repair kit.",
      "content": "Patch up holes with a repair kit. In some cases, a blind may develop a hole on one or both ends. This can cause multiple problems, from the blind falling out to the blinds not rotating properly. You can buy a cheap blind repair kit at a department store and simply place adhesive tape over the holes. This should correct the issue. [2] X Research source"
    },
    {
      "title": "Remove items jamming the blinds.",
      "content": "Remove items jamming the blinds. If blinds won't rotate, and there doesn't seem to be overlapping or backwards blinds, check the slots where the blinds are connected to the carrier stem. In some cases, there is something obvious jammed in these holes, like a piece of dirt or even a small piece of the blind itself that broke off. If you can dislodge this object with your fingers, this will usually clear up the issue. [3] X Research source"
    },
    {
      "title": "Use lubricant spray to fix rotation issues.",
      "content": "Use lubricant spray to fix rotation issues. If blinds won't rotate because the rod is not rotating, it may just need some lubrication. Pick up a lubricant spray meant to be used on household items, like WD-40. Spray a small amount of lubricant where the rod is connected to the blinds. This may help the rod rotate properly. [4] X Research source"
    },
    {
      "title": "Check your blinds individually if troubleshooting fails.",
      "content": "Check your blinds individually if troubleshooting fails. If basic troubleshooting doesn't work, there may be a bigger issue at play. If you can narrow down an issue to a single blind, remove and replace that blind . A blind may be very bent or cracked and it's preventing surrounding blinds from closing or rotating. Problem blinds don't always need to be repaired, however. If a blind is simply backwards, you and remove it and then reattach it in the correct position."
    },
    {
      "title": "Replace a carrier stem if you can't find an issue with the blinds.",
      "content": "Replace a carrier stem if you can't find an issue with the blinds. If your blinds are all in good shape, check the carrier stem connecting the blind to the poll on the top. If the carrier stem is cracked or damaged, it needs to be removed and replaced."
    },
    {
      "title": "Disconnect the spacer chain if necessary.",
      "content": "Disconnect the spacer chain if necessary. Some blinds are connected by a spacer chain running along the bottom between each blind. The chain runs through a plastic loop at the end of each blind. [5] X Research source In this case, you need to detach the blinds from the spacer chain before removing them from the hook. Locate the clip securing the chain at the end and twist it off with your fingers. Feed the chain outward from the loop at the bottom of the blind you're removing, disconnecting other blinds from the chain until the problem blind is detached."
    },
    {
      "title": "Lift the blind off the hook.",
      "content": "Lift the blind off the hook. Blinds on hooks are the easiest to remove. Open your blinds and then simply raise the problem blind upwards off the hook. Bend the blind slightly to detach it from the hook and then lift the blind off the poll altogether."
    },
    {
      "title": "Attach a replacement blind to the hook.",
      "content": "Attach a replacement blind to the hook. Once your blind is removed, take your replacement blind. Point the blind's curve in the same direction as the other blinds. Hold onto the blind near the top. Maneuver the vane back into the hook by lifting the blind, twisting it over the hook, and pressing it down gently to secure."
    },
    {
      "title": "Reattach the blind to the spacer chain.",
      "content": "Reattach the blind to the spacer chain. If you have a spacer chain, you'll need to reattach the new blind here as well. Thread the chain through the holes on the end of each blind. Thread it back through any blinds that were disconnected earlier. Keep feeding the chain through the blinds until you reach the end. Reattach the clip securing the chain by screwing it back on with your fingers."
    },
    {
      "title": "Open the blinds.",
      "content": "Open the blinds. If you need to replace the stem, the first thing you should do is open the blinds. You can't replace the stem if your blinds are closed. [6] X Research source"
    },
    {
      "title": "Remove the blind attached to the carrier stem.",
      "content": "Remove the blind attached to the carrier stem. Unhook your blind from the problem stem. If you have a spacer chain, remove the blind from the spacer chain as well."
    },
    {
      "title": "Grab the carrier body with needle nose pliers.",
      "content": "Grab the carrier body with needle nose pliers. The carrier stem is a small rectangle shaped piece of plastic clamped around the top of the blind. The stem is attached to the poll by a small piece of plastic found on the poll just to the right of the stem. This is known as the carrier body. Clamp a pair of pliers around the carrier body. Get as close as you can to the body without touching the stem. [7] X Research source The poll the blades are attached to is hollow inside. The carrier body found inside the poll, pressed against the right side."
    },
    {
      "title": "Twist off the stem.",
      "content": "Twist off the stem. Use your free hand to gently twist the stem away from the carrier body, holding the body still with your pliers. As you twist, pull the stem downward until it detaches from the carrier body. [8] X Research source"
    },
    {
      "title": "Get a replacement stem.",
      "content": "Get a replacement stem. It's important you get the exact right match for your old carrier stem. A different stem will not attach properly to your blinds. Either order a stem from the same manufacturer online or take your stem to a hardware store and find an exact match there. [9] X Research source You can ask a worker at a hardware store to help you identify the correct stem if you're confused."
    },
    {
      "title": "Insert the new stem.",
      "content": "Insert the new stem. Inserting the stem is a lot easier than removing it. The stem should have a knob that fits into a hole in the carrier body. Simply push the stem into the carrier body until it slides into the hole. You can then push your blade back through the stem. [10] X Research source Once the stem is replaced, you can reattach the blind and spacer chain."
    }
  ]
}