{
  "url": "https://www.wikihow.com/Clean-a-Stained-Toilet-Bowl",
  "title": "The Best Ways to Remove Stains From a Toilet Bowl",
  "steps": [
    {
      "title": "Look at the stain color and placement to determine what’s causing it.",
      "content": "Look at the stain color and placement to determine what’s causing it. Usually, toilet stains are caused by minerals, mold, or mildew. Different stains require different products to effectively get rid of them. [1] X Research source To find out which method to follow, determine what’s causing your stains. Mineral stains (caused by hard water) appear as rings and build up in the inner toilet bowl. They may be pink, red, brown, or white. Use an acidic cleanser for mineral build-up. Mold stains can occur anywhere on your toilet. Mold is slightly fuzzy and can be blue, green, yellow, gray, black, or white. Use a bleach-based cleaner for mold. Mildew can also grow anywhere on your toilet, but it’s most commonly found near the top of the toilet bowl or on the toilet tank. Mildew usually starts out white, but may turn yellow or brown in time. Use bleach products for these stains, too."
    },
    {
      "title": "Squeeze a toilet cleanser around and under the rim and let it sit for 10 minutes.",
      "content": "Squeeze a toilet cleanser around and under the rim and let it sit for 10 minutes. Clean your toilet by squeezing a toilet bowl cleaner all around the underside of the time and letting it sit for 10 minutes. Then, use a hard-bristled toilet brush to work the cleaner into all the nooks and crannies. This starts loosening the stains and build up. Use bleach for mold and mildew and acidic cleaners for mineral stains. Always wear gloves and eye protection while working with highly acidic products. Never mix cleaners. Vinegar and bleach (and ammonia and bleach), for example, make poisonous gas when combined. Before you begin cleaning your toilet, check your manufacturer's instructions. Certain products can damage the inner workings of your toilet—such as the flapper—while others may cause discoloration."
    },
    {
      "title": "Turn off the water and flush the toilet.",
      "content": "Turn off the water and flush the toilet. Having extra water in the toilet bowl dilutes the cleaning products, so turn off the water (with the valve behind your toilet) and flush it to empty the bowl. You may need to use a cup, towel, or wet vacuum to get up the last of the water. [2] X Research source Open the door and any windows in the bathroom before you start. When the toilet is dry the drain opens directly to the sewage pipe—it can get pretty smelly. Consider wearing a mask, especially if the room isn’t well ventilated."
    },
    {
      "title": "Pour 3 c (710 mL) of vinegar into the toilet and let it sit overnight.",
      "content": "Pour 3 c (710 mL) of vinegar into the toilet and let it sit overnight. To break up mineral deposits (which are basic), pour white vinegar up to the normal waterline (roughly 3 c (710 mL)) and let it sit overnight. [3] X Research source Give the whole thing a good scrub with a stiff-bristled toilet brush in the morning. [4] X Research source You can also use lemon juice—it’s only slightly less acidic than vinegar. To get things even more concentrated, soak some paper towels in vinegar and stick them directly on the stains. You may have heard that bleach is good for hard water and limescale, but bleach is basic (high pH) and not effective for dissolving minerals. In fact, if you use bleach on rust (red and brown) stains, they can become even worse. [5] X Research source"
    },
    {
      "title": "Rub a baking soda paste onto any leftover stains, then rinse with vinegar.",
      "content": "Rub a baking soda paste onto any leftover stains, then rinse with vinegar. Soak paper towels in vinegar and stick them to the stains for 4 hours. Mix baking soda and water until it forms a thick paste. Take off the paper towels, rub the paste into the stained areas with a cloth, then wait 5-10 minutes. Spray the bowl down with vinegar to rinse it off. [6] X Research source Use at least 8 oz (230 g) of baking soda for the paste, and make the consistency very thick, so it can stick to the stains. Use a few drops of water at a time while making the paste. Flush your toilet three times (and remove the water again) between switching cleaning products."
    },
    {
      "title": "Pour ½ cup (118 ml) of hydrogen peroxide into the bowl.",
      "content": "Pour ½ cup (118 ml) of hydrogen peroxide into the bowl. Hydrogen peroxide is an all-around great disinfectant, and it can tackle hard water stains, too! Pour ½ cup (118 ml) of hydrogen peroxide into the bowl, then let it sit for half an hour. [7] X Research source Scrub the stains with a toilet brush. If the stains are higher than the water line, put hydrogen peroxide into a spray bottle and spritz it directly onto them or soak paper towels in hydrogen peroxide and stick them to the area."
    },
    {
      "title": "Pour roughly 3 c (710 mL) of brick acid into the bowl.",
      "content": "Pour roughly 3 c (710 mL) of brick acid into the bowl. Muriatic acid , or brick acid, is incredibly acidic (pH 2) and can take a serious bite out of hard water stains. Pour about 3 c (710 mL) of brick acid up to where the water usually settles, then let it sit for an hour. [8] X Research source Scrub the stains with a toilet brush. Stick paper towels soaked in the acid directly onto stains that are higher than the water line. If you get any brick acid on your skin, run cold water over the area for ten minutes. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Gently rub the stains with a wet pumice stone.",
      "content": "Gently rub the stains with a wet pumice stone. If nothing else works, try using a pumice stone toilet bowl cleaner (or just a pumice stone, if you happen to have one lying around). Soak the stone in warm water for 20 minutes, then use very light pressure to scrub away stains. [10] X Research source Pumice is very soft, but it’s still a rock. While this method is great at getting rid of stains, too much pressure can scratch your toilet bowl."
    },
    {
      "title": "Spray the stains with white vinegar, then scrub with a toilet brush.",
      "content": "Spray the stains with white vinegar, then scrub with a toilet brush. To kill the organisms making these stains, spray the areas or pour 3 c (710 ml) of white vinegar directly into the bowl, then scrub with a toilet brush. White vinegar is acidic enough to effectively kill mold and mildew and prevent it from coming back. [11] X Research source Another natural product you can try is tea tree oil, which is believed to be a fungicide. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Add 10 drops of tea tree essential oil to your toilet bowl or spray a tea tree oil solution (5-10 drops of oil to a bottle of water) directly onto any mildew or moldy spots. Flush the toilet at least three times between cleaning methods so nothing mixes together or gets stuck in the internal mechanisms of the toilet."
    },
    {
      "title": "Spray the stains and the underside of the rim with hydrogen peroxide.",
      "content": "Spray the stains and the underside of the rim with hydrogen peroxide. Put hydrogen peroxide into a spray bottle and cover the mold or mildew. Get the liquid up under the rim if you’re seeing mildew stains—that’s an area it likes to grow in. Let it sit for at least 10 minutes, then scrub it off. [13] X Research source"
    },
    {
      "title": "Pour 3 c (710 ml) of diluted bleach into the toilet bowl and scrub the stains.",
      "content": "Pour 3 c (710 ml) of diluted bleach into the toilet bowl and scrub the stains. If the stains persist, move on to bleach. Dilute the bleach to a ratio of 1:32 (bleach to water) and spray it onto the stains, or add 3 c (710 ml) to the toilet bowl. Use a toilet brush to scrub the bleach into the stains."
    }
  ]
}