{
  "url": "https://www.wikihow.com/Act-and-Look-Smart",
  "title": "13 Tips For Appearing Smarter",
  "steps": [
    {
      "title": "Wear clean, fitted outfits to make a good first impression.",
      "content": "Wear clean, fitted outfits to make a good first impression. Wearing baggy, ripped, or stained clothes can accidentally make you look sloppy and unprofessional. Although it doesn’t have anything to do with your inner intelligence, humans make a lot of snap-judgements about each other, so it’s best to give them a good first impression. Find shirts, pants or dresses that fit you well, and aren’t too tight or too loose. [1] X Research source Go for a button-down shirt every once in a while, instead of just a T-shirt."
    },
    {
      "title": "Avoid wearing sweatpants and athletic gear out and about.",
      "content": "Avoid wearing sweatpants and athletic gear out and about. Of course, you can wear T-shirts and sweatpants when you’re working out or lounging on the couch. But when you go out in public, put on some jeans, a skirt, or slacks, to give yourself an extra boost of confidence. Not only will you look more professional, but you’ll feel better: more prepared, alert, and ready to do your best. If you’re planning to work out later in the day, bring your workout clothes in your bag to change into later, so that you can still look professional throughout the day."
    },
    {
      "title": "Wear glasses to look smarter.",
      "content": "Wear glasses to look smarter. The notion that people who wear glasses are smart is totally unfounded, but it’s such a popular trope in movies, books, and TV, that lots of people will automatically think you look smarter if you wear glasses. If you need corrective lenses, go for glasses instead of contact lenses, and it may boost your image. [2] X Research source If you want to wear glasses, but don’t actually need them to see, you can get “fashion glasses” that are just clear glass lenses."
    },
    {
      "title": "Invest in a good-looking pair of shoes to finish off your outfit.",
      "content": "Invest in a good-looking pair of shoes to finish off your outfit. They don’t have to be expensive, or high-heeled, but having clean, unscuffed footwear can go a long way toward giving you a smart look. Try going for something a little bit nicer than sneakers to step up your look. [3] X Research source Try Chelsea boots or suede sneakers. Avoid wearing running shoes when you’re not working out."
    },
    {
      "title": "Maintain personal hygiene to smell fresh and look clean.",
      "content": "Maintain personal hygiene to smell fresh and look clean. Shower and shave regularly and always wear deoderant. Brush your teeth and floss . You don’t have to do an elaborate hairstyle or wear makeup to look smart, but you do have to take care of your body, and smell nice and clean. [4] X Research source If you don’t have time to wash your hair on a particular day, wear it in a braid so that it doesn’t look oily."
    },
    {
      "title": "Practice upright posture.",
      "content": "Practice upright posture. Try to stand with your shoulders back and your spine straight. If you have to spend a lot of time sitting, you can still improve your posture by sitting with your back arched slightly, and your computer monitor in line with your eyes. Practicing good posture makes you look smarter, because you look confident and professional. [5] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Maintaining good posture can also avoid a lot of back pain. [6] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Maintain eye contact when you’re speaking and listening.",
      "content": "Maintain eye contact when you’re speaking and listening. Making eye contact in conversation makes you look confident, at ease with yourself, and engaged in whatever you’re discussing. If you don’t feel comfortable making eye contact, practice looking between somebody’s eyes or at their eyebrows, and go from there. [7] X Research source Don’t feel the need to stare into somebody’s eyes during the whole conversation. This can feel too intense. Instead, try maintaining eye contact for about 5 seconds and then look away at something else before coming back to looking in their eyes. [8] X Research source Try to maintain eye contact about 50% of the time when you’re speaking, and about 70% of the time when you’re listening. [9] X Research source"
    },
    {
      "title": "Listen more than you speak to absorb information.",
      "content": "Listen more than you speak to absorb information. You might be tempted to join a conversation and say a bunch of made-up stuff to make yourself look smart, but actually that makes you come off as phony. If you don’t know anything about a subject, don’t make it obvious by making stuff up. Instead, listen. You’ll actually learn! Then you can politely steer the conversation toward a topic that you know something about. [10] X Research source Don’t change the topic to boast about yourself. Instead, switch it to a topic that you’re comfortable discussing. Like, “oh, that reminds me of a conversation I had with my grandfather. He had such an interesting life. He used to…”"
    },
    {
      "title": "Ask insightful questions.",
      "content": "Ask insightful questions. When there’s a conversation about something that you don’t know much about, you can still look intelligent. Nobody knows everything, but smart people know how to ask insightful questions that take the conversation out of small-talk and into something more meaningful. [11] X Research source For instance, if someone is describing an experience they had, you can ask, “How do you feel like that experience changed the way you interact with people today?” or if they are describing a book they read, you can ask, “What most stood out to you about the book?”"
    },
    {
      "title": "Read books on the commute and before bed.",
      "content": "Read books on the commute and before bed. This might seem like a simple one, but it will actually make you stand out in a crowd. Many people think that they don’t have time to read , but you don’t actually need a huge chunk of time to read a book. Bring along a book in your backpack or purse, and take it out whenever you would normally start swiping through your phone: in line, on the bus, on the train, waiting for a friend to show up. Choose a genre that you actually enjoy reading, and it won’t feel like a chore. [12] X Research source Not only will you look smart by reading a book in public, but you will actually get smarter by exposing yourself to new worlds, words and ideas. [13] X Expert Source John Keegan Dating Coach Expert Interview. 12 March 2021. Try to read before you go to sleep instead of watching television. It will calm your brain for bed better than watching bright lights and moving pictures. Just don’t read anything too sad or scary right before bed!"
    },
    {
      "title": "Keep up to date on the news so you can have interesting conversations.",
      "content": "Keep up to date on the news so you can have interesting conversations. Don’t feel like you have to read a newspaper front-to-back every day to be on top of things. A quick glance at the headlines on your phone in the morning might be enough to start an intelligent-sounding conversation. You can say, “Did you hear about…” and then let the other person do most of the talking. [14] X Research source You also don’t have to keep on all the news that’s happening everywhere. Choose a topic that you’re interested in, and check in about it. Many news outlets offer podcast summaries of their news, so you don’t have to read if you don’t have time. For example, you can listen to The New York Times podcast, “The Daily.”"
    },
    {
      "title": "Take notes and do your homework to look smart in class.",
      "content": "Take notes and do your homework to look smart in class. To succeed in school, you have to be prepared. People aren’t really naturally much smarter than others; it’s mostly about preparation. Do the reading and take notes while the teacher is talking. [15] X Research source If you don’t understand something, and don’t want to ask in front of the whole class, draw a star on your notes in the margin to remind yourself to ask the teacher after class. Don’t talk about test grades with other students. This only makes you come across as stuck-up and grade-obsessed, not more intelligent. If people ask for your grade on a test, just say, “I prefer not to talk about grades, but I was happy with how I did,” or, “I didn’t do so well this time, I’m going to study more.”"
    },
    {
      "title": "Spend time talking with people who are older than you to gain wisdom.",
      "content": "Spend time talking with people who are older than you to gain wisdom. It’s tempting to spend all your time with friends your own age, but make a little time to talk with your grandparents, or other elders and mentors in your life who have wisdom to share. Ask about their life experiences and listen to their stories. [16] X Research source You’ll gain a lot of wisdom, and people might even begin to see you as “wise beyond your years.”"
    }
  ]
}