{
  "url": "https://www.wikihow.com/Make-a-Headband-Stay-in-Place",
  "title": "3 Ways to Keep Headbands from Sliding Off",
  "steps": [
    {
      "title": "Pull your hair up into a bun or ponytail.",
      "content": "Pull your hair up into a bun or ponytail . Brush your hair so that it's smooth and tangle-free, then gather it into a bun or ponytail. You'll be keeping your hair in this style throughout the day, so make it nice and neat. [1] X Research source Create a mid-high or high bun or ponytail. Don't make a low bun or low ponytail. This method works the best for elastic headbands, but it may also work for silk scarves as well."
    },
    {
      "title": "Apply a light misting of hairspray, then let it dry.",
      "content": "Apply a light misting of hairspray, then let it dry. Focus the hairspray on the top and sides of your head, where the headband will sit. Don't worry about your nape or the bun/ponytail itself. [2] X Research source If you can, use a non-flexible, texturizing hairspray. [3] X Research source No hairspray? Try dry shampoo, sea salt spray, or a bit of hair wax or pomade."
    },
    {
      "title": "Put the headband on.",
      "content": "Put the headband on. Pull the headband down over your head, then slide the front up back up so that it sits just behind your hairline. The rest of the headband should sit behind your ears and against the base of your skull. [4] X Research source If you're using a silk scarf , place the knot on top of your head for a more secure hold. You may not even need to use bobby pins! You could also tie the knot at the back of your head to mix up your look. [5] X Research source"
    },
    {
      "title": "Secure the headband with a bobby pin behind each ear.",
      "content": "Secure the headband with a bobby pin behind each ear. Slide the bobby pin through your hair so that the tips are pointing towards your face. You want the bobby pin to be pointing down, not up. This will keep the headband from riding back on your head. [6] X Research source [7] X Expert Source Janet Miranda Professional Hair Stylist & Makeup Artist Expert Interview. 13 April 2021. You need 1 bobby pin on each side of your head. Choose a bobby pin that matches your hair color so it will blend into your hair. [8] X Research source Make sure that the wavy side of the bobby pin is facing down against your hair, and that the flat side is facing up."
    },
    {
      "title": "Slide 2 more bobby pins through the back of the headband, making an X.",
      "content": "Slide 2 more bobby pins through the back of the headband, making an X. Like with the first set of bobby pins, make sure that these are pointing down as well. This will keep the headband from riding up on your nape. [9] X Research source You can skip this step if you feel that the headband is secure enough."
    },
    {
      "title": "Get an elastic headband.",
      "content": "Get an elastic headband . This method works on any type of stretchy, elastic headband. It can be the thick, workout headband made from stretchy jersey material, or it can be the skinny ribbon-like headband made from colored or printed elastic. You can try this method on non-stretchy, ribbon headbands that are connected with a small bit of elastic. If the headband is made from lace, use hot glue instead!"
    },
    {
      "title": "Flip the elastic inside-out so that the wrong side is exposed.",
      "content": "Flip the elastic inside-out so that the wrong side is exposed. If this is a wide, work-out headband, you might actually see a seam running down its length. If this is a colored or printed elastic headband, the color will be lighter or solid-colored on this side."
    },
    {
      "title": "Draw a squiggly line with puffy paint across the elastic.",
      "content": "Draw a squiggly line with puffy paint across the elastic. This can be a smooth, wavy line or a sharp, zigzag line. Don't draw a straight line, however, or the paint will break when you put the elastic headband on. [10] X Research source Match the color of the puffy paint to the elastic or to the printed design. Puffy paint is sometimes called \"puff paint\" or \"dimensional fabric paint.\" If you can't find puffy paint, use hot glue instead. This is a great option for non-stretchy, lace headbands."
    },
    {
      "title": "Let the paint dry, then do the other side.",
      "content": "Let the paint dry, then do the other side. Your headband is circular, but you are working on it while it is flat. You just did 1 side, but now you have to do the other. This is easier than working in a full circle. Once the paint dries, just flip the headband over and do the other side. Make sure that the ends of the squiggly lines on the front and back of the headband match up. Puffy paint can take several hours to dry, so be patient. As it dries, it will look a little darker and flatter. If you 'e using hot glue, you only need to wait a few minutes. Hot glue sets up very quickly."
    },
    {
      "title": "Wait for the paint to dry, then flip the headband right-side-out.",
      "content": "Wait for the paint to dry, then flip the headband right-side-out. The puffy paint or hot glue will act as a sort of rubber grip. When you put it on your head, it will create friction and catch onto your hair. [11] X Research source Be careful not to stretch the elastic too much. If you pull too much on it, the puffy paint or hot glue may snap. It should stand up to pulling it over your head, however."
    },
    {
      "title": "Get a ribbon headband with an elastic closure.",
      "content": "Get a ribbon headband with an elastic closure. These types of headbands look like a strip of ribbon joined by the ends with about 4 inches (10 cm) of elastic. Do not use an elastic headband; the Velcro will prevent it from stretching. This method is not recommended for sheer or lace headbands because the Velcro will be visible. Use the puffy paint method, but with hot glue."
    },
    {
      "title": "Purchase Velcro that's a little narrower than the ribbon.",
      "content": "Purchase Velcro that's a little narrower than the ribbon. The Velcro can be any color, but black would work the best because it won't get dirty as fast. The exact width of the Velcro doesn't matter, as long as it is narrower than the ribbon. If you can get Velcro in multiple colors, match the color to the ribbon. If you can't find something narrower, get Velcro that's the same width instead. Avoid self-adhesive Velcro. The glue isn't very strong and it will create a sticky, gummy mess—not a good combination for hair!"
    },
    {
      "title": "Cut the Velcro so that it's the same length as the ribbon part.",
      "content": "Cut the Velcro so that it's the same length as the ribbon part. You don't have to measure the ribbon. Just hold 1 end of the Velcro against 1 end of the ribbon. Pull it across the top of the ribbon to the other end, then cut it. [12] X Research source If your ribbon is crimped when it joins the elastic, subtract 1 inch (2.5 cm) from your Velcro. This way, the Velcro won't bunch up when you glue it in. Keep the scratchy, hook side of the Velcro. Set the soft, loop side for another project."
    },
    {
      "title": "Hot glue the Velcro to the underside of the ribbon.",
      "content": "Hot glue the Velcro to the underside of the ribbon. Turn your headband inside out so that you can see the back of the ribbon. Working 1 inch (2.5 cm) at a time, apply hot glue to the back of the Velcro, and press it against the ribbon. Try to align the ends as best as you can. If you cut the Velcro 1 inch (2.5 cm) shorter, then start gluing it 1 ⁄ 2 inch (1.3 cm) from the end of the ribbon. If you don't have hot glue, use fabric glue instead. It will work just fine, but it will take longer to dry."
    },
    {
      "title": "Turn the headband right-side-out and wear it.",
      "content": "Turn the headband right-side-out and wear it. The Velcro will now act like the tiny hooks on a plastic headband. It will grab onto your hair, and help keep the headband in place! [13] X Research source Hot glue dries almost instantly, so it should be ready by the time you finish gluing the Velcro down. Fabric glue will need about 15 to 20 minutes to dry, however."
    }
  ]
}