{
  "url": "https://www.wikihow.com/Get-Rid-of-Mites-on-Snakes",
  "title": "How to Get Rid of Mites on Snakes",
  "steps": [
    {
      "title": "Get a shallow plastic container that has a lid with holes.",
      "content": "Get a shallow plastic container that has a lid with holes. Find a plastic container that is large enough for your snake to fit comfortably into. Make sure that the lid has holes so that the snake can breathe while its soaking. [1] X Research source If you cannot find a lid that already has holes in it, use an electric drill to punch holes through the plastic. The lid prevents the snake from climbing out of the container."
    },
    {
      "title": "Place the snake into the plastic container.",
      "content": "Place the snake into the plastic container. Remove the snake from its enclosure. Transfer it into the plastic container and keep the lid off for the time being."
    },
    {
      "title": "Fill the container with a solution of warm water and povidone iodine.",
      "content": "Fill the container with a solution of warm water and povidone iodine . Combine 1 part povidone iodine and 10 parts warm water. Use water that is 75–85 °F (24–29 °C) so that it is a comfortable temperature for the snake. The amount of water that you use depends on both the size of the snake and the container. Use enough water so that the snake can bathe, but not too much that the snake could drown. Povidone iodine is commonly sold under the name of Betadine."
    },
    {
      "title": "Keep the snake soaking in the solution for 30 minutes to 1 hour.",
      "content": "Keep the snake soaking in the solution for 30 minutes to 1 hour. Place the lid on the container. Make sure that the container is close by so that you can keep an eye on the snake while its soaking."
    },
    {
      "title": "Take the snake out and wipe away remaining mites with mineral oil.",
      "content": "Take the snake out and wipe away remaining mites with mineral oil. Check the chin, vent fold, and belly scutes for any dead or alive mites. Dip a cotton-tipped swab in mineral oil and use it to gently rub between the folds and scales to remove the mites. [2] X Research source You can also dab the heat pits and eyes with mineral oil. The vent fold is located on the underside of the tail, the belly scutes are the wide scales on the belly, and the heat pits are the small holes located between the eyes and nostrils. [3] X Research source"
    },
    {
      "title": "Repeat the soaking process daily for up to 1 week.",
      "content": "Repeat the soaking process daily for up to 1 week. Check the snake and the enclosure for mites daily. Soak the snake in the povidone-iodine solution every day until the mites are gone. If the mites persist or if the snake’s condition deteriorates, take the snake for specialist treatment with a veterinarian. You will be able to tell if the snake's condition deteriorates if it has a loss of appetite, vomiting, starts breathing with an open mouth, or if it experiences changes in shedding. [4] X Research source"
    },
    {
      "title": "Get rid of all food and water within the enclosure.",
      "content": "Get rid of all food and water within the enclosure. While the snake is soaking, begin cleaning the enclosure. Pour the water out and discard any uneaten or leftover food. Clean out the food and water containers thoroughly. Food and water must be disposed of to prevent it from being contaminated with cleaning chemicals. You only need to clean the enclosure once to remove the mites, not every day."
    },
    {
      "title": "Dispose of all of the substrate and porous items in the enclosure.",
      "content": "Dispose of all of the substrate and porous items in the enclosure. Take all of the substrate and porous items out of the enclosure. Place these into a plastic garbage bag and keep it outside until it can be discarded. Make sure it is out of reach from pets. Wood is a porous item that cannot be cleaned adequately and must be removed. [5] X Research source Whether you are getting rid of mites or simply doing a regular complete cleanup, don't reuse any portion of old substrate after it."
    },
    {
      "title": "Vacuum the inside of the enclosure thoroughly.",
      "content": "Vacuum the inside of the enclosure thoroughly. Vacuum the floors and wall of the enclosure. Use the corner attachment to vacuum out the corners. [6] X Research source This will help to remove mites, mite eggs, and mite feces."
    },
    {
      "title": "Mix together a bleach and water solution.",
      "content": "Mix together a bleach and water solution. Use 1 part bleach to every 30 parts water and combine these in a clean bucket. Stir it to combine the water and the bleach. If you use 1 US gal (3.8 L) of water, you will need to use 1 ⁄ 2 cup (120 ml) of bleach. Make sure that you wear gloves when working with bleach."
    },
    {
      "title": "Wash the enclosure with the bleach and water solution.",
      "content": "Wash the enclosure with the bleach and water solution. Use clean rags to wipe down all areas of the enclosure with the bleach solution. Make sure that the area you are working in is well-ventilated. [7] X Research source Disinfecting the enclosure doesn’t kill the mites themselves, but it does kill the harmful organisms that are associated with the mites. The bleach solution may also drown some remaining mites."
    },
    {
      "title": "Rinse the enclosure out with clean water after 10 minutes.",
      "content": "Rinse the enclosure out with clean water after 10 minutes. Let the bleach solution sit in the enclosure for 10 minutes. Then use fresh water and a new clean rag to remove all of the bleach residue. [8] X Research source"
    },
    {
      "title": "Boil any rocks in the enclosure for 20-30 minutes.",
      "content": "Boil any rocks in the enclosure for 20-30 minutes. Place any rocks from the snake enclosure into a large pot. Fill the pot with water so that the rocks are completely submerged. Boil the rocks to kill any mites that may be on or inside them. [9] X Research source"
    },
    {
      "title": "Use a no pest strip inside the enclosure.",
      "content": "Use a no pest strip inside the enclosure. Purchase a no pest strip online or from your local pet store or veterinarian. Follow all of the directions on the label thoroughly by sealing the enclosure and then ventilating it correctly once the no pest strip has been removed. Keep the no pest strip in the enclosure for approximately 3 hours. Never use a no pest strip while your snake is in the enclosure as it can be dangerous for the animal. No pest strips release an insecticide vapor into the enclosure which will kill any remaining mites. [10] X Research source"
    },
    {
      "title": "Set up the enclosure and return the snake.",
      "content": "Set up the enclosure and return the snake. When both the enclosure and the snake have been cleaned, set up the enclosure again with a brand new substrate. Transfer the snake back into the enclosure and check it for mites daily. [11] X Research source Paper towels are often a good substrate to use when you are trying to get rid of snake mites. This is because you will be able to easily spot any additional mites."
    }
  ]
}