{
  "url": "https://www.wikihow.com/Get-Hardwood-in-Stardew-Valley",
  "title": "4 Easy Ways to Get Hardwood Pieces in Stardew Valley",
  "steps": [
    {
      "title": "Cut down Large Stumps.",
      "content": "Cut down Large Stumps. You'll need to use Copper Axe or better. A weaker axe will be unable to cut the wood. Keep in mind that if you have the Forester profession , you'll have a 50% chance to receive one extra piece of Hardwood when harvesting. Large Stumps can be found in the following locations: The Secret Woods : located in the northwest corner of Cindersap Forest. You'll need a Steel Axe to cut down the Large Log blocking the way. Six (6) Large Stumps will respawn daily. Forest Farm : this farm type is chosen at the beginning of the game. You'll have eight (8) large stumps on the west side of the farm that respawn daily. Four-Corners Farm : this farm type is chosen at the beginning of the game. You'll have one large stump in the top-left quadrant of the farm that respawns daily. Hardwood can be used for building, crafting, gifting, or completing the Community Center [1] X Research source"
    },
    {
      "title": "Cut down Large Logs.",
      "content": "Cut down Large Logs. You'll need to use a Steel Axe or better. A weaker axe will be unable to cut the wood. Keep in mind that once these Logs are cut down, they do not respawn . Large Logs can be found in the following locations: The Secret Woods : located in the northwest corner of Cindersap Forest. The Large Log will be blocking the entrance. The Mines : after unlocking Qi's Walnut Room and completing the Danger In The Deep quest, you'll need to activate the Shrine of Challenge to find Large Logs on floors 41-69. [2] X Research source"
    },
    {
      "title": "Cut down Mahogany Trees.",
      "content": "Cut down Mahogany Trees. These trees look similar to Maple Trees and Oak Trees. However, Mahogany Trees have a more square-like shape to their silhouette when fully grown. They can be planted from a Mahogany Seed. You can use any axe to cut down this tree. [3] X Research source You can find Mahogany Trees all over the farm and town. To keep a constant supply, plant any Mahogany Seeds where you chop down the fully grown tree. On average, it takes about 24 in-game days for a tree to reach maturity."
    },
    {
      "title": "Break barrels and boxes in The Mines.",
      "content": "Break barrels and boxes in The Mines. Hardwood can be received as loot when you destroy these objects. It's not guaranteed every time, but this can add up if you're already in The Mines farming for other materials, such as iron ore and clay ."
    },
    {
      "title": "Robin may gift players during Feast of the Winter Star.",
      "content": "Robin may gift players during Feast of the Winter Star. As Stardew's holiday event, Feast of the Winter Star allows players to give a gift to an NPC and receive one in return. If you are gifted by Robin, you may receive 25 Hardwood."
    }
  ]
}