{
  "url": "https://www.wikihow.com/Prune-Lantana",
  "title": "How to Prune Lantana",
  "steps": [
    {
      "title": "Prune your lantana before it blooms for best results.",
      "content": "Prune your lantana before it blooms for best results. Typically, lantana plants bloom through the spring and fall. Trim your plant in the late winter or early spring before it hits the growth period for optimal flower yield. [1] X Research source While you don’t have to prune your lantana plants, it helps them spur new growth and look great in your garden. If you live in the Northern Hemisphere, you can prune your lantana plants in June."
    },
    {
      "title": "Trim the stems of your plant to 6–8 in (15–20 cm) to rejuvenate it.",
      "content": "Trim the stems of your plant to 6–8 in (15–20 cm) to rejuvenate it. If you want to trigger new growth, cut all of the stems to about 6–8 in (15–20 cm). Use pruning shears, and make your cuts at a 45-degree angle. [2] X Research source The fresh cuts encourage the plant to grow new stems and leaves. Cutting your stems at a 45-degree angle helps the plant recover from the wound more quickly and stay healthy."
    },
    {
      "title": "Cut away damaged areas to keep your lantana healthy.",
      "content": "Cut away damaged areas to keep your lantana healthy. If you notice any damaged or decaying areas on your plants due to frostbite or other problems, it is best to remove them while pruning in the spring. To do this, line your pruning shears up to the stem at the start of the discoloration, and make a clean snip at a 45-degree angle. [3] X Research source You can cut the damaged stems down to the ground or leave them between 1 ⁄ 2 –1 ft (0.15–0.30 m), based on your personal preference. If you want a shorter shrub, chop it to the ground. This way, your plant will not waste any valuable nutrients on withered stems."
    },
    {
      "title": "Prune selectively in the summer and fall to shape your plants.",
      "content": "Prune selectively in the summer and fall to shape your plants. If you’d like to shape your lantana plant as it grows, you can cosmetically prune it during the growth season. While this is not required, it helps your plant maintain its shape, fit in the garden bed or container, and look attractive. [4] X Research source Lantana plants grow very quickly, so feel free to trim your plant as you see fit."
    },
    {
      "title": "Remove any fading flowers, withered stems, and unattractive branches.",
      "content": "Remove any fading flowers, withered stems, and unattractive branches. Start at the bottom of your plant and begin trimming away any discolored flowers, brown or yellow stems, and long branches. Use pruning shears to make your cuts. Make your snips along the stem at a 45-degree angle to encourage healthy growth. Work your way around the plant until it looks gorgeous and green rather than faded and droopy. [5] X Research source To remove an entire stem, make your cut at the base of the stem. If removing parts of the plant, cut along the stem in between 2 leaves."
    },
    {
      "title": "Cut your plant down by one-third if it looks unkempt.",
      "content": "Cut your plant down by one-third if it looks unkempt. If your plant looks overgrown, trim around the shrub to get rid of about one-third of its total mass. Make snips around the sides and top of your plant using pruning shears. Snip the stems at a 45-degree angle. Prune your lantana plant until it looks great, based on personal preference. [6] X Research source If you live in the Northern Hemisphere, this likely occurs by September or October. Don't worry about making the shape perfect, as lantanas grow quickly and any uneven areas will soon be filled in. For example, if your lantana is outgrowing its garden bed, snip the plant back so it is contained inside the space."
    },
    {
      "title": "Make small snips around the crown of your plant to clean up the shape.",
      "content": "Make small snips around the crown of your plant to clean up the shape. To do this, smooth the crown of your plant by snipping away long branches, extending leaves, and extra flowers. This keeps your lantana plant looking bush-like and controlled. You can do this once in the late summer or early fall or 1-3 times a month, based on your desired look. Position your shears at a 45-degree angle when you make your cuts. [7] X Research source If you are pruning a vining lantana plant, snip from bottom to top. Pruning vining lantanas helps give them a full, dense appearance."
    }
  ]
}