{
  "url": "https://www.wikihow.com/Open-a-Bostitch-Heavy-Duty-Stapler",
  "title": "How to Open a Bostitch Heavy Duty Stapler",
  "steps": [
    {
      "title": "Set your Bostitch stapler on a hard, flat surface.",
      "content": "Set your Bostitch stapler on a hard, flat surface."
    },
    {
      "title": "Look for the back assembly, sometimes called a pusher.",
      "content": "Look for the back assembly, sometimes called a pusher. On some models this will have a red tab pointing out of the back."
    },
    {
      "title": "Hold the top of the stapler in place with your non-dominant hand.",
      "content": "Hold the top of the stapler in place with your non-dominant hand. Never place your hand under the stapler. [1] X Research source"
    },
    {
      "title": "Use your dominant hand to push in on the back and then pull it up and out.",
      "content": "Use your dominant hand to push in on the back and then pull it up and out. Detach it completely, and the magazine where the staples are placed should be removed as well. [2] X Research source On a Bostitch Heavy Duty EZ Squeeze model, you push the button on the back and the magazine will open in the front. Press the magazine back in to reload. [3] X Research source"
    },
    {
      "title": "Disconnect the hose that applies the pneumatic pressure.",
      "content": "Disconnect the hose that applies the pneumatic pressure."
    },
    {
      "title": "Set the safety on.",
      "content": "Set the safety on. This is usually by the handle. It will not come as an option on all models."
    },
    {
      "title": "Turn the stapler around so that you can see the front, but you aren’t pointing it directly at yourself.",
      "content": "Turn the stapler around so that you can see the front, but you aren’t pointing it directly at yourself."
    },
    {
      "title": "Look for the latch near the front and side or front and bottom.",
      "content": "Look for the latch near the front and side or front and bottom. Pull it down to expose the magazine and reload it. [4] X Research source"
    },
    {
      "title": "Push the magazine back into place.",
      "content": "Push the magazine back into place. Make sure it locks in place before using the stapler again. [5] X Research source"
    }
  ]
}