{
  "url": "https://www.wikihow.com/Remove-a-Painting-from-a-Frame",
  "title": "How to Remove a Painting from a Frame",
  "steps": [
    {
      "title": "Assess the damage to the painting.",
      "content": "Assess the damage to the painting. If serious, you may need to hire a professional restorer."
    },
    {
      "title": "Examine the front and back of the frame.",
      "content": "Examine the front and back of the frame. Determine the method of attachment. Removal is reversal of assembly. [1] X Research source"
    },
    {
      "title": "Note which staples go to which part of the assembly.",
      "content": "Note which staples go to which part of the assembly."
    },
    {
      "title": "Remove staples, nails or screws from back of frame.",
      "content": "Remove staples, nails or screws from back of frame. [2] X Research source It is not necessary to take out the staples holding the stretcher bar itself. Use pliers to remove the staples if they don't come out easily. [3] X Research source Continue around the back of the picture."
    },
    {
      "title": "Carefully wedge in the screwdriver to get a grip on the spline.",
      "content": "Carefully wedge in the screwdriver to get a grip on the spline."
    },
    {
      "title": "Remove the spline from all the way around the painting.",
      "content": "Remove the spline from all the way around the painting."
    },
    {
      "title": "Pull any staples/nails found holding the canvas to the frame, being careful not to rip the canvas material too much.",
      "content": "Pull any staples/nails found holding the canvas to the frame, being careful not to rip the canvas material too much. It may need to be re-attached to another stretcher bar if the current one is not reusable."
    },
    {
      "title": "Gently push the canvas backward or frame forward to separate from each other.",
      "content": "Gently push the canvas backward or frame forward to separate from each other."
    },
    {
      "title": "Slowly poke under the canvas.",
      "content": "Slowly poke under the canvas. [4] X Research source The wood stretcher bar holds the canvas giving it shape. There is a crevice into which the spline used to fit, pinching the canvas taut. This is the same principle a screen door uses."
    },
    {
      "title": "Continue around the edge of the frame/picture.",
      "content": "Continue around the edge of the frame/picture. There may be many years that the canvas has been pressed folded. It is not glued to the wood, but may be stuck slightly."
    },
    {
      "title": "If transporting, carefully roll up around a foam cylinder and place in sturdy carton.",
      "content": "If transporting, carefully roll up around a foam cylinder and place in sturdy carton. [5] X Research source Wrap loosely so paint does not chip and break off."
    }
  ]
}