{
  "url": "https://www.wikihow.com/Can-You-Cite-Chat-Gpt",
  "title": "The Definitive Guide to Citing ChatGPT as a Source",
  "steps": [
    {
      "title": "You can (and should) cite ChatGPT when you use it for research.",
      "content": "You can (and should) cite ChatGPT when you use it for research. The process to cite ChatGPT and other generative AI tools is a little different for each writing style (APA, MLA, Chicago, etc.). It also varies depending on how you used the tool. Before using ChatGPT in your research, make sure you understand your school, organization, or publisher's stance on AI use . Don't use ChatGPT to write your paper and then try to cite it. Only cite ChatGPT when you use the tool to aid in research."
    },
    {
      "title": "ChatGPT responses are not retrievable, so keep a record.",
      "content": "ChatGPT responses are not retrievable, so keep a record. Much like quoting a conversation or exchange, ChatGPT's responses won't be accessible to the person reading your paper. When citing ChatGPT, it's best to save both the prompt you issued and the bot's entire response in a document that you can access later and share if necessary. Now that you can create public links for ChatGPT responses, there's a chance that these links may be required by style guides as retrievable sources. [1] X Research source For now, only MLA has suggested using direct links to ChatGPT responses in citations. Other style guides may follow suit in the future."
    },
    {
      "title": "When to cite ChatGPT.",
      "content": "When to cite ChatGPT. The American Psychological Association is still working on its official guidelines for citing AI chatbots, but they've released interim guidelines in their style blog. [2] X Research source If you used ChatGPT or another AI tool in your research, describe how you used it in your Method section. [3] X Research source If citing ChatGPT in another type of essay, response paper, or literature review, you can describe how you used AI in your introduction. Consider including the full text of ChatGPT's response in your appendix or other supplemental section."
    },
    {
      "title": "Reference page citations.",
      "content": "Reference page citations. On your References page, you'll cite ChatGPT and other AI tools as you would other software. You'll need to include the author/developer, the date you ran the query, the title of the software, and the URL of the tool on your References page. For example: OpenAI. (2023). ChatGPT (June 26 version) [Large language model]. https://chat.openai.com/chat"
    },
    {
      "title": "In-text citations.",
      "content": "In-text citations. As when citing , you'll use the author/developer's name in your citation, as well as the year in which you issued and received the query: Parenthetical citations: (OpenAI, 2023) Narrative citations: OpenAI (2023) You'll want to quote ChatGPT's response similar to how you'd quote a conversation. For example: When prompted with \"Why isn't Pluto a planet?\" the ChatGPT generated text indicated that Pluto does not meet the criteria required by the IAU, as it \"shares its orbit with a number of other small icy bodies in the Kuiper Belt, a region of the solar system beyond Neptune that contains many similar objects\" (OpenAI, 2023)."
    },
    {
      "title": "When to cite ChatGPT.",
      "content": "When to cite ChatGPT. When using the MLA style, you should cite ChatGPT (or your preferred generative AI tool) when you paraphrase, quote, or otherwise incorporate AI-generated content into your paper. When citing ChatGPT in an MLA paper, you'll include the prompt on your Works Cited page, and an abbreviated version of the prompt in your in-text citations. While ChatGPT doesn't have the ability to reliably provide its own citations, Bing Chat does. The MLA Style Center recommends using AI tools that provide sources so you can review them, and then cite the original sources in your paper. [4] X Research source"
    },
    {
      "title": "Works Cited page citations.",
      "content": "Works Cited page citations. On your Works Cited page, instead of beginning the source with an author, begin with the prompt you provided to ChatGPT. You'll also use the Title of Container element to name the AI tool (ChatGPT), the date accessed, the publisher of the tool (OpenAI), and the URL to the tool. Initial prompt: \"How is masculinity portrayed in the book The Great Gatsby by F. Scott Fitzgerald\" prompt. ChatGPT , 13 Feb. version, OpenAI, 26 Jun. 2023, chat.openai.com/chat. Follow-up prompts: \"In 200 words, describe how Jordan Baker subverted gender roles in The Great Gatsby\" follow-up prompt. ChatGPT , 13 Feb. version, OpenAI, 26 Jun. 2023, chat.openai.com/chat. While the MLA Style Center has not updated their documentation since ChatGPT began offering direct links to responses, they do state that, when possible, it's best to include a link to the conversation with ChatGPT. [5] X Research source To generate a link, click Copy Link , then replace the URL in your reference with the one you've generated."
    },
    {
      "title": "In-text citations.",
      "content": "In-text citations. Instead of using an author in your in-text citations, you'll use a very-brief version of your prompt. Using the sources from our Works Cited page as examples: The male characters often express unrelenting desires for control and dominance in their relationships, particularly with women (\"How is masculinity portrayed\"). When asked to describe how Jordan Baker subverted gender roles in The Great Gatsby, ChatGPT stated that her athletic abilities \"challenge the notion that women should be confined to domestic roles or be dependent on men for their success (\"In 200 Words\")."
    },
    {
      "title": "When to cite ChatGPT.",
      "content": "When to cite ChatGPT. The Chicago Manual of Style does not require you to cite ChatGPT when you use its text in your own work. [6] X Research source However, they do provide guidance for students or researchers to create citations in numbered footnotes or endnotes, as well as in in-text citations."
    },
    {
      "title": "Footnotes and endnotes.",
      "content": "Footnotes and endnotes. In Chicago citation style, you should not list ChatGPT in your bibliography or in your reference list. Only include ChatGPT as a source in a footnote or endnote. The citation is simple and only requires the name of the AI tool, the date the response was generated, the name of the developer (OpenAI), and the URL to ChatGPT: If the prompt is included in the text: 1. Text generated by ChatGPT, March 7, 2023, OpenAI, https://chat.openai.com/chat. If the prompt is not included in the text: 1. ChatGPT, response to “How deep is the deepest point in the Atlantic Ocean,” June 26, 2023, OpenAI."
    },
    {
      "title": "In-text citations.",
      "content": "In-text citations. You don't have to use in-text citations when you use ChatGPT, but you should acknowledge that you've used it in your text. For example, \"When asked how deep the deepest part of the Atlantic Ocean is, ChatGPT discussed the Milwaukee Deep, a trench that's approximately 27,480 feet below sea level.\" Alternatively, if you're using author-date citations instead of footnotes and endnotes, you can simply use (ChatGPT, June 26, 2023) instead. Still, you should not add ChatGPT to your bibliography."
    }
  ]
}