{
  "url": "https://www.wikihow.com/Detect-Arrogant-People",
  "title": "How to Identify an Arrogant Person (and How to Handle Them)",
  "steps": [
    {
      "title": "They make every conversation about them.",
      "content": "They make every conversation about them. Next time you’re around them, listen to their conversation. Is it always about them? Do they get mad or irritated if the center of attention moves to someone else? Arrogant people like to be the center of attention, and will steer a conversation so that it always focuses on themselves. [1] X Research source Often, an arrogant person will try to “one-up” someone else’s story, or somehow prove that they’re better than the people around them, even when it’s not a competition. Arrogant people might also try to talk about things they have little knowledge or experience about, just to hear themselves speak."
    },
    {
      "title": "They get upset if you question them or their worldview.",
      "content": "They get upset if you question them or their worldview. Pose a small question about the person’s own view of things, like, “Are you sure?” or, “That doesn’t seem right to me…” Don't be aggressive––just skeptical and curious. Most people are willing to reevaluate their own opinions or perspectives, but arrogant people believe they’re always correct, or that their way is the best way. [2] X Research source An arrogant person will probably get frustrated or angry at your questioning, while other people might be bothered, but not angry. According to Miller, arrogant people easily become defensive, and have little empathy for other people’s feelings. Arrogant people don’t like it when reality doesn’t line up with their fantasy."
    },
    {
      "title": "They have a lot of flimsy or rocky friendships.",
      "content": "They have a lot of flimsy or rocky friendships. Arrogant people often have trouble fostering meaningful relationships. Their need to be superior to others mixed with the way they refuse to see others’ perspectives means their friendships are often unhealthy and unhappy. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If they seem to go through friends quickly, they may be arrogant. At the same time, arrogant people often can't understand why they don't have any reliable and supportive friends, since they don’t believe they’re in the wrong. That said, arrogant people tend to attract friends at first because they seem “cool” or appealing, but those friends eventually learn the truth."
    },
    {
      "title": "They’re always looking down on other people.",
      "content": "They’re always looking down on other people. Arrogant people often need to feel like they’re better than other people, especially those who come from different backgrounds, experiences, or beliefs. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source To them, their experiences are the only good or true ways to live, and everything else isn’t worthy of respect. For example, they might laugh at or belittle another person’s religion or spirituality. They may also insult someone’s career or hobbies. You might ask around to see if they’ve said anything unkind about you or people you know. They may have valid criticisms, or they may have a deeper dislike that suggests insecurity and arrogance."
    },
    {
      "title": "They’re manipulative, or overly controlling.",
      "content": "They’re manipulative, or overly controlling. Arrogant people often try to stay “on top” at the expense of others. They might get other people to do things that aren’t in their best interest, or they might try to sabotage others so that they look bad, while the arrogant person gets to look good, or even save the day. It’s all about maintaining a good appearance. [5] X Research source Many arrogant people have a false charm that no one seems to see through. But the arrogant person is usually more than happy to show their cruel side to those that they don't like. When they are cruel, their friends will usually ignore it or not do anything to stop it since they're afraid that they'll be treated badly by their \"friend.\""
    },
    {
      "title": "They blame other people for their own mistakes.",
      "content": "They blame other people for their own mistakes. Arrogant people hate to be wrong. It means that they’re not perfect, and if they’re not perfect, then they’re just like everyone else. [6] X Research source Often, when an arrogant person makes a mistake, they’ll try to pin the blame on someone else, so that the other person takes the fall, and the arrogant person gets to keep looking perfect. Or, they might try to convince you that it wasn’t actually a mistake, or that it’s not as bad as it seems."
    },
    {
      "title": "They give unsolicited advice.",
      "content": "They give unsolicited advice. Arrogant people love to be the authority on things, even when they don’t have much experience themselves. It makes them look wise. That’s why they often give you tips or instructions, even when you didn’t ask for it, or didn’t need it. It’s most frustrating when you tell you to do something you’re already doing, which makes it look like you’re proving them right."
    },
    {
      "title": "They’re never humble about anything.",
      "content": "They’re never humble about anything. Usually, when you do something well or receive an award, you practice a little humility so that people don’t think you have a big ego. But arrogant people don’t want to be humble, they want to be the best. [7] X Research source They won’t accept losing or being wrong, and when they win, they act like it was inevitable."
    },
    {
      "title": "They always act cold or detached.",
      "content": "They always act cold or detached. Arrogant people often see themselves as “too cool to care.” For example, if you’re gushing about a book or movie you like, they’ll say they didn’t like it, just because they’re afraid of looking too passionate or genuine. This makes it hard for them to make real connections with other people, or to empathize. It also means they’re not very invested in the lives of other people. They don’t want it to seem like they care too much."
    },
    {
      "title": "They act like they deserve more than other people.",
      "content": "They act like they deserve more than other people. Arrogant people often think they should be able to cut lines, take bigger portions, or get paid more than others. They feel that because they’re superior, they shouldn’t have to do things the way regular people do things, so they’re always demanding extra attention or better service than the rest of us. They also act mortified when they’re denied special treatment. [8] X Research source"
    },
    {
      "title": "Set clear boundaries, and don’t tolerate being mistreated.",
      "content": "Set clear boundaries, and don’t tolerate being mistreated. Johartchi tells us that a lot of arrogant people refuse to self-reflect, and that often the best course of action is to accept that and set boundaries. Firm boundaries protect your own dignity, and communicate to the arrogant person that you won’t tolerate disrespect. For example, if the arrogant person starts to talk down to you or insult you, walk away, or say, “I won’t speak with you until you learn to respect me as an equal.” Or, if they insist that you do something their way, you might say, “This is my job, and I know what I’m doing. If you have a problem, you can talk to the boss.”"
    },
    {
      "title": "Act unimpressed or ignore them when they boast.",
      "content": "Act unimpressed or ignore them when they boast. It can be tempting to buy into an arrogant person’s grandiose fantasies, but the next time they start talking about how great they are, don’t budge! [9] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Take care not to give them too much praise, which is what they’re looking for. Instead, say something polite, like “That’s great! I’m happy for you,” then change the subject of the conversation."
    },
    {
      "title": "Moderate conversations when you’re in a group with them.",
      "content": "Moderate conversations when you’re in a group with them. Arrogant people love to be the center of attention, and often dominate conversations with bragging or boasting. [10] X Research source When speaking in a group with them, make sure to include other people and ask them specific questions, so that the arrogant person isn’t the only one talking. If the arrogant person interrupts or tries to change the subject, say, “One moment, I want to hear more from Jane. She was saying something I find very interesting.”"
    },
    {
      "title": "Take pride in your own accomplishments.",
      "content": "Take pride in your own accomplishments. Arrogant people often put others down in order to stay on top, and they’ll probably do it to you, too. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Protect your own self-esteem by reminding yourself that your ideas and accomplishments have worth, and are something you should be proud of. In fact, if an arrogant person is rude about your own ideas or achievements, it probably means that they feel threatened by them, which is a sign that you should feel especially proud."
    },
    {
      "title": "Be compassionate, even to the arrogant person.",
      "content": "Be compassionate, even to the arrogant person. Miller tells us to not be judgmental of arrogant people, or you risk having as negative an outlook as they do. Arrogant people are often trying to hide certain vulnerabilities and fears. Most of the time, the need for a strong and unquestionable self-image comes out of deeply rooted pain. Stay patient , and remind yourself that an arrogant person is still a person. If you like, give the arrogant person praise for something that’s real and notable, like a good deed. Sometimes, all they need is to be reminded that they don’t need to posture to be recognized. Arrogant people might have other problems you don’t realize, like personality disorders or a traumatic past. It’s not your responsibility to solve these, but you should stay civil and empathetic."
    },
    {
      "title": "Practice active listening.",
      "content": "Practice active listening. Arrogant people often struggle to listen to others and appreciate their stories, input, or merits. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Practicing active listening can help you absorb and internalize what other people are telling you, without talking over them or dismissing their words. Maintain eye contact and focus your attention on the person. Ask them questions about what they’re saying, and repeat it back to them to make sure you understand. Only offer your own opinion or perspective once they’re finished."
    },
    {
      "title": "Take time to consider new perspectives.",
      "content": "Take time to consider new perspectives. It’s often hard for arrogant people to accept criticism, or to have empathy for other people. [13] X Research source Expand your mind by talking to a diverse range of people. Then, if someone offers a tip, or does something you don’t understand, take a moment to clear your mind before you react: Ask yourself if what they said was meant to hurt you, or if they’re trying to help. Remind yourself that just because you’d do something a certain way, it doesn’t mean it’s the best way for another person to do it."
    },
    {
      "title": "Congratulate others, and stay humble.",
      "content": "Congratulate others, and stay humble. Arrogant people tend to belittle or ignore other people’s accomplishments because they feel threatened by other people’s success. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source When a friend or coworker finds success, resist the urge to critique or criticize. Instead, tell them you’re happy for them! You might even stay humble by asking for advice or pointers. Another way to practice humility is to thank other people for their contributions when you find your own success. For example, if you’re telling a story about winning a medal, you could say, “But I couldn’t have done it without my friend, who cheered me on the whole time.”"
    }
  ]
}