{
  "url": "https://www.wikihow.com/Kiss-Your-Boyfriend-at-School",
  "title": "How to Kiss Your Boyfriend at School",
  "steps": [
    {
      "title": "A quick coat of lip balm can help your lips look irresistible.",
      "content": "A quick coat of lip balm can help your lips look irresistible. Lip balm is a lot less messy than lip gloss, and will keep your lips soft and perfectly kissable. [1] X Research source Stash a tube or tin of your favorite lip balm in your school bag so you can be ready for just about anything. Gloss can definitely highlight your lips, but it’ll make for a pretty messy kiss. If you’re a big lip gloss fan, wipe it off before going for a smooch."
    },
    {
      "title": "Mints are a must if you plan on locking lips.",
      "content": "Mints are a must if you plan on locking lips. Before meeting up with your boyfriend, suck on a mint or chew a minty piece of gum first. Whatever you do, stay away from any especially smelly foods, like garlic, processed cheese, and onions. [2] X Research source If you usually see your beau right after class, grab a piece of spearmint gum 5-10 minutes before the bell rings."
    },
    {
      "title": "Choose a time when both you and your beau can sneak out of class.",
      "content": "Choose a time when both you and your beau can sneak out of class. Instead of going to the bathroom, meet your BF in a secret spot like an empty stairwell or isolated hallway. Enjoy 5-7 minutes of quality time with your man before heading back to class. After all, you don’t want your teacher to get suspicious! [3] X Research source Try to plan your break when you and your BF are in nearby classrooms. Your “bathroom break” won’t be very worthwhile if you spend most of it hiking across the school."
    },
    {
      "title": "You don’t want a teacher or student ruining the moment.",
      "content": "You don’t want a teacher or student ruining the moment. Try finding an empty classroom before classes start. Then scope out a corner of the room that will keep you far away from any prying eyes. If any students or teachers walk in, pretend that you’re having a conversation or studying for an upcoming test. [4] X Research source Take a few days to scope out different classrooms before settling on a meeting spot. It could get pretty awkward if some students start filing in!"
    },
    {
      "title": "Plan a time to meet before school starts.",
      "content": "Plan a time to meet before school starts. Chances are, no one’s going to be lurking behind the building when you and your BF get together. While you smooch, keep an eye on the clock so you don’t miss your first class! [5] X Research source While one-on-one time with your BF is great, it’s not worth getting in trouble over! If the back of your school is off-limits, pick a different place to meet up."
    },
    {
      "title": "This is a great option if you and your BF live in the same neighborhood.",
      "content": "This is a great option if you and your BF live in the same neighborhood. Try grabbing a seat toward the back of the bus, so fewer people can walk past and interrupt the moment. Just don’t forget to get off at your stop! [6] X Research source"
    },
    {
      "title": "Enjoy some alone time in the parking lot before school starts.",
      "content": "Enjoy some alone time in the parking lot before school starts. If you or your boyfriend drive to school, turn it into a date! Carpool to school together and stay in the car for a little bit. Then, kiss your BF to your heart’s content without any fear of getting caught! [7] X Research source"
    },
    {
      "title": "It’s not the best hiding place, but it can work in a pinch.",
      "content": "It’s not the best hiding place, but it can work in a pinch. Before you and your BF enter school for the day, sneak behind a thick, bushy tree for some alone time. It’s not an ideal kissing spot, but it can get the job done if you don’t want to risk smooching in the halls. [8] X Research source The tree has to be thick enough to hide both you and your beau. If the trunk is too thin, you won’t be fooling anybody."
    },
    {
      "title": "Some couples aren’t fans of smooching in public.",
      "content": "Some couples aren’t fans of smooching in public. That’s okay! If you and your bae aren’t big on PDA, try kissing him somewhere other than his lips. You could give him a quick peck along the tip of his nose, or plant a kiss in the middle of his forehead. Behind the earlobe is another subtle place you can try. [9] X Research source While it can be really fun to try out new kisses, keep your setting in mind, too. For instance, a peck on the cheek and nose could be appropriate in the halls, while a smooch on the jaw or neck is better left for your alone time."
    }
  ]
}