{
  "url": "https://www.wikihow.com/Get-Cat-Urine-Out-of-a-Mattress",
  "title": "How to Get Cat Urine Out of a Mattress",
  "steps": [
    {
      "title": "Absorb excess wet urine.",
      "content": "Absorb excess wet urine. When you discover a fresh marking that’s still wet, grab a couple of old towels and press them firmly into the mattress to absorb as much of the urine as possible. Replace the towels with dry ones as needed. You know you’ve absorbed as much as possible when towels come away dry. [1] X Research source Launder the towels immediately to remove the urine and get rid of the smell, otherwise the cat may mark again. Use paper towels if you don't want to get cat urine on your towels."
    },
    {
      "title": "Take the mattress outside.",
      "content": "Take the mattress outside. When the weather is mild enough and it’s not raining, take the mattress outside if you can. This will make it easier to soak the mattress with water and cleaner, and speed up the drying process. Place the mattress on a clean surface, such as a picnic table or patio. To protect the mattress from dirt, lay down a large plastic sheet before you put down the mattress."
    },
    {
      "title": "Protect the box spring if you cannot move the mattress.",
      "content": "Protect the box spring if you cannot move the mattress. When the weather is too cold, snowing, or raining, leave the mattress in place on the bed. Lay down a large plastic sheet between the mattress and the box spring. Place one or two folded towels between the mattress and box spring underneath the affected area on the mattress. The towels and plastic will help protect the box spring and the floor below from water damage."
    },
    {
      "title": "Soak the area with water.",
      "content": "Soak the area with water. Fill a bucket with about 4 cups (940 ml) of room temperature water. Pour the water on the affected area of the mattress. [2] X Research source Concentrate the water on the affected area as much as possible without soaking the rest of the mattress. Dousing the area with water will dilute the urine and reduce the smell."
    },
    {
      "title": "Absorb excess moisture with towels.",
      "content": "Absorb excess moisture with towels. Once you’ve thoroughly soaked the area with a bucketful of water, grab some fresh towels. Lay a couple of fresh towels over the wet area and press them into the mattress. Replace them with dry towels as necessary, until the towels come away dry. [3] X Research source Like before, place the soiled towels in the laundry immediately. Replace the towels underneath the mattress with dry ones."
    },
    {
      "title": "Choose a cleaner.",
      "content": "Choose a cleaner. There are a few different products you can try when it comes to removing cat urine from a mattress. Enzyme cleaners are specifically designed to break down organic matter like urine and blood. Use about ½ to a full cup (118 to 235 ml) of cleaner, depending on the size of the stain. You can also try a mixture of household cleaning products such as: [4] X Research source ¼ to ½ cup (59 to 118 ml) vinegar mixed with equal parts water (depending on the size of the stain ¼ to ½ cup (59 to 118 ml) hydrogen peroxide mixed with equal parts water and 1 teaspoon (5 ml) laundry detergent or stain remover Reader Poll: We asked 353 wikiHow readers what their go-to cleaning product is for removing cat spray odor, and 57% said a homemade natural cleaning solution. [Take Poll]"
    },
    {
      "title": "Saturate the stain with cleaner.",
      "content": "Saturate the stain with cleaner. Slowly pour the cleaner over the affected area, making sure you cover the entire stain. If you're using a cleaner in a spray bottle, remove the spray nozzle and pour the cleaner directly onto the stain. Spraying cleaner with a spray bottle will not penetrate the stain deeply enough, and won’t remove all the urine. [5] X Research source"
    },
    {
      "title": "Let the cleaner soak in.",
      "content": "Let the cleaner soak in. Leave the cleaner to soak into the mattress for 15 minutes. This will give the cleaner time to work its way down into the mattress, penetrate the stain, and help break down the urine. [6] X Research source"
    },
    {
      "title": "Absorb excess cleaner with towels.",
      "content": "Absorb excess cleaner with towels. After 15 minutes, take a couple of fresh towels and lay them over the stain on the mattress. Press them into the mattress to absorb excess cleaner, water, and urine. Continue blotting until you’ve absorbed all the moisture you can. Launder the dirty towels immediately."
    },
    {
      "title": "Sprinkle on some baking soda.",
      "content": "Sprinkle on some baking soda. Sprinkle about ½ cup (110 g) of baking soda over the wet area. This will help draw out more moisture, and pull urine and cleaner odors out of the mattress. [7] X Research source"
    },
    {
      "title": "Allow the remaining cleaner to air dry.",
      "content": "Allow the remaining cleaner to air dry. Letting the cleaner air dry in the mattress will give it the best chance of breaking down the urine and cleaning the mattress. [8] X Research source If you were able to take your mattress outside, leave it out to dry in a covered and protected area where it won’t get dirty or wet from rain. Inside, set up a fan and point it at the mattress to help speed up the drying time. The mattress may take two to three days to dry completely. To sleep on the mattress before it’s dry, cover the affected area with one or two towels, followed by a plastic bag. Make the bed as usual. Remove the towels in the morning to let the mattress continue air drying."
    },
    {
      "title": "Sweep or brush, the area to remove baking soda.",
      "content": "Sweep or brush, the area to remove baking soda. Do NOT vacuum it up. Baking soda will pass through your vacuum's filters and end up in the motor. And then your vacuum will eventually die. When the baking soda has clumped together and absorbed all the liquid it can, use a brush or broom to clean it off the mattress. If the mattress is still wet, you can add more baking soda to keep drawing out moisture and odors."
    },
    {
      "title": "Take a trip to the vet to address medical issues.",
      "content": "Take a trip to the vet to address medical issues. A medical problem could be causing your cat to urinate somewhere other than the litter box. To eliminate this possibility, and to treat your cat if something is wrong, take your pet to the vet and tell the vet your cat urinated outside the litter box. Possible medical causes for this include: [9] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Diabetes Arthritis pain Bladder or kidney stones Urinary tract infections Hyperthyroidism"
    },
    {
      "title": "Reduce your cat’s stress levels.",
      "content": "Reduce your cat’s stress levels. Anxiety is another common problem that could cause your cat to urinate outside of the litter box. There are lots of things that can stress cats out, but if anxiety is the problem, you will have to help calm your cat to prevent this from happening again. Common causes of feline stress and anxiety are: [10] X Research source New additions to the family, such as a new baby or another pet. If this is the case, give your cat a safe space to retreat to and work on reintroducing the newcomer and the cat again. Other cats or animals roaming outside your house. In that case, keep your cat inside, and take measures to deter the other animals from coming around. Diet can also cause cat stress, especially if your cat is on a restrictive diet. Talk to your vet about the best course of action if you suspect diet is the problem. Not enough play time or attention. While cats are solitary creatures, they still need attention. Dedicate time each day to playing with, brushing, and petting your cat."
    },
    {
      "title": "Provide your cat with an extra litter box.",
      "content": "Provide your cat with an extra litter box. A good rule of thumb is to have one litter box per cat in the house, plus an extra. [11] X Research source This can be especially important if your cat is older, has trouble getting to the bathroom quickly, or is starting to have trouble with stairs. In that case, make sure there's a litter box on each level of the house. Place a litter box in two of the cat’s favorite rooms if your house has one floor."
    },
    {
      "title": "Clean the litter box more often.",
      "content": "Clean the litter box more often. Cats are very clean animals, and they may stop using their litter boxes if the boxes aren't cleaned out often enough. Some cats will even refuse to use the litter box unless it’s cleaned out after each use. You should be scooping the litter box once a day, and clumping litter should be changed out every two to three weeks. [12] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Consider a litter box with shorter sides for an older cat.",
      "content": "Consider a litter box with shorter sides for an older cat. Older cats can get joint pain and arthritis. When it comes to using a litter box with high sides, getting in and out and using the box can be painful. Try a litter box with shorter sides and see if that makes a difference. [13] X Research source"
    },
    {
      "title": "Keep your cat out of the bedroom.",
      "content": "Keep your cat out of the bedroom. One of the simplest solutions for stopping your cat from urinating on the bed is to keep the cat out of the bedrooms. This is especially important if you're allergic to your cat, since urine is one of the triggers for allergies. [14] X Research source Pay attention to whether the cat starts to mark elsewhere, however. Preventing the cat from getting into your room may stop it from urinating on the bed, but it may start to mark somewhere else, especially if the underlying cause wasn’t addressed."
    },
    {
      "title": "Install plastic mattress covers.",
      "content": "Install plastic mattress covers. These are great for keeping your mattress safe from all sorts of spills, including urine, beverages, and other liquids that could stain and cause bad odors. The plastic covers are like fitted sheets that go over top of the mattress, and then you make the bed as usual over the plastic sheet. If your cat does urinate on the mattress again, strip the bed, launder the sheets, and use an all-purpose cleaner and a cloth to wipe the plastic."
    }
  ]
}