{
  "url": "https://www.wikihow.com/Make-Ojibwe-Style-Frybread",
  "title": "How to Make Ojibwe Style Frybread",
  "steps": [
    {
      "title": "Pour flour into one of the medium sized bowls.",
      "content": "Pour flour into one of the medium sized bowls. Push flour to the sides of the bowl making a hole in the middle, the hole in the flour will imitate another bowl."
    },
    {
      "title": "Mix milk with water and microwave for two minutes.",
      "content": "Mix milk with water and microwave for two minutes. Pour into the flour bowl."
    },
    {
      "title": "Add yeast or baking powder and let stand for 3 or 4 minutes, so the yeast can mix with the liquid.",
      "content": "Add yeast or baking powder and let stand for 3 or 4 minutes, so the yeast can mix with the liquid."
    },
    {
      "title": "Add sugar and salt.",
      "content": "Add sugar and salt."
    },
    {
      "title": "Start mixing slowly pulling in small amounts of the flour.",
      "content": "Start mixing slowly pulling in small amounts of the flour."
    },
    {
      "title": "Make sure not to let any lumps of flour be present in the mixture",
      "content": "Make sure not to let any lumps of flour be present in the mixture Mix until too thick to mix with spoon or whisk."
    },
    {
      "title": "Use hands to mix in remaining flour into developing bread.",
      "content": "Use hands to mix in remaining flour into developing bread."
    },
    {
      "title": "Oil the sides of the 2nd medium sized bowl and transfer dough.",
      "content": "Oil the sides of the 2nd medium sized bowl and transfer dough."
    },
    {
      "title": "Knead for 1 to 2 minutes (do not over knead).",
      "content": "Knead for 1 to 2 minutes (do not over knead)."
    },
    {
      "title": "Let dough rise for 1 to 2 hours or until it rises to a considerable amount close to double its size (covering the bowl of dough with a towel helps the process).",
      "content": "Let dough rise for 1 to 2 hours or until it rises to a considerable amount close to double its size (covering the bowl of dough with a towel helps the process)."
    },
    {
      "title": "Fill medium sized skillet halfway with cooking oil and heat on medium-high heat",
      "content": "Fill medium sized skillet halfway with cooking oil and heat on medium-high heat Throw in a small piece of dough to make sure the cooking oil is ready to fry in."
    },
    {
      "title": "Be careful to not start a fire!",
      "content": "Be careful to not start a fire!"
    },
    {
      "title": "Grease your hands because dough will be sticky.",
      "content": "Grease your hands because dough will be sticky."
    },
    {
      "title": "Tear a chunk off your dough then start pancaking (like making a hamburger patty) and stretching into a circular shape.",
      "content": "Tear a chunk off your dough then start pancaking (like making a hamburger patty) and stretching into a circular shape."
    },
    {
      "title": "Then tear a small hole in the middle to be sure the middle cooks.",
      "content": "Then tear a small hole in the middle to be sure the middle cooks."
    },
    {
      "title": "Fry bread pieces may be whatever size you would like.",
      "content": "Fry bread pieces may be whatever size you would like."
    },
    {
      "title": "Place dough in the oil and cook until golden brown.",
      "content": "Place dough in the oil and cook until golden brown. Flip and repeat on the other side until done."
    },
    {
      "title": "Enjoy your bread, top with butter, sugar, honey or good old fashioned taco meat with cheese, lettuce, tomatoes (onions & sour cream optional) to make a famous Indian Taco",
      "content": "Enjoy your bread, top with butter, sugar, honey or good old fashioned taco meat with cheese, lettuce, tomatoes (onions & sour cream optional) to make a famous Indian Taco"
    }
  ]
}