{
  "url": "https://www.wikihow.com/Freeze-Cells-in-Excel",
  "title": "3 Easy Ways to Freeze Panes to Lock Columns or Rows in Excel",
  "steps": [
    {
      "title": "Open a project in Microsoft Excel.",
      "content": "Open a project in Microsoft Excel. You can open an existing project or create a new spreadsheet . Microsoft Excel is available on Windows and Mac. You can also use the online web version at https://www.office.com/ . You can use Excel to make tables , type formulas , and more."
    },
    {
      "title": "Click the View tab.",
      "content": "Click the View tab. It's at the top of Excel. Frozen cells are rows or columns that remain visible while you scroll through a worksheet. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you want column headers or row labels to remain visible as you work with large amounts of data, you'll likely find it helpful to lock those cells into place. Only whole rows or columns can be frozen. It is not possible to freeze individual cells."
    },
    {
      "title": "Click the Freeze Panes button.",
      "content": "Click the Freeze Panes button. It's in the \"Window\" section of the toolbar. A drop-down menu will open with a set of three freezing options. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Freeze Top Row or Freeze First Column.",
      "content": "Click Freeze Top Row or Freeze First Column . If you want to keep the top row of cells in place as you scroll down through your data, select Freeze Top Row . To keep the first column in place as you scroll horizontally, select Freeze First Column ."
    },
    {
      "title": "Unfreeze your cells.",
      "content": "Unfreeze your cells. If you want to unlock the frozen cells and scroll normally, click the Freeze Panes menu again and select Unfreeze Panes . [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Open a project in Microsoft Excel.",
      "content": "Open a project in Microsoft Excel. You can open an existing project or create a new one."
    },
    {
      "title": "Select the row or column after those you want to freeze.",
      "content": "Select the row or column after those you want to freeze. If the data you want to keep stationary takes up more than one row or column, click the column letter or row number after those you want to freeze. For example: [4] X Research source If you want to keep rows 1, 2, and 3 in place as you scroll down through your data, click row 4 to select it. If you want columns A and B to remain still as you scroll sideways through your data, click column C to select it. Frozen cells must connect to the top or left edge of the spreadsheet. It's not possible to freeze rows or columns in the middle of the sheet."
    },
    {
      "title": "Click the View tab.",
      "content": "Click the View tab. It's at the top of Excel. [5] X Research source"
    },
    {
      "title": "Click the Freeze Panes button.",
      "content": "Click the Freeze Panes button. It's in the \"Window\" section of the toolbar. A drop-down menu will open with a set of three freezing options. [6] X Research source"
    },
    {
      "title": "Click Freeze Panes on the menu.",
      "content": "Click Freeze Panes on the menu. It's at the top of the menu. This freezes the columns or rows before the one you selected. [7] X Research source When you scroll, those columns or rows will be frozen in place."
    },
    {
      "title": "Unfreeze your cells.",
      "content": "Unfreeze your cells. If you want to unlock the frozen cells, click the Freeze Panes menu again and select Unfreeze Panes . [8] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Open a project in the Microsoft Excel app.",
      "content": "Open a project in the Microsoft Excel app. The app looks like an x on top of a green rectangle. Microsoft Excel is available on iOS and Android."
    },
    {
      "title": "Tap Home.",
      "content": "Tap Home . If you don't see the menu, tap the icon of the A in front of a pencil."
    },
    {
      "title": "Tap View.",
      "content": "Tap View . This is at the bottom of the pop-up menu."
    },
    {
      "title": "Tap Freeze Top Row or Freeze First Column.",
      "content": "Tap Freeze Top Row or Freeze First Column . If you want to keep the top row of cells in place as you scroll down through your data, select Freeze Top Row . To keep the first column in place as you scroll horizontally, select Freeze First Column ."
    },
    {
      "title": "Unfreeze your cells.",
      "content": "Unfreeze your cells. If you want to unlock the frozen cells, tap Freeze Top Row or Freeze First Column again to remove the checkmark."
    },
    {
      "title": "Freeze multiple columns or rows (optional).",
      "content": "Freeze multiple columns or rows (optional). If the data you want to keep stationary takes up more than one row or column, tap the column letter or row number after those you want to freeze. For example: If you want to keep rows 1, 2, and 3 in place as you scroll down through your data, tap row 4 to select it. If you want columns A and B to remain still as you scroll sideways through your data, tap column C to select it. Frozen cells must connect to the top or left edge of the spreadsheet. It's not possible to freeze rows or columns in the middle of the sheet. Once selected, tap Home . Tap View . Tap Freeze Panes . This freezes the columns or rows before the one you selected. To unfreeze, tap Freeze Panes again to remove the checkmark."
    }
  ]
}