{
  "url": "https://www.wikihow.com/Blend-Colors-in-Photoshop",
  "title": "How to Blend Colors in Photoshop",
  "steps": [
    {
      "title": "Customize your brush tool (optional).",
      "content": "Customize your brush tool (optional). Select the brush or pencil tool in the Tools panel on the left. Open the Brushes palette using the Window → Brushes command in the top menu, or by clicking the icon that looks like a piece of paper, in the top options bar. Adjust the size and shape of your brush tool to suit your current project. Sticking to the default brush is fine if you're new to Photoshop. You'll soon realize if your brush is too large or too small, and you can always return to this menu to make changes. Choose \"hard edge\" for precise control over what you affect, or \"soft edge\" for a brush with a more diffuse edge."
    },
    {
      "title": "Find the blend modes options.",
      "content": "Find the blend modes options. When you have the brush or pencil tool selected, you can change the blend mode using a drop-down menu in the top options bar. Each of these modes uses a different formula to mix new color into the existing color on the canvas. The most common options are explained below. In some versions of Photoshop, you may be able to alter the blend mode from the brushes palette. Older versions of Photoshop may not have every blend mode available."
    },
    {
      "title": "Choose the Normal mode to keep colors separate.",
      "content": "Choose the Normal mode to keep colors separate. In Normal mode, Photoshop won't blend colors at all. When using the Brush tool, the blend color will completely cover the base color. When the Edit tool is used, the edit value overrides the existing color. You probably won't be using this for your blend, but it's good to understand how the default blend mode works. This is called Threshold when working with a bitmap or indexed-color image. [1] X Research source In this case, the resulting color will be the closest possible match available in the color map."
    },
    {
      "title": "Blend in Overlay mode.",
      "content": "Blend in Overlay mode. This very popular blending mode makes light areas lighter and dark areas darker. [2] X Research source The end result is a picture with more significant highlights and shadows, and fixes issues with over- and under-exposure. If you're interested in the technical details, this uses the Multiply and Screen formulas, described below."
    },
    {
      "title": "Darken the base color.",
      "content": "Darken the base color. There are several ways to darken colors, each of which works a bit differently: In Darken mode, each pixel's red, green, and blue value gets compared to the new color you're adding. For each of the three comparisons, the darkest value ends up in the final image. In Multiply mode, each brush stroke will \"multiply\" the new color and base color's brightness. You can keep adding brush strokes, making the result darker each time. Darker Color mode works similarly to Darken, except it compares the two pixels as a whole instead of looking at RGB values. Each pixel will either remain the old color, or be replaced by the new, whichever is darker. Linear Burn mode darkens all colors, but tends to produce more blacks and extra-dark color areas than other modes. [3] X Research source Color Burn is similar to linear burn for dark colors, but has a less pronounced effect on light colors. It may result in greater contrast and saturation."
    },
    {
      "title": "Lighten the image.",
      "content": "Lighten the image. Each method of darkening a color has a corresponding opposite formula for lightening: In Lighten mode, the red, green, and blue values of the base color and blend colors are compared. Lighter values of the blend color are used to lighten the image. Use Screen mode to makes anything darker than white less visible. Use Lighter Color to replace darker areas completely with the blend color. Linear Dodge (Add) adds the values of the two colors together. If either color is white, the result will be completely white. If either color is black, there will be no change. [4] X Research source Color Dodge has a lesser effect on darker colors, leading to greater contrast."
    },
    {
      "title": "Modify the foreground and background colors.",
      "content": "Modify the foreground and background colors. The Behind and Clear modes are available in layered images. If the Behind mode is chosen, a color will be applied behind the layer and show only in transparent areas. The Clear mode is essentially an eraser, making all pixels in front of the background transparent."
    },
    {
      "title": "Adjust brightness with Difference mode.",
      "content": "Adjust brightness with Difference mode. This will compare the brightness values of the base and blend colors, creating a result value by subtracting the smaller from larger values. This will bring the brightness closer to the blend color, whether it is darker or lighter than the base color."
    },
    {
      "title": "Cancel out colors with Subtract or Divide.",
      "content": "Cancel out colors with Subtract or Divide. Mathematically, these do exactly what you'd expect to the two color values. In practice, this means that similar colors move toward black when using Subtract, and move toward white when using Divide. [5] X Research source"
    },
    {
      "title": "Scatter the colors with Dissolve mode.",
      "content": "Scatter the colors with Dissolve mode. This is mostly used for special effects, not for touching up a photo. The blended color will look scattered or jagged instead of transitioning smoothly. Try this for an old-fashioned effect. [6] X Research source"
    },
    {
      "title": "Adjust specific values.",
      "content": "Adjust specific values. The remaining modes have a more narrow effect. Each of these replaces one value of the base color with the corresponding value of the blend color. All other characteristics remain the same. Hue (for example, a particular type of red) Saturation (low saturation looks more grey, while higher saturation looks more vivid) Luminance (how bright or dim the color looks)"
    },
    {
      "title": "Add color to black and white images.",
      "content": "Add color to black and white images. The Color mode replaces both hue and saturation with the blend color's values, leaving the luminance of the base color the same. This is often used to add color to black and white images."
    },
    {
      "title": "Try the gradient blend.",
      "content": "Try the gradient blend. Look for the Bucket Fill tool in your Tools panel. Click and hold until tool options appear. Select \"gradient,\" then click on the gradient bar at the top. Adjust the hues and values as desired. Select an area using the Lasso or Magic Wand tools, then apply the gradient by clicking and dragging. The result is a smooth transition between two colors."
    },
    {
      "title": "Duplicate and erase.",
      "content": "Duplicate and erase. Make a copy of the layer or area you're trying to adjust. Past it on a new layer above the original. Select an eraser tool with soft, diluted edges and a soft opacity blend between 5 and 20%. Gradually erase the top layer until you've achieved the desired effect."
    },
    {
      "title": "Set layer opacity.",
      "content": "Set layer opacity. If you have two or more layers you'd like to overlap, adjust the opacity slider above each layer name. This controls how transparent each layer is."
    },
    {
      "title": "Adapt blend settings to your tablet.",
      "content": "Adapt blend settings to your tablet. Choose a brush and find the tablet options in the brush settings panel. Enable \"transfer\" and set the brush to adjust opacity depending on the pressure you apply to your tablet. You can use this with any shape and type of brush, but there are great custom options from online brush makers that provide a milky or oily feel. Once you've selected your transfer brush, just select the color you'd like to blend in and stroke lightly over the base image."
    },
    {
      "title": "Adjust with a smudge tool.",
      "content": "Adjust with a smudge tool. Select the smudge tool in the Tools panel, represented by a finger icon. In your brush panel, select a soft, round smudge tool, and turn up scattering to about 20%. Smudge together colors near the border a painting-like transition. You may need to play with the smudge strength value on the top bar to get the desired effect."
    },
    {
      "title": "Create a mask blend.",
      "content": "Create a mask blend. Place one color over the other, on two layers. Click the New Layer Mask button in the Layers panel, next to the top layer. Select the mask and apply a white to black gradient within the mask. The 100% black area will display only the lower layer, and the 100% white area will display only the upper layer."
    },
    {
      "title": "Cover with a blur filter.",
      "content": "Cover with a blur filter. Select the border area you'd like to blend. Navigate to Filter → Blue → Gaussian blur on the top menu. Adjust the slider to taste. To repeat this, select additional areas with the Lasso tool, then press Ctrl + F to apply the same filter. Use command + F instead on a Mac."
    },
    {
      "title": "Blur vector images together.",
      "content": "Blur vector images together. If you are using vector graphics, create two vector shapes of different colors. Alter the properties to add a feather radius. The shapes will blur along the edges, blending wherever they are near each other. Increase the feather radius value for a greater effect."
    },
    {
      "title": "Imitate paint effects with the mixer brush.",
      "content": "Imitate paint effects with the mixer brush. Select the Mixer Brush from the Tools panel, represented by a paintbrush and drop of paint. (In some versions, you may need to hold down the Brush icon to reveal this option.) Visit the Brush settings menu to check out several new options. Each of these will imitate a painter's techniques, such as dragging two colors of wet paint together."
    }
  ]
}