{
  "url": "https://www.wikihow.com/Cook-Taba-Ng-Talangka",
  "title": "How to Cook Taba Ng Talangka",
  "steps": [
    {
      "title": "Heat up 1 US tbsp (15 ml) of extra-virgin olive oil in a medium skillet.",
      "content": "Heat up 1 US tbsp (15 ml) of extra-virgin olive oil in a medium skillet. Measure out the oil and pour it in the skillet. Swirl the oil around the skillet until it coats the bottom. Turn the burner on to medium-high and place the skillet over it. [1] X Research source Heat the oil until it begins to shimmer."
    },
    {
      "title": "Add the minced garlic and taba ng talangka to the skillet.",
      "content": "Add the minced garlic and taba ng talangka to the skillet. Mince 2 US tbsp (30 ml) of garlic and add the garlic to the hot oil. Measure out 1/3 cup (43 g) of the taba ng talangka paste and add that, as well. Give the ingredients a good stir so the garlic is coated evenly with the crab paste. [2] X Research source"
    },
    {
      "title": "Saute the garlic and taba ng talangka until the mixture bubbles.",
      "content": "Saute the garlic and taba ng talangka until the mixture bubbles. Stir the mixture occasionally as it heats up in the skillet. Wait for the mixture to start bubbling vigorously before moving to the next step. [3] X Research source This should only take a few minutes."
    },
    {
      "title": "Add 3 US tbsp (44 ml) of achiote juice and cook for 30 seconds.",
      "content": "Add 3 US tbsp (44 ml) of achiote juice and cook for 30 seconds. Soak 1 teaspoon of achiote powder (annatto powder) in 3 US tbsp (44 ml) of hot water. Strain the “juice” to remove any gritty bits of powder, then add the 3 US tbsp (44 ml) to the mixture in the skillet. [4] X Research source"
    },
    {
      "title": "Add 3 cups (360 g) of cooked rice and stir the ingredients thoroughly.",
      "content": "Add 3 cups (360 g) of cooked rice and stir the ingredients thoroughly. You can use white, brown, or jasmine rice for this, depending on your tastes. Continue to cook the mixture over medium-high heat. Stir continuously until the rice is evenly coated with the taba ng talangka sauce. [5] X Research source"
    },
    {
      "title": "Serve the rice dish immediately.",
      "content": "Serve the rice dish immediately. Once the rice is thoroughly coated in the sauce and heated through, turn off the burner. Divide the dish up on 2 or 3 plates and serve it right away. Taba ng Talangka rice is an excellent side dish for grilled seafood, pork, or chicken. [6] X Research source Refrigerate leftovers in an airtight container and consume them within 3 days. [7] X Research source"
    },
    {
      "title": "Boil 1 lb (450 g) of fettuccine noodles and put them on a large plate.",
      "content": "Boil 1 lb (450 g) of fettuccine noodles and put them on a large plate. Cook your noodles in boiling water as you normally would, following the instructions on the package. Strain the cooked noodles with a colander. Use tongs to transfer the cooked noodles to a large serving plate. [8] X Research source Set this aside for now."
    },
    {
      "title": "Heat up 2 US tbsp (30 ml) of canola oil in a large pan.",
      "content": "Heat up 2 US tbsp (30 ml) of canola oil in a large pan. Measure out the canola oil and add it to a large pan. Swirl the oil around the pan so it coats the bottom. Put the pan on a burner set to medium-high heat. [9] X Research source Heat the canola oil until it begins to shimmer."
    },
    {
      "title": "Sauté the garlic and onions in the hot oil until they become fragrant.",
      "content": "Sauté the garlic and onions in the hot oil until they become fragrant. Mince 2 US tbsp (30 ml) of garlic and dice a medium onion with a sharp knife. Add both to the hot oil in the pan. Sauté the garlic and onion for about 2 minutes, or until they become fragrant. [10] X Research source"
    },
    {
      "title": "Add ½ cup (60 ml) of rice wine and cook the mixture for 1 minute.",
      "content": "Add ½ cup (60 ml) of rice wine and cook the mixture for 1 minute. Measure out the rice wine and pour it straight into the pan with the garlic and onion. Stir the ingredients well to combine them. [11] X Research source Continue stirring occasionally as the mixture cooks for 1 minute."
    },
    {
      "title": "Mix in 1 ½ cup (150 g) of taba ng talangka and simmer for 2 minutes.",
      "content": "Mix in 1 ½ cup (150 g) of taba ng talangka and simmer for 2 minutes. Measure out the taba ng talangka paste. After adding the paste to the mixture in the pan, stir the ingredients together thoroughly until everything is coated in taba ng talangka paste. Let the mixture simmer gently. [12] X Research source"
    },
    {
      "title": "Add salt, pepper, and cream and simmer for 3 to 4 minutes.",
      "content": "Add salt, pepper, and cream and simmer for 3 to 4 minutes. Sprinkle the salt and pepper over the mixture, adding the preferred amount according to your tastes. Measure out 1 cup (120 ml) of heavy whipping cream and pour it into the pan with the taba ng talangka mixture. [13] X Research source Stir the sauce well and let it simmer."
    },
    {
      "title": "Add the seafood and cook everything together for 2 minutes.",
      "content": "Add the seafood and cook everything together for 2 minutes. You can use shrimp, mussels, squid, and crab for this recipe. Clean and devein 1 lb (450 g) of your mixed seafood. Add the seafood to the pan and cook everything together. Stir the mixture occasionally. Continue until the seafood is cooked through, then turn off the heat. Cooking the seafood will only take about 2 minutes or so. [14] X Research source"
    },
    {
      "title": "Ladle the sauce over the noodles and serve the pasta immediately.",
      "content": "Ladle the sauce over the noodles and serve the pasta immediately. Chop up 1 tablespoon of green onions and arrange it on the plate as garnish right before you serve the pasta. Include a pair of tongs so your guests can serve themselves, or you can plate the pasta for them. Enjoy the pasta immediately while it’s still hot! [15] X Research source Keep any leftovers in the refrigerator in an airtight container and eaten them within 3 days. [16] X Research source"
    },
    {
      "title": "Heat up 2 US tbsp (30 ml) of canola oil in a large wok.",
      "content": "Heat up 2 US tbsp (30 ml) of canola oil in a large wok. Measure out the canola oil and add it to a large wok. Set a burner to medium-high heat and put the wok over the burner. Heat the canola oil until it begins to shimmer. [17] X Research source"
    },
    {
      "title": "Sauté the garlic, ginger, and onions until they become fragrant.",
      "content": "Sauté the garlic, ginger, and onions until they become fragrant. Chop up 1 tbsp (14.3 g) of ginger, 1 tbsp (14.3 g) of garlic, and ¼ cup (30 g) of onions with a sharp knife. Add all 3 chopped veggies to the hot oil in the wok. Sauté the veggies for 2 to 3 minutes, or until they become fragrant. [18] X Research source"
    },
    {
      "title": "Add the taba ng talangka, shrimp, bay, tinapa, and squid and cook for 3 minutes.",
      "content": "Add the taba ng talangka, shrimp, bay, tinapa, and squid and cook for 3 minutes. Put 2 US tbsp (30 ml) of taba ng talangka, 100g of shelled and deveined shrimp , ¼ cup (30 g) of tinapa flakes, ½ cup (60 g) of squid rings, and 3 pieces of bay leaf into the wok. Stir the ingredients thoroughly until the mixture is fully combined. Continue to stir occasionally and cook the mixture until the seafood changes color. [19] X Research source This will take about 3 minutes."
    },
    {
      "title": "Season with salt and add the cooked rice and peas.",
      "content": "Season with salt and add the cooked rice and peas. Sprinkle salt over the mixture according to your personal taste. Add 4 cups (480 g) of cooked rice and ¼ cup (30 g) of green peas. Stir the ingredients together thoroughly. Continue to cook, stirring occasionally, until the cooked rice is hot. Turn off the burner. [20] X Research source"
    },
    {
      "title": "Serve the taba ng talangka fried rice immediately.",
      "content": "Serve the taba ng talangka fried rice immediately. Chop up a handful of green scallions and sprinkle them on top of the rice as garnish. Plate the fried rice for your guests or allow them to serve themselves. Enjoy the dish while the rice is still hot! [21] X Research source Refrigerate any leftovers in an airtight container. Eat them within 3 days. [22] X Research source"
    }
  ]
}