{
  "url": "https://www.wikihow.com/Convert-Tenths-of-a-Pound-to-Ounces",
  "title": "How to Convert Tenths of a Pound to Ounces",
  "steps": [
    {
      "title": "Identify the part of the number that you're going to convert.",
      "content": "Identify the part of the number that you're going to convert. Your starting point should be a number like 5.75 pounds. The .75 denotes the tenths of a pound, so that's the part that you would be converting. Note that the number before the decimal, the 5, is your total number of whole pounds."
    },
    {
      "title": "Type the number of tenths of a pound into your calculator.",
      "content": "Type the number of tenths of a pound into your calculator. Make sure that you include the decimal. It will probably automatically add a zero, in which case your number will look something like 0.75 pounds. [1] X Research source"
    },
    {
      "title": "Multiply that number by 16.",
      "content": "Multiply that number by 16. There are 16 ounces in every pound, so to convert from tenths of a pound to ounces, you just multiply by 16. The answer will be your total number of ounces. [2] X Research source 0.75 times 16 ounces equals 12 ounces. Note that to reverse this process, you simply have to divide by 16 rather than multiplying. So, if your original quantity is 5 pounds, 12 ounces, you could just divide 12 by 16 to get 0.75 pounds. Then add the 5 back in, and 5 + 0.75 equals a total of 5.75 pounds."
    },
    {
      "title": "Write your original number in pounds and ounces.",
      "content": "Write your original number in pounds and ounces. The number of whole pounds from your original number is all the numbers to the left of the decimal. The number of ounces is the answer that you got when you multiplied the tenths of a pound by 16. For the example of 5.75 pounds, the answer would be written 5 pounds, 12 ounces."
    },
    {
      "title": "Write down the number you want to convert.",
      "content": "Write down the number you want to convert. For this method, your number should include decimals. For example, 4.8125 pounds or 0.25 pounds."
    },
    {
      "title": "Underline all the numbers to the left of the decimal point.",
      "content": "Underline all the numbers to the left of the decimal point. This number tells you how many whole pounds you have. If you have 4.8125 pounds, 4 is left of the decimal point, so you'll underline the 4. If you have a bigger number, as with 17.5 pounds, underline all of the digits before the decimal point. In this case, you'd underline 17. If the number to the left of the decimal is zero, as with 0.25 pounds, your final answer will only include ounces. You can say \"zero pounds\" if you want, but it's implied if you just list the ounces."
    },
    {
      "title": "Identify the tenths of a pound.",
      "content": "Identify the tenths of a pound. This should include all of the numbers that you didn't underline in the last step. In other words, it's all the numbers to the right of the decimal point. For 4.8125 pounds, the tenths are 0.8125. For 17.5 pounds, the tenths are 0.5. For 0.25 pounds, the tenths are 0.25"
    },
    {
      "title": "Set up your equation.",
      "content": "Set up your equation. First, you need to know that there are 16 ounces in every pound. So your equation will be 16 times the total tenths of a pound, which is the number you identified in the previous step. [3] X Research source"
    },
    {
      "title": "Multiply the equation.",
      "content": "Multiply the equation. If the answer has decimal places, you can round it to the nearest whole number. Generally, you round down if the decimal is .4 or lower, and round up if the decimal is .5 or higher. [4] X Research source 16 x 0.8125 pounds = 13 ounces 16 x 0.437 pounds = 6.992 ounces. We can round that to 7 ounces, because 0.9 is higher than 0.5, so we round up. 16 x 0.7 pounds = 11.2 ounces. We can round 11.2 to 11 ounces, because 0.2 is lower than 0.4, so we round down."
    },
    {
      "title": "Combine your total number of whole pounds and your total number of ounces.",
      "content": "Combine your total number of whole pounds and your total number of ounces. Generally, the larger measure is listed first, so you'll say pounds first, and then the ounces. 4.8125 pounds becomes 4 pounds, 13 ounces. 17.5 pounds becomes 17 pounds, 8 ounces. 0.25 pounds becomes 4 ounces."
    },
    {
      "title": "Write down the number you want to convert.",
      "content": "Write down the number you want to convert. For this method, your number should begin written as pounds and ounces. For example, 7 pounds, 2 ounces."
    },
    {
      "title": "Circle the number of whole pounds.",
      "content": "Circle the number of whole pounds. It should be fairly clear from how you wrote the measurement in step 1, but it's just the number of pounds. When you're done with the conversion, this number will be what you write first, to the left of the decimal point. For 7 pounds, 2 ounces, you would circle the 7. For 15 pounds, 6 ounces, you would circle the 15. If your original measurement is only written in ounces, and the total number of ounces is less than 16, the number of whole pounds will just be zero. For example, 13 ounces could be written 0 pounds, 13 ounces. If your original measurement is just written in ounces, and the total number of ounces is greater than 16, then the total number of pounds will be included as all the numbers to the left of the decimal point in your answer at step 5. For example, 100 ounces divided by 16 equals 6.25 pounds. We don't have to look at the original measurement to find the total pounds, because it's included before the decimal point in the answer."
    },
    {
      "title": "Identify the number of ounces.",
      "content": "Identify the number of ounces. Again, this should be clear from how you've written the measurement in step 1. If you have 7 pounds, 2 ounces, then there are 2 ounces."
    },
    {
      "title": "Set up your equation.",
      "content": "Set up your equation. There are 16 ounces in every pound. To find your tenths of a pound, you want to divide your total number of ounces by 16. This should give you all the numbers that come after the decimal point. [5] X Research source"
    },
    {
      "title": "Divide to solve the equation.",
      "content": "Divide to solve the equation. If you want, you can round so that you have fewer numbers after the decimal. The answer will be less precise, but simpler. To round, just choose the number you want to end with, then look at the next digit. If it's 4 or less, the first number stays the same. If it's 5 or more, the first number rounds up by 1. 2 ounces divided by 16 equals .125 pounds. If you wanted to round it to the tenths place, which is the number right after the decimal point, you would look at the next number. Here, the next number is 2, and 2 is less than 4, so we would round to .1 pounds. 100 ounces divided by 16 equals 6.25 pounds. In this case, you not only get your tenths of a pound, you also get the total number of whole pounds, which is the number before the decimal. Say you want to round 6.25 pounds to the tenths place. 5 is the next number, and it is equal to or greater than 5, so you would round up. The rounded answer would be 6.3 pounds."
    },
    {
      "title": "Now combine your previous answers for the number of whole pounds and the converted tenths of a pound.",
      "content": "Now combine your previous answers for the number of whole pounds and the converted tenths of a pound. This number is your final answer. 7 pounds, 2 ounces can be written as 7.125 pounds. 100 ounces is 6.25 pounds."
    }
  ]
}