{
  "url": "https://www.wikihow.com/Check-the-Tire-Pressure-at-a-Gas-Station",
  "title": "How to Check the Tire Pressure at a Gas Station",
  "steps": [
    {
      "title": "Reference your vehicle’s manual to find your optimal tire pressure.",
      "content": "Reference your vehicle’s manual to find your optimal tire pressure. First, open your glove box and pull out the manual for your vehicle. Find the section of your manual that lists the recommended tire pressure settings for your vehicle. Every car, truck, and SUV is different, so look up your specific vehicle’s tire pressure requirements. [1] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source The recommended tire pressure settings are usually within the range of 26-36 psi. Your front and rear tires may have different psi requirements. If you’re worried about forgetting the pressure requirements for your tires, jot them down on a piece of paper or make a note in your phone. Pressure is listed in psi, which stands for pound-force per square inch."
    },
    {
      "title": "Look on the panel of the driver’s door if you don’t have a manual.",
      "content": "Look on the panel of the driver’s door if you don’t have a manual. [2] X Research source If you can’t find your car’s manual, the air pressure requirements are typically listed on a panel or sticker near the driver-side door. The location of this information is different for each model, but it’s often hidden in the seam where your door meets the frame of the vehicle. Open the vehicle’s door and poke around to look for the information on your vehicle’s tires. [3] X Research source"
    },
    {
      "title": "Inspect your tires to look for the max PSI on your particular brand.",
      "content": "Inspect your tires to look for the max PSI on your particular brand. Inspect your tire’s pressure limit to ensure that you don’t overfill your tires. Get on your knees and run your finger around the rubber that just outside of the hubcap until you find some raised lettering. Inspect the writing carefully until you find a line that says “max psi” or “maximum psi.” [4] X Research source Maximum tire pressure is usually 44-51 psi. There may be a different maximum pressure for front and rear tires, so check both of them. Write this number down alongside the recommended setting if you don’t want to forget. The number on your tire is the maximum amount of pressure that your tire can contain. The number in the vehicle is the recommended setting for optimum gas mileage and minimal wear and tear."
    },
    {
      "title": "Use the gas station’s pressure gauge if they have one.",
      "content": "Use the gas station’s pressure gauge if they have one. Most gas stations either have a dedicated pressure gauge or a pressure gauge attached to the handle of the air compressor. If you can’t find the gas station’s pressure gauge, ask the clerk behind the counter of the store to find out where it’s located. You will typically find it alongside the air compressor and vacuum. [5] X Research source If you live in Connecticut or California, the pressure gauge and air compressor are free to use. While it usually costs $0.25-1.50 everywhere else, some stations will voluntarily offer free air and pressure gauges. You can search for a free pump near you by looking online at https://www.freeairpump.com/ . If the air compressor has a small metal cylinder attached to the top of the handle, that’s the pressure gauge. Some smaller gas stations may not have an air compressor or pressure gauge. If there’s a mechanic attached to the gas station, you can ask them if they’d be willing to check your pressure. They may try to charge you, but many employees will gladly perform the simple check for free."
    },
    {
      "title": "Buy a pressure gauge inside the gas station if they don’t have one.",
      "content": "Buy a pressure gauge inside the gas station if they don’t have one. If you want to purchase your own pressure gauge, go inside of the store. Ask the clerk behind the desk if they sell pressure gauges. Most gas stations will have handheld gauges for sale, and you can buy one to store in your glove box. [6] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source It’s a good idea to have a pressure gauge anyway. If you ever have a light pop up on your dashboard that your pressure is low, you can stop the vehicle and check your tires regardless of where you are. These handheld pressure gauges typically cost $5.00-15.00."
    },
    {
      "title": "Twist the valve-stem cap counterclockwise to remove it.",
      "content": "Twist the valve-stem cap counterclockwise to remove it. Pick a tire on your vehicle to start. Find the air valve by looking for a small tube sticking out of the hubcap. Grip the cap on the top of your valve and turn it counterclockwise by hand. Turn as hard as necessary to loosen the cap and continue twisting until it pops off. [7] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source Do this in a location where you’ll be able to easily reach all of your tires with the hose if you’re using the gas station’s gauge."
    },
    {
      "title": "Insert the pressure gauge and press it down into the valve.",
      "content": "Insert the pressure gauge and press it down into the valve. Turn the pressure gauge on and place the opening at the end of the hose on top of the air valve. Push the hose in to open your air valve and connect the compressor or gauge. As you press the hose into the valve, you’ll hear some air escaping. Continue pressing the hose into the valve until the noise dissipates. [8] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If you’re using the gas station’s pressure gauge and it costs money to turn it on, insert the necessary coins or your credit card before inserting your gauge."
    },
    {
      "title": "Hold the gauge in place and read the results.",
      "content": "Hold the gauge in place and read the results. Keep the hose still to get an accurate pressure reading. On a digital compressor, inspect the screen on the machine or handle to determine your tire’s pressure level. If you’re using a cheaper handheld gauge or the handle on the air compressor, a small tube will pop up when you attach the hose. The number at the hash mark on the bottom of the tube is your car’s pressure level. [9] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source The older gauges on air compressors will not read your pressure if you’re pulling the handle to send air out. Don’t squeeze the handle while taking your pressure reading. Your reading will be inaccurate if you’ve been driving for a long time before you take the pressure reading. If it is freezing out, your tire pressure will be functionally lower than your reading, usually by 1 psi for every 10 °F (−12 °C) under freezing. So if your car reads at 40 psi and it’s 22 °F (−6 °C) out, your tire pressure is actually 39 psi."
    },
    {
      "title": "Remove the gauge and screw the valve-stem cap back on.",
      "content": "Remove the gauge and screw the valve-stem cap back on. Take the hose off of your air valve and grab your valve-stem cap. Immediately screw the cap back on by twisting it clockwise on top of the valve. Continue turning the cap until it cannot be turned any further. You don’t need to use a ton of pressure to do this. [10] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source If you’re using the gauge on an air compressor and the pressure in your tires is low, pull the trigger on the handle to add air to your tire. Then, check the gauge again by reading the tube that pops up. Continue adding pressure until your tire’s pressure matches the recommended level as stated by your manufacturer."
    },
    {
      "title": "Repeat this process for every other tire on your vehicle.",
      "content": "Repeat this process for every other tire on your vehicle. After you’re done reading the pressure on your first tire and closed the valve, repeat this process on your other tires. Work your way around the car either clockwise or counterclockwise to ensure that you don’t accidentally check a tire twice. [11] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Insert coins into the machine to turn the air compressor on.",
      "content": "Insert coins into the machine to turn the air compressor on. Newer air compressors may take credit or debit cards, but you usually need coins to turn the older compressors on. Insert the necessary coins or use your credit card to turn the compressor on. The machine will make a rumbling noise once the compressor is ready to be used. [12] X Research source If you only have cash, go inside and ask the clerk for some change. The price for using an air compressor is usually $0.25-1.50. Some gas stations will offer free air, though."
    },
    {
      "title": "Use the station’s air compressor to fill your tires to the recommended level.",
      "content": "Use the station’s air compressor to fill your tires to the recommended level. Remove the valve-stem cap on the tire that you want to fill. Insert the hose into the valve by pressing it into the opening. Pull the trigger for 5-30 seconds to add air based on how low your pressure is. [13] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source The rate at which air fills your tires is dependent upon the power of the air compressor. This is largely a trial and error process. Often, it will add 1 psi every 2-3 seconds. Usually, gas station air compressors will run for 5 minutes before you need to insert more money."
    },
    {
      "title": "Use a portable air compressor if you possess your own compressor.",
      "content": "Use a portable air compressor if you possess your own compressor. If the gas station doesn’t have an air compressor or you prefer to use your own, feel free to pull it out at the station or at home. Unscrew the valve-stem cap and press the hose into the valve. Turn your compressor on to fill your tire with air. [14] X Research source There are digital air compressors where you can set your desired psi on the digital screen. A portable air compressor will cost $50-300. Cheaper air compressors are often too weak to efficiently fill a car’s tire, though. This is a great tool to have if you regularly drive in a city or rural area where tires are more likely to go flat."
    },
    {
      "title": "Check the pressure again before screwing the cap back on.",
      "content": "Check the pressure again before screwing the cap back on. Once you’ve added air to your tire, check the pressure again to see if you need to continue adding more air. Use the same method that you used to originally check your pressure to avoid minor discrepancies between gauges. Add more air as needed and reattach the cap by twisting it on the valve to finish filling your tire. [15] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source As long as you’re within 2-3 psi of the recommended psi settings, your tires are perfectly safe to use. If the pressure is more than 5 psi underneath the recommended setting, you need to refill the tire soon. A little high is better than a little low. The air inside of your tires naturally escapes over time, even if they’re properly sealed, so don’t worry if you’re a few psi over the recommended number."
    },
    {
      "title": "Monitor your air pressure monthly to ensure that it doesn’t get too low.",
      "content": "Monitor your air pressure monthly to ensure that it doesn’t get too low. Air will naturally escape from your tires, even when there aren’t any leaks or holes. In addition, the pressure changes based on the temperature outside. Check your vehicle’s tire pressure at least once a month to ensure that your tire’s pressure remains within the safe range. [16] X Research source"
    }
  ]
}