{
  "url": "https://www.wikihow.com/Replace-the-Screen-on-a-Screen-Door",
  "title": "How to Replace the Screen on a Screen Door",
  "steps": [
    {
      "title": "Remove the door from the frame and take off the door handle.",
      "content": "Remove the door from the frame and take off the door handle. Typically, screen doors are made from a lightweight aluminum frame and fiberglass screen material. To remove the door, lift it upward while pulling the bottom away from the track along the bottom. Then, place the door on a flat surface. If you have a door handle in the way of your screen, remove the screws with a flathead screwdriver to take it off. [1] X Research source The door should easily come off with moderate force. Not all door styles will have a door handle overlapping the screen. If your screen door is on hinges, tap the hinge pins with a screwdriver to remove them and slide the door upward from the hinges."
    },
    {
      "title": "Pull the splines out of the door frame groove with steady, firm pressure.",
      "content": "Pull the splines out of the door frame groove with steady, firm pressure. The splines are pieces of narrow rubber tubing that keep the screen secure around the door frame. There is a separate piece of spline for each side of the screen. Use an awl or your screwdriver to pry up the spline at the corner of the frame. Then, grab the spline and gently pull it upward. Do this for all 4 sides of your door frame. [2] X Research source Be careful when removing the splines. If they are still in good shape, you can reuse them. If you pierce the splines or damage them, throw them away and get new splines that have the same diameter as the old ones."
    },
    {
      "title": "Remove the old screen material from your door frame.",
      "content": "Remove the old screen material from your door frame. Once the splines are removed, the screen is no longer attached to the door. At this point, you can simply lift it off of the door frame. Fold it up, roll it up, or bunch it up before you throw it away. [3] X Research source"
    },
    {
      "title": "Cut the screen at least 2 in (5.1 cm) wider than your door frame.",
      "content": "Cut the screen at least 2 in (5.1 cm) wider than your door frame. Measure the length and width of the opening in the door frame to determine how large the replacement screen needs to be. When measuring the width, take width measurements from different spots on the door. Then, add 2 in (5.1 cm) to both the length and width measurements so you have enough room to secure the splines. [4] X Research source You can purchase a full roll of screening if you plan on replacing multiple screens in multiple doors. On average, most screen doors come in 2 standard sizes, either 32 in (81 cm) or 36 in (91 cm) wide. They often measure to 80 in (200 cm) high."
    },
    {
      "title": "Place the new screen across the door frame.",
      "content": "Place the new screen across the door frame. Center the screen as best as you can and aim to have the same amount of extra screen on each side. Keeping it centered ensures that 1 side is not too short when securing it to the frame. [5] X Research source It’s okay if the screen is not perfectly centered since you’ll trim off the extra later on."
    },
    {
      "title": "Have a friend hold the screen in place so it stays taught.",
      "content": "Have a friend hold the screen in place so it stays taught. Try to keep the screen as taught as possible. This looks the best and ensures no bugs get through the screen. Hold one end in place as your friend holds the other, and pull on the screen gently to get rid of any slack. [6] X Research source If you're working alone, use pieces of tapes or clamps to hold the screen in place."
    },
    {
      "title": "Roll the spline roller on the screen before inserting the splines.",
      "content": "Roll the spline roller on the screen before inserting the splines. After you lay the screen across the door frame, roll your spline roller across each groove of the door frame. This dents the screen slightly, making it easier to replace the spline. [7] X Research source Doing this also helps prevent your screen from ripping during the process."
    },
    {
      "title": "Reuse or replace your splines depending on their condition.",
      "content": "Reuse or replace your splines depending on their condition. If your splines are still flexible and do not have any cuts or dents, use the same pieces that secured the old screen. If the splines are cracked, old, dry, or damaged, throw them away and get new splines with the same diameter. [8] X Research source If you are replacing the splines, cut them to the length of the grooves on the door frame."
    },
    {
      "title": "Use a spline roller to press the spline and screen deeply into the groove.",
      "content": "Use a spline roller to press the spline and screen deeply into the groove. Line the spline up with the groove of the frame, and apply the roller to push the spline into the groove. Start at one corner and roll until you reach the opposite end. Then, secure the adjacent spline, working in an “L” shape. Do this until all 4 splines are pushed down and the screen is securely held in place. [9] X Research source For a thorough hold, push the corners of the screen into place using a screwdriver. [10] X Research source"
    },
    {
      "title": "Cut away the extra screen using a utility knife.",
      "content": "Cut away the extra screen using a utility knife. Once the screen is fastened to the frame, you can trim off any extra hanging along the edges. Line up your utility knife with the screen so it is about 1 ⁄ 16 in (0.16 cm) above the spline, pierce the screen with the tip of the knife, and drag the knife through the screen to cut it. Do this for all 4 sides and throw away the scraps of screen. [11] X Research source"
    },
    {
      "title": "Replace your screen door and handle after you install the screen.",
      "content": "Replace your screen door and handle after you install the screen. To put the screen back in place, lift it up with both hands, and line up the bottom with the door track. Then, tilt the screen door until it is straight, and slide it into place. If you removed the door handle, screw it back into place with a flathead screwdriver. [12] X Research source With a bit of maneuvering, you can easily put the door back on. If your door is on hinges, place the door back into your door frame, and place the hinge pins inside of the hinges. Tap them into place with the handle of a screwdriver."
    }
  ]
}