{
  "url": "https://www.wikihow.com/Be-a-Good-Basketball-Player",
  "title": "How to Be a Good Basketball Player",
  "steps": [
    {
      "title": "Improve your ball handling skills.",
      "content": "Improve your ball handling skills. Some experts believe the ability to handle the ball well is the most important skill in the game. You shouldn’t have to think too hard about dribbling the ball if you practice a lot. A good way to improve this skill is through dribbling drills. Practice with circle dribbles. In this drill, you use one hand to dribble the ball in circles around your right foot. Then switch to the other hand and leg. Practice dribbling between cones or chairs. Try doing figure 8 dribbles, in which you dribble the ball in and out of your legs, using a figure 8 motion. Bounce the ball from one hand to the other. Practice your dribbling with both hands so you can more easily change directions on the floor. Dribble suicide drills condition you while improving drilling ability. Start at the baseline. Dribble in a sprint to the closest free throw line and back. Then dribble to midcourt line and back. Then dribble to the farthest away free throw line and back. Finally, dribble all the way to the other side of the court and then back. Start at one end of the court. Dribble the entire length of the court and make a layup or a jump shot. Get your own rebound, and do the same thing, moving to the other end of the court. Do this three times as fast as you can."
    },
    {
      "title": "Improve your passing ability.",
      "content": "Improve your passing ability. Passing is a skill that basketball players must master. There are two basic ways to pass. One is a chest pass in which you throw the ball to your teammate without it bouncing. The second is a bounce pass, in which you bounce the ball once when throwing it to your teammate. This is the hardest pass for a defender to intercept. Players working on passing abilities might want to play a pickup game that uses no dribbling at all so they can focus more on passing. Practice passing with two hands. This will give you more control over the ball. Put your weight into the pass by stepping into it. This will improve ball speed and control. Aim for your teammates’ hands when passing to them. Pass to a specific team member rather than throwing the ball in the direction of their voice. Your thumbs should point down at the end of a pass, and you should follow through. Otherwise, the ball will be harder to catch because it won’t have the right back spin. You don’t have to pass a ball with great speed. Don’t forget the easy pass. If you get too tricky, you might provoke more turnovers. Don’t jump when passing. If you do this, you can’t land with the ball so it’s harder. Move toward the ball when it’s being passed to you. That makes it harder for a defender to intercept it. Try to catch it with two hands. Once you learn the basic passes, try to learn more advanced passes, like the overhead pass and the outlet pass. [1] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020."
    },
    {
      "title": "Improve your shooting.",
      "content": "Improve your shooting . The shooters get a lot of the glory, and they are obviously critical to the game. But you don’t want to be in a situation where people are blocking your shots or you miss a lot of them. That will land you on the bench. Use your fingertips. This helps you maintain proper control of the ball when shooting. Bend your legs and stay small when you begin the shot. Then, spring up, and end tall, with your body straightened and hands up in the air. When players start shooting while standing straight, they can lower their shooting percentage. The legs are critical in shooting. In fact, you should play the entire game with your knees mostly bent. Go for the higher percentage shots. Don’t always try to shoot the tricky shots. Figure out which shots are difficult for you to make, and focus on the easier shots. This will make you seem like a better shooter overnight. Point the elbow toward the middle of the rim, and keep it in, as well as your middle finger when you follow through. Finish your shot as if you are dipping your hand into the rim. Proper follow through also means that your fingers should hang down, not be together or pointed. Fully extend your arm at the end of your shot, with your elbow snapping back. And keep your elbow at the level above your eyes when you release the ball."
    },
    {
      "title": "Condition your body.",
      "content": "Condition your body. Athleticism makes the difference between a good skill set, and an unstoppable skillset. Speed, quickness, verticality, strength, and stamina can turn any skill deadly just by simply giving you the advantage over an opponent physically. You need to perform practice drills that condition your body in a way that is designed for basketball offensive play, not just exercises like you might do for fun. Coaches look for players who want to work hard to achieve good conditioning, [2] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020. like who has an explosive first step or who can jump 2 feet (0.61 m) in the air. [3] X Research source [4] X Research source Use a pre-planned workout . There are many basketball conditioning plans that will help you get in shape and improve your stamina. Even 45 minutes three times a week can make a big difference. Some conditioning workouts suggest exercises like skipping rope, sprinting from the free-throw line to the net and slapping the net with the hands, shooting for one minute from different spots on the court, and performing defensive slide moves."
    },
    {
      "title": "Keep your feet moving.",
      "content": "Keep your feet moving. A good defender must be quick on the feet and constantly on the move. If you stand still too long on the court, you won’t be good at this position. Mentally envision that you’ve stepped in paint. Ask yourself, how many of your footprints will you see on the court? You want to “paint the floor” by moving a lot and being everywhere. Increase your activity on defense, and you will be more effective. Try for every single ball. Don’t keep your eye on the ball – keep your eye on the other player. Otherwise you could be tricked by ball fakes. Maintain eye contact with the player you are guarding. Keep the player away from the baseline and force him or her to the front of the rim."
    },
    {
      "title": "Stay low.",
      "content": "Stay low. Good defenders bend their knees. They spend most of the game moving and crouched low. They should also keep their head lower than the head of the person they are guarding. [5] X Research source Keep feet wide apart and legs bent when on defense. Constantly move your feet. It will be easier for an offensive player to get past you if your legs are together or your feet crossed. Keep your nose lower than the nose of the person you are guarding. This way you can react quickly to motion made by your opponent. Standing upright can make a defender lose balance. Your feet should be shoulder length apart, with your knees bent slightly."
    },
    {
      "title": "Put your hand on the ball.",
      "content": "Put your hand on the ball. If you are careful, you can use this technique to be a better defender without fouling the player you are guarding. If the opponent is holding the ball in shooting position, put your hand on the ball. This will make it harder for them to shoot the ball. If your opponent has the ball below their midsection, put your hand on top of the ball. This will make it harder for them to shoot."
    },
    {
      "title": "Become a better rebounder.",
      "content": "Become a better rebounder . Remember no matter how good you are, you are only one player out of five. Rebounding the ball can determine the outcome of games. Your team can't score if it doesn't have possession. Move to the inside position, so you have a better chance at the ball. Don’t stand straight. If you squat down, you will have more power in your jump and a better chance at the ball. When you jump for the ball, keep both hands as outstretched as you can."
    },
    {
      "title": "Improve your defensive conditioning.",
      "content": "Improve your defensive conditioning. Defenders need to do a lot of running and must stay low to properly guard another player. Defensive endurance training will improve play. Doing a wall sit is a good way to improve your defensive conditioning. All you need to do is find a wall and sit down, as if you were sitting in a chair (but without one). Stand with your back to the wall. Slide down the wall until your knees are in a 90-degree angle with the floor. Hold the position for about 60 seconds when starting out. Try jumping rope with two legs and go as fast as you can. Time and count your jumps so you can track progress. It sounds simple, but jumping rope is a great way to improve your conditioning for basketball. That’s because it improves endurance but also agility. Try agility drills . Start on the baseline, right side. Sprint to the top right corner of the free throw line, shuffle to the left corner, backpedal to the baseline and shuffle to where you started. Then, move to the right corner and do the same thing. Boys should be able to do this in 10-14 seconds and girls in 11-15 seconds."
    },
    {
      "title": "Try lower body strength training.",
      "content": "Try lower body strength training . Lifting weights will improve your body’s overall strength, which is good on defense when you need to get rebounds or block shots. You want to vary exercises, though. Do squats. Take a dumbbell, keep feet flat on the ground and go as low as you can, keeping your thighs parallel to the ground. Try lunges and step ups. Using a barbell or dumbbell, keep your leading foot flat on the ground and your torso erect. Step up on a box and then down again or lunge forward with each leg. [6] X Research source"
    },
    {
      "title": "Try upper body strength exercises.",
      "content": "Try upper body strength exercises . These exercises are divided into pushes and pulls. You can use bands to help you by putting a foot or knee into a band when doing things like chin-ups or pull-ups if they are hard for you in the beginning. Use a barbell or dumbbell to do bench presses or shoulder presses. To bench press, lie on a weight bench with your feet on the floor. Unlock the bar and lift it with straight arms. Lower it to mid-chest, and then press it upward, locking your elbows. Don’t move your butt off the bench. Try to do this in sets of five reps. [7] X Research source Use a barbell or dumbbell to perform bicep curls . When doing a bicep curl, you want to stand straight with a dumbbell in each hand. Keep your elbows in close to your body. Make sure your palms face forward. Then curl the dumbbell until the biceps fully contract and dumbbells stop at the shoulder. Now, lower the dumbbells to the starting position, and repeat. [8] X Research source ."
    },
    {
      "title": "Master the rules.",
      "content": "Master the rules . Sometimes younger basketball players forget the game’s rules. If you don’t know the rules by heart, you will cause problems for your team. A good way to master the rules is by joining a club team when you’re young or in the summer in between seasons. If the team on offense has the ball behind the mid-court line, it has 5 seconds to move the ball over the mid-court line or it loses the ball. Knowing a rule like this helps you prevent turnovers. The offensive team can’t bring the ball back over the mid-court line once it gets the ball over the mid-court line, or it loses the ball. These are the kinds of rules that smart basketball players know. [9] X Research source"
    },
    {
      "title": "Study the game.",
      "content": "Study the game. You need to understand everything you can about your position and about court strategy. You are going to get more playing time if you are a strategic player in addition to one with strong technical skills. [10] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020. You can find many training videos on YouTube. Study your past games and those of the competition. What worked? What went wrong? After a game, sit down with your coach. Together, try to come up with one area that you need to improve. Then, work on that area in practice. Find a mentor. You can ask a basketball coach or find a good basketball player who'd be willing to teach you. Different coaches have different philosophies and systems. Figure out yours so you can adapt to it. Maybe they don’t want point guards to get more than three turnovers in a game. Whatever their own personal rules are, it’s helpful if you learn them. Watch professional and other high-level games to see how the best play the game. Use what you learn in your own game."
    },
    {
      "title": "Understand your role.",
      "content": "Understand your role. Don’t focus solely on scoring. One mistake young players make is they put all the emphasis on scoring. Focus on how you can add value to your team. Maybe you are a great passer, for example. If you’re not good at being a three-point shooter, don’t try it much. You should give up the ball to the teammate who’s better at that role. Maybe you are a great catch-and-shoot player. Then focus on that. If you are a center, you want to spend your time practicing rebounding and post drills, not dribbling. So figuring out your role also helps you pick the right training exercises."
    },
    {
      "title": "Be mentally tough.",
      "content": "Be mentally tough . Basketball is a mental game, not just a physical one. Some experts say the mental aspects of the game are 70% of it. Coaches look for players with mental toughness. Provide 100 percent effort. Basketball is a game of dedication and persistence. Don’t be afraid to be criticized, either. It’s how you will learn. [11] X Research source Coaches want players who are passionate, determined, who want to get better and who will work hard to do so, and who have the will to prepare to win, not just the will to win. Be aggressive. Coaches look for players who are aggressive and focused on the court and off it. They want someone who will dive on the floor if there is a loose ball and is constantly applying pressure to other players when acting as a defender."
    },
    {
      "title": "Be a team player.",
      "content": "Be a team player. Good sportsmanship is one of the most important aspects of basketball. You can only get so far in a sport on your own. You'll need to be humble and ready to listen to your coach and teammates if you want to improve. [12] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020. Being a team player also means winning with grace, losing respectfully, and putting in the effort it takes to be the strongest player you can be. [13] X Expert Source Ryan Tremblay Basketball Coach Expert Interview. 13 November 2020. Great players elevate their teammates’ play when they are on the court. To be a good team player, pass more often, run for an open space to help that teammate being surrounded by the opposite team, help block, help with rebounds, etc. People will like you and will return you the favor!"
    }
  ]
}