{
  "url": "https://www.wikihow.com/Drive-in-Kingdom-of-Saudi-Arabia",
  "title": "How to Drive in Kingdom of Saudi Arabia",
  "steps": [
    {
      "title": "Drive on the right side of the road.",
      "content": "Drive on the right side of the road. The steering wheel is on the left side like in the US and most countries. [1] X Research source"
    },
    {
      "title": "Get a license.",
      "content": "Get a license. You will need to pass a reverse or parallel parking test. [2] X Research source It doesn't matter which type of car you get, manual or automatic transmission."
    },
    {
      "title": "Don't drive over the speed limit.",
      "content": "Don't drive over the speed limit. Although very common, it is being enforced; there are cops with speed cameras almost everywhere. Undercover cops are also very common on highways, usually a white lumina, crown Victoria, or corolla with flashers hid behind the tinted glass, and sometimes they have police bumpers."
    },
    {
      "title": "Drive in the extreme right lane if you are traveling slower than other traffic; be alert for traffic exiting and entering the road, particularly if the right side is not curbed.",
      "content": "Drive in the extreme right lane if you are traveling slower than other traffic; be alert for traffic exiting and entering the road, particularly if the right side is not curbed. Pass on the left."
    },
    {
      "title": "Use turn signal/indicators in the direction you want to go when changing lanes, turning, and waiting at signals, etc.",
      "content": "Use turn signal/indicators in the direction you want to go when changing lanes, turning, and waiting at signals, etc."
    },
    {
      "title": "Be cautious if you are a woman.",
      "content": "Be cautious if you are a woman. As of June 2018, it is no longer illegal for women to drive in Saudi Arabia. [3] X Research source However, it's entirely possible that a woman driving may be met with negative reactions from men. Take caution not to break any driving laws, so as to avoid drawing the attention of an ill-mannered policeman."
    }
  ]
}