{
  "url": "https://www.wikihow.com/Make-a-Female-Toga",
  "title": "How to Wrap a Female Toga",
  "steps": [
    {
      "title": "Fold a plain, white bed sheet in half lengthwise.",
      "content": "Fold a plain, white bed sheet in half lengthwise. In general, the toga should extend from just beneath your armpits all the way down to your knees. You can have it go all the way down to your ankles for something more elegant, however, or you can make it shorter for a sexier look. [1] X Research source Make sure that you’re folding the long edge down, not the short edge. You want to make the bed sheet narrower , not shorter. Wear a white slip or a white tank top and shorts under your toga for more coverage. If you don't have a bed sheet, cut a 35 by 75 inches (89 by 191 cm) rectangle out of fabric, then hem the edges."
    },
    {
      "title": "Hold the sheet behind you, with 1 corner above your left shoulder.",
      "content": "Hold the sheet behind you, with 1 corner above your left shoulder. Use your left hand to hold the left corner about 12 inches (30 cm) above your left shoulder. Hold the rest of the bed sheet in your right hand. [2] X Research source If you folded the bed sheet to make it shorter, make sure that the folded part is on the inside, against your body. You don't want that to be visible."
    },
    {
      "title": "Wrap the sheet around you, stopping in front of your right shoulder.",
      "content": "Wrap the sheet around you, stopping in front of your right shoulder. Bring the right corner of the bed sheet across the front of your torso, towards the left. Pull it behind and across your back to complete the wrap. Stop when you reach the front of your right shoulder. [3] X Research source"
    },
    {
      "title": "Pull the sheet taut, then tie the right corner to the left in a double-knot.",
      "content": "Pull the sheet taut, then tie the right corner to the left in a double-knot. The back of the bed sheet should rest against your shoulder blades, or just below them. The right side of the bed sheet should sit right under your right armpit. [4] X Research source If you are wearing a tank top, use that as a guide for the back of the bed sheet. Wrap the bed sheet tight enough so that it doesn't fall off, but not so tight that you can't walk. [5] X Research source"
    },
    {
      "title": "Tuck the tails of the knot under the shoulder for a nicer look.",
      "content": "Tuck the tails of the knot under the shoulder for a nicer look. Twist the tails of the knot into thin ropes, then tuck them under the knotted part of the shoulder. This way, they won't be visible. [6] X Research source If the tails are too short to twist into ropes, just tuck them under the knot and shoulder strap as best as you can."
    },
    {
      "title": "Wrap gold cording around your waist 2 to 3 times to make a belt.",
      "content": "Wrap gold cording around your waist 2 to 3 times to make a belt. Cut a piece of gold cording long enough to wrap around your waist 4 to 5 times. Center it behind your back, then cross the ends in front of your waist. Wrap the ends around your torso towards your back and back around to the front. Tie them into a secure, double-knot in the front. [7] X Research source You don't have to tie the cording exactly like this, but the crisscross will create a nice effect. Choose a rope that is about the thickness of a pen or pencil. You can also use leather cording instead. If you don't want to wear a belt with your toga, use safety pins to secure the under layer of fabric to the outer. Do this on the left and right side. [8] X Research source Alternatively, wrap a gold chain-link belt around your waist instead."
    },
    {
      "title": "Adjust the front panel so that it covers your chest.",
      "content": "Adjust the front panel so that it covers your chest. The left side of the front panel probably covers your left breast already, but the right side of the panel may be askew. Gently tug the right side of the panel so that it covers your right breast. [9] X Research source You may have to adjust the panel beneath the belt as well, especially if you tied the belt tightly. It needs to align with the panel above the belt. You want to adjust the toga after you have added the belt because it’s easier to do so when the fabric is cinched."
    },
    {
      "title": "Fold a solid-colored bed sheet in half widthwise.",
      "content": "Fold a solid-colored bed sheet in half widthwise. White is the most recognizable color for togas, but you can try ivory, maroon, or green as well. Make sure that it is solid-colored! [10] X Research source The short edges don't have to match up. If you want a longer toga, then you can fold it so that 1 of the edges is longer than the other. The toga will start under your armpits and land wherever you want it to. Longer styles that go past your knees work the best for this version."
    },
    {
      "title": "Hold the left corner of the bed sheet in front of your left shoulder.",
      "content": "Hold the left corner of the bed sheet in front of your left shoulder. You will wrap the bed sheet around your torso like a towel, but you will need the corner so that you can tie the right corner to it. [11] X Research source Having the corner level with the top of your shoulder should be plenty. You can always adjust it later."
    },
    {
      "title": "Wrap the sheet around you, finishing in front of your right shoulder.",
      "content": "Wrap the sheet around you, finishing in front of your right shoulder. The right corner needs to be long enough so that you can pull it behind your neck and towards the left shoulder. If the right corner is not long enough, start again. This time, fold the bed sheet in half lengthwise until you get the length you want. [12] X Research source If you folded the bed sheet in half lengthwise, you may have to wrap the sheet 2 or 3 times around your torso. Wrap the sheet tight enough so that it stays up, but not so tightly that you can't walk around. Plan on leaving about 3 feet (0.91 m) of material at the right corner."
    },
    {
      "title": "Twist the right corner into a rope.",
      "content": "Twist the right corner into a rope. Don't get too carried away here; you don't want to bunch up the fabric that's already wrapped around you. If you want, you can wrap a hair tie or rubber band around the bed sheet at your right shoulder first, then twist whatever is left into a rope. [13] X Research source The hair tie/rubber band will act as a stopper for the rope. You can cover it up with a gold, Roman or Greek-looking pin or medallion later."
    },
    {
      "title": "Bring the rope behind your neck and tie it to the left corner.",
      "content": "Bring the rope behind your neck and tie it to the left corner. A tight, double-knot will do just fine here, but you can overlap and safety pin the corners too. [14] X Research source Pull the rope tight enough so that it holds your toga up, but not so tight that it's uncomfortable."
    },
    {
      "title": "Tuck the knot under the wrapped fabric.",
      "content": "Tuck the knot under the wrapped fabric. Pull on the sheet that's already wrapped around you upwards slightly so that it covers the knot. Make sure that both of the knot's tails are out of sight. If you can’t hide the knot, undo it, then tie it lower on the left corner."
    },
    {
      "title": "Tie a belt or cord around your waist to cinch and secure the toga.",
      "content": "Tie a belt or cord around your waist to cinch and secure the toga. A leather or gold cord will work great here, but you can use a simple gold or leather belt too. If you're using the cord, wrap it a few times around your waist so that it crisscrosses and makes an X. This creates a more decorative look. For a fancier touch, add a Greek or Roman-looking medallion to each shoulder. Pin them carefully through the twisted rope. Make sure that they match!"
    },
    {
      "title": "Put on a white tube top and a pair of matching white shorts.",
      "content": "Put on a white tube top and a pair of matching white shorts. White is the most popular color for togas, but if you don't like to wear white, you could try an off-white color, such as ivory or pale gold. If you want something more striking, then maroon or green are good options too. Make sure that your bra is strapless too, otherwise you'll spoil the whole strapless look!"
    },
    {
      "title": "Fold a white, solid-colored bed sheet in half widthwise.",
      "content": "Fold a white, solid-colored bed sheet in half widthwise. This is only if your shorts and tube top are white. If they are a different color, match the bed sheet to them instead. [15] X Research source Make sure that the narrow edges of the bed sheet match up. If you are very tall, then you may want to fold it askew so that 1 edge is longer than the other. If the bedsheet is too narrow to wrap around your torso, fold it lengthwise."
    },
    {
      "title": "Wrap the folded edge around your torso, just under the armpits.",
      "content": "Wrap the folded edge around your torso, just under the armpits. Hold the toga behind your back, with 1 corner against your left armpit. Wrap the other corner across the front of your body. Keep wrapping until you get a snug fit. [16] X Research source This is just like wrapping a towel around your body. Make sure that the left corner lands some place that you can easily reach and pin. If it lands on your back, adjust the right corner. The toga needs to be tight enough to hold, but loose enough so that you can still walk."
    },
    {
      "title": "Tuck the left corner under the wrapped fabric.",
      "content": "Tuck the left corner under the wrapped fabric. For an additional level of security, you might want to add a safety pin. Insert the safety pin from behind the fabric so that it's not visible on the outside. [17] X Research source Avoid pinning the toga directly to your tube top. It may sound like a good idea at first, but if your toga gets tugged down, your tube top will fall as well!"
    },
    {
      "title": "Tie a belt or cord around your waist to cinch and secure the toga.",
      "content": "Tie a belt or cord around your waist to cinch and secure the toga. A leather belt would work just fine here, but you can also use a thin leather or gold cord. If you choose the latter, consider wrapping it a few times around your waist so that it makes an X. [18] X Research source This style is very simple and elegant. You can make it look fancier by wearing a gold necklace or collar. The lack of shoulder straps will help make it stand out!"
    }
  ]
}