{
  "url": "https://www.wikihow.com/Download-from-Microsoft-Stream",
  "title": "How to Download a Video on New Microsoft Stream and Classic",
  "steps": [
    {
      "title": "Go to https://stream.office.com in a web browser.",
      "content": "Go to https://stream.office.com in a web browser. This is the website you can use to log into the new Stream on Microsoft SharePoint Stream on SharePoint allows you to access videos from SharePoint, OneDrive , and Teams . Your SharePoint administrator may have a different web address for you to use to log in. In this case, use the web address provided by your administrator. Alternatively, you can download a video from OneDrive or Teams . [3] X Research source"
    },
    {
      "title": "Login to your Microsoft account.",
      "content": "Login to your Microsoft account. If you are not logged in automatically, log in using the username and password associated with your business account. This will likely be a company email address and password."
    },
    {
      "title": "Click ⋯ or ⋮ next to a video.",
      "content": "Click ⋯ or ⋮ next to a video. This displays a drop-down menu."
    },
    {
      "title": "Click Download.",
      "content": "Click Download . This downloads the video. You can find your downloaded files in your Downloads folder. [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Alternatively, you can click a video to play it and then click Download at the top of the screen. To download a video on SharePoint, you must be the owner who uploaded the original video, or you must have been granted permission by the owner to download the video."
    },
    {
      "title": "Go to https://web.microsoftstream.com/ in a web browser.",
      "content": "Go to https://web.microsoftstream.com/ in a web browser. This is the website for Microsoft Stream Classic. Microsoft Stream Classic will be retired on February 15, 2024. Make sure you download all the videos you have uploaded so that you can transfer them to a different platform."
    },
    {
      "title": "Login to your account.",
      "content": "Login to your account. You'll need to use a company or organization's email. Log in with the email address and password you were provided."
    },
    {
      "title": "Click ••• next to the video you want to download.",
      "content": "Click ••• next to the video you want to download. You'll see this three-dot menu icon to the right of the video's thumbnail."
    },
    {
      "title": "Click Download original video.",
      "content": "Click Download original video . It's next to the download icon near the bottom of the menu. [5] X Research source"
    }
  ]
}