{
  "url": "https://www.wikihow.com/How-Do-I-Stop-Being-Sexually-Needy-to-My-Girlfriend",
  "title": "How to Stop Being Sexually Needy: Dealing with Mismatched Libidos",
  "steps": [
    {
      "title": "You might feel “sexually needy” if you and your partner have mismatched libidos.",
      "content": "You might feel “sexually needy” if you and your partner have mismatched libidos. It’s completely normal for couples to have different sex drives, though those differences might not show up when you first start dating. Psychosexual Therapist Jacqueline Hellyer explains: \"when you're first dating [...], you can't wait to rip [each others'] clothes off. But that's not what life is like for most people. All so transitioning from that all [can be difficult].\" [1] X Expert Source Jacqueline Hellyer Licensed Psychosexual Therapist Expert Interview. 15 October 2021. Once differences in libido start to show up, you might feel guilty or ashamed for wanting “too much sex\" if you have a higher sex drive. Meanwhile, your partner might start being less affectionate or distancing themselves in order to avoid anything that might lead to sex. [2] X Research source Mismatched libidos don’t mean that there’s something “wrong” with either of you. [3] X Research source Different sexual needs can cause tension in relationships, but you can improve the situation through communication and collaboration. [4] X Expert Source Jacqueline Hellyer Licensed Psychosexual Therapist Expert Interview. 15 October 2021. Sexual compatibility encompasses more than just agreeing how often you want to have sex. It means you two agree what sex represents in a relationship and feel comfortable communicating your desires and boundaries. [5] X Expert Source Alysha Jeney, MA, LMFT Licensed Relationship Therapist Expert Interview. 11 August 2021."
    },
    {
      "title": "Sexual frustration and a desire for intimacy can also stem from unmet emotional needs.",
      "content": "Sexual frustration and a desire for intimacy can also stem from unmet emotional needs. Physical touch creates a sense of security and bonding, as it releases a flood of feel-good hormones like oxytocin and dopamine. Depending on your attachment style (the way you approach relationships), you might crave physical touch in order to feel secure and loved. The desire for validation from your partner is often normal. However, here’s how to tell if the need for sexual contact is coming from a bigger, unhealthy emotional reliance on your partner: [6] X Research source Ask yourself, “Do I need sex to feel ‘complete,’ to improve my self-esteem, or to feel reassured in my relationship?” If the answer is “yes,” it might be time to talk to your partner about any emotional concerns you have in the relationship, take time to work on your own self-esteem , or reach out to a therapist for professional help."
    },
    {
      "title": "Communicate your broader sexual needs and concerns.",
      "content": "Communicate your broader sexual needs and concerns. You might want to restore what you see as a healthy sex life, but your girlfriend might have a different idea of what a healthy sex life looks like to her. Psychosexual therapist Jacqueline Hellyer emphasizes the importance of communication: \"[sex] is like a mutual hobby. It's something you do for pleasure in your leisure time, right? If you play tennis together, if you were going to cooking classes together, you would talk about it. [...] Awkwardness [is] just a myth. It's not real, it doesn't happen. Anything good in life requires focus and communication. There's two people involved. That's the only way you're going to have a good tennis match or cook a good meal together.\" [7] X Expert Source Jacqueline Hellyer Licensed Psychosexual Therapist Expert Interview. 15 October 2021. Pick a time to talk when you’re both feeling relaxed and not actively engaged in intimacy. Ask your girlfriend about what sex means to her in a relationship and whether she’s satisfied with the amount of sex you’re having. [8] X Research source “I really love it when you initiate sex. I think it’s hot and it makes me feel wanted. What do you like about our sex life and what do you wish were different?” [9] X Research source “I like having sex with you because it makes me feel close to you. I’m curious, how often do you like to have sex in a week?” “I’ve noticed we’re not having sex as often as we used to. I know that’s normal, but I wanted to ask: is there’s anything you’d want us to do differently?”"
    },
    {
      "title": "Talk about and listen to each other's specific sexual preferences.",
      "content": "Talk about and listen to each other's specific sexual preferences. Ask her what gets her in the mood and what she finds pleasurable. Psychosexual therapist Jacqueline Hellyer reminds readers, \"A lot of people have this myth that [sex] should just happen, like you shouldn't have to do anything. And that if you have to do something, well it's forced or awkward or somehow wrong. And I'm always saying 'people, no, no, no' this is very normal. So even just knowing that it's normal to [have to] get in the mood kind of takes away some of the awkwardness.\" [10] X Expert Source Jacqueline Hellyer Licensed Psychosexual Therapist Expert Interview. 15 October 2021. By openly talking about your likes and dislikes, you can make sure you and your girlfriend are both getting the most out of your sex life. And remember, communication shouldn’t just be a one-time thing—check-in before, during, and after sex. [11] X Research source “Do you prefer when someone initiates sex with touch or words?” “What kinds of mood, touch, and rhythms turn you on?” “Is there a time of day when you feel more into sex than other times?”"
    },
    {
      "title": "Be open to compromise.",
      "content": "Be open to compromise. Aim to find a middle ground that respects each other's boundaries and helps you both get something you want. It's important for sex to be about shared connection, rather than one person's pleasure. Psychosexual therapist emphasizes that \"the only way something can be right and work for you is if you're in touch with what you're feeling and communicating with your partner. And vice versa. [...] Then you're co-creating something that's working for both of you.\" [12] X Expert Source Jacqueline Hellyer Licensed Psychosexual Therapist Expert Interview. 15 October 2021. Regardless of the compromises you make, remember both you and your partner should enthusiastically consent to anything before you do it. [13] X Research source For instance, your partner might not want penetrative sex, but she might be into light touching or kissing you while you masturbate. Your girlfriend might not want to have sex after a long workday, but she might enjoy having sex in the morning. She might prefer to schedule in sex, rather than having to initiate it and worry about potential rejection. [14] X Research source"
    },
    {
      "title": "Try to avoid assigning blame or fault.",
      "content": "Try to avoid assigning blame or fault. It’s easy to feel rejected or frustrated if your partner turns you down. However, your partner’s disinterest in sex might not be about you at all. Their lack of desire might come from a naturally lower sex drive, hormonal changes, side effects from medication, or even everyday stress and fatigue. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source No matter why your partner doesn’t want to have sex, it’s important to avoid pressuring them or getting upset with them. It’s never okay to coerce anyone into sex, and making your partner feel guilty can reduce sexual desire even more. [16] X Research source"
    },
    {
      "title": "Refocus on romance and non-sexual connection in your relationship.",
      "content": "Refocus on romance and non-sexual connection in your relationship. For many women, emotional connection is a prerequisite for sexual desire. [17] X Research source By turning your attention towards making your girlfriend feel special and valued in your relationship, you might actually improve your sex life. Try reigniting the spark by taking her on a romantic date, leaving cute notes around the house, and listening to her when she’s having a rough day. [18] X Expert Source Alysha Jeney, MA, LMFT Licensed Relationship Therapist Expert Interview. 11 August 2021. Pick an activity she loves and make an effort to do that alongside her, whether that’s watching her favorite movie or trying out her favorite hobby."
    },
    {
      "title": "Rebuild your physical connection through non-sexual touch.",
      "content": "Rebuild your physical connection through non-sexual touch. It might sound counter-intuitive, but the key to restoring intimacy through affection is to let go of any expectations of sex. By taking sex off the table, your girlfriend won't feel pressured and you won’t feel disappointed if a cuddle session doesn't lead to sex. Try greeting your girlfriend with a kiss, snuggling up on the couch, or offering to give her a back massage. [19] X Research source Non-sexual physical touch is linked to higher satisfaction in relationships."
    },
    {
      "title": "Ask yourself what worked well in the past for your sex life.",
      "content": "Ask yourself what worked well in the past for your sex life. Think back on a time when you felt sexually satisfied in your relationship—what was different back then? It’s normal for sexual desire to change over time, and you might have to put in some effort to spice things up, especially if you’ve been dating for a while. Psychosexual therapist Jacqueline Hellyer explains, \"a lot of people think sex is intercourse or that sex is [only about] getting off. [Actually,] it's about connection and pleasure and intimacy and feeling good about each other. There's nothing performative in that.\" [20] X Expert Source Jacqueline Hellyer Licensed Psychosexual Therapist Expert Interview. 15 October 2021. Work together to pinpoint a few key things that used to spark desire in your relationship and bring those back. [21] X Research source If you feel like you’re missing the whirlwind romance from when you first started dating, try surprising your girlfriend with a weekend getaway or fun night at her favorite restaurant. [22] X Expert Source Alysha Jeney, MA, LMFT Licensed Relationship Therapist Expert Interview. 11 August 2021. If you’re worried you just don’t have as much time to connect, try to plan a weekly date night where you’ll unplug from your devices and spend quality time with each other. If you two used to go days without seeing each other but now live together, try and recreate anticipation and excitement by sending racy texts during the day while you’re out."
    },
    {
      "title": "Find other forms of release.",
      "content": "Find other forms of release. If your girlfriend doesn’t want to have sex and says “no,” it’s important to respect what she wants. Masturbation is a perfectly healthy way to satisfy your sexual needs, and it can help you get in touch with your own body. [23] X Expert Source Jacqueline Hellyer Licensed Psychosexual Therapist Expert Interview. 15 October 2021. [24] X Research source You can also turn to activities like exercise and art as a way to engage in something physical and tangible, so you can take your mind off sex. [25] X Research source Consider trying an open relationship or bringing a new person into the bedroom—if you go this route, try using dating apps to advertise for this type of relationship. Reader Poll: We asked 326 wikiHow readers and 57% of them named Tinder as their favorite online dating platform. [Take Poll] So that one might work for you, too!"
    },
    {
      "title": "Consider seeing a sex therapist.",
      "content": "Consider seeing a sex therapist. A professional sex therapist can help you two figure out how to navigate your different sexual needs if things aren’t improving. Sex therapist Jacqueline Hellyer reminds readers that it's normal to seek help: \"we have doctors, dentists, accountants, financial advisors, personal trainers, chiropractors, mechanics for our car. We have so many people who we go to when we don't have knowledge and skills in something. [...] But when it comes to sex and in fact very often relationships in general, a lot of people think 'oh, you know, we should be able to fix this ourselves [even though] it's the one area in life where we actually have no information or training in.\" [26] X Expert Source Jacqueline Hellyer Licensed Psychosexual Therapist Expert Interview. 15 October 2021. A large part of a sex therapist’s job focuses on simply re-establishing communication and helping you each gain an understanding of where the other person’s coming from. Sex therapists can also help treat potential sex addiction, which is when someone experiences strong, unwanted, uncontrollable thoughts and urges surrounding sex. [27] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}