{
  "url": "https://www.wikihow.com/Make-a-Wig",
  "title": "How to Make a Wig",
  "steps": [
    {
      "title": "Measure around the head at the hairline.",
      "content": "Measure around the head at the hairline. Use a cloth tape measure to measure along the hairline. The tape measure should extend from the base of your hairline at your neck to the top of your hairline at the forehead. [1] X Trustworthy Source BreastCancer.org Patient-focused nonprofit organization providing resources for those affected by breast cancer Go to source The tape measure should wrap just above the ears on either side of your head. Do not pull the tape measure. It should lie flat against flattened hair, but it should not be taut."
    },
    {
      "title": "Measure down the center top of your head.",
      "content": "Measure down the center top of your head. Place the end of a cloth tape measure at the center of your forehead, matching the end of the tape measure to the beginning of your natural hairline. Drape the tape measure over the crown of your head and down to the middle of the nape, where you natural hairline ends. As before, do not pull the tape measure. It should lie flat against flattened hair without being taut."
    },
    {
      "title": "Measure from one ear to the other.",
      "content": "Measure from one ear to the other. Bring the end of the cloth tape measure to the uppermost point at which your ear connects to the rest of your head. Drape the tape measure over the crown of your head and back down to the same position of the opposite ear. The tape measure should rest on both ears along the point at which eyeglasses or sunglasses would sit. Once again, the tape measure should lie flat against flattened hair but should not be pulled tight."
    },
    {
      "title": "Transfer your measurements to a wig block.",
      "content": "Transfer your measurements to a wig block. [2] X Expert Source Nikia Londy Hair Augmentation Specialist Expert Interview. 7 October 2021. Draw a rough sketch of the perimeter of your head based on the measurements you took. Use your cloth tape measure to measure out the same distances for the perimeter of your head, the crown of your head, and the distance between your ears. Alternatively, you could find a cotton lace cap or other fine net cap that will fit your head and place that over the wig block. It will not be a custom fit, but doing this can be easier than trying to form and apply strips of cotton lace."
    },
    {
      "title": "Nail cotton ribbons to the block.",
      "content": "Nail cotton ribbons to the block. Line cotton ribbon along the perimeter of your wig outline, as drawn previously. Gently hammer this ribbon onto the wig block using small nails. If you decide to use a Styrofoam head instead of a wooden wig block, you can use sewing pins instead of nails to attach the ribbons. Make sure that the ribbons are as flat as possible on the wig block."
    },
    {
      "title": "Apply wet cotton lace.",
      "content": "Apply wet cotton lace. Moisten strips of cotton lace by quickly spritzing them with water from a spray bottle. Drape the strips of cotton lace over the wig block and stitch them to the ribbon. Note that the strips of cotton lace must be at least as long as the measurement you took for the crown of your head. They can, however, be a little longer at this point. Use as few strips as possible, opting for larger pieces rather than many smaller ones. Pin the lace in place before sewing it onto the ribbon. You can find cotton lace in a variety of colors, but avoid lace with patterns already embroidered into it. Wetting the lace beforehand makes it easier to form and shape."
    },
    {
      "title": "Try the foundation on.",
      "content": "Try the foundation on. Remove the nails from the ribbon and take the wig foundation off the wig block. Try it on to determine if it fits correctly. If the wig foundation does not fit correctly, determine why not. Return the foundation to the wig block and make any adjustments you need to make in order to fix the fit. When everything fits the right way, trim off any excess cotton lace that hangs past the ribbon border of the wig foundation"
    },
    {
      "title": "Choose real or synthetic hair.",
      "content": "Choose real or synthetic hair. [3] X Trustworthy Source BreastCancer.org Patient-focused nonprofit organization providing resources for those affected by breast cancer Go to source Both options have advantages and disadvantages. Generally, for a wig that will be worn every day, you would want to use real hair. For a wig only worn on occasion, you might be able to use synthetic hair. Natural hair look more realistic, tends to be more durable, and can tolerate heat and other styling products better. On the other hand, wigs made from real hair must be restyled after washes, the color can fade with light exposure, and the wigs can become damaged more easily. Synthetic hair does not look as realistic and can be damaged by heat and hair dye. On the other hand, wigs made from synthetic hair tend to be lighter, do not need to be restyled after washes, and do not fade as quickly."
    },
    {
      "title": "Sort and pull the hair.",
      "content": "Sort and pull the hair. Run handfuls of hair through a hair heckle to detangle, straighten, and sort the hair. Pull and tie it into sections using hair elastics. A hair heckle consists of a sturdy base with five rows of pointed needles. It can straighten hair and blend multiple shades together. Bolt the heckle down before using it."
    },
    {
      "title": "Place the hair in between drawing mats.",
      "content": "Place the hair in between drawing mats. Lay one end of each hair section onto one drawing mat. Place the other drawing mat on top of the hair so that the pointed sides of both mats meet. Drawing mats are leather rectangles with short wires or needles along one side. They are used to keep hair straight and organized."
    },
    {
      "title": "Pick out the right ventilating needle.",
      "content": "Pick out the right ventilating needle. [4] X Expert Source Nikia Londy Hair Augmentation Specialist Expert Interview. 7 October 2021. The right size depends on the number of strands you want in a single knot. For more strands, choose a larger needle. For fewer strands, choose a smaller one. If you have lace with very fine gaps, you might need to use fewer strands per gap, so you would choose a smaller needle. For lace with larger gaps, the number of strands will influence the fullness of the wig. More strands will create a fuller, fluffier wig, while fewer strands will create a flatter style."
    },
    {
      "title": "Pull the hair through in a loop and knot it onto the lace.",
      "content": "Pull the hair through in a loop and knot it onto the lace. [5] X Research source You will need to single-knot or double-knot sections of hair made from only a few strands onto the individual gaps in the lace foundation using your ventilating tool. Fold the end of a thin section of hair to form a loop. Hook this loop with your ventilating needle and push it through one of the gaps in the lace foundation. Maneuver the needle so that you can grab the hair at the base of the loop with the hook, pulling it back through the gap of the lace. This should give you a new loop of hair that wraps around the edge of the gap. Knot the strands of hair once or twice onto the cotton edge of the gap. Make sure that the knot is fully tightened and closed so that the hair stays in place. You will need to pull the entire length of the section through the knot as you tighten it. Note also that you should be using your free hand to hold the other side of the hair taut as you work throughout this entire process."
    },
    {
      "title": "Work from the neck up.",
      "content": "Work from the neck up. You should always start knotting the wig onto the lace from the bottom of the neckline. Work your way up along the back before moving to the sides. After reaching the sides, work your way over the crown of the head. The hair on the sides should be tied with double knots. The hair on the top of the wig, or on the crown, should be tied on using single knots. This prevents the hair from looking too thick."
    },
    {
      "title": "Vary the direction.",
      "content": "Vary the direction. Once you reach the crown of the wig, you should mentally separate the top into six separate directions and tie the strands off evenly in each of those directions. Do not merely tie the strands so that they fall in one single direction, since this will not look natural. You should have two sections that extend straight down from either side of the wig, and the other four sections should be evenly spaced between these initial two."
    },
    {
      "title": "Cover the ribbons.",
      "content": "Cover the ribbons. Turn the wig inside out and stitch hair along the inside edge of the ribbons to prevent them from showing from the front."
    },
    {
      "title": "Sew in steel springs.",
      "content": "Sew in steel springs. Use a needle and thread to sew a few short steel springs around the temples, neck, and forehead of the wig. This will help the hair lift in a natural, pleasant manner. The springs should only be a few loops wide and should not be visible from under the hair."
    },
    {
      "title": "Make the part and style the wig.",
      "content": "Make the part and style the wig. With all the hair sewn in place, part the wig as you would do with a normal head of hair and cut the hair into your desired style. If you are anxious about cutting the hair into a good or flattering style, you might want to ask a hair stylist for some tips or ask if he or she will cut the wig for you."
    },
    {
      "title": "Make the final fit.",
      "content": "Make the final fit. Try the wig on. It should now be complete, but if anything looks off, you should still be able to adjust it."
    },
    {
      "title": "Make an easy costume wig",
      "content": "Make an easy costume wig . You can make a quick, inexpensive wig for a costume using a balloon, hair net, wefts of hair, and glue. Inflate the balloon and use it as a dummy head. Place the hair net over the balloon and glue the hair onto it. Trim away unwanted portions when done."
    },
    {
      "title": "Create a jellicle cat wig",
      "content": "Create a jellicle cat wig . You can create a wig to mimic the appearance of a jellicle cat from the Cats musical using sheets of faux fur. Measure your head for the correct shape and size. Create a pattern using your measurements and cut the faux fur out according to this pattern. Create and attach fake cat ears."
    },
    {
      "title": "Learn how to make doll wigs",
      "content": "Learn how to make doll wigs . Doll wigs can be made out of yarn. You can create one with or without a sewing machine."
    },
    {
      "title": "Make a ragdoll wig for yourself",
      "content": "Make a ragdoll wig for yourself . You can make a large wig in the ragdoll style for a costume. Use yarn, and either sew or glue the wig into shape."
    },
    {
      "title": "Create an easy wig from a mop",
      "content": "Create an easy wig from a mop . Another way to make a costume wig is with a clean mop. Color the mop as desired and glue the individual mop strands to a hat."
    }
  ]
}