{
  "url": "https://www.wikihow.com/Kids-Eat-Free",
  "title": "30+ Restaurants Where Kids Eat Free (or Super Cheap)",
  "steps": [
    {
      "title": "IHOP",
      "content": "IHOP Every day from 4 to 10 pm, you can visit your local International House of Pancakes to get a free kid’s meal with the purchase of a full-priced adult entree. [1] X Research source Guests 12 and under can enjoy a pancakes combo plate, French toast sticks, macaroni and cheese, chicken strips, or a cheeseburger. [2] X Research source"
    },
    {
      "title": "Fricker’s",
      "content": "Fricker’s Kids under 10 eat free all day every day at most Fricker’s locations when you dine in. Check with your local store to see if they participate in this incredible deal for families. [3] X Research source"
    },
    {
      "title": "Woodys Bar-B-Q",
      "content": "Woodys Bar-B-Q Many Woodys locations offer a Kids Eat Free Night where children get their meal free with the purchase of an adult entree. Find a location in your area to see if they offer this deal near you. [4] X Research source Some locations offer this deal for kids 10 and under, while others allow kids 12 and under to enjoy a free meal."
    },
    {
      "title": "Denny’s",
      "content": "Denny’s Join the Denny’s rewards program and get a free kid’s meal with the purchase of an adult entree that costs $6 or more. Kids can choose between pancakes, a cheeseburger, macaroni and cheese, or chicken tenders. [5] X Research source The day of the deal depends on the location, so call up your local Denny’s to see when they offer it. [6] X Research source"
    },
    {
      "title": "WaBa Grill",
      "content": "WaBa Grill WaBa Grill offers a Kids Eat Free program all weekend long and after 4 pm Monday through Friday. With this sweet deal, children can enjoy a complimentary Chicken or Tofu Mini Bowl with the purchase of any full-price entree. Use the code “KIDS” on weekdays and “KIDZ” on Saturdays and Sundays to redeem this promotion. [7] X Research source To use the code, use the WaBa Rewards App, visit their website , or show the code at the checkout counter."
    },
    {
      "title": "Chili’s",
      "content": "Chili’s Join the My Chili’s Rewards loyalty program to get email and text offers for a free kids meal with the purchase of a regular entree. [8] X Research source Children 12 and up can choose a pizza, macaroni and cheese, burger bites, cheese quesadilla, chicken fingers, and more. [9] X Research source"
    },
    {
      "title": "Culver’s",
      "content": "Culver’s Culver’s doesn’t give out free kids meals, but each kid’s meal comes with a certificate for a free scoop of Fresh Frozen Custard (Vanilla, Chocolate, or the Flavor of the Day). It also comes with a Scoopie Token, which you can save up to earn a free Scoopie Kids’ Meal. [10] X Research source Save up to 10 Scoopie Tokens to exchange them for a prize. You can also exchange Scoopie Tokens for a free football, kickball, soccer ball, basketball, or plush Scoopie."
    },
    {
      "title": "Bruster’s Ice Cream",
      "content": "Bruster’s Ice Cream Bruster’s doesn’t offer free meals for kids, but participating stores give family members under 40 in (100 cm) tall a free baby cone. Check with your local Bruster’s to see if they offer this fun year-round deal. [11] X Research source"
    },
    {
      "title": "Fuddruckers",
      "content": "Fuddruckers Some Fuddruckers locations may not offer free kid's meals, but reach out to your local restaurant to see what other kid's deals they have. [12] X Research source Some locations offer a Kids Night where kid’s meals are only $1.99 with the purchase of an adult meal. [13] X Research source"
    },
    {
      "title": "Cody’s Original Roadhouse",
      "content": "Cody’s Original Roadhouse Cody’s offers a Kids Eat Free deal every Monday and Tuesday night. All you need to do is purchase an adult entree to get a free meal for kids 10 years old and under. [14] X Research source"
    },
    {
      "title": "Genghis Grill",
      "content": "Genghis Grill Although it isn’t free, kids can eat for only $1.99 on Mondays after 4 pm with the purchase of an adult meal. This deal is limited to 2 meals per table, and it’s only available when you dine in, but we still think it’s a great discount! [15] X Research source"
    },
    {
      "title": "Cinzzetti’s",
      "content": "Cinzzetti’s Children can eat delicious Cinzzetti’s pizza and pasta for just $4.99 on Mondays and Tuesdays at dinnertime. Visit your local all-you-can-eat Italian Buffet to take advantage of this cheap deal. [16] X Research source"
    },
    {
      "title": "Cody’s Original Roadhouse",
      "content": "Cody’s Original Roadhouse Kids 10 and under can eat for free at Cody’s every Monday and Tuesday night. To take advantage of this deal, all you need to do is purchase one adult entree. [17] X Research source"
    },
    {
      "title": "Ruby Tuesday",
      "content": "Ruby Tuesday After 5 pm on Tuesday, kids 12 years old and under can get a free meal with the purchase of a full-priced adult entree. Just make sure to plan on going inside—this deal is only available if you dine in. [18] X Research source"
    },
    {
      "title": "Miller’s Ale House",
      "content": "Miller’s Ale House Order a $10 item to get a free kid’s meal on Tuesdays. The deal is limited to 2 per table and your kid can choose between a burger, quesadilla, Chicken Zingers, Fried Shrimp Platter, mac & cheese, and a grilled chicken breast. [19] X Research source"
    },
    {
      "title": "Coco’s Bakery and Restaurant",
      "content": "Coco’s Bakery and Restaurant Kids eat free all day at Coco’s for both pickup and delivery orders. To redeem this offer, order on their website and use the code “FREEKIDSMEAL.” [20] X Research source"
    },
    {
      "title": "Marie Callender’s",
      "content": "Marie Callender’s At select Marie Callender’s locations, you can get a free kid’s meal all day on Tuesday and Saturday. Check with your local restaurant to see if they offer this awesome deal. [21] X Research source"
    },
    {
      "title": "Cinzzetti’s",
      "content": "Cinzzetti’s On Mondays and Tuesdays every week, kids can get a free dinner for just $4.99. Take your family to your local Italian all-you-can-eat buffet to cash in on this sweet offer. [22] X Research source"
    },
    {
      "title": "Bob Evans",
      "content": "Bob Evans Download and register an account on the Bob Evans app, then spend $15 on the app (before sales tax) to get a free kid’s meal on Tuesdays. [23] X Research source There’s no age limit, and you can choose from a wide variety of meals, including their homestyle fried chicken tenders, Chicken-N-Noodles, and Little Piggy Pancakes. [24] X Research source"
    },
    {
      "title": "Famous Dave’s",
      "content": "Famous Dave’s If you live in Tukwila, Tacoma, or Everett, Washington, or West Jordan or Layton, Utah, we have a deal for you. Every Tuesday, kids can get a Lil’ Wilbur Meal (a cheeseburger, hand-breaded chicken strips, a kid’s rib dinner, or macaroni and cheese) for free with the purchase of an adult entree."
    },
    {
      "title": "Smashburger",
      "content": "Smashburger Every Wednesday in 2024, you can get a free kid’s meal in-store with the purchase of an adult entree, side, and drink. [25] X Research source Check the Smashburger website to see if a location near you is currently offering this family-friendly deal. [26] X Research source"
    },
    {
      "title": "Luby’s",
      "content": "Luby’s Run over to Luby’s on Wednesdays and Saturdays to get a free meal for kids 12 years old and under with the purchase of an adult meal. Their meal selections vary daily, but you can contact your local restaurant to see what they offer today. [27] X Research source"
    },
    {
      "title": "IKEA",
      "content": "IKEA At most IKEA locations , you can get up to 2 free kid’s entrees when you buy any adult entree at their Swedish restaurant. All you need to do is scan an IKEA Family card to receive this delicious offer for kids 12 and under. [28] X Research source"
    },
    {
      "title": "Chevy’s Tex Mex",
      "content": "Chevy’s Tex Mex Kids 12 and under can enjoy a free meal at Chevy’s for only $1 when you purchase an adult entree. This deal is offered all day every Wednesday in their dining room. [29] X Research source"
    },
    {
      "title": "Red Robin",
      "content": "Red Robin Red Robin’s participating locations don’t offer a free kid’s meal, but they do have a Wednesday deal where children under 11 can get their meal 50% off. When you dine in, you also get free unlimited refills of their Bottomless sides and drinks. To redeem this deal online, use the code “KIDSMEAL50.” [30] X Research source"
    },
    {
      "title": "Marie Callender’s",
      "content": "Marie Callender’s At select stores, Marie Callender’s offers a free kid’s meal on Tuesdays and Saturdays. [31] X Research source Contact your local restaurant and bakery to see if you can take advantage of this great offer."
    },
    {
      "title": "Luby’s",
      "content": "Luby’s This Texas chain offers a free meal for kids under 12 on Wednesdays and Saturdays with the purchase of an adult meal. [32] X Research source Their menu has a lot to choose from, including a bacon cheese steak, chopped steak, chicken tenders, roast chicken, and a three veggie plate."
    },
    {
      "title": "Modern Market Eatery",
      "content": "Modern Market Eatery Modern Market offers a kid's meal after 5 pm on Saturday and Sunday with the purchase of an adult entree. At this delicious healthy restaurant, your kiddos can choose favorites like mac & cheese, pizza, roasted chicken, grilled cheese, and more. [33] X Research source"
    },
    {
      "title": "Freebirds World Burrito",
      "content": "Freebirds World Burrito This Texas Tex-Mex chain offers free kid’s meals on Sundays. [34] X Research source Your little Weebird can choose from a taco or a quesadilla with a side of chips and juice."
    },
    {
      "title": "Tumbleweed",
      "content": "Tumbleweed All day on Sunday, you can dine in and purchase an adult entree to get one free kid’s meal for kids 10 years old and younger. [35] X Research source Tumbleweed has a large menu full of options for your little ones, including a taco, burrito, quesadilla, chimichanga, and grilled cheese."
    },
    {
      "title": "Modern Market Eatery",
      "content": "Modern Market Eatery Every Saturday and Sunday after 5 pm, treat your family to a free kid’s meal with the purchase of an adult entree in-restaurant. Enjoy a pizza, salad, protein bowl, sandwich, or chef bowl while your little ones chow down on faves like macaroni and cheese, pizza, and grilled cheese. [36] X Research source"
    }
  ]
}