{
  "url": "https://www.wikihow.com/Avoid-Stomach-Pain-when-Taking-Antibiotics",
  "title": "How to Avoid Stomach Pain when Taking Antibiotics",
  "steps": [
    {
      "title": "Follow your doctor’s instructions exactly.",
      "content": "Follow your doctor’s instructions exactly. When your doctor writes you a prescription for antibiotics, they will give you specific instructions on how to take the medication. [2] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Following their instructions can help reduce your chances of developing stomach pain, since your doctor will most likely give you tips on how to avoid unpleasant side effects. Your instructions will include how many days you should take the antibiotics, how many times per day to take them, and whether you should take them with food. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Unless the label indicates otherwise, store your antibiotics in a cool, dark, and dry place. [4] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Some antibiotics may need to be stored in the refrigerator, between 35.6 °F (2.0 °C) to 46.4 °F (8.0 °C). [5] X Research source Check the storage instructions of your medication before refrigerating it, and do not freeze antibiotics. [6] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Determine if your antibiotics should be taken with food.",
      "content": "Determine if your antibiotics should be taken with food. Some medications are meant to be taken with food. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source This is because the food acts as a physical barrier to the surface of the gut wall, reducing side effects like indigestion, nausea, and stomach irritation. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If your instructions tell you to take your antibiotics with food, make sure to do so every time to avoid an upset stomach. Some antibiotics are meant to be taken on an empty stomach, such as flucloxacillin and tetracycline. [9] X Research source Do not take food with these drugs because it may affect their absorbancy and increase your risk of side effects like nausea and diarrhea. If you need to take your antibiotics on an empty stomach, take them about one hour before a meal, or 2 hours after a meal. Set an alarm if you need help remembering the time. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Certain foods may affect the absorption of some antibiotics. For example, milk and other dairy products can interfere with the absorption of tetracycline by 50-90%. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source This may cause stomach pain, so ask your doctor if you need to avoid specific foods when taking your medication."
    },
    {
      "title": "Make sure to take the correct amount of the antibiotic each day.",
      "content": "Make sure to take the correct amount of the antibiotic each day. Be precise when taking your antibiotics; do not underdose, overdose, or double dose. Underdosing antibiotics increases your risk of treatment failure and may cause high antibiotic resistance. [12] X Research source While overdosing is unlikely to cause you serious harm, it will make you more likely to have an upset stomach. [13] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you have a hard time remembering if you have already taken your medication, hang a calendar where you keep your medications. When you take your antibiotics for the day, write it on your calendar so you do not accidentally double dose. Your prescription will be written for the amount of time it will take the antibiotic to fight off the bacterial infection. If you don't take your antibiotic as prescribed, the remaining bacteria in your body may restart an infection, or the antibiotics may not work as well the next time they're needed. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Increase the amount of good bacteria in your body.",
      "content": "Increase the amount of good bacteria in your body. Aside from fighting off the “bad” bacteria in your body, antibiotics also attack the “good” bacteria in your body. [15] X Research source When this good bacteria is attacked, it disrupts your gut, so restoring the levels of good bacteria may relieve stomach pain. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source While some people think good bacteria has a positive effect, it’s still under research. Always check with your doctor before trying any new supplements. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Plain, unsweetened yogurt is an excellent source of probiotics or good bacteria. Eat 1 or 2 plain Greek yogurts a day when taking antibiotics, and look for yogurt that contains live, active culture for best results. [18] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Garlic is a good source of prebiotics, which provide nourishment for probiotics. [19] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Other foods with prebiotics include oats, bananas, blueberries, asparagus, spinach, artichokes, onions, leeks, flax seed, and chia seeds. [20] X Research source Other sources of good bacteria include miso, sauerkraut, kombucha, kimchi, and kefir. [21] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Board certified gastroenterologist Peter Gardner says that your microbiome plays “a huge role [in your body], in everything from inflammation to building muscle.” This means the levels of bacteria in your gut may affect your gastrointestinal system and overall health."
    },
    {
      "title": "Tell your doctor about past experiences you've had with antibiotics.",
      "content": "Tell your doctor about past experiences you've had with antibiotics. If you have a history of stomach pain caused by antibiotics, discuss it with your doctor. Your doctor may give you an alternative drug. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Your doctor may also adjust the dose of your medication to reduce your chances of stomach pain, or prescribe anti-sickness medication to lessen symptoms like nausea or vomiting. [23] X Research source Certain antibiotics may cause an allergic reaction, such as an itchy rash. If you experience blistering skin, facial swelling, or breathing issues (wheezing), call 911 immediately. [24] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Drink a cup of chamomile tea.",
      "content": "Drink a cup of chamomile tea. Chamomile is a mild herbal remedy that can work as an anti-inflammatory. If your stomach lining is upset by the imbalance of bacteria from your medication, chamomile tea can help soothe your stomach. Although some studies support the use of chamomile tea for stomach pain, more research needs to be done to determine whether it is effective. [25] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Bring water to a boil, then pour over a chamomile tea bag . Cover your teacup or pot, and allow your tea to steep for 15 to 20 minutes. The longer your tea steeps, the stronger it will be. If you like, add a teaspoon of honey or another sweetener of your choice."
    },
    {
      "title": "Apply a \"hot\" pack to your belly.",
      "content": "Apply a \"hot\" pack to your belly. Placing a hot water bottle or an electric heating pad over your stomach is shown to relieve pain and discomfort. If your pain is due to cramps caused by antibiotics, the feeling of warmth against your skin may help you relax and feel better. If you don't have a hot pack, fill a sock with dried pinto beans or rice. Tie your sock and put it in the microwave for 30 seconds, or until the ingredients are warm to the touch. Don't let your hot pack get too hot. You want it to feel warm to the touch. Find a comfortable place to lie down, where you can balance the hot pack against your stomach. Leave it in place for at least 15 minutes. You may repeat as often as you'd like to."
    },
    {
      "title": "Drink some rice water.",
      "content": "Drink some rice water. Rice water is water that is left over after cooking rice. Drinking rice water may temporarily control diarrhea caused by antibiotics and minimize stomach pain. [26] X Research source Make your own rice water by cooking 1/2 cup of plain white rice with 2 cups of water. Bring the rice-water mixture to a boil, then turn down the heat and allow it to simmer for 20 minutes, or until the rice is tender. Pour the rice and water through a sieve, reserving the rice for a bland meal. Catch the rice water in a bowl or kitchen pot. Fill a drinking glass with the rice water, and enjoy it warm. If you like, add a spoonful of honey."
    },
    {
      "title": "Enjoy a hot cup of fresh ginger tea.",
      "content": "Enjoy a hot cup of fresh ginger tea. Ginger is a well-known remedy for alleviating vomiting and nausea. [27] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Sipping on a warm infusion of ginger tea may help relieve the stomach pain caused by antibiotics, but more research needs to be done to determine whether it is effective. [28] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Wash, peel, and roughly chop 1 to 2 inches (2.5 to 5.1 cm) of ginger root. Bring 1 to 2 cups of water to a boil, then add your ginger. The more water you use, the more diluted your tea will be. If you steep the ginger in water, your tea will be stronger. Boil for 3 to 5 minutes, then steep the ginger for another 3 to 5 minutes. Remove the ginger tea from the heat, strain out any chunks of ginger, and pour your fresh ginger tea into a mug or teapot. If you like, add a spoonful of honey or other sweetener. Some people enjoy a slice of lemon with their hot ginger tea."
    }
  ]
}