{
  "url": "https://www.wikihow.com/Come-Out-to-Your-Friends",
  "title": "How to Come Out to Your Friends",
  "steps": [
    {
      "title": "Wait until you feel ready to come out.",
      "content": "Wait until you feel ready to come out. There's no rush to come out, and you don't owe anyone an explanation about your sexuality or gender identity. Give yourself as much time as you need to get comfortable with yourself before you reveal yourself to your friends. Your coming out should be on your own terms. [1] X Expert Source Marissa Floro, PhD Counseling Psychologist Expert Interview. 18 February 2021. In some cases, friends or family members might be asking about your sexuality or gender identity. You don't have to answer them until you're ready. You might instead say, \"I'm not really worried about dating right now. Are you seeing someone?\" Some of your friends might feel ready to come out before you, and that's okay! You don't need to come out just because someone else has. Your journey is different from theirs. Coming out isn't a one-time thing. It's a lifelong journey as you meet and connect with new people! [2] X Expert Source Marissa Floro, PhD Counseling Psychologist Expert Interview. 18 February 2021."
    },
    {
      "title": "Ask your friends about LGBTQ+ issues to see if they’re accepting.",
      "content": "Ask your friends about LGBTQ+ issues to see if they’re accepting. It’s normal to feel nervous about how your friends will react. Fortunately, you can test their reactions by seeing how they respond to LGBTQ+ topics. Bring up an LGBTQ+ character, news story, or issue, then ask your friends what they think about it. See if they seem supportive or possibly judgmental. [3] X Research source You might say, “What did you think of Love, Simon ?” “Were you shocked when Cheryl came out as a lesbian on Riverdale ?” or “I’m confused about this same sex wedding cake debate. What do you think?” If you’re transgender or nonbinary, you might say, “Have you read about the transgender bathroom laws? What do you think?” or “Have you ever questioned your own gender identity?” If you are intersex, you may say “I've watched an interesting documentary on forced surgery on intersex babies. Whats your stance on the issue?”"
    },
    {
      "title": "Identify the friends you think will support you.",
      "content": "Identify the friends you think will support you. Consider which of your friends seem supportive of same sex relationships, transgender people, intersex people and nonbinary people. Pick the people you think will be most supportive to tell first. As you tell more people, your supportive friends can be there for you as you come out to others. [4] X Research source It’s possible that many of your friends will be supportive. However, it’s okay if you just start with a single friend. What’s important is that you feel comfortable with your coming out journey. While you can't know for sure how people will respond, you can definitely make an informed guess based on what people have said in the past. [5] X Expert Source Marissa Floro, PhD Counseling Psychologist Expert Interview. 18 February 2021."
    },
    {
      "title": "Postpone telling people you think will judge or reject you.",
      "content": "Postpone telling people you think will judge or reject you. While it’s not fair to you, some people may have trouble accepting your identity. This can be really painful, but it’s important to remember that this has nothing to do with you. If you suspect someone will react negatively, wait to tell them until you’re ready to deal with their reaction. Keep in mind that you never have to tell them if you don’t want to. [6] X Expert Source Marissa Floro, PhD Counseling Psychologist Expert Interview. 18 February 2021. For instance, you might have a friend who’s very vocal about their negative opinions regarding LGBTQ+ issues. It’s probably best not to tell them about your identity. If you’re feeling hurt over losing friends who won’t accept you, remind yourself that true friends love you for who you are. You don’t need negative people in your life, and you will find friends who support you."
    },
    {
      "title": "Make new friends",
      "content": "Make new friends in the LGBTQ+ community if you don’t have support. It’s okay if you feel nervous about trying to make new friends. Don’t worry about bonding with people right away. Just focus on meeting people through social events or online. Get to know them and try to make a connection. Soon, you’ll have new friends who love you for who you are. Go to LGBTQ+ events or meetups in your area. Set a goal to meet people and say, “Hi.” Over time, you’ll make a few new friends."
    },
    {
      "title": "Write down what you want to tell your friends.",
      "content": "Write down what you want to tell your friends. Think about everything you’d like to say, then jot down the ideas that seem most important to you. Pour out your heart and say how you feel about your friends. Then, revise what you’ve written so that it’s clear and concise. [7] X Research source You might write something like, “Lately, I’ve been dealing with a lot of conflict inside myself, but recently I realized something really important. You’re one of my closest friends, so I want to be my true self around you. I hope that you’ll accept me for who I am. I’m gay, and I’m ready to live my life out and proud.”"
    },
    {
      "title": "Use a positive tone to show that you're proud of who you are.",
      "content": "Use a positive tone to show that you're proud of who you are. Your identity is part of you, so you have every right to be excited and proud to share it with people. Don't let worries about how people will react make you feel ashamed or like you're holding in a secret. As you plan what you want to say, keep your tone positive and celebratory. [8] X Research source For instance, use an upbeat tone of voice while you're speaking. Additionally, focus on how you're sharing your truth rather than thinking of this as a dark secret."
    },
    {
      "title": "Say only what feels comfortable to you.",
      "content": "Say only what feels comfortable to you. You are totally in control of what you say during your coming out. Don’t feel pressured to provide personal details or to explain yourself. Decide what you’re comfortable sharing, and stick to that. [9] X Expert Source Marissa Floro, PhD Counseling Psychologist Expert Interview. 18 February 2021. For example, you don't need to disclose what your chosen label is if you don't want to. [10] X Expert Source Marissa Floro, PhD Counseling Psychologist Expert Interview. 18 February 2021. You don't need to provide \"proof\" of your identity. Similarly, you don't need to explain how you realized your identity unless you want to do so. What you share is totally up to you."
    },
    {
      "title": "Practice what you want to say so it’s easier to share with your friends.",
      "content": "Practice what you want to say so it’s easier to share with your friends. State what you want to say aloud so you can hear how it sounds. You might also sit in front of a mirror so you can practice telling it to someone else. Keep practicing until you feel comfortable with what you want to say. [11] X Research source If something feels wrong, don’t be afraid to change it. If you’re already out to a family member or best friend, ask them to help you practice. For instance, you might tell them what you plan to say and get their feedback."
    },
    {
      "title": "Tell your friends in person if you feel comfortable doing it face-to-face.",
      "content": "Tell your friends in person if you feel comfortable doing it face-to-face. If you’re comfortable coming out in person, doing it one-on-one or in small groups is an awesome idea. Ask your friends to meet you in a comfortable, private location. Then, tell them what you practiced. For instance, you might ask your friends out to dinner or could invite them over to your house."
    },
    {
      "title": "Use props if you want to make it playful and fun.",
      "content": "Use props if you want to make it playful and fun. You get to set the mood for your coming out. If you want it to be more playful than serious, try adding props to your announcement. You might use a large banner or give your friends small items or gifts with your LGBTQ+ announcement written on them. In addition to keeping it fun, props also break the ice for you! Here are some ideas: [12] X Research source Make a banner that says “I’m gay!” and stand under it. Hand out cupcakes that say “Your Friend is Bi.” Give your friends eggs filled with glitter, then ask everyone to break them just before you make your announcement. Sing “I’m Coming Out” on a karaoke machine."
    },
    {
      "title": "Come out in a text if you’re too nervous to say it in person.",
      "content": "Come out in a text if you’re too nervous to say it in person. You might be too nervous to tell people in person, and that’s totally okay! Instead, type out everything you want to say into a text. Alternatively, send your friends a fun coming out meme. In addition to helping you feel comfortable, this gives them time to process the information and come up with a response. [13] X Research source You could text them, “Hey, you’re one of my best friends, so I wanted to tell you something really important about me. I hope that you’ll accept me for who I am and be there for me. I’ve known for awhile that I’m a trans man, and I want to start living my life as my true self.”"
    },
    {
      "title": "Write a letter if you express yourself better on paper.",
      "content": "Write a letter if you express yourself better on paper. A personal letter is an intimate way of expressing what you want to say without having to do it in person. Write or type all of the information you want to share as part of your coming out. Personalize letters to each of your friends so they understand how much they mean to you. Send the letters to your friends, then wait a few days before following up with everyone. Some of your friends might reach out to you right away. If this happens, listen to what they have to say and answer questions you feel comfortable with. After about 2-3 days, contact friends you haven’t heard from. Say something like, “I wanted to talk to you about the letter I sent you. Have you read it?”"
    },
    {
      "title": "Make an announcement on social media to tell everyone at once.",
      "content": "Make an announcement on social media to tell everyone at once. If you’re comfortable with everyone knowing your sexuality or gender identity, posting on social media might be a fun, easy way to come out to everyone. Type out an emotional message if that feels right to you, or post a fun LGBTQ+ photo. Explain that you’re proud of who you are and hope your friends will be supportive. [14] X Research source Type something like, “I feel like it’s time for me to be honest with everyone. I’m gay and proud! I hope that everyone reading this can accept me for who I am and will support my coming out!” You could also post a pic of you in your favorite rainbow outfit, holding a sign that says, “Hey! I’m Gay!”"
    },
    {
      "title": "Host a coming out party if you want to set a celebratory tone.",
      "content": "Host a coming out party if you want to set a celebratory tone. If you enjoy being the center of attention, a coming out party might be the most fun way to tell your friends. Plan a party that’s as big or small as you feel comfortable with. Then, invite the friends you think will be supportive. Here are some party ideas to help you come out: [15] X Research source Consider using rainbow decorations to signal to your friends that this is a coming out party. Hang a banner that announces your identity if that feels right to you. Have a toast to give your coming out speech. Decorate your treats with fun coming out statements, like “Gay AF” or “Who runs my world? Girls!”"
    },
    {
      "title": "Expect your friends to ask questions.",
      "content": "Expect your friends to ask questions. Your friends are probably going to have questions, so decide what you're comfortable addressing. Don't feel pressured to answer any questions that make you uncomfortable. However, it's helpful to provide answers to topics you're open to talking about. For instance, your friend might ask, \"How long have you known you were transgender?\" You might say, \"I realized I was really a guy when I was three-years-old, but I haven't felt comfortable talking about it until now.\" Similarly, a friend might ask, \"Are you sure you're gay?\" You could respond, \"Yes, I'm definitely attracted to guys.\" Gently refuse to answer questions that are too personal. Let’s say your friend asks about your sex life. You might say, “I’m glad you want to know me better, but that’s not something I feel comfortable sharing. I hope you understand.”"
    },
    {
      "title": "Give your friends time to process your coming out.",
      "content": "Give your friends time to process your coming out. It's common for your friends to feel shocked, even if they're super supportive of the LGBTQ+ community. This doesn't mean they're pulling away or don't accept you. It's important to give them the time they need to think about what you've said and decide how to respond. Let your friends have time to think things over. Some of your friends might immediately reach out to you, and that's awesome! If your friends go quiet for a few days, give them a little space. After a few days, touch base with them to see if they're open to talking. You might text them, \"Hey! I just wanted to see how you were doing. Wanna chat?\""
    },
    {
      "title": "Don’t take negative responses personally.",
      "content": "Don’t take negative responses personally. Unfortunately, some people may react negatively when you come out. This can be super painful, but it’s important to remember that they aren’t really rejecting you. Their reaction is about them, so try to separate yourself from it. [16] X Research source Take a break from people who are making you feel bad about yourself. If someone says a nasty comment to you, respond with something like, “I’m sorry that you hold that kind of hate in your heart,” “I’m sorry you feel that way,” or “It’s not okay for you to say these things to me.”"
    },
    {
      "title": "Ask your friends not to tell anyone else if that's important to you.",
      "content": "Ask your friends not to tell anyone else if that's important to you. You have the right to decide who knows about your identity. Your coming out should be on your own terms, so tell your friends what you're comfortable with them sharing. This will help you control your own story and decide what labels apply to you. Say something like, \"I'm telling you this because you're one of my closest friends. However, I'm not ready for everyone at school to know, so please don't tell anyone else,\" or \"I'm planning to come out to different people at different times. Please don't discuss this with anyone else because I want to tell them in my own time.\""
    },
    {
      "title": "Focus on the positives because your identity is something to celebrate.",
      "content": "Focus on the positives because your identity is something to celebrate. There may be some difficult moments during your coming out process. Try not to let these issues get you down. Instead, think about what’s going right in your life and how awesome it will be to finally live the life you want. Make a gratitude list to remind yourself of what’s going well. Write down 3-5 things that you’re grateful for every day, then re-read your list when you’re feeling down. Surround yourself with people who support you so you’re not worrying about people who are negative. Don’t forget about online forums! If you’re not feeling supported in real life right now, look for pro-LGBTQ+ friends online. You’re not alone!"
    },
    {
      "title": "Recognize it’s okay to change your label as you grow.",
      "content": "Recognize it’s okay to change your label as you grow. While some people instantly know their sexuality or gender identity, it’s okay if it takes you a while to fully understand who you are. Give yourself permission to be who you are on the inside, even if that means coming out again to the same group of friends. If they’re the right friends for you, they’ll support you every time! [17] X Research source For instance, you might think that you’re bisexual at first. However, you might later discover that you’re gay. Similarly, you might think you’re nonbinary but may decide that you’re actually a trans man/woman. It’s okay to re-label yourself!"
    }
  ]
}