{
  "url": "https://www.wikihow.com/Draw-Carl-from-Up",
  "title": "How to Draw Carl from Up",
  "steps": [
    {
      "title": "Begin with his head.",
      "content": "Begin with his head. Draw a rounded rectangle and make it wide at the bottom. Add ears. Make sure to draw vertical and horizontal lines to help with facial features in the next step."
    },
    {
      "title": "Create his face.",
      "content": "Create his face. If you recall from seeing the movie, he has bushy eyebrows, square glasses and a round nose."
    },
    {
      "title": "Create his body.",
      "content": "Create his body. Start with his pants and tweed jacket. Note: don't forget to also draw a vertical line for his body's guideline."
    },
    {
      "title": "Draw his hands and shoes.",
      "content": "Draw his hands and shoes. In this picture he is carrying three balloons; make sure to draw his left hand as if it's holding something."
    },
    {
      "title": "Draw the details on his clothes.",
      "content": "Draw the details on his clothes. Draw a bow-tie, a bottle cap pin and his belt. Then add the folds on his clothes."
    },
    {
      "title": "And lastly, draw the three balloons he's holding.",
      "content": "And lastly, draw the three balloons he's holding. Balloons are never completely round. They're more teardrop shaped. And don't forget to add a tiny triangle at the end of each balloon. That's the knot that keeps the balloon full of helium."
    },
    {
      "title": "You can now outline your drawing with permanent media.",
      "content": "You can now outline your drawing with permanent media. Use a pen or marker (or a paint brush ). Wait a few minutes for the ink to dry, and erase all the pencil marks. That will keep your drawing looking neat."
    },
    {
      "title": "Color him!",
      "content": "Color him! He wears brown and white clothes exclusively. So use different variations of brown. Don't forget to color the balloons too. For this drawing, we used yellow, blue, and pink."
    }
  ]
}