{
  "url": "https://www.wikihow.com/Cheat-on-a-Scantron-Test",
  "title": "Can You Cheat on a Scantron Test? 7 Cheating Myths Debunked",
  "steps": [
    {
      "title": "Fact:",
      "content": "Fact: Rubbing Chapstick on your Scantron just makes it greasy. While there was a rumor going around for a while that the slick nature of the lip balm would mess up the grading machine, that just isn’t the case. In fact, it can even cause your correct answers to be marked as incorrect, giving you an even lower score than you would have gotten in the first place. [1] X Research source Plus, your teacher might be able to see the grease marks on your Scantron and figure out what you tried to do."
    },
    {
      "title": "Fact:",
      "content": "Fact: It could cause you to fail the test. If you don’t use a #2 pencil on your Scantron, the grading machine might not be able to read it. If that’s the case, you could end up getting a 0 on the test. It’s better to use the right pencil and get an actual score than to risk it for a failed grade. [2] X Research source"
    },
    {
      "title": "Fact:",
      "content": "Fact: It could cause the machine to skip your answers. While it’s true that not fully filling in the bubble could confuse the grading machine, it could also lead to an incomplete score or an even lower grade. Plus, if the machine can’t read your test at all, you might fail completely. [3] X Research source The same is true if you try to fill your answers in partially or halfway."
    },
    {
      "title": "Fact:",
      "content": "Fact: This method stems from a rumor from the 1990s. Scantrons have come a long way since then, and there are safeguards in place that prevent the machine from getting tripped up by this. If your Scantron does confuse the sensors, you could fail the test. [4] X Research source Your teacher probably won’t be super happy that you didn’t follow directions and fill your answers in all the way."
    },
    {
      "title": "Fact:",
      "content": "Fact: Filling out your Scantron incorrectly could cause you to fail. It’s true that zig zagging lines might confuse the sensors. However, if you fill out your Scantron incorrectly, your teacher may just throw it out. Drawing lines to connect your answer bubbles is pretty obvious, and the person grading your Scantron will be able to spot it right away. [5] X Research source"
    },
    {
      "title": "Fact:",
      "content": "Fact: Making extra marks will just cause an error in the machine. If you draw on the black lines on the sides of your Scantron, you might fail the test. Scantrons that can’t go through the machine usually aren’t graded. [6] X Research source Some people also try writing on the black lines and then erasing them, which has the same effect."
    },
    {
      "title": "Fact:",
      "content": "Fact: All the tests after yours will fail, making it obvious what you did . If you switch from the teacher’s answer key to your own, there’s no way they aren’t going to notice. Plus, all they have to do is look at your Scantron to see that you wrote something extra on top. [7] X Research source This is maybe the riskiest cheating method of all, since it’s instantly noticeable and can’t be written off as a mistake."
    }
  ]
}