{
  "url": "https://www.wikihow.com/Install-Applications-on-an-iPod-Touch",
  "title": "How to Install Applications on an iPod Touch",
  "steps": [
    {
      "title": "Ensure that you are logged in with your Apple ID.",
      "content": "Ensure that you are logged in with your Apple ID. In order to download and install apps from the App Store, your iPod will need to be logged in with your Apple ID. See this guide to learn how to create an Apple ID and log in with it. You can double-check that you are logged in by opening the Settings app, selecting \"iTunes & App Store\", and then ensuring that your AppleID is displayed at the top of the screen. When creating an Apple ID, you will be asked for credit card information. This will be used for making purchases on the App Store. See this guide for instructions on creating an Apple ID without a credit card."
    },
    {
      "title": "Connect to a wireless network.",
      "content": "Connect to a wireless network. You will need to have an active wireless network connection in order to access the store and download apps. See this guide for details on connecting to a wireless network on your iPod Touch."
    },
    {
      "title": "Check for any system updates.",
      "content": "Check for any system updates. Updating your iPod will ensure that you have access to the most apps possible, as some apps are only available for the latest versions of iOS. See this guide for details on updating your iPod Touch."
    },
    {
      "title": "Open the App Store.",
      "content": "Open the App Store. Tap the App Store icon on your Home screen. This will open the main page of the App Store. You will need to have an internet connection."
    },
    {
      "title": "Search or browse for an app you want to install.",
      "content": "Search or browse for an app you want to install. You can use the search bar to look for specific apps, or you can browse through the categories on the main page. If this is your first iPod, check out the \"New to the App Store?\" section. This contains a selection of Apps that Apple feels are essential for most users."
    },
    {
      "title": "Check out the app details.",
      "content": "Check out the app details. When you select an app, you will see various details about it, including price, description, user reviews, and details on the company that created it. If you don't know much about the app, give the reviews a quick look over. You may be able to discover potential problems with the app. This is especially important if you're going to be purchasing the app. You don't want to buy an app that ends up not working properly."
    },
    {
      "title": "Buy or select the app.",
      "content": "Buy or select the app. If the app costs money, the price will be listed below the app image. Tap the price to purchase the app. If the app is free, it will say \"Free\" beneath the app image. Tap \"Free\" to add it to your app list. You will need to have a credit card associated with your Apple ID, or you will need to have redeemed an iTunes gift card. You may be asked to enter your Apple ID password if your account is set to ask for passwords upon purchase."
    },
    {
      "title": "Install the app.",
      "content": "Install the app. Once you've purchased that app (or tapped the \"Free\" button), the \"Install\" button will appear. Tap the \"Install\" button to begin downloading the app. The button will turn into a circle, and the progress will be displayed on the border. Wait for the app to download and install. Larger apps may take a while on slower connections."
    },
    {
      "title": "Open the app.",
      "content": "Open the app. Once the app has been downloaded and installed, you can run it like any other app. You can open the installed app from the Store page by tapping the \"Open\" button, or you can start the app from the Home screen."
    },
    {
      "title": "Ensure iTunes is updated.",
      "content": "Ensure iTunes is updated. In order to connect to the iTunes store, you will need to have the latest version of iTunes installed on your computer. See this guide for details on updating iTunes."
    },
    {
      "title": "Open the iTunes Store.",
      "content": "Open the iTunes Store. Click the Store menu and select Home . At the top of the window, click the \"App Store\" section. Click the \"iPhone\" tab to load iPhone and iPod Touch apps."
    },
    {
      "title": "Search or browse for an app you want to install.",
      "content": "Search or browse for an app you want to install. You can use the search bar to look for specific apps, or you can browse through the categories on the main page. If this is your first iPod, check out the \"New to the App Store?\" section. This contains a selection of Apps that Apple feels are essential for most users."
    },
    {
      "title": "Check out the app details.",
      "content": "Check out the app details. When you select an app, you will see various details about it, including price, description, user reviews, and details on the company that created it. If you don't know much about the app, give the reviews a quick look over. You may be able to discover potential problems with the app. This is especially important if you're going to be purchasing the app. You don't want to buy an app that ends up not working properly."
    },
    {
      "title": "Buy or select the app.",
      "content": "Buy or select the app. If the app costs money, the price will be listed below the app image. Click the price to purchase the app. If the app is free, it will say \"Free\" beneath the app image. Click \"Free\" to add it to your app list. You will need to have a credit card associated with your Apple ID, or you will need to have redeemed an iTunes gift card. You may be asked to enter your Apple ID password if your account is set to ask for passwords upon purchase."
    },
    {
      "title": "Connect your iPod to your computer via USB.",
      "content": "Connect your iPod to your computer via USB. Your iPod will appear in the Devices menu of iTunes."
    },
    {
      "title": "Sync your new app to the iPod.",
      "content": "Sync your new app to the iPod. This usually happens automatically. You can monitor the sync progress int eh display at the top of the window. If it doesn't sync automatically, select your iPod from the Devices menu, select the \"Apps\" tab, check the box next to the app you want to install, and click Apply"
    },
    {
      "title": "Install Cydia.",
      "content": "Install Cydia. Cydia is the package manager for jailbroken iOS devices. It is installed automatically when you jailbreak your device. Cydia allows you to install apps ad tweaks that are not normally allowed in the Apple App Store. See this guide for details on installing Cydia on your iPod Touch."
    },
    {
      "title": "Install GBA4iOS (Game Boy emulator).",
      "content": "Install GBA4iOS (Game Boy emulator). This emulator will allow you to play any Game Boy, Game Boy Color, or Game Boy Advance game on your iPhone. You will need to install the app directly from the website instead of installing from the App Store. See this guide for instructions on installing on iOS 6."
    }
  ]
}