{
  "url": "https://www.wikihow.com/Catch-a-Bird",
  "title": "How to Catch a Bird",
  "steps": [
    {
      "title": "Look both up and down.",
      "content": "Look both up and down. Birds can be hard to find because they’re small enough to hide under a lot of household items, but they can also fly up out of your line of vision. Finding them could require that you do some extensive searching. Start by verifying that they are not any place dangerous. Dangerous hideouts include water glasses, bathrooms, doorways, window, stoves, and sofas. Hard to find hideouts include curtain rods, plants, lamps, mantels, ceiling fans, picture frames, and underneath furniture. They can also hide inside objects like laundry baskets, boxes, and drawers. [2] X Research source"
    },
    {
      "title": "Stay cool.",
      "content": "Stay cool. Birds understand body language so screaming or frantic movement will cause them to be as anxious as you are. To ease their nerves you should speak softly and move at a normal pace. [3] X Research source"
    },
    {
      "title": "Make the cage inviting.",
      "content": "Make the cage inviting. Your bird will be more likely to fly back to its cage if it likes being there. The cage should be someplace near where people congregate, so that it stays interested, but should also be away from windows, which birds believe leave them susceptible to danger. Have a variety of toys in the cage to make it interesting. Finally, give your bird a special treat whenever it goes into the cage. Do not give the bird the same treat on any occasion other than returning to the cage, else it might find going back to the cage less special. [4] X Research source Never use time in the cage as punishment; this will create negative associations with the cage. [5] X Research source"
    },
    {
      "title": "Don’t make the outside too inviting.",
      "content": "Don’t make the outside too inviting. It is a bad idea to give your bird food outside of the cage, because this encourages it to believe that it will never need to go back to the cage for anything. Similarly, reserve the bird’s favorite toys for inside the cage. Finally, don’t build up the expectation that your bird can be outside all the time. Instead of letting it out all day once a week, try to establish a consistent amount of daily time out of the cage to manage expectations. While you don’t want to make the outside too inviting, you should make sure that your bird gets a good amount of exercise out of the cage. It’s good for its health and a tired bird will be easier to put back in the cage./trainedparrot.com/Caging/</ref> It can also help to time your birds outside time up with a regular sleeping schedule. That means, put it back in the cage every night before returning to bed. As the lights begin to go off it will understand that it is time to rest."
    },
    {
      "title": "Call to your bird as he is flying away.",
      "content": "Call to your bird as he is flying away. If you are there when your bird flies away, call after him using a calm but loud voice. If he realizes he is suddenly in the wild and doesn’t want to be, he will be able to immediately make his way home following the sound of your voice. Seeing his cage might inspire your bird to fly down to you right away, as this is a familiar object in a very unfamiliar world. [6] X Research source"
    },
    {
      "title": "Keep your eyes on your bird.",
      "content": "Keep your eyes on your bird. Chances are your bird will not fly terribly far away, as birds that spend most of their times in their cages tend to not be such strong flyers. Keep your eyes on it until it is out of sight. Pay attention to how low it was flying and how tired it looked; these indicate that it may have landed just out of your line of vision."
    },
    {
      "title": "Go to where you last saw it in the air.",
      "content": "Go to where you last saw it in the air. Ask some friends or family members to go with you, as a group of people searching for a bird will be more effective. When you get to the area where you last saw your bird, spread out and circle around the area."
    },
    {
      "title": "Bring another pet bird with you.",
      "content": "Bring another pet bird with you. If you have another pet bird that your escaped bird gets along with, bring this bird with you in her cage. Place the cage where you can see it. The bird in the cage will most likely start calling out to you which in turn might inspire your lost bird to start calling. Listen for your escaped bird’s call."
    },
    {
      "title": "Call out for your bird.",
      "content": "Call out for your bird. If you don’t have another pet bird, you should try to call to your escaped bird with your voice. Use words and tones that your bird knows or mimics to let him know that it is you. He might call back to you if he is in the area."
    },
    {
      "title": "Keep your search to a one-mile radius at first.",
      "content": "Keep your search to a one-mile radius at first. Pet birds will generally not go far once they have escaped your home. Look in trees, on lawns, and in bushes. Note that during your search, your bird might see you before you see him. Sometimes, birds will get quiet when their owner is near because they feel more comfortable. [7] X Research source"
    },
    {
      "title": "Bring your bird’s cage to the area where you found him.",
      "content": "Bring your bird’s cage to the area where you found him. Once you have located your bird, you should coax it to you. Do not try to grab your bird, no matter how excited you are to see him. You must remain calm or else you could startle your bird into flying again."
    },
    {
      "title": "Bring your bird’s favorite toys with you.",
      "content": "Bring your bird’s favorite toys with you. To lure your bird into the cage, you should bring its favorite toys and treats. If the bird is particularly fond of one person, try to have them present as well. All of these items can be used to lure your bird back to you. [8] X Research source"
    },
    {
      "title": "Call your bird.",
      "content": "Call your bird. If you have trained your bird to step up on to your index finger, call out “up.” If well trained, it should come to you on its own."
    },
    {
      "title": "Capture it.",
      "content": "Capture it. Avoid grabbing your bird, as this can permanently ruin your relationship for a while, but if you cannot get it to perch, it might be absolutely necessary to do so. If a hose is readily available, spray the bird with large amounts of water in a short period of time. This will make it heavy so that it cannot fly off. Grab it in a way that will secure it in your hands, without applying too much pressure; birds are delicate. If you or your friends lack experience holding a bird, try throwing a pillow case around it instead. It is important not to be too gentle with the hose. If you don’t get the bird sufficiently wet quick enough, it will only be frightened off. Have friends scattered around to watch what direction the bird flies if it escapes. If they can find a high perch for a good view, even better. Nighttime can be a good time to catch a bird. They often are tired. Furthermore, if you shine a high powered flashlight in their face, they might be blinded long enough for another person to grab them."
    },
    {
      "title": "Hold the bird gently to prevent harm.",
      "content": "Hold the bird gently to prevent harm. If the bird resists capture begin by throwing a towel or a pillow case over it to prevent it from flying off. Once the bird is in your hands, you will want to secure its heads, feet, and head without pushing them into awkward positions or slowing the bird's breathing. A towel can help you secure the bird without applying too much pressure. Covering its face will also reduce the threat that the bird will see something that causes stress. However, you should be sure that it is a breathable cloth towel that does not obstruct the flow of oxygen to the bird. [9] X Research source"
    },
    {
      "title": "Leave your other birds in their cages by an open window.",
      "content": "Leave your other birds in their cages by an open window. Birds that don’t spend much time outside probably will not recognize their home. However, your bird may be drawn back home by the sound of their bird calls. You can also try leaving your bird’s cage along with lots of your bird’s favorite food on your front lawn or doorstep. Your bird will be drawn to the familiar cage (and his favorite food)."
    },
    {
      "title": "Place a trap.",
      "content": "Place a trap. If you can purchase a trap at a pet store and place it outside with food. This will draw them in. Otherwise, you can try placing an extra cage on your roof with some food and watch for signs of your bird. Either way, it should be placed as high as possible, because birds prefer to be in the air. Check frequently, because your bird will likely panic when captured. You will want to use what is called a \"live trap,\" which traps the bird without causing physical harm to it. Typically, this will be a cage trap, which, like it sounds, is a cage that will trap any bird that steps inside."
    },
    {
      "title": "Visit a veterinarian after recapture.",
      "content": "Visit a veterinarian after recapture. It is extremely probable that a domesticated bird left in the wild for an extended period of time will contract some sort of illness or suffer from malnutrition. Take your bird to a vet as soon as possible to check for any problems. Don’t be disheartened if your bird doesn’t reappear immediately though. Some birds can live for years in the wild."
    },
    {
      "title": "Keep calm.",
      "content": "Keep calm. It is important to remember that while you are probably upset that there is a bird in your house, that bird is most likely terrified. The worst thing you could do would be to start screaming and throwing things at the bird--this will only cause it to panic and flutter around your house in a frenzy. Stay calm and remember that the bird is much more scared than you are. [10] X Research source"
    },
    {
      "title": "Corral your pets away from the bird.",
      "content": "Corral your pets away from the bird. If a bird does get into your house, you should put your pets in a room and shut the door so that the bird cannot get in (and your pets can’t get out). In particular, cats love to chase birds. [11] X Research source"
    },
    {
      "title": "Close all doors to other rooms.",
      "content": "Close all doors to other rooms. You want to contain the movement of the bird by forcing it to stay in one room. To do this, you should shut all of the doors leading to other rooms so that the bird has no choice but to stay in the room it is in. If the doorways leading into the room don’t have doors, you can hang towels or blankets in them so that they are blocked. Use push pins to hold the towel or blanket up."
    },
    {
      "title": "Lower your blinds and turn off lights.",
      "content": "Lower your blinds and turn off lights. Closing blinds will reduce the likelihood that the bird will accidentally fly into a closed window thinking that it is an exit. Moreover, if you shut off all light sources, aside from one open window, the bird will be drawn to the window and ultimately should try to fly out. [12] X Research source"
    },
    {
      "title": "Open one window.",
      "content": "Open one window. If you leave one open window and eliminate all other light sources, the bird should generally be drawn to it. Stay calm or else you will attract the bird’s attention. Give the bird approximately thirty minutes before trying a new course of action."
    },
    {
      "title": "Use a sheet to encourage the bird to fly out.",
      "content": "Use a sheet to encourage the bird to fly out. Take a large sheet and hold it with your hands extended as far upward and outward as possible, so as to cover your person. Walk toward the bird shaking the sheet, to scare it in the direction of the window. Be careful not to touch the bird roughly. Birds are gentle and susceptible to damage from even relatively light contact. [13] X Research source"
    },
    {
      "title": "Call a professional.",
      "content": "Call a professional. Ultimately, some birds are going to want to stay in your house despite all encouragement and certain large predatory birds are too dangerous to engage with. If you are having trouble, research local wildlife removal online and call a professional for assistance. [14] X Research source"
    },
    {
      "title": "Contact local wildlife authorities.",
      "content": "Contact local wildlife authorities. Regulations strictly limit what you can do in response to a nuisance bird. However, there are steps that can be taken if birds are destroying your property, their droppings are becoming a health hazard, or they are obstructing the use of gutters. Wildlife authorities might be able to give you a special permit to trap the bird, or provide suggestions about how to drive them off. Remember, migratory birds will only be around temporarily; it might be best to wait them out."
    },
    {
      "title": "Install bird repellents.",
      "content": "Install bird repellents. There are a number or devices that can legally be used to drive off birds. These sound emitting devices that scare birds off when they approach an area. Products like the Prowler Owl are designed to trick birds into believing that predators are around. Chemical Polybutylene repellents can also be applied to surfaces that birds are attracted to. Before installing any of these, you should clean bird droppings from the surface. Ultrasonic emitters have not been found to be effective. Devices intended to scare birds with loud sounds and bright visuals are also less effective in urban areas, where birds have often acclimated to such distractions."
    },
    {
      "title": "Construct physical obstructions.",
      "content": "Construct physical obstructions. If you know where the birds like to nest, you can build obstructions that will prevent them from settling there. Install a block of wood on ledges at a 45 degree angle so that they can't settle there. Net meshes can be constructed over exterior surfaces."
    },
    {
      "title": "Train your bird.",
      "content": "Train your bird. You should train your bird to step up on your index finger. Place your index finger in front of it, say a command like \"up\", and give it a treat every time it steps up. Practice this even when you aren’t putting it back in the cage, so it doesn’t assume that step up practice will translate into going back into the cage. In fact, sometimes you should put it in the cage and let it come back out, so that it does not know for sure that returning to the cage translates into a prolonged period of enclosure. [15] X Research source If it runs away whenever you approach it, try hand feeding it with a treat until it is comfortable with your hands being in the cage and sees them as a good thing. If it won't step up, try pushing up gently with your finger, or pushing your finger slightly closer to its knees. You can also coax it with a treat. Try rewarding it even if it only steps up halfway, at least until it learns to step up all the way. Try pushing up while it is holding on if it refuses to step up completely. You can try practicing with things other than your finger, includes sticks. Ladders can be particularly useful because birds naturally like to walk up them. Training your bird to do this can be an easy way to get them back into the cage. Because birds like to move upward, your bird will often grow fonder of this trick if you begin to lift your finger slowly after it steps up. [16] X Research source Some people recommend that you perform this procedure every time you return your bird to its cage. The idea is that, if you allow it to fly back on its own volition it might come to believe that it sets its own schedule for outside time."
    },
    {
      "title": "Hold your bird so that it can’t fly off.",
      "content": "Hold your bird so that it can’t fly off. Once you have it on your index finger, you need to secure your bird so that it can’t fly off, but also so that it is still comfortable. One way to do this is to press your thumb lightly against your index finger, securing the birds feet to your finger. Alternatively, you can hold your other hand over its back gently, so that it will not be able to extend its wings out. [17] X Research source You should practice these positions during regular training, so that your bird becomes accustomed to them and does not anticipate that it means a return to the cage. Also, if it becomes second nature, you will be less likely to forget to secure it and allow it to fly off when it is someplace foreign or dangerous. [18] X Research source"
    },
    {
      "title": "Ask your veterinarian about trimming your bird’s wings.",
      "content": "Ask your veterinarian about trimming your bird’s wings. If you are having trouble controlling your bird, you can have its wings trimmed, permitting it to fly only a little or not at all, depending on how short they are clipped. [19] X Research source This can, however, be counterproductive, because your bird will not tire itself outside of the cage and might be less willing to return."
    }
  ]
}