{
  "url": "https://www.wikihow.com/Cope-when-Your-Friend-Stops-Talking-to-You",
  "title": "What to Do If a Friend Won’t Talk to You",
  "steps": [
    {
      "title": "Ask your friend to talk with you about what happened.",
      "content": "Ask your friend to talk with you about what happened. Sometimes, a conversation can make everything clearer. Reach out to your friend and ask if they’d be willing to talk. Who knows? Their silence may be completely accidental. And if it’s not, this is a great opportunity to talk about what’s been on both of your minds. [1] X Research source Try reaching out the way you’d normally communicate, whether that’s via text, social media, or phone call. Reach out when the timing feels right. Avoid trying to talk to them during stressful or busy times, and give them a little space first if you’ve had a falling out. Avoid bombarding them with messages. Reach out once, and then see what happens. If they continue to ignore you even after you reach out, know that it may be better to walk away rather than continue to confront them."
    },
    {
      "title": "Determine what went wrong.",
      "content": "Determine what went wrong. There may be a reason why your friend stopped talking to you. Consider whether you might have said something unkind or hurtful to your friend. Remember, nobody is perfect—everybody makes mistakes. What matters most is taking responsibility for your actions and ensuring you don’t make the same mistakes again. [2] X Research source A friend might stop talking to you if you failed to support them, were selfish, accused them of something, or had a heated argument. If you truly don’t know why a friend stopped talking to you, ask mutual friends for advice or if they know something you don’t. Keep in mind that it’s not usually just one thing that causes a friendship to drift apart but a series of behaviors and instances. Taking responsibility can look like apologizing and righting your behavior."
    },
    {
      "title": "Know that nothing may have gone wrong.",
      "content": "Know that nothing may have gone wrong. It’s very possible that you’ve done nothing wrong to your friend or the friendship. Sometimes, people grow in different directions or put their own wrongdoings on you. If that’s the case, do what’s best for you—maybe that’s apologizing just because or standing firm and walking away from the friendship. [3] X Research source It can be difficult to realize, but sometimes, ignoring someone is a way of silently breaking off a friendship. Try to acknowledge the reasoning behind your friend’s behavior. Maybe they’re in a new relationship or are under a lot of stress. While these aren’t excuses to be silent, they can help you better understand why they’re treating you this way. [4] X Research source"
    },
    {
      "title": "Apologize to your friend.",
      "content": "Apologize to your friend. If you’ve hurt your friend or done something to upset them, take responsibility and apologize for your actions. Be honest and avoid making excuses to offer amends. Explain that you understand how hurt they are by what you did and that it won’t happen again. [5] X Research source If you want to continue the friendship, explain that you're happy to resume being friends whenever it feels right for them. No pressure, no judgment. Make sure to keep any promises you make. Actions speak louder than words, so do your best to avoid making the same mistakes that hurt your friend. Give your friend time to consider your apology. Things may not heal immediately, so give your friend time and space to think about your apology. [6] X Research source Reader Poll: We asked 599 wikiHow readers who’ve argued with a loved one, and 59% of them agreed that the best way to show your commitment to rebuilding the relationship is by apologizing and taking responsibility for your actions . [Take Poll]"
    },
    {
      "title": "Know that it’s okay to let go of the friendship.",
      "content": "Know that it’s okay to let go of the friendship . Sometimes, taking a step back is healthier than trying to mend a friendship. Maybe you’ve reached out or tried to make amends multiple times and continue to be ignored or gaslit. A friend who continues to ignore or make you feel bad isn’t worth your time or energy, even if you did something wrong. If they’re not willing to hear your apology, know that there will be other people who will. [7] X Research source Losing a friend can be hard, but remember to take care of yourself . Know that you’re not alone, and even though the world seems dark now, things can and will get better."
    },
    {
      "title": "Know that friendships come and go.",
      "content": "Know that friendships come and go. With time, you grow and evolve, and so do your friends. Friends can move away, drift apart, or take different paths. And that’s all okay—it’s a natural part of life. Keep this reality in mind and know that losing one friend doesn’t mean you’ll never connect with someone again. [8] X Research source"
    },
    {
      "title": "Stay positive and be judgment free.",
      "content": "Stay positive and be judgment free . Judging your friend, yourself, or the situation can make it harder to cope and heal. When you hold negative emotions, you amplify your suffering and feelings of disconnection. So, do you best to avoid judgment and look at the situation optimistically . [9] X Research source For example, rather than looking at what you lost from the friendship, look at what you gained. Maybe you learned something about yourself or how to handle similar conflicts in the future."
    },
    {
      "title": "Know that you can’t control other people’s actions.",
      "content": "Know that you can’t control other people’s actions. At the end of the day, the only thing you can control is yourself. You can’t control if your friend ignores you, accepts your apology, or wants to make amends. All you can do is control how you respond, react, and behave moving forward. So, stay true to yourself, learn from your mistakes , and do what you can to improve your life . [10] X Research source"
    },
    {
      "title": "Seek solace with other friends and family members you can trust.",
      "content": "Seek solace with other friends and family members you can trust. The silent treatment can be hard, especially coming from a close friend. If you’re feeling lonely, confused, or frustrated, try reaching out to a trusted loved one for guidance or a listening ear. Sometimes, talking it out or hanging out with other friends can bring you clarity. [11] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Know that you’re not alone, no matter where you are in the coping process. If you’re struggling mentally, consider talking to a therapist. They can give you personalized advice and guidance."
    },
    {
      "title": "Redirect your energy.",
      "content": "Redirect your energy. It can be easy to wallow in what happened—losing a friend can be incredibly hard—but know that your life doesn’t have to be sorrowful. Try redirecting your energy into something positive and uplifting to brighten your mood and distract yourself. [12] X Research source Do something that’ll bring you happiness and peace. Journal your thoughts to help process what happened. [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Go for a walk every day to help clear your head and unplug. Dive into a new hobby to find joy in something new."
    },
    {
      "title": "Remember that life moves on.",
      "content": "Remember that life moves on. Even though it sounds cliché and may not be exactly what you want to hear right now, it’s true. No matter what trial or tribulation you’re being challenged with, it and the feelings it comes with will soon pass. Life continues—the world keeps spinning. It may take time, but you can and will heal. Just take it day by day. [14] X Research source"
    },
    {
      "title": "Silence from a friend hurts because your feelings are dismissed.",
      "content": "Silence from a friend hurts because your feelings are dismissed. If a friend purposely avoids or ignores you, it can make you feel small and shut out. This can be painful because you may not know why you’re being given the silent treatment, and if you do, you’re not given a chance to apologize and make up for it. Many psychologists say that the silent treatment is the worst type of emotional abuse because of this. [15] X Research source The silent treatment from a friend can be especially painful because you share experiences, fond memories, and happiness together. Having a close friend can greatly impact your life, and their silence can leave a hole in your heart. [16] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Keep in mind that not every bit of silence is deliberate. Sometimes, a friend can go MIA because they’re overwhelmed with work, relationships, family matters, etc."
    },
    {
      "title": "A friendship is likely over if you feel uneasy about it.",
      "content": "A friendship is likely over if you feel uneasy about it. Friendships are meant to make you feel good and uplifted. Your closest pals should help you feel comfortable, supported, and loved! If this friend makes you question yourself, doesn’t support you, or abuses your kind or apologetic nature, it may be time to end things. [17] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source A good friend won’t make you compromise your values or always agree with them. Know that not all friendships have to end badly or permanently. Sometimes, people just go down different paths. You can still be cordial with them, but maybe you simply take a step back and aren’t as close as you once were, and that’s okay."
    }
  ]
}