{
  "url": "https://www.wikihow.com/Prepare-a-Bill-of-Quantities",
  "title": "How to Prepare a Bill of Quantities in Construction",
  "steps": [
    {
      "title": "Use the spreadsheet to list materials you'll need to complete your project.",
      "content": "Use the spreadsheet to list materials you'll need to complete your project. Set up your spreadsheet so that each row is a material you'll need to complete your project. Use the columns to organize the following information about each material: [1] X Research source Item number (could be a serial number or part number) Description Unit of measurement Quantity Rate per unit (to be filled in by contractors bidding on the project) Total cost of material (to be filled in by contractors bidding on the project)"
    },
    {
      "title": "Pull materials from the architect's plans.",
      "content": "Pull materials from the architect's plans. The architect's plans include specifications for various building materials used to complete the design. Write down dimensions as well—these will come in handy when you're estimating the amount of a material you'll need. [2] X Research source The name and specifications for each material go into the \"description\" column of your BOQ spreadsheet. For example, if you're building a house, you might need framing materials, sheetrock, bricks, concrete, flooring materials, wiring, lighting fixtures, and kitchen and bathroom fixtures. Be as specific as possible with your description. Include the dimensions of the surface or area, the thickness of the material you need, and any other details that might impact the quality of the material."
    },
    {
      "title": "List specific materials needed in each category, even if they repeat.",
      "content": "List specific materials needed in each category, even if they repeat. Different parts of your project will likely be handled by different contractors. Your BOQ tells each contractor what they will need for the project so they can prepare their bid. This doesn't mean you need a new spreadsheet for each category—just divide one spreadsheet into sections. For example, if you're building a house, you might have separate categories for framing, electrical, plumbing, and flooring. Since both framing and flooring require nails, each of these categories would have a row for \"nails\" under each category. Traditionally, each row is numbered consecutively from \"1,\" with the numbers starting over for each category or section."
    },
    {
      "title": "Enter the unit of measurement for each material, then the amount you need.",
      "content": "Enter the unit of measurement for each material, then the amount you need. In the column you created for \"unit of measurement,\" enter the unit used for each material. These are usually standard units, such as feet (meters) or gallons (liters). Then, in the \"quantity\" cell, enter the amount of that unit that you need for that material. [3] X Research source For example, if part of your project includes painting a room, you might list \"gallon\" as the unit of measurement for the paint, then \"10\" as the number of gallons of paint you need. Add 15-20% to each material calculation to account for waste. Sometimes your unit of measurement will reflect how that particular material is sold. For example, if cable is one of your materials, and that cable is sold in spools of a standard size, you could use \"spool\" as your unit of measurement."
    },
    {
      "title": "Quantify labor in terms of the man-hours needed to complete a task.",
      "content": "Quantify labor in terms of the man-hours needed to complete a task. A man-hour is, roughly, the amount of work that can be done by a single person skilled at that work in one hour. How you specifically define this depends on the size and scope of your project and the type of labor you need. [4] X Research source For example, if a brick wall is part of your project, you would need to know how many bricks the average bricklayer can lay in one hour—that would be your man-hour, roughly, although it would also need to account for other aspects of bricklaying, such as mixing mortar. Different contractors may work with different crew sizes. Your total number of man-hours helps contractors figure out what size crew they need for the job. Based on the number of bricks you need for your brick wall, it might take 200 man-hours for the build. But for a team of 5 bricklayers could get it done in 40 hours—so maybe a week to 10 days. On top of your basic man-hours include time for rest breaks and meals. This is still a very conservative estimate because you can't account for things that might happen once work starts. Talk to contractors to get an idea of how long it would take to complete a given task. A quantity surveyor would usually be able to estimate this off the top of their head, based on their experience with similar projects."
    },
    {
      "title": "Evaluate bids from contractors based on the cost estimate you draw up.",
      "content": "Evaluate bids from contractors based on the cost estimate you draw up. Figure out the average prices for materials and labor in your area by calling suppliers and talking to contractors. BOQs from similar projects that were recently completed can also help you come up with a cost estimate. [5] X Research source Your initial cost estimate gives you a benchmark that helps you rate the feasibility of the bids you get in. Don't include these numbers in the BOQs you give to contractors—just keep them for your own reference. It might not be strictly necessary to make an initial cost estimate for every project, but they can actually save you a lot of time on larger projects where you have a lot of bids to sort through."
    },
    {
      "title": "Set a timeline for completing each construction task.",
      "content": "Set a timeline for completing each construction task. The man-hours you've calculated will give you a rough idea of when each task needs to be done. It's a loose schedule since you can't account for a lot of things, such as weather, that could cause delays. But even a loose schedule helps potential contractors figure out if they can work on the project. [6] X Research source For example, if you've estimated it will take a total of 1,000 man-hours to build your house, it would take 25 hours for contractors to complete the build (assuming they all work 40 hours a week with no delays). You might set a schedule for 30-40 weeks."
    },
    {
      "title": "Call contractors and provide them with a basic run-down of the project.",
      "content": "Call contractors and provide them with a basic run-down of the project. If the contractor says they're interested and have the time to commit to your project, go ahead and forward them your BOQ. They'll go through it and enter their estimates in the columns for \"rate per unit\" and \"total cost.\" [7] X Research source If you have experience managing a building project, you can save some money by overseeing the project yourself. Otherwise, you'll likely want to hire a main contractor to manage and supervise the project. Always verify the contractors' licenses and check their references before you solicit bids from them. Ask your architect or quantity surveyor for contractor recommendations. They tend to know people in the industry and can tell you who you should talk to (and who you should stay away from)."
    },
    {
      "title": "Use your BOQ to compare contractor bids so you can choose the best fit.",
      "content": "Use your BOQ to compare contractor bids so you can choose the best fit. With a BOQ, each contractor who bids on a project uses the exact same materials and labor estimates as the basis of their bid. You can easily compare the numbers they've provided without needing to break them down at all. [8] X Research source This is where your initial cost estimate comes in handy. If a contractor submits a bid significantly lower than your initial cost estimate, you know to be skeptical."
    },
    {
      "title": "Use your BOQ for material scheduling, cost analysis, and other project planning.",
      "content": "Use your BOQ for material scheduling, cost analysis, and other project planning. As your project progresses, your BOQ gives you a good idea of what's coming up next so you can plan ahead. Knowing what needs to happen and when keeps you flexible so you can adjust your plans as needed to account for any unforeseen delays. [9] X Research source For example, what if there's a shortage of a particular material you need to complete the flooring? Looking at your BOQ, you could push ahead with another part of the project that isn't dependent on flooring so your project stays on schedule."
    }
  ]
}