{
  "url": "https://www.wikihow.com/Memorise-Long-Text-in-the-Shortest-Amount-of-Time-Possible",
  "title": "Quick Ways to Memorize Long Texts and Paragraphs",
  "steps": [
    {
      "title": "Divide the text into separate actions or objectives.",
      "content": "Divide the text into separate actions or objectives. Once you read through the text you want to memorize a few times, patterns will start to emerge. Use these patterns or themes in the text to split it up into smaller units. Your units won't necessarily correspond to whole paragraphs or even whole sentences. Rather, each smaller unit should discuss a single idea. [2] X Research source For example, if you're trying to memorize Abraham Lincoln's Gettysburg Address, your first chunk might be the first line of the speech, in which Lincoln talks about the founding of the United States. The second chunk might relate to Lincoln's description of the civil war, then the third to the battlefield Lincoln was consecrating that day. Despite being separate chunks, the second and third chunks make up the same paragraph. [3] X Research source Look for phrases you already know that you won't have to work as hard to commit to memory. For example, if you already remember the phrase \"four score and seven years ago\" from the Gettysburg Address, you don't need to worry about memorizing that. Sometimes it can also help to reformat the text. You might hand-write or type the text out with plenty of space between the chunks. You might even include separate headings for each of the chunks."
    },
    {
      "title": "Practice each chunk separately.",
      "content": "Practice each chunk separately. Now that you've found your chunks, start with the first one and repeat it until you feel comfortable with it and can recite it without looking at the text. Then move on to your second chunk and do the same. [4] X Research source Get a good familiarity with each of the chunks separately before you start to combine them. If there is a particular area of your original chunk that's giving you trouble, try separating it into even smaller chunks. Then you can combine those smaller chunks together once you've got them down."
    },
    {
      "title": "Combine the first chunk with the second chunk.",
      "content": "Combine the first chunk with the second chunk. Once you have a handle on your chunks, it's time to put them together so you can eventually memorize the whole text. Start with the first text and try to recite it from memory. But this time, instead of stopping with the first chunk, move on to the second chunk. [5] X Research source Practice the first and second chunk together until you can recite them flawlessly. Then you're ready to add the third chunk."
    },
    {
      "title": "Repeat the process until you've memorized the entire text.",
      "content": "Repeat the process until you've memorized the entire text. Once you have the first and second chunk combined as a unit, move on to the third chunk and practice all three together. This reinforces your memory of the earlier chunks as well. Keep adding new chunks until you've reached the end of the text you want to memorize. [6] X Research source If you run into rough spots, stop and go back over them until you can recite them smoothly. Then integrate that part into the rest of the chunk. Throughout the process, keep your eye out for transitions that you can use as triggers to combine the chunks together seamlessly. If these transitions aren't in the text, add them mentally to help you connect the chunks — just remember not to say them out loud."
    },
    {
      "title": "Map out a familiar place in your mind.",
      "content": "Map out a familiar place in your mind. The memory palace technique, also known as the \"loci technique,\" has been around since the ancient Greeks. The idea is to think of a familiar place in your mind, then attach the text you want to memorize to the location you already have memorized. That place becomes your \"memory palace.\" [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It's often easiest to use your home, since you're intimately familiar with the rooms and the objects inside. Your place can also be a fictitious place that you're deeply familiar with. For example, if you're a big fan of Harry Potter and have a familiar map in your head of Hogwarts, you could use that. Your \"memory palace\" doesn't have to be a single building or location. It can also be a route from one place to another. For example, you might use your route from home to work or school."
    },
    {
      "title": "Assign parts of the text you want to memorize to rooms in the \"palace.\"",
      "content": "Assign parts of the text you want to memorize to rooms in the \"palace.\" Go through your text and break it down into small bits. These could be as short as phrases or as long as paragraphs. Think about the rooms in your \"memory palace\" and the objects within them. Set a logical starting point and start connecting bits of the text to the objects in the room. The objects don't necessarily have to exist in the room. You can simply place them there in your mind. For example, if you're trying to memorize Hamlet's soliloquy, you might imagine a letter \"B\" on the door of a room. When you open the room, there are arrows and slingshots pelting you from a large bag of gold coins. If you close the door and move down the hall, there are arms reaching out that grab you and carry you across a turbulent ocean. [8] X Research source"
    },
    {
      "title": "Walk through your palace to connect the pieces together.",
      "content": "Walk through your palace to connect the pieces together. When you enter your palace mentally and walk through it, you'll encounter each piece of the text you're trying to memorize. Thread them together as you move through the palace, always taking the same route each time. It will probably take several walkthroughs for you to have the text down, but each walkthrough will reinforce your mental association between the visual image and the text. [9] X Research source If you encounter pieces that are difficult to remember, you may want to rethink the object you have associated with that piece or break it up into smaller pieces associated with multiple objects."
    },
    {
      "title": "Use the mental image to recall the text you want to memorize.",
      "content": "Use the mental image to recall the text you want to memorize. When you want to recite the text you've memorized, take yourself mentally back to your memory palace. As you walk through the rooms, recite the text based on the objects you encounter. This technique may take some practice to master. If you're up against a deadline, it may not be the best time to create a memory palace. However, once you've used it a few times, you may find it enables you to memorize text more quickly. If you used a route rather than a place, you can travel through the text you're trying to memorize every day as you head to work or school. You could even try it in reverse as you go back home. Then you'd be able to say you know the text \"backward and forward.\""
    },
    {
      "title": "Memorize the first letter of each word of the text to create a shortcut.",
      "content": "Memorize the first letter of each word of the text to create a shortcut. Memorizing something is as much about your ability to recall the information as it is about committing it to your memory. To exercise your ability to recall, make a new page with only the first letter of each word in the text. Include punctuation so you can identify sentences and pauses. Then try to recall the text using only those first letters. [10] X Research source For example, if you were trying to memorize Hamlet's soliloquy from Shakespeare's Hamlet, you would write \"t b, o n t b? t i t q — w 't n i t m t s t s a a o o f, o t t a a a s o t, a, b o, e t?\" [11] X Research source Then you would see how many words you could get just from those first letters. Circle the letters that correspond to words you couldn't remember and then go back to the text. Use your favorite memorization technique to better commit those words to your memory in the context of the text, then try the first letters again. This trick is also useful if you're trying to recall something you memorized a long time ago but haven't thought about since. You might be surprised how much you'll recall."
    },
    {
      "title": "Turn the words into a song to help you remember them.",
      "content": "Turn the words into a song to help you remember them. The melody and rhythm of a song attach to the text and make it easier for you to remember. Use a familiar melody or a favorite song that you can fit the text into. It doesn't matter if the lines rhyme (they likely won't), as long as you can make it work as a song. [12] X Research source If you're musically inclined, you could try recording yourself playing the song. You may also be able to find an instrumental version of the song on your favorite streaming service. Educational programs, such as \"Schoolhouse Rock,\" often create songs for historical documents and speeches. Search the internet or your favorite video streaming service and see what you can find."
    },
    {
      "title": "Walk around as you recite the memorized text to stimulate your brain.",
      "content": "Walk around as you recite the memorized text to stimulate your brain. Once you've committed the text to memory, you'll find you have better recall if you're able to move around while reciting it — especially if you were moving around while you memorized it. Being active stimulates blood flow to your brain to make it easier to recall a text you've memorized. [13] X Research source Feel free to gesticulate as well to really get into the emotion of the text. The more passion and emotion you attach to it, the better you'll be able to remember it."
    },
    {
      "title": "Connect images to the text if you're a visual learner.",
      "content": "Connect images to the text if you're a visual learner. You may find it easier to remember pictures than words, in which case this technique might work for you. [14] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. Similar to the memory palace technique, try to come up with an image for each of the main words in the text. Your brain will typically be able to fill in articles and other small words automatically. [15] X Research source For example, if you were trying to memorize Abraham Lincoln's Gettysburg Address, you might think of an image of your father, an image of the United States, an image of the Statue of Liberty, and an equal sign to represent the first line: \"Four score and seven years ago our fathers brought forth on this continent a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal.\" If you enjoy emoji, you might try \"translating\" the text into emoji. Since those images are already familiar to you, it might make the text easier to remember. Writing the passage over and over may also help if you're a visual learner. [16] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020."
    },
    {
      "title": "Record yourself reading the text if you're an auditory learner.",
      "content": "Record yourself reading the text if you're an auditory learner. Some people can more easily commit things to memory by listening to them over and over. If that's you, record yourself reading the text you want to memorize so you can listen to it. The act of speaking and listening may enhance your memory. [17] X Expert Source Alexander Ruiz, M.Ed. Educational Consultant Expert Interview. 18 June 2020. [18] X Research source If you dislike the sound of your own voice, you can always get someone else to read the text for you. However, you'll get less of a benefit by listening to someone else's voice than you would if you listened to your own voice. If you're trying to memorize a relatively famous text, you may also be able to find recordings online of famous actors or other celebrities reading the text."
    }
  ]
}