{
  "url": "https://www.wikihow.com/Put-Spell-Check-on-Facebook",
  "title": "How to Put Spell Check on Facebook",
  "steps": [
    {
      "title": "Sign into your Facebook account.",
      "content": "Sign into your Facebook account. Create a new Google Chrome browsing tab and visit Facebook at www.facebook.com. If you’re not yet signed in, enter your account details on the allocated text fields and click the “Sign In” button to proceed to your account."
    },
    {
      "title": "Post a status.",
      "content": "Post a status. Click the Update Status text field at the very top of the page and start typing in the status that you want to post."
    },
    {
      "title": "Enable Google Chrome’s Spell-Check tool.",
      "content": "Enable Google Chrome’s Spell-Check tool. Make a right-click on the Status Update text field and choose “Spell-Check Options” from the pop-out menu. Select the “Check the spelling of text fields” from the slide-out menu that will appear to enable Google Chrome’s built in Spell-Check tool. Every time you misspell a word, a red line will appear below it telling you that the word is wrongfully spelled."
    },
    {
      "title": "Correct spelling.",
      "content": "Correct spelling. To correct the spelling, right-click on the underlined word and a list of possible correct choices will appear. Select one of the suggested words from the list and it will replace the one that you misspelled."
    },
    {
      "title": "Sign into your Facebook account.",
      "content": "Sign into your Facebook account. Create a new Mozilla Firefox browsing tab and visit Facebook at www.facebook.com. If not yet signed in, enter your account details on the allocated text fields and click the “Sign In” button to proceed to your account."
    },
    {
      "title": "Post a status.",
      "content": "Post a status. Click the Update Status text field at the very top of the page and start typing in the status that you want to post."
    },
    {
      "title": "Enable Mozilla Firefox’s Spell-Check tool.",
      "content": "Enable Mozilla Firefox’s Spell-Check tool. Make a right-click on the Status Update text field and select “Check Spelling” from the pop-out menu. You’ll see a check mark beside this option when the Mozilla Firefox’s Spell-Check tool is active. Every time you misspell a word, a red line will appear below it telling you that the word is wrongfully spelled."
    },
    {
      "title": "Correct spelling.",
      "content": "Correct spelling. To correct the spelling, right-click on the underlined word and a list of possible correct choices will appear. Select one of the suggested words from the list and it will replace the one that you misspelled."
    },
    {
      "title": "Sign into your Facebook account.",
      "content": "Sign into your Facebook account. Create a new Safari browsing tab and visit Facebook at www.facebook.com. If not yet signed in, enter your account details on the allocated text fields and click the “Sign In” button to proceed to your account."
    },
    {
      "title": "Post a status.",
      "content": "Post a status. Click the Update Status text field at the very top of the page and start typing in the status that you want to post."
    },
    {
      "title": "Enable Safari’s Spell-Check tool.",
      "content": "Enable Safari’s Spell-Check tool. Make a right-click on the Status Update text field and choose “Spelling and Grammar” from the pop out menu. Select the “Check Spelling While Typing” from the slide out menu that will appear to enable Safari’s built in Spell-Check tool. Every time you misspell a word, a red line will appear below it telling you that the word is wrongfully spelled."
    },
    {
      "title": "Correct spelling.",
      "content": "Correct spelling. To correct the spelling, right-click on the underlined word and a list of possible correct choices will appear. Select one of the suggested words from the list and it will replace the one that you misspelled."
    },
    {
      "title": "Sign into your Facebook account.",
      "content": "Sign into your Facebook account. Create a new Internet Explorer browsing tab and visit Facebook at www.facebook.com. If not yet signed in, enter your account details on the allocated text fields and click the “Sign In” button to proceed to your account."
    },
    {
      "title": "Post a status.",
      "content": "Post a status. Click the Update Status text field at the very top of the page and start typing in the status that you want to post."
    },
    {
      "title": "Enable Internet Explorer’s Spell-Check tool.",
      "content": "Enable Internet Explorer’s Spell-Check tool. Make a right-click on the Status Update text field and choose “Language” from the pop out menu. Select the language you prefer from the slide-out menu that will appear to enable Internet Explorer’s built in Spell-Check tool. For a more accurate spell-checking, select “English (United States)” from the list of language available. Every time you misspell a word, a red line will appear below it telling you that the word is wrongfully spelled."
    },
    {
      "title": "Correct spelling.",
      "content": "Correct spelling. To correct the spelling, right-click on the underlined word and a list of possible correct choices will appear. Select one of the suggested words from the list and it will replace the one that you misspelled."
    }
  ]
}