{
  "url": "https://www.wikihow.com/Know-if-You-Are-in-a-Parasitic-Relationship",
  "title": "How to Know if You Are in a Parasitic Relationship",
  "steps": [
    {
      "title": "Ask yourself if your partner has to do everything with you.",
      "content": "Ask yourself if your partner has to do everything with you. It's definitely possible to have almost everything in common, but it's still healthy to do some things separately and have some solitude. [1] X Research source Your partner may say that they love you a lot and want to be with you all the time. [2] X Research source [3] X Expert Source Tara Vossenkemper, PhD, LPC Licensed Professional Counselor Expert Interview. 27 October 2021. If every single time you step out of the house, even if it's just to pick up a prescription from the pharmacy or to get coffee, you hear your partner say, \"I'll come, too!\" then they may be a parasite. If you suddenly notice that your partner is always doing the things you used to love doing alone, from morning yoga to taking a walk after dinner, then they may be a parasite. If your partner also cannot do anything by themself, whether it's to have a coffee date with a new acquaintance or to get an oil change, and is always asking you to come along, then you may be in a parasitic relationship."
    },
    {
      "title": "Consider whether you have any separate friends.",
      "content": "Consider whether you have any separate friends. Have you suddenly noticed that all of your friends have become your partner's friends? To some degree, this is normal, but if ever since you got serious, all of your partner's own friends have fallen off the radar in favor of yours, that's a red flag. [4] X Research source This may be your significant other's way of ensuring you stay together forever. After all, who wants to deal with the awkwardness of breaking up when you have the exact same friends? If your significant other never had any other friends to begin with, this should also be another cause for concern. This is a sign that the person isn't capable of forming close bonds with people they aren't dating. [5] X Research source"
    },
    {
      "title": "Be cautious about paying for everything.",
      "content": "Be cautious about paying for everything. Sure, everyone gets strapped for cash from time to time, but if you find that you're the one always paying for dinner, movies, trips, gas, and the big things, like the person's education, child support, rent and other bills, then it's worth examining if this is an arrangement you're comfortable with, and how your partner would respond if you, for example, lost your income. If the person you're dating takes it as a given that you will take care of them, sit down and have a talk pronto. [6] X Research source Your partner may want control over your finances. [7] X Research source [8] X Expert Source Tara Vossenkemper, PhD, LPC Licensed Professional Counselor Expert Interview. 27 October 2021. The person might even say, \"I'd love to go out to dinner, but you know I'm so broke this month.\" This is a way of tricking you into paying while making you think it's your idea. Even if you have tons of money to spare, this should still be a warning sign. If the person you're dating is so willing to take advantage of your money, they will be just as willing to take advantage of your emotions."
    },
    {
      "title": "See if you're doing excessive favors for your partner.",
      "content": "See if you're doing excessive favors for your partner. In a healthy relationship, partners take turns doing favors for each other whenever one person needs a little help. In a parasitic relationship, one partner is always doing favors for the other and getting nothing in return. If you find that you're giving your partner rides everywhere, cooking all the meals or picking them up, running errands for him, and basically taking care of all the little things they're too lazy to do, then you may be infected by a parasite. [9] X Research source Though it may hurt, write two lists: one, a list of all the favors you've done for your partner, and two, a list of all the favors they've done for you. They don't match up, do they?"
    },
    {
      "title": "See if your partner is completely asocial.",
      "content": "See if your partner is completely asocial. This is another major problem. If any time you and your partner are out in public together, they refuse to talk to other people, demands your attention constantly, and generally shows no regard for others, then you need to rethink your priorities. It's one thing if your partner is really shy, but another if they are rude to others or just flat-out acts like they don't exist. [10] X Research source This is a sign that the person doesn't see a life outside of you. If you find that when the two of you go out, you have to constantly spend all of your time by your partner's side or they get hurt or jealous, then you have a problem."
    },
    {
      "title": "See if your partner is upset any time you do your own thing.",
      "content": "See if your partner is upset any time you do your own thing. In any healthy relationship, both partners should feel comfortable doing their own thing. This can mean hanging out with your own friends, getting some quality family time, or just reading, running, or pursuing your own hobbies on your own time. If your partner truly loves and cares about you, then they should be happy when you pursue your own interests and grow as a person on your own. [11] X Research source If your partner is hurt, angry, jealous, or distant whenever you leave the house without them, even if you're just grabbing coffee with your cousin Sally, then they resent your individuality. If your partner checks in on you and asks when you'll be home every five minutes when you're out, then they may be a parasite. It may not be possible to convince them even though you show your phone or tell them where you have been. [12] X Research source [13] X Expert Source Tara Vossenkemper, PhD, LPC Licensed Professional Counselor Expert Interview. 27 October 2021."
    },
    {
      "title": "See if other people have voiced concern about your relationship.",
      "content": "See if other people have voiced concern about your relationship. When people voice concern about your relationship, it's natural to get defensive and to feel even more determined to prove everyone wrong by trying as hard as you can to make things work. But if you find that your friends, family members, and pretty much everyone in your orbit is worried that your significant other is taking advantage of you, then there may be some truth to what they're saying. When you tell these people they're wrong, you end up driving them away. Then your partner gets exactly what they want -- even more of your time and attention."
    },
    {
      "title": "Notice if your partner is always talking about his or her problems.",
      "content": "Notice if your partner is always talking about his or her problems. If you can't even remember the last time you shared your deepest fears or doubts with your partner, then you're in hot water. If you feel like your significant other is always the one who is talking, upset, getting comfort, and seeking and getting your love and attention, then you have a problem. It's okay if your partner is having a bad month, but if you feel like there is always something wrong in his or her life, then you may be getting used for emotional support. In a healthy relationship, both partners get to talk about their problems and concerns equally. If you feel like your partner is doing at least 80% of the talking and you're not particularly shy, then you have a problem. If any time you mention yourself, your partner tries to make your problems seem smaller by saying that they have it so much worse, then you have a problem."
    },
    {
      "title": "Notice if you never get to share your feelings.",
      "content": "Notice if you never get to share your feelings. [14] X Research source If you're afraid to share your feelings because you think your partner will get angry and misunderstand you, or if you don't share your thoughts and feelings because you know your partner won't really listen, then you have a problem. You should feel just as comfortable about sharing your thoughts, fears, and hopes as your partner does. Both people should be able to share in a relationship, and if every time you try to talk about yourself, your partner says they're busy or tired, interrupts you and tries to make it all about themself, or just gets a glazed look that makes it they aren't listening, then you may be getting used."
    },
    {
      "title": "Notice if there's no such thing as a compromise in your relationship.",
      "content": "Notice if there's no such thing as a compromise in your relationship. You're in a parasitic relationship if you feel like, no matter what, your partner always ends up getting exactly what they want. You may find yourself giving in just because it's easier than fighting, because your partner will be mad if they don't get what they're after, or simply because you've convinced yourself that they must want it more. In a healthy relationship, partners work together to find a decision that can make them both happy, and take turns \"giving in\" to each other. Sure, it's not a big deal to give in on some of the small stuff, like about where to have dinner or what to watch on TV. But this habit can make it easier for you to give in on the big things, like deciding where to move together."
    },
    {
      "title": "Notice if you never hear any words of appreciation.",
      "content": "Notice if you never hear any words of appreciation. When is the last time you heard your partner say how much you mean to them? If you can't even remember, then you may be getting used and taken for granted. Your partner may think it's a given that you know how much they love you and how special you really are, but if your partner really cares about you, then they would tell you, not just assume that you know. If you don't even get thanked for all of the favors you're doing, then you are definitely getting taken advantage of. If your partner never compliments you or tells you how nice you look on date night, then you may be being used."
    },
    {
      "title": "Notice if you constantly have to tell your partner how much you love them.",
      "content": "Notice if you constantly have to tell your partner how much you love them. That's right. Your partner almost never tells you how amazing you are, but you find yourself feeling like you have to say \"I love you\" twenty times a day so the person doesn't feel like you're neglecting him or not giving him enough love and affection. [15] X Research source If you feel like you have to tell your partner how much you love him, how great he is, and how much you value him fifty times a day just to help him be less needy, then you have a problem. In a healthy relationship, both partners should compliment each other and say \"I love you\" around the same amount -- and only when they actually mean it."
    },
    {
      "title": "See if you feel guilty any time you don't give in.",
      "content": "See if you feel guilty any time you don't give in. This is an important one. Have you noticed that any time you say no or don't give your partner exactly what they want, your partner gets deeply disappointed. You shouldn't give in to your partner just because they are sad that you didn't meet their request, just like you shouldn't give in to a child throwing a tantrum in public. You shouldn't feel bad about not giving in to your partner's ridiculous requests. [16] X Research source Guilt should not be the driving force in any healthy relationship. Do you find yourself constantly doing things for your partner where you sacrifice all your pleasures just to make them happy? If you do not fulfill their wishes, do they withdraw from you until you give in? Are you made to feel that your partner is nothing without you or can not survive without you. These are signs that you may be in a parasitic relationship."
    },
    {
      "title": "See if you feel drained of energy after hanging out with your partner.",
      "content": "See if you feel drained of energy after hanging out with your partner. Do you often find yourself feeling drained out after spending time with your partner? A parasite doesn't just drain your wallet and free time. But they can rip you off your energy levels—spiritually, emotionally and physically. A parasitic partner can suck the life out of you. You are constantly giving them emotional, financial support, convincing them that everything is okay, and they can even drag you into their problems making you feel equally responsible for whatever miserable state they are in. In a healthy relationship, partners empower each other and make each other feel like anything is possible. In a parasitic relationship, one partner drains the other partner's energy, making him feel incapable of doing anything."
    },
    {
      "title": "See if you feel like you're losing your identity.",
      "content": "See if you feel like you're losing your identity. If you're in a parasitic relationship, then your significant other may be trying to make you feel like you're losing your sense of self; your partner will want this sense of self to be replaced by your sense of yourself as a part of a couple, as a being in a relationship. If you're forgetting who you really are and feel like you're losing track of all of the things that make you special and happy, then you may be in a parasitic relationship that is making you feel a loss of identity. In a healthy relationship, two people gain a stronger sense of themselves as they bond together as a couple; in a parasitic relationship, one person tries to take on the qualities of the other person and doesn't give him any time to figure out who he really is."
    },
    {
      "title": "See if you're starting to feel used.",
      "content": "See if you're starting to feel used. If you suspect that you're getting used, then it's likely that you probably are. If you get the sense that your significant other is only with you because of your apartment, your car, your money, or your ability to comfort them at all hours of the night, then you should get out of the relationship as soon as you can. If you feel like you're giving a ton of support and getting no support at all, even in the most basic things, like getting a \"good luck!\" note before a big exam, then you may be getting used by your partner. [17] X Research source Ask yourself, would your partner still be with you if it wasn't for your nice apartment/new car/big bank account/good looks? If you even hesitate a second before answering, then you're getting used. Reader Poll: We asked 1399 wikiHow readers what they would do if they found out a girl was using them, and only 5% of them said ignore it and continue the relationship as is. [Take Poll] So, if you're feeling used and you decide to leave the relationship, you wouldn't be alone."
    },
    {
      "title": "See if you stop feeling like your goals or desires matter at all.",
      "content": "See if you stop feeling like your goals or desires matter at all. This is another way that a parasite can drain you of your own identity. If you're sacrificing everything so that your significant other can follow his dreams, finish school, move closer to his or her family, or pursue his favorite hobby for hours a day, then you may be in a parasitic relationship. In a healthy relationship, both partners have individual goals and work to get them to align; in a parasitic relationship, one person's goals become the focus of the relationship. You may not even have noticed that you've stopped caring about becoming a nurse or a chef because you're too busy trying to help your partner find his or her way. If your partner never even asks about what you want for your future or how you see your career five years down the line, then it may be because they are only interested in themself."
    }
  ]
}