{
  "url": "https://www.wikihow.com/Cook-Frozen-Pierogies",
  "title": "How to Cook Frozen Pierogies",
  "steps": [
    {
      "title": "Boil them in the microwave for the quickest option.",
      "content": "Boil them in the microwave for the quickest option. Add the frozen pierogi to a large, microwave-safe bowl. Add enough water to cover the pierogi completely. Microwave the bowl on high power for 5 minutes, then carefully remove the bowl and check that the pierogi are hot and tender. Drain them and serve. 5 minutes of cooking is usually adequate for a 16 oz (450 g) package of about 12 frozen pierogi. Don’t cover the bowl while microwaving."
    },
    {
      "title": "Use the stove for the classic boiling option.",
      "content": "Use the stove for the classic boiling option. For a 16 oz (450 g) package of around 12 frozen pierogi, boil at least 2 US qt (1.9 l) of water in a large pot. Add the frozen pierogi and boil them until they all float, and then for 1-2 minutes more—typically 5-7 minutes total. Either drain the pot or scoop out the cooked pierogi with a slotted spoon and serve. [1] X Research source Remember that these frozen pierogi are already fully cooked, so you really just need to heat them through. If you’re planning to boil and then saute the pierogi, you can remove them from the boiling water as soon as they all float. Dry them quickly with paper towels before sauteing them."
    },
    {
      "title": "Saute the pierogies, either when still frozen or after boiling them.",
      "content": "Saute the pierogies, either when still frozen or after boiling them. Heat about 0.25 c (59 ml) of butter, olive oil , or a combination of the 2 in a large skillet over medium heat. Carefully place the pierogi in the pan and cook them until they are tender, heated through, and very lightly browned. Turn them regularly while cooking. If you’re sauteing straight from frozen, it will usually take around 8-10 minutes to cook a 16 oz (450 g) package of about 12 pierogi. If you’ve already boiled the frozen pierogi, it will only take 2-3 minutes to lightly brown them. [2] X Research source"
    },
    {
      "title": "Bake frozen pierogi for a slightly crispier alternative.",
      "content": "Bake frozen pierogi for a slightly crispier alternative. Preheat the oven to 400 °F (204 °C), and place a 16 oz (450 g) package of about 12 frozen pierogies on a baking sheet that you’ve lightly greased with cooking spray. Bake the pierogies for 18-20 minutes, turning once halfway through, until the pierogi are heated through and slightly browned. For added browning, add some cooking spray to the tops of the pierogi before baking, or brush them with a bit of melted butter ."
    },
    {
      "title": "Deep-fry the pierogi if you like them really crispy.",
      "content": "Deep-fry the pierogi if you like them really crispy. Choose a large, deep skillet or pot and add a 2–3 in (5.1–7.6 cm) layer of cooking oil (for example, vegetable, canola, or peanut oil). Heat the oil to 350 °F (177 °C), then carefully add the frozen pierogi one at a time with a slotted spoon. Cook them for at least 4 minutes (until they all float), then remove them from the oil and lay them on a paper towel-lined plate. Use a kitchen thermometer to determine the temperature of your oil. Make sure you have enough oil to fully submerge the pierogi. If your pan or pot isn’t large enough to fit an entire 16 oz (450 g) package of pierogi, cook them in 2 or more batches. Do not drop the pierogi into the oil, or it may splatter."
    },
    {
      "title": "Bring 2 US qt (1.9 l) or more of salted water to a boil.",
      "content": "Bring 2 US qt (1.9 l) or more of salted water to a boil. Pour the water into a large pot and place it over high heat on the stove. Add a heavy pinch of salt to the water as it comes to a boil. Use 2 US qt (1.9 l) of water for every 8-10 pierogi—roughly 12–16 oz (340–450 g)."
    },
    {
      "title": "Add the frozen pierogi, stir them, and adjust the heat.",
      "content": "Add the frozen pierogi, stir them, and adjust the heat. Once the water is at a full boil, place the frozen pierogi into the pot, being careful not to splash hot water. They’ll sink right away, so give the pot a good stir so the pierogi don’t stick to the bottom. Adjust the heat as needed to maintain the water at a very gentle boil. [3] X Research source Keep the pot uncovered while boiling the pierogi."
    },
    {
      "title": "Boil the pierogi until they float.",
      "content": "Boil the pierogi until they float. This will usually take around 5 minutes total. If you are going to finish cooking the pierogi by sauteing them in a skillet, they’re ready to remove from the water at this point. [4] X Research source If, however, you want to serve them only boiled (that is, not boiled and then sauteed), let them cook for another 2-3 minutes after they float to the surface. Then, drain the water or remove the pierogi with a slotted spoon and stir them in a bowl with a bit of butter and/or olive oil. They’re ready to serve at this point."
    },
    {
      "title": "Dry the boiled pierogi with paper towels if you’re going to saute them.",
      "content": "Dry the boiled pierogi with paper towels if you’re going to saute them. After you boil the pierogi in water until they float (around 5 minutes), remove them with a slotted spoon and place them on a plate lined with a paper towel. Pat the tops of the pierogi with another paper towel to remove any excess water. If you don’t remove the excess water from the pierogi, the oil will “spit” and splatter when you place them in the skillet to saute them."
    },
    {
      "title": "Heat 0.25 c (59 ml) of butter and/or oil in a large skillet.",
      "content": "Heat 0.25 c (59 ml) of butter and/or oil in a large skillet. Place the skillet over medium heat and add butter, olive oil, or a combination of the two. Preheat the pan and oil for 2-3 minutes. This amount of oil is sufficient for 16 oz (450 g) of pierogi (about 12 pierogies)."
    },
    {
      "title": "Saute the pierogi for 3-4 minutes, then turn them.",
      "content": "Saute the pierogi for 3-4 minutes, then turn them. Carefully add the pierogi one at a time to the heated oil. Space the pierogi out so they don’t touch—if there isn’t room, cook them in batches. Let them cook for 3 minutes, then check the undersides. If they’re not yet golden brown, cook them for another minute."
    },
    {
      "title": "Flip the pierogi and finish cooking them.",
      "content": "Flip the pierogi and finish cooking them. When the pierogi are browned to your liking on the bottom, flip them over with a spatula and cook them for another 3-4 minutes. When the other sides are nicely browned as well, remove them from the pan and serve."
    },
    {
      "title": "Melt 4 tbsp (60 g) of butter in a large skillet.",
      "content": "Melt 4 tbsp (60 g) of butter in a large skillet. Place the skillet over medium heat. It will take around 2-3 minutes for the butter to melt. [5] X Research source If desired, you can use 2 tbsp (30 g) of butter and 0.125 c (30 ml) of olive oil."
    },
    {
      "title": "Add 12 frozen, pre-cooked pierogi to the pan.",
      "content": "Add 12 frozen, pre-cooked pierogi to the pan. Carefully place the frozen pierogi in the pan one at a time so they don’t cause the melted butter to splatter. [6] X Research source You’ll get about 12 pierogi in a standard 16 oz (450 g) package of frozen pierogi. If you are using uncooked frozen pierogi, you should boil them on the stove (until they float) or in the microwave (for 5 minutes), then pat them dry before adding them to the skillet."
    },
    {
      "title": "Put 0.75 c (180 g) each of sliced onions and mushrooms into the skillet.",
      "content": "Put 0.75 c (180 g) each of sliced onions and mushrooms into the skillet. Simply dump the sliced onions and mushrooms on top of the pierogies, then nestle them down in between the pierogi with a spatula. [7] X Research source If you don’t care for mushrooms, you can use 1.5 c (360 g) of onions instead and omit the mushrooms."
    },
    {
      "title": "Cover the skillet for 2 minutes, then turn the pierogi.",
      "content": "Cover the skillet for 2 minutes, then turn the pierogi. Place the lid on the skillet and allow the pierogi, onions, and mushrooms to cook for 2 minutes over medium heat. Then, lift off the lid, flip over all of the pierogi, and stir the onions and mushrooms a bit with your spatula. [8] X Research source You should notice some slight browning on the pierogi at this point."
    },
    {
      "title": "Cook the pierogi for 2 more minutes in the covered skillet.",
      "content": "Cook the pierogi for 2 more minutes in the covered skillet. Put the lid back on the skillet and let everything cook for another 2 minutes. Then take the lid off, flip the pierogi over, and stir the veggies once more. [9] X Research source"
    },
    {
      "title": "Cover the skillet and keep checking the pierogies every minute.",
      "content": "Cover the skillet and keep checking the pierogies every minute. Keep uncovering the skillet, flipping the pierogi, and stirring the onions and mushrooms until everything is browned to your liking. It will likely take 14-16 minutes total for the pierogi to heat through and become nicely browned on the outside. [10] X Research source If the pierogi have browned in 12 minutes or less, turn down the heat to medium-low and cook them for a total of at least 14 minutes. Press down on the pierogi to make sure they are soft and heated through in the middle. Once they’re nicely browned, the pierogies are ready to serve and enjoy!"
    }
  ]
}