{
  "url": "https://www.wikihow.com/Read-Bunny-Body-Language",
  "title": "How to Read Bunny Body Language",
  "steps": [
    {
      "title": "Look for an excited jump in the air.",
      "content": "Look for an excited jump in the air. If you've ever seen your rabbit suddenly jumps up while kicking their legs or twisting mid-air, you might have witnessed a \"binky\". This playful behavior is a sign of a very happy rabbit. [1] X Research source Your bunny might perform a binky or two while running around and playing. Sometimes your rabbit will binky just because they feel like it."
    },
    {
      "title": "See if your bunny flops over.",
      "content": "See if your bunny flops over. Your rabbit might suddenly fall and flip over onto their side, sometimes rolling onto their back. This maneuver, typically called \"flopping\", might appear alarming at first, but is another sign of a very relaxed bunny. [2] X Research source A flopping rabbit is one that feels they are completely safe and comfortable in their environment."
    },
    {
      "title": "Watch for circling behavior.",
      "content": "Watch for circling behavior. You might notice that your rabbit sometimes runs circles around you or runs around between your legs performing mini figure eights. This usually means an excited and happy bunny, or maybe just one that is expecting a treat from you. Either way, it's a good sign that your rabbit is very pleased to see you. [3] X Research source"
    },
    {
      "title": "See if they nudge your hand.",
      "content": "See if they nudge your hand. Using their nose to nudge your hand can mean that they like you or want you to pet their head, but it could also mean that they want that part of you to move out of their way. A gentle nudge typically indicates a happy bunny, while a more harsh nudge might be from an impatient bunny. Pay attention to the situation and circumstances that the bunny is using their nose and you will begin to see what they are trying to tell you."
    },
    {
      "title": "Observe how your rabbit lays down.",
      "content": "Observe how your rabbit lays down. A relaxed bunny will often sprawl when they lay down. They'll lay flat on their side or belly with their back legs relaxed to the side or stretched out behind them. [4] X Research source If your rabbit sprawls near you, this is a good sign that they trust you. This facet of bunny body language is straightforward. A bunny with a very relaxed pose indicates an equally relaxed bunny. In the wild, rabbits need to be ready to run at a moments notice. But if it looks like your rabbit would need to get up before running away, that's a sign that they don't view you as a threat. They may also lay with all their legs tucked in beneath them in a loaf position. Their face should look calm, with their eyes slightly closed and their ears pointed slightly backwards in a relaxed pose."
    },
    {
      "title": "Look for a rabbit standing on their hind legs.",
      "content": "Look for a rabbit standing on their hind legs. Bunnies will sometimes \"periscope\" when they are curious about their surroundings. This means they stand on their hind legs and scan the area, twisting their head to look around or sniffing the air. This is an alert and curious rabbit that simply wants to learn more about their surroundings. If a curious bunny is investigating something, they may approach it cautiously with their neck stretched out and their ears angled forward."
    },
    {
      "title": "See if your rabbit starts to rub their chin on things.",
      "content": "See if your rabbit starts to rub their chin on things. \"Chinning\" is a natural behavior for rabbits and is a way for them to mark their territory. Rabbits have scent glands under their chin which they rub on objects to leave an odorless scent. This tells other rabbits that they own this thing, whether it be you, a toy, or a table leg. Your rabbit might do this when exploring a new area or if presented with new objects. [5] X Research source"
    },
    {
      "title": "Watch out for nipping.",
      "content": "Watch out for nipping. Though it may seem like more of an aggressive behavior, a rabbit that gently bites is often just trying to get your attention. They might be attempting to groom you, or asking for some pets instead. [6] X Research source To discourage this behavior, loudly shout \"ouch!\" whenever your bunny gives you a nip and pull away. Don't pet or interact with them after a bite. The loud sound and lack of attention should communicate to your rabbit that nipping won't get them what they want."
    },
    {
      "title": "See if they thump their hind legs.",
      "content": "See if they thump their hind legs. If your bunny stomps one of their hind legs on the ground, they are trying to send a message. \"Thumping\" is a rather cute display, but it's also a sign of a worried or angry rabbit. Thumping may occur if your rabbit is upset with you. Stomping of their back paw could also mean that there is danger around or they are very worried. A single thump is often all your rabbit needs to get the point across, but continued thumping can mean your rabbit is afraid of something. Try to calm them down or distract them with a small treat. [7] X Research source Make sure there is nothing nearby that might be frightening your rabbit."
    },
    {
      "title": "Look for pinned back ears and a crouched position.",
      "content": "Look for pinned back ears and a crouched position. If you notice that your rabbit has their ears completely pinned back against their body, they might be feeling nervous. They will usually be in a tense, crouched position. They might look like they're trying to flatten themselves to the ground. A bunny in this position is nervous or feeling stressed. [8] X Research source Some rabbits may relax their ears back when they are calm or sleepy, so look for other signs of tension to confirm this is a result of stress."
    },
    {
      "title": "See if your rabbit gives you the cold shoulder.",
      "content": "See if your rabbit gives you the cold shoulder. If your rabbit makes a point to turn away from you and avoid contact, they might just be giving you the cold shoulder. This typically means your bunny is upset at you, maybe because you rearranged their enclosure or clipped their nails recently. This is a harmless behavior, but a possible sign that your rabbit is a bit angry with you at the moment. Give them some space and let them get over it."
    },
    {
      "title": "Look for them flicking their feet at you.",
      "content": "Look for them flicking their feet at you. After setting your rabbit down or approaching them, they might hop away from you and \"flick\" their back legs at you as they do. Rabbits sometimes do this when they're upset with you. It might be a good idea to give them some time alone until they forgive you. [9] X Research source"
    },
    {
      "title": "Be careful if your rabbit lunges at you.",
      "content": "Be careful if your rabbit lunges at you. A territorial rabbit may lunge at you if you stick your hand in their personal space or when trying to grab them. Your bunny might swat at your hand, growl at you, or even bite. If a rabbit feels cornered or threatened, they may resort to lashing out and lunging at you. A rabbit might also lunge if they're feeling territorial and protective of their property. [10] X Research source If you are lunged at, remove your hand or part of your body speak softly then slowly move your hand towards the bunny again and they shouldn't lunge at you over time. Sometimes they will lunge at you and if you flinch but leave your hand there, just in front of them, they will take a minute, sniff and nudge your hand with their nose - this is good, it means they are getting to know you as a friend and the lunging will gradually go away."
    },
    {
      "title": "Look for a rabbit in a boxing position.",
      "content": "Look for a rabbit in a boxing position. A rabbit that is very upset might stand up on their hind legs and try to swat at your with their raised front paws. This is sometimes called \"boxing\" and is a display of aggression from your rabbit. [11] X Research source This aggression might stem from fear or stress. A rabbit in a boxing position is attempting to defend itself and should be left alone to calm down."
    },
    {
      "title": "Leave your rabbit alone if they show teeth.",
      "content": "Leave your rabbit alone if they show teeth. If your rabbit shows you their front teeth, this can be an aggressive warning that they might be about to bite. Your rabbit may stand with their head pointed up at you with their teeth bared, they will look tensed up and more aggressive than a worried rabbit. [12] X Research source Leave them alone and keep your hands away from their face to avoid getting bit."
    },
    {
      "title": "Listen for growls or grunts.",
      "content": "Listen for growls or grunts. Rabbits are typically very quiet animals that don't tend to vocalize very often. When rabbits are angry, they will growl or grunt to tell you how they are feeling. Pay attention to when they do this and learn what they prefer. If the rabbit is provoked further, it may also scream. This startling and often very unpleasant sound is a result of extreme distress or possibly pain. Seek veterinary attention if your rabbit screams without an apparent cause."
    }
  ]
}