{
  "url": "https://www.wikihow.com/Make-a-Guy-Cry-over-Text",
  "title": "How to Make a Guy Cry over Text",
  "steps": [
    {
      "title": "Tug at his heart strings by telling him he's always on your mind.",
      "content": "Tug at his heart strings by telling him he's always on your mind. Do the same for your guy and show him that he's always on your mind. Send him sincere and loving texts during the day just to say hello and tell him that you miss him when he's not there. \"I had a dream about you last night and woke up smiling.\" \"This is your daily reminder that I'm crazy about you. ♥️\" \"You're in my thoughts when I wake up and when I go to sleep—and I wouldn't have it any other way.\""
    },
    {
      "title": "Earnest compliments will make him feel valued and admired.",
      "content": "Earnest compliments will make him feel valued and admired. Think about all the traits that make him a great significant other. Is he honest, loyal, smart, or supportive? Be specific with your compliments; tell him what you love about him and why. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source \"Your positivity is infectious. I always feel my best when I'm around you.\" \"Your confidence inspires me to be more confident in myself, too. Thank you for always being yourself! ♥️\""
    },
    {
      "title": "Show him that you recognize and appreciate all he does for you.",
      "content": "Show him that you recognize and appreciate all he does for you. Gratitude strengthens any relationship, and verbalizing your thanks over text will give your guy an instant happiness boost. Tell him what you're thankful for, and speak up when he goes above and beyond for you! \"You're always so calm and thoughtful with me, and that's what I love about you.\" \"I know you truly love me because of all the sacrifices you've made. Thank you for always being there for me.\""
    },
    {
      "title": "Trust is a vital part of any relationship.",
      "content": "Trust is a vital part of any relationship. He will feel exceptional when you tell him how much you trust him and how easy it is to be yourself around him. Reflect on how you have built up trust between one other over time, or talk about the ways that he has proven himself to be a reliable and trustworthy partner for you. \"The best part about being with you is that I can be myself too; nothing feels forced. You're my true love.\" \"I feel so protected in your arms. I know I can rely on you for anything!\""
    },
    {
      "title": "Offer him emotional support and be respectful of his feelings.",
      "content": "Offer him emotional support and be respectful of his feelings. Show him that you'll be there for him when he's having a bad day, and let him know that you're always happy to talk, listen, and help him through anything that life throws at him. Seeing how deeply his partner cares for his emotional well-being will move him to tears. [2] X Research source \"I'm sorry you had a rough day. I'll be there soon, and we can talk about anything.\" \"You can always count on me for love and support. I'm here for you, my darling!\""
    },
    {
      "title": "By recognizing his success, you can make him feel great about himself.",
      "content": "By recognizing his success, you can make him feel great about himself. Congratulate him earnestly when he gets that promotion at work or meets a new milestone at the gym. Be enthusiastic and happy for him; the more you emphasize how proud you are of him, the more emotional he'll become. \"You should be so proud of yourself, my love. I know I am!\" \"Congratulations, love. I have never doubted that you can do anything you set your mind to!\""
    },
    {
      "title": "Let him know you love him even when you're far apart.",
      "content": "Let him know you love him even when you're far apart. Whether he's away for the weekend or you're on the road for work, send him a text to let him know you miss him. He'll be touched when he knows how deeply you feel about his absence. \"We may be miles apart, but I'll be thinking of you the whole time I'm gone.\" \"Words can't describe how much I miss you. We'll be together again soon, my love! ♥️\""
    },
    {
      "title": "Remind him how compatible you two are as a couple.",
      "content": "Remind him how compatible you two are as a couple. Tell him why you make a great match, whether it's through shared values or common interests. Emphasize your belief that you two are a strong and like-minded couple, and he's bound to get emotional! \"You understand me as nobody else does. Our connection is magical!\" \"We spend hours together talking, and it feels like seconds. I'd say we're a perfect match, my love.\""
    },
    {
      "title": "Give him some insight into how he makes you feel.",
      "content": "Give him some insight into how he makes you feel. Describe the feelings you experience around him, using words like \"happy,\" \"content,\" and \"joy.\" Offer positive reinforcement so that he knows you're proud to have him as your partner. \"I thought I knew what love was. Then I met you, and you filled my life with true joy.\" \"You taught me what love was. I never knew I would feel so content in my life.\" \"I don't know how I got lucky enough to have you in my life, but I'll never take you for granted.\""
    },
    {
      "title": "Being open with him will let him show his own vulnerabilities comfortably.",
      "content": "Being open with him will let him show his own vulnerabilities comfortably. Show him that he can cry around you without fear of judgment or criticism. Let him know when something he says makes you teary-eyed, and normalize the idea of being openly emotional to one another. [3] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source \"I wouldn't trade being with you for anything else.\" \"Sometimes I get tears in my eyes just thinking about how much I love you.\""
    },
    {
      "title": "Make him cry by emphasizing how deeply you're in love with him.",
      "content": "Make him cry by emphasizing how deeply you're in love with him. Be honest about all the romantic feelings you have about him, and tell him in detail about how he makes you feel. You can show your love to someone in many ways, but just sometimes, you need to hear (or read) those words to feel reassured. \"I love the way you are, and I would never try to change you.\" \"My love for you grows stronger every day.\" \"I will happily tell you that I love you every day for the rest of my life.\""
    },
    {
      "title": "Make your guy feel special by telling him that he's \"the one.\"",
      "content": "Make your guy feel special by telling him that he's \"the one.\" Emphasize that you love him more deeply than any other guy and that you're not interested in being with anybody else. Your guy will feel confident and loved when you refer to him as \"the one.\" \"I spent a long time searching for \"the one,\" but now I know that it's always been you. \"You're the only person that I want to be with for the rest of my life.\" \"The truth is, I'm not just in love with you: you're the love of my life.\""
    },
    {
      "title": "Reassure your guy and tell him that you want to take on life by his side.",
      "content": "Reassure your guy and tell him that you want to take on life by his side. Long and happy relationships are formed by two people who accept each other's imperfections. Show him that you're willing to work on the relationship to make it a successful one. \"All relationships have ups and downs, but I can face anything with you. ♥️\" \"I know we can handle anything that life throws at us when we're together.\" \"We both have flaws, but we accept and love one another despite them. There's nobody else I'd rather be imperfect with than you.\""
    },
    {
      "title": "Describe a happy memory to make him get emotional.",
      "content": "Describe a happy memory to make him get emotional. Text him to reminisce about your first date or the moment you knew he was the one. Pick a memory you know he feels strongly about and make him feel like he's right back in the perfect moment you shared. \"Remember the day we met? I think I knew even then that we had a special connection.\" \"Our first kiss was magical. And every kiss since has been even better. 💋\""
    },
    {
      "title": "Talking about future plans demonstrates your love and commitment.",
      "content": "Talking about future plans demonstrates your love and commitment. Mention something you'd like to do with him years from now, or how clearly you can picture a future together. You don't have to get overly specific if you're not ready for that conversation, but you can hint that you want to be with him for the long haul. [4] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source \"I want to start building our future together. I'm positive that you're the guy for me!\" \"I can't wait to see what the future holds. With you beside me, I know everything will work out.\""
    }
  ]
}