{
  "url": "https://www.wikihow.com/Dispose-of-Landscaping-Rocks",
  "title": "How to Dispose of Landscaping Rocks",
  "steps": [
    {
      "title": "Try this if the rocks are piled up in a high-visibility spot.",
      "content": "Try this if the rocks are piled up in a high-visibility spot. For example, this can really work if you had a delivery of stones dumped on your front curb or driveway and don’t know what to do with the leftovers. Before long, someone will walk or drive by and decide they want to take home some free landscaping stones. [1] X Research source If you’re really eager to speed the process along, add “will help load” to your sign!"
    },
    {
      "title": "This might get faster results than the “free” sign.",
      "content": "This might get faster results than the “free” sign. Surely someone in your neighborhood is planning a landscaping job and wouldn’t mind some free rocks to help trim the budget. Pick out likely candidates and simply ask them if they’d like some free landscaping stones. Offer to help load the rocks if you wish, or specify that the task is up to them. [2] X Research source"
    },
    {
      "title": "Think of this as a “free” sign with a much wider reach.",
      "content": "Think of this as a “free” sign with a much wider reach. If you cast a wide enough net, you can nearly always find someone who’s willing to take something off your hands for free. Create a posting for Craigslist or similar classified ad sites, or go old-school and post a classified ad in your local newspaper. To avoid a scam or other problematic situation, it’s usually recommended to make the transaction in a public location, like a shopping center parking lot. This really isn’t a good option in this case, though, so you’ll have to be okay with the person coming to your home to get the rocks."
    },
    {
      "title": "Your odds are best if the rocks are free and in good shape.",
      "content": "Your odds are best if the rocks are free and in good shape. In other words, if the stones are piled up fairly neatly, free of twigs and other debris, relatively clean , and being offered free of charge, you’ll probably find a local landscaper who’s willing to come pick them up. [3] X Research source In fact, if you recently ordered a load of stones from a landscaper and have a leftover pile, that same landscaper may be willing to come pick them up. But don’t expect any money back!"
    },
    {
      "title": "Landfills usually accept rocks for free or for a small fee.",
      "content": "Landfills usually accept rocks for free or for a small fee. Before loading up your friend’s pickup with rocks, though, contact the landfill to clarify its policies and procedures. You don’t want to get there and find out they won’t accept the stones! [4] X Research source While “half-ton” pickup trucks get their moniker from their original recommended payload capacity of 1,000 lb (450 kg), most modern half-ton pickups can safely carry 3,000 lb (1,400 kg) in the truck bed."
    },
    {
      "title": "Contact charitable thrift shops that sell donated building supplies.",
      "content": "Contact charitable thrift shops that sell donated building supplies. Shops like Habitat for Humanity’s ReStore, for example, often sell donated landscaping materials along with a range of other building, home improvement, and home decor items. You’ll have to load up the rocks and bring them yourself, but think of that as part of your effort to serve the greater good! [5] X Research source"
    },
    {
      "title": "Recyclers turn rocks into road-paving material.",
      "content": "Recyclers turn rocks into road-paving material. Check your local government website for information on recyclers near you. They usually accept not only rocks but bricks, broken concrete, and chunks of asphalt. You’ll almost certainly be responsible for transporting the material to them, though, and there may even be a small fee involved. [6] X Research source"
    },
    {
      "title": "This is a good option if you literally have tons of rocks.",
      "content": "This is a good option if you literally have tons of rocks. The average full-size roll-off dumpster can handle a payload of around 20,000 lb (9,100 kg)—which is a lot of rocks—but the rental company may have a much lower weight limit of around 4,000–8,000 lb (1,800–3,600 kg) for safety reasons. So get clarification before you start filling the dumpster. [7] X Research source For reference, 1 cubic yard—that is, a 3 × 3 × 3 ft (91 × 91 × 91 cm) cube—of landscaping rocks weighs about 3,000 lb (1,400 kg). A roll-off dumpster rental typically costs around $400-$500 USD. [8] X Research source"
    },
    {
      "title": "Think of it as renting a dumpster and the workers to fill it.",
      "content": "Think of it as renting a dumpster and the workers to fill it. You’ll almost certainly pay more than if you just rent a dumpster, but you’ll save on some backbreaking labor as a trade-off. Also keep in mind that not all junk removal companies will haul away rocks, so make sure to ask this specifically before hiring one of them. [9] X Research source"
    },
    {
      "title": "It may be permissible to include rocks with household waste.",
      "content": "It may be permissible to include rocks with household waste. That said, your trash hauler or local government might instead prohibit landscaping materials like rocks, so definitely check first. If it is okay, closely follow any weight restrictions and other regulations. You might have to dispose of your stones little-by-little with each trash pickup. [10] X Research source If it’s prohibited where you live, but you don’t mind ignoring the rules and taking a long time getting rid of the rocks, you could probably get away with tossing a handful at a time in with each bag of trash."
    },
    {
      "title": "You might not need rocks now, but how about in a year or two?",
      "content": "You might not need rocks now, but how about in a year or two? You don’t have to worry about stones decomposing, so the real trick is finding an out-of-the-way storage spot. You might put them under a deck, behind a shed, or in a hidden corner of your property. You could even bury them! In the meantime, here are some rock re-use ideas to consider: [11] X Research source Surround the base of a tree with stones instead of mulch. Create natural looking edging along a planting bed. Make a rustic stone pathway through your garden. Mark out a property line. Lay them at the end of your home’s downspouts to prevent muddy patches in your grass. Clean them up and paint them as crafts. For most of these uses, rocks that are at least a couple inches in size are better than the small ones, since they could get washed off when it rains. A piece with more weight will stand the test of time a bit better."
    }
  ]
}