{
  "url": "https://www.wikihow.com/Deal-with-a-Stubborn-Person-in-a-Relationship",
  "title": "How to Deal with a Stubborn Person in a Relationship",
  "steps": [
    {
      "title": "Try to control your emotions before you respond.",
      "content": "Try to control your emotions before you respond. It can be really challenging to deal with someone who's stubborn. Sometimes you might even get the feeling that they get satisfaction out of seeing you get upset when they refuse to budge on something. You'll get a lot further if you can keep yourself even-keeled, so if you feel yourself getting frustrated, take a couple of deep breaths or leave the room for a moment until you feel like you're in control again. [1] X Research source If you start to get angry or upset, your partner might feel like your point of view isn't rational, which can make them stick to their perspective even more stubbornly. [2] X Research source"
    },
    {
      "title": "Ask yourself why this is important to them.",
      "content": "Ask yourself why this is important to them. [3] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021. It might aggravate you when your partner refuses to budge, but that doesn't necessarily mean they're wrong. Take some time to dig in a little deeper and see if you can see things from their point of view. Even if you don't agree with them, this can make it a lot easier to work together toward a solution that makes you both happy. [4] X Research source When you give your partner a chance to explain themselves, you might discover that they're actually refusing to replace their worn-out shoes because they're feeling really stressed about finances and they're not sure they can afford the extra expense. [5] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021."
    },
    {
      "title": "Make plenty of time for positive connections.",
      "content": "Make plenty of time for positive connections. If you often find yourself butting heads with your partner, it can help to remind them that in the end, you really love them no matter what. In fact, if somebody feels like they need to be right all the time, it's sometimes a reaction to feeling insecure or like their opinion wasn't valued enough. By reassuring them, you might help them feel comfortable enough to relax and be more open to compromise. [6] X Research source Be sure to let them know how much you appreciate the good things they do, too! Even if it doesn't make a difference in how stubborn they are, it's always a good idea to tell your partner that you love them."
    },
    {
      "title": "Don't directly contradict the other person if you can avoid it.",
      "content": "Don't directly contradict the other person if you can avoid it. When your partner is being stubborn, try not to focus on what you disagree on—they'll usually point that out on their own. Instead, focus on where your perspectives overlap. [7] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021. By framing what you're bringing up as something the two of you need to figure out together, it'll feel less like an issue the two of you should be arguing about. [8] X Trustworthy Source Understood Nonprofit organization dedicated to resources and support to people with thinking differences, such as ADHD or dyslexia Go to source For instance, don't say, \"I know you don't like her, but my mom wants us to come over on Tuesday.\" Instead, try saying something like, \"I really appreciate how hard you try to get along with my family even though it's not always easy. I'm going over to my mom's for dinner on Tuesday, do you want to come with me?\" If your partner is stubbornly refusing to talk to you about something, you might say something like, \"I know even when we aren't getting along, you really love me. I just need to feel heard. Can I just share my thoughts with you for about 10 minutes? Then we can go watch TV.\""
    },
    {
      "title": "Try to find some common ground.",
      "content": "Try to find some common ground. You're not likely to get very far if you and your partner are equally stubborn—there has to be some give-and-take. It can be hard, but try to hone in on anything that the two of you can agree on. Then, try to build on that to find a compromise! [9] X Trustworthy Source Understood Nonprofit organization dedicated to resources and support to people with thinking differences, such as ADHD or dyslexia Go to source Remember, you're both on the same team. [10] X Research source For example, if your partner thinks that your children shouldn't have an allowance and you think they should, focus on the fact that you both want what's best for your kids. By negotiating, you might agree that your children can have a small amount put into savings each week as long as they complete all of their chores. If they insist on getting pineapple on their pizza and you can't stand it, you might agree to order separate, smaller pizzas instead of a large one."
    },
    {
      "title": "State what you're thinking in a confident way.",
      "content": "State what you're thinking in a confident way. People who are stubborn usually get their way by being the loudest person in a room. They just keep repeating themselves until everyone else backs down. You don't necessarily have to come off as aggressive, but use a clear, confident tone of voice when you're talking, and don't make it sound like you're asking their permission to speak. Just express what you want. [11] X Research source Use facts to back up your opinion. For example, if your partner refuses to go to the doctor for a checkup, you might share some statistics about health concerns for people in their age range. [12] X Research source You can also share why something is personally important to you. For instance, you might explain that you would be devastated if something happened to them because they neglected their health. Using \"I feel\" statements can be a great way to communicate where you're coming from without coming across as accusatory or critical."
    },
    {
      "title": "Give them space to express themselves.",
      "content": "Give them space to express themselves. Don't shut your partner out just because they're being stubborn. [13] X Expert Source Laura Richer Licensed Mental Health Counselor Expert Interview. 24 September 2021. After all, they might very well have a good point. Once you've explained yourself, ask them what they're thinking—and why they feel so strongly about it. [14] X Research source Then, really listen to the answer. Don't interrupt them or spend the whole time thinking about what you're going to say next. [15] X Trustworthy Source Understood Nonprofit organization dedicated to resources and support to people with thinking differences, such as ADHD or dyslexia Go to source"
    },
    {
      "title": "Let go of the little things.",
      "content": "Let go of the little things. Sometimes it's just not worth the time and energy to fight over something small, like how to do a chore around the house or what to watch on TV. If it's not really that big of a deal, consider just letting your partner have their way. When you have a more harmonious relationship, it will be a lot easier to cope with the bigger issues as they crop up. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Maybe they absolutely insist on using the wrong size knife to chop onions, and you know the job would be so much faster if they would just pull the bigger knife from the block. Instead of bickering over it, just do something else. In the end, there are probably more important things than how quickly the onions are diced!"
    },
    {
      "title": "Don't get pushed around on things you feel strongly about.",
      "content": "Don't get pushed around on things you feel strongly about. Although sometimes it's better to let things go, there are absolutely times in a relationship when you should stand up for yourself. Your partner might stubbornly argue with you about it, but chances are, when they see you're serious, they'll come around—and they'll likely respect you more in the long run. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If your partner insists on driving their vehicle without insurance, for example, you might emphatically let them know that you're not okay with them being that irresponsible since you share finances. It would be reasonable to say that if they can't maintain insurance on their vehicle, you won't ride with them anywhere."
    },
    {
      "title": "Make sure your partner isn't stressed or distracted.",
      "content": "Make sure your partner isn't stressed or distracted. If you have something to talk about that you think your partner might resist, try not to bring it up when they're already feeling tense, or when they're busy, tired, or hungry. That can get the conversation off to a bad start as soon as you begin interacting. Instead, wait to chat until you're both feeling relaxed. [18] X Trustworthy Source Understood Nonprofit organization dedicated to resources and support to people with thinking differences, such as ADHD or dyslexia Go to source For instance, even if you have something important on your mind, try not to bring it up as soon as your partner gets home from work. Instead, wait until they've had a few minutes to get settled in."
    },
    {
      "title": "Don't push too hard too fast.",
      "content": "Don't push too hard too fast. Once you and your partner have both had a chance to speak your mind, consider dropping the subject for a little while. Some people are just slow to change their minds, and the more you press them to agree with you, the more they'll retreat into their original position. On the other hand, if you give them some space to think without pressure, your partner might just be able to see things from your point of view. [19] X Research source Make sure to end on a positive note. You might say something like, \"Okay, I know we still don't see eye to eye on this, but I really appreciate you sharing your thoughts with me. I love you no matter what. Let's set this aside for now and talk about it tomorrow.\""
    },
    {
      "title": "Remember that it's a part of who you fell in love with.",
      "content": "Remember that it's a part of who you fell in love with. It might not always seem like it, but there are actually times when being stubborn can be a positive character trait. After all, if they're determined to be with you, they'll be willing to make it work no matter what. When the two of you agree, there will be no stopping you. [20] X Research source When you can appreciate your partner for exactly who they are, it will make it easier to deal with the times when the two of you are on opposite sides of the fence."
    }
  ]
}