{
  "url": "https://www.wikihow.com/Calculate-Frequency",
  "title": "How to Calculate Frequency",
  "steps": [
    {
      "title": "Learn the formula.",
      "content": "Learn the formula. The formula for frequency, when given wavelength and the velocity of the wave, is written as: f = V / λ [1] X Research source In this formula, f represents frequency, V represents the velocity of the wave, and λ represents the wavelength of the wave. Example: A certain sound wave traveling in the air has a wavelength of 322 nm when the velocity of sound is 320 m/s. What is the frequency of this sound wave?"
    },
    {
      "title": "Convert the wavelength into meters, if necessary.",
      "content": "Convert the wavelength into meters, if necessary. If the wavelength is given in nanometers, you need to convert this value into meters by dividing it by the number of nanometers in a single meter. [2] X Research source Note that when working with extremely small numbers or extremely large numbers, it is generally easier to write the values in scientific notation . The values will be shown in and out of their scientific notation forms for this example, but when writing your answer for homework, other schoolwork, or other formal forums, you should stick with scientific notation. Example: λ = 322 nm 322 nm x (1 m / 10^9 nm) = 3.22 x 10^-7 m = 0.000000322 m"
    },
    {
      "title": "Divide the velocity by the wavelength.",
      "content": "Divide the velocity by the wavelength. Divide the velocity of the wave, V , by the wavelength converted into meters, λ , in order to find the frequency, f . [3] X Research source Example: f = V / λ = 320 / 0.000000322 = 993788819.88 = 9.94 x 10^8"
    },
    {
      "title": "Write your answer.",
      "content": "Write your answer. After completing the previous step, you will have completed your calculation for the frequency of the wave. Write your answer in Hertz, Hz , which is the unit for frequency. Example: The frequency of this wave is 9.94 x 10^8 Hz."
    },
    {
      "title": "Learn the formula.",
      "content": "Learn the formula. The formula for the frequency of a wave in a vacuum is almost identical to that of a wave not in a vacuum. Since there are no outside influences on the velocity of the wave, though, you would use the mathematical constant for the speed of light, which electromagnetic waves would travel at under these conditions. As such, the formula is written as: f = C / λ [4] X Research source In this formula, f represents frequency, C represents the velocity or speed of light, and λ represents the wavelength of the wave. Example: A particular wave of electromagnetic radiation has a wavelength of 573 nm when passing through a vacuum. What is the frequency of this electromagnetic wave?"
    },
    {
      "title": "Convert the wavelength into meters, if necessary.",
      "content": "Convert the wavelength into meters, if necessary. When the problem gives you the wavelength in meters, no further action is needed. If, however, the wavelength is given in micrometers, you need to convert this value into meters by dividing it by the number of micrometers in a single meter. Note that when working with extremely small numbers or extremely large numbers, it is generally easier to write the values in scientific notation. The values will be shown in and out of their scientific notation forms for this example, but when writing your answer for homework, other schoolwork, or other formal forums, you should stick with scientific notation. Example: λ = 573 nm 573 nm x (1 m / 10^9 nm) = 5.73 x 10^-7 m = 0.000000573"
    },
    {
      "title": "Divide the speed of light by the wavelength.",
      "content": "Divide the speed of light by the wavelength. The speed of light is a constant, so even if the problem does not provide you with a value, the value remains 3.00 x 10^8 m/s . Divide this value by the wavelength converted into meters. [5] X Research source Example: f = C / λ = 3.00 x 10^8 / 5.73 x 10^-7 = 5.24 x 10^14"
    },
    {
      "title": "Write your answer.",
      "content": "Write your answer. With this, you should have calculated the value of the frequency of the wave. Write your answer in Hertz, Hz , the unit for frequency. Example: The frequency of this wave is 5.24 x 10^14 Hz."
    },
    {
      "title": "Learn the formula.",
      "content": "Learn the formula. Frequency and the time taken to finish a single wave oscillation are inversely proportional. As such, the formula for calculating frequency when given the time taken to complete a wave cycle is written as: f = 1 / T In this formula, f represents frequency and T represents the time period or amount of time required to complete a single wave oscillation. Example A: The time for a certain wave to complete a single oscillation is 0.32 seconds. What is the frequency of this wave? Example B: In 0.57 seconds, a certain wave can complete 15 oscillations. What is the frequency of this wave?"
    },
    {
      "title": "Divide the number of oscillations by the time period.",
      "content": "Divide the number of oscillations by the time period. Usually, you will be told how long it takes to complete a single oscillation, in which case, you would just divide the number 1 by the time period, T . If given a time period for numerous oscillations, however, you will need to divide the number of oscillations by the overall time period required to complete them. [6] X Research source Example A: f = 1 / T = 1 / 0.32 = 3.125 Example B: f = 1 / T = 15 / 0.57 = 26.316"
    },
    {
      "title": "Write your answer.",
      "content": "Write your answer. This calculation should tell you the frequency of the wave. Write your answer in Hertz, Hz , the unit for frequency. Example A: The frequency of this wave is 3.125 Hz. Example B: The frequency of this wave is 26.316 Hz."
    },
    {
      "title": "Learn the formula.",
      "content": "Learn the formula. When told the angular frequency of a wave but not the standard frequency of that same wave, the formula to calculate the standard frequency is written as: f = ω / (2π) [7] X Research source In this formula, f represents the frequency of the wave and ω represents the angular frequency. As with any mathematical problem, π stands for pi, a mathematical constant. Example: A particular wave rotates with an angular frequency of 7.17 radians per second. What is the frequency of that wave?"
    },
    {
      "title": "Multiply pi by two.",
      "content": "Multiply pi by two. In order to find the denominator of the equation, you need to double the value of pi, 3.14. Example: 2 * π = 2 * 3.14 = 6.28"
    },
    {
      "title": "Divide the angular frequency by the double of pi.",
      "content": "Divide the angular frequency by the double of pi. Divide the angular frequency of the wave, given in radians per second, by 6.28, the doubled value of pi. [8] X Research source Example: f = ω / (2π) = 7.17 / (2 * 3.14) = 7.17 / 6.28 = 1.14"
    },
    {
      "title": "Write your answer.",
      "content": "Write your answer. This final bit of calculation should indicate what the frequency of the wave is. Write your answer in Hertz, Hz , the unit for frequency. Example: The frequency of this wave is 1.14 Hz."
    }
  ]
}