{
  "url": "https://www.wikihow.com/Chamber-Pot-Markings-on-Bottom",
  "title": "An Identification Guide for Chamber Pot Markings",
  "steps": [
    {
      "title": "Manufacturer’s mark",
      "content": "Manufacturer’s mark The most dominant mark on a chamber pot’s bottom is typically a manufacturer's mark. These marks, also known as maker’s marks, company trademarks, or factory marks, were branded onto the pots by the shop or company that created them. Each manufacturer has a unique mark, similar to a modern-day logo. Some possible manufacturing marks include: [1] X Research source Crest flanked by two lions and a crown: Wood and Sons Ltd (1891-1907, Stoke-on-Trent, England). [2] X Research source Crown with “Johnson Brothers” written underneath: Johnson Brothers (1913-1968, England). [3] X Research source Inscribed with “Fielding” or “S F & CO:” Crown Devon (1878-1912, Stoke-on-Trent, England) [4] X Research source Inscribed with “DAVENPORT:” Davenport & Co (1790-1900, Staffordshire, England) [5] X Research source Unicorn surrounded by wreath: Alfred Meakin Ltd, (1875-1977, Stoke-on-Trent, England). [6] X Research source Circle with “M” on top: Maddock’s Lamberton Works, (1892-1923, Trenton, NJ). [7] X Research source Crown or seal with \"Clementson Brothers Royal Patent Stoneware Hanley\" stamp: Clementson Brothers (1870-1910, Staffordshire, England). [8] X Research source"
    },
    {
      "title": "Registration marks",
      "content": "Registration marks The bottom of a chamber part may feature a marking that looks like Rd. No. followed by a six-digit number. These numbers are known as registration numbers and are typically found on English chamber pots. Each pot’s registration number correlates to the year the pattern was registered with the British Government. [9] X Research source English Registration Marks also come in the form of diamond or “lozenge” marks, which resemble a small diamond topped by a circle. [10] X Research source Diamond or “lozenge” marks on chamber pots contain information about the design’s registration date as well as the parcel number and the type of material that was used. If a piece of pottery has a diamond or lozenge mark, use this chart from the Association of Small Collectors of Antique Silver (ASCAS) to estimate when a pattern was registered with the UK patent office."
    },
    {
      "title": "Design name",
      "content": "Design name Some antique chamber pots feature a design name on the bottom of the pot. These engraved words are the name of the design as it was copyrighted with the relevant patent office. For example, many Australian chamber pots from the late 1800s are stamped with the word “WATTLE.” [11] X Research source “Wattle” is the patented name of the design pattern used on these pots, which feature Australia’s native wattle flower. Other popular chamber pot designs include “IRIS,” “IVORY,” and “PRINCESS.”"
    },
    {
      "title": "Standard chamber pots look like ceramic pots or dishes with one handle.",
      "content": "Standard chamber pots look like ceramic pots or dishes with one handle. A chamber pot may sometimes have two handles, depending on the type. Some chamber pots have removable lids, while others look more like a chair or stool with a hinged lid or have no lid at all. [12] X Research source There are many other types of chamber pots, however, that are rarer and considered more valuable, including: [13] X Research source Bourdaloue: Used in the 1800s to allow corseted women to relieve themselves standing-up. Oblong-shaped, similar to a modern gravy boat. Urine containers: Sleek chamber pot designs; women’s were bottle-shaped with feminine decorations, while men’s had circular designs with angular necks. Carriage pots: Used for long-distance travel on public transport. Circularly shaped with a wide rim and handle, often made of a less fragile material with usage instructions printed on the pot. Bedpans: Typically found in hospitals or medical settings. Features a long, protruding handle and flat edges to prevent leakage and bruising."
    },
    {
      "title": "Antique chamber pots are usually made out of ceramic pottery.",
      "content": "Antique chamber pots are usually made out of ceramic pottery. However, they’ve been made throughout history out of practically any material that can hold liquid. A chamber pot’s construction typically reflected the owner’s wealth; e.g., lower-class families owned tin or leaden pots with no lids, while wealthier families used copper, porcelain, or ceramic pots. [14] X Research source Chamber pots were also commonly made out of: Tin Lead Earthenware Delftware Stoneware"
    },
    {
      "title": "Consult a professional antique collector or expert for dating.",
      "content": "Consult a professional antique collector or expert for dating. It isn’t easy to precisely date a chamber pot, especially without markings. Consult a professional antiquer who can decode the markings on the bottom of a chamber pot or use their expertise to date the piece based on its pattern and materials. Or, you can post photos of the chamber pot bottom on popular antiquing forums like Antiquers.com or Treasurenet.com . You can also check if your chamber pot has any features or materials unique to certain eras: If a chamber pot has no registration number or maker’s mark, it can be nearly impossible to determine in what year the chamber pot was made, especially without expert help. This challenge is due to chamber pots remaining largely unchanged throughout history, with some exceptions: [15] X Research source In the 1400s-1700s , many chamber pots were made of earthenware with coarser textures. By the mid-1600s , many pots were imported from Staffordshire, England (and often marked as such via a manufacturer’s mark on the bottom of the pot). In the 1700s , commodes and close stools become more popular than the simple pot. From the 1850s to the year 1900 , highly decorative, cobalt-blue chamber pots became popular in Victorian England, commonly using stoneware and china materials."
    },
    {
      "title": "Vintage chamber pots in good condition are typically worth $30-$500.",
      "content": "Vintage chamber pots in good condition are typically worth $30-$500. Antique chamber pots may be worth more if they have historical significance, are highly decorative, or were made by an esteemed manufacturer. A chamber pot’s value may also be influenced by: [16] X Research source Condition : Valuable chamber pots sold at auction are usually in excellent condition. Small chips, cracks, stains, or fading colors may lessen a chamber pot’s value. Decoration : Highly decorative and elaborate chamber pots may be worth more, especially if they have unusual colors or shapes, satirical images, unique handles, hand-painted decor, embossed letters, or an original lid. Type : Bourdaloue chamber pots are highly sought-after collectibles and are often sold at the highest prices due to their unique and unusual designs. These chamber pots may be worth anything from a few hundred to a few thousand dollars. At the very least, antique chamber pots can usually be sold as collector’s items or repurposed household objects like planters or pitchers. At an antique store or flea market, these pots usually sell for around $40-$60."
    },
    {
      "title": "A chamber pot is a portable toilet, usually a pot or bowl, used to relieve oneself.",
      "content": "A chamber pot is a portable toilet, usually a pot or bowl, used to relieve oneself. These utilitarian antiques were used before most people had access to indoor plumbing. While outhouses could be used during the day, chamber pots were used at night, especially in the winter, when leaving the home to use an outhouse could be uncomfortable or dangerous. [17] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source In general, every bedroom in a home had its own chamber pot. If everyone in a household slept in one room, they may have only had one chamber pot. Chamber pots were kept and stored next to the bed or in a commode, which is an enclosed piece of furniture similar to a small cabinet or chest. [18] X Research source Emptying chamber pots was part of daily chores for historical families. Family members or servants would empty the contents of the chamber pot into an outhouse, out a window, into a body of water, or over a garden. [19] X Research source Alternate names for chamber pots include “pot,” “pot de chambre,” “Jordan,” “po,” “jerry,” “honey bowl,” and “thunder mug.” [20] X Research source"
    },
    {
      "title": "The earliest known examples of chamber pots come from Ancient Egypt.",
      "content": "The earliest known examples of chamber pots come from Ancient Egypt. Archaeologists discovered chamber pots dating from the 1300s B.C. at the Tel-el-Amarna site in Egypt. [21] X Research source Early versions of the chamber pot have also been found in Ancient Rome and Greece. [22] X Research source By the 1500s, chamber pots had evolved into the shape and style that we most recognize today."
    },
    {
      "title": "Many antique chamber pots come from Colonial America or Victorian England.",
      "content": "Many antique chamber pots come from Colonial America or Victorian England. In colonial-era America, most chamber pots were made of earthenware with a coarse texture. These rustic chamber pots usually took on a reddish color, as opposed to the silver and white styles popular in Europe. [23] X Research source By the late 1600s, chamber pot factories in Staffordshire, England had begun to import chamber pots to the colonies, making these ceramic versions the more popular choice. In Victorian England, chamber pots were typically made of stoneware and china, and sometimes metal. Victorian chamber pots were highly decorated with delicately complex floral designs, usually using blue and white color schemes. They would also often feature the faces of Victorian politicians on the bottom interior to create a satirical, amusing political statement. [24] X Research source"
    }
  ]
}