{
  "url": "https://www.wikihow.com/Look-Into-Your-Own-Ear",
  "title": "How to Look Into Your Own Ear",
  "steps": [
    {
      "title": "Search online for smartphone otoscope attachments.",
      "content": "Search online for smartphone otoscope attachments. There are 2 basic categories of smartphone otoscope attachments—those that clip over your phone's camera, and those that attach by cable to your phone's USB or Lightning port. Shop online for a model that is compatible with your phone. A traditional otoscope is basically a magnifying glass with a handle, a light, and a cone-shaped tip that is inserted into the outer section of the inner ear. Smartphone otoscopes either magnify the image for your phone's camera, or act as their own magnifying camera, and record video. Scopes range in price from less than $50 USD to over $300 USD. You can check product reviews for guidance, and you may also want to ask your doctor if they have any experience with or recommendations for such devices. If you're a MacGyver-type, you can even try making one yourself! [1] X Research source"
    },
    {
      "title": "Download the appropriate app and follow its instructions.",
      "content": "Download the appropriate app and follow its instructions. Most if not all models of scope attachments pair with a brand-specific app. Download this app for guidance on installing the scope, using it, and saving or sending the images/video. The apps are typically free, but of course you've already had to pay for the scope! Most otoscope attachments record video as opposed to taking pictures, since this makes it easier for the average novice to get some decent inner ear views."
    },
    {
      "title": "Insert the speculum no more than 2 cm (0.79 in) into your ear.",
      "content": "Insert the speculum no more than 2 cm (0.79 in) into your ear. No matter if you're using a traditional otoscope or a smartphone attachment, never stick the speculum (the pointed part) more than 1–2 cm (0.39–0.79 in) into your ear. Your inner ear is very sensitive, and you definitely don't want to damage your eardrum! [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you are unsure of your abilities, or if you're experiencing ear pain, let a medical professional examine your ear instead."
    },
    {
      "title": "Move the speculum around slightly and record video of your inner ear.",
      "content": "Move the speculum around slightly and record video of your inner ear. With the app open and the speculum placed just barely into your ear, you should see video of your inner ear appear on your phone screen. Follow the product instructions for recording video, and move the speculum around slowly to get a full view of your inner ear. [3] X Research source Do not stick the speculum deeper into your ear if the image is grainy, blurry, or dark. Check the settings for the product to see if you can improve the image."
    },
    {
      "title": "Send the video to a trained medical professional for diagnosis.",
      "content": "Send the video to a trained medical professional for diagnosis. Self-diagnosis is not recommended by medical professionals nor the manufacturers of smartphone otoscope attachments. Instead, you should send the video to your doctor or another trained medical professional for a proper diagnosis. [4] X Research source Some apps may provide a way to send the video directly to on-call doctors for diagnosis, possibly at a cost of around $15 USD per analysis. Based on scholarly analysis of certain smartphone otoscopes, the image quality and diagnostic quality of scope attachments matches up well with traditional otoscopes. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source In fact, some doctors may even prefer the results they provide. [6] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Attach an appropriately-sized speculum to the otoscope.",
      "content": "Attach an appropriately-sized speculum to the otoscope . Most modern otoscopes use a single-use, disposable speculum (the pointed part that you put into the person's ear). Specula come in different sizes, and the proper size should fit snugly into the outer third (no more than 2 cm (0.79 in) deep) of the person's ear canal. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Use the following guidelines for speculum size: adults, 4-6 millimeters; children, 3-4 millimeters; infants, 2 millimeters. The speculum usually just snaps onto the pointed part of the otoscope. Dispose of the speculum after a single use. If you have a reusable speculum, sanitize it thoroughly according to the product instructions."
    },
    {
      "title": "Turn on the otoscope's light and hold it like a pencil.",
      "content": "Turn on the otoscope's light and hold it like a pencil. Flip the switch or push the button to light up the tip of the otoscope, then grasp the handle between your thumb and forefinger like a pencil or pen. Touch the back of your holding hand to the person's cheek to help steady both your hand and the scope. [8] X Research source Be calm and move gently during an examination of someone else's ear. Many people don't like the feeling of having something stuck into their ear, and the ear is a very sensitive organ that can be easily damaged. If possible, watch a medical professional use an otoscope before trying it yourself."
    },
    {
      "title": "Straighten the person's ear canal with your free hand.",
      "content": "Straighten the person's ear canal with your free hand. Lightly pinch their outer ear between your fingers, at either the 10 o'clock (for the right ear) or 2 o'clock (for the left ear) positions. Gently tug their outer ear up and back—this will straighten out the person's ear canal and make it easier for you to get a clear view inside. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you're checking a child under 3 years old, try gently pulling the outer ear downward first. This may provide a better view."
    },
    {
      "title": "Insert the otoscope's speculum 1–2 cm (0.39–0.79 in) into the ear canal.",
      "content": "Insert the otoscope's speculum 1–2 cm (0.39–0.79 in) into the ear canal. While keeping the back of your holding hand against the person's cheek, carefully place the tip of the speculum into the outer section of their ear canal. Look into the otoscope with your dominant eye and close your other eye. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Do not press the speculum into their ear canal with any amount of force. Simply guide the tip 1–2 cm (0.39–0.79 in) in. If it won't go in easily, you likely have too large of a speculum attached. If the person indicates any pain or discomfort, stop immediately and carefully withdraw the otoscope. Have a medical professional do the examination instead."
    },
    {
      "title": "Point the tip of the otoscope toward the person's nose first.",
      "content": "Point the tip of the otoscope toward the person's nose first. Begin your examination at this angle, which follows the path of the ear canal. Once you have a clear view, gently move the otoscope around at different angles to examine other parts of the eardrum and ear canal walls. [11] X Research source Quickly but carefully withdraw the otoscope if the person says they feel pain or discomfort."
    },
    {
      "title": "Look for common signs of a healthy ear.",
      "content": "Look for common signs of a healthy ear. You aren't a trained medical professional, so don't try to diagnose any type of ear problems. If the person is having ear troubles of any type, tell them to see a doctor. If they aren't having any problems, though, look for the following signs to confirm a healthy inner ear: The ear canal itself should be flesh-colored and covered in tiny hairs. It's also normal to have some brown or reddish-brown earwax on the canal walls, but the wax shouldn't be blocking the canal. There shouldn't be any signs of swelling. The eardrum should be translucent and white or gray in color. You should be able to see tiny bones pressing against the inside surface of the eardrum."
    },
    {
      "title": "Remove the otoscope carefully and slowly.",
      "content": "Remove the otoscope carefully and slowly. Draw the speculum straight out of the person's ear canal and pull the back of your hand off of their cheek. Let go of their outer ear with your other hand. Now you can check the other ear. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Checking someone else's ears, or having them check yours, is never an adequate substitute for a proper medical checkup. Use an otoscope only to confirm that your inner ear looks healthy, not to diagnose a problem when it doesn't feel right."
    }
  ]
}