{
  "url": "https://www.wikihow.com/Burn-Cone-Incense",
  "title": "A Complete Guide to Burning Incense Cones",
  "steps": [
    {
      "title": "Use a heat-proof incense burner.",
      "content": "Use a heat-proof incense burner. Cones often come with a metal disk to absorb the heat. However, you can use an ashtray, ceramic bowl, or a special heat-proof incense box or tray to contain the heat safely. Place the container away from flammable objects, like curtains, lampshades, or paper. [1] X Research source"
    },
    {
      "title": "Put a layer of sand or salt in the burner to distribute the heat.",
      "content": "Put a layer of sand or salt in the burner to distribute the heat. Spread a layer of sand or salt about 1 cm (0.39 in) thick on the bottom of any heat-resistant container to help distribute the heat. Other alternatives are white ash or rice. It can also be used to snuff out the flame, if needed. [2] X Research source You don't have to do this step, but many people find that it helps their incense burn better."
    },
    {
      "title": "Place the cone in the container with the point facing up.",
      "content": "Place the cone in the container with the point facing up. If you’re using an incense box, place the cone in the small circular slot designed for it. Otherwise, place the cone in the center of any heat-proof box or tray. The flat, wider part of the cone should sit on top of the surface, with the tip of the cone facing up. [3] X Research source If you filled the container with sand or salt, position the cone evenly on the sand so it doesn't fall over. There are two types of cones: a traditional cone and a backflow cone . Unlike traditional cones, backflow cones have a small hole on the tip, which creates a waterfall effect."
    },
    {
      "title": "Use a match or a candle to light the tip of the cone.",
      "content": "Use a match or a candle to light the tip of the cone. [4] X Expert Source Julie Brow-Polanco Master Herbalist & Certified Aromatherapist Expert Interview. 12 April 2022. Master Herbalist Julie Brow-Polanco recommends bring a match or lighter to the tip of the cone until a small flame appears. Then, pull the match or lighter away. The flame doesn’t need to appear for very long—5 to 10 seconds is fine. [5] X Research source Brow-Polanco advises against using a stove or any strong flame to light the tip of the cone, as you may burn your hands. [6] X Expert Source Julie Brow-Polanco Master Herbalist & Certified Aromatherapist Expert Interview. 12 April 2022."
    },
    {
      "title": "Wait for an orange glow to appear on the tip.",
      "content": "Wait for an orange glow to appear on the tip. Once the flame disappears, the tip of the incense cone should glow. If the tip looks dark or burnt when you remove the flame, try to relight it until the tip is orange. The orange glow signals the cone is properly heated, like embers in a fire. [7] X Research source"
    },
    {
      "title": "Gently blow or fan the incense cone to ensure the flame is out.",
      "content": "Gently blow or fan the incense cone to ensure the flame is out. Use your hands or a piece of paper to fan the cone, or use your breath to blow the top of the cone softly. A steady, consistent stream of smoke signals the flame is gone and the incense is burning safely. [8] X Research source"
    },
    {
      "title": "Enjoy your incense for 20 to 40 minutes.",
      "content": "Enjoy your incense for 20 to 40 minutes. Allow your incense to burn from the tip to the bottom of the cone. If your incense container has a top, lightly cover it to let the smoke trickle out slowly. Unlike incense sticks or coils, the smoke from cones tends to be heavier and stronger. [9] X Research source You may want to open a window nearby, but be sure the cone isn’t directly in front of it so it doesn’t go out."
    },
    {
      "title": "Snuff the tip out by pressing the burnt end against a heat-resistant surface.",
      "content": "Snuff the tip out by pressing the burnt end against a heat-resistant surface. If you want to put out the incense before it burns out on it's own or you have to leave it unattended, simply snuff the cone. Press the burning end against a heat-resistant surface, like the box or tray, or use sand, salt, white ash, or rice to put the heat out. [10] X Research source You can also use cool water to ensure the embers are out."
    },
    {
      "title": "Dispose of the ash in the trash once it’s cooled down.",
      "content": "Dispose of the ash in the trash once it’s cooled down. Once the cone is extinguished, let the remaining ash cool down completely before handling it to avoid burns. Take a trash bag or a garbage tin and sweep the ash in. [11] X Research source Use a vacuum or dustpan as an alternative."
    },
    {
      "title": "Store your incense in a cool, dry place away from direct sunlight.",
      "content": "Store your incense in a cool, dry place away from direct sunlight. Place your incense inside an airtight container or sealed plastic bag to preserve its scent. Storing it away from direct sunlight maintains its scent and burn quality. [12] X Research source Similarly, keep incense away from flammable materials or heat sources to avoid an accidental fire."
    },
    {
      "title": "Blow out solid flames to prevent excess smoke.",
      "content": "Blow out solid flames to prevent excess smoke. If the flame doesn’t go out after 10 seconds of lighting it, put the cone out. An incense cone with a solid flame gives off a smokier, less pleasant smell and is a fire hazard. Relight it or use a new cone until the tip burns orange. [13] X Research source"
    },
    {
      "title": "Add more oxygen if the tip won’t stay lit.",
      "content": "Add more oxygen if the tip won’t stay lit. If you're using a lid, remove the top to allow more air. Relight the cone if necessary, gently blow the flame, and enjoy! [14] X Research source"
    },
    {
      "title": "Clean the cone if it's brand new or oily with a paper towel.",
      "content": "Clean the cone if it's brand new or oily with a paper towel. New incense cones can be a little more oily than desired. Use a paper towel to gently blot the cone to remove excess oil or moisture so it burns properly."
    },
    {
      "title": "Keep your incense cone away from drafty areas or open windows.",
      "content": "Keep your incense cone away from drafty areas or open windows. Another reason your incense cone might not stay lit is if it's near a breeze. Light your cone away from open windows or other sources of airflow. Check to ensure there isn't an open-air vent near the incense."
    }
  ]
}