{
  "url": "https://www.wikihow.com/Connect-External-Speakers-to-a-Macbook-Pro",
  "title": "How to Connect External Speakers to a MacBook Pro",
  "steps": [
    {
      "title": "Power-up the speakers.",
      "content": "Power-up the speakers. Connect the power supply of the speaker to an outlet or any authorized socket. If the speakers are USB-powered, simply connect it to the Macbook Pro's USB port."
    },
    {
      "title": "Connect the speakers to the computer.",
      "content": "Connect the speakers to the computer. Insert the audio outline from the speakers into the headphone jack of the Macbook. If the line is not a 3.5 mm jack, connect it to 3.5 mm adapter and then connect the adapter to the Macbook."
    },
    {
      "title": "Turn on the speakers.",
      "content": "Turn on the speakers."
    },
    {
      "title": "Check for sound.",
      "content": "Check for sound. Make sure that the Macbook is not in mute. Turn up the volume by pressing the Volume Up keys located at the top-right corner of the keyboard. You should hear a ding sound whenever you press the Volume Up key. Adjust the sound to your liking."
    },
    {
      "title": "Turn on your speakers.",
      "content": "Turn on your speakers. Make sure your speakers are Bluetooth compatible. Locate the power button and press to turn on."
    },
    {
      "title": "Turn on your Macbook's Bluetooth.",
      "content": "Turn on your Macbook's Bluetooth. Navigate to System Preference by clicking the apple icon in the top left hand corner of the screen. Then click on the Bluetooth option in the third row. If it is off, click the button to turn it on. Your Mac will automatically begin searching for other Bluetooth devices in the area."
    },
    {
      "title": "Turn on your speaker's Bluetooth.",
      "content": "Turn on your speaker's Bluetooth. Refer to your speaker's manual book to turn on Bluetooth. Usually this is done by pressing and holding down a specific button until it lights up. Once this happens, your speaker device will show up in the Bluetooth window on your Mac."
    },
    {
      "title": "Pair the devices.",
      "content": "Pair the devices. Click on the device and pair - if there is a pass code necessary enter it now."
    },
    {
      "title": "Configure sound.",
      "content": "Configure sound. Click back to the original System Preference menu. Then click on the Sound option in the second row. Click on the Output sub menu option. There should be a list of output options available in a small menu. Click on your Bluetooth speakers. Enjoy your music!"
    }
  ]
}