{
  "url": "https://www.wikihow.com/Make-Okra-Juice",
  "title": "How to Make Okra Juice",
  "steps": [
    {
      "title": "Trim",
      "content": "Trim the ends from 4 okra and make a long slit in each. Rinse 4 okra and put them on a cutting board. Then, use a paring knife to cut off both ends from each okra. Discard the ends and make 1 long shallow slit down each okra. [1] X Research source The slit will help the inside of the okra soak."
    },
    {
      "title": "Put the okra into a glass of water.",
      "content": "Put the okra into a glass of water. Pour about 1 cup (240 ml) of room temperature water into a large glass and place the 4 okra into it. They'll probably float near the top of the glass. [2] X Research source Avoid using hot water to soak the okra since this could make the okra become mushy."
    },
    {
      "title": "Let the okra soak overnight at room temperature.",
      "content": "Let the okra soak overnight at room temperature. You can put a lid on the glass or cover it with plastic wrap so nothing falls into the water. Leave the okra for about 24 hours so the okra softens and infuses the water. [3] X Research source"
    },
    {
      "title": "Squeeze the mucilage into a new glass.",
      "content": "Squeeze the mucilage into a new glass. Once the okra has soaked for a day, lift them out of the water, but don't throw the water out. Find the slit on the side of an okra, hold it over a clean glass, and squeeze it so it releases clear mucilage. Repeat this for each of the okra. [4] X Research source You can throw away the okra once you've squeezed all of the mucilage into the glass."
    },
    {
      "title": "Pour the infused water into the new glass and stir the mixture.",
      "content": "Pour the infused water into the new glass and stir the mixture. Slowly pour the water that the okra soaked in into the glass with the mucilage. Then, stir gently so the mucilage is incorporated. The okra water will taste like unsweetened coconut milk or coconut water."
    },
    {
      "title": "Drink the okra water once a day if you're trying to lower your blood sugar.",
      "content": "Drink the okra water once a day if you're trying to lower your blood sugar. Although research is needed, you might notice an improvement in your blood sugar if you drink a glass of okra water every day. Try to drink it in the morning before you eat breakfast. [5] X Research source To tell if okra water is helping your blood sugar, track your blood sugar numbers for at least a few weeks and let your doctor know that you've added it to your diet."
    },
    {
      "title": "Boil",
      "content": "Boil the okra in water for 4 to 5 minutes. Put 1 ⁄ 4 pound (110 g) of okra into a pot on the stove along with 2 cups (470 ml) of water and turn the burner to high. Let the okra boil until they become somewhat tender. [6] X Research source Boiling the okra will reduce the bitterness, but avoid boiling the okra or they could become mushy."
    },
    {
      "title": "Drain the okra and set the water aside.",
      "content": "Drain the okra and set the water aside. Set a strainer over a bowl or measuring jug and carefully pour the okra into it. Let the okra and water cool while you put the other punch ingredients into the blender. If you like, boil and cool the okra up to 1 day in advance. Put the boiled okra and its water into the refrigerator until you're ready to make the punch."
    },
    {
      "title": "Put the okra, milks, egg, brandy, and nutmeg into the blender.",
      "content": "Put the okra, milks, egg, brandy, and nutmeg into the blender. Once the okra has cooled, add it to a blender along with 5 tablespoons (97.5 g) of sweetened condensed milk, a 12 fluid ounces (350 ml) can of evaporated milk, 1 egg, 1 ⁄ 4 cup (59 ml) of brandy, and 1 teaspoon (2 g) of ground nutmeg. If you don't want to use raw egg, leave it out or substitute a pasteurized egg product."
    },
    {
      "title": "Blend the punch for 30 seconds and add okra water as needed.",
      "content": "Blend the punch for 30 seconds and add okra water as needed. Place the lid on the blender and turn the machine on to \"Blend.\" Continue to blend the mixture until the okra is smooth. Slowly blend in some of the reserved okra water until the punch is as thin as you'd like. The egg will help the punch foam up a little as it blends."
    },
    {
      "title": "Pour the punch over ice before serving it.",
      "content": "Pour the punch over ice before serving it. Fill serving glasses with ice and slowly pour the okra punch into them. Enjoy the punch before the ice melts and dilutes the drink. You shouldn't store leftover okra punch since it contains raw egg."
    },
    {
      "title": "Put a banana, frozen fruit, and frozen okra into a blender.",
      "content": "Put a banana, frozen fruit, and frozen okra into a blender. Peel a small ripe banana and drop it into a blender. Add ½ cup (50 g) of frozen, sliced okra and ½ cup (75 g) of your favorite frozen fruit. You can use a single type of frozen fruit or a combination. For example, use frozen mixed berries or peaches with mangoes. The sweetness of the banana and frozen fruit will hide the bitter taste of the sliced okra. The banana will also give the smoothie a slightly creamy flavor."
    },
    {
      "title": "Pour in 1 cup (240 ml) of liquid and 1⁄2 teaspoon (2.5 ml) of vanilla extract.",
      "content": "Pour in 1 cup (240 ml) of liquid and 1 ⁄ 2 teaspoon (2.5 ml) of vanilla extract. You can use any type of liquid you like for your smoothie or use a combination as long as you pour in at least 1 cup (240 ml). For a non-dairy smoothie, use kombucha, fruit juice, coconut milk, or okra water. To make a creamier smoothie, use milk or kefir."
    },
    {
      "title": "Blend the smoothie until it's smooth.",
      "content": "Blend the smoothie until it's smooth. Put the lid on the blender and turn it on to \"Blend\" for at least 30 seconds. Keep blending until you don't see any pieces of okra or chunks of fruit. You may have to stop and scrape down the sides of the blender occasionally."
    },
    {
      "title": "Taste the smoothie and adjust the flavor or consistency.",
      "content": "Taste the smoothie and adjust the flavor or consistency. Remove the lid and taste a spoonful of the okra smoothie. If you'd like to make the smoothie sweeter, you can drizzle in a little honey or agave. If the smoothie is too thick for your liking, pour in a little more liquid and blend the smoothie to incorporate it. If the smoothie is too thin, you can blend in ice cubes to make it thicker."
    }
  ]
}