{
  "url": "https://www.wikihow.com/Calculate-Weighted-Average",
  "title": "How to Calculate Weighted Average",
  "steps": [
    {
      "title": "Gather the numbers you would like to average.",
      "content": "Gather the numbers you would like to average. You’ll need to start by assembling a list of the numbers for which you’d like to find the weighted average. For example, if you’re trying to find a weighted average for a series of grades in a class, first write down each of the grades. [1] X Research source For instance, maybe your total grades are 82 for quizzes, 90 on your exam, and 76 on your term paper."
    },
    {
      "title": "Determine the weight value of each number.",
      "content": "Determine the weight value of each number. Once you have your numbers, you’ll need to know how much each of them weighs, or is worth, as part of your final average. For instance, in your class, the quizzes might be worth 20% of your total grade, while the exam is 35% and the term paper is 45%. In this case, the weights add up to 1 (or 100%). [2] X Research source In order to use these percentages in your calculation, you’ll need to convert them to decimal form. The resulting numbers are called “weighting factors.”"
    },
    {
      "title": "Multiply",
      "content": "Multiply each number by its weighting factor (w). Once you have all your numbers, pair up each number (x) with its corresponding weighting factor (w). You’ll be multiplying each set of numbers and weights together, then adding them all up to find the average. [3] X Research source For example, if your total quiz score is 82 and quizzes are worth 20% of your grade, multiply 82 x 0.2. In this case, x=82 and w=0.2."
    },
    {
      "title": "Add",
      "content": "Add the resulting numbers together to find the weighted average. The basic formula for a weighted average where the weights add up to 1 is x1(w1) + x2(w2) + x3(w3), and so on, where x is each number in your set and w is the corresponding weighting factor. [4] X Research source To find your weighted average, simply multiply each number by its weight factor and then sum the resulting numbers up, the same way you would take the average of any other data set. [5] X Expert Source Mario Banuelos, PhD Associate Professor of Mathematics Expert Interview. 11 December 2021. For example: [6] X Research source The weighted average for your quiz grades, exam, and term paper would be as follows: 82(0.2) + 90(0.35) + 76(0.45) = 16.4 + 31.5 + 34.2 = 82.1. This means you have a grade of 82.1% in the course."
    },
    {
      "title": "Write down the numbers you want to average.",
      "content": "Write down the numbers you want to average. When you’re calculating a weighted average, the different weights will not always add up to 1 (or 100%). Either way, start by gathering your data, or the individual numbers for which you’d like to find your average. [7] X Research source For example, maybe you’re trying to figure out how many hours of sleep you get each night on average over the course of 15 weeks, but it varies from week to week. You may sleep 5, 8, 4, or 7 hours a night."
    },
    {
      "title": "Find the weight of each number.",
      "content": "Find the weight of each number. Once you know your numbers, figure out the total weight associated with each number. For example, let’s say that on average, over the course of 15 weeks, there were some weeks when you slept more hours per night than others. The weeks that are most representative of how much you usually sleep would have more “weight” than the others. You would use the number of weeks associated with each amount of sleep as your weighting factor. For instance, putting the weeks in order by weight: [8] X Research source 9 weeks when you slept 7 hours a night on average. 3 weeks when you slept 5 hours a night. 2 weeks when you slept 8 hours a night. 1 week when you slept 4 hours a night. The number of weeks associated with each number of hours is your weighting factor. In this case, you slept 7 hours a night during most weeks, while there were relatively few weeks when you slept more or fewer hours."
    },
    {
      "title": "Calculate the sum of all the weights.",
      "content": "Calculate the sum of all the weights. In order to determine the weighted average, you’ll need to figure out how much all the weights are worth when you put them together. To do this, simply add up all the weights. In the case of your sleep study, you already know that the total of all the weights is 15, since you are examining your sleep patterns over the course of 15 weeks. [9] X Research source The total number of weeks you looked at adds up as follows: 3 weeks + 2 weeks + 1 week + 9 weeks = 15 weeks."
    },
    {
      "title": "Multiply the numbers by their weights and add up the results.",
      "content": "Multiply the numbers by their weights and add up the results. Next, multiply each number in your data set by its corresponding weight, just as you would if the weights added up to 1 (or 100%). Add the resulting numbers together. For example, if you’re calculating the average amount of sleep you got each night over the series of 15 weeks, multiply the average number of hours you slept per night by the corresponding number of weeks. You would get: [10] X Research source 5 hours per night (3 weeks) + 8 hours per night (2 weeks) + 4 hours per night (1 week) + 7 hours per night (9 weeks) = 5(3) + 8(2) + 4(1) + 7(9) = 15 + 16 + 4 + 63 = 98"
    },
    {
      "title": "Divide",
      "content": "Divide the result by the sum of the weights to find the average. Once you’ve multiplied each number by its weighting factor and added the results, divide the resulting number by the sum of all the weights. This will tell you the weighted average. For example: [11] X Research source 98/15 = 6.53. This means you slept an average of 6.53 hours each night over the course of 15 weeks."
    }
  ]
}