{
  "url": "https://www.wikihow.com/Do-a-Fast-Ball-in-Tennis-in-Wii-Sports",
  "title": "How to Do a Fast Ball in Tennis in Wii Sports",
  "steps": [
    {
      "title": "Start a match of Wii Sports Tennis.",
      "content": "Start a match of Wii Sports Tennis. If you want to practice, play against some computer opponents. You can't use Training mode to practice."
    },
    {
      "title": "Wait until it is your turn to serve.",
      "content": "Wait until it is your turn to serve. You can only perform a fast strike while you are serving."
    },
    {
      "title": "Press \"A\" to toss the ball up to serve.",
      "content": "Press \"A\" to toss the ball up to serve. Don't hit it the first time, since you'll just be testing the timing."
    },
    {
      "title": "Time how long it takes the ball to reach its highest point.",
      "content": "Time how long it takes the ball to reach its highest point. The ball will hang in one spot for a moment. Let the ball fall back into your hand. This will let you get a feel for the timing."
    },
    {
      "title": "Toss the ball again and flick your Wii remote when it is at the top.",
      "content": "Toss the ball again and flick your Wii remote when it is at the top. Flick your Wii remote when the ball is hanging at the top of the toss. If you time it right, the ball should catch fire and shoot off very fast. The speed that you flick your wrist doesn't matter, you just need to flick it exactly when the ball is at its highest point."
    },
    {
      "title": "Continue practicing.",
      "content": "Continue practicing. Getting a consistent fast serve will take practice. You'll need to know the timing by heart if you want to be able to pull off these shots regularly."
    },
    {
      "title": "Vary your serves.",
      "content": "Vary your serves. Once you've mastered the power serve, don't use it every time. Your opponent will expect it and will soon be able to counter it easily. Instead, sprinkle power serves in every few serves to keep your opponents on their toes."
    }
  ]
}