{
  "url": "https://www.wikihow.com/Reheat-a-Burrito",
  "title": "5 Great Ways to Reheat a Burrito So It’s Crispy and Delicious",
  "steps": [
    {
      "title": "Place your burrito on a microwave-safe plate.",
      "content": "Place your burrito on a microwave-safe plate. Remove any foil the burrito is wrapped in. Foil in the microwave can cause a fire! [1] X Research source"
    },
    {
      "title": "Lay a damp paper towel over the burrito.",
      "content": "Lay a damp paper towel over the burrito. The damp paper towel will help your burrito heat up evenly and prevent it from getting soggy. [2] X Research source"
    },
    {
      "title": "Microwave the burrito on medium for 2 minutes.",
      "content": "Microwave the burrito on medium for 2 minutes. [3] X Research source"
    },
    {
      "title": "Keep heating the burrito for 1 minute at a time until it’s heated through.",
      "content": "Keep heating the burrito for 1 minute at a time until it’s heated through. Unwrap your burrito and check that the filling inside is hot. Once it’s finished, remove the paper towel and dig in! Want to turn your reheated burrito into a full-on meal? Enjoy it with delicious homemade guacamole or chips and homemade salsa."
    },
    {
      "title": "Preheat your oven to 225 °F (107 °C).",
      "content": "Preheat your oven to 225 °F (107 °C). If your burrito isn’t already wrapped in foil, wrap it in some now. Leave one end open so all the delicious filling inside the tortilla heats up evenly. [4] X Research source"
    },
    {
      "title": "Place the burrito on a baking sheet.",
      "content": "Place the burrito on a baking sheet. Set the baking sheet on the middle shelf of your oven. [5] X Research source"
    },
    {
      "title": "Bake the burrito for 30 minutes, then check the temp.",
      "content": "Bake the burrito for 30 minutes, then check the temp. After 30 minutes, unwrap the burrito and check the filling to see if it’s heated all the way through, tasting a bite if needed. [6] X Research source"
    },
    {
      "title": "Keep baking the burrito until it’s heated through.",
      "content": "Keep baking the burrito until it’s heated through. When it’s ready, remove the foil and enjoy! Pair your burrito with homecooked rice for an even more mouthwatering meal."
    },
    {
      "title": "Add a few drops of oil to a skillet and heat it over medium-low.",
      "content": "Add a few drops of oil to a skillet and heat it over medium-low. Let the pan pre-heat for a few minutes. [7] X Research source"
    },
    {
      "title": "Place your burrito in the skillet and turn up the heat to medium.",
      "content": "Place your burrito in the skillet and turn up the heat to medium. If your burrito is wrapped in foil, take that off first. Press down on the burrito with a spatula so it’s nice and flat in the skillet. [8] X Research source"
    },
    {
      "title": "Cover the skillet with a lid and heat the burrito for 5 minutes.",
      "content": "Cover the skillet with a lid and heat the burrito for 5 minutes. The lid will help trap in the heat so your burrito cooks evenly. [9] X Research source"
    },
    {
      "title": "Flip the burrito, put the lid back on, and cook it for 5 more minutes.",
      "content": "Flip the burrito, put the lid back on, and cook it for 5 more minutes. After 5 minutes, your burrito should be ready to go! [10] X Research source Like spicy burritos? Try making your own hot sauce."
    },
    {
      "title": "Preheat your air fryer to 330 °F (166 °C).",
      "content": "Preheat your air fryer to 330 °F (166 °C). Take off any foil wrapped around your burrito and toss it. [11] X Research source Pro tip: for a crispier burrito, spray the tortilla with olive oil or avocado cooking spray."
    },
    {
      "title": "Heat the burrito in the air fryer for about 15 minutes.",
      "content": "Heat the burrito in the air fryer for about 15 minutes. You’ll know it’s ready when the tortilla starts turning golden brown. [12] X Research source"
    },
    {
      "title": "Take out your burrito and enjoy!",
      "content": "Take out your burrito and enjoy! Try pairing your burrito with homecooked beans or maybe even a heaping plate of nachos."
    },
    {
      "title": "Preheat your toaster oven to 400 °F (204 °C).",
      "content": "Preheat your toaster oven to 400 °F (204 °C). Wrap your burrito in foil if it’s not already. [13] X Research source"
    },
    {
      "title": "Toast your burrito on high for 8-12 minutes.",
      "content": "Toast your burrito on high for 8-12 minutes. Check on the progress of your burrito—you’ll know it’s done when the filling inside is heated up all the way through. [14] X Research source"
    },
    {
      "title": "Remove the foil and toast your burrito for a couple more minutes.",
      "content": "Remove the foil and toast your burrito for a couple more minutes. This will give the outside of the burrito a delicious, crispy texture. After a couple minutes, remove the burrito from the toaster oven and dig in. [15] X Research source Next time, try making your own custom burritos at home with chicken, carne asada, chorizo, or another meat (or veggie substitute) of your choosing!"
    },
    {
      "title": "Deconstruct burritos with wet ingredients before reheating them.",
      "content": "Deconstruct burritos with wet ingredients before reheating them. If your burrito has sour cream, guacamole, or another wet ingredient in it, unroll it and scoop out the wet ingredients. Set them aside in a bowl and reheat your burrito—that way the wet ingredients will be cold just like when you first got the burrito. After your burrito is warmed up, add the wet ingredients back in and you’re good to go!"
    },
    {
      "title": "Reheat frozen burritos in the microwave or oven.",
      "content": "Reheat frozen burritos in the microwave or oven. Frozen burritos need to be heated at a higher temperature and for longer. Here’s how to reheat them so they still taste delicious: [16] X Research source Microwave : remove any foil and heat the burrito in the microwave using the defrost setting for a few minutes. Then, heat the burrito on high for 1-2 minutes. Oven : wrap the burrito in foil if it’s not already, then heat it in the oven for 30-40 minutes at 350 °F (177 °C)."
    },
    {
      "title": "Reheat breakfast burritos using any of the above methods.",
      "content": "Reheat breakfast burritos using any of the above methods. Yes, you can definitely reheat breakfast burritos too! Just like regular burritos, breakfast burritos will heat up nicely using a microwave, oven, stove top, air fryer, or toaster oven."
    }
  ]
}