{
  "url": "https://www.wikihow.com/Hide-What-Game-You%27re-Playing-on-Discord",
  "title": "2 Easy Ways to Hide What Game You're Playing on Discord",
  "steps": [
    {
      "title": "Open the Discord application.",
      "content": "Open the Discord application. Discord is available for Windows, Mac, and Linux. [1] X Research source You can also use Discord in your browser at https://discord.com/ . If you're playing a game with Discord Rich Presence support, Discord will indicate your gaming activity to your friends. Use this method to disable all activity status, or skip to the next section to hide only certain games ."
    },
    {
      "title": "Click the cog icon.",
      "content": "Click the cog icon. This is in the bottom-left corner, next to your profile picture and username ."
    },
    {
      "title": "Click Activity Privacy.",
      "content": "Click Activity Privacy . You can find this in the left panel, underneath the Activity Settings header."
    },
    {
      "title": "Toggle off \"Share your detected activities with others\".",
      "content": "Toggle off \"Share your detected activities with others\". This option is at the top of the page. The switch will turn grey. [2] X Research source Discord saves changes to your settings automatically, so you may exit this page and continue playing. You can revisit this section at any time to turn the slider back on and share your gaming status with others."
    },
    {
      "title": "Open the Discord application.",
      "content": "Open the Discord application. Discord is available for Windows, Mac, and Linux. You can also use Discord in your browser at https://discord.com/ . Use this method to keep your activity status on but hide specific games."
    },
    {
      "title": "Click the cog icon.",
      "content": "Click the cog icon. This is in the bottom-left corner, next to your profile picture and username."
    },
    {
      "title": "Click Registered Games.",
      "content": "Click Registered Games . You can find this in the left panel, underneath the Activity Settings header. You'll see a list of all currently added and recognized games."
    },
    {
      "title": "Click the eyeball icon next to the game or app.",
      "content": "Click the eyeball icon next to the game or app. This is the Toggle detection icon. When the red slash is active, this particular game will not show in your activity status. This feature is relatively new and may be buggy. For best experiences, hover over the game you want to hide and click the X to fully remove it from your added games. When you launch it again, it won't show in your activity status."
    },
    {
      "title": "Hide connections (optional).",
      "content": "Hide connections (optional). If you have certain accounts connected to your Discord profile, such as Crunchyroll , PlayStation, or Xbox, your activity will be displayed when you engage in these services. To hide it, do the following: Click the cog icon. Click Connections in the left panel. Toggle off Display [connection] as your status . Repeat for all connections you want to hide."
    }
  ]
}