{
  "url": "https://www.wikihow.com/Get-an-Adderall-Prescription",
  "title": "How to Get an Adderall Prescription",
  "steps": [
    {
      "title": "Be prepared for when you go and visit a doctor.",
      "content": "Be prepared for when you go and visit a doctor. If you think you have ADHD , you might experience some or all of these symptoms on a daily basis. ADHD is different for everyone, but common symptoms include: [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Having a short attention span Making many thoughtless mistakes Being forgetful or losing things often Having trouble sticking with tasks for a long period of time Having difficulty sitting still Excessive talking or physical movement A decreased or nonexistent sense of danger Acting impulsively"
    },
    {
      "title": "Your regular doctor can give you a prescription.",
      "content": "Your regular doctor can give you a prescription. If you have a psychiatrist, you can also make an appointment with them instead. Set up the appointment to talk about your ADHD symptoms to make sure you discuss a prescription medication. [2] X Research source A doctor won’t be able to counsel you like a psychiatrist will, but they can prescribe you medication."
    },
    {
      "title": "Talk about any concerns you have about your symptoms.",
      "content": "Talk about any concerns you have about your symptoms. Explain how they affect your daily life and how often you have them. Really reiterate how much your memory, attention span, and focus make it hard to do your schoolwork or job. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Always be honest , and try to be as thorough as possible when talking to your doctor or psychiatrist. The more you open up about your symptoms, the more they can help you."
    },
    {
      "title": "They may have questions about your symptoms.",
      "content": "They may have questions about your symptoms. If you have any trouble remembering something, defer back to your list of symptoms that you wrote out earlier. You might have to answer questions about your memory, your hyperactivity levels, or your impulsivity. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Don’t exaggerate, but don’t play it down, either."
    },
    {
      "title": "Some people don’t want to treat ADHD with medication.",
      "content": "Some people don’t want to treat ADHD with medication. However, if you’d like to try Adderall as a treatment, tell your healthcare professional that. Based on your symptoms, they might recommend that you try a different medication or stick to therapy for now. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Other ADHD medications include Ritalin, Concerta, Vyvanse, and Dexedrine. [6] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source You’ll also need to tell your doctor about any other prescriptions you’re taking and if you have a history of substance abuse."
    },
    {
      "title": "It’s important not to abuse Adderall if you get a prescription for it.",
      "content": "It’s important not to abuse Adderall if you get a prescription for it. Take the dose that your doctor prescribes, and try to monitor your symptoms throughout the day. The amount you take depends on your age, weight, medical history, and the type of medication you’re taking. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you are prescribed long-acting Adderall, or Adderall XR, you will probably only need to take 1 pill per day. [8] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source If you are prescribed standard Adderall, you may need to take 2 pills per day. [9] X Trustworthy Source Child Mind Institute Nonprofit organization providing evidence-based care for children with mental health and learning disorders and their families Go to source"
    },
    {
      "title": "All ADHD medication comes with a range of side effects.",
      "content": "All ADHD medication comes with a range of side effects. When you take Adderall, you might experience loss of appetite, insomnia, dizziness, headaches, stomach issues, or mood changes. These side effects may get better as you stay on the medication, but it’s important to tell your doctor about them. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If you experience any severe side effects like muscle weakness, panic attacks, hypertension, or psychosis, call your doctor right away. [11] X Research source"
    },
    {
      "title": "Make the appointment about a month from your start date.",
      "content": "Make the appointment about a month from your start date. After about a month or so, you should be able to tell if Adderall is improving your day-to-day life. You can talk about your focus, attention span, ability to concentrate, and hyperactivity levels. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source It might be helpful to keep a journal or a diary about your symptoms."
    },
    {
      "title": "Adderall is not a one-size-fits-all medication.",
      "content": "Adderall is not a one-size-fits-all medication. You might need to up your dosage, lower your dosage, or switch to a different medication entirely. Always talk to your doctor before stopping Adderall so you can do it safely, and follow their prescriptions exactly. [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Going cold turkey off Adderall can cause health problems like tremors, headaches, and having suicidal thoughts . Always talk to your doctor before stopping a prescription medication. [14] X Research source"
    },
    {
      "title": "Adderall is a controlled substance, so you won’t get automatic refills.",
      "content": "Adderall is a controlled substance, so you won’t get automatic refills. You will most likely need to visit your doctor every 30 days to talk about your symptoms and your dose levels. Some insurance companies let you do 90-day refills through the mail, but it depends on your healthcare provider. [15] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source You may be able to see your doctor via a video visit or over the phone."
    }
  ]
}