{
  "url": "https://www.wikihow.com/Design-a-Habitat-for-a-Ladybird",
  "title": "How to Design a Habitat for a Ladybird",
  "steps": [
    {
      "title": "Poke holes in an empty plastic box.",
      "content": "Poke holes in an empty plastic box. Choose a box that is a least 6 inches on each side, with a lid that seals. You can find large plastic food storage containers at a thrift store or dollar store. Using an icepick or a slender screwdriver, poke 6 – 10 breathing holes in the lid. Make the holes big enough to let air in, but too small for the ladybugs to escape. This step can be very dangerous. Ask an adult to help with this one."
    },
    {
      "title": "Add grass and leaves.",
      "content": "Add grass and leaves. Add some fresh leaves and grass from your garden, so your ladybirds will have something to crawl around on."
    },
    {
      "title": "Add some decoration.",
      "content": "Add some decoration. If you want to make your ladybird habitat pretty, you can add some decoration. Give your ladybugs small pebbles to explore, or tiny shells to hide under."
    },
    {
      "title": "Add ladybirds.",
      "content": "Add ladybirds. Search your yard or garden until you find a ladybug – you'll probably find one on a plant leaf or on a branch. Using a large leaf, gently brush the ladybird off its perch and into the box. Put the lid on the box, and look for the next one. You don't need too many ladybirds – three to six should be plenty. It is best to look for ladybirds in a bright, fruit-and-vegetable-filled garden. If it has plants and flowers, it's more than likely you'll find some. Ladybugs are more common in middle and late spring as well as early summer. If you can't find any ladybirds, you can order them online from a gardening supply store."
    },
    {
      "title": "Add some food.",
      "content": "Add some food. Place a few moistened raisins or banana slices in the box, so your ladybirds have something to eat. If you are going to keep them for more than one day, remember to add new food every day. [1] X Research source Never feed ladybirds citrus fruits like oranges or lemons, or any type of acidic fruit. Ladybirds can be kept for several days, but if you try to keep them permanently they will die of malnutrition. You should release them back into your garden within the week."
    },
    {
      "title": "Give them water.",
      "content": "Give them water. Place a wet paper towel in the box, so your ladybirds will have access to water. You can also keep their foliage moist by misting it with water from a spray bottle, or add water droplets to the leaves with a clean eye-dropper. [2] X Research source"
    },
    {
      "title": "Release your ladybirds.",
      "content": "Release your ladybirds. The little beetles will die if kept in a cage, so you'll want to return them to your garden after you've watched them for a while. The ideal time to release ladybugs is early evening, which gives them all night to find shelter, food, and water. [3] X Research source If you have a ladybird habitat in your garden, release your ladybugs near it."
    },
    {
      "title": "Create the outer framework.",
      "content": "Create the outer framework. You can use a large empty coffee can, a wooden box, or an open-faced birdhouse. A birdhouse with an overhang to keep rain out is ideal. If you're using a can or box, create an overhang by nailing a piece of plywood to the top, extending out several inches from the front of the box. [4] X Research source [5] X Research source"
    },
    {
      "title": "Collect assorted tubes.",
      "content": "Collect assorted tubes. Your finished ladybird hotel will look like a large box, with stacks of circular holes filling the front (the circles are the openings of the tubes.) Collect hollow tubes, like bamboo shoots or thin cardboard tubing. You can create more tubes by rolling leaves or paper. Ideally, you want a selection of different types of tubes in different widths (diameter.) [6] X Research source"
    },
    {
      "title": "Trim the tubes.",
      "content": "Trim the tubes. Measure the inner floor of the box or birdhouse from back to front. Then cut all the tubes to the same length, just long enough to fit inside the box or birdhouse. [7] X Research source Stack the tubes lengthwise from front to back, so that the holes face forward. Pack them snugly, but don't crush them – they need to remain hollow. Fill any gaps around large tubes with smaller tubes. Glue the tubes in place as you lay them down, or secure them with string or wire."
    },
    {
      "title": "Hang your ladybird hotel.",
      "content": "Hang your ladybird hotel. Hang the box (or can) of tubes in a bush or tree, or secured against a wall. Be sure the location is shaded, and will not get too hot. Tilt the box slightly forward, so any rain that gets in can drain out. Ladybirds will be attracted to the narrow tubes in the box, because it gives them a safe place to find shelter and hibernate. [8] X Research source Hang the box close to plants that ladybugs like (such as rosebushes), so the little beetles will be attracted to their hotel. If you like, you can add a few moist raisins in some of the holes to attract more ladybugs. Other bugs may move in to your ladybird hotel, and that's fine. Some gardeners create elaborate “bug hotels” to attract all sorts of different bugs to their garden."
    },
    {
      "title": "Purchase bamboo tubing.",
      "content": "Purchase bamboo tubing. Look for raw bamboo at gardening supply stores or the outdoor section of hardware stores. You can also find them online or in Walmart's home and garden center. Look for stalks at least a foot in length, and ½ to 2 inches in diameter."
    },
    {
      "title": "Cut your bamboo to size.",
      "content": "Cut your bamboo to size. Using a small hand saw, to shorten your bamboo stalks to about 10 – 12 inches in length. Cut the ends at an angle, so that the “top” side of the tube is longer than the “bottom” side of the tube on both ends. This will create a small “canopy” over the entrance to the tube to help keep rain out. [9] X Research source Be careful not to split the bamboo when you cut it. Use sandpaper to smooth any rough edges."
    },
    {
      "title": "Drill hanging holes.",
      "content": "Drill hanging holes. Using a small power drill, create a hole near the opening at each end. Drill both holes on the “top,” or longer side of the tube. [10] X Research source Be sure the holes are large enough to feed the chain or twine through."
    },
    {
      "title": "Thread twine or chain through the holes.",
      "content": "Thread twine or chain through the holes. You can use sturdy twine or slender chain to hang your ladybird feeder. Thread the twine into one hole from the outside, push it through the tube, and pull it out through the hole at the other end. Pull the twine until the overhanging ends are about the same length, and tie the ends together. If you are using chain, connect the ends with a twisty tie. [11] X Research source"
    },
    {
      "title": "Stock your feeder with raisins.",
      "content": "Stock your feeder with raisins. Place a handful of raisins in the feeder tube before hanging it. The raisins will attract ladybirds, and give them something to eat when pest insects are scarce. [12] X Research source Replenish your feeder with raisins from time to time, to keep your ladybirds around when they aren't eating aphids."
    },
    {
      "title": "Hang your ladybird feeder.",
      "content": "Hang your ladybird feeder. Hang the feeder close to the plants in your garden that seem to attract the most pests. Rose bushes, in particular, are known to attract aphids (a favorite of ladybugs.) [13] X Research source"
    },
    {
      "title": "Grow plants that attract ladybirds.",
      "content": "Grow plants that attract ladybirds. Ladybirds will help keep your plants healthy by feeding on scales, mites, mealybugs, leaf hoppers, and aphids. To attract more ladybugs to your garden, plant things that will attract them. [14] X Research source Flowers that attract ladybirds include: geraniums (scented), coreopsis, and cosmos. Herbs that attract ladybugs include: angelica, cilantro, caraway, fennel, and dill."
    }
  ]
}