{
  "url": "https://www.wikihow.com/Delete-YouTube-Playlist",
  "title": "2 Quick Ways to Delete Any Playlist on YouTube",
  "steps": [
    {
      "title": "Open the YouTube app.",
      "content": "Open the YouTube app. This is the white play button with a red background. If you aren't already logged into your YouTube account , do so now. You can delete playlists that you created . For playlists you didn't make, you can remove the bookmark to delete it from your library."
    },
    {
      "title": "Tap your profile picture.",
      "content": "Tap your profile picture. This is at the bottom-right corner."
    },
    {
      "title": "Tap the playlist you want to delete.",
      "content": "Tap the playlist you want to delete. You'll find this under the Playlists section. You can also tap View all to find the playlist more easily."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . This is in the top-right corner. If you're trying to delete a playlist made by someone else, tap the bookmark icon underneath the title instead. The icon will no longer be filled, and you'll see Removed' at the bottom of your screen."
    },
    {
      "title": "Tap Delete playlist.",
      "content": "Tap Delete playlist . This is at the top of the menu."
    },
    {
      "title": "Tap Delete.",
      "content": "Tap Delete . The playlist will be deleted from your library."
    },
    {
      "title": "Go to https://www.youtube.com/ in a web browser.",
      "content": "Go to https://www.youtube.com/ in a web browser. If you aren't already logged into your YouTube account, do so now. [1] X Research source"
    },
    {
      "title": "Click Playlists.",
      "content": "Click Playlists . This is in the left sidebar. If you don't see this option, click the three-line icon to expand the menu. You'll see all of your saved playlists."
    },
    {
      "title": "Click View full playlist.",
      "content": "Click View full playlist . This is the last option underneath the playlist's thumbnail. The playlist will expand in full view."
    },
    {
      "title": "Click ⋮.",
      "content": "Click ⋮ . This is underneath the playlist's title. If you're trying to delete a playlist made by someone else, click the bookmark icon underneath the title instead. The icon will no longer be filled, and you'll see Removed from library at the corner of your screen."
    },
    {
      "title": "Click Delete playlist.",
      "content": "Click Delete playlist . This is the last option, next to the trash can icon. The playlist will be deleted."
    }
  ]
}