{
  "url": "https://www.wikihow.com/Insert-a-Cross-Mark-in-Word",
  "title": "How to Insert a Cross Mark in Word (Including Keyboard Shortcut)",
  "steps": [
    {
      "title": "Open your document in Word.",
      "content": "Open your document in Word. You can either open Word, then go to File > Open to open your document, or you can right-click your document file and click Open with > Word . You can also create a new, blank document."
    },
    {
      "title": "Click where you want to add the symbol.",
      "content": "Click where you want to add the symbol. The cursor defaults to the last place it was when you last worked on the document or in the most upper left corner of a new document. You can use the ALT code Alt + 0215 instead of continuing through with the rest of this method, though that alt code will produce a small cross mark (×). If you want to read more about ALT codes, read How toType Symbols Using the ALT Key . [1] X Research source"
    },
    {
      "title": "Click the Insert tab.",
      "content": "Click the Insert tab. You'll see this along the top of your document space next to the Home tab. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you're using a Mac, you'll see this along the top of your screen, and it will produce a drop-down menu."
    },
    {
      "title": "Click Symbol.",
      "content": "Click Symbol . You'll see this in the far right of the menu in the Symbols grouping. If you're using a Mac, you'll find this in the middle of the drop-down menu."
    },
    {
      "title": "Click More Symbols.",
      "content": "Click More Symbols . You'll see this at the bottom of the menu. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you're using a Mac, the button is Advanced Symbol instead. A window will pop up and you can click to select the cross mark symbol and click Insert . [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click to select Wingdings 2 from the font drop-down menu.",
      "content": "Click to select Wingdings 2 from the font drop-down menu. You'll find this under the Symbols tab."
    },
    {
      "title": "Click to select the cross mark symbol and click Insert.",
      "content": "Click to select the cross mark symbol and click Insert . You'll see the cross mark symbol appear in the document where your cursor is located. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    }
  ]
}