{
  "url": "https://www.wikihow.com/Hook-a-Sand-Flea",
  "title": "How to Hook a Sand Flea",
  "steps": [
    {
      "title": "Put some attractor beads on your line.",
      "content": "Put some attractor beads on your line. Sand flea eggs are orange in color; many fishermen believe these eggs are what attract fish to eat sand fleas. They therefore like to thread orange plastic beads on their line before attaching the hook. Small fluorescent orange bobbers can serve the same purpose as the beads, with the added benefit of keeping the bait just off the bottom."
    },
    {
      "title": "Attach a short monofilament leader.",
      "content": "Attach a short monofilament leader. If you like to fish with light line (10 to 15 pound test/5 to 7 kg class), use a heavier monofilament leader (25 pound test/12 kg class) of about 18 inches (45 cm). You can attach a snap swivel to the line to make it easier to change hooks/lures. You may also want to use a small split shot for added casting weight."
    },
    {
      "title": "Add some weight to the line.",
      "content": "Add some weight to the line. Some fishermen use only a small split shot for added casting weight, while others use sinkers of up to 4 ounces (114 g), depending on where they’re fishing and what species they’re after."
    },
    {
      "title": "Choose the right hook.",
      "content": "Choose the right hook. There are two styles of hook commonly used for hooking sand fleas: Pompano fishermen favor the Kahle hook, which features a wide, round bend that aims the hook point back toward the middle of the hook shaft. Other circular style hooks can work equally well. Sheepshead fishermen prefer to use a long-shafted hook, typically about size 1."
    },
    {
      "title": "Hook the sand flea lightly through the body.",
      "content": "Hook the sand flea lightly through the body. Thread the point up through the body above the telson (spade-like tail section) and belly sac toward the head, making sure the crustacean can disperse its eggs as you retrieve it. [2] X Research source Ideally, the hook will be run through at enough of an angle so the crustacean will be pulled to the side when you retrieve the bait. Some fishermen prefer to push the barb through the shell, while other fishermen prefer to poke only the hook point through the shell. Lightly hooking the sand flea this way makes it less likely to hang up on seaweed or rocks. Some fishermen prefer to remove the sand flea’s hard outer shell altogether."
    },
    {
      "title": "Go out to the beach at low tide.",
      "content": "Go out to the beach at low tide. This exposes the areas sand fleas inhabit."
    },
    {
      "title": "Look for V-shaped areas on the sand near tiny shells and rocks.",
      "content": "Look for V-shaped areas on the sand near tiny shells and rocks. The V-marks are places where sand fleas have dug themselves in. [3] X Research source You may also be able to see a few sand fleas in the process of burying themselves."
    },
    {
      "title": "Gather up a bunch of sand fleas.",
      "content": "Gather up a bunch of sand fleas. The easiest way to do this is with your hands, a sand shovel, or a sand rake, but some fishermen instead put out a thin net where the sand fleas are, kick the sand to loosen it, then let the tide sweep the dislodged sand fleas into the net."
    },
    {
      "title": "Keep the sand fleas in a bucket of moist sand.",
      "content": "Keep the sand fleas in a bucket of moist sand. Sand fleas need enough moisture to keep their gills wet, which is why you use moist sand. You do not want to submerge them in water, however, as they will drown. If the weather is especially hot, cover the moist sand with a damp cloth. You may also want to cover the cloth with ice chips to keep the cloth and sand beneath cool."
    },
    {
      "title": "Drain out the fleas’ waste daily.",
      "content": "Drain out the fleas’ waste daily. Sand fleas will keep 3 to 4 days in a bucket of moist sand, but during that time, they do produce a yellow-colored waste that must be removed to keep them from suffocating."
    },
    {
      "title": "Consider freezing sand fleas for later use.",
      "content": "Consider freezing sand fleas for later use. If you can’t readily find sand fleas, or you find more than you can use during a single outing, you may want to freeze and store sand fleas for future use. To do this, first boil the fleas and then freeze them. Frozen sand fleas will keep 3 to 4 months."
    }
  ]
}