{
  "url": "https://www.wikihow.com/Perform-Suplexes-in-Pro-Wrestling",
  "title": "How to Perform Suplexes in Pro Wrestling",
  "steps": [
    {
      "title": "Get into a DDT position, but wrap their left arm around your head.",
      "content": "Get into a DDT position, but wrap their left arm around your head. [1] X Research source"
    },
    {
      "title": "Put your right arm on their waist, and lift them up into a vertical position.",
      "content": "Put your right arm on their waist, and lift them up into a vertical position."
    },
    {
      "title": "Fall backwards, letting your back land first.",
      "content": "Fall backwards, letting your back land first."
    },
    {
      "title": "Wrap your opponents right arm around your head, or vice versa if you're a lefty.",
      "content": "Wrap your opponents right arm around your head, or vice versa if you're a lefty. [2] X Research source"
    },
    {
      "title": "Wrap both of your arms around their stomach, and pull up.",
      "content": "Wrap both of your arms around their stomach, and pull up. They should land head first or shoulder first."
    },
    {
      "title": "Wrap your arms around their stomach.",
      "content": "Wrap your arms around their stomach. [3] X Research source"
    },
    {
      "title": "Pull up until they are over your head.",
      "content": "Pull up until they are over your head."
    },
    {
      "title": "Let go and they should be thrown over your head and land on the lower part of their neck first.",
      "content": "Let go and they should be thrown over your head and land on the lower part of their neck first."
    },
    {
      "title": "Hook a leg with the suplex.",
      "content": "Hook a leg with the suplex. [4] X Research source Usually hook the left leg, so that the jumping is easier. The harder the leg is hooked, the less likely it is to hit you in the head if you decide to bridge the move."
    },
    {
      "title": "Know how you can change this move, and still get the same desired effect.This move can be changed into a pin if you bridge the move, so that you bridge off your head.",
      "content": "Know how you can change this move, and still get the same desired effect.This move can be changed into a pin if you bridge the move, so that you bridge off your head."
    },
    {
      "title": "Grab the opponent by their waist.",
      "content": "Grab the opponent by their waist. [5] X Research source"
    },
    {
      "title": "Lift them up so it takes the form of something much like a gut-wrench power-bomb.",
      "content": "Lift them up so it takes the form of something much like a gut-wrench power-bomb. (Like Jack Swagger.) Unlike a powerbomb, the move is done over your right shoulder. The opponent needs to take it with a front bump."
    },
    {
      "title": "Grab your opponent's arm, and pull.",
      "content": "Grab your opponent's arm, and pull."
    },
    {
      "title": "Lock your head in their right arm and make sure to have both of your arms holding their waist.",
      "content": "Lock your head in their right arm and make sure to have both of your arms holding their waist."
    },
    {
      "title": "Pull up, so they land back first.",
      "content": "Pull up, so they land back first. This move ends in a pin, and was made and popularized by Chris Jericho."
    },
    {
      "title": "Grab your opponent into a general DDT position.",
      "content": "Grab your opponent into a general DDT position. Lifting both arms up, hook both of your hands together. [6] X Research source"
    },
    {
      "title": "Know how to receive the move.When receiving the move, make sure the opponent is in position, and then pull down with your arms to lock in - Make sure it's not too tight, or they will not be able to remove their arm.",
      "content": "Know how to receive the move.When receiving the move, make sure the opponent is in position, and then pull down with your arms to lock in - Make sure it's not too tight, or they will not be able to remove their arm."
    },
    {
      "title": "Know how to give the move.",
      "content": "Know how to give the move. Drop to a squat and then take the opponent overhead. When they are at the highest point, remove your right arm, and finish the move as if it were an arm-drag. To sell the move, drop to a front bump."
    },
    {
      "title": "Place yourself in a front face lock/DDT position.",
      "content": "Place yourself in a front face lock/DDT position. [7] X Research source"
    },
    {
      "title": "Grab down low, lock your hands on the back of your opponent.",
      "content": "Grab down low, lock your hands on the back of your opponent."
    },
    {
      "title": "Take your opponent overhead, the opponent should land on his back, Bridge on your head.",
      "content": "Take your opponent overhead, the opponent should land on his back, Bridge on your head. This can be made into a pin like the fisherman's suplex. Very important that the person receiving does a flip bump. It is very unlikely to get them over without a decent jump."
    }
  ]
}