{
  "url": "https://www.wikihow.com/Get-Hair-Glue-Out-of-Clothes",
  "title": "The Best Ways to Remove Dried Hair Glue From Your Clothes",
  "steps": [
    {
      "title": "Mix 1 cup (236 mL) of warm water with 1 cup (236 mL) of white vinegar.",
      "content": "Mix 1 cup (236 mL) of warm water with 1 cup (236 mL) of white vinegar. Put the water in a bowl and heat it up in the microwave for 1 minute to get it nice and warm. Then, pour in the white vinegar, mixing the 2 ingredients together. [1] X Research source"
    },
    {
      "title": "Dip a toothbrush in the mixture and brush off the glue.",
      "content": "Dip a toothbrush in the mixture and brush off the glue. Soak a toothbrush in the vinegar solution and apply it to the dried glue spots. Use the bristles to help dissolve the glue and the back of the toothbrush to scrape it off. Keep reapplying the mixture to the spot until the glue flakes off. [2] X Research source Don’t be afraid to apply some pressure! Depending on how much glue is on your clothes, it can take several minutes to work it out. Use your hands along with the toothbrush to pull and remove the dried glue. If you have a lot of set in hair glue, add a few drops of dish soap to the vinegar mixture. Dish soap also helps to soften the glue and lift up stains."
    },
    {
      "title": "Wash your clothes on your washing machine’s warm cycle.",
      "content": "Wash your clothes on your washing machine’s warm cycle. To remove the vinegar solution and any leftover glue stains from your clothes, throw them in the washer. Then, hang your clothes up to air dry fully. [3] X Research source If there are leftover glue stains after taking off the glue, just rub some laundry detergent directly into the stains before washing your clothes. Air drying helps you see if there is any glue residue or staining left over after washing. If you do have leftover glue or stains, just follow the steps above to get them out. Using a dryer can cause leftover glue to set in and fix itself to your clothes."
    },
    {
      "title": "Apply a few drops of rubbing alcohol to a discrete part of your clothes.",
      "content": "Apply a few drops of rubbing alcohol to a discrete part of your clothes. Before using rubbing alcohol all over the glue, perform a patch test. Find a piece of your clothing that’ll hide stains well, such as the inside of a hem, and pour on a few drops of rubbing alcohol. Wait for it to dry and see if there is any discoloration. [4] X Research source If you do see any discoloration, switch to a different method to get the glue out of your clothes."
    },
    {
      "title": "Soak a cotton ball in rubbing alcohol and press it on the glue for 1 minute.",
      "content": "Soak a cotton ball in rubbing alcohol and press it on the glue for 1 minute. To help loosen and dissolve the dried glue, coat a cotton ball or clean rag with rubbing alcohol. Then, press the cotton ball into the stain for 1 minute. [5] X Research source Acetone can be used in place of rubbing alcohol if you prefer. Just make sure to patch test the acetone on your clothes before applying it to the glue."
    },
    {
      "title": "Saturate the cotton ball again and dab at the glue.",
      "content": "Saturate the cotton ball again and dab at the glue. Soak a new cotton ball with rubbing alcohol. Then, blot the cotton ball onto the glue, dabbing on top of it and around it to further loosen the glue. [6] X Research source"
    },
    {
      "title": "Pry off the glue with a butter knife, alternating with more dabs of alcohol.",
      "content": "Pry off the glue with a butter knife, alternating with more dabs of alcohol. Using a blunt butter knife or spoon, carefully peel the glue off of your clothes. If the glue doesn’t feel softened enough to come off, dab at it some more with the cotton ball soaked in rubbing alcohol. Then, continue to scrape it off with the knife. [7] X Research source"
    },
    {
      "title": "Rinse your clothes with water and wash them in the washing machine.",
      "content": "Rinse your clothes with water and wash them in the washing machine. Once the glue is out of your clothes, rinse them under cold water to remove the rubbing alcohol and any glue debris. Then, pop your clothes in your washing machine using your machine’s warm cycle. Just let your clothes air dry fully before you wear them out again. [8] X Research source"
    },
    {
      "title": "Mix ½ cup (118 mL) of baking soda with ¼ cup (59 mL) of coconut oil.",
      "content": "Mix ½ cup (118 mL) of baking soda with ¼ cup (59 mL) of coconut oil . In a bowl, add in the baking soda and coconut oil. Mix the ingredients together until you have a smooth, paste-like consistency. [9] X Research source If your coconut oil is too hard to mix, pop it in the microwave for 10 to 15 seconds to soften it."
    },
    {
      "title": "Rub the baking soda solution into the dried glue.",
      "content": "Rub the baking soda solution into the dried glue. Take a dollop of the mixture and apply it on top of the dried glue. With your hands, work the mixture into the glue. As you massage the fabric, you’ll feel the bits of glue coming off. [10] X Research source If you don’t want to use your hands, scrape off the glue with a butter knife or spoon."
    },
    {
      "title": "Dab your clothes with warm water and dish soap.",
      "content": "Dab your clothes with warm water and dish soap. Because you’re using oil on your clothes, you’ll need some dish soap to get it out. In a bowl, warm up 1 cup (236 mL) of water in the microwave. Squeeze in several drops of dish soap and swirl it around to get the water nice and soapy. Simply wet a clean cloth with the soapy water and dab at the baking soda-oil mixture to remove it from your clothes. [11] X Research source If your hair glue spots aren’t too large in the first place, just soaking them in hot, soapy water can be enough to loosen the glue so you can pull it off with your hands."
    },
    {
      "title": "Wash your clothes in the washing machine using its warm setting.",
      "content": "Wash your clothes in the washing machine using its warm setting. To get your clothes back to their old selves, place them in the washing machine and wash them on a warm water cycle. Then, remove them from the washer and let them air dry fully. [12] X Research source"
    },
    {
      "title": "Put a handful of ice cubes in a plastic bag and place it over the glue.",
      "content": "Put a handful of ice cubes in a plastic bag and place it over the glue. Using ice is a super easy way to freeze the dried glue so it’s solid enough to pull off. Just get out a plastic storage bag and put a handful of ice cubes inside. Then, set it over the dried hair glue for 5 to 10 minutes. [13] X Research source Alternatively, if your piece of clothing is small enough, put it straight in the freezer. This also freezes the glue so it pops right off. Just wrap your clothing in a plastic storage bag and set it in the freezer for about 30 minutes."
    },
    {
      "title": "Peel off the glue with your hands.",
      "content": "Peel off the glue with your hands. Once the glue has frozen and hardened, simply pick it off with your fingers. If it’s still sticking to your clothes a bit, just place the bag of ice over the spot for another minute or 2. [14] X Research source"
    },
    {
      "title": "Apply a stain remover on top of the glue stains.",
      "content": "Apply a stain remover on top of the glue stains. When you use ice to remove hair glue, you’ll probably be left with some glue stains. Just rub a bit of stain remover or some laundry detergent into the spots and let it sit for several minutes to remove the stains. [15] X Research source"
    },
    {
      "title": "Wash your clothes in the washing machine using warm water.",
      "content": "Wash your clothes in the washing machine using warm water. To fully get the hair glue stains out, pop your clothes in the washer and wash them using your machine’s warm setting. Then, let your clothes air dry fully instead of placing them in the dryer. [16] X Research source"
    },
    {
      "title": "Apply a small dollop of glue remover onto the dried glue.",
      "content": "Apply a small dollop of glue remover onto the dried glue. If a more natural solution isn’t working for you, there are actually lots of products that are made specifically to remove glue! Choose one, like Goo Gone , and squeeze it on top of each glue spot on your clothes. [17] X Research source"
    },
    {
      "title": "Let the remover soak for 5 minutes, then scrape it off with a spoon.",
      "content": "Let the remover soak for 5 minutes, then scrape it off with a spoon. As the glue remover settles into your clothes, it loosens and dissolves the glue. Let it sit and soften the hair glue for about 5 minutes. Then, just use the edges of a spoon to gently scrape off the glue and any remaining remover. [18] X Research source"
    },
    {
      "title": "Wash your clothes on your washing machine’s warm setting.",
      "content": "Wash your clothes on your washing machine’s warm setting. Once all of the glue and remover is off of your clothes, place them in your washing machine. Just wash them on your machine’s warm cycle and hang them up to air dry. [19] X Research source"
    }
  ]
}