{
  "url": "https://www.wikihow.com/Get-Rid-of-Birds",
  "title": "How to Get Rid of Birds",
  "steps": [
    {
      "title": "Getting rid of the bird’s food and water may send them on their way.",
      "content": "Getting rid of the bird’s food and water may send them on their way. Secure your trashcan lids carefully and cover up your compost pits. A lot of birds, like pigeons and sparrows, will eat basically anything. Keeping a tidy yard and home will go a long way to sending them on their way. Fill in or drain any standing pools of water, and don’t leave any potential food sources outside. [1] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source If there’s a plant that the birds seem to enjoy in your garden, consider potting the plant and moving it inside. Do you have outdoor pets? If so, don’t leave the food and water outside after they get something to eat and drink. The food and water bowls may be attracting the birds. If you have a garage or a closed-off entryway, store your garbage cans inside. That’s really the best way to ensure the birds don’t poke around your home looking for food."
    },
    {
      "title": "If birds keep sneaking into your home, they’re getting in somewhere.",
      "content": "If birds keep sneaking into your home, they’re getting in somewhere. Walk around your home and check out any dryer vents, pipes, and openings. If there’s any chance a bird could sneak in and make it home, cover the opening with mesh wire. Birds tend to love nesting in attics, rafters, and crawl spaces, so keeping them from getting inside. [2] X Expert Source Elmer Bensinger Pest Control Specialist Expert Interview. 5 February 2021. Hire a contractor to install mesh wire on your roof. Unless your roof is flat, it isn’t safe to wander around up there. If you have any openings that aren’t supposed to be there, fill them in with silicone caulk or flashing . Putting mesh wire over your gutters will keep birds from perching on them while keeping all kinds of junk from building up. That’s a win-win!"
    },
    {
      "title": "Fake predators will spook birds away if they come into the area.",
      "content": "Fake predators will spook birds away if they come into the area. Place a variety of cheap, plastic animal decoys around your home. Choose natural predators of birds, such as snakes, owls, and even coyotes. Set one or two of these up around the perimeter of the bird-infested area. Rotate them out with fresh ones every few days to keep the birds on edge. Birds will be much less likely to hang around if they think they’ll be in danger. [3] X Research source Birds are surprisingly smart, and they’ll get wise that your decoys are fake if you leave them in the same location for too long."
    },
    {
      "title": "Birds will naturally avoid anything reflective, so do some decorating!",
      "content": "Birds will naturally avoid anything reflective, so do some decorating! Cut out strips of aluminum foil and hang them from the trees or shrubs. Punch holes in thin aluminum disposable pans and do the same thing. Hanging shiny CDs or reflective tape is another way to deter birds. Make sure that you leave plenty of room for these objects to spin around and move. [4] X Research source Metallic spinning propellers sold at most garden centers do an excellent job of ridding an area of birds. Shiny objects are only going to keep birds away if they move a little bit every now and then."
    },
    {
      "title": "An occasional loud noise will scare large groups of birds away.",
      "content": "An occasional loud noise will scare large groups of birds away. You don’t need to blast heavy metal out of your window every night either; just play a high-pitched noise or listen to a song with the windows open periodically. Any unnatural noise will confuse and scare the birds, and if the birds get scared often enough, they’ll learn not to stick around. [5] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source Playing recordings of birds in distress or raptors may be especially effective. This may freak your neighbors out though, so only play these sounds periodically when you see birds nearby or if you live in a rural area. [6] X Trustworthy Source University of Missouri Extension University of Missouri program dedicated to research-based, practical public education Go to source You can find all kinds of free recordings and compilations of birds in distress online."
    },
    {
      "title": "For a permanent solution, line your gutters and home with spikes.",
      "content": "For a permanent solution, line your gutters and home with spikes. Those X-shaped needles you see on the edges of large buildings are known as porcupine wire, and they’re a great way to keep birds from perching or assembling a nest. Hire a contractor to string this stuff up around the edges of your home. [7] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source This will really only work if you have a slanted roof, since the birds will still be able to land on the flat portion that isn’t covered with the wire."
    },
    {
      "title": "If you’ve got a dog or a cat, let them outside periodically to scare birds.",
      "content": "If you’ve got a dog or a cat, let them outside periodically to scare birds. The presence of a bird or dog will keep birds from hanging around for too long. Border collies, sheepdogs, and other breeds enjoy chasing birds and are very good at it. Take your pet out in your yard or on the porch whenever you’re hanging around outside to deter birds. [8] X Trustworthy Source National Audubon Society Nonprofit environmental organization focused on conservation, citizen science, and public science education Go to source If you’ve got a domesticated indoor cat, don’t take them outside without a leash."
    },
    {
      "title": "These machines emit a high-frequency sound to scare birds away permanently.",
      "content": "These machines emit a high-frequency sound to scare birds away permanently. The frequency of the noise is in the range where humans won’t hear it. They can be kind of pricey, but they’re extremely effective at keeping birds away. You just grab some batteries, turn the machine on, and leave it on your roof or in your yard. [9] X Trustworthy Source Penn State Extension Educational organization dedicated to delivering science-based information to people, businesses, and communities Go to source Don’t use one of these machines if you have pets. Cats and dogs can typically hear the sound they emit, and you may put your furry friend through some unnecessary stress."
    },
    {
      "title": "It’s cliché, but a scarecrow can keep birds away if you move it around.",
      "content": "It’s cliché, but a scarecrow can keep birds away if you move it around. Purchase a premade one from your local craft or garden store. Or, make your own by constructing a cross out of wood and then covering it with clothes stuffed with straw. Place your scarecrow in the vicinity of the pesky birds and watch them fly away. [10] X Research source Move your scarecrow around every few days to keep the birds from getting too comfortable with it. Changing up the clothes can help as well. Like the fake predator statues, the birds will get used to the scarecrow if it just sits in one location forever."
    },
    {
      "title": "This is a great option if you want to keep other pests away, too.",
      "content": "This is a great option if you want to keep other pests away, too. This solution is not feasible in every space, but can be a great tool to keep birds away while watering your garden! You typically just install some batteries and set the sprinkler in your yard. Every time a bird tries to land, a spray of water will scare them away. [11] X Trustworthy Source National Audubon Society Nonprofit environmental organization focused on conservation, citizen science, and public science education Go to source Even if the birds are just hanging out in a nearby tree, this will help. The moment something sets your sprinkler off, the sound of the sprinkler going off suddenly will scare birds away. These will also keep raccoons, rabbits, and stray cats from messing around in your yard. Don’t worry about the strength of the water stream. This is a harmless way of keeping an area bird-free."
    },
    {
      "title": "If there’s a nest or roost nearby, call a pro to do the job right.",
      "content": "If there’s a nest or roost nearby, call a pro to do the job right. It’s almost always illegal to disturb, move, or interfere with a native bird, so don’t take the risk by messing with it. Contact a local wildlife rehabilitation facility or bird removal specialist and have them take a look at the situation. They’ll be able to safely remove the bird and/or their nest from your yard, roof, or home. [12] X Expert Source Elmer Bensinger Pest Control Specialist Expert Interview. 5 February 2021. The vast majority of birds in the United States are protected by federal law, so if you’ve got a bunch of birds around, just assume that they’re protected. Don’t touch them or remove any nests without contacting a professional. [13] X Research source Outside of the fact that it’s often illegal, birds can carry a variety of diseases and parasites. It’s not worth the risk of touching a bird, a bird’s eggs, or a bird’s nest. [14] X Research source"
    }
  ]
}