{
  "url": "https://www.wikihow.com/Chick-Fil-a-Secret-Menu",
  "title": "The Best Hidden Menu Items to Try at Chick-fil-A",
  "steps": [
    {
      "title": "Fill Chick-N-Mini rolls with your favorite breakfast items.",
      "content": "Fill Chick-N-Mini rolls with your favorite breakfast items. Breakfast at Chick-fil-A is certainly superior, but you know what would make it even better? Combining everything into one awesome mini sandwich! Order the Chick-N-Minis with hash browns, dunk the hash brown into your favorite sauce, and place them inside the mini sandwiches. This secret menu item is only available during breakfast."
    },
    {
      "title": "Buy a Hash Brown Scramble Burrito with nuggets and shredded cheese.",
      "content": "Buy a Hash Brown Scramble Burrito with nuggets and shredded cheese. Watch out Taco Bell—Chick-fil-A is coming for your breakfast quesadillas! This menu hack is full of cheesy and pillowy potato goodness and turns your classic breakfast burrito into an entirely new experience. Mix some buffalo sauce and buttermilk ranch to dip your Chicken Quesadilla in, and you’ll savor every bite. This hidden menu item is only available during breakfast."
    },
    {
      "title": "Order a 12-count nugget, large fry, pepper jack cheese, and buffalo sauce.",
      "content": "Order a 12-count nugget, large fry, pepper jack cheese, and buffalo sauce. If you’re in the mood for nachos, this secret menu item will satisfy your craving!Creamy, spicy, and salty, the Loaded Chicken Waffle Fries hit all the marks. [1] X Research source This dish requires a bit of assembly, as you’ll most likely receive these items separately, but we promise the labor is worth it."
    },
    {
      "title": "Buy Mac & Cheese, 3 piece Chick-n-Strips, and Zesty Buffalo sauce.",
      "content": "Buy Mac & Cheese, 3 piece Chick-n-Strips, and Zesty Buffalo sauce. Cut or rip your chicken strips into bite-sized pieces and toss them into your mac and cheese. Then, smother everything with buffalo sauce for a spicy and creamy meal. [2] X Research source Ask for a side of bacon instead of Chick-n-Strips to make a Buffalo Bacon Mac & Cheese. [3] X Research source"
    },
    {
      "title": "Ask for fried chicken on a Club Sandwich.",
      "content": "Ask for fried chicken on a Club Sandwich. Looking for a fried chicken sandwich with all the veggie and bacony goodness of a Grilled Chicken Club? Well, look no further! The Fried Chicken Club is a Grilled Chicken Club with a fried patty instead of a grilled one. [4] X Research source"
    },
    {
      "title": "Grab lots of buffalo sauce to go with your Chicken Sandwich.",
      "content": "Grab lots of buffalo sauce to go with your Chicken Sandwich. If you’re a buffalo sauce lover, this is the secret menu item for you! Simply order a regular Chicken Sandwich and douse it with Chick-fil-A’s signature buffalo sauce. [5] X Research source For a supreme experience, disassemble your sandwich and place the patty back in the bag with buffalo sauce. Shake it up until the patty is covered in sauce, then reassemble. [6] X Research source"
    },
    {
      "title": "Ask for a Spicy Grilled Chicken Patty Sandwich.",
      "content": "Ask for a Spicy Grilled Chicken Patty Sandwich. If you love Spicy Chicken Sandwiches, this secret menu item is for you! The Spicy Char is a grilled version of the Spicy Chicken Sandwich, combining Chick-fil-A’s delicious grilled chicken with their spicy sauce."
    },
    {
      "title": "Purchase 2 Chicken Sandwiches without the buns.",
      "content": "Purchase 2 Chicken Sandwiches without the buns. Step aside KFC—Chick-fil-A is coming for you! This secret menu item replicates KFC’s Double Down (only with better chicken). When your order arrives, use the 2 chicken patties as the buns of your sandwich and place the cheese and other toppings in between the 2 patties."
    },
    {
      "title": "Order a Chick-fil-A Deluxe without chicken.",
      "content": "Order a Chick-fil-A Deluxe without chicken. This secret menu item is perfect for vegetarians or kids. Simply ask the Team Member to toast your meatless sandwich, and you’ll have a delicious grilled cheese. [7] X Research source For a classic grilled cheese experience, ask them to hold the lettuce, tomato, and pickle chips or order a toasted bun with cheese."
    },
    {
      "title": "Request a lettuce bun instead of a bread bun.",
      "content": "Request a lettuce bun instead of a bread bun. If you’re watching your carbs, substitute Chick-fil-A’s normal bun with 2 pieces of lettuce. Order your favorite sandwich as usual, but ask for it with extra lettuce and no bun."
    },
    {
      "title": "Sandwich a cup of ice cream between 2 cookies.",
      "content": "Sandwich a cup of ice cream between 2 cookies. It’s no surprise that Chick-fil-A knows how to do dessert, but did you know you could take their famous offerings to the next level? Order 2 Chocolate Chunk Cookies and a cup of Icedream. Then, scoop the ice cream on the bottom of 1 cookie and place the other on top. [8] X Research source"
    },
    {
      "title": "Purchase a fruit cup and an Icedream cup.",
      "content": "Purchase a fruit cup and an Icedream cup. Want something cold and sweet that’s bursting with fresh flavor? Place the fruit from Chick-fil-A’s fresh fruit cup on top of an Icedream cup to make your own ice cream sundae. The extra fruit makes it healthy, right? [9] X Research source"
    },
    {
      "title": "Mix a Cookies & Cream Milkshake with a Chocolate Chunk Cookie.",
      "content": "Mix a Cookies & Cream Milkshake with a Chocolate Chunk Cookie. Cookie fans, this one’s for you! All you have to do is crumble the deliciously soft cookie into your creamy milkshake, mix it up, and enjoy. [10] X Research source"
    },
    {
      "title": "Ask for a cup of root beer and a scoop of Icedream.",
      "content": "Ask for a cup of root beer and a scoop of Icedream. This classically simple dessert is packed full of rich flavor. See if a Team Member will make it for you (and blend it up), or order a root beer with ice cream on the side to assemble it yourself. [11] X Research source"
    },
    {
      "title": "Request a Lemonade with strawberry topping.",
      "content": "Request a Lemonade with strawberry topping. Chick-fil-A’s lemonade is top-tier, but what if we told you it could turn into something even better? Ask a Team Member for a Lemonade with strawberry milkshake topping inside. We promise you won’t be disappointed. [12] X Research source If the Team Member can’t make the drink for you, no worries! Order the items separately and combine them yourself."
    }
  ]
}