{
  "url": "https://www.wikihow.com/Find-a-Topic-for-Your-Research-Paper",
  "title": "How to Find a Topic for Your Research Paper",
  "steps": [
    {
      "title": "Your textbook, syllabus, and class notes can help you find a topic.",
      "content": "Your textbook, syllabus, and class notes can help you find a topic. If you're writing your paper for a class, skim through your course materials to see what sparks your interest. Major academic journals in your field of study might also give you ideas for a topic. [1] X Research source If your textbook has discussion questions at the end of each chapter, these can be great to comb through for potential research paper topic ideas. Look at any recommended reading your instructor has suggested—you might find ideas there as well."
    },
    {
      "title": "Run an internet search or talk to your instructor.",
      "content": "Run an internet search or talk to your instructor. Scholars in a field of study always know what issues are really hot in the field at any given time. If you want to write something more cutting edge, focus on these newly emerging issues. [2] X Research source Think about current events that touch on your field of study as well. For example, if you're writing a research paper for a sociology class, you might want to write something related to race in America or the Black Lives Matter movement. Other instructors in the same department or field might also have ideas for you. Don't be afraid to stop in during their office hours and talk or send them an email, even if you've never had them for a class."
    },
    {
      "title": "Being active can stimulate your mind to focus on topic ideas.",
      "content": "Being active can stimulate your mind to focus on topic ideas. If you've been churning through materials and just can't come up with something that really strikes you, taking a break will help. And research shows walking will boost your creative thinking by as much as 60%! [3] X Research source If you want to walk with a friend and discuss topic ideas as you walk, that can help too. Sometimes, you'll come up with new things when you can bounce your ideas off someone else."
    },
    {
      "title": "Bounce ideas off of people you know to get their thoughts.",
      "content": "Bounce ideas off of people you know to get their thoughts. Talking to other people is a great way to work through your general ideas and figure out more specifically what you might want to write your paper on. Pay particular attention to any questions they ask—those can be great at generating research topics. People who aren't really familiar with the general subject you're researching can be helpful too! Because they aren't making many assumptions, they might bring up something you'd overlooked or not thought about before."
    },
    {
      "title": "Set a timer for 5 or 10 minutes and write without stopping.",
      "content": "Set a timer for 5 or 10 minutes and write without stopping. Don't worry about editing or creating something polished—no one has to see this but you. Do this for each of your topic ideas. When the timer goes off, assess how you feel. Did you want to keep writing, or did you have to force yourself to keep going? How much about the topic do you already know? What are you curious about? Having a personal interest in the topic will keep you from getting bored. You'll do better research—and write a better paper—if you're excited about the topic itself."
    },
    {
      "title": "Search online for background articles about topics you like.",
      "content": "Search online for background articles about topics you like. You might have several topics you're thinking about—getting some background can help! Make sure the topic fits in with your assignment for your paper and that there are still unanswered questions out there. Generally, you don't want to write about something that's already been researched extensively. Ideally, based on your background research, you'll be able to choose one of the topics that interests you the most. If you still can't narrow it down, keep reading! Even though you wouldn't want to use them as sources for your actual paper, sources like Wikipedia can be excellent for getting background information about a topic."
    },
    {
      "title": "Jot down words related to your topic to search for sources.",
      "content": "Jot down words related to your topic to search for sources. For some topics, you'll include proper nouns, such as the name of a specific person you're researching. If your topic is more conceptual, on the other hand, include synonyms as well as the specific terminology you plan to use in your paper. [4] X Research source For example, if you've chosen environmental regulations as a topic, you might also include keywords such as \"conservation,\" \"pollution,\" and \"nature.\""
    },
    {
      "title": "Search online or on library databases and review your results.",
      "content": "Search online or on library databases and review your results. Use your keywords to find out how much research has already been done on the topic you're thinking about. This preliminary research can also give you some sources for your paper. [5] X Research source Your results might also suggest other keywords you can search to find more sources. Searching for specific terminology used in articles you find often leads to other articles. Check the bibliography of any papers you find to pick up some other sources you might be able to use."
    },
    {
      "title": "Narrow your topic to a specific time period, geographic area, or population.",
      "content": "Narrow your topic to a specific time period, geographic area, or population. If you're getting hundreds of results on your topic, try another search with something more specific. You might need to narrow your topic in more than one way to find something narrow enough that you can do it justice in your research paper. [6] X Research source For example, suppose you decided to look at race relations in the US during the Trump administration. If you got too many results, you might narrow your results to a single US city or state. Keep in mind how long your research paper will ultimately be. For example, if there's an entire book written on a topic you want to write a 20-page research paper on, it's probably too broad."
    },
    {
      "title": "Broaden your scope if you're not getting enough results from your keywords.",
      "content": "Broaden your scope if you're not getting enough results from your keywords. Sometimes, you'll type in your keywords and only get a handful of results—or worse, nothing at all! If you were doing an original study, this would be great. But you can't write a research paper without sources, so if you're not getting a lot of hits, you'll have to cast a broader net. [7] X Research source For example, suppose you wanted to research the impact of a particular environmental law on your hometown, but when you did a search, you didn't get any quality results. You might expand your search to encompass the entire state or region, rather than just your hometown."
    },
    {
      "title": "Run another search based on the information you've gained.",
      "content": "Run another search based on the information you've gained. Really, you can do this at the same time that you're limiting or expanding your topic. At this stage, your research is more about experimenting and staying flexible so you can find the best angle of approach that will yield results you can use. [8] X Research source For example, you might do an initial search and get hundreds of results back and decide your topic is too broad. Then, when you limit it, you get next to nothing and figure out you've narrowed it too much, so you have to broaden it a little bit again. Stay flexible and keep going until you've found that happy medium that you think will work for your paper."
    },
    {
      "title": "Use the 5 W's (who, what, when, where, and why) to write your question.",
      "content": "Use the 5 W's (who, what, when, where, and why) to write your question. You don't have to answer all of these questions, but they can help you narrow your focus. Ultimately, this research question will be the driving force behind your research and your entire paper. [9] X Research source For example, your research question might be something like \"How did environmental regulations affect the living conditions of people living near paper mills?\" This question covers \"who\" (people living near paper mills), \"what\" (living conditions), \"where\" (near paper mills), and \"why\" (environmental regulations)."
    },
    {
      "title": "Write down citation information as you work.",
      "content": "Write down citation information as you work. Even sources that you find in your preliminary research might end up being something you use in your final paper. Writing down the citation information also ensures that you can find the source again if you want to refer back to it. At this point, your list is still a \"working\" list. You won't necessarily use all the sources you find in your actual paper. Building a working list of sources is also helpful if you want to use a source and can't immediately get access to it. If you have to get it through your professor or request it from another library, you have time to do so."
    },
    {
      "title": "Your thesis is the answer to your research question.",
      "content": "Your thesis is the answer to your research question. Once you've got a little bit of research under your belt, you should be able to decide how you want to answer your research question. Then, you'll do additional research to prove or disprove your thesis. [10] X Research source For example, suppose your research question is \"How did environmental regulations affect the living conditions of people living near paper mills?\" Your thesis might be something like: \"Environmental regulations improved living conditions for people living around paper mills.\" As another example, suppose your research question is \"Why did hate crimes spike in the US from 2017 to 2020?\" Your thesis might be: \"A permissive attitude towards racial supremacy caused a spike in hate crimes in the US from 2017 to 2020.\" Keep in mind, you don't have to prove that your thesis is correct. Proving that your thesis was wrong can make for an even more compelling research paper, especially if your thesis follows conventional wisdom."
    }
  ]
}