{
  "url": "https://www.wikihow.com/Replace-a-Projector-Lamp",
  "title": "How to Replace a Projector Lamp",
  "steps": [
    {
      "title": "Gather the necessary tools.",
      "content": "Gather the necessary tools. Luckily, you'll only need a manual screwdriver to remove the panel. You will also want to have a soft, non-abrasive cloth handy to help avoid any contact with your fingers and the lamp assembly. A Micro-Fiber Cleaning Cloth is recommended."
    },
    {
      "title": "Turn off TV or Projector.",
      "content": "Turn off TV or Projector. After the unit has cooled down properly, remove the power cord from the outlet and the unit completely."
    },
    {
      "title": "Remove Lamp Compartment Door.",
      "content": "Remove Lamp Compartment Door. The lamp compartment on projectors is usually located underneath the projector unit. For Rear Projection TVs, the lamp compartment should be located in the rear towards the bottom left or right side of the TV. 2-4 screws will be holding the compartment in place. Removed the screws and the lamp compartment door."
    },
    {
      "title": "Remove Lamp Assembly.",
      "content": "Remove Lamp Assembly. Carefully pull out the lamp assembly and disconnect any power cords that may still be connected to the lamp assembly. Put it aside and don't get it confused with your new lamp!"
    },
    {
      "title": "Clean Lamp Compartment.",
      "content": "Clean Lamp Compartment. Dust gets everywhere and while you have the projector open, use a soft cloth or micro-fiber cleaning cloth to remove any loose dust from the lamp compartment."
    },
    {
      "title": "Insert New Lamp Assembly.",
      "content": "Insert New Lamp Assembly. Carefully reconnect any power cables to the new lamp if present and slide the new lamp into the compartment in the same orientation that the original lamp came out."
    },
    {
      "title": "Replace Lamp Compartment Door.",
      "content": "Replace Lamp Compartment Door. Set the lamp compartment door back into place and securely screw in the door without screwing it in too tightly."
    },
    {
      "title": "Reset the lamp timer.",
      "content": "Reset the lamp timer. Instructions on how to do this should be covered by the instruction manual."
    },
    {
      "title": "You're Done!",
      "content": "You're Done! Enjoy your projector or TV again and make sure you have a backup lamp handy in case the lights go out unexpectedly."
    }
  ]
}