{
  "url": "https://www.wikihow.com/Change-Wheel-Bearings",
  "title": "How to Change Wheel Bearings",
  "steps": [
    {
      "title": "Park your vehicle",
      "content": "Park your vehicle on a flat surface. As with most types of auto maintenance, you'll want to take all necessary precautions when changing your vehicle's wheel bearings to ensure your safety. The worst thing that can happen when changing your wheel bearings is for your vehicle to suddenly shift or roll away. Before you begin, park your vehicle on a level surface. Put the vehicle in park (or, for manuals, 1st, reverse, or neutral) and be sure to put the parking brake up. [1] X Research source Note: Every vehicle is different. The instructions below are intended as a general set of guidelines and thus will not perfectly fit every vehicle. If you run into problems while attempting to change your wheel bearing or have doubts after you finish, it's very wise to enlist the help of a professional mechanic. Doing so can save time, prevent future headaches, and save money in the long run."
    },
    {
      "title": "Use wheel chocks to secure wheels whose bearings you aren't replacing.",
      "content": "Use wheel chocks to secure wheels whose bearings you aren't replacing. For added stability, it can be smart to use sturdy chocks to hold your vehicle's wheels in place. Obviously, you'll want to use chocks on the wheels you don't plan on modifying, as the wheels you do modify will be elevated off the ground. For example, you would place wheel chocks behind the rear tires if you are fixing a front wheel bearing and behind the front tires if you are working on a rear wheel."
    },
    {
      "title": "Loosen the lug nuts",
      "content": "Loosen the lug nuts and lift the wheel using a jack. For proper access to the internal components of the wheel whose bearings you're replacing, you'll need to elevate the wheel. Luckily, most vehicles come with a jack for just this purpose. Before you lift the wheel, however, you may want to slightly loosen the lug nuts with a tire iron, as breaking their initial resistance is harder without the ground holding the wheel steady. After this, carefully lift your wheel. [2] X Research source If your vehicle doesn't come with a jack, you may need to buy a suitable jack at an auto supply store. See wikiHow's guide on how to change a tire for help elevating your vehicle's wheel. To prevent dangerous slippage, make sure that the vehicle is securely seated on the jack and that the jack is flush with the ground before attempting to lift the wheel. It's also important to make sure the jack touches the vehicle on a sturdy, metal piece of the undercarriage, rather than on fragile plastic molding, as the weight of the vehicle can damage the latter. Most vehicles have jack points where the frame has extra support to lift the vehicle. It's best to check the owners manual to learn the best place to position your jack. It is also extremely wise to use a safety jack stand for added support in the event the floor or scissor jack fails."
    },
    {
      "title": "Unscrew the lug nuts and remove the wheel.",
      "content": "Unscrew the lug nuts and remove the wheel. The lug nuts, which you should have already loosened, should come off easily. Remove these and put them in a safe place where you won't lose them. Next, remove the wheel itself. It should come freely. [3] X Research source Some like to keep track of the lugnuts by removing the hubcap , turning it over, and using it as a sort of \"plate\" to contain them."
    },
    {
      "title": "Remove the brake caliper.",
      "content": "Remove the brake caliper . Using a socket and a ratchet, remove the caliper's bolts. Then, remove the caliper itself using a screwdriver. When removing the caliper, be careful not to let it dangle freely, as this can damage the brake hose. Instead, hook it on a secure part of the undercarriage or use a short length of string to tie it in place. A bungee cord or a bent wire hanger are two additional ways to secure the caliper. [4] X Research source"
    },
    {
      "title": "Remove the dust cover, cotter pin, and castle nut.",
      "content": "Remove the dust cover, cotter pin, and castle nut. [5] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source In the center of the vehicle's exposed rotor should be a small metal or plastic cap called the dust cover which protects the components holding the rotor in place. Since you'll need to remove the rotor, the cap and the components it protects will have to go. Usually, the dust cover can be removed by gripping it with calipers and tapping the calipers with a hammer. Inside, you'll find the castle nut, usually secured with a cotter pin. Remove the cotter pin with pliers or wire cutters, then unscrew the castle nut and remove it (and its washer). Be sure to keep these small but important parts somewhere that they won't be lost!"
    },
    {
      "title": "Remove the rotor.",
      "content": "Remove the rotor. Place your thumb securely on the peg in the middle of the rotor assembly. Firmly (but somewhat gently) bump the rotor itself with the palm of your other hand. The wheel's outer bearing should loosen or fall out. Remove the outer bearing. Finally, remove the rotor itself. If the rotor gets stuck, you can use a rubber mallet to hit it loose. This can, however, damage the rotor, so it's best to use a mallet only if you are not planning on reusing the same rotor."
    },
    {
      "title": "Unscrew the hub bolts and remove the old hub.",
      "content": "Unscrew the hub bolts and remove the old hub. The wheel bearing is inside the hub, which is usually held in place with several bolts that screw in from behind. These bolts can be tricky to reach because they're tucked away in the undercarriage, so you may want to use a skinny socket wrench and/or a breaker bar to loosen and remove them. When you've removed the bolts, take the hub off of the axle. Note that if you've purchased a new hub assembly, at this point, you can install the new hub and put the wheel back together and you'll be finished. To install a new set of bearings inside the hub, read on."
    },
    {
      "title": "Disassemble the hub assembly.",
      "content": "Disassemble the hub assembly. To gain access to the bearings, you'll need to take apart the hub. You'll probably need to use a wrench (and/or a hammer) to remove the end of the hub and any anti-lock brake wheel that may be part of your hub. Then, you may need to use a specialized \"puller\" tool to remove the central bolt. The bearing assembly should come apart easily."
    },
    {
      "title": "Remove races and clean the knuckle.",
      "content": "Remove races and clean the knuckle. Removing the bearing assembly's races usually means physically breaking them with a grinder or hammer and chisel. Because of this, you'll want to have replacement races ready. After removing the races, it's a good idea to clean the inside of the bearing assembly around the knuckle. There's usually lots of grease and grime here, so have plenty of rags handy."
    },
    {
      "title": "Install new races and new wheel bearings.",
      "content": "Install new races and new wheel bearings. Set new races in place in the bearing assembly with a few taps from a hammer. Finally, grease a new inner bearing and install it in the assembly. Ensure the bearings are properly aligned, that they're pushed in as far as they can go, and that any sealing rings are flush with the outside of the assembly. [6] X Research source Use lots of grease for your bearings. You can apply the grease by hand or with a special \"bearing packer\" tool. [7] X Research source Rub plenty of extra grease around the outsides of your bearings and any sealing rings."
    },
    {
      "title": "Replace all parts in reverse order.",
      "content": "Replace all parts in reverse order. Now that you've changed the bearings, basically all that's left to do is to re-build your vehicle's wheel. Don't forget, however, that this means installing a new outer bearing after the rotor is in place. Put the hub assembly back together and install it on the axle shaft. Put the rotor back on and secure it in place with its bolts. Install a new, well-greased outer bearing at this point . Lightly tighten the castle nut and secure it in place with a new cotter pin. Replace the dust cap. Put the caliper and brake pads back in place and secure them with the appropriate bolts. Finally, put the tire back in place and secure it with lug nuts. When you're all done, carefully lower the car back down to the ground with your jack. Congratulations - you've just changed your wheel bearings."
    }
  ]
}