{
  "url": "https://www.wikihow.com/Fix-a-Squeaky-Dryer",
  "title": "How to Fix a Squeaky Dryer: Disassembly and Repair",
  "steps": [
    {
      "title": "Diagnose issues by listening to the dryer.",
      "content": "Diagnose issues by listening to the dryer. Turn the dryer on and listen to the squeaking. Is it coming from the back, top, or bottom of the dryer? The location of the squeaking will give you a hint as to what you need to replace and where to start looking. [1] X Research source If you can’t really tell where the squeak is coming from, that’s okay. Since you’re taking your dryer apart anyway, you’ll be able to get a closer look at all the parts to see what’s going on."
    },
    {
      "title": "Unplug the dryer.",
      "content": "Unplug the dryer. Before working on your dryer, unplug the unit from the wall and keep it unplugged the entire time. It’s dangerous to work on a dryer that’s still connected to power, so always do this before opening it up. [2] X Research source"
    },
    {
      "title": "Unscrew the screws on the back of the dryer.",
      "content": "Unscrew the screws on the back of the dryer. Take a look at the back of your dryer and find the 2 to 4 screws near the top that attach to the top panel. Use a screwdriver to unscrew these screws to disconnect the top panel from the back of the dryer. [3] X Research source Usually these screws are Phillip’s head, but your dryer may have different screws."
    },
    {
      "title": "Unscrew the screws holding the top panel in place.",
      "content": "Unscrew the screws holding the top panel in place. Depending on your dryer model, you may have 2 more screws near the front of the dryer or near the lint trap. Use your screwdriver again to unscrew any screws you see on the top of the dryer. [4] X Research source If the screws are near your lint trap, take the trap out of the dryer and set it aside before you unscrew."
    },
    {
      "title": "Pop the top of the dryer open.",
      "content": "Pop the top of the dryer open. Grab a putty knife or a flathead screwdriver and shimmy it underneath the top panel near the front of the dryer. Gently push the top panel upwards and open up the top of your dryer so you can see inside. [5] X Research source Rest the top panel of the dryer against a wall or another solid surface. Try to keep it at a 90-degree angle to the dryer so you don’t pull on any wires or connections. For some dryers, all you need to do is pull the top panel backward to slide it off."
    },
    {
      "title": "Unclip the switch on the top of the dryer.",
      "content": "Unclip the switch on the top of the dryer. The clip is what connects the wires from inside the dryer to the top of the dryer. Grab a pair of pliers and gently unclip the plastic pieces holding the wires together. [6] X Research source Unclipping the wires ensures you won’t pull or tug on them as you disassemble the rest of the dryer."
    },
    {
      "title": "Unscrew the front panel and pull it off.",
      "content": "Unscrew the front panel and pull it off. The front panel is normally held onto the dryer by 2 to 4 screws. Use a screwdriver to unscrew them, then pull the entire front panel off. Set it to the side to reattach it later on. [7] X Research source If there is a metal panel on top of your dryer, use your putty knife or flathead screwdriver to pop that off as well. Now your entire dryer is visible to you so you can see what’s going on."
    },
    {
      "title": "Check out the dryer belt on the drum of the dryer.",
      "content": "Check out the dryer belt on the drum of the dryer. Look at the drum, or the large metal cylinder inside the dryer. On the outside, you’ll notice a brown belt. Normal dryer belts are completely solid, and aren’t ripped or torn in any way. [8] X Research source Dryer belts are one of the most common issues with dryers, especially if yours is an older model. Belts tend to snap and fray easily, leading to a grating, irritating noise while drying."
    },
    {
      "title": "Replace the dryer belt",
      "content": "Replace the dryer belt if it’s frayed or torn. If the belt looks damaged in any way, get a new belt that matches your dryer model. Then, reach down to the idler pulley and gently lift the belt off of the pulley mechanism. Finally, pull the drum out of the dryer and swap out the old belt with a new one. [9] X Research source Dryer belts are easy to swap in and out. Simply pull the old one off the drum, then slide the new one onto it in its place. Some dryers are even missing a belt all together. If you look for a belt and you can’t find one, that’s a sure sign that it’s the lack of a belt causing the squeaking."
    },
    {
      "title": "Replace the glide bearings if they are damaged or torn.",
      "content": "Replace the glide bearings if they are damaged or torn. The glide bearings are the plastic seals inside of the drum near the front of the dryer. Take a look and see if they look frayed or damaged at all. If they do, release the locking tabs on the side of the drum by pinching the plastic pieces together, then remove the glide bearings. Then, attach new glide bearings to the inside of the drum. [10] X Research source Be sure to buy glide bearings made for your specific dryer model. Otherwise, they may not fit inside the drum."
    },
    {
      "title": "Put the drum back into the dryer.",
      "content": "Put the drum back into the dryer. Once you’ve replaced the belt, set the drum back into the middle of the dryer and then hook the belt onto the idler pulley. Give the drum a few spins with your hands to make sure everything looks good, then reassemble your dryer. [11] X Research source Be sure that the belt glides smoothly through the pulley before you reassemble your dryer. Otherwise, you could be dealing with more squeaking and grinding."
    },
    {
      "title": "Oil the idler pulley.",
      "content": "Oil the idler pulley. The idler pulley is situated underneath the drum near the back of the dryer. To get to it, reach down and pull the belt off of the idler pulley. Then, remove the drum from the dryer. Use WD-40 or a household oil to oil the roller wheel axle inside of the pulley. [12] X Research source To reattach the drum belt, set the drum inside the dryer and pull the belt over the pulley again. Spin the drum manually a few times to spread the oil around, then reassemble the dryer."
    },
    {
      "title": "Replace the idler pulley if it looks damaged.",
      "content": "Replace the idler pulley if it looks damaged. Sometimes, the idler pulley will be broken or damaged in a way that makes it squeak. If you’ve tried oiling it and it’s still squeaking, order a replacement pulley and pull the belt off the pulley. Pop off the tri-ring collar with a flathead screwdriver, then pull off the idler pulley and the washer. Replace them with new parts before reattaching the belt. [13] X Research source If your idler pulley is squeaky and you’ve fixed it with oil or WD-40, you might want to replace it anyway. Chances are, the oil will hold it over for a few weeks, but it will probably start squeaking again in the future."
    },
    {
      "title": "Install new roller wheels if they look dirty or damaged.",
      "content": "Install new roller wheels if they look dirty or damaged. Roller wheels sit near the very back of the dryer and help spin the drum. To access them, reach down to the idler pulley and gently lift the belt off, then pull the drum out of the dryer. Unscrew the metal bracket holding the wheel down, then pull off the tri-ring collar with a flathead screwdriver. Finally, pull off the roller wheel and then replace it with a new one. [14] X Research source Take this time to clean off any lint or hair that you see on the post of the roller wheel, too. This will help it spin smoothly instead of catching and squeaking."
    },
    {
      "title": "Remove the 3 to 4 screws on the blower housing on the back of the dryer.",
      "content": "Remove the 3 to 4 screws on the blower housing on the back of the dryer. Grab a screwdriver and head to the back of your unit. On the back, usually on the left side, you’ll see a large metal casing that runs from top to bottom. Unscrew the handful of screws keeping this metal casing on, then pull it off of your dryer. [15] X Research source You can only do this step after you’ve removed the top panel of your dryer."
    },
    {
      "title": "Clean the blower wheel and housing with a vacuum.",
      "content": "Clean the blower wheel and housing with a vacuum. When you take off the blower housing, you’ll probably notice a lot of lint and dust inside. Use a vacuum to clean out the housing thoroughly, then do the same thing to the blower wheel near the bottom of the vacuum. [16] X Research source As you clean the blower wheel, check it carefully for small objects that may have gotten lodged inside. Things like pencils and tweezers can get stuck inside the blower wheel, causing a squeaky grinding noise."
    },
    {
      "title": "Replace the blower wheel if it’s bent or damaged.",
      "content": "Replace the blower wheel if it’s bent or damaged. A bent, damaged blower wheel could be causing the squeak in your dryer. To replace the blower wheel, slip the dryer belt out of the idler pulley and pull the drum out of the dryer. Use a screwdriver to pop off the metal clip that holds the motor for the blower wheel in place, then use a wrench to unscrew the blower wheel from the rear motor. Then, unscrew the blower wheel with your hands the rest of the way. [17] X Research source Attach your new blower wheel by going in reverse: tighten the new wheel by hand, use a wrench to screw the wheel into the rear motor, and then add the metal clip back onto the motor."
    }
  ]
}