{
  "url": "https://www.wikihow.com/Add-Sales-Tax",
  "title": "How to Add Sales Tax",
  "steps": [
    {
      "title": "Determine the sales tax rate in your location.",
      "content": "Determine the sales tax rate in your location. You can look it up online or ask a sales associate what it will be. While states usually set a statewide sales tax, some municipalities add their own taxes on top of that. This means that the sales tax rate can vary drastically when moving between different cities or counties. [1] X Research source Sales tax is not charged on all items you buy. Check online to see what is, and is not, taxed in your area."
    },
    {
      "title": "Convert the sales tax percentage into a decimal figure.",
      "content": "Convert the sales tax percentage into a decimal figure. Take the percent number and imagine a decimal point after it. Now move that decimal point two spaces to the left, giving you the decimal equivalent of the sales tax percentage. For example, if the sales tax rate is 8%, the decimal figure will be .08. [2] X Research source"
    },
    {
      "title": "Multiply the price of the item by the decimal figure you calculated in the previous step.",
      "content": "Multiply the price of the item by the decimal figure you calculated in the previous step. This calculation will give you the amount of tax that will be charged for your purchase. For example, if the item you want to buy is $20, multiply 20 times .08 and you get 1.6. That means you will have to pay $1.60 in sales tax. [3] X Research source"
    },
    {
      "title": "Add the amount of tax you calculated to the listed price.",
      "content": "Add the amount of tax you calculated to the listed price. This will give you the total price you will have to pay at the register. Using our same example once again, if you will be charged $1.60 on your $20 item, simply add 1.6 to 20, for a total of $21.60."
    },
    {
      "title": "Round the sales tax rate to 10%.",
      "content": "Round the sales tax rate to 10%. No matter what the actual tax rate is, this will make your multiplication much simpler. The goal in estimating sales tax is to make the math simple enough to do in your head. Don't bother with exact amounts, just estimate well enough to make sure you have enough money to pay for what you want to buy. By using an estimate of 10% it will mean that, in most cases, you are rounding up, making your estimate more than you will actually pay. [4] X Research source If you are actually rounding the tax rate down, make sure to remember that your estimate will be a little bit less than you will need to pay."
    },
    {
      "title": "Move the decimal point in the cost of your item one space to the left.",
      "content": "Move the decimal point in the cost of your item one space to the left. This will give you a good, quick estimate of how much tax you will be charged. No need for complicated calculations, just move the decimal over and that will give you 10% of the cost on the tag. [5] X Research source In doing this, you are actually multiplying the cost of your item by the decimal equivalent of 10%, which is obviously really easy! For example, .10 times $20 equals $2."
    },
    {
      "title": "Add the estimated tax to the cost of the item.",
      "content": "Add the estimated tax to the cost of the item. Because we rounded up, your estimate will probably be higher than the tax actually charged, but you will know you can afford to pay the total cost. To use our example from the previous step one more time, $20 plus $2 makes the estimated total cost including tax $22."
    }
  ]
}