{
  "url": "https://www.wikihow.com/Address-a-Congressman",
  "title": "How to Address a Congressman",
  "steps": [
    {
      "title": "Write your email or letter to the congressional representative",
      "content": "Write your email or letter to the congressional representative in your constituency. You can contact a congressional representative to resolve a national, local, or personal issue, for instance. When doing this, it is best to contact the congressional representative in your area. [1] X Research source To find your local representative, visit https://www.house.gov/representatives/find-your-representative . Then, type in your zip code. However, there are no restrictions on contacting other congressional representatives. They just may not be able to help you as well as the representative in your constituency."
    },
    {
      "title": "Start with “Dear,” followed by \"Mr./Mrs./Ms.\" and their last name.",
      "content": "Start with “Dear,” followed by \"Mr. /Mrs./Ms.\" and their last name. If you are writing an email or letter to your congressional representative, use “Dear” for the proper salutation. Then, write \"Mr./Mrs./Ms.,\" and their last name. Complete the body of your letter explaining what action you want the congressional representative to take, and provide evidence explaining why this is significant or important. Write, “Dear Mr. Jones,” then begin the body your letter on the next line."
    },
    {
      "title": "Draft your email or letter using a polite and respectful tone.",
      "content": "Draft your email or letter using a polite and respectful tone. After you list the salutation, introduce yourself by giving your name, profession, and local district. Then, briefly summarize the issue at hand. You can write your congressional representative if you disagree with a current bill, for instance. Mention why the bill harming your local community, and provide statistics or facts illustrating the damage. Provide thorough support as to why the representative should take action on your concern. You can include your contact information for them to follow up with you if you'd like. Be sure the purpose of your email or letter is clearly stated. For instance, if you are referencing a particular bill, provide the number of the bill or resolution date. Write something like, \"Dear Mr. DeFazio, My name is John Doe, and I am a carpenter in your district. I am deeply saddened by the most recent logging bill proposed last month. I worry that if we keep cutting down trees, there won't be any left. I urge you to please consider voting against this bill.\""
    },
    {
      "title": "Close your email or letter by saying \"Sincerely\" or \"Respectfully.\"",
      "content": "Close your email or letter by saying \"Sincerely\" or \"Respectfully.\" Then, write your full name after the closing. When you write a letter to your representative, always leave a friendly, polite closing. For instance, write either \"Sincerely, Jane Doe,\" or \"Respectfully, John Doe.\" You can write thank you if you have made a request."
    },
    {
      "title": "Address the envelope if you're writing a letter to “The Honorable” to show your respect.",
      "content": "Address the envelope if you're writing a letter to “The Honorable” to show your respect. “The Honorable” is the usual title given to elected officials in the United States. Whether you are writing a letter or an email, use this to address your congressman or congresswoman. For example, if you were writing to Oregon Democratic Representative Peter DeFazio, you’d start out by writing “The Honorable.”"
    },
    {
      "title": "Add the representative’s full name after “The Honorable.”",
      "content": "Add the representative’s full name after “The Honorable.” When addressing a representative in writing, you should use their first and last name at a minimum. Add their middle name or middle initial if they commonly use it in their name. To figure out if your congressional representative goes by their middle name or middle initial, search them online and review their congressional webpage. For instance, if writing to Oregon Democratic Representative Peter DeFazio, address him as “The Honorable Peter DeFazio.”"
    },
    {
      "title": "Write “United States House of Representatives” after their name.",
      "content": "Write “United States House of Representatives” after their name. This way, your correspondence goes to the correct branch of government. If you are writing the Pennsylvania Republican Party Congressman Tim Murphy, write “The Honorable Tim Murphy” Then, write “United State House of Representatives” on the next line."
    },
    {
      "title": "List their business address after “House of Representatives.”",
      "content": "List their business address after “House of Representatives.” This is the last step in your greeting. To find the representative’s business address, search their name online, and go to their personal electoral website. Then, look for the “Contact” link. Many of these addresses are in Washington, DC. For example, your full heading might read: The Honorable Tim Murphy United States House of Representatives 2040 Frederickson Pl, Greensburg, PA 15601."
    },
    {
      "title": "Use \"Mr./Mrs./Ms.\" followed by their last name for a personal greeting.",
      "content": "Use \"Mr. /Mrs./Ms.\" followed by their last name for a personal greeting. If you are meeting with a congressman or congresswoman face-to-face or over the phone, use a professional title such as \"Mr./Mrs./Ms.,” and then their last name. After you initially say this, you can refer to them as “sir” or “ma’am.” [2] X Research source Avoid saying “Congressman/Congresswoman” when addressing them in person. While this still sounds polite, it is not proper protocol."
    },
    {
      "title": "Say “The Honorable” before their last name when giving an introduction.",
      "content": "Say “The Honorable” before their last name when giving an introduction. In some instances, you may be responsible for introducing a congressman or congresswoman, like during a large event or conference. To give a formal introduction, start off with “The Honorable,” and then provide only their last name. [3] X Research source"
    },
    {
      "title": "Call them “Congressman\" or \"Congresswoman\" as an informal alternative.",
      "content": "Call them “Congressman\" or \"Congresswoman\" as an informal alternative. First, use the formal greetings. Then, ask them if they prefer the alternatives if you want to use them. Some members of Congress prefer to be called by these titles, rather than “The Honorable” or \"Mr./Mrs./Ms.” This is based on personal preference. [4] X Research source After using the formal greeting, the representative may ask you to call them “Congressman” or \"Congresswoman\" instead. You can say “Representative” or \"Congressman/Congresswoman\" interchangeably."
    }
  ]
}