{
  "url": "https://www.wikihow.com/Parboil",
  "title": "How to Parboil",
  "steps": [
    {
      "title": "Boil a pot of water on the stovetop.",
      "content": "Boil a pot of water on the stovetop. Fill a saucepan with tap water and then place it on the stovetop. Place a lid on the saucepan to make the water boil a little quicker and wait until it is bubbling vigorously and continuously. Water normally takes about 10 minutes to boil."
    },
    {
      "title": "Cut all your vegetables to the same size.",
      "content": "Cut all your vegetables to the same size. In order for the food to cook evenly, it is important to cut your vegetables to the same size. The actual size of the pieces doesn’t matter, as long as they are all a similar shape and size. [1] X Research source Avoid grating the vegetables, as this causes them to cook too quickly and makes it hard to parboil them."
    },
    {
      "title": "Leave cauliflower pieces in boiling water for approximately 4 minutes.",
      "content": "Leave cauliflower pieces in boiling water for approximately 4 minutes. Cauliflower doesn’t take long to cook, so place it in boiling water for longer than 5 minutes. Set a timer to help yourself keep track of the time. After 4 minutes, remove the cauliflower pieces from the water. [2] X Research source If you are parboiling an entire cauliflower, leave it in the boiling water for 8 minutes."
    },
    {
      "title": "Parboil 2 cm (0.79 in) potato cubes for about 10 minutes.",
      "content": "Parboil 2 cm (0.79 in) potato cubes for about 10 minutes. Gently place the potato cubes into the boiling water. Avoid dropping them in, as this cause splashes of hot water to burn you. After 10 minutes, drain the potatoes immediately to stop them from continuing to cook. [3] X Research source If you are parboiling larger pieces of potato, simply increase the cooking time a little. For example, if your potatoes are in 3 centimetres (1.2 in) cubes, boil them for 15 minutes. Parboiled potatoes are great for roasting and making hashbrowns with."
    },
    {
      "title": "Leave mushrooms to boil for 2 minutes.",
      "content": "Leave mushrooms to boil for 2 minutes. Mushrooms cook really quickly so they require very little exposure to the boiling water. Add the mushrooms to the boiling water and wait for them to parboil. Drain the water after 2 minutes to stop the mushrooms from cooking any further. [4] X Research source This technique can be used on all types of edible mushrooms."
    },
    {
      "title": "Bring a pot of water to the boil.",
      "content": "Bring a pot of water to the boil. Place a saucepan of tap water on the stove top and turn the heat up to high. Put a lid on the saucepan to help the water boil faster. Wait about 10 minutes for the water to come to a rolling boil. If you like, add a pinch of salt to accentuate the flavours in the meat."
    },
    {
      "title": "Parboil chicken until it loses its pink colour.",
      "content": "Parboil chicken until it loses its pink colour. It is important to make sure that the inside of the chicken has no sign of pink flesh before you remove it from the water. Simply place a knife into the flesh to check the colour of the meat. Check the colour of the meat in a couple of places to ensure that the entire chicken is cooked. [5] X Research source Parboil a whole chicken for 30-40 minutes. Parboil a chicken breast for 10 minutes and parboil legs, thighs, and quarters for 5 minutes."
    },
    {
      "title": "Leave beef or pork ribs to parboil for 45 minutes.",
      "content": "Leave beef or pork ribs to parboil for 45 minutes. Many recipes require you to parboil your beef ribs before roasting them. This can help to stop the ribs from drying out. Place the ribs into the water for 45 minutes with the lid on. Once they have parboiled, drain the water. [6] X Research source Avoid parboiling other cuts of pork and beef, as it can make the meat too chewy."
    },
    {
      "title": "Place a pot of water on the stovetop to boil.",
      "content": "Place a pot of water on the stovetop to boil. Pour tap water into a pot and then place it on the stovetop. Wait for the water to start bubbling vigorously and continuously. This takes approximately 10 minutes. Put a lid on the saucepan to help it boil faster."
    },
    {
      "title": "Boil white rice for 5 minutes to parboil it.",
      "content": "Boil white rice for 5 minutes to parboil it. Parboiling rice is a great option if you are making a risotto or if you are freezing it, as it prevents it from going soggy when you reheat it. Place the rice into a saucepan of cold water and then wait for it to boil. Once the water starts boiling, leave the rice to cook for 5 minutes and then drain out the water. [7] X Research source Only cook 1 type at a time, as different types of rice have different cooking times."
    },
    {
      "title": "Leave brown rice to boil for 15 minutes.",
      "content": "Leave brown rice to boil for 15 minutes. Brown rice has a denser texture than white rice so it takes a little longer to parboil. Gently pour the rice into the boiling water and wait for it to cook. After, 15 minutes, drain out the excess water and leave the rice to cool. [8] X Research source Parboiled brown rice is great for making brown rice risotto and rice salad."
    }
  ]
}