{
  "url": "https://www.wikihow.com/How-Long-Should-You-Leave-Shampoo-in-Your-Hair",
  "title": "How Long Should You Leave Shampoo in Your Hair? Tips for Shinier, Healthier Hair",
  "steps": [
    {
      "title": "Long enough to work the shampoo into your whole scalp.",
      "content": "Long enough to work the shampoo into your whole scalp. The important thing when you’re shampooing your hair isn’t how long you’re doing it for, but how thorough you’re being. The exact amount of time that takes can vary depending on how much hair you have and how dirty your hair is. The main thing you should focus on is working the shampoo into your entire scalp from front to back. [1] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source That will help leave you with clean, bouncy, healthy-looking hair. Some shampoos may come with instructions to leave the product in your hair for a few minutes before rinsing it out. When in doubt, follow the instructions on the bottle."
    },
    {
      "title": "It could end up irritating your scalp.",
      "content": "It could end up irritating your scalp. Most shampoos aren’t meant to be left in your hair. They should be rinsed out right after you’re done lathering in the shower. If you’re tempted to let shampoo sit in your hair after you’re done washing it to get an extra squeaky clean feel, think twice—shampoos contain parabens, miranol, and other ingredients that can cause contact dermatitis (a red, itchy rash). A bad reaction like this is more likely to happen if the shampoo has time to sit on your skin. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "At least 5 minutes.",
      "content": "At least 5 minutes. Unlike regular shampoos, dandruff shampoo actually needs to sit on your scalp so it has time to work its magic. After you’ve massaged the shampoo into your scalp (avoid your actual strands of hair since dandruff shampoo is too drying), wait at least 5 minutes before rinsing it out. [3] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. Experts recommend washing your hair with regular shampoo and conditioner after you’ve rinsed out the dandruff shampoo. Pro tip: If you have dry hair, coat it with coconut oil 30 minutes before you use your dandruff shampoo. It will help lock in moisture so the dandruff shampoo doesn’t dry your hair out more. [4] X Research source"
    },
    {
      "title": "Focus on cleaning your scalp rather than your hair.",
      "content": "Focus on cleaning your scalp rather than your hair. Shampoo is actually meant to be massaged into your scalp, not scrubbed into your hair. Working shampoo directly into your hair just causes friction and tangling, which definitely isn’t good for your locks. Instead, massage small amounts of shampoo into your scalp underneath your hair, working your way around your entire head. When you’re done, thoroughly rinse out all of the suds. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Vigorous scrubbing, scratching, and kneading might feel nice on your scalp, but don’t do it! Always be gentle when you’re washing your hair so you don’t damage it or cause tangles. You don’t need to use a lot of shampoo to thoroughly clean your hair. Measure out an amount that’s about the size and volume of a single raspberry. That’s really all you need! [6] X Research source"
    },
    {
      "title": "Don't rinse and repeat.",
      "content": "Don't rinse and repeat. You've probably seen shampoo before that says to \"rinse and repeat\" on the bottle. Fortunately for your wallet (and your busy mornings), there's no need to wash your hair twice in the shower. These instructions are usually just a marketing tactic that gets people to use and buy more product. [7] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source One thorough shampooing is all your hair needs."
    },
    {
      "title": "Always follow up with conditioner.",
      "content": "Always follow up with conditioner. [8] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. When you shampoo your hair, you’re stripping away oils that naturally condition it. To keep your hair healthy and manageable, those oils need to be replaced. That’s where conditioner comes in. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Conditioner decreases static, increases shine, and improves the strength of your hair, among other things, so it’s a must in your hair washing routine. [10] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source When you’re applying conditioner, focus on the ends of your hair. They’re usually the driest, and using conditioner near your roots can weigh your hair down."
    },
    {
      "title": "It depends on your hair type.",
      "content": "It depends on your hair type. Everyone’s hair is different. Washing every day might work for some people, while washing once or twice a week may be better for others. In general, the thickness of your hair and the amount of oil your scalp produces are good indicators of how often you should be lathering up. Here are some general guidelines you can follow: [11] X Expert Source Patrick Evan Professional Hair Stylist Expert Interview. 17 January 2019. For fine, thin, or oily hair: shampoo every day or every other day. For medium-thick or dry hair: wash your hair every 2-3 days. For thick or curly hair: wash your hair 1-2 times a week."
    },
    {
      "title": "It also depends on your lifestyle.",
      "content": "It also depends on your lifestyle. Working out a lot and sweating can make your hair dirtier faster. If you use a lot of products in your hair, it might get greasier faster than if you didn’t. Living in a highly polluted area can even cause your hair to get dirtier in between washes. [12] X Research source All of these things may mean you need to wash your hair more frequently. While your hair type definitely matters, experiment with how regularly you wash your hair to find what works best for your lifestyle. You may have heard that shampooing less frequently will cause your scalp to produce less oil, but that’s actually a myth! Oil production is controlled by your hormones, not how regularly you wash your hair. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}