{
  "url": "https://www.wikihow.com/Get-Clay-in-Animal-Crossing",
  "title": "Animal Crossing New Horizons: How to Get Clay",
  "steps": [
    {
      "title": "Hit rocks with a shovel.",
      "content": "Hit rocks with a shovel. When you use a shovel on a rock, you'll get a total of 8 resources per rock. This depends on your speed when hitting the rock. You can get clay, iron nuggets , stone, and even Bells . [1] X Research source To get the most resources per rock, dig two holes: one above and one to the right of your current position. The rock should be on your left. Hit the rock at a diagonal. Your character won't be pushed back, and you'll be able to hit up to 8 times before the resources time out. Make sure not to eat any fruit beforehand. If you eat a fruit and hit a rock with a shovel, you will destroy it. To get fruit out of your character's system, sit on a toilet or dig up any tree."
    },
    {
      "title": "Visit a Nook Miles island.",
      "content": "Visit a Nook Miles island. You can get Nook Miles for completing daily quests in your NookPhone. When you reach 2,000 points, you can purchase a Nook Miles Ticket with the machine in Resident Services. Once you have the ticket, visit the Airport and speak to Orville. You'll select the I want to fly option, and then tell Orville you want to use your Nook Miles Ticket . When you're on the island, look for rocks you can hit with your shovel."
    },
    {
      "title": "Knock down blue balloons.",
      "content": "Knock down blue balloons. Every so often, balloons holding a present will float across your island. Presents with blue balloons drop materials such as clay and iron nuggets. Use your slingshot to strike down any passing blue balloons for a chance at some clay."
    },
    {
      "title": "Use the \"time travel\" trick (optional).",
      "content": "Use the \"time travel\" trick (optional). If you need lots of clay and don't want to wait for a natural daily reset, you can opt to time travel instead. Keep in mind that this isn't an official feature of Animal Crossing. While you won't be banned, this can be considered a \"cheat.\" To time travel, do the following: Save Animal Crossing and close the game fully. Go to the Nintendo Switch System Settings . Select System . Scroll down to Date and Time . Turn off Synchronize Clock via Internet . Set the date and time for the next day or a future day. Launch Animal Crossing again."
    },
    {
      "title": "Clay can be used for DIY recipes.",
      "content": "Clay can be used for DIY recipes. With clay, you can make a variety of furniture, fencing, and even musical instruments. DIY recipes can be obtained from certain villagers, messages in bottles on the beach, floating balloon presents, and more. You can visit a crafting bench to get started. You can even get DIY recipes from other friends. You'll just need a Nintendo Switch Online subscription to visit or host friends from other islands."
    }
  ]
}