{
  "url": "https://www.wikihow.com/See-if-Someone-Has-Multiple-Instagram-Accounts",
  "title": "How to Tell if Someone Has More Than One Instagram Account",
  "steps": [
    {
      "title": "This may sound obvious, but sometimes people list their other Instagram accounts on their main profile.",
      "content": "This may sound obvious, but sometimes people list their other Instagram accounts on their main profile. You'll see this often with influencers, business owners, and even with friends who have accounts for different topics, aesthetics, and interests. You can also check the person's stories to see if they are resharing content from one of their other accounts."
    },
    {
      "title": "If one of your friends has a second account, you might see that account in your recommendations.",
      "content": "If one of your friends has a second account, you might see that account in your recommendations. It happens all the time—someone creates a secondary Instagram account that they want to keep secret , but Instagram recommends the secret account to their friends! To see your recommended friends: [1] X Research source Go to your own Instagram profile. Tap the outline of a person with a plus (+) to the right of the \"Edit Profile\" button. Tap See All to check out your suggestions. Check out the profiles to see if any of them look like they belong to your friend. You'll want to look at their bio, photos, reels , and location for content that looks similar to what you see on their main account."
    },
    {
      "title": "Syncing your iPhone or Android contacts helps you find all Instagram accounts owned by your contacts.",
      "content": "Syncing your iPhone or Android contacts helps you find all Instagram accounts owned by your contacts. If a person you're curious about is in your phone contact list, syncing will trigger Instagram to suggest that person's account(s) to you. [2] X Research source To sync your contacts: Go to your own profile and tap the three horizontal lines at the top. Tap Settings . Tap Account . Tap Contacts Syncing . Tap the switch next to \"Connect Contacts.\" Once connected, Instagram will start recommending any of your contacts who are on Instagram. You can check your recommended friends list or just wait for notifications from Instagram."
    },
    {
      "title": "The user's second account might be following their main account.",
      "content": "The user's second account might be following their main account. Tap the Followers link on their main profile to browse through their followers. Identifying this person's second account will require a little sleuthing, as you'll have to scour each profile for clues like similar photos, bios, and other details. If you got a strange friend request or message from an account you don't recognize and want to know if it belongs to one of your friends, check to see if anyone you know is already following that account. You can send a mutual friend a quick message to ask if they know who the account belongs to."
    },
    {
      "title": "If a person has multiple Instagram accounts, they might use similar names for their accounts.",
      "content": "If a person has multiple Instagram accounts, they might use similar names for their accounts. For example, if you search microsoft on Instagram, you'll find Microsoft's main Instagram account, as well as some additional accounts they own like @microsoftlife and @microsoft.design. [3] X Research source Try searching for the person's username, as well as the person's real name (if you know it)."
    },
    {
      "title": "Search Google for the person's name and \"Instagram\" to see what comes up.",
      "content": "Search Google for the person's name and \"Instagram\" to see what comes up. If searching Instagram doesn't yield results, there's an easy way to use Google to search for words, names, and phrases that appear in public Instagram accounts. Here's how: [4] X Research source Type the person's name (or anything else you think might appear in the person's Instagram bio) into the search box. Type a space, and then type site:instagram.com . Press Enter or the search icon to see all results from public Instagram accounts that contain the name you entered."
    },
    {
      "title": "Searching for one of their photos can help you find out where else that photo appears online.",
      "content": "Searching for one of their photos can help you find out where else that photo appears online. By searching for any of their photos , you might find out that a person is using that photo on another one of their Instagram accounts, on a secret Facebook account, or on any other platform. The easiest way to reverse image search on Instagram is with Google Chrome on your computer: [5] X Research source Sign in to https://instagram.com in Chrome on your computer. Go to one of the person's posts or click their profile photo. Right-click the photo and select Search images with Google Lens . Click and drag a square around the image you want to search. Any matching photos will appear in the right panel. If you can't use a computer, just open the person's profile photo or one of their photo posts in the Instagram app and take a screenshot (they won't know). Then, open the Google app on your phone, tap the camera icon, and select the screenshot to search. [6] X Research source"
    },
    {
      "title": "Sometimes people add links to their Instagram accounts on Facebook, Twitter, and TikTok.",
      "content": "Sometimes people add links to their Instagram accounts on Facebook, Twitter, and TikTok. If you suspect someone has more than one Instagram account and you know how to find them on another social media platform, check to see which Instagram account they list on their other social media profiles."
    },
    {
      "title": "If you have access to the person's phone, you can find out if they log in with multiple accounts.",
      "content": "If you have access to the person's phone, you can find out if they log in with multiple accounts. This will only work if you can access their phone. Just open Instagram, tap their profile photo, and tap their name at the top of the screen. Any other Instagram accounts they're signed in to will appear in the bottom panel. If nothing shows up, you can tap Log in or create a new account at the bottom, and then select Log in to existing account to see if their phone prompts you to log in with a particular username and password."
    }
  ]
}