{
  "url": "https://www.wikihow.com/Lighten-Your-Hair-Without-Bleach",
  "title": "How to Lighten Your Hair Without Using Bleach",
  "steps": [
    {
      "title": "Try lemon juice as a lightener.",
      "content": "Try lemon juice as a lightener. This method only works for hair that has not been color treated. Lemon juice seems to be one of the most popular methods of lightening hair without bleach. It will produce a subtle all-over lightening effect if you apply it to all of your hair or subtle highlights if you only apply it to some select sections. You'll want to use pure lemon juice to do this. The bottled kind is perfectly okay, but fresh-squeezed lemon juice is more potent. [1] X Research source Mix equal parts lemon juice and water. Put the mixture inside a spray bottle and spray the mixture onto your hair. Spray enough so your hair turns damp. Alternatively, apply the mixture to your wet hair at the end of your shower and don't rinse it out. Regardless of which option you choose, the key to this step is to sit out in the sun while the lemon juice is in your hair. The UV rays from the sun is what helps trigger the lightening effect. Note — it is not the heat from the sun that reacts with the lemon juice, so using a blow dryer instead of sitting outside will not work. Only stay out in the sun for about 30-60 minutes. And make sure you're also wearing sunscreen on your exposed skin. Because lemon juice is highly acidic, you should use a lot of conditioner to re-hydrate your hair after you've used this mixture. Keep in mind that this method will produce a very subtle lightening effect. Try repeating it once per week to lighten your hair gradually over time."
    },
    {
      "title": "Use chamomile tea to lighten your hair.",
      "content": "Use chamomile tea to lighten your hair. Chamomile, like lemon juice, is a very popular method of lightening hair. This works best if your hair is already somewhat light. It will not produce an effect on darker hair and is not recommended for hair that has been dyed. After the treatment, you will notice a very subtle golden tint and brightening effect on your naturally blonde hair. Start by brewing some strong chamomile tea. You'll need about 5 tea bags and you'll want to steep them in three cups of hot water for about 30 minutes, or until the tea is cool enough to apply it to your head. [2] X Research source Once the tea has steeped and cooled, then put the tea (minus 5 tablespoons) inside a spray bottle. Take the remaining 5 tablespoons and add them to a bottle of your regular conditioner. The next time you shower and wash your hair, use the pure chamomile tea as your shampoo. Once the 'shampoo' is rinsed off, apply your conditioner/tea mixture as your conditioner. Let the conditioner sit on your hair for at least a few minutes before rinsing it off. [3] X Research source If you have the time, allow your hair to air dry in the sun after you've shampooed and conditioned your hair with the chamomile tea. An alternative is to simply spray the chamomile tea onto your dry hair and then go out into the sun. [4] X Research source"
    },
    {
      "title": "Consider honey for lightening your hair.",
      "content": "Consider honey for lightening your hair. Honey is a great substance. Besides being able to lighten your hair, honey can also be used for a variety of medical purposes as it has anti-bacterial properties. Honey also contains very small amounts of hydrogen peroxide, which is what is able to lighten your hair. If you would prefer not to use hydrogen peroxide, you may want to skip this option. [5] X Research source Mix 1-2 tablespoons of raw honey (commercial, pasteurized honey will not work) into a cup of water. Apply the honey/water mixture to your hair so it's spread evenly. Once the mixture is applied to your hair, you want to let it sit for about an hour. Regular Conditioner — An alternative to the honey/water mixture is to add the 1-2 tablespoons of honey to your conditioner. Then use your conditioner as you would normally. [6] X Research source Honey/Conditioner Mixture — Mix ⅓ cup of raw honey with ¼ cup of conditioner. Wet your hair and then apply the honey/conditioner mixture to your hair. Make sure the mixture is applied evenly — you may want to use a comb to brush it through your hair completely. Put on a shower cap (or plastic wrap) and go to bed. Wash the mixture off in the morning using your normal routine. [7] X Research source Honey + Cinnamon + Olive Oil — Adding cinnamon to the honey will produce a warm blonde with reddish undertones and olive oil is moisturizing. Mix 1 cup of raw honey to 2 cups of distilled water. Add 1 tablespoon of cinnamon and 1 tablespoon of olive oil. Mix the ingredients together. Wet your hair and then apply the mixture to your hair evenly. Cover your hair with a shower cap and go to bed. Wash the mixture off in the morning using your normal routine. Instead of using distilled water for the Honey + Cinnamon + Olive Oil mixture, use 2 cups of white vinegar. The rest of the process is exactly the same. [8] X Research source"
    },
    {
      "title": "Make a lightening solution with rhubarb.",
      "content": "Make a lightening solution with rhubarb. You can obtain rhubarb at a grocery store or a farmer's market, or you can try growing some of your own in your garden. (Rhubarb can spread quite easily in a garden and can often be found growing in wild places on its own as well.) [9] X Research source Chop up enough rhubarb to make ¼ cup. Add the chopped rhubarb to a sauce pan with 2 cups of water. Put the sauce pan on the stove and bring the mixture to a boil. After the mixture has boiled, allow it cool down, then strain the liquid out of the sauce pan into a bottle. Apply the liquid to your hair leave it on for 10 minutes. Then rinse the liquid out with water."
    },
    {
      "title": "Apply olive oil to lighten your hair.",
      "content": "Apply olive oil to lighten your hair. In addition to using olive oil in various other mixtures, you can also use olive oil on its own. In addition to being able to lighten your hair, olive oil is also a great moisturizer. [10] X Research source Apply at least a couple tablespoons of olive oil to your hair. Allow the olive oil to soak into your hair for at least 30 minutes. Shampoo your hair to remove the olive oil and then style your hair as you normally would."
    },
    {
      "title": "Employ baking soda to make your hair lighter.",
      "content": "Employ baking soda to make your hair lighter. Baking soda can be used as both a shampoo and as a method to lighten your hair. It will produce a subtle effect, so you'll want to use this method daily or weekly until your hair is lightened to the point you want it. Although, you can continue to use baking soda as your regular shampoo, just be aware that your hair may continue to lighten a little more. [11] X Research source [12] X Research source Mix baking soda, about ¼ to ⅓ cup, with small amounts of water until it turns into a paste. Apply the paste all over your hair in place of your regular shampoo. Rinse out the baking soda paste and apply your normal conditioner."
    },
    {
      "title": "Create a lightening solution with apple cider vinegar.",
      "content": "Create a lightening solution with apple cider vinegar. Like baking soda, apple cider vinegar can also be used to both clean and lighten your hair. You can use apple cider vinegar regularly as a rinse after you've shampooed your hair. Apple cider vinegar is great for washing out all the chemical build-up in your hair from styling products. [13] X Research source Mix ¼ cup of apple cider vinegar to 1 cup of water. Shampoo and condition your hair as your normally would, then apply the apple cider vinegar mixture to your hair. Leave the mixture on your hair for about 20 minutes, then rinse with water."
    },
    {
      "title": "Administer cinnamon to lighten your hair.",
      "content": "Administer cinnamon to lighten your hair. Cinnamon can be used in other hair lightening mixtures, or it can be used on its own. The nice thing about cinnamon is that it also smells great! [14] X Research source Mix 3-4 tablespoons of ground cinnamon into approximately the same amount of your regular conditioner. Apply the mixture to your hair evenly. Use a comb to make sure it's spread throughout all your hair. [15] X Research source Put a shower cap or plastic wrap on your hair and leave the whole mixture in while you sleep. [16] X Research source Shampoo and condition your hair in the morning as you would normally."
    },
    {
      "title": "Utilize salt for lightening your hair.",
      "content": "Utilize salt for lightening your hair. If you have ever spent an entire summer swimming in the ocean, you'll know that salt water is a great way to lighten your hair. Even if you don't live near the ocean, you can still use salt water to lighten your hair at home. [17] X Research source Mix 1 part salt to 5 parts water. Rinse the mixture through your hair and leave it to sit for at least 15 minutes. Rinse your hair out with fresh water. As an alternative, mix ½ cup of sea salt to a small amount of water so it forms a paste. Apply the paste to your damp hair and sit in the sun for a while. Rinse your hair out with water after you've been out in the sun. [18] X Research source"
    },
    {
      "title": "Use the sun to naturally lighten your hair.",
      "content": "Use the sun to naturally lighten your hair. While the sun can burn and tan (i.e. darken) your skin, it's also lighten your hair. One of the easiest ways to lighten your hair is to simply spend a lot of time outside in the sun. Always remember to wear sunscreen and protective clothing on your exposed skin so you don't get sun damage. [19] X Research source The great thing about the sun is that it can be used on its own, or in combination with any of the other hair lightening treatments. To have the sun lighten your hair faster, apply one of the mixtures mentioned in this article to your hair first, before going outside."
    },
    {
      "title": "Try vitamin C as a hair lightener.",
      "content": "Try vitamin C as a hair lightener. To lighten your hair with vitamin C, you'll need to obtain vitamin C tablets or pills. Crush 8-9 of your vitamin C tablets into a powder and then add the powder to your regular shampoo. Use your shampoo normally and the added vitamin C will slowly lighten your hair. [20] X Expert Source Gina Almona Professional Hair Stylist Expert Interview. 12 February 2021. [21] X Research source As an alternative you can make a hair mask with vitamin C. Take 15-20 vitamin C tablets and crush them into a powder. Then add the powder to a small amount of anti-dandruff shampoo to form a paste. Apply the paste all over your hair. Put on a shower cap or plastic wrap and leave the mixture on for 1-2 hours, then rinse off with water. [22] X Research source"
    },
    {
      "title": "Contemplate a hair lightening product.",
      "content": "Contemplate a hair lightening product. If you have tried other lightening options and you haven't found them to work, or they do not last long enough to satisfy you, you may want to consider a more professional option. Also, if you have dark hair and want a more dramatic lightening effect, or if you have previously colored your hair at home or at a salon, then you will need to see a professional hair stylist. Professional hair color products are not made equal. There are several hair color products that are made without bleach or hydrogen peroxide, and even without other harmful chemicals. Because each person's hair is different, your best option is to make an appointment with your hair stylist or colorist and ask them for the best non-bleach option. [23] X Research source [24] X Research source"
    }
  ]
}