{
  "url": "https://www.wikihow.com/Clean-a-Pan-with-Baking-Soda",
  "title": "How to Clean a Pan with Baking Soda",
  "steps": [
    {
      "title": "Add water to cover the bottom of the pan.",
      "content": "Add water to cover the bottom of the pan. Don’t fill the pan entirely. You should only use enough to cover the bottom surface in 1 inch (2.5 cm) or less of water. Be careful not to use so much water that it boils over. [1] X Research source Depending on the size of your pan, you may need as much 1 cup (240 mL) of water or more. For a griddle or other shallow pan, you may only need a splash or two."
    },
    {
      "title": "Bring the water to a boil, then place the pan in the sink.",
      "content": "Bring the water to a boil, then place the pan in the sink. Heat the pan over the stove until the water begins to lightly boil. Then remove the pan from the stove and place it into the sink, without dumping out the boiling water. [2] X Research source Use oven mitts if necessary to prevent burning yourself on the hot pan."
    },
    {
      "title": "Add 1 cup (240 mL) of white vinegar.",
      "content": "Add 1 cup (240 mL) of white vinegar. Pour 1 cup (240 mL) of white vinegar into the hot water in the pan. Vinegar will help neutralize odors in the pan and loosen baked-on food residue. [3] X Research source If you don't have white vinegar, apple cider vinegar will also work here. [4] X Research source"
    },
    {
      "title": "Add 2 tablespoons (30 mL) of baking soda.",
      "content": "Add 2 tablespoons (30 mL) of baking soda. Keep the pan in the sink in order to avoid messy overflows. You should expect to see the baking soda and vinegar begin to bubble and fizz as soon as they come into contact with each other. [5] X Research source"
    },
    {
      "title": "Let it sit for a few minutes.",
      "content": "Let it sit for a few minutes. Let the mixture fizz for a few minutes in the sink while the pan cools off. The fizzing of the vinegar and baking soda will help lift caked-on food residue. [6] X Research source"
    },
    {
      "title": "Scrub the pan.",
      "content": "Scrub the pan. Using the scouring side of a sponge, scrub the inside of the pan vigorously, focusing on the stained or scorched areas. You’ll be surprised at how much grime you're able to scrub off! [7] X Research source Don't be afraid to touch the fizzing baking soda and vinegar reaction. It's harmless! Just avoid getting it in your eyes."
    },
    {
      "title": "Empty the pan and wash normally.",
      "content": "Empty the pan and wash normally. Dump out the mixture in the sink, rinse with hot water, and wash with dish soap and a clean sponge. Then dry with a clean dish towel. [8] X Research source"
    },
    {
      "title": "Mix equal parts baking soda and hot water.",
      "content": "Mix equal parts baking soda and hot water. If the baking soda and vinegar didn’t completely clean out your pan, try using an abrasive paste made from mixing 1 part baking soda and 1 part water directly in the pan. [9] X Research source If your paste is too runny, add in a little more baking soda. If it’s too dry, add a splash more water. Repeat until you reach the desired consistency. Make sure you've rinsed out any remaining vinegar from the previous step before beginning this method."
    },
    {
      "title": "Scrub the pan with the mixture.",
      "content": "Scrub the pan with the mixture. The baking soda paste here will act as a light abrasive, scraping off burned food residue. Using a scouring sponge, scrub the problem areas until the stains lift. [10] X Research source It may be necessary to add more paste after you start scrubbing."
    },
    {
      "title": "Empty the pan and wash normally.",
      "content": "Empty the pan and wash normally. Dump out the mixture, rinse with hot water, and wash with dish soap and a clean sponge. Then dry with a clean dish towel. [11] X Research source"
    }
  ]
}