{
  "url": "https://www.wikihow.com/Boy-Mom",
  "title": "What's a \"Boy Mom?\" Meaning, Origin & Why It's So Cringey",
  "steps": [
    {
      "title": "A “boy mom” is a specific type of parent who’s hyper fixated on her son.",
      "content": "A “boy mom” is a specific type of parent who’s hyper fixated on her son. While it’s perfectly fine to express pride in having a son, a “boy mom” takes it to another level. Having a son is her entire identity, and she may put him on a pedestal or give him preferential treatment over girls. Some “boy moms” have a particularly unhealthy attachment to their child, relying on their sons for happiness and emotional intimacy. [1] X Research source A “boy mom” used to refer to a mother who had a son, but it’s now a negative archetype for a mom who’s obsessed with her male child’s gender. Many online users believe a “boy mom” is the mom version of a “ pick-me girl ,” especially if she thinks having a son makes her better than other moms and brags about it all the time."
    },
    {
      "title": "“Boy Mom” culture reinforces harmful gender norms and stereotypes.",
      "content": "“Boy Mom” culture reinforces harmful gender norms and stereotypes. Many TikTok users have criticized boy moms because they promote the idea that “boys will be boys,” or that boys are more rough or energetic than girls. This belief is dangerous because it implies that certain behaviors are masculine and feminine, and it doesn’t hold boys accountable for their actions. If a boy becomes violent while playing, for example, a “boy mom” may excuse it and link it to just “being a boy.” [2] X Research source Similarly, many self-proclaimed “boy moms” post videos of their son in the kitchen so they “won’t be impressed by a bad meal made by a woman.” This reinforces the idea that cooking and cleaning are “women’s work.”"
    },
    {
      "title": "TikTokers think “boy moms” use their sons to heal their emotional wounds.",
      "content": "TikTokers think “boy moms” use their sons to heal their emotional wounds. Many self-proclaimed “boy moms” treat their sons like a significant other, putting them in an inappropriate role. This dynamic is known as emotional incest, which can hinder their child’s development. [3] X Research source Boy moms often guilt trip their sons if they decide to leave home, get married, or make decisions on their own, and this can make it difficult for children to set boundaries as adults. [4] X Research source In addition, a “boy mom” might see her future daughter-in-law as a threat. She might exclude her from conversation or act possessive around her son, harming his romantic relationship and making him feel guilty for prioritizing his partner."
    },
    {
      "title": "A “boy mom” fosters a toxic family dynamic for her children.",
      "content": "A “boy mom” fosters a toxic family dynamic for her children. When a “boy mom” shows greater affection toward her son, it can lower the self-esteem of her other kids. Parental favoritism is linked to anxiety, depression, and other behavioral problems, which may continue in adulthood. [5] X Research source A daughter might feel less worthy than her brother, fueling resentment or jealousy toward him. This behavior also puts pressure on her son to be the “ golden child ,” negatively affecting his mental health. He might believe he always has to please his mother to be worthy of love. [6] X Research source"
    },
    {
      "title": "A “boy mom” coddles her son and gives him special treatment.",
      "content": "A “boy mom” coddles her son and gives him special treatment. On TikTok, there’s tons of “boy mom” content that has similar themes and ideals. A “boy mom” is usually overprotective and possessive of her son, believing he can do no wrong. Some self-proclaimed “boy moms” have even talked about their son in a romantic or inappropriate way, saying things like, “I’m going to love you so much that no woman is ever going to be good enough for you.” Other signs of “boy mom” behavior include: [7] X Research source Favoring her sons over her daughters Referring to her son as her “whole world” Constantly posting the “perks” of having a boy Sharing she loves her son more than her daughter Being excited to be her son’s “first kiss” or “first love” Coddling her son and believing he can “do no wrong” Feeling sad that her son is leaving home or getting married Acting like she’s in competition with her future daughter-in-law"
    },
    {
      "title": "Originally, the term “boy mom” referred to moms with male children.",
      "content": "Originally, the term “boy mom” referred to moms with male children. While the exact origin of “boy mom” is unknown, it started off as a positive term. Moms used it to describe their unique experience of raising boys, or to express enjoyment about having a son. People would add “boy mom” in their posts, captions, and hashtags to connect with other moms online and find a community of parents that they could resonate with."
    },
    {
      "title": "Social media use turned “boy mom” into a negative term.",
      "content": "Social media use turned “boy mom” into a negative term. In recent years, self-identifying “boy moms” posted controversial videos on TikTok. These videos featured content like moms experiencing a “break up” after their son moved away, or teaching their son how to cook so he “wouldn’t need a wife.”"
    }
  ]
}