{
  "url": "https://www.wikihow.com/Circular-Breathe",
  "title": "How to Circular Breathe (for Beginners)",
  "steps": [
    {
      "title": "Fill your cheeks with air, and breathe in and out through your nose.",
      "content": "Fill your cheeks with air, and breathe in and out through your nose. Get a feel for what it’s like to breathe with your cheeks puffed out. Then, puff out your cheeks again. Keeping your jaw closed, create a small opening in your lips. Use your cheek muscles to slowly push the air out as you simultaneously breathe through your nose. [1] X Research source Practice maintaining this stream of air for at least 5 seconds."
    },
    {
      "title": "Start exhaling with your lungs when the air in your mouth runs out.",
      "content": "Start exhaling with your lungs when the air in your mouth runs out. Since you have been breathing in through your nose the whole time, your lungs should fill up by the time the air in your mouth runs out. You can change where the air is coming from by closing your soft palate. [2] X Research source"
    },
    {
      "title": "Fill your cheeks with air again.",
      "content": "Fill your cheeks with air again. Do this right before your lungs run out so you have time to fill your lungs again while you are using the air stored in your mouth. By filling your cheeks with air, you’re giving yourself another air supply to use in conjunction with your lungs. [3] X Research source"
    },
    {
      "title": "Repeat this sequence continuously.",
      "content": "Repeat this sequence continuously. Once you are able to turn it into a seamless process, you will never have to pause to take a breath while playing your instrument again. [4] X Research source If you notice a bump in the sound as you move from your cheeks to your lungs, that’s okay. With practice, that transition will smooth out. To help smooth out that passage, visualize pushing your tongue forward at the same time as if saying “gah.” Try not to think of the technique in terms of switching from one source of air to another, which can lead to a less-than-seamless transition. Instead, think about it as one continuous process."
    },
    {
      "title": "Practice for 15 minutes a day with different tricks and techniques.",
      "content": "Practice for 15 minutes a day with different tricks and techniques. Some experts recommend spitting a thin stream of water to get a sense of the technique and how much force you’ll need to use to produce sound on your instrument. Fill your mouth with water and practice spitting the water in a thin, continuous stream as you breathe in and out through your nose. [5] X Research source Try pursing your lips around a straw to mimic the mouth position used to play your instrument. Put the other end of the straw in a glass of water and follow the steps for circular breaking until you produce a seamless stream of bubbles. [6] X Research source Alternatively, you can use the detached mouthpiece of your instrument to practice. Vocalizing a strong “HA” sound as you practice circular breathing may also help you produce long, sustained notes."
    },
    {
      "title": "Try circle breathing on your instrument as soon as possible.",
      "content": "Try circle breathing on your instrument as soon as possible. You don't have to have mastered the technique in practice settings to apply it to your instrument. The only way to get better at it is to do it, so add the rest of your instrument as soon as you can make a sound using just your mouthpiece. [7] X Research source Work your way up. Start by holding single notes, then move on to easy, repetitive exercises. Some registers will make this easier than others. You may find it easier to start with exercises that hit the higher part of your instrument’s range. [8] X Research source"
    },
    {
      "title": "Maintain good singing posture.",
      "content": "Maintain good singing posture. Stand with your feet shoulder-width apart. Make sure your weight is evenly balanced between your feet. Lift your chin so it’s parallel to the floor. Hold your shoulders back and down with your chest held high in a natural position. [9] X Research source Relax your hands and keep them still at your side. Flex your knees so that they’re loose and not locked. If you can’t find a balanced stance, try jumping and landing on your feet. Your natural stance after jumping is typically the correct body posture. Practicing good posture when singing makes it easier for quality sound to be produced without straining the vocal cords."
    },
    {
      "title": "Exhale completely then inhale through your mouth.",
      "content": "Exhale completely then inhale through your mouth. Gently exhale until you feel completely empty of air. Hiss like a snake to exhale rather than forcing or pushing the air out. Once the hissing stops and you’re completely out of air, drop your jaw. Allow air to flow in naturally. Notice how your belly expands and your breath is completely silent. [10] X Research source Take note of how your body feels breathing with this technique rather than taking an intentional deep breath or shallow gasp. Practice other breathing exercises that help train your lungs, such as alternate nostril breathing. To practice alternate nostril breathing, alternate blocking one nostril and inhaling through the other, then holding your breath for a few seconds. Unblock one nostril, exhale, pause, then inhale again through the same nostril. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Hold your breath again with both nostrils held closed, then repeat your exhale on the other nostril."
    },
    {
      "title": "Try a simple circular breathing exercise using your diaphragm.",
      "content": "Try a simple circular breathing exercise using your diaphragm. Place one hand on your upper chest and one just below your rib cage. Breathe deeply and slowly through your nostrils and push the air toward your lower belly. Purse your lips and exhale. Tighten your abdominal muscles and let them cave inward. [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source When you inhale, the hand on your chest should remain still while the one on your belly rises. On your exhale, the hand on your belly should move down to its start position. Repeat the cycle of breathing slowly and deeply from your diaphragm. Match the length of your inhale to the length of your exhale without any pause in between."
    },
    {
      "title": "Practice cyclic sighing to relieve anxiety and stress.",
      "content": "Practice cyclic sighing to relieve anxiety and stress. Inhale slowly through your nose. Then, take another, deeper breath to fully expand and fill up your lungs. Slowly exhale all the air through your mouth as if you’re sighing. Vocalize as you would when sighing, if desired. Repeat this process for five minutes a day for as long as you’d like. [13] X Research source Cyclic sighing has been shown to lower anxiety, improve mood, increase energy, and regulate the nervous system . [14] X Research source"
    },
    {
      "title": "Wind instrumentalists use circular breathing to hold an uninterrupted note.",
      "content": "Wind instrumentalists use circular breathing to hold an uninterrupted note. Circle breathing allows musicians to maintain a continuous sound without pausing to take a breath. This technique is common in the folk music of many cultures. [15] X Research source Some of the most traditional instruments associated with circle breathing include the bawu of southwestern China, the didjeridu (or didgeridoo ) of Aboriginal Australia, and the nagaswaram of South India. Circular breathing has also become popular among American jazz musicians and is commonly used for saxophone playing."
    },
    {
      "title": "Singers use circular breathing for breath support and in cultural traditions.",
      "content": "Singers use circular breathing for breath support and in cultural traditions. Modern singers often have to hold long notes and can easily lose their breath. Circular breathing benefits singers by helping them improve their breath support and hold notes for a long time—a crucial part of maintaining a clear and professional vocal tone. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source In vocal coaching, circular breathing is often called “passive breathing” or “passive inhalation.” Continuous breathing in singing is not a new concept—it’s been used by many ancient and modern-day cultures in important traditions and practices. [17] X Research source Tuvan throat singing, for example, is used by singers in the Tuva Republic to project their voices in their chest while simultaneously controlling their mouth, lips, and throat. The technique, also known as throat singing, has also been observed in the heritage of the Xhosa people of South Africa, the Chukchi people of northern Russia, the Ainu people of northern Japan, and the Inuit people of North America."
    },
    {
      "title": "Cyclic or circular breathing is used in yoga and deep meditation.",
      "content": "Cyclic or circular breathing is used in yoga and deep meditation. Buddhist monks have used the advanced breathing technique for centuries as part of Anapanasati Sutta, a.k.a. their breath-mindfulness discourse. [18] X Research source In modern times, advanced yoga instructors and meditation practitioners use cyclic breathing to release negative energy and tension. [19] X Research source Circular breathing is also believed to improve physical health by bringing a fresh supply of oxygen to the blood, which may make it more difficult for viruses to enter the body. [20] X Research source Meditative breathing , in general, has been shown to have positive impacts on overall well-being, including depression, anxiety, cognitive function, and physical performance. [21] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    }
  ]
}