{
  "url": "https://www.wikihow.com/Check-Your-Cell-Phone%27s-Airtime-Balance",
  "title": "How to Check Your Cell Phone's Call and Text Balance",
  "steps": [
    {
      "title": "Dial *646#.",
      "content": "Dial *646#. On your AT&T mobile phone, open your phone’s keypad (either on-screen or physically), and dial the *646# (*MIN#) code on the call screen. If you want to check your minutes in Spanish, dial *876# (*USO#) on your phone instead."
    },
    {
      "title": "Press your phone’s “Send” button.",
      "content": "Press your phone’s “Send” button. Once you do, a confirmation message will appear on the screen saying that the request is currently being processed."
    },
    {
      "title": "Wait for a response from the network.",
      "content": "Wait for a response from the network. After a few seconds, you will receive a text message containing detailed information about your account’s remaining minutes."
    },
    {
      "title": "Dial #646.",
      "content": "Dial #646. On your Verizon mobile phone, open your phone’s keypad (either on-screen or physically), and dial the #646 (#MIN) code on the call screen."
    },
    {
      "title": "Press your phone’s “Send” button.",
      "content": "Press your phone’s “Send” button. Afterwards, wait for the voice recording on the other end of the line to state the details of your current usage and your remaining number of minutes."
    },
    {
      "title": "Wait for a confirmation message.",
      "content": "Wait for a confirmation message. After a few seconds, you will receive a text message containing the same information you heard from the voice recording to serve as your reference."
    },
    {
      "title": "Dial *4.",
      "content": "Dial *4. On your Sprint mobile phone, open your phone’s keypad (either on-screen or physically), and dial *4 on the call screen."
    },
    {
      "title": "Press your phone’s “Send” button.",
      "content": "Press your phone’s “Send” button. A voice recording will prompt you what to press next."
    },
    {
      "title": "Press 3 for “Account info,” then 2.",
      "content": "Press 3 for “Account info,” then 2. You will then be informed of how many minutes you have left. Since you won’t get any text messages, it would be best to write down the information given to you by the voice recording so you’ll have a copy."
    },
    {
      "title": "Dial #646#.",
      "content": "Dial #646#. On your T-Mobile phone, open your phone’s keypad (either on-screen or physically), and dial the #646# (#MIN#) code on the call screen."
    },
    {
      "title": "Press your phone’s “Send” button.",
      "content": "Press your phone’s “Send” button. This will prompt the system to process your request."
    },
    {
      "title": "Wait for a response from the network.",
      "content": "Wait for a response from the network. Barely taking a minute, you will get a message containing the detailed information about the current and remaining minutes on your account."
    },
    {
      "title": "Dial #225.",
      "content": "Dial #225. On your US Cellular mobile phone, open your phone’s keypad (either on-screen or physically), and dial #225 (#BAL) code on the call screen."
    },
    {
      "title": "Press your phone’s “Send” button.",
      "content": "Press your phone’s “Send” button. This will prompt the system to process your request."
    },
    {
      "title": "Wait for a response from the network.",
      "content": "Wait for a response from the network. You’ll get a message containing detailed information about your usage, such as rates, text messages sent, and your available minutes."
    }
  ]
}