{
  "url": "https://www.wikihow.com/Install-a-Sound-Card",
  "title": "Easy Steps to Install a Sound Card",
  "steps": [
    {
      "title": "Ensure that you need a sound card.",
      "content": "Ensure that you need a sound card. Nearly all modern computers have a sound card built into the motherboard. You can double-check that you have a sound card built-in by looking for speaker jacks on the back of the computer. Sound cards are really only necessary for audiophiles and recording studio computers, or for very old computers that don't have built-in sound."
    },
    {
      "title": "Power down your computer and remove all the cables.",
      "content": "Power down your computer and remove all the cables. This will allow you to move your computer to a place that allows you to easily access it. Place the computer on its side on a table, with the ports on the back closest to the table. The ports are connected to the motherboard, so having them closest to the table will ensure that you can get to the motherboard when the case is open. Avoid laying the computer on carpet."
    },
    {
      "title": "Remove the side panel on your computer.",
      "content": "Remove the side panel on your computer. Most newer cases have thumbscrews, but you may need a Phillips-head screwdriver. The screws run down the back of the computer. Remove the panel on the opposite side of the motherboard and set it aside."
    },
    {
      "title": "Ground yourself.",
      "content": "Ground yourself. You should always ground yourself when working inside your computer. You can use an electrostatic wrist strap or touch a metal water tap to discharge any electrostatic buildup. If you don't ground yourself, you run the risk of damaging your components with electrostatic discharge."
    },
    {
      "title": "Clean out any dust.",
      "content": "Clean out any dust. Since your computer is open, you should take this opportunity to clean out the dust that has built up inside the case. Too much dust can lead to overheating, which can lead to your components failing. Use compressed air to remove as much dust and debris as possible. Make sure to get in all of the nooks and crannies."
    },
    {
      "title": "Locate the PCI slots.",
      "content": "Locate the PCI slots. These are the slots that you can install expansion cards into. PCI slots are typically white, and you may have 1-5 of them. The slots line up with the removable panels on the back of the case. If you're having difficulty identifying the PCI slots, check your motherboard's documentation. You can look this up online if you have the motherboard's model number ."
    },
    {
      "title": "Remove the existing sound card (if necessary).",
      "content": "Remove the existing sound card (if necessary). If you are replacing an old card, remove the old card first. Having two cards installed will lead to hardware conflicts. Remove the screw securing the card to your case and pull the card directly out of the slot. You may need to disconnect the sound card from your CD/DVD drive. Make sure that any speakers connected to the old sound card are disconnected before you remove the old card."
    },
    {
      "title": "Insert the new card.",
      "content": "Insert the new card. Remove the corresponding dust guard panel from the back if you are installing the new card. Make sure that the notches in the slot line up with the card, and press the card straight down firmly. Don't force the card into the slot, and ensure that the ports on the back line up with the with the bay opening."
    },
    {
      "title": "Secure the card with a screw.",
      "content": "Secure the card with a screw. Screw a single screw into the metal tab that secures the card to the computer chassis. Don't overtighten, but ensure the card is snugly fastened to the case."
    },
    {
      "title": "Connect the sound card to the CD/DVD drive (optional).",
      "content": "Connect the sound card to the CD/DVD drive (optional). Some older sound cards may connect to the CD/DVD drive with a small cable. This is optional on virtually all newer computers, as this connection is now handled by the hardware."
    },
    {
      "title": "Close the case.",
      "content": "Close the case. Return the side panel to the computer and secure it. Place the computer back at your desk and plug the cables back in."
    },
    {
      "title": "Place your speakers.",
      "content": "Place your speakers. Set up your speakers around your computer. Ensure that the left and right channels are on the correct sides. Avoid placing the subwoofer in a corner or up against the wall."
    },
    {
      "title": "Connect the speakers to the sound card.",
      "content": "Connect the speakers to the sound card. Examine the ports on the sound card. These ports are color-coded and should match the colors of your speaker cables. Green – Front speakers or headphones Black – Rear speakers Silver – Side speakers Orange – Center/Subwoofer Pink – Microphone"
    },
    {
      "title": "Turn on the computer.",
      "content": "Turn on the computer. Wait for Windows to load. Your sound card should be detected by Windows automatically, and the drivers will be automatically installed."
    },
    {
      "title": "Install the sound card drivers.",
      "content": "Install the sound card drivers. If Windows cannot install the correct drivers of your sound card, you will need to install the drivers manually. Use the disc that came with the drive, or download the drivers from the manufacturers. [1] X Research source"
    },
    {
      "title": "Test the speakers.",
      "content": "Test the speakers. Make sure that your speakers are turned on and the volume is up. Click the Volume icon in your System Tray. When you use the slider to set the volume, a test sound will play out of your speakers. If there is no Volume icon, your sound card may not be properly installed. Make sure that the drivers were installed correctly."
    }
  ]
}