{
  "url": "https://www.wikihow.com/Remove-a-Default-or-Core-System-Apps-from-an-Android-Phone",
  "title": "How to Remove Default or Core System Apps from an Android",
  "steps": [
    {
      "title": "Open your Android's Settings.",
      "content": "Open your Android's Settings. If your device is not rooted you'll only be able to disable apps that came preinstalled, not completely remove them. Disabling an app will prevent it from running and remove it from your Apps list. To do this, tap the Settings app in your Apps list. It looks like a gray gear. If your device is rooted, you can use special tools to remove system apps . If you don't know what it means to gain root access on your Android phone, your device is probably not rooted. You can try rooting your device by unlocking your bootloader ."
    },
    {
      "title": "Tap Applications, Apps, or Application manager.",
      "content": "Tap Applications , Apps , or Application manager . You'll likely need to scroll down to find this in the Device section, though some Android devices will have a tab at the top of the Settings menu you can use to jump to it. On Samsung devices, you'll need to tap Applications and then Application manager. The wording on your settings and the layout of the menus will vary from Android to Android."
    },
    {
      "title": "Tap the More or ⋮ button.",
      "content": "Tap the More or ⋮ button. You'll see this in the upper-right corner of the apps list."
    },
    {
      "title": "Tap Show system apps.",
      "content": "Tap Show system apps . This will show system apps as well as apps you've downloaded in the app list. You cannot disable all system apps."
    },
    {
      "title": "Scroll through the list to find an app you want to disable.",
      "content": "Scroll through the list to find an app you want to disable."
    },
    {
      "title": "Tap the app to view its details.",
      "content": "Tap the app to view its details."
    },
    {
      "title": "Tap the Uninstall updates button (if available).",
      "content": "Tap the Uninstall updates button (if available). If the app has been updated, it may need to have these updates removed before you can disable it."
    },
    {
      "title": "Tap the Force stop button.",
      "content": "Tap the Force stop button. If the app is running, it will need to be stopped before it can be disabled."
    },
    {
      "title": "Tap the Disable button.",
      "content": "Tap the Disable button. Note that while you can disable many apps that come preinstalled on your device, you won't be able to disable essential system processes or some preinstalled apps."
    },
    {
      "title": "Tap Yes to confirm.",
      "content": "Tap Yes to confirm. The app will be disabled, which will stop it from running and remove it from your apps list."
    },
    {
      "title": "Gain root access on your Android device.",
      "content": "Gain root access on your Android device. The process for this is different for every single Android model, so there are far too many different ways to discuss here. Also, it is not possible to gain root access at all on many Android models. Typically when gaining root access, you'll need to unlock the bootloader ."
    },
    {
      "title": "Open the Play Store.",
      "content": "Open the Play Store. You'll be downloading a special app from the Play Store that is able to disable any app on a rooted device."
    },
    {
      "title": "Search for \"Titanium Backup.\"",
      "content": "Search for \"Titanium Backup.\" This is one of the most popular utilities for users of rooted Android devices. It is primarily designed for creating backups, but can also remove apps you can't normally get rid of."
    },
    {
      "title": "Tap Install.",
      "content": "Tap Install . You don't need the Pro version to delete apps. Tap Install next to the free version of the app."
    },
    {
      "title": "Tap Open.",
      "content": "Tap Open . This button appears after the app has installed."
    },
    {
      "title": "Tap Grant when prompted for Superuser access.",
      "content": "Tap Grant when prompted for Superuser access. This will give Titanium Backup root access, which is required in order to remove the system apps. If Titanium Backup cannot get root access, your device is not properly rooted. You'll need to go back through your device's rooting instructions and make sure everything was followed correctly."
    },
    {
      "title": "Tap the Backup/Restore button.",
      "content": "Tap the Backup/Restore button. You'll see this at the top of the screen after Titanium Backup initializes."
    },
    {
      "title": "Scroll through the list to find an app you want to remove.",
      "content": "Scroll through the list to find an app you want to remove. You'll see every app and service that's installed on your device. You can tap \"Click to edit filters\" to search for specific keywords, like \"messages.\""
    },
    {
      "title": "Tap an app.",
      "content": "Tap an app. This will open more details."
    },
    {
      "title": "Swipe from left to right.",
      "content": "Swipe from left to right. This will switch to the \"Backup properties\" tab."
    },
    {
      "title": "Tap the Backup! button.",
      "content": "Tap the Backup! button. This will create a backup of the app, which you'll want in case removing the app causes problems with your device. If your system becomes unstable after removing the app, you can restore the backup."
    },
    {
      "title": "Tap the Un-install! button.",
      "content": "Tap the Un-install! button."
    },
    {
      "title": "Tap Yes after reading the warning.",
      "content": "Tap Yes after reading the warning. Take the warning to heart. Removing a vital system process may require a complete reflashing of your Android's ROM (operating system)."
    },
    {
      "title": "Repeat for any other apps you want to remove.",
      "content": "Repeat for any other apps you want to remove. Go back through the list and remove any additional apps you want to remove. You may only want to remove one or two at a time and then test your system for a while, that way if anything goes wrong you have an idea about which app removal was the problem."
    }
  ]
}