{
  "url": "https://www.wikihow.com/Have-Healthy-Lips",
  "title": "How to Have Healthy Lips",
  "steps": [
    {
      "title": "Saliva will actually dry your lips out.",
      "content": "Saliva will actually dry your lips out. When you lick your lips it is usually in an attempt to moisturize them. In fact, not only does it dry out the surface, it also creates a lot of damaging friction on the lips. It can be hard to stop licking your lips when you do it subconsciously. Try to be very conscious of what you are doing with your tongue and do something else with your mouth, such as sucking on a toothpick."
    },
    {
      "title": "Your lips are sensitive surfaces that can be damaged relatively easily.",
      "content": "Your lips are sensitive surfaces that can be damaged relatively easily. To keep them healthy, avoid damaging the surface by picking at the skin with your fingers or biting at the skin with your teeth. Usually, picking happens when there is already damage to the surface of your lips. However, it is much better to leave the surface of your lips alone while they heal than to remove peeling or damaged skin with your fingers."
    },
    {
      "title": "Touching your lips a lot when not necessary can damage them over time.",
      "content": "Touching your lips a lot when not necessary can damage them over time. Your goal should be to leave the surface alone as much as possible, so that the skin surface of the lips remains intact. This is not to say that you can never touch your lips. It just means that you shouldn't touch your lips all of the time."
    },
    {
      "title": "Extreme temperatures and conditions can really do a number on your lips, causing damage to the surface.",
      "content": "Extreme temperatures and conditions can really do a number on your lips, causing damage to the surface. If possible, protect them from exposure to the elements. [1] X Research source If you are walking in a windy area, cover your lips with a piece of clothing, such as a scarf. If you are spending time in the sun, try to keep your lips protected, either with a piece of clothing or sunscreen."
    },
    {
      "title": "Get medical treatment for wounds or sores on your lip that lasts several weeks.",
      "content": "Get medical treatment for wounds or sores on your lip that lasts several weeks. It is relatively common to have a disease or infection that impacts the health of your lips. Some common lip infections and diseases that can benefit from treatment include: [2] X Research source Cold sores Cheilitis Photosensitivity Cuts and wounds caused by trauma"
    },
    {
      "title": "Petroleum jelly or lip balm can protect your lips from hot or cold conditions.",
      "content": "Petroleum jelly or lip balm can protect your lips from hot or cold conditions. Extreme weather can harm your lips and leave them chapped and dry, so be sure to give your lips a protective coating so they don't get red and chapped. [3] X Research source Petroleum jelly is a cheap and effective product that can moisturize your lips and prevent them from getting chapped. If you want some color on your lips, try a tinted lip balm or lip gloss. You can also put on lipstick over petroleum jelly if you want color and protection. Lip balms come in a variety of scents, like mint and vanilla. You can also use an unscented product. [4] X Expert Source Tymia Yvette Makeup & Lash Artist Expert Interview. 23 April 2020."
    },
    {
      "title": "Exposure to the sun can do a lot of damage to the surface of your lips.",
      "content": "Exposure to the sun can do a lot of damage to the surface of your lips. Look for a lip balm or chapstick that contains sunscreen and apply it daily before exposing your lips to the sun. Pick a lip balm or chapstick that has an SPF rating of 30 or higher."
    },
    {
      "title": "Discontinue using products that irritate your lips.",
      "content": "Discontinue using products that irritate your lips. If your lips are tender or swollen, it could be caused by products you are putting on them. Keep track of your symptoms and stop using any products that may be irritating your lips. For example, many lip plumping products can be used safely but there is a chance that they will irritate your lips. If the product you are using is irritating or hard on the surface of your lips, stop using it."
    },
    {
      "title": "You should only exfoliate once a week.",
      "content": "You should only exfoliate once a week. While you can use beauty products designed for gentle exfoliation, you can also just use a soft toothbrush to gently rub the surface. After exfoliating, apply a moisturizer to replenish your lips. [5] X Expert Source Tymia Yvette Makeup & Lash Artist Expert Interview. 23 April 2020. Try not to use any abrasive products to exfoliate your lips. [6] X Expert Source Tymia Yvette Makeup & Lash Artist Expert Interview. 23 April 2020. Get a separate toothbrush to brush your lips. But make sure that it has got soft bristles."
    },
    {
      "title": "Hydrating yourself will help your lips stay moist and healthy.",
      "content": "Hydrating yourself will help your lips stay moist and healthy. Hydrated lips are less prone to crack or to becoming chapped. You should aim to drink between 2,200–3,000 millilitres (9.3–12.7 c) of fluids every day. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you need to drink more water , try carrying water with you at all times. Increase your water intake by drinking it at set times every day, such as right when you wake up, when you take a break at work, or when you come home from work."
    },
    {
      "title": "A healthy diet makes your skin glow and helps your lips look healthy and natural.",
      "content": "A healthy diet makes your skin glow and helps your lips look healthy and natural. One easy way to make your diet healthier is to increase the intake of fresh vegetables and fruits you eat. You should also stay away from junk foods, such as sweets and fried foods. You should also change the type of beverages you drink when you are trying to eat a healthier diet. For instance, avoid carbonated drinks, instead go for water or fresh fruit juices."
    },
    {
      "title": "Smoking exposes your lips to a variety of toxins, which can damage their surface.",
      "content": "Smoking exposes your lips to a variety of toxins, which can damage their surface. One key way to keep your lips healthy is to not smoke. It also dramatically increases your chance of getting lip cancer, which can be life-threatening and severely damaging to the lips. [8] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you are having a hard time quitting smoking on your own, talk to your doctor about how they might help you. This may include medication or behavioral therapies. [9] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "A strong immune system helps your fight off any infections.",
      "content": "A strong immune system helps your fight off any infections. Stock up on supplements for zinc, copper, and vitamin C to help keep it in check. Treat your body well. Reduce your stress levels, get enough sleep, eat healthy, and exercise to boost your immune system."
    }
  ]
}