{
  "url": "https://www.wikihow.com/Play-New-Super-Mario-Bros.-Wii",
  "title": "How to Play New Super Mario Bros. Wii",
  "steps": [
    {
      "title": "Be familiar with the format.",
      "content": "Be familiar with the format. This is one of Wii's hottest sellers, but it's far different than any other video game you'll find on sale. Today's games are mostly 3D, but this one is 2D (it's technically a blend between 2 and 3D, nicknamed \"2.5D\"). You can only go in one of two directions: Forwards and backward. If you don't feel like jumping right in, you could play some of the game's ancestors to get a feel for it."
    },
    {
      "title": "Learn the controls.",
      "content": "Learn the controls. Being a classic side-scroller, the controls are simplistic and easy to learn. The controller is held sideways so that your right thumb should be near the 1 and 2 buttons and your left thumb is near the arrow pad and A button. Directional Arrows: Select the direction to move in (left/right). When in the air, the down arrow does a ground-pound. When climbing on a wire fence (found in castles), all four arrows are used to move around. The 2 button: This button is used to jump. Holding it down longer results in a better jump. The 1 button: Hold 1 to dash. When combined with pressing 2, your jumps are much longer than they normally would be. When in possession of either a fire flower or an ice flower, 1 is used both to dash and to shoot. The A button: Put yourself in a bubble. This is a great tactic to know in multi-player games. When you are about to lose a life (falling into a pit, about to run into an inevitable enemy), press A to save yourself. Another player can pop the bubble once you are in a safe area and you can resume playing without losing a life. This will not work in single-player games (you will lose a life). The + key: Pause/Menu; Wall Jump: Jump towards the wall then press 2 and the directional arrow away from the wall at the same time. Shake: Makes your character spin. When in possession of either a fire flower or an ice flower, this will release two balls of fire or ice respectively to both the left and the right. Lifting: While holding 1 and shaking the remote, you can lift by nearby objects including small ice cubes, turtle shells, and power blocks. This is an effective move when playing multiplayer as the character above can assist the character below. Triple Jumping: Jump while dashing. Keep holding the 1 key. Directly jump again when your character touches the ground. Do it again to get your character to triple jump. Simultaneous Ground Pound: This works only for multiplayer gameplay and is great for defeating difficult enemies such as wigglers or piranha plants. Have at least 2 players ground pound and hit the ground at the same time. All on-screen enemies will then disappear."
    },
    {
      "title": "Know the items.",
      "content": "Know the items. New Super Mario Bros. Wii has many new and returning items that come in handy throughout a game. They can make or break your game, so it's important to know how they work. Mushroom: Turns Mario into Super Mario. Super Mario is taller and stronger. Super Mario can take two hits before dying instead of one. Fire Flower: A useful item that allows Mario to shoot fireballs. Press 1 to shoot fire. Hitting an enemy with a fireball leaves behind a coin to collect. Most (but not all) enemies can be killed with this. Ice Flower: A new item to Mario side-scrollers. This allows you to freeze enemies inside blocks of ice. The blocks can be picked up and thrown (and can be used for many purposes). Mini Mushroom: An item that first made its debut in this game's prequel for the handheld DS, New Super Mario Bros. This shrinks the player down to minuscule size. With the mini mushroom, you can fit into small spaces and your jumps are extra high. Mini Mario can dash on water. He needs to ground pound to kill an enemy. Be careful with this item, though. It takes only one hit to kill Mario. Propeller Suit: A brand-new item that allows Mario to launch up into the air and float much longer than a regular jump. To use this, shake the Wii remote. Mario can be hit by enemies three times before dying. Penguin Suit. Another new item. It allows you to slide on ice and shoot ice balls at enemies. Like the Propeller Hat, it can take three hits before losing a life. 1-Up Mushrooms: Gives you an extra life. They look just like regular Mushrooms except that they are green. Power Star: Makes Mario invincible. Any enemies you run into while it is in effect immediately die. It also lights up the cavern in certain \"dark\" underground levels. When playing multiplayer, make this effective by allowing the invincible character to lift the other character. Both will become invincible."
    },
    {
      "title": "Know your enemies.",
      "content": "Know your enemies. There are a lot of classic Mario enemies in this game. Knowing how to avoid or defeat each can help you significantly. Here are some of the most common ones: Koopa Troopa: The most common enemy you will come across. Stomp on their shells to immobilize them, and you can kick them away if you wish. Kicking a Koopa shell near other enemies will knock out anything in its path. Just be sure it doesn't come back at you because Koopa shells are dangerous. Koopa Paratroopas have small white wings, allowing them to hop around or hover in the air. Stomp on them to take their wings off, and they will walk around like a normal Koopa. Note: The difference between Koopas with red shells and green shells is that red ones stay put on the ledge they walk on, while green Koopas walk continuously in a straight line, only turning if they hit a dead-end. Goomba: Goombas are brown mushroom-like beings that waddle many of the game's levels. They are the weakest opponents in the game and can be killed by stomping them. Paragoombas, like Paratroopas, have wings, which allow them to hop around. Spikes: Strange creatures that pull spiked balls out of their mouths and throw them at you. They are often positioned on high ground, making them somewhat tough to defeat. But if you have good timing and can avoid its throws, a simple stomp to the head will eliminate it. Just be careful you don't try to stomp it while it's pulling a spiked ball out of its mouth! Bullet Bill/Banzai Bill: As their names imply, they are black bullets with eyes and arms, shot out of a launcher (usually with a Bullet Bill shooter on either side). They can be frozen with an Ice Flower, which will allow you to jump on them and reach hard-to-reach places. Banzai Bills are immense, grinning versions of Bullet Bills, found only in two levels (looking even bigger when they appear a second time). Although they are huge, they are fairly easy to defeat. Jump on them, like Bullet Bills, and you will kill them. Swoopers: In the underground levels, bat-like creatures will fly from the roof of the cave at you. A simple jump can avoid them, and a single stomp will kill them. Lakitu: Bespectacled Koopas riding on top of smiling clouds. They throw down enemies like Spikes, which can get frustrating as they throw them down very quickly at some points during levels. If you manage to stomp on the Koopa, usually using Yoshi to hover, you can jump on the cloud and ride it using the directional pad. However, after a few seconds, the cloud will disappear, and a new Lakitu will return shortly. Wigglers: Found only in the poisonous swamps of World 5, these yellow caterpillar-like enemies seem harmless, but will still take away a life if you touch them. The only way to defeat them is to throw a shell, a POW block, or use a synchronized ground-pound in multiplayer, for if you merely stomp on them, they will become angry, turn red, and walk a little faster. Giant wigglers can also be found underground. They are much faster than normal ones and can walk right into the swamp. You can bounce on them without having them become angry, but make sure they don't lead you right into the swamp. Podoboos: In the fiery levels, balls of fire with eyes will hop around or jump out of lava. Be sure to avoid them. They can be frozen, they die when you freeze them. Cheep-Cheeps: Many kinds of fish, called \"Cheep-Cheeps,\" dwell the aquatic levels of Mario Bros Wii. Despite their harmless appearance, they are not friendly. The only way to get past them is to swim around them and avoid them or shoot them with either ice or fireballs. There are several kinds, so learn all their habits! Dry Bones: Found in the fortress and castle levels, these walking skeletons, assuming the look of Koopas, can only be defeated with a star or by being frozen and thrown or ground-pounded upon. Pokeys: Segmented, spikey, cactus-like enemies lurking in the desert world. The only way to defeat them is with a star, which will turn you invincible, or have Yoshi eat them. If Yoshi eats their heads, then their entire body will collapse. Their spikes will disappear for about 2 seconds to the music. If Yoshi eats any part of their body at this point, no matter how tall they are, he will gobble up the entire Pokey, and lay an egg which will contain items like coins, Mushrooms, 1-Up Mushrooms, or Fire Flowers. Hammer Bros: Elite members of the Koopa army who are usually found in groups of two or three. They toss hammers at you, so be very cautious about your timing. Some of them stand on floating block platforms and can be hit from underneath. For the rest, they can be killed by stomping on them or shooting them with fire. Fire and Ice Bros: Hammer Bros that shoot ice or fire. You can always tell what kind of \"Bro\" it is by its shell. Hammer Bros have green shells and the fire and ice varieties have red and light blue shells, respectively. They are best avoided since their attacks (especially the Fire Bros) have excellent range. They can be killed with a stomp or, ironically, with ice and fireballs. Piranha Plants: Common enemies that usually come out of pipes. Some shoot fire."
    },
    {
      "title": "Learn each level.",
      "content": "Learn each level. Every level is different and unique in some way or another. Don't get discouraged if you don't pass a level on your first few tries. If you get stuck on a level for long enough, you have the option to use the Super Guide in which Luigi appears and shows you through the level. When playing with more than one player, work together to get through levels."
    },
    {
      "title": "Defeat bosses.",
      "content": "Defeat bosses. This is very important. Without beating bosses, you will advance nowhere in this game. Each boss is a Koopaling, a son of Bowser. They make their first appearance since Super Mario World. Each one has its routine that it uses to defeat you, so watch first and observe its patterns. When you see an opening, stomp it on the head three times."
    },
    {
      "title": "Play with friends.",
      "content": "Play with friends. This is the first Mario platform game to feature 4-player simultaneous gameplay. You and three friends can play through the game together, as if on a team. Player one is always Mario and the other players can choose between Luigi and Blue and Yellow Toad. All players' abilities are exactly alike, so picking your character is just a matter of preference."
    },
    {
      "title": "Stop at the Mushroom Houses.",
      "content": "Stop at the Mushroom Houses. At these houses, you have the chance to gain either lives or items by playing short mini-games. The items you win can be accessed on the map by pressing 1. Use your items in levels you're having trouble with."
    },
    {
      "title": "Use items to your advantage.",
      "content": "Use items to your advantage. For example, you can freeze enemies in blocks of ice and use them as stepping stones. Use propeller hats to gain ground faster and bypass enemies below."
    },
    {
      "title": "Save your game.",
      "content": "Save your game. You can only do this after defeating a castle. You cannot save during the middle of a level or a world except after beating a castle/fortress level (as stated before). You may \"Quick Save\" during the game, but you may only load the quick-saved save file once, otherwise you will go back to your previous normal save point. After defeating Bowser in World 8, you can save anytime."
    },
    {
      "title": "Find secret exits and secret areas.",
      "content": "Find secret exits and secret areas. Some levels have more than one way out. If you discover a secret exit, there may be some extra benefits from it! (The image here shows a secret area)"
    }
  ]
}