{
  "url": "https://www.wikihow.com/Cure-Erectile-Dysfunction-Naturally",
  "title": "How to Cure Erectile Dysfunction: Can Natural Remedies Help?",
  "steps": [
    {
      "title": "Follow a healthy, balanced diet.",
      "content": "Follow a healthy, balanced diet. A healthy diet helps keep your weight down and reduces cholesterol, both of which can improve ED. Eating right also supports your heart health, which is important for overcoming ED. Base your diet around fruits and vegetables, lean proteins, whole grains, and low-fat dairy products to maintain good nutrition. For ideal heart health, include 4-5 servings each of fruit and vegetables in your diet every day. Have 1 or 2 in each meal, then have some more for snacks throughout the day. [6] X Trustworthy Source American Heart Association Leading nonprofit that funds medical research and public education Go to source Get your proteins from lean sources like poultry, fish, beans, nuts, and eggs. [7] X Research source Switch to whole-wheat or whole-grain products instead of white and enriched types. [8] X Research source"
    },
    {
      "title": "Reduce saturated fat in your diet.",
      "content": "Reduce saturated fat in your diet. Studies show that decreasing the amount of saturated fat in your diet can help treat and prevent ED. Try to replace saturated fats in your diet with healthier or non-fat sources instead. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Saturated fats come from processed, fried, and salty foods. Red meat and brown-mean poultry are also high in saturated fats. [10] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Get only 10% of your daily calories from saturated fat and 25-35% of your calories from all fats. That means if you eat 2,000 calories less than 200 should come from saturated fat and less than 700 should come from all fats. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Get plenty of vitamin D to boost testosterone.",
      "content": "Get plenty of vitamin D to boost testosterone. A vitamin D deficiency could also contribute to ED by lowering your testosterone levels. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Include plenty of fortified foods, dairy products, eggs, and fish. Your body an also produce vitamin D if you spend time in the sun. [13] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Vitamin D deficiencies are common because foods don’t contain high amounts. You might need to take a supplement if your doctor tells you to. [15] X Research source"
    },
    {
      "title": "Drink alcohol in moderation.",
      "content": "Drink alcohol in moderation. Excessive drinking could interfere with your circulation and prevent blood flow to your genitals, triggering ED. Keep your drinking limited to an average of 1-2 drinks per day. This should help you avoid any problems. [16] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source [17] X Research source Trying to have sex while you're drunk could also cause ED. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Eat more vitamin B12 if you have a deficiency.",
      "content": "Eat more vitamin B12 if you have a deficiency. A vitamin B12 deficiency could interfere with your nerve function and cause ED. A simple blood test can confirm if you have a vitamin B12 deficiency. [19] X Research source If you do, the include plenty of leafy green vegetables, eggs, dairy, lean meat, and fish in your diet to get your daily dose of B12. [20] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Adults need 2.4 mcg of B12 per day. You can get this from food or a multivitamin supplement. [21] X Research source"
    },
    {
      "title": "Exercise every day to improve your heart health.",
      "content": "Exercise every day to improve your heart health. Besides supporting your heart health, regular exercise also improves your circulation and blood flow. All of this can help treat ED. Moderate-to-intense aerobic activity is best for treating ED. Try more vigorous running, cycling, swimming, or other cardio exercises for the best results. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [23] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The general recommendation is to get at least 150 minutes of exercise per week. Space that out and exercise for 30 minutes 5-7 days per week. [24] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you ride your bike often, this could make ED worse by interfering with circulation in your genitals. Limit your riding to 3 hours per week and use other exercises instead. [25] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you aren’t healthy enough for intense exercise, you can still add more physical activity to your life. Even a daily walk could treat ED. [26] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Maintain a healthy body weight.",
      "content": "Maintain a healthy body weight. Being overweight could cause ED or make it worse. If you are overweight, then losing weight could be a big help. Talk to your doctor and determine the ideal weight for you, then design a diet and exercise routine to reach and maintain that weight. [27] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Fortunately, the other steps for treating ED naturally, like following a healthy diet and exercising regularly, will also help you lose weight. You can tackle both problems at once."
    },
    {
      "title": "Quit smoking and using illicit drugs.",
      "content": "Quit smoking and using illicit drugs. Tobacco and drugs can constrict your blood vessels, making ED more likely. [28] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It’s best to quit both habits if you have them, both to treat your ED and to improve your overall. [29] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Reduce stress as much as you can.",
      "content": "Reduce stress as much as you can. Stress could also cause ED by distracting you from intimacy. If you regularly feel stressed, then taking steps to reduce it can improve your physical and mental health significantly. [30] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Relaxation exercises like meditation or deep breathing are great for relieving stress. Try setting aside 15-20 minutes each day for these activities. [31] X Research source Doing things you like is also good for reducing stress. Make time for some of your hobbies each day as well."
    },
    {
      "title": "Stop taking medications that could cause ED.",
      "content": "Stop taking medications that could cause ED. A number of prescription and OTC medications could trigger ED. These include antidepressants, diuretics, antihistamines, muscle relaxers, pain relievers, and tranquilizers. Talk to your doctor about switching to medications that don’t cause ED as a side effect. [32] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Never stop taking medications without asking your doctor first."
    },
    {
      "title": "Maintain your dental health.",
      "content": "Maintain your dental health. This probably sounds strange, but there is actually a link between your oral health and ED. Studies show that gum disease could inflame blood vessels throughout your body, including in your genitals, which could trigger ED. You can prevent this by practicing good oral health, brushing every day, and seeing your dentist for regular cleanings and checkups. [33] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Stimulate blood flow with L-arginine.",
      "content": "Stimulate blood flow with L-arginine. L-arginine is an amino acid that could open blood vessels and improve ED symptoms. [34] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try taking 6-30 mg per day, depending on the dosage instructions. [35] X Research source Usually the daily intake should be spread out in 2 or 3 different doses, but follow the instructions provided. Do not take L-arginine along with Viagra. It may also cause nausea and cramping."
    },
    {
      "title": "Try ginseng supplements.",
      "content": "Try ginseng supplements. Ginseng is a popular remedy for many health issues, and might help treat ED by stimulating blood flow. [36] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try taking 200 mg per day to see if this helps you. [37] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source Common side effects from ginseng are insomnia, headaches, and vertigo."
    },
    {
      "title": "Use DHEA to increase libido.",
      "content": "Use DHEA to increase libido. Men with ED often experience decreased libido as well. The hormone DHEA shows some success in boosting libido and could also treat ED. [38] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Try taking 50-100 mg daily, depending on the product instructions. [39] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source This supplement may cause acne. [40] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Women can also take DHEA to raise their libido. [41] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Speak to your partner about your problem.",
      "content": "Speak to your partner about your problem. You might feel embarrassed and avoid talking about ED with your partner, but shutting them out isn’t the right answer. Partners might feel like the situation is their fault. Be as open as you can and talk with them about your problem. That way, you two will stay connected and can tackle the problem together. [42] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Be sure to reassure your partner that this isn’t their fault and it doesn’t mean you aren’t attracted to them. There are many physical and mental factors that can cause ED that is completely unrelated to your relationship. Try to find other ways to show your feelings. Cooking a nice dinner or cleaning the house could show them you still care about them and the relationship."
    },
    {
      "title": "Visit a therapist or psychiatrist if you feel overwhelmed.",
      "content": "Visit a therapist or psychiatrist if you feel overwhelmed. ED can be an overwhelming problem, and you don’t have to face it alone. Seeing a therapist to talk over your stress and anxiety can be a big help. This kind of emotional support might even treat your ED. [43] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Try and include your partner in your therapy sessions. Their support can be a big help for you. Therapy is also helpful if stress or emotional problems were the cause of your ED in the first place. Handling any emotional issues can be a big part of your recovery."
    },
    {
      "title": "Work on problems in your relationship if you have any.",
      "content": "Work on problems in your relationship if you have any. All relationships have problems and while it’s rare less common, relationship problems could contribute to ED. Communicate any problems or complaints you have to your partner and encourage them to do the same. Fixing any relationship issues could help end your ED. [44] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You two could also attend couple’s counseling together for professional help."
    }
  ]
}