{
  "url": "https://www.wikihow.com/Make-Stim-Toys",
  "title": "How to Make Stim Toys",
  "steps": [
    {
      "title": "Find a chewable item.",
      "content": "Find a chewable item. Check that the material it is made of is non-toxic and won't break up when chewed. Choose an item that is small and lightweight enough to be used as jewelry. If the toy is for a child, be sure that the item is not small enough to be swallowed. Many types of rubber, plastic, and stones like amber can be safely chewed."
    },
    {
      "title": "Choose a string or chain.",
      "content": "Choose a string or chain. There are many types of string, ribbon, and chain that can be used as jewelry. When choosing a holder, check that it is non-toxic and will not fray or break when chewed. The texture of the holder is just as important as the chewable object. Some people might prefer a silky ribbon, while others will want a clunky chain. Feel free to test out different materials."
    },
    {
      "title": "Attach the item.",
      "content": "Attach the item. You can attach the item by drilling a small hole and threading the string or chain through it. You can also use a wire cage hanging from a necklace or bracelet to have an easily removable chewable. Another option is to use a knotting method to form a tiny net around your object."
    },
    {
      "title": "Adjust the length.",
      "content": "Adjust the length. Decide whether you want a necklace, bracelet, anklet, or some other item. If you are using chain, you will need to learn how to change the length of a jewelry chain and how to add clasps to the ends. If you are using string or ribbon, you can simply cut the ends to the length you want and then tie them together using a square knot ."
    },
    {
      "title": "Choose your case and decorations.",
      "content": "Choose your case and decorations. There are plenty of phone cases and plastic decorative items available online, at craft stores, and in other locations. Choose a hard, solid-colored or clear case. For decorations, choose items that have interesting textures and appearances. You can find tiny velvet animals, mini mirrors, fabric patches, and anything else that is small enough to fit on a phone case. Since this is on your phone, you probably will not be chewing it, so don't worry about paint or small parts. [1] X Research source"
    },
    {
      "title": "Protect your work surface.",
      "content": "Protect your work surface. You can lay down newspaper, printer paper, saran wrap, or any other material that will prevent glue from getting on your table."
    },
    {
      "title": "Prepare the case.",
      "content": "Prepare the case. You should have a hard plastic phone case that is not flexible. To remove any dust or fingerprints, wipe the phone case with rubbing alcohol. You can use cotton balls dampened with rubbing alcohol or premade alcohol wipes. After this, leave the case flat on the table and do not touch it with your skin."
    },
    {
      "title": "Prepare your decorations.",
      "content": "Prepare your decorations. You can find your own decorations or buy decoden cabochons online that are made just for phone cases. Wipe the backs of the decorations with rubbing alcohol to clean them, and then place them on the phone case without glue to plan where you want them to stay."
    },
    {
      "title": "Start gluing.",
      "content": "Start gluing. There are many types of glue available for plastic, and they come in several colors. Some choices include Fuwa Fuwa, Whipple Decorating Creme, E6000 Craft Adhesive, and others. If you have a latex allergy or similar condition, check the glue ingredients before using. Once you are ready, add the decorative pieces to the back of your phone case. [2] X Research source"
    },
    {
      "title": "Dry and use.",
      "content": "Dry and use. Check the glue instructions for drying time. When your case is done drying, put it on your phone and enjoy a convenient tactile toy!"
    },
    {
      "title": "Gather clear elastic cord, glue, and beads of various sizes and shapes.",
      "content": "Gather clear elastic cord, glue, and beads of various sizes and shapes. Plastic beads are cheap and simple, while glass beads look fancier and can be worn to work. Ensure that the glue is clear and does not shatter easily. Two-part epoxy glue (which you mix by hand) or E-6000 work best for this.b"
    },
    {
      "title": "Begin stringing beads along the cord.",
      "content": "Begin stringing beads along the cord. It helps to alternate between one large bead and one small bead. Try round beads to make them comfortable to spin in your hands. [3] X Research source"
    },
    {
      "title": "Tie the elastic once or twice.",
      "content": "Tie the elastic once or twice. Then slip the bracelet on and off your wrist. Is it comfortable? Do you need to make it larger or smaller? The knot may try to undo itself as you take the bracelet on or off. If this happens, ask a friend to pull the knot tight as you try it on."
    },
    {
      "title": "Glue the knot once the bracelet is the correct size.",
      "content": "Glue the knot once the bracelet is the correct size. Place your bracelet on some cardboard, tagboard, or old newspaper. Pull the cord as tight as you can, then glue it. Apply plenty of glue to help it stay. Let it sit to dry as long as the instructions suggest. Some glues, such as E-6000, involve fumes. Try gluing the bracelet outside. (When it is dry, the fumes will be gone and it will be safe.) If your beads are translucent, try not to get glue inside the beads, as it may make them less shiny. A thicker glue will be easier to keep out of the center of the beads."
    },
    {
      "title": "Clip off the ends of the string once the glue is dry.",
      "content": "Clip off the ends of the string once the glue is dry. If you applied lots of glue, you should be able to cut it very close and trim off any pointy bits so that it is smooth. [4] X Research source"
    },
    {
      "title": "To stim, place the bracelet around one thumb and loosely close your fist around it.",
      "content": "To stim, place the bracelet around one thumb and loosely close your fist around it. With your other hand, pull the bracelet so it spins through your hand. You can also wave it around, run your fingers over it, or experiment with new ways to stim."
    },
    {
      "title": "Get a balloon and some flour.",
      "content": "Get a balloon and some flour. Any type of flour works for this purpose, but use a typical balloon rather than a water balloon, as water balloons are thinner and more susceptible to popping. Don't get a cheap balloon, as these will pop easily. You may even want to put one balloon inside of another balloon before filling it, as a precaution. If you have an allergy to latex, use latex-free balloons."
    },
    {
      "title": "Open the neck of the balloon.",
      "content": "Open the neck of the balloon. You can use your fingers to gently widen the neck of the balloon. [5] X Research source"
    },
    {
      "title": "Spoon flour into the balloon.",
      "content": "Spoon flour into the balloon. Take a small spoon and begin adding flour into the balloon. Be cautious to avoid spilling flour all over your workspace. [6] X Research source"
    },
    {
      "title": "Stop when the balloon is at a medium size.",
      "content": "Stop when the balloon is at a medium size. The balloon should be full enough so that there's minimal air, but not full enough that it's impossible to change its form using your hands. If it's firm to the touch, it's too full, and you run the risk of it bursting and making a mess everywhere when you squeeze it."
    },
    {
      "title": "Tie the neck of the balloon shut",
      "content": "Tie the neck of the balloon shut . Stretch out the neck of the balloon, then knot it by creating a loop and slipping the end of the neck through the loop. Make sure not to flip the balloon in a way that causes the flour to spill out. If you've \"double-bagged\" the balloons, be sure to tie both of the balloons, not just one. Tuck the innermost knot into the second balloon, and then knot the outermost balloon."
    },
    {
      "title": "Squeeze the balloon.",
      "content": "Squeeze the balloon. You can knead the balloon with your hands and move the flour around inside of the balloon. Just be careful not to squeeze all the flour to one end of the balloon, or it might pop!"
    },
    {
      "title": "Grab a see-through jar, some water, food coloring, glitter glue, and glitter.",
      "content": "Grab a see-through jar, some water, food coloring, glitter glue, and glitter. Have enough water to almost fill the jar, and enough food coloring and glitter to fill the water. Be prepared to use the stove, as well, since you need to boil the water. You can also add some lightweight decorations, such as metallic confetti, to the glitter jar. This can add some extra sparkles when you shake the jar. If you or the recipient has poor coordination, this may not be the best choice for a stim toy, as a glass jar will break if dropped, and the hot water required in the project may melt a plastic jar."
    },
    {
      "title": "Boil the water.",
      "content": "Boil the water. You can do this using a pot or a teakettle. [7] X Research source"
    },
    {
      "title": "Pour the boiling water into the jar.",
      "content": "Pour the boiling water into the jar. Use caution - use potholders or oven mitts when handling the pot or kettle, and keep a distance from the pot or kettle and the water so that you don't risk burning yourself or splashing hot water on you. [8] X Research source"
    },
    {
      "title": "Add a few drops of any desired color food coloring.",
      "content": "Add a few drops of any desired color food coloring. When adding in the food coloring, take care that you add enough to get the color of water that you want."
    },
    {
      "title": "Shake in the glitter.",
      "content": "Shake in the glitter. Grab the glitter and glitter glue, and add it into the hot water. Use a spoon to stir it thoroughly."
    },
    {
      "title": "Add in any other accessories.",
      "content": "Add in any other accessories. If you're putting any other decorations (i.e. small plastic toys, glow sticks, seashells, etc.) into your glitter jar, put them in the glitter water. [9] X Research source"
    },
    {
      "title": "Close the lid tightly.",
      "content": "Close the lid tightly. Put extra force into making sure the lid is closed. You can also glue the lid shut if you don't plan on reopening the jar at any point."
    },
    {
      "title": "Shake the jar.",
      "content": "Shake the jar. To stim with the toy, shake the jar and watch the glitter swirl around. A glitter jar, also called a calm down jar, creates a very calming visual effect used by many people!"
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. You will need different plastic bottles (preferably thick soda bottles), as well as a variety of buttons, beads, dry rice, popcorn kernels, and dry beans. If desired, you can also gather mini accessories such as small plastic toys, small seashells, and/or glitter."
    },
    {
      "title": "Pour the materials in the sensory bottles.",
      "content": "Pour the materials in the sensory bottles. Place something different in each bottle (e.g. one bottle with rice, another bottle with beads, etc.). Fill the bottles halfway or nearly to the top. Add any accessories, if desired. [10] X Research source"
    },
    {
      "title": "Close the bottles tightly.",
      "content": "Close the bottles tightly. Glue the bottle caps shut if you don't plan on opening the bottles again."
    },
    {
      "title": "Shake the bottles.",
      "content": "Shake the bottles. To stim with your toy, shake the bottles and listen to the noise each bottle makes."
    },
    {
      "title": "Get the things you need.",
      "content": "Get the things you need. You will need a large sealable plastic bag, hair gel, duct tape, and other desired accessories such as small toys, craft pom-pom balls, glitter, and/or marbles. [11] X Research source"
    },
    {
      "title": "Squirt the whole bottle of hair gel into the plastic bag.",
      "content": "Squirt the whole bottle of hair gel into the plastic bag. Be sure that the bag isn't too full, however, since you don't want the bag to break. [12] X Research source"
    },
    {
      "title": "Add the desired accessories.",
      "content": "Add the desired accessories. [13] X Research source"
    },
    {
      "title": "Seal the bag tightly.",
      "content": "Seal the bag tightly. Close the bag and firmly duct tape all the sides of the bag to keep the gel from spilling out. You may want to put the plastic bag inside another plastic bag, if possible, in case the first plastic bag leaks."
    },
    {
      "title": "Squeeze the gel pad.",
      "content": "Squeeze the gel pad. To stim with your toy, squish the gel pad and feel the texture with your hands."
    },
    {
      "title": "Pick out the needed materials.",
      "content": "Pick out the needed materials. You will need a stuffed animal, small weighted materials (i.e. pebbles, beads, buttons, dry beans, etc.), small zipped bags, a seam ripper, a sewing needle, and thread. [14] X Research source This may not be the best stim toy for you to make if you have poor fine motor control or can't sew, since it does require sewing."
    },
    {
      "title": "Open the back of the stuffed animal using the seam ripper.",
      "content": "Open the back of the stuffed animal using the seam ripper. Pull out half of the cotton filling from the toy."
    },
    {
      "title": "Place the small weighted materials in the small zipped bags.",
      "content": "Place the small weighted materials in the small zipped bags. Close the bags tightly."
    },
    {
      "title": "Refill the stuffed animal.",
      "content": "Refill the stuffed animal. Put the bags inside of the stuffed animal. Place the cotton filling back as well."
    },
    {
      "title": "Sew the stuffed animal back using the needle and thread.",
      "content": "Sew the stuffed animal back using the needle and thread."
    },
    {
      "title": "Stim with your toy.",
      "content": "Stim with your toy. To stim, feel the stuffed animal by squishing and feeling the materials inside. You can also place the stuffed animal on you to feel the weighted effect from the amount of materials it has."
    },
    {
      "title": "Find the needed supplies.",
      "content": "Find the needed supplies. You will need 2 cups of flour, 2 cups of water, 1/2 cup of sea salt, 1/8 cup of vegetable oil, 1 tablespoon of cream of tartar, food coloring, and 8-10 drops of any desired essential oil. [15] X Research source"
    },
    {
      "title": "Combine all the ingredients except the oil in a large saucepan with the heat not on.",
      "content": "Combine all the ingredients except the oil in a large saucepan with the heat not on. Mix until there are no lumps. [16] X Research source"
    },
    {
      "title": "Place the stove on to medium heat.",
      "content": "Place the stove on to medium heat. Stir until the play-dough forms into a large clump of thick dough. This usually takes about five to ten minutes. [17] X Research source"
    },
    {
      "title": "Remove the play-dough from heat.",
      "content": "Remove the play-dough from heat. Add the drops of essential oil and food coloring until it reaches the color you like. Consider letting the color of the play-dough match with the oil. Examples include: Lavender oil for purple play-dough. Orange oil for orange play-dough. Lemon oil for yellow play-dough. Peppermint oil for green play-dough. Grapefruit oil for pink play-dough."
    },
    {
      "title": "Knead the play-dough.",
      "content": "Knead the play-dough. [18] X Research source"
    },
    {
      "title": "Let it cool in a plastic bag.",
      "content": "Let it cool in a plastic bag. Seal the bag tightly and store away in a fridge to keep the play-dough soft."
    },
    {
      "title": "Stim with the play-dough.",
      "content": "Stim with the play-dough. To stim, squish the play-dough and play with it as you like. Sniff it as well to smell the sweet oils."
    }
  ]
}