{
  "url": "https://www.wikihow.com/Report-a-Missing-Person-in-the-U.S",
  "title": "How to File a Missing Person Report in the USA",
  "steps": [
    {
      "title": "Call your local police department once you notice the person is missing.",
      "content": "Call your local police department once you notice the person is missing. Time is usually of the essence in missing person cases, and contrary to popular belief, you don’t have to wait a designated time to report a person missing. Contact the local police once you’ve realized the person is missing. [1] X Research source Find your local police department’s phone number online by searching “[your county] police department,” or dial 911 and say you’d like to report a missing person. Avoid touching the missing person's things (such as their room, clothing, or car) or tampering with their social media accounts, as these may be used as evidence by the police later on."
    },
    {
      "title": "Tell the officer you’d like to file a missing person’s report.",
      "content": "Tell the officer you’d like to file a missing person’s report. Explain to the officer that you’d like to report a missing person. Specify how long the person has been missing and/or the last time you saw them. [2] X Research source Emphasize the age and health of the missing individual with the officer. For instance, someone under 18 or an elderly individual with dementia may require an Amber or Silver alert. Some departments may ask you to wait 24-72 hours to file an official report unless the circumstances of the missing person appear dire or concerning. For example, if foul play or suspicious activity is suspected, the report may be filed despite the time frame."
    },
    {
      "title": "Provide personal information about the missing person.",
      "content": "Provide personal information about the missing person. To file a missing person report, you must tell the officer everything you know about the missing individual. This includes their full name, date of birth, address, phone number, well-being, and physical description. The police will likely ask for details about what the person was wearing the last time they were seen and what they were doing or planning to do. [3] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source Offer to send the police a recent photo of the missing individual to add to their report and aid the investigation. Be aware that the police may ask for your assistance in obtaining medical or bank records and/or social media information."
    },
    {
      "title": "Stay in touch with the police by following up on the report.",
      "content": "Stay in touch with the police by following up on the report. After you file the report, contact the police again about the status of the report within the next few days. The police will likely contact you if anything is found; however, it’s important to stay on top of the situation yourself, just in case. Make it a priority to call them regularly with any leads or new information. [4] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source Reach out to friends, family, and community members and tell them about your missing loved one while you wait. The more people who know the person is missing, the more people who can help search."
    },
    {
      "title": "Offer more details for the report as needed.",
      "content": "Offer more details for the report as needed. If the missing person report stays open for several weeks, the police may ask you to provide DNA samples, dental records, or further information to help locate them. While this can be jarring, know that the police are doing the best they can to find your loved one. [5] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source Try to stay calm while the search is ongoing. Requests for certain information don't necessarily indicate the fate of the missing person—law enforcement is simply gathering as much information as they can to bring your loved one home."
    },
    {
      "title": "Report the missing person to the FBI if foul play is suspected.",
      "content": "Report the missing person to the FBI if foul play is suspected. The Federal Bureau of Investigations (FBI) can help locate a missing person, especially if you or the local police believe foul play or suspicious activity is involved. More often than not, your local department will handle contacting the FBI, but you can take still call in the report yourself, providing the same information you gave the local police. [6] X Research source Find your local FBI precinct’s number by searching “[state name] FBI phone number” online or going to the Department of State's missing persons website . Report missing children by calling 800-THE-LOST (800-843-5678). [7] X Trustworthy Source United States Department of Justice Official website of the U.S. Department of Justice Go to source"
    },
    {
      "title": "Have their name entered into the NCIC database if they’re under 18 years old.",
      "content": "Have their name entered into the NCIC database if they’re under 18 years old. The National Crime Information Center (NCIC) is a resource for missing persons and allows other law enforcement agencies to access information about missing children, expanding the search across county and state lines. [8] X Research source Ask your local police department to help you enter the missing person’s name into the NCIC database or contact the NCIC directly by calling 1-800-843-5678. [9] X Research source"
    },
    {
      "title": "Put the missing person’s information on missing person websites.",
      "content": "Put the missing person’s information on missing person websites. The more people who know your loved one is missing, the more likely they are to be found. Post about their disappearance on missing person websites like NamUs.com and MissingPersonsCenter.org to help spread the word nationally and internationally. Legitimate websites are free and backed by government agencies."
    },
    {
      "title": "Post about the missing person on social media.",
      "content": "Post about the missing person on social media. Consider running a Facebook group, Instagram page, Twitter hashtag, or blog about your missing loved one. Include detailed information about the person, such as their full name, where they were last seen, and what they could be wearing. Provide a contact number for your local police department so people can call if they have any tips on the person's whereabouts. Think of your social media post as a virtual missing person poster, making sure to include the person’s picture, age, and physical description. Avoid putting your own phone number or address on missing person advertisements or posts, as this could result in false tips and hoaxes. [10] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source Always be wary of tips from strangers claiming to have seen the missing person, and only pay attention to plausible tips. Report any legitimate tips to the police so they can investigate."
    },
    {
      "title": "Contact news media about the missing person.",
      "content": "Contact news media about the missing person. Spread the word that the person is missing by contacting local news media outlets, such as local television stations, newspapers, and online news publications. Get in touch with the editor of the news outlets and tell them about the missing person. Offer them a story and ask if they’d be willing to help you spread the word. Think about the local news stations you watch in the morning. Search a station’s name online, go to their website, and look for a “contact” tab. Write to local newspapers or visit their offices yourself, supplying pictures and information on the missing person."
    }
  ]
}