{
  "url": "https://www.wikihow.com/Play-the-Game-of-Taboo",
  "title": "How to Play Taboo",
  "steps": [
    {
      "title": "Divide your group into even teams.",
      "content": "Divide your group into even teams. Taboo works best when you have 4 or more players that are 12 or older. Split the players into teams so they have the same number of people and have the same skill levels. If you have an odd number of people, that’s fine too! One person from the team with fewer people will just take a second turn later in the game. [1] X Research source Match new players up with more skilled players, and young players with older players to make the game more fair. One team could be all of the people with birthdays that fall during January-June, and the other team could be those with birthdays in July-December. When you have couples or family members playing together, it can be a good idea to put them on separate teams so that they do not have any kind of advantage over the other players."
    },
    {
      "title": "Load cards into the cardholder.",
      "content": "Load cards into the cardholder. Shuffle the deck of cards , and place them with the red side face-down inside of the cardholder. Keep the top of the cardholder open so the deck is easy to access for the players. [2] X Research source You can still play the game if you don’t have the cardholder. Just set the pile of cards in front of whatever player is going first."
    },
    {
      "title": "Choose a starting team and clue-giver.",
      "content": "Choose a starting team and clue-giver. Pick a team at random to go first during the game, and select a player to be the first person to give clues. The clue-giver places the cardholder in front of them and sits across from the rest of their teammates. The opposing team sits next to the clue-giver. [3] X Research source The clue-giver changes each round."
    },
    {
      "title": "Give the opposing team the Taboo buzzer.",
      "content": "Give the opposing team the Taboo buzzer. If it’s your first time playing, take off the battery cover and load fresh AA batteries into the buzzer. Set the buzzer in front of the opposing team so any member can easily reach it during the round. [4] X Research source If you press the button and the buzzer doesn’t work, replace the batteries."
    },
    {
      "title": "Start the timer.",
      "content": "Start the timer. When the clue-giver is ready to start the round, they immediately flip over the sand timer to begin. The Taboo game timer usually lasts between 1–2 minutes, so rounds go pretty quickly. [5] X Research source Designate a player each turn to pay attention to the timer so you end the round at the right time. Expert tip: Most copies of Taboo come with a 1-minute sand timer, which should be your first choice to use. As a variant, you can expand to using a 2-minute timer on someone's phone."
    },
    {
      "title": "Draw 1 card from the cardholder when you're the clue-giver.",
      "content": "Draw 1 card from the cardholder when you're the clue-giver. As soon as the timer starts, the clue-giver takes the top card of the deck and flips it over on the cardholder so they can see the opposite side of the one that was showing. The word at the top of the card is the guess word and the list of words underneath it are the taboo words . [6] X Research source Make sure none of the clue-giver’s team members can see the card in the holder. If a teammate sees any words on the card, then the clue-giver discards it and draws a new card."
    },
    {
      "title": "Give teammates clues about the guess-word without saying a taboo word.",
      "content": "Give teammates clues about the guess-word without saying a taboo word. As quickly as they can, the clue-giver tries to make their team say the guess word at the top of the card. The clue-giver can't use any part of the word or any of the taboo words listed underneath it. If a teammate thinks they know the word, they can shout it out. [7] X Research source Example: If the guess-word is “book,” you might give clues like, “something you use to study in school,” or, “a large collection of words that has a main plot.” If the guess-word is \"cookbook,\" then you can't use “cook” or “book” within any of your clues. You may not use gestures, sound effects, initials, or abbreviations when you’re giving clues. It’s against Taboo rules to give “sounds like” or “rhymes with” clues. If the guess word is “boat,” you could not give a clue like, “It rhymes with ‘goat.’” There are no penalties for wrong guesses, but teammates must guess the exact word. If they get close, keep giving clues until they get it right. If you get to a word that you don't know, or your teammates are having a hard time guessing it, you can skip the card and set it aside. However, skipping a card gives a point to the other team."
    },
    {
      "title": "Discard the card for saying a taboo word.",
      "content": "Discard the card for saying a taboo word. Each card includes some of the most obvious related words as taboo words that are not allowed in clues. The opposing team sees the taboo words, and if the clue-giver says one (or any part of the word), they press the button on the buzzer and the card gets discarded. [8] X Research source The playing team loses a point each time they get buzzed (which gets awarded to the opposing team).[Image:Play the Game of Taboo Step 6 Version 5.jpg|center]] Example: For “book,” the taboo words might be “pages,” “read,” “story,” “paperback,” and “text.” Example: If one of the taboo words is “automobile,” then the clue-giver cannot use “auto” in any of their clues."
    },
    {
      "title": "Draw and play new cards until the timer runs out.",
      "content": "Draw and play new cards until the timer runs out. If a team correctly guesses a word, leave it in the cardholder to count it as points. If the clue-giver skips a card or accidentally breaks a rule, the card goes into a discard pile. If there’s still time left in the round, the clue-giver immediately draws the next card and continues playing. When the timer runs out, have a player shout “Times up!” so the clue-giver stops. [9] X Research source If a team doesn’t guess the last card’s word when the timer runs out, then the card is set aside but not placed in the discard pile."
    },
    {
      "title": "Switch teams and clue-givers for the next round.",
      "content": "Switch teams and clue-givers for the next round. Score the points at the end of each clue-giver's turn. Then, have the opposing team choose a player for their first clue-giver. Switch seats so that the new clue-giver is in front of the cardholder and their teammates are across from them. Once players are ready, they can flip the sand timer and draw the top card of the deck to start the next round. [10] X Research source If you run out of cards, take all the cards you set aside, shuffle them, and use the words on the opposite side."
    },
    {
      "title": "The clue-giver’s team earns points for correctly guessed cards.",
      "content": "The clue-giver’s team earns points for correctly guessed cards. After each round, count up the cards still left on the cardholder to determine how many points the current team earned. Each card is worth 1 point, so mark them down on a score sheet or piece of paper. [11] X Research source"
    },
    {
      "title": "The opposing team earns points for each card in the discard pile.",
      "content": "The opposing team earns points for each card in the discard pile. Count the cards that the clue-giver skipped or were discarded for breaking a rule. Each card is worth 1 point for the opposing team, so tally their score as well. [12] X Research source The opposing team also earns a point for each time they use the buzzer. Take all of the cards used during the round and set them aside."
    },
    {
      "title": "End the game once each player has had a turn to give clues.",
      "content": "End the game once each player has had a turn to give clues. Keep alternating which team gives clues each round until all the players have had a chance to do it. If your team earns the most points by the end of the game, then you win! [13] X Research source If the teams are uneven, the team with fewer players chooses someone to be the clue-giver twice. That way, both teams have the same number of turns. Alternatively, you can decide to play to a certain score, or for a certain number of rounds, whichever you prefer."
    },
    {
      "title": "Give clues quickly but carefully.",
      "content": "Give clues quickly but carefully. Read the guess-word and all of the taboo words first, and then start giving clues as fast as you can. Try to use as few words as possible so you don’t confuse your teammates or spend too much time on a single word. If you realize partway into giving clues that you said something confusing, tell your teammates to disregard that clue."
    },
    {
      "title": "Use synonyms and antonyms.",
      "content": "Use synonyms and antonyms. Try to get your teammates thinking about words that are similar to the guess word to help them get on the right track. Choose words that have similar definitions or are complete opposites, but just remember not to say “sounds like” or “rhymes with” clues. Example: If the guess-word is “poster,” you might say clues like “wall hanging” or “movie advertisement.” Example: If the guess-word was “angry,” you could say, “not happy,” or “opposite of pleased.”"
    },
    {
      "title": "Describe multiple meanings that a word could have.",
      "content": "Describe multiple meanings that a word could have. Many words in a Taboo game have more than one meaning, and it doesn't matter which definition you use for your clues. If your team is stuck on clues for one meaning, try clues for the other definitions to help them make the connection. Example: If you have a word like “bank,” you can give clues like “the place where you deposit money” or “the edge of a river.” Example: If the word is chicken, you could say “a farm bird” as well as “what you call someone who is acting afraid.”"
    },
    {
      "title": "Skip words that are stumping your teammates.",
      "content": "Skip words that are stumping your teammates. Sometimes you'll get a word that your team can’t guess even after giving a lot of clues. Even though you lose a point for passing, it’s better to move on to a new card and easier word so you have a chance to earn more points. Players should say \"skip\" whenever they want to skip a word. It's quite common for someone to win 6 points in a 1-minute round, so don't spend more than about 15 seconds on a given word. Only pass when it is absolutely necessary to help your team come out on top."
    }
  ]
}