{
  "url": "https://www.wikihow.com/Clean-an-Oven-with-Vinegar",
  "title": "How to Clean an Oven with Vinegar",
  "steps": [
    {
      "title": "Take out the oven racks and set them aside.",
      "content": "Take out the oven racks and set them aside. If your oven racks are dirty, put them on a towel so they don’t get your surface dirty. If you have a pizza stone or thermometer in your oven, take those out as well. Make sure there are no pots or pans in your oven before you clean it. [1] X Research source"
    },
    {
      "title": "Make a paste out of baking soda and water.",
      "content": "Make a paste out of baking soda and water. Mix ½ cup (170 g) of baking soda with 3 tablespoons (44 mL) of water in a small bowl. Combine the ingredients with a spoon until they make a thick, spreadable paste. If your mixture is still powdery, add more water until it is more spreadable. [2] X Research source If the paste is too watery, it won’t spread as well. Add more baking soda if you need to."
    },
    {
      "title": "Coat your oven in the paste.",
      "content": "Coat your oven in the paste. Wear rubber gloves to protect your hands. Pick up small bits of your baking soda paste and spread it on the bottom, sides, and top of your oven. Add more paste to surfaces that are especially grimy, like the bottom of your oven . [3] X Research source"
    },
    {
      "title": "Let the paste sit in your oven for 12 hours.",
      "content": "Let the paste sit in your oven for 12 hours. Leave the paste in your oven overnight, or for about 12 hours. If you are pressed for time, you can let the paste sit for 1 hour instead, but it may not remove all of the grime in your oven. [4] X Research source Baking soda works to break down grease and grime in your oven. Do not use your oven while the paste is still in it. Heating up the baking soda will cause it to burn and create even more of a mess in your oven."
    },
    {
      "title": "Wipe out the oven with a damp towel.",
      "content": "Wipe out the oven with a damp towel. Wear gloves to protect your hands. Use a damp towel or cloth to wipe out the majority of the baking soda paste. Pay special attention to areas that are coated in grime. Scrub firmly to remove most of the dirt and grime. [5] X Research source If you run into any especially stubborn areas, use a spatula to scrape them off."
    },
    {
      "title": "Spray white vinegar throughout your entire oven.",
      "content": "Spray white vinegar throughout your entire oven. Put white vinegar into a spray bottle. Spray the entire interior of your oven. Pay special attention to areas that might have baking soda residue, like the corners and the bottom of your oven. [6] X Research source The vinegar will react with the baking soda and create a foam. This is normal, and will help to clean your oven."
    },
    {
      "title": "Wipe out the oven with a damp towel.",
      "content": "Wipe out the oven with a damp towel. Use warm water to help break down any remaining grime in your oven. Be sure to wipe out all areas of your oven so there is no baking soda or vinegar left. Let your oven dry completely before you turn it on to use it again. [7] X Research source Use a dry towel to wipe down your oven and speed up the drying process."
    },
    {
      "title": "Wipe out any loose debris in the oven.",
      "content": "Wipe out any loose debris in the oven. Use a paper towel or cloth to wipe out any large chunks of dried food or grime from your oven. Don’t scrub too hard, since these will be dry and hard to get out. Chip out large debris with a spatula. You can also use a handheld vacuum to get rid of chunks of debris in your oven."
    },
    {
      "title": "Boil ⅓ of a pot of water.",
      "content": "Boil ⅓ of a pot of water. Fill a 12 inches (30 cm) pot ⅓ of the way full. Boil it on high heat on the stovetop. Watch for large bubbles that pop at the top of the water to tell when it is boiling. If the water starts to boil over, turn the heat down slightly. [8] X Research source"
    },
    {
      "title": "Add an equal part of white vinegar to the pot.",
      "content": "Add an equal part of white vinegar to the pot. Fill your pot up another ⅓ of the way with white vinegar. These measurements can be approximate. Let the pot boil for another 30 seconds, then turn off the heat. [9] X Research source"
    },
    {
      "title": "Place your pot of water and vinegar onto the bottom rack of your oven.",
      "content": "Place your pot of water and vinegar onto the bottom rack of your oven. Use oven mitts to transfer your pot to the bottom rack of your oven. If you have taken your racks out to clean them, just place the pot on the bottom of the oven. Make sure there are no empty dishes or thermometers in your oven. [10] X Research source"
    },
    {
      "title": "Close the oven door and let the pot sit for 45 minutes.",
      "content": "Close the oven door and let the pot sit for 45 minutes. The hot water will create steam and spread vinegar and hot water all over your oven. This will soften the grease and grime in your oven, making it easier to clean. Close your oven door to trap the steam and let the pot sit for at least 45 minutes. [11] X Research source Do not let the pot sit for more than 1 hour, or else the water will start to cool and become less effective."
    },
    {
      "title": "Wipe out your oven with a damp cloth.",
      "content": "Wipe out your oven with a damp cloth. Use hot water to help break down any grime. Remove the oven racks for an easier reach. Use a metal spatula to scrape out any difficult or crusted grime. Make sure to wipe out your entire oven before you use it again."
    },
    {
      "title": "Place your oven racks in the bathtub.",
      "content": "Place your oven racks in the bathtub. Clear your bathtub of any shampoos or soaps. If your bathtub is dirty, clean it out before you start. Place your oven racks in your bathtub. Set them on top of each other or side by side."
    },
    {
      "title": "Sprinkle baking soda over the oven racks.",
      "content": "Sprinkle baking soda over the oven racks. Make sure all of the racks are covered with baking soda. Shake a liberal amount of baking soda over your oven racks. Flip the racks over to make sure each side gets baking soda on it. Apply more on spots that are especially dirty. Baking soda will work to naturally break down grease on your oven racks."
    },
    {
      "title": "Spray your oven racks with white vinegar.",
      "content": "Spray your oven racks with white vinegar. Put white vinegar into a spray bottle. Douse your oven racks with the vinegar. The vinegar and baking soda will react, creating a foam on your oven racks. Make sure you spray vinegar on every side of each oven rack. [12] X Research source The foam works to break down grease and grime."
    },
    {
      "title": "Submerge the oven racks in hot water overnight.",
      "content": "Submerge the oven racks in hot water overnight. Fill your bathtub with hot water. Make sure the oven racks are completely submerged in the water. Let them sit for about 12 hours or overnight. Do not take them out of the water early, or they may dry with the grime still on them. [13] X Research source"
    },
    {
      "title": "Scrub away any grime left on the racks with a sponge or towel.",
      "content": "Scrub away any grime left on the racks with a sponge or towel. Use an old sponge brush or towel to wipe away stubborn grime that is left on your oven racks. The combination of vinegar, baking soda, and water will make the grime much easier to take off. Use a metal spatula to chip off any stubborn grime. [14] X Research source You can also use a scrub brush to wipe away the grime."
    },
    {
      "title": "Rinse your oven racks with cool water and let them dry.",
      "content": "Rinse your oven racks with cool water and let them dry. Wash off any residual vinegar or baking soda with cool water in your bathtub. Use a towel to dry your oven racks or let them air dry completely before putting them back in your oven. Rinse your bathtub out to wash any residual vinegar or baking soda down the drain."
    }
  ]
}