{
  "url": "https://www.wikihow.com/Curl-Synthetic-Hair",
  "title": "How to Curl Synthetic Hair",
  "steps": [
    {
      "title": "Determine if you can curl the hair.",
      "content": "Determine if you can curl the hair. If you're using synthetic hair extensions or a wig, read the product label to see if it can be heated. The label should tell you how much heat the synthetic hair can handle. If you're unsure if they can handle the heat or you want to curl your weave, test curl a tiny portion of your hair to see if it melts. [2] X Research source If testing to see if the synthetic hair will melt, ensure that you choose a hair that is slightly hidden so that if it does melt, it won't be noticeable."
    },
    {
      "title": "Divide your hair and heat your curling iron.",
      "content": "Divide your hair and heat your curling iron. Decide how large you'd like your curls to be and divide your hair into sections. If you'd like small curls, divide your hair into many sections. If you want big curls, divide the hair into a few sections. Use a clip to secure the hair to your head. Turn your curling iron on to the lowest setting which might just be a warming setting (or level \"1\"). If you'll be curling extensions or a wig, place or secure the hair to a mannequin head."
    },
    {
      "title": "Spray your hair with water.",
      "content": "Spray your hair with water. You'll need to wet your hair so that each portion is completely wet, but not dripping with water. You can wet your hands and run your fingers through the hair or you can use a spray bottle to spritz the hair until it's completely wet. [3] X Research source Wetting your synthetic hair can prevent it from melting and can help it hold the curl."
    },
    {
      "title": "Curl each portion of your hair.",
      "content": "Curl each portion of your hair. Wrap the preheated curling iron around one wet portion of synthetic hair and curl it up. Hold the curling iron in place until the hair begins to feel warm. Gently slide the curling iron out of the curl. Continue curling the rest of your hair. [4] X Research source If you want to get a tighter curl, pin the curl in place against your head until it cools completely. This will also help the curl hold its shape longer."
    },
    {
      "title": "Moisturize your synthetic hair.",
      "content": "Moisturize your synthetic hair. Squirt a little cream-based moisturizer onto the palm of your hand. Rub your hands together and run the moisturizer through your synthetic hair. The moisturizer will help the synthetic hair hold the curl. You can also use an olive oil in place of the cream moisturizer."
    },
    {
      "title": "Roll your hair onto perm rods.",
      "content": "Roll your hair onto perm rods. Determine how large you'd like your curls and lay out several sizes of perm rods. Divide your hair into a small section and roll it up and onto a perm rod. Cap the end so the hair stays tightly wound on the rod. Do this until you've rolled all of your hair onto perm rods. Try to vary the sizes of the perm rods to get different sizes of curls. For a more natural look, keep the curls near your neck and the back of your head larger and looser. Use smaller perm rods for the curls near your face so they're smaller and tighter."
    },
    {
      "title": "Dip the perm rods in hot water.",
      "content": "Dip the perm rods in hot water. Fill a mug 2/3 full with water and heat it for about 1 minute. Carefully, dip each perm rod with hair into the hot water and hold it in the mug for about 15 to 20 seconds. Lift the perm rod out and dip each of the other perm rods in one at a time. [5] X Research source If your water cools, rewarm it and continue dipping the perm rods. Always use caution when handling hot water. If the mug is too hot to handle, wait till it's comfortable to pick up with your bare hands."
    },
    {
      "title": "Let the hair dry.",
      "content": "Let the hair dry. Keep the hair in the perm rods and let them cool and dry completely. They may dry quickly or take a full day to dry, depending on how much hair you wrapped on each curling rod. If you want to sleep with the perm rods in so your curls set overnight, just wear a protective cap. If you're short on time, you could blow dry the hair. Just ensure that the blow dryer is on the lowest setting."
    },
    {
      "title": "Remove the perm rods.",
      "content": "Remove the perm rods. Once the hair has dried completely around the perm rods, gently remove them. The curls will probably be tight and springy when pulled. If you'd like them to stay tight and close to your head, just leave them alone. If you'd like the curls to look softer or fluffier, run your fingers through your hair. You can also separate curls into smaller ones. This can make them look softer and add volume to your hair."
    },
    {
      "title": "Divide and straighten a small section of hair.",
      "content": "Divide and straighten a small section of hair. Gather a small section of your hair and brush it to remove any tangles. Turn on a flat iron to the lowest setting (usually around 250-300 degrees F) and once it's warm, run it through the strand. Continue running the flat iron over the section of hair until the section is smooth and straight. [6] X Research source Each section will end up being a curl. For many small curls, keep the sections small. You should also make sure the sections aren't too large or the pin clips won't be able to hold the hair."
    },
    {
      "title": "Use a flat iron to curl the hair.",
      "content": "Use a flat iron to curl the hair. With the flat iron on the lowest setting, run it through the straight strand of hair. Wind the hair backwards away from your face so that the strand curls onto the flat iron. Do this slowly so that the hair curls. Keep the temperature of the flat iron low so that it doesn't melt your synthetic hair. [7] X Research source The curl doesn't have to be perfect. You're just getting a basic curl shape that you'll wind and pin to your head."
    },
    {
      "title": "Pin the curl to your head.",
      "content": "Pin the curl to your head. While the curl is still warm, wrap it tightly around your index finger. Gently slide the curl off of your finger and hold it between your thumb and index finger. The curl will look like a flat, circular twist of hair. Bring the curl to your scalp and pin it to your head using a small metal hair clip. [8] X Research source If you want the curls to hold longer, you can spray the curl with hair spray before you wrap and pin them."
    },
    {
      "title": "Pin the rest of your hair and let the curls sit overnight.",
      "content": "Pin the rest of your hair and let the curls sit overnight. Straighten, curl and pin the rest of your hair. You may find it easier to curl and pin the hair closest to your temples (if curling a weave). This will keep the hair out of your face. Once you've pinned all of your synthetic hair, let them rest in the pins overnight or at least for several hours. Remove the clips and run your fingers through the curls. [9] X Research source To get a more natural look, you can run your fingers in between curls to divide them and give your hair more body."
    }
  ]
}