{
  "url": "https://www.wikihow.com/Reset-Oil-Life-on-Honda-Civic",
  "title": "How to Reset Your Civic's Oil Life Indicator",
  "steps": [
    {
      "title": "Turn the electrical on by pressing the power button.",
      "content": "Turn the electrical on by pressing the power button. Do not suppress the brake like you normally would when you’re turning the vehicle on. Just hit the push-to-start button on its own to turn the auxiliary power on. On some models, you may need to press the button twice to do this. [1] X Research source This process will apply to most Honda models manufactured after 2018. If you’ve got a digital computer screen in your vehicle that displays maintenance info, this solution is probably for you. The oil reset process also depends on the trim package of the Civic, so you may need to use an older reset option even if you’ve got a 2018 or newer Honda."
    },
    {
      "title": "Press the Menu button.",
      "content": "Press the Menu button. On your steering wheel, locate the Menu button. It’s almost always going to be a little “i” to your left. This will open the settings for your vehicle on the computer screen. [2] X Research source"
    },
    {
      "title": "Press Enter and cycle until you hit the Maintenance screen.",
      "content": "Press Enter and cycle until you hit the Maintenance screen. The Enter button is normally on the right side of the steering wheel. Press Enter to open the menu options. Use the arrow buttons to scroll up and down through the options until you find Maintenance. Select this option with the OK button. [3] X Research source"
    },
    {
      "title": "Scroll through the options until you see Oil Life.",
      "content": "Scroll through the options until you see Oil Life. Use the arrow buttons to navigate up and down through the options in the Maintenance folder. Keep scrolling until you locate the Oil Life setting. [4] X Research source If you recently changed the oil and the Oil Life reads 100%, you don’t need to reset anything. You may want to reset the Oil Life if you want a more accurate reading because you suspect the current settings are off or if you changed the oil and the Oil Life doesn’t read 100%."
    },
    {
      "title": "Press the Enter button and confirm to reset the oil life.",
      "content": "Press the Enter button and confirm to reset the oil life. With the cursor on the Oil Life, press the Enter button. This will pull up the option to reset the oil life indicator. Press the Enter button and confirm that you want to reset the Oil Life. Then, start your car to get a fresh reading. [5] X Research source Depending on your trim options and model, you may need to press and hold the select button for 5-10 seconds. If you still see a problem with the oil, you have a check engine light on, or you’re getting a diagnostic alert for the oil life after resetting it, take your vehicle to the mechanic."
    },
    {
      "title": "Turn the power on but don’t crank the ignition.",
      "content": "Turn the power on but don’t crank the ignition. If you have a press-to-start button, press the button once or twice without depressing the brake pedal to turn the electrical on. If you have a traditional key, turn it to the “On” position. [6] X Research source This process applies to most of the mid-2010s Civic models that have a computer screen, but don’t use it to display diagnostic information. If you change your menu settings on the screen just above the steering wheel, this is probably your solution. If the display screen won’t respond, tap the brake pedal twice after turning the electrical on. On some Civics, you have to manually turn the digital screen on this way."
    },
    {
      "title": "Press and hold the “SEL/RESET” button until “Oil Life” starts to blink.",
      "content": "Press and hold the “SEL/RESET” button until “Oil Life” starts to blink. This button is usually on the bottom right of the steering wheel. On some models, it’s on a small knob in the bottom right behind the steering wheel. Once you’ve located the SEL/RESET button, press and hold it down until the Oil Life light or indicator begins to blink repeatedly. [7] X Research source"
    },
    {
      "title": "Press and hold the “SEL/RESET” button again to reset everything.",
      "content": "Press and hold the “SEL/RESET” button again to reset everything. Let the Oil Life indicator blink for a few seconds. Then, press and hold the SEL/RESET button again until the Oil Life indicator turns off entirely. You’ve now successfully reset the Oil Life. [8] X Research source On these older models, there may not be any percentage displayed anywhere. The Oil Life indicators will just pop on when it’s time for an oil change."
    },
    {
      "title": "Turn the electrical on.",
      "content": "Turn the electrical on. If you have a traditional key, turn the electrical on without cranking the engine all the way and leave the key in the “On” position. If you have a push-to-start model, press the button once or twice without pressing the brake pedal to turn the electrical on. [9] X Research source This process applies to the Honda Civics with no central computer screen on the console. If you’ve got a 2005-2010 with the limited features, this is probably the process for you."
    },
    {
      "title": "Press the Trip knob and find the Engine Oil Life percentage.",
      "content": "Press the Trip knob and find the Engine Oil Life percentage. Locate the Trip knob on your dashboard. It’s located under the odometer where it shows your mileage. Press that knob repeatedly until you see the oil life percentage pop up on your dash. [10] X Research source"
    },
    {
      "title": "Hold the Trip knob down until the system resets.",
      "content": "Hold the Trip knob down until the system resets. Press and hold the Trip knob until something happens. Either the Oil Life will immediately jump to 100%, or the system will blink as it resets. Once the Oil Life reads 100%, you’ve successfully reset it. [11] X Research source If you hold the Trip knob down when you’re on one of the mileage settings, you’ll just reset the trip distance, not the oil life."
    }
  ]
}