{
  "url": "https://www.wikihow.com/Repair-an-Underwire-Bra",
  "title": "How to Fix Your Bra’s Wire and Keep It from Poking through Again",
  "steps": [
    {
      "title": "Cut out a piece of moleskin or thick fabric.",
      "content": "Cut out a piece of moleskin or thick fabric. Use a pair of scissors to carefully cut out a 2-inch (5.08 cm) long rectangle of moleskin (also called medical gauze), soft canvas, or thick fabric. Cut and round the corners to prevent them from irritating your skin. If you’re using fabric, cut out a strip of fabric adhesive to the same size and adhere the sticky side of the adhesive to the fabric. [1] X Research source If you’re using fabric, choose a piece that's similar in color to your bra. That way, the patch can blend in better."
    },
    {
      "title": "Poke the wire back into the bra.",
      "content": "Poke the wire back into the bra. Find where the wire is sticking out of the edge of the bra. Poke the wire all the way back inside its sleeve, until you can’t see the wire. Where the wire was, there should be a small hole. [2] X Research source"
    },
    {
      "title": "Press the moleskin or fabric strip over the hole.",
      "content": "Press the moleskin or fabric strip over the hole. Place the strip with the sticky side down over the hole so that it bends over the edge of the bra. Smooth out the strip with your fingers to make sure it lies flat against the bra. [3] X Research source Spend some extra time smoothing the moleskin. The moleskin needs the heat from your skin to properly adhere to the fabric. If you’re worried about the moleskin or fabric patch coming off, use a needle and thread to fasten the edges to the bra. This fix should last a long time, but it’s best to hand wash your bra going forward to prevent the moleskin from peeling off."
    },
    {
      "title": "Thread a sturdy needle with upholstery thread and knot the end.",
      "content": "Thread a sturdy needle with upholstery thread and knot the end. Use a pair of scissors to cut a 6 to 8-inch (15.24 to 20.32 cm) piece of upholstery thread . Upholstery thread is meant to fix furniture, which makes it strong and sturdy enough to make your bra last longer. However, you can also double up on a thick sewing thread. Thread the needle and tie a simple knot . [4] X Research source"
    },
    {
      "title": "Duct-tape the end of the wire, then push it back into the hole.",
      "content": "Duct-tape the end of the wire, then push it back into the hole. Take a small piece of duct tape and wrap it around the end of the exposed wire. Push the wire all the way back in, until you can no longer see it. If the hole is larger, pull together each edge of the hole so that the edges meet."
    },
    {
      "title": "Sew the edges of the hole together with a whipstitch.",
      "content": "Sew the edges of the hole together with a whipstitch. With the edges together, poke the needle through one edge and pull it through. Circle the needle around to the other edge and push the needle straight through, directly under the first hole. Repeat the whipstitch all the way until you reach the other end of the hole. Make sure your stitches are close together to keep the wire from escaping. Make a knot. Sew a little bit farther than the hole on each side to help reinforce the edges."
    },
    {
      "title": "Apply nail polish or fabric glue to reinforce the stitching.",
      "content": "Apply nail polish or fabric glue to reinforce the stitching. Add a dab of nail polish or fabric glue to the top of the stitching and work it in with your fingers. Let the polish or glue dry, and your bra is fixed! [5] X Research source You can also use superglue instead of nail polish or fabric glue. This fix should last a while, but you can always add a little more nail polish after you handwash it to prevent the stitching from coming apart again."
    },
    {
      "title": "Check to make sure the bra is the right size.",
      "content": "Check to make sure the bra is the right size. If your bra is too small, it can ride up and cause the wire to eventually poke through. Buying a well-fitting bra from the beginning can reduce the chances of the wire poking out and irritating your skin. Before purchasing your next bra, use a measuring tape to measure your bra size . [6] X Research source If your bra fits correctly, the band should sit level around your ribcage without squeezing or riding up, the center of the bra should lie flat, and the straps should fit snugly without digging in. If you raise your arms with the bra on and it stays in place, that could be a sign that you’ve found a good fit for you."
    },
    {
      "title": "Hand wash your bra.",
      "content": "Hand wash your bra. Washing machines can wear out your bra faster and cause the underwire to bend, break, or poke through. The best way to wash a bra is to do it by hand. In a sink, bucket, or bathtub, soak your bra in a gallon of cold water with a tablespoon (14.17 g) of liquid laundry detergent for about 15 minutes. Rinse the bra, wring it out, then hang it up to dry. [7] X Research source If you still want to machine-wash your bra, try to wash it in a small load of laundry inside a lingerie bag on the delicate cycle."
    },
    {
      "title": "Remove the wire completely.",
      "content": "Remove the wire completely. If the wire keeps irritating you during the day, you can also take the wire out completely and make your bra wireless. Depending on the structure of your bra or your breast size, removing the wire may make your bra less comfortable or less supportive, but in most cases, they aren’t necessary. [8] X Research source If you want to try it out, use scissors to snip a small hole at the end of the wire casing and slide the wires out. If taking out the wire is more uncomfortable, carefully slip the wire back into the hole and stitch it closed, following the instructions in method 2. If your wire is broken in half and you want to keep the wire, buy a replacement . Use a pair of scissors to cut a small hole, slip out the broken wire, slide in the new wire, then sew the hole shut and seal it using nail polish or fabric glue."
    }
  ]
}