{
  "url": "https://www.wikihow.com/Focus-in-Life",
  "title": "How to Focus in Life",
  "steps": [
    {
      "title": "Understand what made you lose focus in the first place.",
      "content": "Understand what made you lose focus in the first place. Often people lose focus because they are working too hard or not hard enough. When you understand what led you to act a certain way and lose focus, you can react accordingly. Keep in mind why you aren't focused throughout reading this article. You know you best. If you analyze yourself, you can use the steps below according to how you think. [1] X Research source"
    },
    {
      "title": "Organize your life.",
      "content": "Organize your life. [2] X Research source lifehack.org/articles/productivity/how-organize-your-life-10-habits-really-organized-people.html You can't be clear on what you're doing unless you organize your thoughts. Think through what your goals are. Be very clear and deliberate in titling what is a goal to you. Think about the big picture when you organize your thoughts. Decide where you want to go physically, mentally, or even emotionally. But try to have a solid and tangible goal such as working or living in a particular place. Make sure that this goal is reasonable, however."
    },
    {
      "title": "Know your purpose for doing what you do.",
      "content": "Know your purpose for doing what you do. [3] X Research source If you want to work in a particular place, know why. Is it for money, happiness, or even for others? You can't focus unless you know exactly why you do what you do. If you said yes to a task or goal because you were afraid of disappointing or hurting someone, rethink your goal. Doing something because you want to avoid hurting another drains your energy. In some regards, you have to do what is best for you and not others."
    },
    {
      "title": "Trust other people to do things.",
      "content": "Trust other people to do things. Don't put the weight all on yourself to get somewhere. Absolutely focus on what you want to do and understand why, however know that you can't do everything. There are some jobs that others will volunteer to do and it's your job to let them do it . If there are tasks on your to do list that keep you from doing what you feel you really need to do, then let others know you need a hand. If they realize you trust them and think they're capable, others will step up and help you. If they aren't doing a good job at a task, then take a short amount of time to help them out with it. Just be sure not to criticize them but rather coach. They're helping you, not the other way around. [4] X Research source"
    },
    {
      "title": "Regularly make sure you know your priorities.",
      "content": "Regularly make sure you know your priorities. Understand what it most important to you reaching your ultimate goal. Every day set aside some time for yourself to jot down everything that's important for you to accomplish. Always stop and question why you're doing something and double check that it's an important thing for you to do. Never lose track of why you're doing a specific thing or else you will lose focus. [5] X Research source"
    },
    {
      "title": "Pace yourself and don't be afraid of distractions.",
      "content": "Pace yourself and don't be afraid of distractions. If you overwork yourself, you will eventually get tired and lose focus. Non-productive time is absolutely okay. In fact, you may find that non-productive moments in your life are priceless. Don't be afraid to go out with friends for a night or two. Don't make it a habit, but absolutely give yourself a break occasionally. [6] X Research source Creativity and focus demand you give yourself some breathing time. You can't let your creative juices flow if you're constantly working."
    },
    {
      "title": "Don't be afraid to ask others for advice.",
      "content": "Don't be afraid to ask others for advice. When you're taking the occasional break, tell your friend or family member what task you're finding difficult. Not only may you get some good ideas from them, but talking about it could also make the task at hand much easier for you to work around because you're in a creative atmosphere. Work is often a recited, repetitive task. Talking instills more freedom. By talking, you are giving yourself the freedom to converse your thoughts on a project and quite possibly come up with brand new and interesting ideas."
    },
    {
      "title": "Don't lose track of what you want.",
      "content": "Don't lose track of what you want. [7] X Research source Even though you want to distract yourself occasionally, don't make a habit of it. Keep a mindset in which you focus on your goals without burning yourself out. An underlying focus you should always have is maintaining or finding happiness. Finding a balance between work and distractions is ideal. Every day make sure you remember your motives to do what you do."
    }
  ]
}