{
  "url": "https://www.wikihow.com/Place-Your-Fingers-Properly-on-Piano-Keys",
  "title": "Piano Hand Placement: Proper Finger Position, Exercises & More",
  "steps": [
    {
      "title": "Sit on the edge of the piano bench.",
      "content": "Sit on the edge of the piano bench. The piano bench should be far enough away from the piano to allow you to sit on the front edge with your feet flat on the floor. Ideally, your legs will extend out from the piano bench with your knees at right angles (or slightly wider). [1] X Research source Your thighs shouldn't rest on the bench. If they are, you're seated too far back. You’ll use the piano’s pedals eventually, so your legs should be free to move forward enough to reach them. For now, rest your feet flat on the floor."
    },
    {
      "title": "Sit with tall posture to align your head and shoulders.",
      "content": "Sit with tall posture to align your head and shoulders. Proper posture will give you greater ability to reach all the keys as you play and keep you from developing back problems later on. Roll your shoulders back so that your shoulder blades fall in line alongside your spine. [2] X Research source Relax your neck and look straight forward. Hunching over the keys will limit the mobility of your hands as you play."
    },
    {
      "title": "Keep your elbows in front of you and your wrists raised above the keyboard.",
      "content": "Keep your elbows in front of you and your wrists raised above the keyboard. If your arms are in the correct position, your elbows are in front of your body. Your elbows should be bent slightly, with the inner elbow creases facing upward toward the ceiling. [3] X Research source Move the piano bench back a little if your elbows are by your sides. On the other hand, if you find that you're reaching straight out without any bend in your elbows, move the piano bench closer to the piano. Avoid sticking your elbows out. This can cause wrist problems as you start playing more often. Your forearms should be perpendicular to the piano keyboard. Keep your wrists relaxed to avoid strain and just about 1 in (2.5 cm) above the edge of the keys. This helps your fingers come down on the keyboard and improves your dexterity. [4] X Research source"
    },
    {
      "title": "Arch your fingers over the keys.",
      "content": "Arch your fingers over the keys. You want to play the piano with the tips of your fingers. While your thumb should be straight, the rest of your fingers should curve loosely over the keys, as though you're holding a ball. [5] X Research source If necessary, you can practice the correct position by holding a tennis ball in your hand. The way your fingers curl around the ball is the way they should curve over the keys. Let your fingertips come down approximately in the center of the white keys (near where the shorter black keys begin). [6] X Research source"
    },
    {
      "title": "Relax your arms and shoulders.",
      "content": "Relax your arms and shoulders. Tensing your arms or shoulders can cause strain. You may want to shake out your arms a bit and do basic stretches for your arms and back to loosen up your muscles before you sit down to play. [7] X Research source As you play, check your posture periodically and release any tension in your arms or shoulders. After some time, a relaxed posture will become automatic."
    },
    {
      "title": "Let your arms and elbows follow your fingers.",
      "content": "Let your arms and elbows follow your fingers. As you move your hands up and down the keyboard, keep your arms more or less perpendicular to your hands and think about moving your elbows in a smooth, fluid motion. This avoids twisting and excessive strain on your wrists. [8] X Research source Think about using the bigger muscles in your arms, and even in your back, to press the keys, rather than simply your fingers."
    },
    {
      "title": "Keep your fingernails trimmed short.",
      "content": "Keep your fingernails trimmed short. If you plan to play piano frequently, long nails will get in the way of proper hand position. Long nails also click on the keys, which can be distracting while you’re playing a song. [9] X Research source Aim to keep your nails short enough that you can easily feel the piano key with the entire “pad” of your fingertips."
    },
    {
      "title": "Number your fingers from 1 to 5, beginning with the thumbs.",
      "content": "Number your fingers from 1 to 5, beginning with the thumbs. All piano sheet music uses the same universal numbering for the fingers and thumb on each hand. If you memorize the number for each finger, you'll be able to read finger positioning notations quickly. [10] X Research source The numbering starts with your thumb at number 1 and goes to your pinky finger at number 5. The left hand is a mirror image of the right hand, using the same numbers for the same fingers."
    },
    {
      "title": "Identify middle C on the keyboard.",
      "content": "Identify middle C on the keyboard. Middle C (also called C4) is in the center of the keys and is a point of reference for where you are on the keyboard. It’s also the note that bridges the treble clef and bass clefs. To find any C note, look for a group of 2 black keys next to each other (black keys come in groups of 2 or 3). The white key immediately to the left of the first black key in a group of 2 black keys is a C. On a full-size, 88-key piano, middle C is the 4th C from the left. On smaller keyboards or pianos, middle C is usually the 3rd C from the left. [11] X Research source"
    },
    {
      "title": "Play middle C with your right thumb (1).",
      "content": "Play middle C with your right thumb (1). Let your other fingers on your right hand naturally fall on the white keys to the right of your thumb (2 is on D, 3 is on E, 4 is on F, and 5 (your pinky) is on G). This is the natural five-finger placement for the right hand. [12] X Research source Your left thumb is supposed to sit on middle C as well. However, if you're playing with both hands, you'll move your left hand over a key rather than trying to play middle C with both thumbs. When your left thumb is on middle C, you’ll place 2 on B, 3 on A, 4 on G, and 5 (your pinky) on F."
    },
    {
      "title": "Use your 2nd, 3rd, and 4th fingers to play the black keys primarily.",
      "content": "Use your 2nd, 3rd, and 4th fingers to play the black keys primarily. The black keys (keys that play sharp or flat notes) are shorter and set deeper into the keyboard, so use your longest fingers to play them. Flatten your fingers out slightly so that you can reach them more easily. This way, you don't have to move your hands forward and back over the keys and can keep them in the same place they would be when you were playing the white keys. [13] X Research source All 5 of your fingers (including the thumb and pinky) can play the white keys. However, it’s very rare that you’ll need your thumb or pinky to play a black key since that can lead to some awkward fingering combinations."
    },
    {
      "title": "5-finger exercise 1: Play 5-note pattern in contrary motion.",
      "content": "5-finger exercise 1: Play 5-note pattern in contrary motion. Contrary motion means your hands are moving in opposite directions (away or toward each other) on the keyboard. Playing in contrary motion is a great exercise for feeling out the 5-finger position and learning to play with the same fingers in each hand. To get comfortable in this position, try this exercise: [14] X Research source Place your right thumb on middle C and keep your left thumb hovering just to the left. Play C with your right thumb (1), then place your pointer fingers (2) on the keys immediately to the right and left of C. Keep playing one note at a time in both hands (your right hand notes getting higher, your left hand notes getting lower) until you reach your pinkies, then return to middle C. In this exercise, the finger pattern in both hands will be 1-2-3-4-5-4-3-2-1. After you’re comfortable playing the white keys, try adding some black keys for your 2nd, 3rd, and 4th fingers to play."
    },
    {
      "title": "5-finger exercise 2: Play 5-note patterns in parallel motion.",
      "content": "5-finger exercise 2: Play 5-note patterns in parallel motion. Parallel motion means your hands and fingers are moving in the same direction on the keyboard. Unlike the contrary motion exercise, this drill teaches you to play the same sequence of notes in each hand which means you won’t be using the same fingers at the same time. To do this exercise: [15] X Research source Place your right thumb (1) on middle C and your left pinky (5) on the C an octave lower (1 C to the left of middle C). Play both Cs at once, then place your next finger (4 in the left hand and 2 in the right hand) on the next note, D. Keep stepping up one note at a time until your left hand reaches your thumb (1) and your right hand reaches the pinky (5), then reverse direction and return to your starting notes. In this exercise your right hand will play 1-2-3-4-5-4-3-2-1, while your left hand will play 5-4-3-2-1-2-3-4-5. After you’re comfortable playing the white keys, try adding some black keys for your 2nd, 3rd, and 4th fingers to play."
    },
    {
      "title": "5-finger exercise 3: Skipping fingers within the 5-finger position.",
      "content": "5-finger exercise 3: Skipping fingers within the 5-finger position. Once you’re comfortable playing 5 adjacent notes in a row without looking down at the keyboard very often, it’s time to try playing larger intervals (music doesn’t always just move step by step!). This exercise can be played in contrary or parallel motion: Contrary motion: Start with your right thumb (1) on middle C and your left thumb just to the left. Slowly in both hands, play the following finger pattern: 1-3-2-4-5-3-4-2-1. You’ll play the same fingers at the same time, resulting in a mirrored pitch pattern. Parallel motion: Put your right thumb (1) on middle C and your left pinky (5) on the next C to the left. In your right hand, play 1-3-2-4-5-3-4-2-1. Your left hand will play 5-3-4-2-1-3-2-4-5. This results in the same pitch pattern (just an octave apart)."
    },
    {
      "title": "Pass your thumb under your other fingers to move upward in the right hand.",
      "content": "Pass your thumb under your other fingers to move upward in the right hand. To move your hand upward beyond 5 keys, cross your thumb under your pointer, middle, or ring finger to rest on the next key up. Practice this movement with scales until it becomes habit. [16] X Research source In your left hand, cross your thumb under your fingers as you play lower on the keyboard. (Remember, your hands mirror each other.)"
    },
    {
      "title": "Cross your fingers over your thumb to move downward in the right hand.",
      "content": "Cross your fingers over your thumb to move downward in the right hand. When you’re playing a descending passage in the right hand and reach your thumb, cross your ring, middle, or index finger over your thumb and onto the next key to continue. Think of this like the reverse motion of crossing your thumb underneath as you play higher. In the left hand, cross your fingers over your thumb as you play higher on the keyboard. [17] X Research source"
    },
    {
      "title": "Learn major and minor scales with proper fingering.",
      "content": "Learn major and minor scales with proper fingering. Scales are one of the basic building blocks of music, and if you practice scales with proper fingering, your fingers will automatically know where to go when you see parts of a scale in a piece of music. [18] X Research source Many scales share fingering patterns with each other, meaning not every scale has unique fingerings. For example, the following fingerings are used for the C, D, E, G, and A major scales: [19] X Research source LH: 5-4-3-2-1-3-2-1 RH: 1-2-3-1-2-3-4-5 For a full list of piano scale fingerings, look at the major scales and minor scales from PianoScales.org. Keep in mind that fingers are not notes. For example, just because you start playing middle C with your right thumb doesn't mean your right thumb will always play middle C. Notice you mainly use your fifth finger for starting or ending a scale. Generally, your pinky is weakest and will be the least used finger on your hand."
    },
    {
      "title": "Find the most comfortable fingering for arpeggios.",
      "content": "Find the most comfortable fingering for arpeggios. Arpeggios, or broken chords, typically have standard fingerings. Depending on the notes in the chord, that standard fingering may not work for you. If it's more comfortable for you to use different fingers, do so—just make sure you're consistently using the same fingers every time and that the arpeggios sound even. [20] X Research source For example, the standard fingering for a C major arpeggio going up in the right hand is 1-2-3 1-2-3 etc. However, if stretching your fingers to every other key is uncomfortable, you could try 1-2-4 1-2-4 instead. For a full list of standard arpeggio fingers, check out this arpeggio fingering chart . Practicing arpeggios is a good way to memorize basic chords up and down the keyboard."
    },
    {
      "title": "Adapt standard fingerings for your own hands.",
      "content": "Adapt standard fingerings for your own hands. You may find fingering notations already printed in sheet music, and this can be a good place to start when you're learning a new song. However, standard fingerings don't necessarily work for all hands. [21] X Research source For example, if you have small hands, you may find it's easier to pass your thumb under just your index and middle finger when you need to move your hand up. If you change the standard fingering, make sure you keep it consistent and mark it in your music. If you switch up the fingering within the same piece, you won't develop muscle memory for that song and may find yourself making more errors. The exception is for scales. These should follow the standard fingering patterns the vast majority of the time."
    },
    {
      "title": "Try to keep your left and right hand motions symmetrical.",
      "content": "Try to keep your left and right hand motions symmetrical. Your left and right hands are mirror images of each other, even if they're moving in different directions or playing different patterns. Try to arrange your fingering so that you're using the same fingers at the same time or shifting hand position simultaneously, when possible. [22] X Research source For example, when playing arpeggios in contrary motion, it’s helpful to use a pattern like 1-2-4 in both hands. This lets you mirror your fingers and cross your thumb under at the same times. It will become easier to play more complex pieces of music if you can maintain this symmetry in your fingering. When your hands are in sync, the music will flow more naturally."
    },
    {
      "title": "Write your fingerings on your sheet music.",
      "content": "Write your fingerings on your sheet music. Especially when you're just starting to learn piano, writing down the number of the finger that will play each note enables you to progress more quickly. [23] X Research source Writing in fingerings helps reinforce consistent fingering while you practice and can help you memorize music, too. After you've played for a while and recognize common musical patterns, writing down fingerings may start to feel less necessary. However, keep this practice in mind for extremely complex pieces."
    }
  ]
}