{
  "url": "https://www.wikihow.com/Be-Chivalrous-on-a-Date",
  "title": "10+ Chivalrous Ways to Charm Her on a Date",
  "steps": [
    {
      "title": "Don’t just ask your date to hang at your house.",
      "content": "Don’t just ask your date to hang at your house. Instead, make dinner reservations, pick out a hiking train, or research a fun museum exhibit to go to. [1] X Expert Source Erika Kaplan Relationship Advisor Expert Interview. 1 October 2020. Put in effort to show your date that you actually thought about fun things for you two to do together. [2] X Research source It’s considered polite for the person who asks for the date to do the planning."
    },
    {
      "title": "A text is fine, but a phone call feels more chivalrous.",
      "content": "A text is fine, but a phone call feels more chivalrous. [3] X Expert Source Erika Kaplan Relationship Advisor Expert Interview. 1 October 2020. Instead of texting your date “wyd later,” give them a ring to see when they’re free. It might feel a little scarier, but it’s a nice way to show your date that you care. [4] X Research source If your date doesn’t answer, feel free to leave them a message."
    },
    {
      "title": "Don’t just text or honk your horn.",
      "content": "Don’t just text or honk your horn. [5] X Expert Source Erika Kaplan Relationship Advisor Expert Interview. 1 October 2020. If you’re picking your date up from their home, head on up and knock on the door when you arrive. It will make them feel like you really care, and you’ll start your date out on the right foot. [6] X Research source If your date lives with other people, be prepared to quickly meet their parents or roommates before you head out for the night."
    },
    {
      "title": "You can hold the car door and any other doors you encounter.",
      "content": "You can hold the car door and any other doors you encounter. Get ahead of your date by a few steps, then swoop in and hold the door open for them. This classic chivalrous act will make them feel appreciated, and it’s a nice way to show your date respect. [7] X Research source There may be a few times when you can’t grab the door in time, and that’s okay! Chivalrous acts are great to aspire to, but don’t beat yourself up if you can’t do them all."
    },
    {
      "title": "That way, they won’t get soaking wet.",
      "content": "That way, they won’t get soaking wet. If you show up to your date spot and it’s starting to rain, shake out your umbrella and hold it over your date. Feel free to huddle under the umbrella too, but make sure they’re not getting soaked! [8] X Research source You could also drop your date off closer to the door and then park the car. That way, they don’t have to walk through the rain if they don’t need to."
    },
    {
      "title": "Before you sit down, step behind your date and grab their coat.",
      "content": "Before you sit down, step behind your date and grab their coat. You can either hang it on a coat rack nearby or place it on the back of their chair. If their coat is wet, try to put it somewhere it can dry off while you two enjoy each other’s company. [9] X Research source If you aren’t sure how to go about this, try asking your date, “Can I help you with your coat?” That way, they know what you’re doing."
    },
    {
      "title": "Offer them a seat at the table before you sit down.",
      "content": "Offer them a seat at the table before you sit down. When they sit, gently push them in so they’re comfortable. After that, you can head to your own seat and sit down. [10] X Research source If your date sits down before you have a chance to pull out their chair, it’s okay. This is a nice chivalrous act, but it’s not the end of the world if you don’t get to it."
    },
    {
      "title": "Give your date your full attention while you two are together.",
      "content": "Give your date your full attention while you two are together. Keep your phone on silent and put it in your pocket or your bag so you aren’t tempted to look at it. Make eye contact with your date and really listen to them as they talk so you two can make a connection. [11] X Research source If you need to keep your phone on for emergencies, put it on vibrate. Then, explain to your date what’s going on if you need to take a phone call or check a quick text. Reader Poll: We asked 772 wikiHow readers, and only 7% of them said the best way to make your partner feel more respected is being on time . [Take Poll] While being on time is important, listening and communicating can be better ways to be chivalrous and respectful."
    },
    {
      "title": "It isn’t a necessity, but it will make you look good.",
      "content": "It isn’t a necessity, but it will make you look good. When the check comes, offer to pick up the tab. Your date might want to pay for it or even offer to split it—it’s up to you whether or not you want to pay in full or let them help out. In general, though, it’s nice to at least offer up your money at first. [12] X Research source A common misconception is that men always have to pay for a date when they’re out with a woman. This isn’t the case at all, and you and your date can decide with each other about who wants to pay for what."
    },
    {
      "title": "If the sun goes down, your date might get chilly.",
      "content": "If the sun goes down, your date might get chilly. If you notice them start to shiver, shrug off your jacket and give it to them. They’ll feel more comfortable, and you two can probably keep hanging out for longer. [13] X Research source This is a fun way to be chivalrous if you’re taking a nature walk or going stargazing."
    },
    {
      "title": "Drop them off or have them text you when they get home.",
      "content": "Drop them off or have them text you when they get home. If you two arrived separately, make sure they get to their car or find a safe ride home. If you picked them up, walk them to their door and wait until they get inside to leave. [14] X Expert Source Erika Kaplan Relationship Advisor Expert Interview. 1 October 2020. You’ll make them feel safe, and they’ll appreciate that you care for their wellbeing. [15] X Research source If you walk your date to their door, don’t ask if you can come inside. It’s fine if they invite you in, but it can seem a little presumptuous to assume you’re going inside."
    },
    {
      "title": "Have them delivered to their home address.",
      "content": "Have them delivered to their home address. It’s always nice to get an unexpected gift, and it’s a sweet way to let your date know you had a good time. Call up a florist near you and get them to deliver a beautiful bouquet with a sweet note attached. [16] X Research source This isn’t totally necessary, but it will make your date feel good!"
    }
  ]
}