{
  "url": "https://www.wikihow.com/How-Long-to-Wait-to-Meet-Someone-You-Met-Online",
  "title": "How Long Should You Wait to Meet Someone You Met Online? Rules for Dating Apps & More",
  "steps": [
    {
      "title": "Three weeks is the sweet spot for switching from online to offline.",
      "content": "Three weeks is the sweet spot for switching from online to offline. Studies show you have the best chances of happiness if you talk to someone online for about 3 weeks before you meet in person. Wait any longer, and reality might not match your expectations, leading to disappointment. [1] X Research source People naturally present their best side in their dating profiles. Getting only this information can lead you to form an idealistic impression of the person in your mind. The longer you talk to that person online, the stronger that impression becomes. If you and the other person meet when your impression is still fluid, you can adjust your idea of them more easily. At the same time, you know enough about them that the first time meeting them doesn't feel like meeting a complete stranger."
    },
    {
      "title": "There's no reason to wait if you really click with someone.",
      "content": "There's no reason to wait if you really click with someone. It's absolutely possible (if not common) that you'll meet someone online and instantly feel a strong connection. You both feel the same way and want to meet right away. Typically, you'll find you have a lot in common pretty quickly and feel like you're both on the same wavelength. Deciding to move your relationship offline within a few days of meeting is more common if you find that the two of you have friends in common or run in some of the same circles. For example, you might say, \"I can't believe we haven't just run into each other before!\" At the same time, be cautious if the other person is pressuring you to meet up immediately and you're not comfortable with that. If the feeling's mutual, you'll know, but being pressured into an early meeting is a red flag. [2] X Research source"
    },
    {
      "title": "You learn more about someone if you get them talking.",
      "content": "You learn more about someone if you get them talking. Closed questions that can be answered \"yes\" or \"no\" don't really tell you much about someone or give you any way to advance the conversation. Instead, encourage the other person to open up and share stories about their life. [3] X Research source People tend to feel that they are unique, so they like it if you personalize your message so it seems as though you could only write it to them. For example, you might reference something in their profile directly and ask them about it: \"I see that you enjoy running. Were you in the 5k here last week?\" You might also ask questions based on the values someone lists in their profile. For example, you might say, \"I know that family is important to you. Tell me about one of your favorite experiences with your family.\""
    },
    {
      "title": "Dig into one topic rather than bouncing between subjects.",
      "content": "Dig into one topic rather than bouncing between subjects. Ask the person questions, then ask follow-up questions based on their answers. This allows you to get to know them on a deeper level. [4] X Expert Source Lisa Shield Dating Coach Expert Interview. 13 December 2018. For example, suppose you ask the person if they have any siblings, and they say they have 2 sisters. From there, you might ask them about their sisters, how old they are, what kind of relationship they had when they were kids, if they're close now, and how often they see each other. You can also use their answers to springboard to another topic really organically. For example, if they say one of their sisters plays softball, you could continue asking about their sister or you could ask them if they play any sports."
    },
    {
      "title": "Make sure you're both on the same page before you get too involved.",
      "content": "Make sure you're both on the same page before you get too involved. If you're looking for a long-term romantic relationship, let the person know as soon as possible after you start talking. If the other person is more interested in something casual, it might be better to let them move on than to meet up with them. [5] X Expert Source Sarah Schewitz, PsyD Licensed Clinical Psychologist Expert Interview. 15 April 2019. Some people say they're only interested in something casual because they don't want to scare others off. But good relationships are founded on open and honest communication, so it's best to be open from the beginning about what you want."
    },
    {
      "title": "Most people text or chat off the dating site before meeting.",
      "content": "Most people text or chat off the dating site before meeting. Exchanging numbers so you can text directly or using another messaging app might feel as though you've progressed in your relationship. Essentially, you like and trust this person at least enough to give them your phone number. [6] X Research source Typically, you'll want to have several conversations with the person before you jump to this level—but you still might've only talked to them for a couple of days."
    },
    {
      "title": "People who are demanding or controlling online might be even worse in person.",
      "content": "People who are demanding or controlling online might be even worse in person. Even after you start talking to someone online, remind yourself that they're still a stranger to you. As much as you might think you know them, anyone can say anything they want online. Be wary if you notice any of the following: [7] X Research source They contradict themselves or change their story several times. At best, this means they're lying to you. If they can't be honest with you before you even meet in person, what does that say for the future? You can't verify much, if any, information about them. It's unlikely that someone you meet online has no digital footprint. If you can't find them anywhere else online, they could be using a false identity to try to scam you or hurt you. They seem too good to be true. Someone who seems like they agree with everything you say and check every box on your \"ideal significant other\" checklist might be hiding something. Nobody's perfect, and while they might just be trying to impress you, they might also be trying to lure you into an abusive relationship. They start rattling off a checklist of traits they expect in a future partner. Everyone has their preferences, but a long list of demands could mean that they're controlling or will try to change you. [8] X Research source"
    },
    {
      "title": "Use their social media to learn more about who they are.",
      "content": "Use their social media to learn more about who they are. If the person uses their real name on the dating app or site where you met them, a quick online search should pull up their social media accounts as well. Otherwise, you might ask them if they'd be willing to connect with you on social media. [9] X Research source It's not necessarily a red flag if the person doesn't want to connect to you on social media right away—remember, you're a stranger to them too. They're also entitled to protect their privacy. If you do gain access to their social media, check out their posts and the comments and likes. Do they seem to have several friends who know them in real life and comment regularly? That typically indicates that they're a real person with a normal social life. Click through their friends as well. Even if you can't see much of these people's accounts, you should be able to get a sense of the person's different social circles. For example, they might have some friends they went to school with and some others that they work with. In addition to confirming that you're talking to a real person, you can also use their social media to find out a little more about their likes and dislikes, background, hobbies, and interests. All of this gives you more stuff to talk to them about."
    },
    {
      "title": "A video call lets you observe the person's body language and demeanor.",
      "content": "A video call lets you observe the person's body language and demeanor. Through a video call, you get a lot more information about someone than just what they're saying. It also gives you a chance to see the person live and confirm that they're the same person shown in their profile pictures. [10] X Research source Video calls also allow you to have more nuanced conversations. You can introduce more humor because the other person can see you and hear your tone of voice. After a video call, you'll also have a better idea of how to read the person's texts to you. Because you know how they generally talk, you can understand more about their tone and how to take their messages. It can help you decide if you want to meet them in person or not."
    },
    {
      "title": "Wear clean, casual clothes that fit you well.",
      "content": "Wear clean, casual clothes that fit you well. When you're meeting someone for the first time, the way you dress tells the person how much you care about the meeting. If you put some effort into your appearance, it shows that this date is important to you. [11] X Expert Source Lisa Shield Dating Coach Expert Interview. 13 December 2018. For example, if you're a masculine-presenting person, you might wear well-fitting dark-wash jeans and a pressed button-up shirt. If you're a feminine-presenting person, a casual skirt or dress is always a good option. Choose something comfortable that you can easily move around in without worrying about a \"wardrobe malfunction,\" especially if you have something more active planned for your first date."
    },
    {
      "title": "Keeping the meeting short and sweet takes some pressure off.",
      "content": "Keeping the meeting short and sweet takes some pressure off. Generally, plan something that won't take more than an hour. More open-ended excursions can get awkward, especially if sparks don't fly as you thought they would. A short date is also safer because you have an easy out if things start to go south. [12] X Research source For example, you might make plans to see a small local art exhibit together that only takes about 20 minutes to walk through. Stick to the time limit for the first meeting to set your boundaries. If you want to continue to see the person, make plans to meet up again instead of extending your initial meeting. You'll end on a high note and look forward to seeing each other again. Even a basic, rather open-ended date like meeting up for coffee can be brief if you tell the other person from the outset that you have something to do at a specific time. For example, if you meet on your lunch break, that means you have to go back to work."
    },
    {
      "title": "Go for a walk rather than just grabbing coffee.",
      "content": "Go for a walk rather than just grabbing coffee. If you get moving, conversation will be more natural and you can talk about the things you see around you. Just sitting in a café can feel unnatural and awkward. [13] X Expert Source Lisa Shield Dating Coach Expert Interview. 13 December 2018. This doesn't mean you can't go with the stand-by coffee date—but get your coffee and go for a walk around the block rather than just sitting there. You might consider a more organized activity, such as mini-golf, as well. But activities like that are usually better for future dates unless it's something you do often and feel really comfortable with."
    },
    {
      "title": "Think of the first date as a test to see if there will be a second.",
      "content": "Think of the first date as a test to see if there will be a second. If you decide you are interested in the person, and the feeling seems mutual, go ahead and make plans to see each other again. It's usually best to do this before the first date ends. [14] X Research source For example, you might say, \"There's a special showing of that movie we were talking about next Thursday. Do you want to go with me?\" If you were playing a game or doing something active, you might playfully suggest a rematch. For example, you might say, \"I can't believe you beat me—must be beginner's luck. Care for a rematch on Saturday?\" Maintain your texting relationship in between the two dates. Generally, it's a good sign if you're naturally texting each other at about the same frequency after the first date that you were before. Reader Poll: We asked 735 wikiHow readers, and 52% of them agreed that they decide how long to wait between the first and second dates based on the level of connection and chemistry they feel on the first date . [Take Poll]"
    }
  ]
}