{
  "url": "https://www.wikihow.com/Get-120-Fps-on-Ps5",
  "title": "How to Play Games at 120FPS and 120Hz on a PlayStation 5",
  "steps": [
    {
      "title": "A PS5.",
      "content": "A PS5. This console is still hard to find, but you'll get access to higher framerates and quicker load times. Make sure to set up your PS5 properly."
    },
    {
      "title": "A TV or monitor that supports 120hz and 120FPS.",
      "content": "A TV or monitor that supports 120hz and 120FPS. Most older TVs and monitors can only support 60FPS, so make sure you have a newer display that supports higher framerates."
    },
    {
      "title": "An HDMI 2.1 cable.",
      "content": "An HDMI 2.1 cable. This is what allows your PS5 to display the images at a higher resolution. [3] X Research source You should have received an HDMI 2.1 cable with your PS5. If you don't have it, you'll need to order a replacement HDMI 2.1 cable."
    },
    {
      "title": "A supported PS5 game.",
      "content": "A supported PS5 game. Not all PS5 games support 120 FPS, so you'll need to make sure you're trying to play a game that supports it. [4] X Research source Here's a list of games that currently support 120 FPS: Apex Legends Borderlands 3 Bright Memory: Infinite Call of Duty: Black Ops Cold War Call of Duty: Modern Warfare 2 Call of Duty: Vanguard Call of Duty: Warzone 2.0 Cyber Shadow PS5 Destiny 2 PS5 Devil May Cry 5: Special Edition DIRT 5 DOOM Eternal F1 2021 F1 22 Fortnite Ghostrunner Ghostwire: Tokyo God of War Ragnarök JUMANJI: The Video Game Knockout City Monster Boy and the Cursed Kingdom Neon White OlliOlli World Overwatch 2 Quake Shinorubi The Nioh Collection The Touryst Tom Clancy's Rainbow Six: Siege Tony Hawk's Pro Skater 1 + 2 Uncharted: Legacy of Thieves Collection WRC 9 Ys VIII: Lacrimosa of Dana"
    },
    {
      "title": "Turn on your PS5.",
      "content": "Turn on your PS5. You'll be taken to your main dashboard. Your PS5 must be in Performance Mode to enable 120 FPS."
    },
    {
      "title": "Go to Settings.",
      "content": "Go to Settings. This can be found in the top-right corner."
    },
    {
      "title": "Select Save Data and Game/App Settings.",
      "content": "Select Save Data and Game/App Settings . This will be underneath Accessories ."
    },
    {
      "title": "Select Game Presets.",
      "content": "Select Game Presets . You can find this header on the left side."
    },
    {
      "title": "Select Performance Mode or Resolution Mode.",
      "content": "Select Performance Mode or Resolution Mode . A pop-up menu will open with the options: Game Default , Performance Mode , and Resolution Mode . [5] X Research source"
    },
    {
      "title": "Select Performance Mode.",
      "content": "Select Performance Mode . You'll now see the option to select 120 FPS in supported games. Make sure your video output is set to Automatic 120 Hz Output . To check, go to your PS5's Settings → Screen and Video → Video Output → 120 Hz Output → Automatic . [6] X Research source If you don't see this option, your display does not support 120Hz output."
    },
    {
      "title": "Launch a supported game.",
      "content": "Launch a supported game. You'll only be able to get 120 FPS on your PS5 with supported games. Use this method if your game does not automatically switch to 120 FPS after enabling Performance Mode."
    },
    {
      "title": "Go to your game's settings.",
      "content": "Go to your game's settings. This will vary depending on the game. In most cases, this will look like a cog icon."
    },
    {
      "title": "Select the \"Video\" or \"Graphics\" tab.",
      "content": "Select the \"Video\" or \"Graphics\" tab. You'll see options regarding your in-game graphics."
    },
    {
      "title": "Toggle on 120FPS Mode.",
      "content": "Toggle on 120FPS Mode . Click the switch, arrow, or bubble in the option for 120FPS Mode or similar. This will enable 120 FPS on your supported game."
    },
    {
      "title": "Confirm your TV or monitor supports 120Hz.",
      "content": "Confirm your TV or monitor supports 120Hz. Do this by opening your PS5's Settings . Go to Screen and Video → Video Output → Video Output Information . Locate 120Hz . If this isn't on the list underneath the Information for the connected HDMI device header, your display does not support a 120Hz refresh rate. You'll need to buy a new TV or computer monitor."
    },
    {
      "title": "Restart your PS5.",
      "content": "Restart your PS5. Try to turn off your PS5 , wait a few minutes, then turn it back on. Check that your settings are still correct, then launch a supported game. [7] X Research source"
    },
    {
      "title": "Unplug your HDMI and reconnect it.",
      "content": "Unplug your HDMI and reconnect it. Sometimes your ports may be clogged with dust and debris. Unplug your cable, dust your display, then plug it back in. [8] X Research source"
    },
    {
      "title": "Ensure your HDMI is in the correct port.",
      "content": "Ensure your HDMI is in the correct port. With some displays, there is a designated HDMI for specific settings. [9] X Research source Check the back of your display and look for a 120Hz label. If your HDMI is not in the correct port, switch it over."
    }
  ]
}