{
  "url": "https://www.wikihow.com/Get-Playdough-Out-of-Carpet",
  "title": "The Best Ways to Remove Playdough from Carpets & Rugs",
  "steps": [
    {
      "title": "Allow the playdough to dry completely.",
      "content": "Allow the playdough to dry completely. Leave the playdough to dry for several hours before attempting to remove it from the carpet. Once the playdough feels hard to the touch, you'll know it has dried completely. This may seem counterintuitive, but stiff, dry playdough will be much easier to loosen from the carpet fibers than soft, gooey playdough. [1] X Research source While your instinct may be to immediately apply hot water and soap to the stain, you must resist the urge! Applying heat will only cause the playdough to melt further into your carpet. If the playdough stain is in a high-traffic area of your home such as a hallway, consider placing an empty cardboard box over the stain. The box will keep people from accidentally stepping on the playdough as it dries, which would push the playdough further into the carpet and make it more difficult to remove."
    },
    {
      "title": "Consider freezing the playdough for faster results.",
      "content": "Consider freezing the playdough for faster results. Hold a can of compressed air 2 to 3 inches (5.1 to 7.6 cm) away from the carpet and spray the playdough stain for 10 to 15 seconds. Freezing the playdough is a great alternative to allowing it to dry naturally if you are pressed for time. Freezing the playdough with cold air will create the same hardening effect as allowing it to dry with less time. [2] X Research source Cans of cold air can be purchased at most auto parts stores. The playdough will eventually look frosted over and frozen when it is ready to be removed. Keep your fingers away from the cold air as you spray! This air is very cold and could cause freeze burns if it touches your skin. Practice extreme caution and follow any safety directions listed on the can."
    },
    {
      "title": "Use a brush or knife to gently scrape it away.",
      "content": "Use a brush or knife to gently scrape it away. Use a carpet brush or butter knife to begin chipping away the hardened playdough from your carpet. Scrape or brush repeatedly in the same direction to loosen the dried playdough from the carpet fibers. [3] X Research source Avoid using a circular motion with your brush as it could force the playdough further into the carpet. Use a dull knife or butter knife only. A sharper blade could damage the fibers of your carpet."
    },
    {
      "title": "Vacuum up any removed pieces as you work.",
      "content": "Vacuum up any removed pieces as you work. Use a vacuum to remove loosened pieces of playdough from your carpet as you work. As soon as playdough has been unstuck from the carpet it should be disposed of immediately. If you skip this step and continue rubbing to remove additional pieces, you will run the risk of pushing removed pieces back into the carpet, which would negate all of your hard work! [4] X Research source Alternate scraping and vacuuming until as much of the playdough is removed as possible."
    },
    {
      "title": "Apply rubbing alcohol to a paper towel and gently blot the carpet.",
      "content": "Apply rubbing alcohol to a paper towel and gently blot the carpet. Pour a small amount of rubbing alcohol onto a clean paper towel and blot the playdough stain gently to loosen any remaining residue. Make sure you only blot the stain, as rubbing could make it worse. Switch to a clean spot on your paper towel in between blots so that you do not spread the playdough stain as you clean. Rubbing alcohol could damage the adhesive on the backing of the carpet, so do not pour it directly onto the carpet. Transfer only a small amount to the surface of the carpet using a paper towel or towel. Test the alcohol on your carpet in an inconspicuous spot, like under a table or on the edge of the room, before applying it to the playdough stain to make sure that it doesn’t damage your carpet."
    },
    {
      "title": "Use hydrogen peroxide for stubborn stains on white carpets.",
      "content": "Use hydrogen peroxide for stubborn stains on white carpets. Apply a small amount of hydrogen peroxide to the stain with a clean paper towel. Blot the stain gently until the remaining playdough residue is removed. Hydrogen peroxide will also effectively remove any discolorations caused by the playdough but should only be used on white carpet. Hydrogen peroxide could bleach carpets with color or patterns. You can also use a stain remover such as Resolve to treat stubborn playdough stains."
    },
    {
      "title": "Apply some mild soap to the stain.",
      "content": "Apply some mild soap to the stain. Remove your cleaning solution and any remaining playdough residue with soap. Apply a small amount of mild soap to a paper towel and gently blot the carpet. Make sure that your soap does not contain bleach, which could cause discoloration."
    },
    {
      "title": "Wash away the soap with cold water.",
      "content": "Wash away the soap with cold water. Use a spray bottle full of cold water to wet the area, then remove the soap by blotting the carpet with a clean towel. Only spray a thin layer of water over the carpet at a time. You don’t want to soak your carpet, as this could cause water damage to the subflooring underneath. Instead, apply several thin layers of water, blotting with a paper towel in between sprays, until all the soap has been removed. Make sure to use cold water! Warm water could cause any remaining playdough to melt back to your carpet fibers."
    },
    {
      "title": "Cover the spot with paper towels and add pressure to dry the carpet.",
      "content": "Cover the spot with paper towels and add pressure to dry the carpet . Remove all water from your carpet by applying a layer of clean paper towels or a regular towel to the area you’ve just been cleaning. Press the paper towels down into the carpet to soak up the water. Consider placing a heavy book or block on top of the towels for a couple of hours to help them soak up the water."
    },
    {
      "title": "Use a hair dryer to dry the spot more quickly.",
      "content": "Use a hair dryer to dry the spot more quickly. Place a hairdryer over the wet spot and dry, using its lowest setting, until the water has been removed. Place your hand on the carpet to test its dryness as you use the hairdryer. Make sure that all playdough has truly been removed before using this drying method, otherwise you could reintroduce the playdough stain to the carpet."
    },
    {
      "title": "Dry the carpet with a desk fan if you don't have a hairdryer.",
      "content": "Dry the carpet with a desk fan if you don't have a hairdryer. Place a desk fan on the floor next to where you’ve been cleaning. Aim the fan so that the air blows directly over the wet area of the carpet. Use an extension cord if necessary in order to get the fan as close to the wet spot as possible. The closer the fan is situated to the wet carpet, the more effective it will be at drying."
    }
  ]
}