{
  "url": "https://www.wikihow.com/Convert-Feet/Second-to-Miles/Hour",
  "title": "How to Convert Feet/Second to Miles/Hour",
  "steps": [
    {
      "title": "Set up the rate as a ratio or fraction.",
      "content": "Set up the rate as a ratio or fraction. The fraction will have feet in the numerator and seconds in the denominator. The number of feet per second should be given to you. The rate should be per second, so you should have a 1 in the denominator. [2] X Research source For example if you are converting 500 feet per second to miles per hour, your ratio will look like this: 500 feet 1 second {\\displaystyle {\\frac {500{\\text{feet}}}{1{\\text{second}}}}} ."
    },
    {
      "title": "Convert the number of feet to miles.",
      "content": "Convert the number of feet to miles. There are 5,280 feet in a mile. [3] X Research source So, to convert, divide the number of feet by 5,280. Rewrite your ratio in terms of miles per second. [4] X Research source For example, if you are converting 500 feet per second, you would calculate 500 5 , 280 = .095 {\\displaystyle {\\frac {500}{5,280}}=.095} . So, your new ratio is .095 miles 1 second {\\displaystyle {\\frac {.095{\\text{miles}}}{1{\\text{second}}}}} ."
    },
    {
      "title": "Change the value in the denominator to .00028 hours.",
      "content": "Change the value in the denominator to .00028 hours. This is the conversion of 1 second to hours, found by dividing 1 by 3,600 since there are 3,600 seconds in 1 hour. For example, your new ratio is .095 miles .00028 hours {\\displaystyle {\\frac {.095{\\text{miles}}}{.00028{\\text{hours}}}}} ."
    },
    {
      "title": "Convert to the unit rate.",
      "content": "Convert to the unit rate. This means the rate of miles per 1 hour. To do this, divide the numerator of the fraction by the denominator. [5] X Research source For example, .095 miles .00028 hours = 339.29 miles 1 hour {\\displaystyle {\\frac {.095{\\text{miles}}}{.00028{\\text{hours}}}}={\\frac {339.29{\\text{miles}}}{1{\\text{hour}}}}} . So, 500 feet per second converts to 339.29 mph."
    },
    {
      "title": "Set up the rate as a ratio or fraction.",
      "content": "Set up the rate as a ratio or fraction. Set up the fraction so that the number of miles is in the numerator. This should be given to you. The rate should be per hour, so you should have a 1 in the denominator. [6] X Research source For example if you are converting 50 miles per hour to feet per second, your ratio will look like this: 50 miles 1 hour {\\displaystyle {\\frac {50{\\text{miles}}}{1{\\text{hour}}}}} ."
    },
    {
      "title": "Convert the number of miles to feet.",
      "content": "Convert the number of miles to feet. Every mile has 5,280 feet in it, so to convert, multiply the number of miles by 5,280. [7] X Research source Rewrite your ratio in terms of feet per hour. For example, if you are converting 50 miles per hour, you would calculate 50 × 5 , 280 = 264 , 000 {\\displaystyle 50\\times 5,280=264,000} , So, your new ratio is 264 , 000 feet 1 hour {\\displaystyle {\\frac {264,000{\\text{feet}}}{1{\\text{hour}}}}} ."
    },
    {
      "title": "Convert the number of hours to seconds.",
      "content": "Convert the number of hours to seconds. Since an hour has 3,600 seconds, to convert you would multiply the number of hours by 3,600. [8] X Research source Since you are working with a unit rate of 1 hour, you would simply multiply 1 and 3,600. Rewrite your new ratio in terms of feet per seconds. [9] X Research source For example, 1 × 3 , 600 = 3 , 600 {\\displaystyle 1\\times 3,600=3,600} . So, your new ratio is 264 , 000 feet 3 , 600 seconds {\\displaystyle {\\frac {264,000{\\text{feet}}}{3,600{\\text{seconds}}}}} ."
    },
    {
      "title": "Convert to the unit rate.",
      "content": "Convert to the unit rate. The unit rate is feet per 1 second. This means you must get the denominator of your fraction to 1. To do this, divide the numerator by the denominator. You can also think of it as dividing the numerator and denominator by the denominator. [10] X Research source For example, 264 , 000 feet 3 , 600 seconds = 73.33 feet 1 second {\\displaystyle {\\frac {264,000{\\text{feet}}}{3,600{\\text{seconds}}}}={\\frac {73.33{\\text{feet}}}{1{\\text{second}}}}} . So, 50 miles per hour converts to 73.33 feet per second."
    },
    {
      "title": "Restate 1,000 feet per second as miles per hour.",
      "content": "Restate 1,000 feet per second as miles per hour. Set up the rate as a fraction: 1 , 000 feet 1 second {\\displaystyle {\\frac {1,000{\\text{feet}}}{1{\\text{second}}}}} Convert the number of feet to miles. To do this, divide the number of feet by 5,280: 1 , 000 5 , 280 = .189 {\\displaystyle {\\frac {1,000}{5,280}}=.189} . Convert the number of seconds to hours. To do this, divide the number of seconds by 3,600: 1 3 , 600 = .00028 {\\displaystyle {\\frac {1}{3,600}}=.00028} . Convert to the unit rate. To do this, divide the numerator by the denominator: .189 miles .00028 hours = 675 mph {\\displaystyle {\\frac {.189{\\text{miles}}}{.00028{\\text{hours}}}}=675\\;{\\text{mph}}} ."
    },
    {
      "title": "Convert 15 miles per hour to feet per second.",
      "content": "Convert 15 miles per hour to feet per second. Set up the rate as a fraction: 15 mi 1 hour {\\displaystyle {\\frac {15{\\text{mi}}}{1{\\text{hour}}}}} Convert the number of miles to feet. To do this, multiply the number of miles by 5,280: 15 × 5 , 280 = 79 , 200 {\\displaystyle 15\\times 5,280=79,200} . Convert the number of hours to seconds. To do this, multiply the number of hours by 3,600: 1 × 3 , 600 = 3 , 600 {\\displaystyle 1\\times 3,600=3,600} . Convert to the unit rate. To do this, divide the numerator by the denominator: 79 , 200 feet 3 , 600 seconds = 22 feet per second {\\displaystyle {\\frac {79,200{\\text{feet}}}{3,600{\\text{seconds}}}}=22\\;{\\text{feet per second}}} ."
    },
    {
      "title": "Compare the following two rates.",
      "content": "Compare the following two rates. A red car is traveling 65 mph. A blue car is travelling 80 feet per second. Which car is travelling faster? Convert one of the rates so that both rates are stated in the same units. Then, you just need to compare the two rates. For example, you might convert the blue car's rate of 80 feet per second into miles per hour: Convert the number of feet to miles: 80 5 , 280 = .015 {\\displaystyle {\\frac {80}{5,280}}=.015} . Convert the number of seconds to hours: 1 3 , 600 = .00028 {\\displaystyle {\\frac {1}{3,600}}=.00028} . Convert to the unit rate: .015 miles .00028 hours = 53.57 mph {\\displaystyle {\\frac {.015{\\text{miles}}}{.00028{\\text{hours}}}}=53.57\\;{\\text{mph}}} . The red car is travelling at a rate of 65 mph. The blue car is travelling at a rate of 53.57 mph. So the red car is travelling faster."
    }
  ]
}