{
  "url": "https://www.wikihow.com/Lose-Weight-Fast-on-the-5-Bites-Diet",
  "title": "How to Lose Weight Fast on the 5 Bites Diet",
  "steps": [
    {
      "title": "The 5-bite diet counts bites instead of calories.",
      "content": "The 5-bite diet counts bites instead of calories. The 5-bite diet limits you to only 12 bites of food each day: 5 bites for lunch, 5 bites for dinner, and two 1-bite snacks. This is marketed as a short-term diet for rapid weight loss without needing exercise or healthy food. This diet has some pretty big downsides, so most doctors don't support it. [1] X Research source The diet allows any kind of food, but you are encouraged to have at least 1 bite of high-protein food per meal."
    },
    {
      "title": "Yes, but you'll need a long-term plan to keep the weight off.",
      "content": "Yes, but you'll need a long-term plan to keep the weight off. Although it is one of the riskiest ways to do it, a \"crash diet\" like the 5-bite diet can cause weight loss. Unfortunately, the weight usually returns. To avoid \"yo-yo-ing\" back up to your original weight, it's better to have a plan that includes nutrition, exercise , and even behavioral therapy. [2] X Research source Weight loss is hard, and the slow, reasonable approach can feel like a struggle. A short-term crash diet can help by motivating you with some immediate weight loss. It's still a marathon, not a sprint, so this only works if you use the psychological boost to stick to your exercise and healthy eating plan. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Over the long term, you could lose roughly 1.75 pounds (0.8 kg) per week.",
      "content": "Over the long term, you could lose roughly 1.75 pounds (0.8 kg) per week. You might lose more than this during your actual dieting. These numbers are based on a weekly average for a plan where you try a very low-calorie diet for 2 weeks, eat normally for 4 weeks, and repeat. (Staying on a crash diet for any longer than 2 weeks can be very dangerous, especially without the help of a doctor. [4] X Research source ) You might have seen some much higher weight loss numbers promised by the 5-bite diet. Don't believe what they're selling! Most doctors recommend that overweight people aim to lose 1 or 2 pounds (0.5 to 1 kg) per week. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "No, the 5-bite diet is not safe.",
      "content": "No, the 5-bite diet is not safe. Very low-calorie diets like this are called \"crash diets,\" and they starve your body of energy and nutrients. It turns out those nutrients are pretty important: even a couple of days on a crash diet can mess with your heartbeat and kidney function. [6] X Research source It's especially dangerous as a long-term diet, sometimes even fatal. [7] X Research source"
    },
    {
      "title": "You can ask your doctor about very low-calorie diets.",
      "content": "You can ask your doctor about very low-calorie diets. If you want to try a diet like this, plan your approach with your doctor to make sure you are getting important nutrients. These diets are controversial (people often lose hair and feel dizzy trying this), so your doctor might recommend a different plan instead. [8] X Research source Follow all your doctor's advice and don't diet for longer than they recommend. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You can also talk to a registered dietitian (RD). This is a better choice than a nutritionist, who might not be qualified to give individual health advice. [10] X Research source It's true that the 5 bite diet was designed by a doctor, but unfortunately even doctors sometimes promote dangerous fad diets. If a doctor is making \"too good to be true\" claims, trying to sell a book or product, or advertising the diet with personal testimonials, don't trust them. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "A more reasonable limit on meal sizes is safer and more sustainable.",
      "content": "A more reasonable limit on meal sizes is safer and more sustainable. Eating 5 bites per meal is just not enough to keep you alive. A less extreme approach to smaller portion sizes, though, might help with long-term habits. You can switch to smaller plates and bowls, avoid snacks between meals, and split a meal at restaurants with large portions. [12] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Another approach is to increase the amount of healthy, low-energy-density foods in your diet. For instance, you can cover half your plate with green vegetables each meal, and/or replace high-energy snacks like protein bars with more filling, low-calorie food like carrots."
    },
    {
      "title": "Yes, cutting drinks that contain calories is a good idea.",
      "content": "Yes, cutting drinks that contain calories is a good idea. The 5-bite diet allows only zero-calorie liquids, but doesn't limit them. This means you can drink as much water, coffee, tea, and diet soda as you like. Since these liquids have no calories, they don't affect your weight directly. They might even make it easier to resist overeating by helping you feel full. [13] X Research source Unlike the rest of the diet, this part is pretty good advice and supported by most experts. [14] X Research source"
    },
    {
      "title": "It turns out eating less isn't as powerful as you think.",
      "content": "It turns out eating less isn't as powerful as you think. Eighty percent of people who lose weight from dieting gain the weight back within a year. And that's not because they started binge-eating or didn't choose the right diet. Our bodies compensate for our diet, adjusting energy use to get back to the old weight. Fad diets that focus only on lowering calories are especially good at causing this \"yo-yo\" effect, and that can be a big blow to our motivation and self-esteem. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source So if starving ourselves doesn't work, what does? There's no single, simple answer, but plans that build up your motivation seem to help. That means taking realistic, concrete steps that you can accomplish without torturing yourself—think \"stop drinking soda\" or \"cover half my dinner plate with vegetables.\" [16] X Expert Source Alyssa Chang Wellness Coach & Personal Trainer Expert Interview. 16 October 2019."
    }
  ]
}