{
  "url": "https://www.wikihow.com/Foxtrot",
  "title": "How to Foxtrot",
  "steps": [
    {
      "title": "Hold your partner in a closed ballroom position.",
      "content": "Hold your partner in a closed ballroom position. [1] X Expert Source Andrey Stanev Professional Dance Instructor Expert Interview. 20 May 2020. Perform the foxtrot facing your partner and holding hands at all times. If you’re the lead, use your left hand to hold the follower’s right hand in a gentle clasp. Then place your right hand on the follower’s left shoulder blade. If you're the follower, place your left hand on the lead’s right shoulder blade. [2] X Research source Position your clasped hands at the shoulder height of the follower."
    },
    {
      "title": "Mirror the lead if you’re dancing the follower part.",
      "content": "Mirror the lead if you’re dancing the follower part. When dancing the foxtrot, it’s important that the leading and following roles are clear so the dance looks smooth and fluid. If you're the lead, take 1 step forward with your left foot. As a result, if you're the follower, take 1 step back with your right foot to create space. Similarly, if you're the lead, take 1 step to the left. Then if you're the follower, take 1 step to the right so that you and your partner move together. Traditionally, the man is the lead and the woman is the follower."
    },
    {
      "title": "Dance to the 4/4 timing of the foxtrot.",
      "content": "Dance to the 4/4 timing of the foxtrot. Learning to dance the foxtrot is all about learning the right rhythm and sticking to the beat. 4/4 timing means that there are 4 beats to every 1 bar of music and the rhythm is slow, slow, fast, fast. The slow parts are equal to 2 beats of the music and the fast parts are equal to only 1 beat of the music. Listen to big band foxtrot music and count 4 beats out loud to hear the slow, slow, fast, fast rhythm. [3] X Research source The 4/4 timing is one of the most important things to keep in mind while you’re learning the foxtrot. [4] X Research source"
    },
    {
      "title": "Move around the dance floor with the basic foxtrot step and turn.",
      "content": "Move around the dance floor with the basic foxtrot step and turn. It's relatively simple to dance the foxtrot to a whole song! Simply repeat the basic step with your partner to the beat of the music and move your way around the dance floor. If you encounter any obstacles such as objects or other dancers, perform a basic turn to change direction slightly. [5] X Research source The foxtrot is a simple and elegant form of ballroom dancing. You can simply repeat the basic steps during your dance or you can learn more advanced steps as your confidence and skills develop."
    },
    {
      "title": "Take 1 step forward with your left foot.",
      "content": "Take 1 step forward with your left foot. Stand facing your partner with your feet together. This is called the closed position. Then use your left foot to take 1 step forward if you’re the lead. If you’re the follower, take 1 step back with your right foot to mirror the lead. [6] X Expert Source Andrey Stanev Professional Dance Instructor Expert Interview. 20 May 2020. Step slowly so the step lasts 2 beats of the music. [7] X Research source"
    },
    {
      "title": "Take a second step forward with your right foot.",
      "content": "Take a second step forward with your right foot. Repeat the same process so that you and your partner take 2 steps overall. However, this time step forward with your right foot instead of your left. If you’re the follower, take a second step back with your left foot. [8] X Expert Source Andrey Stanev Professional Dance Instructor Expert Interview. 20 May 2020. These are called walking steps. This second step also takes 2 counts and follows the slow part of the foxtrot rhythm."
    },
    {
      "title": "Use your left foot to take 1 sidestep to the left.",
      "content": "Use your left foot to take 1 sidestep to the left. This is the second part of the basic foxtrot step and it involves moving at a faster pace. If you’re the lead, step to the side and forward very slightly with your left foot. If you’re the follower, quickly step to the right using your right foot. Make sure to step back very slightly to give the lead room as they step forward. [9] X Research source Complete the sidestep at the fast speed of the foxtrot rhythm. This is 1 beat of the music. Perform the sidestep twice as quickly as you performed each walking step."
    },
    {
      "title": "Bring your feet together to close the sidestep.",
      "content": "Bring your feet together to close the sidestep. The final part of the basic foxtrot step is to bring your sidestep to a close. If you’re the lead, bring your right foot to your left foot and position your feet close together. If you’re the follower, draw your left foot over to your right foot. Move at a fast foxtrot rhythm of 1 count of music. [10] X Research source Overall, the 4 parts of the basic foxtrot step follow the slow, slow, fast, fast rhythm of 2, 2, 1, 1, in terms of counts. This means that you count 2 beats of the music while you perform the slow parts of the step and 1 beat of the music for the fast parts. [11] X Expert Source Andrey Stanev Professional Dance Instructor Expert Interview. 20 May 2020."
    },
    {
      "title": "Do the sequence in a backward direction to perform a basic backward step.",
      "content": "Do the sequence in a backward direction to perform a basic backward step. When you’re dancing the foxtrot, moving forward and backward requires the same sequence of steps, however, you simply switch direction. For example, if you’re the lead, take 1 slow step back with your left foot and then a second slow step back with your right foot. Then step to the side with your left foot and draw your right foot over to close the sidestep. [12] X Research source It works in the same way if you’re the follower. Take 1 slow step forward with your right foot and then a second slow step forward with your left foot. Step right with your right foot and then bring your left foot over to complete the sidestep."
    },
    {
      "title": "Step forward with your left foot.",
      "content": "Step forward with your left foot. It’s easy to learn how to turn to the left while you’re doing the foxtrot. Face your partner in the closed position and make sure that your feet are together. Then take 1 step forward with your left foot. If you’re the follower, take 1 step back with your right foot. Follow the lead of your partner to make sure that you dance together in time. [13] X Research source Stick to the slow foxtrot rhythm of 2 counts for this step. Turning follows the same slow, slow, fast, fast rhythm as the basic step."
    },
    {
      "title": "Take a diagonal step back and face towards the left.",
      "content": "Take a diagonal step back and face towards the left. Now it’s time to rotate your body so that you and your partner can dance into the turn. Use your right foot to step back diagonally and face towards the left. If you’re the follower, take a diagonal step forward with your left foot and face towards the left. Keep to the slow foxtrot rhythm of 2 counts for this turn. [14] X Research source After taking the diagonal step, check that you and your partner are standing parallel to where you started the turn. This means you rotated correctly."
    },
    {
      "title": "Step to the left with your left foot and then close the sidestep.",
      "content": "Step to the left with your left foot and then close the sidestep. If you’re the lead, step to the left using your left foot and then bring your right foot over to join your left. If you’re the follower, step to the right with your right foot and then close the sidestep with your left foot. Make sure that each foot movement is for 1 beat to follow the fast rhythm. [15] X Research source This part of the foxtrot turn is exactly the same as the basic step."
    },
    {
      "title": "Repeat the same sequence in the opposite direction to turn right.",
      "content": "Repeat the same sequence in the opposite direction to turn right. Turning to the right when you’re dancing the foxtrot is exactly the same as turning to the left, however, you simply step in the other direction. If you’re the lead, take a step back with your left foot. Then take a diagonal step forward with your left foot to face towards the right. Sidestep towards the right with your right foot and close the step with your left foot. [16] X Research source If you’re the follower, take a step forward with your right foot and then a diagonal step back with your right foot to face toward the right. Then sidestep toward the left with your left foot and close the sidestep with your right foot. Turning left is much more common than turning right when you’re dancing the foxtrot. This is because it’s traditional to move counterclockwise around the dancefloor."
    }
  ]
}