{
  "url": "https://www.wikihow.com/Get-to-Know-Someone-Better-over-Text",
  "title": "Texting 101: 11 Great Ways to Get to Know Someone Better",
  "steps": [
    {
      "title": "It’s an easy way to get things going.",
      "content": "It’s an easy way to get things going. Not sure what to send as your first text? No problem. Send them an open-ended question, which are questions that can’t be answered with a simple “yes” or “no.” That’ll get them to send a thoughtful response that you can use to build off of. [1] X Research source For instance, you could try, “If you could go anywhere you want, where would you go?” or “What’s the most interesting thing you’ve read lately?” Try, “How do you relieve stress?” or “What kind of exercise do you like to do?” You could also try, “Where’s your favorite place to grab a burger?” or “Do you know any good salmon recipes?” Avoid closed questions like, “Do you like pizza?” or “Have you ever been to the beach?” If they respond with just “yes” or “no,” it can be tough to keep the conversation going."
    },
    {
      "title": "Find out who they are and what they do.",
      "content": "Find out who they are and what they do. Ask them about what they do for work or what kind of job they hope to have one day. Find out how many siblings they have and ask them about their parents. Don’t be afraid to get a little personal. It’s one of the best ways to get to know more about them. [2] X Research source Send messages like, “Do you have any brothers and sisters?” “What do you do for work? Do you like it?” “Do you have any pets?” and “What’s your dad like?” Ask things like, “Who’s your best friend and how long have you been friends with them?” and “Where did you go to school?” and “What did you want to be when you were a kid?” If they don’t feel comfortable talking about something, don’t push them too hard. They may eventually open up more to you."
    },
    {
      "title": "Ask them about what they’re into.",
      "content": "Ask them about what they’re into. Find out what they do for fun, what their hobbies are, and how they relax and decompress. Ask them about their favorite movies, books, TV shows, and music. Get to know them by learning more about what they love. [3] X Research source Try texting, “So what do you like to do on the weekends? Workout? Chill? What?” or “What’s your all-time favorite book?” or “Do you have a favorite band?” Get specific with questions like, “What is the best concert you’ve ever been to?” or “If you could have dinner with any person, alive or dead, who would it be and why?” You could also try, “Do you have any hobbies or secret talents that not everyone knows about?”"
    },
    {
      "title": "Get into some of the uncomfortable stuff, too.",
      "content": "Get into some of the uncomfortable stuff, too. Learning more about what someone doesn’t like can also help you know more about them in general. Ask them about what annoys them or drives them crazy. Ask them if there’s anything they’re afraid of or if anything makes them nervous to get to know them on a deeper level. [4] X Research source You could text, “So, I hate when people chew with their mouth open. Do you have any pet peeves like that?” You could also message, “Do you have any weird phobias like clowns or anything like that?” Get a little personal with things like, “Is there anything that makes you scared or anxious?” or even, “What’s your biggest fear?”"
    },
    {
      "title": "You don’t want them to get offended.",
      "content": "You don’t want them to get offended. Steer clear of heavy or controversial topics like politics or religion until you’ve had a chance to get to know them a little better. Use your initial messages to find some chemistry. Ask fun questions that will encourage them to answer and keep the conversation going while also telling you a lot about their personality. [5] X Expert Source Joshua Pompey Relationship Expert Expert Interview. 27 November 2019. [6] X Research source For instance, you could ask, “What’s your favorite quote from a movie?” or “What’s your best dad joke?” or “What 3 words would you use to describe yourself?” You could also ask, “What are you most grateful for today?” or “If you could change your name, what name would you choose and why?”"
    },
    {
      "title": "Turn getting to know them into a fun game.",
      "content": "Turn getting to know them into a fun game. Tell the Truth is a simple game where one person asks the other person a question and they have to tell the truth or pay a price. Send them a text asking if they’d like to play with you. Come with some kind of fun punishment so the stakes are super high. Ask them personal questions as part of the game so you can also get to know more about them. [7] X Research source You could choose a harmless punishment like having to send an embarrassing photo or having to cough up $1 for not telling the truth. If they’re down to play, take advantage of it! Ask questions like, “Why did your last relationship end?” or “Are you interested in anybody right now?” or “What’s something that you’ve never told someone else?”"
    },
    {
      "title": "Don’t be afraid to get a little flirty or risqué with it.",
      "content": "Don’t be afraid to get a little flirty or risqué with it. Never Have I Ever is a game where you say something that you’ve never done and if the other person has done it, they have to accept a punishment. Use statements that can reveal information about them, and be honest whenever they make their own statements—it’s only fair! [8] X Research source Normally, the punishment is the person has to take a sip of their drink, but you can set your own punishments such as having to send an embarrassing photo or a short clip of yourself singing a song of the other person’s choosing. For instance, you could send, “Never have I ever had a one-night stand,” or “Never have I ever dated my friend’s ex.” That’ll tell you a lot about a person! You can also keep it innocent and low-key with something like, “Never have I ever gone to Paris” or “Never have I ever eaten raw sushi.” You can still learn more about them that way."
    },
    {
      "title": "It’s important that you’re honest and open as well.",
      "content": "It’s important that you’re honest and open as well. Whenever they ask you questions about yourself, answer them! If you’re willing to share things about yourself, they may be more willing to do so as well. Honest communication can help both of you learn more about each other. [9] X Research source If they’re willing to tell you more about themselves you should be willing to share your answers to personal questions as well. It doesn't all have to be personal stuff—entertain them with a funny story that happened to you at work or tell them what your plans are for the weekend, for instance. [10] X Expert Source Joshua Pompey Relationship Expert Expert Interview. 27 November 2019."
    },
    {
      "title": "Use smiley faces and hearts to spice things up.",
      "content": "Use smiley faces and hearts to spice things up. Don’t go overboard with it. But a few well-placed emojis can keep the conversation lighthearted and fun, which may make them more comfortable telling you things about themselves. [11] X Research source You could add a winking emoji after texting, “Don’t worry, your secret is safe with me.” If they tell you something really personal, you could follow up with a heart emoji to let them know you care and you’re touched that they shared it with you."
    },
    {
      "title": "It’s a great way to keep the conversation going.",
      "content": "It’s a great way to keep the conversation going. You don’t want to just grill someone by texting them with a million questions. It could make it feel like an interrogation instead of a conversation. Don’t be afraid to veer off track and just start talking about something else entirely. If they’re engaged in the conversation, they’ll follow along with you and you can keep it going. [12] X Expert Source Joshua Pompey Relationship Expert Expert Interview. 27 November 2019. Eventually, you may circle back to more personal topics. [13] X Research source It’ll also help make them feel more comfortable talking to you in general. For instance, you could change gears with something like, “Did I tell you about the turtle I saved from the middle of the road the other day?” or “What did you think of the most recent Marvel movie?” You could also talk about something going on with you for a bit by texting, “I’ve got this crazy project at work that’s been keeping me super busy, but I’m actually excited about it.” They can learn more about you that way."
    },
    {
      "title": "Use a funny image when words fail.",
      "content": "Use a funny image when words fail. When all else fails, send a meme or a gif that you think they’ll think is funny or that they’ll relate to. They may laugh and respond with a comment or two that you can use to keep things moving. It’s also a great way to show them a bit of what your sense of humor looks like. [14] X Research source For instance, if they’re super into Star Wars and you see a funny meme that involves some of the characters from the movies, send it to them! They may respond and you can keep the conversation going. If you’re feeling really creative, you could even make a meme that reflects their personality. For instance, if they talk about how they’re always late, you could make a meme with their face on The White Rabbit from Alice in Wonderland saying, “I’m late!”"
    }
  ]
}