{
  "url": "https://www.wikihow.com/Dye-Carnations",
  "title": "How to Dye Carnations",
  "steps": [
    {
      "title": "Get a fresh, white carnation.",
      "content": "Get a fresh, white carnation. Avoid using wilted ones, as they won't take up the dye as well. You can use more carnations if you want to. [1] X Research source"
    },
    {
      "title": "Cut the end of the carnation off at an angle.",
      "content": "Cut the end of the carnation off at an angle. It would be even better if you submerged the stem in water first, then cut the ends off underwater. This will prevent air bubbles from forming at the base of the stem. Air bubbles can clog up the stem, and prevent the colored water from flowing as well. [2] X Research source"
    },
    {
      "title": "Fill a jar with warm water.",
      "content": "Fill a jar with warm water. You will need at least ½ cup (120 milliliters) of water. How much you use depends on the size of jar you are using. [3] X Expert Source Denise Porcaro Tupper Floral Design Expert Expert Interview. 5 April 2022. The flower will soak up warm water much faster than cool water. [4] X Research source"
    },
    {
      "title": "Stir in some food coloring.",
      "content": "Stir in some food coloring. You will need 20 to 30 drops of food coloring per 1/2 cup (120 milliliters) of water. [5] X Research source Stir the food coloring into the water with a spoon until the color is consistent. [6] X Expert Source Denise Porcaro Tupper Floral Design Expert Expert Interview. 5 April 2022. If you don't have any food coloring, you can use liquid watercolor instead (but not regular paint)."
    },
    {
      "title": "Set the carnation into the water, then wait for it to change color.",
      "content": "Set the carnation into the water, then wait for it to change color. How fast the petals change color depends on how \"thirsty\" the flower was and what color you are using. [7] X Expert Source Denise Porcaro Tupper Floral Design Expert Expert Interview. 5 April 2022. Some colors show up much faster than others. It also depends on how long the stem was to begin with; the longer the stem, the longer it will take. [8] X Research source The flowers won't end up a bright and solid color; they will be streaky with patches of white."
    },
    {
      "title": "Get a fresh, white carnation.",
      "content": "Get a fresh, white carnation. Don't use a colored one, or the colors won't show up well. Also, avoid using an old, wilted carnation, or it won't soak up the water or dye."
    },
    {
      "title": "Trim about 4 inches (10 centimeters) off of the bottom of the carnation.",
      "content": "Trim about 4 inches (10 centimeters) off of the bottom of the carnation. Use a sharp knife or a pair of scissors for this. For even better results, cut the stems while they are under the water. This will prevent air bubbles, which can lead to early wilting. [9] X Research source"
    },
    {
      "title": "Split the stem lengthwise down the middle with a sharp knife.",
      "content": "Split the stem lengthwise down the middle with a sharp knife. Split the stems until you are about halfway up the stem. Place the cut carnation into a vase filled with plain water when you are done. [10] X Research source If you are really careful, you can try to split the stem into three parts rather than two."
    },
    {
      "title": "Fill 2 to 3 small glasses with warm water.",
      "content": "Fill 2 to 3 small glasses with warm water. You will need about 1 to 2 inches (2.5 to 5 centimeters) of water for each glass. [11] X Research source Make sure that the glasses have straight walls; avoid using anything that curves inward or outward. You can also use test tubes instead. Tie them together with string or a rubber band first, then set them down into a cup. [12] X Research source"
    },
    {
      "title": "Add some food coloring into each cup.",
      "content": "Add some food coloring into each cup. Be generous with the dye. Plan on using 20 to 30 drops for ½ cup (120 milliliters) of water. Stir the water until the color is consistent."
    },
    {
      "title": "Set the carnation into the jars.",
      "content": "Set the carnation into the jars. Place the jars close together so that they are touching. Make sure that the segments are well-submerged; add more water and dye, if needed. [13] X Research source"
    },
    {
      "title": "Wait for the carnation to start changing color.",
      "content": "Wait for the carnation to start changing color. This may take as little as a few hours to as long as a whole day. Keep in mind that some colors show up much faster than others. For example, if you used pink, yellow, and blue, you might see the blue show up after a few hours, and the yellow show up after a day."
    },
    {
      "title": "Take the carnation out of the dye once it's the color you want it to be.",
      "content": "Take the carnation out of the dye once it's the color you want it to be. Keep in mind that carnations dyed in this manner will rarely turn out a solid color; they will usually have white streaks in them."
    },
    {
      "title": "Get some fresh, white carnations.",
      "content": "Get some fresh, white carnations. You can dye just one carnation, if you want to, but because you will be using so much water and dye for this method, you might as well dye a whole bunch. You will need to dye one carnation at a time, however."
    },
    {
      "title": "Prepare the dye bath.",
      "content": "Prepare the dye bath. Fill a large bucket with 1 gallon (3.8 liters) of water. Stir in 1 tablespoon (13 grams) of alum and enough food coloring to get the color you want. If you don't have any food coloring, use liquid watercolor or colored ink instead. [14] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source You can use fabric dye instead. Pour enough dye into 1 gallon (3.8 liters) of water until you get the color you want. [15] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source You can also use a floral dye. Mix it according to the instructions on the package, as each brand may be different. [16] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source"
    },
    {
      "title": "Dip the flower bloom into the dye bath.",
      "content": "Dip the flower bloom into the dye bath. Hold the carnation by the stem, then dip the flower part into the bucket. Swish the carnation around in the water for about two seconds, then lift it out. [17] X Research source"
    },
    {
      "title": "Let the excess dye drip back.",
      "content": "Let the excess dye drip back. Hold the flower upside down over the bucket, and let the excess dye drip back into the dye bath. You can give the flower a gentle shake, if you need to."
    },
    {
      "title": "Set the carnation into a vase and let it dry.",
      "content": "Set the carnation into a vase and let it dry. If you think that the flower turned out too dark, you can rinse the excess dye off under clean water. [18] X Research source Keep in mind, however, that the color will lighten a little as the flower dries. [19] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source You can dye more flowers while you wait for the first one to dry."
    },
    {
      "title": "Use the carnation in your floral arrangement.",
      "content": "Use the carnation in your floral arrangement. Once you have dyed the flower, you can trim its stem, pull off its leaves, etc. You can use it fresh, or you can dry it further to preserve it. Be careful not to get the blossom part wet, however, or the dye may run."
    }
  ]
}