{
  "url": "https://www.wikihow.com/Play-SET",
  "title": "How to Play SET 3 Different Ways",
  "steps": [
    {
      "title": "Gather 1 or more players.",
      "content": "Gather 1 or more players. SET is typically played in a group, but you can also play the game solitaire-style. Unlike many other card games, SET isn’t turn-based—instead, you and any other players race to collect as many cards as you can. [1] X Research source We think it’s best to play with about 1-6 players. Any more and the game can get a little too rowdy."
    },
    {
      "title": "Arrange 12 cards face-up on a flat surface in a 4-by-3 grid.",
      "content": "Arrange 12 cards face-up on a flat surface in a 4-by-3 grid. Shuffle the cards so the deck is randomized. After, board game expert Derek Pederson tells us to lay out the cards in a rectangle. Then, flip the cards face-up in the middle of the play area, so every player can see them. You may arrange the cards in a tall rectangle (a 3 x 4 grid) or a long rectangle (a 4 x 3 grid), as long as each player can clearly see all the cards."
    },
    {
      "title": "Search for a set of 3 cards in the grid.",
      "content": "Search for a set of 3 cards in the grid. Once the cards are on the table, every player races to search for a set. A “set” is a group of 3 cards with individual characteristics that, when considered 1 at a time, are either the same on each card or are unique on each card . These 4 characteristics are: shape, number of shapes, color of shapes, and shading of shapes. For example: [2] X Research source A solid red oval, a solid red squiggle, and a solid red diamond are a set , since all 3 cards are red, all 3 are solid-colored, all 3 have only 1 shape, and all 3 have different types of shapes. A card with 3 green outlined diamonds, a card with 2 solid purple squiggles, and a card with a single red, striped oval are a set , since the cards don’t share any characteristics at all. An outlined red diamond, 3 outlined red diamonds, and 1 outlined purple diamond are not a set , since 2 are outlined and one is not, and also since 2 are red and one is not."
    },
    {
      "title": "Say “set” before the other players and point out the cards.",
      "content": "Say “set” before the other players and point out the cards. Yell “set” as soon as you see something— SET is a competitive race to the finish, and isn’t turn-based at all. When you declare “set,” you get “control” of the board—simply point to all the set you’ve found, so players can see what your set is. [3] X Research source If 2 people yell “set” at the same time, give control to the person who’s made fewer sets, or if they’re tied, to the person who is younger. If nobody can find a set: Add 3 more cards to the table."
    },
    {
      "title": "Pause gameplay and let the other players confirm your set.",
      "content": "Pause gameplay and let the other players confirm your set. Give your opponents a few seconds to review, just in case there was a mistake. Don’t collect any cards until the other players give you the go-ahead. [4] X Research source If you falsely identify a set, subtract a point from your total score at the end of the game. Otherwise, continue playing the game as usual."
    },
    {
      "title": "Collect the 3 cards and place them together in front of you.",
      "content": "Collect the 3 cards and place them together in front of you. Grab your set from the card grid and keep it close by. Each set you collect counts as 1 total point at the end of the game. [5] X Research source"
    },
    {
      "title": "Replace the missing cards in the grid with 3 new ones.",
      "content": "Replace the missing cards in the grid with 3 new ones. Fill the empty spaces in the grid, placing the new cards face-up. Pull these new cards from the shuffled deck. [6] X Research source"
    },
    {
      "title": "Continue playing until there are no cards or sets left in the deck.",
      "content": "Continue playing until there are no cards or sets left in the deck. Keep replacing the SET cards within the grid as more sets are called and collected. End the game once all the cards are gone, or there are no more possible sets. [7] X Research source A SET deck has 81 total cards. Depending on gameplay, there might be 6 to 9 unmatched cards leftover at the end of the game."
    },
    {
      "title": "Count the number of sets each player has to declare a winner.",
      "content": "Count the number of sets each player has to declare a winner. Convert each set of 3 cards into 1 point. Then, factor in any penalties you earned throughout the game. Compare your scores with the other players—whoever has the most sets/points is the winner! [8] X Research source If you’re playing solitaire SET , try to collect as much of the deck as you can."
    },
    {
      "title": "Deal 4 cards to 2 or more players.",
      "content": "Deal 4 cards to 2 or more players. SETUP is a more strategic game that requires 2 or more players. Gather the players around the table, shuffle the SET deck, and deal each player 4 face-down cards. Then, place the rest of the deck face-down in the center of the table. [9] X Research source Players look at their cards, but keep them secret. The object of this version is to play cards that don’t make sets."
    },
    {
      "title": "Turn over the top 2 cards of the deck.",
      "content": "Turn over the top 2 cards of the deck. Place these cards in the center of the table next to the deck. Players will play their cards next to these."
    },
    {
      "title": "Take turns placing cards face-up on the table.",
      "content": "Take turns placing cards face-up on the table. The player to the left of the dealer goes first, placing a card from their hand face-up onto the table next to the 2 cards already on the table. The object is to avoid making sets with the cards already on the table, so play a card you think won’t make a set. After you place a card, draw another from the deck. Remember: “Sets” are groups of 3 cards where each individual characteristic (shapes, number, color, shading) is either shared or completely unique."
    },
    {
      "title": "Identify any sets made by the last card played.",
      "content": "Identify any sets made by the last card played. After a player plays a card, every other player examines the cards on the table to find a possible set made by the last played card. (Note that the set must include the last-played card in order to count.) Then: [10] X Research source If there is no new set: The next player plays a card next to the last-played card, and the game continues. If there is a set: The player who played the card must take all the cards on the table, and 2 new cards are flipped over from the deck and onto the table."
    },
    {
      "title": "Play until the deck runs out.",
      "content": "Play until the deck runs out. Players take turns playing cards, trying to identify sets, and drawing cards, until there are no more cards in the deck. Once that happens, the game ends immediately, and players count the cards they each took. The player who took the fewest number of cards wins! [11] X Research source"
    },
    {
      "title": "Shuffle the deck and deal 2 cards to each player.",
      "content": "Shuffle the deck and deal 2 cards to each player. This variation is also played with 2 or more players. Shuffle the SET deck, then place it face-down on the table between you. Give the other players 2 face-down cards, then give yourself 2 face-down cards. Then, lay 2 face-up cards next to the deck. [12] X Research source The object of this version is to bet on how many sets you can make with your hand."
    },
    {
      "title": "Give each player an equal number of poker chips.",
      "content": "Give each player an equal number of poker chips. This variation uses poker chips for betting. Give each player an equal number of chips. Distribute as many as you like, but 20 is a good starting number. [13] X Research source"
    },
    {
      "title": "Look at your hand and see if it can make a set with the table cards.",
      "content": "Look at your hand and see if it can make a set with the table cards. players look at the 2 cards they were dealt, and keep them a secret. Compare your cards to the cards on the table, and see if you can make a set of 3 using both the cards in your hand and those on the table. [14] X Research source Remember: “Sets” are groups of 3 cards where each individual characteristic (shapes, number, color, shading) is either shared or completely unique."
    },
    {
      "title": "Place bets based on how good you think your hand is.",
      "content": "Place bets based on how good you think your hand is. Now, place bets like you’re playing Poker. The more sets you can make with your cards, the better your hand is. Whoever didn’t deal makes the first bet, and players keep raising or matching the bet until they agree on a maximum bet. [15] X Research source If no players wish to bet, another card is dealt onto the table, and players then bet using that additional card. If you don’t wish to bet but other players do, you “fold” and sit out the round."
    },
    {
      "title": "Reveal your cards and claim the chips if you have more sets.",
      "content": "Reveal your cards and claim the chips if you have more sets. The player whose hand can make the most sets when combined with the cards on the table takes all the chips that were bet. [16] X Research source If there’s a tie, both players split the chips evenly."
    },
    {
      "title": "Play until someone wins all the chips.",
      "content": "Play until someone wins all the chips. After the round, reshuffle and deal the cards again. Then, you can choose to end the game in a few ways. First, you might decide that whoever wins all the chips wins the game. Or, play a predetermined number of hands, and then see who has the most chips at the end. [17] X Research source Or, just play until you get bored!"
    }
  ]
}