{
  "url": "https://www.wikihow.com/Relocate-to-the-United-States",
  "title": "How to Move to the US and Begin a New Life",
  "steps": [
    {
      "title": "Have an employer sponsor you.",
      "content": "Have an employer sponsor you. The easiest way to get permission to move to the US is to have an employer sponsor your move. If a US employer wants to hire you, they begin the process by filing a petition with the United States Citizenship and Immigration Services (USCIS) on your behalf. [1] X Trustworthy Source US Citizenship and Immigration Services U.S. government agency in charge of the naturalization and immigration systems Go to source Employer sponsorship allows you to stay permanently in the US. This permanent status is called a “green card.”"
    },
    {
      "title": "Gain sponsorship from a family member.",
      "content": "Gain sponsorship from a family member. Family members in the US might also be able to sponsor you if you don't have an employer willing to do so. Your family member starts the process by filing a Form I-130 petition with USCIS on your behalf. [2] X Trustworthy Source US Citizenship and Immigration Services U.S. government agency in charge of the naturalization and immigration systems Go to source Once the petition is approved, you go through consular processing in your home country. A US citizen can immediately petition for a spouse, unmarried child under 21, or parent to move permanently to the US. [3] X Trustworthy Source US Citizenship and Immigration Services U.S. government agency in charge of the naturalization and immigration systems Go to source A US citizen can also petition for a married child, unmarried child over 21, or sibling. However, these family members don't have priority and must wait for a visa to become available before they can move to the US. If your family member is a permanent resident, they can petition for their spouse or unmarried children to join them in the US. Generally, there is a waiting period. [4] X Trustworthy Source US Citizenship and Immigration Services U.S. government agency in charge of the naturalization and immigration systems Go to source"
    },
    {
      "title": "Identify other ways to move to the United States.",
      "content": "Identify other ways to move to the United States. If you don't have an employer or family member in the US who can petition for you, there may be another way for you to relocate to the country. Some common options include: Self-petition if you have extraordinary ability . People with outstanding abilities in the arts, sciences, education, business, or athletics can petition for a green card. Non-immigrant work visas . These are temporary visas that allow you to live in the US for a certain amount of time. When the visa expires, you need to leave. Nonimmigrant visas are available for people who work in specialty occupations that require at least a bachelor's degree, as well as for people of extraordinary ability. [5] X Research source Your employer will file a Form I-129 petition on your behalf. Intra-company transfers . A business may transfer a manager or executive from a foreign office to a US office. Your employer will file Form I-129 to start the process. [6] X Trustworthy Source US Citizenship and Immigration Services U.S. government agency in charge of the naturalization and immigration systems Go to source Tourist visa . You can only stay in the US on a tourist visa for six months. You shouldn't get a tourist visa if you intend to stay longer. You can't search for work on a tourist visa. Student visa . You can get a student visa if you are attending a US school as a foreign exchange student or a permanent international student. Talk to your school about whether you qualify for a student visa. They can help you with the process."
    },
    {
      "title": "Apply for a nonimmigrant visa",
      "content": "Apply for a nonimmigrant visa . Contact your local US embassy or consulate to complete your application or visit https://ceac.state.gov/genniv/ to apply online. When you apply, you must pay application fees amounting to several hundred dollars, depending on the type of visa you're applying for. You will also need the following documents: passport travel itinerary dates of your recent visits to the United States résumé or CV your I-129 (if you are getting a nonimmigrant work visa) SEVIS ID (if you are a student) additional information if requested"
    },
    {
      "title": "Schedule an interview when a visa becomes available.",
      "content": "Schedule an interview when a visa becomes available. The State Department's National Visa Center (NVC) processes your application and related paperwork. Depending on the type of visa you applied for, a visa may not be immediately available for you. The NVC will contact you when a visa opens up. [7] X Research source If you applied using a petition from your employer or a family member who is a US citizen, you likely won't have to wait very long. However, if you apply in a non-priority category, you may find yourself waiting months or even years."
    },
    {
      "title": "Get a medical exam before your consular interview.",
      "content": "Get a medical exam before your consular interview. Before the US will give you a visa, you will likely need a medical exam and immunizations. The consular officer may give you other tasks to complete before your interview, such as getting your fingerprints taken. Give yourself plenty of time before your consular interview to complete everything. Make sure your passport is valid for at least 6 months. Go through all passports for your family members and update any that are nearing expiration. [8] X Research source"
    },
    {
      "title": "Attend your consular interview.",
      "content": "Attend your consular interview. You will finish processing at the US consulate or embassy nearest you. At the interview, a consular officer will ask you questions about the information you provided on your application and review your supporting documents. [9] X Research source If you are approved, the consular officer will tell you when to pick up your visa. If your visa is not approved, the consular officer may explain why. You are welcome to apply again. Application fees are not refunded if your application is denied."
    },
    {
      "title": "Research temporary housing if you want to wait to find permanent housing.",
      "content": "Research temporary housing if you want to wait to find permanent housing. You may want to wait until you actually arrive in the US before you start looking for a place to live. Most larger cities have extensive short-term housing options available. Services such as Airbnb are popular sources of short-term housing. You might also consider long-term hotels. If you don't have the funds to make a separate trip to the US to look at rental properties, securing temporary housing may also save you potential disappointment. Rental properties aren't always as they appear online and you could run into problems if you sign a long-term lease sight unseen."
    },
    {
      "title": "Search for housing on the internet.",
      "content": "Search for housing on the internet. Begin the search early. Depending on where you are moving to, it could take you some time to find something affordable. Housing costs in the US are generally cheaper than in many European countries. However, housing in cities like New York or San Francisco is very expensive. [10] X Research source Housing may be listed by the owner on Craigslist and similar websites. You can also find apartments and homes for rent on real estate websites. Conduct a general internet search for \"apartments to rent\" or \"houses to rent\" with the name of the city and state where you plan to move. You can also hire a realtor to find housing for you. [11] X Research source You might want to use a realtor only if you intend to buy a house or if you want a furnished executive apartment. If you have pets, make sure the apartment complex allows them. Not all apartments in the US do."
    },
    {
      "title": "View available homes in person.",
      "content": "View available homes in person. You can check out apartments or houses in person with a tourist visa. Work with the landlord to schedule a time to view the apartment, then apply online for your tourist visa. Note how clean and safe the building is. Are the stairs and hallways full of trash? Is the lobby dirty? If so, then the landlord might not be diligent. [12] X Research source Take pictures of each place you see so you can remember what they look like when you get back home. Pay attention to the neighborhood. Some neighborhoods in cities are safer than others. Look for graffiti on apartment buildings or alleyway walls, which may indicate gang activity. If the apartments have iron bars on the windows, this may be a sign that the neighborhood is considered unsafe by those who live there. If you have children, you might also want to tour local schools while you're there."
    },
    {
      "title": "Complete a rental application if you find a place you like.",
      "content": "Complete a rental application if you find a place you like. Once you've chosen an apartment or home, you typically must fill out a written application. Some apartments have online applications. If you don't read English well enough to complete the application, you can have someone else help you with it. A typical application asks for the following: [13] X Research source personal information Social Security number driver's license number employment information, including proof of income (such as a pay stub or employment offer that states your salary) references"
    },
    {
      "title": "Review your lease carefully before signing.",
      "content": "Review your lease carefully before signing. Apartments leases typically run for 12 months. [14] X Research source The lease covers your responsibilities as a tenant and your landlord's duties as a landlord. If you don't read English well enough to understand the lease, have someone explain it to you before you sign it. When you sign your lease, you'll be expected to pay the first month's rent upfront. You may also have to pay a security deposit. Keep a copy of the lease for your records."
    },
    {
      "title": "Decide what you need to take with you.",
      "content": "Decide what you need to take with you. Unless you are relocating from Canada or Mexico, it may be difficult to transport large amounts of furniture to your new home in the US. Choose items that would be difficult to replace or that have significant sentimental value. Moving these items to a separate space in your home or creating a checklist can make the process easier.. [15] X Research source You might want to bring clothes and footwear. Remember that the US is a big country with different climates. Hawaii is warm all year, whereas northern states like Maine, Minnesota, and Alaska have very cold winters. Try to sell the items you're not taking with you, or give them away to friends and neighbors who need them. Generally, you can buy furniture in the US for less money than it will cost to transport what you already own."
    },
    {
      "title": "Find international moving companies.",
      "content": "Find international moving companies. If you intend to move significant amounts of furniture and other belongings, call several moving companies and ask for quotes. If you don't have a lot of furniture and other oversized items, you might consider using a shipping service instead. [16] X Research source If you've chosen a moving company, schedule a day for them to come and pick up your stuff. Follow their instructions for packing your items. You may also be able to pay them a little extra to pack things for you."
    },
    {
      "title": "Get official copies of personal identification documents.",
      "content": "Get official copies of personal identification documents. Before leaving your home country, gather copies of important documents you might need in the US to prove your identity or status. If you're relocating with family, you'll need their documents as well. Get certified (official) copies of the following: your birth certificate birth certificates for anyone in your family adoption records, if you adopted a child marriage license divorce decree transcripts from your children's schools medical and dental records for all family members [17] X Research source"
    },
    {
      "title": "Change your mailing address.",
      "content": "Change your mailing address. Go to your post office and tell them your new address. Ask them if mail can be forwarded. Also, contact businesses directly and let them know your new address. [18] X Research source"
    },
    {
      "title": "Open a checking account at a US bank.",
      "content": "Open a checking account at a US bank. Once you've moved in, you'll see several bank branches in your area. Choose one that seems most convenient, and get a checking account with a debit card. Most places in the US accept debit and credit cards, so you don't often need to carry cash. Each bank will need to see different information from you. Talk to a branch representative and asking what you will need. [19] X Research source You can gather the information and then return to open the account. Generally, you need to present your immigration documents, proof of a physical address (such as your lease), your passport, and a Social Security number (if you have one). Some banks are located inside and outside the US: Citibank, HSBC, Barclays, etc. If you have an account with them, then they can help you set up a US account."
    },
    {
      "title": "Get your utilities turned on.",
      "content": "Get your utilities turned on. If you're renting, check with your landlord about what utilities you need to turn on yourself. Some utilities may be in your landlord's name and included in the rent you pay. You may need to create an account for each of the following: [20] X Research source electricity gas water heat telephone internet/WiFi cable/satellite television"
    },
    {
      "title": "Register your children for school.",
      "content": "Register your children for school. Find the nearest school district and contact the principal's office. If you don't know which district your children should attend, then stop into your city or county government's office. Children are usually guaranteed a seat in their district, which is based on where you live. In the US, children typically start kindergarten at the age of five. However, many schools also offer a pre-kindergarten, which is for children ages three and four. To register in public school, you must typically present a copy of the child's birth certificate or passport, immunization records, and any transcripts from prior schools they attended. [21] X Research source Call the school directly to find out exactly what you need. You can also enroll your children in private school, which you must pay fees for. You can find private schools by looking online. The application process varies. Since your child isn't guaranteed a seat in a private school, begin the process as soon as possible—even before you leave home."
    },
    {
      "title": "Get a Social Security number.",
      "content": "Get a Social Security number. A Social Security number is required if you intend to work in the United States. This number is used to report how much money you made and to determine if you are eligible for Social Security benefits, which are retirement benefits. You don't need the number simply to get a driver's license or open a bank account. [22] X Trustworthy Source US Social Security Administration Independent U.S. government agency that administers Social Security and related information Go to source You could have applied for the Social Security card when you applied for your visa. Check your application to see if you did. If you need to apply in the US, visit your nearest Social Security Administration (SSA) office 10 days after you've arrived. Bring proof that you are authorized to work in the US along with your birth certificate or passport. Visit https://secure.ssa.gov/ICON/main.jsp to find the SSA office nearest you. You can also call SSA at 1-800-772-1213."
    },
    {
      "title": "Obtain a driver's license.",
      "content": "Obtain a driver's license. You need legal permission to drive in the United States. The permission you need will depend on how long you are in the US. If you're a short-term visitor, you can get an International Driving Permit (IDP) from your country's motor vehicle department. However, if you're permanently relocating to the US, you'll need a driver's license from the state where you live. [23] X Trustworthy Source USA.GOV Official website for the United States federal government Go to source Your state's motor vehicle department will have more information on the requirements for getting a driver's license. To locate the nearest motor vehicles office, visit https://www.usa.gov/motor-vehicle-services and click on your state."
    },
    {
      "title": "Familiarize yourself with US laws.",
      "content": "Familiarize yourself with US laws. In the US, laws can be set by the federal government, state governments, and local governments. You should familiarize yourself with the laws. Remember that ignorance of the law is rarely a defense. Gambling is one area where the US differs from many other nations. Gambling is tightly regulated in the United States. For example, Utah has very strict laws against gambling, but the neighboring state, Nevada, is home to Las Vegas, which is internationally renowned for its casinos, slot machines and various other forms of legalized gambling. Learn local regulations, such as whether you need to clean off the sidewalk in front of your apartment or house after a snowstorm. [24] X Research source If you don't know if something is legal, look it up on the internet or talk to a neighbor. Your local city or town hall may also have resources to assist you."
    },
    {
      "title": "Have your pets vaccinated.",
      "content": "Have your pets vaccinated. Pet dogs and cats must be vaccinated against rabies in most parts of the US. After your pet is vaccinated, you'll receive a license tag to place on your pet's collar. Hold onto your proof of vaccination. You may need to present this document to your city or county government when you license your dog. If your pet hasn't been spayed or neutered (de-sexed), you might consider doing this. License fees are often lower for pets that have been spayed or neutered."
    },
    {
      "title": "Practice your English",
      "content": "Practice your English . The US has no official language. [25] X Research source However, almost everyone speaks English and business is typically conducted in English. It's okay if you aren't great at English. You have plenty of time to practice your speaking skills. You might want to take a class. Many colleges offer English as a Second Language (ESL) classes. Your local community center or public library may also offer free classes. However, the best way to learn may be simply to get out and talk to people."
    }
  ]
}