{
  "url": "https://www.wikihow.com/Fly-Planes-in-GTA",
  "title": "How to Fly Planes in GTA",
  "steps": [
    {
      "title": "Board the plane.",
      "content": "Board the plane. You can board an airplane the same way you get inside a car; just stand beside the aircraft and press the Triangle button on your PlayStation controller to board it."
    },
    {
      "title": "Take off.",
      "content": "Take off. Press your finger and hold the R2 button on the topside of your PlayStation controller and the airplane will start to move towards the direction it’s facing. Once it gains enough speed, the plane will start to lift off the ground. Hold down the R2 button until you get to your desired altitude."
    },
    {
      "title": "Steer the plane.",
      "content": "Steer the plane. Use the left analog stick to control the movement of the plane. You can move up, down, left, or right by simply using the left analog stick on your PlayStation controller."
    },
    {
      "title": "Yaw.",
      "content": "Yaw. To quickly change the direction the plane is flying, press the L1 button to make a quick yaw to the left or the R1 button to yaw the plane to the right."
    },
    {
      "title": "Fire the airplane’s weapons.",
      "content": "Fire the airplane’s weapons. Military-type airplanes, like the Hydra, have built-in guns and missiles that you can use to shoot at enemies. Press the X button on your PlayStation controller to fire these weapons and take down your target."
    },
    {
      "title": "Change camera angles.",
      "content": "Change camera angles. Just like driving cars, you can change the view of the camera while flying planes just by pressing the right analog stick."
    },
    {
      "title": "Land the aircraft.",
      "content": "Land the aircraft. If you can’t find a landing strip, you can try to land on open fields or long straight roads without any cars to crash into. Once you’ve sighted the place you’re going to land, press the L2 button to slow down the aircraft. Steer the plane as you descend with the left analog stick and press it to draw out the plane’s undercarriage to land properly."
    },
    {
      "title": "Board the plane.",
      "content": "Board the plane. You can board an airplane the same way you get inside a car; just stand beside the aircraft and press the Y button on your Xbox controller to board it."
    },
    {
      "title": "Take off.",
      "content": "Take off. Press your finger and hold the Right Trigger (RT) button on the topside of your Xbox controller and the airplane will start to move towards the direction it’s facing. Once it gains enough speed, the plane will start to lift off the ground. Hold down the Right Trigger (RT) button until you get to your desired altitude."
    },
    {
      "title": "Steer the plane.",
      "content": "Steer the plane. Use the left analog stick to control the movement of the plane. You can move up, down, left, or right by simply using the left analog stick on your Xbox controller."
    },
    {
      "title": "Yaw.",
      "content": "Yaw. To quickly change the direction the plane is flying, press the Left Bumper (LB) button to make a quick yaw to the left or the Right Bumper (RB) button to yaw the plane to the right."
    },
    {
      "title": "Fire the airplane’s weapons.",
      "content": "Fire the airplane’s weapons. Military-type airplanes, like the Hydra, have built-in guns and missiles that you can use to shoot at enemies. Press the A button on your Xbox controller to fire these weapons and take down your target."
    },
    {
      "title": "Change camera angles.",
      "content": "Change camera angles. Just like driving cars, you can change the view of the camera while flying planes just by pressing the right analog stick."
    },
    {
      "title": "Land the aircraft.",
      "content": "Land the aircraft. If you can’t find a landing strip, you can try to land on open fields or long straight roads without any cars to crash into. Once you’ve sighted the place you’re going to land, press the Left Trigger (LT) button to slow down the aircraft. Steer the plane as you descend with the left analog stick and press it to draw out the plane’s undercarriage to land properly."
    },
    {
      "title": "Board the plane.",
      "content": "Board the plane. You can board an airplane the same way you get inside a car; just stand beside the aircraft and press the F button on your keyboard to board it."
    },
    {
      "title": "Take off.",
      "content": "Take off. Press your finger and hold the W button on your computer keyboard and the airplane will start to move towards the direction it’s facing. Once it gains enough speed, the plane will start to lift off the ground. Hold down the W button until you get to your desired altitude."
    },
    {
      "title": "Steer the plane.",
      "content": "Steer the plane. Use the arrow keys on the right hand area of the keyboard control the movement of the plane. You can move up, down, left, or right by simply pressing the arrow keys."
    },
    {
      "title": "Yaw.",
      "content": "Yaw. To quickly change the direction the plane is flying, press the Q button to make a quick yaw to the left or the E button to yaw the plane to the right."
    },
    {
      "title": "Fire the airplane’s weapons.",
      "content": "Fire the airplane’s weapons. Military-type airplanes like the Hydra have built-in guns and missiles that you can use to shoot at enemies. Press the Left ALT button to fire missiles or the Left CTRL button to guns and take down your target."
    },
    {
      "title": "Change camera angles.",
      "content": "Change camera angles. Just like driving cars, you can change the view of the camera while flying planes just by pressing the V button on your keyboard."
    },
    {
      "title": "Land the aircraft.",
      "content": "Land the aircraft. If you can’t find a landing strip, you can try to land on open fields or long straight roads without any cars to crash into. Once you’ve sighted the place you’re going to land, press the S button to slow down the aircraft. Steer the plane as you descend with the arrow keys, and press the number 2 button on the number pad portion of the keyboard to draw out the plane’s undercarriage to land properly."
    }
  ]
}