{
  "url": "https://www.wikihow.com/Get-a-Rape-Kit",
  "title": "How to Get a Rape Kit: Everything You Need to Know",
  "steps": [
    {
      "title": "A rape kit is the evidence that’s collected during a sexual assault exam.",
      "content": "A rape kit is the evidence that’s collected during a sexual assault exam. Typically, this kit includes bags for storing your clothes, along with containers, tubes, and swabs to store evidence from your assault. Essentially, this kit is a well-rounded collection of evidence that can help investigators track down and prosecute your assailant. [1] X Research source When your rape kit is collected, examiners will ask you to stand on a large piece of paper. This helps them collect any stray hairs and fibers, which might be valuable evidence."
    },
    {
      "title": "Visit your local hospital or rape crisis center to have a rape kit collected.",
      "content": "Visit your local hospital or rape crisis center to have a rape kit collected. Local healthcare centers have trained professionals who know how to collect your rape kit in a safe way; if a professional is not available, they often have advocates who will go to the hospital with you and stay by your side the entire process. Once you arrive at the hospital (alone or with the advocate) let a triage nurse know about your situation, and they’ll help you get situated. [2] X Research source"
    },
    {
      "title": "Don’t take a shower or bath.",
      "content": "Don’t take a shower or bath. It’s completely understandable if you want to wash yourself off after everything that’s happened, but try holding off for a few more hours until your rape kit is collected. If you hop in the shower you might accidentally wash off valuable evidence. [3] X Research source Additionally, try not to wash your hands until you’ve visited the hospital."
    },
    {
      "title": "Refrain from using the restroom.",
      "content": "Refrain from using the restroom. You may have to use the restroom, but try holding off until your rape kit is collected. Using the restroom puts you at risk of accidentally losing valuable evidence. Try not to wash your hands until you've visited the hospital."
    },
    {
      "title": "Refrain from brushing your teeth or having a snack.",
      "content": "Refrain from brushing your teeth or having a snack. Wait until a trained examiner has swabbed your mouth and collected all of the evidence they need. Once your rape kit is collected, you’ll be good to go. [4] X Research source"
    },
    {
      "title": "Visit the hospital before you change into fresh clothes.",
      "content": "Visit the hospital before you change into fresh clothes. It's a good idea to bring a fresh change of clothes, however, the examiners will ask you to submit your old clothes as evidence. Once your rape kit is collected, you can change into fresh, clean clothes. [5] X Research source"
    },
    {
      "title": "Call a loved one or advocate to go with you to the hospital if you'd like.",
      "content": "Call a loved one or advocate to go with you to the hospital if you'd like. It can be incredibly overwhelming to visit the hospital after an assault, but you don’t have to go through the process alone. All victims are welcome to bring a friend, relative, or advocate with them who will stay by their side during the exam. [6] X Research source"
    },
    {
      "title": "Your physical injuries are treated first.",
      "content": "Your physical injuries are treated first. If you’re seriously hurt, nurses will make sure that you’re safe and stable first. The exam won’t start until you’ve been treated. [7] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source"
    },
    {
      "title": "A special nurse or examiner will ask you about your medical history.",
      "content": "A special nurse or examiner will ask you about your medical history. Rape kits are usually collected by Sexual Assault Nurse Examiners (SANEs) or Sexual Assault Forensic Examiners (SAFEs or SAEs). These people are specially trained and will help walk you through the exam process. Expect questions about your current medications and medical history, as well as questions about your recent sex life. Some of these questions may be a bit uncomfortable to answer, but they’ll help your rape kit be really thorough and accurate. [8] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source SANEs or SAFEs will ask about recent consensual partners. These people won’t be judging or criticizing you whatsoever—they just need to know what DNA to exclude so they can focus on the real perpetrator."
    },
    {
      "title": "A SANE or SAFE will examine you.",
      "content": "A SANE or SAFE will examine you. A trained professional will take a few swabs from your genitals, mouth, and/or anus, depending on your situation. The examiner may also collect blood, hair, and/or urine samples, or swab your skin. Your examiner will also ask you if they can hold onto your clothes from the assault, in case your garments hold any trace evidence, like hairs or fibers. [9] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source The examiner will also take a picture of your internal injuries with a small camera known as a colposcope. [10] X Research source The examiner may also ask to comb through your pubic hair as a way to pick up trace evidence. If you ever feel uncomfortable with any part of the exam, you can ask your examiner to stop. Your safety and comfort are most important during the exam. It is important to note that a majority of hospitals do not have a SANE on staff, so it is possible that an Emergency Room Nurse will be conducting your exam, however, rest assured, they are trained professionals. [11] X Research source"
    },
    {
      "title": "It can take anywhere between 2-4 hours.",
      "content": "It can take anywhere between 2-4 hours. Collecting evidence is a really thorough process, and can take a pretty long time. [12] X Research source While you’re at the hospital, ask your examiners for a more specific time range—they’ll be able to walk you through the process and give you a timeline of what’s going on. [13] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source"
    },
    {
      "title": "Take any medications or treatments the examiner prescribes.",
      "content": "Take any medications or treatments the examiner prescribes. You might be prescribed some antibiotics, just in case your assailant passed something on to you, a sexually transmitted disease/infection. Your examiner might also recommend that you take fast-acting birth control pills like Ovral or PlanB, which will prevent an unwanted pregnancy after the fact. [14] X Research source Typically, you’ll take 2 birth control pills immediately, and then another 2 pills in 12 hours."
    },
    {
      "title": "Not at all.",
      "content": "Not at all. Rape kits are helpful if you decide to take legal action, but they aren’t required whatsoever. It’s perfectly valid if getting a rape kit is out of your comfort zone at the moment. If you decide to get a rape kit and feel scared or uncomfortable during the process, you’re completely within your right to ask the examiners to stop what they’re doing. [15] X Research source If you’re okay with getting a rape kit, it’s best to visit the hospital sooner rather than later. Most DNA evidence should be gathered within 3 days so it can be analyzed properly. Some companies have even created at-home rape kits, although these are not as thorough as the hospital examination, it is still a way for evidence to be collected if you decide to not immediately report your assault. [16] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source"
    },
    {
      "title": "You don’t have to report what happened to the police.",
      "content": "You don’t have to report what happened to the police. Sexual assault is extremely traumatic, and it’s completely understandable if you need time to think about and process the events. [17] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You can always report your assault to police several weeks or months later, if that’s easier and more comfortable for you."
    },
    {
      "title": "The exam doesn’t cost anything.",
      "content": "The exam doesn’t cost anything. In the United States, the Violence Against Women Act protects victims from being charged. If you still get billed, call a sexual assault service provider right away. [18] X Trustworthy Source Rape, Abuse, and Incest National Network Largest anti-sexual assault organization in the US providing support and advocacy for survivors Go to source You can find your local provider here: https://centers.rainn.org ."
    },
    {
      "title": "Some places will store your rape kit for up to 15 years.",
      "content": "Some places will store your rape kit for up to 15 years. It ultimately depends on where you live, but most law enforcement groups will hold onto your rape kit for several years after the fact. Ask your examiner or a local police officer for more specific information about the common practices in your area. [19] X Research source"
    }
  ]
}