{
  "url": "https://www.wikihow.com/Post-Pictures-on-Instagram-from-Your-Computer",
  "title": "Posting on Instagram from Your Computer: Quick Guide",
  "steps": [
    {
      "title": "Go to https://www.instagram.com/ in a web browser.",
      "content": "Go to https://www.instagram.com/ in a web browser. You can use any web browser on your computer to post on Instagram. If you are not logged in to Instagram automatically, go ahead and log in using the username and password associated with your account."
    },
    {
      "title": "Click Create in the left menu.",
      "content": "Click Create in the left menu. This opens a window you can use to create a new post. Instagram in a web browser does not allow you to post stories. You'll only be able to create a standard Instagram post."
    },
    {
      "title": "Click Select from computer.",
      "content": "Click Select from computer . It's the blue button at the center of the page."
    },
    {
      "title": "Select a photo to upload.",
      "content": "Select a photo to upload. Select a picture from your computer, then click Open . To select more than one photo, hold Ctrl on PC or Command on Mac as you click the photos you want to upload."
    },
    {
      "title": "Crop your photo(s) and click Next.",
      "content": "Crop your photo(s) and click Next . Click and drag your photo to position it within the post the way you want it, then click Next in the upper-right corner. You can also click the icon with two brackets forming a square in the lower-left corner to select an aspect ratio. Click the magnifying glass icon in the lower-left corner and then use the slider bar to adjust the zoom of your pictures."
    },
    {
      "title": "Select a filter and click Next.",
      "content": "Select a filter and click Next . You can click one of the filters on the right side to select one, or click the Adjustments tab to adjust the brightness, contrast, fade, saturation, temperature, and vignette manually."
    },
    {
      "title": "Write a post and click Share.",
      "content": "Write a post and click Share . Enter a caption for your post if you'd like. You can include hashtags or any other information you want. When you're finished, click Share in the upper-right corner to post your picture(s). [1] X Research source To tag a location in your post, click the map icon to search for and select a location. Use the Accessibility menu to add alt text that describes the images for people with visual impairments. Click Advanced Settings if you'd like to toggle off like and view counts or commenting."
    }
  ]
}