{
  "url": "https://www.wikihow.com/Emotionally-Unavailable-Woman",
  "title": "How Do You Spot an Emotionally Unavailable Woman?",
  "steps": [
    {
      "title": "An emotionally unavailable woman is a woman who won't open up to you.",
      "content": "An emotionally unavailable woman is a woman who won't open up to you. She has trouble handling emotions and is often afraid of being criticized or rejected if she expresses them. She typically tries to stick to casual relationships and avoids getting too attached to anyone. Being emotionally unavailable is different from simply being slow to open up to people. Someone who's slow to open up has no trouble talking about emotions in general. [1] X Research source Being emotionally unavailable isn't permanent. Anyone can change and become more emotionally available —but it does take time and effort to get there. Typically, women become this way as a result of being hurt in a previous relationship or emotionally neglected or abused as a child. Psychologists also refer to emotional unavailability as avoidant-dismissive attachment. [2] X Research source Difficulty discussing emotions is the primary trait. As a result, she might also: [3] X Research source Prioritize her independence and avoid asking others for help or support Avoid discussing anything that's personal or sensitive Stay busy so she doesn't have time to spend quality time alone with anyone Brush off problems as no big deal"
    },
    {
      "title": "She's never been in a serious relationship.",
      "content": "She's never been in a serious relationship. Emotionally unavailable people can be charming, funny, and enjoyable to spend time with—at least at first. But when a relationship starts to get more serious, an emotionally unavailable woman will usually choose to end it before it becomes too emotionally demanding for her. [4] X Research source It's also possible that she's had at least one serious relationship that hurt her badly and caused her to become emotionally unavailable as a defense mechanism to protect herself from getting hurt in the future."
    },
    {
      "title": "She has trouble showing up.",
      "content": "She has trouble showing up. A woman who is emotionally unavailable is often actually unavailable as well. She might make plans and then cancel them at the last minute (or worse, just ghost you). Because she lacks empathy, she doesn't understand that failing to show up when she says she's going to is something that's frustrating or annoying to others. [5] X Research source Emotionally unavailable women typically also keep themselves really busy with work and other commitments because they believe that if they're always busy, they won't have to stop and emotionally connect with anyone. It's not necessarily a red flag if she happens to have a lot going on and just doesn't have a lot of free time. If she's truly emotionally unavailable, she'll be keeping busy to avoid having downtime to spend with people."
    },
    {
      "title": "She doesn't put the same effort into the relationship as you.",
      "content": "She doesn't put the same effort into the relationship as you. For an emotionally unavailable woman, a relationship just sort of exists—you're either there or you're not, but she's not going to put a lot of work into bonding with you. She might even plan on leaving the relationship as soon as it's no longer fun for her. [6] X Research source This isn't to say that emotionally unavailable women aren't capable of making a commitment. She can be extremely committed but still be ready to leave at the first sign of trouble. For an emotionally unavailable woman, not bonding and becoming attached is one way that she protects herself from getting hurt."
    },
    {
      "title": "She never compromises and likes to be in control.",
      "content": "She never compromises and likes to be in control. Because emotionally unavailable women have a hard time handling their emotions, they avoid them by trying to control every aspect of every situation. As long as everything goes their way, they think, they don't have to worry about getting upset. [7] X Research source They might also see compromise as weakness (just like showing emotion), which would make it difficult for them to relinquish control and find middle ground with someone else."
    },
    {
      "title": "She isn't physically affectionate.",
      "content": "She isn't physically affectionate. Some people just aren't touchy-feely and folks definitely have different ideas about how much physical affection is appropriate in public. But if she's basically never physically affectionate at all, even in private, she might be emotionally unavailable. [8] X Research source If she's just not a physically affectionate person but is still emotionally available, you'll be able to tell because she'll be willing to be vulnerable around you and talk about her feelings freely. Even though she's not affectionate, she often is sexually active. But because she tends to separate sex from love, you won't feel an emotional connection during sex and it might feel somewhat transactional."
    },
    {
      "title": "She consistently dodges responsibility for things.",
      "content": "She consistently dodges responsibility for things. Women who are emotionally unavailable will often do whatever they can to avoid dealing with issues that come up in life. It's fairly common for them to avoid taking care of something until it mushrooms into a much bigger deal than it would have been if they'd just handled the issue when it first came up. [9] X Research source For example, she might avoid calling a credit card company or paying her bill until the account winds up in collections and she gets sued. A big part of the reason for this is that she likely has a hard time asking for help when she needs it, so instead she just avoids the problem that she needs help with. [10] X Research source"
    },
    {
      "title": "She avoids discussing or defining the relationship.",
      "content": "She avoids discussing or defining the relationship. Often, a woman becomes emotionally unavailable because she's been hurt in the past. By putting up walls and refusing to define the relationship, she thinks she can protect herself from being in that position again. [11] X Research source This can be really frustrating if you've been dating for a while and you still don't know where you stand. It can also lead you to feel insecure in the relationship. She might also not even really know how to define love or romantic attachment, which can make these types of conversations exceedingly difficult and frustrating for her. [12] X Research source"
    },
    {
      "title": "She never talks about how she feels about you.",
      "content": "She never talks about how she feels about you. She might just seem like she's playing it cool, but she doesn't seem capable of telling you how she feels. When pressed, she might give you something vague and then switch the subject, or she'll wait for you to say something and then just say she feels the same way. [13] X Research source For example, you might say, \"I had a great time at dinner tonight. I really like talking to you,\" and she responds, \"Yeah, me too.\""
    },
    {
      "title": "She seems cool and collected no matter what happens.",
      "content": "She seems cool and collected no matter what happens. Typically, an emotionally unavailable woman considers any display of emotion to be a sign of weakness. Because she doesn't want to seem weak, she tends to have a pretty tough exterior, and it might seem like she's unflappable and nothing gets her down. [14] X Research source Remember that just because she doesn't appear to be upset or stressed out doesn't mean those emotions aren't brewing underneath the surface. This tough exterior can also make an emotionally unavailable woman seem unpredictable because you never know what she's feeling until it boils over, which can appear to happen out of the blue."
    },
    {
      "title": "She's afraid of being criticized or rejected.",
      "content": "She's afraid of being criticized or rejected. A woman who is emotionally unavailable typically doesn't have good coping skills and has trouble handling any kind of negative emotions. But she's especially troubled by the feelings of anger and shame that might come up if she feels as though someone is criticizing her. [15] X Research source She might also be indignant in the face of criticism because she can't imagine anybody actually criticizing her of all people. Emotionally unavailable women can also be very good at turning any criticism or rejection back around on the person who said it. For example, if you get upset because she didn't do the dishes, she might say, \"Well, I would have done them if you hadn't been hanging out in the kitchen all night.\""
    },
    {
      "title": "She doesn't introduce you to her friends or family.",
      "content": "She doesn't introduce you to her friends or family. At some point when you've been dating someone for a little while, you naturally want to introduce them to the other people in your life. But a woman who's emotionally unavailable typically will avoid doing this because she doesn't want to integrate you into her life or bond with you on a deeper level. [16] X Research source If you've just started dating, you might find that she never invites you over to her place either—likely because she wants to control what you know about her and how involved you are in her life."
    },
    {
      "title": "Decide if you want to continue the relationship.",
      "content": "Decide if you want to continue the relationship. There's no question that being in a relationship with anyone who's emotionally unavailable can be frustrating and challenging. If you love a woman who's emotionally unavailable, this can be especially hard. When you think about it, you might come to the decision that as much as you love her, the relationship is doing more harm than good for your life. [17] X Research source It's a good idea to try to talk to her about this, but since she tends to avoid deep conversations, that's likely to be difficult for you to get off the ground. If she is willing to talk, explain that you believe she is emotionally unavailable and describe what you need emotionally from the relationship. This will help her decide if she's willing or able to try to meet your needs or if she'd rather call it quits."
    },
    {
      "title": "Seek couples and individual therapy.",
      "content": "Seek couples and individual therapy. Continuing a relationship with someone who's emotionally unavailable requires effort from both of you. For this to work, she has to be self-aware enough to realize that she's emotionally unavailable and want to do something about it. Therapists can help both of you cope with the situation and teach you ways to deal with the issues that come up. [18] X Research source Improving your relationship and strengthening your emotional bond is something you both need to work on together. To a large extent, you'll get as much out of therapy as you're willing to put in—and that goes for both of you. Keep in mind that this is going to be very difficult because emotionally unavailable people typically have a really hard time asking for help and she likely sees talking to a therapist as showing weakness. [19] X Research source"
    },
    {
      "title": "Set boundaries in your relationship.",
      "content": "Set boundaries in your relationship. Your relationship won't last very long unless you set strong boundaries that ensure your needs are met. Make sure that you have space in the relationship to talk about your own feelings. Even if she is unable to fully understand how you're feeling or what you're going through, she can still listen and validate you . [20] X Research source For example, you might tell her that even though she doesn't understand it, you need 15 minutes to decompress when you come home from work before you can do anything else. While she might not understand why, she can at least respect that you have that need."
    },
    {
      "title": "Take care of your own needs.",
      "content": "Take care of your own needs. Maintaining a relationship with an emotionally unavailable woman means that you'll likely have to get at least some of your emotional needs met somewhere else. Make sure she understands this and that you're both on the same page about the needs you have that she's not capable of meeting and how you're going to deal with that. [21] X Research source For example, if she can't give you emotional support when you're upset, you might talk to a close friend or family member instead of talking to her. When you do this, let her know that it isn't a rejection of her. You might explain that you're making a temporary accommodation so you don't put undue pressure on her. Let her see that you're doing what you can to try to make the relationship work while she works on herself."
    },
    {
      "title": "Make space for her to open up on her own.",
      "content": "Make space for her to open up on her own. It's totally possible for her to become a more emotionally available person if she has a growth mindset and is willing to put in the work and be a little uncomfortable sometimes. At the same time, this is a long process—she's not going to change overnight. If you love her, your support and compassion can make all the difference in helping her open up. [22] X Research source There's nothing wrong with being less emotionally available than other people and it doesn't make her a bad person. If she's willing to put in the work, she'll appreciate your support as she grows. Perhaps the biggest thing you can do to support her is make sure she feels safe and knows that you're not going to judge her or reject her for anything she tells you about how she feels."
    },
    {
      "title": "Yes, people can recover from emotional unavailability.",
      "content": "Yes, people can recover from emotional unavailability. Although emotional unavailability typically comes from relationship patterns established in childhood, it is possible to change those patterns for the better. With time, effort, and support, people can learn to be more emotionally available and enjoy healthier relationships. [23] X Research source The biggest difficulty with becoming more emotionally available is the fact that emotionally unavailable people have a very hard time asking for help, which they typically will need to heal from past trauma and change their relationship patterns. Another hurdle is the fact that emotionally unavailable people tend to avoid having deep conversations about their emotions—something they'll have to do a lot of if they want to become more emotionally available."
    },
    {
      "title": "Sure, an emotionally unavailable woman might miss you.",
      "content": "Sure, an emotionally unavailable woman might miss you. Like with emotional availability, this exists on a spectrum. Generally, the more emotionally unavailable someone is, the less they'll miss you when you're gone. At the same time, specific circumstances might change this. [24] X Research source For example, she might not miss you at all when you go to work because you do that every day and she's accustomed to it. But she might miss you if you travel to visit your family for a week. It's also possible for an emotionally unavailable woman to miss you after you break up with her, if she starts thinking about the situation and feeling as though she wants the relationship back."
    },
    {
      "title": "Most emotionally unavailable women show love by doing things for you.",
      "content": "Most emotionally unavailable women show love by doing things for you. While she might not be physically affectionate, she might also take your car and get it washed while you're busy one afternoon, or cook you dinner while you're watching the game. If she cares for you and likes having you around, she'll do things for you that she thinks will make you happy and make your life easier. [25] X Research source She might also buy you gifts. Emotionally unavailable people frequently prefer to show their love by spending money and buying things for people they care about. Keep in mind that there are many different ways to show love. It's important that you know how she shows love so that you can come to see those things in an emotionally important way."
    }
  ]
}