{
  "url": "https://www.wikihow.com/Make-Glass-in-Minecraft",
  "title": "A Quick Guide to Crafting Glass in Minecraft",
  "steps": [
    {
      "title": "Fill a furnace with fuel.",
      "content": "Fill a furnace with fuel. Put coal, charcoal, dried kelp, or any other fuel source into the bottom square of the furnace. Don’t have a furnace? Make one by placing 8 cobblestone blocks in a ring using your crafting table."
    },
    {
      "title": "Place sand in the furnace.",
      "content": "Place sand in the furnace. Collect sand from the shorelines around your Minecraft world and place a stack of it in the upper box of the furnace."
    },
    {
      "title": "Take the glass from the furnace.",
      "content": "Take the glass from the furnace. The glass will appear in the results square in the smelting window."
    },
    {
      "title": "Place 8 glass backs surrounding a unit of dye on a crafting table.",
      "content": "Place 8 glass backs surrounding a unit of dye on a crafting table. Choose the dye color that corresponds with your desired glass color and stick it in the center of the crafting table. Then, place 8 glass blocks on the outer edge of the crafting table to create a stack of 8 stained glass blocks. [1] X Research source To make each dye color, you need: Red: Beetroot, poppy, red tulip, or rosebush Orange: Orange tulip or torchflower Yellow: Dandelion or sunflower Lime: Sea pickle Green: Cactus Cyan: Pitcher plant Light blue: Blue orchid Blue: Lapis lazuli or cornflower Purple: Red and blue dye Magenta: Allium or lilac Pink: Peony, pink petals, or pink tulip Gray: Black + white dye Light gray: Azure bluet, oxeye daisy, or white tulip White: Bone meal or lily of the valley Brown: Cocoa beans Black: Ink sac or wither rose"
    },
    {
      "title": "Place 6 glass blocks in the bottom 2 rows of a crafting table.",
      "content": "Place 6 glass blocks in the bottom 2 rows of a crafting table. This gives you 16 glass panes per 6 glass blocks placed down. [2] X Research source Tip: Used stained glass blocks to make stained glass panes."
    },
    {
      "title": "Glass bottles",
      "content": "Glass bottles Interested in brewing potions ? First, you'll need to make glass bottles. Make a \"V\" shape on a crafting table using 3 glass blocks. This creates 3 glass bottles. [3] X Research source To fill a bottle with water, hold it in your quick slot bar and use it on any body of water."
    },
    {
      "title": "Beacon",
      "content": "Beacon A beacon is a special tool that can be used to boost your stats in a Minecraft battle. To make one, place 3 obsidian blocks on the bottom row of a crafting table, a nether star in the central slot, and glass blocks in all the other slots. To get a nether star: Spawn a Wither in your game and destroy it . To get obsidian: Create a system at your home base where moving water interacts with a stationary lava pool."
    },
    {
      "title": "Daylight sensors",
      "content": "Daylight sensors Daylight sensors are redstone-based tools that analyze the amount of sunlight in the game. [4] X Research source To make one, fill your crafting table as follows: Entire top row: Glass blocks Entire middle row: Nether quartz Entire bottom row: Wooden slabs"
    },
    {
      "title": "End crystals",
      "content": "End crystals End crystals allow players to summon the ender dragon back into the game. To make an end crystal, fill your crafting table accordingly: Top row: Glass block, glass block, glass block Middle row: Glass block, Eye of Ender, glass block Bottom row: Glass block, Ghast tear, glass block"
    }
  ]
}