{
  "url": "https://www.wikihow.com/Register-a-Business-on-Google",
  "title": "How to Register a Business on Google",
  "steps": [
    {
      "title": "Go to https://business.google.com/ in a web browser.",
      "content": "Go to https://business.google.com/ in a web browser. You can use any web browser on PC or Mac."
    },
    {
      "title": "Click Start Now.",
      "content": "Click Start Now . It's the green icon in the upper-right corner, and below the text on the web page."
    },
    {
      "title": "Type the name of your business and click Next.",
      "content": "Type the name of your business and click Next . Click the line below the header that says \"Business name\" and type the name of your business. Then click the blue button that says \"Next\"."
    },
    {
      "title": "Fill out your location information.",
      "content": "Fill out your location information. The next page is where you enter your address. Use the pulldown menu to select what country you are from. Use the next line to type your street address. The third line is where you type your city. Use the pulldown menu to select your state, and type your zip code (if you live in the US). There is also a checkbox at the bottom for you to check if you deliver goods to your customers. Click \"Next\" when you finish filling out the form."
    },
    {
      "title": "Type a business category.",
      "content": "Type a business category. Use the line below the text on the page to type what kind of business your run. As you type, you will see a list of matching categories. Click the correct category as soon as you see it. Click \"Next\" when you are finished."
    },
    {
      "title": "Type your phone number and website.",
      "content": "Type your phone number and website. The next page is for your contact information. Use the first line to type your phone number. Use the pulldown menu in front of this line to select what country you are from. Then use the second line to type the URL for your website. Click \"Next\" when you are ready to continue."
    },
    {
      "title": "Select whether you want to stay in the know.",
      "content": "Select whether you want to stay in the know. Click the radial button next to \"Yes\" or \"No\" if you want Google to send you tips on how to improve your presence on Google. Click \"Next\" when you are ready to continue."
    },
    {
      "title": "Click Continue.",
      "content": "Click Continue . It's the blue button at the bottom of the screen. This will confirm that you are authorized to manage the business listing."
    },
    {
      "title": "Click Mail.",
      "content": "Click Mail . It's the blue button that below the text asking you to select a verification method. Google will send you a postcard with a 5 digit code. You can now go to https://business.google.com/ and log in to manage your business listing. Certain features will be locked until you verify your location with the 5 digit code on the postcard."
    },
    {
      "title": "Verify your location.",
      "content": "Verify your location. When the postcard with the 5-digit code arrives in the mail, go to https://business.google.com/ and click \"Verify location\" in the sidebar to the left. Type the 5-digit code in the line that says \"Enter code\" and click \"Verify\". This will unlock all the features of the Google business website and allow you to fully manage your business listing."
    }
  ]
}