{
  "url": "https://www.wikihow.com/Gemini-and-Scorpio-Friendship",
  "title": "Do Gemini and Scorpio Make Good Friends? All Your Burning Questions, Answered",
  "steps": [
    {
      "title": "Scorpios are dedicated, passionate, protective friends.",
      "content": "Scorpios are dedicated, passionate, protective friends. For the most part, Scorpio keeps their inner-circle small—they’re about quality over quantity. This water sign takes every relationship super seriously, friends included. So you can expect them to be your ride-or-die, keeper of secrets, and biggest advocate—but know that they expect a lot in return, too. [1] X Research source Scorpio’s the kind of friend who believes your enemies are their enemies. If you’re mad at someone, they are, too. As a water sign, they’re an amazing shoulder to cry on. Scorpio has a deep, intuitive understanding of others’ feelings. If someone talks behind your back, they won’t let it slide. Scorpio will be ready to throw down if it means defending a pal!"
    },
    {
      "title": "Geminis are flexible, fun, and friendly pals to all.",
      "content": "Geminis are flexible, fun, and friendly pals to all. Quick-witted and super social, Gemini is an absolute joy to be around. They could build rapport with a brick wall, and they make friends instantly. They're a mutable sign, so you could drag Gemini along to any gathering or game night—but beware, they're known for being a little flaky, too. [2] X Research source Gemini is endlessly curious, so they’ll make you feel like the most interesting person on the planet. Have a weird hobby? They want to hear about it! This air sign is super adaptable, so you never have to worry about how they’ll fit in with other friends. They can get along with just about anyone. Gemini is also whip-smart. If you love a deep and stimulating debate, Gemini is the perfect friend for you."
    },
    {
      "title": "Scorpio and Gemini will find each other totally fascinating.",
      "content": "Scorpio and Gemini will find each other totally fascinating. These two are like night and day to each other; and at the same time, they both find people inherently fascinating. They’ll both love being friends with someone who operates in such a different way, and even when their differences pose challenges, they’ll still love the excitement in their friendship. To build on your friendship, ask each other questions about how the other thinks and feels: “Are you more likely to get sad or angry when someone hurts you?” Ask each other about their reactions to songs, books, and movies. You’ll both love to hear about how different your friend’s opinions are. Do your best to appreciate each other for what makes you different; when they act in an unexpected way, take a second to enjoy the surprise!"
    },
    {
      "title": "These clever signs will challenge each other intellectually.",
      "content": "These clever signs will challenge each other intellectually. Gemini and Scorpio are two of the sharpest signs in the Zodiac, so naturally, they’ll have incredible conversation. Debates, discussions, and deep-dives are sure to be a hallmark in this friendship. They’ll both absolutely love finally meeting another friend who can keep up with their quick wit. Try asking your pal a stimulating, open-ended question to bond: “Do you think life on other planets exists? Why or why not?” If your pal has a strong opinion, push them on it. They’ll love the challenge: “I actually disagree. I think the book’s theme was more straightforward…” You two will be especially interested in the subject of psychology. Try sharing books and TedTalks on the topic, then discuss them after. Reader Poll: We asked 794 wikiHow readers about what topics they most enjoy chatting about with a Gemini girl, and only 7% of them said politics . [Take Poll] Some people find politics too personal or controversial, so stick to talking about psychology or philosophy until you get to know her better."
    },
    {
      "title": "They’ll love getting into trouble with their perfect partner in crime.",
      "content": "They’ll love getting into trouble with their perfect partner in crime. These are two signs that crave excitement on a super deep level. They don’t mind getting their hands dirty if it means that as a reward, they’ll have a night to remember. These two might stir up a little drama when they’re together, but they’ll definitely have a blast doing it. Try crashing a party you weren’t invited to together. You two will have so much fun taking on new identities and trying now to get caught. Walk up to people you don’t know and ask them to play you in a game of pool. Losers have to tell the winning team their deepest secret. Whether you’re getting matching tattoos, pranking other friends, or summoning spirits together, you two will never have a dull moment."
    },
    {
      "title": "Scorpio and Gemini make a great team and complement each other well.",
      "content": "Scorpio and Gemini make a great team and complement each other well. Scorpio and Gemini are ultimately super different signs, but at the end of the day, they’re both total forces of nature. If they work together, they can totally balance each other out and become a pretty powerful duo—Scorpio will bring the fire, and Gemini will bring the fun. Throw an exciting theme party together. Scorpio can do the careful planning and creative stuff, while Gemini can charm the guests. If you two go to the same school, why not run for office? Scorpio and Gemini would make an amazing President/VP pair. Scorpio and Gemini would make great business partners, too. Scorpio brings the strategy, Gemini brings the charisma."
    },
    {
      "title": "At times, Scorpio’s possessiveness might spook Gemini.",
      "content": "At times, Scorpio’s possessiveness might spook Gemini. Because they're ruled by Mars, Scorpio wants relationships to be super deep and intense. So, they won’t love it if Gemini doesn’t seem as invested as they are. This can occasionally make Scorpio come off as a little obsessive, and Gemini (who can’t stand to have their freedoms limited!) might struggle with this. [3] X Research source Scorpio, remember that when Gemini spends time with other people, that doesn’t take away from their friendship with you. Take a deep breath and cut them some slack! Gemini, try to carve out some time in that busy schedule just for Scorpio—this will make your pal feel special and appreciated."
    },
    {
      "title": "Gemini’s flighty nature might frustrate Scorpio.",
      "content": "Gemini’s flighty nature might frustrate Scorpio. Gemini loves following every whim, and they hate to feel suffocated. Because of this, Gemini’s known to cancel plans last minute and jump to new, exciting adventures. As a fixed sign, Scorpio is serious and organized, so they might find this super annoying. [4] X Research source Gemini, if you care about Scorpio, respect your time together. If you’re desperate to do something new, at the very least invite them along, too. Scorpio, respect that Gemini’s flakiness is part of what makes them exciting. You can’t stand boring people, so in a way, isn’t this a blessing?"
    },
    {
      "title": "Scorpio will want to discuss feelings, but Gemini is all about facts.",
      "content": "Scorpio will want to discuss feelings, but Gemini is all about facts. Though these two are curious and bright, they don’t always love pouring over the exact same topics. Scorpio will want to know Geminis deepest feelings, but Gemini hates emotional talks. Scorpio might get bored by the history of the Roman empire, but Gemini is all ears. Scorpio, respect Gemini's boundaries. They’ll open up to you in time, but if they’re unwilling to dive into deep stuff straight away, that’s okay. Gemini, because you're ruled by Mercury, everything interests you. So why not stick to topics that Scorpio loves, like music and psychology?"
    },
    {
      "title": "If these two learn to love their differences, a beautiful friendship will follow.",
      "content": "If these two learn to love their differences, a beautiful friendship will follow. If they don’t work at it, Gemini and Scorpio could end up at each other’s throats. But the truth is, with a little patience and understanding, these two can create an incredible, exciting, and unique friendship—one that can change each other’s lives for the better. This friendship is a pretty remarkable one, so give it all you’ve got!"
    }
  ]
}