{
  "url": "https://www.wikihow.com/Identify-a-Tonkinese-Cat",
  "title": "How to Identify a Tonkinese Cat",
  "steps": [
    {
      "title": "Look for a Tonkinese coat coloring.",
      "content": "Look for a Tonkinese coat coloring. The Tonkinese coat is short and it lays close to the cat's body. It is fine, silky, and soft. The coat coloring pattern can be pointed (high contrast), mink (medium contrast) or solid. These different patterns all come in four different colors: [1] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source Blue - soft blue-grey Champagne - cream to beige coloring Natural - medium brown Platinum - pale, silvery gray"
    },
    {
      "title": "See if the eye color corresponds with the coat color.",
      "content": "See if the eye color corresponds with the coat color. With Tonkinese cats, the coloring pattern of the coat usually corresponds to the eye color in a specific way. If the eye color does not match the coat pattern, then it may not be a pure bred Tonkinese. [2] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source Pointed coat - blue eyes Mink coat - aqua eyes Solid coat - green to yellow/green eyes"
    },
    {
      "title": "Look at the cat's ear shape.",
      "content": "Look at the cat's ear shape. A Tonkinese cat has pointed and upright ears that are wide at the base and rounded at the tips. The ears make the cat look alert and wide awake because they are so upright. [3] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source The Tonkinese cat's ears are moderately sized in relation to the cat's head size. They should generally look neither large or small."
    },
    {
      "title": "Make sure the legs are slender and proportionate.",
      "content": "Make sure the legs are slender and proportionate. The Tonkinese cat has slim legs that are generally proportionate in length and girth to the cat's body. However, the back legs are slightly longer than the front legs. [4] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source The Tonkinese also have oval paws. The cats have five toes on the front paws and four toes on the back paws."
    },
    {
      "title": "Assess whether the cat is surprisingly heavy.",
      "content": "Assess whether the cat is surprisingly heavy. One of the defining characteristics of the Tonkinese breed it that it is heavier than expected. If you pick up the cat and it weighs more than you think it would from looking at it, then it may be a Tonkinese. [5] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source If you weigh the cat, it should be between six and twelve pounds. [6] X Research source"
    },
    {
      "title": "Look for a moderate build and size.",
      "content": "Look for a moderate build and size. The Tonkinese was bred to be a moderately-sized cat with good proportions. Its body is firm and muscular but not overly so. If you look at a Tonkinese it should simply appear in proportion. [7] X Trustworthy Source Cat Fancier's Association World's largest registry of pedigreed cats and organization devoted to the well-being of all cats Go to source Even the cat's head, ears, and tail should all look well proportioned. In show cats, the balance and proportion of the cat is more important than the overall size of the cat."
    },
    {
      "title": "Determine whether you have a friendly cat.",
      "content": "Determine whether you have a friendly cat. The Tonkinese is not a distant or aloof cat. It likes to interact with people and other animals a lot, so it shouldn't be left alone for long periods of time. If your cat likes to meet new people or animals and doesn't spend a lot of time alone, it may be a Tonkinese. [8] X Research source A very friendly Tonkinese may go up to you and demand your attention with a lot of meows. In fact, the cat may even do that to strangers that come to your door."
    },
    {
      "title": "Make sure you have an active cat.",
      "content": "Make sure you have an active cat. The Tonkinese cat loves to play. It will chase, leap, and jump after toys if you play with it. It will gladly engage in a game of hide and seek with other animals, or even you. Whatever is going on, the Tonkinese wants to be involved. This activity level means that the cat needs lots of toys and equipment to play with so that it gets the amount of activity is desires."
    },
    {
      "title": "Determine whether you have an intelligent cat.",
      "content": "Determine whether you have an intelligent cat. The Tonkinese is a very smart cat. It can be trained pretty easily, especially for a cat. It particularly enjoys learning games, such as fetch, and mastering cat puzzles. [9] X Research source Because these cats are so smart, they need a lot of interactive toys and games to keep their minds occupied."
    },
    {
      "title": "Assess whether you have an affectionate cat.",
      "content": "Assess whether you have an affectionate cat. The Tonkinese breed is a very loving breed that loves to snuggle with its family members. With this breed, it is not surprising if the cat jumps up on your lap and curls right up. In fact, it will likely follow you around the house until you pay attention to it and give it some love. [10] X Research source A Tonkinese loves being involved in family activities. Don't be surprised if it jumps up on the table during a family meal because it wants to be part of the group."
    },
    {
      "title": "Ask your veterinarian about your cat's breed.",
      "content": "Ask your veterinarian about your cat's breed. If you want to verify your cat's breed, you can simply ask your veterinarian. An experienced veterinarian should have a lot of knowledge about common cat breeds and they may be able to give you verification. However, they may not be able to identify less common breeds without some research. Since a Tonkinese is a cross between a Siamese cat and a Burmese cat, your veterinarian may suggest that your cat is one of these breeds."
    },
    {
      "title": "Talk to a breeder.",
      "content": "Talk to a breeder. To get verification of your cat's breed, talk to an expert in breeding Tonkinese cats. By contacting a breeder that specializes in this breed, you will be able to get reputable information. Ask the breeder if they would consider consulting with you about your cat. They may request that you pay a consulting fee, as this is related to their business. Look at the websites of cat associations or appreciation groups to find quality breeders to consult with. There are breeders of this cat spread out all over the world, but there are not a ton of them. While you may be able to bring your cat to the breeder if they are in your area, breeders outside of your area may be able to do an assessment based on photos."
    },
    {
      "title": "Get a DNA test done.",
      "content": "Get a DNA test done. If you want the most reliable verification possible for your cat's breed, then you should get a DNA test done. You will need to contact a company that specializes in pet DNA testing and have them send you a sampling kit. Many companies have these available online. The sampling kit will have instructions for collecting a sample included. Typically, though, sample collection involves swabbing your cat's cheek. Once that is done, you will send it back to the company for analysis. The company will send you the results once the sample has been analyzed. There are a variety of companies and organizations that do pet DNA testing. Look for companies that have the widest possible database. This allows for the most accurate DNA match. These DNA tests will not tell you about any potential genetic health problems. Instead, they are used to help determine your cat's lineage."
    }
  ]
}