{
  "url": "https://www.wikihow.com/Be-a-Hippie",
  "title": "How to Be a Hippie",
  "steps": [
    {
      "title": "Feel groovy.",
      "content": "Feel groovy. Start with the music that rocked a generation and just the music that makes you feel good! Hitchhike down to your local record store (or truck on over to eBay) and pick up the record of three days of love and music that defined the high point of hippiedom: Woodstock . Listen to Jimi Hendrix and his inimitable rendition of Star Spangled Banner, Joe Cocker getting by with a little help from his friends, and the ever-popular Fish Cheer from Country Joe and the Fish. For a truly authentic Woodstock experience, listen to it in the rain. In the mud. Naked, with friends. While Woodstock has some of the best acts and most memorable songs of the sixties, don't neglect other music of the era as you build your hippie cred. (Actually, hippies never used the word \"cred.\") Groove to some of these other great artist that tapped the toes of the Biggest Generation: Bob Dylan. There's a dichotomy here, one you must resolve for yourself. Do you go with Acoustic Bob, or Electric Bob? Either way, Mr. Dylan is one of the key ingredients in any hippie repertoire. The Beatles. Especially during their psychedelic period, when they'd moved from \"She Loves You (Yeah, Yeah, Yeah)\" to \"Lucy in the Sky With Diamonds.\" Jefferson Airplane. Before the watered-down, glitzed-up popsters that were Jefferson Starship, Jefferson Airplane took us down a rabbit hole, and gave us somebody to love. The Grateful Dead. If you don't know the Dead, then you just don't know the meaning of the word \"hippie.\" These guys gave birth to an entire genre known as the \"jam band,\" exemplified by bands like Phish, String Cheese Incident, and Widespread Panic (actually, The Allman Brothers Band gave birth to Panic). They also gave birth to an entire volume of jam band jokes, like \"Why do Deadheads wave their hands in front of their face when they dance? So the music doesn't get in their eyes!\" Janis Joplin. If there is an archetypal \"hippie chick,\" it would have to be Janis. Of course, she had her hair, her beads, and her wild-abandon ways, and she also had a voice that could sear, soar, cajole, seduce, and stun with its power. While there are far too many excellent hippie bands to list individually, you must become familiar with Crosby, Stills, and Nash (with and without Neil Young); Joni Mitchell; Judy Collins; Sly and the Family Stone; The Doors; Donovan; The Who; The Stones; The Byrds; Buffalo Springfield, and, arguably, Frank Zappa."
    },
    {
      "title": "Play it forward.",
      "content": "Play it forward. The music then was exactly what a generation needed. But time marches on, and there is awesome music being produced today that fits the ethos of peace, love, and understanding. Enjoy it. Being a hippie is all about openness and embracing what's good. As long as you can dance to it."
    },
    {
      "title": "Get counter-cultured.",
      "content": "Get counter-cultured. Understand fully the many aspects of the 1960s and 1970s that formed the hippie subculture. [1] X Research source Learn how many of these people got together, what their general morals and beliefs were, and where they came from. So much of the history of hippie subculture can be found on the internet today; possibly more than any other subculture. You can gain much insight into the Hippie subculture from watching the original Woodstock movie, \"Celebration at Big Sur\", \"Monterey Pop\", and so on. These are shown on Sundance and the Independent Film Channel, or you might be able to rent them from Netflix. Don't just glue yourself to the History Channel (like wow, how to make a hippie feel old, man!). Read the words of the poets and authors and other cultural touchstones that defined hippiedom: Electric Kool Aid Acid Test by Tom Wolfe about Ken Kesey and his Merry Pranksters is required reading, and when you're done, you will know if you're on the bus, or off the bus. Learn to howl, and read the poetry of Allen Ginsberg and Jack Kerouac. While they themselves preceded the hippie culture, their works sparked the creative spirit in such icons as Hunter S. Thompson, and Bob Dylan (among many others). Don't forget to laugh at the comics, and yourself. One of the greatest comedians to come from that era was the guy who gave us the \"hippie dippy weatherman with your hippie dippy weather, man.\": George Carlin. Unlike many hippies of the era, Mr. Carlin stuck to his beliefs throughout his life."
    },
    {
      "title": "Get up to date.",
      "content": "Get up to date. Understand that being a hippie today is a bit different than being a hippie in the 60s and 70s. [2] X Research source Hippies have new ideas on different topics that deal with the changing times. The hippie generation forming today is doing living by many of the same ideals that formed then, but the Vietnam war is over, and Martin Luther King, Jr., was more or less victorious in his struggle for civil rights. Ask your parents what it was like while growing up in those days. You may be surprised—and, at turns, appalled—learning about your parent's bag was. They might surprise you, as they were once young and wild, too, and experienced many of the same things you are experiencing today, including love, war, a divided country, and a persistent existential threat."
    },
    {
      "title": "Try to follow hippie ideals.",
      "content": "Try to follow hippie ideals. Contribute as little to pollution as possible. Hippies love mother earth, and do all they can to keep it well. Buy clothing and products that are recyclable and are good for the environment. Do volunteer work and learn about barter. Hippies in the 60s believed in trade or barter rather than money."
    },
    {
      "title": "Learn the lingo.",
      "content": "Learn the lingo. In the day, hippies had their own lexicon, as does every generation. Here are just some of the words that were part of the hippie's vocabulary: [3] X Research source 1-A, closely related to Draft Card : This would determine whether you would have to go to Vietnam, unless you could get into the National Guard (hard), get CO status (harder), or move to Canada. Babe, baby, chick, old lady: These were affectionate terms for women and wives or girlfriends. Bag: Your thing. What you were or weren't into. \"Like wow, you know, needlepoint just isn't my bag.\" Blow your mind: Be really impressed by something almost unbelievable. \"Man, it blows my mind that your old lady used to be my wife!\" Bogart: Not sharing a joint. Bummer: A very bad thing. \"Oh, bummer, man. I'm out of bread.\" Bread: Money Cat: A hip hippie. Cop out: Bagging responsibility and taking the easy way out. \"He loves the war, but joined the National Guard. What a cop out.\" Dig: To grok; to understand, or to like. \"I like really dig Sgt. Pepper , man, you dig? Your thing. What you do. Your bag. You dig? Far out: Like totally cool. Gone: Really, really far out. Flashback: An unexpected replay of a drug experience, without the drugs. Freak flag: Long hair. Fuzz: Police. Also, pigs, cops, and \"the man.\" Grok: To dig. Coined by Robert Heinlein in Strangers in a Strange Land . Grooving: really enjoying something. \"Man, I'm grooving on these new tunes by Dylan\" Groovy: Very cool. It's a good thing. Head: Somebody who enjoys drugs. High: What a head usually is. If it feels good, do it; Make love, not war; Give peace chance; : Hippie mantras Joint: A marijuana cigarette. Killer: Really good. \"That was some killer weed in that joint. Acapulco gold?\" Rap: To converse. Split: To leave. \"Man, it's been great rapping with you, but I gotta split now, gotta get ready for my gig at the Fillmore.\" Wow: An expression that shows excitement. \"Wow, man, bummer you have to leave. Me and my old lady have some killer weed that will really blow your mind, you dig?\""
    },
    {
      "title": "Get the clothes.",
      "content": "Get the clothes. Or don't. Clothing is optional for hippies, and even when it's required, the key to being a hippie is to not care about the material stuff. It's about the attitude, not the fashion. So no need rummaging through eBay finding the right round-rimmed rose-colored glasses, bell bottoms, or tie-dyed shirts . It's just as credible to visit the bargain bins at Goodwill. As long as you're comfortable and colorful, you're cool. [4] X Research source Wear clothes made of natural materials, especially hemp. Hemp is the plant that releases the most pollution-preventing oxygen. Colorful ponchos and the Baja Jacket are a great hippie clothing staples, too. Look into second-hand stores, thrift shops, garage sales, and making your own clothes and jewelry. Hippies are known for their tie-dye attire, Native American jewelry, peasant skirts, and bell bottom pants. Men grew out their hair and facial hair, such as goatees and mustaches. Women usually went places without a bra and no makeup. The image of the barefoot hippie is real, but they also wore sandals, soft boots or moccasins, even tennis shoes. Hippies were not immune to the weather. Some staple items to create a modern hippie style include tiered, floral maxi dresses and short flowy shift dresses. [5] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020. High-waisted flare jeans and loose, blousy tops are a part of this style. [6] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020. Besides this, you can wear brown suede boots, hats, and fashion scarves to dress like a hippie. [7] X Expert Source Natalie Tincher Style Strategist & Wardrobe Specialist Expert Interview. 4 June 2020."
    },
    {
      "title": "Do your part to make the world better.",
      "content": "Do your part to make the world better. Stand against anti-life things such as wars, and help to campaign for a more liberal society with issues such as gay rights and drug laws. Take a stand for the environment and give animals a voice. Most hippies think that drug prohibition hurts more than drug use. Google LEAP (Law Enforcement Against Prohibition), or NORML (National Organization for the Reform of Marijuana Laws)."
    },
    {
      "title": "Let your freak flag fly.",
      "content": "Let your freak flag fly. Grow your hair and go to the hair salon as little as possible. Keep clean, but use natural soaps and deodorants and herbal products. Dr. Bronner's has long been a favorite maker of cleansing products for hippies. Make your own, if possible. Dreadlocks are a popular hippie hair-do too."
    },
    {
      "title": "Like wow, man, look at the colors.",
      "content": "Like wow, man, look at the colors. Some hippies are into smoking pot, and the use of psychedelic drugs such as mushrooms and LSD. More recently, ecstasy is also making a scene in hippie culture. Is it legal? Not at all. Is it dangerous? There's no consensus on that one. Ultimately, it's a choice for you to make, given what we know in the 21st century, but it was most definitely part of the hippie culture of the 60s. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source One can only wonder what would have become of bands like The Beatles or The Grateful Dead without their experimenting with hallucinogens. Given that, you don't have to take drugs to be a hippie! Remember, many hippies—Frank Zappa, notably—avoided drugs and preferred the \"natural high\", which they sought through meditation, listening to music, colored lights, dancing, backpacking, and other healthy activities. Also, recreational drug use (barring alcohol) is illegal in many countries, so do be careful."
    },
    {
      "title": "Become a vegetarian.",
      "content": "Become a vegetarian. Some hippies eat only organic vegetarian and vegan food, though keep in mind that in the 60s, \"organic\" was not a food category, and veganism was rarely practiced. Most hippies were too poor to be too picky about what they ate. Today's organic foods, free-range and health food stores are a legacy of the hippie movement; you might find hippies at your local one."
    },
    {
      "title": "GO GMO FREE!",
      "content": "GO GMO FREE! Stay away from foods with more than 10 ingredients on them. If they look confusing to your eyes, then they're NOT healthy!"
    },
    {
      "title": "Going to Farmers Markets is also a hippie thing.",
      "content": "Going to Farmers Markets is also a hippie thing. Support your local farms and buy produce from them!"
    },
    {
      "title": "Going Vegan is also a good alternative if you believe that animal's lives should be well respected.",
      "content": "Going Vegan is also a good alternative if you believe that animal's lives should be well respected. This includes taking cow's milk (a cow's milk is best for its young child), Bee's honey, (they create it themselves, therefore it's a by product of an animal), and eggs (in the case of chickens, they are basically a \"period\" of a chicken; an unfertilized egg doesn't turn into anything, but fertilized by a rooster, it turns into a chick) out of your diet."
    },
    {
      "title": "Spirituality is also pretty important for the neo-hippie.",
      "content": "Spirituality is also pretty important for the neo-hippie. Study chakras and meditate. educate yourself on crystals and the healing benefits, maybe even start collecting them!"
    },
    {
      "title": "Watch movies like Woodstock (1970), Festival Express (2003), Revolution (1968), Magical Mystery Tour (1967), Alice's Restaurant (1969), and Magic Trip (2011).",
      "content": "Watch movies like Woodstock (1970), Festival Express (2003), Revolution (1968), Magical Mystery Tour (1967), Alice's Restaurant (1969), and Magic Trip (2011). These films capture the hippie counterculture pretty well."
    }
  ]
}