{
  "url": "https://www.wikihow.com/Are-Curses-Real",
  "title": "Are Curses Real or Just Mythology?",
  "steps": [
    {
      "title": "There's no scientific evidence that curses are real.",
      "content": "There's no scientific evidence that curses are real. If you’re worried that things like curses, hexes, or the “evil eye” are real, rest assured that you’ve nothing to fear. There’s no scientific or rational evidence to suggest otherwise. [1] X Research source People might imagine they’re seeing the results of a curse for several reasons, though: Strange probability. If you flip a coin 10 times on a Tuesday and it lands on heads every single time, you might believe the fact that it’s Tuesday has something to do with it. Really though, it’s just random luck. The coin and Tuesday have nothing to do with one another. [2] X Research source Confirmation bias. When you subconsciously seek out proof for a theory regardless of the evidence, it’s confirmation bias. For example, if you think black cats are bad luck, you might already be primed to blame the last black cat you saw for anything bad that happens next. [3] X Research source Cultural tradition. The stories and practices of our ancestors and family can be powerful. If you grow up your whole life being told that witchcraft is real, it can be hard to shake that belief. [4] X Research source Effectance motivation. Effectance motivation refers to the natural human desire to have control over your environment. If it feels better to blame a curse than bad luck, you’re likely to write off bad luck as a cause for your woes. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "The Bible suggests curses are real in a sense.",
      "content": "The Bible suggests curses are real in a sense. The Old Testament does contain multiple references to curses, but they’re more general invocations of evil than what you imagine when someone talks about curses today. These curses are also noticeably absent in the New Testament, which suggests Christ’s redemption and God’s love completely neutralize any curse you may come across. [6] X Research source Adam’s original sin can be interpreted as a kind of original curse. That sin is relieved by asking God for forgiveness! A lot of the references to curses simply treat being “cursed” as identical to not being in harmony with God. For example, Deuteronomy 27-28 reference curses, but only in the context of being out of God’s graces. Galatians 3:13 mentions, “Christ redeemed us from the curse of the law by becoming a curse for us, for it is written: ‘Cursed is everyone who is hung on a pole.’” Here, you can see how the Bible treats curses more as the opposite of being with God—not a traditional curse."
    },
    {
      "title": "Both the Quran and hadith assert that curses are real.",
      "content": "Both the Quran and hadith assert that curses are real. The Quran contains 47 references to curses, and most of the passages treat the idea of being cursed as punishment from Allah for acts of evil. [7] X Research source The hadith also confirms the existence of supernatural Jinn and the “evil eye” (where witches can look at you in a certain way to curse you). [8] X Trustworthy Source Pew Research Center Nonpartisan thinktank conducting research and providing information on public opinion, demographic trends, and social trends Go to source Most passages on curses are comparable to 9.68, which states, “Allah has promised the hypocritical men and the hypocritical women and the unbelievers the fire of hell […] and Allah has cursed them and they shall have lasting punishment.” As 5.13 reminds us, “Allah loves those who do good.” Any curses can be removed by praying to Allah, putting your faith in Him, and performing good acts per the pillars of Islam ."
    },
    {
      "title": "Curses play an important part of Hindu mythology.",
      "content": "Curses play an important part of Hindu mythology. There are a lot of curses in the Hindu Vedas, and Hindu myths contain plenty of references to curses. Unlike traditional modern concepts of curses though, the curses in Hinduism’s stories often correspond to key lessons about life or explain certain phenomena. It’s not like you can “get cursed” in a Western sense. [9] X Research source In Hinduism, curses are referred to as “shraps.” The opposite of a curse in the Vedic texts is a “boon”—something the Gods gift humans for good behavior. For example, in the story of Yudhishthira and Karna, Yudhishthira’s mother hides the truth from her family. As a result, all women are supposedly cursed with an inability to hide secrets. Here, you can see how the curse isn’t so much something that follows people around, but more of an explanation for a bad behavior."
    },
    {
      "title": "Curses play a key role in Wicca and Witchcraft.",
      "content": "Curses play a key role in Wicca and Witchcraft. Curses can take a lot of different forms depending on the tradition or Magick. From simple spells that merely annoy or inconvenience someone to powerful rituals that can cause great harm, every “Left Hand” occultist tradition respects the power of curses. [10] X Research source The most common type of curse in Witchcraft is the binding spell. This genre of curses can restrict or limit someone’s behavior, or trap them to a certain kind of bad luck. While most traditions do respect the ability to evoke demons or spirits, curses are rarely able to force these otherworldly beings to follow someone around."
    },
    {
      "title": "Generational curses, or negative patterns passed down family lines, are real.",
      "content": "Generational curses, or negative patterns passed down family lines, are real. A generational curse refers to anything that impacts you based on bad luck (or unfortunate behavior) in your family’s past. If all of your grandparents grew up impoverished, the data says that it’s more likely that you grew up in poverty too, even though you didn’t do anything wrong. [11] X Research source Other examples include: Generational trauma. People who are abused often end up abusing others. If an ancestor of yours was traumatized, you’re more likely to have parents who were traumatized. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Hereditary illness. A lot of diseases and disorders are simply genetic. If your family has historically been susceptible to certain genetic conditions it’s a kind of curse. Alcoholism and substance abuse disorders. These issues sit at the crossroads of generational trauma and hereditary illness. Addiction isn’t entirely genetic, but the odds increase if you have it in your ancestry. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Mental health issues. There’s a lot of evidence that conditions such as schizophrenia, autism, depression, and bipolar disorder are genetic. [14] X Trustworthy Source National Institutes of Health U.S. government agency for biomedical and public health research Go to source"
    },
    {
      "title": "Believing that you’re cursed can lead to all kinds of distress.",
      "content": "Believing that you’re cursed can lead to all kinds of distress. If you genuinely believe that you’re cursed, it can cause you to be anxious, depressed, or paranoid. It can also lead to self-fulfilling prophecies. If you’re convinced that you’re going to fail a test because you’re cursed, you’re less likely to put in the time studying to pass the class. If you find yourself so stressed by the possibility that you’re cursed that it makes it hard to get through the day, reach out to a medical professional for help."
    },
    {
      "title": "Even if curses aren’t real in a traditional sense, the impact can be.",
      "content": "Even if curses aren’t real in a traditional sense, the impact can be. There may not be any direct evidence that curses are real, but the feelings of being cursed can have a real influence on your daily life. And even still, generational curses are certainly a well-documented phenomenon (even if that isn’t what people mean when they talk about magical curses). The fact that every religion treats curses slightly differently speaks to the power of the belief that you’re cursed. Depending on your religious beliefs, you may believe curses to be an extension of God’s will."
    }
  ]
}