{
  "url": "https://www.wikihow.com/Draw-a-Realistic-Portrait-from-a-Photograph",
  "title": "How to Draw a Realistic Portrait from a Photograph",
  "steps": [
    {
      "title": "Pick a reference or photograph.",
      "content": "Pick a reference or photograph. Make sure whichever picture(s) you choose, drawing them matches your skill level. If you're just a beginner, you probably shouldn't pick a photo that involves too many weird shadows, is taken from an unusual angle, etc.; keep it simple. If you've had more practice drawing portraits , you can try something more complex to challenge your skills. Decide if you want the person to be male or female. Male portraits tend to have stronger shadows, which may or may not be easier for you. Female portraits tend to have longer hair, and some people find a lot of hair boring and/or difficult to draw. Decide if you want the person to be younger or older. Older faces can be more interesting, yet more challenging, because of the extra lines and texture, but they can also convey the most emotion. Very little children are easier to draw, but may be harder if you're used to drawing adults."
    },
    {
      "title": "Create a general outline of the face and head.",
      "content": "Create a general outline of the face and head. For this, use a lighter pencil, use a 2H, or if you don't have pencils with a different lead, use a mechanical pencil. These pencils create thinner, lighter lines, which will be easier to erase if you need to change the outline. Pay attention to whether the person't head is tilted or turned. These variations are very common in the photographs, and if you don't consider the actual eye level, the portrait will look unnatural. Go in further and draw the outlines of the general facial features, such as the eyes , some lines of the nose , inside of the ear , and lips , but don't shadow anything in."
    },
    {
      "title": "Don't assume anything.",
      "content": "Don't assume anything. Only draw what you can see. If there are no bags under the eyes, do not draw them. If you can only see two or three lines around the nose, don't draw more to make it more defined. Making assumptions are risky because those assumptions could be false and mess up the image being conveyed. You can go back later and add details that can't be seen in your reference photo if you don't want your portrait to be an exact replica."
    },
    {
      "title": "Begin shadowing.",
      "content": "Begin shadowing. This is the most daunting part of drawing a portrait, but it's what makes the subject come to life. Determine the lightest and darkest parts of the person's face . If you want your portrait to look 3-dimensional and dramatic, make the lightest parts as white as possible (with your hardest/finest pencil) and make the darkest parts and black as possible (with your boldest pencil)."
    },
    {
      "title": "Use keen observational skills.",
      "content": "Use keen observational skills. To make sure the shadows and features look realistic and similar to your reference, consistently look back and compare your drawing to the photo. You don't have to become OCD about this--especially if you're a beginner, your drawing will almost never look like an exact copy of the photo. Don't forget that part of drawing a good portrait is capturing the uniqueness and expression of your subject. If your subject has a larger-than-average nose, don't try to make it slimmer. Or, if their eyebrows are wispier, don't try to darken them. A portrait should look like a real person, not an ideal."
    },
    {
      "title": "Be patient",
      "content": "Be patient and take your time. Rushing a portrait will diminish its quality."
    }
  ]
}