{
  "url": "https://www.wikihow.com/Cook-King-Crab-Legs",
  "title": "How to Cook King Crab Legs",
  "steps": [
    {
      "title": "Thaw the crab legs overnight in the refrigerator before cooking them.",
      "content": "Thaw the crab legs overnight in the refrigerator before cooking them. They take about 8 hours to defrost. Wait until you’re ready to use them before you begin the defrosting process. If you’re trying to thaw them in a hurry, submerge them in cold, running water. Although you can cook frozen king crab legs in most cases, they cook at a quicker and more even rate when thawed first. [1] X Research source King crab legs spoil rapidly. For that reason, don’t thaw them out days in advance. Most crab legs are sold frozen to preserve their freshness. You won’t find a lot of fresh crab unless you live near the ocean. If you’re getting a fresh crab, remember to clean it ."
    },
    {
      "title": "Trim the crab legs with kitchen shears if necessary to reduce their size.",
      "content": "Trim the crab legs with kitchen shears if necessary to reduce their size. You can usually place the crab legs whole in a steamer basket, pot of water, or baking sheet. However, king crab legs are pretty big and may not fit as well as you would like. To compensate, use something sharp, like kitchen shears, a good chef’s knife, or a paring knife. Cut across the legs as the joints to separate them into multiple pieces. If you have the opportunity to cook the legs whole, leave them alone. It not only saves you a little extra work, but it helps ensure the meat stays juicy and tender."
    },
    {
      "title": "Score the crab legs with a knife to make them easier to open.",
      "content": "Score the crab legs with a knife to make them easier to open. This is optional, but it can help you deal with the hard shell covering the legs. Flip all of the legs over to the back side, which will be colored white. Run a sharp, serrated paring knife vertically down the center. Be careful to avoid cutting into the meat. [2] X Research source Leave the shell closed and intact until you have finished cooking the legs. Then, you can pull them open at the cut you made. They will be easier to open this way. Don’t pull open the shell or cut it too deeply. Exposing the meat makes it more likely to dry out while it’s cooking. Score the shell, but don’t cut through it."
    },
    {
      "title": "Fill a large pot with about 3 cups (710 mL) of water.",
      "content": "Fill a large pot with about 3 cups (710 mL) of water. The water temperature doesn’t matter, but keep the pot about ⅓ of the way full. Have a steamer insert that also fits inside the pot, but wait to put it in for now. A steamer insert is basically a small metal basket that helps cook food by holding it above the water level. Make sure the water doesn’t reach the steamer basket or the crab legs. [3] X Research source If you don’t have a steamer insert, try using a metal colander. You may also be able to fit something like a wire cooling rack or foil inside the pot. The water level doesn’t have to be exact. The most important part is adding enough to last throughout the steaming process while also making sure the crab legs aren’t submerged."
    },
    {
      "title": "Add halved lemons and garlic to the water if you wish to season it.",
      "content": "Add halved lemons and garlic to the water if you wish to season it. It isn’t necessary, but it will add some additional flavor to the crab legs. Slice up to 3 lemons in half lengthwise and drop them into the water. Then, peel the skin off a head of garlic. Split it in half before dropping the cloves into the water. [4] X Research source You can use fewer lemons or garlic cloves if you wish. You could also use store-bought minced garlic or chop up the garlic bulbs if you prefer."
    },
    {
      "title": "Warm the water over high heat until it begins to bubble.",
      "content": "Warm the water over high heat until it begins to bubble. Bring the water up to 212 °F (100 °C). Once it begins to bubble rapidly, it is ready for the crab legs. Since you aren’t using a lot of water, you won’t have to worry too much about it bubbling over. However, make sure you have enough water to last for at least 5 minutes. [5] X Research source Do a final check on the water. It shouldn’t touch the steamer basket once you place it inside the pot. If the water level is too high, let the water cool, then pour some of it out into the sink."
    },
    {
      "title": "Place the crab legs and steamer basket inside the pot.",
      "content": "Place the crab legs and steamer basket inside the pot. Fit as many crab legs as you can by laying them flat inside the basket. Overlapping them a little is fine as long as they are inside the pot. You can usually cook about 1.5 to 2 lb (0.68 to 0.91 kg) at once, but it depends on the size of pot and steamer basket you’re using. [6] X Research source If you’re cooking a lot of crab legs, plan on dividing them into batches. This will ensure they all get an equal amount of time in the basket and plenty of steam. Stuffing too many in at once could cause them to cook unevenly."
    },
    {
      "title": "Cover the pot and cook the crab legs for 5 minutes.",
      "content": "Cover the pot and cook the crab legs for 5 minutes. Check all of the crab legs once your timer goes off. When they are done, a strong crab smell will fill your kitchen. The crab legs turn a consistent red color and feel warm all over. [7] X Research source"
    },
    {
      "title": "Melt butter if you wish to create a dipping sauce.",
      "content": "Melt butter if you wish to create a dipping sauce. Making a basic sauce is easy since you can simply melt a little butter and dunk the crab meat into it. Try melting 0.5 cups (113 g) of butter in a saucepan on the stove. If you wish to add more flavor to it, add 2 tablespoons (30 mL) of lemon juice and 2 teaspoons (6.56 g) of garlic powder. Then, drizzle it onto the meat or dip the meat into it after removing it from the shells. [8] X Research source Making a sauce is optional and the crab legs will taste fine on their own as well."
    },
    {
      "title": "Preheat your oven to 350 °F (177 °C).",
      "content": "Preheat your oven to 350 °F (177 °C). Let the oven warm up while you prepare the crab legs. Give it at least 5 to 10 minutes to reach full temperature. Meanwhile, keep the door shut until you’re ready to put the crab legs in the oven. Be careful about using different temperatures. It will effect how long the crab legs take to cook. High heat settings could also cause the meat to dry out."
    },
    {
      "title": "Spread the crab legs in a single layer on a shallow cooking sheet.",
      "content": "Spread the crab legs in a single layer on a shallow cooking sheet. Pick a baking or cookie sheet with plenty of room to fit the crab legs. Don’t use one with high sides, since that could cause the crab legs to cook unevenly. Lay the crab legs flat over the sheet. You can usually fit up to 2 lb (0.91 kg) on one sheet. ’ If you can’t fit all of the crab legs, split them into batches or use multiple sheets. Don’t try stacking them. They won’t cook at the same rate."
    },
    {
      "title": "Boil about 0.5 cups (120 mL) of water and pour it onto the sheet.",
      "content": "Boil about 0.5 cups (120 mL) of water and pour it onto the sheet. Try warming the water up in a microwave or kettle. Be careful when pouring it to avoid burns. Pour it directly onto the baking sheet so it covers the bottom by about 0.125 in (0.32 cm). You may need to use more or less water depending on the sheet’s size. [9] X Research source Wear rubber kitchen gloves to avoid the possibility of coming into contact with scalding water. The water isn’t strictly necessary, but it’s useful for keeping the crab legs moist while they bake. Without the water, the meat could turn out dry and rubbery."
    },
    {
      "title": "Mix lemon juice, garlic, and other herbs to add to the crab legs.",
      "content": "Mix lemon juice, garlic, and other herbs to add to the crab legs. The main advantage of baking is getting to cook the crab legs with all sorts of other ingredients. For a simple recipe, try pouring 0.25 cups (59 mL) of lemon juice into a separate bowl. Mix in 3 tablespoons (44 mL) of olive oil, ¾ of a cup (170.1 g) of butter, 3 cloves of garlic, and 1 teaspoon (0.54 g) of parsley. [10] X Research source You can customize the flavor mixture any way you want. For example, you could add ingredients like salt, cajun seasoning, or other herbs like dill. If you like the crab legs plain, you don’t have to add anything at all."
    },
    {
      "title": "Brush or pour seasonings onto the crab legs if you are using any.",
      "content": "Brush or pour seasonings onto the crab legs if you are using any. Use a kitchen brush to coat all of the crab legs with a consistent layer of the seasoning mixture. If you don’t have a brush, pour the mixture onto the baking sheet. Try to distribute it evenly over all of the crab legs. [11] X Research source Consider saving half of a butter sauce mixture to eat with the crab legs after they finish cooking. You don’t have to do this, but it’s a way to give the crab more flavor."
    },
    {
      "title": "Cover the crab legs with a layer of aluminum foil.",
      "content": "Cover the crab legs with a layer of aluminum foil. Use the foil as a way to seal in the moisture and flavors. Cover the entire sheet, taking care to tuck the edges of the foil over its sides. When you move the sheet to the oven, watch out so the ingredients don’t spill out the sides. [12] X Research source"
    },
    {
      "title": "Cook the crab in the oven for about 15 minutes.",
      "content": "Cook the crab in the oven for about 15 minutes. Set your timer and wait. Then, lift the foil to check on the crab legs. They turn a bright red color as they cook. You can touch them to see if they feel warm all over. You will also be able to detect a strong crab smell in your kitchen. [13] X Research source Keep in mind that the cooking time will vary depending on your oven and the heat setting used."
    },
    {
      "title": "Preheat the grill to about 325 °F (163 °C).",
      "content": "Preheat the grill to about 325 °F (163 °C). Use the medium-low setting if your grill has it. Then, wait about 15 minutes for the grill to reach full temperature. While it’s heating up, prepare the crab legs. [14] X Research source If your grill has a limited temperature range, using a medium setting is fine. Remember to watch the crab legs carefully to ensure they don’t overcook."
    },
    {
      "title": "Brush the crab legs with oil if you will place them directly on the grill.",
      "content": "Brush the crab legs with oil if you will place them directly on the grill. Pour about 0.25 cups (59 mL) of olive oil into a bowl. Using a kitchen brush, cover all of the crab legs in the oil. The oil will prevent them from sticking to the grill. [15] X Research source If you don’t have a brush, you can rub the oil onto the crab legs by hand. Another option is to roll them in the oil. You could also wrap the crab legs in aluminum foil. It’s safe to use on the grill and will prevent them from sticking. If you plan on seasoning the crab legs before cooking them, use foil instead of oil."
    },
    {
      "title": "Wrap the crab legs in foil if you plan on seasoning them.",
      "content": "Wrap the crab legs in foil if you plan on seasoning them. Lay 4 sheets of aluminum foil on a countertop. Spread the crab legs out evenly between them. You can generally fit as much as 3.5 lb (1.6 kg) king crab legs, so get more foil if you wish to make more than that. Set aside another 4 sheets of foil to wrap up the crab legs. [16] X Research source The foil isn't necessary if you plan on cooking the crab legs plain. Simply coat them in oil to prevent them from sticking to the grill."
    },
    {
      "title": "Coat the crab legs with butter and seasonings for additional flavor.",
      "content": "Coat the crab legs with butter and seasonings for additional flavor. For example, take about ¼ of a cup (55 g) of butter. Rub it over each of the crab legs by hand. Then, cut a lemon into quarters and squeeze them onto the crab legs. [17] X Research source For additional flavor, chop up 5 cloves of garlic and sprinkle them over the crab legs. Add ½ of a cup (2.5 g) of parsley, 1 teaspoon (5.69 g) of sea salt, and 1 teaspoon (2.33 g) of black pepper as well. You can also melt some butter to pour over the crab legs once you’re done grilling them."
    },
    {
      "title": "Cook the crab legs on the grill for about 5 minutes.",
      "content": "Cook the crab legs on the grill for about 5 minutes. Place the crab legs closer to the side of the grill, away from the coals or direct heat, to prevent them from overcooking. Keep them about 5 in (13 cm) away from the heat. Then, close the grill top and leave the crab legs undisturbed. [18] X Research source If you’re cooking the crab legs in foil, be sure to wrap them up tightly to lock in any added seasonings. Butter and other ingredients won’t do you any good if they leak out!"
    },
    {
      "title": "Flip the crab legs and cook them for up to 5 minutes.",
      "content": "Flip the crab legs and cook them for up to 5 minutes. Use a pair of tongs to turn them over, keeping them in the same spot on the grill. Close the top again when you’re done. When the crab legs are done, they will be bright red and have a strong smell. They will also be consistently warm all over. [19] X Research source Note that the cooking time can vary a lot depending on your grill and the heat setting used. All grills cook food at a different rate. Keep an eye on the crab legs to prevent them from burning."
    },
    {
      "title": "Fill a large stockpot half-full with cold water.",
      "content": "Fill a large stockpot half-full with cold water. The amount of water you need will depend on the stockpot you’re using. A basic stockpot takes about 24 cups (5,700 mL) of water, but adjust the amount as needed. This will be enough to cook about 4 lb (1.8 kg) of king crab legs. [20] X Research source Make sure the crab legs are completely submerged in the water or else they may not cook evenly. If your stock pot is too small, cook the crab legs in batches or use multiple pots."
    },
    {
      "title": "Salt and season the water if you wish to flavor the crab legs.",
      "content": "Salt and season the water if you wish to flavor the crab legs. For example, start with 1 tablespoon (17.06 g) of salt and stir it into the pot of water. Then, mix in 2 tablespoons (34.12 g) of store-bought seafood seasoning. You could mix in herbs like parsley and dill, put garlic and lemons in the pot, or customize the flavor however you wish. [21] X Research source The salt is useful for seasoning the crab legs and getting them to cook at a more uniform rate. Even if you don’t plan on adding anything else, the salt is worth adding."
    },
    {
      "title": "Turn the heat up high until the water begins to boil.",
      "content": "Turn the heat up high until the water begins to boil. Set your stove to a high setting and wait. Watch for the water to bubble at a consistent rate. It will take a little bit of time, so don’t rush to turn down the heat. The water has to be boiling before you put the crab legs into the pot. If it isn’t boiling, you will have a much harder time determining when the crab legs are done cooking."
    },
    {
      "title": "Submerge the crab legs in the water.",
      "content": "Submerge the crab legs in the water. Drop the crab legs into the water, taking care to avoid splashes from the hot water. Use tongs to push the crab legs down and tuck them into the water as much as possible. Try to keep them completely covered by the water before letting them cook. [22] X Research source Any parts that are out of the water won’t get cooked. If you want the legs to cook at the same rate, keep them submerged. If you can’t fit all of the legs into the pot, save some of them to cook later."
    },
    {
      "title": "Reduce the heat to medium and wait for the water to boil again.",
      "content": "Reduce the heat to medium and wait for the water to boil again. Adding the crab legs reduces the water temperature, so it won’t be bubbling anymore. Wait a couple of minutes until it begins to bubble rapidly again. Once it reaches that point, it will quickly cook the crab legs at an even rate. [23] X Research source Plan on simmering the crab legs until they’re done. Check the water for tiny, consistent bubbles and wisps of steam. Start the timer once the water reaches that point."
    },
    {
      "title": "Boil the crab legs for 5 to 7 minutes until they are heated through.",
      "content": "Boil the crab legs for 5 to 7 minutes until they are heated through. Leave the pot uncovered and watch as the crab legs change color. They will turn a consistent shade of red as they fill your kitchen with a delicious smell. Once they look done, use tongs to pull them out of the water. Put them on a plate to eat warm. [24] X Research source Try serving the warm crab legs with melted butter and lemon juice. You could also enjoy them plain if you wish."
    }
  ]
}