{
  "url": "https://www.wikihow.com/Print-a-Large-Image-on-Multiple-Pages-on-PC-or-Mac",
  "title": "Simple Ways to Print One Image on Multiple Pages on PC or Mac",
  "steps": [
    {
      "title": "Go to https://rasterbator.net in a web browser.",
      "content": "Go to https://rasterbator.net in a web browser. The Rasterbator is a popular website known for creating poster-sized wall art. This site works in any web browser on both Windows and macOS."
    },
    {
      "title": "Click Create your poster.",
      "content": "Click Create your poster ."
    },
    {
      "title": "Select a source image.",
      "content": "Select a source image. There are three ways to do this: If the image is online, type or paste its direct URL into the “Load from URL” blank, then click Load. If the image is on your computer, click Browse… to open your computer’s file browser, select the image, click Open , and then click Upload . Another way to upload an image from your computer is to drag it from a folder to the “Drag image file here” box."
    },
    {
      "title": "Select your paper settings.",
      "content": "Select your paper settings. Under “Paper settings,” choose your desired options: [1] X Research source Choose the size and format of the paper you’re printing on, such as A5 (5.8” x 8.3) or US Letter (8.5” x 11”), from the first drop-down menu. Select either the Portrait (tall) or Landscape (wide) format. The default margin size is 10 mm, which should work for most home printers. Margins are necessary because most printers don’t print all the way to the edge of the paper. If the margins are too small, some of the images will be cut off—if it’s too big, you can always just trim off the edges. Overlap makes it easy to join the images together when you cut off the margins because the image will slightly overlap with the adjoining sheets. Check the “Overlap pages by 5 mm” box for the best results."
    },
    {
      "title": "Choose the size of your poster.",
      "content": "Choose the size of your poster. The “Output size” section determines the size of your poster based on the number of sheets making up the image. The higher the number of sheets, the larger the size of the poster. Enter the number of sheets into the first box. In the drop-down menu, select wide or high . For example, if you type 6 into the “sheets” box and select wide , the image will be the size of 6 sheets of paper across (wide). Rasterbator will figure out how many sheets tall the poster must be to fit the image. If you select tall , the example image would be 6 sheets tall, and Rasterbator would determine the width based on the image size. The grid lines on the preview show how many sheets of paper you’ll be using."
    },
    {
      "title": "Click Continue.",
      "content": "Click Continue ."
    },
    {
      "title": "Select a style and click Continue.",
      "content": "Select a style and click Continue . Rasterbator lets you choose from an assortment of styles to add an artistic effect to your poster. Click a style (a preview will appear on the image), or select No effects to skip this step. Rasterbation and Black and white rasterbation are popular choices that print in a halftone style, comprised of many dots."
    },
    {
      "title": "Select your color preferences and click Continue.",
      "content": "Select your color preferences and click Continue . If you selected a style, you’ll be able to choose additional options for the final product. If you chose No effects , none of these menu options will affect your poster."
    },
    {
      "title": "Select your final style options.",
      "content": "Select your final style options. These options will vary depending on the style you selected. If you did not select a style, you can still browse through the drop-down menu at the top of the screen to add some effects to your final product. If you decide not to use any, select Enlarge from the menu. To make it easy to trim off the margins, check the box next to “Crop marks.” This is optional and is not necessary if you added the 5mm overlap."
    },
    {
      "title": "Click Complete X page poster!.",
      "content": "Click Complete X page poster! . The “X” represents the number of pages you’re printing. The site will now build your image."
    },
    {
      "title": "Download the PDF.",
      "content": "Download the PDF. Click OK or Save (the options vary by computer and browser) to download the finished image that’s ready to print onto multiple pages."
    },
    {
      "title": "Open the PDF.",
      "content": "Open the PDF. Double-click the file you downloaded from Rasterbator to open it in your computer’s default PDF reader. Rasterbator recommends using Adobe X Reader , but any reader is fine. [2] X Research source"
    },
    {
      "title": "Click the File menu.",
      "content": "Click the File menu. If you’re using Windows, it’s in the menu bar at the top of the PDF reader. If you’re using a Mac, it’s in the menu bar at the top of the screen."
    },
    {
      "title": "Click Print.",
      "content": "Click Print . This opens your computer’s printing options."
    },
    {
      "title": "Select your printer.",
      "content": "Select your printer. If the printer you want to use does not appear in the “Printer” drop-down, click the drop-down to select it now."
    },
    {
      "title": "Select a paper size.",
      "content": "Select a paper size. Click Size or Paper Size , then select the size you selected in Rastorbator."
    },
    {
      "title": "Select the “Scale to fit” option.",
      "content": "Select the “Scale to fit” option. If you’re using a Mac, you may have to click Show Details to see your printer options. [3] X Research source In macOS, select Scale to Fit . If you’re using Adobe Reader for Windows, check “Fit” under “Paper size & handling.”"
    },
    {
      "title": "Make sure your printer is not set up to print on both sides of the paper.",
      "content": "Make sure your printer is not set up to print on both sides of the paper. For the poster to print properly, each page must print on its own sheet. If you’re using Windows, make sure “Print on both sides of the paper” is NOT checked. If you’re using macOS, select Layout from the drop-down menu at the center of the printer screen, then make sure “Two-sided” is set to None ."
    },
    {
      "title": "Click Print.",
      "content": "Click Print . This sends your poster to the printer."
    },
    {
      "title": "Arrange the pages in order.",
      "content": "Arrange the pages in order. It’s best to use a large surface for this. If you printed the image across many sheets, it may be difficult to figure out which sheet goes where. Fortunately, there’s a marker at the bottom-right corner of each page that tells you how to connect the sheets. [4] X Research source"
    },
    {
      "title": "Trim the margins.",
      "content": "Trim the margins. Use the crop marks on the outside of the image as a guide for cutting. It’s best to use a utility knife and a ruler to get a clean line."
    },
    {
      "title": "Join your pages together to form one large image.",
      "content": "Join your pages together to form one large image. You can use any method you wish, such as tape, gluing it to a board, or pinning each sheet to your wall. It may be helpful to use a small piece of tape on the edge of each adjoining sheet when the poster is face-up on the ground so you can easily move it. Alternatively, you can print multiple images on one sheet of paper or print on both sides of your paper ."
    }
  ]
}