{
  "url": "https://www.wikihow.com/Know-if-Someone-Considers-You-a-Best-Friend",
  "title": "How Do You Know if Someone Considers You Their Best Friend? Get the Scoop on Your BFF",
  "steps": [
    {
      "title": "Best friends spend a lot of time communicating.",
      "content": "Best friends spend a lot of time communicating. They won't leave you wondering where they are or what they're thinking for very long. Instead, they'll text updates on what's going on to keep you in the loop. These may include frantic messages after a bad date or funny memes that they think you'd like. If you don't text back, they'll likely double or triple-text you until you reply. [1] X Research source This friend will text you first after they get asked out by their crush, and they may even send you updates from the date. They might frequently send you screenshots, memes, or funny YouTube clips that they know you'll enjoy."
    },
    {
      "title": "In a tight-knit friendship, a friend will make time for you in their life.",
      "content": "In a tight-knit friendship, a friend will make time for you in their life. [2] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 12 January 2021. Does your friend ask you to hang out every week? Even every day? If the answer is yes, it means they really love being around you and enjoy spending time with you. [3] X Research source If you're always the one initiating plans, that may be a sign that you're not quite as close yet. It's also possible that your friend is just a little shy about making plans. Reader Poll: We asked 992 wikiHow readers about which signs mean someone wants to be your friend and isn't just being polite, and only 9% of them said if they give you hugs . [Take Poll] Instead, regularly reaching out to you and making plans to hang out might better signal that they want to be friends."
    },
    {
      "title": "This friend drops everything to help you in their time of need.",
      "content": "This friend drops everything to help you in their time of need. Whether you had a terrible day at work or you're going through a health crisis, a friend that really cherishes you is always there for you. After they've helped you, they'll call or text to check up on you just to make sure that everything is okay. [4] X Research source Other things this friend may do to show that they care is bring you takeout, lend you a shoulder to cry on, or send you flowers and a note if they live out of town. Be wary of friends that seem to disappear when times get tough. Though no one is perfect, a true friend sticks by your side when life takes a turn for the worse."
    },
    {
      "title": "Best friends don’t need to schedule conversations.",
      "content": "Best friends don’t need to schedule conversations. They'll call to ask a random question, make plans, or just to see how your day is going. In this day and age, phone calls are a little more scheduled. It's a good sign if someone is comfortable enough with you to call and chat anytime! [5] X Research source This friend may call you out of the blue to see if they can pick you up and get ice cream. They might also call to ask a random question, like, \"I just realized I don't know who your favorite band is! You have 5 seconds to decide.\""
    },
    {
      "title": "No subject is considered off-limits or boring.",
      "content": "No subject is considered off-limits or boring. You may talk about the weird dreams you had the night before, funny experiences that happened during your family reunion, or the music playing in the waiting room at the dentist's office. Regardless of the subject, this friend listens to your stories and anecdotes like they're the most important thing in the world. [6] X Research source To show that they're really listening, a true friend will pay attention when you're talking to them. They'll nod along as you speak, ask questions to learn more and keep their eyes on you instead of their phone."
    },
    {
      "title": "Besties encourage each other.",
      "content": "Besties encourage each other. They want to see you succeed, whether it's at basketball tryouts, your new job, or your personal dreams like showing your art in a museum. [7] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 12 January 2021. Whatever your goals may be, this friend believes in you and makes it known. [8] X Research source Someone that makes fun of you or belittles you are not treating you like a best friend, even if they say that's what you are."
    },
    {
      "title": "A true friend gives you real feedback.",
      "content": "A true friend gives you real feedback. If this friend sometimes says things that you don't want to hear, that doesn't necessarily mean that they don't consider you a best friend. In fact, it may mean that they really care about you. Truly close friends know when to give someone advice or steer their friend in a different direction if they're concerned for them. [9] X Research source Maybe you've been seeing someone that doesn't treat you super well. A friend that really values you would likely say something like, \"You deserve someone that treats you with respect.\""
    },
    {
      "title": "This friend doesn't make you feel bad about who you are.",
      "content": "This friend doesn't make you feel bad about who you are. They know that your friendship means too much to judge you on something silly like the clothes you wear or the music you enjoy. [10] X Expert Source Tracy Carver, PhD Licensed Psychologist Expert Interview. 12 January 2021. If you feel like you can say or do anything that comes to mind when you're hanging out with your friend, that's a sign that you've reached best friend territory. [11] X Research source If this person makes you feel self-conscious around them or you feel like you can't be yourself, they're not treating you like their best friend."
    },
    {
      "title": "Best friends help each other through tough times.",
      "content": "Best friends help each other through tough times. They may ask for your advice, call when they're upset or overwhelmed, or depend on you for help with their schoolwork. Everyone asks for help in different ways. If you're the one this person calls when life gets difficult, you're likely very important to them. [12] X Research source Your friend may lean on you for support after a gnarly breakup or ask you to quiz them all night for an upcoming final. Big or small, they go to you when they need anything."
    },
    {
      "title": "This person opens up to you about things they don't tell anyone else.",
      "content": "This person opens up to you about things they don't tell anyone else. Notice if your friend tells you things like their embarrassing middle school stories or even mistakes they've made in the past. Being vulnerable is a key component to close friendships. If this person is comfortable being themselves around you, you probably mean the world to them. [13] X Research source Notice if your friend confides in you about their struggles and seeks your advice. Listening to your opinion and feedback is a clear sign that they trust you."
    },
    {
      "title": "This friend doesn't leave you guessing about how they feel about you.",
      "content": "This friend doesn't leave you guessing about how they feel about you. They'll say thank you when you help them and express words of appreciation often. They may even give you thoughtful gifts or write you kind notes. Regardless of how they show it, they let you know how important you are to them. [14] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source This friend may make you a playlist to help you recover from a breakup, give you a comic book you've been dying to read on your birthday or write you a sweet postcard when they're on vacation."
    }
  ]
}