{
  "url": "https://www.wikihow.com/Deal-with-Hair-Loss-in-Cats",
  "title": "How to Deal with Hair Loss in Cats",
  "steps": [
    {
      "title": "Understand why it is important to determine the underlying condition.",
      "content": "Understand why it is important to determine the underlying condition. For each of these conditions, the key to dealing with the hair loss is treating the underlying illness. It is unlikely that hair loss will be the only symptom of the condition. For instance those with skin infections of whatever sort (bacterial folliculitis, demodectic mange, and ringworm) are likely to be itchy, whilst a cat with Cushing's disease will be thirsty."
    },
    {
      "title": "Recognize signs of bacterial folliculitis.",
      "content": "Recognize signs of bacterial folliculitis. When your cat has this condition, his skin becomes heavily infected with bacteria which grow down the hair shaft into the root, which can cause a good deal of damage. This damaged hair is then accidentally licked away when the cat grooms himself. [1] X Research source Skin diseases in old dogs and cats. R E Halliwell. Vet Rc 126(16), 389-394 Treatment may require sedation of the cat so that he can be bathed with a medicinal shampoo in order to decrease the numbers of bacteria on the skin surface. The cat may also be given a course of oral antibiotics for four to six weeks. A broad spectrum antibiotic such as amoxicillin is generally prescribed."
    },
    {
      "title": "Know that telogen defluxion can be caused by stress.",
      "content": "Know that telogen defluxion can be caused by stress. This condition leads to a symmetrical hair loss that happens all at once. Telogen defluxion is generally triggered by a stressful event, like pregnancy, lactation, severe illness, or surgery. The hair loss tends to happen about a month after the stress. No treatment is needed for this condition because the skin is not damaged and so the hairs grow back on their own once the stressful event has passed."
    },
    {
      "title": "Treat ringworm as it occurs.",
      "content": "Treat ringworm as it occurs. Ringworm is not a worm but a fungal parasite called Microsporum canis , which grows down a cat’s hair shaft. The cat’s body will recognize that hair shaft as damaged, and the hair will fall out. Treatment includes clipping your cat’s hair short to reduce contamination from shed hairs, and an oral medication such a griseofulvin, ketoconazole, or itraconazole. Griseofulvin acts by stopping fungal cell division. [2] X Research source Absorption of the drug is enhanced by fat, and the medication is best given with a knob of butter. A typical dose is 125 mg twice daily for an average-sized cat."
    },
    {
      "title": "Recognize and treat Cushing’s disease.",
      "content": "Recognize and treat Cushing’s disease. Hyperadrenocorticism, which is also known as Cushing's disease, is extremely rare in cats. It occurs when a cat’s body produces too much natural cortisol. This makes the cat hungry and thirsty, and physical changes take place such as a potbelly, thin skin, and hair loss. [3] X Research source Skin diseases in old dogs and cats. R E Halliwell. Vet Rc 126(16), 389-394 Treatment involves giving a daily capsule containing trilostane which inhibits the glands that produce cortisol."
    },
    {
      "title": "Treat demodectic mange.",
      "content": "Treat demodectic mange. The demodex mange mite is rare, but when it occurs it likes to live near your cat’s hair shafts. This mite can cause damage to the hair, which causes it to shed easily. When a cat's hair sheds easily, it can result in bald spots. Use caution when treating demodectic mange, as some treatments are toxic to cats. Topical treatments like lime sulfur dips and 1% selenium sulphide shampoos can be effective and are safe for cats. Follow the directions listed on the container."
    },
    {
      "title": "Understand why cats may lose their hair because of allergies.",
      "content": "Understand why cats may lose their hair because of allergies. Cats can develop allergies to irritants in the environment around them, as well as to different foods. These allergies manifest themselves as itchy skin and occasionally diarrhea or vomiting. This itchiness can result in the cat licking herself too much, which damages the hair shafts; this in turn can make it look like she is losing patches of her hair."
    },
    {
      "title": "Monitor your cat’s hair loss.",
      "content": "Monitor your cat’s hair loss. You may get a clue that your cat has an allergy to a certain pollen or grass if his itchiness or baldness is seasonal. For example, your cat may only lose fur in the spring or summer when a certain pollen is in the air. If you see that your cat does appear to have seasonal allergies, talk to your vet about trial steroids. Some veterinarians will give cats some allergy-fighting steroids that may help to reduce the itch and allows the cat’s coat to return to normal."
    },
    {
      "title": "Put your cat on a trial hypoallergenic diet.",
      "content": "Put your cat on a trial hypoallergenic diet. Unfortunately, food allergies cannot be controlled by steroids, and the cat will continue to react poorly unless the allergen is eliminated from his diet. Put your cat on a commercial, prescription diet (like Hills ZD or Purina HA). Do not feed your cat anything else. It may take up to eight weeks to flush your cat’s system of the allergen. If a food allergy was the problem, then after eight weeks on a hypoallergenic diet the cat should be more comfortable and should have stopped over grooming, which should result in the regrowth of the bald patches."
    },
    {
      "title": "Understand that arthritis can lead to hair loss.",
      "content": "Understand that arthritis can lead to hair loss. A cat who is suffering from arthritis may lick the joint that is causing him pain. This arthritic pain can be controlled by giving your cat painkillers, which should reduce his desire to lick the affected area. Talk to your vet if you think your cat is suffering from arthritic pain."
    },
    {
      "title": "Consider giving your cat meloxicam.",
      "content": "Consider giving your cat meloxicam. Meloxicam (Metacam) belongs to a family of drugs called NSAIDs (Non-steroidal Anti-inflammatory Drugs). Meloxicam works by inhibiting an enzyme, COX-2, which triggers prostaglandin release, which in turn limits the inflammation that leads to fever and pain. This medication may help reduce your cat’s arthritic pain. Talk to your veterinarian before giving your cat this medication."
    },
    {
      "title": "Do not give your cat meloxicam if he is dehydrated.",
      "content": "Do not give your cat meloxicam if he is dehydrated. Meloxicam should only be given to well-hydrated animals. Dehydrated animals may have impaired renal function and the additional decrease in blood supply to the kidney caused by the medication may tip the animal into renal failure. Likewise, meloxicam must be given with or after food. Do not give your cat meloxicam if he is taking other NSAIDs or steroids of any kind."
    },
    {
      "title": "Understand that fleas can be a common cause of hair loss.",
      "content": "Understand that fleas can be a common cause of hair loss. Biting parasites like fleas can be a common source of irritation that can lead to hair loss. However, these pests can be difficult to spot. Instead, look for flea dirt, which is the dried blood left behind when a flea bites your cat’s skin. Brush your cat’s hair in the opposite direction and look for brown flakes or specks. Wet a paper towel and put some of these flecks on the towel. When the flea dirt comes into contact with the moisture, it should become red or orange again as the blood is reconstituted."
    },
    {
      "title": "Treat your cat regularly for fleas.",
      "content": "Treat your cat regularly for fleas. Flea medication generally acts by inhibiting nerve transmission in fleas, which causes them to become paralyzed and die. Common flea medications contain fipronil or selamectin. The recommended dose of flea medication is generally 6 mg/kg that is applied to the skin on the back of the cat's neck."
    },
    {
      "title": "Treat all of the animals in your house.",
      "content": "Treat all of the animals in your house. If you have more than one pet in your house, it is important that you treat all of them for fleas, so long as they have fur. If you only treat one animal, it is very likely that they pick up fleas again from the other animal in your house. You should also consider using an insecticide (or ‘flea bomb’) in your house to remove fleas from your furniture and carpets."
    },
    {
      "title": "Consider psychological issues if all other causes of hair loss have been ruled out.",
      "content": "Consider psychological issues if all other causes of hair loss have been ruled out. Psychogenic behavior is sometimes called obsessive-compulsive behavior and is a reaction to stress. In order to reach a conclusion that the cause of the over-grooming is psychological, all other possible causes of hair loss need to be tested for and ruled out."
    },
    {
      "title": "Be aware that cats can become addicted to licking their fur.",
      "content": "Be aware that cats can become addicted to licking their fur. The act of licking causes the release of endorphins (natural occurring morphine-like substances) into the cat's bloodstream. This gives the cat a natural \"high\" to which they can become addicted. [4] X Research source Psychogenic alopecia in cats. L. Swayer et al. JAVNA 214(1), 71-74 The trigger to the original episode of licking is usually a stressful event such as a stray cat moving into a new home. The cat resorts to licking to calm himself, and becomes hooked on the habit."
    },
    {
      "title": "Reduce your cat’s stress to help him break the habit.",
      "content": "Reduce your cat’s stress to help him break the habit. To do this, try to show your cat that he has no competition for resources such as food, water, or sleeping spots. Provide plenty of toys to keep your cat occupied. You should also give your cat plenty of places to hide if he is feeling stressed."
    },
    {
      "title": "Consider using a synthetic pheromone.",
      "content": "Consider using a synthetic pheromone. Synthetic pheromones, such as Feliway, are chemical messengers that you can pump into the air to make your cat feel calm. The scent the synthetic pheromone produces is a scent that reassures the cat because his body interprets it as a feeling of safety. [5] X Research source Psychogenic alopecia in cats. L. Swayer et al. JAVNA 214(1), 71-74 These synthetic pheromones come in spray bottles, which you can use to spray on the cat’s bedding, or as room diffusers, which help to make your whole house smell safe to your cat."
    }
  ]
}