{
  "url": "https://www.wikihow.com/Put-Someone-in-the-Recovery-Position",
  "title": "How to Put Someone in the Recovery Position",
  "steps": [
    {
      "title": "Check for breathing and consciousness.",
      "content": "Check for breathing and consciousness. Before you decide to put someone in the recovery position, it's important that you take a moment to assess the situation. Check to see if the person is unconscious, but breathing, and has no other life-threatening conditions. Talk to the person to assess if he is responsive. Check for breathing by placing your cheek near the nose and mouth of the person to feel his breath. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If the person is breathing and unconscious or semi-conscious, you can place him in the recovery position."
    },
    {
      "title": "Consider possible spinal injuries.",
      "content": "Consider possible spinal injuries. If you suspect the person has a spinal injury, do not attempt to move her until the paramedics arrive. If she is struggling to breathe and it is necessary to open her airway, place your hands on either side of her face, and gently lift her jaw upwards. Be careful not to move her neck. Spinal injuries may be present if the person: [2] X Research source Has suffered a head injury, a major blow to the back of the head, a fall from a height between five and ten feet, and is (or has been) unconscious. Complains of severe pain in her neck or back. Won't move her neck. Feels weak, numb or paralysed. Has twisted her neck or back. Has lost control of her limbs, bladder or bowels. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Position the arms and legs.",
      "content": "Position the arms and legs. Once you have established that it is safe to put him into the recovery position, kneel down to one side of him so you can position the arms. Place the arm nearest to you at a right angle to his body, so the elbow is towards you. The palm should be facing up and in front of the head. Then take the other arm and place it across his chest. Tuck the hand under the side of his head, so the back of the hand is against the cheek. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source After positioning the arms, you should bend the knee of the leg farthest away from you, so the foot is flat on the floor. [5] X Research source"
    },
    {
      "title": "Roll her over towards you.",
      "content": "Roll her over towards you. When you have positioned the arms and legs, you can gently roll her onto her side. Take hold of the raised knee, and carefully pull it towards you and down. Ensure that the hand you placed under the head stays there and supports the head. Be slow and careful to ensure you do not bang the head against the ground. [6] X Research source The arm you extended out a right angle will stop her from rolling over any further. Rolling too far can block free expansion of the chest and impede breathing. You can also roll the person by grabbing her firmly by the hip — either by a belt or the waistband of her pants, or by a front pocket — and pulling, with one hand on the shoulder farthest from you for stabilization."
    },
    {
      "title": "Open the airway.",
      "content": "Open the airway. Once you have rolled the person over, and ensured that he is secure and the head is supported, you can open the airway a little. To do this, gently tilt the head back and lift the chin. Check that the airway is clear of any blockages. [7] X Research source Continue to monitor his pulse and breathing while you wait for help to arrive. Cover him with a blanket or coat to keep him warm."
    },
    {
      "title": "Place the infant face down over your arm.",
      "content": "Place the infant face down over your arm. The recovery position for an infant, a baby under one year old, is different. You should begin by carefully laying the infant over your arm, face down, and at a slight angle. The infant's head should be slightly lower than the body. [8] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Try to keep the elevation of the body above the head no more than five degrees. This keeps the baby from aspirating any fluids/blockages and encourages drainage."
    },
    {
      "title": "Support the neck and head.",
      "content": "Support the neck and head. When you lay the infant on your arm, you should be sure to support the neck and head with your other hand. So, if you are laying the infant over your left arm, place your right hand under her head and neck to support it. [9] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Keep the mouth and nose clear.",
      "content": "Keep the mouth and nose clear. When you supporting the infant's head, it's essential that you do not block the mouth and nose unwittingly. Note where your fingers are, and double-check that the infant can breathe. [10] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Wait for help.",
      "content": "Wait for help. Once you have placed the infant into the recovery position, monitor her breathing and wait for medical help to arrive. If the infant stops breathing at any point you may have to perform CPR . [11] X Research source"
    }
  ]
}