{
  "url": "https://www.wikihow.com/Load-and-Fire-a-Muzzleloader",
  "title": "How to Load and Fire a Muzzleloader",
  "steps": [
    {
      "title": "Distinguish between a flintlock rifle, a caplock, and an and in-line percussion muzzleloader.",
      "content": "Distinguish between a flintlock rifle, a caplock, and an and in-line percussion muzzleloader. There are three basic types of muzzleloaders, and you need to make sure that you select ammunition, powder, and a method of loading appropriate to each. The traditional muzzleloader is the flintlock rifle. These feature a more complex but authentic firing mechanism, and a longer \"twist rate,\" which refers to the length of time it takes for the bullet to make a rotation in the barrel. The twist rate affects the accuracy of the rifle. Traditional muzzleloaders with a longer twist rate are generally more accurate when using what are called \"buffalo\" bullets, which feature the traditional lead ball and a more modern \"bullet shaped\" lead. Flintlock rifles require a complex loading operation, fixing a piece of flint to the hammer to strike sparks onto the flashpan, an operation covered below. Caplock rifles have a side-mounted firing pin similar to the flintlock rifle, and operates and loads in much the same way, but uses a more modern pre-loaded firing cap to fire the rifle. Unless you're a very experienced firearms enthusiast, it's recommended to use this method and become familiar with the mechanics of muzzle loading before you attempt to fire a flintlock. [1] X Research source In-line percussion muzzleloaders are more modern-looking rifles that blur the line between old-school black powder rifles and contemporary smokeless models. They feature a shorter twist rate and are generally more accurate and easier to load than traditional muzzleloaders, and employ a firing cap in the pin."
    },
    {
      "title": "Choose an appropriate powder for your rifle.",
      "content": "Choose an appropriate powder for your rifle. Traditional black powder can be used in any variety of muzzleloader, though more modern pellet forms are also available. These are pre-measured into compact pellets that can be dropped into the barrel to load. Traditional powder has a tendency to rust barrels if not cleaned regularly and efficiently. Black powder absorbs moisture, making it sometimes volatile. When you're just getting started, consider using powder pellets as you get used to your rifle and the way it fires."
    },
    {
      "title": "Select an ammunition appropriate for your rifle.",
      "content": "Select an ammunition appropriate for your rifle. In the beginning, it can be somewhat difficult to figure out what ammo might be the most efficient and accurate for your gun. By becoming somewhat familiar with the way your rifle fires, though, and trying out the different types of muzzleloader shot, you can settle on something that works. Traditional \"round ball\" ammo is made of pure lead and designed to work with cloth patches. If you want to fire in the old-school way that the pioneers did, this is your ammo. If you're hunting, you might want to select something a little more accurate. Conical shot is a more \"bullet shaped\" muzzleloader shot. It tends to be a bit lighter, more accurate, and come in different sizes, depending on the bore of your rifle. \"Sabot\" refers to a small plastic shoe or sleeve used to nestle a rifled bullet in. Using a sabot is a way to increase the accuracy of your rifle and to use somewhat smaller, lighter bullets in a larger-bore rifle barrel. If you're planning on hunting with a muzzleloader, using a sabot with an appropriate-sized ammunition is recommended."
    },
    {
      "title": "Get some patches, wadding, and lubricant.",
      "content": "Get some patches, wadding, and lubricant. Most ammunition sold with wadding patches of the appropriate size, used to seat the shot against the powder charge. Wadding is usually a chunk of cloth or paper placed behind the projectile to seal the bore, or placed in front of it to prevent the ball(s) from simply rolling out the end of the barrel when the gun is pointed downwards. One of the best materials for this is known as \"Pillow Ticking\" and can be easily found at a fabric store. If you can't get it, just use paper towels. Lubricant is used to reduce friction and make the gun function better. In rifled guns, the barrel is lubricated as well as the patch (wad) after each shot to make the projectile easier to load down the rifled barrel."
    },
    {
      "title": "Get caps or flint.",
      "content": "Get caps or flint. Depending on the type of rifle you have, you'll also need firing caps to discharge your rifle, or you'll need flint for use in a flintlock rifle, to strike and spark and set off the powder in the flashpan. The most common cap is called the #11 cap, which has been in use for more than a hundred years. Musket caps are somewhat more powerful and are popular with hunters for that reason."
    },
    {
      "title": "Check the barrel.",
      "content": "Check the barrel. Verify that the gun is not loaded by putting the ramrod down the barrel and measuring the distance that it can reach. It must reach all the way to the location of the touch hole in the pan. Use your cleaning rod to clean the barrel of any black powder residue, dirt or dust that may have accumulated. While loading the gun, keep it aimed straight up in the air and avoid putting your face over the barrel at any time, even while you're loading it."
    },
    {
      "title": "Lubricate the barrel.",
      "content": "Lubricate the barrel. Most muzzleloaders will come with a swab (a piece of cloth used to lubricate the rifle) fitted to the slot in the cleaning rod. Apply gun lubricant to the inside of the barrel. Do not apply too much, as it can get in the touch hole and prevent ignition. A thin layer is sufficient, no more than the amount of sunscreen you'd put on your face"
    },
    {
      "title": "Measure your powder.",
      "content": "Measure your powder. Pour black powder from your horn or flask into the powder measurer to the appropriate mark, then pour the powder from the measurer into the muzzle. Tap the side of the rifle a few times with the flat of your hand to settle the powder."
    },
    {
      "title": "Load your bullet.",
      "content": "Load your bullet. Using the smaller end of the bullet-starter, push the bullet into the barrel. Be gentle. When you get to the end of the starter, pull it out and use the longer end to push it farther down. [2] X Research source Use the ramrod to seat the bullet securely on the powder charge. Use a short but firm motions to seat it, don't jam it in a stabbing motion like you see in old Civil War movies. There's a mark on the ramrod that will let you know when the bullet has been seated. When that mark lines up with the end of the barrel, the bullet should be seated properly. It's important to make sure the bullet is seated firmly on the charge, leaving no gaps between the powder and the bullet."
    },
    {
      "title": "Load your percussion cap.",
      "content": "Load your percussion cap. With the gun pointed in a safe direction, use your priming tool to seat the cap on the nipple. Make sure the safety is on, if your rifle has one, or that you're at half-cock, if you're using a side-lock rifle."
    },
    {
      "title": "Fix the flint into the hammer.",
      "content": "Fix the flint into the hammer. Pull the hammer back to the half-cock position. If there is no flint already in the gun, use a screwdriver or metal bar to loosen the screw which holds the top jaw of the cock in place. Use a rectangular scrap of leather the right size to enclose the flint, and fold it around the back of the flint. Place the flint with the leather in the jaws of the cock so that the sharp end protrudes towards the flash pan and tighten the screw securely."
    },
    {
      "title": "Pull the hammer to full-cock.",
      "content": "Pull the hammer to full-cock. Close the frizzen (the part that covers the pan) and test fire it by pulling the trigger. Ensure the lock produces a shower of sparks that hit the inside of the flashpan. If it doesn't, remove the flint and reattach it. Make sure everything is secure and striking appropriately. Take your time."
    },
    {
      "title": "Measure out your powder.",
      "content": "Measure out your powder. Loosen the screw on the side of the brass powder measurement. Draw the sliding end of the measurement back to the line that marks the amount of powder required for your specific gun and tighten the screw. Consult your firearms dealer to determine the correct amount of powder to use for your gun."
    },
    {
      "title": "Pour your powder into the barrel.",
      "content": "Pour your powder into the barrel. Lift the muzzle of the gun so that the barrel is perpendicular to the ground. Level off the top of the powder measurement and pour the powder into the barrel. Tap the side of the barrel with the heel of your hand a few times to ensure the powder all falls tho the bottom."
    },
    {
      "title": "Load the gun.",
      "content": "Load the gun. Place a lubricated patch over the end of the barrel. This patch should be larger than the ball and should be able to wrap around it. Press the patched ball into the barrel using the short end of the bullet starter. Continue to slide the ball or bullet down the barrel with the long side of the bullet starter. Use the blunt end of the ram rod to slide the ball down the rest of the barrel until it is seated firmly atop the powder. Use one steady motion to seat the bullet, don't jab into the gun like you see in the movies."
    },
    {
      "title": "Fill the flashpan.",
      "content": "Fill the flashpan. Once the ball has been seated, remove the ramrod and lay the gun across your lap. Fill the small brass flash pan powder dispenser with the FFFF powder used in flintlock rifles for this purpose. This can be done by unscrewing the back of the dispenser and pouring powder in until it is about 3/4 full. Pull the hammer back again to half-cock. If the frizzen (pan cover/striking surface) is not already open, open it, and press the pointed end of the powder dispenser against the bottom of the shallow flash pan to release the powder. Fill the pan with powder making sure to tilt the gun slightly so that the powder enters the touch hole located at the side of the barrel within the flash pan. Once the pan is full, close the cover tightly. Your gun is loaded and ready to fire."
    },
    {
      "title": "Secure the butt of the gun",
      "content": "Secure the butt of the gun firmly against your shoulder. Pull the hammer to full-cock, and aim the muzzle at your target. Be sure that no one is standing directly beside you in front of the touch hole. Sparks will fly and you want to make sure everyone is clear of the expulsion. Always wear the appropriate ear and eye protection when firing a muzzleloader. It's loud. Practice good gun safety ."
    },
    {
      "title": "Aim the rifle.",
      "content": "Aim the rifle. Look down the length of the barrel through the open sights. When all three sights are in line both vertically and horizontally upon the target you wish to hit, take a deep breath and hold it. Some muzzleloaders don't have much in the way of sights. You can consider updating your old-school weapon by fitting it with more modern sights. This is especially recommended if you plan on hunting with your muzzleloader."
    },
    {
      "title": "Remove the safety and squeeze the trigger.",
      "content": "Remove the safety and squeeze the trigger. Keep the rifle securely in your shoulder and follow through, holding your position and waiting until the smoke clears (there will be a lot) before dropping your posture and looking at your target. In a flintlock rifle, the flint will slam down, scraping down the inside of the frizzen and flipping open the flashpan, creating sparks which fall into the powder in the now open flashpan. This powder ignites, making a flash of flame which travels into the touch hole and ignites the main charge."
    }
  ]
}