{
  "url": "https://www.wikihow.com/Blessed-Be-Meaning",
  "title": "What Does \"Blessed Be\" Mean in Wicca?",
  "steps": [
    {
      "title": "“Blessed be” is a Wiccan phrase used to wish positivity onto someone.",
      "content": "“Blessed be” is a Wiccan phrase used to wish positivity onto someone. The phrase is typically said in relation to receiving a blessing from the Wiccan Goddess or God. Some other Pagans have also adopted the phrase into their own practices. [1] X Research source Saying “Blessed be” is the equivalent of saying something like “May God be with you” or “May God bless you.” While it is common for Wiccans and other Pagans to use the phrase, it’s not a requirement. Some Pagans say “Blessed be” on a daily basis while others rarely, if ever, say it."
    },
    {
      "title": "In greeting",
      "content": "In greeting Wiccans commonly use “Blessed be” as a way to greet fellow practitioners at a gathering or to let others know they’re Wiccan. Many Pagan religions and practices are very individualistic, so using the phrase is often a way to build a sense of union and community. [2] X Research source"
    },
    {
      "title": "During a prayer or spell",
      "content": "During a prayer or spell Many Wiccans say “Blessed be” to enhance their intentions. They use the phrase to ask for the gods’ blessing and to ensure their prayers will be heard. [3] X Research source"
    },
    {
      "title": "To close a ritual",
      "content": "To close a ritual Wiccans often say “Blessed be” to seal their ritual and magic. When they say this phrase at the end of a ritual, it allows the gods to hear their intentions and allows the magic to begin working. [4] X Research source"
    },
    {
      "title": "The phrase originated in Gardnerian Wicca.",
      "content": "The phrase originated in Gardnerian Wicca. Gardnerian Wicca is an early form of the religion that follows the teachings of Gerald Gardner, which were published in the 1950s. While this is up to debate amongst the Pagan community, Gardner claimed to have been initiated into a coven of witches that practiced ancient magic, which he adopted into his own religion. [5] X Research source"
    },
    {
      "title": "It was used in a ritual practice called the Five Fold Kiss.",
      "content": "It was used in a ritual practice called the Five Fold Kiss. The Five Fold Kiss is an initiation ritual performed in Gardnerian Wicca practices in which five parts of the initiate’s body are kissed. These five parts represent the five points of a pentagram and are accompanied by a blessing. [6] X Research source The standard blessing is as follows: “Blessed be thy feet, which have brought thee in these ways. Blessed be thy knees, that shall kneel at the sacred altar. Blessed be thy womb, without which we would not be. Blessed be thy breasts, formed in beauty. Blessed be thy lips, that shall utter the Sacred Names of the gods.”"
    },
    {
      "title": "The phrase may have been adopted from Christianity.",
      "content": "The phrase may have been adopted from Christianity. Wicca is a relatively new religion, so while this phrase is most closely associated with it, it may have Christian origins. For example, the King James Bible includes the verse, “Blessed be the name of the Lord.”"
    },
    {
      "title": "A variation of the phrase is used in pop culture.",
      "content": "A variation of the phrase is used in pop culture. The book and television series The Handmaid’s Tale uses the phrase “Blessed be the Fruit” as a form of greeting. This comes from the Bible verse Luke 1:42 which states, “Blessed is the fruit of thy womb.” When someone says this greeting, the typical response is \"May the Lord open.\" Both phrases refer to a blessing of fertility on the handmaids."
    }
  ]
}