{
  "url": "https://www.wikihow.com/Know-if-You-Have-Bipolar-Disorder",
  "title": "How to Know if You Have Bipolar Disorder",
  "steps": [
    {
      "title": "Recognize the signs of mania.",
      "content": "Recognize the signs of mania. During a manic period, feelings of euphoria, creativity, and heightened awareness are common. [4] X Research source Manic periods may last a few hours or stretch on for days or weeks. [5] X Trustworthy Source National Institute of Mental Health Informational website from U.S. government focused on the understanding and treatment of mental illness. Go to source The Mayo Clinic describes the following signs of mania: [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Having a feeling of being \"high,\" - so high, in some cases, that one feels invincible. This is often accompanied by the feeling that one has special powers or is godlike. Dealing with racing thoughts. Thoughts may jump from subject to subject so quickly that it's difficult to keep up or concentrate on one thing. Talking so quickly that others can't make sense of what one is saying, and feeling jumpy and restless. Staying up all night or sleeping for only a few hours at a time, but never feeling tired the next day. Exhibiting reckless behavior. During a manic episode, a person might sleep with several people and not use protection. They may gamble large amounts of money or make risky business investments. An individual might also spend money on large, expensive items, quit a job, and so on. Exhibiting extreme irritability and impatience with others. This can escalate into starting arguments and picking fights with people who don't go along with one's ideas. In rare cases, delusions, hallucinations, and visions can occur (e.g. believing to hear the voice of God or an angel)."
    },
    {
      "title": "Know the symptoms of bipolar depression.",
      "content": "Know the symptoms of bipolar depression. For those with bipolar disorder, the periods of depression are longer and more frequent than periods of mania. Watch for these symptoms: [7] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source An inability to experience pleasure, joy, or even happiness. Feelings of hopelessness and inadequacy. Feelings of worthlessness and guilt are also common. Sleeping more than normal and feeling tired and sluggish all the time. Gaining weight and having changes in appetite. Experiencing thoughts of death and suicide."
    },
    {
      "title": "Understand the signs of a hypomanic episode.",
      "content": "Understand the signs of a hypomanic episode. A hypomanic episode is an abnormally and persistently elevated mood that lasts for four days. It can also include irritability and other symptoms. [10] X Research source American Psychiatric Association. (2000). Diagnostic and Statistical Manual of Mental Disorders (4th ed., text rev.). Washington, DC: Author. Hypomania is different from a manic episode in that it is usually less severe. Watch out for: [11] X Research source American Psychiatric Association. (2013). Diagnostic and Statistical Manual of Mental Disorders: DSM-5. Washington DC: American Psychiatric Association. Feelings of elation Irritability Inflated self-esteem or grandiosity Decreased need for sleep Pressured speech (speech that is rapid and intense) Flight of ideas (when one's brain seems to move rapidly from one idea to another) Distractibility Psychomotor agitation, such as bouncing your leg or tapping your fingers, or an inability to sit still Unlike mania, hypomania typically does not result in hospitalization. While someone experiencing hypomania might feel elated, have an increased appetite or sex drive, and may have intense interactions with others, they would likely still be able to go to work and manage ordinary tasks without many, if any, negative consequences. Delusions and hallucinations are also not present in hypomania. [12] X Research source American Psychiatric Association. (2000). Diagnostic and Statistical Manual of Mental Disorders (4th ed., text rev.). Washington, DC: Author."
    },
    {
      "title": "Understand mixed features.",
      "content": "Understand mixed features. In some cases, people experience mania and depression at the same time. These individuals experience depression and irritability, racing thoughts, anxiety, and insomnia simultaneously. Mania and hypomania can qualify as having mixed features if there are also three or more symptoms of depression. For example, imagine someone is engaging in risky behaviors. They are also experiencing insomnia, hyperactivity, and racing thoughts. This satisfies the full criteria for mania. If this person also experiences at least three symptoms of depression, this is a manic episode with mixed features. Example might be feelings of worthlessness, loss of interest in hobbies or activities, and recurrent thoughts of death. [13] X Research source"
    },
    {
      "title": "Know the characteristics of bipolar I disorder.",
      "content": "Know the characteristics of bipolar I disorder. This form of bipolar disorder is the most commonly known manic-depressive form of the illness. A person classified as having bipolar I must experience at least one manic episode or mixed episode. People with bipolar I disorder may also experience a depressive episode. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source People with bipolar I are the most likely to experience highs that lead to risky behavior. This form of the illness is often disruptive to one's work life and relationships. Those affected by Bipolar I are more likely to attempt suicide, with a completed suicide rate of 10-15%. [15] X Research source American Psychiatric Association. (2000). Diagnostic and Statistical Manual of Mental Disorders (4th ed., text rev.). Washington, DC: Author. People suffering from bipolar I are also at a high risk of having or developing a substance abuse problem. [16] X Research source American Psychiatric Association. (2000). Diagnostic and Statistical Manual of Mental Disorders (4th ed., text rev.). Washington, DC: Author. There is also a connection between bipolar I and hyperthyroidism. This makes it even more important to see a doctor. [17] X Research source American Psychiatric Association. (2000). Diagnostic and Statistical Manual of Mental Disorders (4th ed., text rev.). Washington, DC: Author."
    },
    {
      "title": "Understand the symptoms of bipolar II disorder.",
      "content": "Understand the symptoms of bipolar II disorder. This variation involves less intense manic episodes and full-blown depressive episodes. The person may sometimes experience a muted version of hypomania, but the underlying state is usually depression. [18] X Research source People with bipolar II disorder are often misdiagnosed as having depression. To tell the difference, one must look for the distinguishing characteristics of bipolar depression. Bipolar depression is different from MDD because it is often paired with manic symptoms. Sometimes there is overlap between the two. It takes a qualified professional to distinguish between these conditions. [19] X Research source American Psychiatric Association. (2013). Diagnostic and Statistical Manual of Mental Disorders: DSM-5. Washington DC: American Psychiatric Association. For people with bipolar II, mania may manifest as anxiety, irritability, or racing thoughts. Bursts of creativity and activity are less common. Like bipolar I, there is a high risk for suicide, hyperthyroidism, and substance abuse in bipolar II. [20] X Research source American Psychiatric Association. (2000). Diagnostic and Statistical Manual of Mental Disorders (4th ed., text rev.). Washington, DC: Author. Bipolar II tends to be more common in women than men. [21] X Research source American Psychiatric Association. (2000). Diagnostic and Statistical Manual of Mental Disorders (4th ed., text rev.). Washington, DC: Author."
    },
    {
      "title": "Look for the signs of cyclothymia.",
      "content": "Look for the signs of cyclothymia. This is a milder form of bipolar disorder that involves mood swings with less severe instances of mania and depression. The mood swings tend to operate on a cycle, going back and forth between depression and mania. According to the Diagnostic and Statistical Manual of Mental Disorders (DSM): [22] X Research source American Psychiatric Association. (2013). Diagnostic and Statistical Manual of Mental Disorders: DSM-5. Washington DC: American Psychiatric Association. Cyclothymia begins early in life and its onset is usually in adolescence and early adulthood. Cyclothymia is equally common in men and women. As with bipolar I and II, there is an increased risk of substance abuse for those affected by cyclothymia. Sleep disorders are also commonly found alongside cyclothymia."
    },
    {
      "title": "Look for seasonal changes in mood.",
      "content": "Look for seasonal changes in mood. It's common for people with bipolar disorder to experience a shift as the seasons change. In some cases, a manic or depressive episode will last an entire season. In other cases, the change in season prompts the beginning of a cycle that includes both mania and depression. Manic episodes are more common in the summertime. Depressive episodes are more common in the fall, winter and spring. This is not a hard and fast rule, however; some people experience depression in the summer and mania in the winter."
    },
    {
      "title": "Understand that having bipolar disorder doesn't always impair functionality.",
      "content": "Understand that having bipolar disorder doesn't always impair functionality. Some people with bipolar disorder have trouble at work and in school. In other cases, the person may seem to be doing just fine in these areas. Those with bipolar II and cyclothymia can often function at work and school. Those with bipolar I tend to have a harder time in these areas. [23] X Research source American Psychiatric Association. (2000). Diagnostic and Statistical Manual of Mental Disorders (4th ed., text rev.). Washington, DC: Author."
    },
    {
      "title": "Be aware of substance abuse issues.",
      "content": "Be aware of substance abuse issues. Up to 50 percent of people who suffer from bipolar disorder struggle with substance abuse. They use alcohol or other tranquilizers to stop racing thoughts during manic episodes. They may also use drugs to try to achieve a high when they're in a depressive episode. [24] X Research source Substances like alcohol have their own effects on mood and behavior. They can be difficult to distinguish from bipolar disorder. People who abuse drugs and alcohol are at greater risk of suicide. This is because substance abuse can increase the severity of both mania and depression. Substance abuse may also instigate a cycle of manic depression."
    },
    {
      "title": "Notice breaks from reality.",
      "content": "Notice breaks from reality. People with bipolar disorder are often out of touch with reality. This occurs both during periods of extreme mania and periods of severe depression. This can manifest as either a dangerously inflated ego or a sense of guilt that is not in proportion to real events. In some cases, psychosis and hallucinations occur. Breaks from reality happen most frequently in bipolar I during manic and mixed episodes. They occur less often in bipolar II and almost never in cyclothymia. [25] X Research source American Psychiatric Association. (2000). Diagnostic and Statistical Manual of Mental Disorders (4th ed., text rev.). Washington, DC: Author."
    },
    {
      "title": "Talk with your doctor.",
      "content": "Talk with your doctor. Because bipolar is a very serious disorder, you need to your doctor and tell them about your symptoms. They may hand your case over to a psychiatrist. Alternatively, you may also see a clinical psychologist or a therapist for diagnosis, but only psychiatrists can prescribe medicine. Medications used to treat bipolar disorder include mood stabilizers, antidepressants, antipsychotics, and anti-anxiety drugs. These medications work by blocking and/or regulating certain chemicals in the brain. They regulate dopamine, serotonin, and acetylcholine. [26] X Research source Young, L.T. (2004). What exactly is a mood stabilizer? Journal of Psychiatry and Neuroscience, 29(2), pp. 87-88. Mood stabilizers work to regulate a person's mood. They prevent the extreme highs and lows of bipolar disorder. Among these are drugs such as Lithium, Depakote, Neurontin, Lamictal, and Topamax. Antipsychotic medications help reduce psychotic symptoms like hallucinations or delusions during mania. They include Zyprexa, Risperdal, Abilify and Saphris. [27] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Antidepressant medications used to treat bipolar depression include Lexapro, Zoloft, Prozac, and others. Finally, to manage symptoms of anxiety, a psychiatrist might prescribe Xanax, Klonopin, or Lorazepam. [28] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Medications should always be prescribed by a qualified psychiatrist or physician. They should be taken as directed to avoid health complications. If you're concerned that you or a loved one has bipolar disorder, reach out to a therapist or psychiatrist for diagnosis. If you or a loved one is having suicidal thoughts, immediately contact a trusted loved one or friend. If you're in the United States, you can also call or text 988 for advice. [29] X Research source"
    }
  ]
}