{
  "url": "https://www.wikihow.com/End-a-Text-Conversation",
  "title": "How to End a Text Conversation",
  "steps": [
    {
      "title": "Excuse yourself by saying that you're about to start doing something.",
      "content": "Excuse yourself by saying that you're about to start doing something. After sending a few messages with someone, excuse yourself by saying something like “I’m about to go to the gym for a little, it was nice to talk!” This will hint to them that you probably won’t be responding to their messages for a little bit. [1] X Research source Be sure to tailor your responses depending on who you’re talking to. If you’re messaging with a coworker, you can say something along the lines of “I’m about to make some dinner. I’ll see you in the office on Monday!”"
    },
    {
      "title": "State why you aren’t available to talk right now.",
      "content": "State why you aren’t available to talk right now. Sometimes, ending a conversation is as simple as saying “I’m at work right now, I’ll talk to you soon!” Most people will be understanding as long as you have a real reason for ending the conversation. For example, if you’re at home, you can say “Someone’s at the door – we’ll chat more soon!” If you’re about to get in the car, you can send a quick message like “TTYL, I’m driving!” Avoid lying about what you’re doing or why you can’t talk. More often than not, the person talking to you will know that you’re being dishonest, and they might get upset."
    },
    {
      "title": "Tell them you’re going to bed if it’s late at night.",
      "content": "Tell them you’re going to bed if it’s late at night. Most people are pretty understanding if you have to end the conversation to get to sleep. Once you feel yourself starting to get tired, let your texting friend know that you’ll be heading to sleep soon. Try to avoid falling asleep while talking, which can seem rude! For example, you could say something like “I have to hit the sack – talk to you tomorrow!” if you know you’ll be able to talk then. If you don’t get to talk to them often, you could say something like “I’m so sleepy. Let’s catch up later this week!” and make plans to talk on the phone or even video call within the next few days."
    },
    {
      "title": "Respond with an emoji or two when appropriate.",
      "content": "Respond with an emoji or two when appropriate. When you’re talking to someone who you see in person often, responding with an emoji is a great way to pause the conversation until you see each other. Remember to make sure that the emoji is an appropriate response to their statement before you press send! [2] X Research source For example, if your roommate texts you “I’m bringing home pizza for dinner!” you could respond with the heart eyes emoji or the thumbs up emoji to let them know that you saw the message and you’re excited. If a friend or family member texts you saying “Are you free?” or “Can you talk later?” you can respond with the thumbs up or thumbs down emojis depending on your answer. This is a great way to end a conversation before it starts. Because you aren’t responding with words, the other person will be less likely to feel like they need to reply to your message."
    },
    {
      "title": "Wait to respond to messages if you have nothing to say.",
      "content": "Wait to respond to messages if you have nothing to say. If you’ve been texting for a while and don’t have anything to say, just wait to respond. Try to think of something within 15-30 minutes so it doesn’t seem like you’re ignoring the message. If you can’t think of something to say, end the conversation by making plans to talk later or saying that you’re busy. Don’t feel like you have to reply immediately to messages that you receive. If you don’t have anything to say, sometimes it’s best to just wait until you think of something important or funny to contribute."
    },
    {
      "title": "End on a flirty note with a cute comment or emojis.",
      "content": "End on a flirty note with a cute comment or emojis. When it comes time to end the conversation with your crush, keep things light and cute! Use an emoji like the kissy face or heart eyes emoji, and let them know you’re thinking about them even though you can’t talk. Before you go to sleep, say something like “Goodnight, I can’t wait to talk to you tomorrow! Xoxo” or “Sweet dreams!” If you want to lead into a different conversation for when you’re available to talk, try saying something like “I have to go right now, but what do you think about Drake’s newest album? Let’s discuss later!”"
    },
    {
      "title": "Make plans to talk later in person or on the phone.",
      "content": "Make plans to talk later in person or on the phone. If you’re talking to someone that you normally have contact with and won’t be able to respond for a while, make plans to talk to them later. Be specific with your plans so they know what time to expect to hear from you. [3] X Research source For example, if you’re in school, you can tell your partner in the morning, “I have classes all day today, but I’ll be done at 4:30. Want to meet at 5 for dinner?”"
    },
    {
      "title": "Thank them for a good time if you went on a date.",
      "content": "Thank them for a good time if you went on a date. Waiting to contact your crush after a date is a thing of the past. If you’ve been texting after your date, end the conversation by thanking them for a great night and suggesting that you do it again. [4] X Research source For example, you can say something like “Thank you so much for such a fun night! Let’s plan another one soon?” If you’re confident that they like you, you can be more bold. Try saying something like “I hope I dream about you tonight!”"
    },
    {
      "title": "Close the conversation casually if you’re not interested in them.",
      "content": "Close the conversation casually if you’re not interested in them. Talking to someone who has a crush on you can be a tricky situation. Try to remain friendly but be straightforward with your responses. [5] X Expert Source Maria Avgitidis Matchmaker & Dating Expert Expert Interview. 20 December 2019. If you don’t want to talk to them, let them know you aren’t interested and end the conversation there. [6] X Research source For example, if they ask you to hang out, you can say something like “You’re a nice person, but I’m just not interested in you that way.” Try not to suggest continuing the conversation or saying anything like “Talk to you later,” which can give them the wrong idea. If you ever feel unsafe after rejecting someone, tell a trustworthy person. Contact law enforcement as soon as possible if the person sends you threats or begins to act strangely."
    },
    {
      "title": "Excuse yourself from the group.",
      "content": "Excuse yourself from the group. Before you abruptly leave the conversation, send a message to let the other members know that you’re leaving. You don’t have to give a reason why, but telling them that you’re leaving might prevent them from adding you back into the group or putting you in future group messages. [7] X Research source You can say something like “Hey, I’m going to remove myself from this group. Getting all these messages is slowing my phone down!”"
    },
    {
      "title": "Open the message thread in the “Messages” app.",
      "content": "Open the message thread in the “Messages” app. Go to your “Messages” app, which is normally located on the bottom of the screen and looks like a green square with a speech bubble in it. Scroll through your message threads until you find the group that you want to leave. [8] X Research source Look for the names of the people in the group, or the group name. Depending on who started the group, they may have titled it based on the content of the message. If you can’t find the thread, use the search function in the message app by typing in a name of someone in the message."
    },
    {
      "title": "Tap on the “i” in the top right corner of the thread.",
      "content": "Tap on the “i” in the top right corner of the thread. The “i” with a circle around it will take you to the information page of the text message, where you can see the group members, shared pictures, and more. When you get to the information page, the top of the screen will say “Details.” [9] X Research source If you can’t find the “i,” try exiting out of the message and opening it back up again to make it reappear."
    },
    {
      "title": "Select “Leave this Conversation” in the information menu.",
      "content": "Select “Leave this Conversation” in the information menu. Below the names of the group members and the options to share your location, you should see a bar across the screen that says “Leave this Conversation” in red. Tap on the bar, and then tap on the button that pops up from the bottom of the screen. [10] X Research source If the button isn’t available, that means that it isn’t an iMessage thread because a member of the group doesn’t have iMessage. On an iPhone, you’re only able to leave iMessage groups. If the text of the bar appears in grey, that means that there are only 3 people in the group. In order to leave a group with 3 people, you have to add another person to the group to take your place."
    },
    {
      "title": "Turn on “Do Not Disturb” to mute notifications but stay in the group.",
      "content": "Turn on “Do Not Disturb” to mute notifications but stay in the group. The “Do Not Disturb” function turns off notifications from the group message, but allows you to see the conversation and respond when you’re not busy. Just above the “Leave this Conversation” bar, toggle the “Do Not Disturb” switch to be green rather than grey. [11] X Research source If you want to receive notifications from the group again, just turn the switch back to the original position. This only turns off notifications for one specific thread. If you don’t want to receive notifications at all on your phone, you can turn on the overall Do Not Disturb function."
    }
  ]
}