{
  "url": "https://www.wikihow.com/Change-Facebook-Color-Scheme",
  "title": "How to Change Facebook Color Scheme",
  "steps": [
    {
      "title": "Launch Google Chrome.",
      "content": "Launch Google Chrome. This method works if you use Google Chrome as your web browser. Look for it on your computer and open it."
    },
    {
      "title": "Visit the Chrome Web Store.",
      "content": "Visit the Chrome Web Store. Enter chrome.google.com/webstore in the address bar. The Chrome Web Store will load. You can get apps, extensions, and themes for Google Chrome here."
    },
    {
      "title": "Search for Facebook color scheme extensions.",
      "content": "Search for Facebook color scheme extensions. Use the search field on the top left corner of the page to search for extensions. Use “color” and “Facebook” as your search terms. Several will appear in your results. Filter the search for Extensions only by clicking on “Extensions” on the upper left corner. The results will show only extensions."
    },
    {
      "title": "Install an extension.",
      "content": "Install an extension. There are a lot of extensions available that can change the color scheme in Facebook. One of the most popular is “FB Color Changer.” Click the “Add to Chrome” button to install it."
    },
    {
      "title": "Log into Facebook.",
      "content": "Log into Facebook. Enter facebook.com on the address field then use your Facebook account and password to log in. The login fields are found in the upper-right corner of the page. Click the “Log in” button to proceed."
    },
    {
      "title": "Open the extension.",
      "content": "Open the extension. The button for the extension will appear on the header bar. The button’s color is pink. Click on it, and a small window will pop up for the FB Color Changer."
    },
    {
      "title": "Change the color scheme.",
      "content": "Change the color scheme. The FB Color Changer window has a color picker. Click the color you want to use as your Facebook color theme. You will see it applied immediately. You can now have a Facebook page in whatever color you desire."
    },
    {
      "title": "Launch Mozilla Firefox.",
      "content": "Launch Mozilla Firefox. This method works if you use Mozilla Firefox as your web browser. Look for it on your computer and open it."
    },
    {
      "title": "Go to Add-ons.",
      "content": "Go to Add-ons. Click the button with three horizontal bars in the upper-right corner of the browser to open the menu. Click the puzzle icon for “Add-ons”. The Add-ons Manager will load in a new tab or window. You can also directly get to this page by entering about:addons in the address bar. The Add-ons Manager is where you search and download add-ons for Firefox."
    },
    {
      "title": "Search for Facebook color scheme add-ons.",
      "content": "Search for Facebook color scheme add-ons. Use the search field on the top right corner of the page to search for add-ons. Use “color” and “Facebook” as your search terms."
    },
    {
      "title": "Install an add-on.",
      "content": "Install an add-on. There are a lot of add-ons available that can change the color scheme in Facebook. One of the most popular is “Facebook Color Changer.” Click the “Install” button to install it."
    },
    {
      "title": "Log into Facebook.",
      "content": "Log into Facebook. Go to facebook.com and use your Facebook account and password to log in. The login fields are found in the upper-right corner of the page. Click the “Log in” button to proceed."
    },
    {
      "title": "Open the add-on.",
      "content": "Open the add-on. The button for the add-on will appear on the header toolbar of the browser. The button’s color is pink. Click on it, and a drop-down list of different predefined colors will appear."
    },
    {
      "title": "Change the color scheme.",
      "content": "Change the color scheme. Click the color you want to use as your Facebook color theme. You will see it applied immediately. You can now have a Facebook page in various colors, which you can change as often as you want."
    }
  ]
}