{
  "url": "https://www.wikihow.com/Make-Pancakes",
  "title": "How to Make Pancakes",
  "steps": [
    {
      "title": "Crack the eggs",
      "content": "Crack the eggs into a bowl and beat until creamy. Add in the dry ingredients (excluding the salt and baking soda if using self-rising flour). Do not stir the mixture at this point!"
    },
    {
      "title": "Melt",
      "content": "Melt the butter in a microwave-safe bowl. Make sure that it's completely melted; about a minute is sufficient."
    },
    {
      "title": "Add the butter and milk to the mix.",
      "content": "Add the butter and milk to the mix. Stir gently, leaving some small clumps of dry ingredients in the batter. Do not blend until completely smooth. If your batter is smooth, your pancakes will be tough and flat as opposed to fluffy. [1] X Research source If using vanilla extract, you can add it to the mix alongside the butter and milk. Overmixing your batter is going to develop strong gluten strains, which will make your pancakes very chewy."
    },
    {
      "title": "Heat the frying pan to a medium-low flame.",
      "content": "Heat the frying pan to a medium-low flame. If you have an initial \"pancake\" setting on your stove, use that. Be sure to use non-stick spray, or a pat of butter so the pancakes won't stick. You want the inside of the pancake to start cooking before the outside gets fully brown. A medium-low heat will allow the inside to start cooking without the outside burning. Avoid a high flame at all costs."
    },
    {
      "title": "Sprinkle a few flecks of water onto your pan.",
      "content": "Sprinkle a few flecks of water onto your pan. If it 'dances', or jumps from the pan with a sizzle, the pan is ready for the batter."
    },
    {
      "title": "Pour about 3 tablespoons to 1/4 cup batter from the tip of a large spoon or from a pitcher onto the hot griddle or greased frying pan.",
      "content": "Pour about 3 tablespoons to 1/4 cup batter from the tip of a large spoon or from a pitcher onto the hot griddle or greased frying pan. The amount you pour will decide the final size of your pancakes. It is best to begin with less batter, and then slowly pour more batter onto the pan to increase the pancake size."
    },
    {
      "title": "Cook for about two minutes or until the pancake is golden.",
      "content": "Cook for about two minutes or until the pancake is golden. You should see bubbles form and then pop around the edges. When the bubbles at the edge of the batter pop and a hole is left that does not immediately close up, flip the cake gently. [2] X Research source [3] X Research source"
    },
    {
      "title": "Cook the other side until golden and remove.",
      "content": "Cook the other side until golden and remove. Want a deeper color? Repeat the steps for another thirty seconds per side until the pancake is done enough for your tastes."
    },
    {
      "title": "Enjoy!",
      "content": "Enjoy! Try adding butter, peanut butter , syrup, jelly, chocolate chips, cookies, candy crumbles or fruit to your pancakes for a different, more exciting flavor. [4] X Research source The varieties are endless. These are the most delectable pancakes you will ever taste."
    },
    {
      "title": "Make rainbow pancakes.",
      "content": "Make rainbow pancakes . Looking for a colorful twist to your pancakes? Rainbow pancakes are the way to go! They are quick, easy, and fun to make. Little ones enjoy the beautiful colors added to their pancakes for a lovely 'rainbow'. [5] X Research source"
    },
    {
      "title": "Make fluffy pancakes.",
      "content": "Make fluffy pancakes . Having delicious fluffy pancakes that look like a pillow are one of the best pancakes out there. Finishing off with rich maple syrup will make your pancakes the bomb! [6] X Research source"
    },
    {
      "title": "Try a variety of fruit pancakes.",
      "content": "Try a variety of fruit pancakes. They are many types of fruit pancakes to try from and do make your breakfast a hint healthier. Examples can be such as blueberry pancakes, apple pancakes, and even pear pancakes. Find your favorite!"
    },
    {
      "title": "Make Bisquick mix pancakes.",
      "content": "Make Bisquick mix pancakes . If you're not in the mood to make your yummy breakfast from scratch, grab your Bisquick mix box and whip some tasty pancakes that taste nearly homemade."
    },
    {
      "title": "Make buttermilk pancakes.",
      "content": "Make buttermilk pancakes . Sometimes using what you have on hand can make something taste so good, and in this case, buttermilk. Buttermilk pancakes are faster to make so they are perfect for moving-on morning rushes. Cook these pancakes with a close eye and top them off with anything you desire. [7] X Research source"
    },
    {
      "title": "Make basic pancakes.",
      "content": "Make basic pancakes. You don't always have to carry on a bunch of ingredients to make something so good such as pancakes. Make easy pancakes that you and everyone else will love."
    },
    {
      "title": "Make Mickey Mouse pancakes.",
      "content": "Make Mickey Mouse pancakes . They're cute, easy, and super yummy. Kids will enjoy these pancakes if they are a big Disney fan! [8] X Research source"
    }
  ]
}