{
  "url": "https://www.wikihow.com/Repair-Rotted-Eaves",
  "title": "How to Repair Rotted Eaves",
  "steps": [
    {
      "title": "Remove the gutters and roof flashing if needed.",
      "content": "Remove the gutters and roof flashing if needed. In order to give yourself clear access to the eaves, you may first need to detach the drainage structures covering them. Unscrew the gutters at the brackets, then pull out the nails holding them in place and lower them down safely. Do the same for flashing where it overlaps the edges of the overhang. Set up a ladder on a flat stretch of ground directly beneath the section of gutter you’re removing and station a friend or helper nearby to stabilize it while you’re working. [1] X Research source For larger projects, consider renting and assembling a full scaffolding around your roof. A scaffolding will also be much safer to work on, and won't require any additional assistance for support."
    },
    {
      "title": "Pry off the shingle mold.",
      "content": "Pry off the shingle mold. Starting at one corner of the roof, wedge a pry bar into the narrow space at the top of the shingle mold (the thin wooden strip that sits just below the shingles). Force the mold away from the roofing a few inches at a time, then lift off the entire piece in one section. Hold onto the old shingle mold if it looks to be in good shape. You can reuse it later. If you’re having trouble getting the shingle mold to budge, try scoring the upper and lower edges with a utility knife. [2] X Research source Be careful not to damage the piece by wrenching on it with the pry bar."
    },
    {
      "title": "Pull away the rotten fascia.",
      "content": "Pull away the rotten fascia. With the shingle mold out of the way, you’ll be able to simply work the fascia (the vertical boards framing the outside of the eaves) free by hand. Due to their deteriorated state, they should come away easily. Don’t discard the old fascia just yet—it will come in handy for cutting your replacement materials. [3] X Research source Use your pry bar to loosen sections that have become stuck or jammed. [4] X Research source Keep a large waste bin or similar container nearby to dispose of all the rotten roofing materials together when you’re finished with your project."
    },
    {
      "title": "Remove the old soffit.",
      "content": "Remove the old soffit. The soffit is the wide horizontal board that encloses the underside of the eaves. Like the fascia, a decaying soffit should be soft enough to pull out manually. Grab the exposed edge of the board and give it a sharp tug downward to dislodge it. [5] X Research source Don’t be surprised if the soffit breaks apart while you’re attempting to pull it free. Waterlogged boards will often be soggy and prone to crumbling. Take caution when removing the old soffit. It’s not uncommon for birds, squirrels, and insects like bees and termites to build their nests behind these enclosures."
    },
    {
      "title": "Cut away rotten or damaged rafters.",
      "content": "Cut away rotten or damaged rafters. Examine the condition of the rafter (the thick beam running the length of the overhang). Assuming it’s in good shape, you can leave it in place and install the new materials around it. If it shows signs of rotting, water damage, or other wear you’ll need to chop it out using a reciprocating saw. [6] X Expert Source Barry Zakar Handyman Expert Interview. 16 July 2020. To make the removal process easier, cut the rafter in 1–2 feet (0.30–0.61 m) sections, then pause to rip each section individually. If your eaves are upheld by multiple rafters, you'll need to remove and replace them one at a time in order to avoid compromising your roof's stability."
    },
    {
      "title": "Gather your materials for the new eaves.",
      "content": "Gather your materials for the new eaves. Head down to your local home improvement center and shop for boards to replace the worn-out soffit and fascia. It’s important that the new boards match the old ones in terms of width and thickness—you can cut them to the right length later. It may help to bring along a small section of the old materials for reference. [7] X Expert Source Barry Zakar Handyman Expert Interview. 16 July 2020. In addition to wood, you also have the option of choosing a material like cellular PVC, fiber cement, aluminum, or galvanized steel for your new eaves. These materials will be stronger, longer-lasting, and more weather-resistant than ordinary boards. [8] X Research source Make sure you also pick up enough pressure-treated lumber to cut new shingle molds and rafters, if necessary."
    },
    {
      "title": "Cut new lumber for the rafters if needed.",
      "content": "Cut new lumber for the rafters if needed. If your supports are in need of replacing, saw the new beam to match the old one. Remember to use only pressure-treated lumber for the rafters. It will hold up much better to moisture and stress. [9] X Expert Source Barry Zakar Handyman Expert Interview. 16 July 2020."
    },
    {
      "title": "Install the new rafters.",
      "content": "Install the new rafters. Clamp the replacement beam to the wooden backboard at the rear of the eave enclosure to hold it in place. Fasten the rafter with 4\" (10 cm) wood screws. When you've successfully replaced one rafter, it will be safe to begin removing the next one. [10] X Research source Since the rafters are a critical part of the eaves’ support structure, it will be necessary to make sure they're in good condition before you begin installing the new components for your eaves. Press on the newly-installed beam to double check that it’s solid and secure before moving on."
    },
    {
      "title": "Cut the new soffit.",
      "content": "Cut the new soffit. Using a section of the rotted soffit as a template, saw the replacement material to the right size. This can be done with a handsaw, though you’ll get the most precise and efficient results with a circular saw or table saw. Ideally, the soffit should be made up of only 1 or 2 boards to minimize leaking. If you don’t have enough intact soffit to serve as a template, measure the underside of the eaves from one side of the house to the other and mark the dimensions on the new board. The fewer pieces you use to fashion the soffit, the less chance there will be of water, insects, and other destructive forces finding their way in."
    },
    {
      "title": "Cut the replacement fascia.",
      "content": "Cut the replacement fascia. Trim the fascia boards to the correct length the same way you did the soffit. Be sure to cut the edges where the boards will meet to opposing 45 degree angles so they’ll fit together properly. [11] X Research source If your home’s eaves feature any unique angles or projections, it may be necessary to measure and mark these features on the fascia board prior to sawing to confirm that everything will line up the way it’s supposed to. Some materials, like aluminum or steel, may need to be measured and cut in-store by a home improvement specialist before you bring them home."
    },
    {
      "title": "Apply a coat of weatherproofing sealant to wood fascia and soffits.",
      "content": "Apply a coat of weatherproofing sealant to wood fascia and soffits. Before you put the new roofing components in place, you’ll want to make sure that they’ll be able to stand the test of time. The best way to do this is to treat them with a wax or resin finish. Brush the sealant onto both sides of your materials, then let them sit until they're dry to the touch. It should only take 1-2 hours for the sealant to dry into a functional finish. Once it’s set into the wood, the sealant will help repel moisture, mold, grime, and other messes, preventing rotting in the future."
    },
    {
      "title": "Attach the new soffit.",
      "content": "Attach the new soffit. Align the soffit board with the underside of the eave so that its edges are flush with the rafter. Then, nail it into place. For a sturdier hold, sink a nail every 4–6 inches (10–15 cm). 1.5 inches (3.8 cm) wood screws will also be strong enough to get the job done. It may help to have an assistant hold the board in place while you fasten it down."
    },
    {
      "title": "Spread caulk around the edges of the soffit.",
      "content": "Spread caulk around the edges of the soffit. Use a caulk gun to fill in any gaps, cracks, or crevices you happen to spot in the new soffit. This will provide further protection against water and insect-related damage. Allow the filler to harden before modifying the soffit in any way. [12] X Research source You can also use roofing cement or wood putty in place of traditional caulk. [13] X Research source"
    },
    {
      "title": "Attach the new fascia.",
      "content": "Attach the new fascia. Position the replacement boards over the rafter and secure them using galvanized nails or 2.5 inches (6.4 cm) wood screws. Repeat this process for each section of the roof where the eaves are beginning to show signs of deterioration. Once the new fascia is in place, you can fill the nail holes and paint the boards to match the rest of your home’s trim. By the time you finish your project, your new overhang will be solid, watertight, and ready to stand up to a stiff downpour or a family of nesting squirrels."
    }
  ]
}