{
  "url": "https://www.wikihow.com/Make-Coconut-Milk-from-Coconut-Cream",
  "title": "How to Make Coconut Milk From Coconut Cream",
  "steps": [
    {
      "title": "Start off with your fave brand of coconut cream.",
      "content": "Start off with your fave brand of coconut cream. For best results, choose a can of organic, unsweetened coconut cream . Use a can opener to take the lid off the coconut cream. Scoop out 3 heaping tablespoons (42.52 grams) of coconut cream. Drop the coconut cream into a bowl. [1] X Research source If you plan to drink your coconut milk right after you make it, then chill your coconut cream in the fridge for 1 day before you whip up your DIY beverage."
    },
    {
      "title": "Splash in 1 tablespoon (14.77 mL) to create a milk-like consistency.",
      "content": "Splash in 1 tablespoon (14.77 mL) to create a milk-like consistency. Once you’ve put 3 heaping tablespoons (42.52 grams) of coconut cream into the bowl, measure out 1 tablespoon (14.77 mL) of water. Diluting the coconut cream creates 1 serving⁠—or ¼ cup (59.15 mL)—of coconut milk. [2] X Research source Use the same ratio to create larger quantities of coconut milk. For example, for 4 servings, or 1 cup (240 mL), of coconut milk, mix 4 tablespoons (59.15 mL) of water with 12 tablespoons (170.1 grams) of coconut cream."
    },
    {
      "title": "Use a metal whisk to stir your 2 ingredients into coconut milk.",
      "content": "Use a metal whisk to stir your 2 ingredients into coconut milk. Grab a metal whisk so you can mix up the coconut cream and the water. Use quick, circular motions to “beat,” or blend, the coconut cream and water into coconut milk with a smooth consistency. [3] X Research source Alternatively, use a hand mixer to blend the coconut cream and the water."
    },
    {
      "title": "For cold and refreshing coconut milk, put it in a container you can chill.",
      "content": "For cold and refreshing coconut milk, put it in a container you can chill. Take out a container, like a mason jar . Pour your fresh coconut milk into the container. Put a lid on the container and tighten it, then put your coconut milk in the fridge so it's nicely chilled. [4] X Research source"
    },
    {
      "title": "Enjoy your tasty beverage while it's fresh.",
      "content": "Enjoy your tasty beverage while it's fresh. If you'd like crisp and cool coconut milk ASAP, chill it in the fridge for 30 minutes to 2 hours or pour it over ice. If you'd like to use it later, consume it within 3 days. Have fun with all the possibilities for your homemade coconut milk—for example, make an Indian curry or whip up a Thai iced coffee ! [5] X Research source"
    }
  ]
}