{
  "url": "https://www.wikihow.com/Make-a-Beer-Pong-Table",
  "title": "How to Make a Beer Pong Table",
  "steps": [
    {
      "title": "Purchase an 8x4 foot (2.43x1.22 meter) piece of plywood.",
      "content": "Purchase an 8x4 foot (2.43x1.22 meter) piece of plywood. Retailers and hardware stores typically sell plywood for framing and home use, in 8x4 foot (2.43x1.22 meter) sized pieces. [1] X Research source You can also use leftover plywood that you have from a housing project, or you can contact a lumber or hardware store to see if they have extra scraps they are willing to give away for free. If the plywood is cut to a slightly different size like 9x3 feet (2.74x0.91 meters), it's still suitable to use for your beer pong table. The average cost of a cheap, 8x4 foot (2.43x1.22 meter) piece of plywood can be anywhere from $13 to $20. [2] X Research source If the sales associate tries to get you to buy a more expensive type of plywood say, \"I'm only using this as a beer pong table. Give me your cheapest stuff because I don't need a high-quality plywood.\""
    },
    {
      "title": "Place your plywood over a tabletop or countertop.",
      "content": "Place your plywood over a tabletop or countertop. Place your plywood over a table or countertop. Longer tables work best because the plywood has something to rest on, rather than floating in the air. If you have a thicker or heavier plywood, there will be less of a chance of it tipping over and falling. Advise people not to lean or stand on the beer pong table because it can quickly collapse. Fold up tables or dining room table tops are usually the most commonly used beer pong tables."
    },
    {
      "title": "Secure your plywood to the table.",
      "content": "Secure your plywood to the table. You must make sure that your plywood is steady on top of the table or it may topple over. Use duct tape to attach the plywood to the table by wrapping it around the table and your piece of plywood. Use as many pieces of tape that you need until your table feels secure to the table. You can also place heavy objects in the center of the table to hold it down. Do not use an expensive table when doing this because the duct tape could pull away some of the table's finish. To test the security of your table, softly push down on either end of the table to see if it tips over."
    },
    {
      "title": "Waterproof your beer pong table.",
      "content": "Waterproof your beer pong table. Waterproofing your table will prevent the plywood from becoming damaged if beer or other liquids get spilled on your table. Go to the hardware store or look online for waterproofing sealants, stains, or paints that you can purchase. Once you get them, apply a thin coat of the sealant to the surface of your beer pong using a wide painters brush. Allow the stain or sealant to dry fully before using the table. [3] X Research source Sealing your table will make cleaning it much easier and reduce the bad scent that often comes with spilled beer. Not sealing your pong table could result in mold growth if you don't clean up spills well. When using a waterproof sealant or paint, do it outside or make sure that the windows are open."
    },
    {
      "title": "Purchase a thick plywood.",
      "content": "Purchase a thick plywood. A thick piece of plywood will add stability to your table. Buy a 4x8 foot (1.2x2.4 meter) piece of plywood, which will become the surface of your table. When looking for plywood, look for variations that are a 1/2 an inch (12.7 millimeters) or 3/4 of an inch (19.05 millimeters) thick."
    },
    {
      "title": "Cut the plywood in half.",
      "content": "Cut the plywood in half. Measure four feet from the end of either side of the table, lengthwise, and make a mark with a pencil in the center. Use a straight edge to draw a line width-wise on the plywood. The line in the center of your plywood will be where the table folds. Use a circular saw, miter saw, or table saw to cut your plywood in half. [4] X Research source"
    },
    {
      "title": "Arrange eight pieces of wood to form a frame under your tabletop.",
      "content": "Arrange eight pieces of wood to form a frame under your tabletop. Set your two tabletops on the ground with the top of the table facing down. Arrange planks of wood around the outer edges of your plywood to create the frame. Because each piece of your table top measures 4x4 feet (1.2x1.2 meters), the frame under your plywood must also be 4x4 feet. Create two frames for each side of your tabletop. Make sure that the plywood and the planks of wood run flush on all four sides. Once your frame is the right size, you can set your plywood to the side. If your wooden planks are too long, then you may need to cut them down with a saw. The frame will look like a shallow wooden box on top of your plywood. You can purchase the framing lumber at most hardware stores. For this project, a 2\" x 6\" (38 x 140 mm) piece of lumber could work for framing material."
    },
    {
      "title": "Nail your frame together.",
      "content": "Nail your frame together. Once the frame is set up, nail the pieces together so that it forms two frames that are 4x4 feet (1.2x1.2) meters big. Put two nails in each corner of your frame, attaching the two pieces of wood together to form an L. Once all sides of your frame have been nailed together, you should have a square made out of your lumber."
    },
    {
      "title": "Nail the frame to the plywood.",
      "content": "Nail the frame to the plywood. Position the plywood over your frame and make sure that the edges run flush. Once it's in the correct position, put nails or screws into the surface of your plywood, attaching the frame to the plywood. You may need to put multiple nails along the surface of the plywood to safely secure the top of the table to the frame. [5] X Research source Repeat the process on the other piece of plywood."
    },
    {
      "title": "Attach a four foot long piano hinge to the center.",
      "content": "Attach a four foot long piano hinge to the center. A piano hinge is a metal hinge that can be used to connect both sides of your table together. Flip the table over, so that the surface of the table is facing the ground. Bring the two piece of tables together so that the frames are flush with one another. Place the piano hinge to both sides of the frame and center it. Once the hinge is flush, put screws into each of the holes to firmly attach it to the table's frame. [6] X Research source"
    },
    {
      "title": "Mount folding legs to the bottom of the table.",
      "content": "Mount folding legs to the bottom of the table. Purchase folding table legs at a hardware store or online. This will make it so that your folding beer pong table has something to stand on when deployed. Lay the legs under the table, inside of the frame. Test the legs and fold them out to see how they will function. Once you're satisfied with the placement, screw them in with an electric drill. [7] X Research source Folding legs allow your table to be folded up and transported easily. Do not get legs that are longer than 3.5 feet (1 meter), or they may not fit inside of your wooden frame."
    },
    {
      "title": "Create your design before you begin work.",
      "content": "Create your design before you begin work. Think of ideas for how you want to decorate your beer pong table. Talk to your roommates and think of something that represents the house or an inside joke that you all share. You can also add to the functionality of your pong table with the design by designating where each player should put their cups. You can do this by drawing or painting round circles that are the same size as the cups that you'll be putting out. If you're designating where players put their cups, make sure to trace the top of the cup because your cups will need to fit next to one another when you play. If you trace the bottom of the cup, the circles will be too close together. Good ideas for designs include a favorite sports team, the university that you attend, or the fraternity, sorority, or club that you all belong to."
    },
    {
      "title": "Paint the surface of the table",
      "content": "Paint the surface of the table . Purchase paint at a hardware store and use a flat brush to paint the surface of the table. Laying down a colored base coat may make whatever you're painting on top of it pop. Before painting on top of another layer of paint, make sure that it dries. If you want more accurate straight lines, lay down painters tape in the places that you want to make your line. Using a stencil is also another great idea to get more detailed images by using paint."
    },
    {
      "title": "Let your guests decorate the table.",
      "content": "Let your guests decorate the table. Another idea is to allow your guests and party members to decorate the table over time. Start the fun by using some thick markers to draw all over the surface of the table. Encourage people at the party to join in and draw something of their own. Over time, your beer pong table should fill up and have a personality of its own."
    },
    {
      "title": "Get creative with your table.",
      "content": "Get creative with your table. There are other ways that you can alter or change your beer pong table. One example is a group that used LED lights to illuminate their table during games. [8] X Research source You can also engrave a wooden table, or can use graffiti paint to create a unique design or tag. Get creative and think of different methods that you can use to enhance the look of the table."
    }
  ]
}