{
  "url": "https://www.wikihow.com/Cleanse-Chakra-Stones",
  "title": "How to Cleanse Chakra Stones",
  "steps": [
    {
      "title": "Running water carries negative energy away from your stones.",
      "content": "Running water carries negative energy away from your stones. Hold your stone for about a minute underneath a stream of running water. [1] X Expert Source Emily Christensen Spiritual Advisor & Founder of Rainbow Raaja Expert Interview. 8 July 2020. A natural source like a river or small waterfall is best, but your kitchen faucet will work too. Visualize the impurities flowing away with the stream. [2] X Research source Place your stones outside during a heavy rain for a similar cleansing effect. Gently pat your stones dry afterwards. Avoid this method for stones that dissolve in water, like selenite, celestine, fluorite, black tourmaline, turquoise, pyrite, topaz, moonstone, or opal. [3] X Expert Source Emily Christensen Spiritual Advisor & Founder of Rainbow Raaja Expert Interview. 8 July 2020."
    },
    {
      "title": "Saltwater heals your stones much like it heals a wound or cut.",
      "content": "Saltwater heals your stones much like it heals a wound or cut. Place your stones in a large bowl and fill it with natural saltwater, like ocean water. If you’re landlocked, create your own saltwater at home with Himalayan or sea salt. Your stones can soak anywhere from 30 minutes to 48 hours, depending on the severity of the negative energy. [4] X Research source Saltwater is a powerful cleansing method because it combines the energy of water and earth (salt). To avoid water damage and absorb pure earth energy, place your stones in a bowl full of coarse salt. If possible, place your bowl outdoors for 24 hours. Avoid this method for stones that dissolve in water (selenite, celestine, fluorite, black tourmaline, turquoise, pyrite, topaz, moonstone, or opal) or that corrode with salt (pyrite, black tourmaline, selenite, opal, moonstone, turquoise, amber, or topaz)."
    },
    {
      "title": "Brown rice absorbs negative energy from your stones.",
      "content": "Brown rice absorbs negative energy from your stones. Place your stones in a large bowl and cover them with uncooked brown rice grains for about 24 hours. Throw out the grains immediately afterward since they’re now full of negative energy. [5] X Research source Don’t cook or eat the rice after cleansing since it’s now spiritually tainted. This method is safe for all crystals."
    },
    {
      "title": "Fresh snow is a blank canvas for reflection and stillness.",
      "content": "Fresh snow is a blank canvas for reflection and stillness. Set your stones outside on top of new snowfall and let them soak and reflect until they feel renewed. The crisp, cold water energy and cleansing sunlight will leave the crystal sparkling clean and ready for healing. [6] X Research source A bowl full of fresh snow indoors works the same if you don’t have a secure, secluded outdoor spot to place them. Use snow on crystals or stones associated with water, divination, or reflection. Skip this method for stones that dissolve in water (selenite, celestine, fluorite, black tourmaline, turquoise, pyrite, topaz, moonstone, or opal) or that are sensitive to direct sunlight (aquamarine, chlorargyrite, cinnabar, creedite, fluorite, topaz)."
    },
    {
      "title": "Earth encourages stability, soothes anxiety, and connects you with your body.",
      "content": "Earth encourages stability, soothes anxiety, and connects you with your body. Bury your stones in a shallow hole in the ground and leave them overnight. The raw earth will absorb any lingering negative energy and prepare your stones to soothe and calm your instabilities. Dig them up carefully in the morning and wipe away any dirt or mud still clinging to them. [7] X Research source Stones like red jasper or black tourmaline resonate strongly with earth energy. Moisture in the ground might damage stones that are sensitive to water (selenite, celestine, fluorite, black tourmaline, turquoise, pyrite, topaz, moonstone, or opal)."
    },
    {
      "title": "Sunlight and moonlight cleanse and recharge your stones.",
      "content": "Sunlight and moonlight cleanse and recharge your stones. To harness their light energy, lay your stones in a safe spot outside or on a windowsill. [8] X Expert Source Emily Christensen Spiritual Advisor & Founder of Rainbow Raaja Expert Interview. 8 July 2020. Leave them out all night to soak up moonlight (especially during a full moon) or for about 30 minutes on a bright sunny day to be cleansed by sunlight. [9] X Research source Some stones begin to fade when they’re exposed to direct sunlight for too long, so keep your sun sessions short for stones like aquamarine, chlorargyrite, cinnabar, creedite, fluorite, or topaz. [10] X Expert Source Emily Christensen Spiritual Advisor & Founder of Rainbow Raaja Expert Interview. 8 July 2020. To harness both light energies at once, leave your stones out during a solar or lunar eclipse. You can also try setting them out before nightfall and bringing them inside in the late morning so they have a chance to absorb the sun and the moon. This method works especially well for clear stones like quartz."
    },
    {
      "title": "With conviction, your own breath can cleanse small stones.",
      "content": "With conviction, your own breath can cleanse small stones. Place the stone in your dominant hand and inhale deeply. Meditate on a cleansing thought like “I release you of negative energy” or “You are free to vibrate” while you move your hand toward your nose. Then exhale repeated, short breaths through your nose onto the stones. [11] X Research source Repeat this breathing cycle for about 30 seconds or until you feel the stones have renewed energy. This method is safe for all stones. It’s best for small ones because your breath can easily cover them."
    },
    {
      "title": "Some crystals have cleansing abilities and can be used on other stones.",
      "content": "Some crystals have cleansing abilities and can be used on other stones. To cleanse a small stone, lay it on top of a cleansing crystal like a slab of selenite, a geode, or large clump of quartz crystals. By physically touching the stones together, the larger stone will gradually draw out the vibrational impurities from the smaller one. [12] X Research source To cleanse a large stone this way, bury it under smaller cleansing crystals like carnelian or hematite in a large bowl for about 24 hours."
    },
    {
      "title": "Sound waves are a beautiful way to restore a stone’s vibrational energy.",
      "content": "Sound waves are a beautiful way to restore a stone’s vibrational energy. Chant or use a singing bowl, tuning fork, or a bell to create a constant wash of sound. The exact pitch doesn’t matter as long as it’s loud enough to cover the stone and your intention to cleanse it and use it for good is strong. [13] X Research source This method is safe for all stones and is an easy way to cleanse large quantities of stones all at once. Cleansing with sound waves usually takes about 5 to 10 minutes."
    },
    {
      "title": "Burning sage is an ancient cleansing ritual.",
      "content": "Burning sage is an ancient cleansing ritual. To begin, carefully light the end of some sage on fire until it is gently smoking. Grab your stones and move them in and out of the smoke until you feel their negative energy drift away. [14] X Expert Source Emily Christensen Spiritual Advisor & Founder of Rainbow Raaja Expert Interview. 8 July 2020. The cleansing smoke will absorb any negative energy in the stones and disperse it into the air to be carried away. [15] X Research source This method is safe for all stones and usually works in around 30 seconds, although it could take longer. If you don’t have actual sage, use palo santo, a sage stick, a candle, or incense as a substitute. Perform this ritual outdoors, or near an open window if you have to do it inside. As you fan the smoke, focus your intentions on cleaning and clearing the stones. [16] X Expert Source Emily Christensen Spiritual Advisor & Founder of Rainbow Raaja Expert Interview. 8 July 2020."
    },
    {
      "title": "Visualization is a powerful cleansing practice.",
      "content": "Visualization is a powerful cleansing practice. Hold your stone in your dominant hand and imagine a bright, purifying white light shining from your palm. Visualize the stone glowing brighter and cleaner the longer it’s exposed to the light. When done correctly, this takes about 1 minute or so. [17] X Research source Meditating before or during your visualization can help you enter the spiritual space to perform it effectively."
    },
    {
      "title": "A clear, powerful intention can connect with and cleanse your stones.",
      "content": "A clear, powerful intention can connect with and cleanse your stones. All you need is the belief that you have the power to cleanse them yourself. [18] X Expert Source Emily Christensen Spiritual Advisor & Founder of Rainbow Raaja Expert Interview. 8 July 2020. Declare your stone is clean by saying something like “This crystal is now clear” or “I dedicate this stone to healing, love, and light” out loud. [19] X Research source It’s helpful to meditate on your intention before saying it out loud if you’re struggling to really believe in yourself. This method can be very powerful when it’s done from the heart with conviction."
    }
  ]
}