{
  "url": "https://www.wikihow.com/Dry-Leather-Shoes",
  "title": "How to Dry Leather Shoes",
  "steps": [
    {
      "title": "Clean and prepare your shoes for drying.",
      "content": "Clean and prepare your shoes for drying. Dirt or mud that is allowed to dry can become extremely difficult to remove, and it may even discolor the leather. Use a cloth or brush to remove any mud on the shoes and dry up as much water you can with a towel. Remove the laces and allow them to dry separately. If your shoes have removable insoles, remove them, too, and lay them flat to dry."
    },
    {
      "title": "Stuff the shoes with dry newspaper.",
      "content": "Stuff the shoes with dry newspaper. Crumbled up newspaper stuffed into the shoe will absorb moisture while helping the shoes retain their shape. If you don't have newspaper on hand, paper towels or scrap paper will work, too. [1] X Research source"
    },
    {
      "title": "Leave the shoes to dry for 24 to 48 hours.",
      "content": "Leave the shoes to dry for 24 to 48 hours. Place the shoes in a dry, well-ventilated area and allow them 24 to 48 hours to dry (depending on how wet the shoes got and how thick the leather is). To avoid cracking or otherwise damaging the leather, do not put the shoes in direct sunlight or near a heat source, such as a radiator. [2] X Research source"
    },
    {
      "title": "Remove the newspaper and replace the insoles and laces.",
      "content": "Remove the newspaper and replace the insoles and laces. Once the shoes have dried inside and out, discard the newspaper and replace the laces and insoles."
    },
    {
      "title": "Condition your shoes with leather lotion, saddle soap, or shoe polish.",
      "content": "Condition your shoes with leather lotion, saddle soap, or shoe polish. Depending on the look and condition of the shoes after drying, you may want to apply a leather conditioner to further clean and protect them. [3] X Research source Dress shoes, especially, may benefit from an application of shoe polish. Use a cloth or rag to apply the polish to the leather surface of the shoes. Remove the excess polish with a shoe brush. You can then shine the shoes by using a fresh cloth to briskly buff the polish into the leather. [4] X Research source"
    },
    {
      "title": "Clean mud and dirt off the shoes.",
      "content": "Clean mud and dirt off the shoes. Mud can become difficult to remove once it dries onto leather, so use a cloth or brush to remove any dirt or mud that may have accumulated on the wet shoes. Dry the shoes as best you can with a towel."
    },
    {
      "title": "Stuff newspaper inside the shoes to absorb interior moisture.",
      "content": "Stuff newspaper inside the shoes to absorb interior moisture. The newspaper will help the shoes hold their shape while it absorbs moisture inside the shoes. [5] X Research source Paper towels, tissue paper, or scrap paper can be used in place of newspaper."
    },
    {
      "title": "Wrap newspaper around the outside of the shoe.",
      "content": "Wrap newspaper around the outside of the shoe. This newspaper will absorb moisture from the outside of the shoe and will speed up the drying time. Use rubber bands to hold the newspaper in place. Paper towels can be used if you don't have newspaper on hand. [6] X Research source Newsprint can discolor leather, so try to use newsprint that doesn't have color print or photographs. A layer of paper towel between the shoe and the newsprint can help avoid discoloration from newsprint. Darker leathers are less likely to show discoloration from newsprint."
    },
    {
      "title": "Replace the newspaper after 1 to 2 hours.",
      "content": "Replace the newspaper after 1 to 2 hours. Discard both the interior and exterior newspaper and replace with fresh, dry newspaper every 1 to 2 hours until the shoes are dry."
    },
    {
      "title": "Condition and polish your shoes if they got very wet or dirty.",
      "content": "Condition and polish your shoes if they got very wet or dirty. Getting wet and dirty can harm the polish on shoes, and the cleaning and drying process can leave leather dry and unprotected. If your shoes got a good soaking or got especially dirty, you may consider applying leather lotion or saddle soap after they've dried. If your shoes appear dull or scuffed , use shoe polish to restore their finish."
    },
    {
      "title": "Clean and prepare your wet shoes.",
      "content": "Clean and prepare your wet shoes. Wipe off any dirt or mud on the shoes and use a towel to remove as much water as possible. Remove the laces and insoles and allow them to dry separately from the shoes."
    },
    {
      "title": "Place a folded towel under a portable fan.",
      "content": "Place a folded towel under a portable fan. This will collect any water that may drip from your shoes while they dry."
    },
    {
      "title": "Create 2 S-shaped hooks from paperclips or a wire clothes hanger.",
      "content": "Create 2 S-shaped hooks from paperclips or a wire clothes hanger. You need two S-shaped hooks to hang your shoes from the fan's front guard. If you don't have S-hooks on hand, you can quickly make some from household materials. Paperclips can be quickly folded into an S or Z shape. If you don't have paperclips, can you cut and reshape sections of a wire clothes hanger or similar wire material. [7] X Research source"
    },
    {
      "title": "Hang your shoes on the front of the fan.",
      "content": "Hang your shoes on the front of the fan. Hang one end of the S-hooks onto the front guard of the portable fan, spacing the hooks about 7 or 8 inches apart to make room for both shoes to hang. Hang your shoes off the other end of the S-hook. Depending on the shape and construction of your shoes, you can either hang them from the backstay or from the tongue. Make sure the interior of the shoe is facing toward the fan, so that the air is pushed into and over the shoe. The bottom of the shoes should be pointing away from the fan."
    },
    {
      "title": "Protect and polish your dry shoes if they appear dull or dried out.",
      "content": "Protect and polish your dry shoes if they appear dull or dried out. If your shoes look worse for the wear after drying, consider using leather lotion or saddle soap to restore and condition the leather. Dress shoes are particularly prone to looking dull or scuffed after getting wet and dirty. You can restore their finish with shoe polish. Use a cloth to apply the polish to the shoe leather. Then use a shoe brush to remove excess polish. Finally, shine the shoes by buffing vigorously with a fresh cloth. [8] X Research source"
    }
  ]
}