{
  "url": "https://www.wikihow.com/Create-a-Comic-Character",
  "title": "How to Create a Comic Character",
  "steps": [
    {
      "title": "Do some light sketches of what your character may resemble.",
      "content": "Do some light sketches of what your character may resemble. Once you have a general idea of the type of comic you want to create, do some light sketching. Don't worry about creating the perfect design yet; you're just in the preliminary planning stages. Just grab a pencil and paper and begin drawing a few versions of the character. [1] X Research source Light sketching can help you figure out your drawing style and get a sense of how your character may appear. Make the main character visually interesting and appealing, but keep in mind that you'll be drawing them a lot. If you are new to drawing, choose a design that's simple. Strive to create a character that is recognizable in many forms. Drawing can help you get a sense of a character's personality as well. What kind clothes your character wears, for example, can reflect personality."
    },
    {
      "title": "Jot down a list of loose personality traits.",
      "content": "Jot down a list of loose personality traits. From here, start brainstorming about your character's personality. Who is this character? What is he or she like? Spend some time brainstorming before you move on to drawing a more final version of your character. [2] X Research source Think about your genre. If you're doing a gag-a-day comic, your character can be simple, like Garfield. He's lazy and sarcastic and does not have too many traits beyond this. If you're working with a more complex genre, you'll need a deeper character. Consider their positive and negative traits, as well as their hopes and dreams. If you're writing a genre-based comic, like fantasy, consider archetypes, which are stock characters that tend appear repeatedly in fiction. For example, an archetypal mentor would be wise, patient, and calm."
    },
    {
      "title": "Get some inspiration from your favorite comics.",
      "content": "Get some inspiration from your favorite comics. Don't just limit yourself to superhero comic books. Look at newspaper comics, web comics, or even manga. Pay attention to the characters and how they're developed. Ask yourself what makes the characters compelling and interesting. Ask yourself: How does the writer create a unique personality and voice for each character? Why are they interesting? How is their storyline developed over the course of the comic? Pay attention to the art style. In serious comics, the art may be detailed and realistic, but in lighthearted comics, it may be cartoonish and unrealistic."
    },
    {
      "title": "Consider the type of comic you're creating.",
      "content": "Consider the type of comic you're creating. Comics are a diverse field. There are some gag-a-day comics, such as comics published in local newspapers, but there are also comics that tend to be more serious. Many web comics have complicated and long running story lines with somewhat more complex characters. If you're looking for a simple format, consider the talking animal route and emulate comics like Garfield. Usually, these comics only have a few panels and end with a joke. If you want to do something more serious, a web comic, like Questionable Content, may better serve you inspiration-wise. Consider looking graphic novels. While different than comics, there is some overlap."
    },
    {
      "title": "Decide on the tools you'll be using to draw.",
      "content": "Decide on the tools you'll be using to draw. Every artist uses different tools. Before you begin to draw your comic, make sure you know how you'll be drawing it. You should pick tools you can work with efficiently. Tools that are unfamiliar to you may be tedious, making it harder for you to commit to your character. [3] X Research source If you're tech-savvy, consider using electronic tools. Tools like adobe photoshop, for example, can really help streamline the process if you're comfortable drawing on a screen. If you'd prefer to do it the old fashion way, think about the type of paper you'll use, as well as the type of pen and pencil."
    },
    {
      "title": "Draw a basic body and face.",
      "content": "Draw a basic body and face. Once you've discovered your tools, start with the basics. Draw a basic outline of your character's body. You want to get a sense of his or her basic proportions before fleshing out the character. You should also draw a somewhat closer up picture of just your character's face. As the face is where your character will portray emotion, you want to make sure you've got the character's facial structure locked down. [4] X Research source Start out with some basic shapes, then fill it in with muscle and details, like scars. Don't worry too much about shading just yet. Focus on the character's face. Is it heart-shaped, oval-shaped, rounder? Does it have any distinguishing physical characteristics, like big eyes or a cleft chin?"
    },
    {
      "title": "Play around with physical traits as you do several drawings.",
      "content": "Play around with physical traits as you do several drawings. Redraw the character's face and body again and again. Most cartoonists draw many, many versions of their character before settling on a final design. Reshape and redesign the character several times until you get a version you like. [5] X Research source Use your eraser here. If you dislike how the character's legs look, erase and redraw them. You can add or subtract elements of your character as well. For example, you may have originally intended your character to be bald, but that doesn't feel right. Try adding some hair. Draw as many versions as you need until you find something you like. This can take awhile, so have patience. Don't settle on a design that you dislike. Keep ease of drawing in mind as you go. Even if you really like a particular element of your character, don't keep anything that would be difficult to draw repeatedly."
    },
    {
      "title": "Practice drawing your character with several expressions.",
      "content": "Practice drawing your character with several expressions. Your character will have to make a lot of expressions throughout your comic. You should practice drawing just your character's face expressing a wide variety of emotions. [6] X Research source Figure out how many expressions you want to create. A simple comic may only need basic expressions, like happy, sad, and mad. A more complex comic should have more complicated expressions, like irritated, hollow, and confused. Draw your character expressing each of your chosen emotions. Adjust each drawing as you go."
    },
    {
      "title": "Settle on a final design.",
      "content": "Settle on a final design. After a lot of experimentation, try to draw one solid design of your character. You can use this design later on when you begin actually writing your comic. Mixing and matching all the elements you liked from the preliminary drawing phases, draw a final version of your character. [7] X Research source Draw slowly here and provide slightly more detail than you did in earlier steps. You want this drawing to be something you come back to as you draw your comic. Remember to keep ease of drawing in mind. If you find some element of your character is difficult to draw, you may want to cut this element out in your final draft. Have a friend look at the final drawing and give you honest feedback. If they give any constructive feedback, you can retool your character accordingly."
    },
    {
      "title": "Name your character.",
      "content": "Name your character. To start, you want to give your character a name. This should be something that appeals to readers. You may also want to consider a name that speaks to your character's personality. [8] X Research source Names are easier for animal characters because you can use a silly pet name. For a serious comic with realistic characters, however, you'll need to choose more carefully. Keep the implication of names in mind. For example, the name \"Christian\" carries religious context, so avoid using it unless you want that in your comic. There are no hard or fast rules for names, but it can help to know the time period your comic takes place in. For example, if your comic takes place in the 1800's, modern names like Harper and Jayden may seem out of place."
    },
    {
      "title": "Make a list of your character's most notable qualities.",
      "content": "Make a list of your character's most notable qualities. Write down basic personality traits, focusing on the most notable ones first. From there, get more specific. How do they react to others? Are they kind and generous, or do they withhold their emotions. How do they respond to conflict? For a simpler comic, your character may not need a complex personality. They could just have a few quirks and traits. For a more complicated comic, however, you'll have to get more in-depth. For example, they may react differently to different types of people."
    },
    {
      "title": "Decide on your character's past.",
      "content": "Decide on your character's past. Your character should have a backstory, especially if you're doing a more complex comic. Spend some time fleshing out where your character was before the events of the story began. [9] X Research source A character in a complex story does not need to have a complex backstory. You can simply lay out the basics, like their birthplace, childhood, and major events. Focus on how the character's past affects his current personality and choices. As you write backstory, try to consider how your character's unique experiences will affect his life."
    },
    {
      "title": "Think about your character's wants and needs.",
      "content": "Think about your character's wants and needs. Interesting characters have a set of wants and needs that drive most of their actions. Spend some time consider what your character wants. In a simple comic, your character may want simple things. Garfield, for example, wants to sleep and eat. In a more complex comic, your character may want to find a sense of purpose. Focus on needs as well. There are many universal needs, like food, shelter, love, and compassion. Your character may have unique needs as well, A character that was abandoned in childhood may have a heightened need for security as an adult. People want entertaining stories. So you need to learn about the target audience, genre, genre conventions, and the types of things that sell compared to those that don't sell well. You can write what you want but with an understanding of what other people want. Only then can you find agents and producers because they are interested in what they can sell."
    }
  ]
}