{
  "url": "https://www.wikihow.com/Revivify-5e",
  "title": "What Is the Revivify Spell & How Does it Work in DnD 5e?",
  "steps": [
    {
      "title": "Revivify is a 3rd-level spell that can resurrect creatures.",
      "content": "Revivify is a 3rd-level spell that can resurrect creatures. In D&D, it’s possible for characters (and non-player characters, or NPCs) to die—sometimes permanently. If you don’t want a permanent death, you’ll need a spell capable of bringing them back to life. That’s where Revivify comes in; when cast on a creature that’s been dead for less than a minute, it can resurrect them immediately with 1 hit point. [1] X Research source Casting time : 1 action Range : Touch Target : A creature that has died within the last minute Components : Verbal, somatic, and material (diamonds worth 300 gp, which are consumed) Duration : Instantaneous School : Necromancy"
    },
    {
      "title": "Touch a creature and expend a 3rd-level spell slot to cast Revivify.",
      "content": "Touch a creature and expend a 3rd-level spell slot to cast Revivify. You can’t cast Revivify on a target from afar, and you must have a 3rd-level spell slot available in order to cast the spell successfully. If you’re worried about characters dying in a battle, be sure to conserve at least one 3rd-level spell slot (if not more) to ensure you can cast Revivify if needed. [2] X Research source Remember: Revivify can’t resurrect a creature that died of old age, nor can it regrow missing body parts."
    },
    {
      "title": "Cast Revivify on your target within 1 minute of its death.",
      "content": "Cast Revivify on your target within 1 minute of its death. Revivify’s main drawback is that it has a very specific (and short) time limit. If a creature has been dead for over a minute of in-game time, you can’t use Revivify to resurrect them. So, be sure to act as quickly as possible if a creature needs to be resurrected with Revivify. [3] X Research source If you’re in combat, remember that each round is about 6 seconds of in-game time, so you must cast Revivify on a creature within 10 rounds after they die. Outside of combat, it’s up to the DM to determine how long you have before it’s too late to cast Revivify."
    },
    {
      "title": "Make sure you have diamonds worth 300 gold pieces available.",
      "content": "Make sure you have diamonds worth 300 gold pieces available. Most material components in D&D spells are worthless (or very cheap) and easy to get ahold of or replace with a spell focus. On the other hand, Revivify absolutely can’t be cast without diamonds worth 300 gold pieces (gp). Try to secure enough for at least 1 spell before a tough fight! [4] X Research source You may find diamonds as loot (determined by the DM) while adventuring, or you may be able to buy them from certain merchants in the game."
    },
    {
      "title": "Remember you can’t cast Revivify on unconscious creatures making death saves.",
      "content": "Remember you can’t cast Revivify on unconscious creatures making death saves. Revivify specifically applies to creatures that are already dead. If a character is making death saving throws, that means they’re unconscious and dying with 0 hit points—but not dead yet. So, rather than using Revivify, you can help dying characters by healing them or using a spell like Spare the Dying. [5] X Research source Death saving throws represent a character’s ability to resist death and stabilize on their own without healing. If a dying character succeeds three death saves, they automatically stabilize (but remain unconscious). If they fail three death saves, they die immediately."
    },
    {
      "title": "Limit the number of diamonds the players can have.",
      "content": "Limit the number of diamonds the players can have. Some DMs feel Revivify is too convenient and takes away the stakes of character death. Luckily, that doesn’t have to be the case; as the DM, simply keep careful track of how many diamonds you give the players (or allow them to find) to ensure they conserve their supply and cast Revivify very wisely. [6] X Research source While you could ban Revivify completely, this might be too harsh for some players. Character death is significant; some players might not want their characters to die permanently. Always check before a campaign to see how your players feel about character death—and give them a chance to resurrect fallen characters (even if you limit how often they can do it)."
    },
    {
      "title": "Set up challenging traps or battles if players have lots of diamonds.",
      "content": "Set up challenging traps or battles if players have lots of diamonds. On the other hand, if you don’t want to regulate the amount of diamonds your players can have, there’s another way to up the ante: create obstacles where character death is a very real possibility. After all, if your players have all the diamonds they could ever need, why not set up a deadly trap, or have your boss enemy cast Power Word Kill? [7] X Research source Throwing challenges at your players doesn’t mean intentionally trying to kill them all the time (or cause a TPK). It just means creating situations where players can absolutely survive if they strategize and play smart, but the consequences of making a mistake are deadlier than the average battle or trap."
    },
    {
      "title": "Resurrection spells",
      "content": "Resurrection spells Revivify isn’t the only spell that can resurrect fallen creatures in D&D 5e. However, it is the lowest-level resurrection spell available—and the only one that can be cast in a single action. Thus, if you need to quickly resurrect an ally in combat, Revivify is the only spell that can do the trick. If you have the time (and resources), you can use these spells out of combat: [8] X Research source Raise Dead . This is a 5th-level spell that can resurrect creatures that have been dead for up to 10 days. It takes 1 hour to cast and requires a diamond worth 500 gp. Resurrection . This is a 7th-level spell that can resurrect creatures that have been dead for up to a century. It takes 1 hour to cast and requires a diamond worth 1,000 gp. Reincarnate . This is a 5th-level spell that can create a new body for a creature that has been dead for up to 10 days and call the creature’s soul into the body. It takes 1 hour to cast and requires rare reagents worth 1,000 gp. True Resurrection . This is a 9th-level spell that can resurrect creatures that have been dead for up to 200 years and even recreate the creature’s body if it’s been lost. It takes 1 hour to cast and requires diamonds worth at least 25,000 gp."
    },
    {
      "title": "Gentle Repose",
      "content": "Gentle Repose Gentle Repose is a handy 2nd-level spell you can use if Revivify (or any other resurrection spell) isn’t an option when a character dies. It protects a body from decaying for 10 days. Time spent under the influence of Gentle Repose doesn’t count against the time limit of spells like Revivify or Raise Dead, effectively giving you more time to resurrect fallen allies. [9] X Research source"
    },
    {
      "title": "Spare the Dying",
      "content": "Spare the Dying Resurrection spells (or even Gentle Repose) only work on already dead creatures. If you’re trying to stop a creature from dying in the first place, Spare the Dying is a cantrip and handy “death prevention” spell. If a creature is unconscious and dying (making death saving throws), you can cast Spare the Dying to stabilize them immediately. [10] X Research source A creature saved with Spare the Dying will remain unconscious until healed—so you’ll need a potion, a medicine check with a healer’s kit, or a spell like Healing Word or Cure Wounds to actually wake them up."
    },
    {
      "title": "Yes, Revivify is an extremely useful (and important) spell for any party.",
      "content": "Yes, Revivify is an extremely useful (and important) spell for any party. Because death is a very real possibility in most D&D adventures, it’s wise to have at least one character in the party that can resurrect—and Revivify is the most accessible resurrection spell in the game. It’s low-level, its materials don’t cost as much as other spells, and it can be used quickly in battle. [11] X Research source Revivify is the first resurrection spell you’ll likely have access to, so be sure to take it when you get the chance; it may help your party get through the game's lower levels."
    },
    {
      "title": "Clerics, paladins, and artificers can cast Revivify.",
      "content": "Clerics, paladins, and artificers can cast Revivify. If your character is a cleric, paladin, or artificer, you can have them learn Revivify from their class spell list whenever 3rd-level spells become available to them. However, even if your PC isn’t one of those classes, there are a few other subclasses and optional class features that can also use Revivify. For example: [12] X Research source Bards . If you’re playing a bard, you can learn Revivify using the Magical Secrets feature. Druids . As a druid, you can opt to use an optional class feature that allows Revivify at level 9. Divine Soul sorcerers . This sorcerer subclass can use the entire cleric spell list, including Revivify. Celestial warlocks . Revivify is on the expanded spell list for this warlock subclass."
    }
  ]
}