{
  "url": "https://www.wikihow.com/Is-Crap-a-Bad-Word",
  "title": "Is “Crap” a Bad Word?",
  "steps": [
    {
      "title": "“Crap” can be seen as rude, but it isn’t technically a swear word.",
      "content": "“Crap” can be seen as rude, but it isn’t technically a swear word. It’s sort of an in-between term—it’s not as vulgar or obscene as other profanities, but it’s probably not okay to say in a more formal setting. [1] X Research source For example, you probably wouldn’t want to say this term in front of your teacher at school or your boss at work. When deciding whether or not to use the word “crap,” think about the setting you’re in and the people you’re with. If you’re hanging out with your friends in an informal setting, it’s probably more acceptable to say it. On the other hand, if you’re spending time with your grandparents, you might want to avoid it . In the past, “Crap” was considered more of a swear word, so they might find it offensive. [2] X Research source"
    },
    {
      "title": "“Crap” is a versatile word that can mean many different things.",
      "content": "“Crap” is a versatile word that can mean many different things. In its most literal sense, “crap” is a rude word for feces or excrement. As a slang term, “crap” can mean that something is junk or of bad quality (“This book is crap—the writing is so bad!”) It can also mean that something is nonsense (“Everything he said was crap. He didn’t tell the truth at all!”) [3] X Research source It can be used as an adjective: “The new shoes I got were really crappy quality—they started falling apart the first time I wore them!” [4] X Research source Or to add emphasis to an exclamation: “That scared the crap out of me!” [5] X Research source Or to refer to stuff/clutter: “Why is all this crap strewn around the room? We’ve got to tidy up!” [6] X Research source Common variations include the exclamation \"holy crap,\" which is used to express surprise, or the phrase \"bull crap,\" which means that something is nonsensical or untrue. [7] X Research source"
    },
    {
      "title": "Junk or garbage",
      "content": "Junk or garbage If you want to say that something is worthless or poor quality, consider using “junk” or “garbage” instead. They’re not swear words, but they definitely get the same point across as “crap.” [8] X Research source Here are some examples: “I wanted to like the movie, but it turned out to be garbage. It wasn’t entertaining or enjoyable at all!” “I need to start going through my closet to get rid of stuff I don’t need anymore. It’s full of junk!”"
    },
    {
      "title": "Foolishness, baloney, or nonsense",
      "content": "Foolishness, baloney, or nonsense If you want to say that something is completely silly or nonsensical but don’t want to use the word “crap,” try using “foolishness,” “baloney,” or “nonsense” instead. [9] X Research source For example: “I used to think it was okay to gossip, but now I’m done with all that foolishness. It just causes unnecessary drama in the end.” “My sister tried to convince me that ghosts are real, but I think that’s a bunch of baloney.” “I used to believe that I’d fail a test if I didn’t use my lucky pencil, but now I know that’s nonsense.”"
    },
    {
      "title": "Lousy, cheap, or worthless",
      "content": "Lousy, cheap, or worthless If you’re looking for an adjective to describe something, but you don’t want to say “crappy,” consider saying “lousy,” “cheap,” or “worthless.” They have similar meanings, but they’re not swear words. [10] X Research source “I’m so done with this lousy phone. I’ve had it for way too long, and it’s definitely time for a replacement.” “My new backpack is way too cheap. The zipper broke, and I’ve only had it for a few weeks.” “Ugh, my rain boots are totally worthless! They didn’t keep any water out at all.”"
    }
  ]
}