{
  "url": "https://www.wikihow.com/Add-a-Stopwatch-to-PowerPoint",
  "title": "How to Add a Stopwatch to PowerPoint",
  "steps": [
    {
      "title": "Launch PowerPoint 2003, 2007 or 2010.",
      "content": "Launch PowerPoint 2003, 2007 or 2010. Open your created presentation file."
    },
    {
      "title": "Click the Slide Show tab or Menu item and then click the Set Up Slide Show button.",
      "content": "Click the Slide Show tab or Menu item and then click the Set Up Slide Show button. In the middle right section of the Set Up Show window, click the radio button for \"Using timings, if present\" under the Advance Slides heading. Click the OK button to close the window."
    },
    {
      "title": "Select the ​​​Rehearse Timings button on the toolbar.",
      "content": "Select the ​​​Rehearse Timings button on the toolbar. The slideshow will begin to play in full-screen mode. Advance the slides after the appropriate amount of time you think you will need for each screen by clicking anywhere on the slide show. This will allow you to time slides as they are displayed. Note that the time allotted for each screen is being tracked and shown in the upper left hand window."
    },
    {
      "title": "Watch the slideshow again using the From Beginning button at the far left edge of the Slide Show toolbar.",
      "content": "Watch the slideshow again using the From Beginning button at the far left edge of the Slide Show toolbar."
    },
    {
      "title": "Review the advancement of the slides using timing and make note of those that will need their timing adjusted.",
      "content": "Review the advancement of the slides using timing and make note of those that will need their timing adjusted."
    },
    {
      "title": "Make any necessary changes to the time taken to advance slides automatically.",
      "content": "Make any necessary changes to the time taken to advance slides automatically. Timing can be adjusted for individual slides in the Normal view. Click the slide that requires an adjustment, then choose the Animations tab. The far right edge of the Transition to this Slide section offers Advance Slide options. Adjust the amount of time in the field following the words \"Automatically After.\""
    }
  ]
}