{
  "url": "https://www.wikihow.com/Get-Clay-in-Stardew-Valley",
  "title": "How to Find and Use Clay in Stardew Valley: 3 Simple Methods",
  "steps": [
    {
      "title": "Equip the hoe tool.",
      "content": "Equip the hoe tool. The hoe is one of the default tools you get when you start Stardew Valley . It looks like a gray rectangle with a long wooden handle."
    },
    {
      "title": "Till the ground.",
      "content": "Till the ground. You can get clay randomly from tilling any spot on the ground, so you may have collected some while you cleared out areas to plant your crops. You can get clay from tilling dirt or sand."
    },
    {
      "title": "Use the hoe on an artifact spot.",
      "content": "Use the hoe on an artifact spot. Artifact spots look like three worms coming up out of the ground. These spots can give you various treasures, but they can also give you crafting supplies. [1] X Research source Clay can be found in artifact spots at any location. You have a 24-60% chance (depending on the artifact spot location) to get clay, and you have the possibility of getting 1 to 3 chunks of clay."
    },
    {
      "title": "Equip the pickaxe tool.",
      "content": "Equip the pickaxe tool. The pickaxe is one of the default tools you get when you start Stardew Valley. It looks like a gray boomerang with a long wooden handle."
    },
    {
      "title": "Break open rocks.",
      "content": "Break open rocks. Breaking open rocks in the mines gives you a chance of collecting geodes. Each geode has a 6.25% chance of containing a chunk of clay. [2] X Research source In order to open Geodes, you'll need to visit the blacksmith in town and pay a small processing fee."
    },
    {
      "title": "Use bombs.",
      "content": "Use bombs. Bombs are a single-use craftable item that you can use to clear big portions of the mine at once. Bombs will break all of the rocks in it's effective radius, giving you a chance to get more geodes, and it will till a smaller radius of dirt tiles, which can also provide clay. [3] X Research source"
    },
    {
      "title": "Break open clay nodes at the Ginger Island Dig Site.",
      "content": "Break open clay nodes at the Ginger Island Dig Site. Ginger Island can be accessed if you've repaired the boat at Willy's Fish Shop. There is a dig site on Ginger Island similar to the quarry that can spawn clay nodes, a mining node that specifically drops clay. [4] X Research source"
    },
    {
      "title": "Wait for the Feast of the Winter Star.",
      "content": "Wait for the Feast of the Winter Star. This is the final festival of the year in Stardew Valley , and the main event of this festival is the secret gift-giving. [5] X Research source"
    },
    {
      "title": "Get Jas or Vincent as your secret gift-giver.",
      "content": "Get Jas or Vincent as your secret gift-giver. Children have a chance of giving you clay as a gift, but it isn't a very reliable way to get this resource as it's random which gift-giver you get and which gift they give you. While you can get clay as a gift, clay is not liked by any of the villagers as gifts. All of the villagers dislike clay, with the exception of Abigail, Evelyn, George, Haley, Jas, Marnie, Sebastian, and Vincent hating clay. [6] X Research source"
    },
    {
      "title": "Clay is used in a few recipes.",
      "content": "Clay is used in a few recipes . Three of the most important items clay is used for is to make Quality Retaining soil, Deluxe Retaining Soil, and a Bone Mill. Clay is also used to make a Garden Pot, Brick Floor, and Fiber Seeds. [7] X Research source"
    },
    {
      "title": "Clay is used to make the silo.",
      "content": "Clay is used to make the silo. The silo is an important building if you have farm animals, especially during the winter. You'll need 10 clay to complete this building. [8] X Research source"
    },
    {
      "title": "Clay can be used in tailoring.",
      "content": "Clay can be used in tailoring. You can use clay in the sewing machine to make a Shirt, or it can be used to create orange dye at the dye pots. [9] X Research source"
    }
  ]
}