{
  "url": "https://www.wikihow.com/Hold-in-a-Fart",
  "title": "How to Hold in a Fart when You're on the Brink",
  "steps": [
    {
      "title": "Clench your butt cheeks.",
      "content": "Clench your butt cheeks. Think of it this way: if there's no space between your butt cheeks, then how can the fart get out? This can be a bit painful and you can't sustain it for that long, but if you clench your cheeks, your fart simply can't escape. Squeeze your glutes to tighten your anus and keep it tight; if you unclench, the fart might come out. [1] X Research source Keep in mind that holding in a fart isn't a permanent solution, and it may return with more force than before. It's completely safe to hold in your farts every now and then—you don't need to worry about any serious health repercussions. That said, holding in your farts routinely can cause bloating and cramps, which can be unpleasant. Hold in farts when you need to, but relax your body and let all systems go as soon as you get the chance. If you have severe obstructions in your colon, holding in your farts can be dangerous. This is extremely rare, though, and usually only happens to critically ill patients. [2] X Research source"
    },
    {
      "title": "Change the position of your body.",
      "content": "Change the position of your body. Sometimes you may just need to wiggle around a bit to move that fart to a different part of your body. After all, fart is just gas, so it can shift around inside you. If you're sitting, try standing up. If you're standing, sit down. If you're sitting but can't get up, try shifting from one butt cheek to the other. Just don't make any sudden movements or the fart might come out!"
    },
    {
      "title": "Lean forward in your chair.",
      "content": "Lean forward in your chair. This is another time-tested strategy. If you're sitting down and need to fart, place both hands on the arm rests, put your weight on your toes, and gently lean forward a bit, lifting your bum off the seat. This can sometimes help the urge to fart go away, as pointing your toes and leaning up can also help you clench your anus a bit. Keep in mind that holding in a fart makes it louder when the time comes. Though holding in your farts can be a great short-term strategy, a fart rarely just \"disappears.\" Eventually, your fart will come back—and with more power than before because there's a lot of pressure behind it. [3] X Research source"
    },
    {
      "title": "Lie down.",
      "content": "Lie down. If you're sitting up or standing and need to fart, sometimes lying down can help you change positions and get rid of the urge to fart. If you're hanging out with friends, this can be hard to pull off, but if you're all sitting around watching TV, see if you can sprawl out on the couch or do something that helps you hold in your fart while looking pretty natural."
    },
    {
      "title": "Stand up straight and lift your chin.",
      "content": "Stand up straight and lift your chin. If you're standing and have the urge to fart, it can help to straighten up so your body is more erect. Maintaining good posture may give the fart more room to move around your body (so you can avoid releasing it)."
    },
    {
      "title": "Shift from cheek to cheek.",
      "content": "Shift from cheek to cheek. If you're sitting and feel the urge to pass gas, one thing you can do is to delicately shift from cheek to cheek. Sometimes, this motion is all you need to make that farting feeling go away temporarily. This can also help you release the fart in a less noisy manner, if push comes to shove. The problem with this maneuver is that it can look a bit obvious, so you may want to make it look like you're suddenly fascinated by something to the right of you—and then to the left of you..."
    },
    {
      "title": "Release the fart slowly.",
      "content": "Release the fart slowly. If you're in public and have no escape route and know that the fart is coming on any second now, then your best bet is to slowly release it. Carefully and slowly unclench your butt cheeks, wiggle around a bit, and then let the fart slowly escape from your body. If you let it out all at once, it's more likely to make a loud noise. If people start wrinkling their noses at the smell, just pretend like you didn't fart . You can even wrinkle up your nose and look around accusingly at the people nearby—they can't prove it was you!"
    },
    {
      "title": "Make a loud noise to cover the fart.",
      "content": "Make a loud noise to cover the fart. So this isn't the most ideal maneuver, but sometimes, you just know you have to fart, and you have no option but to make a loud noise or to cause a diversion when you know the time has come. Here are some things you can do: Cough loudly Laugh loudly Drop a textbook Turn on the radio Set off a phone alarm"
    },
    {
      "title": "Make an excuse to leave so you can fart.",
      "content": "Make an excuse to leave so you can fart. This is the easiest way to fart and get away with it. If it's possible, then you should simply excuse yourself for a minute and then go and do your business. [4] X Research source Here are the easiest things you can do: Pretend to take a phone call Go \"check something out\" on the other side of the room Say you need some fresh air Say you want to wash your hands Use the bathroom"
    },
    {
      "title": "Eat less of the foods that cause gas.",
      "content": "Eat less of the foods that cause gas. Some foods that are rich in sulfur may make you pass gas more often—not to mention that they may make those farts smell even worse! Foods filled with carbohydrates are also more likely to make you pass gas, but every person has their own \"trigger foods.\" Though you shouldn't avoid these foods entirely, try to cut back on them if you know you'll be going to a place where you may not want to fart. Foods that are known to cause gas include: [5] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Vegetables such as broccoli, cauliflower, cabbage, onions, and mushrooms Beans and other legumes Fruits such as apples, peaches, and pears Bran and whole wheat products Milk products such as cheese, yogurt, and ice cream Eggs Carbonated drinks, such as sodas"
    },
    {
      "title": "Avoid eating or drinking too fast.",
      "content": "Avoid eating or drinking too fast. Another reason why you may have gas is because you down your food or drinks too quickly and don't give your body time to properly digest your food. The next time you eat, make a conscious effort to slow down and to carefully chew your food until each bite is thoroughly broken down. Stop eating on the run, if that's what you do, and make an effort to slow down and eat a few minutes earlier if you need to. [6] X Research source If you like soda, make sure you sip it slowly instead of downing it in three gulps, or you're guaranteed to make the gas situation worse."
    },
    {
      "title": "Avoid chewing gum or sucking on hard candy.",
      "content": "Avoid chewing gum or sucking on hard candy. The repeated motion that accompanies chewing gum or sucking on hard candy can actually make you fart more. This can especially be the case if you're doing this on an empty stomach. If you want to minimize your embarrassment, then cut back on the chewing gum and hard candy. Chewing rapidly causes you to swallow extra air, and leads down to the breakdown of food in your gut, which can cause farting. [7] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Sugar-free gum and candy that contain sorbitol are the worst offenders since your colon can't digest them. [8] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Use over-the-counter medications for occasional relief.",
      "content": "Use over-the-counter medications for occasional relief. Though medication isn't necessary and should only be used if you really have a problem with this, consider taking over-the-counter medication to relieve occasional symptoms of flatulence. Beano , Gas-X , Mylanta Gas, or even Lactase tablets are good options. Be sure to follow the dosage instructions on the package. The medications break down sugar in your body, making food easier to digest. It's fine to take OTC medications as needed for short periods of time (like a week or so), but try to avoid relying on it in the long-term. If you find yourself needing to take medications for more than a week or so, reach out to your doctor for advice."
    },
    {
      "title": "Get regular exercise.",
      "content": "Get regular exercise. Sometimes people can fart more just because they aren't getting regular exercise or that they're sitting for prolonged periods of time — these two things tend to go hand in hand. If you make a goal of exercising for at least 30 minutes a day and moving around as much as you can throughout the day, then your body will be in better shape overall and you'll be less likely to pass gas. Exercise also helps you get rid of the extra air in your system. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source It can also help to go for a 10-15 minute walk right after a meal. [10] X Research source"
    },
    {
      "title": "See a doctor if these lifestyle changes don't help to reduce your gas.",
      "content": "See a doctor if these lifestyle changes don't help to reduce your gas. If your gas problem doesn't go away or gets worse, it's time to see a doctor for professional advice. This is especially true if you're experiencing a lot of abdominal pain and bloating along with the gas. You may also want to check with a doctor if you experience: A sudden change in your bowel habits Frequent bouts of constipation or diarrhea Rectal pain Sudden weight loss [11] X Research source"
    }
  ]
}