{
  "url": "https://www.wikihow.com/Break-the-Ice-on-Tinder",
  "title": "How to Break the Ice on Tinder",
  "steps": [
    {
      "title": "Mention something you saw in a profile picture or album.",
      "content": "Mention something you saw in a profile picture or album. Do they have a pet? Does it look like they have a very active social or work life? You could type something like, “Please tell me that dog in your profile picture belongs to you, because he is adorable.” If someone cares enough about something to include it in a profile picture (either because it’s important or just cute), chances are they won’t pass up an opportunity to talk about it. [1] X Research source Pets, books, activities, locations, friends, children, events, and fashion are all things you can take note of and ask about. Ask them for the story behind their profile picture. This is a simple opener and gives them the opportunity to share a little more about their life. You could ask, “Is there a story that goes along with your profile pic? It looks like you’re having a great time!”"
    },
    {
      "title": "Bring up the hobbies they mention in their bio.",
      "content": "Bring up the hobbies they mention in their bio. You could ask for more details about how they got interested in a particular activity, or you could share your own experience if it’s something you have in common. For example, you could say something like, “I saw on your profile that you like hiking. Last summer I spent a month backpacking on the Appalachian Trail. Where is the most beautiful place you’ve ever hiked? This could potentially lead to an easy date. If you share a hobby, you could ask if they would like to get together to do that activity sometime, or you could tell them you’d love to experience something they are a master of, like kickboxing, video-gaming, or volunteering."
    },
    {
      "title": "Tell them you had hoped to match because of “XYZ” in their profile.",
      "content": "Tell them you had hoped to match because of “XYZ” in their profile. If you’re genuinely interested in something you read on their profile, it’s perfectly fine and flattering to express excitement and interest. For example, if you noticed that they were born in Ireland and you have family who lives in Ireland, you could say, “I’m so excited we matched. I noticed you were born in Ireland, and I have family that lives there. What area did you live in?” [2] X Research source Finding these commonalities is really helpful in starting a conversation that won’t just die out after the opening lines and will hopefully bring you a little closer to a date."
    },
    {
      "title": "Send “two truths and a lie” if they have a sparse profile.",
      "content": "Send “two truths and a lie” if they have a sparse profile. This is a great way to get someone’s attention and to get to know them a little bit better when they don’t have a lot listed in their bio. When you get a match, simply send a message that says, “I have to get to know you a little more. Two truths and a lie?” [3] X Research source This can be a fun back a forth game. To play, you simply send 3 statements to the other person, 2 of which are true things about yourself, and 1 of which is made up. The other person then guesses which statements are truth and which is a lie. For example, you could tell someone where you were born, what your first job was, and then make up a lie about how many siblings you have."
    },
    {
      "title": "Use “this or that” questions for a quick opener to get the dialogue going.",
      "content": "Use “this or that” questions for a quick opener to get the dialogue going. Use the same line every time, or have an arsenal of options for different scenarios. For example, you could send a message that says, “Tacos or burritos?” or “What was the better invention: netflix or nutella?” “Would you rather” questions are very similar, too, and they are great options for starting a conversation. [4] X Research source Giving options rather than asking open-ended questions might appeal more to someone who is filtering through multiple matches. For “would you rather,” you could ask something like, “Would you rather go without cheese for the rest of your life or have to eat pancakes for every meal?”"
    },
    {
      "title": "Find out what current pop culture fad they can’t stand.",
      "content": "Find out what current pop culture fad they can’t stand. La Croix, rosé wine slushies, flossing, cactus inspired tattoos, mom jeans, that latest pop hit that’s playing everywhere—this is a fun way to learn something about someone and start talking. Try asking something like, “Confession time: what is a current “popular” thing that you secretly hate?” [5] X Research source For a funny follow up, you could search for a GIF or meme that includes that object and send it to them to tease them."
    },
    {
      "title": "Share information about yourself and follow it up with a question.",
      "content": "Share information about yourself and follow it up with a question. For example, you could say something like, “I’m planning on going to New York with some friends later this year. Where was the last place you traveled to for fun?” You could also say something along the lines of, “I love to cook and try out different recipes and recently made paella, which was a super fun (and delicious) experience. What are some of your favorite meals you’ve ever had?” Books, concerts, television, movies, and restaurants are all areas where you might have some common ground with your match."
    },
    {
      "title": "Find out what 3 items they would bring with them to a deserted island.",
      "content": "Find out what 3 items they would bring with them to a deserted island. Say something like, “I know it’s a little cliché, but if you were going to be stuck on a desert island, what 3 things would you bring with you for fun—not survival.” This can give you a lot of information about someone! Be prepared with your own answers in case they ask you back. [6] X Research source You could even make the question even more specific, like what 3 books they would bring, what 3 foods they would want to have, or which 3 people they would bring along for company."
    },
    {
      "title": "Pose a quirky question to pique their interest.",
      "content": "Pose a quirky question to pique their interest. You could ask something like, “What’s your favorite pasta shape? Mine is fusilli,” or “What was your favorite cartoon show growing up?” These questions or interests might be kind of obscure, but they also can be successful ice breakers. [7] X Research source You can google “quirky Tinder ice breakers” to get more ideas, or spend a few minutes brainstorming up a few of your own."
    },
    {
      "title": "Put their name in a joke to help break the ice.",
      "content": "Put their name in a joke to help break the ice. There are a lot of great examples of this online, but try to be clever and witty even if the joke ends up sounding a little silly. Chances are you’ll get a response just for being unique. [8] X Research source For example, if someone’s name is “Amy,” you could say something like, “You know, you can’t spell ‘dreamy’ without ‘amy.’” For someone named “Matt,” you could say something like, “I’m not sure that it matt-ers, but I’m glad we matched up.”"
    },
    {
      "title": "Share what the funniest opening line is that you’ve received on Tinder.",
      "content": "Share what the funniest opening line is that you’ve received on Tinder. This is a great way to get laughing about some of the experiences you have had, and hopefully your match will respond with their own story, too. [9] X Research source Similarly, you could ask them what the funniest or weirdest opening line is that they’ve received."
    },
    {
      "title": "Pretend that you don’t understand Tinder.",
      "content": "Pretend that you don’t understand Tinder. You could start out by saying, “Wait, what does this mean? We matched. So, we are engaged now? I’m so excited! I can’t wait to tell my mom.” Don’t keep up the charade for too long, though. Once you get a response, you could either continue playing along, or say something like, “But for real, I’m glad we matched. What are you up to today?” If the person plays along with you, you’ll know they have a good sense of humor and that you might get along well in person."
    },
    {
      "title": "Admit that you are unsure of how to break the ice.",
      "content": "Admit that you are unsure of how to break the ice. Sometimes being direct and admitting to vulnerability is a great way to open up a line of communication. You could say something like, “Man, I’m so excited to have matched with you that I can’t think of anything to say.” Or you could say something like, “Crickets chirp while I try to think of a witty opener.” Being transparent and funny is going to be more effective that a simple “Hey,” or “What’s up?”"
    },
    {
      "title": "Ask for a date outright.",
      "content": "Ask for a date outright. Say something like, “Well, I obviously think you’re cute. And you swiped right. Why don’t we get together this week for a drink?” This is a bold and direct way to break the ice, without easing into a conversation with the person first. The other person might respond and say yes, or perhaps they will say they’d like to chat a little first. Or they might ignore you. It’s a bit of a gamble but could have a fun payoff."
    }
  ]
}