{
  "url": "https://www.wikihow.com/Care-for-a-Cast-Iron-Skillet",
  "title": "How to Care for a Cast Iron Skillet",
  "steps": [
    {
      "title": "Wash it",
      "content": "Wash it right after use. Try to get to it before the food you cook has a chance to crust over the skillet. This makes cleanup a lot easier. Simply wipe out the food scraps with a sponge and then rinse the skillet with hot water. [1] X Research source You can use a touch of regular dish soap to help dislodge sticky food, but don't use too much. Never use bleach or any kind of harsh cleanser. Never put your cast iron skillet in the dishwasher. The detergent will corrode the iron."
    },
    {
      "title": "Remove built-up food with salt and vinegar.",
      "content": "Remove built-up food with salt and vinegar. If the bottom of the skillet has a layer of caked-on food, make a mixture of coarse salt and vinegar and use a paper towel to rub it around the bottom of the skillet. It's easier on the iron than a scrub brush would be, and less likely to remove the nonstick seasoning. [2] X Research source You can also burn off caked food. Turn up the oven to 500 °F (260 °C) and put the skillet inside for an hour or so. The food will turn to ash, and you'll be able to brush it off and rinse the skillet. However, if you use this method you'll need to re-season the skillet, since that will get burned off as well."
    },
    {
      "title": "Dry the skillet thoroughly.",
      "content": "Dry the skillet thoroughly. Leaving wet spots on the skillet will lead to rust. After washing the skillet, use a dishcloth to dry it all over, including the handle. [3] X Expert Source Kadi Dulude House Cleaning Professional Expert Interview. 22 September 2019."
    },
    {
      "title": "Store the skillet in a dry place.",
      "content": "Store the skillet in a dry place. If you're stacking it with other pans, you might want to line the skillet with a paper towel to make sure that no moisture gets trapped between them and protect the seasoning from getting scratched off. [4] X Research source"
    },
    {
      "title": "Preheat the oven",
      "content": "Preheat the oven to 350 ºF. To season a brand new cast iron skillet, you rub it with oil and bake the oil into the surface of the cast iron. This builds up a nonstick coating, called the \"seasoning,\" that keeps the skillet from rusting and creates the perfect surface for cooking everything from scrambled eggs to pancakes to cobblers. [5] X Research source"
    },
    {
      "title": "Wash and dry the new skillet.",
      "content": "Wash and dry the new skillet. Use hot, soapy water and a scrub brush to scrub the skillet completely clean. This will remove any chemicals or other residues from the skillet so they don't get trapped in the seasoning. [6] X Research source After this first washing, you won't be using a scrub brush on the skillet again, since it will take off the precious seasoning you'll be working to preserve. Make sure to dry the skillet well, so that it doesn't create steam when you put it in the oven."
    },
    {
      "title": "Coat the skillet with fat.",
      "content": "Coat the skillet with fat. You can use flaxseed, vegetable shortening, or olive oil. Use a paper towel to rub the fat into the skillet all over. The fat will bake into the skillet and fuse with the iron to become a layer of seasoning. You won't be able to taste or smell it once the process is complete. [7] X Expert Source Kadi Dulude House Cleaning Professional Expert Interview. 22 September 2019. Try not to miss any spots when you're covering the skillet with fat. If you miss a spot, it won't get a coating of seasoning, and will be more prone to rusting."
    },
    {
      "title": "Put the skillet in the oven.",
      "content": "Put the skillet in the oven. Bake the skillet for 2 hours to make sure the seasoning gets fully formed. [8] X Research source After a few hours, remove it from the oven and set it on a heat safe surface to cool. [9] X Expert Source Kadi Dulude House Cleaning Professional Expert Interview. 22 September 2019."
    },
    {
      "title": "Repeat the process.",
      "content": "Repeat the process. Spread another coating of fat onto the skillet and bake it for another 2 hours, then let it cool. If you'd like, you can repeat it one more time to make extra sure that the seasoning won't strip off when you cook your first meal in the skillet. After this initial seasoning, the oil you use when you cook food will keep the skillet in good shape. Every time you cook a meal, the nonstick surface will improve."
    },
    {
      "title": "Soak the skillet in a vinegar solution.",
      "content": "Soak the skillet in a vinegar solution. This will eliminate the rust , and it works no matter whether you have a few spots or the entire skillet has gotten rusty. Get a big pot large enough to hold the skillet. Fill it with a solution of half white vinegar, half water. Place the skillet in the pot and make sure it's completely submerged. Soak it for at least 3 hours so the vinegar has time to dissolve the rust. [10] X Research source When you remove the skillet, check for rust. If you still see rust spots, use a scrub brush to scrub them away. Don't soak the skillet for more than 4 hours, or the iron will start to degrade. You just want to soak it long enough to take off the rust. [11] X Research source"
    },
    {
      "title": "Rinse and dry the skillet.",
      "content": "Rinse and dry the skillet. Rinse off all of the vinegar, then use a dish towel to completely dry the skillet. [12] X Research source"
    },
    {
      "title": "Coat it with fat.",
      "content": "Coat it with fat. Just like you would for a brand-new skillet, use a paper towel to rub lard, olive oil or vegetable oil all over the skillet. This will become the skillet's new seasoning. [13] X Expert Source Kadi Dulude House Cleaning Professional Expert Interview. 22 September 2019."
    },
    {
      "title": "Bake the skillet for 2 hours.",
      "content": "Bake the skillet for 2 hours. Put it in an oven preheated to 350 °F (177 °C). After 2 hours, remove the skillet and let it cool completely. [14] X Research source"
    },
    {
      "title": "Repeat the process.",
      "content": "Repeat the process. Coat it in another layer of oil, bake for 2 hours, and allow it to cool again. The once-rusty skillet should now have a protective layer of seasoning."
    }
  ]
}