{
  "url": "https://www.wikihow.com/Cope-when-Your-Friend-Dumps-You",
  "title": "How to Cope when Your Friend Dumps You",
  "steps": [
    {
      "title": "It’s okay to be sad, heartbroken, and angry.",
      "content": "It’s okay to be sad, heartbroken, and angry. Losing a friend can be really hard. You don’t have to deny your own feelings and you shouldn’t try to bury them. Let yourself get angry or feel sad or even cry if you need to. Eventually, you’ll heal from the experience and it won’t hurt as much. [1] X Research source The first step in moving past the loss of a friend is getting in touch with how you feel. [2] X Expert Source Chloe Carmichael, PhD Licensed Clinical Psychologist Expert Interview. 29 May 2019."
    },
    {
      "title": "Try to come up with 1 or 2 insights you’ve gained from the experience.",
      "content": "Try to come up with 1 or 2 insights you’ve gained from the experience. Believe it or not, there may be some value to having your friend dump you. It can sometimes teach you things about yourself and about other people. Take some time to think about anything that may give your pain some value. [3] X Research source For instance, you may have put too much trust in your friend or assumed that they would never do anything to hurt you. It doesn’t mean you can’t trust anyone again, but now you know what can happen if you put too much faith in someone who doesn’t have your best interests at heart."
    },
    {
      "title": "Try not to take the end of your friendship personally.",
      "content": "Try not to take the end of your friendship personally. Remember that it was your former friend who decided to end your friendship. It’s not your fault. They may just be on a different path than you and it has nothing to do with who you are. It may feel painful now, but the end of your friendship may actually turn out to be a good thing that frees you up to make new friendships. [4] X Research source If your friend ended your friendship because they feel you abused or mistreated them, you may want to use it as an opportunity to reflect on your actions."
    },
    {
      "title": "Get back into the activities that you love.",
      "content": "Get back into the activities that you love. Try to get into a new routine that includes time for the things that make you happy. Do things that bring you joy and help you connect with other people. It may help you come to terms with losing your friendship. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For instance, if you used to get together with friends to play video games or exercise, try getting back into it. Familiar activities can make you feel good and keep your mind off of the loss of your friend."
    },
    {
      "title": "Use new activities to occupy the space left by your friend.",
      "content": "Use new activities to occupy the space left by your friend. If there’s something you’ve always wanted to try, now is the perfect time to do it. Keeping busy can help distract you from the loss of your friendship, so it helps to fill the time that you used to spend with your friend with new hobbies or activities. [6] X Expert Source Chloe Carmichael, PhD Licensed Clinical Psychologist Expert Interview. 29 May 2019. It can be something fun like a cooking class or something challenging like running a marathon. [7] X Research source Look up classes or clubs online if you’re trying to get into something new. For instance, if you always wanted to try rock climbing, there’s probably a local gym or club you can join to learn how to do it!"
    },
    {
      "title": "Help yourself heal by pampering yourself a little bit.",
      "content": "Help yourself heal by pampering yourself a little bit. Find activities that are calming and soothing, so you can do something just for you. A spa day can be a great pick-me-up. Get a facial, massage, manicure, or pedicure, and try to focus on yourself. If you're on a budget, even a spa day at home with a bubble bath can lift your spirits. Go shopping and buy yourself those shoes or sunglasses that you've been wanting for a while. Plan a movie marathon of all your favorites films, complete with popcorn and candy. Have a nice meal at restaurant that you've been dying to try. Even something simple like indulging in an ice cream cone or smoothie can help boost your mood."
    },
    {
      "title": "Nobody has to read it, but it can help get your feelings out.",
      "content": "Nobody has to read it, but it can help get your feelings out. While talking to other people can help you feel less alone, writing a note about how you feel to yourself can help you come to terms with your own emotions. Start a journal or write a letter to your former friend that talks about the end of your friendship and how you feel about it. Nobody ever has to see the letter, so be as honest and open as you can be. [8] X Research source Just the act of writing about your feelings can be really therapeutic."
    },
    {
      "title": "Put them away, at least until you’ve moved on.",
      "content": "Put them away, at least until you’ve moved on. Gather any items that remind you of your friend such as photos, clothing, or gifts. Place them in a container like a box or a basket and put them somewhere out of sight such as in a closet or beneath your bed. Moving on from your friend can be a little easier if you aren’t constantly reminded about them. [9] X Research source You can throw them away if you like, or you can keep them for when you aren’t feeling as hurt. They may be memories that you’ll treasure once you heal."
    },
    {
      "title": "Seeing them online can make things harder.",
      "content": "Seeing them online can make things harder. You likely have a lot of photos together on any social media sites that you’re friends on. Seeing old memories can bring up negative feelings, and seeing your former friend live their life without you can be hurtful as well. It’s best to just unfriend and unfollow them so you don’t have to deal with it. [10] X Research source We all love Facebook, Twitter, Instagram, and other social media apps, so it may be difficult, but you don’t want to be obsessively stalking your former friend’s accounts. [11] X Expert Source Chloe Carmichael, PhD Licensed Clinical Psychologist Expert Interview. 29 May 2019. You can unfollow them or fully block them so they can’t see any of your stuff either."
    },
    {
      "title": "Enjoy doing things with people you love.",
      "content": "Enjoy doing things with people you love. Hang out with some of your other friends or visit family members you haven’t seen in a while. Enjoy being in the company of people who love you and find some fun or relaxing activities you can do to take your mind off of your former friend. [12] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For instance, you could go out for dinner with some old friends or hang out with your sibling and watch a movie."
    },
    {
      "title": "Cultivate new friendships that will replace your old ones.",
      "content": "Cultivate new friendships that will replace your old ones. Just because your friend dumped you doesn’t mean you won’t ever have any other friends! Try joining a specific interest group on social media, take an educational or fitness class, or get involved in your community. There are people you can meet that you may end up having a lot in common with. [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source For example, if you’re super into gardening, you can look for local gardening groups you can join. You’ll meet other people who share your interests. A fitness class can be a great way to get in shape and make new friends at the same time!"
    },
    {
      "title": "It can make you feel less alone.",
      "content": "It can make you feel less alone. Reach out to people you feel like you can talk to, especially people who have been through difficult breakups before. Don’t try to deal with your pain on your own. Talk to people you trust about how you’re feeling so they can empathize with you and make you feel less alone. [14] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "There’s nothing wrong with seeking help if you need it.",
      "content": "There’s nothing wrong with seeking help if you need it. Losing a friend that you cared about can be really difficult to cope with. If your emotions are intense and you’re having trouble coming to terms with your friend dumping you, reach out to a counselor or a therapist. They’ll be able to help you overcome and cope with your feelings of loss. [15] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You can go online to look up therapists and counselors in your area. Reader Poll: We asked 678 wikiHow readers which coping strategy they find most helpful after experiencing rejection, and only 9% of them agreed on seeking professional help or therapy. [Take Poll] Therapy can be extremely helpful and you should always seek help if you need it, but in many cases, it may be enough to rely on the support of friends and family."
    }
  ]
}