{
  "url": "https://www.wikihow.com/Scrap-a-Car",
  "title": "The Best Ways to Scrap Your Vehicle & Make Money Fast",
  "steps": [
    {
      "title": "Sell car parts separately for extra cash.",
      "content": "Sell car parts separately for extra cash. Some components in your vehicle are more valuable when you resell them as opposed to scrapping them. Even though removing parts may reduce the overall scrap value of your vehicle, there’s potential to earn more for the individual pieces. Take out any aftermarket parts that you had installed and list them on sites like eBay or Facebook Marketplace to see if there are any potential buyers. Some potential valuable parts in your vehicle are: [1] X Research source Car battery Tires and rims Alternator Radiator Audio or GPS systems Catalytic converter (if they’re legal to sell in your area)"
    },
    {
      "title": "Remove all your belongings from your vehicle.",
      "content": "Remove all your belongings from your vehicle. Go through your vehicle and look for anything that you want to keep. Empty out the center console and glove compartment, and check under and in between the seats for any personal items that got stuck. [2] X Research source If your vehicle is really dirty or muddy, you may get a lower scrap price for it. Clean your car so you get the best value. Remove your license plates as well if you don’t plan on driving your vehicle anymore."
    },
    {
      "title": "Compare offers from scrapyards and car-buying websites.",
      "content": "Compare offers from scrapyards and car-buying websites. Contact the local scrap yards in your area and tell them the year, make, and model of the vehicle you want to scrap. Alternatively, search “junk car buyers” and the name of your city on Google to find websites that will buy your car for scrap metal. You may need to upload information and images about your vehicle before getting an estimate. Choose the service that gives you the best offer to earn the most money from your vehicle. [3] X Research source Scrapyards may ask for pictures of your vehicle to assess any damage to your vehicle. Either text or email pictures of your car so you’re able to get an accurate estimate. Be sure to ask about any processing fees you’d have to pay to ensure you’re getting the best deal for your vehicle."
    },
    {
      "title": "Schedule a pickup or dropoff for your vehicle.",
      "content": "Schedule a pickup or dropoff for your vehicle. If you’re able to drive your vehicle, take it right to the scrapyard to drop it off in person. If you accepted an offer from a website or if your vehicle doesn’t work anymore, then they’ll set up a time to pick up the vehicle from your location with a tow truck. When you drop your vehicle off or have it towed, you’ll be paid for your vehicle right after you sign off on the sale and give them the title. [4] X Research source Junkyards may try to lower the price of your vehicle if they notice more damage than you claimed."
    },
    {
      "title": "Gather your vehicle title and ownership documents.",
      "content": "Gather your vehicle title and ownership documents. Because you need to prove that you own the vehicle you’re getting rid of, look through your documents to find the title. You may also need a bill of sale, junk title application, or title transfer application, but ask the junkyard or web service directly to see what paperwork they require. [5] X Research source The paperwork you need may also depend on your state laws. Contact your local DMV to find out what papers or forms are required to sell or scrap a vehicle in your area. If you can’t find your vehicle’s title, then get a replacement before scrapping your vehicle. If you still have liens or loans out on your vehicle, then you will have to settle the remaining balance and get a lien release form before scrapping your vehicle. [6] X Research source"
    },
    {
      "title": "Remember to cancel your registration and insurance.",
      "content": "Remember to cancel your registration and insurance. Because you don’t have your vehicle anymore, contact your state’s DMV to find out the process for canceling your vehicle’s registration. Then, contact your insurance provider to cancel your automotive policy so you don’t have to pay for it anymore. Some states will refund a portion of your vehicle’s registration payment when you cancel it."
    },
    {
      "title": "Local junkyards",
      "content": "Local junkyards Junkyards are usually the easiest and most reliable places to sell your vehicle since they’re local to your area. When you look for junkyards, ensure that they buy junk vehicles from individuals and check their reviews online to see what experiences other customers have had. After you explain the make, model, and year of your vehicle, ask for a quote on your vehicle. [7] X Research source Some junkyards may offer free towing if you’re not able to drive your vehicle, but others may charge a fee."
    },
    {
      "title": "Online car buyers",
      "content": "Online car buyers Online car buyers pay cash for your vehicle before delivering them to junkyards. Look for sites that offer online estimates so you’re able to type in your vehicle information and get a quote for how much your vehicle is worth. Many sites will buy junk cars that are undriveable, but you may be able to sell a working vehicle for even more money. Choose the site that gives you the best offer for your vehicle. Peddle accepts junk vehicles nationwide and will usually pick up and pay for your vehicle within 1–2 days. CarBrain will purchase any totaled or non-running vehicle, and you’ll usually get paid 1–2 days after receiving a quote. Wheelzy gives you an instant offer within minutes and pays you on the spot when they pick up your vehicle. Carvana and Cars.com buy driveable vehicles as long as the odometer still works."
    },
    {
      "title": "You'll make $300–500 USD for scrapping your car.",
      "content": "You'll make $300–500 USD for scrapping your car. The average scrap price for a vehicle is around $165 USD per 1 t (1,000 kg). Since most vehicles weigh 2 t (2,000 kg) or more, you’ll usually get at least $300 USD but typically no more than $500 USD depending on the weight of your vehicle. [8] X Research source Other factors that may affect the value of your vehicle include the quality of the scrap metal, market price fluctuations, and the time of year."
    },
    {
      "title": "You may be able to scrap a vehicle without a title for an additional fee.",
      "content": "You may be able to scrap a vehicle without a title for an additional fee. The car title proves that you own the vehicle, and you usually have to transfer it to the junkyard or web service to get a full payment. Some states don’t hand out titles, so contact your DMV to find out what paperwork you need in order to scrap your vehicle. [9] X Research source If you don’t have a your vehicle’s title, some junkyards and websites will still let your scrap your car after paying a $50–150 fee."
    },
    {
      "title": "Scrap your vehicle if it's undrivable or requires expensive repairs.",
      "content": "Scrap your vehicle if it's undrivable or requires expensive repairs. Because you’ll get the lowest value when you scrap a car, it’s usually a last resort if your vehicle isn’t working and repairs cost more than its value. If your vehicle is still drivable or only requires minor repairs, then you’ll most likely get more money from fixing and selling your car instead."
    },
    {
      "title": "Sell your vehicle if it still runs.",
      "content": "Sell your vehicle if it still runs. If you want to get the most money for a working vehicle, privately sell your car to a buyer in your area. Let your friends and family know you’re selling your vehicle to see if they know anyone who’s interested. Otherwise, post your vehicle online to sites like eBay or Facebook Marketplace to get offers from other people. [10] X Research source Check your state’s requirements for selling a vehicle privately because you may need special paperwork to transfer the title. Alternatively, go to a dealership to see if you’re able to trade in your vehicle . They’ll either pay you for your car or put the money towards getting a new one."
    },
    {
      "title": "Keep the vehicle for spare parts.",
      "content": "Keep the vehicle for spare parts. If you’re handy with repairing vehicles, save a junk car to use the parts on another vehicle you own of a similar make and model. If a part goes bad on the vehicle that you drive, then remove and install the working part from the junk car instead. That way, you won’t have to pay for an expensive new part from a mechanic."
    },
    {
      "title": "Donate your vehicle to charity.",
      "content": "Donate your vehicle to charity. Contact the charity of your choice to see if you’re able to donate your vehicle . Many charity organizations take junk car donations that they sell to junkyards so you’re able to get rid of your vehicle and help out a cause you care about. Additionally, you may qualify for a tax deduction based on the value of your vehicle and get a larger return later on. [11] X Research source"
    }
  ]
}