{
  "url": "https://www.wikihow.com/Preserve-Air-Jordan-Sneakers",
  "title": "How to Preserve Air Jordan Sneakers",
  "steps": [
    {
      "title": "Put them in zip locks with few packs of silica.",
      "content": "Put them in zip locks with few packs of silica. [1] X Research source"
    },
    {
      "title": "Buy Force guards.",
      "content": "Buy Force guards. If you have a ton of shoes but preserving them is worth it as it makes creasing nearly impossible. [2] X Research source"
    },
    {
      "title": "Try not to wear them in bad weather.",
      "content": "Try not to wear them in bad weather. Even the lightest rain can damage your shoes and cut off a year in its life."
    },
    {
      "title": "Try not to wear the same shoe more than twice a week at max!",
      "content": "Try not to wear the same shoe more than twice a week at max! [3] X Research source If you have a lot of shoes, then schedule when you'll wear them. It sounds like high maintenance but you'll be glad you did it!"
    },
    {
      "title": "Use light cleaning agents.",
      "content": "Use light cleaning agents. Try Mr. Clean 's Magic Eraser."
    },
    {
      "title": "When you get home, don't just leave your shoes by the door to collect dust.",
      "content": "When you get home, don't just leave your shoes by the door to collect dust. Just put them back in the box. [4] X Research source"
    },
    {
      "title": "Keep them in dark areas like your closet.",
      "content": "Keep them in dark areas like your closet. Light ages a shoe and the material. [5] X Research source"
    },
    {
      "title": "Stay away from clubs and dances.",
      "content": "Stay away from clubs and dances."
    },
    {
      "title": "Don't drive with nice shoes.",
      "content": "Don't drive with nice shoes. You only use the front of your foot to hit the pedals and that creates a 45 degree crease angle and your shoe will crease. Try bringing an extra pair of old shoes!"
    },
    {
      "title": "Don't continuously clean your shoe after each time you wear them!",
      "content": "Don't continuously clean your shoe after each time you wear them! Continuous cleaning from water creates oxidation in the air and that very air you breathe creates a chemical compound that creates the infamous yellowing found on famous Jordans like the 5's,6's,11's,and 16's. The less water, the better and the less cleaning, the better."
    }
  ]
}