{
  "url": "https://www.wikihow.com/Find-the-Publisher-of-a-Book",
  "title": "How to Find the Publisher of a Book",
  "steps": [
    {
      "title": "Look for the publisher’s name on the title page.",
      "content": "Look for the publisher’s name on the title page. The name of the publisher should appear at the bottom of the title page, under the title and author of the book. The publisher’s name will usually be listed under the logo for the publisher. [2] X Research source"
    },
    {
      "title": "Check the copyright page for the publisher’s name.",
      "content": "Check the copyright page for the publisher’s name. The copyright page may appear on the back of the title page or on the following page. The copyright page will list the author’s full name and then the name of the publisher, usually at the top of the page. [3] X Research source The address of the publisher will usually also appear at the bottom of the copyright page, which can be useful for your citation if you need to note the city where the publisher is based."
    },
    {
      "title": "Locate the publisher’s name on the back of the book.",
      "content": "Locate the publisher’s name on the back of the book. The name of the publisher should be listed above the ISBN barcode on the back of the book. The publisher’s name should be easy to spot over the ISBN barcode. [4] X Research source"
    },
    {
      "title": "Check for mentions of the publisher in the acknowledgements or elsewhere.",
      "content": "Check for mentions of the publisher in the acknowledgements or elsewhere. Old books, books that have been self-published, or books produced by very small publishers may not have the publisher's name listed on the title page or the copyright page. If you cannot find their name on the back of the book either, skim through the book to check for information on the publisher. For instance, look at the author's acknowledgements page (if there is one) to see if they mention the publisher."
    },
    {
      "title": "Look up the publisher on bookseller websites.",
      "content": "Look up the publisher on bookseller websites. If you do not have a physical copy of the book, you can find the publisher’s name by searching the book title on websites like Amazon, Indigo, Powells, and other major booksellers. The bookseller’s website will probably provide complete information on the book, including the publisher’s name and where they are located. [5] X Research source You can also look for the publisher's name on Google Books. This can be especially helpful for older and out-of-print books."
    },
    {
      "title": "Read reviews of the book online to find the publisher information.",
      "content": "Read reviews of the book online to find the publisher information. You can also check the first several lines of reviews of the book online, as the reviewer will often list the book’s publisher in the review. The publisher’s name and location will usually appear in bold before the review or in the first 1-2 lines of the review. [6] X Research source You can also look at online book review websites like Goodreads, as the publisher’s name will be listed on the main page for the book on the site."
    },
    {
      "title": "Check for the publisher’s name online through your local library.",
      "content": "Check for the publisher’s name online through your local library. Do a search for the book title on your local library’s website to find the publisher’s name and location. It will usually be listed below the title and author of the book. [7] X Research source You can also access the Library of Congress online catalog to search for the publisher for the book. Put the title of the book in the catalog to see if the publisher is listed."
    },
    {
      "title": "Look up the publisher through an academic database.",
      "content": "Look up the publisher through an academic database. If you are searching for the publisher of a scholarly book or text, use an academic database like Google Scholar online. You can also search for the publisher of the book through scholarly databases like JSTOR through your local university library."
    },
    {
      "title": "Include the location of the publisher in the citation.",
      "content": "Include the location of the publisher in the citation. For APA format, you will need to include the city and state or area where the publisher is based in the citation. For MLA and Chicago Style format, you will need to include the city where the publisher is based in the citation. [8] X Research source The city and state or area should be listed with the publisher’s information in the print book, or online. For example, you may write, “New Haven, CT” or “Toronto” as the publisher’s location."
    },
    {
      "title": "Write the publisher’s full name.",
      "content": "Write the publisher’s full name. Include the publisher’s name as it appears on the print book or online. Separate the location of the publisher and their name with a colon. For example, you may write, “New Haven: Harvard University Press” or “Toronto: Quattro Books.”"
    },
    {
      "title": "Place the publisher’s name in the citation properly.",
      "content": "Place the publisher’s name in the citation properly. Follow the appropriate citation style for citing a book based on the format you are using. The location of the publisher and their name should appear at the end of the citation. For example, for APA format, you would write, “Connelly, K. (2013) Come Cold River. Toronto, ON: Quattro Books.” For MLA format, you would write, “Connelly, Karen. Come Cold River. Toronto: Quattro Books, 2013.” For Chicago Style format, you would write, “Connelly, Karen. Come Cold River. Toronto: Quattro Books, 2013.”"
    }
  ]
}