{
  "url": "https://www.wikihow.com/Apply-Zombie-Makeup",
  "title": "How to Apply Zombie Makeup",
  "steps": [
    {
      "title": "Prepare your face.",
      "content": "Prepare your face. You'll want to start with a clean canvas, so use a gentle cleanser to remove makeup and oils from your skin. Rinse with warm water, then pat (don't rub) your face dry with a towel. Avoid putting on moisturizer or sunscreen. These products might cause latex-based makeup to slide off. Pull your hair back. If you have long hair or bangs, keep it out of your face while you work. Put it up into a ponytail , and clip stray hairs out of the way with bobby pins or a headband. If you're a guy, you may want to shave before applying any make-up or prosthetic. Latex and gelatin can get stuck in the hair, making it them quite painful to remove."
    },
    {
      "title": "Apply latex or gelatin to create wounds and gashes (optional).",
      "content": "Apply latex or gelatin to create wounds and gashes (optional). Liquid latex and gelatin are two substances you can use to create really cool zombie effects - like open wounds, bloody gashes, bite marks and broken noses. Although they might sound intimidating or overly complicated to use, both liquid latex and gelatin are actually surprisingly easy to work with. An explanation of how both products work can be found in parts three and four of this article. If you do decide to work with either liquid latex or gelatin, they will need to be applied at this point in the make-up process, that is, before you begin working with face paints. However, if you decide these products are too much work or you don't have time to find them, just skip to the next step. You can still create a hideously decayed zombie look without them!"
    },
    {
      "title": "Apply a base of white face paint or stage make-up.",
      "content": "Apply a base of white face paint or stage make-up. Using a soft makeup or stippling sponge, dab the white all over your face. Then blend it in small, light motions until your whole face is covered in a thin layer of makeup. Allow it to dry completely. Create a mottled effect by subtly applying a second color over the white. You can go with grey for an ashen, decayed effect, red or purple for a bruised effect or green and yellow for a gangrenous effect. Use the best quality face paint you can find. Cheap, low-quality face paint will not blend well and is bad for your skin. Try to get your hands on some high-quality stage make up - it can usually be found in good costume stores."
    },
    {
      "title": "Create dark circles around your eyes.",
      "content": "Create dark circles around your eyes. Dark, sunken eyes can help you look dead, violently injured, sleep-deprived, or all of the above! Outline your lids with dark pencil eyeliner, then smudge it outward. Then use black or brown eyeshadow or face paint to fill in the dark circles beneath the eyes and around the eyelids. Blend around the edges with purple and red paint or shadow to create the illusion of freshly-bruised skin, or with green and yellow for an older looking bruise."
    },
    {
      "title": "Hollow out your cheeks.",
      "content": "Hollow out your cheeks. Zombies are often pretty emaciated looking - good brains can be hard to come by you know! You can achieve this sunken in effect by sucking in your cheeks and lightly blending some black powder or paint into the hollows. This will highlight your cheekbones."
    },
    {
      "title": "Darken your lips.",
      "content": "Darken your lips. Apply black lipstick or face paint to your lips for a dried-out, dead look. Also emphasize the creases around your mouth with some dark, shadowy lines."
    },
    {
      "title": "Create popping veins and bloody scratches.",
      "content": "Create popping veins and bloody scratches. Use a small paintbrush to paint thin, zig-zagged lines in blues and purples all over the face to create popping veins. Take a dry stippling sponge (or some other coarse sponge) and dip it in red face paint. Draw the sponge lightly over the skin to create a bloody-looking scratch."
    },
    {
      "title": "Finish with some fake blood.",
      "content": "Finish with some fake blood. You can buy fake blood at most costume stores, or you can make your own non-toxic version simply by adding some red food coloring to corn syrup. For all the fake blood you'll ever need, mix one cup of corn syrup with one or two tablespoons of red food coloring. For darker, more realistic looking, you can also add one or two drops of blue food coloring. Apply the blood to your hairline and let it drip down your face, or cup some blood in your hand and dip your mouth in to make it look like you just fed! Use a toothbrush for blood spatter. Put some fake blood onto a toothbrush, aim the bristles at your face, and run your finger over the bristles from bottom to top. Create a dripping blood effect. Dip a sponge into the fake blood and squeeze it over your skin. The blood should run into a natural-looking drizzle."
    },
    {
      "title": "Wear creepy zombie contact lenses.",
      "content": "Wear creepy zombie contact lenses. Zombie contact lenses - which are typically very pale blue or white - can really up the scare-factor of your costume. Find such contact lenses online or at costume stores."
    },
    {
      "title": "Get greasy zombie hair.",
      "content": "Get greasy zombie hair. The undead aren't particularly concerned with personal hygiene, so washing their hair isn't a priority. If you want your locks to look limp and lifeless, rub a generous amount of conditioner through them. You can do this before or after you apply your makeup. You can also make your hair look messy and unkempt (for that \"just out-of-the-coffin\" look) by teasing or backcombing the hair using a small comb. Spritz with hairspray to hold in place. Sprinkle baby powder into your roots to achieve a graying, ashen effect."
    },
    {
      "title": "Stain your teeth.",
      "content": "Stain your teeth. Like the rest of their bodies, zombies' teeth are typically rotting and decayed. Of course, it's possible to buy fake teeth at the costume store, but these can be awkward or uncomfortable to wear and prevent you from talking or eating properly. Overcome this problem by (temporarily) staining your teeth using water mixed with a little brown food coloring. Swish the mixture around your mouth and between your teeth, then spit out. Alternatively, you could use red food coloring for a bloody effect! When you're done, brush your teeth with a little baking soda to remove the stains and restore your teeth to their original color."
    },
    {
      "title": "Create the costume.",
      "content": "Create the costume. Perfect zombie make-up should be complemented by an authentic-looking zombie costume. To create a classic zombie costume, get some old dress clothes (second-hand stores are great for this) and do whatever you can to rip and dirty them. Go at them with a scissors, roll them in the mud, give them to the dog to chew on - the scruffier they end up looking, the better. Create bullet holes in your clothing by making circular marks with black permanent marker, then dribble or splatter fake blood around the edges. The great thing about zombie make-up is that you can wear it with any costume to instantly zombify it. Use your creativity to come up with a zombie version of whatever boring Halloween costume you were originally thinking of -- become a zombie ballerina, a zombie tourist or a zombie pirate!"
    },
    {
      "title": "Purchase liquid latex.",
      "content": "Purchase liquid latex. Liquid latex is good for achieving a generally deathly look, as well as building up wounds or other facial deformities. You should be able to find it at seasonal Halloween supply stores, or at beauty supply chains. Choose a color that looks appropriately pale and decaying."
    },
    {
      "title": "Use the \"stretch and stipple\" technique.",
      "content": "Use the \"stretch and stipple\" technique. Stretching out your skin as you apply latex ensures that you won't have any accidental blank patches. Additionally, it will leave you with some decidedly creepy wrinkling when the latex dries. Gently spread or stretch the area of skin you're painting. It's best to do this technique one area at a time (i.e., forehead, one cheek, chin, etc.). Using a clean paintbrush or makeup sponge, apply a thin layer of liquid latex to the area in small stippling motions. Keep your strokes light and short."
    },
    {
      "title": "Build up deformities or wound sites.",
      "content": "Build up deformities or wound sites. You can use these techniques to make the face look misshapen, or lay the groundwork for a scabbing \"wound.\" Apply another layer of latex to \"build\" your make up. Creating light layers of latex, instead of smearing on thick amounts, creates even coverage with minimal clumping. Mix a little bit of uncooked oatmeal with the latex, then apply in one or two small areas on the face. This is great for a gangrenous or scabby look. Put single-ply tissue between latex layers. Get a piece of toilet paper, and separate the sheets so that you have a single ply. Rip the edges until you have the shape and size you want. Hold it over an area with a base latex layer already underneath it, and paint another layer over it. It will help disguise the smoothness of your skin with a rotting texture."
    },
    {
      "title": "Put wounds or scabs into latex.",
      "content": "Put wounds or scabs into latex. By selectively ripping parts of the liquid latex, you can put wide gashes or small lacerations into your new skin. Use scissors. You should carefully snip the latex until you create the wound you want. Be careful not to nick your skin! Use a toothpick. Simply stick it into the liquid latex and drag it through for a gaping wound."
    },
    {
      "title": "Fill your wounds with blood.",
      "content": "Fill your wounds with blood. Dip a clean paintbrush or makeup sponge into fake blood, and gently dab it into your gashes or over your oatmeal portions."
    },
    {
      "title": "Make gelatin",
      "content": "Make gelatin a few hours before. For the right consistency, use about 1/3 cup (80mL) of water per packet of gelatin. Color the gelatin. Use a few drops of food coloring for an unnatural tone, or add a bit of liquid foundation in a tone close to your skin for a flesh-like look. Cut the gelatin into cubes. Store it in a bowl or resealable plastic bag."
    },
    {
      "title": "Gently heat the gelatin.",
      "content": "Gently heat the gelatin. If you heat it to boiling, you'll break down the structure of the gelatin. Put it in a bowl in the microwave and heat in 10-second intervals, until the cubes have softened and become slightly gooey."
    },
    {
      "title": "Apply the gelatin to your face to create raised wounds.",
      "content": "Apply the gelatin to your face to create raised wounds. Using a popsicle stick or tongue depressor, glop the gelatin onto the area. As it begins to dry and re-harden, use the stick to pull up small, stretchy threads — this will create more texture around the wound."
    },
    {
      "title": "Allow the gelatin to harden and dry.",
      "content": "Allow the gelatin to harden and dry. If you're still using a makeup sponge on other parts of your face, be careful to steer clear of the gelatin areas."
    }
  ]
}