{
  "url": "https://www.wikihow.com/Car-Makes-Noise-when-Turning",
  "title": "Why Does Your Car Make Noise When You Turn?",
  "steps": [
    {
      "title": "",
      "content": "The 4 CV joints connect each wheel to their respective axle. These joints allow the wheels to turn at different angles so that they don’t fight one another on sharp turns, and they help the transmission transfer power by rotating. If they’re damaged, they can make a lot of noise. You may also notice your car shaking when you accelerate. [1] X Research source What’s it sound like? When you turn around corners, you’ll notice a clicking noise. You’ll hear a knocking noise if the damage is especially bad. The sound may only occur on one side. How do you fix it? See a mechanic to have the CV joints swapped out if they’re damaged. If the connection to the transmission is the issue, they’ll need to be adjusted. What’s it going to cost? If you need a brand new CV joint, it’ll cost $900-1,200 each. Basic maintenance may only run $100-150 each, though."
    },
    {
      "title": "",
      "content": "The suspension ball joints connect your front wheels to the vehicle via the suspension (they’re in the back as well if you drive a truck), and every wheel has two of them. If one (or more) of these joints is rusty, worn down, or damaged, it can cause noises when you turn your wheels and the suspension joints rub against another part of the vehicle. [2] X Research source What’s it sound like? Creaking, clunking, or popping near the tires. It sort of depends on how your vehicle’s suspension is designed and how many joints are damaged. It may only occur on one side. How do you fix it? A mechanic will remove your tires, inspect the ball joints and replace any joints that have lost their shape or been damaged. What’s it going to cost? This is surprisingly cheap most of the time. Each ball joint will run $100-150, so expect that plus the shop’s labor cost."
    },
    {
      "title": "",
      "content": "The power steering pump keeps the power steering fluid pressurized so you don’t have to turn the wheel harder when you’re turning at high speeds. If the power steering pump is bad, you’ll hear noises when you turn. You’ll also notice it’s harder to steer than it normally is. [3] X Research source What’s it sound like? A whining or groaning noise when you turn. You may also notice a squealing when you start the engine. How do you fix it? The pump probably needs to be replaced, so see a mechanic to have the problem diagnosed. In fringe cases, the power steering fluid may need to be replaced . What’s it going to cost? Expect to spend somewhere between $500-800 on a new power steering fuel pump. New fluid may only cost $50-80."
    },
    {
      "title": "",
      "content": "Power steering fluid is the lifeblood of your steering wheel. The fluid is what makes it possible for you to move hundreds of pounds of rubber and steel by lightly turning a wheel. The system is a complex combination of hoses, gears, and belts; if any of those components are damaged, it can interfere with your ability to steer properly. This will also make a ton of noise! What’s it sound like? Typically, you’ll hear screeching or whining noise when driving at normal speed. The noises will get more dramatic when you turn. How do you fix it? Have a professional check out your power steering system. They’ll make any adjustments or repairs. What’s it going to cost? This will run you anywhere from $125-1,600 depending on what kind of work needs to be performed. If it’s a fluid refill or a minor repair, it’ll be on the lower side. Power steering system failure will require more expensive work."
    },
    {
      "title": "",
      "content": "The tie rods connect the steering rack to the steering knuckles where the front wheels pivot when you turn the wheel. If the tie rods aren’t lubricated properly or they’re cracked, it can toy with your steering alignment. This kind of turning trouble is best dealt with quickly since a snapped tire rod will cause your axle to separate. [4] X Research source What’s it sound like? A clunking or thumping noise coming from the axle area. How do you fix it? The tire rod either needs to be lubricated by a pro, or replaced entirely. What’s it going to cost? This is one of the cheaper repairs. Expect to pay $150-400 depending on whether the rod needs maintenance or to be replaced."
    },
    {
      "title": "",
      "content": "The sway bar connects your vehicle’s suspension system to the actual body of your car. Your suspension system absorbs all of those bumps and potholes, and the sway bar keeps your car stable while it’s doing all of that absorption. If the sway bar link is damaged, you’ll notice a much rougher ride and trouble handling your vehicle on rougher roads. It’ll also make a ton of noise. [5] X Research source What’s it sound like? A popping or knocking whenever you go over bumps or turn on an imperfectly flat road. How do you fix it? Sway bar replacement is very straightforward for even a novice mechanic, although we still don’t recommend a DIY repair as raising the vehicle for this requires special equipment. What’s it going to cost? This should run around $125-200."
    },
    {
      "title": "",
      "content": "The suspension bushings are the rubber or polyurethane cushions mounted around car suspension and steering joints. They absorb a lot of the vibrations from potholes and bumps, kind of like your body’s cartilage that protects your joints. When the bushings wear down, those vibrations will make their way to the steering column and vehicle. You’ll also experience loose steering and poor handling alongside the noise. [6] X Research source What’s it sound like? Clunking and rattling every time you turn the wheel or brake hard. You may hear squeaking too, if the bushings just need to be lubricated. The noise may only occur on one side of the vehicle. How do you fix it? The worn-down bushings need to be replaced. If the bushings are dried out, they need to be lubricated. See a mechanic for this work. What’s it going to cost? You’re probably going to spend around $250-350 for each bushing that needs to be replaced."
    },
    {
      "title": "",
      "content": "Every vehicle is suspended above the ground by a suspension system made up of shocks and struts. These are the components that bounce up and down when you drive over a bump. They also keep the tires pushed against the pavement when you drive and help your vehicle stay flat. If the struts and shocks are damaged, it can lead to tire cupping, braking issues, and swaying when you change lanes. [7] X Research source What’s it sound like? You’ll hear knocking and banging when you drive. You’ll also hear a cracking or snapping noise when you make hard turns. How do you fix it? Your suspension system probably needs an overhaul and any struts and shocks that are damaged need to be replaced. What’s it going to cost? If you need to replace both the struts and shocks, expect to spend $300-900. It’ll be less if only one set of the components needs to be swapped out."
    }
  ]
}