{
  "url": "https://www.wikihow.com/Apply-Individual-Eyelashes",
  "title": "How to Apply Individual Eyelashes",
  "steps": [
    {
      "title": "Pick out your individual lashes.",
      "content": "Pick out your individual lashes. Individual lashes can be purchased at most drug stores or makeup counters at department stores. Individual lashes from the drug store sometimes come in kits with a pair of tweezers and eyelash glue. Kits can be helpful for packaging all the needed materials together. [1] X Research source If you decide to only purchase a package of individual lashes, be sure to also buy eyelash glue. Be sure to purchase lashes that match your natural lash color. Lash colors can come in blonde, brown, and black shades."
    },
    {
      "title": "Clean your eyelids.",
      "content": "Clean your eyelids. Before you apply the individual lashes, use makeup remover to take off any lingering makeup on your eyes. There is some debate on whether to apply makeup before or after applying lashes, but more often than not, you want to work on a clean surface and allow the lashes have a sticking surface free of dirt, oil and makeup. [2] X Research source [3] X Expert Source Alicia Ramos Skincare Professional Expert Interview. 12 June 2019."
    },
    {
      "title": "Pour out the lash glue.",
      "content": "Pour out the lash glue. On a small square of aluminum foil, pour out a small droplet of lash glue. [4] X Research source You don’t need a lot of glue to apply the lashes, but a small drop of glue will make it easier to coat the bottom portion of the lashes. The color of eyelash glue comes in either black or white. Buying black glue might be helpful if you are planning on applying heavy makeup, but white glue dries clear and might be the better choice if you are going for a more natural look."
    },
    {
      "title": "Test where you want to place the lashes.",
      "content": "Test where you want to place the lashes. Before you apply your glued lashes, pluck a lash (or grouping of lashes) from the packaging with your tweezers, and hold the lashes in the spot you want to apply them. This will help you decide where to place the lashes before you add the glue, so they look the most flattering and natural. Since eyelashes vary in length, individual eyelashes come in a variety of lengths as well. In a lash package, there are normally small, medium, and long length lashes. Try different looks to get exactly the one you want. For a subtle look, 3-5 lashes toward the center and outer corner of the eye will work. You could also build up greater density in the outer corners for a cat-eye effect. The smaller lashes are intended for the inside corners of the eyes and filler, while the medium and longer lashes are meant for the middle and outer edges of your eyes. [5] X Research source Still, you will want to vary the lash lengths somewhat to create the most natural look."
    },
    {
      "title": "Apply glue to the lashes.",
      "content": "Apply glue to the lashes. Individual lashes can come in single, or a small grouping of 2-5 lashes. However your chosen lashes are packaged, use tweezers to grip near the base of the lash or lashes, and gently pluck it free from the packaging. The base of the lashes should be facing you, while the ends of the lashes should be facing away. Carefully dip only the base of the lashes in the small droplet of glue on the aluminum foil. [6] X Research source Always follow the gluing instructions that come on the packaging of lash glue. The amount of glue should be enough that you are confident the eyelashes won't fall off, but not so much that you’ll have a large glob on your eyelid. Consider waiting about 15-30 seconds before you apply the lashes to your eyelid. This will help the glue become tackier, allowing it to adhere better on your lid."
    },
    {
      "title": "Glue the lashes to your eyelid.",
      "content": "Glue the lashes to your eyelid. With the help of a mirror, bring the tweezers up to your slightly opened eye, and stick the lashes right above roots of your real eyelashes, starting in the middle of your top eyelid. [7] X Research source [8] X Expert Source Alicia D'Angelo Makeup Artist & Hair Stylist Expert Interview. 10 April 2020. Once the lash is on your lid, you can use the tweezers to gently “brush” the lash upward, so it mimics the curve of your real lashes, and doesn’t droop down into your line of sight. Individual lashes can be applied to both the top and bottom lashlines, but false eyelashes look most natural when only applied to the top eyelid. Some people use their fingers to apply the glued lashes, but it’s really all about personal preference. If it is your first time applying lashes, using tweezers might offer more precision. If you make a mistake, you can easily remove the lash and try to reposition it before the glue dries. If the glue is very tacky and the lash is already glued into place, wait for the glue to completely dry. This may take about ten minutes. Then use your tweezers to remove the unsatisfactory lash, remove any glue residue, and try to glue the lash on again."
    },
    {
      "title": "Continue to apply lashes to both eyes.",
      "content": "Continue to apply lashes to both eyes. It is normally easiest to apply lashes to one eye, and then the other. Depending on how thick you want your eyelashes to look, you can apply just a few lashes, or most of the lashes that came with the package. Apply the lashes starting from the middle of your eye, and work your way outward to the corner of your eye. [9] X Research source As you move outward, use longer lashes. Then, fill in the inner corner of your eye with the shorter lashes in the package. [10] X Expert Source Alicia Ramos Skincare Professional Expert Interview. 12 June 2019. Working from the middle of your eye outward will gradually build up the thickness of your lashes. Vary the lash length a little bit in any given spot to create a more natural look. Keep your own eye shape in mind as you apply lashes. Different shapes will need different lash concentrations in different areas."
    },
    {
      "title": "Touch up the lashes.",
      "content": "Touch up the lashes. After about 10-15 minutes, the lash glue should be completely dry. Use your finger to softly touch the top of your lashes and check for stickiness. Once thoroughly dried, consider using an eyelash curler to gently curl and blend the false eyelashes with your natural eyelashes. [11] X Research source Be sure you don’t pinch the curler too hard, as this could dislodge and take off some of the individual lashes."
    },
    {
      "title": "Apply makeup.",
      "content": "Apply makeup. Add the rest of your makeup when the individual lashes are completely dry. Apply any eye shadow, and eyeliner you were planning to add to your eyes. Liquid liner looks best with false eyelashes, because it is very effective in hiding glue bumps. [12] X Research source Finally, apply mascara to both eyes to blend in the lashes even more. If you want to play it safe, wait at least 30 minutes after applying the eyelashes before you put makeup on. [13] X Expert Source Alicia Ramos Skincare Professional Expert Interview. 12 June 2019. At this point, your lashes should look long, full, and natural."
    },
    {
      "title": "Removing the lashes.",
      "content": "Removing the lashes. When you are finished wearing your individual lashes for the day, use an oil-based makeup remover to remove the lashes. [14] X Research source The oil-based make up remover will soften the lash glue, and then you can start pulling the individual lashes off your lid beginning at the outer corner, and working your way in. While an oil-based remover is the most effective, it will damage your false lashes to a point where you won't be able to wear them again. If you intend to reuse the lashes, look for a non-oil remover."
    }
  ]
}