{
  "url": "https://www.wikihow.com/Become-a-Beekeeper",
  "title": "Can You Be a Beekeeper?",
  "steps": [
    {
      "title": "As a beekeeper, you will maintain and manage your bee colonies.",
      "content": "As a beekeeper, you will maintain and manage your bee colonies. You’ll spend your time caring for bees, feeding them, and collecting their honey once they produce an excessive amount. On most days, you’ll just check in on the bees to ensure that they’re healthy and productive. While it may sound like a lot of work, beekeeping requires very little daily effort once your hive is established, since bee colonies are largely self-sufficient. As a beekeeper, the hardest work you’ll do will come early on when you’re establishing the hive. Once that’s over, most beekeepers find the process of checking in on their hive and seeing the colony grow rewarding and relaxing! Some beekeepers will develop personal relationships with their hives! After a while, you may develop a sense for when your bees are upset, or when they’ve lost motivation. [1] X Research source"
    },
    {
      "title": "No, but you do need to know a fair bit about bees!",
      "content": "No, but you do need to know a fair bit about bees! If you’re an avid fan of insects and you already know a fair bit about bee behavior, you can definitely get started without any training. However, you may want to sign up for a beekeeper training program at your local university’s extension office. These programs take anywhere from a few months to a year, and they’re typically free (or extremely cheap). Beekeeping is popular among homesteaders—people who live in a self-sufficient way by growing their own food and making their own goods. Most homesteaders are self-taught, so there’s no reason you can’t teach yourself too."
    },
    {
      "title": "Most beekeepers just buy their first set of hives.",
      "content": "Most beekeepers just buy their first set of hives. You can have a hive shipped to you from a larger beekeeper. A hive will typically run you $150, but it’s a one-time buy since the bees will reproduce. This is generally seen as the best way to acquire your bees, since they’ll be used to humans handling them and they’ll be disease-free when they arrive. [2] X Research source You can order package bees, or a nucleus hive. Package bees are live bees that you add to a brand new hive. A nucleus is a half-colony that comes with a portion of the honeycombs, which will jumpstart growth. Either option is fine, but package bees are generally considered safer."
    },
    {
      "title": "You can collect a wild swarm if you can find one and it’s legal.",
      "content": "You can collect a wild swarm if you can find one and it’s legal. This is often more art than science. Once you find a hive, you can use a smoker to calm the bees, and guide them directly off of the honeycombs into a container. If the bees are on the ground, you can use a sheet of cardboard to scoop them up. Regardless, you’ll need to scoop up nearly the entire swarm, and transfer them to your hive. [3] X Research source If you go this route, you must wear a beekeeper’s outfit and utilize a smoker to prevent the swarm from attacking. Taking a colony away from its hive is going to upset the bees, and you may be stung if you don’t wear any protective gear or use a smoker to cool the bees down. This is illegal in some jurisdictions. Check with your state and city first before you start peeling a bee hive off of a tree trunk. Many wild bees carry diseases, which is the key reason beekeepers typically buy their hives. If you collect multiple hives and one of them is carrying a disease, you may have a disaster on your hands. [4] X Research source"
    },
    {
      "title": "Your hives will multiply over time, so don’t buy too many at first!",
      "content": "Your hives will multiply over time, so don’t buy too many at first! As your colonies grow and flourish, a hive will eventually run out of space. When this happens, the bees will begin to swarm, and split itself in half. The portion of the bees that leave the original hive will choose a new queen and start a new colony. As a result, you shouldn’t run into a shortage of bees after you buy your first set of hives. [5] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source"
    },
    {
      "title": "Unless you live in a major city, it’s usually fine to just get started.",
      "content": "Unless you live in a major city, it’s usually fine to just get started. Check with your local agricultural department to make sure, but if you aren’t living in a major city, there usually aren’t any applications or anything you’ll need to submit. In some areas, there are no beekeeping regulations at all. [6] X Research source You will typically need to register your hive with the state once it’s established, though. [7] X Research source It isn’t normally illegal to keep a beehive in a major city, but you often need to file for permits and you’re typically restricted on how many colonies you can have. This process isn’t typically very tenuous, though. You usually file an application and then an inspector checks out your plans and space. [8] X Research source"
    },
    {
      "title": "You will probably need permission to sell your honey.",
      "content": "You will probably need permission to sell your honey. Honey selling is regulated differently in every state, but you may need to get a health inspection and a business license before you can start selling anything. However, some states don’t treat honey sales the way they treat other food products or businesses, so be sure to look up the laws where you live! [9] X Research source Some states treat local honey as a “cottage food.” Cottage foods are products that you’re allowed to sell without a food or health inspection, and you occasionally don’t even need to register a business. This is why bake sales aren’t treated the same way as food trucks! [10] X Trustworthy Source University of California Division of Agriculture and Natural Resources Extension program of the University of California system devoted to educating and improving local communities Go to source"
    },
    {
      "title": "Your initial investment in materials can cost $400-800.",
      "content": "Your initial investment in materials can cost $400-800. A brand new bee hive will likely cost you around $150, and a good beekeeper’s outfit can cost $100-200. Beyond that, you’ll also need storage bins, a smoker, protective gear, and tools for handling the hive. All things considered, you’re looking at over $400 on the low end. [11] X Research source If you don’t want to harvest the honey manually, you’ll also need to buy an extractor. These typically run $100-200, but they’ll pay for themselves if you plan on starting a business! A lot of these supplies are just one-time buys. You won’t need to keep buying bins and smokers over and over again once you’re all set up. There are beekeeping starter kits out there that come with a lot of the supplies you’ll need. These kits are a good option if you’re starting totally from scratch."
    },
    {
      "title": "You need roughly 7 feet (2.1 m) of outdoor space per hive.",
      "content": "You need roughly 7 feet (2.1 m) of outdoor space per hive. The hives themselves aren’t particularly big—a standard hive will be roughly 20 by 17 inches (51 by 43 cm). However, the bees won’t be happy if they’re cramped in a small space, and the entrance to a hive is a pretty busy space. If you want your bees to be happy and healthy, you’ll need to keep the 7 feet (2.1 m) around each hive clear. [12] X Research source Most beekeepers utilize Langstroth hives. These are preassembled “houses” with built in frames for separate hives. The bees will use the individual boards inside of each section to build their honeycombs and produce honey. Beekeepers like these hives because it’s easy to slide each section in and out of the structure to check on the bees. [13] X Research source"
    },
    {
      "title": "Beekeepers will harvest and sell their hives’ excess honey.",
      "content": "Beekeepers will harvest and sell their hives’ excess honey. There’s a huge market out there for local organic honey. Once a hive starts producing a ton of honey, beekeepers will collect it, bottle it, and sell it to local shops or private buyers. Selling the honey usually isn’t enough to make a full-time living, though. Many beekeepers will also sell their leftover beeswax, and offer services to remove established hives from people’s yards. [14] X Research source Honey sales are regulated the same way as any other business; don’t assume you can just harvest honey and start selling it without registering and creating a business!"
    },
    {
      "title": "Many beekeepers don’t make money—they do this as a hobby!",
      "content": "Many beekeepers don’t make money—they do this as a hobby! A lot of beekeepers, if not most of them, maintain their hives simply because they enjoy beekeeping. Some beekeepers do it just so they have a source of honey for themselves! You don’t have to start a business here, so if you just want to keep bees, go for it! [15] X Research source Bees perform an important service in the environment, and you’ll be doing your local ecosystem a huge favor if you start keeping bees!"
    },
    {
      "title": "It can vary, but expect to make $600 per hive every year.",
      "content": "It can vary, but expect to make $600 per hive every year. While there’s obviously going to be some variation from hive to hive, a single swarm of bees is capable of producing roughly $600 worth of honey per year. However, a lot of your potential profits depend on the local demand for organic honey in your area. Still, $600 a year is a reasonable goal if you’re motivated. [16] X Research source Many beekeepers make deals with local grocery stores to sell their honey on their shelves, or go to farmer’s markets to sell their products directly to the public."
    },
    {
      "title": "You probably won’t make anything your first year.",
      "content": "You probably won’t make anything your first year. It takes most hives roughly 1 year to get established and comfortable enough to produce honey for you to harvest and sell. It depends on the weather where you live, the amount of nectar in your area, and the type of bees you’re keeping, but it’s safe to assume you won’t make very much money your first year. [17] X Research source"
    }
  ]
}