{
  "url": "https://www.wikihow.com/Cut-Vinyl-Siding",
  "title": "How to Cut Vinyl Siding",
  "steps": [
    {
      "title": "Buy a fine-tooth plywood saw blade.",
      "content": "Buy a fine-tooth plywood saw blade. A fine-tooth plywood saw blade will give you the best results when cutting vinyl siding with a circular saw. Avoid using other kinds of saw blades or you may not get a clean cut. [1] X Research source You can find a fine-tooth plywood saw blade online or at your local home improvement store."
    },
    {
      "title": "Mount the saw blade so it’s backward in the circular saw.",
      "content": "Mount the saw blade so it’s backward in the circular saw. The points on the teeth of the saw blade should be pointing in the opposite direction the blade spins in. It’s important that the blade is mounted backward or you won’t get a clean, smooth cut. [2] X Research source"
    },
    {
      "title": "Mark the line you want to cut on the siding with a pencil and straight edge.",
      "content": "Mark the line you want to cut on the siding with a pencil and straight edge. Go over the line a few times with the pencil. You want it to be dark enough so you can see it when you’re using the saw. [3] X Research source If you’re cutting dark vinyl siding, run a piece of light-colored masking tape over the section you want to cut. Mark your line on the tape so you’re able to see it better."
    },
    {
      "title": "Lay the siding on a flat table so the spot you’re cutting is hanging off the edge.",
      "content": "Lay the siding on a flat table so the spot you’re cutting is hanging off the edge. You don’t want anything to be underneath the line you’re cutting or you’ll cut into it with the saw. [4] X Research source You can also put 2 planks of wood on the table and lay the siding on that so the section you’re cutting is elevated."
    },
    {
      "title": "Cut along the line you drew using the circular saw.",
      "content": "Cut along the line you drew using the circular saw. Push the saw along the line at a steady rate to get a clean, smooth cut. Watch the blade carefully as you’re cutting to make sure it’s staying on the line. Use your free hand to hold the vinyl siding down so it doesn't shift while you're cutting it. [5] X Research source Make sure you're wearing safety goggles when you're cutting the vinyl siding."
    },
    {
      "title": "Use measuring tape to measure how much siding you need to cut off.",
      "content": "Use measuring tape to measure how much siding you need to cut off. Measure the length of the section of wall you're covering with siding. Then, subtract that amount from the length of the piece of siding you're going to cut. The total you get is how much you'll need to cut off the siding. For example, if the section of wall you're covering is 5 feet (1.5 m) long, and the piece of siding is 9.5 feet (2.9 m) long, you'll need to cut off 4.5 feet (1.4 m) from the siding so it fits on the wall."
    },
    {
      "title": "Mark the line you want to cut on the siding with a pencil.",
      "content": "Mark the line you want to cut on the siding with a pencil. Use a carpenter's square to draw the line straight. Make the line as dark as possible so it's visible when you're cutting it. [6] X Research source If you're cutting dark vinyl siding, use chalk or light-colored tape to mark the line you want to cut."
    },
    {
      "title": "Hold the siding steady with your non-dominant hand.",
      "content": "Hold the siding steady with your non-dominant hand. Grip it near the line you marked so the siding doesn't shift as you're cutting it. [7] X Research source"
    },
    {
      "title": "Cut along the marked line using tin snips.",
      "content": "Cut along the marked line using tin snips. As you're cutting the siding, avoid closing the blades on the tin snips all the way so you get a cleaner cut. Keep cutting until you get all the way across the vinyl siding. [8] X Research source Wear safety goggles while you're cutting the siding. [9] X Expert Source Alberto DeJesus Construction Specialist Expert Interview. 15 December 2021."
    },
    {
      "title": "Repeat on the rest of the vinyl siding.",
      "content": "Repeat on the rest of the vinyl siding. Use the piece you just cut to see where you need to mark the lines on the other pieces. Lay it on top of another piece of siding and trace the cut edge onto the other piece."
    },
    {
      "title": "Measure the wall to see how much siding you need to cut off.",
      "content": "Measure the wall to see how much siding you need to cut off. Measure the height of the section of wall you're covering with the siding. Then, subtract that amount from the height of the siding and write down the total you get. The total is how much you'll need to cut off the siding. For example, if the section of wall you're covering is 5 inches (13 cm) tall, and the siding is 12 inches (30 cm) tall, you'll need to cut off 7 inches (18 cm) from the siding."
    },
    {
      "title": "Use a pencil to mark the line you want to cut on the siding.",
      "content": "Use a pencil to mark the line you want to cut on the siding. The line should run lengthwise from one end of the siding to the other. To make the line straight, draw it using a carpenter's square. [10] X Research source"
    },
    {
      "title": "Lay the vinyl siding on a flat surface.",
      "content": "Lay the vinyl siding on a flat surface. It's important that the surface is flat so the siding doesn't shift as you're cutting it. A flat table or work bench will work. [11] X Research source"
    },
    {
      "title": "Score the line you marked with a utility knife.",
      "content": "Score the line you marked with a utility knife. Carefully follow along the line with the utility knife until you've gone from one end of the siding to the other. Don't worry about cutting all the way through the siding with the knife — you're just scoring it for now. [12] X Research source Make sure you're wearing safety goggles when you score the vinyl siding."
    },
    {
      "title": "Use both hands to snap the siding in half along the score line.",
      "content": "Use both hands to snap the siding in half along the score line. Place 1 hand on each side of the scored line, hold the siding firmly, and start bending the siding. Keep bending until the siding breaks along the line you scored. If it doesn't break, try scoring the line again with the utility knife. [13] X Research source"
    }
  ]
}