{
  "url": "https://www.wikihow.com/Be-a-Really-Cool-Guy",
  "title": "How to Be a Really Cool Dude",
  "steps": [
    {
      "title": "Be true to who you really are.",
      "content": "Be true to who you really are. Looks don’t matter so long as you’re being who you actually are . Stop caring about how you come off to other people just do you. Have fun, joke around, talk about your interests, and do what you want to do. If you can make anybody laugh, that's a great start. [1] X Research source Be proud of what makes you unique. If you're into birdwatching, own it! You can’t be yourself if you aren’t proud of what makes you different. Love where you came from. If you're from the South and have a Southern drawl, don't try to hide it because you live up North. People will appreciate that you're different. If you really care who wins a baseball game or which movie gets the Oscar, show it. Don't act like nothing matters. That’s the definition of uncool."
    },
    {
      "title": "Radiate positive energy everywhere you go.",
      "content": "Radiate positive energy everywhere you go. If you want to be a really cool guy, then you have to know how to charm everyone in your presence. Walk confidently and be comfortable talking to anyone you encounter with ease, humor, and a smile on their face. Flatter the eighty-year-old woman and crack up the eight-year-old boy; to be truly charming, you need the magic touch that lets you make everyone feel at ease in your presence. [2] X Research source To charm a person, show more of an interest in them than in talking about yourself. Ask about a person's interests or feelings and nod intently while making eye contact to show that you actually care. Laugh freely. Don't be afraid to gently tease others or laugh at yourself if things are going well. People tend to think that “cool guys” are all brooding and dark. The reality is that people don’t tend to enjoy downers after more than a few minutes of convo."
    },
    {
      "title": "Be clever, entertaining, and witty.",
      "content": "Be clever, entertaining, and witty. Being witty can be a fun part of being cool if you’ve got the rizz to sweep people off of their feet. Make people laugh, keep them on their toes, and maintain a light and playful banter with everyone who comes your way. To be witty, you also have to be sharp, and to offer incisive and clever comments at the right moment. [3] X Research source If someone says something funny, don't just laugh—answer back with a funny comment of your own! Watch other witty people you admire, from comedians to your funny uncle, to see if you can pick up on their tricks. Deliver your jokes when everyone is listening and loudly enough for everyone to hear. If you make a joke too quietly or when someone else is talking, it won't be cool if you try it again."
    },
    {
      "title": "Socialize with as many different people as possible.",
      "content": "Socialize with as many different people as possible. Don't be fooled by the movies. Cool guys don't pose in the parking lot on their motorcycles until they're surrounded by the “cool” crowd. Call up people, make plans, take risks, and make friends. If you're social and hang out with a lot of people , then you'll look cool because you have a variety of friends. [4] X Trustworthy Source Pew Research Center Nonpartisan thinktank conducting research and providing information on public opinion, demographic trends, and social trends Go to source Accept invitations. Don't turn people down just because you don't think it will be \"cool\" to show up somewhere. Though it's great to hang out with others, give yourself some time to do your own thing and develop your personality. Be friendly to everyone . Don't only be social and nice to the popular kids. Truly cool people are cool with everybody."
    },
    {
      "title": "Showcase confidence and be proud of who you are.",
      "content": "Showcase confidence and be proud of who you are. You could be amazingly good-looking, but people won't notice you if you speak timidly or have a slouched posture. Hold your head up and your chest out, and look everyone in the eye to express confidence . Work on your self-esteem to get rid of any problems you may have with insecurity. This is not an overnight process, but you won't gain respect from others until you respect yourself. [5] X Research source Speak clearly and slowly enough so that everyone hears what you have to say. Make eye contact when you talk to people. This shows that you're comfortable with yourself."
    },
    {
      "title": "Show an interest in the people you meet.",
      "content": "Show an interest in the people you meet. Who wants to hear someone talk about himself all the time? Find out what other people are interested in or working on and ask them about it. This will earn you a reputation as someone who is caring and considerate. [6] X Research source When you talk to someone, ask, \"How are you?\" This shows that you actually care about the person. Ask a person about their interests. People love talking about their hobbies and the stuff that they’re into. People will think you’re cool just for being."
    },
    {
      "title": "Build people up instead of tearing others down.",
      "content": "Build people up instead of tearing others down. A lot of people think it’s cool to make fun of people who are less cool than you. However, putting people down doesn't make you look better. Even if it buys you a few cheap laughs in the moment, it’s just going to make you look insecure and desperate at the end of the day. [7] X Research source Instead of putting people down, you can tease or playfully poke fun at your friends. They'll tease you back and you'll both have fun, instead of entering a storm cloud of negativity."
    },
    {
      "title": "Broaden your horizons by reading a lot of books.",
      "content": "Broaden your horizons by reading a lot of books. Read as many books as you can! Always have a good book under your shoulder and read instead of scrolling on your phone when you’re bored. Not only will you learn something, but you’ll stimulate your mind and stay entertained! Plus, someone who is well-read is always attractive. The more you read, the more you know, and the more you'll develop a unique perspective on the world. [8] X Research source If people call you a nerd, just laugh it off. Anything is cool if you make it cool. Reading will also make it easier for you to talk to a variety of people, not just one narrow social circle. Truly cool people can talk to almost anyone."
    },
    {
      "title": "Keep up on current events and follow the news.",
      "content": "Keep up on current events and follow the news. You don't need to tear through several newspapers per day, but having a basic understanding of what's going on in the world will give you a reputation of being smart and knowledgeable, both of which are attractive qualities. This process can be as simple as checking the news once a day. [9] X Research source Listen to public radio or newscasts instead of mindlessly playing background music when you’re in the car or showering. You don't have to sound like a know-it-all to bring up something interesting and relevant. People will think it's cool that you have time to think about the world."
    },
    {
      "title": "Stay physically active and exercise regularly.",
      "content": "Stay physically active and exercise regularly. Being physically fit and active is already cool. Even if you're not super into sports, going to the gym or running can get your blood flowing and can improve your physique. Being physically active will also develop your confidence, which is essential if you want to be cool. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Sports are also a great way to make new friends and bond with other people. Join a sports team or two in your school, and see how many new friends you make. Physical activity also releases endorphins which make you feel better, improving your overall mood and making you more appealing to hang out with."
    },
    {
      "title": "Pursue your interests and don’t be shy about them.",
      "content": "Pursue your interests and don’t be shy about them. Whether you join a club at school or take a screenwriting class in your spare time, doing something that you love will not only make you more interesting, but it can help you make new friends. Don't be shy about pursuing your interests, even if some of the things you love may not be traditionally considered to be “cool.” Birdwatching can be cooler than hip-hop dance if you own it! [11] X Research source If you join a club, you can eventually have a leadership position in the organization, which is very cool."
    },
    {
      "title": "Pick up some unique skills to make you stand out.",
      "content": "Pick up some unique skills to make you stand out. The more you can do, the cooler you'll be. Learn how to fix a car, build a table, finish a deck, or even cook the perfect steak. If you have a skill, you'll not only be useful to others, but people will think it's cool that you [[Acquire New Skills|took the initiative to learn how to do something. [12] X Trustworthy Source Pew Research Center Nonpartisan thinktank conducting research and providing information on public opinion, demographic trends, and social trends Go to source Once you've mastered a skill, you can even teach it to someone else. Ice cold levels of cool, right there."
    },
    {
      "title": "Pursue a personal project at all times.",
      "content": "Pursue a personal project at all times. Though certain interests, like team sports, can be developed better in groups, part of being cool is being able to spend time learning things on your own. Anyone who is comfortable spending time by himself and who even enjoys spending time by himself is much cooler than someone who is so socially eager that they always need to be around people. [13] X Research source Spend time learning to play the guitar, picking up a new language, or just writing down your thoughts in a journal. This will help you figure out who you are and you'll become cooler in the process. If you're always around, people will take you for granted. But if you're sometimes busy because you're catching up on some alone time, then people will appreciate you more when you're around."
    },
    {
      "title": "Convey confidence and strength through your body language.",
      "content": "Convey confidence and strength through your body language. Though being cool always comes from within, people can make assumptions about you if your body language indicates that you're insecure or unsure of yourself. To have cool body language, just stand tall, keep your head high and your shoulders open, showing that you're proud to be taking up space. [14] X Research source Don't hunch over. Stand and sit up straight. Don't cross your arms over your chest, or you'll look uncomfortable and insecure. Instead, keep your arms at your sides or use them to gesture as you speak. Don't fidget with your hands or your clothes, or you'll look insecure."
    },
    {
      "title": "Maintain good hygiene and take care of yourself.",
      "content": "Maintain good hygiene and take care of yourself. Have you ever met a cool guy who reeks of sweat and never brushes his teeth? Didn't think so. Shower every day, use deodorant, brush and floss your teeth twice a day, and wash your hair regularly. Carry some mints or gum around with you to get rid of bad breath. Be sure to also wash your clothes regularly. Having good hygiene will also make you feel good about yourself. It’s hard to be socially confident and happy if you’re bumming around and can’t be bothered to shower."
    },
    {
      "title": "Look after your skin",
      "content": "Look after your skin and actually moisturize. Dudes tend to skip the exfoliation because they think it’s too “girly” but real cool guys know smooth skin is worth it. Wash your face with warm water and rub on some moisturizer afterward. If you have dry skin, moisturize with a product meant for dry skin. [15] X Research source For oily and combination skin, use a moisturizer without alcohol and that is meant for oily/combination skin. Watch what you eat and drink. A healthy diet and drinking lots of water is also great for your complexion. Oily and greasy foods will make your complexion oilier and greasier, too."
    },
    {
      "title": "Assert yourself and speak with confidence.",
      "content": "Assert yourself and speak with confidence . Don't be afraid to take up space when you sit or when you move around. Don't be afraid to be louder, even though it will create some social pressure. When you speak, slow down your words to show that you value what you're saying and you're not worried that you'll get cut off. [16] X Research source At the same time, know when to let other people take center stage. You can't assert yourself 100% of the time."
    },
    {
      "title": "Wear clothes that reflect your personal style.",
      "content": "Wear clothes that reflect your personal style. Make sure your clothes fit properly and actually look good on you. Try to find colors or patterns that especially look good with your skin tone, and wear them most. Even a simple wardrobe like a T-shirt and jeans is fine as long as it fits and suits you . Having cool style means wearing what you love no matter how ridiculous you may look. If people make fun of your clothes and you stop wearing them just to please people, you're not being cool. Experiment with different styles, and try to find the one that plays off of your strengths and identity, whether you're preppy or going for more of a rocker or hipster look. If you need to go shopping for clothes, invest in only a few items of clothing of more expensive, higher quality clothing instead of buying lots of mediocre and cheap clothes."
    },
    {
      "title": "Style your hair to match your overall vibe.",
      "content": "Style your hair to match your overall vibe. Just because you have nice clothes doesn't mean you can forget about your hair. Style your hair in a style that suits you and that is comfortable and easy to maintain. Wash your hair regularly, and if it's short, try different hairstyles. [17] X Research source If you need to get a haircut or want a new style, the best method is to splurge on an expert hair stylist once, take a picture of that haircut, and get it done at cheaper places later on. If they style your hair in a certain way that you like, have them show you how to recreate that look on your own."
    },
    {
      "title": "Smile everywhere that you go.",
      "content": "Smile everywhere that you go. You may think that it's not cool to smile, or that only dorks grin from ear to ear for no reason, but quite the opposite is true. If you're nice and smile at people, they'll feel welcomed and will want to get to know you. If you're too cool to say hi, then you'll just be hanging out by yourself in the corner while everyone else has a good time. [18] X Research source A smile makes a lasting impression. Even if people don't know you well, they'll like you if you smile at them. And if you don't smile at them, they'll think you're a jerk or a grouch before they even get to know you."
    }
  ]
}