{
  "url": "https://www.wikihow.com/Philia-Love",
  "title": "What is Philia Love? Meaning, Unique Traits & More",
  "steps": [
    {
      "title": "Philia (fill-ee-uh) love is love between friends.",
      "content": "Philia (fill-ee-uh) love is love between friends. This type of love encompasses the feelings of affection you may hold toward your friends, family, peers, or colleagues. Philia love is all about bonding with others over shared goals and values. Unlike lust or even some kinds of romantic love, philia love usually doesn’t involve sexual or romantic feelings and is almost always reciprocal—you form friendships with people you know want to be friends with you. The Greek philosopher Aristotle stated that there are 3 types of philia love based on different benefits. These benefits include: [1] X Research source Usefulness: You might form some friendships because you believe they’ll lead to certain benefits, such as job opportunities or a larger network of contacts. This might be the type of relationship you have with your work colleagues or peers at school. Pleasure: These types of friendships are based on the enjoyment and pleasure you get from being with someone. You might feel philia love toward your friends who you hang out with on the weekend or go on vacation with. If you no longer find the other person pleasing, your feelings of love toward them may change. Virtue: This type of love and friendship is all about genuine care and concern for another person. Rather than focusing on what you’re getting out of the relationship, you pursue this kind of friendship because you share a deep connection with the other person. This is the highest form of friendship."
    },
    {
      "title": "Self-love",
      "content": "Self-love It was proposed by the Greek philosopher Aristotle that true friendship couldn’t be achieved until you learn to love yourself . Only when you begin to treat yourself with kindness and empathy can you begin to extend such kindness to others and achieve the highest form of friendship. [2] X Research source To begin your journey of self-love, be sure to talk to positively to yourself and use positive affirmations to raise your self-esteem. Tell yourself things like, “I am strong,” “I deserve to be loved,” and “I am a good person.”"
    },
    {
      "title": "Acceptance",
      "content": "Acceptance Friendship is built on mutual acceptance of one another’s unique traits and differences. You respect their opinions and individual perspective, and they in turn listen to what you have to say with genuine interest. Acceptance also means that you accept yourself for who you are, and you’re not afraid to be yourself around them. [3] X Research source To cultivate acceptance in your friendship, keep an open mind when your friend talks to you and show genuine interest in what’s going on in their life. Actively listen to what they have to say and make an effort to engage in deeper conversations with them."
    },
    {
      "title": "Loyalty",
      "content": "Loyalty A true friendship is marked by a deep sense of loyalty and protectiveness toward a person you care about. Even when things get tough, you’ll stick by their side to help them through it, and you know that they’ll do the same for you. [4] X Research source Make sure you’re there to support your friend during hard times to show that you’ll always stick by their side."
    },
    {
      "title": "Trust",
      "content": "Trust You often feel like you can be open and honest with a true friend. In this kind of friendship, you treat each other with compassion and empathy and are always willing to lend a helping hand. Trust is what sets a real friend apart from just any ordinary acquaintance. [5] X Research source Building trust is all about establishing healthy boundaries and respecting them. [6] X Research source Boundaries include things like deciding which topics you are and aren’t comfortable sharing, establishing when you need some time to yourself, and deciding how much communication you need to make your friendship work."
    },
    {
      "title": "Comfort",
      "content": "Comfort There are likely few awkward silences when you’re together, and it might even feel like you’re hanging out with another member of your family rather than just a friend. You feel safe with them and don’t feel like you need to monitor every single thing you say in front of them. There’s just an overall sense of ease when you’re with a true friend. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Make an effort to really get to know them better and ask them lots of questions about their interests and passions. They’ll likely feel more comfortable and be willing to open up if they know you’re genuinely interested in their life."
    },
    {
      "title": "Enjoyment",
      "content": "Enjoyment You truly enjoy being around a good friend and likely feel happy and excited at the thought of spending time with them. Being with a friend can be an incredibly positive and enriching experience, and you likely feel refreshed and energized whenever you hang out together. [8] X Research source Plan fun things to do with your friend and make great memories. Go on a trip , go out to fun new restaurants and cafes, or start a new hobby together, like cooking or hiking."
    },
    {
      "title": "Growth",
      "content": "Growth A friend is someone who encourages you to be your best self and supports you in your efforts to grow and evolve. They support your dreams and likely do what they can to help you reach your goals. On top of that, a true friend is someone who you feel inspires you to do better, and you may influence each other to continuously strive to be the best versions of yourselves. [9] X Research source Help each other to set goals for the future and always be there to motivate each other to keep moving. Share your honest thoughts and feelings with your friend and be open to taking their advice and constructive criticism. After all, they’re likely just trying to help you grow and achieve your dreams."
    },
    {
      "title": "Gratitude",
      "content": "Gratitude Friendship is also about being grateful and appreciative of all the wonderful things your friend has done for you. Looking back, you might be able to list a whole bunch of things they’ve done to make your life that much better. A true friend is irreplaceable and an extremely important part of your life. Be sure to remind them of that from time to time. [10] X Research source Take some time to properly express your gratitude. Buy your friend a nice gift, treat them to a meal, or write them a note telling them how much you appreciate them."
    },
    {
      "title": "Independence",
      "content": "Independence Even though you may be best friends, it’s okay to need some time away from each other every now and then. In fact, the best friendships allow you and the other person to maintain your independence and still remain confident that you’ll be there to support each other when you need it. [11] X Research source Find ways to enjoy being alone by taking time to pursue your interests, going on solo adventures, or finding a new hobby . Don’t be afraid to tell your friend when you need some space. If they’re a true friend, they’ll understand and be ready to pick up right where you left off once you feel ready."
    },
    {
      "title": "Reciprocity",
      "content": "Reciprocity As the Greek philosophers pointed out, friendship and philia love are all about the reciprocity of feelings. Within friendships, both people give as much as they receive. Respect, comfort, compassion, empathy, and all the other things that make a great friendship are things that both you and your friend will equally contribute to your relationship. [12] X Research source The most important thing is that you and your friend do these things because you want to, not because you feel like you have to. True philia love is based on acts of kindness for someone because you genuinely care about them and want to see them happy. [13] X Research source"
    },
    {
      "title": "Philia love is the most general form of love the Bible talks about.",
      "content": "Philia love is the most general form of love the Bible talks about. You can find the idea of brotherly love and love of one’s neighbors throughout the Bible. Within this context, philia love isn’t just the love you feel toward your best friends, but also the love you have for your family and others in your community. Some passages that mention philia love include: “Love one another with brotherly affection. Outdo one another in showing honor.” — Romans 12:10 ESV (English Standard Version) [14] X Research source “Now concerning brotherly love you have no need for anyone to write to you, for you yourselves have been taught by God to love one another…” — 1 Thessalonians 4:9 ESV “Whoever loves his brother abides in the light, and in him there is no cause for stumbling.” — 1 John 2:10 ESV “And this commandment we have from him: whoever loves God must also love his brother.” — 1 John 4:21 ESV"
    },
    {
      "title": "Eros (eh-rows)",
      "content": "Eros (eh-rows) This type of love is closest to what we now think of as romantic love. Eros is characterized by passion and desire, oftentimes in a sexual manner. This desire for sex and physical intimacy is what ultimately sets eros apart from philia. [15] X Research source Eros isn’t always reciprocated, unlike most cases of philia love. A person may desire someone else romantically, but there’s no guarantee those feelings will be returned."
    },
    {
      "title": "Agape (uh-gaw-pay)",
      "content": "Agape (uh-gaw-pay) You have a deep love of mankind when you experience agape. In a religious context, some also describe it as a love of God that extends to all of humanity. Agape is a combination of eros and philia, a mix of passion and fondness that knows no limits and doesn’t necessarily require reciprocation. [16] X Research source"
    },
    {
      "title": "Storge (store-gay)",
      "content": "Storge (store-gay) The love you feel for your family is known as storge. Many people often think of this kind of love as the love parents feel for their children. Storge is also a very natural kind of love. In other words, we feel a natural connection to our family and don’t judge whether or not they deserve our love like we might with eros or philia. [17] X Research source"
    },
    {
      "title": "Ludus (loo-dus)",
      "content": "Ludus (loo-dus) Ludus is playful, oftentimes flirtatious, love. Some also describe it as uncommitted love. Think of people who are casually seeing each other but don’t actually want a committed relationship. Ludus love is formed from a desire for fun and excitement with no strings attached. [18] X Research source Ludus is somewhat similar to eros in terms of passion and desire, but eros often also comes with a desire to be committed to another person."
    },
    {
      "title": "Pragma (prag-muh)",
      "content": "Pragma (prag-muh) This is a kind of love born out of practicality and a sense of duty. Think of the concept of arranged marriages. Even if there’s no passion or desire, two people may still stick by one another out of a sense of duty. [19] X Research source"
    },
    {
      "title": "Mania (main-ee-uh)",
      "content": "Mania (main-ee-uh) This is a dangerous, obsessive kind of love. Someone who experiences mania often becomes infatuated with another person and can become extremely jealous and possessive. [20] X Research source Please note: Mania is also an official medical condition that can cause abnormally high levels and extreme changes in a person’s energy, emotions, or mood. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Philautia ​​(fill-law-tee-uh)",
      "content": "Philautia ​​(fill-law-tee-uh) This kind of love is the love you feel for yourself. Philautia can be both healthy and unhealthy. In an unhealthy situation, this self-love turns into an inflated sense of self-importance. However, if you have a healthy level of self-love, you likely feel confident in your abilities and have healthy self-esteem. [22] X Research source As stated by Aristotle, self-love is an important part of achieving the highest level of philia love and forming true friendships."
    }
  ]
}