{
  "url": "https://www.wikihow.com/Make-Illuminated-Manuscripts",
  "title": "How to Make Illuminated Manuscripts",
  "steps": [
    {
      "title": "Gather 15 to 20 pieces of parchment.",
      "content": "Gather 15 to 20 pieces of parchment. Classic manuscripts were made out of thick, white parchment cut down to about 8 by 11 in (20 by 28 cm). If you can find some, gather enough for your manuscript in its entirety for authenticity. [1] X Research source You can find parchment at most craft or paper supply stores. Traditionally, parchment was also dusted with pumice powder to roughen the surface and make it receptive to ink and paint. If you can’t find any parchment, just use thick, white cardstock instead."
    },
    {
      "title": "Trim the end of a quill so you can write with it.",
      "content": "Trim the end of a quill so you can write with it. Traditionally, illuminated manuscripts were written in with feather quills from ducks, geese, or chickens. Grab one of these dried quills and use scissors or a knife to cut the tip into a fine point so you can write with it. You can find quills at most paper supply stores. If you don’t have a quill you can use, just grab a fountain pen with black ink instead."
    },
    {
      "title": "Dip the quill's pointed tip into black ink.",
      "content": "Dip the quill's pointed tip into black ink. Pour a small amount of black ink into a bowl so you can access it easily. When you’re ready to write, dip the very end of the quill into the black ink and then shake off the excess. Traditionally, black ink was made of soot or iron salts, but you can use any ink that’s available to you."
    },
    {
      "title": "Pick out the bottom and top portions of pages where you want to add text.",
      "content": "Pick out the bottom and top portions of pages where you want to add text. Depending on what you want your manuscript to look like, you can write in the top portion, the bottom portion, the middle portion, or leave entire pages blank for images. You can also figure out a border around the edges of the paper and pick out the areas where you’d like to draw pictures. Decide how long you want your story to be and then pick out the pages you’d like to use. In traditional manuscripts, the images were much larger than the words on the pages. In most illuminated manuscripts, the first letter of each page was much larger and more detailed than the rest. You can start on that letter first or leave room to do it later."
    },
    {
      "title": "Copy an adventure or story from the Middle Ages or write your own.",
      "content": "Copy an adventure or story from the Middle Ages or write your own. Traditionally, illuminated manuscripts depicted fanciful events, like adventure stories and heroic knights. To stick with these themes, you can either copy an existing story, like King Arthur and the Round Table, or you can make one up on your own. Consider writing out the text on a scrap piece of paper as a practice before you put it onto your manuscript."
    },
    {
      "title": "Write in calligraphy to make your manuscript look old-fashioned.",
      "content": "Write in calligraphy to make your manuscript look old-fashioned. Calligraphy, or decorative handwriting, was very popular in the Middle Ages when illuminated manuscripts were made. Keep your handwriting as neat as possible as you ink out your letters, and try to make them as fancy-looking as possible. [2] X Research source If you can’t do calligraphy, that’s okay too. Just use your neatest cursive handwriting to keep your letters clean and sharp-looking."
    },
    {
      "title": "Let the ink dry for about 15 minutes.",
      "content": "Let the ink dry for about 15 minutes. Black ink takes a while to dry, especially on parchment paper. Before you move on with your manuscript, spread the pages of text out on a flat surface and leave them to dry completely. [3] X Research source To avoid smudging the ink as you write, keep your hand up off the paper when you hold your quill."
    },
    {
      "title": "Sketch your images and designs with a quill and ink.",
      "content": "Sketch your images and designs with a quill and ink. Before you add color to your pages, use the same quill and black ink to mark out the design you’d like to draw so you know where to add color on the page. Try drawing scenes from the story you wrote out in calligraphy to add visual images to your manuscript. Let the ink dry for about 10 minutes before you move on. [4] X Research source Classic illuminated manuscript designs were 2D images that depicted fanciful tales. Tigers, kings, and nature were common themes for classic manuscripts, but you can draw any images that you’d like to."
    },
    {
      "title": "Draw a border around the text if you’d like to.",
      "content": "Draw a border around the text if you’d like to. Many illuminated manuscripts had fanciful borders surrounding the entire page or the box of text. Use your quill and black ink to draw out some vines, flowers, or leaves around the edges of the page."
    },
    {
      "title": "Paint a base coat onto areas where you want to press gold leaf.",
      "content": "Paint a base coat onto areas where you want to press gold leaf. Grab a base coat for gold leaf and dip a small paint brush into it. Pick out the areas of your design that you’d like to press gold leaf onto, then gently paint the base coat on those areas. Try not to get it outside the lines, or it could dilute the paint you use later on. [5] X Research source Traditional base coats were made of plaster, but you can find base coats at most craft supply stores."
    },
    {
      "title": "Press the gold leaf onto your design.",
      "content": "Press the gold leaf onto your design. Grab a sheet of gold leaf with tweezers and carefully press it onto the areas that have a base coat on them. Use a fluffy paint brush to brush away the excess gold leaf, then press the remaining gold leaf down onto the page so it really sticks. Gold leaf is a thin sheet of real gold that you can manipulate using a paint brush. It’s great for adding a regal border or angelic lighting to an image. Gold leaf adds the “illumination” to your images that gives these manuscripts their name. Traditionally, gold leaf was added to window panes and fruits in the background of images. If you’re doing a craft with your kids, you can use gold glitter paint instead."
    },
    {
      "title": "Add color to your designs with watercolor paint.",
      "content": "Add color to your designs with watercolor paint. Pick out the colors that you’d like to use for the rest of your image. Try to use watercolors, as they best reflect the traditional vegetable dyed colors of the Middle Ages. Use a small paint brush to dab color into the areas of your design to fill in the rest of the visual, then let the paint dry for about 15 minutes. If you’re doing this as a craft project with your kids, let them use glitter glue or brightly colored paint to fill in their images. Classic illuminated manuscripts used vegetable dyed paint, meaning they had a limited range of colors. To stick to the classic look, try to use light greens, purples, deep reds, and burnt oranges. You can use white or tan paint to add highlights to your figures and objects as well."
    },
    {
      "title": "Gather the pages in the correct order.",
      "content": "Gather the pages in the correct order. Once all your pages are dry, collect them in the order that you’d like them to go. Make sure they are all cut to the same size and that there isn’t anything missing from your text. [6] X Research source Classic manuscripts had folded pieces of parchments, called “gatherings,” but you don’t have to use that for yours."
    },
    {
      "title": "Press the spine of the pages against 3 narrow, leather thongs.",
      "content": "Press the spine of the pages against 3 narrow, leather thongs. Line the left side of the pages up against 3 narrow, leather thongs, and spread the thongs lengthwise across the spine of the book. These thongs will hold the pages of your manuscript together, so they should be slightly wider than the group of pages. You can find leather thongs at most craft supply stores. If you can’t find any leather thongs, you can use synthetic ones instead."
    },
    {
      "title": "Sew the pages onto the thongs with linen thread.",
      "content": "Sew the pages onto the thongs with linen thread. Thread a needle with thick linen thread and tie the end in a knot. Use the linen thread to go in through the top of the pages, then out through the top of one leather thong. Keep going until you’ve attached all of the pages to all 3 of the thongs in a straight line. [7] X Research source If you have a lot of pages in your manuscript, this can be tough to do. Try working in sections to get all of the pages attached in the same way."
    },
    {
      "title": "Loop the leather thongs through wooden boards.",
      "content": "Loop the leather thongs through wooden boards. Grab 2 wooden boards that are slightly larger than the pages of your manuscript. Line up the boards on your pages, then mark where the ends of the leather thongs fall on the boards. Use a chisel to pop out 3 holes in each board for the thongs, then pull the thongs through the holes and tie them off. If there’s excess leather sticking out of the book, you can use scissors or a knife to cut it off. You can use any kind of wood for the boards that you’d like to, as long as it’s mostly flat."
    }
  ]
}