{
  "url": "https://www.wikihow.com/Put-Echo-Dot-in-Setup-Mode",
  "title": "Easy Steps to Put Your Echo Dot in Setup Mode",
  "steps": [
    {
      "title": "Open the Alexa app on your phone or tablet.",
      "content": "Open the Alexa app on your phone or tablet. Tap the app icon that looks like the word \"alexa\" on a light blue background on your Android, iPhone, or iPad. Leave your Echo Dot turned off for now. You'll turn it on in a few moments. If you don't have the Alexa app yet, you can download it from the App Store (iPhone/iPad) or Play Store (Android)."
    },
    {
      "title": "Tap Devices.",
      "content": "Tap Devices . It's in the lower-right corner of the Alexa app with the icon of a house with switches in it. [1] X Research source"
    },
    {
      "title": "Tap +.",
      "content": "Tap + . This plus sign is in the top right corner of your screen. [2] X Research source If you see the Echo Dot that you're trying to put in setup mode, reset it so it doesn't appear here. Press and hold the \"Action\" button on it for about 20 seconds and wait for the ring light to flash off and on again. [3] X Research source"
    },
    {
      "title": "Tap Add Device.",
      "content": "Tap Add Device . It's usually the first option in the menu that slides up from the bottom of your screen. [4] X Research source"
    },
    {
      "title": "Tap Amazon Echo.",
      "content": "Tap Amazon Echo . You'll find this under the \"All Devices\" header next to an icon of a speaker. [5] X Research source"
    },
    {
      "title": "Tap Echo, Echo Dot, Echo Plus, and more.",
      "content": "Tap Echo, Echo Dot, Echo Plus, and more . This is usually the first and only option under \"Echo Smart Speakers.\" [6] X Research source"
    },
    {
      "title": "Turn on your Echo and wait for the light to shine orange.",
      "content": "Turn on your Echo and wait for the light to shine orange. The light will change from blue to orange within 30 seconds of turning it on. Once you see the orange light, you'll know you're in setup mode. [7] X Research source If the light never appears, you may need to reset your Echo Dot. [8] X Research source"
    },
    {
      "title": "Tap Yes in the Alexa app.",
      "content": "Tap Yes in the Alexa app. This will confirm that your Echo Dot is plugged in, turned on, and in setup mode."
    },
    {
      "title": "Tap your Echo Dot under \"Available Devices.",
      "content": "Tap your Echo Dot under \"Available Devices. \" Doing this will start the setup process."
    },
    {
      "title": "Tap your Wi-Fi network and tap Continue.",
      "content": "Tap your Wi-Fi network and tap Continue . You will be prompted to enter the network's password if it has one."
    },
    {
      "title": "Follow the on-screen prompts to set up your Echo Dot.",
      "content": "Follow the on-screen prompts to set up your Echo Dot. You can tap Skip to skip steps for now, like syncing your contacts list with your speaker or saying \"Alexa\" to set up voice recognition. You can always return to those steps later. Your Echo Dot will remain in setup mode until it has successfully paired with the Alexa app on your phone or tablet. Your speaker will automatically exit setup mode once connected to a Wi-Fi network. Now you can say \"Alexa, set a timer for 12 minutes\" or \"Alexa, what's the weather like tomorrow?\" [9] X Research source"
    }
  ]
}