{
  "url": "https://www.wikihow.com/Gpu-Artifacting",
  "title": "Common Causes of GPU Artifacting and How to Fix It",
  "steps": [
    {
      "title": "GPU artifacting is visual anomalies and distortions produced by your graphics card.",
      "content": "GPU artifacting is visual anomalies and distortions produced by your graphics card. It can occur on an integrated or dedicated graphics card. The following are some examples of GPU artifacting: [1] X Research source Lines and streaks: These are colored streaks that randomly appear and dart across your screen. Dots: In addition to lines, you may see random colored polka dots appear on your screen. Pixelation: This is when random blocky chucks appear on your screen. Distortion: This is when an image is warped, twisted, or bent. Screen Tearing: Screen tearing is when the frames aren't rendered properly and it appears there is a line tearing the image into two separate images on the screen. Random symbols: You may see random symbols appear on the screen. Often compared to \"Space Invader\" sprites. Flashing: You may see flashes of random colors on the screen. Random textures: You may see random textures appear on your screen or apply to geometric shapes in a game. Random shapes: You may see random shapes or bubbles appear on the screen."
    },
    {
      "title": "Overheating.",
      "content": "Overheating. If your GPU is getting too hot, the fans aren't working, or your computer isn't properly ventilated, this can cause artifacting. It can also shorten the lifespan of your GPU."
    },
    {
      "title": "Overclocking.",
      "content": "Overclocking. Overclocking your GPU and pushing it past its factory settings. This can cause artifacting because your GPU is trying to handle more than it was designed to handle."
    },
    {
      "title": "Power supply issues.",
      "content": "Power supply issues. Your GPU consumes a lot of power. If your power supply does not supply enough power to your GPU, it can cause artifacting."
    },
    {
      "title": "Outdated graphics drivers.",
      "content": "Outdated graphics drivers. If you are not keeping your graphics drivers up-to-date, there could be flaws in the drivers that are causing artifacting."
    },
    {
      "title": "Extreme graphics settings.",
      "content": "Extreme graphics settings. If you are setting your graphics settings in your games too high or too extreme, this can cause artifacting."
    },
    {
      "title": "Software issues.",
      "content": "Software issues. If you notice artifacting only happens on a particular game or program, there could be software issues or bugs with that particular game."
    },
    {
      "title": "GPU malfunctioning.",
      "content": "GPU malfunctioning. GPU artifacting can be a sign that there are problems with the VRAM or other parts of your GPU. Your GPU could be dying ."
    },
    {
      "title": "Update your display drivers.",
      "content": "Update your display drivers. One of the first things to check is if your graphics drivers are up-to-date and update your graphics drivers . You can download the latest drivers for your graphics card from the manufacturer's website. Use the following steps to update your drivers in Windows: [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Right-click the Windows Start menu. Click Device Manager . Expand Display adapters . Right-click your display adapter. Click Update drivers . Click Search automatically for drivers ."
    },
    {
      "title": "Check your connections.",
      "content": "Check your connections. Check the video cable that connects to your monitor. Make sure it is secure and working properly. Try using a different video cable and see if this fixes the problem."
    },
    {
      "title": "Improve cooling.",
      "content": "Improve cooling. If your GPU is getting too hot, this can cause artifacting. On average, your GPU should be running at about 60°C-70°C. During intense gaming, it may reach as high as 90°C. If it's too hot, make sure your computer is in a well-ventilated area with nothing blocking the fans. You may want to clean out any dust from the vents, fans, and the inside. You may want to improve your PC's cooling system. You may need to apply thermal paste to your GPU. Use the following steps to check your GPU's temperature: Right-click the Windows Start menu. Click Task Manager . The Performance tab (Windows 10) or the Chart icon to the left (Windows 11). Check the temperature of your GPU. You can also use third-party tools, like MSI Afterburner, to check your GPU's temperature."
    },
    {
      "title": "Lower your in-game graphics settings.",
      "content": "Lower your in-game graphics settings. Check the graphics settings in your games. Most games have a variety of graphics settings you can tweak. Everything from the texture, shadow, and reflection quality to the frame rate, the resolution, and more. Try reducing the graphics settings for more graphically intense games to see if this fixes the problem."
    },
    {
      "title": "Update or repair software.",
      "content": "Update or repair software. If the problem is happening on a particular game or program, there could be a problem with the software. Check to see if there are any updates for the software. If that doesn't work, try uninstalling the game and reinstalling it."
    },
    {
      "title": "Check your power supply unit.",
      "content": "Check your power supply unit. Your GPU consumes a lot of power. Make sure your power supply unit is producing enough power to power it. You can check your power supply unit using a power supply tester or a multimeter ."
    },
    {
      "title": "Disable overclock settings.",
      "content": "Disable overclock settings. If you are overclocking your GPU, you are running it beyond the manufacturer's specifications. Revert your overclock settings back to their default factory settings."
    },
    {
      "title": "Undervolt your GPU.",
      "content": "Undervolt your GPU. Some users have managed to fix GPU artifacting by undervolting their GPU . This reduces the power your GPU uses, lowering its temperature and making it run more efficiently. You can undervolt your GPU using programs like MSI Afterburner. Undervolting your GPU too much may cause your graphics drivers to crash and not run properly. The trick is to find a sweet spot."
    },
    {
      "title": "Underclock your GPU.",
      "content": "Underclock your GPU. If you continue to experience artifacting issues, your GPU could be starting to go bad. You may want to try underclocking it. While this will reduce your GPU's performance and capabilities, it will also reduce its power consumption and heat output. This may reduce artifacting and extend the life of your GPU. You can underclock your GPU using a program like MSI Afterburner. [3] X Research source"
    },
    {
      "title": "Replace your GPU.",
      "content": "Replace your GPU. If you've tried everything and are still experiencing GPU artifacting, your GPU could be damaged. It may be time to replace your GPU."
    }
  ]
}