{
  "url": "https://www.wikihow.com/Run-Air-Lines-in-a-Shop",
  "title": "How to Run Air Lines in a Shop",
  "steps": [
    {
      "title": "Use copper pipe if you want hard-piped air lines.",
      "content": "Use copper pipe if you want hard-piped air lines. Copper is the best choice for metal air pipes because it doesn’t rust and is easy to work with. Buy copper pipe at a hardware store or a home improvement center. [1] X Research source Keep in mind that if you use copper pipe for your air lines, you have to know how to sweat and solder joints to connect lengths of pipe. It’s possible to use steel or aluminum pipe for air lines, but these are harder to work with because you have to thread them to connect them. They are also less practical than copper because they can rust if moisture gets inside them."
    },
    {
      "title": "Choose semi-flexible rubber tubing if you want flexible air lines.",
      "content": "Choose semi-flexible rubber tubing if you want flexible air lines. Make sure the tubing is approved for high pressure. Purchase the tubing at a home improvement center or a hardware store. [2] X Research source Flexible tubing is more forgiving if you decide you want to change the layout of your air lines down the road. Rubber tubing is also easier to connect than copper pipe if you don’t know how to sweat copper joints."
    },
    {
      "title": "Never use PEX or PVC tubing for compressed air.",
      "content": "Never use PEX or PVC tubing for compressed air. These materials are not rated for high pressure. They can explode if you try to use them to run air lines in your shop. [3] X Research source PEX and PVC tubing are both types of plastic tubing that are meant for running water lines."
    },
    {
      "title": "It depends on the CFM of your compressor and the length of the air lines.",
      "content": "It depends on the CFM of your compressor and the length of the air lines. Measure the CFM of your air compressor with a flow meter and measure the total distance you plan to run your air lines with a tape measure. Look up a table online for air compressor pipe size and find the intersection of your compressor’s CFM and the length of the lines to determine the pipe size. [4] X Research source CFM stands for cubic feet per minute. It indicates how much air the compressor can move in a minute. Simply Google “air compressor pipe size table” and click on images to see a bunch of tables you can use to find the right pipe size. For example, if your air compressor has a CFM of 80 and you’re running 50 ft (15 m) total of air lines, you would need 1.25 in (3.2 cm) pipe for the lines. Using the right size of pipe reduces the PSI drop, or drop in air pressure, from the air compressor to the point of use."
    },
    {
      "title": "Somewhere with plenty of airflow around the compressor.",
      "content": "Somewhere with plenty of airflow around the compressor. Your air compressor has to intake fresh air to work properly, so don’t cram it somewhere with limited airflow. The cleaner the air, the better, so avoid areas where there’s a lot of dust, spray paint, or other particles in the air. [5] X Research source It’s also a plus if the space is vented to the outside air for even better circulation. Consider the location of your air lines and the layout of your shop as well. Don’t put the air compressor somewhere in the way or where it’s hard to connect to the air lines."
    },
    {
      "title": "Put the compressor in a separate space to isolate noise.",
      "content": "Put the compressor in a separate space to isolate noise. Place it in a closet, a cubicle, or an adjacent room. Then, run the air lines out of the space to your shop. This cuts down on distracting noise and keeps it out of the way. [6] X Research source If you choose to do this, make sure the compressor is still easy to access. Also, consider whether its location means you have to add a lot of length to your air lines."
    },
    {
      "title": "Attach air lines to the wall with plumbing clamps.",
      "content": "Attach air lines to the wall with plumbing clamps. Screw plumbing clamps into the walls at regular intervals high along the walls where you want to run the air lines. Slide the lines into the clamps and tighten the screws on the clamps to hold them in place. [7] X Research source If you’re sweating and soldering copper pipes as you run them, use stand-off brackets for the plumbing cramps to keep the pipes about 4 in (10 cm) off the wall and give yourself room to work."
    },
    {
      "title": "Put hose connection stations where you plan to use compressed air.",
      "content": "Put hose connection stations where you plan to use compressed air. Screw wall-mounted, quick-connect air hose connectors to the wall anywhere in your shop where you want to have easy access to compressed air. Connect your air lines to the top of the air hose connectors. [8] X Research source For example, if you tend to use compressed air nail guns in one part of your shop, that would be a good place for one air connection station. If you use a paint gun in another part of the shop, that would be another good area. You can always add to your air lines later on, so don’t worry too much about adding a ton of hose connection stations right now. A quick-connect air hose connector is a small metal box with an air valve built into it that you just press an air hose into to connect a tool to the air lines. You just screw the box to the wall wherever you want to be able to quickly connect a tool to the air lines in your shop."
    },
    {
      "title": "Install shut-off valves in between hose connection stations.",
      "content": "Install shut-off valves in between hose connection stations. Use high-pressure shut-off valves. Insert 1 valve between 2 lengths of pipe or tubing wherever you want to be able to turn the air supply on or off to a section of the lines. You just have to press a separate length of air line into either side of the valve to install the valve in the line. [9] X Research source Make sure you also put a shut-off valve above the main air hose connection that your compressor connects to. Shut-off valves are just rectangular levers that you turn 90 degrees to open or close the line."
    },
    {
      "title": "Use T-connectors and elbow connectors in your air lines.",
      "content": "Use T-connectors and elbow connectors in your air lines. Insert a T-connector in between lengths of your air lines when you want to branch the lines off in different directions. Connect lines with an elbow when you just want to bend the line in one direction. Just press separate lengths of air line into both sides of the connectors to insert the connectors in the air lines. [10] X Research source For example, if you have 3 hose connection stations along 1 long wall, run 1 main air line along the top of the wall. Put a T-connector in the line above each connection station and run a length of pipe or tubing down from each T-connector to each connection station. Or, if you just have 1 hose connection station on a wall, run the main air line along the top of the wall to just above that station and put an elbow on the end of it, facing down. Run another length of air line from the elbow down to the hose connection station. For copper pipe, use copper T-connectors and elbows. For flexible rubber tubing, use air hose push fittings."
    },
    {
      "title": "Connect your compressor to the air lines with a short, flexible air hose.",
      "content": "Connect your compressor to the air lines with a short, flexible air hose. Plug 1 end of the hose into the hose connection station in the air line and 1 end into the air compressor. Using a short flexible hose makes it easy to disconnect the air compressor and move it if you ever need to. [11] X Research source This also makes it quick and easy to disconnect the air compressor and drain the moisture from it. Install a pass-through filter between the end of the hose and the beginning of the air line to trap water and contaminants and keep them out of your pipes or tubing."
    }
  ]
}