{
  "url": "https://www.wikihow.com/Be-Good-at-Group-Discussion",
  "title": "How to Be Good at Group Discussion",
  "steps": [
    {
      "title": "If at all possible, do your studying ahead of time.",
      "content": "If at all possible, do your studying ahead of time. Read any materials that have been distributed. Do any reading that was assigned. If you just have a general idea of the topic, spend some time researching the topic. In fact, it's a good idea to bring some notes with you, so you have something to refer back to in the discussion, particularly if you have evidence you want to discuss."
    },
    {
      "title": "This helps you get the most out of your group discussion.",
      "content": "This helps you get the most out of your group discussion. Sometimes, people may not express themselves as well as they want, or you simply may not hear all of what they say. It's fine to ask for clarification, particularly if you want to provide a counterpoint."
    },
    {
      "title": "If you only stick to your beliefs, you’ll have a hard time learning anything new.",
      "content": "If you only stick to your beliefs, you’ll have a hard time learning anything new. One of the benefits of group discussion is it gives you a chance to interact with people you might not normally have a conversation with. That means you have a chance to learn something new and expand your horizons. [2] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source When someone presents an idea that takes you aback, think a moment before responding. Try to put yourself in the other person's shoes to see where they're coming from. If you don't understand something, ask a follow-up question. The other person will likely appreciate that you are interested in what they have to say."
    },
    {
      "title": "A group discussion should involve everyone in the group, including yourself.",
      "content": "A group discussion should involve everyone in the group, including yourself. When you have an opinion or a fact that's relevant to what's being said, jump in and voice what you have to say. [3] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source If you're a little shy, try getting the leader's attention so you have a chance to speak. You can also ask questions to encourage discussion."
    },
    {
      "title": "Backing up your statements helps you look credible.",
      "content": "Backing up your statements helps you look credible. With this in mind, make sure you have evidence or research to back up what you say. Of course, that evidence could be your experience, but you do need to be able to explain why you are presenting a certain side."
    },
    {
      "title": "It’s easy for group discussions to go off on a tangent.",
      "content": "It’s easy for group discussions to go off on a tangent. In fact, it can be a lot of fun. However, try to stay focused on the discussion at hand, so you and others will get the full benefit of the discussion."
    },
    {
      "title": "Being in a group discussion is not just about saying what's on your mind.",
      "content": "Being in a group discussion is not just about saying what's on your mind. It's also about listening to other members in the group. While what you have to say is important, it's also important to let others have their say, as well. [4] X Research source To listen well, don't just be thinking about what you want to say next. Actually hear what the other members are saying. Try jotting down short notes on what others are saying, so you have them to refer back to. If you have a good idea, hold onto it until the moment is right to share. Don't cut people off while they're sharing their ideas. It can help to jot down a few words to help remind yourself to share your idea once it's your turn to speak."
    },
    {
      "title": "Rude remarks won’t get you anywhere.",
      "content": "Rude remarks won’t get you anywhere. When a discussion starts getting heated, it can be tempting to start attacking the person. However, you need to stick to discussing ideas to keep the conversation civil. [5] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source For instance, you might be tempted to say, \"Well, you're stupid for thinking that.\" However, that will only cause the conversation to spiral downward. Try, \"Can you explain to me why you think that? I disagree, but I'd like to hear more about your side.\" This sentence will help dialogue continue to flow, and they may make a point that will win you over."
    },
    {
      "title": "Respect and civility can go a long way in a group discussion.",
      "content": "Respect and civility can go a long way in a group discussion. When making a point, include everyone with your language. Don't use sexist or racist language when speaking up, as it may make others feel excluded. For instance, try using \"Chairperson\" instead of \"Chairman.\" Say \"Can I get everyone's attention?\" instead of \"Ladies and gentlemen, can I get your attention?\""
    },
    {
      "title": "Open-ended questions can help to get people talking about the subject.",
      "content": "Open-ended questions can help to get people talking about the subject. These are ones that require more than a \"yes\" or \"no\" answer . [6] X Research source You can ask exploring questions to get a dialogue going, such as \"What do you think was meant by 'objectivity versus subjectivity'?\" Challenge questions can get a debate going, such as \"What assumptions is the author making? Do you think they're valid assumptions?\" You can also ask questions about relationships, such as \"What are the similarities between these two ideas? What are the differences?\" Diagnostic questions can be helpful as well, such as \"What do you think the author's motive was for this scene?\""
    },
    {
      "title": "As a leader, it's your job to help all the members in the group have a say.",
      "content": "As a leader, it's your job to help all the members in the group have a say. Some members will be shyer than others, which means you need to create a space for them to speak. For instance, you could go around the group and have each person say what they think, so everyone has a chance to speak. [7] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source"
    },
    {
      "title": "If you ignore how members are feeling, you could alienate some of the group.",
      "content": "If you ignore how members are feeling, you could alienate some of the group. Instead, pay attention to how each member is reacting to what's being said. That includes paying attention to their nonverbal reactions. They may be saying a great deal with their body language. [8] X Research source Take steps to address issues as you notice them. For instance, if one person gets consistently cut off by another member, you may notice they cross their arms and glare at the other person. Try to mediate the problem by asking what that person thinks, as well as encouraging members to let others finish their thoughts before speaking up."
    },
    {
      "title": "Heated discussions can be fine, but hurtful words aren’t.",
      "content": "Heated discussions can be fine, but hurtful words aren’t. As the leader, try to make sure everyone stays on point. They should be discussing ideas, not diving into attacks on other people, whether they're attacking people in the group or not. [9] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source"
    },
    {
      "title": "That way, you have something everyone can focus on and refer back to.",
      "content": "That way, you have something everyone can focus on and refer back to. It's best if you can take notes somewhere where everyone can see, such as on a projection screen or whiteboard. This can also serve as a record of what happened in the group. If you prefer, you can ask a volunteer to do the note-taking."
    },
    {
      "title": "A good leader knows when they’re not needed.",
      "content": "A good leader knows when they’re not needed. If the group is functioning on its own, try not to interrupt the flow. If the discussion is on task and clipping along at a good speed, try not to stop the flow by interrupting the conversation."
    }
  ]
}