{
  "url": "https://www.wikihow.com/Is-Mild-or-Medium-Hotter",
  "title": "Which Level of Spiciness Is Hotter: Mild or Medium?",
  "steps": [
    {
      "title": "Mild is the lowest level of spice.",
      "content": "Mild is the lowest level of spice. Mild means “not extreme,” so it’s used to describe the least spicy foods. [1] X Research source Medium, on the other hand, means “to be in the middle,” and is between mild and hot. Some mild and medium store-bought products can taste pretty similar, which can cause a little bit of confusion."
    },
    {
      "title": "Spice levels are measured by the amount of capsaicin in a food.",
      "content": "Spice levels are measured by the amount of capsaicin in a food. Capsaicin, a chemical compound in peppers, causes the spicy burning sensation in your mouth. [2] X Research source It’s often found in the white parts of a pepper—that’s why the seeds are the hottest part! The more capsaicin, the spicier the food. Spiciness is measured in SHU, or Scoville Heat Units. Mild foods are around 100-2,500 SHU, and medium foods are 2,500-30,000."
    },
    {
      "title": "Spiciness affects everyone differently.",
      "content": "Spiciness affects everyone differently. Everybody’s mouth is different, so everyone reacts to capsaicin differently—basically, taste is relative. [3] X Research source People who are used to eating hot peppers eventually develop a tolerance for the chemical, allowing them to eat spicier and spicier foods. Because of this, what counts as “medium” somewhere could mean “mild” somewhere else. If you're sensitive to spice, consider ordering mild, or asking for “medium mild” at new restaurants."
    },
    {
      "title": "Mild",
      "content": "Mild Mild foods include bell peppers, banana peppers, poblano peppers, shishito peppers, pimento peppers, anaheim peppers, and paprika. [4] X Research source Peppers of the same species can vary in heat based on the conditions they were grown in. Mild peppers are best for people who are just starting out with heat. Their flavors are very gentle, and some can have no capsaicin at all (like bell peppers). Salsas and other store-bought foods are often color-coded by heat level—green for mild, yellow or orange for medium, and red for hot."
    },
    {
      "title": "Medium",
      "content": "Medium The medium rating (roughly 2,500-30,000 SHU) is significantly wider than the mild. Medium peppers include: jalapeños, chili peppers, serrano peppers, cayenne peppers, Hungarian peppers, aleppo peppers, cherry peppers, chipotle peppers, and paprika Kalocsa peppers. [5] X Research source Medium peppers are great for people trying to ramp up the heat. On the lower end are poblanos—think if a bell pepper were spicy—and on the higher end are chili peppers."
    },
    {
      "title": "Hot",
      "content": "Hot Some examples of hot peppers are tabasco peppers, habanero peppers, scotch bonnet peppers, Thai peppers, pequin peppers, and apache peppers. [6] X Research source There are also very hot and extremely hot peppers, which are more than 100,000 SHUs. One of the world’s hottest peppers, the Carolina Reaper, is 2.2 million SHUs. [7] X Research source Hot, very hot, and extremely hot peppers should only be eaten by spice enthusiasts who really enjoy that burning sensation."
    },
    {
      "title": "Start with mild foods and slowly increase the spiciness.",
      "content": "Start with mild foods and slowly increase the spiciness. If you want to introduce spicier foods into your life, start at the level you’re already comfortable with. If you’re into jalapenos, start with medium. [8] X Research source If chili flakes make you tear up, try something like a banana pepper."
    },
    {
      "title": "Eat slowly and wait between bites.",
      "content": "Eat slowly and wait between bites. Spiciness can sneak up on you—some peppers pack their heat in an aftertaste. [9] X Research source If you’re trying a new food (especially one that’s advertised as spicy), wait a few seconds after you swallow to eat more."
    },
    {
      "title": "Have a citrus or dairy product handy to cool you down.",
      "content": "Have a citrus or dairy product handy to cool you down. Since capsaicin is what causes the spiciness, make sure you have something nearby that can neutralize it. Dairy products contain the protein casein, which breaks down capsaicin, and acidic foods have been found to reduce the pain associated with spiciness. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Water can’t dissolve capsaicin, so it’s not a good option for cooling your tongue . It’s better than nothing, but if you don’t have milk or citrus, try sucking on a sugar cube or eating bread, instead. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Mixing pineapple, tomato sauce, lemon juice, or lime juice into food can make it less spicy."
    },
    {
      "title": "Go at your own pace.",
      "content": "Go at your own pace. Everyone reacts differently to spiciness, so your limit may be lower than other peoples’—and that’s totally okay! If you eat something and feel an unpleasant burning sensation, stop, drink some milk, and switch to a milder food. Building a capsaicin tolerance takes a while, and really, it’s just about enjoying the flavors!"
    }
  ]
}