{
  "url": "https://www.wikihow.com/How-Toilets-Work",
  "title": "How Does a Toilet Work? A Step-by-Step Breakdown",
  "steps": [
    {
      "title": "",
      "content": "When you press down on the handle to flush the toilet, it lifts a lever inside the tank connected to a chain and circular rubber flapper . As the flapper lifts up, it breaks the watertight seal at the bottom of the tank so the water can start flowing into the bowl. The flapper floats in the water to stay open even after you let go of the handle. [1] X Research source If the flapper doesn’t open, try adjusting the chain length so it’s shorter. Sometimes, the plastic parts on the inside of the handle can break. If the handle feels loose or doesn’t open the flapper, then replace the assembly ."
    },
    {
      "title": "",
      "content": "Most toilets tanks release about 2 gallons (7.6 L) of water every time you flush. The water travels through the flush ring , a channel just underneath the toilet seat, to enter the bowl. [2] X Research source About 20% of the water goes through small rim holes along the edge of the bowl to rinse away any waste. The remaining water gets directed into a channel along the bottom of the bowl called the siphon jet to help your toilet start flushing. [3] X Research source If there’s no water in your tank, make sure you turn on the water supply using the valve on the wall behind your toilet."
    },
    {
      "title": "",
      "content": "Normally, the water level sits just below the highest point of the S-trap , which is the curved section at the bottom of your toilet that leads to the drain pipe. After you flush and the level rises, the water rushes over the top of the S-trap and creates a siphon. This siphon acts like a vacuum that pulls all the water and waste out of the bowl and through the S-trap. Once the water level is low enough for air to get back into the S-trap, the siphon stops and the bowl starts filling up again. [4] X Research source If your toilet doesn’t flush, it could be a sign of a clog. Try unclogging your toilet with a plunger or plumbing snake. If there isn’t enough water to start the siphon, then there may be an issue inside the tank. Adjust the fill valve or float to raise the water level and improve the flush power."
    },
    {
      "title": "",
      "content": "As water empties out of the tank, the flapper will slowly drop back down to cover the flush valve. The flapper creates an airtight seal so the tank can refill without leaking into the bowl. [5] X Research source If the flapper doesn’t close completely or there’s water leaking into the tank, make sure there are no obstructions between the flapper and valve. Fix a flapper by adjusting the length of the chain or by replacing the unit completely."
    },
    {
      "title": "",
      "content": "The fill valve is usually a tall plastic piece near the back of your toilet tank that pulls water in from the supply line. The water flows from the valve and into the tank to raise a float , which either looks like a balloon or a plastic cylinder on the flush valve. When the water level reaches the max fill line on the vertical overflow tube and raises the float, the fill valve shuts off so your toilet doesn’t keep running. [6] X Research source The overflow tube leads directly to your toilet bowl so the tank doesn’t overflow if the water level rises higher. It’s normal for water to go through a small hose from the fill valve to the overflow tube while the tank is refilling. Once the fill valve shuts off, the water will stop going into the overflow tube as well. If you’re fixing a running toilet , check to make sure the flapper is completely closed and undamaged. If that doesn’t work, then adjust the height of the float or replace the fill valve ."
    }
  ]
}