{
  "url": "https://www.wikihow.com/Curl-Long-Thick-Hair",
  "title": "3 Pro Ways to Get Beautiful Curls for Long and Thick Hair",
  "steps": [
    {
      "title": "Apply a heat protecting serum.",
      "content": "Apply a heat protecting serum. Using direct heat from the curling iron can damage your hair, so it's a good idea to apply serum before you get to work. Serum meant to protect your hair from heat damage is available in the hair styling section of drugstores. Make sure that your hair is clean and dry before you get started. Curls tend to fall out of hair that's a little oily, so don't use too much conditioner before you plan to curl your hair. Don't curl wet hair, either; as your hair dries, the curls will fall out, especially if your hair is long and thick."
    },
    {
      "title": "Heat up a curling iron.",
      "content": "Heat up a curling iron. If you want big, loose curls, use an iron with a bigger barrel. For tighter curls, choose one that has a smaller barrel. Either way, try to use a ceramic curling iron. These get hotter than other curling irons, creating a longer-lasting style for thick, long hair."
    },
    {
      "title": "Wrap the front of your hair around the curling iron.",
      "content": "Wrap the front of your hair around the curling iron. Start with the hair that grows above your forehead, and wrap a two-inch section of hair around the barrel. Roll it over so that the hair gets pulled back from your forehead, not toward your face. Hold it there for three seconds, then remove the curling iron and use a pin to hold the curl in place. Don't hold the curling iron in your hair for too long. Too much heat exposure can cause your hair to dry out. If you have bangs, don't wrap them with the rest of your hair. They should be styled separately."
    },
    {
      "title": "Use the same method to curl the rest of your hair.",
      "content": "Use the same method to curl the rest of your hair. Wrap it in two-inch sections around the curling iron, hold in place for three seconds, then slip out the iron and pin the curl to your head. [1] X Research source If you need help curling the back, ask a friend to help you out. It can be difficult to make neat curls on the back of your head. For a tousled look, experiment with curling sections of your hair in different directions, rather than uniformly curling them toward the crown of your head."
    },
    {
      "title": "Spray your hair with hairspray.",
      "content": "Spray your hair with hairspray. When all of your hair is pinned up in curls, spray it with hairspray. If you want tight curls that stay in place all day, use a maximum hold spray; for looser, more natural-looking curls, use a loose hold spray."
    },
    {
      "title": "Remove the pins.",
      "content": "Remove the pins. After your hair has cooled from the iron, remove each of the pins and let the curls drop to your shoulders. Apply more hair spray if you wish. You can also run your fingers gently through the curls to make them look softer."
    },
    {
      "title": "Wash and condition your hair.",
      "content": "Wash and condition your hair. Don't over-condition, as this will make your curls more likely to fall out over the course of the day. While your hair is still wet, use a wide-toothed comb to remove any tangles. Gently pat it dry with a towel."
    },
    {
      "title": "Make t-shirt strips",
      "content": "Make t-shirt strips . Use a scissors to cut an old t-shirt lengthwise into strips. Insert the scissors at the neck and cut down to the hem, then repeat along the neckline until you have enough strips to roll up your entire head of hair. The strips should be a few inches longer than your hair. [2] X Research source If you don't have an old t-shirt, you can use long socks, dishtowels, or any piece of cotton fabric that is the same length as your hair. If you want small, tight curls, make the strips narrow. For larger curls, make them wider, about 2 or 3 inches (5.1 or 7.6 cm)."
    },
    {
      "title": "Roll your hair in the strips.",
      "content": "Roll your hair in the strips. Start by separating a section of your hair from the rest. Comb it out so it's smooth, then line up the end of a t-shirt strip with the tip of the section of hair. Begin rolling it toward your so that the hair gets rolled up in the strip. When you reach your scalp, tie the ends of the strip to hold it in place. Repeat until all sections of your hair have been rolled. [3] X Research source Roll strips of hair in different directions, or under instead of over, to achieve a tousled effect. Roll halfway up your hair and stop if you want waves that only extend halfway up your hair."
    },
    {
      "title": "Let your hair dry.",
      "content": "Let your hair dry. Wait several hours or overnight for your hair to completely dry in the strips. Removing the strips before your hair is dry will result in curls that don't last very long."
    },
    {
      "title": "Take out the t-shirt strips.",
      "content": "Take out the t-shirt strips. When your hair is totally dry, untie the strips and let your curls fall to your shoulders. Use hair spray, gel or mousse to hold them in place."
    },
    {
      "title": "Put your hair in a high ponytail.",
      "content": "Put your hair in a high ponytail. Bend over and use a comb to gather your hair at the top of your head and secure it with an elastic band. Make sure it's free of bumps and tangles. [4] X Research source This method works best if your hair is wet. Either wash and condition your hair as usual, or wet your hair and pat it dry in preparation for this method. Make sure your hair is completely free of tangles."
    },
    {
      "title": "Make a sock bun.",
      "content": "Make a sock bun. Take a clean tube sock, cut off the toe, and roll it into a donut shape. The larger the donut, the bigger your curls will be. Place the sock donut over your ponytail and pull your hair through. With the donut placed against your head, wrap your hair over the donut and tuck it underneath, a section at a time. Continue doing so until all of your hair is securely in place over the donut. [5] X Research source"
    },
    {
      "title": "Let your hair dry.",
      "content": "Let your hair dry. Wait several hours or overnight for your hair to dry around the bun. When you're sure it's completely dry, remove the bun and let your curls fall free. This method results in loose, wavy curls. Keep them in place with gel, mousse or hairspray."
    }
  ]
}