{
  "url": "https://www.wikihow.com/Clean-Blood-Stains-from-Leather",
  "title": "How to Clean Blood Stains from Leather",
  "steps": [
    {
      "title": "Scrape off the dried blood with a stiff-bristled brush.",
      "content": "Scrape off the dried blood with a stiff-bristled brush. Guide the brush over the stain in gentle, careful movements, so you don’t scratch your leather in the process. [1] X Research source"
    },
    {
      "title": "Blot the fresh stain with a clean rag instead of wiping it.",
      "content": "Blot the fresh stain with a clean rag instead of wiping it. Soak up as much as you can with gentle dabbing motions. Try not to wipe down the stain, or you might make it worse. [2] X Research source"
    },
    {
      "title": "Treat the spot with a leather cleaner and a leather conditioning product.",
      "content": "Treat the spot with a leather cleaner and a leather conditioning product. Soak a clean, cotton cloth with leather cleaner. Then, move the cloth in circular motions over the stain. Let the surface dry off for at least 5 minutes; then, dip another clean, cotton rag into a leather conditioner. Lightly massage the product onto the leather, and let it sit for 5 more minutes. Afterwards, wipe off any extra conditioner with a cotton cloth. [3] X Research source The Leather Institute recommends cleaning the spot with a leather cleaner, and following up with a combination cleaner-conditioner-protectant product. You can buy leather cleaners and conditioners online or from specialty stores."
    },
    {
      "title": "Go over the stain with a mild soap solution.",
      "content": "Go over the stain with a mild soap solution. Soak another clean sponge in a diluted mixture of cold, soapy water. Blot the damp sponge all over the pesky stain, and dab it dry with a dry, clean cloth. [4] X Research source"
    },
    {
      "title": "Treat the stain with 3 drops of ammonium hydroxide and 1 L (0.26 US gal) of water.",
      "content": "Treat the stain with 3 drops of ammonium hydroxide and 1 L (0.26 US gal) of water. Since ammonium hydroxide is a really strong chemical, dip a clean sponge into the mixture and dab it onto a tiny section of the stain first. If the leather doesn’t look damaged, sponge down the rest of the stain with the diluted mixture. Then, blot the stain dry with a paper towel. [5] X Research source You can buy ammonium hydroxide online or from chemical distributors."
    },
    {
      "title": "Cover it up with leather polish.",
      "content": "Cover it up with leather polish. Pick a leather polish that’s a close match to your leather item. Then, apply a small amount of polish to the stain using a clean cloth, working the polish into the stain using circular motions. Once you’ve completely covered the stain, buff the polish into the leather with a clean section of cloth. Let the polish dry completely before using your leather again, whether it’s a jacket, sofa, purse, or something else entirely. [6] X Research source You can pick up leather polish online or from certain big-name retailers. Check your leather polish bottle for drying recommendations. If you’re applying polish to a pair of leather boots or a leather handbag, hold the polish bottle up to the leather and see if it’s a good match."
    },
    {
      "title": "Certain chemicals and solvents aren’t safe to use.",
      "content": "Certain chemicals and solvents aren’t safe to use. Products like high pH cleaners, abrasives, alcohol, butyl cellosolve, mink oil, wax, furniture polish, and glass cleaner may damage your leather in the long run. As a general rule of thumb, only use products that are specifically recommended for leather. [7] X Research source Some sources suggest using saddle soap to clean your leather. [8] X Research source However, other experts, like The Leather Institute, don’t recommend this. [9] X Research source"
    }
  ]
}