{
  "url": "https://www.wikihow.com/Do-a-Shadow-Clone-Jutsu",
  "title": "How to Summon Shadow Clones (Techniques for Shadow Clone Jutsu)",
  "steps": [
    {
      "title": "Extend the index and middle fingers on both of your hands.",
      "content": "Extend the index and middle fingers on both of your hands. Use both of your hands to stick out your index and middle fingers. Fold in the rest of your fingers on both hands. Make sure your index and middle fingers touch and are parallel to each other. Flick your wrists so your 4 fingertips are pointed up."
    },
    {
      "title": "Hold out your right hand vertically.",
      "content": "Hold out your right hand vertically. For this part of the summoning process, keep your hand where it is so that two of your fingers are facing up. It’s a simple gesture, but this hand seal is important so you can properly channel your chakra. Hand seals aid shinobi so they can focus on molding their chakra into the correct form that allows them to summon duplicates of themselves."
    },
    {
      "title": "Hold out your left hand horizontally to form a cross.",
      "content": "Hold out your left hand horizontally to form a cross. Turn your left wrist 90 degrees so your hand is parallel to the ground. Move your hand until your index and middle fingers press against the ones on your right hand. Make sure the knuckles on your left hand and right hand touch. Check that you’ve formed a cross with your fingers—that’s a sign that you’ve finished your hand seal. [1] X Research source Typically, when you perform this hand seal, your right hand goes in front of your left hand, and the front of your right hand's knuckles face your opponent. Naruto is an iconic shinobi who’s hailed for his ability to perform Shadow Clone jutsu with a single hand seal. Many shinobi use a series of hand seals—this tactic makes it easier for them to visualize how to mold, control, and transform their chakra into clones."
    },
    {
      "title": "Focus on balancing your chakra energy.",
      "content": "Focus on balancing your chakra energy. Consider how many clones you need and how much chakra energy you have in your reserve. Perhaps you only need 5-10 shadow clones and you have a high level of chakra available. Then again, you may need 30 in order to win a battle. Make a judgment call and visualize how many clones you require. Just take care to set an amount that won't physically and spiritually fatigue you to the point of total exhaustion. [2] X Research source Focus on spinning the chakra in your body into a tight spiral: when it’s highly concentrated and collected in one place, it’ll be easier to tap into and channel. [3] X Research source If you need to create more chakra, mix your physical energy and spiritual energy together—this vital combination is called \"stamina.\" If you train your body before a battle, then all the clones you summon will have incredible brute force and won't need to expend spiritual energy as they fight. [4] X Research source"
    },
    {
      "title": "Yell out “Shadow Clone jutsu!”",
      "content": "Yell out “Shadow Clone jutsu!” When you've built up enough chakra energy to distribute evenly among all your clones, it's time to act—you don't have a moment to lose. Cry out the command, \"Shadow Clone jutsu!\" and watch your tribe of clones instantly appear. [5] X Research source If you're a veteran shinobi with massive chakra reserves, shout \"Multiple Shadow Clone jutsu!\" to create over 300 clones at once. If you use Multiple Shadow Clone jutsu, you can train quickly and learn many new forms of martial arts since your clones can telepathically share their experiences with you. [6] X Research source Keep in mind that Multiple Shadow Clone jutsu is a \"Kinjutsu\"—forbidden technique—since it costs such a significant amount of chakra energy and can severely exhaust shinobi. [7] X Research source Naruto learned the powerful method of Multiple Shadow Clone jutsu after he got his hands on a forbidden scroll. [8] X Research source"
    },
    {
      "title": "Press your index and middle fingers together to perform the “Ram.”",
      "content": "Press your index and middle fingers together to perform the “Ram.” Raise your left and right index and middle fingers and press them together. Slide down your right hand so your fingertips touch the back of your knuckles on your left hand. Overlap your left ring finger and pinky over the ones on your right hand. [9] X Research source The \"Ram\" is also known as the \"Histuji\" and is based on the zodiac sign, the Goat. It's very common and is one of Naruto's go-to hand seals."
    },
    {
      "title": "Clasp your hands together to perform the “Serpent.”",
      "content": "Clasp your hands together to perform the “Serpent.” Simply press your palms together and interlock your fingers. You've now performed a basic but powerful hand seal that can result in \"kekkei genkai\" (altered DNA) and trigger Earth, Lightning, and Wood Releases, which are special elemental abilities. The \"Serpent\" is also known as the \"Mi\" and is a favorite among powerful shinobi because it allows them to create their own signature jutsu (mystical skills and techniques). [10] X Research source"
    },
    {
      "title": "Raise your index fingers and make their tips touch to do the “Tiger.”",
      "content": "Raise your index fingers and make their tips touch to do the “Tiger.” Clasp your hands together and keep your forearms horizontal. Raise your left and right index and middle fingers, then press them together. Take a deep breath to ground yourself and focus on your source of chakra energy. [11] X Research source The \"Tiger\" is also known as the \"Tora,\" and it's a hand seal that's necessary for Fire and Earth releases. If you'd like to not only summon clones but also throw balls of fire or raise earth to create a protective wall, perfect your \"Tiger.\""
    },
    {
      "title": "Alternatively, use 3 of your favorite hand seals.",
      "content": "Alternatively, use 3 of your favorite hand seals. If you are a shinobi with intermediate prowess and can summon clones but can't quite tap into your chakra energy with just 1 hand signal, choose your favorite trio. Other than the \"Ram,\" \"Tiger,\" and \"Serpent,\" you may also select from: [12] X Research source The \"Rat,\" or \"Ne\" : raise your left index and middle finger, then wrap your right fingers around them. Keep your left index finger relaxed. This also enables you to unlock the \"Shadow Imitation Technique\" so your shadow can move freely. The \"Bird,\" or \"Tori\" : Create a triangular arch by pressing the pinky and middle finger of your right hand against those of your left hand. Interlock your ring fingers and index fingers. Touch the tips of your thumbs together. This also helps with wind-based techniques. The \"Boar,\" or \"I\" : Form partial fists—to do so, curl up your fingers so your palms are exposed. Press your palms together and make sure to keep your forearms parallel to the ground. This is great for summoning jutsu and was a favorite of Jiyaiya, who loved to use it to conjure up toads. The \"Inu,\" or \"Dog\" : Just make a fist with your right hand and lay your left palm on top of it. This hand seal is preferred by water ninjas, like Kisame and Zabuza, because it activates Water Release techniques. The \"Dragon\" or \"Tatsu\" : Interlock your index, middle, and ring fingers. Cross your thumbs over each other and press the tips of your pinkies together. Keep your forearms parallel to the ground. This hand signal also allows you to create a dragon-shaped entity out of any element. The \"Horse\" or \"Uma\" : Make the tips of your index fingers touch so they create a triangular arch. Face your palms toward your torso. Curl your thumbs so their tips touch the bottom of your index fingers. Stack the knuckles of your other 3 fingers. This hand seal is also ideal for throwing fireballs or dispelling illusions. The \"Monkey\" or \"Saru\" : Hold out your left palm so it faces up. Place your right palm on top of it. Make sure your thumbs point in opposite directions. Slide your right pinky between your left thumb. The \"Saru\" is essential for channeling \"Chidori,\" a high concentration of lightning chakra. The \"Ox\" or \"Ushi\" : Stretch out all your fingers except your thumbs and cross them—make sure not to close them. Hold out your right hand horizontally and stretch out your left hand vertically. Lay your left ring and middle finger down so it touches the knuckles of your right right and middle finger. Keep your forearms parallel to the ground. This hand signal is mainly used for fire jutsu."
    },
    {
      "title": "Shout out, “Shadow Clone jutsu!”",
      "content": "Shout out, “Shadow Clone jutsu!” Now that you've flowed through all 3 of your hand seals, tap into your chakra energy and concentrate on the amount of clones you'd like to summon. Finish your epic technique with a loud \"Shadow Clone jutsu!\" and bear witness to all the duplicates of yourself you've conjured up. In due time and with enough practice, you may build up enough chakra energy to effortlessly perform Shadow Clone jutsu with a single hand seal."
    },
    {
      "title": "Cross your middle finger over your index finger.",
      "content": "Cross your middle finger over your index finger. To create a hand seal with only one arm, use the hand on your dominant arm—slip your middle finger in front of your index finger. Create an \"X\" formation with both fingers. If you only have one arm or want to ignore one of your arms, you'll have less physical energy. After all, physical energy comes from the cells within your body, and you'll only be tapping into the cells from a single arm. [13] X Research source Cultivate your inner will and mental power so you can develop enough chakra control to summon with a hand seal that only uses one hand. Naruto mastered the one-armed hand seal when he injured one of his arms but still wanted to summon Shadow Clones."
    },
    {
      "title": "Mold your chakra to summon your clones.",
      "content": "Mold your chakra to summon your clones. Visualize all your chakra energy and imagine rolling it into a tight spiral. Then, decide on how many duplicates of yourself you'd like to bring into existence. When you've made your choice, portion out the chakra energy you're willing to spend. Make sure there's enough to distribute equally among your desired number of clones. [14] X Research source"
    },
    {
      "title": "Bellow out, “Shadow Clone jutsu!”",
      "content": "Bellow out, “Shadow Clone jutsu!” Congratulations, master shinobi—you've managed to tap into your chakra energy with less physical advantages than many other ninja. Now that you've harnessed all that chakra energy, let out a mighty roar and scream \"Shadow Clone jutsu!\" Make your opponent's jaw drop with the army of clones you've raised. [15] X Research source"
    }
  ]
}