{
  "url": "https://www.wikihow.com/Conquian-Card-Game",
  "title": "How to Play Conquian: Complete Game Guide",
  "steps": [
    {
      "title": "Remove the 8s, 9s, and 10s from a deck of cards.",
      "content": "Remove the 8s, 9s, and 10s from a deck of cards. Take a regular deck of cards without the jokers and take out the 8. 9, and 10 of each suit. Use the 40 remaining cards to play the game. [1] X Research source Aces are always considered low, so from lowest to highest rank, the cards are A, 2, 3, 4, 5, 6, 7, J, Q, and K. 7s are considered in sequence with Jacks."
    },
    {
      "title": "Shuffle and deal 10 cards to each player.",
      "content": "Shuffle and deal 10 cards to each player. Conquian is primarily a 2-player game, so choose one person to be the dealer. Shuffle the cards and deal them out one at a time to each player. Set the remaining cards in a face-down stock pile. [2] X Research source Even though Conquian is usually just a 2-player game, you can still try it with 3 or 4 people instead. For 3 players, deal out 8 cards. For 4 players, give each player 7 cards."
    },
    {
      "title": "Be the first player to play 11 cards into melds.",
      "content": "Be the first player to play 11 cards into melds. Melds are either sets , which are 3 or more cards of the same rank, or sequences , which are 3 or more cards of the same suit in rank order. During the game, players will play new melds and add to existing ones until one person has laid out a total of 11 cards. [3] X Research source For 3-player games, players need to meld 9 cards total. In a 4-player game, a player wins if they meld 8 cards."
    },
    {
      "title": "Turn over the top card of the stock.",
      "content": "Turn over the top card of the stock. The player who isn’t the dealer goes first. Take the top card of the stock pile and set it face-up in the middle of the table. [4] X Research source Cards you turn over are never added to your hand."
    },
    {
      "title": "Play a meld with the revealed card and cards from your hand.",
      "content": "Play a meld with the revealed card and cards from your hand. If the card forms a meld with 2 or more others in the player’s hand, they can immediately play the cards face-up in front of them. After playing one meld, they can then put down any additional melds they have in their hand. After that, the player discards 1 card from their hand. [5] X Research source Example: If you have J ♠ and Q ♠ in your hand and the turned card is a 7 ♠, you could lay them down to form a sequence meld."
    },
    {
      "title": "Discard the card if you can’t (or don’t want to) use it.",
      "content": "Discard the card if you can’t (or don’t want to) use it. You can’t save the card in your hand for a future turn, so if you can’t use it immediately, then set it aside into the discard pile. You can also choose not to use the card for a meld in your hand if you’d rather save the cards for later. Saving melds for later can be a good strategy so other players don’t know what cards you’re trying to get."
    },
    {
      "title": "Take the discarded card or the next card in the stock for all future turns.",
      "content": "Take the discarded card or the next card in the stock for all future turns. Alternate turns between players. For all future turns of the game, players first may choose to use the last discarded card if they’re able to meld it right away. If they aren’t able to or don’t want to, then they may flip over the top card of the stock instead. [6] X Research source Once you have melds played in front of you, you’re allowed to add or rearrange cards as long as you form legal melds. Example: If you have 3 ♣, 4 ♣, 5 ♣, and 6 ♣ in a sequence meld, 6 ♦ in your hand, and 6 ♥ is the turned card, you could rearrange your melds into a 3 ♣, 4 ♣, 5 ♣ sequence and 6 ♣, 6 ♦, 6 ♥ set. If you had 4 ♦ in your hand and 4 ♥ is the turned card, you couldn’t rearrange the cards because it breaks the sequence. If a discarded or turned-up card can be used in a meld already on the table on your turn, your opponent can force you to take and use it."
    },
    {
      "title": "End the game when one person has melded 11 cards.",
      "content": "End the game when one person has melded 11 cards. Alternate players each turn. At some point in the game, players may run out of cards in their hand. If they haven’t melded 11 cards yet, they still choose the discarded card or flip the top card to see if they can use it. Once someone melds their 11th card, they immediately win the game. [7] X Research source Conquian games are only a single round, but you can play multiple rounds to see who wins the best 2 out of 3. For 3- or 4-player games, players only need to meld a total of 9 cards or 8 cards respectively."
    },
    {
      "title": "Keep track of what cards have been played.",
      "content": "Keep track of what cards have been played. As cards get played, try to memorize what other players have in front of them and what’s already been discarded. That way, you can guess which cards are still available to add to your melds. Plus, you’ll see what cards your opponent needs for their melds. [8] X Research source"
    },
    {
      "title": "Discard cards that force your opponent to meld.",
      "content": "Discard cards that force your opponent to meld. When you discard, try and pick the card that’s most inconvenient for your opponent. If you can force them into taking a card in a meld, it can force them to discard a card and limit their options during later turns. [9] X Research source Example: If a player only has 2 cards left in their hand, force them to take the discard. Since they’ll have to discard a card from their hand, they’ll have a harder time adding their last card to an existing meld."
    },
    {
      "title": "Form multiple melds so you have more flexibility.",
      "content": "Form multiple melds so you have more flexibility. Try to have a variety of sets and sequences when you form melds. When you have more sets or sequences, you’re more likely to have an open spot to place the card you take. [10] X Research source Remember that you can rearrange any melds you already put down on the table. Make sure you’re looking for new ways to combine your cards. Be careful not to play all your melds too early in the game, or else the other player will know what cards you’re looking for. Try to save at least 1 meld to lay out at the end of the game."
    },
    {
      "title": "Try bluffing to trick your opponent into a bad move.",
      "content": "Try bluffing to trick your opponent into a bad move. Try to convince the other player that you’re close to winning or that you really don’t like the card they discarded. If they feel under pressure or like they’re at an advantage, they may fall for the trap and give you the card you need. [11] X Research source"
    }
  ]
}