{
  "url": "https://www.wikihow.com/Convert-cm-to-mm",
  "title": "How to Convert cm to mm",
  "steps": [
    {
      "title": "Examine the problem.",
      "content": "Examine the problem. It must describe a measurement of length in centimeters (cm) and instruct you to find the equivalent value in millimeters (mm). Example: The width of a particular table measures 58.75 centimeters. What is the width of the same table when taken in millimeters?"
    },
    {
      "title": "Multiply the centimeter value by 10.",
      "content": "Multiply the centimeter value by 10. There are 10 millimeters in every 1 centimeter. This means that you will need to find the number of millimeters per centimeter by multiplying the centimeter measurement by 10. [1] X Research source The \"millimeter\" is a smaller unit than the \"centimeter,\" even though both are derived from the basic \"meter.\" When you convert any larger metric unit to a smaller one, you must multiply the original value. Example: 58.75 cm * 10 = 587.5 mm The width of the table in the problem is 587.5 millimeters."
    },
    {
      "title": "Examine the problem.",
      "content": "Examine the problem. Read through the problem and make sure that it contains a measurement of length provided in millimeters (mm). It must also instruct you to convert that measurement to its equivalent in centimeters (cm). Example: The height of a certain door is 1780.9 millimeters. Find the height of the same door when described in centimeters."
    },
    {
      "title": "Divide the millimeter value by 10.",
      "content": "Divide the millimeter value by 10. There are 10 millimeters for every 1 centimeter, so you'll need to divide the number of millimeters by 10 to find its equivalent centimeter value. [2] X Research source The \"centimeter\" is larger than the \"millimeter,\" and whenever you need to convert a smaller metric unit to a larger one, you must divide the original value. Example: 1780.9 mm / 10 = 178.09 cm The height of the door in this problem is 178.09 centimeters."
    },
    {
      "title": "Look at the problem.",
      "content": "Look at the problem. Verify that the problem provides a measurement of length in centimeters (cm). It should also indicate that the measurement must be converted into its equivalent number of millimeters (mm). Example: The length of a certain television screen is 32.4 centimeters. Find the length of the same screen in millimeters."
    },
    {
      "title": "Move the decimal one place to the right.",
      "content": "Move the decimal one place to the right. There are 10 millimeters in every 1 centimeter, so the centimeter value will be smaller by one decimal place. You should be able to convert centimeters into millimeters by shifting the decimal point one place to the right. [3] X Research source Moving the decimal point of a number to the right increases its value, and every place holder shift equals a value of 10. As such, shifting the decimal to the right once will increase the resulting value by a factor of 10. Example: Moving the decimal point in \"32.4\" to the right once would result in a value of \"324.0,\" so the length of the screen in this problem equals 324.0 millimeters."
    },
    {
      "title": "Look at the problem.",
      "content": "Look at the problem. Look over the problem and verify that it provides a measurement of length described in millimeters (mm). It should also instruct you to convert that value into its equivalent in centimeters (cm). Example: The height of a particular chair measures 958.3 millimeters. What is the height of the same chair in centimeters?"
    },
    {
      "title": "Move the decimal one place to the left.",
      "content": "Move the decimal one place to the left. There are 10 millimeters for every 1 centimeter, so the millimeter value will be larger by one decimal place. As such, you can convert millimeters into centimeters by shifting the decimal point one place to the left. [4] X Research source Moving the decimal point to the left makes the resulting value smaller, and each decimal place holder represents a factor of 10. This means that shifting the decimal one place to the left will decrease the resulting value by a factor of 10. Example: Moving the decimal point in \"958.3\" to the left once would result in a value of \"95.83,\" so the height of the chair in this problem measures 95.83 centimeters."
    },
    {
      "title": "Convert 184 centimeters to millimeters.",
      "content": "Convert 184 centimeters to millimeters. In this problem, you need to change the centimeter value into its equivalent in millimeters. Do so by either multiplying the centimeter value by 10 or by shifting the decimal one place to the right. [5] X Research source Mathematical Conversion: 184 cm * 10 = 1840 mm Decimal Shift: 184.0 cm => shift the decimal to the right once => 1840 mm"
    },
    {
      "title": "Convert 90.5 millimeters to centimeters.",
      "content": "Convert 90.5 millimeters to centimeters. This problem asks you to find the equivalent centimeter amount for a value provided in millimeters. You can do so by dividing the original millimeter value by 10. Alternatively, you can shift the decimal point in the original millimeter value one place to the left. Mathematical Conversion: 90.5 mm / 10 = 9.05 cm Decimal Shift: 90.5 mm => shift the decimal to the left once => 9.05 cm"
    },
    {
      "title": "Convert 72.6 centimeters to millimeters.",
      "content": "Convert 72.6 centimeters to millimeters. For this problem, you'll need to find the equivalent millimeter value of a number currently described in centimeters. Accomplish this by either multiplying the centimeter value by 10 or by shifting its decimal point one place to the right. Mathematical Conversion: 72.6 cm * 10 = 726 mm Decimal Shift: 72.6 cm => shift the decimal to the right once => 726 mm"
    },
    {
      "title": "Convert 315 millimeters to centimeters.",
      "content": "Convert 315 millimeters to centimeters. This problem instructs you to change the value of a number provided in millimeters to its equivalent in centimeters. Divide the original millimeter value by 10 to accomplish this task, or simply shift the decimal point one place to the left. Mathematical Conversion: 315 mm / 10 = 31.5 cm Decimal Shift: 315.0 mm => shift the decimal to the left once => 31.5 cm"
    }
  ]
}