{
  "url": "https://www.wikihow.com/Reduce-Stress-Before-Giving-a-Speech",
  "title": "How to Reduce Stress Before Giving a Speech",
  "steps": [
    {
      "title": "Pick a topic you are interested in.",
      "content": "Pick a topic you are interested in. If you can, pick a subject you enjoy. Speak on topics you know well. Even if you are delivering dreary statistics about last year's crop failure, put something of yourself into your speech by explaining why you are interested in the topic. Practice and preparation are easier if your subject matter is important or enjoyable to you. [1] X Research source If you think your material is interesting and meaningful, your audience will catch your enthusiasm and appreciate your sincerity. For instance, if you are interested in a complex scientific theory, your enthusiasm can make a speech about this theory more engaging and can clarify why the theory is important for an audience."
    },
    {
      "title": "Become an expert on your subject.",
      "content": "Become an expert on your subject. It's important to know your topic well when you are giving a speech. If not, you could get embarrassed in front of the audience if your content is not correct. Also, if you don't know your subject well, you could be asked questions after the speech that you can't answer. [2] X Research source When researching your topic, its important to do preliminary work to understand the basic subject overall but then focus in on a specific subject you can talk about. For instance, if you may want to talk about Shakespeare's plays you should know general information about them overall but you should narrow your focus to 1 or 2 of his plays for your speech. Also think about questions that might be asked about your subject. Preparing answers to likely questions will make you feel more prepared, and thus less nervous. Also prepare an \"I don't know\" answer if people will be asking questions. You can say something like, \"That is a great question. I'll look into that.\""
    },
    {
      "title": "Write your speech early.",
      "content": "Write your speech early. If you are nervous about giving a speech, it may be tempting to procrastinate and wait until the last minute to write it. However, giving yourself time to edit and practice the speech will help you overcome your nervousness. [3] X Research source If you are giving a short speech in class, consider writing it a week ahead of time. This will give you a few days to edit it and a few days to practice the final draft. If you are giving a long speech in front of hundreds of people, such as an hour long lecture, you should begin writing your speech several weeks before you are set to give it. Depending on your subject, if you write your speech in advance, be sure to look for updates on the material that come after you write your speech but before you deliver it so you information is up to date."
    },
    {
      "title": "Practice the speech out loud.",
      "content": "Practice the speech out loud. Practicing will help you smooth out the speech so the language and ideas flow well and will help make the speech sound like second nature. If you practice enough times, it will minimize your nervousness and give you confidence in your ability to give the speech compellingly. [4] X Research source Practice your speech in front of another person. Having an audience will get you used to giving your speech in front of an audience. Consider setting up a camera and practice on camera. Play it back and watch it to see what you can improve or do better. It's always good to fix your problem before doing your speech!"
    },
    {
      "title": "Finalize your script.",
      "content": "Finalize your script. Don't pick the day of your speech to experiment with a new style or to change the content drastically. If you don't do the speech as you have rehearsed it, it may give you an extra reason to feel nervous in front of a crowd. [5] X Research source This is not to say that you can't make small changes, such as adding an example or 2 or changing a sentence here and there. You simply shouldn't make large substantive changes right before the speech. It may be necessary to update statistics or ideas that may have changed since you wrote the speech. However, if these changes are drastic, it may be better to address the changes at the end of your speech, depending on the topic."
    },
    {
      "title": "Put previous negative experiences",
      "content": "Put previous negative experiences behind you. Some people have speaking anxiety because of some humiliating incident of the past—often in childhood. Such events can be highly traumatizing and can cause lifelong, paralyzing fear of speaking in public. Maybe your fear isn't even a true phobia, but still relates to past flops and embarrassments. [6] X Research source Remember that all good speakers started out as not-so-good speakers. They improved because they resolved to do better the next time and they learned from their past mistakes. If a past incident is the basis of your fear, visit a therapist or counselor who specializes in phobias. Contrary to popular belief, many phobias can be cured with a lot of work and regular therapy sessions."
    },
    {
      "title": "Visualize",
      "content": "Visualize the outcome you want. Many people who fear public speaking visualize their upcoming speech as an abysmal failure and this has a negative impact on their speeches. Instead, you should visualize yourself giving the speech the way you want to. If you anticipate success, you are more likely to get it. [7] X Research source Mentally rehearse that you are speaking confidently with a smooth delivery to an appreciative audience. Hear the words coming out of your mouth in a flowing cadence. See yourself with an erect posture, breathing free and easy. By visualizing this way, you are programming your mind and body for the results you want."
    },
    {
      "title": "Push away",
      "content": "Push away negative thoughts. Each time you engage in self-doubt or you visualize a negative outcome, shake yourself out of it. Say \"STOP\" firmly to yourself. Do anything to get your mind out of the failure trap: sing, whistle, recite poetry, walk around the block, or talk to a friend. [8] X Research source You can even make those scary images seem silly and laughable by imagining your audience in clown costumes or in their underwear."
    },
    {
      "title": "Listen to relaxing or energizing music before your speech.",
      "content": "Listen to relaxing or energizing music before your speech. One of the best ways to calm your mind before a speech is to listen to music that you like. This will help calm your nerves and will get you in a good head space for your speech. [9] X Research source What specific music you listen to depends on what music you like and what type of speech you are giving. If you are giving a motivational speech, you may want to listen to music that will amp you up. If you are giving a more somber speech, such as one that describes societal problems, you may want to listen to calm music."
    },
    {
      "title": "Let go of the idea that you have to be perfect.",
      "content": "Let go of the idea that you have to be perfect. Most people are afraid of public speaking because they fear the embarrassment of making mistakes in front of others. Anxiety over mistakes only makes mistakes more likely. Even professional speakers occasionally make mistakes. The difference is that they don't consider mistakes major obstacles to success. The secret is to accept that mistakes are going to happen sometimes, and to develop the ability to recover from them quickly. One way to let go of the need for perfection is to view future mistakes as opportunities to improve."
    },
    {
      "title": "Get enough rest.",
      "content": "Get enough rest. Plan ahead and get a good night's sleep before your presentation. Being fatigued during your speech will minimize your ability to deal with the stress of giving a speech. If you have trouble falling asleep, drink some warm milk and think some pleasant, relaxing thoughts. It may also help to listen to a relaxation tape or soft music, or to do some light reading before going to sleep."
    },
    {
      "title": "Minimize other stressful events right before the speech.",
      "content": "Minimize other stressful events right before the speech. If you can, clear your calendar of stressful events that could interfere with your ability to concentrate and speak confidently and sincerely. In other words, don't schedule a job interview, a dentist visit, or a meeting with your ex-spouse's lawyer on the same day you are going to deliver that all-important speech."
    },
    {
      "title": "Avoid mood-altering substances.",
      "content": "Avoid mood-altering substances. Some people mistakenly think that drinking lots of coffee or alcohol, smoking cigarettes, or popping a tranquilizer before speaking will improve their delivery. However, mood-altering substances are a crutch you don't need. It's best to avoid these substances altogether so that you can use all of your mental abilities to get through the speech. [10] X Research source One problem with taking mood-altering substances before a speech is that you can't necessarily regulate the dosage. You don't know how much is too much and, once it is in your bloodstream, there is little you can do about it. Your relaxation may turn to sluggishness. Your pep may turn to jitters."
    },
    {
      "title": "Exercise moderately to calm your nerves.",
      "content": "Exercise moderately to calm your nerves. If you have excess energy before your speech, you can get a little of it out by exercising. Do a light workout that gets rid of some of your excess energy but doesn't exhaust you completely. [11] X Research source For example, you could do a gentle yoga class or go for a walk a few hours before your speech to get you relaxed and ready."
    },
    {
      "title": "Look your best.",
      "content": "Look your best. Take some time to pick an outfit that is both comfortable and professional. Polish your shoes and comb your hair. Wear attractive, flattering, professional-looking clothing. When you look good and are comfortable, it will help you feel confident. [12] X Research source If you aren't sure what looking good is all about, talk to friends and family members that have good style. Talk to them about the colors and styles that look best on you. If you are giving a very important speech, you can hire an image consultant or a stylist to tell you what to wear. A good image consultant can tell you how to look fantastic without spending a fortune."
    },
    {
      "title": "Eat healthy",
      "content": "Eat healthy and lightly before your speech. On the morning of your speech, eat something healthy that will keep your energy up throughout the day. Then eat lightly, or not at all, starting 1 hour before speaking. A full stomach can lower your energy level and concentration, because your body is busy digesting food. However, you don't want to be starving when you give your speech either. [13] X Research source Don't drink soda or other drinks that could make you jittery or make your energy crash right before your speech. Carbonated beverages can also give you dry mouth, which can make it hard to give your speech. Any nervousness can make digestion difficult. You don't want a belch or a gurgling stomach interrupting your speech."
    },
    {
      "title": "Take a moment to calm yourself if you need it.",
      "content": "Take a moment to calm yourself if you need it. If you walk out to give the speech and you are too nervous to speak, give yourself a second to calm down. Also, if you start to speak and your voice is shaky, take a pause. Clear your throat, take a drink of water if it's available, and focus your mind on your speech. Taking a moment to get in the right head space will help you get through the whole speech. [14] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source It is much better to take a moment to calm yourself than to continually struggle through the speech. You can even walk up to your speaking location early to give your nerves time to calm down."
    },
    {
      "title": "Remember to breathe.",
      "content": "Remember to breathe. Anxiety tightens the muscles in the chest and throat. As you approach the platform, take a deep breath and relax. With a restricted airway and without enough oxygen, your voice can come out as a whisper or a squeak. Deep breathing, on the other hand, sends oxygen to the lungs and brain and expands the throat and chest, promoting relaxation. [15] X Trustworthy Source Go Ask Alice Medical advice site with content written by health promotion specialists affiliated with Columbia University Go to source Throughout the speech, take a moment to breathe every once in a while. Mark moments when you should breathe in your script if necessary. After every few paragraphs include the word \"Breathe,\" so that you are reminded to do it."
    },
    {
      "title": "Focus on friendly faces.",
      "content": "Focus on friendly faces. While speaking, maintain eye contact with your listeners. Find friendly faces and focus on them. Smiles and approving nods will give you extra encouragement. [16] X Research source Try focusing on someone in the back of the room. This has a calming effect on some speakers. It feels weird, but it doesn't look weird. If you can't see anyone's face, due to bright lights or a dark room, pick several spots out in the crowd and look at them in turn throughout the speech. This will help keep you from looking down at your page or screen throughout the speech. If there is a microphone and you can't see people's faces, try pretending the microphone is the only person in the room. Forget that the audience is looking at you and focus on speaking into the microphone."
    },
    {
      "title": "Don't dwell on mistakes if they happen.",
      "content": "Don't dwell on mistakes if they happen. The way to recover from a mistake is to observe it dispassionately, take whatever corrective action is appropriate, and regain your composure. Focus on what to say next and get on with the speech. Dwelling on an error and feeling bad about it only adds to your confusion and nervousness. It's okay to forget a line or 2 in your speech. No one's going to eat you up or yell at you. Just continue with what you know, no one in the audience knows the content of your speech."
    }
  ]
}