{
  "url": "https://www.wikihow.com/Connect-an-Xbox-360-Headset",
  "title": "How to Connect an Xbox 360 Headset",
  "steps": [
    {
      "title": "Turn the headset volume all the way down.",
      "content": "Turn the headset volume all the way down. This will help prevent hearing damage when you first put it on."
    },
    {
      "title": "Plug the headset into your controller.",
      "content": "Plug the headset into your controller. There is a jack on the bottom of the controller in the center. Plug the headset into this jack."
    },
    {
      "title": "Put your headset on.",
      "content": "Put your headset on. When you start playing a game, slowly turn the volume up until it is at a comfortable level. The headset is only for voice chat, no game sound or music will be transferred through the headset."
    },
    {
      "title": "Troubleshoot a nonworking headset.",
      "content": "Troubleshoot a nonworking headset. If the headset doesn't work, it may be faulty or the connection port may be dirty. Ensure that the cables are not frayed, and that there is no dirt on the connector. You can use a cotton swab and rubbing alcohol to clean the port."
    },
    {
      "title": "Charge the headset before using it.",
      "content": "Charge the headset before using it. Plug the charging cable into the port on the headset. Connect the other end to the USB port on your Xbox 360. Your Xbox 360 will need to be turned on in order to charge the headset. If you have the AC power adapter, you can use that to charge the headset instead. The headset will not work while it is charging. When the headset is fully charged, all four lights on it will blink simultaneously. This may take a couple hours."
    },
    {
      "title": "Turn on the console and the headset.",
      "content": "Turn on the console and the headset. Turn the 360 on, and press the power button on the headset. Press the Connect button on your Xbox 360 console, and then press and hold the Connect button on the headset for two seconds. The headset will connect to both the console and a controller. The lights on the headset will indicate which controller it is assigned to. You can change the controller it is connected to by pressing the Connect button on the headset."
    },
    {
      "title": "Mute the headset.",
      "content": "Mute the headset. Press and hold the power button to mute the headset. The headset will beep twice whenever the mute settings are changed."
    },
    {
      "title": "Adjust the volume.",
      "content": "Adjust the volume. Press the \"+\" and \"-\" buttons to adjust the volume of the headset."
    },
    {
      "title": "Update your Xbox 360.",
      "content": "Update your Xbox 360. You will need the latest version of the Xbox 360 operating system in order to use the Bluetooth headset. See this guide for details on updating your Xbox 360."
    },
    {
      "title": "Charge the headset.",
      "content": "Charge the headset. Plug the charging cable into the port on the Bluetooth headset. Connect the other end to the USB port on your Xbox 360. Your Xbox 360 will need to be turned on in order to charge the headset. Once the lights stop flashing, the charging is complete. Charging your headset will connect it to the Xbox 360 at the same time."
    },
    {
      "title": "Wirelessly connect your headset.",
      "content": "Wirelessly connect your headset. If you didn't plug the headset in to the Xbox 360 to charge, you can connect wirelessly. Once connected, it will automatically connect every time it is in range and in Xbox mode. Toggle the switch on the side of the headset so that the green color is displayed. This will enable Xbox mode for the headset. Press and hold the Power button for two seconds. The light on the headset will flash green. After you hear the headset startup, press and hold the Connect button on the headset for two seconds. Press and release the Connect button on the Xbox 360 within 20 seconds. The headset lights will flash three times."
    },
    {
      "title": "Change the assigned controller.",
      "content": "Change the assigned controller. The headset will connect to both the console and a controller. The lights on the headset will indicate which controller it is assigned to. You can change the controller it is connected to by pressing the Power or Connect button on the headset. [1] X Research source"
    }
  ]
}