{
  "url": "https://www.wikihow.com/Clean-a-Dehumidifier",
  "title": "How to Remove Mold from a Dehumidifier's Tank and Clean the Filter",
  "steps": [
    {
      "title": "Disconnecting power prevents you from getting shocked while cleaning.",
      "content": "Disconnecting power prevents you from getting shocked while cleaning. Use the Power button to turn your dehumidifier off. If your dehumidifier turns on when you’re cleaning the components, it could also get damaged since it isn’t running properly. [1] X Research source Most dehumidifiers will beep if you start taking it apart while it’s still on. Clean your dehumidifier once every 2 weeks so dust and dirt doesn’t buildup. It’ll only take an hour at max to clean it completely."
    },
    {
      "title": "Cleaning dust off the surface stops it from getting on internal components.",
      "content": "Cleaning dust off the surface stops it from getting on internal components. Run a dry microfiber cloth over the exterior of your dehumidifier to clean it. If there are any stubborn spots or scuff marks, get a corner of the cloth damp and gently scrub the area until it’s clean. [2] X Research source Avoid using water directly on your dehumidifier since you could damage the electronic components."
    },
    {
      "title": "Vacuuming gets dust and dirt out from inside your dehumidifier.",
      "content": "Vacuuming gets dust and dirt out from inside your dehumidifier. The air intake is the grate on the front or back of your dehumidifier. Hold the vacuum hose against the intake opening and slowly move it back and forth over the area. Run the vacuum over the intake about 2 times to loosen and remove the dust buildup inside. [3] X Research source Using a vacuum also helps keep the coils clean so they aren’t as dusty."
    },
    {
      "title": "Old water in the tank could harbor mold or mildew.",
      "content": "Old water in the tank could harbor mold or mildew. Check the dehumidifier’s display for a lit light or icon signaling that the tank is full. Carefully pull the tank out from the bottom of your dehumidifier and take it to a tub or sink. Slowly pour out the water until it’s completely drained. [4] X Research source If your dehumidifier has a hose that runs to a drain, then it won’t have a tank to empty or clean."
    },
    {
      "title": "A quick cleanse with dish soap will kill any bacteria inside the tank.",
      "content": "A quick cleanse with dish soap will kill any bacteria inside the tank. Fill the bottom of the tank with water and add in a few drops of mild dish soap. Shake the tank around so the soap and water splash against the sides and clean off any residue that’s on the surface. Swish the water for a couple of minutes before pouring it out down the sink. Fill the tank up with clean water and swish it around to get rid of all the suds and residual cleaner. [5] X Research source For extra cleaning power against mold and mildew, try a mix that’s equal parts white vinegar and warm water. Let the mixture soak in the tank for up to 1 hour before dumping it out. Dry the outside of the tank with a clean towel and let the inside air-dry completely. [6] X Research source"
    },
    {
      "title": "The air filter is typically behind the grate on the dehumidifier’s exterior.",
      "content": "The air filter is typically behind the grate on the dehumidifier’s exterior. How you access the filter varies between models. If you see a handle or tab on the top of the filter, gently pull it up and away from your dehumidifier. If you can’t see the filter, then pull out the water tank from the bottom of the dehumidifier. Check the top of the opening for the filter tab so you can pull it out. [7] X Research source Insignia and Frigidaire dehumidifiers have air filters in the back behind a grate that pops out. Certain LG models have filters that you can only access once you remove the tank. The air filter looks like a rectangular plastic frame with mesh netting to catch dust and dirt. Avoid using your dehumidifier without a filter since you could damage the internal components."
    },
    {
      "title": "Cleaning out the filter helps clear out blockages in your dehumidifier.",
      "content": "Cleaning out the filter helps clear out blockages in your dehumidifier. Use the brush attachment on your vacuum and run the bristles over the filter. [8] X Research source If it’s really dirty, wet a clean cloth with warm water and lather in a few drops of mild dish soap. Wet the filter with warm water and wipe it clean to remove all the stubborn debris. Rinse the filter with cold water and set it in a well-ventilated place to let it air-dry completely. [9] X Research source Alternatively, you can clean the filter in a mixture that’s equal parts white vinegar and warm water. Leave it to soak for 15 minutes to an hour depending on how much buildup you have. Be careful not to press the vacuum too hard against the filter so you don’t break through it. Avoid putting the filter in your dishwasher since it will get damaged."
    },
    {
      "title": "Dust on the coils stops them from working efficiently.",
      "content": "Dust on the coils stops them from working efficiently. The coils are straight metal pieces that are usually behind the filter or grate on your dehumidifier. If you’re able to remove the grate or front cover on your dehumidifier, carefully pull it off. Move your cleaning brush parallel to the direction of the coils to get rid of the dust and dirt. [10] X Research source The metal coils can be sharp, so avoid touching them. Alternatively, spray a coil cleaner onto the coils. This cleaner foams up and doesn’t require you to rinse or wipe it off afterward. [11] X Research source"
    },
    {
      "title": "Letting the components dry ensures the dehumidifier runs smoothly.",
      "content": "Letting the components dry ensures the dehumidifier runs smoothly. If you washed any pieces of your dehumidifier, let them air-dry completely. When it’s dry, slide the filter back into the slot on your dehumidifier. If you had to remove the tank to access the filter, reattach it as well before you turn your dehumidifier back on again. [12] X Research source"
    }
  ]
}