{
  "url": "https://www.wikihow.com/Make-Alcohol-Wipes",
  "title": "How to Make Alcohol Wipes",
  "steps": [
    {
      "title": "Use a roll of paper towels if you want to make disposable wipes.",
      "content": "Use a roll of paper towels if you want to make disposable wipes. Regular 2-ply paper towels with perforations are perfect for this project, since you can easily tear away 1 wipe at a time. If you plan on cleaning up tough messes, go with 3-ply paper towels. [1] X Research source Avoid 1-ply paper towels—they tend to disintegrate once they get wet. [2] X Research source"
    },
    {
      "title": "Go with washable cotton cloths if you prefer a reusable option.",
      "content": "Go with washable cotton cloths if you prefer a reusable option. If environmental and waste issues are a concern to you, use plain cotton wash clothes instead of single-use paper towels. You can still store cotton cloths in the cleaning solution—just be sure to wash the wipes after each use. [3] X Research source If you have large pieces of cotton or old T-shirts, cut them into 8 inches (20 cm) squares for this project. They don’t have to be perfectly square, but try to make them uniform in size. Extra thin washcloths are preferable for this. Cheese cloths are also a great option."
    },
    {
      "title": "Buy a tall, rectangular plastic container with a lid for an easy solution.",
      "content": "Buy a tall, rectangular plastic container with a lid for an easy solution. You’ll need a 4-quart (3.8 liters) container to hold the full length of paper towel roll, but you don’t have to use this size. You can easily slice through a paper towel roll with a serrated knife to cut it down to size, if needed. A flip-top is the most convenient option, but it's not required—a regular airtight lid works just fine. [4] X Research source The container does not have to be a cylinder. A roll of paper towels will conform to a rectangular shape. For cotton cloths, get a container that holds at least 1 US-quart (950 ml) (0.9 liters). [5] X Research source You can use square plastic containers for this! Just pull the individual paper towels off the roll before you store them."
    },
    {
      "title": "Try a large glass container with an airtight lid if you don’t use plastic.",
      "content": "Try a large glass container with an airtight lid if you don’t use plastic. If you’re using cotton cloths to make your wipes, select a glass jar that can hold at least 1 US-quart (950 ml) (0.9 liters). Go with a 2-quart (1.9 liters) minimum if you’re using paper towels so you can fit at least half of a paper towel roll in there. Keep in mind that the lid has to be airtight to preserve your wipes. [6] X Research source"
    },
    {
      "title": "Go with zip-top baggie for a convenient and portable option.",
      "content": "Go with zip-top baggie for a convenient and portable option. Freezer bags are the most durable option, but regular plastic baggies work just fine as long as they can be zipped closed completely. You can easily tuck these smaller packets into your bag or in the car when you’re on the go. [7] X Research source Separate the paper towels and take them off the roll if you go this route."
    },
    {
      "title": "Mix the warm water, isopropyl alcohol, and dish soap in a bowl.",
      "content": "Mix the warm water, isopropyl alcohol, and dish soap in a bowl. Measure out 2 cups (470 ml) of warm water, 1 cup (240 ml) of isopropyl alcohol, and 1 tablespoon (15 ml) of dish soap and dump them all in a medium-sized bowl. Stir the ingredients with a spoon until they’re full incorporated. [8] X Research source Use at least 70% isopropyl alcohol for the most effective disinfectant properties. Filtered tap water is fine for this. You might want to use distilled water if you don't think you’ll use up your wipes within a few months. [9] X Research source"
    },
    {
      "title": "Add 10 drops of essential oil for scent and antibacterial properties, if desired.",
      "content": "Add 10 drops of essential oil for scent and antibacterial properties, if desired. You can use any essential oil you like if scent is your only concern. If you want extra germ-busting power, go with lemon, orange, tea tree, lavender, or peppermint essential oil. You can use 1 essential oil or try a custom combination. [10] X Research source Essential oil is really concentrated, so avoid using more than 10 drops. For a strong antibacterial wipe, try mixing tea tree and myrrh oils."
    },
    {
      "title": "Place the wipes into your chosen storage container.",
      "content": "Place the wipes into your chosen storage container. If you need to trim down a roll of paper towels to fit into the container, turn the roll on its side and slice through it with a serrated knife. Then, slide the roll vertically into the tall plastic container. For cotton cloths or individual paper towels, simply stack them inside the container. You can also roll up the cotton clothes before putting them in the container if you prefer. [11] X Research source"
    },
    {
      "title": "Pour the cleaning solution over the wipes to saturate them.",
      "content": "Pour the cleaning solution over the wipes to saturate them. Lift the bowl and slowly dump the cleaning solution directly on top of the wipes. The absorbent cloths will start to soak up the solution immediately. Don't pour too fast or the container may overflow! [12] X Research source You can knead or press down on the wipes to help them soak up the solution faster, if you like."
    },
    {
      "title": "Pull out the cardboard roll if you’re using paper towels.",
      "content": "Pull out the cardboard roll if you’re using paper towels. The paper towels will soften and pull away from the cardboard roll in the center once they’re fully saturated. You can just reach in, pinch the roll, and pull it out of the container. The wipes will hold their shape without the support of the cardboard. [13] X Research source The cardboard will start to disintegrate over time, so don't forget this step. Close the container lid tightly when you’re done."
    },
    {
      "title": "Keep the airtight lid closed so the wipes don’t dry out.",
      "content": "Keep the airtight lid closed so the wipes don’t dry out. Alcohol dries quickly when it’s exposed to oxygen, so make sure the airtight lid is secure before storing your wipes. Try to avoid leaving the lid off for extended periods when you’re using the wipes, as well. Quickly grab 1 or 2 wipes at a time and close the container immediately. [14] X Research source"
    },
    {
      "title": "Grab the innermost wipe and pull up to remove it from the container.",
      "content": "Grab the innermost wipe and pull up to remove it from the container. If you used a paper towel roll, pull out individual wipes starting in the center of the roll and work your way out. The perforations make it easy to pluck out 1 paper towel at a time. [15] X Research source If you used cotton cloths or individual paper towels, grab the wipe on top."
    },
    {
      "title": "Use your wipes on hard surfaces to clean and disinfect them.",
      "content": "Use your wipes on hard surfaces to clean and disinfect them. Alcohol kills germs, so you can use your wipes to clean up messes and disinfect hard surfaces, like countertops and tile. Avoid using your wipes on fabric or delicate materials, since alcohol can be very harsh and may cause damage. [16] X Research source"
    }
  ]
}