{
  "url": "https://www.wikihow.com/Buy-an-iTunes-Gift-Card-Online",
  "title": "How to Buy an iTunes Gift Card Online",
  "steps": [
    {
      "title": "Go to https://www.apple.com/shop/gift-cards.",
      "content": "Go to https://www.apple.com/shop/gift-cards . You can use either a mobile or desktop browser to purchase a gift card from Apple's online store. [1] X Research source"
    },
    {
      "title": "Click or tap Email a gift card.",
      "content": "Click or tap Email a gift card . You'll most likely have to scroll down to find this near the bottom of the page under the header, \"App Store & iTunes Gift Cards by Email.\""
    },
    {
      "title": "Click or tap to select a design for the gift card.",
      "content": "Click or tap to select a design for the gift card. You have the opportunity to match your gift card to the occasion, such as a birthday, instead of using the default blue card."
    },
    {
      "title": "Enter a gift card amount next to the value header.",
      "content": "Enter a gift card amount next to the value header. You can enter a value between $10.00 and $200.00."
    },
    {
      "title": "Enter information for the email.",
      "content": "Enter information for the email. You'll need to enter the recipient's name and email address as well as your name and email address and an optional message."
    },
    {
      "title": "Click or tap Add to Bag.",
      "content": "Click or tap Add to Bag . You'll see this blue button in the top right corner of your browser window."
    },
    {
      "title": "Click or tap Check Out.",
      "content": "Click or tap Check Out . After you've reviewed the purchase summary, you can click or tap Check Out to continue. If you're not logged in with your Apple ID, you'll be prompted to log in or continue as a guest. If you log in, you'll be able to use any saved or previous payment methods; however, if you continue as a guest, you won't be able to use any pre-saved payment methods or save your current payment method."
    },
    {
      "title": "Click or tap Place Your Order.",
      "content": "Click or tap Place Your Order . Your gift card will be sent immediately and you'll receive an email confirmation of the purchase. [2] X Research source"
    },
    {
      "title": "Go to https://www.amazon.com/ in a web browser.",
      "content": "Go to https://www.amazon.com/ in a web browser. You can use a desktop or mobile web browser to purchase an iTunes gift card. If you're not already signed into your account, sign in now."
    },
    {
      "title": "Search for Digital iTunes Card.",
      "content": "Search for Digital iTunes Card . You'll find the search bar at the top of the page."
    },
    {
      "title": "Click or tap the App Store & iTunes card with the value you want.",
      "content": "Click or tap the App Store & iTunes card with the value you want. You'll see a list of different iTunes gift cards with different amounts in your search results and be able to select one to continue. If you don't see a card with the amount you want, select the option with a value range (e.g., $25 - $100)."
    },
    {
      "title": "Pick a card design (if applicable).",
      "content": "Pick a card design (if applicable). You have the opportunity to match your gift card to the occasion, such as a birthday, instead of using the standard blue card. If you selected a specific card from the search results, you may not have the ability to change the card design."
    },
    {
      "title": "Select a card amount (if applicable).",
      "content": "Select a card amount (if applicable). If you didn't select a specific card from the search results, you have the chance to select a value for the gift card here. You can either select an amount from the listed amounts or you can select Enter amount to enter a value that is not listed. If you selected a specific card from the search results, you may not have the ability to change the gift card's value."
    },
    {
      "title": "Enter information for the email.",
      "content": "Enter information for the email. You'll need to enter the recipient's name and email address as well as your name and email address and an optional message. You can also choose a delivery date for the email and gift card."
    },
    {
      "title": "Click or tap Add to cart.",
      "content": "Click or tap Add to cart . You'll see this on the right side of the page."
    },
    {
      "title": "Click or tap Proceed to checkout.",
      "content": "Click or tap Proceed to checkout . You'll see this in the top right corner of the page."
    },
    {
      "title": "Enter your billing and shipping information (if prompted).",
      "content": "Enter your billing and shipping information (if prompted). Even though you are ordering a digital gift card, you may be prompted to enter shipping information."
    },
    {
      "title": "Click or tap Place your order.",
      "content": "Click or tap Place your order . You'll see this on the right side of the page along with a breakdown of your purchase."
    },
    {
      "title": "Open iTunes.",
      "content": "Open iTunes. If you're using macOS Catalina, you can skip this method; only Windows and macOS Mojave and older users still have access to iTunes. If you don't have iTunes and you're using a Windows computer, you can download the application for free from https://www.apple.com/itunes/ . You'll find this application in the Start Menu or in the Applications folder of Finder."
    },
    {
      "title": "Click Store.",
      "content": "Click Store . You'll see this centered in the top-half of the iTunes application window with Library , For You , and Browse ."
    },
    {
      "title": "Click Send Gift.",
      "content": "Click Send Gift . You'll see this on the right side of the window under the header \"Music Quick Links.\""
    },
    {
      "title": "Enter the recipient's email address in the \"To\" text field.",
      "content": "Enter the recipient's email address in the \"To\" text field. The iTunes and App Store gift card will be sent to that email address. Fill out the rest of the text fields, like the recipient's name and a message that will be included with the gift card email."
    },
    {
      "title": "Click to select the amount of the gift card.",
      "content": "Click to select the amount of the gift card. When you're done filling out the information on the left side of the screen, you'll be able to move on to the next side, where you can pick the gift card amount. If you don't want any of the choices available, click Other to be able to enter an amount."
    },
    {
      "title": "Click to select a delivery date.",
      "content": "Click to select a delivery date. You can either send the gift card now, or you can choose a different date. For instance, if your friend's birthday is next month, you can have the gift card delivered in a month."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . You'll see this in the bottom right corner of the window."
    },
    {
      "title": "Click to select a theme.",
      "content": "Click to select a theme. You can choose from a variety of color schemes and font styles for the gift card and email to adhere to. Click through them all and you'll see a preview of that theme displayed to the right. A blue checkmark will indicate which theme you have selected."
    },
    {
      "title": "Click Next.",
      "content": "Click Next . You'll see this in the bottom right corner of the window. If you see a larger preview of your email, click Next again to continue."
    },
    {
      "title": "Click Buy Gift.",
      "content": "Click Buy Gift . When you see a purchase confirmation and receipt of your gift card, you'll be able to click Buy Gift . If you're not logged into an Apple ID, you'll be prompted to log in or continue as a guest. Depending on your previous selection, the gift card will either send immediately or wait until a delivery date. You'll also receive an email confirmation for the purchase."
    }
  ]
}