{
  "url": "https://www.wikihow.com/Do-Automatic-Writing",
  "title": "How to Do Automatic Writing",
  "steps": [
    {
      "title": "Decide on a medium.",
      "content": "Decide on a medium. Do you want to use a computer for your automatic writing session or do you want to use pen/pencil and paper? This is completely based on your personal preference. Some would argue that pen and paper is the only good way to use automatic writing, but if you can type faster than you can write (and you're more comfortable with it), it may be more helpful to use a computer. You can also try out each medium to see which one you prefer, or you can change between the two if you like."
    },
    {
      "title": "Give yourself a question or topic that you want to write about.",
      "content": "Give yourself a question or topic that you want to write about. If you are practicing automatic writing to improve your creativity, or to help yourself get started on a writing assignment, then it will be helpful to have a prompt of some sort. You could, for example, write about something that has been on your mind a lot lately, or about a dream you had recently that stands out in your mind. Perhaps a problem you have, or something you are excited about. Maybe you have an idea for a story in mind, in which case you can use that as your topic. If you haven't quite fleshed out in your mind all the details of the story you'd like to write, you can simply write about all the different ideas and pieces of the story that you do have. You could, for example, answer the “5 W's” about your topic. That is, Who? What? When? Why? How? [2] X Research source Or you could just have the topic you want to write about in mind."
    },
    {
      "title": "Set a timer.",
      "content": "Set a timer. 10 minutes should be a good starting point. Setting a timer will help you avoid wondering if you've been writing for long enough. Remember that 10 minutes is merely a suggested starting point. If you want to write for longer, then do so. If you set your timer for 10 minutes, but you feel like you have more to write, you should keep going until you feel that you've gotten it all out. On the other hand, you should not stop writing until the 10 minutes are up. Even if you feel that you have run out of things to write. Keep trying, and eventually your hand will write something. Remember, you can write anything, even if it's a wild tangent from your topic or only loosely related."
    },
    {
      "title": "Close your eyes if you can.",
      "content": "Close your eyes if you can. Traditionally, a key part of practicing automatic writing is to close your eyes while you write. This prevents you from thinking about something you previously wrote, or from correcting something you have written. If you feel that you will be tempted to peek at your work during this exercise, you might also consider putting on a blindfold while you work, and / or recording your thoughts (orally) on your phone or computer, for later transcription. If you find that you cannot write with your eyes closed, then do it with your eyes open, but remember that you are not allowed to stop writing to change what you have written. Do not cross anything out, do not erase, do not stop. If your mind suddenly changes directions, then simply start writing whatever it is you are thinking, even if it means starting a new sentence in the middle of a different one."
    },
    {
      "title": "Do a calming activity if you don't like closing your eyes.",
      "content": "Do a calming activity if you don't like closing your eyes. You can listen to instrumental music, meditate , or listen to a guided meditation before and/or during your automatic writing session. This will relax you and make it easier for the words to flow. You might meditate before your writing session, then listen to instrumental music while you write."
    },
    {
      "title": "Start writing.",
      "content": "Start writing. Write whatever comes in to your mind as it comes into your mind. Ideally, it will be related to your topic, but if it is unrelated, you should still write it. Pay absolutely no attention to grammar, spelling, sentence structure, style, or anything that you would normally be worried about when writing. These things are of absolutely no importance in automatic writing."
    },
    {
      "title": "Relax.",
      "content": "Relax. After you have completed a round of writing, stop your writing, and give yourself a break for a few minutes."
    },
    {
      "title": "Read what you have written.",
      "content": "Read what you have written. Now you should go back to what you have written and read through it. Don't judge yourself harshly. What you have written may not make any sense at all, and it definitely won't be pretty."
    },
    {
      "title": "Highlight or circle anything that is interesting to you.",
      "content": "Highlight or circle anything that is interesting to you. As you are reading, you may find things that you find particularly interesting. You should make note of these by highlighting them or circling them to come back to. Using these ideas, you can complete another round of automatic writing, if you feel that you want to continue the exercise."
    },
    {
      "title": "Continue with your writing.",
      "content": "Continue with your writing. If, after using automatic writing you feel that you are ready to move on to the next step in your writing process, then do so. On the other hand, if you feel that you have moved forward, but still haven't gotten what you wanted out of the exercise, feel free to repeat as often as necessary."
    },
    {
      "title": "Find a place that is free of distraction.",
      "content": "Find a place that is free of distraction. You will need a comfortable place, where you won't be interrupted in order to use automatic writing in a more spiritual way. You do not have to do this exercise for any particular amount of time, so there is no need to set a timer. However, some recommend setting aside 30-45 minutes to do your writing."
    },
    {
      "title": "Decide on how you will write.",
      "content": "Decide on how you will write. Are you more comfortable writing with pen and paper, or do you prefer typing on a computer? This is completely based on your personal preference. While there are those that argue that it is best to use pen and paper, you should generally stick to what you are more comfortable doing. If you're not sure how you want to do it, try doing it both ways and choose whichever is more comfortable for you. If you use a computer, use whatever word processor you most typically use (e.g. Microsoft Word, NotePad, TextEdit on Mac, etc.)"
    },
    {
      "title": "Clear your mind.",
      "content": "Clear your mind. Do your best to clear your mind of all thoughts, for example, about things you have to do later in the day, things you are worried about, etc. [3] X Research source If you are particularly stressed, upset, angry, or worried about something, then put off your session for another time. It will be difficult to clear your mind if you have a big issue you are focused on. Take a few deep breaths, try focusing on the air going in and out of your nostrils, and how it feels. Is it cold going in and warm going out? Is it shallow or deep? Clearing your mind is a skill that you must practice. As you practice more, you will improve."
    },
    {
      "title": "Call on the entity you wish to channel.",
      "content": "Call on the entity you wish to channel. This might be “spirit guides”, “angels”, or “my higher self”, for example. If you wish to do this, you can do it by praying to them or through meditation. Some suggest that this is a good idea, while others leave it out altogether. Do what feels right for you."
    },
    {
      "title": "Close your eyes.",
      "content": "Close your eyes. Keeping your eyes closed will allow you to let your mind communicate more directly with your hand(s), and keep you from judging what is coming out on the paper or screen. For this method, it is absolutely imperative that you have your eyes closed. If you feel afraid to close your eyes, then focus your eyes on the wall in front of you. Although you may end up with nothing more than marks on a page, you will improve with time. If the entity you are channeling wishes to write words and sentences, then they will do so."
    },
    {
      "title": "Put your pen to the paper.",
      "content": "Put your pen to the paper. If you are using a computer, put your hands on the keyboard as though you were about to type something."
    },
    {
      "title": "Let your hands do what they want.",
      "content": "Let your hands do what they want. Type, write, or draw whatever comes into your mind. If you are using paper, this may mean drawing symbols or doodles. If you want to have questions answered when channeling entities, you can also do this. Begin by writing down the question you want answered, and then letting your hand freely guide you to the answer. Don't try to interpret anything that you are drawing, writing, or typing as it is happening. Simply let it happen. Your mind may try to come back into control, but do your best to simply let the thoughts flow freely. Only you will be able to know when an automatic writing session is over. Keep going for as long as it feels comfortable, and stop if/when it begins to feel negative or uncomfortable. [4] X Research source"
    },
    {
      "title": "Take a deep breath.",
      "content": "Take a deep breath. When you are finished with your session, take a few deep breaths to come back to yourself. If you wish, you can thank the entity you have channeled."
    },
    {
      "title": "Look over what you have written.",
      "content": "Look over what you have written. At this point, you can see what has come out on the page/screen. Hopefully you find something that makes sense for you. If not, try not to worry. Put it away for the day, and try again tomorrow. This is a skill that takes a lot of practice. Remember that even if you are not able to achieve the result you desire, automatic writing is still great for strengthening your creativity."
    },
    {
      "title": "Keep copies of the writings.",
      "content": "Keep copies of the writings. Over time, you may see patterns, ongoing messages or other connections that are worth piecing together."
    }
  ]
}