{
  "url": "https://www.wikihow.com/Make-a-Tornado-Omelette",
  "title": "How to Make a Tornado Omelette",
  "steps": [
    {
      "title": "Beat the eggs together in a bowl.",
      "content": "Beat the eggs together in a bowl. Whisk until smooth or until there are no strands left when you lift the fork from the mix. Season the eggs with a pinch of salt and pepper for a better and more rich taste if you wish. To get a more silky texture, consider using a sieve after beating the eggs."
    },
    {
      "title": "Pour a small amount of vegetable oil into the pan.",
      "content": "Pour a small amount of vegetable oil into the pan. Heat the pan at medium to high heat until it gets hot. Make sure the pan is hot not warm or your whirl might not look like one. You can substitute the vegetable oil by using some butter instead. Using a non-stick pan might be better."
    },
    {
      "title": "Pour all the egg mixture into the pan.",
      "content": "Pour all the egg mixture into the pan. Wait a few seconds or until the egg coagulates and forms a thin but solid base. You have to time this perfectly as you can't do a whirl if you wait too long or too short"
    },
    {
      "title": "Bring the egg in.",
      "content": "Bring the egg in. Bring the rim of the egg from two opposite sides of the pan using the chopsticks and drag them to the middle of the pan but make sure to keep the chopsticks apart. When dragging the chopsticks to the middle, put them about 3 centimetres (1.2 in) apart from each other so you can turn them easily."
    },
    {
      "title": "Make a whirl using the chopsticks.",
      "content": "Make a whirl using the chopsticks. Start turning the chopsticks slowly in a circle. While doing this, make sure to keep the chopsticks about 3 centimetres (1.2 in) apart from each other the whole time. After a while, the egg will start looking like a vortex. Jiggle the pan a bit while rotating the chopsticks to make it easier. You can turn the pan instead of turning your chopsticks."
    },
    {
      "title": "Remove the egg before it is fully cooked.",
      "content": "Remove the egg before it is fully cooked. This will ensure that it has a slightly moist texture. The residual heat will continue cooking the egg. Season with more pepper if desired. You should serve the dish immediately. The egg is best served with rice or curry."
    }
  ]
}