{
  "url": "https://www.wikihow.com/Get-Rid-of-Saddlebags",
  "title": "The Best Ways to Reduce Saddlebags & Lose Fat",
  "steps": [
    {
      "title": "Know that you can't really spot reduce.",
      "content": "Know that you can't really spot reduce. It's not what you want to hear, but it has to be said. While you can tone up those thighs and hips of yours, that fat will still be there. So doing leg lift after leg lift won't get you the results you want -- it has to be a combination of diet, fat burning, and toning. We wish it weren't so, but it is! Everybody's body is a bit different. Some start losing fat on top, some on bottom, some on their core, some on their extremities. In other words, this may take some patience. You may see your stomach shrinking before your thighs. If that becomes the case, relax and take a breath. You're on the right track."
    },
    {
      "title": "First, burn away the fat",
      "content": "First, burn away the fat . This is goal one. To get to those svelte thighs of yours underneath those saddlebags, that fat needs to be blasted away. The most efficient way of doing that? Cardio. No ifs, ands, or buts about it. 4 or 5 times a week for at least 30 minutes is ideal, but it can be broken up into smaller bits, too. Cardio takes on dozens of different forms, not just running! You can get on the elliptical, go for a bike ride, walk, swim, box, play tennis, heck, even go dancing! As long as your heart gets pumping, it's good. If long workouts aren't your thing, take solace in high-intensity interval training. It actually has shown to burn more calories in a shorter amount of time. So take 15 minutes on the treadmill (or wherever) alternating between walking and sprinting. Your heart will even keep pumping afterward, burning calories by itself! [1] X Research source"
    },
    {
      "title": "Then, build muscle",
      "content": "Then, build muscle . Once you get rid of the fat, you gotta work on what's underneath it -- or you'll just end up with that unfortunate \"skinny fat\" look. So after, before, or at a completely different time than your cardio, start pumping that iron. If dumbbells aren't your cup o' tea, you can use your own body to strengthen and tone itself. Planks, squats, lunges, burpees -- they'll all start firming you up. And then there's pilates and yoga -- awesome activities that will show results, too!"
    },
    {
      "title": "Keep it spicy",
      "content": "Keep it spicy . This whole workout thing gets pretty boring if you don't mix it up. And doing the same thing over and over might get you results initially, but then they stop and you end up just running around in circles, getting nowhere. To beat the body plateau and the mind numb, start cross training. In other words, do a whole bunch of different stuff! It's the best way to stay motivated, too. So take a break from the gym and hit the pool. Switch up your treadmill for the elliptical. Go on a hike, play tennis, or go rock climbing. Take a free trial class at a pilates studio, try hot yoga, or sign up for Zumba . The options are endless!"
    },
    {
      "title": "Turn anything into an activity.",
      "content": "Turn anything into an activity. Even though your schedule may only allow for an hour or so at the gym, that doesn't mean you can't find little opportunities throughout the day to get active. You'd be surprised how many calories you can burn doing a few yoga stances while you watch TV! Little things do add up. So start parking far away at work, taking the stairs, walking the dog the long way around the block, giving the house a good scrub down, and dancing while you get ready. Still skeptical? The Mayo Clinic team has said that the calories burned in everyday life are more important than they ever realized. [2] X Research source They're people to trust!"
    },
    {
      "title": "Do step-ups.",
      "content": "Do step-ups. Most gyms have workout benches or exercise steps if you don't have your own. Hold a dumbbell in each hand with your arms down at your sides. Step up with your right foot onto the bench and then your left foot. Step down with your right, then your left foot. Repeat 10 times. Reverse the lead foot and repeat the exercise 10 times. [3] X Research source Beginners should start with 2-pound weights and work up to 15 pounds in each arm. Aim for 3 to 4 sets on each foot. Go faster! See how long you can go all out for and up it each workout session."
    },
    {
      "title": "Perform side leg raises.",
      "content": "Perform side leg raises. Put on ankle weights and hold onto a wall or piece of furniture to gain balance. Lift your right leg up straight in front of your body as far as you can. Lower your leg and repeat 10 times. Switch legs and lift 10 times. Keep your hips straight during the exercise! You want to feel that burn! [4] X Research source Aim for 3 or 4 sets on each leg. Start doing as many as you can, of course, and work your way up gradually."
    },
    {
      "title": "Do leg lift exercises on the floor.",
      "content": "Do leg lift exercises on the floor. Extend your legs and lie on your right side, with your hips stacked and your head supported by your right elbow. Raise your leg as high as you can and lower it. Repeat 10 times and then switch sides. Keep your abdominal muscles tight! Your core should always be contracted. Aim for 3 sets per leg. You can use resistance bands or ankle weights for a more advanced workout, too."
    },
    {
      "title": "Modify your leg lifts to switch it up.",
      "content": "Modify your leg lifts to switch it up. Get on your hands and knees, with your hands below your shoulders and your knees below your hips. With your knee bent, raise your left leg out to the side as high as you can. Hold it for 2 seconds and lower the leg back down. Keep your abs tight and your hips in line with your body. Repeat 10 times and switch legs. When you get good at this, do it fast, almost jumping between legs. When you go to bring your left foot in, push off with your right. Can you do it for a whole minute? Aim for 3 sets on each leg. 3 is a good number of sets for just about anything. Reader Poll: We asked 331 wikiHow readers for their favorite ab workout to target and strengthen core muscles, and only 11% of them said bird dogs. [Take Poll] However, bird dogs are a type of leg lift that works your core and legs. Plus, they're a good choice if you have back pain."
    },
    {
      "title": "Do squats",
      "content": "Do squats . If you can do them in front of a mirror, even better -- that way you can make sure you have constant good form. Stand with your legs shoulder width apart and grab those dumbbells. Bring them to shoulder level, elbows bent, and work your way into a squat, abs flexed. [5] X Research source Get into a position where you're parallel with the floor. Hold it in that position and lift back up. Repeat three sets of 10. At the end, hold the squat for as long as you can. And then 5 seconds more!"
    },
    {
      "title": "Cut out the processed junk.",
      "content": "Cut out the processed junk. Let's keep this as simple as possible. Getting rid of those saddlebags is not rocket science -- they're just excess fat stores that your body has unfortunately decided to hold onto in a rather inconvenient place. The first thing that needs to go? The junk food. It's full of empty calories, bad fats, and very few nutrients. So cut it out! Anything fried or packaged goes on the no-no list. And baked goods and sweets, too. If it's not a good source of protein, fiber, vitamins, good carbs or fats, it doesn't qualify. This means you'll be going fresh -- and doing some cooking! It's impossible to completely avoid these and it's illogical to say something is completely off-limits. So instead of thinking to yourself, \"I can't have these,\" think of it as a treat to have every once in a while."
    },
    {
      "title": "Choose the right carbs.",
      "content": "Choose the right carbs. You should choose whole, complex carbs that contain plenty of fiber, such as brown rice, whole wheat products, quinoa, oats, and the ones in veggies. These will keep you fuller for longer. White or processed carbs on the other hand can be stored as fat if not used for energy right away. Avoid white rice, white bread, cookies, cakes, and pastries. Need some tips? Instead of bread, use eggplant slices or a lettuce wrap. When you go out to restaurants, say you don't need that basket of bread. Get brown rice instead of white, and substitute your spaghetti for whole wheat pasta, quinoa, chickpeas, or thinly sliced vegetables like peppers. [6] X Research source"
    },
    {
      "title": "Pile on fruits and veggies.",
      "content": "Pile on fruits and veggies. You've probably heard that you should eat the rainbow and it's true. The more color you eat, the better. How do you do that? Fruits and veggies! They are nutrient dense -- packed with tons of vitamins and minerals and don't have a lot of calories. You could eat pounds and pounds of salad and be okay -- imagine eating pounds and pounds of fried chicken! Green, leafy vegetables are especially good for you. Spinach, kale, lettuce, Brussels sprouts, cabbage, and broccoli? Great choices. Carrots, onions, peppers, squash -- the more colorful veggies -- are good, too. Blueberries, oranges, bananas, apples, kiwis, grapes, strawberries, and papayas are super fruits.They're full of antioxidants, fiber and vitamins. And tasty to boot!"
    },
    {
      "title": "Stick to the good fats.",
      "content": "Stick to the good fats. Yep, there are definitely such a thing. And they're good for you! Having a diet that includes good fats (but not too many of course) can actually help lower your cholesterol and protect your heart. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source So while the bad fats (the saturated kind) need to go, the good fats (the unsaturated kind) can stay. You'll find these in nuts, avocados, olive oils, and fatty fish like salmon, mackerel, and trout. Just make sure you stick to them in moderation -- even too much of a good thing can be bad."
    },
    {
      "title": "Drink water",
      "content": "Drink water . It's almost too good to be true, but it's not (because it is definitely true). Upping your water intake can help shed pounds, the only effort being lifting that bottle to your chin. Seriously! Studies have shown that people who drink the necessary amount and then some (women need about 3 liters and men need 4 (including the amount in food)) weigh less. [8] X Trustworthy Source FamilyDoctor.org Family-focused medical advice site run by the American Academy of Family Doctors Go to source Cold water can even up your metabolism! So keep that bottle around; it'll be awfully handy. The benefits of water don't just stop at weight loss. It's great for your muscles and organs, your skin, hair and nails, keeps everything regular that must not be mentioned, makes you feel full and can actually make you feel energized. And that's not including the fact that when you're drinking it, you're not drinking those bubbly, sugary drinks that aren't good for you! Replace all sugary drinks in your diet with water. These include soda, sweetened coffee and tea, lemonade, and juice."
    },
    {
      "title": "Eat three meals a day.",
      "content": "Eat three meals a day. You should have three meals a day with small, healthy snacks in between each meal. This will keep you full without making you crave unhealthy, processed foods. Do not skip meals, as this can hurt rather than help your diet."
    },
    {
      "title": "Have a plan you can stick to.",
      "content": "Have a plan you can stick to. All this talk about not eating packaged junk is all well and good, but unless you have a plan, it'll be hard to stick to. You know what you should do, but what are you going to do? So find a plan that appeals to you that meets your goals. Consider giving yourself a caloric goal for each day (our article, How to Calculate How Many Calories You Need to Eat to Lose Weight , can get you started on that). If you don't like that idea, aim for a certain amount of your food intake being vegetables (or a similar idea). And it's easier than ever nowadays to keep track with smartphone apps! Have a workout plan, too. Do you want to work out 4 times a week? For how long? Do you want to work out until you burn X number of calories or is it by activity?"
    }
  ]
}