{
  "url": "https://www.wikihow.com/Prove-a-Mother-Unfit",
  "title": "How to Prove a Mother Unfit",
  "steps": [
    {
      "title": "Examine the mother's behavior.",
      "content": "Examine the mother's behavior. It is not in a child's best interests to remain in the custody of a parent whose behavior puts the child in danger. Consider the nature and frequency of any past instances of: Physical violence Excessive disciplining Emotional abuse Drug or alcohol abuse Convictions for sexual offenses. [2] X Research source"
    },
    {
      "title": "Consider the environment in which the mother is raising the child.",
      "content": "Consider the environment in which the mother is raising the child. If the parent places the child in or fails to remove the child from dangerous circumstances or a dangerous environment, that may be grounds to remove the child from the parent's custody. As you review those conditions, ask yourself: Is the parent properly supervising the child? Is the parent properly feeding, clothing, and educating the child? Does the parent associate with criminals, gang members, violent people, or drug users? Is the home well-maintained with heat, running water, and enough space for the child? Is there anything else dangerous in the home, such as lead paint or improperly stored firearms?"
    },
    {
      "title": "Gather evidence.",
      "content": "Gather evidence. You will need to present evidence that the parent or the environment in which the parent is raising the child poses a danger to the child. Assemble any evidence you can, including: Photographs, video, and audio files showing physical or verbal abuse Medical records related to injuries Criminal records Communications between yourself and the mother, such as emails, texts, and voicemails"
    },
    {
      "title": "Interview witnesses.",
      "content": "Interview witnesses. You can use witness testimony to prove that it would be in the child's best interests to remove the child from the care of the parent. Speak to friends or family members who may have observed the parent harming, threatening to harm, neglecting, or endangering the child. Get the details of the incident from the witness, then ask if he or she would be willing to testify in court about what he or she observed. Your witnesses may also have evidence in their possession, such as threatening emails or voicemails left by the parent."
    },
    {
      "title": "Initiate a case.",
      "content": "Initiate a case. In order to ask a court to terminate or modify the unfit mother's custody rights, you must initiate a court case. You can initiate a case by doing one of the following: Call your state's Department of Child Protective Services (CPS). Depending on the particular policies of the CPS office in your state, CPS may investigate and file your case for you. Petition for divorce. If you are married, child custody will be a major issue in your divorce case. When you are filling out your divorce petition, explain what kind of custody arrangement you want and why the other parent is unfit. Petition for custody. If you were never married to the other parent, you can file a petition to establish custody. If you are divorced from the other parent and want to modify an existing custody order, you can file a petition to modify the custody order. Ask the court clerk what forms you need to file in order to make your request. Use the forms to explain what kind of custody arrangement you want and why the other parent is unfit. Petition for guardianship. If you are not a parent of the child, you can file to become the child's legal guardian. Ask the court clerk what forms you will need to file, and use the forms to explain to the court why the child should be removed from the parent and placed in your care."
    },
    {
      "title": "File your documents.",
      "content": "File your documents. Whether you are filing for divorce, custody, or guardianship, you will need to make several copies of your forms and take them to the court clerk. The clerk will fill your original forms and stamp the copies as \"filed.\" You may be required to pay a filing fee. The clerk will notify you when the court sets a hearing date. If you are filing for custody or guardianship, you must file your petition in the county where the child lives. If you cannot afford to pay the filing fee, ask the clerk how you can file an application for a fee waiver. You must provide information about your household finances and submit the form to the clerk. If the judge denies your fee waiver, the clerk will notify you that you must pay the regular filing fee."
    },
    {
      "title": "Serve the mother.",
      "content": "Serve the mother. Once you have filed your petition, you must serve the mother with formal notice of the proceedings. Depending upon your court's rules, you may be permitted to file a \"Waiver\" or \"Acceptance of Service\" signed by the parent instead. If you are required to give notice, you may be able to request that the court clerk give notice on your behalf. Otherwise, do one of the following: Pay the sheriff's office or a professional process server to serve the parent; or Arrange for a friend or relative over 18 years of age and not involved in the case to hand-deliver the papers to the parent."
    },
    {
      "title": "File a Proof of Service.",
      "content": "File a Proof of Service. Have your process server fill out and sign a \"Proof of Service\" or \"Affidavit of Service\" form (available from the court clerk) verifying that he or she served the other party. [3] X Research source You must then file the signed form with the court clerk."
    },
    {
      "title": "Attend the hearing.",
      "content": "Attend the hearing. Dress professionally, arrive early, and wait for your case to be called. The judge will ask why you are requesting that the mother's custody rights should be terminated or modified, and why doing so would be in the best interests of the child. The parent will have the opportunity to rebut your arguments with witnesses and evidence."
    },
    {
      "title": "Present evidence.",
      "content": "Present evidence. Bring copies and originals of documents and photographs, and bring audio or video files on a CD. You should arrange your evidence chronologically in a binder so that you can quickly refer to each item in court. If you have evidence that came from one of your witnesses, ask the witness about that piece of evidence during his or her testimony. When arguing for custody, you should be prepared to present evidence that it would be in the child's best interests to be placed in your care. To demonstrate to the court that you can provide a safe, stable home for the child, bring a copy of your lease or mortgage."
    },
    {
      "title": "Take witness testimony.",
      "content": "Take witness testimony. You and your witnesses will be permitted to testify about incidents that demonstrate that the parent is unfit. If you have an attorney, he or she will ask questions to guide you through your testimony. If you are representing yourself, explain each incident to the judge calmly and matter-of-factly. After you testify, you can present witnesses to testify about any incidents they observed. The court may allow the child to testify at the hearing. Different states have different rules about whether a child's testimony is admissible in court. For example, children over 10 years of age are generally allowed to testify in Ohio, while children younger than 10 must be found by the court to be able to understand questions and answer truthfully. After each witness has been examined, the other side will have an opportunity to cross-examine the witness. Keep your answers short and truthful, and do not be afraid to admit that you do not know an answer. [4] X Research source"
    },
    {
      "title": "Comply with the court's orders.",
      "content": "Comply with the court's orders. At the conclusion of the hearing, the judge may make a custody determination, or he or she may decide that additional information is needed. If this is the case, the court may order a child custody evaluation, during which an independent evaluator will interview the parties, the child, and friends and family; and visit the parties' homes. The evaluator may also schedule psychological testing. If the court orders a custody evaluation, the clerk will set another hearing date. Comply with the interviews and home visits, then return to court on the hearing date for the judge's ruling on your custody petition."
    }
  ]
}