{
  "url": "https://www.wikihow.com/Measure-Dishwasher",
  "title": "How to Measure the Opening for a Dishwasher to Get the Perfect Fit",
  "steps": [
    {
      "title": "Most contractors intentionally use 1 of 2 standard dimensions.",
      "content": "Most contractors intentionally use 1 of 2 standard dimensions. Measuring and sizing a dishwasher for a cabinet opening used to be a headache back in the day, but most contractors these days will intentionally use 1 of the 2 cabinet sizes. They are: [1] X Research source Standard: 24 inches (61 cm) wide, 24 inches (61 cm) deep, and 35 inches (89 cm) high. Compact: 18 inches (46 cm) wide, 24 inches (61 cm) deep, and 35 inches (89 cm) high."
    },
    {
      "title": "Use a measuring tape",
      "content": "Use a measuring tape and check the width under the cabinet. The countertop is a perfect straight edge to make measuring easy, so run the tape from the top left corner where the cabinet meets the underside of the countertop to the top right corner on the opposite side. Use a pen and paper to note the precise length, and include eights of an inch. [2] X Research source Measure the width in the back of the cabinet and the bottom of the front as well, just to confirm that the width is even throughout. If the opening is slightly smaller than the standard or compact size, don’t worry. Most standard/compact dishwashers will fit in slightly smaller openings. If you have baseboards inside the cabinet, don’t include them in your measurements unless they’re more than 2 inches (5.1 cm) high. You can either draw the dimensions, or list them and label them in order."
    },
    {
      "title": "Measure the left and right side from the front to the back wall.",
      "content": "Measure the left and right side from the front to the back wall. Pull your measuring tape out and measure the floor from the back lefthand corner, to the front lefthand corner where the cabinet ends. Jot down this measurement. Then, measure the depth on the right side of the opening. [3] X Research source If the depth isn’t equal on the two sides, opt for the smaller measurement."
    },
    {
      "title": "Go corner to vertical corner and check all 4 corners for the height.",
      "content": "Go corner to vertical corner and check all 4 corners for the height. Use your measuring tape to calculate the height in the back corner of the cabinet opening. Repeat this process in the corner on the opposite side. Then, measure the edges at the front. [4] X Research source Use the shortest measurement for your height. You may notice a thin metal bar attached to the underside of the countertop near the front. Don’t include this in your measurement—it’s the railing you need to attach the dishwasher"
    },
    {
      "title": "If you have a kitchen island, measure how much room you have.",
      "content": "If you have a kitchen island, measure how much room you have. You need at least 3 inches (7.6 cm) of space to slide a dishwasher into its opening. If you’ve got a kitchen island across from the cabinet opening, measure that distance and jot it down. [5] X Research source For example, if your cabinet is 24 inches (61 cm) deep, you need at least 27 inches (69 cm) of space to install a dishwasher with a depth of 24 inches (61 cm). If your cabinet depth is 24 inches (61 cm), but you only have 20 inches (51 cm) of clearance to the island, your dishwasher can’t be more than 17 inches (43 cm) deep—even if you have the extra cabinet space."
    },
    {
      "title": "An uneven floor may make measuring height a pain.",
      "content": "An uneven floor may make measuring height a pain. If your home is old enough that the floors have warped over time, grab a spirit level and set the level down horizontally inside the cabinet. Check the bubble to confirm the floor is level. If there are any uneven bumps, hold the spirt level up and use it as a guide to measure the height where the flooring isn’t uniform. [6] X Research source If the height in the uneven area is more than 1 ⁄ 2 in (1.3 cm) different than the other height measurements you’ve taken, use the shorter height from the uneven area."
    },
    {
      "title": "You can always fill in a small gap, but you can’t make cabinets bigger.",
      "content": "You can always fill in a small gap, but you can’t make cabinets bigger. If your cabinet opening isn’t a common size for a dishwasher and you can’t find any models that fit perfectly, buy a dishwasher that’s 1 ⁄ 4 –1 inch (0.64–2.54 cm) smaller than the cabinet opening. You can always cover gaps or fill them in with insulation. [7] X Research source If the height is a little short, you can extend the legs on the dishwasher to make it sit taller. If the width of your dishwasher is smaller than the opening, you can insulate the gap with moving blankets. The depth is the least important measurement—you can have any sized gap back there without it impacting performance."
    },
    {
      "title": "It’s rare that a dishwasher sits perfectly flush with the cabinets.",
      "content": "It’s rare that a dishwasher sits perfectly flush with the cabinets. Most dishwashers are designed to stick out 1.5–3 inches (3.8–7.6 cm) so that you can open the door comfortably. Dishwasher dimensions don’t include the door, so if you take your measuring tape to the store with you to check dimensions yourself, remember that you don’t include the door. [8] X Research source"
    },
    {
      "title": "Super wide dishwashers tend to be very inefficient.",
      "content": "Super wide dishwashers tend to be very inefficient. If your cabinet is bigger than 36 inches (91 cm), your options are fairly limited. Unfortunately, these giant dishwashers just don’t tend to be very good. However, 2 compact dishwashers can be a great solution! Simply install them side-by-side. It’ll be cheaper for you, and you’ll cut back on your water/utility bills. [9] X Research source As tempting as it may be to just install a normal dishwasher in a large cabinet space, you can’t fill in more than 1–2 in (2.5–5.1 cm) gaps with insulation."
    }
  ]
}