{
  "url": "https://www.wikihow.com/Create-an-%27Escape-the-Room%27-Game-in-PowerPoint",
  "title": "How to Create an 'Escape the Room' Game in PowerPoint",
  "steps": [
    {
      "title": "Open up PowerPoint.",
      "content": "Open up PowerPoint."
    },
    {
      "title": "Make a quick menu, just by adding two rounded rectangles, typing in, 'Play'.",
      "content": "Make a quick menu, just by adding two rounded rectangles, typing in, 'Play'."
    },
    {
      "title": "Think about where you might start.",
      "content": "Think about where you might start. How about an escape the basement? You can find a perfect, dirty basement image by: Clip art/click the drop down button for the type of clip art/only select photographs/type in, basement, or room. Then look around until you find an orangey like colored basement. Or just get it from your file."
    },
    {
      "title": "Add arrows which indicate where the user wants to go.",
      "content": "Add arrows which indicate where the user wants to go. Make sure to use the same basement picture for every slide you make, or you can take various pictures around a basement where you live, but not the same."
    },
    {
      "title": "Create the game play.",
      "content": "Create the game play. Click one of the arrows (make sure you have more than five slides for this game!), then hyperlink/place in this document/click the slide where you want it to go to."
    },
    {
      "title": "Add details on the other slide that you made the arrow hyperlink to.",
      "content": "Add details on the other slide that you made the arrow hyperlink to. Make another arrow, that faces the opposite way of the other in the previous slide, then hyperlink it to the previous one."
    },
    {
      "title": "Make the escape.",
      "content": "Make the escape. Don't make it too obvious for the players to see the escape door. For example, make a key, to open that door. Or better, a puzzle! Or maybe a riddle, so players go deeper into the game."
    },
    {
      "title": "Try adding a puzzle or riddle.",
      "content": "Try adding a puzzle or riddle. If you wanted to make a puzzle or a riddle, get help from your parents or something or from the internet."
    },
    {
      "title": "Draw up a rectangle",
      "content": "Draw up a rectangle that looks like a door. Then shapes/oval. Draw up an oval on the door. Then, select the door and then the doorknob, then press control+G. This will group the whole thing, selected."
    },
    {
      "title": "Create another doorknob, which covers the group doorknob.",
      "content": "Create another doorknob, which covers the group doorknob."
    },
    {
      "title": "Make a key",
      "content": "Make a key ."
    },
    {
      "title": "Group the key after you've made it, then put it somewhere in the slide.",
      "content": "Group the key after you've made it, then put it somewhere in the slide."
    },
    {
      "title": "Select the doorknob that covers the group doorknob.",
      "content": "Select the doorknob that covers the group doorknob. Then animation/custom animation/add effect/appear."
    },
    {
      "title": "Click the drop down button.",
      "content": "Click the drop down button."
    },
    {
      "title": "Click the 'timing' tab.",
      "content": "Click the 'timing' tab."
    },
    {
      "title": "Click triggers/start effect on click of/choose the group of the key.",
      "content": "Click triggers/start effect on click of/choose the group of the key. Then add another effect for the doorknob/disappear."
    },
    {
      "title": "Click the drop down button.",
      "content": "Click the drop down button. Timing, triggers/start effect on/click the group key. Now when you play, hover your mouse pointer to the doorknob. The cursor won't change to a hand! Why? Then click the key. Then the doorknob that covered the group, will appear!"
    },
    {
      "title": "Make a one-item inventory box.",
      "content": "Make a one-item inventory box. To make one, Make a rectangle. Then copy and paste the group key, fitting it just right in the rectangle. Then create another rectangle, but covering the key. Then, right click/format picture/fill/solid fill/transparent it until the key looks clear enough to see. Then click the line color tab/solid line/transparent it, 100%."
    },
    {
      "title": "Select the group key in the inventory box.",
      "content": "Select the group key in the inventory box. Add effect/appear/timing/triggers/on click of/the group key on the ground. Then do the same, but this time, disappear."
    },
    {
      "title": "Select the transparent rectangle, add effect/appear/drop down list/timing/on click of/the key in the inventory box.",
      "content": "Select the transparent rectangle, add effect/appear/drop down list/timing/on click of/the key in the inventory box. Then do the same, disappearing."
    },
    {
      "title": "Make more slides, then once you've finished, let someone else finish it.",
      "content": "Make more slides, then once you've finished, let someone else finish it."
    }
  ]
}