{
  "url": "https://www.wikihow.com/Get-a-Free-Po-Box",
  "title": "A Simple Guide to Getting a Free USPS PO Box",
  "steps": [
    {
      "title": "You need to live or work within the zip code parameters of a USPS office.",
      "content": "You need to live or work within the zip code parameters of a USPS office. USPS branches only deliver within a certain radius, so make sure you live in an area that’s serviced by a local branch. [1] X Research source"
    },
    {
      "title": "You need to live or work from a spot that isn’t on a USPS delivery route.",
      "content": "You need to live or work from a spot that isn’t on a USPS delivery route. If you live in an apartment or home that gets mail delivered via cluster mailboxes, you unfortunately don’t qualify for a free PO Box. People who get their mail delivered via mailrooms or other collective delivery systems also can’t apply. [2] X Research source"
    },
    {
      "title": "You must live or work from a place that’s legally accessible by USPS.",
      "content": "You must live or work from a place that’s legally accessible by USPS. The USPS can’t deliver to certain locations because of low-quality roads, private neighborhoods, secure communities, specific ordinances, and dangerous circumstances. If one of these factors prevents you from being on a USPS delivery route, you don’t qualify for a free PO Box. [3] X Research source"
    },
    {
      "title": "You need to live or work out of at a permanent address.",
      "content": "You need to live or work out of at a permanent address. USPS doesn’t grant free PO boxes to people who live in or work out of temporary locations, like hotel rooms, college dorms, transient trailer parks, or campsites. [4] X Research source"
    },
    {
      "title": "Apply for the free PO Box in person at your local post office.",
      "content": "Apply for the free PO Box in person at your local post office. Unfortunately, USPS doesn’t allow people to apply for free PO Boxes online. [5] X Research source Instead, you’ll need to stop by your nearest post office and request to apply there. Bring a filled-out 1093 application form , along with 2 different types of ID (like a driver’s license and birth certificate). A USPS employee will help go over your information and get your PO Box set up. [6] X Research source If you can't print out the 1093 form ahead of time, don't worry! You can get one at the post office. If you end up not qualifying for a free PO Box, you can still set up a paid one . As of February 2024, the smallest PO Box size costs around $5. [7] X Research source This box can be set up at the post office of your choice, even if it’s different from the one you applied at. [8] X Research source"
    },
    {
      "title": "Customers can only get 1 PO Box for free.",
      "content": "Customers can only get 1 PO Box for free. If you want another PO Box in addition to your free one, you’ll have to pay the standard monthly fee. [9] X Research source As of February 2024, the sizes and costs are: XS: $4.83 S: $6.17 M: $9.17 L: $13.50 XL: $24"
    },
    {
      "title": "Customers get the smallest possible PO Box for their future mail.",
      "content": "Customers get the smallest possible PO Box for their future mail. USPS will give you a PO Box that can handle the amount of mail you typically get. [10] X Research source For some people, this might be an XS; for others, it might be something larger, like an S or M."
    },
    {
      "title": "Get a free PO Box in the UK using UK PostBox.",
      "content": "Get a free PO Box in the UK using UK PostBox . UK PostBox lets customers set up a free PO Box that’s based in Dorset. Don’t live near there? That’s okay—UK PostBox offers plenty of digital services to help you access and read your mail wherever you are. [11] X Research source You can get a PO Box in a different location, like London, but you’ll have to pay a monthly fee."
    }
  ]
}