{
  "url": "https://www.wikihow.com/Install-a-Bios-Update-from-a-USB",
  "title": "How to Install a BIOS Update from a USB",
  "steps": [
    {
      "title": "Get your system specs.",
      "content": "Get your system specs. Press the Windows key and type \"msinfo\" , then click the search result showing a system app that you can open to see your computer's specs. You'll want to note the information near \"BaseBoard Product\" (it's your motherboard model), as well as the motherboard's manufacturer and \"BIOS Version/Date.\""
    },
    {
      "title": "Insert the USB into your computer.",
      "content": "Insert the USB into your computer. If your computer has a tower, you'll find USB ports on the front and back of it; if you're using an all-in-one, you'll find USB ports on the back of the monitor; and if you're using a laptop, the USB ports are located on the sides of your computer."
    },
    {
      "title": "Download the BIOS update.",
      "content": "Download the BIOS update. This step varies between manufacturers, but you should be able to use a search engine, like Google, to locate your motherboard's website with a BIOS update. When your file explorer opens, make sure you choose to save the file to your USB stick. If the file saves to your local drive, you'll need to move it to the USB drive."
    },
    {
      "title": "Restart your computer and access the BIOS page.",
      "content": "Restart your computer and access the BIOS page. As your computer boots up, immediately begin pressing the key your computer's manufacturer assigned to the BIOS startup . If the BIOS doesn't launch, you'll need to restart again and try a different key. For most computers, this key is one of the function keys (e.g., F12), although some computers, like Asus, use the Del key or the Esc key. If you don't know your computer's BIOS key, look it up by typing your computer's manufacturer name, model name, and \"BIOS key\" into a search engine."
    },
    {
      "title": "Enter Setup or Advanced Mode and wait for your BIOS to load.",
      "content": "Enter Setup or Advanced Mode and wait for your BIOS to load. After successfully hitting the setup key (this might be F2) or the Advanced screen (F7 for some computers), the BIOS will load. This should only take a few moments. When the loading is complete, you will be taken to the BIOS settings menu."
    },
    {
      "title": "Access the BIOS update on your USB.",
      "content": "Access the BIOS update on your USB. This process varies between manufacturers and motherboards, but you should see where you can select to access the BIOS file from your USB stick. If you see a \"Boot\" tab, you'll navigate there to enable your USB stick for updates."
    },
    {
      "title": "Allow your BIOS to update.",
      "content": "Allow your BIOS to update. This process can take a few minutes to over an hour, depending on your computer and the size of the BIOS update. Once your BIOS is finished updating, your computer should restart itself, though you may be prompted to confirm this decision. Do not turn off your computer while the BIOS is updating. Doing so can cause the BIOS to become corrupted, meaning that your computer will be unable to start, complete the BIOS installation, or otherwise run at all. [1] X Research source"
    }
  ]
}