{
  "url": "https://www.wikihow.com/Bumble-Speed-Dating",
  "title": "How to Play Bumble Speed Dating (& What to Do If You Can’t)",
  "steps": [
    {
      "title": "Bumble Speed Dating is Bumble's fast-chat game.",
      "content": "Bumble Speed Dating is Bumble's fast-chat game. You are paired with a person at random based on your match criteria, and you'll have three minutes to chat. During the chat, you are not allowed to see the person's picture or profile. After the chat, their picture will be revealed and you will be asked if you liked the chat. Then, you will be asked if you want to continue to the next chat. [1] X Research source Either person can send the first message. If you're not sure what to say, you can send GIFs or use the Questions game to break the ice. To get the most out of speed dating , dating coach Laura Bilotta says, \"First of all, approach the event with a positive mindset. Trust the process, and don’t take things too seriously. Make peace with the fact that not everyone you like is going to match with you, and that’s ok. The right person is out there for you somewhere. Remember that everyone at the event is single, with the same goals - to meet new people, and hopefully establish a connection.\""
    },
    {
      "title": "Speed Dating is between 7 PM and 8 PM every Thursday.",
      "content": "Speed Dating is between 7 PM and 8 PM every Thursday. You can play Speed Dating at 7 PM, no matter your time zone."
    },
    {
      "title": "Tap the stopwatch icon.",
      "content": "Tap the stopwatch icon. To start playing Speed Dating, you'll need to sign up by tapping the stopwatch in the upper-right corner of the Bumble app. Alternatively, you can wait for the Speed Dating card to appear as you are swiping ."
    },
    {
      "title": "Tap Sign Up before the game starts.",
      "content": "Tap Sign Up before the game starts. It's the yellow button at the bottom of the page. You will be reserved a time and see a page telling you when the game starts."
    },
    {
      "title": "Tap the stopwatch icon to start playing.",
      "content": "Tap the stopwatch icon to start playing. You can start Speed Dating at any time during the hour the game is active. A notification will be sent to you telling you when the game starts."
    },
    {
      "title": "The rules and community guidelines are the same during Speed Dating as at any other time.",
      "content": "The rules and community guidelines are the same during Speed Dating as at any other time. Be kind and respectful. [2] X Research source Respect everyone's boundaries. Do not make sexual comments or upload sexual material without express consent. Do not engage in bullying, belittling, or intimidating behavior. Do not attack people for their views or values. Do not engage in hate speech against anyone based on race, gender identity and expression, or disability. Send original messages and be authentic. Don't use chatbots, spam other users, or use Bumble to sell things. Don't do anything illegal, including fraud, violence, or selling illegal substances."
    },
    {
      "title": "Block and report them.",
      "content": "Block and report them. Tap the icon with three dots in the upper-right corner during a chat, then select the option to block and/or report the user."
    },
    {
      "title": "Speed dating isn't showing up.",
      "content": "Speed dating isn't showing up. Restart the Bumble app. Make sure you have a stable internet connection. If you are not getting a decent internet connection, restart your modem or router or try switching to mobile data. Update the Bumble app in the Google Play Store on Android or the App Store on iPhone and iPad. Clear the app cache. Android: . Swipe down from the top and tap the Gear icon to open Settings . Tap Apps or Apps manager . Tap the Bumble app and tap Storage . Tap Clear cache . iPhone: Open the Settings app and tap General . Tap the Bumble app and tap Offload app ."
    },
    {
      "title": "It's taking too long to pair.",
      "content": "It's taking too long to pair. If you are not pairing with anyone in the chat, there might not be enough people for you to pair with. Try expanding your preferences, such as your preferred age range. You can also use Bumble Spotlight, a paid feature that will move you to the front of the queue during Bumble Speed Dating and regular swiping. You get one free 30-minute Spotlight with your subscription every week. However, you can purchase an additional spotlight and combine them for a total of 150 minutes. [3] X Research source"
    }
  ]
}