{
  "url": "https://www.wikihow.com/Replay-a-Snapchat",
  "title": "2 Simple Ways to Replay a Snapchat Once or Twice",
  "steps": [
    {
      "title": "Open the Snapchat app.",
      "content": "Open the Snapchat app. This looks like a white ghost with a yellow background. If you aren't already logged in , tap Log in to do so now. [1] X Research source Make sure Snapchat is updated to its latest version. Remember that the sender will be notified if you replay a Snap."
    },
    {
      "title": "View a Snap.",
      "content": "View a Snap. If a friend has sent you a Snap, you should see it on the Chats screen. Tapping it once will open the Snap. Once the Snap ends, it will close. Do not exit the Chat screen. If you do, you won't be able to replay the Snap."
    },
    {
      "title": "Tap and hold the Snap again.",
      "content": "Tap and hold the Snap again. It should say Tap and hold to replay below your friend's name. When it's ready to be viewed again, you'll see the colored square icon."
    },
    {
      "title": "Tap the Snap again.",
      "content": "Tap the Snap again. This will replay the Snap. Similar to saving Snaps , the sender will be notified of the replay."
    },
    {
      "title": "Open the Snapchat app.",
      "content": "Open the Snapchat app. This looks like a white ghost with a yellow background. If you aren't already logged in, tap Log in to do so now. [2] X Research source Replay Again allows you to replay a Snap twice, which means you can see a single Snap up to three times. You must be subscribed to Snapchat+ to use Replay Again, along with other features ."
    },
    {
      "title": "View a Snap.",
      "content": "View a Snap. If a friend has sent you a Snap, you should see it on the Chats screen. Tapping it once will open the Snap. Once the Snap ends, it will close. Do not exit the Chat screen. If you do, you won't be able to replay the Snap."
    },
    {
      "title": "Tap and hold the Snap.",
      "content": "Tap and hold the Snap. It should say Tap and hold to replay below your friend's name. When it's ready to be viewed again, you'll see the colored square icon."
    },
    {
      "title": "Tap the Snap.",
      "content": "Tap the Snap. This will replay the Snap. The sender will be notified of the replay."
    },
    {
      "title": "Replay the Snap again.",
      "content": "Replay the Snap again. If you want to view the Snap a third time, tap and hold the Snap. When the colored square icon appears, tap the Snap. This will replay it again."
    }
  ]
}