{
  "url": "https://www.wikihow.com/Fake-5-Dollar-Bill",
  "title": "How to Tell if a $5 Bill is Real or Counterfeit",
  "steps": [
    {
      "title": "Find the two “5” watermarks on either side of the portrait.",
      "content": "Find the two “5” watermarks on either side of the portrait. Hold the bill up to the light. On the left of President Lincoln and the 10 stars, look for the faint image of three 5s in a vertical line. To the right of the portrait, underneath the other 10 stars, is the image of a large 5. Both images are visible from both sides of the note. [1] X Research source"
    },
    {
      "title": "Hold the note to the light to see the security thread to the right of Lincoln.",
      "content": "Hold the note to the light to see the security thread to the right of Lincoln. This thread runs vertically between the portrait and the Treasury seal. It’s imprinted with “USA” and “5” in an alternating pattern and is visible on both sides of the bank note. [2] X Research source Look at the thread with an ultraviolet light to see if the thread glows blue."
    },
    {
      "title": "Examine the purple color of the bill from the center to the edges.",
      "content": "Examine the purple color of the bill from the center to the edges. The background of the center of the bill is light purple and blends to a dull grayish green near the edges. [3] X Research source"
    },
    {
      "title": "Feel the raised printing and unique texture of the bill’s paper.",
      "content": "Feel the raised printing and unique texture of the bill’s paper. Move your finger along the surface of the bill to feel the raised printing. Federal Reserve note paper is made of ¼ linen and ¾ cotton, and feels slightly rough to the touch because of its unique printing process. [4] X Research source Look for small red and blue security fibers embedded in the bill with a magnifying glass. Counterfeit bills might have fibers that are drawn or printed on instead of being part of the paper itself. [5] X Research source"
    },
    {
      "title": "Look for President Lincoln on the front and his memorial on the back.",
      "content": "Look for President Lincoln on the front and his memorial on the back. This $5 note has a portrait of President Lincoln without a frame around him, touching the bottom and top of the border. At the bottom is a banner that says “LINCOLN.” On the back is the Lincoln Memorial without a border and with “IN GOD WE TRUST” near the top. [6] X Research source"
    },
    {
      "title": "Look for the Federal Reserve and Treasury seals on either side of Lincoln.",
      "content": "Look for the Federal Reserve and Treasury seals on either side of Lincoln. The black seal on the left of President Lincoln’s portrait is a black “UNITED STATES FEDERAL RESERVE SYSTEM” symbol. The green seal to the right of the portrait on top of the word “FIVE” represents “THE DEPARTMENT OF THE TREASURY” and has “1789” at the bottom. [7] X Research source"
    },
    {
      "title": "Find the microprinted text inside the border and on the shield.",
      "content": "Find the microprinted text inside the border and on the shield. Use a magnifying glass to see “FIVE DOLLARS” inside the loops along the left and right borders of the bill, “E PLURIBUS UNUM” at the top of the shield on the Great Seal, and “USA” repeated on the columns of the shield. [8] X Research source On the back of the bill, look for “USA FIVE” along one edge of the large purple 5."
    },
    {
      "title": "Locate the Great Seal in purple to the right of President Lincoln.",
      "content": "Locate the Great Seal in purple to the right of President Lincoln. This United States symbol of freedom features an eagle, a shield, and a banner reading “E PLURIBUS UNUM” on either side. An arc of 20 purple stars surrounds both this seal and the portrait of President Lincoln. [9] X Research source"
    },
    {
      "title": "Find the large purple 5 on the back of the bill in the lower right corner.",
      "content": "Find the large purple 5 on the back of the bill in the lower right corner. This large “5” helps people who have visual impairments distinguish this bill from other bills. [10] X Research source"
    },
    {
      "title": "Look for the green series numbers to the right and left of Lincoln.",
      "content": "Look for the green series numbers to the right and left of Lincoln. Each series number is made up of a unique set of numbers and letters that identify the bill. One series number is near the upper left corner while the other is below the Treasury seal. [11] X Research source Make sure the serial numbers on each bill match and are evenly spaced. If you received multiple $5 bills, make sure the serial numbers on the bills are different from each other. [12] X Research source The black number and letter below the left serial number represent the Federal Reserve Bank that distributed the note."
    },
    {
      "title": "Identify the series year at the bottom right of President Lincoln’s portrait.",
      "content": "Identify the series year at the bottom right of President Lincoln’s portrait. To the right of Lincoln above the bottom border is the word “SERIES” followed by a year number. This design only includes the years 2006, 2009, 2013, 2017, and 2021. [13] X Research source If your bill matches this design but has a different series year, it may be fake. Make sure that the first letter in the serial number corresponds to the series year. G is 2004A, I is 2006, J is 2009, P is 2017A, L is 2009A, M is 2013, N is 2017, and Q is 2021. [14] X Research source"
    },
    {
      "title": "Hold the bill to the light to see the embedded thread left of the portrait.",
      "content": "Hold the bill to the light to see the embedded thread left of the portrait. This thread runs vertically down the note and includes “USA FIVE” and a small flag in an alternating pattern. You can find this thread on both sides of the note and it glows blue when placed under ultraviolet light. [15] X Research source"
    },
    {
      "title": "Hold the bill up to the light to see the watermark of President Lincoln.",
      "content": "Hold the bill up to the light to see the watermark of President Lincoln. The faint image of the former president’s face can be seen in the blank space to the right of his portrait, between the border and the Treasury seal. This image can be seen on both sides of the banknote. [16] X Research source"
    },
    {
      "title": "Find the Federal Reserve and Treasury seals on each side of the portrait.",
      "content": "Find the Federal Reserve and Treasury seals on each side of the portrait. Look for the black “UNITED STATES FEDERAL RESERVE SYSTEM” seal to the left of the portrait. On the left is a green seal for “THE DEPARTMENT OF THE TREASURY” with “1789” at the bottom and the word “FIVE” printed on top of it in black ink. [17] X Research source"
    },
    {
      "title": "Feel the raised printing and unique texture of the paper.",
      "content": "Feel the raised printing and unique texture of the paper. Move your finger along the surface of the bill to feel the raised printing. Federal Reserve note paper is made of ¼ linen and ¾ cotton and feels slightly rough and of higher quality than other paper. [18] X Research source Compare the texture of the bill to other $5 bills in the same series to see if it may be fake. These bills also contain small red and blue security fibers that can be seen with a magnifying glass."
    },
    {
      "title": "Look for President Lincoln on the front and his memorial on the back.",
      "content": "Look for President Lincoln on the front and his memorial on the back. This portrait is larger than it was on previous bills, touching the outer edge of both the bottom and top borders. At the bottom is a banner with “LINCOLN” printed on it. The back has a portrait of the Lincoln Memorial with “IN GOD WE TRUST” at the top of the frame. [19] X Research source"
    },
    {
      "title": "Inspect the microprinted words on the border and the edge of the portrait.",
      "content": "Inspect the microprinted words on the border and the edge of the portrait. Use a magnifying glass to search for the small printed words “FIVE DOLLARS” written inside the left and right decorative borders. Along the lower edge of the oval frame of President Lincoln’s portrait are the words “UNITED STATES OF AMERICA.” [20] X Research source"
    },
    {
      "title": "Find the green 5 on the lower right of the back of the bill.",
      "content": "Find the green 5 on the lower right of the back of the bill. This large solid-green number helps people with visual impairments distinguish $5 bills from other denominations. [21] X Research source"
    },
    {
      "title": "Locate the serial numbers that appear twice on the front of the note.",
      "content": "Locate the serial numbers that appear twice on the front of the note. One serial number can be found at the top left of the portrait and the other on the bottom right. Both are printed in green ink. [22] X Research source Look to see that both serial numbers match and are evenly spaced. If you have multiple $5 bills, make sure the serial numbers on each bill are different from each other. [23] X Research source The letter and number underneath the top number identify the Federal Reserve bank that distributed the bill."
    },
    {
      "title": "Hold the bill up to the light to see a thread to the left of the bank seal.",
      "content": "Hold the bill up to the light to see a thread to the left of the bank seal. The thread runs vertically down the note and is printed with “USA” and “FIVE” in an alternating pattern. This thread can be found on both sides of the note. [24] X Research source If you have an ultraviolet light, hold it up to the bill to make sure the thread glows blue."
    },
    {
      "title": "Find the words “THE UNITED STATES OF AMERICA” around the portrait.",
      "content": "Find the words “THE UNITED STATES OF AMERICA” around the portrait. Use a magnifying glass to search for the microprinting along the outer edge of Abraham Lincoln’s oval portrait frame. [25] X Research source"
    },
    {
      "title": "Look for the black Federal Reserve bank seal and the green U.S.",
      "content": "Look for the black Federal Reserve bank seal and the green U.S. Treasury Seal. The Federal Reserve seal is to the left of the portrait and the Treasury seal is to the left. The Federal Reserve seal has the name of the Federal Reserve bank with the United States seal or an “I” inside of it. [26] X Research source The seal is made with the same green ink as the two serial numbers. [27] X Research source"
    },
    {
      "title": "Feel the bill’s texture and the raised ink along the note.",
      "content": "Feel the bill’s texture and the raised ink along the note. Federal Reserve note paper is made of ¼ linen and ¾ cotton that feels slightly rough. [28] X Research source A real bill will have slightly raised ink you can feel just by brushing your finger across the surface. [29] X Research source Use a magnifying glass to see the small red and blue security fibers throughout the bill. [30] X Research source"
    },
    {
      "title": "Find Present Lincoln on the front and the Lincoln Memorial on the back.",
      "content": "Find Present Lincoln on the front and the Lincoln Memorial on the back. This banknote includes a picture of President Abraham Lincoln in an oval portrait with the word “LINCOLN” on a banner at the bottom and large leaves on either side. The back is a picture of the Lincoln Memorial with “IN GOD WE TRUST” at the top of the frame. [31] X Research source"
    },
    {
      "title": "Locate the two green serial numbers near the top and bottom of the bill.",
      "content": "Locate the two green serial numbers near the top and bottom of the bill. The serial numbers are a unique combination of letters and numbers, found below the Federal Reserve seal and above the Treasury seal. [32] X Research source Examine the numbers to make sure they match and that each number is evenly spaced. [33] X Research source If you received multiple $5 bills, make sure the serial numbers on each bill are different from each other. [34] X Research source"
    },
    {
      "title": "Examine the Federal Reserve and Treasury seals on either side.",
      "content": "Examine the Federal Reserve and Treasury seals on either side. On the left side of Abraham Lincoln’s portrait, look closely at the black seal to see the name of the Federal Reserve Bank surrounding the number “5” or “4-D”. Examine the blue seal on the right side of the portrait to see the name of the U.S. Department of the Treasury. [35] X Research source The U.S. Treasury seal changed in 1969 from the inscription “THESAUR. AMER. SEPTENT. SIGIL.” to “THE DEPARTMENT OF THE TREASURY” with “1789” at the bottom. [36] X Research source The most valuable $5 bills are “greenbacks” printed from 1861 to 1929. 1929 is when the appearance of banknotes began to be standardized. [37] X Research source"
    },
    {
      "title": "Feel the bill for raised ink and compare the paper to verified $5 notes.",
      "content": "Feel the bill for raised ink and compare the paper to verified $5 notes. Federal Reserve paper is ¼ linen and ¾ cotton, giving it a crisp, rough finish that feels different from other kinds of paper. [38] X Research source Genuine currency also has slightly raised ink that can be felt with your fingertips. [39] X Research source Note paper also contains blue and red security fibers throughout the bill—look closely at the bill or use a magnifying glass to see them. Bills from 1914 to 1929 measure 7.375 by 3.125 inches (18.73 cm × 7.94 cm) while bills from 1929 to 1993 are only 6.14 by 2.61 inches (15.6 cm × 6.6 cm). [40] X Research source"
    },
    {
      "title": "Look for Abraham Lincoln on the front and a special design on the back.",
      "content": "Look for Abraham Lincoln on the front and a special design on the back. A $5 bill printed during this time has a portrait of former President Lincoln on the front in an oval-shaped frame. [41] X Research source The picture on the back varies depending on the year that the bill was printed in. Bills from 1914 to 1929: Shows the vignettes of Columbus looking for land and the pilgrims’ landing. [42] X Research source Bills from 1929 to 1993: Pictures the Lincoln Memorial. [43] X Research source"
    },
    {
      "title": "Find the serial numbers to the left and right of Lincoln’s portrait.",
      "content": "Find the serial numbers to the left and right of Lincoln’s portrait. A unique combination of letters and numbers appears twice on the front of the $5 note. One is located on the bottom left of President Lincoln’s portrait and the other is above the Treasury seal to the right of the portrait. [44] X Research source Check to make sure the serial numbers on each bill match and are spaced evenly. [45] X Research source If you received multiple $5 bills, ensure that the serial numbers on the bills are different from each other. [46] X Research source"
    },
    {
      "title": "Report the suspected counterfeit bill to your local police station.",
      "content": "Report the suspected counterfeit bill to your local police station. If you live in the U.S. and you found a counterfeit banknote, immediately notify your local police. Make sure to tell them the physical characteristics of the person who handed you the bill, their license plate number, and the make, model, and color of their vehicle. [47] X Research source If you live outside of the U.S., notify the U.S. Secret Service field office in your area. Law enforcement authorities will then submit the suspected currency to your government’s federal law enforcement agency (like the United States Secret Service). [48] X Research source If the banknote is found to be genuine, your local police will return it as soon as possible. If it’s counterfeit, you will not be reimbursed. [49] X Research source"
    }
  ]
}