{
  "url": "https://www.wikihow.com/Be-a-Better-Listener-with-ADHD",
  "title": "13 Ways to Be a Better Listener When You Have ADHD",
  "steps": [
    {
      "title": "Multi-tasking can make it harder for you to pay attention.",
      "content": "Multi-tasking can make it harder for you to pay attention. If someone wants to talk, put away your phone, close your book, or turn off the TV. Pull up a chair and give them your undivided attention. They’ll appreciate it and it’ll make it easier for you to focus on what they’re saying. [1] X Research source Your ability to multi-task may be great for getting things done at work and around your home, but it won’t make you a better listener! Catch yourself when your mind starts wandering off. [2] X Expert Source Hilya Tehrani, PsyD Licensed Clinical Psychologist Expert Interview. 27 August 2021."
    },
    {
      "title": "It’ll help keep your mind from wandering.",
      "content": "It’ll help keep your mind from wandering. While you’re listening to someone talk, nod your head to acknowledge that you understand what they’re saying and smile occasionally (like when they say something funny) to let them know you’re listening. Every now and then, make a sound like “uh-huh” or say something brief like, “okay” or “right.” It can help you stay focused on the conversation and it’ll make it seem like you’re really listening, which the person talking may really appreciate. [3] X Research source For instance, while the other person is talking to you, when they make a point, you could say, “Gotcha.” Focusing on what they’re saying in order to respond or react can help you pay attention."
    },
    {
      "title": "It may help you follow along in the conversation.",
      "content": "It may help you follow along in the conversation. As they’re talking to you, echo the words in your mind. It’ll help them stick and will force you to really pay attention to what they’re saying. If you get lost or you aren’t sure what they said, just ask so you can get back on track. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Imagine what they’re saying like a movie in your head.",
      "content": "Imagine what they’re saying like a movie in your head. Many people with ADHD are visual thinkers and learners, so take advantage of the way your brain works. When someone is talking or explaining something to you, try thinking of it like a movie with characters and lots of detail. It can help you follow along in the conversation and may help you better comprehend what someone is saying. [5] X Research source For instance, if a teacher is explaining a concept, try visualizing it in your mind. If your friend is telling you about their day, imagine it in your mind as they talk about it. Make sure to visualize and listen, though—you don’t want to start daydreaming!"
    },
    {
      "title": "Keeping your hands busy can make it easier for you to listen.",
      "content": "Keeping your hands busy can make it easier for you to listen. Fidgeting is a mindless activity that you can do while you’re working on another task (like listening). It’s been proven to be an effective way to help people with ADHD improve their ability to focus. Try playing with a fidget toy while you’re listening. If you can’t use a toy, try carrying around a small, smooth stone (known as a “worry rock”) in your pocket that you can fiddle with when you need to focus. [6] X Research source You can also try explaining to people that fidgeting actually helps you pay attention so they’ll understand and you don’t have to keep it hidden. Other simple forms of fidgeting include drumming your fingers or doodling while you’re on a phone call or listening to a lecture. Similarly, taking up a physical activity that incorporates mindfulness (like martial arts or yoga) might help you improve your focus. [7] X Expert Source Hilya Tehrani, PsyD Licensed Clinical Psychologist Expert Interview. 27 August 2021."
    },
    {
      "title": "You’ll know what to say when it’s your turn to talk.",
      "content": "You’ll know what to say when it’s your turn to talk. Pay attention to what the person talking to you is saying right now. Follow along with their words and don’t worry about coming up with something to say when they’re done talking. [8] X Research source Plus, just by being a better listener and paying attention to the person you’re talking to when they’re speaking, you’ll actually be better prepared to respond to them. Bring your mind back to the conversation if you catch yourself thinking way ahead. [9] X Expert Source Hilya Tehrani, PsyD Licensed Clinical Psychologist Expert Interview. 27 August 2021."
    },
    {
      "title": "It can help you focus on what someone else is saying.",
      "content": "It can help you focus on what someone else is saying. Resist the urge to jump in and interrupt a conversation. Focus on waiting until the person speaking finishes their sentence or is done talking before you say something. If you do need to interrupt to clarify something or ask a question, politely ask for permission first. [10] X Research source Not only is it rude to interrupt someone when they’re speaking, it can actually make it harder for you to pay attention to what they’re saying. If you need to interrupt, you could ask, “Excuse me, can I ask a quick question?”"
    },
    {
      "title": "It shows you’re listening and can help you follow along.",
      "content": "It shows you’re listening and can help you follow along. Whenever someone talking to you says something important or if they put emphasis on something, try repeating it back out loud or summarizing it in your own words. It’ll help it stick out in your memory and keep you focused on the conversation. [11] X Research source If someone says, “After we finish getting groceries, we’ll stop by Tim’s to drop off the food, then we’ll swing by the dog park for a bit” you could say, “Okay, groceries, Tim’s, dog park. Got it.”"
    },
    {
      "title": "Make sure you understand what you need to do.",
      "content": "Make sure you understand what you need to do. If a boss, teacher, friend, or anyone else gives you a task or an assignment, listen closely to what they say when they explain it to you. Then, echo their instructions to make sure you know what you need to do and to show them that you understand what they’re saying. [12] X Research source For instance, if your manager gives you a list of things to do before you get off work, you could say, “Okay, empty the garbage, adjust the thermostat, and turn off all the lights. Got it.” They can also correct or clarify something if you aren’t fully understanding them."
    },
    {
      "title": "It can help you out if you get lost in the details.",
      "content": "It can help you out if you get lost in the details. If someone is talking really quickly, sharing lots of little details, or if you’re just having trouble following along, try asking them to help you out. Tell them you’re a bit confused and ask if they can give you the main points that they want you to understand. [13] X Research source You could try, “So sorry, I’m a bit lost. Can you tell me what the main points were?” You could also try to keep it casual with something like, “I’m having a little trouble keeping up. Can you give me the summary?”"
    },
    {
      "title": "That way you’re super clear on what the instructions are.",
      "content": "That way you’re super clear on what the instructions are. If you’re in a meeting, class, or lecture, taking notes is a great way to keep yourself focused and record the information so you can study or review it later. Jot down key words and any questions you have so you can remember to ask them later. If someone is asking you to do something, ask them if they can email or write out the directions so you can consult them and you won’t get confused. [14] X Research source If you’re able to, recording a conversation, class, or lecture can be really helpful. Use a recording app and replay it as many times as you need! Just make sure you get permission or ask if it’s okay first. [15] X Research source"
    },
    {
      "title": "Sometimes people just need to vent.",
      "content": "Sometimes people just need to vent. If someone comes to you to talk about a problem or something that’s upsetting them, try not to worry about coming up with the perfect solution. Instead, focus on just being a good listener and being there for them. If they want your opinion or your input, they’ll ask! [16] X Research source If you’re busy trying to come up with words of advice while someone is talking, you probably aren’t giving them your full attention."
    },
    {
      "title": "Ask a friend to help you get better at it.",
      "content": "Ask a friend to help you get better at it. Listening is actually a skill! But that’s good news. It means you can work to get better at it. Ask a friend, family member, or even a trusted co-worker to help you out. Take turns telling each other a story about something that recently happened to you. Keep it short, but long enough that you’ll have to pay attention. When they’re done talking, repeat back key details from the story and ask them for some feedback. [17] X Research source For instance, you could have your friend tell you about a restaurant they went to recently. They can talk about everything they did while they were there, what they ate, and what they thought about the experience. When they’re finished, you can give a recap of the story to see how well you were paying attention. The more you practice listening, the better you’ll be. In time, you can become a master listener!"
    }
  ]
}