{
  "url": "https://www.wikihow.com/Make-Dog-Shampoo",
  "title": "How to Make Dog Shampoo",
  "steps": [
    {
      "title": "Wash your dog with dish soap, vinegar, and glycerin.",
      "content": "Wash your dog with dish soap, vinegar, and glycerin. A simple, all purpose dog shampoo can be made using one cup of dish soap, one cup of apple cider vinegar, and 2 ounces of glycerin. Glycerin is a form of sugar alcohol you can purchase online or at a drug store. You will also want jars to mix your shampoo, and an empty shampoo bottle to put it in when you're finished. [1] X Research source Pour all your ingredients into a jar, making sure to pour the dish soap first. Shake the ingredients thoroughly until mixed evenly. Place the mixture into an empty shampoo bottle and store in your bathroom until you're ready to bathe your dog."
    },
    {
      "title": "Try castile soap, vinegar, and water.",
      "content": "Try castile soap, vinegar, and water. Another type of natural shampoo can be made with castile soap, vinegar, and water. Make sure to use non-scented castile soap, as it has less irritants. You can buy your ingredients at a drug store or local supermarket. [2] X Research source You can either grate 2 to 3 tablespoons of castile soap flakes from a bar using a cheese grater or you can use 2 to 3 tablespoons of liquid castile soap. Add your castile soap to 4 cups of hot water. Use a spoon to mix until the soap flakes dissolve. Then, add white or apple cider vinegar and mix. Transfer the mixture to a bottle and seal. Always shake the mixture before using it on your dog."
    },
    {
      "title": "Add rosemary water for a shiny coat.",
      "content": "Add rosemary water for a shiny coat. If you want to give your dog's coat some shine after a bath, you can use rosemary water. You can buy fresh rosemary leaves online, or at a local health food store. [3] X Research source Bring 4 cups of water to a boil and add 2 teaspoons of rosemary leaves. Remove the pot from the heat and let it sit for 10 minutes. Then, strain the rosemary out of the water. Set the water aside until it's room temperature. You can pour the water over your dog after a bath, giving her coat a sweet scent and a nice shine."
    },
    {
      "title": "Treat a flea problem with water, vinegar, and baby shampoo.",
      "content": "Treat a flea problem with water, vinegar, and baby shampoo. While it's not scientifically proven to work, you may be able to get rid of fleas by using a natural cleaner. However, make sure to see your vet for a recommendation first, as fleas can spread in your home and infect other pets. You can use water, vinegar, and baby shampoo for a homemade flea bath. [4] X Research source Mix together one quart of water, one cup of white vinegar, and one cup of baby shampoo. Mix all of the ingredients until the mixture is uniform throughout. Use this mixture on your dog during a bath to address a flea problem. Even if the natural flea shampoo doesn't work, the dog may simply benefit from getting a bath because the fleas may drown in the process."
    },
    {
      "title": "Use oatmeal for itchy skin.",
      "content": "Use oatmeal for itchy skin. If your dog keeps itching her skin, an oatmeal bath may alleviate some pain and discomfort. Oatmeal may have some healing properties, and is used in many commercial pet shampoos. To make oatmeal shampoo, all you need is a coffee grinder, food processor, or blender, oatmeal, baking soda, and warm water. [5] X Research source Grind a cup of oatmeal in a coffee grinder, food processor, or blender. Grind it until it has the consistency of flour. Pour the oatmeal into a large bowl and stir in half a cup of baking soda. Gradually add a quart of warm water and mix it all together. To use the mixture on your dog, get your dog wet first and then lather her with the oatmeal mixture. Let it sit for 5 minutes before rinsing off your dog."
    },
    {
      "title": "Go for aloe vera gel for dry skin.",
      "content": "Go for aloe vera gel for dry skin. If your dog has dry or flaky skin, aloe vera gel may be able to help. You can purchase aloe vera gel at a local drugstore or supermarket. You will mix 1 quart of water, 1 cup of baby shampoo, 1 cup of white or apple cider vinegar, 1/3 cup of glycerin, and 2 tablespoon of aloe vera gel. Mix the ingredients until you have a paste that's consistent throughout. [6] X Research source"
    },
    {
      "title": "Learn when a dry bath is needed.",
      "content": "Learn when a dry bath is needed. Sometimes, you may want to bathe your dog with dry shampoo. A dry bath may be optimal if your dog gets smelly or dirty frequently. Bathing her every time you notice a smell can result in dry skin. Dogs should not be bathed more than once a month. If you feel your dog needs a bath more frequently than this, try using a dry bath. [7] X Research source"
    },
    {
      "title": "Make a mixture of baking soda, corn starch, and essential oils.",
      "content": "Make a mixture of baking soda, corn starch, and essential oils. To make a dry bath, you'll mix 1 cup of baking soda, 1 cup of corn starch, and a few drops of essential oils together. Essential oils can be found at a local supermarket, drug store, or health food store. They can also be purchased online. [8] X Research source Be very careful when using essential oils. You should always dilute oils in a carrier oil, like olive oil, before using them directly on your dog's skin. [9] X Research source Do not use Oregano or Thyme oils on animals. You should also be extremely careful not to get essential oils anywhere near your dog's eyes."
    },
    {
      "title": "Sprinkle the mixture over your dog's back.",
      "content": "Sprinkle the mixture over your dog's back. You do not need to use all of the dry shampoo. Sprinkle a small amount along your dog's bath. You may also sprinkle some on top of your dog's head, being careful to avoid your dog's eyes. You should use a cup of the mixture for mid-sized dogs and half a cup for small dogs. [10] X Research source"
    },
    {
      "title": "Rub the mixture into your dog's fur.",
      "content": "Rub the mixture into your dog's fur. Use your fingers to gently massage the mixture into the dog's skin. You can also use a comb if you do not want the mixture to get on your hands. Massage the mixture until its dispersed evenly throughout your dog's coat. [11] X Research source"
    },
    {
      "title": "Brush your dog.",
      "content": "Brush your dog. Allow your dog to shake vigorously when you're done, as this will get a lot of the dry shampoo out of her coat. Then, brush her thoroughly to get rid of the remaining dry shampoo. [12] X Research source Make sure you brush the dog until you do not notice any dry shampoo residue. Baking soda can dry out a dog's skin if it's left on for a long time. [13] X Research source"
    },
    {
      "title": "Avoid products containing toxic ingredients.",
      "content": "Avoid products containing toxic ingredients. When using ingredients like dish soap on your dog, read the ingredient list thoroughly beforehand. You want to make sure the soap does not contain any ingredients that are toxic to a dog's skin. Choose a different brand of dish soap to use if you notice any of the following ingredients listed: [14] X Research source Ammonium Chlorine Glycol Ethers Formaldehyde"
    },
    {
      "title": "Never use laundry detergent in dog shampoo.",
      "content": "Never use laundry detergent in dog shampoo. You should never substitute laundry detergent for dish soap when making homemade dog shampoo. Brands of laundry detergent like Tide, Cheer, and Downey all contain ingredients that are toxic for dogs. [15] X Research source You should also not use things like bathroom cleaners and all-purpose cleaners in place of dish soap."
    },
    {
      "title": "See a vet to treat problems that do not respond to natural treatments.",
      "content": "See a vet to treat problems that do not respond to natural treatments. While all natural cleaners can save you money, certain problems should be addressed by a vet. If your dog has fleas, seek a veterinarian's advice on treatment to prevent the problem from spreading. You should also talk to a vet if your dog has consistently dry, itchy, or flaky skin that does not respond to at home treatments."
    },
    {
      "title": "Watch for signs of an adverse reaction.",
      "content": "Watch for signs of an adverse reaction. Your dog may have an adverse reaction to certain homemade cleaners. If you notice any of the following symptoms, seek veterinary care for your dog immediately: [16] X Research source Red, raw, or blistered skin Drooling or pawing at the mouth Loss of appetite Fever Tearing of the eyes Lethargy"
    }
  ]
}