{
  "url": "https://www.wikihow.com/Add-Your-URL-to-Google",
  "title": "Easy Ways to Submit a Domain or Webpage to Google Search",
  "steps": [
    {
      "title": "Login to the Google Search Console website.",
      "content": "Login to the Google Search Console website. To do so, go to https://search.google.com/search-console/ in a web browser and click Get Started Then sign in to your Google account . If you have Google Analytics set up on your website, sign in to the same Google account you have Google Analytics set up through. This will make the verification process much easier. If you already have a Google Search Console account set up for a different URL, click the drop-down menu with your website URL in the upper-left corner. Click Add property ."
    },
    {
      "title": "Select a property type.",
      "content": "Select a property type. There are two types of properties you can select. They are as follows: Domain: This option allows you to register all URL and subdomains for your website. This includes both \"HTTP\" and \"HTTPS\" protocols as the URL with \"www.\" and without it. It also includes any mobile domains you have. If you select this option, you will need to verify ownership using a DNS record. URL Prefix: This option allows you to register a single URL (i.e. \" https://www.example.com \" or \" http://example.com \". This option gives you multiple options to verify ownership of the URL."
    },
    {
      "title": "Enter your primary URL into the space and click Continue.",
      "content": "Enter your primary URL into the space and click Continue . Open the website you want to add to Google in a new tab. Copy the primary URL from the address bar. Paste it into the example space below \"Domain\" or \"URL Prefix.\" Then click Continue ."
    },
    {
      "title": "Select a verification method.",
      "content": "Select a verification method. If you selected \"Domain,\" you will need to verify your ownership of the domain through your domain name (DNS) provider. Alternatively, if your website is registered through a domain name provider, such as GoDaddy.com, you can select the provider from the list and click Start Verification and follow the instructions. If you selected \"URL Prefix,\" you can select one of the following options to verify ownership: [1] X Research source HTML File: To use this option, download the HTML file provided and upload it to your website. HTML Tag: Click this option and click Copy next to the HTML tag. Paste it into the \"<head>\" section of the HTML file that the URL leads to. Google Analytics: You will need to add the Google Analytics code in the \"<head>\" section of the HTML file that your URL leads to. Once this is confirmed, you will get a notification that your URL has been verified. Google Tag Manager: If you have Google Tag Manager set up on your website, you can use this method to verify your website. You must be logged in to Google Search Console with the same account as your Google Tag Manager account. The tag manager code must be placed immediately after the \"<body>\" tag in the HTML document for the URL. Domain name provider: If you select this option, you will need to click Copy next and then add then log in to your domain name provider and add the copied text as a TXT DNS record. This is the only way to verify ownership if you want to add a domain."
    },
    {
      "title": "Click Verify.",
      "content": "Click Verify . Once you have selected a verification method and done the necessary steps, click Verify . Allow a few days to a few weeks before your website URL displays on Google. If you are submitting a URL prefix to Google, it is recommended that you submit all URL prefixes for the website that you own. This includes the prefix with \"http:\" and \"https:\", as well as the URL with \"www.\" and without \"www.\" at the beginning. Include mobile \"m.\" prefixes if you have them."
    },
    {
      "title": "Login to the Google Search Console website.",
      "content": "Login to the Google Search Console website. To do so, go to https://search.google.com/search-console/ and log in with the Google account that your website is registered with in Google Search Console. If you add a new page to your website, such as a new blog post, you can request that that page be indexed in the Google Search Console."
    },
    {
      "title": "Make sure your primary website is selected.",
      "content": "Make sure your primary website is selected. Check the drop-down menu in the upper-left corner. Make sure your primary website or domain name is selected in the menu. If it is not, use this drop-down menu to select the primary URL for the page you want to add."
    },
    {
      "title": "Copy the page URL you want to submit.",
      "content": "Copy the page URL you want to submit. Open the exact webpage you want to submit in a new browser tab. Copy the exact URL from the address bar."
    },
    {
      "title": "Paste the URL in the Inspect bar at the top of Google Search Console.",
      "content": "Paste the URL in the Inspect bar at the top of Google Search Console. Paste the URL in the search bar that says \"inspect any URL in \"www.yourwebsite.com\" and press Enter . This will inspect the URL and tell you if it has already been indexed or not."
    },
    {
      "title": "Click Request Indexing.",
      "content": "Click Request Indexing . If the inspection returns an alert that says the URL is not on Google, click Request Indexing to add it to Google. Allow a few days to a few weeks for it to be added. To check if the web page has been added to Google, log back into Google Search Console and paste the URL in the inspection bar, and press Enter . It will tell you if it is or is not on Google. If it is not yet on Google, resubmitting it will not move you up in the queue. If you make changes to a page that is already on Google, you paste the URL in the inspection bar and click Request Indexing to get an updated version of the URL indexed in Google."
    },
    {
      "title": "Copy the sitemap URL for your website.",
      "content": "Copy the sitemap URL for your website. If you don't have a sitemap, there are many free tools only you can use to generate a sitemap. You can also create one manually. If you are using a CMS, such as WordPress, Wix, or Squarespace, you probably have a sitemap generated automatically. You can generally find your sitemap at one of the following URL examples: [2] X Research source www.websiteurl.com/sitemap_index.xml www.websiteurl.com/sitemap/sitemap.xml www.websiteurl.com/sitemapindex.xml www.websiteurl.com/sitemap/index.xml www.websiteurl.com/sitemap1.xml www.websiteurl.com/sitemap.php www.websiteurl.com/sitemap.txt www.websiteurl.com/sitemap.xml.gz www.websiteurl.com/sitemap/"
    },
    {
      "title": "Login to the Google Search Console website.",
      "content": "Login to the Google Search Console website. To do so, go to https://search.google.com/search-console/ and log in with the Google account that your website is registered with in Google Search Console. Adding your sitemap to Google Search Console makes it easier for Google web crawlers to index your website more quickly and efficiently as well as allowing you to submit every page of your website all at once."
    },
    {
      "title": "Click Sitemap.",
      "content": "Click Sitemap . It's in the menu bar to the left."
    },
    {
      "title": "Paste your website sitemap URL in the field.",
      "content": "Paste your website sitemap URL in the field. It's the text field below \"Add a new sitemap.\""
    },
    {
      "title": "Click Submit.",
      "content": "Click Submit . It's the blue button on the right side of the sitemap field. This adds your sitemap to Google."
    }
  ]
}