{
  "url": "https://www.wikihow.com/Make-an-ICO-File",
  "title": "How to Make an ICO File on Windows & Mac",
  "steps": [
    {
      "title": "Open https://icoconvert.com/ in your internet browser.",
      "content": "Open https://icoconvert.com/ in your internet browser. Icoconvert is a free online image converter that allows you to upload images and convert them to ICO files . It also has options for creating a style for the ICO image, and you can save it in multiple sizes in one file. This allows the image to scale to different sizes depending on its use. Other image converter sites that work similarly include ICOConverter ( https://www.icoconverter.com ) and Online-Convert ( https://image.online-convert.com/convert-to-ico ). You can use online file converters in all desktop and mobile internet browsers."
    },
    {
      "title": "Click the Choose File button and select an image.",
      "content": "Click the Choose File button and select an image. This button is under the \"Step 1: Upload an Image\" heading at the top. It will open your file navigator window and allow you to select your image. Use the navigation window to navigate to the image file you want to select, then click Open ."
    },
    {
      "title": "Click Upload.",
      "content": "Click Upload . It's the large file below the \"Choose File\" button. This uploads the file to the website. Allow a few minutes for it to complete."
    },
    {
      "title": "Crop the image (optional).",
      "content": "Crop the image (optional). Cropping your image allows you to trim the excess areas around the image that you don't want to use. Click and drag a square around the area of the image you want to keep."
    },
    {
      "title": "Select a style (optional).",
      "content": "Select a style (optional). Icoconvert allows you to select different styles for your ICO images. These styles are different image shapes and borders. To select a style, scroll down and click the styles you want to use below the \"Step 3. Apply Styles\" header. You can select more than one style."
    },
    {
      "title": "Select an icon format.",
      "content": "Select an icon format. If you want to make an ICO file for Windows, select ICO for Windows 10, 11, 7, and 8 . If you want to make a custom icon size, select Custom sizes . ICO files can be multiple sizes that scale to fit their use. If you want to keep the ICO file the same size as the image you uploaded, select \"Custom sizes\" and click the radio option next to \"Original Size.\" If you want to adjust the file size or create a scalable ICO file, click the radio option next to \"Multi-size in one icon\" and then click the checkbox next to all the sizes you want the ICO file to be able to take. You'll also have the option to make a Favicon for your website or a PNG file for other platforms."
    },
    {
      "title": "Click Convert ICO.",
      "content": "Click Convert ICO . It's the first button below \"Steps 5. Convert and Download.\" This converts the file you uploaded to the image file that you selected. Alternatively, you can click PNG to ICO to convert a PNG file to an ICO file. Click Resize image to change the image size. Click Compress image to make the image file size smaller, and click PNG to SVG to convert a PNG file to a scalable vector graphic file."
    },
    {
      "title": "Click Download your icon(s).",
      "content": "Click Download your icon(s) . It's the blue text that appears below the \"Convert ICO\" button when you click it. This downloads your image files in the file format you selected. You can find your image files in your \"Downloads\" folder."
    },
    {
      "title": "Open MS Paint.",
      "content": "Open MS Paint. Paint is a basic graphics editing program that comes preinstalled on all versions of Windows, including Windows 10 and Windows 11. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You can use Paint to create files you can easily convert to ICO files. To open it, type paint into the Windows search bar and click Paint in the search results. If you're using Windows 11, the latest version of Paint allows you to create a transparent background for your icon."
    },
    {
      "title": "Create or open an image.",
      "content": "Create or open an image. To open an existing image you want to convert to an ICO, go to File > Open and select the file. Alternatively, you can use the Paint tools to draw your own image. Because Paint for Windows 11 now features layers, you create an icon in Paint and make the background layer transparent. However, this won't work if you open an existing image in Paint."
    },
    {
      "title": "Resize the image so that it is the size of an icon.",
      "content": "Resize the image so that it is the size of an icon. Most ICO files are typically square images that are 32 x 32 pixels. They can be as large as 256 x 256 pixels or as small as 16 x 16 pixels. Larger files can scale down to smaller sizes, but small files cannot be enlarged without looking pixelated and distorted. To resize the image: In Windows 10, click Resize in the box that says \"Image\" in the menu bar at the top. On Windows 11, click the icon in the \"Image\" panel that looks like a drawing of a mountain with an arrow pointing up and to the right. Click the radio option next to Pixels . Enter the height and width of the file in pixels (i.e., 256 x 256) next to \"Vertical\" and \"Horizontal.\" If it doesn't let you make the two values the same, click the chain icon to unlink the sizes (Windows 11) or uncheck \"Maintain aspect ratio\" (Windows 10). Click OK ."
    },
    {
      "title": "Make the background transparent (Windows 11 only).",
      "content": "Make the background transparent (Windows 11 only). If you only want to keep the subject of your icon and not the background, you can make the background transparent. This will only work if you drew the icon in Paint and didn't open an existing image file. Click Layers at the top-right to show the layers. Hover your mouse over the background layer at the bottom of the layers list. Click the eye icon on the background layer to hide it. The background will now have a gray checkerboard pattern to indicate that it is transparent."
    },
    {
      "title": "Save the file as a PNG file.",
      "content": "Save the file as a PNG file. This common file type is easy to convert to ICO and retains background transparency if present. Here's how: Click File menu and select Save as . Select the PNG file type. Type a file name and saving location. Click Save ."
    },
    {
      "title": "Use ICOConvert to convert the PNG to an ICO file.",
      "content": "Use ICOConvert to convert the PNG to an ICO file. Go to https://icoconvert.com/ and use the instructions in our Online File Converter method to convert your creation to the ICO format. You can now apply the icon as a shortcut on your desktop."
    },
    {
      "title": "Open the image you want to convert in Preview.",
      "content": "Open the image you want to convert in Preview. Typically, you can open an image in Preview by double-clicking the file. If Preview is not your default image viewer, you can use the following steps to open an image in Preview. Right-click (or Command-click) the image. Select Open with . Click Preview.app . Just keep in mind that the ICO format is Windows-specific, so you won't be able to use these icons on your Mac. Mac icons use the .ICNS format."
    },
    {
      "title": "Resize the image to a square in the size of an icon.",
      "content": "Resize the image to a square in the size of an icon. Most ICO files are typically square images that are 32 x 32 pixels. They can be as large as 256 x 256 pixels or as small as 16 x16 pixels. Larger files can scale down to smaller sizes, but small files cannot be enlarged without looking pixelated and distorted. To resize the image : Click the Markup icon at the top (the marker icon) if the Markup toolbar isn't showing. [2] X Research source Click the Adjust Size button, which is a square with smaller squares and rectangles inside. Select Pixels in the drop-down menu to the right in the \"Images Dimensions\" window. Enter the desired sizes into the boxes next to \"Height\" and \"Width.\" Click OK ."
    },
    {
      "title": "Export the image as an ICO file.",
      "content": "Export the image as an ICO file. When you export an image, the drop-down menu next to \"Format\" gives you a selection of a few different file formats to export the image as. If you hold Option and click the drop-down menu, it gives you an extended list of file formats, including the option to export the image as an ICO file for Windows icons. [3] X Research source Click File in the menu bar at the top. Click Export . Enter a file name next to \"Export as\". Hold the Option key and click the drop-down menu next to Format . Select Microsoft Icon . Alternatively, if you wanted to make this a Mac icon, you could save the icon in the ICNS format. Click Save ."
    },
    {
      "title": "Open or create a new image file in Photoshop.",
      "content": "Open or create a new image file in Photoshop. While Photoshop won't let you save an ICO file, you can use it to create your icon as a PNG or JPEG and then convert it to ICO with an online converter. You can open or create a new file at any time in Photoshop by clicking File in the menu bar at the top, followed by New or Open . If you are creating a new image file, you will be asked to select the dimensions. The dimensions of an ICO file are typically 32 x 32 pixels, but start with 256 x 256 if you want to work with a bigger canvas. Larger images can scale down to smaller image sizes, but small image sizes cannot be enlarged without the image looking pixelated and distorted. Make sure you use RGB color mode in Photoshop, not CMYK."
    },
    {
      "title": "Resize the image to the size of an icon (if needed).",
      "content": "Resize the image to the size of an icon (if needed). If you opened an existing file, you may need to resize the image to be the size of an icon. Icons are typically 32x32, but they can range in size from 16 x 16 to 256 x 256. Click Image in the menu bar at the top. Select \" Pixels \" in drop-down menus next to \"Width\" and \"Height.\" Enter the size of the image in the boxes next to \"Width\" and \"Height.\" Click OK ."
    },
    {
      "title": "Save the image as a PNG file.",
      "content": "Save the image as a PNG file. This common file type is easy to convert to ICO. If your icon has a transparent background , the PNG file format will preserve it. Go to File > Save a Copy . Select PNG and give the file a name that ends with the .png file extension. Click Save ."
    },
    {
      "title": "Use ICOConvert to convert the PNG to an ICO file.",
      "content": "Use ICOConvert to convert the PNG to an ICO file. Go to https://icoconvert.com/ and use the instructions in our Online File Converter method to convert your creation to the ICO format. You can now apply the icon as a shortcut on your desktop."
    }
  ]
}