{
  "url": "https://www.wikihow.com/Move-on-from-the-Past-in-a-Relationship",
  "title": "How to Move on from a Past Relationship",
  "steps": [
    {
      "title": "Give yourself time to process any feelings related to the past.",
      "content": "Give yourself time to process any feelings related to the past. Try to label your emotions as they come, either by journaling or simply saying how you feel out loud. If you want to cry, scream, or shout, that’s okay, too. We promise you won’t feel this way forever. In the mean time, accepting your emotions without judgment will let you move on in a healthy way. [1] X Research source However you feel is valid and real. The feelings of grief and rejection that can come with separating from a partner actually activate the same area in your brain as physical pain, but know that the pain is temporary. [2] X Trustworthy Source Proceedings of the National Academy of Sciences Official peer-reviewed and multidisciplary journal for the National Academy of Sciences. Go to source"
    },
    {
      "title": "Romanticizing past partners can make it hard to move on.",
      "content": "Romanticizing past partners can make it hard to move on. It’s completely normal to hold onto the imaginary future you envisioned with an ex rather than seeing the reality of the relationship. Think back on all the love and wonderful experiences you shared with your partner. At the same time, take a second to recognize your former partner’s flaws and any problems, fights, and pet peeves from your relationship. Comparing past relationships to present relationships makes it easier to be critical of potential new partners. By remembering the reasons why you and your ex broke up, you can open yourself up to new people and possibilities."
    },
    {
      "title": "It’s hard to heal when you’re confused or angry about your breakup.",
      "content": "It’s hard to heal when you’re confused or angry about your breakup. Whether you saw your breakup coming from a mile away, or whether you feel blindsided, it’s completely understandable to hold onto negative emotions. Here are key steps to start letting go of that resentment so you can free yourself and move on: [3] X Research source Rather than blaming yourself or your partner, think of the broader causes that might’ve led to your breakup (ex. wounds from old relationships, mental health, finances, life stage etc.). Take control of your story. Try to see the events of the breakup as they are, and focus on a positive future full of love. Practice gratitude. Think about the incredible relationships and opportunities you have right now in your life."
    },
    {
      "title": "Forgiveness makes it easier to move on from negative emotions.",
      "content": "Forgiveness makes it easier to move on from negative emotions. While it’s normal to think back again and again on the past, at a certain point, it’s healthier to commit to changing your thought patterns. Acknowledge your partner’s role in any past hurt, and acknowledge any hurt you might’ve done to them. Then—we know it’s a tough ask—try to make the choice to forgive your partner and forgive yourself. [4] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Use forgiveness as a turning point to refocus on yourself and what you need in the future, rather than what you want to change in the past. You don’t have to reach out to your partner in order to forgive them. Forgiveness can be a personal process and mindset shift, too."
    },
    {
      "title": "It’s hard to let go when you see reminders of your past relationship.",
      "content": "It’s hard to let go when you see reminders of your past relationship. Try not to contact your ex, either in real life or on social media. You can unfollow them, block their number, and delete old pictures of the two of you. It might also help to box up any mementos of your relationship, like gifts and old photos. If your ex reaches out to you, let them know you need time and space to heal and process. [5] X Research source Similarly, steer clear of physical intimacy with an ex if you want to move on and form healthier, stable relationships. [6] X Research source"
    },
    {
      "title": "Social support can help you through tough times.",
      "content": "Social support can help you through tough times. It’s easy to feel lonely as you try to move on, but you’re definitely not alone. Try to connect with friends and family face-to-face and share how you’re feeling with them. Call up a friend you haven’t talked to in a while. You can also join a community organization or local club to make new friends and build connections. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If reaching out to people doesn’t come naturally to you, that’s okay. You can find a built-in, supportive community by joining a local or online support group. Reader Poll: We asked 523 wikiHow readers who they’d reach out to if they needed to vent about their love life or heartbreak, and 53% said they’d connect with their closest friends to find the support they need. [Take Poll]"
    },
    {
      "title": "Create new routines to take care of yourself and your body.",
      "content": "Create new routines to take care of yourself and your body. As you let go of a past relationship, healthy routines can create stability, even when it feels like a major part of your life has changed. [8] X Research source Start by setting a time to sleep and wake up every day. Then, reinforce healthy habits by aiming for 30 minutes of exercise, eating a healthy diet, and keeping up good personal hygiene. Treat yourself to a massage, a spa day, or even a night at home with tasty snacks and your favorite movie."
    },
    {
      "title": "As you move on from the past, you have a huge opportunity for growth.",
      "content": "As you move on from the past, you have a huge opportunity for growth. Maybe you’ve always wanted to try out Brazilian jiu-jitsu or take a cooking class. You might’ve dreamed about traveling to Rome or volunteering at an afterschool program. Use this time to re-invent how you think and feel about yourself and your capabilities. [9] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Try making a list of everything you want to do. Aim to cross 1 item off that list every day. [10] X Research source"
    },
    {
      "title": "Use this time to learn what you want and need from future relationships.",
      "content": "Use this time to learn what you want and need from future relationships. Despite all the hurt, your past can still have a positive and meaningful impact on your future. Is there anything you want to do differently moving forward? Sit down and write out a few goals or strategies for future relationships. [11] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source [12] X Research source Here’s a list of questions to help you reflect: [13] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source What role did you play in any past relationship conflicts? Do you see any trends in your past relationships or choice of partners? How do you react to stress and conflict in relationships? What traits do you want in a future partner? What traits do you want to avoid?"
    },
    {
      "title": "Catch your inner critic and focus on positive, hopeful statements.",
      "content": "Catch your inner critic and focus on positive, hopeful statements. Look out for thoughts that use absolutes like “never” and “always.” Similarly, watch out for self-blaming statements that use words like “should’ve” or “must.” As a good test, check if the way you’re talking to yourself is how you’d talk to a friend or loved one. When negative words come through your head, spin them into encouraging statements. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Rephrase a negative statement into a mantra like, “I deserve love, and I’m going to find someone incredible.” Give yourself credit for trying, even if you aren’t perfect (none of us are). For instance, “The relationship didn’t work out, but I gave it my best shot.” If you make a mistake, change a self-blaming thought with language like, “I messed up a little, but that doesn’t mean I’m a bad person or a bad partner.”"
    },
    {
      "title": "Take your time to heal and ease into new relationships.",
      "content": "Take your time to heal and ease into new relationships. It can be tempting to jump into a rebound relationship but take time to process your emotions and connect with yourself before you start dating again. By focusing on what makes you happy and rediscovering parts of yourself that you might have lost in the past, you can form more authentic relationships moving forward. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source There’s no set amount of time to wait before starting a new relationship. Typically the longer you were together and the more involved you were in each others’ lives (ex. living together, raising kids together), the longer you’ll need before falling in love again. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source You’ll know you’re ready to be a committed partner again when you know what you want from a relationship and know what you can give in a relationship. [17] X Research source"
    },
    {
      "title": "There’s more than one person out there for you.",
      "content": "There’s more than one person out there for you. Even though it may not feel like it now, you will find someone and you can fall in love again. Your next partner might not be exactly who you expect or check every box. To keep an open mind, try to come up with the 3 traits that are most important to you in your future partner. [18] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Your 3 traits can be about personality, appearance, or other characteristics. For instance, you might want a future partner who’s dedicated to community service, athletic, and who shares your religion. Research shows you can still have a healthy, fulfilling relationship even if you haven’t completely resolved feelings towards your former partner. In fact, getting into a new relationship after you’ve taken time to work on yourself can help you move on. [19] X Research source"
    },
    {
      "title": "Everyone needs extra help from time to time.",
      "content": "Everyone needs extra help from time to time. Talk to your primary care physician for a referral to a therapist or look for an online counseling service like Better Help or Talkspace. If your feelings about the past start to get in the way of daily life, that could be a sign of depression or anxiety. [20] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source A mental health professional can also help you work through PTSD, trauma, and trust issues, especially if you're moving on from a toxic relationship. If you can’t afford therapy, check out free peer-lead support groups at https://www.nami.org/Support-Education/Support-Groups/NAMI-Connection ."
    }
  ]
}