{
  "url": "https://www.wikihow.com/Go-to-the-Bathroom-in-the-Woods",
  "title": "An Expert Guide to Using the Bathroom Outdoors",
  "steps": [
    {
      "title": "Pack a bag with hand sanitizer, toilet paper, and a small trowel.",
      "content": "Pack a bag with hand sanitizer, toilet paper, and a small trowel. A rule when it comes to mastering the great outdoors is to be prepared. This means packing essential bathroom toiletries like toilet paper, unscented or biodegradable wipes, a trowel to dig a cathole for bowel movement, WAG (bag made for disposing of human waste) or plastic sealable bags, and hand sanitizer. [1] X Research source If you’re looking for zero-waste options, you can pack a portable bidet to clean yourself up after doing your business. When disposing of any toilet paper or wipes, be sure to purchase a plastic bag that isn’t see-through."
    },
    {
      "title": "Stay at least 200 feet (61 m) from water, trails, and campsites.",
      "content": "Stay at least 200 feet (61 m) from water, trails, and campsites. This is to prevent water contamination and the spread of disease and ensure you don’t disrupt the trail or other hikers. Before picking a spot, look around and make sure you’re not near bodies of water like streams, lakes, rivers, trails, or campsites. [2] X Research source Walking 75 paces should ensure that you’re far enough away. The only time you can urinate in natural bodies of water is it the waterway has a high flow rate of over 500 CFS (Cubic Feet per Second). The high flow rate will be enough to dilute any contaminants in your urine. [3] X Research source"
    },
    {
      "title": "Find a secluded spot with large rocks, bushes or trees.",
      "content": "Find a secluded spot with large rocks, bushes or trees. Look for a spot that isn’t entirely out in the open and is on relatively flat land for some privacy. You may need to walk farther into the woods to find a secluded spot, so pay attention to your location. [4] X Research source"
    },
    {
      "title": "Watch out for poison ivy, ant hills, and bee nests.",
      "content": "Watch out for poison ivy, ant hills, and bee nests. These are things you definitely want to avoid when choosing a bathroom spot. It’s also a good idea to look out for any other dangerous or poisonous plants or animals when picking out a bathroom location so that you don’t have to worry about getting hurt. [5] X Research source Spot poison ivy by looking for plants with clusters of three leaves."
    },
    {
      "title": "Locate a backcountry outhouse as an alternative.",
      "content": "Locate a backcountry outhouse as an alternative. If you’re going on a popular backpacking trail, there will likely be a backcountry outhouse along your route—or at least not too far out of the way. These outhouses are designed as pit toilets, large holes in the ground covered by a wooden seat, where people can come and use the bathroom at their leisure. You’ll still need to bring your own toilet paper, wipes, and sanitizer, though! [6] X Research source If you aren’t sure, you can always call the organization that manages the trails for more information on backcountry outhouses that may be available to you."
    },
    {
      "title": "Dig a cathole at least 6 inches (15 cm) deep for a bowel movement.",
      "content": "Dig a cathole at least 6 inches (15 cm) deep for a bowel movement. A cathole is the name for a hole used for human waste. Make sure the hole is about 6–8 inches (15–20 cm) across. A good rule of thumb is to make sure the hole is at least as deep as your hand is long. Use a small trowel to dig the hole, or try using a rock or study stick if you don’t have a trowel. [7] X Research source If you’re in the woods in the snow, the hole should extend 6 inches (15 cm) below ground level, not just the snow Opt for a spot in the sun, as this can help speed up decomposition. [8] X Research source"
    },
    {
      "title": "Cover your waste with a rock in areas where you can’t dig a hole.",
      "content": "Cover your waste with a rock in areas where you can’t dig a hole. A trowel may not be strong enough to dig a hole in arid or rocky areas. Instead, find a rock large enough to cover your bowel movement but not too large that you can’t move it. Roll it to the side. Generally, the soil beneath a rock is either soft or has a slight indent in the ground because of the rock’s weight. Poop there, rolling the rock back into place when you’re done. [9] X Research source"
    },
    {
      "title": "Use a disposable toilet kit for carry-everything-out areas.",
      "content": "Use a disposable toilet kit for carry-everything-out areas. Some trails have a mandatory carry-everything-out program, which includes your bodily waste. Place a WAG bag or a similar disposable toilet kit beneath you. Squat or support yourself on a rock, log, or tree to do your business. Then, wrap or tie the bag up to secure your waste. You may want to double bag it in another WAG or sealable bag for proper disposal later. [10] X Research source"
    },
    {
      "title": "Squat low and ensure your clothing isn’t in the way before you do your business.",
      "content": "Squat low and ensure your clothing isn’t in the way before you do your business. Squatting as low as you can will make it easier for you to defecate. If your clothes are slightly below your knees, they shouldn’t get in the way. [11] X Research source If you can’t hold a squat, position yourself partway on a rock or log. You can also use the “Throne” method. Find a tree on an upward slant. Rest your back against the tree to get into a proper squat position. [12] X Research source"
    },
    {
      "title": "Wipe using toilet paper or baby wipes.",
      "content": "Wipe using toilet paper or baby wipes. If you brought these supplies with you, remove them from your toiletry bag. If you don’t have toilet paper, tissues, or wipes with you, look for a smooth leaf (making sure it’s not poisonous) to use instead. [13] X Research source If you’re not sure whether a leaf is poisonous or not, it’s best not use it."
    },
    {
      "title": "Pack out your used toilet paper.",
      "content": "Pack out your used toilet paper. Instead of burying it, place your used toilet paper or baby wipes in a sealable plastic bag. If you are out in the woods for several days, bring several empty plastic bags or one larger one to contain all your used paper. [14] X Research source Animals will dig up the used toilet paper which is why you shouldn’t bury it. This bag should be kept in your toiletry bag. If you’re using leaves you found nearby, these can go directly into the hole."
    },
    {
      "title": "Fill the hole with soil using the trowel.",
      "content": "Fill the hole with soil using the trowel. When you're finished, you'll want to make sure that you cover the hole and your business with the soil you scooped out. Make sure the ground is nice and flat so it won’t attract the attention of any animals. [15] X Research source Your trowel should never touch any waste, so only use it to scoop soil back into the hole. Try walking on the hole to compact the soil. Use pine needles, twigs, or leaves on the ground to help cover up where you dug."
    },
    {
      "title": "Place a stick upright where you dug the hole.",
      "content": "Place a stick upright where you dug the hole. This is to indicate to others that this is where you used the bathroom. The stick doesn’t need to be very big - 6 inches (15 cm) is long enough. Place it vertically in the soil, ensuring that it won’t fall over. [16] X Research source You can also place a medium-sized rock on top of the spot if you can’t find a stick."
    },
    {
      "title": "Use hand sanitizer to clean your hands once you’re done.",
      "content": "Use hand sanitizer to clean your hands once you’re done. This will ensure you don’t have lingering germs on your hands. [17] X Research source Use just a drop or two of the hand sanitizer. It’s a good idea to put the hand sanitizer in its own small plastic bag inside your toiletries bag to ensure it stays germ-free."
    },
    {
      "title": "Stand on even ground if you’re urinating.",
      "content": "Stand on even ground if you’re urinating. Look for a flat spot, especially if you have to squat. If you can’t find a flat spot, at least ensure you’re facing a downward slope to avoid getting in the way of runoff. [18] X Research source Squat down to urinate if you're a female. It’s not necessary to dig a hole if you’re peeing, although you can if desired. Opt for durable surfaces like pine duff or rocks if possible."
    },
    {
      "title": "Pack out your toilet paper, if you used it.",
      "content": "Pack out your toilet paper, if you used it. Instead of burying it, place your used toilet paper or baby wipes in a sealable plastic bag. Dispose of them in the trash later so animals don't dig them up. Or, use a pee cloth or a kula-cloth as a zero-waste alternative to toilet paper. These absorb your pee and air dry without creating bacteria."
    },
    {
      "title": "Use a pee funnel as an alternative to squatting.",
      "content": "Use a pee funnel as an alternative to squatting. Also called Female Urination Devices (FUDs) is an alternative method for people who aren’t comfortable fully exposing themselves. FUDs are straw or funnel-shaped plastic extenders that allow you to urinate while standing and wearing pants. Use a FUD by placing the cup or tube between your legs directly under your urethra. Tilt your pelvis forward slightly and relieve yourself. [19] X Research source"
    },
    {
      "title": "Opt for a menstrual cup for a zero-waste option.",
      "content": "Opt for a menstrual cup for a zero-waste option. A menstrual cup will capture any blood accumulated from your period. When you’re ready to dispose of your menstrual cup, dig a cathole as you would when pooping. Cover the hole using your trowel, only to touch the dirt. Rinse your menstrual cup with drinkable water before placing it back in. [20] X Research source"
    },
    {
      "title": "Dispose of tampons or pads in a resealable bag.",
      "content": "Dispose of tampons or pads in a resealable bag. If you’re more comfortable using tampons or pads, that’s okay! Use a ziplock or small garbage bag to dispose of used hygiene products and applicators. You may want to double-seal these to avoid any smells or potential leakages until you can properly dispose of them. [21] X Research source"
    }
  ]
}