{
  "url": "https://www.wikihow.com/Replace-the-Dishwasher%E2%80%99s-Drain-and-Wash-Impeller",
  "title": "How to Replace the Dishwasher’s Drain and Wash Impeller",
  "steps": [
    {
      "title": "Remove the dishwasher’s lower dish rack and set it aside.",
      "content": "Remove the dishwasher’s lower dish rack and set it aside. Unscrew the nut that holds the lower spray arm. Take note of the little bushing in the spray arm. You'll need to re-attach that bushing in the same position."
    },
    {
      "title": "In the top cover, there are eight screws that need removing.",
      "content": "In the top cover, there are eight screws that need removing. Use a #15 Torx driver on those screws. The spray tower is held with a friction fit from the rubber from the tower. Pull that out and set it aside."
    },
    {
      "title": "Remove the center screw in the impeller with a ¼-inch nut driver and the adjustable wrench.",
      "content": "Remove the center screw in the impeller with a ¼-inch nut driver and the adjustable wrench. There is a hex shape nut on top of the impeller and that’s molded into it. Hold the impeller with the wrench and remove the screw."
    },
    {
      "title": "Four screws are now visible and hold the chamber in place.",
      "content": "Four screws are now visible and hold the chamber in place. Use the #21 Torx driver and remove these screws. Lift the filter housing out of the dishwasher and set it aside. Note : Water may be left in the housing, so use a towel or sponge to dry it up."
    },
    {
      "title": "Lift the chopper blade and the bushing connected to it out.",
      "content": "Lift the chopper blade and the bushing connected to it out. Next, with the #15 Torx driver, remove this one screw that connects to the drain impeller and set it aside."
    },
    {
      "title": "Take the flat blade screwdriver and pop the old seal from underneath the housing.",
      "content": "Take the flat blade screwdriver and pop the old seal from underneath the housing. Take a rag and wipe out that area to get a clean surface to adhere the new seal to."
    },
    {
      "title": "Inspect the new seal.",
      "content": "Inspect the new seal. Before you put in the new seal, verify there are no chips or cracks on the surface. This is a pressure seal and the face of it connects to the stainless steel bottom of the drain impeller, so it needs to fit perfectly. If required, lubricate it with some water along the edge to make it slide into place easier and so it won’t bind to the motor shaft."
    },
    {
      "title": "Install the drain impeller and re-install the cover and single screw that holds it in place.",
      "content": "Install the drain impeller and re-install the cover and single screw that holds it in place. The cover should not be flat when the screw goes in. If it does lay flat, then the cover won’t sit far enough down the pump housing and it won’t create a good seal."
    },
    {
      "title": "Re-install the chopper and connect the bushing to it.",
      "content": "Re-install the chopper and connect the bushing to it. The bushing has a notch that will fit into a hole on top the top of the drain impeller and also a hook into the chopper blade."
    },
    {
      "title": "Re-install the filter housing.",
      "content": "Re-install the filter housing. The four screws are not symmetrical with the body of the pump so line those up. Loosely replace the screws with the number #20 Torx driver. Note – Do not over tighten the screws. This may cause the filter housing to warp."
    },
    {
      "title": "Before reinstalling the impeller, take note of the difference in the lengths of the two shafts.",
      "content": "Before reinstalling the impeller, take note of the difference in the lengths of the two shafts. The impeller is flat on one side. The flat slide sits on top of the post in the drain impeller. Push the circulation impeller down this post. When it’s near the bottom of the post, take the adjustable wrench and put it on the impeller. Then: Hold the impeller with the wrench and tighten the screw. Check that it turns freely and is not scraping."
    },
    {
      "title": "Remove the gasket for the pump cover with a flat blade screwdriver.",
      "content": "Remove the gasket for the pump cover with a flat blade screwdriver. Fit it into the opening, peel the old gasket out, and install the new one. Tip : Check that the channel is clean and no food debris or soap crud is present if so then clean it out."
    },
    {
      "title": "Re-install the pump cover.",
      "content": "Re-install the pump cover. Insert the outlet hose into the water tower at the back. Loosely install the eight screws to secure the cover to the pump. Tighten every second screw to prevent the cover warping and follow the same procedure with the next set of screws. Tip : Take care not to drop any of the screws at this point as they will go down the drain and you’ll have to uninstall everything to get to these screws."
    },
    {
      "title": "Install the lower bearing for the bottom spray arm and put the spray arm in place.",
      "content": "Install the lower bearing for the bottom spray arm and put the spray arm in place. Verify the arms are turning freely. Your dishwasher’s drain and wash impeller has been repaired!"
    }
  ]
}