{
  "url": "https://www.wikihow.com/Play-Downball",
  "title": "How to Play Downball",
  "steps": [
    {
      "title": "Follow the rules.",
      "content": "Follow the rules. They are quite simple. There is a king, queen, jack, and dunce (like any 4 square) or if you are playing 2 square then it is only king and dunce."
    },
    {
      "title": "Serve.",
      "content": "Serve. The king serves the ball, bouncing the ball (you can buy rubber ones in most sport shops, if you can't just use tennis ball) in his square first then it lands in an opponents square. The player who receives the ball hits it by hitting it in his square first which goes into another square [1] X Research source"
    },
    {
      "title": "Game play continues until one of these things occurs:",
      "content": "Game play continues until one of these things occurs: The ball is hit out (that means out of the squares) [2] X Research source Once someone gets out they swap with the person below them. For example, King gets out and has to swap with Queen. The ball is fulled (meaning that the player hit the ball into his opponent's square without first hitting it into his own) This is called straight. The ball is double bounced (meaning that the ball is hit, but does not reach another square on the second bounce) The ball may bounce in a square, then be hit into that square and then from there into the next square, although this is optional. You may let it not bounce If a line call (where it bounces in the middle of the squares) is unclear, then it is deemed a 'liner', where whoever gets the ball first bounces the ball into middle the of the squares,(in the middle of all points of squares) and when the ball bounces game play resumes The ball is double touched (by a person on any part of body or clothing)"
    },
    {
      "title": "Learn the other rules used during the playing of this game.",
      "content": "Learn the other rules used during the playing of this game."
    },
    {
      "title": "Know how Reserves work.",
      "content": "Know how Reserves work. There is a thing called Reserves. With reserves you can play handball with over four player, though might be little boring for the reserve. A reserve sits on the sideline until Dunce gets out. Once Dunce gets out it swaps with the first reserve and the person just in Dunce goes into Reserve. If you have four Reserves then once Dunce gets out the first reserve goes into Dunce. The person in second reserve becomes first reserve. The person in third reserve becomes second reserve and the person who just got out goes to fourth reserve"
    },
    {
      "title": "Use footsies and headsies.",
      "content": "Use footsies and headsies. Those are when you kick the ball or head the ball. When you kick or header it you are allowed to do fulls with the ball (hitting it over line without bouncing in your square first. During the playing of the game the player in the King Square can call a certain number of squares such as Top, middle, or bottom 4, for the amount of players they want out during that round."
    },
    {
      "title": "Try modifying the rules.",
      "content": "Try modifying the rules. You may change the rules if you want but the main thing is that there are 4 squares or 2 squares and there is always king, queen, jack and dunce."
    },
    {
      "title": "Opt for eight squares.",
      "content": "Opt for eight squares. If you want to play 8 square then you would have to split a square in half. It is actually more fun to play this in squares larger than those of ordinary 4 square. The optimal playing field is to use rectangular parking spaces in a line"
    }
  ]
}