{
  "url": "https://www.wikihow.com/Grow-Ivy-from-Cuttings",
  "title": "How to Propagate Ivy from Clippings",
  "steps": [
    {
      "title": "Take cuttings from ivy in the late summer or early fall.",
      "content": "Take cuttings from ivy in the late summer or early fall. From English Ivy to Swedish Ivy, all ivy varieties produce new growth in the late summer or early fall, making this an excellent time of year to take cuttings for propagation. Additionally, taking cuttings between the late summer to early fall ensures that the timing is right for planting your new ivy in the spring if you’re planning on moving them outside. [1] X Research source Whether you plan to propagate your clippings in soil or water (either method is equally effective for any ivy variety), take your cuttings in the late summer and early fall months. Aim to take cuttings before the cold weather sets in."
    },
    {
      "title": "Look for young, fresh growth on an existing ivy plant.",
      "content": "Look for young, fresh growth on an existing ivy plant. Identify new growth by looking for the parts of the ivy plant that look fresh and light green rather than the older areas with dark green leaves and thick stems. Ivy clippings taken from the current year’s growth are most likely to succeed in the propagation process—hello, new plant friends! [2] X Research source Taking cuttings from this year’s growth is also known as semi-ripe cutting."
    },
    {
      "title": "Cut a 5 in (13 cm) ivy stem with 3 to 4 nodes using pruning shears.",
      "content": "Cut a 5 in (13 cm) ivy stem with 3 to 4 nodes using pruning shears . Hold the stem with 1 hand just above one of the nodes (the point where the leaves branch off the stem). Then, use a pair of clean cutting shears to cut a 5-inch (13 cm) ivy clipping at a 45-degree angle. [3] X Research source Avoid cutting ivy stems with damaged leaves or unusual growth patterns. Sanitize your pruning shears between cuttings by wiping isopropyl or rubbing alcohol over the surface of the shears. [4] X Research source"
    },
    {
      "title": "Wrap the cuttings in a damp towel and put them in a plastic bag.",
      "content": "Wrap the cuttings in a damp towel and put them in a plastic bag. Wet a paper towel or rag and carefully wrap it around the cut ends of your ivy stems. Then, place your wrapped cuttings in a plastic bag to help keep them moist as you prepare to plant them. [5] X Research source Wrapping your cuttings in a damp paper towel is especially important if you're waiting to put your cuttings in soil for an hour or more. Take your cuttings in the morning, as the ivy will likely be covered in dew which may help keep your cuttings moist and happy."
    },
    {
      "title": "Select a 8 in (20 cm) pot to insert your cutting(s) into.",
      "content": "Select a 8 in (20 cm) pot to insert your cutting(s) into. If you plan on doing 6 cuttings or less, go for a standard 8 in (20 cm) pot. Plant ivy cuttings in any type of pot, including terra cotta, plastic, and ceramic—just make sure it has drainage holes at the bottom. [6] X Research source Putting several cuttings in one pot will reduce the space required for the cuttings and mean fewer pots to water. Who doesn't love less work? If you plan on taking more than 6 cuttings, go for a larger pot, or opt to plant your cuttings in several pots instead."
    },
    {
      "title": "Fill each pot with 1 part sand and 1 part perlite and water it.",
      "content": "Fill each pot with 1 part sand and 1 part perlite and water it. Start by filling a pot with 1 part sand and 1 part perlite , leaving about 1 ⁄ 2 inch (1.3 cm) of space from the edge. Then, place the pot over a sink or set it outside, and fill the pot with water until it runs out of the bottom. [7] X Research source Leaving the soil below the edge of the pot will allow you to water the cuttings without the water overflowing."
    },
    {
      "title": "Poke holes in the soil 2 inches (5.1 cm) apart around the edge of the pot.",
      "content": "Poke holes in the soil 2 inches (5.1 cm) apart around the edge of the pot. Use the eraser end of a pencil to poke holes 3 inches (7.6 cm) deep. This will allow you to insert the cuttings into the soil without moving the rooting powder off the end of the cutting. [8] X Research source Make as many holes as you have cuttings. Skewers, dowels, or other small pointed objects are effective tools to help you poke holes in the soil."
    },
    {
      "title": "Trim an additional 1⁄2 inch (1.3 cm) off the ends of the cuttings.",
      "content": "Trim an additional 1 ⁄ 2 inch (1.3 cm) off the ends of the cuttings. Using your pruning shears , trim 1 ⁄ 2 inch (1.3 cm) from the end of your cuttings at a 45-degree angle. Then, prune away any leaves within 3 inches (7.6 cm) off the end of the cutting. This will give you a clean, fresh end to insert into the soil. [9] X Research source Re-cutting the ends of your ivy clippings is especially important if you gathered them longer than an hour ago, as the cuttings are more likely to have dried out."
    },
    {
      "title": "Dip the cut end of each cutting in rooting hormone.",
      "content": "Dip the cut end of each cutting in rooting hormone . Pour some of your rooting hormone into a cup. Then, dip the bottom 1–2 inches (2.5–5.1 cm) of the cut end of your ivy into the hormone powder. Finish by carefully lifting the clipping out and lightly tapping it to knock off any excess hormone. [10] X Research source Rooting powder is a chemical designed to stimulate plant cuttings and ensures that your lovely ivy will grow to its fullest capacity! Pouring your root powder into a cup rather than placing the clippings directly into the container protects your rooting powder from becoming contaminated for future use."
    },
    {
      "title": "Place a cutting into each hole and secure it with soil.",
      "content": "Place a cutting into each hole and secure it with soil. Carefully insert each cutting into one of the individual holes you created. Then, place the end with the rooting hormone into a hole until it hits the bottom. Hold the cutting upright with one hand and press the soil around it so it stays securely in place. [11] X Research source Keep the cutting centered in the hole to avoid knocking off any rooting growth hormone. The more root hormone you manage to keep on your cutting, the better chance it has to grow into a gorgeous plant. If the cutting is too long or unwieldy to stay in the soil, you may need to keep it in place with a stake . To do this, simply place a stick a few inches from the base of the plant and secure it to the plant with non-wire plant ties ."
    },
    {
      "title": "Soak your ivy pot until water runs out the bottom.",
      "content": "Soak your ivy pot until water runs out the bottom. Put your freshly planted clippings under a faucet or use a watering can to soak the soil . Keep watering in a light stream until water comes out of the bottom of the pot, which will signal that you've thoroughly moistened all of the soil. [12] X Research source Be careful not to disturb the cuttings as you water by keeping the stream of water away from the base so that they stay securely in the soil."
    },
    {
      "title": "Place the cutting in a cup filled with room-temperature water.",
      "content": "Place the cutting in a cup filled with room-temperature water. Fill a cup you don’t mind using for propagation full of room temperature water. Then, carefully insert your cutting into the cup, ensuring that you've covered the bottom node on the stem with water. [13] X Research source"
    },
    {
      "title": "Change the water once every 2 to 3 days and rinse the roots.",
      "content": "Change the water once every 2 to 3 days and rinse the roots. Dump out the old water and replace it with clean, room-temperature water once every 2 to 3 days. This will promote root growth and ensure that your ivy cutting has the clean water it needs to establish itself into a healthy, new plant! [14] X Research source Look for any leaves that drop into the water and promptly remove them."
    },
    {
      "title": "Transfer the cuttings to soil once the roots are 5 in (13 cm) long.",
      "content": "Transfer the cuttings to soil once the roots are 5 in (13 cm) long. Check the length of the roots by carefully pulling the ivy stem out of the water and holding a ruler next to the roots. Then, measure the ivy from the bottom node to the end of the roots. If your cutting is about 5 in (13 cm), carefully plant your rooted clipping in a pot pre-filled with 1 part perlite and 1 part sand, and water it thoroughly. [15] X Research source If your cutting isn’t around 5 in (13 cm), carefully re-insert your cutting back into the water-filled cup. You should notice root growth after about 2-3 weeks—how exciting!"
    },
    {
      "title": "Place the pots in a bright, warm location.",
      "content": "Place the pots in a bright, warm location. If the pots are inside, place them near a window that gets bright light but won’t shine directly onto the cuttings. If you’re keeping your potted cuttings outside, put them in a greenhouse, a propagator , or cover the pots with plastic bags and place them in a warm, bright location out of direct sunlight to ensure they stay happy and healthy. [16] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source Be sure to place the cuttings somewhere easily accessible, as you will need to check the moisture level of the potted cuttings every few days or so. Consider putting the cuttings somewhere you'll regularly see so you remember to care for them."
    },
    {
      "title": "Keep the surface of the cutting’s soil damp at all times.",
      "content": "Keep the surface of the cutting’s soil damp at all times. Sprinkle the soil with water whenever the surface starts to dry out. The amount of time the soil takes to dry out will depend on the warmth and humidity where the plants are located. [17] X Research source Use your finger to feel the top layer of soil and determine if it’s dry. A mister hose attachment works well to keep outdoor cuttings wet, while direct watering works well for indoor pots. Be careful not to drown the cuttings by leaving the pot sitting in water."
    },
    {
      "title": "Remove any discolored or dead cuttings in the soil.",
      "content": "Remove any discolored or dead cuttings in the soil. If you see a cutting that has turned yellow, wilted, or fallen over, remove it from the pot. Taking dead and diseased cuttings out of the pot will help the other cuttings to grow and thrive. [18] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    },
    {
      "title": "Repot cuttings when they have new growth or in the spring.",
      "content": "Repot cuttings when they have new growth or in the spring. With proper love and care, climbers like ivy typically root within 1-2 months. Once you’re ready to repot them , simply move them to a larger container and pot them as you would any new plant, using normal soil and being careful not to damage the roots in the transition process. [19] X Research source Allow your new cuttings to establish themselves for at least a few months before repotting them. If you are planning to move your cuttings outdoors, wait until they develop a strong root system and plant them outdoors in the spring or the fall."
    }
  ]
}