{
  "url": "https://www.wikihow.com/Make-a-Flour-Bomb",
  "title": "How to Make a Flour Bomb",
  "steps": [
    {
      "title": "Gather the supplies needed.",
      "content": "Gather the supplies needed. You will need a few supplies to create a flour bomb out of panty hose or socks. Make sure you have all of the supplies with you before you begin. You may already have all of the supplies in your home! [1] X Research source Pantyhose or long socks. Flour A spoon"
    },
    {
      "title": "Fill the pantyhose or socks.",
      "content": "Fill the pantyhose or socks. If you are using pantyhose, you need to cut one leg of the pantyhose off where it connects at the top before beginning. Open up the pantyhose or socks wide and use the spoon to fill it with spoonfuls of flour. Keep filling until the pantyhose or socks have enough flour to completely fill the toe part. You should have about ½ to 1 cup in the sock or pantyhose."
    },
    {
      "title": "Tie off the pantyhose or socks.",
      "content": "Tie off the pantyhose or socks. Tie a knot in the pantyhose or sock close to where the flour is. The knot should be a couple of inches above where the flour is. This should create a tied off pocket of flour with a long handle of pantyhose or sock to hold onto."
    },
    {
      "title": "Play with your flour bomb.",
      "content": "Play with your flour bomb. Hold the long end of the flour bomb and throw the bomb up in the air. Watch the flour splat out of the pantyhose or sock as it hits the ground. You can also play flour bomb wars by getting friends together and making several flour bombs to use to gently hit each other with. The flour will leave a fun white spot where it hit you!"
    },
    {
      "title": "Collect all of the necessary supplies.",
      "content": "Collect all of the necessary supplies. You can use several household supplies to easily make fun flour bombs. Gather together all of the supplies needed before starting the project. Napkins, paper towels, or dryer sheets. Flour A spoon Rubber bands"
    },
    {
      "title": "Lay the napkin, paper towel, or dryer sheet out.",
      "content": "Lay the napkin, paper towel, or dryer sheet out. You need to have the napkin, paper towel, or dryer sheet laid out flat on a table to get it properly filled with flour. You can lay several down at once if you’d like to make multiple flour bombs."
    },
    {
      "title": "Spoon out the flour.",
      "content": "Spoon out the flour. Use a small spoon to put flour into the center of the napkin, paper towel, or dryer sheet. You should only add about 1 to 2 spoonfuls to each to make sure you have enough room to tie the flour bomb. A larger paper towel might be able to have 3 to 4 spoonfuls in it depending on how big it is."
    },
    {
      "title": "Tie the flour bomb.",
      "content": "Tie the flour bomb. Gather the four corners of the napkin, paper towel, or dryer sheet and bring them together so that the flour rests in a pocket underneath them. Wrap a rubber band around the flour bomb very close to the flour pocket. Make sure you have all edges of the napkin, paper towel, or dryer sheet pulled through the rubber band so the flour will not leak."
    },
    {
      "title": "Enjoy playing with your new flour bombs.",
      "content": "Enjoy playing with your new flour bombs. Take your flour bombs outside to have fun throwing into the air. The flour will make a fun, white spot wherever the bomb lands. Try setting up a target to throw the flour bombs at for a fun outdoor game."
    },
    {
      "title": "Gather all of the materials needed.",
      "content": "Gather all of the materials needed. Creating a flour bomb out of a balloon is an easy way to have an explosion of flour. You only need a few household supplies to make a balloon flour bomb. Get all of your materials together to begin this project. Balloons A medium size funnel Flour A spoon A needle or pin. Tape and String to hang the balloon"
    },
    {
      "title": "Attach a funnel to the balloon.",
      "content": "Attach a funnel to the balloon. Gently slide the mouth of the balloon onto the tip of a funnel. A medium to large size funnel will work best to keep the balloon secured on the funnel."
    },
    {
      "title": "Fill the balloon with flour.",
      "content": "Fill the balloon with flour. Use one hand to hold the balloon mouth and funnel base while you spoon the flour into the balloon. Add 1 to 2 spoonfuls of flour into the funnel for it to slide down into the balloon. Carefully remove the balloon mouth from the funnel making sure not to let any of the flour spill out of the balloon."
    },
    {
      "title": "Blow up the balloon.",
      "content": "Blow up the balloon. Carefully blow up the balloon to a nice size that will easily pop. Try not to overfill the balloon so it doesn’t pop before you intend for it to. Make sure you only blow out air into the balloon because you don’t want to accidentally inhale the flour inside the balloon. Tie the balloon mouth off when the balloon has reached the size you want."
    },
    {
      "title": "Pop the balloon to make a flour explosion.",
      "content": "Pop the balloon to make a flour explosion. Hang the balloon up high with string or just tape to give the flour a place to fall from. Use a needle or pin to carefully pop the balloon. Watch the flour fly from the balloon and fall down to the ground. For added fun, have someone stand underneath the balloon to end up covered in white flour."
    }
  ]
}