{
  "url": "https://www.wikihow.com/Bedroom-Eyes-Meaning",
  "title": "What Does “Bedroom Eyes” Mean? Everything You Need to Know",
  "steps": [
    {
      "title": "Bedroom eyes refers to a sultry, seductive facial expression.",
      "content": "Bedroom eyes refers to a sultry, seductive facial expression. Physically, bedroom eyes are heavy-lidded or partially shut eyes that look hazy or dreamy, particularly during intimate moments when someone feels aroused. Thus, they can also be a type of flirtation. They’re seen as sultry and enticing, implying that someone is looking at another person with desire and inviting them closer. [1] X Research source “Giving someone bedroom eyes” can also be a way of showing someone you’re interested in them—either to hook up or have a sensual and possibly romantic connection. Keep in mind that bedroom eyes don’t guarantee interest from someone. Even if you think you see someone giving bedroom eyes, find out if they actually like you instead of making assumptions!"
    },
    {
      "title": "Bedroom eyes involve dropped eyelids and dilated pupils.",
      "content": "Bedroom eyes involve dropped eyelids and dilated pupils. If someone gives you “bedroom eyes,” that means locking eyes, softening their stare, and smiling subtly with lidded eyes. [2] X Research source Bedroom eyes usually also include relaxed facial muscles. When someone does it intentionally, they might also use slow, sensual movements and touches to amp up the chemistry. Intentional bedroom eyes are almost hypnotic, designed to pull people in and get them to return the intense gaze. It’s also possible for someone to unintentionally have bedroom eyes if they’re attracted to someone and their body reacts to that. Some celebrities are even said to have naturally alluring “bedroom eyes,” like Megan Fox and Tyra Banks."
    },
    {
      "title": "Make eye contact while slightly lowering your eyelids.",
      "content": "Make eye contact while slightly lowering your eyelids. When you make eye contact with the person you’re interested in, close your eyelids slightly—they should look heavy-lidded but not so far shut that it looks like you’re fighting sleep. Then, give a coy smile, either by smirking with one side of your mouth or smiling slightly with both sides of your mouth. [3] X Research source Coy smiles are alluring and disarming. Bedroom eyes alone don’t guarantee interest, but smiling at someone pointedly while making bedroom eyes is a much stronger sign that you want them to approach!"
    },
    {
      "title": "Hold the other person’s gaze before briefly looking away.",
      "content": "Hold the other person’s gaze before briefly looking away. Once you make eye contact with someone, hold it to send a clear indication that you’re interested in them. Just remember there’s a difference between holding eye contact and staring; try looking away every so often before meeting their gaze once more. [4] X Research source You could also try the “triangle gaze,” which basically means shifting your gaze between someone’s eyes and lips. Meet their eyes, look away, then look at their lips and back up to their eyes. This can really reinforce the desire and attraction between you!"
    },
    {
      "title": "Project confidence with body language cues to add to the overall effect.",
      "content": "Project confidence with body language cues to add to the overall effect. Confidence is the way to go if you’re trying to catch someone’s eye. Maintain an open, relaxed posture without crossing your arms in front of your body or sitting with your legs crossed. [5] X Research source Crossing your arms forms a barrier between you and the other person—but with bedroom eyes, you’re trying to beckon them closer. Try other body language cues like: Biting your lip. Licking your lips. Playing with your hair. Pouting slightly while looking at them."
    },
    {
      "title": "Use makeup to accentuate your eyes.",
      "content": "Use makeup to accentuate your eyes. The “Bedroom eyes” makeup technique can give your eyes a sultry, alluring look. While everyone has their own way of creating this look, “bedroom eyes” generally involve darker eyeshadow (particularly gray, charcoal, or brown), a bit of lighter eyeshadow (ivory or beige) for accents, brown or black eyeliner, and mascara. [6] X Research source To do smokey eye makeup , go over your whole upper eyelid with a thin layer of the darker eyeshadow and blend it in. Then, add more of the dark shade to the bottom of the lid. After eyeshadow is applied, add liner, starting around the middle of your upper eyelid and going toward the outside. Make sure it’s close to your lash line! Optionally, add lighter eyeshadow to the inner corners of your eye to make them pop! Then, complete the look with mascara to make your eyelashes look long and thick ."
    },
    {
      "title": "Pay attention to the other person’s cues as well.",
      "content": "Pay attention to the other person’s cues as well. If they avoid eye contact and don't smile back or come over to you, it probably means they’re not interested—which means it’s better to find somewhere else to gaze. On the other hand, if they do return your gaze and smile back at you, that’s an indicator they might like to chat face-to-face, and it’s probably safe to strike up a conversation. [7] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Even if “bedroom eyes” imply a desire for intimacy, it doesn’t automatically mean both parties want to hook up. Verbal mutual consent is still key before any type of intimacy!"
    },
    {
      "title": "There are several alternate nicknames for bedroom eyes.",
      "content": "There are several alternate nicknames for bedroom eyes. Regardless of the name you use, the meaning is the same—all phrases refer to a facial expression with heavy-lidded eyes that wordlessly convey chemistry and attraction. Synonyms for “bedroom eyes” include: [8] X Research source Come-hither eyes Longing eyes The lustful stare Sexy eyes"
    }
  ]
}