{
  "url": "https://www.wikihow.com/Build-Stencils",
  "title": "How to Build Paper or Plastic Stencils",
  "steps": [
    {
      "title": "Choose your design.",
      "content": "Choose your design. Since you're making your own stencil, there's no limitations on what you can create. Think about the size of the surface you plan to stencil (T-shirt, wall, bookmark), who the design is for (baby, birthday girl, best friend) and where the stenciled image will be (bathroom wall, kitchen border, skateboard deck. Stay with the basics. Letters, numbers and basic shapes (circles, squares and diamonds) can be an easy but effective design choice. Combine a couple of these elements for a personalized look. Work with a theme. Consider motifs associated with different themes--shells, starfish, sea horses, boats and anchors create a nautical look. Rams, bulls, scales, fish and crabs are all elements inspired by a zodiac theme. Draw inspiration from nature. Flowers, trees, butterflies, leaves and sun are just some examples of ideas you can come up with by simply looking outside your window. Stick to the classics. Chose a Greek key, a fleur de lis, a Celtic cross or other traditional and universally recognizable symbols. If you're new to stenciling, you might want to start with an image that's fairly basic in design--not too many separate pieces or too much detail. If you're more experienced or simply confident in your skills, you can create something that's more intricate."
    },
    {
      "title": "Create your design.",
      "content": "Create your design. Once inspiration has struck and you've decided on a design, it's time to capture it as the next step to creating your stencil. Draw the design by hand. You can put pencil to paper to get your idea down. Drawing it yourself allows for maximum creativity and room to play and adjust your design. Work in pencil until you get the design to your liking. Later you'll trace over it with a permanent marker so that it's easy to see the outline when you cut."
    },
    {
      "title": "Print a graphic or template from the Internet.",
      "content": "Print a graphic or template from the Internet. There are tons of online sites that offer free stencils for you to download and print to your home computer. In some cases, you may need to take your printed image to a copier to reduce or enlarge it. In other cases, you may have the option to change the size when you print or you can change your printer settings to allow it print the image larger or smaller."
    },
    {
      "title": "Use a stamp as an outline.",
      "content": "Use a stamp as an outline. If there's a rubber stamp design you like, consider using it as the outline for your stencil. Press the stamp into a pad of black ink and then press it firmly onto a sheet of white paper. Make sure the lines are clean and clear. Use a copier to increase or decrease the size of your stamped image to fit the size you need for your stencil. If the rubber stamp image is too detailed, it may not be a good choice for a stencil. If you still like it, consider eliminating some of the detail lines--paint over them with Whiteout--to simplify the image."
    },
    {
      "title": "Single-Overlay Stencil.",
      "content": "Single-Overlay Stencil. A single-overlay stencil is a single sheet of paper or plastic on which you draw and cut your completed design. Make a single-overlay stencil if you're working from a black-and-white image or if you want your final image to be a silhouette or ghost of the image. If you want to work with a colored image, choose one that has high contrast and very little variation in color. The downside to single layers are that some detail may be lost like, but the upside is that you'll only have one sheet to cut and paint."
    },
    {
      "title": "Trace your image onto thin tracing paper.",
      "content": "Trace your image onto thin tracing paper. Outline the image and separate its different parts. Areas should have clear boundaries that allow \"bridges\" to appear around the openings where paint is to be applied. Make sure the bridges are wide enough to keep paint from seeping under and smudging your image."
    },
    {
      "title": "Multiple-Overlay Stencil.",
      "content": "Multiple-Overlay Stencil. For a design with more detail or more color variations, you'll need to create a multiple-overlay stencil. In other words, you'll create several stencils--each with a portion of the image on it--and layer them one-by-one on your stenciling surface to apply the paint/ink and create the finished design. Trace your image onto thin tracing paper. Begin as you would for a single-overlay stencil. Outline the image and separate its different parts. Areas should have clear boundaries that allow \"bridges\" to appear around the openings where paint is to be applied. Make sure the bridges are wide enough to keep paint from seeping under and smudging your image. Create registration marks. Draw a small triangle or other simple shape in each of the four corners of your drawing. You will copy these onto each overlay you create so that you can line up each layer exactly in place. Lay a new piece of tracing paper over your first stencil drawing. Trace the openings and bridges that go together either by color or purpose (shadows, highlights, etc.) Create as many overlays as you need until you've retraced all the elements of the design."
    },
    {
      "title": "Choose your material.",
      "content": "Choose your material. You don't have to buy expensive paper to create a stencil--you may already have what you need in your kitchen, home office or craft room. Freezer paper. Freezer paper, also known as grease-proof paper, is available at your local grocery store; it's stocked right next to the tinfoil, plastic wrap and wax paper. Unlike wax paper, which was a waxy finish on both sides, freezer paper has a waxy finish on one side only. Freezer paper is a good choice if you plan to stencil on fabric (T-shirt, onesie, tote bag). Draw your design on the unwaxed side. After the stencil is cut out, place it waxy-side down on your fabric. Use an iron to gently heat the paper, and it will stick to the fabric's surface, making it easy to then apply the paint. Tracing paper. Start with tracing paper if you plan to trace the outline of your stencil from an existing design you've found in a book or downloaded from the internet. Tracing paper is thin enough that it's easy to see through it and accurately copy your design. Letter stock. Computer paper and other medium-weight paper can be used to create a stencil. A big plus of this material is that you're likely to already have it on hand. Heavy paper. Cardstock and cardboard make for a sturdier stencil that holds up well with multiple uses. Because this paper is so thick, it's a little more difficult to cut. Be sure your blade is very sharp when working with these papers so that your cuts are clean. Carbon paper. If you've created your stencil on tracing paper but want to transfer it to a sturdier paper, you can use carbon paper to transfer the design. Place the sturdy paper onto your table. Layer a sheet of carbon paper on top of it. Be sure the matte side of the carbon paper is facing up and the side with the carbon is facing down. Lay your tracing paper design on top of the carbon paper. Retrace the design going over every line and detail. Apply firm pressure as you work to ensure that your design transfers clearly and completely. Remove the tracing paper and the sheet of carbon paper. The design will now be \"printed\" on your sturdy paper."
    },
    {
      "title": "Reinforce your stencil.",
      "content": "Reinforce your stencil. It's a good idea to make your stencil as strong as possible so that it stands up well for your project and allows you the option of reusing it in the future. Cover the stencil in contact paper. Clear contact paper is readily available in the housewares department of your local hardware or discount store. Place your stencil flat on a nonporous surface. You don't want to accidentally remove the finish from a table by having it come into contact with the sticky paper. Cut a piece of contact paper the size of your stencil, remove the backing and stick it to the stencil. Trim away any excess. Use packing tape. Place your stencil design-side down on a nonporous surface. Run strips of packing tape over the stencil. Overlap each strip with the next until the entire surface is covered. Run the tape past the edges of the paper and trim the excess"
    },
    {
      "title": "Draw or trace your stencil design.",
      "content": "Draw or trace your stencil design. If you're drawing, you may want to start by working in pencil. Once you have the design how you want it, retrace your pencil lines with a fine to medium point permanent marker. If you're tracing a design, you can use a marker to begin with. If you've created multiple lines while making your initial pencil drawing, be clear on what the final outline should be before going over it in ink."
    },
    {
      "title": "Cut out the stencil.",
      "content": "Cut out the stencil. Because of its delicate nature, cutting paper requires a sharp blade and significant patience. Trying to move too quickly can result in rips and tears that will mean redrawing your stencil and starting again. Secure your stencil in place. Use masking tape to secure the edges of your paper stencil firmly in place on your cutting surface. You could also use small bits of poster gum to get the paper to stick to the work surfaced. To make sure you have contact between the paper and the surface, use only a small amount of the gum and thoroughly flatten it out. Use a sharp, new blade in your cutting knife and remove the areas of your stencil where you plan to apply paint or ink. Do not cut out your bridges--those borders that separate one section of your stencil image from the other. If your stencil is particularly large or your using heavier paper, you may have to replace your blade mid-project; do so as soon as the blade seems dull to prevent it from dragging and tearing your paper. When making long cuts, hold hold your knife at a lower angle and further away from your blade. As you move around your stencil, turn the paper not your hand. To create sharp edges, cut away from corners not into them. Use tweezers and a sharp knife to remove the cut stencil pieces. When you've finished, peel up the tape by its edges. If you can't remove it from the paper stencil without it ripping, simply fold it over onto the back. If you used poster gum, work from one corner and remove the gum from the back of your stencil. If you notice that one of your cuts did not go all the way through, immediately put the plastic back on, re-secure it to the surface and go over the intact area with your blade."
    },
    {
      "title": "Choose your plastic sheet.",
      "content": "Choose your plastic sheet. There are primarily two kinds of plastic to choose from when it comes to creating a stencil--acetate and Mylar. They both do the job well, it's simply a matter of preference, so check them out at your local craft store to see which appeals to you These films come in clear and color, are available by the sheet or by the roll and some even have an adhesive backing. Check the surface to be sure it accepts pen or pencil well so that you can easily draw or trace your design. Look for plastic that has a matte finish as this surface will typically work with graphic or ink. Acetate does have a couple of disadvantages if you're making a stencil that you plan to keep. With time it develops a yellow or grayish cast and its edges have a tendency to curl. Repurpose your old x-rays. Put those old plastic films to a new use as a material for your stencil design."
    },
    {
      "title": "Draw or trace your stencil onto the plastic.",
      "content": "Draw or trace your stencil onto the plastic. Creating a clear drawing or sharply traced stencil is key to making sure you'll be able to easily follow the pattern when it comes time to cut your stencil. Use a permanent marker with a sharp tip to draw or trace your design. If you initially created your design in pencil, trace over it now with the marker. Be careful not to smudge the marker line as you work. The clearer the lines, the more easily you'll be able to follow them when you make your cuts."
    },
    {
      "title": "Cut out the stencil.",
      "content": "Cut out the stencil. A sharp blade and a hard cutting surface are all you need to successfully cut out your stencil. Move slowly and firmly around your design. Stopping occasionally to relax and refocus can help you to keep a steady hand. Secure your stencil in place. Lightly spray the back of the stencil with contact adhesive, wait until it's tacky and place it on your cutting surface. Alternately, you can tape the outside edges of the stencil down and firmly in place. Use a sharp, new blade in your cutting knife and remove the areas of your stencil where you plan to apply paint or ink. Do not cut out your bridges--those borders that separate one section of your stencil image from the other. When making long cuts, hold hold your knife at a lower angle and further away from your blade. As you move around your stencil, turn the plastic not your hand. To create sharp edges, cut away from corners not into them. Use tweezers and a sharp knife to remove the cut stencil pieces. When you've finished, remove the tape and/or carefully peel the plastic stencil film up starting from the outer edges. If you notice that one of your cuts did not go all the way through, immediately put the plastic back done, re-secure it to the surface and go over the intact area with your blade."
    },
    {
      "title": "Smooth out the rough edges.",
      "content": "Smooth out the rough edges. Gently go over the newly cut surfaces of your stencil with fine sandpaper to smooth out any rough edges. If edges aren't smooth, your image won't be clean and crisp when you apply your paint. After sanding, remove the plastic dust with a piece of cheesecloth or soft cotton rag."
    }
  ]
}