{
  "url": "https://www.wikihow.com/Get-Calus-Mini-Tool",
  "title": "How to Get Destiny 2's CALUS Mini Tool: Everything You Need to Know",
  "steps": [
    {
      "title": "Use the Exotic Mission Rotator to replay the Presage exotic quest.",
      "content": "Use the Exotic Mission Rotator to replay the Presage exotic quest. The Exotic Mission Rotator is a new feature added in Season 22 that allows you to play old Exotic missions. The only prerequisite is that you must own the expansion or season associated with that mission. To play Presage, you must own the Season of the Chosen or the Beyond Light DLC. [1] X Research source"
    },
    {
      "title": "Select Presage when it's available.",
      "content": "Select Presage when it's available. There are currently three missions in the Exotic Mission Rotator: Operation: Seraph's Shield , Presage, and Vox Obscura. The Exotic Mission Rotator changes once a week, so you can expect to see Presage available every three weeks. As of the writing of this article, the next time Presage will be available is April 30th, 2024. It will then be available again on May 21st, June 11th, July 2nd, etc."
    },
    {
      "title": "Complete the mission for a chance to get the CALUS Mini Tool.",
      "content": "Complete the mission for a chance to get the CALUS Mini Tool. If you complete the mission on regular difficulty, legendary difficulty, and two runs on any difficulty, you are guaranteed three red border drops. Additional completions will still give rewards, but they're not guaranteed to be red borders. Once you get five red border CALUS Mini Tools, you can craft it."
    },
    {
      "title": "Check Xur's shop.",
      "content": "Check Xur's shop. Xur is a vendor that sells Legendary and Exotic items, but can only be found on Friday, Saturday, and Sunday. He also appears in a random location in the public sectors of the European Dead Zone, Titan, Io, and Nessus, or in the Tower. [2] X Research source Xur sells items for Legendary Shards. To easily check what Xur is selling and where he's located for the week, you can use the website whereisxur.com ."
    },
    {
      "title": "Check Banshee-44's shop.",
      "content": "Check Banshee-44's shop. Banshee-44 sells legendary weapons in his shop (located in the Tower) for 30 Legendary Shards or 7,000 Glimmer. These weapons rotate on a weekly basis. [3] X Research source It's not likely that Banshee-44 will stock the CALUS Mini Tool, but it is possible. Make sure to check in weekly to see if he's selling a copy."
    }
  ]
}