{
  "url": "https://www.wikihow.com/Make-a-Paracord-Combat-Bracelet",
  "title": "How to Make a Paracord Combat Bracelet",
  "steps": [
    {
      "title": "Obtain about 3m (10 feet) of paracord.",
      "content": "Obtain about 3m (10 feet) of paracord. You can use a measuring tape or anything else to get it to about 3m. If you don't have a measuring cord, use your body to approximate! When stretched out to either side, the distance between your fingertips should be approximately equal to your height. If you are close to 5 feet (1.5 m) tall, cutting a cord that is about the same length as two of your arm spans will do the trick."
    },
    {
      "title": "Grab the middle of the paracord to fold it in half.",
      "content": "Grab the middle of the paracord to fold it in half."
    },
    {
      "title": "Wrap the looped end around your wrist to get the circumference of your wrist.",
      "content": "Wrap the looped end around your wrist to get the circumference of your wrist. For a tighter measurement, lace the non looped end through the looped end, so that the paracord stays around your wrist."
    },
    {
      "title": "Tie off the end.",
      "content": "Tie off the end. Use string, yarn, or something similar to mark the circumference of your wrist on the bracelet. If the cord or string will fit around a button or other item that you will use as a clasp, you can add it to the cord directly now. Place it at the top end, where the tie is. Alternatively, you can add this in a later step."
    },
    {
      "title": "Double check that the bracelet will fit.",
      "content": "Double check that the bracelet will fit. You should now have a loop with 2 long strands coming off. Double check that the bracelet will fit by wrapping the looped end around your wrist. If it is too small or too big, adjust the tie that you made in the previous step."
    },
    {
      "title": "Begin weaving the strings.",
      "content": "Begin weaving the strings. Pass the first of the longer strands ( Strand 1) through the loop, then over the second length of string (Strand 2)."
    },
    {
      "title": "Pass strand 2 over the loop and then under strand 1.",
      "content": "Pass strand 2 over the loop and then under strand 1. Strands 1 and 2 should now have switched places."
    },
    {
      "title": "Tighten the knot by pulling on the loose ends.",
      "content": "Tighten the knot by pulling on the loose ends."
    },
    {
      "title": "Repeat the first part of the process.",
      "content": "Repeat the first part of the process. Begin again with strand 1. Note that this time strand 1 will be going right to left instead of left to right. Alternating the side from which you start will help the bracelet lie flat across your wrist."
    },
    {
      "title": "Repeat the second part of the knot.",
      "content": "Repeat the second part of the knot. Again, strand 2 will come from the opposite side as it did in the first knot. Go over the loop and under the opposite strand."
    },
    {
      "title": "Continue this process.",
      "content": "Continue this process. Stop when you have about 3 centimeter (1.2 in) left at the end of the loop. Then, cut off any excess cord. Melt the cut ends of 1 and 2 so that they fuse with the weave. This will stop the bracelet from unraveling when you wear it."
    },
    {
      "title": "Sew on your button",
      "content": "Sew on your button . Sew your button on the end of the bracelet that does not have a loop. You can adjust the fit of your bracelet by changing the placement of your button. If the bracelet seems too small, sew the button as close to the end of the bracelet as possible. If it seems too big, sew the button further in on the bracelet. Be sure you test the size of your button before you sew it on. If it is small enough to fit through the loop on the bracelet without any help, you'll need a bigger button. Likewise, if the button cannot fit through the loop at all, you will not be able to put the bracelet on."
    },
    {
      "title": "Remove the temporary tie that you added above.",
      "content": "Remove the temporary tie that you added above. If you cannot untie it, feel free to cut it instead."
    },
    {
      "title": "Wear the bracelet.",
      "content": "Wear the bracelet. Wrap the bracelet around your wrist and fasten it by slipping the button through the loop."
    }
  ]
}