{
  "url": "https://www.wikihow.com/Hang-Garland-on-Brick",
  "title": "How to Hang Garland on Brick",
  "steps": [
    {
      "title": "Purchase some adhesive hooks that are designed for bricks.",
      "content": "Purchase some adhesive hooks that are designed for bricks. Adhesive hooks, or command strips, are plastic strips with hooks on them that have a strong adhesive on the back. Most adhesive hooks are designed to hold less than 20 pounds (9.1 kg), so make sure that you get some heavy-duty clips if you’re hanging a heavy or large garland. Read the label on a package carefully to ensure that the adhesive on the back will work with brick. Adhesive hooks are the best option if you don’t want to drill into brick but you can’t find brick clips that match your brick pattern. Purchase some adhesive hooks from your local hardware or big box store. They can also be purchased online."
    },
    {
      "title": "Mark the locations that you want to hang your hooks with a pencil.",
      "content": "Mark the locations that you want to hang your hooks with a pencil. Place at least 1 hook for every 2–6 feet (0.61–1.83 m) of garland. Use a measuring tape to space out each hook equally if you’re going for a symmetrical look by measuring the same distance between each of your hooks. Hold a level between potential hooks to determine if a location is even by checking the air bubble in the level. Mark the location for each hook with a pencil. [1] X Research source Different adhesive hooks have different weight thresholds, usually between 2–30 pounds (0.91–13.61 kg) each. The higher the weight threshold for a set of hooks is, the further apart you can place them."
    },
    {
      "title": "Peel the adhesive off the back of the strip and position it on your brick.",
      "content": "Peel the adhesive off the back of the strip and position it on your brick. For each location that you’ve marked off, peel off the cover for the adhesive tape on the back of each hook with your fingernail. Hold the hook up against the brick to position it and slowly lower it against the wall. [2] X Research source The cover for the tape should come off relatively easily, but if it doesn’t, use a small knife to peel the corner open. If you misplaced the hook but you haven’t pressed down yet, you may be able to reposition it."
    },
    {
      "title": "Apply pressure to the front of a strip to set it in place.",
      "content": "Apply pressure to the front of a strip to set it in place. Once you’ve positioned a hook, place both hands on the opposite ends of the hook so that one is on the top of the hook and one is on the bottom. Apply equal, firm pressure into the hook for 5-10 seconds to adhere it to the brick. [3] X Research source"
    },
    {
      "title": "Thread the garland over the hooks to hang it up.",
      "content": "Thread the garland over the hooks to hang it up. Run the garland’s center branch or twine over each of the adhesive hooks. Start in the middle so that you can adjust each side to make it even. If you ever need to remove or adjust any of the hooks, you can either pull on the tab in the bottom of the hook, or use a dull knife to pry it off from the bottom. [4] X Research source Some hooks come with small strips that stick out of the bottom to remove them. Pull this strip directly down to remove a hook. If there isn’t a removal strip attached to the hook, use a flat, dull kitchen or putty knife to get leverage under the hook. Pry it up 1-2 millimeters and then remove the hook by pulling it off."
    },
    {
      "title": "Check your brick wall to make sure that the mortar is recessed.",
      "content": "Check your brick wall to make sure that the mortar is recessed. If the bricks on your wall stick out at least 1 ⁄ 4 in (0.64 cm) past the mortar, you can hang clips around the bricks to hang your garland. Brick clips hook around the edges at the top and bottom of a brick and rely on the brick’s weight to keep the clip in place. However, if the mortar is flush with your bricks, there won’t be enough room to hang the clips. [5] X Research source Brick clips are an excellent option if you don’t want to drill into the mortar or put any adhesive material directly on to your brick. Brick clips will only allow you to hang a garland horizontally if your bricks are in even rows."
    },
    {
      "title": "Purchase a set of clips based on the size of your bricks.",
      "content": "Purchase a set of clips based on the size of your bricks. Measure the height of a brick on the wall where you plan on installing or hanging the garland. You can purchase brick clips from a local hardware store or online retailer. They come in different sizes, so read the label on a package carefully to ensure that the clips are designed for bricks that are the same size as the bricks in your wall. [6] X Research source"
    },
    {
      "title": "Position the top of the clip flush against the top of the brick.",
      "content": "Position the top of the clip flush against the top of the brick. Hold the brick clip slightly above the brick you’re attaching it to and slide it down so that the top of the clip is on top of the brick. Once the top of the clip is hanging on the top of a brick, slide the bottom under the bottom of the brick. Most brick clips will snap into place under the brick. Install each brick clip so that the hook on the face of the clip is facing up. [7] X Research source It’s easy to reposition a brick clip if you don’t like how it’s placed. Pop it off of a brick by pulling the bottom down while pulling it off. Use a stable ladder to reach bricks that are high off of the ground."
    },
    {
      "title": "Place 1 clip for every 2–6 feet (0.61–1.83 m) of garland.",
      "content": "Place 1 clip for every 2–6 feet (0.61–1.83 m) of garland. You can arrange your hooks however you’d like. If you’re hanging the garland around a door or fireplace, place 2 symmetrical hooks above fixture or door. If you’re hanging the garland horizontally, place all your clips along the same row of bricks. The amount of space you leave between clips will determine how many dips there are in your garland. [8] X Research source For example, if you use 3 brick clips, you will have 3 distinct dips in the garland on the wall where you’re installing it. The more clips you add, the less distinct the dips will be."
    },
    {
      "title": "Thread the garland’s twine or branch over the hooks to hang it up.",
      "content": "Thread the garland’s twine or branch over the hooks to hang it up. Start with the centermost hook and run the garland through the hook on the brick clip. While it is hanging on the centermost hook, adjust the length hanging off of each side by carefully pulling on an end to make the garland center. [9] X Research source If the hooks on the brick clips are too big for the twine of your garland, leave 2–4 feet (0.61–1.22 m) of garland hanging off of each clip on both ends. The weight from the garland will keep the rest of the twine or branch in place."
    },
    {
      "title": "Mark off each screw location in the mortar of your brick wall with a pencil.",
      "content": "Mark off each screw location in the mortar of your brick wall with a pencil. If you want your hooks or screws to be symmetrical, use a measuring tape to place your marks in equidistant intervals. If you plan on using hooks to hang your garland, keep each screw location on the same horizontal plane by using a level to ensure that each gap is even and flat. [10] X Research source You can use any kind of pencil to mark the location of each screw."
    },
    {
      "title": "Purchase some wall anchors and hooks or screws.",
      "content": "Purchase some wall anchors and hooks or screws. You can purchase hooks, anchors, and screws at a local hardware store or online. Choose hooks or screws that will fit between your bricks without touching them. In most cases, a screw with a 1 ⁄ 4 inch (0.64 cm) head will be perfect. Screws and hooks should fit at least 1 1 ⁄ 2 inches (3.8 cm) into the mortar. [11] X Research source Check a package of wall anchors to ensure that it will fit the threading of your screw. Most wall anchors will fit several types of screw though. If your garland is under 3 pounds (1.4 kg), you don’t need to use wall anchors. Unless your garland weighs more than 30 pounds (14 kg), any plastic wall anchor that fits your screw will work. Hooks are better for garlands with thicker leaves or tinsel."
    },
    {
      "title": "Place a drop cloth on the ground or over furniture to catch dust.",
      "content": "Place a drop cloth on the ground or over furniture to catch dust. Before you drill into your brick wall, set out a drop cloth along the wall where you plan on drilling. If there is any furniture along the wall, you can either move it out of the way, or cover it. Drilling into mortar will send dust flying all over the place, and cleaning it up can be a pain if you don’t have a drop cloth. [12] X Research source"
    },
    {
      "title": "Drill pilot holes into the mortar for the wall anchors.",
      "content": "Drill pilot holes into the mortar for the wall anchors. Hold a masonry drill bit up to the length of your wall anchor until you’ve found a bit that is at least 1 ⁄ 32 inch (0.079 cm) thinner than the wall anchor. Attach the drill bit to your drill by unscrewing the bolt at the top and sliding it in. Drill a pilot hole that is at least half of the length of your wall anchor into each location where you want to add a screw or hook. [13] X Research source A pilot hole refers to any incision that you make so that a screw or fixture can be screwed in more easily."
    },
    {
      "title": "Insert your wall anchors by screwing them into your pilot holes.",
      "content": "Insert your wall anchors by screwing them into your pilot holes. Use a screwdriver or drill with a fitted drill bit to screw each wall anchor into a pilot hole. Drill each wall anchor in so that it is flush with the mortar. [14] X Research source You can use a can of compressed air to blow away any mortar dust if you’d like. This will keep the anchors from shedding dust particles over time."
    },
    {
      "title": "Drill your screws or hooks into the wall anchors.",
      "content": "Drill your screws or hooks into the wall anchors. Drill your screws into the wall anchors so that 1–3 inches (2.5–7.6 cm) of the screw are sticking out. If you are installing hooks, screw the threaded side into the wall anchor by hand and stop once the threading is hidden in the wall. Rotate the open end of each hook until it is pointing up towards your ceiling. [15] X Research source"
    },
    {
      "title": "Run your garland over the screws or hooks to hang it up.",
      "content": "Run your garland over the screws or hooks to hang it up. Start in the centermost hook so that you can adjust the length on both sides to make it even. If you’re hanging the garland with hooks, run the center of the garland through the center of each hook. If you’re hanging the garland over the screws, balance the twine of the garland over the screw where it meets the wall. If there are loops in the garland’s twine, you can loop them around each screw and then drill the screws in all the way to hide the anchors. [16] X Research source If you find your garland slipping off of a hook, consider wrapping the garland around the hook or taping a leaf or branch to the top of the screw. Garlands aren’t typically very heavy, so it won’t take much tape to keep garland hanging. You can always fill in holes in the mortar by mixing water and mortar in a bucket or tray and use a trowel to apply it."
    }
  ]
}