{
  "url": "https://www.wikihow.com/Choose-a-Soccer-Position",
  "title": "How to Choose a Soccer Position",
  "steps": [
    {
      "title": "The positions are divided into goalkeeper, defender, midfielder, and forward.",
      "content": "The positions are divided into goalkeeper, defender, midfielder, and forward. Aside from the goalie, every type of position will have multiple players on the field at any given time. For example, a team may have 2, 3, 4, or 5 defenders. This means that unlike other sports, there aren’t technically fixed positions for every game of soccer. There are always 11 players on the field for each team, there aren’t actually 11 positions for those players to slot into; the positions on the field totally depends on your team’s strategy. [1] X Research source Every team has a goalkeeper. That’s universal. The rest of the team can be arranged in a variety of different ways, but the most popular setup is a 4-4-2. This is where there are 4 defenders, 4 midfielders, and 2 forwards. But a team can have any composition. While there are 11 players on the field at a time, there are technically 16 potential positions to play."
    },
    {
      "title": "You should consider a defender position if you’re tough and quick.",
      "content": "You should consider a defender position if you’re tough and quick. As a defender, your main purpose is to keep the opposing team from scoring by blocking the opposing team’s path to the net. If you enjoy stopping attackers and you don’t really love shooting or dribbling, defensive positions are perfect for you. [2] X Research source Sweeper is not a super common position anymore, but it’s a great position if you love getting physical. Sweepers don’t do a ton of running, but they do have to be comfortable with getting physical near the net. Center backs block the opposing team’s forwards and guide the defense. If you’re tall and you have great leadership skills, center back may be right for you. Full backs and wing backs block the other team’s wingers and midfielders. These positions involve the most running on the field since you’re so far from the net, and they rarely spend a lot of time with the ball. If you’re fast and don’t like dribbling, these are the positions for you."
    },
    {
      "title": "Try out for midfield positions if you like being in the action.",
      "content": "Try out for midfield positions if you like being in the action. Midfielders are versatile, and if you enjoy playing both defense and offense, this is the role for you. If you love defense and offense equally and you’re a great passer, consider a midfield position. You don’t always get to make the winning shot or game-saving defensive play, but you’ll see plenty of action while everyone else is busy standing around. [3] X Research source Aim to play defensive midfielder if you’re a bit fonder of defense and you aren’t a great shooter. This position will suit you if you are good at interceptions, making key tackles and poaching the ball from any misguided dribbles. Attacking midfielder is a great position for you if you prefer shooting and attacking over defensive play. Go for center midfield if you enjoy creative problem solving and calling the shots. Center midfielders are often the leader on the team, and you’ll be involved in almost every play as a center midfielder. Play winger if you like flashy plays. Wingers often attack the net in explosive offensive schemes, so if you’re fast and have good hand-eye coordination, it’s a great position for you."
    },
    {
      "title": "If you’re good at shooting and dribbling, forward is the position for you.",
      "content": "If you’re good at shooting and dribbling, forward is the position for you. A team’s forwards put the ball in the net, so try out for a forward position if you’re good with the ball. Forwards need to have great ball handling skills and good leg strength. If you’re dexterous, strong, and love attacking, forward might be for you. [4] X Research source Center forwards play near the middle of the field on offense. If you prefer getting physical over trying to outrun or outmaneuver your opponent, center forward is right for you. Strikers do most of the scoring a lot of the time. If you’re fast and you have great kicking power, try out for striker."
    },
    {
      "title": "Every position has its challenges, so take your skills into account.",
      "content": "Every position has its challenges, so take your skills into account. You have to be really good at dribbling as a midfielder, comfortable with getting in someone’s face as a defender, and able to shoot accurately as a forward. Every position requires skill, so try to find the right position for you based on what part of the game you enjoy and excel at. [5] X Expert Source Walter Merino Soccer Coach Expert Interview. 29 January 2020. While some people think that goalkeepers have an easy time, it’s kind of the hardest position in the game in a way. While you don’t do much running, you’re on the hook for protecting the most important thing on the field! That can be a pretty high-stress gig."
    },
    {
      "title": "If you don’t want the ball a lot, play full back.",
      "content": "If you don’t want the ball a lot, play full back. If you’re a full back, you tend to do more running than a lot of other positions since you’re near the sideline and furthest from the center of the field. However, full backs don’t shoot at the other team’s goal and they’re rarely involved in the physical brawls that can happen near the center of the field. To put it another way, the full back is usually the position that has the least impact on the game since they’re not as involved in every play and rarely handle the ball. [6] X Research source Some people think that center backs have it easier than full backs since there’s often less running involved. Many soccer players think wingers actually have it the easiest since they aren’t involved a large percentage of the time on offense or defense."
    },
    {
      "title": "It’s a little subjective, but try center midfielder out if you’re good.",
      "content": "It’s a little subjective, but try center midfielder out if you’re good. As a central midfielder, you transition from defense to offense throughout the entire course of the game. You’re also in the middle of the field, so you tend to see a lot of action. As a result, many coaches will put their most skilled players in the center midfielder position. If you think that’s you, that’s where you belong! [7] X Research source The “best” position for you depends on your skillset. If you have a strong ability to predict an opposing player’s moves and react on the fly, you’d be a great defender. If you’ve got crazy accuracy when it comes to shooting the ball, you’d make a phenomenal forward. Every position requires skill."
    },
    {
      "title": "In terms of technical ball skills, full backs tend to be the weakest.",
      "content": "In terms of technical ball skills, full backs tend to be the weakest. It doesn’t necessarily mean that full back is a bad player—just that it doesn’t involve a lot of shooting or passing. As a result, many coaches will put developing players in the full back position. [8] X Research source Remember, full backs have to do a ton of running. If you’re a full back, it’s possible your coach just put you there because you have better endurance than the rest of your teammates!"
    }
  ]
}