{
  "url": "https://www.wikihow.com/Get-Rabbit-Foot-Stardew",
  "title": "How to Get a Rabbit's Foot in Stardew Valley: Simple Guide",
  "steps": [
    {
      "title": "Purchase rabbits.",
      "content": "Purchase rabbits. Rabbits can only be unlocked after purchasing and building a Deluxe Coop from the Carpenter's Shop. This requires 20,000g, 500 Wood, and 200 Stone. Once a Deluxe Coop is built, you can purchase rabbits from Marnie's Ranch for 8,000g. In some cases, a Rabbit's Foot may appear in the Traveling Cart or by slaying Serpents in the Mines (0.8% drop rate)."
    },
    {
      "title": "Raise the rabbit's friendship and happiness.",
      "content": "Raise the rabbit's friendship and happiness. You can do this by petting and feeding the rabbit every day. Interact with the rabbit to check its heart status. Feeding the rabbit for 6 consecutive days will allow it to mature fully."
    },
    {
      "title": "Check the Deluxe Coop.",
      "content": "Check the Deluxe Coop. As long as a rabbit is mature and fed daily, it will produce Wool every 4 days. Sometimes, it will produce a Rabbit's Foot instead. This will drop automatically; there's no need for other equipment. [1] X Research source Keep your rabbit's friendship high to increase your chances of a Rabbit's Foot appearing."
    },
    {
      "title": "Gifting.",
      "content": "Gifting. Rabbit's Foot is a universally loved gift by all villagers except Penny. Loved gifts will earn 80 friendship points on a normal day, 400 points as a Winter Star gift, or 640 points on a villager's birthday. [2] X Research source"
    },
    {
      "title": "The Community Center.",
      "content": "The Community Center. The Rabbit's Foot is used in the Enchanter's Bundle for the Community Center , along with Oak Resin, Wine, and Pomegranate."
    },
    {
      "title": "Tailoring.",
      "content": "Tailoring. You can use a sewing machine to combine Cloth and a Rabbit's Foot to create a shirt. You can also use it as yellow dye at the dye pots."
    },
    {
      "title": "Secret Note #20.",
      "content": "Secret Note #20. This note involves giving a Rabbit's Foot at the end of the puzzle's map."
    },
    {
      "title": "Group 10-Heart Event.",
      "content": "Group 10-Heart Event. If you get all marriage candidates to 10 hearts, having a Rabbit's Foot in your inventory can prevent a bad outcome during this event."
    }
  ]
}