{
  "url": "https://www.wikihow.com/Prune-Orchids",
  "title": "How to Prune Orchids",
  "steps": [
    {
      "title": "Sterilize your pruning shears",
      "content": "Sterilize your pruning shears before you trim your orchid. Dip your pruning shears in a cup of rubbing alcohol and let them soak in it for 30 seconds. Open and close the shears a few times to ensure that the alcohol gets all over the blades. Then, remove the shears from the alcohol and set them on a paper towel to dry. [1] X Research source Rubbing alcohol dries quickly, so it will only take a few minutes for them to dry."
    },
    {
      "title": "Wait for all of the flowers to fall off of a stem before pruning it.",
      "content": "Wait for all of the flowers to fall off of a stem before pruning it. If your orchid is still blooming or if there are healthy flowers still on the stems, don’t prune the orchid yet. Wait until the blooms fall off. [2] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    },
    {
      "title": "Cut the stem down to the level of the soil if it is brown.",
      "content": "Cut the stem down to the level of the soil if it is brown. [3] X Expert Source Andi Xoch Plant Specialist Expert Interview. 4 August 2021. If your orchid has any stems that are brown or yellow and shriveled, they will not produce any more flowers, so pruning the stems is not recommended. Instead, cut these stems off completely. Use your sterilized pruning shears to cut the stems all the way down to the orchid’s roots. [4] X Research source Cutting off the stems might seem drastic, but it will allow new, healthy stems to grow."
    },
    {
      "title": "Trim off any brown, soft roots that are protruding from the soil.",
      "content": "Trim off any brown, soft roots that are protruding from the soil. Pull your orchid up and out of its pot and look at the roots to see if any of them appear to be dead. Dead roots will look brown and feel soft to the touch. Live roots will be white and firm. Cut across any of the roots that appear to be dead and then return the plant to its pot or repot it. [5] X Research source Trimming off dead roots will help to prevent root rot, which can kill your orchid."
    },
    {
      "title": "Sterilize your pruning shears before pruning your orchid.",
      "content": "Sterilize your pruning shears before pruning your orchid. Dip your pruning shears in a cup filled with isopropyl alcohol or rubbing alcohol for 30 seconds. Open and close them a few times to ensure that the alcohol makes contact with all surfaces of the blades. Then, place the pruning shears on a paper towel to air dry completely. [6] X Research source Rubbing alcohol dries quickly, so the shears should be ready to use within a few minutes."
    },
    {
      "title": "Inspect the leaves of your orchid to ensure it’s healthy enough to prune.",
      "content": "Inspect the leaves of your orchid to ensure it’s healthy enough to prune. If the base of the plant has glossy, green, firm leaves, then it is healthy enough for pruning. However, if the leaves are yellow, brown, dry, or limp, then the plant is not healthy enough for pruning. Give the plant a chance to get healthy before you prune it. [7] X Research source Make sure that you wait until all of the flowers have shriveled or fallen off before trimming to encourage new flowers to grow."
    },
    {
      "title": "Check to see if your orchid has any dormant eyes on the stems.",
      "content": "Check to see if your orchid has any dormant eyes on the stems. Eyes on orchid stems look like small spikes covered with a thin layer of brown or beige plant matter. These eyes can become new stems or flower spikes later on. If you notice any eyes on your orchid, be sure to prune the plant 1 ⁄ 2 in (1.3 cm) above them. [8] X Research source The eyes on orchids look similar to eyes you might spot on a potato."
    },
    {
      "title": "Identify the second node below where the flowers bloomed.",
      "content": "Identify the second node below where the flowers bloomed. A node looks like a brown line running horizontally in a circle around the stem. Usually, the nodes are thicker than other areas of the stem. Nodes are where new flower spikes will emerge on the orchid when it’s ready to bloom again. [9] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source If you spot an eye on a node, cut just above the node where the eye is located to preserve it."
    },
    {
      "title": "Cut 1⁄2 in (1.3 cm) above the nodes to encourage flowering.",
      "content": "Cut 1 ⁄ 2 in (1.3 cm) above the nodes to encourage flowering . This is about the width of your pinky finger. Cut straight across the stem with the sterilized shears. Cutting too close to the node or too far away may affect the plant’s ability to flower. [10] X Research source If there is an eye on the node, be careful not to cut the eye. Leave any brown or beige papery ski that’s covering the eye intact as well."
    },
    {
      "title": "Watch for new flowers to develop in 8-12 weeks.",
      "content": "Watch for new flowers to develop in 8-12 weeks. The speed at which your orchid will flower again will depend on its overall health, climate, and care. However, in general you can expect new flowers to bloom about 8 to 12 weeks after you prune your orchid. [11] X Research source If no flowers bloom within 8 to 12 weeks, try lowering the ambient temperature where your orchid is located by 5°C (8°F). This may help to stimulate new growth. [12] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    },
    {
      "title": "Repot the orchid",
      "content": "Repot the orchid after pruning if it has outgrown its pot. Repotting your orchid once every 2 years or whenever the roots are the same size as the pot is ideal. Choose a pot that is 2 sizes larger than the pot your orchid is currently in, such as a 8 in (20 cm) diameter pot if your orchid is currently in a 6 in (15 cm) pot. Add new potting soil and carefully transfer your orchid to the new pot. [13] X Research source Make sure that you use a specially formulated, well-draining orchid potting soil to repot your orchid."
    },
    {
      "title": "Keep the orchid in an east or west-facing window.",
      "content": "Keep the orchid in an east or west-facing window. This type of location will help to ensure that your orchid gets plenty of sunlight. Monitor the orchid closely to ensure that it is not getting too much sunlight, which may cause the leaves to turn brown or yellow. If the plant is getting too much sunlight, try a different location. [14] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    },
    {
      "title": "Water the orchid",
      "content": "Water the orchid only when the soil feels dry. Orchids can rot and die if you water them too often, so always check the soil before you water it. Stick your finger into the soil to see if it feels moist. If it does, then you don’t need to water the orchid. If the soil feels dry, water your orchid. [16] X Research source You can also use a pencil or wooden skewer to check the moisture level of the soil. Stick the pencil or skewer into the soil by about 1 in (2.5 cm), then pull it out and look at it. If the wood is dark from moisture, don’t water the orchid. If the wood is dry, water the orchid."
    },
    {
      "title": "Fertilize the orchid",
      "content": "Fertilize the orchid 3 out of 4 times when you water it. Purchase an orchid fertilizer and add it to your watering can as indicated by the manufacturer’s instructions. Use the fertilizer infused water for 3 waterings, and then use plain water for the fourth watering to wash out any built-up salts in the soil. Then, repeat the cycle with 3 fertilizer-infused waterings followed by 1 plain water one. [17] X Trustworthy Source Royal Horticultural Society Leading gardening charity in the U.K. providing resources for identifying, growing and caring for flowers and other plants Go to source"
    }
  ]
}