{
  "url": "https://www.wikihow.com/Erect-Scaffolding",
  "title": "How to Erect Scaffolding",
  "steps": [
    {
      "title": "Select a secure foundation on which to build and set your scaffold.",
      "content": "Select a secure foundation on which to build and set your scaffold. Obtain mud sills or base plates to attach the scaffolding to make the footing more stable. One of the main concerns here is to have the scaffolding level and on secure ground. If you are on unlevel ground, you my need to dig down to make the dirt level in any high corner. Also, use the adjusting screws on the scaffolding to level the structure. If the surface is on a drastic slope, obtain leg extensions. [1] X Trustworthy Source US Occupational Safety and Health Administration U.S. government agency responsible for setting and enforcing workplace safety standards Go to source"
    },
    {
      "title": "Opt for casters.",
      "content": "Opt for casters. If you plan on moving your scaffolding to work on various spots, include casters in your scaffolding setup. Remember to lock the casters when you get it into place."
    },
    {
      "title": "Assemble the scaffolding frame.",
      "content": "Assemble the scaffolding frame. [2] X Research source Lay out the ends of the scaffolding. Lift one end piece, and attach the upper cross brace. The far end of this brace should support the end piece while you lift the second end piece and attach its upper cross brace. Secure the ends of the cross braces to the bottom of the opposite end frame."
    },
    {
      "title": "Make sure the scaffold is stable.",
      "content": "Make sure the scaffold is stable. Move the scaffold into your desired position, and make sure it is level and secure."
    },
    {
      "title": "Place the planks.",
      "content": "Place the planks. [3] X Research source Lift the planks through the scaffold bars and into place. Hardware should be included to fasten the planks into place."
    },
    {
      "title": "Secure access to the scaffold.",
      "content": "Secure access to the scaffold. If ladders are used to access the scaffold, use ones that are designed for that specific scaffold. Stair-like ladders can be used to access the scaffold but must have handrails and treading. A concern with the access point is to make it safe to maneuver and to prevent the scaffold from tipping over."
    },
    {
      "title": "Attach the guardrails.",
      "content": "Attach the guardrails. [4] X Research source Guardrails are highly recommended for all scaffolding due to the height of the equipment and the risk of falls. [5] X Expert Source Agustin Renoj Home Improvement Specialist Expert Interview. 13 January 2021. Also consider using tie offs and other fall protection. [6] X Research source"
    },
    {
      "title": "Inspect the scaffolding to ensure safety.",
      "content": "Inspect the scaffolding to ensure safety. Thoroughly examine the scaffolding setup to make sure all pieces are secure. Reinspect the scaffold system every time you leave the site and return to it to make sure it is still safe."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}