{
  "url": "https://www.wikihow.com/Repair-a-Mower-Deck-Spindle",
  "title": "How to Repair a Mower Deck Spindle",
  "steps": [
    {
      "title": "Remove the deck from the mower.",
      "content": "Remove the deck from the mower. This will make it much easier to remove the spindle."
    },
    {
      "title": "Remove the blade and the pulley from the worn spindle.",
      "content": "Remove the blade and the pulley from the worn spindle. You may want to repair both spindles even though only one is showing symptoms."
    },
    {
      "title": "Remove the worn spindle from the deck.",
      "content": "Remove the worn spindle from the deck. Be careful when removing the bolts. Use penetrating oil and let it soak. If the bolts break off, don't panic. You can drill and tap new mounting holes slightly offset from the original ones."
    },
    {
      "title": "You must now dismantle the spindle assembly in order to replace the bearings.",
      "content": "You must now dismantle the spindle assembly in order to replace the bearings. Take the spindle to the bench and suspend the casing over the jaws of a vise or similar object."
    },
    {
      "title": "Reinstall the pulley nut a few turns onto the spindle shaft.",
      "content": "Reinstall the pulley nut a few turns onto the spindle shaft."
    },
    {
      "title": "As shown in the photo, strike the nut with one sharp blow from a small sledge.",
      "content": "As shown in the photo, strike the nut with one sharp blow from a small sledge. It doesn't take much. This should force the shaft out of the spindle casing."
    },
    {
      "title": "At this point, you should be able to remove the shaft from the spindle casing.",
      "content": "At this point, you should be able to remove the shaft from the spindle casing. You will be left with a spindle casing with the top and bottom bearings exposed."
    },
    {
      "title": "Using a screwdriver, tap out each bearing from its seat.",
      "content": "Using a screwdriver, tap out each bearing from its seat."
    },
    {
      "title": "Write down the number stamped on the side of the bearing and go to your local auto parts store to purchase a new one.",
      "content": "Write down the number stamped on the side of the bearing and go to your local auto parts store to purchase a new one."
    },
    {
      "title": "Clean all the parts well.",
      "content": "Clean all the parts well."
    },
    {
      "title": "Press one of the new bearings into the lower bearing seat.",
      "content": "Press one of the new bearings into the lower bearing seat."
    },
    {
      "title": "If there is a sleeve that fits over the shaft within the spindle casing, then make sure and place that into the casing before pressing on the upper bearing.",
      "content": "If there is a sleeve that fits over the shaft within the spindle casing, then make sure and place that into the casing before pressing on the upper bearing."
    },
    {
      "title": "Press on the upper bearing.",
      "content": "Press on the upper bearing."
    },
    {
      "title": "Assemble the shaft to the spindle.",
      "content": "Assemble the shaft to the spindle."
    },
    {
      "title": "Using a pipe or socket, press or tap the retaining sleeve onto the spindle shaft.",
      "content": "Using a pipe or socket, press or tap the retaining sleeve onto the spindle shaft. It will come rest against the inner race of the upper bearing."
    },
    {
      "title": "That's it.",
      "content": "That's it. Put the repaired spindle back onto the deck and you are good for another 5 years or so."
    }
  ]
}