{
  "url": "https://www.wikihow.com/Request-a-Duplicate-W%E2%80%902",
  "title": "How to Request a Duplicate W‐2",
  "steps": [
    {
      "title": "Check if you can access your W-2 online.",
      "content": "Check if you can access your W-2 online. Many employers have online payroll systems where you can view your W-2s and other important financial information. Try logging on to your payroll account and see if you can download another copy of your W-2. If you’re not sure how to access your online payroll system or how to find your W-2, check with your employer or someone in the payroll office."
    },
    {
      "title": "Ask your employer for a duplicate W-2.",
      "content": "Ask your employer for a duplicate W-2. If you lost, misplaced, or never received your W-2 form, ask your employer for a copy. This method is often the easiest and quickest way to get a copy of a W-2 if you can’t download a copy. Contact human resources or the person in charge of payroll for the company to send you a copy of your W-2 form."
    },
    {
      "title": "Update your address with your current employer.",
      "content": "Update your address with your current employer. If you've moved during the year, it's possible that your W-2 went to your old address. Give the employer your correct address for a duplicate W-2. Sometimes employers can send you a copy of your W-2 electronically, so ask about this option if you would like to get your W-2 form faster."
    },
    {
      "title": "Wait to receive your W-2.",
      "content": "Wait to receive your W-2. Contact the Social Security Administration if your employer does not send you your W-2 by February 14th. You may request a microprint copy of a W2 if a copy of a W2 is needed for a Social Security matter, such as an SSA earnings investigation."
    },
    {
      "title": "Determine if you need to call the IRS to get a copy of your W-2.",
      "content": "Determine if you need to call the IRS to get a copy of your W-2. Your first action should be to call your employer if you have not received your W-2 by the end of January. If your attempts to get your W-2 from your employer have failed, then you should call the IRS."
    },
    {
      "title": "Prepare to answer some questions before you call the IRS.",
      "content": "Prepare to answer some questions before you call the IRS. To make it easier and quicker to talk to the IRS about your missing pay stub, you should spend a few minutes preparing before you call. You can find your employer’s information on your final pay stub or earnings statement. You will be asked to provide the following information: Your name Your address Your phone number Your Social Security number Your employer’s contact information Your employment dates An estimate of the wages you earned for the tax year and the federal income tax withheld"
    },
    {
      "title": "Call the Internal Revenue Service (IRS) at (800) 829-1040 if you do not receive your W-2 by February 14th.",
      "content": "Call the Internal Revenue Service (IRS) at (800) 829-1040 if you do not receive your W-2 by February 14th. If your employer still has not sent you your W-2 by February 14th, you will need to contact the IRS. Remember to be prepared to provide the IRS with the following information about your employer: Your employer’s name Your employer’s address, including the city, state, and zip code Your employer’s phone number"
    },
    {
      "title": "File your return using alternative forms.",
      "content": "File your return using alternative forms. You will still have to file a tax return even if your W-2 is missing or late. To do so, you must include Form 4852 with your return, known as a “Substitute for Form W-2, Wage and Tax Statement.” [1] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source Form 4852 will require you to estimate your income and withholdings taxes."
    },
    {
      "title": "File a 1040X if needed.",
      "content": "File a 1040X if needed. If you receive your missing W-2 forms after you file your tax return using the Form 4852 and the information differs from what you reported on your return, you must amend your return. To amend your return, you will need to fill out a US 1040X Tax Return form, “Amended U.S. Individual Income Tax Return.” [2] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source"
    },
    {
      "title": "Use Form 4506 to order a copy of a previous year's tax return from the IRS.",
      "content": "Use Form 4506 to order a copy of a previous year's tax return from the IRS. The IRS keeps copies of W-2 forms from your previous tax years. To get a copy from the IRS you must order a copy of your entire tax return by using Form 4506. [3] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source This service is available for W-2s issued during the past 10 years. There is a $50.00 charge for each return that you request. If you use a Form 4506 to request a previous year’s tax return, you will only get a copy of your actual W-2 if you filed your taxes on paper that year (as opposed to e-filing)."
    },
    {
      "title": "Fill out a Form 4506-T if you just need wage and earning information.",
      "content": "Fill out a Form 4506-T if you just need wage and earning information. Form 4506-T is the Request for Transcript of Tax Return. This form is a good option if you just need certain information from your W-2 form, such as your wages and earnings. You may also need a Transcript of Tax Return to keep a personal income record or to verify employment. [4] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source Be prepared to provide the IRS with your name or names as they are shown on your tax return, Social Security number, and your current and past addresses."
    },
    {
      "title": "Use the online IRS tool called “Get Transcript” to view or print W-2 forms from previous years.",
      "content": "Use the online IRS tool called “Get Transcript” to view or print W-2 forms from previous years. [5] X Trustworthy Source Internal Revenue Service U.S. government agency in charge of managing the Federal Tax Code Go to source The “Get Transcript” tool is another way that you can access your tax returns from previous years. Before you can access your W-2 forms using the “Get Transcript” online service, you must create a login. Be prepared to provide the IRS with your Social Security Number and other personal information, such as your address."
    },
    {
      "title": "Call the Social Security Administration to get a copy of a W-2 form for a Social Security matter.",
      "content": "Call the Social Security Administration to get a copy of a W-2 form for a Social Security matter. You can reach the SSA by calling by calling 800-772-1213. This may be necessary if you need a W-2 form for a Social Security-related matter, such as a Social Security Administration earnings investigation. You may contact the Social Security Administration to request a microprint copy of a W-2 form. You can also visit the Social Security Administration’s website for detailed instructions on how to obtain wage information. [6] X Research source"
    },
    {
      "title": "Pay any fees that are required to obtain your duplicate W-2 forms.",
      "content": "Pay any fees that are required to obtain your duplicate W-2 forms. Copies of W-2 forms are free from the Social Security Administration if you need them for a Social Security-related matter. If you do not need the W-2 forms for a Social Security-related matter, you will have to pay a $37.00 fee. Examples of Social Security-related matters include an earnings investigation by the Social Security Administration or an earnings discrepancy in connection with processing a Title II or Title XVI claim. Examples of non-Social Security-related matters include filing federal or state tax returns, establishing residency, or providing income information for workers’ compensation. If you do not need the W-2 for a Social Security-related matter, then use one of the other methods to obtain your W-2. [7] X Research source"
    }
  ]
}