{
  "url": "https://www.wikihow.com/Help-Someone-with-Their-Period",
  "title": "How to Help Someone with Their Period",
  "steps": [
    {
      "title": "Help them out if they suddenly get their period.",
      "content": "Help them out if they suddenly get their period. If you don't have any supplies, consider offering to go out and get some, such as by going to the nurse's station if at school or college, or popping to the store if at home or work."
    },
    {
      "title": "Comment on positive things or compliment them.",
      "content": "Comment on positive things or compliment them. This will take their mind off feeling less down in the dumps. Most of all, be understanding. Don't make jokes about \"that time of the month\", \"rags\" or \"PMS\", etc. Joking about such things won't help them to feel reassured, and it may irritate or embarrass them. Do commiserate if you know how it feels to have a period. If you don't, then be sympathetic but not invasive."
    },
    {
      "title": "You might accompany them to the sick room or to give them a back rub.",
      "content": "You might accompany them to the sick room or to give them a back rub. Be careful about offering medications; in some cases it's illegal to do so. Ask them if they've had any water recently. If not, fetch them some quickly. Staying hydrated may help ease their queasiness and cramps. Offer to buy them some groceries or a ready-made meal. Or, better yet, make them a meal. Run errands for them on the days they feel worst. They'll be happy to do the same for you when you need it. Bring them a hot water bottle to soothe their cramps. Or, if appropriate, offer to massage their lower back."
    },
    {
      "title": "Gently take them aside and let them know.",
      "content": "Gently take them aside and let them know. If you have a cleaning cloth, a spare pair of jeans or skirt, etc., you can offer those as well. After they're tidied up, you can give them the \"all clear\" if they ask you, otherwise just let it be. If you have any portable stain remover in your bag or desk drawer, give it to them to use. Don't make fun of stains and don't broadcast the fact that you've seen stains. It's impolite to make a big deal out of it and pointless too. Everyone has messy problems now and then."
    },
    {
      "title": "The hormones and discomfort can take a toll.",
      "content": "The hormones and discomfort can take a toll. This can cause some people to feel blue or irritable or sad or even extremely anxious. Most of the time it is short-lived and blows over with a good rest, nutritious food and some tender loving care. Everyone has down days, so roll with it and be a nice and helpful person. Avoid criticizing them for how they are, as this will only make things worse for them."
    },
    {
      "title": "Your help will be reciprocated when you're in need.",
      "content": "Your help will be reciprocated when you're in need. It's about treating someone kindly in acknowledging and caring about the state you find them in. Most people will return the favor whenever a favor has been done for them."
    }
  ]
}