{
  "url": "https://www.wikihow.com/Clean-a-Beauty-Blender",
  "title": "How to Wash a Beauty Blender Sponge",
  "steps": [
    {
      "title": "Prepare a dish of warm, soapy water.",
      "content": "Prepare a dish of warm, soapy water. Fill a small dish with warm water, then squeeze a dollop of gentle hand soap or shampoo into it. Mix lightly until suds form on the surface of the water. Dish soap is generally not recommended, as it can irritate your skin when you need to use the sponge later. Choose a soap specially formulated for makeup brushes or go with a natural body or face wash that's free of chemicals and fragrances. Avoid using face washes for acne-prone or oily skin. Baby shampoo and “gentle formula” organic shampoos work especially well, but most soaps that are safe for use on your skin or hair can be used here."
    },
    {
      "title": "Soak the sponge for 30 minutes.",
      "content": "Soak the sponge for 30 minutes. Drop the sponge into the dish of soapy water. Squeeze it two or three times with your hand, then allow it to soak for approximately 30 minutes. [1] X Research source The dish should have enough water in it to completely cover the blender sponge. If there isn't enough water initially, simply add more as needed. As the sponge soaks, the water will likely begin to change color. Expect the water to take on a dingy beige or tan hue as it draws the foundation and other cosmetics out of the sponge. The sponge should also expand to its full size as it soaks in the soapy water."
    },
    {
      "title": "Massage cleanser into the sponge.",
      "content": "Massage cleanser into the sponge. Gently rub solid \"Blender Cleanser\" or an equivalent soap directly into the most heavily soiled areas of the sponge.You must use a gentle cleanser to avoid damaging the sponge. If you prefer solid soaps, castille soap usually works well. If you'd rather choose a liquid soap , consider moisturizing baby shampoo or an organic shampoo with a gentle formula. Spend 2-3 patient minutes massaging the cleanser into the sponge. Only use your fingertips; do not use a scrubbing brush or other abrasive tool since doing so could damage the sponge."
    },
    {
      "title": "Rinse the sponge free of soap.",
      "content": "Rinse the sponge free of soap. Rinse the sponge under warm, running water until all of the cleanser washes out of it. Any additional makeup sitting near the surface of the sponge should get rinsed out during this step as well. You may need to gently squeeze the sponge under the running water to help remove the soaps and makeup."
    },
    {
      "title": "Analyze whether or not the sponge is clean enough by the clarity of the water while rinsing.",
      "content": "Analyze whether or not the sponge is clean enough by the clarity of the water while rinsing. If the rinse water runs clear beneath the blender sponge, it should be adequately clean and you can move directly to the drying step. If the rinse water still seems dingy, skip the drying step and move into the deep cleaning method (see the “Deep Cleaning” section of this article)."
    },
    {
      "title": "Dry using paper towels.",
      "content": "Dry using paper towels. Wring out excess water by gently squeezing the sponge with your hand, then roll the sponge in clean, dry paper towels to absorb any water still inside. If the sponge is still damp after you blot out the water with paper towels, let it sit in a dry location to continue air drying. Wait until the sponge is completely dry before using it as an applicator."
    },
    {
      "title": "Deep clean the sponge only as needed.",
      "content": "Deep clean the sponge only as needed. As a general rule, you'll only need to perform deep cleaning on your blender sponge if the sponge still appears dirty after following basic cleansing procedures outlined above. This is more likely to happen if you use your blender sponge multiple times per day or if you forget to clean it for one or more weeks. You'll know if your blender sponge needs deep cleaning by looking at it. If the rinse water at the end of your basic cleansing routine seems dirty, or if there are visible stains on the sponge after it dries, try deep cleaning it."
    },
    {
      "title": "Wet the sponge.",
      "content": "Wet the sponge. Hold the sponge under warm, running water for 30 to 60 seconds, or until it absorbs enough water to expand to its full size. Alternatively, you could place the blender sponge in a bowl of warm water for 5 to 10 minutes. You do not need to use soapy water, nor do you need to wait for the water to change color before continuing to the next step."
    },
    {
      "title": "Apply cleanser to the soiled areas.",
      "content": "Apply cleanser to the soiled areas. Dab solid or liquid cleanser directly onto the most heavily soiled areas of the sponge. As with the basic cleaning procedure, you should only use gentle cleansers on your sponge. Specially formulated “Blender Cleanser” works well, but if you'd prefer another option, solid castille soap, liquid baby shampoo, or “sensitive formula” organic shampoos will also work."
    },
    {
      "title": "Rub the sponge against your palm.",
      "content": "Rub the sponge against your palm. Rub the coated portions of the sponge against the center of your palm, working the sponge in small circular motions. Continue rubbing the sponge for approximately 30 seconds. [2] X Research source The scrubbing should be vigorous and more intense than the scrubbing used during your basic cleansing routine. Note, however, that it should still be gentle enough to avoid distorting the shape of the sponge or tearing the sponge material. As you scrub, the cosmetics lying deeper inside the sponge will be drawn out through the surface. You should notice the suds on your palm becoming tinted with the color of your foundation."
    },
    {
      "title": "Rinse while continuing to scrub.",
      "content": "Rinse while continuing to scrub. Rinse the sponge under warm, running water while continuing the rub it against your palm in circular movements. Keep rinsing the sponge until all of the suds are gone. You may need to rinse the sponge for several minutes before you clean out all the soap. It's important that you rinse out all of the soap, though, so don't rush the process."
    },
    {
      "title": "Test the sponge.",
      "content": "Test the sponge. Rinse the sponge under running water again until all of the suds disappear. Make sure that the water you squeeze out is clear and clean. Apply more cleanser to the sponge and rub it against your palm. If the resulting lather is white instead of gray or beige, the sponge should now be clean."
    },
    {
      "title": "Dry the sponge.",
      "content": "Dry the sponge. Gently wring out most of the excess moisture by squeezing the sponge with your hand. Roll the sponge over clean, dry paper towels to dry it off even more. The sponge will probably still be damp after this, so set it aside in a dry place and allow it to air dry. Only use the blender sponge as an applicator once it is completely dry."
    },
    {
      "title": "Sterilize the sponge monthly.",
      "content": "Sterilize the sponge monthly. Even if you clean your sponge on a weekly basis, you should still sterilize it using heat at least once a month. This is especially important if you use your blender sponge on a daily basis. Standard cleaning removes surface bacteria, but the only way to kill bacteria lying deeper in the sponge is by killing it with a short burst of intense heat. You may need to sterilize the sponge more than once a month if you notice the bacteria building up more rapidly. Signs of intense bacteria build-up include uncharacteristic acne breakouts and a foul/unusual odor coming from within the sponge. Note that you'll still need to perform a basic cleaning procedure after sterilizing the sponge. Sterilization will only kill the bacteria; it will not remove any cosmetic stains or foundation."
    },
    {
      "title": "Place the sponge in a dish of water.",
      "content": "Place the sponge in a dish of water. Fill a microwave-safe bowl with approximately 1 inch (2.5 cm) of water. Lay the sponge down in the center of the water puddle. You must sit the blender sponge in water. Do not microwave a fully dry sponge since doing so could damage the material or cause the sponge to catch fire."
    },
    {
      "title": "Microwave for 30 seconds.",
      "content": "Microwave for 30 seconds. Place the uncovered bowl in your microwave and run the appliance at full power for 30 seconds. [3] X Research source Keep an eye on the blender sponge as you microwave it. Don't be alarmed if it expands slightly or if small trails of smoke develop, but stop the microwave immediately if it balloons up past its full size or if heavy smoke starts to form."
    },
    {
      "title": "Let it rest.",
      "content": "Let it rest. Wait one or two minutes before removing the bowl from the microwave and removing the sponge from the water. The sponge will likely be very hot once the microwave cycle ends, and the waiting period is primarily for your own protection. You can actually handle the sponge as soon as it is cool enough to touch."
    },
    {
      "title": "Dry the sponge.",
      "content": "Dry the sponge. Gently roll the sponge in clean, dry paper towels. Let it sit out at room temperature until it feels completely dry. If you plan on performing a basic cleansing routine on the sponge after sterilizing it with heat, you can do so immediately after pulling it out of the microwave. You do not need to dry the sponge first. Wait until the blender sponge is completely dry before using it as an applicator."
    }
  ]
}