{
  "url": "https://www.wikihow.com/Know-if-a-Shy-Guy-Likes-You",
  "title": "How to Know if a Shy Guy Likes You",
  "steps": [
    {
      "title": "The way a guy reacts to your presence reveals their true feelings.",
      "content": "The way a guy reacts to your presence reveals their true feelings. A shy guy may be tight-lipped and do his best to not reveal too much, but it’s hard to disguise your initial reaction to someone. If he lights up whenever you walk in the room, it’s a very good sign that he’s interested in you romantically. [1] X Expert Source Moshe Ratson, MFT, PCC Marriage & Family Therapist Expert Interview. 18 September 2019. This is an especially strong sign if he doesn’t tend to do the same thing with other people."
    },
    {
      "title": "A shy guy may not have the boldness to sweet talk you.",
      "content": "A shy guy may not have the boldness to sweet talk you. If he’s even slightly more talkative with other people but he clams up around you specifically, it’s a sign that he’s into you. Shy guys often overthink what to say or do when they’re around people who take their breath away, so you may feel like you’re always carrying the conversation. [2] X Research source This isn’t to say that he’ll avoid you. In fact, he’ll probably go out of his way to be around you—he’ll just be really quiet (and maybe a little awkward)."
    },
    {
      "title": "Shy people tend to listen super hard to compensate for their quietness.",
      "content": "Shy people tend to listen super hard to compensate for their quietness. A shy guy can come off like he doesn’t really have a lot to say if he’s into you, but he’ll have no problem paying close attention to you. If it feels like he’s a very attentive listener and it seems like you’re always the one ending the conversation, it’s a sign they’re super into you. [3] X Research source This is particularly noticeable in group settings. If he looks off in the distance when some people talk, but looks at you and nods along when you speak up, he’s probably interested. If he ever spaces out when he talks to you or he seems to get lost when you speak for more than 5-10 seconds, he may not be into you."
    },
    {
      "title": "A shy guy may try to be cool around you, but he’ll probably seem awkward.",
      "content": "A shy guy may try to be cool around you, but he’ll probably seem awkward. Shy guys may be quiet around other people generally, but he won’t necessarily seem awkward. If he’s around you and his quiet calmness suddenly turns into an embarrassing and perplexing goofball, it means he’s trying really hard to impress you—even if he isn’t particularly good at it. [4] X Research source They may tell you odd jokes or make a lot of confusing comments. You may even get the impression that they’re messing with you sometimes. If he’s just generally awkward around everybody, it’s likely that he’s just a bit of an oddball and he may not like you."
    },
    {
      "title": "He’ll probably have a strong reaction if you say something nice to him.",
      "content": "He’ll probably have a strong reaction if you say something nice to him. Shy guys often aren’t ready to take a compliment from someone they like, and you’re going to throw them for a loop by saying something kind and sweet. Throw him a semi-flirty comment and see how he reacts. [5] X Research source You might say, “Your hair looks really cute today,” “I really like your outfit,” or, “Has anyone ever told you that you look like Chris Pratt?” If he likes you, he will likely stammer, clam up, or get visibly embarrassed. He may also pay you back an awkward compliment of his own. If he isn't crushing on you, he won’t have a strong reaction. He may just say, “Oh, thanks,” and keep moving."
    },
    {
      "title": "A shy guy may not want to talk about himself, so he’ll ask about you.",
      "content": "A shy guy may not want to talk about himself, so he’ll ask about you. If a guy tends to pepper you with questions, it means that he’s interested in you. This may be super noticeable with a shy guy, though. Introverted guys tend to be a little uncomfortable when it comes to talking about themselves, so he’ll redirect the conversation to focus on you. [6] X Research source This is also a sign that he wants to keep a good conversation going. In addition to questions about what you’ve been up to or what you like to do in your spare time, he may ask a lot of random questions. He may ask things like, “What does your name mean?” or, “What’s the worst job you’ve ever had?”"
    },
    {
      "title": "People fidget when they’re not confident, so see if he gets twitchy.",
      "content": "People fidget when they’re not confident, so see if he gets twitchy. He may play with his hair, keep touching his nose and eyebrows, or play with his hands and fingers. When seated, he may shake his knee up and down or move around a lot. [7] X Research source This is a natural reaction people have when they’re not calm, and a shy guy will definitely not be cool when they’re around someone they like. If he fidgets when he’s bored and you spot him fidgeting all the time when he’s in a boring class or a meeting, the fidgeting around you might not actually mean a whole lot."
    },
    {
      "title": "A shy guy will volunteer to do things for you just to be around you.",
      "content": "A shy guy will volunteer to do things for you just to be around you. If he’s jumping at every opportunity to help you out, he’s super into you. But even if he hasn’t volunteered, a shy guy with a crush will jump at the opportunity to make you happy if you ask him, especially if it means they get to hang out around you. Try asking for a tiny favor and see what he does. [8] X Research source You might ask him to help you carry something out of your car, or help you with your math homework. If he jumps at the opportunity, he’s definitely into you. If he agrees to help but doesn’t seem particularly excited about it, or he sort of sighs and says, “I guess,” he probably doesn’t have a crush on you."
    },
    {
      "title": "More assertive fellas make eye contact, but a shy guy will try to hide it.",
      "content": "More assertive fellas make eye contact, but a shy guy will try to hide it. Eye contact is usually a big sign of attraction, but it’s kind of complicated with a shy guy since they may be kind of scared to lock eyes. If you ever turn your head and you spot him instantly turn his head away from you, he’s probably into you. [9] X Research source Staring, and other types of body language , are one of the main ways people determine whether someone likes them or not. That may not happen when someone is shy. A shy guy may not have the confidence to try locking eyes, winking, brushing against you, etc. They’ll steal a stare here and there if they think they can get away with it, though!"
    },
    {
      "title": "Shy guys will be more talkative when they can review their responses.",
      "content": "Shy guys will be more talkative when they can review their responses. Shy guys are usually not all that open in-person where they can’t think through everything they want to communicate. If this guy gets a lot better at conversation when you text them or chat over social media, it’s a big sign that they’re into you. [10] X Research source You may even notice little gaps between messages. If they don’t reply right away and they take 15-60 seconds to think through their response, it means they really care what you think. Reader Poll: We asked 941 wikiHow readers, and 50% of them agreed that the best way to help a shy or introverted person feel more comfortable is by giving them time and space to open up . [Take Poll]"
    },
    {
      "title": "A good memory is a sign that he thinks about you often.",
      "content": "A good memory is a sign that he thinks about you often. If he ever remembers your favorite candy bar, or he brings you coffee in the morning just the way you like it, it reflects two things. First, it means they pay very close attention to you when you speak. Second, it means that you’re on their mind. Those little details would be forgotten if they weren’t interested in you! [11] X Research source He may also remember details about your personal life. If he remembers that small town you grew up in, or he remembers you played volleyball growing up, he’s definitely thinking about you."
    },
    {
      "title": "A shy guy might enlist help to figure out if you’re into him.",
      "content": "A shy guy might enlist help to figure out if you’re into him. Shy guys aren’t always very good at pursuing crushes directly, but that doesn’t mean they won’t try in other ways. If his friends ever ask you how you feel about him or what you think about things he’s interested in, this shy guy has probably asked his friends to test the waters for him. [12] X Research source One friend may casually ask, “So, do you and James hang out a lot?” When you reply, they may follow up with something like, “Do you like hanging out with him?” or, “Oh, you two should hang out more often. James is a nice guy.”"
    }
  ]
}