{
  "url": "https://www.wikihow.com/Avoid-Talking-in-Class",
  "title": "How to Avoid Talking in Class",
  "steps": [
    {
      "title": "Talking in class seems less fun when you’re right in front of the teacher.",
      "content": "Talking in class seems less fun when you’re right in front of the teacher. Sitting up close to the board also helps you stay focused on the lesson. If you’re allowed to choose your seat, choose a desk up front. [1] X Research source If the spots at the front are taken, look for a quiet student and sit by them. Chances are they won’t start a conversation with you like your best friend might!"
    },
    {
      "title": "Think of the quiet students as your role models.",
      "content": "Think of the quiet students as your role models. Look around the classroom and see if you notice a student that rarely talks during class. For the rest of the class, try acting like them. This can help you practice being more well-behaved and less talkative. [2] X Expert Source Katie Styzek School Counselor Expert Interview. 28 October 2020. For example, maybe this student sits quietly and takes notes. Follow their lead and get your own notebook! Another student might participate a lot in class but always makes sure to raise their hand first. Try that out, too."
    },
    {
      "title": "Before you open your mouth, ask yourself “Is this something that can wait?”",
      "content": "Before you open your mouth, ask yourself “Is this something that can wait?” Sometimes it's hard to remember to filter your thoughts. Think about if what you want to say is related to the class discussion. If it's not, wait until class is over to share what you're thinking. Even the funniest joke in the world can wait until break! [3] X Research source If it’s at all disruptive, like \"This subject is boring, is class almost over?\" don’t say that out loud. Another good trick is to raise your hand. While waiting to be called on, think about what you want to say. If it's not related to the subject your teacher is discussing, put your hand down and remain quiet. Always raise your hand when you have a question about class. Not talking during class doesn't mean your questions about the lesson should go unanswered."
    },
    {
      "title": "Take notes to stay focused on the lesson.",
      "content": "Take notes to stay focused on the lesson. It’s hard to have side conversations when you’re too busy writing down the latest vocab words! If you really struggle to talk, you can write down thoughts you have in your notebook instead of saying them. [4] X Research source Classroom notes should take priority, but if you think of a joke you want to tell your friend, write that down, too. That way you can remember it after class and share it with your friend! You can also use your notebook to write down anything you want to talk about after class. For example, instead of talking to your friend during a lesson, write down, \"Remember to tell Jimmy that my mom said it was okay for them to stay the night this weekend.\""
    },
    {
      "title": "Texting what you have to say instead of talking isn't a good option.",
      "content": "Texting what you have to say instead of talking isn't a good option. Using your phone in class distracts you from the lesson. It also disrupts the whole class if the teacher has to stop and ask you to put your phone away. Leave your phone tucked away in a safe place like your pocket or locker. [5] X Research source You should also avoid passing notes during class, A.K.A. texting the old-fashioned way."
    },
    {
      "title": "Sometimes it’s not you doing all the talking!",
      "content": "Sometimes it’s not you doing all the talking! It can be hard to know how to stop responding to talkative people in class. Do your best to politely tell the students around you that you can’t talk until class is finished. After that, ignore their comments. They’ll get the message and stop trying to talk. Side conversations can be really distracting to teachers, and it’s hard to follow along with the lesson in the middle of another conversation! Try your best to avoid talking with your classmates to really focus. [6] X Research source While you're in the hallway before class, try taking your talkative classmates aside and say something like “I’m not going to talk during class anymore, so can we talk at lunch instead?” Try not to be impolite if your friends talk to you during class. Always be kind and ask them nicely not to pester you while you focus. Yelling \"SHH!\" across the room is no better than talking."
    },
    {
      "title": "There is no shame in asking someone to help you stop talking.",
      "content": "There is no shame in asking someone to help you stop talking. Try asking one of your friends to give you a cue whenever you start to talk in class. Maybe they can cough or tap your shoulder. Whatever cue you decide on, make sure it doesn’t involve them talking to you at all or it defeats the purpose. [7] X Research source Ask a friend that doesn’t usually talk in class. Try something like, “Hey Sam, I’m trying to do a better job at not talking in class. Next time I try to talk to you, can you tap a pencil on your desk as a cue for me to stop?”"
    },
    {
      "title": "They may be upset when you talk, but they can also give you great advice.",
      "content": "They may be upset when you talk, but they can also give you great advice. Tell your teacher you’re having a hard time not talking in class, and see if they have any suggestions for things you can try. Remember that teachers want to see you succeed! They’ll be happy to help you. [8] X Expert Source Katie Styzek School Counselor Expert Interview. 28 October 2020. After class, tell your teacher something like \"I'm trying really hard to stop talking during your class, but I'm still struggling with it. Could you please help me?\""
    },
    {
      "title": "Write something on it to remind yourself not to talk!",
      "content": "Write something on it to remind yourself not to talk! Every time you get the urge to speak, glance down at your sticky note. Consider picking a fun, bright color so that it will attract your attention and act as a good reminder. [9] X Research source Try writing something like “I can talk when class is over” or “silence is golden.”"
    },
    {
      "title": "You may not be able to change your habits overnight.",
      "content": "You may not be able to change your habits overnight. Try to break up your goal into a few smaller goals so that it doesn’t seem so overwhelming. Start by not talking at all through the first half of class. Once that becomes second nature, make your next goal to not speak during the entire class. Finally, make it your goal to avoid side conversations all day! [10] X Research source"
    },
    {
      "title": "Just try your best!",
      "content": "Just try your best! It can be easy to get discouraged when you’re trying something new. If you mess up and talk during class, tell yourself that it’s okay and keep moving forward. Everyone makes mistakes! All that matters is that you keep trying and never give up. [11] X Research source Let’s say you accidentally blurt out a joke in class. Instead of beating yourself up, tell yourself something like, “I just made a mistake and that’s okay. Now I just have to be quiet for the rest of class to make up for it!”"
    },
    {
      "title": "Tell yourself that if you're quiet, you get to watch your favorite movie!",
      "content": "Tell yourself that if you're quiet, you get to watch your favorite movie! Positive reinforcement helps you keep up the good work and stay motivated. As you meet your goals, reward yourself with a piece of candy, 10 extra minutes of playtime after school, or something else you enjoy. It’s hard to stay quiet all day in school, and you deserve it! [12] X Research source Talk to your parents about a reward system that you both agree on. Maybe your mom can take you out for ice cream at the end of the week if you promise to be quiet and focused in class!"
    }
  ]
}