{
  "url": "https://www.wikihow.com/Blunt-Person",
  "title": "What It Means to Be Blunt (& Why It Can Be a Positive Thing)",
  "steps": [
    {
      "title": "A blunt person says what they’re thinking without trying to sound polite.",
      "content": "A blunt person says what they’re thinking without trying to sound polite. They may not consider the consequences of speaking their mind; they’re always direct and honest. Blunt people will “tell it like it is,” while someone more sensitive might try to be diplomatic or avoid discussing a delicate issue. Bluntness can sound harsh, but it’s the complete truth. [1] X Research source A tactful person might say, “You’re doing well so far! Have you tried this yet?” However, a blunt person might say, “No, that’s not how you do it. Do it like this.”"
    },
    {
      "title": "Blunt people are just trying to be honest, not hurtful.",
      "content": "Blunt people are just trying to be honest, not hurtful. Having a blunt personality is about speaking your mind and telling the truth without worrying about other people's feelings. A blunt person is usually trying to offer straightforward advice or share their honest thoughts about a subject, but someone else might interpret their directness as hurtful. [2] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Blunt people usually tell the truth because they have good intentions. They genuinely believe the truth will help, but may not speak their truth in the best way at times."
    },
    {
      "title": "Bluntness can seem cold or rude to sensitive individuals.",
      "content": "Bluntness can seem cold or rude to sensitive individuals. A blunt person says what they think, whether critiquing someone’s art or saying they don’t like a friend’s new partner. Because they’re not trying to spare anyone’s feelings, their opinions may come across as unkind or critical. They’re not trying to upset anyone; they simply don’t realize their words could be hurtful. [3] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source Bluntness can seem jarring to sensitive people or anyone not used to being challenged. Many blunt people end up apologizing (or clarifying their words) after unintentionally hurting someone’s feelings. Blunt people want their friends to face the truth, but can get impatient. That's why they speak up instead of letting people figure things out for themselves."
    },
    {
      "title": "",
      "content": "They tell the truth about everything. It’s important to have friends you can trust to be totally honest . They won’t lie to spare your feelings; when they don’t agree with something, they’ll tell you, and when they compliment you , you’ll know it’s genuine! [4] X Research source Example: Blunt people aren’t afraid of delivering bad news. They’ll tell you when they catch your date lying about you or someone talking behind your back instead of leaving you in the dark. They’ll push you to take action and make positive changes. When you tell them about your dreams and goals, a blunt friend will encourage you to make them a reality. They believe in putting words into action. While some friends might offer vocal support, a blunt person will give you the push you need to get to work. [5] X Research source Blunt friends also advocate for self-improvement, encouraging you to learn new things and take on new challenges. They can help you make decisions because they have no problem playing devil’s advocate and questioning you. They’ll look out for you and tell you what you need to hear. Blunt people share their opinions, even if you get a little offended. Ultimately, that means they care! They tell it like it is because your well-being, safety, and happiness matter to them. They’re willing to risk offending you to tell you what you need to hear. [6] X Research source Example: If a blunt friend feels you have a partner who doesn’t appreciate you or a job that doesn’t pay you enough, they’ll tell you—and encourage you to seek love (or employment) elsewhere. They’re thoughtful listeners. Blunt friends don’t just dish out opinions and advice without thinking. They get as many facts as possible first, which is why they’re great listeners. They listen attentively (without cutting you off or talking over you) to fully understand the situation before offering a trademark blunt response. [7] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source They don’t accept excuses or denial. Blunt people are no-nonsense and won’t let you wallow in self-pity or denial. They’ll hand out reality checks because they know facing the truth is the healthiest thing you can do. They’re also great at figuring out when someone is lying. If someone lies to you, they’ll call it out to protect you. [8] X Research source Example: Blunt friends are helpful during breakups when you to want to wallow in sadness. Letting your feelings out is healthy, but when it’s time to move on, your blunt friend will tell you to get back up, stay busy, and remind you that you deserve better anyway. They give genuine advice. Many blunt friends share their feelings and observations to be helpful. They tell the truth because they believe it’ll make a difference, whether they’re tearing apart an outfit choice or pointing out that someone’s taking advantage of you. They're really just trying to offer you advice. [9] X Research source Example: A blunt person might say, “That outfit looks really unflattering,” but then add something like, “Try a different pair of pants. I think gray or black ones would work.” They won’t rub it in when they’re right. Some blunt people might say, “I told you so,” but most just want to tell the truth and don’t care about being right. A blunt person with good intentions will tell you how they feel and then let you do what you want; if they’re right, they won’t brag or gloat about it. [10] X Research source They’ll apologize when they’re wrong. Blunt people believe in total honesty, so why wouldn’t they be honest with themselves? A blunt person might be confrontational sometimes, but they also won’t shy away from admitting when they’re wrong and making a genuine apology. [11] X Research source Even if they’re not wrong, let a blunt friend know when they upset you with their directness. They’ll appreciate your openness and usually won’t have a problem apologizing or explaining themselves."
    },
    {
      "title": "Blunt people have good intentions, and rude individuals do not.",
      "content": "Blunt people have good intentions, and rude individuals do not. A blunt person may absolutely come off as rude, but that’s not their intention. Conversely, someone trying to be rude doesn’t care about you; they want to make you feel worse and won’t try to help or give any advice. Blunt people may not consider your feelings before speaking, but they do it because they care about you and want to help you succeed. [12] X Research source Being rude doesn't require bluntness. An unkind person isn’t trying to be your friend or tell the truth, but a blunt person is. When someone's bluntness offends you, look for the good intentions behind their words. The more you see how their words are meant to be helpful, the more you can appreciate how good of a friend they are!"
    }
  ]
}