{
  "url": "https://www.wikihow.com/Save-a-Dying-Betta-Fish",
  "title": "How to Save a Dying Betta Fish",
  "steps": [
    {
      "title": "Get a larger tank.",
      "content": "Get a larger tank. A tank size of 2.5 gallons (9.5 liters) at minimum is recommended for a single betta fish. If you have more than one fish, you should get a bigger tank to accommodate all of the fish. [1] X Research source If you have a larger tank, you may not need to change the water as frequently. Toxins will build up more quickly and in higher concentration in a smaller tank."
    },
    {
      "title": "Test the tank’s water.",
      "content": "Test the tank’s water. Having a good pH balance will help restrict the levels of ammonia, nitrite, and nitrate, which will in turn keep your betta healthy. An ideal pH is 7. [2] X Research source Treat the water with a dechlorinator. Follow the manufacturer’s instructions to put this into the water. Test your water for ammonia using a test kit. You will either use a dip-stick test or gather a water sample to test the water. Your ammonia level should read 0, since you just used a dechlorinator. Measure the ammonia level once per day until you start seeing ammonia levels. This will tell you how long you can go before changing the tank’s water. [3] X Research source"
    },
    {
      "title": "Change and condition the water.",
      "content": "Change and condition the water. Twice a week, you should change the water in the tank to make sure that you don’t have dangerous levels of ammonia, nitrate and nitrite building up. You can use distilled, bottled or tap water, but each kind of water needs to be treated before it goes in the tank in order to restore the proper balance of nutrients in the water. Change 25%-50% of the water in the tank twice a week. This means you add 25% new water and keep 75% of the old water (or 50% new and 50% old). Use aquatic water conditioners, available at your pet store for $5-$10, to adjust pH levels in the water. Use them according to the manufacturer’s instructions. Add 1 tablespoon of aquarium salt and 1 drop per gallon of a fungus preventative like Aquarisol. Do not use table salt in place of aquarium salt. Table salt may have additives like iodine and calcium silicate, which can be harmful to fish."
    },
    {
      "title": "Cycle your tank.",
      "content": "Cycle your tank. Cycling your tank means that you build up good bacteria in the tank so that your fish can flourish. This bacteria will help keep ammonia levels low by breaking down fish waste into nitrite and then into nitrate. Start with a fresh tank with no fish in it to cycle the tank. [4] X Research source Add an ammonia source to start the process of generating the good bacteria in nitrate. You can either add fish food or an ammonia solution to the tank. Use a test kit to test the water for ammonia, nitrite and nitrate levels. Your ammonia level will initially read 0. Test the water every day and the ammonia level will start to show trace amounts. The ammonia level will then drop as the nitrite level starts to show up. Then the nitrite level will decrease and the nitrate level will go up. Add a few flakes of fish food every day to keep the ammonia levels generating, which generate nitrite and nitrate levels in turn. Be patient. Cycling a tank properly can take 4-6 weeks to introduce the proper levels into the tank. The improved water quality will keep your fish healthy and sustain longer lives."
    },
    {
      "title": "Regulate the tank water’s temperature.",
      "content": "Regulate the tank water’s temperature. The tank’s temperature should be between 78 and 82 degrees Fahrenheit. Use a heater to keep the temperature constant. [5] X Research source Keep a thermometer in the tank and check it periodically to make sure the temperature is constant. Keep the tank in a warm area of the room. The tank should maintain an even temperature. Keeping it by a window can risk exposure to colder temperatures that can be damaging to the betta."
    },
    {
      "title": "Use a filter in the tank.",
      "content": "Use a filter in the tank. Place a filter in the tank to help clear the water of impurities. The filter should not cause the water to stir too much, as bettas don’t like turbulent water. Filters are available at the pet store for $30-$150, depending on the size of your tank. Buy a filter that is the correct size for your tank."
    },
    {
      "title": "Put aquarium salt in the tank.",
      "content": "Put aquarium salt in the tank. Aquarium salt is derived from evaporated sea water and can be used in fish tanks to reduce nitrite in the water and promote healthy gill functions. It can also help increase electrolytes, which improve a fish’s overall health. [6] X Research source Add 1 tablespoon of aquarium salt for every 5 gallons of water. Add aquarium salt to new fish tanks, when you are changing the water, and when you are trying to figure out a fish’s health problems. Do not use table salt in place of aquarium salt. Table salt may have additives like iodine and calcium silicate, which can be harmful to fish."
    },
    {
      "title": "Empty the tank.",
      "content": "Empty the tank. If your fish needs to be isolated, you will also need to disinfect your tank to prevent the transfer of any health problems to other fish. You also should disinfect your tank before putting your fish back into it. [7] X Research source Pour out water and remove all objects from the tank."
    },
    {
      "title": "Throw away any live plants.",
      "content": "Throw away any live plants. These cannot be disinfected, so it is best to start with new plants if you use live plants or just use fake plants from the stores."
    },
    {
      "title": "Remove the gravel.",
      "content": "Remove the gravel. If you have natural gravel at the bottom of your tank, remove all of this and bake it on a cookie sheet at 450 °F (232 °C) for one hour. Cool the gravel completely. Do not bake gravel if it is coated with any material, as this will melt. In this case, it is probably best to throw it away and start with fresh gravel."
    },
    {
      "title": "Make a bleach and water solution.",
      "content": "Make a bleach and water solution. Use 1 part bleach to 9 parts fresh tap water and put it in a clean spray bottle. Use regular household bleach with no added detergents. Be careful to never add bleach when fish are in the tank, as this will kill fish. [8] X Research source Spray your bleach solution on the inside of the tank. Let it sit for 10-15 minutes."
    },
    {
      "title": "Rinse the tank multiple times.",
      "content": "Rinse the tank multiple times. You need to make sure that all of the bleach residue is rinsed out of the tank so it will not contaminate the water after you put the fish back in. Rinse several times, and then rinse it once more for good measure. Wipe the tank dry with a paper towel. [9] X Research source"
    },
    {
      "title": "Put any other tank items (filter, plastic plants, etc.",
      "content": "Put any other tank items (filter, plastic plants, etc. ) in the bleach solution in a bucket or bowl. Let them sit for 10 minutes, and then rinse them multiple times before putting them back in the tank."
    },
    {
      "title": "Feed bettas appropriate food.",
      "content": "Feed bettas appropriate food. Purchase pellets that are made from fishmeal or shrimp meal. [10] X Research source [11] X Research source"
    },
    {
      "title": "Do not overfeed your betta.",
      "content": "Do not overfeed your betta. A betta’s stomach is about the size of its eyeball, so feed it about that amount twice per day. That translates to approximately 2 or 3 pellets per feeding. Let pellets soak in water 10 minutes before feeding. This will prevent them from swelling up inside your fish’s stomach. [12] X Research source If your fish has a rounded belly, you may be feeding it too much. If its belly looks a little caved in, then you might not be feeding it enough."
    },
    {
      "title": "Clean leftover food out of the tank.",
      "content": "Clean leftover food out of the tank. Uneaten food becomes toxic in the water, contributing to the growth of bacteria and ammonia levels. Bacteria in the tank will in turn start attacking your fish."
    },
    {
      "title": "Make your fish fast once a week.",
      "content": "Make your fish fast once a week. If your fish seems to have trouble digesting food or seems constipated, you can give it a rest by not feeding it once a week. This will not harm the fish and will allow the fish to work through some of the food already in its system. [13] X Research source"
    },
    {
      "title": "Isolate your fish.",
      "content": "Isolate your fish. If your fish has a contagious condition, it will need to be removed from the tank so that any illness does not infect other fish. Prepare a holding tank for your fish by putting fresh, conditioned water into the tank. Remove your fish from the original tank and put it in the new tank. If your fish is experiencing stress because of a new fish or environmental change in its tank, you might find that it feels better after being isolated."
    },
    {
      "title": "Disinfect after handling your fish.",
      "content": "Disinfect after handling your fish. Many disorders that fish have can be highly contagious. Anything that touched the fish or the water, including your hands, the fishnet, a spoon, etc., will need to be disinfected before it should come in contact with another fish. Use antibacterial soap to wash your hands. Disinfect any other item that has come in contact with the fish or the water in the tank using a bleach solution of 1 part bleach and 9 parts water. Soak items for 10 minutes in the bleach solution and rinse very thoroughly. Rinse again for good measure. Never add bleach to the fish tank when fish are in it, as this can kill fish."
    },
    {
      "title": "Administer medication to your fish.",
      "content": "Administer medication to your fish. Once you have positively identified your fish’s ailment, you can administer a common fish medication to your fish. [14] X Research source Give the medication intended for the ailment, and follow the manufacturer’s instructions. Be sure to give your fish the entire course of medication as recommended by the medicine’s manufacturer. Use good judgment when giving medications to your fish. Don’t try out several medications guessing at the right one. If you are unsure, you might consider consulting an aquatic veterinarian."
    },
    {
      "title": "Keep a first aid kit.",
      "content": "Keep a first aid kit. Pet stores often will not carry Betta fish medication, meaning that you will need to order it online. If you do this after your Betta fish gets sick it will likely be too late. Complete first aid kits are available online. However, you can try to save money by ordering the necessary supplies separately. Basic medications include: Bettazing or Bettamax, Kanamycin, Tetracycline, Amplicillin, Jungle Fungus Eliminator, Maracin 1, and Maracyn 2. [15] X Research source"
    },
    {
      "title": "Prevent illness.",
      "content": "Prevent illness. Most Betta fish ailments are caused by improper feeding and cleaning. These will be examined in greater detail later. However, a few things to always keep in mind include: Clean the tank regularly. To keep it clean, do not overcrowd with too many fish, add aquarium salt to water, and disinfect the tank. To limit the spread of disease from one fish to another, immediately remove dead fish, quarantine new fish for two weeks before introducing them to a tank, and wash your hands after handling fish. [16] X Research source Do not overfeed fish or allow food to rot in the tank."
    },
    {
      "title": "Know how to recognize the first signs of illness.",
      "content": "Know how to recognize the first signs of illness. The most obvious way to tell that a Betta fish is sick is to observe whether or not it wants to eat. If it is not eating or appears unexcited at the sight of food, it is likely sick. Other signs of illness include a less vibrant color or strange discolorations. [17] X Research source Others signs that your betta fish is sick include: rubbing against items in the tank as if to scratch itself; swollen, protruded eyes; raised scales that protrude out toward you; lethargy; and a fin that is clumped together rather than spread out. [18] X Research source"
    },
    {
      "title": "Begin with water and food.",
      "content": "Begin with water and food. Most fish illnesses can be addressed by thoroughly cleaning and disinfecting the tank. With all of these conditions, try this approach first, and then move on to medications if you don’t see improvement. Keep track of the symptoms in case you need to consult an aquatic veterinarian to treat your fish. Immediately remove a sick fish from a tank."
    },
    {
      "title": "Treat a fungal infection.",
      "content": "Treat a fungal infection. A fish that has a fungal infection will be paler than usual, will not be active, and will have clumped together fins. Most noticeable will be the white, cotton-like patches on its body. Eliminate a fungal infection by cleaning the tank and treating fresh water with fungus eliminator. Repeat every three days until visible signs of fungus have disappeared. Treat the water with BettaZing or Bettamax to dissolve any remnants of the fungus. Fungal infections are typically the result of a tank that has not been properly treated with salt and Aquarisol. Fungal infections are highly infectious, so this disorder should be treated rapidly. Quarantine infected fish."
    },
    {
      "title": "Treat tail or fin rot.",
      "content": "Treat tail or fin rot. In this case, your Betta fish’s fins and/or tail will turn black or red along the edges, accompanied by white cotton-like growth. The fin will appear to be dissolving and getting shorter. You might see holes or tears in the fin. [19] X Research source Clean the tank once every three days. Add either Ampicillin or Tetracycline into the water to treat it. Repeat until your fish’s fin ceases to show signs that it is still losing tissue. Put some fungus eliminator in the water to facilitate recovery. The tail will repair itself over time, but might not obtain its original luster. [20] X Research source If not treated, this condition can progress to the point where it begins to eat away at your fish’s body. Ultimately, it will be fatal."
    },
    {
      "title": "Treat swim bladder disorder.",
      "content": "Treat swim bladder disorder. If the belly of the fish is enlarged, the fish might have some blockage that needs to be corrected. You might notice an absence of excrement in the tank. The fish might have trouble swimming upright, swimming instead on its side or even upside down. This is a sign of overfeeding. The condition can easily be treated by reducing how much you feed your Betta fish."
    },
    {
      "title": "Treat ich.",
      "content": "Treat ich. Your fish will have white dots all over its body and will lack appetite. It will also try to scratch itself against items in the tank. It is highly contagious and is the most common cause for fish fatalities. [21] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source To treat ich, you should raise the temperature of the tank to somewhere between 78 and 80 degrees Fahrenheit over 48 hours. Add formalin or malachite green to the water. [22] X Trustworthy Source EDIS Electronic database of the University of Florida Institute of Food and Agricultural Sciences's peer-reviewed articles Go to source"
    },
    {
      "title": "Treat Velvet.",
      "content": "Treat Velvet. Fish with Velvet will hold their fins against their body, lose color, refuse to eat, and scratch against the gravel of the tank. It is treatable, but can be hard to spot. To verify that your fish has Velvet, shine a flashlight on it and check for a light gold or rusty film over its skin. Treat Velvet by cleaning the tank and treating the new water with BettaZing. Velvet should not occur if you have been treating your tank properly with salt and water conditioner. If your fish contract Velvet you should reconsider how you care for the tank."
    },
    {
      "title": "Treat pop-eye.",
      "content": "Treat pop-eye. If one of your fish’s eyes is budging out, then it has pop-eye. Unfortunately, pop-eye is not caused by a single condition. Sometimes it is treatable, but other times it is not. If several fish exhibit signs of pop-eye, the water condition is likely at fault. Test the water and replace 30% of the water daily for 4 to 5 days. If one of the fish has pop-eye, it might be a bacterial infection. Remove the fish to a separate tank and treat with Maracyn or Maracyn II until it shows signs of improvement. Occasionally pop-eye is the result of a serious, untreatable medical condition. If your fish does not respond to treatment it is possible that nothing can be done for it."
    },
    {
      "title": "Check for dropsy.",
      "content": "Check for dropsy. In cases of dropsy, your fish’s stomach will begin to swell. When it swells, it will cause the scales to project out like a pinecone. It is not a specific illness, but a sign that your fish can no longer regulate fluids. It will be fatal. If caught early, dropsy can be cured by aquarium salt baths and medicines. However, since it is hard to see what kind of medicine to use (the wrong one can make it worse), this is hard. Vets can help. If the betta is severely affected, euthanizing it is an option. Dropsy is not contagious, but it could be an indication that your water parameters are off. Check them and consider replacing your water."
    },
    {
      "title": "Consult an aquatic veterinary specialist.",
      "content": "Consult an aquatic veterinary specialist. An aquatic veterinarian is one that specializes in treating fish. They are not as common as vets who treat cats, dogs and other household pets."
    }
  ]
}