{
  "url": "https://www.wikihow.com/Set-Your-Trip-Preferences-in-Uber-Driver",
  "title": "How to Set Your Trip Preferences in Uber Driver",
  "steps": [
    {
      "title": "Open up your Uber Driver app.",
      "content": "Open up your Uber Driver app. The icon is maroon with a white hexagon icon on it, with a square design cut out in the middle."
    },
    {
      "title": "Open the Trip Planner from the map.",
      "content": "Open the Trip Planner from the map. Tap the list button with tiny checkmarks in the bottom right corner of the screen."
    },
    {
      "title": "Tap the \"Driving Preferences\" icon from the Trip planner.",
      "content": "Tap the \"Driving Preferences\" icon from the Trip planner. This button will look like two slider buttons in the bottom right corner of the menu."
    },
    {
      "title": "Become familiar with the trip options available to you.",
      "content": "Become familiar with the trip options available to you. Uber Driver Partners and Uber Delivery Partners alike have two types of trips (Deliveries and UberX) that may be available to you. If they're both available to you, you can tell Uber which kinds of trips you want to accept. You'll need to keep at least one trip type on. The options available to you may differ depending on your car, Uber City (for UberPOOL) and your different trip options. Look through the list. If you have only one type of ride you can fulfill, it'll generally be listed as on and will be the only one available. For those with more ride types available, they will be listed on the page. Your options may include UberX, UberXL, UberSUV, UberLUX, UberBLACK, UberPOOL, and Deliveries."
    },
    {
      "title": "Tap on whatever services you don't want to accept, to disable them.",
      "content": "Tap on whatever services you don't want to accept, to disable them. If you only have one type of trip you drive for on Uber, this is not possible, as one service must be turned on at all times. If you inadvertently turned off too many request types, you'll see a \"Reset\" button in the top right corner that you can tap to start over."
    },
    {
      "title": "Save your settings by tapping \"Save\" near the bottom right corner of the screen.",
      "content": "Save your settings by tapping \"Save\" near the bottom right corner of the screen. Before you save your work, you can press the \"Reset\" button in the bottom left to re-enable all trip types."
    }
  ]
}