{
  "url": "https://www.wikihow.com/Balance-a-Centrifuge",
  "title": "How to Balance a Centrifuge",
  "steps": [
    {
      "title": "Make sure the centrifuge is on a level, stable surface.",
      "content": "Make sure the centrifuge is on a level, stable surface. Most centrifuges are about the size of a toaster oven and sit on a counter, tabletop, or other laboratory surface. Before you worry about adding your samples into the centrifuge, confirm that the surface the centrifuge sits on is completely level. A slanted surface will skew results or send the equipment falling to the floor. [1] X Research source If you have a carpenter’s level handy, you can confirm that the surface is completely level. Set the level on the tabletop or counter, and make sure that the horizontal bubble is completely centered in its glass tube. If you’re using a very large centrifuge that rests directly on the floor of your lab, you can skip this step."
    },
    {
      "title": "Select the correct size of tubes for your centrifuge.",
      "content": "Select the correct size of tubes for your centrifuge. Different size centrifuges will take different sizes of tubes. In general, larger centrifuges take larger microtubes. Putting the wrong size tube in a centrifuge could result in a messy spill, or could damage the centrifuge or the tube with your sample. [2] X Research source If you’re confused about which size tube to use with which size centrifuge, consult a more experienced laboratory technician. Or, consult the manual for the centrifuge you’re using. Most tabletop mini centrifuges take a 1.5 mL microtube or a 0.5 mL tube."
    },
    {
      "title": "Fill all of your microtubes evenly.",
      "content": "Fill all of your microtubes evenly. Use a pipette to pour the exact same amount of liquid into each of the microtubes that you’ll be inserting into the centrifuge. [3] X Research source For example, if you fill the first microtube with 10 mL of solution, make sure that all of the other microtubes you plan to use for the experiment are filled with 10 mL of solution. A microtube filled with 9 or 11 mL could unbalance the centrifuge."
    },
    {
      "title": "Fill all of your balance tubes to the same level.",
      "content": "Fill all of your balance tubes to the same level. As their name suggests, balance tubes are inserted into the centrifuge to provide enough weight to balance out the other microtubes. Use a laboratory dropper to fill the balance tubes with liquid, so that all microtubes weigh the same amount. [4] X Research source Or, if your microtubes have marks on the side indicating the amount of liquid in the tube, make sure that all tubes are filled to the same level. [5] X Research source Balance tubes are commonly filled with water. However, if the solution you’re using in the experiment has a density much higher or lower than that of water, use a liquid with a similar density in the balance tubes."
    },
    {
      "title": "Insert a balance tube opposite each microtube in the centrifuge.",
      "content": "Insert a balance tube opposite each microtube in the centrifuge. The central rotor of your centrifuge will have an even number of holes spaced around its perimeter. Choose a hole and firmly insert a filled microtube. Then, insert a balance tube into the hole exactly opposite the hole containing your solution-filled microtube. Adding microtubes 2 at a time will ensure that you’re adding an even amount of weight to either side of the centrifuge. [6] X Research source By adding 1 equally weighted tube on either side of the centrifuge, you’ll keep the center of gravity exactly in the middle of the centrifuge rotor."
    },
    {
      "title": "Rotate the centrifuge rotor 90° and add 2 more microtubes.",
      "content": "Rotate the centrifuge rotor 90° and add 2 more microtubes. Insert these new microtubes halfway in between the 2 microtubes you’ve already added. So, if you added the first 2 microtubes at 12 o’clock and 6 o’clock, add 2 new microtubes at 3 o’clock and 9 o’clock. [7] X Research source Create a system so that you know which tubes are microtubes and which are balance tubes (if the liquids are the same color). You could put a small sticker on top of the sample-filled microtubes, or use a blue marker to color a small dot on top of the balance tubes."
    },
    {
      "title": "Continue adding equidistant microtubes and balance tubes opposite one another.",
      "content": "Continue adding equidistant microtubes and balance tubes opposite one another. You can add as many microtubes as the centrifuge has holes using this system. [8] X Research source Continuing the example, after you’ve added microtubes at 3 o’clock and 9 o’clock, you could add 2 more at 2 o’clock and 8 o’clock and another pair at 11 o’clock and 5 o’clock. If you have an odd number of microtubes, you’ll need to balance the centrifuge using an alternate configuration."
    },
    {
      "title": "Balance 3 microtubes by placing tubes at even intervals.",
      "content": "Balance 3 microtubes by placing tubes at even intervals. If you have 3 microtubes, you could create 3 balance tubes and situate the 3 pairs across from one another. Alternately, balance the centrifuge without using balance tubes by positioning the 3 microtubes at 2 o’clock, 6 o’clock, and 10 o’clock. [9] X Research source The clock positions work well when balancing a 12-hole centrifuge. Other common sizes include centrifuges with 24 and 30 holes."
    },
    {
      "title": "Position 5 microtubes with 1 balance tube.",
      "content": "Position 5 microtubes with 1 balance tube. To balance the centrifuge using 5 microtubes, first fill 1 balance tube with water. Then position 3 tubes at 11, 12, and 1 o’clock. Position the other 3 tubes at 5, 6, and 7 o’clock. The balance tube can be located in any of these positions. [10] X Research source Balance the centrifuge with 6 microtubes using the same configuration, but swap out the balance tube for a sample-filled microtube."
    },
    {
      "title": "Situate 7 microtubes and 1 balance tube in the centrifuge.",
      "content": "Situate 7 microtubes and 1 balance tube in the centrifuge. Place 2 sets of 4 microtubes in a way that the sets will counterbalance one another and center the weight in the centrifuge. Place 4 microtubes (including the balance tube) at 11, 12, 1, and 2 o’clock. Then place 4 more microtubes at 5, 6, 7, and 8 o’clock. [11] X Research source You can balance a centrifuge using 8 microtubes in the same configuration. Just replace one of the microtubes with a sample-filled tube."
    }
  ]
}