{
  "url": "https://www.wikihow.com/Install-a-Medicine-Cabinet",
  "title": "How to Install a Medicine Cabinet",
  "steps": [
    {
      "title": "Scan the wall with a stud finder.",
      "content": "Scan the wall with a stud finder. Use a stud finder to locate your wall’s studs, and mark the locations of the studs with a pencil. Bathroom walls can conceal pipes and electrical wires, so you should use caution if your stud finder identifies any other objects behind the drywall. Drilling through pipes or wires can result in expensive damage. [1] X Research source If you are concerned about possible pipes or electrical wires, consult with a professional before you drill or cut into the wall."
    },
    {
      "title": "Hold the cabinet in place and make sure it’s level.",
      "content": "Hold the cabinet in place and make sure it’s level. Position the cabinet at a height accessible to your household members. Usually 72 inches from the floor is a good place to start, then adjust the height according to your needs. Place a level at the top of the cabinet to make sure it’s straight. Use a pencil to trace the top and bottom outlines of the cabinet. [2] X Research source Having a helper to hold the cabinet in place for you will make the job easier. Try to line up the cabinet with studs for the best support. If you can’t line the cabinet up with the wall studs, you’ll need to use plastic anchors when you drill pilot holes."
    },
    {
      "title": "Open the cabinet door and mark the installation holes.",
      "content": "Open the cabinet door and mark the installation holes. With the cabinet still held in place, open the door and make sure it’s free of any obstructions. Locate the installation holes at the rear of the cabinet. Use your pencil to mark the holes on the supporting wall. [3] X Research source"
    },
    {
      "title": "Drill the pilot holes.",
      "content": "Drill the pilot holes. Set aside the cabinet in a safe place. Drill pilot holes into the pencil marks you made on the wall that line up with the cabinet’s installation holes. [4] X Research source If weren’t able to line the installation holes up with the wall studs, insert plastic anchors into your pilot holes."
    },
    {
      "title": "Fasten the screws to secure the cabinet.",
      "content": "Fasten the screws to secure the cabinet. Position the cabinet back on the wall so the installation holes are lined up with the pilot holes. Drive screws into each hole to secure the cabinet to the wall. [5] X Research source Some cabinets come with washers or plastic bits to conceal the screws once they’re fastened. Check your cabinet’s installation guide for specific information about these or any other included hardware."
    },
    {
      "title": "Locate the wall studs.",
      "content": "Locate the wall studs. Use your stud finder to locate the wall studs. Mark their locations with a pencil. Scan the wall to check for load-bearing framework, pipes, or electrical wires. If you locate an obvious obstruction, consult a professional before cutting or drilling into your wall. [6] X Research source If you do find wires, usually it is pretty easy to move or reroute them, just make sure you turn the breaker off before touching them. If you have the blueprints to your house, check to see if they include any information about what’s behind your wall. If you do identify a large vent, pipe, or load-bearing framework, your best solution will be to install a surface-mounted cabinet. [7] X Research source"
    },
    {
      "title": "Hold the cabinet in place and trace its outline.",
      "content": "Hold the cabinet in place and trace its outline. Hold the cabinet in its intended position and use a level to make sure it’s straight. Use a pencil to trace its complete outline. When you’re finished tracing, set the cabinet aside in a safe place. [8] X Research source"
    },
    {
      "title": "Measure your cabinet width and stud distance.",
      "content": "Measure your cabinet width and stud distance. Most wall framing sets studs at a distance of 16 inches (about 41 cm). However, many medicine cabinets are 18 inches (about 46 cm). If your cabinet is larger than the stud distance, you’ll have to notch, or cut away, part of the studs when you create the recess and supporting frame for your cabinet. [9] X Research source If you purchase a cabinet with a width less than 16 inches, you’ll most likely be able to install it without notching the studs."
    },
    {
      "title": "Cut an inspection hole.",
      "content": "Cut an inspection hole. Drive a drywall screw into the wall in the middle of the outlined area. Don’t drive the screw entirely into the wall, but leave enough of its length to use as a tab to pull out your inspection hole. Use a keyhole or drywall saw to cut a circular hole with a diameter of about 6 inches (15 cm) around the screw, then use the screw to pull out the cut section. [10] X Research source Use a flashlight to look into hole and inspect the area where you want to cut your recess. If you see wires or pipes, call a plumber or electrician to have the obstructions rerouted. [11] X Research source"
    },
    {
      "title": "Cut out a hole along the outline of the cabinet.",
      "content": "Cut out a hole along the outline of the cabinet. If there are no obstructing wires or pipes behind your wall, use a razor knife or a hole saw to cut along the cabinet outline you traced. Take care to only saw through the wall where you’re installing the cabinet, and don’t cut so deep that you come through the wall in the next room. [12] X Research source Avoid using power tools to cut out the hole since they can easily damage the wall on the other side. Try to use careful, even strokes to avoid disfiguring the remaining drywall outside of the cabinet outline."
    },
    {
      "title": "Notch the studs if necessary.",
      "content": "Notch the studs if necessary. If your cabinet is wider than your stud distance, take a hacksaw and slide it behind the obstructing stud to cut any screws holding the next room’s wallboard to its back edge. Use a handsaw to cut through the stud flush with the top and bottom of the drywall opening. [13] X Research source After removing the section of stud that's in the way, place the cabinet into the recess to check its fit. Make sure its door opens without obstruction. Use a utility knife and coarse file to fix any tight spots, like bits of protruding drywall or wall stud."
    },
    {
      "title": "Cut two-by-four boards to create a frame for the cabinet.",
      "content": "Cut two-by-four boards to create a frame for the cabinet. If you’ve notched a stud, cut a pair of two-by-four boards so they will fit flush between the cut stud and the next intact studs on either side. If your studs are intact, cut a board so that it will fit snugly between the studs. Either way, your two-by-fours will need to be flush with the drywall opening to create a secure, well-fitting frame for the cabinet. [14] X Research source If you’ve notched a stud, cut a pair of boards for the bottom of the drywall opening and another pair to frame the top. Cut another pair of boards to fit vertically on both sides of the drywall opening. If your studs are intact and your cabinet outline is square with them, just cut two boards to fit between the studs at the bottom and top."
    },
    {
      "title": "Install the frame.",
      "content": "Install the frame. After cutting two-by-fours to the appropriate sizes, grab a bottom board, apply construction adhesive its ends, and place it between the wall studs. Make sure the board is flush with the drywall opening. Hold the board in place and drive screws through the drywall just below the opening to secure the board. [15] X Research source Repeat the sequence to attach the other boards."
    },
    {
      "title": "Patch the screw heads.",
      "content": "Patch the screw heads. You’ll likely find the 4 to 6 drywall screws that outline the opening and hold the frame in place unsightly. You can cover the screw heads with joint compound, let it dry, then sand it smooth with a fine grit sandpaper. Then prime and paint the area to make your work invisible. [16] X Research source You'll need to patch the screw heads before installing the medicine cabinet. Once it's mounted, the cabinet might make the area harder to patch, prime, and paint."
    },
    {
      "title": "Replace insulation if you’ve cut into an exterior wall.",
      "content": "Replace insulation if you’ve cut into an exterior wall. If you cut the recess into an exterior wall, you likely encountered insulation. If you removed any insulation while you were installing the frame, put it back into place. Depending on your cabinet’s depth, you might need to replace thick insulation with a more compact product. [17] X Research source Visit your local home improvement store and ask a sale representative for help choosing a product such as vacuum insulated panels. [18] X Research source"
    },
    {
      "title": "Mark the cabinet installation holes and drill pilot holes.",
      "content": "Mark the cabinet installation holes and drill pilot holes. Place the cabinet into the recess, open the door, and locate the installation holes on the sides. Use a pencil to mark the holes’ locations on the frame. Set the cabinet aside, then drill pilot holes into the frame at the spots you marked in pencil. [19] X Research source"
    },
    {
      "title": "Place the cabinet in the hole and screw it into place.",
      "content": "Place the cabinet in the hole and screw it into place. Put the cabinet back into the recess. Drive screws through the installation holes and into the frame to secure the cabinet. To finish the job apply a bead of caulk where the medicine cabinet meets the wall. This will give a professional appearance as well as sealing out drafts and insects. [20] X Research source Your cabinet might have come with plastic washers or covers to fit over the installation holes. Check its installation guide if you have these or any additional hardware."
    }
  ]
}