{
  "url": "https://www.wikihow.com/Make-a-Reservation",
  "title": "How to Make a Reservation",
  "steps": [
    {
      "title": "Call as far ahead of time as possible.",
      "content": "Call as far ahead of time as possible. In many cases, you will be able to make a dinner reservation early in the same day. However, if you are planning the dinner ahead of time, call earlier. This is especially important if you have a large group or have special requirements such as dietary needs. Most restaurants will accept reservations a few days in advance, and exclusive fine dining venues will often accept (or even require) reservations weeks or months in advance. If you make your reservations more than a few days in advance, it is best to call the day of the dinner to quickly confirm your reservation."
    },
    {
      "title": "Schedule an early or late dinner if availability is limited.",
      "content": "Schedule an early or late dinner if availability is limited. A helpful way to get a reservation at a heavily booked restaurant is to avoid the dinner \"prime time\" - usually around 7:30 pm. Remain open to booking a reservation at 5:00 pm or even 10:00 pm (depending on the restaurant's hours). This will increase your chances of getting a table the same day or earlier in the week than you expected."
    },
    {
      "title": "Be as courteous as possible when booking a reservation.",
      "content": "Be as courteous as possible when booking a reservation. If you are attempting to book a tough reservation, remember that your attitude on the phone will go a long way. Be confident but polite; avoid giving the impression that you feel entitled to a reservation. Remember, however, that even Michelin-stared restaurants are not in the business of turning away customers. If the host replies that the restaurant has no availability, explain your situation and ask politely if there is any way you can be accommodated in the future."
    },
    {
      "title": "Visit the restaurant in person.",
      "content": "Visit the restaurant in person. A further strategy for booking a tough reservation is asking for availability in person rather than over the phone. This shows that you are willing to put a bit of effort into securing a table. A host is also much less likely to be dismissive or unhelpful when dealing with you face-to-face."
    },
    {
      "title": "Call ahead or cancel if you are running late.",
      "content": "Call ahead or cancel if you are running late. Once you've secured your reservation, call ahead and apologize if it looks like you'll be up to 20 minutes late. If you are running much later than that, consider canceling and rescheduling your dinner. Remember that reservations are made for a reason - to make sure as many guests as possible are served on each night. If you are late it affects other guests' reservations."
    },
    {
      "title": "Book a reservation online if possible.",
      "content": "Book a reservation online if possible. Some restaurants allow you to book online using websites like OpenTable, Reservation Genie, or through their own proprietary system. Not only do these websites offer the convenience of seeing which time slots are still available for dining, but many of them offer coupons or membership rewards programs through which you can accumulate perks by using the service. A similar way to accumulate perks like discounts or reservations at exclusive restaurants is through your credit card company. Credit card companies often include restaurant discounts in their rewards programs as a means to attract customers, and some high-profile cards even offer exclusive access to heavily booked restaurants. If you book your reservation online, you may still want to call ahead and confirm before arriving."
    },
    {
      "title": "Check the rates offered by the hotel.",
      "content": "Check the rates offered by the hotel. You'll get the best rates by booking a hotel reservation as far in advance of the departure date as possible or getting a last-minute deal from a website that specializes in such deals. Be aware that hotels tend to raise rates as availability declines; however, it is possible to get a last minute deal."
    },
    {
      "title": "Use an online travel site to identify hotels in the city you are visiting or near a specific attraction, address or airport.",
      "content": "Use an online travel site to identify hotels in the city you are visiting or near a specific attraction, address or airport. Sites that book hotels, flights, rental cars, vacation packages and more include Orbitz.com, Expedia.com and Travelocity.com. These sites have features that make it easy to adjust dates and see how it affects hotel rates. Hotels.com (an Expedia company) and HotelDiscounts.com specialize in lodgings but also book vacation packages. Sidestep.com is a search engine for other travel sites and makes it easy to compare hotel reservations and other rates. If you aren't picky about arrival and departure dates or location, you might consider Priceline.com. However, you won't know which hotel you are staying in until you book it."
    },
    {
      "title": "Determine whether you need a standard room, one-bedroom, two-bedroom or something larger.",
      "content": "Determine whether you need a standard room, one-bedroom, two-bedroom or something larger."
    },
    {
      "title": "Identify what amenities you need.",
      "content": "Identify what amenities you need. In-room conveniences to consider include high-speed Internet, a refrigerator, a kitchen or kitchenette, and a pull-out sleeper sofa. Some hotels will bring a crib or cot into the room if you need it. Hotel amenities might include an indoor or outdoor pool, fitness center, business center, restaurants and room service."
    },
    {
      "title": "Enter your arrival and departure dates as well as how many adults and children will be staying in the room.",
      "content": "Enter your arrival and departure dates as well as how many adults and children will be staying in the room."
    },
    {
      "title": "Narrow down the list to one or two hotels with the amenities you need and the best rates, and then go to those hotel websites to check rates there.",
      "content": "Narrow down the list to one or two hotels with the amenities you need and the best rates, and then go to those hotel websites to check rates there. Compare rates with discounts (e.g., for seniors, AAA members, frequent flyer members) and taxes applied. If you are bringing pets, verify that pets are allowed and whether an additional fee is charged. Take into account whether a free breakfast is included, or a happy hour offers free drinks and/or food."
    },
    {
      "title": "Look at the photos and virtual tours available online to get a feel for what the hotel and its rooms look like.",
      "content": "Look at the photos and virtual tours available online to get a feel for what the hotel and its rooms look like. You may need to call the hotel to get specific information, such as the year built/remodeled, check-in/check-out times and cancellation policy."
    },
    {
      "title": "Book the hotel room online or by phone.",
      "content": "Book the hotel room online or by phone. You will need to give a credit card number, but the card will not be charged unless you don't cancel according to the cancellation policy."
    },
    {
      "title": "Print or write down your confirmation number and bring it with you on the trip.",
      "content": "Print or write down your confirmation number and bring it with you on the trip."
    },
    {
      "title": "Determine your travel dates.",
      "content": "Determine your travel dates. Often, advance booking will ensure that you will get to choose from a variety of routes and the most affordable fares."
    },
    {
      "title": "Check fares early.",
      "content": "Check fares early. Even if you only have a general idea of when the air travel will take place it is a good idea to start shopping around. If you plan on flying during a major break period such as Christmas or New Year, the proximity of your travel date to the hectic, heavy traffic days can affect your chances of being bumped, missing a flight or just having an unpleasant travel experience. Book early!"
    },
    {
      "title": "Check reliable travel websites.",
      "content": "Check reliable travel websites. Most travel sites operate in a similar manner. They will prompt you to enter a destination and a specific date of travel. A list will be generated showing results across a number of different airlines. The results can usually be organized by price. Price may be affected by a number of variables including the number of stops made, the destination or departure airport and the proximity to the date of travel."
    },
    {
      "title": "Contact an airline directly as an alternative option.",
      "content": "Contact an airline directly as an alternative option. If you have an airline that you prefer you can book tickets online in much the same manner as on any of these travel websites. The disadvantage of this method is that you won't be able to compare prices or routes across different airlines."
    },
    {
      "title": "Have some form of credit card.",
      "content": "Have some form of credit card. The booking itself will require a valid credit card and you will be prompted to enter the credit card number and expiration date in the payment section. You will also be asked for pertinent personal information such as a full name, address and possibly, a passport number for international travel. Make sure you remember to bring the credit card used to pay for your reservation to the airport with you! You may be asked to produce the credit card if the reservation is irretrievable or to prove identity."
    },
    {
      "title": "Ask for confirmation of the booking.",
      "content": "Ask for confirmation of the booking. You will most likely be asked if you'd like an e-mail confirmation to be sent to you. Choose to generate this e-mail confirmation because it will come in handy should you need to reference the details of your reservation. In addition, an e-mail confirmation can be printed and used at airport self-service kiosks for check-in. This step will save you the time and irritation of standing in long queues."
    }
  ]
}