{
  "url": "https://www.wikihow.com/Put-on-Suspenders",
  "title": "How to Put on and Wear Suspenders Like a Pro",
  "steps": [
    {
      "title": "Fasten the suspenders to the back of your trousers.",
      "content": "Fasten the suspenders to the back of your trousers. Before you put on your trousers, secure the suspenders in place. Line up the suspenders with the center of your trousers. Clip or button them to the fabric, never the belt loops. [1] X Research source Fasten X-back suspenders halfway between your spine and your sides. Y-back suspenders fasten in the center of your waistband above the 2 innermost belt loops."
    },
    {
      "title": "Pull up your trousers.",
      "content": "Pull up your trousers. Bring them up as high as possible since you won’t be wearing a belt. Secure any buttons or zippers to help hold your pants in place. High-waisted pants work best with suspenders and offer the most support for your stomach. [2] X Research source"
    },
    {
      "title": "Skip putting on a belt.",
      "content": "Skip putting on a belt. Suspenders make wearing a belt unnecessary. In addition, wearing a belt with suspenders is considered a fashion faux pas, so pick one or the other to wear when you dress in the morning. [3] X Research source"
    },
    {
      "title": "Raise the suspenders over your back.",
      "content": "Raise the suspenders over your back. Lift the suspender straps over your shoulders. X-back suspenders will crisscross over your back. Y-back suspenders will come up from your waistband to your center before splitting off into the 2 straps. Make sure the straps feel flat, comfortable, and centered against your back. Having the suspenders too low causes them to slip off your shoulders. Adjust the straps as needed."
    },
    {
      "title": "Bring the suspenders straight down over your chest.",
      "content": "Bring the suspenders straight down over your chest. Regardless of the style, your suspenders should fall down in 2 straight, vertical lines. The front end will likely be spaced further apart than the back end. As long as the suspenders look even and feel comfortable, you’ve positioned them perfectly. [4] X Research source"
    },
    {
      "title": "Attach the suspenders to the front of your trousers.",
      "content": "Attach the suspenders to the front of your trousers. Finish attaching the suspenders by buttoning or clasping the straps the same way you did with the back ones. Clips fasten directly to your waistband, while button suspenders attach to pairs of buttons placed on the waistband."
    },
    {
      "title": "Slide the buckle on the suspenders to adjust them.",
      "content": "Slide the buckle on the suspenders to adjust them . Most suspenders are adjustable, so they’ll fit even if they’re not tailored to the exact size you need. Feel around for a buckle, which will either be where the straps cross on your back or at the bottom of the front straps. Slide the buckle to shorten or lengthen the straps to get the perfect fit! Suspenders labeled as elastic or one-size-fits-all are always adjustable. Suspenders that aren’t adjustable tend to be handcrafted, like leather ones."
    },
    {
      "title": "Color coordinate suspenders with the rest of your clothing.",
      "content": "Color coordinate suspenders with the rest of your clothing. Incorporate suspenders into your overall outfit to make them into a fashion statement. Match them with same-colored shoes, pants, or a jacket, depending on your preference. [5] X Expert Source Jordan Stolch Image Consultant & Style Advisor Expert Interview. 25 September 2020. [6] X Research source As style advisor Jordan Stolch emphasizes, when you wear suspenders, “you automatically show that you're in touch with style.” [7] X Expert Source Jordan Stolch Image Consultant & Style Advisor Expert Interview. 25 September 2020."
    },
    {
      "title": "Keep them under your jacket to stay classy in formal settings.",
      "content": "Keep them under your jacket to stay classy in formal settings. When wearing your suspenders for work or a special occasion, keep them neatly tucked away beneath a suit jacket or vest. Pair them with a button-down shirt, suit jacket, suit pants, and dress loafers. Suspenders used to be thought of as underwear inappropriate for public display. While that’s not commonly believed today, the rule still applies in formal settings."
    },
    {
      "title": "Wear suspenders over a collared shirt for a semi-professional look.",
      "content": "Wear suspenders over a collared shirt for a semi-professional look. Wear the suspenders over a dressy shirt, leaving the suit jacket off. [8] X Expert Source Jordan Stolch Image Consultant & Style Advisor Expert Interview. 25 September 2020. Striped or seersucker suspenders are most common, but other colors and prints can be used. This look can be worn in public without making you seem overdressed. Pair the suspenders with linen suit pants or khaki pants and black or brown dress loafers."
    },
    {
      "title": "Adopt a punk twist with skinny suspenders.",
      "content": "Adopt a punk twist with skinny suspenders. Put on colored suspenders with skinny straps to adopt a 1960s London style. Wear them with jeans and sneakers. This look has a punk or hipster appeal and can be worn every day in public. [9] X Research source Rugged, durable pants like jeans or corduroy trousers are better for this look since it is inspired by the working class. A tucked-in, button-down shirt is still the classic way to go, but make it a little slack by leaving the top buttons undone, rolling up the sleeves, or wearing flannel print or other colors. Keep your shoes fairly durable. Opt for sneakers or boots over loafers. Style advisor Jordan Stolch recommends pairing your suspenders with a sleek fedora to add even more edge to your look. [10] X Expert Source Jordan Stolch Image Consultant & Style Advisor Expert Interview. 25 September 2020."
    },
    {
      "title": "Wear leather for old-fashioned charm.",
      "content": "Wear leather for old-fashioned charm. Leather suspenders look unique and rustic. They match up well with tweed trousers, a button-down shirt, and old-fashioned accessories like a driving cap, a bowtie, or a trench coat. Dark jeans are another option for this look. Stick with leather loafers or leather dress boots to complete the look."
    },
    {
      "title": "Wear suspenders with dress pants for a semi-formal look.",
      "content": "Wear suspenders with dress pants for a semi-formal look. The most obvious way to incorporate suspenders into an outfit is to match them with dress trousers and a button-down shirt. A suit jacket is not necessary, but closed-toe dress heels or loafers are a good choice. Suspenders are not considered standard business attire for women, so this is a playful but professional look."
    },
    {
      "title": "Achieve a punk look with jeans and a t-shirt.",
      "content": "Achieve a punk look with jeans and a t-shirt. Slip on a t-shirt or tank top underneath the suspenders, then put on a ragged pair of jeans. This creates a very noticeable but customizable punk style perfect for casual settings in public. Stick to sneakers, loafers, or flats with this style. Jordan Stolch, a renowned style advisor and image strategist, advises against wearing t-shirts with bold or loud prints “because the suspenders are already a statement in and of themselves.” Instead, she recommends wearing “something simple underneath.” [11] X Expert Source Jordan Stolch Image Consultant & Style Advisor Expert Interview. 25 September 2020."
    },
    {
      "title": "Pair suspenders with shorts for a summer look.",
      "content": "Pair suspenders with shorts for a summer look. Attach the suspenders to high-waisted or nautical shorts. Slip on a comfortable t-shirt or tank top beneath the suspenders. Any casual, somewhat fitted tank top or t-shirt, such as a red-striped one, works well here. [12] X Research source This look is still casual but somewhat playful, so have fun with your footwear. A wedge heel, sandal, or embellished flat can accompany this look."
    },
    {
      "title": "Wear a skirt for a more feminine look.",
      "content": "Wear a skirt for a more feminine look. Put on a t-shirt but pair it with a skirt. Try to keep the outfit simple, colorful, and charming. Keep the clothing limited to a single pattern and 2 solid colors, then match it with flat sandals, kitten-heel sandals, or decorative flats. [13] X Research source"
    },
    {
      "title": "Accessorize suspenders with jewelry.",
      "content": "Accessorize suspenders with jewelry. Although suspenders are considered menswear, they don’t have to be. Spruce up any pair of suspenders with details you like, such as dangling earrings, delicate necklaces, cocktail rings, and bangle bracelets. Accessories create an appealing, fashion-forward contrast with the suspenders."
    },
    {
      "title": "Get suspenders that fit your body.",
      "content": "Get suspenders that fit your body. The best way to get fitting suspenders is to go to a store that sells them. Ask a store associate to try them on. Employees can usually help you put the suspenders on and get the perfect fit. Suspenders can be found at department stores or purchased online from suspender retailers. [14] X Research source Suspenders are based on height. Suspenders 42 in (110 cm) long fit adults between 5 to 5.75 ft (1.52 to 1.75 m) tall. Suspenders can be often be found as small as 36 in (91 cm) long and as large as 52 in (130 cm). For sizes outside this range, speak with online suspender retailers to create a custom order. The midrange suspender thickness is between 1.25 to 1.5 in (3.2 to 3.8 cm). Smaller suspenders may appear more fashionable, but larger sizes offer more support."
    },
    {
      "title": "Pick X-back suspenders for sturdiness.",
      "content": "Pick X-back suspenders for sturdiness. X-back suspenders form an x on your back. They offer more support because the straps are spread apart. This makes them ideal for physical work and casual settings. Most of these suspenders fasten with clips since most pants don’t have buttons on the sides. [15] X Research source You can always have a tailor sew buttons onto your pants so you don’t have to use clips on X-back suspenders."
    },
    {
      "title": "Choose Y-back suspenders for formal occasions.",
      "content": "Choose Y-back suspenders for formal occasions. Y-back suspenders form a y on your back, attaching to your pants through a single strap that runs down the center. This makes them a little weaker than X-back suspenders, so it’s important to get good quality. These suspenders are often seen at business or formal events. [16] X Research source"
    },
    {
      "title": "Use clip fasteners for pants without buttons.",
      "content": "Use clip fasteners for pants without buttons. Suspenders with clips fasten directly to your pants, so they’re always easy to wear and remove. Although they’re appropriate to wear at any occasion, many people think these suspenders are less professional and less classy. Avoid wearing them in very formal settings. [17] X Research source Clips can also damage your trouser fabric over time."
    },
    {
      "title": "Wear button-on suspenders for style.",
      "content": "Wear button-on suspenders for style. Button-on suspenders generally look better than clip-on suspenders. However, they need to be attached to buttons inside your pant’s waistband. Either use them with pants that have buttons or sew buttons onto your other pants . [18] X Research source Y-back suspenders require 2 buttons in the center of the backside of your waistband. X-backs need 4 buttons total, 2 each off to the side. Both types require 4 buttons on the front. When sewing on buttons , put the suspenders on to see where they fall on the inside of the waistband. Mark those spots and sew on the buttons there."
    }
  ]
}