{
  "url": "https://www.wikihow.com/Change-Cash-App-Password",
  "title": "3 Simple Ways to Change Your Cash App PIN or Password",
  "steps": [
    {
      "title": "Open the Cash App app.",
      "content": "Open the Cash App app. This looks like a white dollar sign with a green background. [1] X Research source Cash App is available for iOS in the App Store and for Android in the Google Play Store . If you aren't already logged in, enter your phone or email and tap Next to do so now. There is a bug with using the Cash PIN reset within the app. If you tap Forgot Cash PIN , you'll be constantly redirected to a support page. You must contact Cash App directly."
    },
    {
      "title": "Tap your profile icon in the top-right.",
      "content": "Tap your profile icon in the top-right. This will open the Your Account page."
    },
    {
      "title": "Tap Support.",
      "content": "Tap Support . This will be next to a question mark icon, above Privacy & Security ."
    },
    {
      "title": "Tap Start a Chat.",
      "content": "Tap Start a Chat . A new window will open with Cash App Support . You'll be a verified checkmark beside the name."
    },
    {
      "title": "Enter your request.",
      "content": "Enter your request. You can type: \"I want to reset a forgotten Cash PIN\". Tap the airplane icon or Send to send your message. Cash App's automated response may send you a link to reset your PIN. If this happens, change the wording to \"I forgot my Cash PIN\". You'll be redirected to a live person in the same chat window."
    },
    {
      "title": "Explain your request.",
      "content": "Explain your request. Cash App's support representative may ask you to verify your account by providing details such as your legal first and last name, all phone numbers and emails associated with your account, last 4 digits of your debit or credit card, and/or your zip code. Cash App's support representative will begin the process to change your Cash PIN. You may be asked to provide a new PIN."
    },
    {
      "title": "Open the Cash App app.",
      "content": "Open the Cash App app. This looks like a white dollar sign with a green background. If you aren't already logged in, enter your phone or email and tap Next to do so now. Use this method if you know your current Cash PIN and want to change it."
    },
    {
      "title": "Tap your profile icon in the top-right.",
      "content": "Tap your profile icon in the top-right. This will open the Your Account page."
    },
    {
      "title": "Tap Privacy & Security.",
      "content": "Tap Privacy & Security . This will be next to a shield icon with a checkmark. You may need to scroll down to find it."
    },
    {
      "title": "Tap Change Cash PIN.",
      "content": "Tap Change Cash PIN . This will be underneath the Security header. If you do not have Security Lock toggled on, you will not see this option."
    },
    {
      "title": "Enter your old Cash PIN.",
      "content": "Enter your old Cash PIN. This is the 4-digit number used to transfer funds."
    },
    {
      "title": "Enter a new Cash PIN.",
      "content": "Enter a new Cash PIN. You can use any combination of four numbers."
    },
    {
      "title": "Confirm your Cash PIN.",
      "content": "Confirm your Cash PIN. Enter the new Cash PIN again. A green check mark will appear. Your new Cash PIN is now active."
    },
    {
      "title": "Open the Cash App app.",
      "content": "Open the Cash App app. This looks like a white dollar sign with a green background. [2] X Research source If you used your email or phone number to log in and out, you'll be sent a log in code. Use this method if you want to login to Cash App with a new email or phone number. If you can't access your email, you'll need to reset your email password . If you don't have access to the phone number associated with your Cash App account, you'll need to contact Cash App ."
    },
    {
      "title": "Tap your profile icon in the top-right.",
      "content": "Tap your profile icon in the top-right. This will open the Your Account page."
    },
    {
      "title": "Tap Personal.",
      "content": "Tap Personal . This is next to a person icon."
    },
    {
      "title": "Tap Add Phone or Email.",
      "content": "Tap Add Phone or Email . You can find this underneath your current login method. A pop-up menu will open."
    },
    {
      "title": "Tap Add Mobile Number or Add Email Address.",
      "content": "Tap Add Mobile Number or Add Email Address . Be sure to use a valid number or email."
    },
    {
      "title": "Enter your mobile number or email address and tap Next.",
      "content": "Enter your mobile number or email address and tap Next . Snapchat will send you a confirmation code. If you entered a mobile number, you'll receive an SMS text message. If you entered an email address, you'll receive an email."
    },
    {
      "title": "Enter the confirmation code and tap Next.",
      "content": "Enter the confirmation code and tap Next . The code will be in 000 – 000 format. You'll see a green checkmark. You can now use this new mobile number or email to sign into your account and use Cash App To remove a number or email, tap the selection, then tap Remove ."
    }
  ]
}