{
  "url": "https://www.wikihow.com/Clean-Poodle-Ears",
  "title": "How to Clean Poodle Ears",
  "steps": [
    {
      "title": "Special ear cleaning solutions contain antibacterial properties.",
      "content": "Special ear cleaning solutions contain antibacterial properties. These cleaners will help keep your poodle’s ears healthy and pristine. Buy an ear cleaner at your local pet store or online. Find a variety of safe and high-quality ear cleaners for your poodle here . [1] X Research source There are pre-loaded wipes you can use instead of cotton balls. They’re more expensive than just soaking some cheap cotton balls, but they are convenient! Don’t use water or DIY solutions to clean a poodle’s ears. When the inside of a dog’s ears get wet, they become a breeding ground for yeast and other bacteria."
    },
    {
      "title": "Squeeze out the excess cleaner to avoid drenching the ear.",
      "content": "Squeeze out the excess cleaner to avoid drenching the ear. You don’t need a dripping-wet cotton ball, but the entire ball should be thoroughly damp. Pour the cleaner into the cotton ball and give it a pinch or two to wring it out. Alternatively, you may use sterile gauze if you don’t have any cotton balls. [2] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Don’t use cotton swabs. The tip can break off in your dog’s ear if your furry friend shakes their head. The other problem with cotton swabs is that they can accidentally push wax and debris deeper into the ear canal. The cotton ball is too big to go that deep. Some ear cleaners are designed to be applied directly to your dog’s ear canal. While you can certainly use these, it’s usually best to check with a vet first. You normally don’t want to pour things inside of your dog’s ear canal if you don’t have to. [3] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Get your pup to lie down and flip their ears up and out.",
      "content": "Get your pup to lie down and flip their ears up and out. If this is your first time doing this, give your poodle a ton of treats to placate them. Get them into a lie down position and pick an ear to start with. Gently flip your poodle’s ear over so the tip rests on top of their head. [4] X Research source Complete the entire cleaning process for one ear at a time, but repeat this process for each ear. If your dog is a little resistant, take them on a long walk and play some fetch or tug-of-war so that they tucker out a bit."
    },
    {
      "title": "Gently work the cotton ball around the lower portion of the ear.",
      "content": "Gently work the cotton ball around the lower portion of the ear. Find the opening for the ear canal, which is the opening inside of their ear. Clean everything you can see around that opening without going inside of the ear canal. Gently wipe using soft, circular motions. Continue doing this until you’ve removed all of the ear wax and dirt that you can see around the base. [5] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Your dog is likely going to be confused, but most dogs kind of enjoy this process once they get used to it. You know that feeling when you haven’t cleaned your ears in a while and then you use a cotton swab? It’s nice, right!"
    },
    {
      "title": "Replace your cotton ball if it’s loaded up with debris.",
      "content": "Replace your cotton ball if it’s loaded up with debris. Once the base of the ear is clean, check the rest of the ear for dirt and ear wax. If you see anything, use your cotton ball to wipe it away. You can ignore any areas where the skin looks healthy and clean. Pay special attention to the base of any tufts of hair inside of the ear. Unlike other breeds, poodles tend to grow a lot of hair on the inside of their ears. It’s easy for stuff to get trapped in this hair. If the upper portion of their ears are gunk-free, don’t worry about wiping them."
    },
    {
      "title": "This is your dog’s way of shaking any fluid or loose ear wax out.",
      "content": "This is your dog’s way of shaking any fluid or loose ear wax out. Once they’re done shaking their head, give their ears another look. If your pup successfully knocked some gunk loose, use your cleaning solution and a fresh cotton ball to wipe it away. [6] X Research source Your dog may roll around a little or shake their head a few times once you’re done. Don’t worry about this—so long as they act normally after a few minutes, they’re fine."
    },
    {
      "title": "A quick drying will help your pup’s ears stay moisture-free.",
      "content": "A quick drying will help your pup’s ears stay moisture-free. Even if your dog’s ears aren’t especially damp, give them a gentle wipe with a soft, dry towel to be sure. You don’t need to shove the towel down especially deep; simply wipe the surface of their skin. If there are any visible fur tufts inside of the ear, wipe them in the same direction instead of moving the towel back and forth to avoid tangles. This is especially important with a poodle. Their coats are beautiful and soft, but the hair on top of their ears can weigh the ears down. This makes it hard for air to enter the ear canal, so moisture of any kind can be a risk since excess ear moisture can breed bacteria."
    },
    {
      "title": "If your dog’s ears are filled with wax, ask your vet about flushing them.",
      "content": "If your dog’s ears are filled with wax, ask your vet about flushing them. Buy a vet-approved antibacterial flushing solution designed specifically for dog ears. Flip their ears up, squirt a dollop of the cleaner directly into the ear canal, and immediately flip their ears down. Gently massage the ears to work the cleaner deep into their ear canal. Wipe the ears out with a cotton swab when you’re done. [7] X Research source It isn’t always a good idea to flush a dog’s ears, so ask your veterinarian if they think it’s a good idea. This kind of deep cleaning isn’t always necessary, and over-cleaning can lead to infection or irritation. [8] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Your vet may be able to recommend a specific ear flushing product that will be ideal for your poodle."
    },
    {
      "title": "This a controversial move, so talk to a vet before doing this.",
      "content": "This a controversial move, so talk to a vet before doing this. If you have the green light from your vet to remove inner-ear hair due to recurrent infections, grab some grooming ear powder designed for dogs. Sprinkle a pinch of the powder over the hair. Use your thumb and index finger or some fine-point forceps to quickly pluck the hair. Only do a few strands at a time to avoid irritating your dog’s skin. [9] X Research source The powder absorbs oils and moisture and makes it easier for your fingers or forceps to grip it. You can use a hemostat instead of forceps if you prefer. After you remove any hair, moisten a cotton ball with ear cleaner and gently wipe the skin. This is a hotly debated topic. Plucking a dog’s inner-ear hair may hurt a little bit, and many veterinarians advocate that it is unnecessary and could sometimes cause more inflammation and then lead to infection. [10] X Research source"
    },
    {
      "title": "Poodles produce a lot of ear wax, so their ears need a bit more care.",
      "content": "Poodles produce a lot of ear wax, so their ears need a bit more care. This is a breed of dog that needs frequent ear cleanings, so don’t neglect this task. [11] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Check your pup’s ears weekly. If there is any debris , dirt, or wax buildup, clean your dog’s ears. This will keep your dog happy, clean, and healthy. Remember, dirty or moist ears can lead to a variety of health problems. [12] X Research source Every dog is different. If your poodle’s ears tend to stay relatively clean, you may only need to clear their ears once a month or so. Most poodles need a weekly cleaning, though."
    },
    {
      "title": "Go to the vet if your dog’s ears smell, develop bacteria, or change color.",
      "content": "Go to the vet if your dog’s ears smell, develop bacteria, or change color. Funky odors are a surefire sign that your dog has an ear infection. Bacteria buildup, like yeast, is also a sign something is up. Your dog’s ears may also be infected if the skin turns red, develops spots, or becomes inflamed. If you notice anything, take your dog to the veterinarian for treatment. [13] X Research source There are a few behavioral signs of ear infections as well. If your pup scratches their ears a lot or shies away when you touch them, they may have an ear infection. Poodles are more prone to ear infections than other breeds due to the hair inside of their ears and how low their ears hang, which is partly why they require so much maintenance when it comes to ear cleanings. [14] X Research source"
    }
  ]
}