{
  "url": "https://www.wikihow.com/Get-Paid-for-Amazon-Reviews",
  "title": "How to Get Paid to Write Amazon Reviews",
  "steps": [
    {
      "title": "Visit the Amazon Influencer Program page to start the sign-up process.",
      "content": "Visit the Amazon Influencer Program page to start the sign-up process. The Amazon Influencer Program allows you to make a Storefront profile, where you can earn commission through the content you make and publish to the platform. Qualifying for this program ultimately depends on your social media presence."
    },
    {
      "title": "Link a social media account through the sign-up window.",
      "content": "Link a social media account through the sign-up window. Which social media platform do you have the biggest following on (e.g., Instagram, YouTube, TikTok, etc.)? Follow the onscreen instructions to log into your profile via Amazon. You don’t need to be super famous to qualify for this program, but you should have a decent following and good engagement potential. Amazon doesn’t provide specific qualification metrics, so feel free to throw your hat in the ring if you think you could be a good fit."
    },
    {
      "title": "Create an Amazon Influencer profile if you’re accepted.",
      "content": "Create an Amazon Influencer profile if you’re accepted. At this point, Amazon will let you know whether you’re accepted. If you see the acceptance screen, follow the onscreen instructions to set up your account."
    },
    {
      "title": "Make review videos for different products on Amazon.",
      "content": "Make review videos for different products on Amazon. Record short videos of yourself reviewing different products for the platform—the shorter they are, the better. [1] X Research source Amazon doesn’t specify an exact time requirement for these videos on their site, so try to keep them as brief as possible (as if you’re making a YouTube Short or TikTok)."
    },
    {
      "title": "Receive affiliate payments for your videos 2 months after the month you posted them.",
      "content": "Receive affiliate payments for your videos 2 months after the month you posted them. Amazon ships out their payments 2 months after the month the money was earned (e.g., money earned in April is paid out in June). You can receive this money in check, gift card, or direct deposit form. [2] X Research source"
    },
    {
      "title": "Create an Amazon review blog.",
      "content": "Create an Amazon review blog. To get approved for the Amazon Associates program, you have to have an existing website, app, or platform with new content. Amazon’s affiliate program runs on a trial basis. As long as you pass the initial application process, you can get an affiliate code on the same day you apply."
    },
    {
      "title": "Post new content to your blog.",
      "content": "Post new content to your blog. Start posting reviews to your blog regularly (Amazon prefers sites with at least 10 posts already live). Make sure that your site is public; otherwise, Amazon will likely not approve it. [3] X Research source"
    },
    {
      "title": "Apply for the Amazon Associates program.",
      "content": "Apply for the Amazon Associates program . Visit this site on your phone or computer."
    },
    {
      "title": "Generate an affiliate link for a product you’d like to promote.",
      "content": "Generate an affiliate link for a product you’d like to promote. Search Amazon for a product you’d like to review on your blog. Once you have the product pulled up, go to the gray SiteStripe bar at the top of the screen and click on Text , Image , or Text+Image to generate a specific type of element to include on your blog. In the small window that appears, choose your store ID from the drop-down menu and choose Get Link . [4] X Research source"
    },
    {
      "title": "Create content using your new affiliate link.",
      "content": "Create content using your new affiliate link. Embed the generated links into relevant blog content so readers can easily click on your links, be redirected to Amazon, and (potentially) make a purchase. [5] X Research source According to Amazon, participating customers can get paid for up to 10% in commissions from the purchases made with affiliate links."
    },
    {
      "title": "Earn at least 3 purchases with your affiliate link in 180 days.",
      "content": "Earn at least 3 purchases with your affiliate link in 180 days. If you don’t meet this threshold within the time period, Amazon will revoke your ID (and ability to make affiliate links). [6] X Research source"
    },
    {
      "title": "Wait to be paid 2 months after you earn the commissions.",
      "content": "Wait to be paid 2 months after you earn the commissions. Let’s say you earn $50 in commissions during the month of June—Amazon would send you the payment by the end of August (either as a direct deposit, check, or gift card). You need to earn at least $10 to get paid."
    },
    {
      "title": "Create affiliate links for specific items on Amazon.",
      "content": "Create affiliate links for specific items on Amazon. Once you’ve created an Amazon Associates account, use the SiteStripe feature to create affiliate links that will earn you money."
    },
    {
      "title": "Include these links in your Instagram posts.",
      "content": "Include these links in your Instagram posts. Create a post that features the items you’ve created affiliate links for. Let’s say you’re taking a trip to the beach, for example—you might post pictures of your beach day and include affiliate links to some of the items you bought in the caption. You could even make a video post where you review the products you’ve created affiliate links for."
    },
    {
      "title": "Generate affiliate links that you could include in your TikTok content.",
      "content": "Generate affiliate links that you could include in your TikTok content. Maybe you have a TikTok account that you use exclusively for product reviews, or you’re just looking to make a little extra money with the account you already have. Whatever the case, use Amazon Associates’ SiteStripe feature to create affiliate links for your upcoming content."
    },
    {
      "title": "Feature the affiliate links in your future TikToks.",
      "content": "Feature the affiliate links in your future TikToks. Feel free to feature certain items in a TikTok and then link to the items in the description. For example, if you’re doing a Get Ready With Me (GRWM) video, you might feature some of the beauty products you use."
    },
    {
      "title": "Leave high-quality reviews on all the products you order on Amazon.",
      "content": "Leave high-quality reviews on all the products you order on Amazon. Go the extra mile in your reviews, sharing extra details about your experiences with different products (both good and bad). You’re more likely to get selected if you frequently post thoughtful reviews on Amazon [7] X Research source You might include details about how to put a specific item together, special considerations to keep in mind, how the product looked/worked for you, and more."
    },
    {
      "title": "Wait for the Amazon Vine program to email you an invitation so you can sign up.",
      "content": "Wait for the Amazon Vine program to email you an invitation so you can sign up. Amazon Vine will reach out to the email attached to your Amazon account if they’re interested in having you join their team, so watch your inbox for an invitation. [8] X Research source There’s unfortunately no way to predict if/when Amazon will reach out—you’ll just have to be patient."
    },
    {
      "title": "Resell any free items you receive from the program to make a profit.",
      "content": "Resell any free items you receive from the program to make a profit. Once you’re part of Amazon Vine, you’ll receive free items to review . What you do with these items afterward is totally up to you, so feel free to resell them on platforms like eBay or Mercari to net some extra cash. If you’re interested in the world of product review (but don’t necessarily care about working with Amazon, check out platforms like Pinecone , Clicks Research , or BzzAgent ."
    },
    {
      "title": "Create a review channel.",
      "content": "Create a review channel. Build a YouTube channel that accurately models the types of products you’d most like to review, whether that’s kitchen gadgets, clothing, or whatever else appeals to you. When your channel is successful enough to qualify for YouTube’s Partner Program , you can start making ad revenue from the ads played on your videos."
    },
    {
      "title": "Gain at least 1,000 subs and 4,000 hours of watch time in the past year.",
      "content": "Gain at least 1,000 subs and 4,000 hours of watch time in the past year. YouTube requires all Partner Program candidates to have consistent traffic and views before getting a stamp of approval. [9] X Research source Continue working on your channel’s growth by creating product review videos frequently. If you have 500 subscribers, have uploaded 3 videos in the past 3 months, and have at least 3,000 watch hours on your channel in the past year, your channel can qualify for smaller money-making features, like channel memberships (a paid subscription to your channel) and Super Thanks (a “tip” viewers can leave on video content)."
    },
    {
      "title": "Apply for the YouTube Partner Program.",
      "content": "Apply for the YouTube Partner Program. Submit your channel to YouTube for review so you can start earning money. [10] X Research source"
    },
    {
      "title": "Wait to get paid between the 21st and the 26th of the next month.",
      "content": "Wait to get paid between the 21st and the 26th of the next month. Once you’re accepted into the YouTube Partner Program and start making money, you can expect to get paid the following month, typically toward the end (21st and 26th). [11] X Research source You’ll get paid via AdSense for YouTube. Tip: To make even more money, add affiliate links to the descriptions of your videos (when relevant)."
    },
    {
      "title": "Get paid for Amazon reviews via freelance writing websites.",
      "content": "Get paid for Amazon reviews via freelance writing websites. It’s possible to find paid product testing and review work on freelance platforms like Upwork and Fiverr . You can also personalize your freelancer profile, making it clear that you’re willing to write Amazon reviews (and what your standard rates are). On some sites, like Fiverr, you can offer different “tiers” of your services. For example, you could offer a short review (100 words or less) for $10, a 500-word review for $25, and so on."
    },
    {
      "title": "Look for paid product review opportunities on paid survey websites.",
      "content": "Look for paid product review opportunities on paid survey websites. Some entrepreneurial reviews have found success getting paid for product reviews on paid survey sites, like Survey Junkie or Swagbucks ."
    }
  ]
}