{
  "url": "https://www.wikihow.com/Clean-a-Grease-Trap",
  "title": "How to Clean a Grease Trap",
  "steps": [
    {
      "title": "Detach the lid from the grease trap gently with a pry bar.",
      "content": "Detach the lid from the grease trap gently with a pry bar. Be sure to go slowly through this process, as there are gaskets for the grease trap located just under the cover. If you damage these, you will have to spend money to replace them."
    },
    {
      "title": "Inspect the grease trap's parts once the lid is removed.",
      "content": "Inspect the grease trap's parts once the lid is removed. You will be removing and replacing parts during cleaning, and you need to know where the components are located and how to install them to put them back in properly. For better results, it may help to draw a diagram of the trap's interior so that you can refer to during the re-installation process."
    },
    {
      "title": "Insert a wooden dowel or measuring stick into the grease trap.",
      "content": "Insert a wooden dowel or measuring stick into the grease trap. Gently guide it to the bottom of the trap, and swirl it lightly in the trap so that the grease and oils mark the dowel. This can provide you with a guide to how much debris is in the trap. Remove the dowel, and use a tape measure to determine how many inches of waste are present. Record the results in a FOG (fatty oils and grease) pump out report, which is issued by the Environmental Protection Agency (EPA)."
    },
    {
      "title": "Use a small bucket to remove any standing water from the tank of your grease trap.",
      "content": "Use a small bucket to remove any standing water from the tank of your grease trap. If you prefer, you can store the water in a larger bucket or trash bin, and pour it back into the drain after collecting the waste."
    },
    {
      "title": "Remove the waste from your grease trap with the small bucket.",
      "content": "Remove the waste from your grease trap with the small bucket. Scoop the bucket in to the trap, and bring out the solidified waste. Place the waste in a water-tight container, such as a heavy-duty plastic trash bag."
    },
    {
      "title": "Scrape down the lid and the sides of the trap with your bucket.",
      "content": "Scrape down the lid and the sides of the trap with your bucket. Remove any large pieces of fat or oils that are attached to the trap. To achieve an even cleaner trap, you can use a wet/dry vacuum to suck out any smaller bits of waste."
    },
    {
      "title": "Clean the lids, trap sides, and parts with soap and room-temperature water.",
      "content": "Clean the lids, trap sides, and parts with soap and room-temperature water. Use a steel pot scrubber to remove excess waste and odor. Flush the screens and parts with water to remove the soap and debris."
    },
    {
      "title": "Re-install the grease traps parts by following your diagram.",
      "content": "Re-install the grease traps parts by following your diagram. Replace the lid once all the parts are secured and working."
    },
    {
      "title": "Copy your FOG report for your records.",
      "content": "Copy your FOG report for your records. [1] X Research source Mail the original to the address listed on the report."
    }
  ]
}