{
  "url": "https://www.wikihow.com/Add-a-Page-in-InDesign",
  "title": "How to Add One or More Pages to an InDesign Document: Easy Guide",
  "steps": [
    {
      "title": "Open your InDesign document and open the Layout menu.",
      "content": "Open your InDesign document and open the Layout menu. Click Layout at the top to open the menu. This displays multiple layout options."
    },
    {
      "title": "Click the Pages menu option.",
      "content": "Click the Pages menu option. You'll see Pages on the Layout menu. Additional menu options will expand."
    },
    {
      "title": "Click the Add Page option.",
      "content": "Click the Add Page option. Click Add Page to open the panel. A page will be added after your active page, and it will share the same parent page as the active page. [1] X Research source"
    },
    {
      "title": "Open your InDesign document and open the File menu.",
      "content": "Open your InDesign document and open the File menu. Click File at the top to open the menu. This displays multiple options."
    },
    {
      "title": "Click the Document Setup menu option.",
      "content": "Click the Document Setup menu option. You'll see Document Setup on the Layout menu. Additional menu options will expand."
    },
    {
      "title": "Specify the total number of pages for the document.",
      "content": "Specify the total number of pages for the document. If you increase the number of pages in the document, they will be added after the last page or spread of your document."
    },
    {
      "title": "Open your InDesign document and open the Layout menu.",
      "content": "Open your InDesign document and open the Layout menu. Click Layout at the top to open the menu. This displays multiple layout options."
    },
    {
      "title": "Click the Pages menu option.",
      "content": "Click the Pages menu option. You'll see Pages on the Layout menu. Additional menu options will expand."
    },
    {
      "title": "Click the Insert Pages option.",
      "content": "Click the Insert Pages option. Click Insert Pages to open the panel. Now you'll be able to add one or more pages to any location in your document."
    },
    {
      "title": "Choose where to insert the pages.",
      "content": "Choose where to insert the pages. Select a parent and enter the number of pages you want to insert. You can insert any number of pages into any location in your document. Once you save your changes, the new blank pages will be added to the selected location."
    }
  ]
}