{
  "url": "https://www.wikihow.com/Enneagram-4",
  "title": "Everything You Need to Know About Enneagram Type 4",
  "steps": [
    {
      "title": "Type 4s are known as the Individualists.",
      "content": "Type 4s are known as the Individualists. They value originality and authenticity above all else, and they often pursue unattainable ideals in life. They’re deeply connected to their melancholy and sadness. Type 4s are the most common Enneagram type, making up 19.6% of the population. [1] X Research source Basic Fear : having no identity or personal significance Basic Desire : finding their significance and creating their identity Key Motivations : expressing their individuality, surrounding themselves with beauty, protecting their self-image, and taking care of their emotional needs"
    },
    {
      "title": "Type 4 is a Heart Type.",
      "content": "Type 4 is a Heart Type. The Enneagram is divided into three overarching types: Heart, Head, and Body. Heart Types make decisions based on their feelings and intuition. For this reason, 4s often pursue careers in the arts or helping professions. [2] X Research source"
    },
    {
      "title": "Type 4s are creative.",
      "content": "Type 4s are creative. 4s see the beauty in life and often find themselves drawn to art and aesthetics. Their deep understanding of emotions often leads to ground-breaking work, and many great artists and creators throughout history shared many Type 4 traits. [3] X Research source"
    },
    {
      "title": "They’re emotionally sensitive.",
      "content": "They’re emotionally sensitive. Type 4s can handle any strong emotions thrown at them. They’re not afraid to talk about pain and are willing to listen to your deepest struggles and fears. Talking about feelings helps 4s develop more intimate relationships. [4] X Research source"
    },
    {
      "title": "4s have a keen eye for beauty.",
      "content": "4s have a keen eye for beauty. 4s are often interested in aesthetics and strive to make the world more beautiful. They may have a good sense of style and an interest in the visual arts like painting and photography. [5] X Research source"
    },
    {
      "title": "4s are introspective.",
      "content": "4s are introspective. This type is always trying to learn more about themselves in the deepest sense. They spend a lot of their time reflecting on themselves and their impact on the world. [6] X Research source"
    },
    {
      "title": "They’re prone to depression and melancholia.",
      "content": "They’re prone to depression and melancholia. 4s are often attracted to the bittersweet parts of life, but if they aren’t careful, this can negatively affect their mental state. Thinking too deeply about negative emotions often leads to self-pity and despair. [7] X Research source If you’re struggling with depression, reach out to a mental health professional or talk to a trusted loved one. Try writing down the positive aspects of your life to remind yourself that things aren’t always as bad as they seem."
    },
    {
      "title": "They tend to be envious.",
      "content": "They tend to be envious. 4s often feel like something is missing from their lives. They feel a deep longing for a sense of satisfaction, and they become jealous when others have what they’re looking for. [8] X Research source To handle your jealousy , try to understand the root of the feeling. Understand if you’re sad or angry and begin to look for solutions to the underlying problem."
    },
    {
      "title": "They can be self-absorbed.",
      "content": "They can be self-absorbed. While 4s’ attempt to understand their emotions and true selves often leads to a strong sense of empathy, they can also become too focused on themselves. 4s are sometimes consumed by their search for meaning in life. They’re always looking for the next thing that will make them feel complete, which sometimes causes them to disregard those around them. [9] X Research source To stop being self-centered , focus on listening rather than talking. Give others your full attention and ask follow-up questions to show you care."
    },
    {
      "title": "They’re afraid of not being special.",
      "content": "They’re afraid of not being special. 4s often feel like they were born with a part of them missing, making them fundamentally different from everyone else. Because of this, they base their identity around being different and hope people will acknowledge and affirm their individuality. If this doesn’t happen, they feel insecure and begin to question themselves and their identity. [10] X Research source To be less insecure, make note of your strengths. Remember your talents and abilities rather than focusing on the ones you don’t have. Whenever you start to feel self-conscious, remember these good qualities to remind yourself of your worth."
    },
    {
      "title": "Get out of your head.",
      "content": "Get out of your head. It’s great to understand and acknowledge your emotions, but it’s also important to remember your feelings don’t define you. Feeling sad or angry doesn’t make you a bad person; it just means something is upsetting you at a particular moment. When you feel bad about something, acknowledge the feeling and let it pass. [11] X Research source"
    },
    {
      "title": "Work consistently.",
      "content": "Work consistently. It’s easy to wait to do something until you’re “in the right mood,” but you’ll be happier putting your creations out into the world. You won’t find your identity while waiting for inspiration to strike. Work on your passions every day to create a healthy routine."
    },
    {
      "title": "Take on new challenges.",
      "content": "Take on new challenges. You may never feel “ready” to take on something that scares you, and that’s okay. Do it anyway! Commit yourself to doing something that will bring out the best in you. This is a great way to boost your confidence and self-esteem."
    },
    {
      "title": "Practice positive affirmations.",
      "content": "Practice positive affirmations. 4s are prone to self-esteem issues, so avoid negative self-talk. Instead, focus on positive thoughts to develop a kinder mindset. When you’re feeling down, think of all the things you like about yourself."
    },
    {
      "title": "4w3s are known as the Aristocrats.",
      "content": "4w3s are known as the Aristocrats. They’re hard workers who value having good taste and want others to view them as knowledgeable. This subtype cares a lot about what others think of them. [12] X Research source 4w3s are very productive and often produce work with strong emotional resonance. They’re likely to succeed as a journalist or motivational speaker. [13] X Research source They might suppress their emotions. Because Type 3s are very practical, 4w3s might not be as emotional as other Type 4s. This is because they put a lot of value into their self-image and want to control how they’re perceived. [14] X Research source They avoid the spotlight. While 4w3s may want success in theory, they tend to avoid it in practice. They often feel that being successful and having all eyes on them will expose their insecurities and self-perceived failures. [15] X Research source"
    },
    {
      "title": "4w5s are called Bohemians.",
      "content": "4w5s are called Bohemians. They often come across as aloof or avant-garde. This subtype bridges the gap between the Heart Type and the Head Type, creating a unique personality with strong emotional and logical traits. [16] X Research source 4w5s are naturally curious. Type 5s are known as Investigators, so 4w5s connect with their 5-wing to learn things about the world and themselves. Their goal is to discover their true inner-self and use that exploration to create meaningful work. [17] X Research source They don’t need much outside validation. Unlike other Type 4s, 4w5s understand their individualism and don’t need reassurance from others. They’re often able to detach from their emotions instead of identifying with them. [18] X Research source 4w5s are procrastinators. While they often have incredible artistic and creative ideas, they’re very slow to act on them. They tend to jump from idea to idea rather than finish what they started, and they often lack the motivation to follow through. [19] X Research source"
    },
    {
      "title": "Type 1",
      "content": "Type 1 4s and 1s are often seen as “oil and water” because they view the world in opposite ways. When they respect each other’s views, however, they often have a high-achieving relationship. 1s provide 4s with much-needed structure, and 4s allow 1s to express their feelings. [20] X Research source"
    },
    {
      "title": "Type 2",
      "content": "Type 2 4s and 2s are often better as friends than romantic partners. In a relationship, these types are likely to become codependent, as the Type 2 will often want to “save” the Type 4. In a healthy relationship, 4s will draw their partner in through their romanticism, while they will be attracted to the 2’s warmth and security. [21] X Research source"
    },
    {
      "title": "Type 3",
      "content": "Type 3 A relationship between a Type 4 and a Type 3 is often outwardly successful because they’re both concerned with their public image. They each possess what the other lacks, and their response to this determines the course of the relationship. They will either view their partner as their missing piece or become too envious for the relationship to succeed. [22] X Research source"
    },
    {
      "title": "Type 4",
      "content": "Type 4 When 4s meet, they often share a sense of knowing that initially leads to a passionate connection. They’ll quickly become inseparable and maintain their relationship through their emotional and creative endeavors. 4s tend to retreat into themselves, though, and this can often cause strain in the relationship. [23] X Research source"
    },
    {
      "title": "Type 5",
      "content": "Type 5 4s and 5s are initially drawn to each other because of curiosity. 4s believe 5s are a withdrawn mystery to pursue, while 5s are curious about 4s’ hidden depths. In a relationship, these two will have stimulating conversations and open communication. [24] X Research source"
    },
    {
      "title": "Type 6",
      "content": "Type 6 These types are drawn to each other’s emotional intensity and intuition. They often bond over their inferiority and feeling like outcasts. Both are emotionally reactive, so conflicts can escalate quickly if their commitment to each other isn’t confirmed. [25] X Research source"
    },
    {
      "title": "Type 7",
      "content": "Type 7 Relationships between Type 4s and Type 7s are very common. These two find each other fascinating and will share a passionate, spontaneous connection. 4s encourage 7s to explore their emotional depth, and 7s help 4s overcome their emotional possessiveness. [26] X Research source"
    },
    {
      "title": "Type 8",
      "content": "Type 8 4s and 8s create a very intense relationship for better or for worse. This relationship is inherently volatile and creative. Type 4 often depends on Type 8’s practicality and protection, while Type 8 is attracted to their partner’s connection with the unseen. [27] X Research source"
    },
    {
      "title": "Type 9",
      "content": "Type 9 These two are both emotionally sensitive and empathetic, so they often believe they’ve found their soulmate when they meet. They feel a deep sense of acceptance and emotional intensity. They support each other’s creativity and give each other the space they need. [28] X Research source"
    },
    {
      "title": "Type 4s are often musicians, actors, and writers.",
      "content": "Type 4s are often musicians, actors, and writers. Because 4s value uniqueness and want to be great creators, there are a lot of celebrities and artists that fall under this enneagram type. [29] X Research source Here are some examples: Fyodor Dostoyevsky Emily Dickinson Kurt Cobain Janis Joplin Stevie Nicks Tim Burton Donald Glover Benedict Cumberbatch Frida Kahlo Bob Dylan"
    }
  ]
}