{
  "url": "https://www.wikihow.com/Rotate-a-Shape",
  "title": "How to Rotate a Shape",
  "steps": [
    {
      "title": "Note the corresponding clockwise and counterclockwise rotations.",
      "content": "Note the corresponding clockwise and counterclockwise rotations. Rotating a shape 90 degrees is the same as rotating it 270 degrees clockwise. [2] X Research source The convention is that when rotating shapes on a coordinate plane, they rotate counterclockwise, or towards the left. [3] X Research source You should assume this, unless it is noted in the problem that you need to rotate clockwise. For example, if the problem states, “Rotate the shape 90 degrees around the origin,” you can assume you are rotating the shape counterclockwise. You would complete this problem the same way you complete a problem that asks “Rotate the shape 270 degrees clockwise around the origin.” You might also see, “Rotate this shape -270 degrees around the origin.”"
    },
    {
      "title": "Find the coordinates of the original vertices.",
      "content": "Find the coordinates of the original vertices. If these aren’t already provided, determine the coordinates using the graph. Remember that coordinates of points are shown using the ( x , y ) {\\displaystyle (x,y)} formula, where x {\\displaystyle x} equals the point on the horizontal, or x-axis, and y {\\displaystyle y} equals the point on the vertical, or y-axis. [4] X Research source For example, you might have a triangle with points (4, 6), (1, 2), and (1, 8)."
    },
    {
      "title": "Set up the formula for rotating a shape 90 degrees.",
      "content": "Set up the formula for rotating a shape 90 degrees. The formula is ( x , y ) → ( − y , x ) {\\displaystyle (x,y)\\rightarrow (-y,x)} . [5] X Research source This formula shows that you are reflecting the shape, then flipping it. [6] X Research source"
    },
    {
      "title": "Plug the coordinates into the formula.",
      "content": "Plug the coordinates into the formula. Make sure that you keep your x and y-coordinates straight. In this formula, you take the negative of the y value, and then switch the order of the coordinates. [7] X Research source For example, the points (4, 6), (1, 2), and (1, 8) become (-6, 4), (-2, 1), and (-8, 1)."
    },
    {
      "title": "Draw the new shape.",
      "content": "Draw the new shape. Plot the new vertex points on the plane. Connect your points using a straightedge. The resulting shape shows the original shape rotated 90 degrees around the origin. [8] X Research source"
    },
    {
      "title": "Identify the corresponding clockwise and counterclockwise rotations.",
      "content": "Identify the corresponding clockwise and counterclockwise rotations. Since a full rotation has 360 degrees, rotating a shape 180 degrees clockwise is the same as rotating 180 counterclockwise. If the problem states, “Rotate the shape 180 degrees around the origin,” you can assume you are rotating the shape counterclockwise. You would complete this problem the same way you complete a problem that asks “Rotate the shape 180 degrees clockwise around the origin.” You might also see, “Rotate this shape -180 degrees around the origin.”"
    },
    {
      "title": "Write down the coordinates of the original shape’s vertices.",
      "content": "Write down the coordinates of the original shape’s vertices. These will likely be given. If not, you should be able to deduce them from looking at the coordinate graph. Remember to note the coordinates of each vertex’s point using the (x, y) convention. For example, you might have a rhombus with points (4, 6), (-4, 6), (-2, -1), and (2, -1)."
    },
    {
      "title": "Set up the formula for rotating a shape 180 degrees.",
      "content": "Set up the formula for rotating a shape 180 degrees. The formula is ( x , y ) → ( − x , − y ) {\\displaystyle (x,y)\\rightarrow (-x,-y)} . [9] X Research source This formula shows that you are reflecting the shape twice. [10] X Research source"
    },
    {
      "title": "Plug the coordinates into the formula.",
      "content": "Plug the coordinates into the formula. Take care to plug the correct coordinate into the correct position of the new ordered pair. In this formula, you keep the x and y values in the same position, but you take the negative value of each coordinate. For example, the points (4, 6), (-4, 6), (-2, -1), and (2, -1) become (-4, -6), (4, -6), (2, 1), and (-2, 1)."
    },
    {
      "title": "Draw the new shape.",
      "content": "Draw the new shape. Plot the new vertex points on the plane. Connect your points using a straightedge. The resulting shape shows the original shape rotated 180 degrees around the origin. [11] X Research source"
    },
    {
      "title": "Note the corresponding clockwise and counterclockwise rotations.",
      "content": "Note the corresponding clockwise and counterclockwise rotations. Rotating a shape 270 degrees is the same as rotating it 90 degrees clockwise. Conventionally, shapes are rotated counterclockwise on a coordinate plane. [12] X Research source You should assume this, unless it is noted in the problem that you need to rotate clockwise. For example, if the problem states, “Rotate the shape 270 degrees around the origin,” you can assume you are rotating the shape counterclockwise. You would complete this problem the same way you complete a problem that asks “Rotate the shape 90 degrees clockwise around the origin.” You might also see, “Rotate this shape -90 degrees around the origin.”"
    },
    {
      "title": "Find the coordinates of the original vertices.",
      "content": "Find the coordinates of the original vertices. This information should be provided, or you should be able to easily find the coordinates by looking at the coordinate plane. For example, you might have a triangle with points (4, 6), (1, 2), and (1, 8)."
    },
    {
      "title": "Set up the formula for rotating a shape 270 degrees.",
      "content": "Set up the formula for rotating a shape 270 degrees. The formula is ( x , y ) → ( y , − x ) {\\displaystyle (x,y)\\rightarrow (y,-x)} . [13] X Research source It shows you that are reflecting the shape, then flipping it. [14] X Research source"
    },
    {
      "title": "Plug the coordinates into the formula.",
      "content": "Plug the coordinates into the formula. Make sure you plug the correct x and y values into the new coordinate pair. In this formula, the x and y values are reversed, and you take the negative value of the x coordinate. [15] X Research source For example, the points (4, 6), (1, 2), and (1, 8) become (6, -4), (2, -1), and (8, -1)."
    },
    {
      "title": "Draw the new shape.",
      "content": "Draw the new shape. Draw the new points on the plane. Use a straightedge to connect them. The resulting shape shows the original shape rotated 270 degrees around the origin. [16] X Research source"
    }
  ]
}