{
  "url": "https://www.wikihow.com/Organize-a-Fashion-Show",
  "title": "How to Organize a Fashion Show",
  "steps": [
    {
      "title": "Pick a theme for your show at least 5 months in advance.",
      "content": "Pick a theme for your show at least 5 months in advance. This will give you direction as you choose designers and outfits, book a venue, and decide on casting. Ideas for themes include “Animals,” “Gothic,” “Masculine Touch,” “Velvet,” “Denim,” and so many more. Be creative and collaborate with others to choose a theme that excites you. [1] X Research source If you are the designer, you probably have a good idea in mind for the theme of the show. If not, you could meet with local design students to see what kinds of outfits are available to showcase."
    },
    {
      "title": "Create a budget",
      "content": "Create a budget for your event. Do you have funds available or are you going to be relying on donations and volunteers? Keep in mind that you will need a venue, a team of people to help plan and run the event, clothes, models, and entertainment. A lot of these items might not cost you anything, but fashion shows generally cost anywhere from $500 to $5,000 to produce. [2] X Research source Planning fundraisers to raise money for your event or appealing to large businesses for donations are 2 ways you can pad your budget. You can ask designers and models to volunteer their time in exchange for free showcasing in your event."
    },
    {
      "title": "Establish how large the show will be and how much tickets will cost.",
      "content": "Establish how large the show will be and how much tickets will cost. If you are planning on using the proceeds from the tickets to help bankroll the event, knowing just how many people you plan to sell tickets to will help you set the price. Most shows last 30–60 minutes and can showcase up to 100 outfits, so even just with the workers and models, there will be a lot of people involved. If you consider that their friends and family will buy tickets to the show, in addition to people from the community at large, you will probably have 200+ people in attendance. [3] X Research source [4] X Research source Price your tickets between $10-$30, depending on the location. In a bigger city, you can charge more money. If you are mainly catering to college students, keep the ticket price low to encourage a bigger turnout. Your venue will determine the size of your event in the end, so keep in mind that until it is booked, your numbers need to be somewhat flexible."
    },
    {
      "title": "Recruit friends",
      "content": "Recruit friends , family, or professionals to help with your event. Whatever tasks or duties you don't assign to someone else will fall to you, and assembling a team to help with various tasks will make the planning process and event production much more enjoyable and rewarding for everyone involved. [5] X Research source If you are a student, you can find other students to help with the show. If you are putting on a fundraiser, have others from your organization volunteer their time."
    },
    {
      "title": "Find someone to take care of advertising and graphic design.",
      "content": "Find someone to take care of advertising and graphic design. This person (or these people) will be in charge of creating fliers and graphics for the event. They will promote the event on social media, with the newspapers in the area, and will visit local businesses to hang signs for the event. They will be integral in helping with ticket sales. [6] X Research source Advertising is something that needs to be planned in advance, so recruit this person as soon as possible."
    },
    {
      "title": "Hire a team to help with hair and makeup for the event.",
      "content": "Hire a team to help with hair and makeup for the event. Students from a local beauty school may be willing to donate their time for free in exchange for the practice or photos for their portfolios. If you have 10 models, have at least 5 individuals to help with hair and makeup. [7] X Research source If you are working with children's fashion, ask their parents to help out the day of the show to make sure the kids are comfortable."
    },
    {
      "title": "Recruit an emcee to do the music and announcements.",
      "content": "Recruit an emcee to do the music and announcements. If you don't know a friend or professional who is willing to donate their time, this may be where you end up spending a little more money, but having a good emcee is an essential part of putting on a fun fashion show. The emcee is in charge of announcing the designers and outfits, keeping the energy of the crowd up, and moving the show along at the right speed. [8] X Research source Look online or talk to people who have planned fashion shows in the past to get referrals for a quality emcee. If you are doing a fundraiser fashion show, make sure to ask if you can get a discount on services."
    },
    {
      "title": "Designate someone to be in charge of the lighting for the event.",
      "content": "Designate someone to be in charge of the lighting for the event. Your emcee might be able to do this task, but if they can't you'll need to find someone else. Someone who has experience running the lights for plays or music events is an ideal candidate. [9] X Research source"
    },
    {
      "title": "Ask for volunteers to help as wardrobe specialists the day of the event.",
      "content": "Ask for volunteers to help as wardrobe specialists the day of the event. Because fashion shows are so fast-paced, your models will need help getting in and out of their various outfits. Having a team designated to help them and keep the outfits in order will help your event run smoothly and prevent last-minute wardrobe emergencies. [10] X Research source Choose individuals who have good organizational skills, as there will be a lot going on backstage and a lot to keep track of."
    },
    {
      "title": "Assemble a group devoted to setup and cleanup tasks.",
      "content": "Assemble a group devoted to setup and cleanup tasks. Handling seating, creating makeshift wardrobe rooms, putting up decorations, handing out programs, and many other tasks the day of the event need to be delegated to a team of individuals. This is a great way for friends and family or other students to get involved if they want to be but don't have much time to commit. Find at least 5 people who can commit to this role. [11] X Research source These individuals need to be available the entire day of the event to help with preparations and with clean up once the show is over."
    },
    {
      "title": "Have an initial meeting",
      "content": "Have an initial meeting with your team to delegate tasks. Getting everyone on the same page is essential to planning an event that will run smoothly. Before the meeting, think about what tasks you will need to delegate to the members of your team. Create an agenda for the meeting with details written out so everyone can reference the plans and knows what the expectations and deadlines are. [12] X Research source For example, on the agenda you could write each person's name and their responsibilities, along with the various tasks they will need to complete, like “Mark Smith, advertising, in charge of social media promotions and creating and hanging fliers in local businesses.”"
    },
    {
      "title": "Find a venue that is large enough for an audience and a runway.",
      "content": "Find a venue that is large enough for an audience and a runway. Local theaters, schools, and community centers are all viable options for a fashion show. If you find a venue that doesn't have a traditional runway, you can always use the existing stage. [13] X Research source The venue will, to a large extent, determine the time of the show and how large of a crowd you can expect, so book it as early in the process as possible. If you are organizing the fashion show as a fundraising event, ask the venue if they will donate the space to you for free or if they could offer you a discount on the booking price. Many universities offer auditorium space for free to students."
    },
    {
      "title": "Check the accommodations of the venue.",
      "content": "Check the accommodations of the venue. Is there a backstage area where the models will be able to get changed? Is there disability accessibility? What about free parking? Have your emcee and wardrobe specialist visit venues with you to get their opinion on the space rather than making the decision on your own. [14] X Research source If you are booking a school or community center, there are probably rooms that can be used for backstage space and dressing rooms for the models."
    },
    {
      "title": "Rent chairs if the venue doesn't have built-in seating.",
      "content": "Rent chairs if the venue doesn't have built-in seating. If you're in a school auditorium or a theater, chances are there are seats already there. For a local community center, you may need to rent chairs for the guests. Based on the crowd restrictions, make a reservation for chair rentals at least 8 weeks ahead of time. [15] X Research source You'll need an isle for guests to walk down, room for disability accessible spots, and space for a runway if there isn't a stage already available."
    },
    {
      "title": "Design the runway area.",
      "content": "Design the runway area. When you book the venue, decide how you will either use the existing stage or make a plan to craft a runway yourself. This will help you plan the timing of the show. Most runways are 100 feet (30 m) and showcase the model walking to an end point and back. [16] X Research source If you are constructing your own runway, buy or rent several wooden, carpeted stage platforms. Line them in the center of the room on the day of the event and make sure they are pushed together tightly—you don't want any gaps. Hang a black curtain where the runway starts so the models can come out from behind it."
    },
    {
      "title": "Get the community involved by asking for volunteers.",
      "content": "Get the community involved by asking for volunteers. People on your team may be willing to model, or they may have friends who would be interested. Advertise on social media and in local businesses that you are looking for models for your event. You could also ask parents at school, members of local churches, or members of local networking groups. Finding volunteers should be relatively easy and is a great way to increase ticket sales for your event, too. [17] X Research source If you are planning a baby or kids fashion show, visit local schools to ask parents about letting their kids participate"
    },
    {
      "title": "Hold a model casting audition to find models for your show.",
      "content": "Hold a model casting audition to find models for your show. Put ads in the newspaper, on social media, or in campus mailers to promote the casting call. Look for models who have a sturdy, confident walk and who have high energy levels. Focusing on confidence and attitude oversize and weight will give you a more dynamic team of models for your shows. [18] X Research source Choose men and women who have varied looks—showcasing different ranges of body types and styles will keep your audience more captivated than having models who all look very similar."
    },
    {
      "title": "Coordinate outfits for the models.",
      "content": "Coordinate outfits for the models. If you or a friend are the clothes designer, you will already know what outfits you would like the models to wear. But if you are putting on a show as a fundraiser, you'll need to talk to local boutique owners and fashion design students to secure donations. Most of these people will be willing to donate clothing items in exchange for the free publicity. [19] X Research source If you are working with a boutique or a school, ask them to help promote your event and sell tickets, too. Some fashion shows even charge the vendors to have their clothing included in the show; if you are planning a big fundraising event, this is another way you could potentially raise money."
    },
    {
      "title": "Schedule fittings for your models several weeks before the event.",
      "content": "Schedule fittings for your models several weeks before the event. This gives designers a chance to make adjustments to the length or fit of the clothing items. You can also take pictures of the models in the clothes to use as promotional material online or in fliers. [20] X Research source If models will be wearing multiple outfits the night of the event, taking photos of them in each outfit can help them remember what goes with each outfit!"
    },
    {
      "title": "Find accessories",
      "content": "Find accessories like shoes, jewelry, and scarves. You don't want your models running around barefoot on the runway! If the designers don't have accessories to pair with the outfits, visit boutiques, ask the models if they have matching accessories, or visit thrift stores to find inexpensive options. [21] X Research source If people are letting you borrow personal clothing, keep a detailed list of who gave what so you can return items after the show."
    },
    {
      "title": "Pick music to play during the show.",
      "content": "Pick music to play during the show. If you know already how many outfits you are showcasing and how long you want the event to last, you can pick music to fit that timeframe. The music will keep you and the models on track the day of the event. High energy music is essential to energize both the audience and the models. [22] X Research source Avoid music with lyrics as it can distract from the designs. Techno music or something with a strong beat is ideal."
    },
    {
      "title": "Schedule the lighting changes for the show.",
      "content": "Schedule the lighting changes for the show. The lighting should follow whichever model is coming to the front of the runway. The rest of the auditorium or space should be dim or dark to illuminate the designs and models. Coordinate this with your designated lighting specialist. [23] X Research source"
    },
    {
      "title": "Practice the show to get the runway timing down.",
      "content": "Practice the show to get the runway timing down. Fashion shows usually run no longer than 30 minutes, so things move pretty quickly. Have at least 3 rehearsals where you can time the models and the outfit changes to make sure things are running smoothly. [24] X Research source If you are working with inexperienced models or younger people, you may need to coach them on how to do a runway walk and strike poses."
    },
    {
      "title": "Write out the timeline for the day of the event.",
      "content": "Write out the timeline for the day of the event. This schedule should be shared with all participants and volunteers at least 1 week before the actual event. Things to specify include what time the makeup and hair artists need to be at the venue, when the models should arrive, when the emcee needs to get setup, and what time ticket-takers need to be available to greet guests. [25] X Research source A lot of behind the scenes work goes into a fashion show. Everyone on your team should be available the day of the show to help out with last-minute tasks."
    },
    {
      "title": "Coordinate with the emcee.",
      "content": "Coordinate with the emcee. The emcee is going to be your best friend the day of the event, as they will be announcing the outfits, designers, models, and keeping the energy level up. Meet with the emcee to create a detailed list of the order of the outfits, what should be said about each one, and how to pronounce everyone's names. [26] X Research source Ask the emcee for their thoughts on your music for the event—if they have experience, chances are they'll have some good insights to share with you."
    },
    {
      "title": "Sell tickets starting 6 weeks in advance of the show.",
      "content": "Sell tickets starting 6 weeks in advance of the show. Keep your demographic in mind—if you are in a large city, you can charge more for a ticket, but in smaller areas you probably don't want to charge more than $10. A range of $10-$30 for a fashion show is appropriate. Have members of your team sell tickets at work and to friends and family, give tickets to vendors to have them distribute as well, and visit schools and community centers to spread the word. [27] X Research source Make sure to have a refund policy in place in case the event has to be cancelled or rescheduled."
    },
    {
      "title": "Use social media",
      "content": "Use social media to spread the word. Create an event on social media that can be shared. Post photos of the models and outfits as teasers to the event in the weeks preceding. Be creative and have your marketing director take the bulk of this work from you. [28] X Research source If you are posting photos of the models, make sure to have their permission beforehand to avoid any privacy violations."
    },
    {
      "title": "Invite VIPs, local TV and radio stations, and the local newspaper.",
      "content": "Invite VIPs, local TV and radio stations, and the local newspaper. Ask them to publicize and cover your event. Having bigger names or businesses involved will create more buzz about the fashion show! Send invitations to these people at least 6 weeks before the event. [29] X Research source If you are organizing a charity fundraiser fashion show, submit press releases to the media with information about the cause you are supporting."
    }
  ]
}