{
  "url": "https://www.wikihow.com/Apply-Basic-Stage-Makeup-(for-Women)",
  "title": "How to Apply Basic Stage Makeup (for Women)",
  "steps": [
    {
      "title": "Wash and moisturize your face to create a smooth base for makeup.",
      "content": "Wash and moisturize your face to create a smooth base for makeup. Use warm water and a mild cleanser to wash your face. Rinse your skin thoroughly and pat it gently with a towel to dry it. Then, apply an oil-free moisturizer all over your face and give it a few minutes to soak in before proceeding. [1] X Research source If your skin is dry or flaky, consider gently exfoliating after you cleanse or use an exfoliating cleanser to slough away rough patches."
    },
    {
      "title": "Use a sponge or makeup brush to apply oil-free foundation.",
      "content": "Use a sponge or makeup brush to apply oil-free foundation . [2] X Expert Source Katya Gudaeva Professional Makeup Artist Expert Interview. 11 April 2019. Go with a full coverage liquid foundation that matches your skin tone or that’s one shade darker than your skin tone. Apply the foundation all over your face to even out your skin tone and give you a nice base to work on. Be sure to blend out thoroughly at the hairline and jawline. If you have warm or reddish undertones , look for a foundation with a yellow or golden finish. If your character is supposed to be sick or tired, go with a foundation that has cool undertones. Consider applying primer before foundation. It’s not required, but it can help makeup last longer, especially under the hot stage lights."
    },
    {
      "title": "Apply concealer",
      "content": "Apply concealer to cover up undereye circles and blemishes. [3] X Expert Source Katya Gudaeva Professional Makeup Artist Expert Interview. 11 April 2019. For dark circles, use a peachy concealer to color correct the purple under your eyes, then follow it up with a concealer that matches your foundation. Then, dot concealer onto blemishes individually with your finger or a makeup brush and blend it out for a seamless look. [4] X Research source If you don’t have dark circles or blemishes, you don’t need to use concealer."
    },
    {
      "title": "Set your foundation and concealer with translucent powder.",
      "content": "Set your foundation and concealer with translucent powder. Use a fluffy powder brush to apply a light dusting of translucent powder all over your face. A light dusting is all you need to set the foundation and concealer and mattify any areas that look oily. [5] X Research source Mattifying is important, since you don’t want your face to look shiny under the stage lights."
    },
    {
      "title": "Contour and highlight your face for extra definition",
      "content": "Contour and highlight your face for extra definition , if desired. Apply bronzer that’s 1-2 shades darker than your foundation to your cheekbones, temples, and jawline to define those features. Use a fluffy brush to blend the bronzer seamlessly into the foundation. Then, apply a highlighting powder or cream that’s 1-2 shades paler than your foundation to your brow bones and along the top of your cheekbones. Be sure to feather out any harsh lines with a fluffy blush to blend your highlighter into the rest of your makeup. [6] X Research source You don’t have to do this for basic stage makeup, it can give your face a more chiseled appearance from a distance. [7] X Research source If you don’t have bronzer on hand, try using a brown eyeshadow. [8] X Research source"
    },
    {
      "title": "Apply blush",
      "content": "Apply blush to your cheeks to accentuate your cheekbones. Use a fluffy brush to apply powdered blush to each cheekbone, starting on the apple of each cheek, which is usually directly under the center of your eyes. Then, sweep the color along your cheekbones and blend out at the hairline to get rid of any harsh lines. Use a blush color that complements your skin tone . Peachy blushes tend to look good on warm undertones, and pinks and roses complement cool undertones."
    },
    {
      "title": "Fill in your eyebrows with a matching brow powder or pencil.",
      "content": "Fill in your eyebrows with a matching brow powder or pencil. Eyebrows can get lost under stage lights, so it’s important to emphasize them. Use a small makeup brush to fill in your natural brows with brow powder that matches the color of your natural brows, or use a matching eyebrow pencil to fill them in. Create a gentle arch at the highest point of your natural brow, which helps to frame your facial features. [9] X Research source If you’re blond, use a light or medium brown pencil or brow powder to fill in your brows to ensure they show up from a distance. To further define your eyebrows, you can apply a white eyeliner or cream directly beneath each eyebrow, which will provide a sharp contrast. Be sure to blend the makeup well so that you don't have a harsh white line. [10] X Research source"
    },
    {
      "title": "Apply neutral eyeshadow to give your eyes dimension.",
      "content": "Apply neutral eyeshadow to give your eyes dimension. Select three shadows: a cream color, a light brown, and a medium to dark brown. Use a makeup brush to apply the medium shade all over both lids and slightly over the crease. Use the lightest color to highlight directly under the eyebrows. Apply the darkest color to your crease and sweep it out to the edge of your sockets. If you need to create a wide-eyed look, skip the darker colors and just use the lightest eyeshadow all over your lids. To make your eyes look smaller, apply only the darkest color from your eyelashes to your crease. You don’t have to use eyeshadow primer before applying eyeshadow, but it can help your eyeshadow last longer."
    },
    {
      "title": "Apply eyeshadow in brighter colors if your role calls for it.",
      "content": "Apply eyeshadow in brighter colors if your role calls for it. Basic stage makeup usually means a neutral eye palette, but if you're playing a dramatic or colorful role, consider using brighter eyeshadow colors instead. Choose a light, medium, and dark variation of the same color and apply the eyeshadow the same way you'd apply neutrals. Blues and greens are good choices for dramatic or colorful characters. For a more sinister vibe, try a deep berry color."
    },
    {
      "title": "Accentuate your eyes with dark brown pencil eyeliner.",
      "content": "Accentuate your eyes with dark brown pencil eyeliner. Start at the inner corner and draw a thin line along your lash line to the outer edge of each eye. Stay as close to the lash line as possible! Then, draw a thin line along your bottom lashes for further definition. Waterproof formulas will hold up the best on stage. For dramatic roles, use thick black eyeliner to accentuate your eyes. Use a liquid liner on your upper lash line if you want more definition."
    },
    {
      "title": "Apply 1-2 coats of dark brown or black mascara to the upper lashes.",
      "content": "Apply 1-2 coats of dark brown or black mascara to the upper lashes. Place the mascara wand at the base of your lashes and sweep up, wiggling the wand slightly as you pull it through your lashes. This helps to coat the lashes as liberally as possible. If you want to emphasize your eyes even more, apply a second coat of mascara to your upper lashes. Use a waterproof formula to prevent your mascara from running on stage. You can also apply false eyelashes if you want your eyes to really pop. [11] X Research source Applying mascara to the lower lashes can make eyes look smaller, so it’s usually best to skip it."
    },
    {
      "title": "Outline your lips with a red or pink lip liner.",
      "content": "Outline your lips with a red or pink lip liner. You don’t need to overdraw your lips! Stick to your natural lip line and outline your mouth with the lip liner. What color you use really depends on your role and your studio’s preference. Pinks usually work best for younger roles, while reds work best for older and more dramatic roles. [12] X Research source Pick the shade that makes the most sense for your specific character."
    },
    {
      "title": "Fill in your lips with a matching lipstick color.",
      "content": "Fill in your lips with a matching lipstick color. Stick to brighter reds and pinks, since darker shades can look black from a distance. Fill in both the top and bottom lips with the lipstick formula of your choice. Look for long-wearing matte formulas. Shiny finishes aren’t recommended for the stage, since the shine can create a glare under stage lights. [13] X Research source Cream formulas work well for dry lips. Liquid matte formulas have great staying power, but can be drying. Choose the lipstick that works best for you! [14] X Expert Source Katya Gudaeva Professional Makeup Artist Expert Interview. 11 April 2019."
    },
    {
      "title": "Mist your face with setting spray or powder to lock your look in place.",
      "content": "Mist your face with setting spray or powder to lock your look in place. Setting sprays can prevent your makeup from melting and running under the hot stage lights. If you don’t have setting spray on hand, give your face another all-over dusting with your loose translucent powder to set your makeup and mattify your face. If you need to, you can also powder your face in between scenes to prolong your stage makeup."
    },
    {
      "title": "Remove your makeup",
      "content": "Remove your makeup after the performance. Don’t forget to remove your makeup after the show, no matter how tired you are! [15] X Expert Source Katya Gudaeva Professional Makeup Artist Expert Interview. 11 April 2019. Cream and oil-based makeup remover formulas tend to work best, but if you have super oily skin, you can use something oil-free. Soak a cotton pad with makeup remover and wipe your face thoroughly until your makeup is gone. Makeup remover wipes work well if you’re on the go. [16] X Research source Sleeping in your makeup can wreak havoc on your skin and cause serious breakouts. [17] X Expert Source Katya Gudaeva Professional Makeup Artist Expert Interview. 11 April 2019."
    },
    {
      "title": "Use a mild cleanser and moisturizer after removing your makeup.",
      "content": "Use a mild cleanser and moisturizer after removing your makeup. Follow up the removal product with a mild cleanser to rinse away any lingering makeup residue. Use warm water and be sure to pat your skin gently with a towel to dry it. Then, apply your favorite moisturizer all over your face to keep your skin looking supple and healthy. If you're prone to acne, consider using an over-the-counter benzoyl peroxide cleanser."
    }
  ]
}