{
  "url": "https://www.wikihow.com/Fix-a-Head-Gasket-With-Engine-Block-Sealer",
  "title": "How to Fix a Head Gasket With Engine Block Sealer",
  "steps": [
    {
      "title": "Check under the oil filler cap.",
      "content": "Check under the oil filler cap. When a head gasket begins to leak, a common symptom that will arise is “mayonnaise” under the oil filler cap. It is called mayonnaise because a film develops on the underside of the oil filler cap that resembles the condiment. A white, creamy buildup on the underside of the oil filler cap is sometimes referred to as “mayonnaise” and indicates a leaking head gasket. A lack of white build up does not necessarily mean the head gasket is not leaking."
    },
    {
      "title": "Look for white smoke in the exhaust.",
      "content": "Look for white smoke in the exhaust. When a head gasket fails, coolant leaks into the cylinders and is burned along with the air and fuel mixture. Burning coolant produces a different color exhaust than the vehicle will produce normally and will appear white or grey instead of the normal dark shades. As the leak in the head gasket grows, the exhaust will become whiter."
    },
    {
      "title": "Drain the oil and look for coolant.",
      "content": "Drain the oil and look for coolant. When changing your oil look at the oil you drained for signs of coolant. A leak in the head gasket will allow coolant to seep into the oil of the vehicle, but coolant and oil are different consistencies so they will naturally separate. [1] X Research source Light swirls in the oil are likely caused by coolant. If there is enough coolant to make out the color, coolant is usually green, orange or pink."
    },
    {
      "title": "Feel and listen for a misfire.",
      "content": "Feel and listen for a misfire. A misfire in your vehicle will feel like a slight to severe vibration that resonates throughout the vehicle. You may notice a shudder in the RPMs in the tachometer that coincides with the vibration. This vibration may be caused by coolant penetrating the cylinders and failing to ignite. [2] X Research source A misfire will often result in the check engine light coming on in your dashboard. A leaking head gasket is one of a number of issues that may cause the check engine light to come on."
    },
    {
      "title": "Use an OBDII scanner.",
      "content": "Use an OBDII scanner. If the check engine light comes on in your vehicle, use an OBDII Code Scanner to check the error code in the engine’s computer. The error code may provide you with an insight into what the issue is with the car. [3] X Research source If the error code indicates a misfire, it may be a result of a bad head gasket. Many auto parts stores will use their OBDII scanner to check your codes for free."
    },
    {
      "title": "Watch the temperature gauge.",
      "content": "Watch the temperature gauge. A bad head gasket will compromise the vehicle’s ability to regulate temperature. If the engine in your vehicle is running hotter than normal or begins to overheat, that may be a symptom of a leaking head gasket. [4] X Research source If your vehicle is overheating, immediately pull over and shut the engine off. Driving an overheating vehicle can cause significant internal damage to the engine and cylinder head."
    },
    {
      "title": "Jack up the vehicle.",
      "content": "Jack up the vehicle. In order to access the low point in the coolant system, you will need to raise the vehicle to a height that allows you to work beneath it. Jack up the vehicle by inserting a jack beneath one of the vehicle’s designated jack points and lifting and pressing or turning the handle. [5] X Research source Once the vehicle is jacked up, place jack stands beneath it to support the weight. If you are unsure of where to find the designated jack points for your vehicle, refer to the owner’s manual. Never work on a vehicle supported only by a jack."
    },
    {
      "title": "Place a container beneath the radiator.",
      "content": "Place a container beneath the radiator. You’ll need a container that is large enough to catch all of fluids you drain from the coolant system of the vehicle twice over. If you do not have a container that is large enough, choose a bucket that is large enough to hold the capacity of the coolant system once, then pour it into a container you can seal before draining the system into the bucket a second time. [6] X Research source Place the container beneath the radiator on the end with the petcock. Refer to your vehicle’s service manual to determine the coolant capacity you will need to keep in a container."
    },
    {
      "title": "Open the petcock on the radiator.",
      "content": "Open the petcock on the radiator. Use a wrench to open the petcock on the bottom of the radiator to drain the coolant and water out of the coolant system and into your container. Allow it to drain completely before closing the petcock again. [7] X Research source Be careful not to allow any of the coolant to leak from the container as it is bad for the environment. Opening the radiator cap will allow the system to drain quicker."
    },
    {
      "title": "Close the petcock and fill the radiator with water.",
      "content": "Close the petcock and fill the radiator with water. Once the coolant system is empty, use the same wrench to close the petcock securely. With the petcock closed, refill the coolant system with water only by opening the radiator cap and pouring it in. [8] X Research source If the radiator cap appears to be severely worn or damaged, you should replace it by purchasing a new one at your local auto parts store. Check in the service manual for your vehicle if you are unable to locate the radiator cap."
    },
    {
      "title": "Disconnect the thermostat.",
      "content": "Disconnect the thermostat. The thermostat in your vehicle helps maintain operating temperature by opening to allow the coolant to pass through the radiator and be cooled by air flow when it becomes too hot. Disconnect the thermostat to prevent it from engaging as you add the sealant. [9] X Research source Disconnect the line leading to the top of the thermostat. Check the service manual for your specific vehicle to help you find the thermostat if you are unsure."
    },
    {
      "title": "Start the vehicle with the heater on high.",
      "content": "Start the vehicle with the heater on high. Once you have refilled the system with water, start the vehicle again to cycle the water through the coolant system so you can flush the remainder of the coolant out when you drain it. [10] X Research source Allow the vehicle to run for ten minutes or so. Keep an eye on the temperature gauge and turn the vehicle off immediately if it begins to overheat."
    },
    {
      "title": "Open the petcock to drain the water.",
      "content": "Open the petcock to drain the water. Once the water has had an opportunity to run through the coolant system, reopen the petcock and drain the water into a container as well. Allow it to drain completely before closing the petcock again. [11] X Research source This is the same process you would use to drain and flush your coolant system. The water will flush out the coolant that was elsewhere in the coolant system the first time you drained it. Reconnect the thermostat during this step."
    },
    {
      "title": "Fill the coolant system with a water and coolant mix.",
      "content": "Fill the coolant system with a water and coolant mix. Refill the coolant system with a 50/50 mixture of coolant and water. Ask the clerk at your local auto parts store to help you determine which coolant is the appropriate kind for your specific vehicle. You can purchase pre-mixed coolant and water, or you may choose to mix it yourself. Add coolant through the radiator cap and give it a minute to drain into the system, then continue to add more until you reach the coolant capacity."
    },
    {
      "title": "Pour in the head gasket sealer.",
      "content": "Pour in the head gasket sealer. Pour the head gasket sealer into the open radiator cap. Read the instructions on the specific brand you purchased for instructions that may be unique to the type of head gasket sealer you chose. You can usually simply pour the sealer into the radiator cap along with the coolant and water."
    },
    {
      "title": "Drive the vehicle for fifteen to twenty minutes.",
      "content": "Drive the vehicle for fifteen to twenty minutes. The sealer will need to travel throughout the coolant system in order to reach the head gasket. Start the motor and allow it to run or drive the vehicle for fifteen or twenty minutes to allow the sealer to travel throughout the system. Again, if the vehicle begins to overheat, stop the engine immediately. After fifteen to twenty minutes, stop the vehicle and allow it to sit for a few hours."
    },
    {
      "title": "Re-evaluate the state of the vehicle’s head gasket.",
      "content": "Re-evaluate the state of the vehicle’s head gasket. Re-evaluate the head gasket leak in your vehicle using the same qualifications you used to determine there was an issue in the first place. A head gasket sealer can be a fairly permanent solution in some situations, while it may fail to solve the problem at all in some others. Keep an eye out for the symptoms of a leaking head gasket after using a head gasket sealer. Having the head gasket replaced is the only truly permanent solution to a leaking head gasket."
    }
  ]
}