{
  "url": "https://www.wikihow.com/Embroider-a-Shirt",
  "title": "The Best Way to Hand Embroider Clothing",
  "steps": [
    {
      "title": "Draw a design on a piece of paper.",
      "content": "Draw a design on a piece of paper. Get creative with your design! Maybe you decide to embroider some flowers on the pocket of a shirt or spell out an inspiring word like “courage” or “hope” in the middle. No matter your design, make sure it’s sketched darkly enough so you can see it. [1] X Research source If drawing isn’t your thing, no worries! Make your design on the computer or find an image online and print out a template. [2] X Research source"
    },
    {
      "title": "Trim away any excess paper around your design with scissors.",
      "content": "Trim away any excess paper around your design with scissors. Get as close to the design as possible. This will make it easier to transfer your template onto your fabric or stabilizer. [3] X Research source"
    },
    {
      "title": "Trace your design on a removable stabilizer that sticks to fabric.",
      "content": "Trace your design on a removable stabilizer that sticks to fabric. First, stick the stabilizer on the shirt where you’d like the design to go. Then, lay a piece of carbon paper over the stabilizer. Next, set your paper template on top of the carbon paper and gently retrace your design. [4] X Research source Using a stabilizer is the best way to ensure your stitches won’t deform or lift off your shirt. [5] X Research source Stabilizers come in many different forms. Some go on the underside of the fabric, some can be stuck on the front, and some even come with built-in designs. Because of the many types, make sure to follow your stabilizer’s instructions carefully. Try drawing directly on the fabric with an erasable fabric marker and using a stabilizer that goes on the underside of the fabric. [6] X Research source"
    },
    {
      "title": "Use an embroidery hoop so your stitches stay flush to the fabric.",
      "content": "Use an embroidery hoop so your stitches stay flush to the fabric. Unscrew the hoop, and place the smallest hoop on the underside of your fabric and the larger hoop on top. Screw the hoop back together until the fabric is taut and bouncy inside the hoop. [7] X Research source If you don’t have an embroidery hoop, use a couple of straight pins to secure a paper template in place. Try putting on the shirt before placing your template on the fabric to make sure the design goes exactly where you’d like it."
    },
    {
      "title": "Slide embroidery floss through your needle and knot the end.",
      "content": "Slide embroidery floss through your needle and knot the end . It’s always better to use more embroidery floss than you think you’ll need. Start by using a piece of thread the same length as your arm. Fold the floss in half and slip the ends through the needle. Tie one end of the floss with a triple knot. [8] X Research source For a wider design, triple the length of floss so you can double back on your stitches. A string of embroidery floss typically has 6 strands. The fewer strands you use, the more delicate the design; the more strands you use, the thicker the outline will be. [9] X Research source"
    },
    {
      "title": "Bring the needle up through the underside of the fabric.",
      "content": "Bring the needle up through the underside of the fabric. Start at a point or edge of your design. Line your needle up with your design from the inside of the shirt. Then, pierce through the fabric and stabilizer and pull the floss taut to start hand embroidering . [10] X Research source"
    },
    {
      "title": "Trace your design with basic embroidery stitches.",
      "content": "Trace your design with basic embroidery stitches. Use your sketched or printed design as your guide, making stitches along the outline. Here are some beginner-friendly stitches you can try: Simple stitch: Bring the needle up through one side of the fabric and down through the other. Straight stitch (running stitch): Push the needle through 1 side and back through the other, leaving a tiny space between each stitch to make a dashed line. [11] X Research source Back stitch: Make a simple stitch, and then skip the length of the first stitch to make the second. Go back to attach the second stitch to the first to create a solid line. [12] X Research source Split stitch: Create a simple stitch, and then push the needle through the middle of the stitch, making a braided line. [13] X Research source Try practicing these stitches on a scrap piece of fabric before embroidering your shirt if you’re a beginner."
    },
    {
      "title": "Use satin stitch to color in empty space.",
      "content": "Use satin stitch to color in empty space. Bring the needle up through the fabric and back down at the opposite end of the outline to make a straight stitch. Then, bring the needle back up as close to the last stitch as possible. Continue stitching until the desired area of your design is completely filled in. [14] X Research source This step is optional but can add depth and dimension to your design, especially if you want your design to be a complete image rather than an outline."
    },
    {
      "title": "Slip your needle under a stitch to end your stitching.",
      "content": "Slip your needle under a stitch to end your stitching . Pull back the fabric of your shirt to see the underside of your stitches. Pull your needle halfway through a stitch. Loop thread around your needle twice (while it’s still hooked under the stitch), and then pull the needle through to form a knot. [15] X Research source Keeping the knot on the underside of the fabric ensures that it won’t be seen within your design. If you’re using more than one floss color, do this before stitching with a new color."
    },
    {
      "title": "Cut leftover thread away from the knot using a pair of scissors.",
      "content": "Cut leftover thread away from the knot using a pair of scissors. Try to get as close to the knot as possible. [16] X Research source For extra security, dab some fabric glue on the knot to keep it from unraveling over time."
    },
    {
      "title": "Unscrew the hoop and take it off of the fabric.",
      "content": "Unscrew the hoop and take it off of the fabric. Then, if you used a stabilizer to transfer your design, carefully remove it from your stitching following the product’s instructions. [17] X Research source Once everything is removed from your fabric, you’re ready to wear and rock your embroidered shirt! Most stabilizers can be cut or washed away, depending on the type. Use scissors to trim away access cut-away stabilizer as close to the stitching as possible. Spray water-soluble stabilizer with water and pick off the excess or throw it in the wash."
    }
  ]
}