{
  "url": "https://www.wikihow.com/Add-Notes-in-Gmail",
  "title": "How to Add Notes in Gmail",
  "steps": [
    {
      "title": "Log into your Gmail email account using your email address and password.",
      "content": "Log into your Gmail email account using your email address and password. You can use any web browser to do this. In this method, you'll create a new label and filter for notes that only work for new emails. With this method, you will not be able to take notes on existing emails or send notes in reply to an email."
    },
    {
      "title": "Create a new label.",
      "content": "Create a new label. Navigate to Settings (it looks like a gear icon), click See all settings , click the Label tab, then click Create new label . You'll see the \"Create new label\" button under the \"Labels\" heading towards the bottom of the page."
    },
    {
      "title": "Name your new label then click Create.",
      "content": "Name your new label then click Create . Since this is a label you'll be using for notes, you might want to pick something like “Notes.”"
    },
    {
      "title": "Create a new filter.",
      "content": "Create a new filter. Click on the Filters and Blocked Addresses tab and select Create a new filter , which you'll see at the bottom of the page."
    },
    {
      "title": "Address the filter then click Create filter.",
      "content": "Address the filter then click Create filter . In the “To:” section of the new filter, insert your Gmail name followed by \"+Notes@gmail.com.\"For example, you'd enter Jane+Notes@gmail.com. When you click Create filter , you'll see another pop-up window."
    },
    {
      "title": "Click the box next to “Apply the label” and then select the new label Notes.",
      "content": "Click the box next to “Apply the label” and then select the new label Notes . This means that when you use this filter, for every email that matches the \"To: Jane+Notes@gmail.com\" sender, the new label will be applied. Click Create filter to continue."
    },
    {
      "title": "Test your “Note” feature.",
      "content": "Test your “Note” feature. To ensure you’ve set it up correctly, send an email to the new email address you just created (jane+notes@gmail.com). You will know it was been sent correctly if the note arrives in your inbox.\\ Use notes sent in Gmail to remind yourself about daily, weekly or monthly events in your calendar. You can send notes to yourself using any email address (not just your Gmail address)."
    },
    {
      "title": "Use third-party alternatives.",
      "content": "Use third-party alternatives. There are plenty of extensions and services that claim to do this for you. You can get third-party apps like Simple Gmail Notes, Right Inbox, Boomerang, or Slack for Gmail. All you need to do is search for Gmail note extensions to find a few, but not all of the third-party apps are trustworthy. Many of these Gmail extensions offer you features so you can highlight or take notes on existing emails. You can also use Google Keep, which is another Google service that offers note-taking productivity."
    }
  ]
}