{
  "url": "https://www.wikihow.com/Introduce-Friends-to-Other-Friends",
  "title": "How to Introduce Friends to Other Friends",
  "steps": [
    {
      "title": "Bring your friends together.",
      "content": "Bring your friends together. If you are at a party or some social gathering, bring your two friends together so that they can physically meet each other. You can have one friend stay put while you track down the other one, or have one friend come with you while you look for the other one. Regardless, try to take them to a place where you are able to introduce them. [1] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source If one friend is being hesitant, say something like “I really want you to meet my friend Bob. He's the biggest Wings fan I know” or “I'm going to introduce you to this person that I think you'll like.”"
    },
    {
      "title": "Make the necessary introductions.",
      "content": "Make the necessary introductions . Once you have brought your friends together, introduce them to each other. You can choose to do the introduction and say their names, or let them do the introduction. However, it may be less awkward and more formal if you do the introduction. [2] X Trustworthy Source Pew Research Center Nonpartisan thinktank conducting research and providing information on public opinion, demographic trends, and social trends Go to source Say something like “Bob, this is Barnaby Smith. Barnaby, this is Bob Robertson.” Use someone's full formal name when making an introduction unless they prefer a nickname."
    },
    {
      "title": "State why you wanted to introduce these two people.",
      "content": "State why you wanted to introduce these two people. Your friends will likely be curious about why you thought it necessary to introduce them to each other. You should explain your reason and let them know why you thought they would be friends. This is helpful because it gives them a point of commonality and an easy starting point for a conversation. [3] X Research source Say something like “I thought I'd introduce you to each other because you are such big fans of the TV show Wings” or “you're both new to town so I thought I'd introduce you to each other.”"
    },
    {
      "title": "Stick around and facilitate the conversation.",
      "content": "Stick around and facilitate the conversation . Once you do the initial introduction and explanation, stick around to keep the conversation going . Meeting new people can be awkward, so you should stay and keep the conversation from fizzling out. If it slows down, mention other things that your friends have in common. [4] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Unless your two friends really hit it off and strike up a good conversation, do not leave right away. Be sure to stick around and nurse the friendship that you are trying to create."
    },
    {
      "title": "Suggest something for everyone to do together.",
      "content": "Suggest something for everyone to do together. One way to have your friends meet is to invite both of them to something that you know that they will like. If both of your friends are into basketball, set up a pickup game and invite both of them. If they like music, go to a show and invite them both. If you organize something ahead of time, it is harder for your friends to bail."
    },
    {
      "title": "Organize a social get-together.",
      "content": "Organize a social get-together. An easy way to get your friends to meet is by hosting a party and inviting both of them. If they both show up, introduce them to each other. This takes the pressure off the introduction and, if your friends do not get along, there are other people around for them to talk with. This way you are not stuck awkwardly doing some activity with two people who do not like each other. As a rule of thumb, be sure to invite people to the party that both friends know. If one friend does not know many people, this can be an opportunity for them to expand their social circle."
    },
    {
      "title": "Set up a friendship blind date.",
      "content": "Set up a friendship blind date. Although you would normally want to be around to facilitate a friendship, it may be easier to arrange for your friends to meet each other without you. Make a time for them to meet at a public place like a bar or coffee shop. Tell them what the other one looks like so that they will be able to identify each other. [5] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source You could also give your friends each other's contact information and let them set up a friend date. In general, try to introduce your friends in person. This will keep the situation from getting too awkward."
    },
    {
      "title": "Let your friends know you are setting them up.",
      "content": "Let your friends know you are setting them up. Before you introduce your friends, let them know that you have a friend that they should meet. Try not to spring it on them or trick them into meeting each other. This will more than likely make the situation more awkward. Foreshadow the introduction a little and tell each friend that you have another friend that they should meet. [6] X Research source Say something like “Bob, you have to meet my friend Barnaby. I think he likes Wings as much as you do” or “Barnaby, I'm going to introduce you to my friend Bob. You two are the only people I know who watch Wings every day.” Make sure to treat both of your friends equally. If you're showing the guy pictures of the girl, then you should also show the girl pictures of the guy."
    },
    {
      "title": "Avoid gossiping",
      "content": "Avoid gossiping . If you introduce two friends, avoid gossiping with them about the other person. If your goal is to create a budding friendship, talking behind each other's backs will quickly put an end to that. Instead of having two friends who are pals, you may find that you have no friends. [7] X Research source"
    },
    {
      "title": "Let it go if they do not like each other.",
      "content": "Let it go if they do not like each other. If your friends do not hit it off, you need to move on. You cannot take it personally. It is not your fault that a friendship did not blossom. Sometimes, people, who in theory should get along, simply do not like each other. [8] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Do not push it if they do not become friends. No one likes being bullied or forced into a relationship."
    },
    {
      "title": "Take it easy if they become best friends.",
      "content": "Take it easy if they become best friends. On the flip side, you may find that your friends become closer to each other than with you. This can be painful because you may feel like you are left out or that they betrayed your initial kindness of introducing them. If this happens, try not to take it personally. It has more to do with them and their budding friendship than it does with you. In addition, they may come back around and start hanging out with you again once their friendship cools a little. [9] X Research source Avoid being territorial or mean to your friends. This will only ensure that they exclude you."
    }
  ]
}