{
  "url": "https://www.wikihow.com/FaceTime-Unavailable",
  "title": "Facetime Unavailable? Here’s What It Means & How to Fix It",
  "steps": [
    {
      "title": "FaceTime needs a cellular connection or Wi-Fi to work.",
      "content": "FaceTime needs a cellular connection or Wi-Fi to work. If either of these connections are poor on either end, FaceTime may not connect properly. You may also experience choppy video and audio, connection alerts, black screens, and dropped calls. [1] X Research source In this case, try to troubleshoot your Internet or go to a place with better signal for your cellular connection. If you're using cellular, make sure cellular data is enabled for FaceTime. Go to Settings → Cellular or Mobile Data → toggle on FaceTime ."
    },
    {
      "title": "You may see \"Unavailable\" if the recipient declined.",
      "content": "You may see \"Unavailable\" if the recipient declined. When you FaceTime someone, it will ring similarly to a regular phone call. If the recipient decides to decline, or if they don't accept within the timeframe, your FaceTime won't start. With the newest update , you can now leave a video or audio message if someone doesn't answer a call—similar to a voicemail . [2] X Research source"
    },
    {
      "title": "If FaceTime is disabled on either device, you won't be able to use it.",
      "content": "If FaceTime is disabled on either device, you won't be able to use it. You can easily check this in your settings. Do the following: Go to Settings → FaceTime → make sure FaceTime is toggled on."
    },
    {
      "title": "When you're blocked, you won't be able to send FaceTime calls.",
      "content": "When you're blocked, you won't be able to send FaceTime calls. This also applies to texts through Messages and calls through the Phone app. If you suspect you've been blocked , you may not have received replies through these apps either."
    },
    {
      "title": "Updates provide common fixes.",
      "content": "Updates provide common fixes. Keeping your device up-to-date can help you avoid software issues that impact apps such as FaceTime. On iOS, go to Settings → General → Software Update → Download and Install . On Mac, click the Apple menu. Click System Settings/Preferences → General → Software Update ."
    },
    {
      "title": "Turn your device off and on again.",
      "content": "Turn your device off and on again. Sometimes, a simple restart can fix basic issues. If you're using an iPhone , press and hold the Volume Up button and Power button at the same time. Swipe to power off. Wait at least thirty seconds, and then power it on again. On iPhones with a home button, press and hold the side button. Slide to power off. On iPads with a home button, press and hold the top button. Slide to power off. On other iPad models , press and hold the top button and either volume button. Slide to power off. On Mac, click the Apple menu and select Restart . [3] X Research source"
    },
    {
      "title": "Disable any active VPN services.",
      "content": "Disable any active VPN services. Since FaceTime isn't available in all countries or regions, a VPN (Virtual Private Network) may interfere with your connection. If you have one active, disable it temporarily to use FaceTime. Once you have finished the call, you can turn it back on."
    },
    {
      "title": "Check the Apple website for outages.",
      "content": "Check the Apple website for outages. When everything is working correctly, you'll see \"All services are operating normally.\" Otherwise, click + to expand the services and check FaceTime ."
    }
  ]
}