{
  "url": "https://www.wikihow.com/Scan-Your-Credit-Card-with-Your-iPhone",
  "title": "How to Scan Your Credit Card with Your iPhone",
  "steps": [
    {
      "title": "Launch Settings.",
      "content": "Launch Settings. Locate the Settings application on your device (gear icon). Tap on it to launch it."
    },
    {
      "title": "Go to Safari.",
      "content": "Go to Safari. The Settings menu will open where you can configure the settings for your device. Scroll down the options, and tap “Safari.” to open the settings for the Safari app."
    },
    {
      "title": "Select “Password and AutoFill.”",
      "content": "Select “Password and AutoFill.” It is located on the General section of the Safari menu, near the top of your screen."
    },
    {
      "title": "Open the Saved Credits Card menu.",
      "content": "Open the Saved Credits Card menu. The “Saved Credit Cards” option is at the bottom of the list menu. Tapping it should display all the credit cards you have linked to your iOS. If this your first time, this screen should be blank except for one option."
    },
    {
      "title": "Add a credit card.",
      "content": "Add a credit card. An “Add Credit Card” option will be at the top of your screen. Tap on it to begin added your credit card."
    },
    {
      "title": "Use the camera.",
      "content": "Use the camera. You will see “Use Camera” option at the top of your screen, above the Card Details fields. Tap on it, and your device’s Camera will open."
    },
    {
      "title": "Scan the credit card.",
      "content": "Scan the credit card. You will see a frame in the Camera screen. Position your credit card within the frame, and your device will automatically scan it. Once the credit card is scanned, it will fill in the credit card details in the menu with the scanned information."
    },
    {
      "title": "Save the card.",
      "content": "Save the card. Once you’re finished, tap the “Done” button located at the top right of the screen. It will save your credit card details on your device. If you want to add more credit cards, just repeat the steps by opening the Camera in the “Add Credit Card” menu."
    },
    {
      "title": "Open an online store using Safari.",
      "content": "Open an online store using Safari. You can use the scan function only while making a purchase on Safari."
    },
    {
      "title": "Place your order.",
      "content": "Place your order. Shop in the online store and place the items want to buy in your cart. Press the “Proceed to Checkout” button, usually located at the top of the screen."
    },
    {
      "title": "Add a new payment method.",
      "content": "Add a new payment method. Most online stores will give you the option to add a new payment method during Checkout. Tap the option, usually located at the top, to continue."
    },
    {
      "title": "Add your credit card.",
      "content": "Add your credit card. On the next screen, tap the “Name on card” field, located on the middle of your screen. When you tap on it to enter your name, you will see a new option, “Scan Credit Card,” located above your keyboard. Tap on it to scan your Credit Card."
    },
    {
      "title": "Scan your credit card.",
      "content": "Scan your credit card. When you tap the scan option, it will automatically start your device’s Camera. Position your credit card within the frame in the Camera screen, and your iOS device will begin scanning. It will immediately fill out the credit card details fields in the Checkout page. Once you’ve scanned your credit card, you can proceed with checking out."
    }
  ]
}