{
  "url": "https://www.wikihow.com/Administer-Eye-Drops",
  "title": "How to Administer Eye Drops",
  "steps": [
    {
      "title": "Always read the label.",
      "content": "Always read the label. Not all eye drops are manufactured the same. Manufacturers will specify safety tips and requirements for their products. Check the label for: Expiration date . Never use eye drops beyond the expiration date. Expired eye drops can irritate your eyes and cause infection or changes in vision. Storage instructions . Generally, eye drops should be stored in a cool, dry place where they are not exposed to sunlight. Follow the required temperature and storage instructions for your eye drops. Never store the eye drops in a freezer. For those who live in the tropics, it is advisable to store eye drops in the refrigerator unless it is not allowed as specified in the label. This comes with a bonus! Cold eye drops provide a more soothing and refreshing effect when applied."
    },
    {
      "title": "Inspect the eye drops bottle and contents properly.",
      "content": "Inspect the eye drops bottle and contents properly. Double-check the consistency of the eye drops. Discard the eye drops if they look suspicious, have turned cloudy, or have changed color. Verify that the dropper tip is not cracked or chipped. Damaged dropper tips will cause injury if it accidentally comes in contact with the eyes. It may also dispense micro fragments that could irritate the eye. [1] X Research source This solution should be isotone and isohydric with the lacrimal fluid [2] X Research source . If this condition is not met, the eye will be irritated and this can lead to corneal alterations, blurry vision, or even permanent eye damage. This means that the eye drops must have similar physico-chemical characteristics with the lacrimal fluid's characteristics. As a general rule when it comes to eye drops: Discard when in doubt."
    },
    {
      "title": "Practice good hygiene.",
      "content": "Practice good hygiene. Always wash your hands before applying eye drops. Dirty hands may contaminate the eye drops or the eye itself with contact. Hand washing is your best defense against germs. Always use soap and water. To wash your hands effectively: [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Work the soap into a lather on hands, wrists, and skin just before the forearm. Rub the palms against each other and then with the fingers interlaced. Overlap the right palm on the back of the left hand with the fingers interlaced. Repeat with the left palm over the back of the right hand. Rub the back of the fingers against the opposing palms in a twisting motion while the tip and half of the fingers are interlocked. Cup the right hand and rub it in a circular way against the left palm for at least 5 times. Do the same with the left hand. Enclose and rub each finger (one by one) of the left hand with your right hand in a gentle, milking manner. Repeat for the right hand. The duration of handwashing should be equivalent to at least 2 full “happy birthday” songs. Rinse thoroughly with water and dry with a clean towel."
    },
    {
      "title": "For contact lens users, remove them prior to use[4] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source .",
      "content": "For contact lens users, remove them prior to use [4] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source . Contact lenses are barriers to proper absorption of eye drops. Place them in your solution in their container and replace them when the eye drops have fully infused into your eyes. It's best to wait for 15 minutes before wearing them again. The contact lens may cause irritation or inhibit eye drop absorption if applied immediately. [5] X Research source You don’t need to remove your contacts if you’re using lubricating eye drops during the day to relieve dryness."
    },
    {
      "title": "Remove the cap.",
      "content": "Remove the cap. Place the cap sideways on a flat surface or hold it with a clean hand. This avoids contamination of the cap with germs. Never place the cap on a surface with the tip pointing up. This exposes the inside of the cap to potentially harmful bacteria. Avoid hand, finger, or skin contact with the dropper tip. This prevents bacteria from polluting the eye drops content and dropper tip. The drops must be sterile. This means that they must not have been in contact with anything before putting them inside your conjunctival sac (tear duct). This is very important because the eye is a very sensitive organ where an infection can develop quickly, leading to serious damage."
    },
    {
      "title": "Tilt your head back and look up towards the ceiling[6] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source .",
      "content": "Tilt your head back and look up towards the ceiling [6] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source . Tilting the head back prevents the eye drops from spilling out. Pull down the lower lid of your eye with the index finger of the non-dominant hand to form a v-pocket in the lower eyelid. The v-pocket is the area that accommodates the eye drop. Hold the eye drop (with the tip pointing down) with your dominant hand. The dropper tip should always be a few centimeters away from the eye. Looking up will prevent excessive movement of the eyeball, which could cause leakage of eye drops. The dominant hand is more stable in holding the eye drop bottle. You will also find it easier to squeeze the eye drop bottle with your dominant hand."
    },
    {
      "title": "Gently squeeze the eye drop bottle over your eye with your dominant hand[7] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source .",
      "content": "Gently squeeze the eye drop bottle over your eye with your dominant hand [7] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source . Make sure only a single drop enters the v-pocket. Be sure not to touch your eye; the dropper tip may injure the eye if it comes into contact with the eye's surface. Multiple drops are not advisable because the second drop almost always is wasted as it spills into the skin. Moreover, there will be poor absorption with multiple drops [8] X Research source ."
    },
    {
      "title": "Let go of your lower eyelid.",
      "content": "Let go of your lower eyelid. This will seal the v-pocket the drops went into. Close your eyelid and gently dab excess fluid with a tissue. Do not use your hands to dab excess fluid as doing so may induce infection or irritation [9] X Research source . A clean towel will also work, but a tissue will be easier to use and is likely more hygienic [10] X Research source ."
    },
    {
      "title": "Close your eyes for 5 minutes and resist blinking[11] X Research source .",
      "content": "Close your eyes for 5 minutes and resist blinking [11] X Research source . Gently press the index finger against the round-shaped sac (your tear duct) in the inner corner of the eye. This can be located at the junction of the eye and bridge of the nose. It takes 5 minutes to facilitate proper absorption of a single eye drop. Blinking may wring out the medicine away from the eye into the skin of the lower eyelids. [12] X Research source Pressing against the round-shaped sac gently will close the connection between the eyes and the nose. This ensures that the drop will not be wasted by draining into the nose. If more than one drop is necessary, you can apply the next drop after 5 minutes elapses. This is especially important if you're using more than one type of eye drop as they should not be mixed. [13] X Research source"
    },
    {
      "title": "Return the cap and seal the eye drop tightly.",
      "content": "Return the cap and seal the eye drop tightly. Repeat for the other eye if necessary. Store it in its proper storage place after use. Wash your hands immediately after eye drop application to remove medication from the hands. When you're finished, perform the handwashing technique described above. If you are using an eye drop and an ointment, apply the ointment second [14] X Research source . The oil in the ointment solution will trap the eye drop and reduce its effectiveness and absorption."
    },
    {
      "title": "Handle any accidents calmly.",
      "content": "Handle any accidents calmly. If you are not very careful and a larger quantity of drops than required touches your eye, you should immediately wash it with water. No harm will be done. Keep the following protocol in mind: If you touch your cornea, you should immediately consult an ophthalmologist because it increases the risk of complications like an infection [15] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source . If you touch the eye-dropper, you should change it with a new one to limit the risk of getting an infection [16] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source . If your vision is very blurry after you use the drug prescribed for the first time, you should call your doctor and tell him this. You might be allergic to that substance. If your eye function does not improve after a few days, call your ophthalmologist. He might suggest a change in your treatment."
    },
    {
      "title": "Know the various types of eye drops.",
      "content": "Know the various types of eye drops. Eye drops are drugs designed for local or topical use, just for the eye. They can be solutions (liquids that contain at least two soluble substances), suspensions (liquids that contain particles in a solvent, that are not dissolving), or emulsions (liquids in which we have at least two non-miscible components) [17] X Research source . They are mostly prescribed by your general practitioner or ophthalmologist after a thorough clinical exam; despite this, some of these drugs can be procured very easily from a pharmacy without a doctor's prescription (they are called OTCs - Over-The-Counter drugs). They are available for the most common ophthalmic affections, like allergies, conjunctivitis, and so on."
    },
    {
      "title": "Know when eye drops are useful.",
      "content": "Know when eye drops are useful. There are a number of different reasons a person may need eye drops. Here are some of the most common issues: For treating different conditions such as conjunctivitis, or pink eye. They can contain antibiotics, NSAIDs (Non-Steroidal Anti-inflammatory drugs) that fight inflammation found in specific infections [18] X Research source . For allergic conjunctivitis along with oral allergy medications, cool compresses, and allergen avoidance [19] X Research source . For glaucoma or increased eye pressure. [20] X Research source For diagnosing ophthalmic problems. It is known that before an ophthalmological exam, the doctor might put some eye drops in your conjunctival sac [21] X Research source for a better view of some components of the eye. There are drugs that can cause an increase in the diameter of the pupil (mydriatic drops, like Homatropine) [22] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source or decrease the pupil diameter (miotic drugs, like Pilocarpine) [23] X Research source . Another common way eye drops are used is lubricating contact lenses and avoiding eye irritation [24] X Research source ."
    },
    {
      "title": "Know why eye drops are effective.",
      "content": "Know why eye drops are effective. This type of administration is very useful when a local effect on the eye is needed, not a systemic effect. Using these, you can get a smaller concentration of the main active substance and obtain a high local concentration within the eye tissue; this is one of the greatest advantages of this form of administration. In other words, eye drops get right to the source. Another very important quality of this type of drug is that they institute their effect very quickly due to excellent absorption rates [25] X Research source ; this appears because the eye is an organ that has a rich lymphatic capillary network which communicates on the whole surface of the eye [26] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source ."
    }
  ]
}