{
  "url": "https://www.wikihow.com/Get-over-a-Crush-on-a-Married-Coworker",
  "title": "Getting over a Crush on a Married Coworker: 12 Ways to Deal with Your Feelings",
  "steps": [
    {
      "title": "Use this as an opportunity to learn about yourself.",
      "content": "Use this as an opportunity to learn about yourself. For example, if your coworker has a lot of qualities you admire, look at your crush on them as a way to understand what you’d want in a future romantic partner. [1] X Research source Or, ask yourself if there’s some other reason behind your crush. For instance, are you attracted to unattainable people because it feels safer than going after someone you could actually have a relationship with? [2] X Research source Once you identify some of the reasons you’re so drawn to your coworker, think about possible solutions. For instance, you might look for people with similar personalities to date, or try to deal with any underlying insecurities or needs that might be triggering your attraction."
    },
    {
      "title": "Focus on activities that you find fun and fulfilling.",
      "content": "Focus on activities that you find fun and fulfilling. [3] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. When you have a crush on someone, it can be hard to think about anything else. Next time you find yourself pining over your coworker, look for a way to redirect your attention. [4] X Research source [v160969_b01]. 10 February 2021. For instance, you might work on a hobby you love, watch a fun movie, or pick up the phone and call a friend. Doing things you love can also help you avoid less healthy ways of coping with your frustrations, like emotional eating or obsessing over your crush’s posts on social media. [5] X Research source"
    },
    {
      "title": "Make an effort to meet new friends.",
      "content": "Make an effort to meet new friends. Meeting other people—or spending more time with friends and loved ones you already know—could help take your mind off your crush. [6] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. Plus, if you’re in the market for romance, putting yourself out there could make it easier to find someone who is actually available! [7] X Research source [v160969_b01]. 10 February 2021. For instance, you might try: Joining a club or volunteer group for people who share your interests. Taking a class at a local college or community center. Making more time for fun activities with your friends, family, or other coworkers. Signing up for a dating app or going to meetups for singles in your area."
    },
    {
      "title": "It’s common to have unwanted sexual or romantic thoughts.",
      "content": "It’s common to have unwanted sexual or romantic thoughts. You might find yourself thinking or fantasizing about your crush without meaning to. [8] X Research source If this happens, don’t try to fight the thoughts or push them away—that will just make you obsess over them even more. Instead, simply notice the thoughts and let them happen without judging them or yourself. Eventually, the thought will pass on its own and your mind will move on to other things. [9] X Research source It can be helpful to label these thoughts when you notice them. For example, try saying to yourself, “I’m having unwanted thoughts about my work crush again.” This takes a lot of practice and patience, so try not to get frustrated if you keep having these thoughts. The point isn’t to make them go away, but to help them feel less overwhelming when they do happen."
    },
    {
      "title": "Calming activities can help relieve anxiety about your crush.",
      "content": "Calming activities can help relieve anxiety about your crush. Being in love with someone you can’t be with is incredibly stressful. If you’re upset by unwanted thoughts about your crush, take a moment to ground yourself by doing something relaxing, such as meditating or doing deep breathing exercises. You could also try: [10] X Research source Writing down your thoughts and feelings in a journal. Once they’re out on paper, they may feel less overwhelming and urgent. You could even write a note to your crush, then destroy it. Doing a visualization exercise. For example, imagine that you are resting in the middle of a peaceful meadow, looking up at the sky. If you notice an unwanted thought, simply allow it to drift by, like a cloud. [11] X Research source Exercising or doing light stretches. This is not only great for stress relief, but it can also boost your confidence and give you something else to focus on aside from your crush."
    },
    {
      "title": "Look at your feelings as a strength, not a weakness.",
      "content": "Look at your feelings as a strength, not a weakness. Having the capacity to fall in love with another person is a beautiful thing—even if you can’t actually act on it. [12] X Research source [v160969_b01]. 10 February 2021. Don’t beat yourself up for having these unwanted feelings. Instead, reflect on the fact that you’re a person who has a lot of love to give, and remind yourself that you deserve to be with someone who can love you back! Treat yourself the same way you would treat your best friend if they were in the same situation. Be patient as you work through your feelings, and try not to judge yourself harshly. [13] X Research source"
    },
    {
      "title": "Remember that what you’re feeling is only temporary.",
      "content": "Remember that what you’re feeling is only temporary. You might feel like you’re going to be heartsick over your crush forever, but that’s not actually true. [14] X Research source [v160969_b01]. 10 February 2021. When your feelings seem overwhelming, give yourself permission to feel them—but reassure yourself that they will eventually change. [15] X Research source Be patient with yourself and do your best to ride it out. When you have feelings for someone you see every day, like a coworker, it can take longer for those feelings to fade. Even so, as long as you don’t act on your crush, you will start to move on eventually."
    },
    {
      "title": "Check your company’s policy on work relationships.",
      "content": "Check your company’s policy on work relationships. Married or not, getting involved with a coworker can make things complicated. If you feel tempted to make a move, ask yourself what a relationship with your coworker could mean for your job. If your work is really important to you, focusing on the downsides could help put things in perspective. [16] X Research source [v160969_b01]. 10 February 2021. For instance, some companies have a strict policy against dating among employees. If that’s true at your job, ask yourself if you’d really want to risk getting in trouble with your supervisors by acting on your feelings. Even if your company has a relaxed policy on office romances, think about other potential consequences. Would it create tension with other coworkers? How would you handle the office gossip?"
    },
    {
      "title": "Thinking through the consequences might help reduce temptation.",
      "content": "Thinking through the consequences might help reduce temptation. Allow yourself a little time to think about how a relationship with your coworker would look. If you’re already friends, how would being with them affect that? [17] X Research source [v160969_b01]. 10 February 2021. What sort of impact would it have on their marriage? How would you feel about them—and yourself—if something did happen between you?"
    },
    {
      "title": "It’s okay to reach out for help if you’re really stressed.",
      "content": "It’s okay to reach out for help if you’re really stressed. Having a crush on a married person can be extremely tough to deal with. [18] X Research source [v160969_b01]. 10 February 2021. If your feelings are interfering with your work, other relationships, or your day-to-day life, call your doctor or see a counselor. They can help you develop healthy coping skills and give you practical advice for dealing with your situation. It may also help to vent to a friend or family member about how you feel."
    },
    {
      "title": "Resist the temptation to hang out outside work.",
      "content": "Resist the temptation to hang out outside work. The more time you spend with your crush, the harder it will be to get past your feelings. It can be really difficult to limit your time with a coworker, but do your best to keep interactions brief and professional. Avoid being around them socially as much as you can. [19] X Expert Source Laura Bilotta Dating Coach Expert Interview. 26 February 2020. [20] X Research source [v160969_b01]. 10 February 2021. For instance, if some of your coworkers are planning a weekend get-together, you might want to skip it if your crush will be there. If possible, limit your time around them at work, too. Don’t hang out with them in the break room during lunch, for example. If possible, avoid volunteering for projects that would involve working closely with them. [21] X Research source"
    },
    {
      "title": "Identify behaviors that could put you at risk of acting on your feelings.",
      "content": "Identify behaviors that could put you at risk of acting on your feelings. Once you’ve figured out what those are, make a promise to yourself to avoid them. Figure out some practical strategies to help you enforce those boundaries for yourself. Be gentle with yourself, but stay firm and do your best to be consistent. [22] X Research source For example, you might say, “I’m not going to indulge in fantasies about my coworker. If I have a sexual thought about them, I’ll just take a few deep breaths or have a drink of water and wait for it to pass.” [23] X Research source Or, if you find that scrolling through your crush’s Facebook feed tends to trigger your feelings, simply unfriend or block them so you won’t be tempted to keep looking."
    }
  ]
}