{
  "url": "https://www.wikihow.com/Make-Artist-Trading-Cards",
  "title": "How to Make Artist Trading Cards",
  "steps": [
    {
      "title": "Start with the size in mind.",
      "content": "Start with the size in mind. Artist trading cards are generally 2 1 ⁄ 2 inches (6.4 cm) by 3 1/2 inches. This allows them to fit into the plastic sleeves in which they are stored. You can then use the plastic card holders in a binder to bring to a trade and store in your own binder collection. This is the size of hockey cards and other trading cards. You can even start with mismatched playing cards as a base for collage or altered item artwork."
    },
    {
      "title": "A paper cutter, if you have one, will help you make square, straight cuts quickly.",
      "content": "A paper cutter, if you have one, will help you make square, straight cuts quickly."
    },
    {
      "title": "You may start by cutting cardstock or heavy paper to size.",
      "content": "You may start by cutting cardstock or heavy paper to size. If you work in another medium, such as leather or fabric, you may either cut it to size or work so that the finished result is the correct size."
    },
    {
      "title": "Express yourself or show your style",
      "content": "Express yourself or show your style , using your preferred medium or media. If you can do it inside of 3.5 x 2.5 inches, you can make an ATC. Drawing and painting are easily done at this size, but so are plenty of other arts, including quilting , photography , crochet , leather work, metal work, and collage ."
    },
    {
      "title": "You don't need to be careless when making an ATC, but there's no need to work your masterpiece in miniature, either.",
      "content": "You don't need to be careless when making an ATC, but there's no need to work your masterpiece in miniature, either. ATCs should be simple pieces that you're willing to give away when you're done. It is suggested 15 minute per card so you will want to trade them."
    },
    {
      "title": "You'll need a selection of cards.",
      "content": "You'll need a selection of cards. Remember that you will be giving your cards away. \"Lots\" can be relative. It could be half a dozen or a few dozen, depending on how many you expect to trade."
    },
    {
      "title": "Is there a particular palette or medium you prefer or a technique you've been exploring lately?",
      "content": "Is there a particular palette or medium you prefer or a technique you've been exploring lately?"
    },
    {
      "title": "Sign and date your cards and attach contact information, if you choose to.",
      "content": "Sign and date your cards and attach contact information, if you choose to. An email address or website is a good compromise if you'll be giving these cards to strangers, or mailing them."
    },
    {
      "title": "The title is optional, but it will give your recipients or viewers a context in which to view your work.",
      "content": "The title is optional, but it will give your recipients or viewers a context in which to view your work. Or leave it to the people trading, beauty is in the eye of the beholder."
    },
    {
      "title": "The whole point of ATCs is to trade with other artists, so once you have a selection of cards, trade them.",
      "content": "The whole point of ATCs is to trade with other artists, so once you have a selection of cards, trade them. Find artists or groups in your area that trade cards. The idea is to trade in person. Attend gatherings of artists in your area, and remind them to bring ATCs to share. Carry them with you as you would business cards, so that if you find an occasion to trade or give away a card, they are with you. Spread the word. If your local artist community is unfamiliar with artist trading cards, you might wish to give away a few cards or offer them with a request for one in return before you get many back. Organize a gathering to swap ATCs. Let people know what ATCs are about, and get together to try trading some. Look on-line. There are on-line groups that will match you up with others the world over who can mail cards in exchange for yours."
    },
    {
      "title": "Because they are the size of other standard trading cards, most will fit in trading card sleeves.",
      "content": "Because they are the size of other standard trading cards, most will fit in trading card sleeves. ATCs should be as unique as the artists who create them, so enjoy the selection. Start a collection of ATCs and try to get as many as you can."
    }
  ]
}