{
  "url": "https://www.wikihow.com/Clean-a-PopSocket",
  "title": "How to Clean a PopSocket",
  "steps": [
    {
      "title": "Fill a shallow dish with cold tap water.",
      "content": "Fill a shallow dish with cold tap water. Grab a shallow dish, such as a small bowl or a deep plate, and fill it with about .5 in (1.3 cm) of very cold tap water. This is to ensure that you only soak the adhesive side of the PopSocket — you should clean the plastic grip separately. Even if your PopSocket is larger than normal, using only a .5 in (1.3 cm) layer of water will ensure that only the adhesive side touches the water when it is extended."
    },
    {
      "title": "Remove the PopSocket and place it sticky-side down in the water.",
      "content": "Remove the PopSocket and place it sticky-side down in the water. Dig your fingernail under the PopSocket to pry it off of your phone, then pull the plastic grip to it extend to its full length. Place the adhesive side down in the water so the plastic grip pokes above the surface of the water. Be sure that your extended PopSocket rises above the surface and drain out water as necessary to avoid getting the rest of it wet. [1] X Research source"
    },
    {
      "title": "Let the PopSocket soak for about 10 seconds, then remove it.",
      "content": "Let the PopSocket soak for about 10 seconds, then remove it. Don't disturb the water and don't take it out before 10 seconds are up. Once 10 seconds have passed, quickly take it out of the water by the grip and shake off any excess water. Do not let it soak for more than 10 seconds or it could ruin the adhesive. [2] X Research source If you are concerned about ruining the adhesive, run the PopSocket under cold water for a few seconds instead, although soaking it is more effective. [3] X Research source"
    },
    {
      "title": "Lay a paper towel down and place the PopSocket sticky-side up.",
      "content": "Lay a paper towel down and place the PopSocket sticky-side up. You can use a regular kitchen towel or a linen towel, depending on what you have readily available. Lay the PopSocket with the sticky side pointing up and the design and plastic grip touch the paper. [4] X Research source"
    },
    {
      "title": "Let the adhesive side of the PopSocket dry for 10 minutes.",
      "content": "Let the adhesive side of the PopSocket dry for 10 minutes. Leave your PopSocket to dry for 10 minutes at most, and keep an eye on it as it dries to see if it finishes sooner. [5] X Research source Avoid using a hair dryer or dabbing it with a towel or you could damage the adhesive and make it less sticky. Just let it air dry, and swiftly re-attach it to your phone the moment it is dry by pressing the sticky side firmly onto the back of your phone. Do not let your PopSocket dry for more than 15 minutes at most or it may lose its ability to stick. If you accidentally leave it out, run it under cold water for a few seconds then let it dry again, although be aware that it may not regain its stickiness."
    },
    {
      "title": "Remove any additional stickers you've added to the end of the PopSocket.",
      "content": "Remove any additional stickers you've added to the end of the PopSocket. If you added stickers to the PopSocket's grip, you will need to remove them before you clean it. If the adhesive is still good on the sticker feel free to put it back on after cleaning, otherwise you will have to simply throw it away and find a new one. PopSockets usually come with some kind of design on the end of the grip, so even if you have to remove any additional stickers you've added, it will still have an aesthetic design. [6] X Research source"
    },
    {
      "title": "Remove the PopSocket and run the plastic grip under cold water.",
      "content": "Remove the PopSocket and run the plastic grip under cold water. Use your fingernail to pry the PopSocket off of your phone, then hold the adhesive side of the PopSocket and turn your water faucet to a low flow on cold. Run only the plastic grip of the PopSocket under water — if you must, wrap the adhesive in a hand towel to prevent getting it wet and affecting its stickiness. You can clean the adhesive separately, but if you get it wet before you're ready to clean it, you could cause the adhesive to lose some of its stickiness. Wrap it or take care to not get it wet while cleaning the grip."
    },
    {
      "title": "Scrub the plastic grip with the corner of a soapy rag, avoiding the adhesive.",
      "content": "Scrub the plastic grip with the corner of a soapy rag, avoiding the adhesive. Hold the PopSocket by the sticky side again and scrub the plastic grip with the corner of a soapy rag PopSocket. Take care to avoid getting soap on the adhesive, and only scrub the plastic parts of the PopSocket. Scrub inside the grooves of the PopSocket's expandable middle section with a cotton swab soaked in soapy water. Apply 70 percent rubbing alcohol to particularly stubborn stains or grime with a cotton swab, then rinse it under water again. Rubbing alcohol is great for removing stains as it evaporates quickly and leaves no damage."
    },
    {
      "title": "Rinse the grip once again, then dry it with a paper towel or rag.",
      "content": "Rinse the grip once again, then dry it with a paper towel or rag. Run the grip under water to get rid of soapy residue and rubbing alcohol, again taking care to avoid getting the adhesive wet. Then, take a dry rag or a paper towel and dab the PopSocket dry until it is completely free of water. [7] X Research source Press it firmly onto the back of your phone with the sticky-side down. You can also air dry the plastic grip. Expand the PopSocket then balance it on its side on a paper towel. This prevents the adhesive from sticking to the towel and will still allow the grip to air dry and drip dry."
    }
  ]
}