{
  "url": "https://www.wikihow.com/Change-the-Background-Color-in-Adobe-Illustrator",
  "title": "How to Change the Background Color in Adobe Illustrator",
  "steps": [
    {
      "title": "Open an Adobe Illustrator file.",
      "content": "Open an Adobe Illustrator file. To do so, double-click the yellow app with the letters Ai , then click File in the menu bar at the top of the screen and Open… . Select the file in which you want to change the background color and click Open ."
    },
    {
      "title": "Go to \"User Interface\" options.",
      "content": "Go to \"User Interface\" options. If you're using a Windows computer, go to Edit > Preferences > User Interface . [1] X Research source If you're using a Mac, go to Illustrator CC > Preferences > User Interface ."
    },
    {
      "title": "Choose a brightness setting from the offered tiles.",
      "content": "Choose a brightness setting from the offered tiles. This will be the tint of all the elements of the user interface including panels, buttons, and menus."
    },
    {
      "title": "Choose a canvas color.",
      "content": "Choose a canvas color. You can select \"Match User Interface Brightness\" or opt for a white canvas. [2] X Research source These settings will not affect any artwork in the drawing space. Any colors picked here will not print out of you print your project."
    },
    {
      "title": "Open an Adobe Illustrator file.",
      "content": "Open an Adobe Illustrator file. To do so, double-click the yellow app with the letters Ai , then click File in the menu bar at the top of the screen and Open… . Select the file in which you want to change the background color and click Open ."
    },
    {
      "title": "Click File in the menu bar.",
      "content": "Click File in the menu bar. It's at the top of your screen with Edit and View ."
    },
    {
      "title": "Click Document Setup….",
      "content": "Click Document Setup… . It's near the bottom of the drop-down. [3] X Research source"
    },
    {
      "title": "Check Simulate Colored Paper.",
      "content": "Check Simulate Colored Paper . It's in the \"Transparency\" section of the dialog box."
    },
    {
      "title": "Click the upper color swatch.",
      "content": "Click the upper color swatch. It's on the right side of the \"Transparency\" section, just left of the grid image."
    },
    {
      "title": "Pick a color for your background.",
      "content": "Pick a color for your background. Do so by clicking on the color wheel and then adjusting the shade with the slider bar. When you're finished, the final color will appear in a swatch in the lower-left corner of the dialog box."
    },
    {
      "title": "Click the swatch and drag it onto an empty square.",
      "content": "Click the swatch and drag it onto an empty square. The empty squares to the right of the color swatch are spaces where you can save custom colors."
    },
    {
      "title": "Close the dialog box.",
      "content": "Close the dialog box. On Windows, click the X , and on Mac, click the red dot in the corner of the dialog box."
    },
    {
      "title": "Click the lower color swatch.",
      "content": "Click the lower color swatch. It's on the right side of the \"Transparency\" section, just left of the grid image."
    },
    {
      "title": "Click the color you just saved.",
      "content": "Click the color you just saved. It's in the small square in the lower-right part of the dialog box where you dragged it. The swatch in the lower-left corner of the dialog box will become the same color as the small square."
    },
    {
      "title": "Close the dialog box.",
      "content": "Close the dialog box. On Windows, click the X , and on Mac, click the red dot in the corner of the dialog box. The swatches and grid image should all be the color you set."
    },
    {
      "title": "Click OK to close the \"Document Setup\" dialog box.",
      "content": "Click OK to close the \"Document Setup\" dialog box."
    },
    {
      "title": "Click View in the menu bar.",
      "content": "Click View in the menu bar. [4] X Research source"
    },
    {
      "title": "Click Show Transparency Grid.",
      "content": "Click Show Transparency Grid . It's toward the bottom of the drop-down. The background will now be the color you specified. [5] X Research source Any objects with fill or line colors, including white, that are not the same as the background will be visible. Instead of changing the transparent grid colors, you can create a large rectangle that's the same size of your artboard, then change the fill color of that shape."
    }
  ]
}