{
  "url": "https://www.wikihow.com/Count-Money-Fast",
  "title": "A Guide to Counting Cash Quickly: Sorting, Organizing & More",
  "steps": [
    {
      "title": "Sort your bills by denomination, then create equal-sized stacks of bills.",
      "content": "Sort your bills by denomination, then create equal-sized stacks of bills. Before you begin counting, create equal-sized stacks of all of your 1s, all of your 5s, all of your 10s, and so on. First, gather all of your bills into one big stack. Then, go through it one bill at a time and put each banknote in its own pile with its respective denomination. (For example, you’ll have a pile of 20s, a separate pile of 50s, and so forth.) [1] X Research source Once your cash is sorted, separate each denomination into equal-sized stacks. For example, you might create stacks of ten 1s, ten 5s, ten 10s, etc. Choose a simple, rounded number that’s easy to multiply and appropriate for the amount of cash you have. (You could make stacks of 10 bills, 20 bills, 50 bills, etc.)"
    },
    {
      "title": "Adjust the bills so that they’re all facing the same direction.",
      "content": "Adjust the bills so that they’re all facing the same direction. After you separate your bills into different stacks, flip your bills so they’re all facing portrait or vignette-side up. (In the U.S, portrait refers to the side with a leader’s face on it, while vignette refers to the side with the Great Seal.) [2] X Research source This will make counting money faster and easier, and keep your stacks more organized. [3] X Research source"
    },
    {
      "title": "Count each bill as you pass it from one hand to the other.",
      "content": "Count each bill as you pass it from one hand to the other. Pick up one stack and hold it in your non-dominant hand. Grab the top bill with your dominant thumb and pointer finger to make sure it’s only a single bill and not 2 bills stacked together. Then, use your dominant hand to grab each bill from the pile one at a time and count the denomination out loud. Continue to grab and move the bills until you’ve shifted the entire stack from one hand to the other. [4] X Research source For example, if you’re counting a stack of 5 dollar bills, say “5, 10, 15, 20,” as you grab and place the first 4 bills onto the flat surface."
    },
    {
      "title": "Wrap a rubber band around a stack once you reach 50 bills.",
      "content": "Wrap a rubber band around a stack once you reach 50 bills. To avoid creating uneven stacks (which will make it tough to calculate later on) and piles of cash that might tip over, bundle your money in stacks. Wrap each stack up with a rubber band. It can help to memorize the value of each stack beforehand. For example, if you’re making stacks of 50 bills each: [5] X Research source A stack of $5 bills = $250. A stack of $10 bills = $500. A stack of $20 bills = $1,000, etc."
    },
    {
      "title": "Add up all your banded stacks and leftover bills.",
      "content": "Add up all your banded stacks and leftover bills. Continue banding each stack of 50 bills and setting them aside. Once you’re out of bills, use a calculator to add the total of each stack together, and add on any leftover bills afterward. [6] X Research source Start with higher denominations first (100s, 50s, 20s). Then, work your way down to the smaller values like 1s. [7] X Research source . For example, if you have 3 fifty-bill stacks of 20s, 2 stacks of 10s, 5 stacks of 5s, and 23 loose 1 dollar bills, your math would look like this: 1,000 + 1,000 + 1,000 + 500 + 500 + 250 + 250 + 250 + 250 + 250 + 23 = 5,273."
    },
    {
      "title": "Re-count your stack to ensure your total is accurate.",
      "content": "Re-count your stack to ensure your total is accurate. Always double-check your total when you’re counting cash. [8] X Research source Once you’ve finished counting your stacks the first time, write down your total. Then, re-calculate. If your number matches, then your total is right. If you calculate a new number, re-count to double-check that new total. For example, if you counted $5,273 the first time, but, after counting again got $5,272, write down $5,272 and count again. You can also use a bill-counting machine or money-counting app to help you double-check your work."
    },
    {
      "title": "Separate your coins by denomination.",
      "content": "Separate your coins by denomination. Divide your pile of change into multiple stacks that represent every denomination of coin you have. For instance, you may have a pile of quarters, a pile of dimes, a pile of nickels, and a pile of pennies once you’re done sorting. [9] X Research source"
    },
    {
      "title": "Organize each type of coin into stacks of a certain dollar amount.",
      "content": "Organize each type of coin into stacks of a certain dollar amount. Count a stack of specific coins (pennies, dimes, corners) into a pile. Once the value of your coins reaches a dollar amount that’s easy to add, set that pile aside. It’s okay if the dollar amount varies for each denomination, but make sure the number of coins in each pile is consistent. [10] X Research source For example, each stack of quarters may be worth $2 (8 coins) while each stack of pennies may only be worth $0.10 (10 coins)."
    },
    {
      "title": "Make identical stacks out of the remaining coins.",
      "content": "Make identical stacks out of the remaining coins. Using the initial stack as a model, make identical stacks out of the rest of the coins in that specific denomination pile. There’s no need to keep track of monetary value while you do this; just focus on creating stacks with the same exact number of coins as the first one. If you have extra coins that don’t quite complete one stack, organize them into a stack and set them aside nearby. [11] X Research source"
    },
    {
      "title": "Add the stacks and extra coins up for each denomination.",
      "content": "Add the stacks and extra coins up for each denomination. Once you’ve made stacks out of all of the coins in a denomination, count the stacks by their monetary value and add them together. Then, add on the value of the leftover coins and write the total number down. It may help to use a calculator when counting your coins. [12] X Research source For example, if you have 9 stacks of 8 quarters (worth $2), think or say, “2, 4 6, 8, 10, 12, 14, 16, 18” while you count the stacks. If you have 3 extra quarters, your math will look like this: $18.00 + $0.75 = $18.75."
    },
    {
      "title": "Add all the denomination piles together.",
      "content": "Add all the denomination piles together. Once you’ve written a total for each denomination pile, add the totals of each pile together. For example, if your quarter pile is worth $18.75, your dime pile is worth $11.60, your nickel pile is worth $3.15, and your penny pile is worth $1.33, then your math would be: $18.75 + $11.60 + $3.15 + $1.33 = $34.83. Write down your total on a sheet of paper when you’re finished. [13] X Research source"
    },
    {
      "title": "Re-count your coins to double-check your math.",
      "content": "Re-count your coins to double-check your math. Once you’ve determined the total value of all your coins combined, re-count your stacks to ensure that your math is accurate. If you calculate the same total on your second try as you did on your first try, you can put your coins back (but keep the total number you wrote down somewhere safe). Counting money by hand isn’t as effective as using counting by machine. While it’s more expensive, consider getting a coin counter to help you calculate your cash. Most banks also have a coin counter that you can use if you’re a member, free of charge. [14] X Research source"
    },
    {
      "title": "Use each of your fingers to count bills in groups of 5.",
      "content": "Use each of your fingers to count bills in groups of 5. Hold a stack of bills (that are all the same denomination) in your non-dominant hand. Fold these bills in half vertically so that all 4 corners are facing up. Then, using one finger at a time on your dominant hand, slide and unfold the bills from the pile. Count how many times you swipe through all your fingers (every count will contain 5 bills). [15] X Research source For example, pull down the 1st bill in the folded stack with your thumb, the 2nd with your pointer finger, the 3rd bill with your middle finger, the 4th with your ring finger, and the 5th with your pinky. Repeat until you’ve pulled down and counted the whole stack. Multiply the number of counts you made by 5 to get the total number of bills. Then, multiply the number of bills by the denomination to get your total."
    },
    {
      "title": "Pull individual bills from one hand’s grip with your opposite thumb.",
      "content": "Pull individual bills from one hand’s grip with your opposite thumb. In your non-dominant hand, hold a stack of bills (of the same denomination) that are folded vertically with the corners facing up. Secure this stack in place with your non-dominant thumb. Then, use your dominant thumb to press down on the front of the first bill and pull it out from underneath the other thumb’s grasp by swiping laterally. Count while swiping each bill this way. [16] X Research source Remember: practice makes perfect. The more you practice this technique, the faster you’ll be at counting cash."
    },
    {
      "title": "Pass banded bills from one hand to the other.",
      "content": "Pass banded bills from one hand to the other. Place a banded stack of bills (of the same denomination) horizontally on a flat surface in front of you. Grab the stack by the top right corner with your right hand. Then, alternate using your left pointer and middle finger to grab and count each bill individually. [17] X Research source Practice this method at least once a day to increase your speed. Consider timing yourself each time and keep trying to beat your previous record."
    }
  ]
}