{
  "url": "https://www.wikihow.com/Mix-Bondo",
  "title": "How to Mix Bondo",
  "steps": [
    {
      "title": "Cut a thick piece of cardboard about 6 by 6 inches (15.24 cm by 15.24 cm).",
      "content": "Cut a thick piece of cardboard about 6 by 6 inches (15.24 cm by 15.24 cm). Alternatively, you can mix it on particle board or buy an inexpensive pad of disposable plastic sheets to mix the Bondo. [1] X Research source"
    },
    {
      "title": "Open the can and mix the Bondo with a stir stick if there is a layer of liquid on top.",
      "content": "Open the can and mix the Bondo with a stir stick if there is a layer of liquid on top. Use the stir stick to lift a golf ball-sized dollop of filler out of the can and reseal the can. [2] X Research source Mix a larger amount of Bondo and hardener if the area you need to patch is larger. Look at your project to estimate the amount of Bondo needed."
    },
    {
      "title": "Add 1 line of hardener--also known as a catalyst or fixing agent--by squeezing it out of the tube across the top of the Bondo filler.",
      "content": "Add 1 line of hardener--also known as a catalyst or fixing agent--by squeezing it out of the tube across the top of the Bondo filler. (Bondo comes with a tube of hardener.) [3] X Research source If you add too much hardener, the mixture will gel too quickly. If you add too little, it increases the amount of time for it to cure, and if you don't add enough it will never cure. If you add 1 line of hardener across the top of the dollop of Bondo, it takes about 15 minutes to dry after applying. Add 2 lines and it takes about 5 minutes to dry. Experiment to get the right Bondo mixture."
    },
    {
      "title": "Use an ice cream novelty stick or a plastic spreader to quickly mix the two substances together.",
      "content": "Use an ice cream novelty stick or a plastic spreader to quickly mix the two substances together. Do not whip them, but rather fold them to avoid introducing air bubbles. Use hardener with dye in it so you can see when the mixture is mixed evenly. If there are no streaks in the filler or areas that are darker or lighter, it is mixed well."
    }
  ]
}