{
  "url": "https://www.wikihow.com/Get-Motivated-to-Exercise-when-Depressed",
  "title": "How to Get Motivated to Exercise when Depressed",
  "steps": [
    {
      "title": "Pick days and times to exercise throughout the week.",
      "content": "Pick days and times to exercise throughout the week. If you’re struggling to be “in the mood” to work out, set aside specific days of the week and times of day that you usually have some free time. Make sure this schedule aligns with your other schedules (like work and sleep) so you don’t feel stressed about making it happen every day. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source For example, if you struggle with waking up, don’t plan to exercise in the morning. Instead, try exercising after work, school, or a meal. Don’t pressure yourself to make up for an exercise period you miss. Remind yourself that tomorrow is a new day to get back on track!"
    },
    {
      "title": "Find a workout routine that excites and interests you.",
      "content": "Find a workout routine that excites and interests you. If you're having trouble committing to your own schedule, try committing to one that someone else has already set up! Signing up for a class can get you on track with a routine. Also, when you're dealing with depression, it's important that you socialize and not isolate. If you find reaching out to friends and family difficult, classes can help you regularly be around people. [2] X Research source If regular gym routines bore you, opt for a class that offers an alternative workout, like a dance or yoga class! This can also be a fun way to meet new people with similar interests to you. Alternatively, if you're nervous about being around new people, try signing up for a fun class with a friend."
    },
    {
      "title": "Ask a workout buddy to keep you social and hold you accountable.",
      "content": "Ask a workout buddy to keep you social and hold you accountable. Designating a friend to exercise with you gives you a healthy social pressure to stick to a work out routine. Ask a friend, colleague, or partner with a similar schedule to exercise with you. [3] X Research source Find someone who already exercises regularly or is interested in starting to exercise, too, so you can inspire and motivate each other. Again, staying social is also an important combatant against depression."
    },
    {
      "title": "Listen to music or watch TV to distract yourself.",
      "content": "Listen to music or watch TV to distract yourself. A lot of people give up on exercising because they find it boring. Depression only exacerbates this feeling. To keep exercise exciting, try watching or listening to something that will hold your attention. This can distract your mind and motivate your body to keep going when you find yourself drifting. [4] X Research source Wearing headphones while you work can also drown out the outside world, allowing yourself to focus on the task at hand. If you're listening to music, stick to upbeat, energetic songs that you feel motivated by. Pick a long playlist or radio station so the mood is consistent! Similarly, if you're watching a show or movie, try something engaging and lighthearted, like a sitcom or reality TV. If you're not a fan of music or TV, try listening to an audiobook or podcast."
    },
    {
      "title": "Change up how you exercise if you start losing interest.",
      "content": "Change up how you exercise if you start losing interest. Depression can make it difficult to find and maintain pleasure in things. If you find any part of your exercise routine boring or exhausting, switch things up by replacing exercises or adding new elements. [5] X Research source If activities you used to like are no longer enjoyable for you, switch to new exercises that work similar body parts, or change the location you do them in. For example, switch from pushups to pullups, or change from running on a treadmill to running outside. Try to not let your exercise routine become a chore that you dread doing!"
    },
    {
      "title": "Pick a schedule that you can do no matter how you’re feeling.",
      "content": "Pick a schedule that you can do no matter how you’re feeling. The stress of making decisions can amplify the effects of depression. To avoid this, pick an exercise routine that’s feasible no matter where your mind or emotions are at on any given day. [6] X Research source Be prepared for feeling low energy some days. Again, consistency is more important than intensity. For example, going for a short walk every day might be more realistic than rallying yourself to do a 10-part workout every day."
    },
    {
      "title": "Walk, jog, bike, or dance 3-5 times a week for 30 minutes.",
      "content": "Walk, jog, bike, or dance 3-5 times a week for 30 minutes. The average adult only needs 2-3 hours of physical activity a week to stay healthy. Instead of stuffing all your exercise into one grueling workout, try splitting it up across the week in short sessions. [7] X Research source The number of days and minutes is up to you, as long as it’s frequent and consistent. Contrary to popular belief, consistency is more effective than intensity."
    },
    {
      "title": "Start with easy objectives so you have more chances to succeed.",
      "content": "Start with easy objectives so you have more chances to succeed. When you initially start coming up with a workout routine, you might have lofty goals for yourself. With depression, reaching for difficult goals can set yourself up for disappointment. Instead, create realistic goals for yourself that you know you can attain and make more challenging over time. [8] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Start by setting smaller goals you might be able to surpass easily, which can motivate you to slowly aim higher and higher. For example, rather than starting with 50 reps a day, start off with 10 and add 5 every week. Instead of aiming for a certain weight, focus on building strength and endurance. With time and a healthy diet, you should organically see results. If you set yourself up for failure, you're more likely to give up early on."
    },
    {
      "title": "Reward yourself after every attempt at working out.",
      "content": "Reward yourself after every attempt at working out. Remember that exercising with depression isn’t easy. Give yourself a pat on the back every time you successfully complete a workout, stick to your routine, try a new exercise, or meet a new goal. [9] X Research source Create rewards for yourself to look forward to after a workout, like a bubble bath or a meal at your favorite restaurant. You deserve a treat every now and then! Celebrating every time you have a small success will do more for your motivation than punishing yourself for not working hard enough."
    },
    {
      "title": "Remind yourself that you can always try again tomorrow.",
      "content": "Remind yourself that you can always try again tomorrow. It can be easy to fall into negative self-talk when you miss a day of exercise or don’t push yourself as hard as think you can. But labelling these moments as failures isn't helpful to your healing. Remember that the occasional shortcoming doesn't reflect how hard you're working to improve your body and mind overall. [10] X Research source Catch yourself when you fall into negative self-talk. Turn your attention to the fact that tomorrow is an opportunity to try again. Contrary to popular belief, being hard on yourself won't motivate you to work harder, especially when you're dealing with depression."
    },
    {
      "title": "If the fatigue of depression is too restricting, ask for help.",
      "content": "If the fatigue of depression is too restricting, ask for help. You might feel that exercising or getting any sort of movement in is extremely taxing for your mind and body. In cases like this, you might consider seeking professional medical treatment to help you get on your feet. [11] X Research source A psychiatrist, doctor, or personal trainer could also work with you to find an exercise routine that works for you and your depression."
    }
  ]
}