{
  "url": "https://www.wikihow.com/Choose-Contact-Lenses",
  "title": "How to Choose Contact Lenses",
  "steps": [
    {
      "title": "Learn the different soft lens options.",
      "content": "Learn the different soft lens options. There are many different types of soft lenses to meet your needs. Generally speaking, a soft lens is easier to adjust to than a rigid gas permeable lens. Soft lenses also tend to be more comfortable, especially when worn for prolonged periods of time. [1] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Extended wear lenses — Can be worn overnight and left in continuously for up to seven days without removing them. [2] X Trustworthy Source American Optometric Association Professional medical organization dedicated to supporting optometrists and improving public eye and vision health Go to source In addition, Air Optix Night and Days are FDA approved for up to 30 days overnight wear. Planned replacement lenses — Should not be worn overnight. Must be replaced regularly, usually every two weeks, four weeks, or 12 weeks. Silicone-based lenses — These lenses are highly breathable and prevent deposits from accumulating. This can result in a more comfortable lens with less risk of irritation, especially if you suffer from dry eyes. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Colored soft lenses — These soft lenses are colored with a tint. The tint may be functional (making it easier to find a lost lens) without altering the color of your eye, or it may be cosmetic, giving you a different eye color than your natural color. [4] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    },
    {
      "title": "Decide on a lens duration.",
      "content": "Decide on a lens duration. Though soft lenses are generally preferable for extended wear, they do not have the longevity that a rigid gas permeable lens has; however, there are some options as far as how long you can reuse a lens before it needs to be replaced. [5] X Research source Daily disposable lenses — These lenses will cost more money due to the frequency at which they are disposed of; however, changing your lenses on a daily basis carries the lowest risk of infection. These lenses are a good choice for people with dry eyes or are prone to allergies as deposits and allergens have less time to build up because you have a new lens each day. Two week/monthly disposable lenses — These are slightly less expensive than daily disposables, and still help reduce the risk of infection by using new lenses every few weeks. Some disposable soft lenses can even be replaced every three months, though you should always defer to your optometrist's advice. [6] X Trustworthy Source American Optometric Association Professional medical organization dedicated to supporting optometrists and improving public eye and vision health Go to source"
    },
    {
      "title": "Determine whether UV protection is important.",
      "content": "Determine whether UV protection is important. Many people choose contact lenses because contacts can be worn during sports without the risk of damage that eyeglasses carry. If you engage in outdoor sports, or if you generally spend a lot of time in the sun, you may want to consider talking to your optometrist about soft lenses with UV protection. [7] X Research source It's important to note that not all soft lenses provide UV protection, though many do. Talk to your optometrist about your options if UV protection is a factor in your decision. Full eye protection is important and UV protection in contacts only protects part of the eye. The rest of the eye should be protected too, so you should still wear sunglasses outdoors even if your contacts provide UV protection."
    },
    {
      "title": "Know the disadvantages of soft lenses.",
      "content": "Know the disadvantages of soft lenses. For many people, soft lenses are more comfortable than rigid gas permeable lenses and better meet their needs; however, soft lenses usually don't correct vision as well as rigid lenses. [8] X Trustworthy Source American Optometric Association Professional medical organization dedicated to supporting optometrists and improving public eye and vision health Go to source There are some other disadvantages that are worth considering. Soft lenses tend to absorb environmental pollutants more easily than rigid lenses. If you are around smoke or airborne particles on a regular basis, you may want to talk to your optometrist to determine if soft lenses would pose a problem. In addition to environmental pollutants, soft lenses also tend to soak up irritants from your hands, including lotion and hand soap. Washing your hands before handling lenses can reduce this risk, though it will not eliminate the chances of absorption. Because of their soft, porous nature, these contact lenses are much more fragile than rigid lenses. As a result, they may rip or tear more easily (though they are meant to be replaced more frequently)."
    },
    {
      "title": "Learn the advantages of RGP lenses.",
      "content": "Learn the advantages of RGP lenses. RGP lenses tend to be slightly less popular than soft lenses for a number of reasons, but there are many areas in which RGP lenses excel. An RGP lens will have the following benefits for most contact lens users: [9] X Research source Sharper vision than soft lenses provide Better visual clarity for some users with astigmatism Preferable for some users with presbyopia who require bifocals or multifocals Better fit and clarity for users with Keratoconus (cone-shaped cornea) Preferable for individuals who need contact lenses after refractive surgery Can be used for ortho-k procedures, in which lenses are worn at night to reshape the cornea"
    },
    {
      "title": "Know the disadvantages of RGP lenses.",
      "content": "Know the disadvantages of RGP lenses. Though RGP lenses are preferable for some users with specific needs, there are also some down sides to these lenses. Some users report that RGP lenses may have the following disadvantages: [10] X Research source They take longer to get used to and may be less comfortable. They will need to be worn regularly to become comfortable for the user (they can even become uncomfortable after a week of not wearing lenses). There is a greater risk of RGP lenses becoming dislodged during physical activities due to the smaller size of the lenses. There is a higher risk of discomfort or corneal abrasions due to the increased chance of dust/debris getting lodged under the lenses. They require greater care and maintenance than soft lenses; however, they tend to last longer, which may save you money in the long run."
    },
    {
      "title": "Consider hybrid contact lenses.",
      "content": "Consider hybrid contact lenses. If you're on the fence about soft vs. RGP lenses, you may want to consider trying hybrid contact lenses. Hybrid lenses are made with a rigid, gas-permeable center but have a soft ring around the RGP component. This gives you the comfort of a soft lens while meeting the specialized needs some users have for a rigid lens. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Hybrid lenses can be used to correct nearsightedness, farsightedness, astigmatism, age-related loss of close-up vision, and keratoconus. Many users who need rigid lenses find that hybrid contact lenses are much more comfortable and easier to wear."
    },
    {
      "title": "Get an eye exam and fitting.",
      "content": "Get an eye exam and fitting. Before you choose a contact lens, or any type of eyewear, it's important to have a thorough examination and fitting with an eye care specialist. An eye exam is required to determine your lens strength and to acquire a prescription for contact lenses. A fitting is necessary to ensure that your lenses fit the shape of your eye and can comfortably meet your needs. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You will most likely need one or more follow-up exams after receiving your lenses. These are typically scheduled one week after getting your lenses, then either one month or six months after, then on an annual basis."
    },
    {
      "title": "Consider how often you'll wear contacts.",
      "content": "Consider how often you'll wear contacts. If you're planning on wearing your contact lenses every day, then you have some flexibility in choosing soft or rigid lenses; however, if you only plan on wearing your contacts on weekends or special occasions, you may be better off choosing soft lenses. [13] X Research source While soft lenses can be worn comfortably on a part-time or full-time basis, rigid lenses must be worn full time in order to remain comfortable on your eyes."
    },
    {
      "title": "Determine how important sharpness of vision is.",
      "content": "Determine how important sharpness of vision is. Any contact lens will correct your vision, giving you better clarity than no lens at all; however, rigid lenses are generally considered to provide the sharpest possible vision of any type of contact lens, especially for users who have astigmatism. [14] X Research source If you need sharp, near-perfect vision for work, consider talking to an eye care specialist about whether a rigid lens might work best for you."
    },
    {
      "title": "Decide how much care/effort you can put in.",
      "content": "Decide how much care/effort you can put in. Improper lens care can lead to a whole host of vision problems, including fungal infections, bacterial infections, and corneal ulcers. Daily cleaning is required by both soft lenses and rigid lenses. The exception is daily disposable contacts, which are thrown out at the end of the day. [15] X Research source Because soft lenses are typically replaced on a daily, weekly, or monthly basis, there is less risk of irritations or infections caused by build up on the lens. If you don't mind taking the extra care and maintenance to keep your contacts in good condition, rigid lenses may work fine for you; however, if you are worried about your ability to take care of your lenses (including the risk of losing lenses), you may want to consider a soft lens."
    },
    {
      "title": "Clean/disinfect your lenses.",
      "content": "Clean/disinfect your lenses. It may go without saying, but you'll need to clean and care for your lenses no matter which type you choose. This is important, as cleaning and disinfecting your lenses will help remove dirt and irritants, including bacteria and fungi that could otherwise infect your eye. [16] X Research source Clean and disinfect your lenses every time you remove them by rinsing and storing your lenses in an approved contact lens solution. To rinse the lens, pour some clean contact solution in the palm of your hand. Use your index finger to gently rub the contact lens around in the solution in your palm. Never reuse contact lens solution. Clean out your lens case on a daily basis and always use fresh contact solution whenever you take out your lenses. Do not use homemade cleaning solutions. You should also avoid using saliva to wet or clean your lenses before use, as this will introduce bacteria to your eyes. Do not use tap water to wash your lenses. Microorganisms can live in distilled water (including the water that comes out of your faucet), and while that water is safe to drink it could be dangerous to trap that water against your eye with a contact lens. [17] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Clean and replace your lens case.",
      "content": "Clean and replace your lens case. Proper care and maintenance of your contact lens case is just as important as cleaning your contacts themselves. Dirt, bacteria, and fungus can accumulate in your case, so you'll need to learn how to clean your case and how often to replace it. [18] X Research source Clean your lens case every day. Avoid using soap; simply rinse it with hot water and spray it down with contact lens solution. Always allow your lens case to air dry. Leaving your lens case wet all day and every day can promote fungal growth, which can cause infections and damage to your eyes. Replace your contact lens case every three months. [19] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source"
    },
    {
      "title": "Wear your lenses properly.",
      "content": "Wear your lenses properly. Though contact lenses are safe to wear, their continued safety depends on how you wear and store your lenses. Anything you introduce your contacts to will eventually make its way to your eyes, which can cause irritation, pain, or even infections. [20] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source Always wash your hands with a mild, unscented, non-cosmetic soap before handling your contact lenses. Dry your hands with a clean, lint-free towel before handling your lenses. Keep your fingernails short and smooth to reduce the risk of damaging the lenses or scratching your eye. If you wear hair spray, make sure you apply it before putting in your contacts. Be sure to wash your hands after using/handling hair spray to prevent it from getting onto your lenses. If you wear makeup, put your contacts in before applying cosmetics. Likewise, make sure you remove your contact lenses before cleaning off your makeup at the end of the day. Only wear your contact lenses for the length of time and the long-term duration that your eye care professional recommended. [21] X Research source Do not sleep with your lenses unless your eye care professional has told you it is safe to do so. Never wear your contacts while swimming in any body of water, including swimming pools. [22] X Research source"
    },
    {
      "title": "Seek medical help if you experience problems.",
      "content": "Seek medical help if you experience problems. Contact lenses do not usually pose any problems for most users, other than some discomfort while adjusting to wearing a lens; however, some people experience adverse symptoms, usually associated with an infection or an underlying medical problem. See your eye doctor immediately if you experience any of the following symptoms: sudden vision loss persistent blurred vision flashes of light severe or prolonged pain signs of infection, including swelling, redness, or irritation [23] X Trustworthy Source American Academy of Opthamologists Professional medical organization focused on advocating for public health and supporting sight-related research Go to source"
    }
  ]
}