{
  "url": "https://www.wikihow.com/Find-Someone-You-Met-Without-a-Name",
  "title": "How to Find Someone You Met Without a Name",
  "steps": [
    {
      "title": "Ask around to see if anyone there knows them.",
      "content": "Ask around to see if anyone there knows them. If you two met at a bar, ask the bartender to see if they’re a regular. If you met them at a store, check with the cashier to see if they come in often. It might be a long shot, but it doesn’t hurt to try! [1] X Research source If they were with a group of friends, look for them, too. If you happen to find someone who knows the person you’re looking for, don’t press them for information. Instead, give them your phone number to give to the other person so they can reach out to you."
    },
    {
      "title": "If they’re a friend of a friend, you might know someone who knows them.",
      "content": "If they’re a friend of a friend, you might know someone who knows them. For instance, if you two met at a party, ask the host who they were and what their name was. They can give you more info on the person and how to get ahold of them. [2] X Research source You can also try looking through your followers on social media to see if they follow the mystery person you’re looking for."
    },
    {
      "title": "Their number may be registered under their name.",
      "content": "Their number may be registered under their name. If you happened to grab someone’s number but not who they are, type the number into Google to see what pops up. If there isn’t much info, try a more specific search engine like BeenVerified, Spokeo, or People Search Engines. [3] X Research source"
    },
    {
      "title": "Almost everyone has a social media account these days.",
      "content": "Almost everyone has a social media account these days. Start by going on Facebook and typing in what you do know, like the city they live in or what they do for work. Filter the search results for your area and scroll through anyone who pops up. If you get lucky, you might find their profile! [4] X Research source You can also try searching on Instagram or Twitter, but their search functions are a little more rudimentary."
    },
    {
      "title": "If they told you where they work, you could find their profile.",
      "content": "If they told you where they work, you could find their profile. Search for their workplace on LinkedIn, then check out the “Employees” tab. If they’ve specified where they work on their LinkedIn profile, you might be able to track them down this way. [5] X Research source It helps if you know the name of the specific company they work for, not just the field that they work in."
    },
    {
      "title": "Maybe you two took a selfie together that you can use.",
      "content": "Maybe you two took a selfie together that you can use. Throw the picture into Google Image search to see if any similar results pop up. If they have any social media accounts or an online presence, you might be able to find them that way. [6] X Research source Google Image searches for pictures that are similar to the one that you upload. It will scan the unknown person’s face and try to find ones that match."
    },
    {
      "title": "If the unnamed person reads it, they’ll be able to connect with you.",
      "content": "If the unnamed person reads it, they’ll be able to connect with you. Head to the Craigslist page for your city and write an ad under the “Missed Connections” page. Describe where you met and what the other person looks like so they know it’s about them if they stumble across it. [7] X Research source The only way the other person will find your ad is if they happen to be scrolling Craigslist. However, if they’re looking for you, there’s a good chance it could happen!"
    },
    {
      "title": "If they live in your neighborhood, you might be able to find them.",
      "content": "If they live in your neighborhood, you might be able to find them. Download NextDoor, a neighborhood social media app that you can connect with other people on. Make a post describing who you’re looking for and where you met. If anyone knows them, they might just comment or send you a private message. Your name, neighborhood, and profile photo will be shared when you make a post on NextDoor."
    },
    {
      "title": "Cities and counties sometimes have their own Facebook groups.",
      "content": "Cities and counties sometimes have their own Facebook groups. Try searching your area on Facebook and joining the group that’s most relevant to your area. Make a post on there detailing who you’re looking for and where you met them to see if anyone knows who they are. [8] X Research source For instance, you might search “Portland” or “Multnomah County.”"
    },
    {
      "title": "You might not know their name, but what else do you know?",
      "content": "You might not know their name, but what else do you know? Maybe they told you where they work, where they went to school, or where they grew up. Try a simple Google search with this information to see what pops up. [9] X Research source For instance, you might search “Arkansas State University” + “Atlanta, Georgia” + “Bartender.” Since you don’t know their name, look at Google Images to see if you recognize anyone. If Google isn’t working out, try a more specific search engine, like BeenVerified."
    }
  ]
}