{
  "url": "https://www.wikihow.com/Make-a-Biscuit-Joint",
  "title": "How to Make a Biscuit Joint",
  "steps": [
    {
      "title": "Gather the tools and materials you will need for the project.",
      "content": "Gather the tools and materials you will need for the project. It is very helpful to have a good, flat, sturdy workbench for this woodworking operation. Briefly, you will need at least the following: A plate jointer , also known as a biscuit jointer . A saw. Measuring tape. Square. Wood glue/ Carpenter's glue. Clamps. Lumber."
    },
    {
      "title": "You can laminate lumber together of differing thicknesses if only one side will be visible, or if you have access to a power plane, but ideally, you will begin with sized, square material of the same thickness.",
      "content": "You can laminate lumber together of differing thicknesses if only one side will be visible, or if you have access to a power plane, but ideally, you will begin with sized, square material of the same thickness."
    },
    {
      "title": "They should fit snugly together along their edges.",
      "content": "They should fit snugly together along their edges. If a beaded look is desired, a rounded edge common in nominal lumber is acceptable, as seen in the scrap material used for the illustrations."
    },
    {
      "title": "Generally, the distance between biscuits will determine how strong the finished plank will be, and thinner lumber will hold better if the spacing is kept to a minimum.",
      "content": "Generally, the distance between biscuits will determine how strong the finished plank will be, and thinner lumber will hold better if the spacing is kept to a minimum. One inch nominal lumber joins fairly well at a twelve inch biscuit spacing, two inch lumber can be cut at sixteen to eighteen inches on center with good results."
    },
    {
      "title": "For single row biscuits, you will want to place the joints at the center of the board's edge, for double rows, cut each row at one third of the boards thickness.",
      "content": "For single row biscuits, you will want to place the joints at the center of the board's edge, for double rows, cut each row at one third of the boards thickness."
    },
    {
      "title": "Make sure the lumber is secured or held tightly, as considerable force is required to push the blade into the work piece.",
      "content": "Make sure the lumber is secured or held tightly, as considerable force is required to push the blade into the work piece."
    },
    {
      "title": "Clean out the biscuit slots to remove sawdust or debris.",
      "content": "Clean out the biscuit slots to remove sawdust or debris."
    },
    {
      "title": "Fill the slot about one fourth full of a good quality wood glue.",
      "content": "Fill the slot about one fourth full of a good quality wood glue. Press the precut biscuits into the slot, and notice if excess glue runs over its edges. This excess can end up on the finished surface of your work, making it almost impossible to stain uniformly later if you desire to do so. Spread a small amount of glue along the edge of the board you are mating to the one you have inserted the biscuits into. Fill the respective biscuit slots one fourth full as you go."
    },
    {
      "title": "Fit the two boards together and make sure they are properly aligned.",
      "content": "Fit the two boards together and make sure they are properly aligned. Then clamp them tightly and allow the glue to dry."
    },
    {
      "title": "Sand or plane down the finished side of your laminated plank when the glue has completely dried.",
      "content": "Sand or plane down the finished side of your laminated plank when the glue has completely dried."
    }
  ]
}