{
  "url": "https://www.wikihow.com/Identify-Water-Hemlock",
  "title": "How to Identify Water Hemlock",
  "steps": [
    {
      "title": "Do an image search on the Web for \"Water Hemlock\" or \"Cicuta maculata\".",
      "content": "Do an image search on the Web for \"Water Hemlock\" or \" Cicuta maculata \". The latter name will give you the top results of what water hemlock looks like, and will help you understand what to look for when identifying this species."
    },
    {
      "title": "Take a look at the entire plant.",
      "content": "Take a look at the entire plant. Water hemlock grows 0.6 m (2.0 ft) to 1.8 m (5.9 ft) tall; stems are erect, stout, hollow mostly of the lower portion, occasionally branching, and mostly hairless. Leaves are below the flowers, and come from the base and along the stem. Roots have thickened, tuberous and chambered bases; a number of the true roots are also often thickened."
    },
    {
      "title": "Study the leaves.",
      "content": "Study the leaves. The leaves are the most important part of the plant to make a positive identification, and distinguishes itself from other species. As mentioned in the previous step, leaves are basal (come from the base), or cauline (grow up along the stem), and develop alternately along the stem. Leaves are two to three-times odd pinnate ( pinnate = arranged like a long feather; odd = single leaf at top), with leaflets lanceolate-ovate to narrowly lanceolate. Each leaflet is around 3 cm (1.2 in) to 10 cm (3.9 in) long, and 1 cm (0.39 in) to about 2 cm (0.79 in) wide. Leaflets are also coarsely toothed. Leaves themselves are around 45 cm (1.48 ft) and about 20 cm (0.66 ft); the longer leaves are found closer to the bottom of the plant. Each division typically contains 3 to 7 leaflets. [1] X Research source Lateral veins of the leaflets extend to the notches between the teeth instead of to the tips along the leaf margins. Few other plants in the family Apiaceae in North America have this characteristic."
    },
    {
      "title": "Look at the stems.",
      "content": "Look at the stems. Apart from what was already mentioned above, C. maculata typically has stems that are reddish-purple to purplish from the nodes. Some of this purplish colour extends down the stem or up from the base of the leaves. Stems also have a whitish film that can be rubbed off when touched. There may be some spotting seen on the stems, although inconspicuous; streaking of reddish purple is more obvious."
    },
    {
      "title": "Notice the roots and sap exuding from the cut stems and roots.",
      "content": "Notice the roots and sap exuding from the cut stems and roots. As mentioned before, the roots are quite fleshy, tuberous and thickened, and the base is often bulbous. Cutting a cross-section of the root reveals that it's chambered and hollow. The sap that comes from cut stems and roots is oily and yellowish, and has a bit of a foul odour; almost like that of mice or raw parsnip."
    },
    {
      "title": "Notice the flowering parts of the plant.",
      "content": "Notice the flowering parts of the plant. The inflorescence is a compound umbel, and there should be about 1 to several per plant. The primary umbel (the largest inflorescence on the plant) will have 18 to 28 rays (with umbellets), and the secondary (smaller) umbels have 12 to 25 rays. Compound umbels are at most 6 in (15 cm) wide, and dome-shaped on top. Individual umbellets are comprised of 12 to 15 flowers clustered together. Each flower is whitish-green, with five small petals, and unequal to subequally symmetrical."
    },
    {
      "title": "Understand where you are most likely to find this plant.",
      "content": "Understand where you are most likely to find this plant. Water hemlock is native to North America, and common in moist to wet areas. This includes shores, along streams, in marshy/swampy areas (bogs, sloughs, fens, riparian areas, etc.), and in wet ditches."
    },
    {
      "title": "Use the steps from above to be able to distinguish Water Hemlock from other similar species.",
      "content": "Use the steps from above to be able to distinguish Water Hemlock from other similar species. The next part below shows some species that are commonly confused with C. maculata , from those related to a couple completely unrelated to this species."
    },
    {
      "title": "Note the number of species that can be quite easily confused with Water Hemlock.",
      "content": "Note the number of species that can be quite easily confused with Water Hemlock. There are surprisingly quite a few species, and most of these species are found in the Carrot Family ( Apiaceae ). These similar species, described more in the steps below, include: Angelicas ( Angelica spp. ) Cow Parsley ( Anthriscus sylvestris ) Caraway ( Carum carvi ) Bulbous Water Hemlock ( Cicuta bulbifera ) Poison Hemlock ( Conium maculatum ) Giant Hogweed ( Heracleum mantegazzianum ) Cow Parsnip ( Heracleum maximum ) Wild Carrot ( Daucus carota ) Red Elderberry ( Sambucus racemosa ) Water Parsnip ( Sium suave ) Western Hemlock ( Tsuga heterophylla )"
    },
    {
      "title": "Distinguish from Angelicas (Angelica spp.",
      "content": "Distinguish from Angelicas ( Angelica spp. ). There are over 180 recognized species of Angelicas in the world, and all fall under the same family as water hemlock. Most species are similar in leaf structure from each other. Exemplary species of mention are White Angelica ( Angelica arguta ) and Yellow Angelica ( Angelica dawsonii ). A. arguta is probably one of the most likeliest of Angelica species to be confused with water hemlock, primarily because of the similarly-looking umbel. However, there are some very distinguishing features of white angelica; there is a large, conspicuous sheathing base at the base of each leaf, and the leaves themselves, while also pinnately-compound, are ovate-lanceolate (wider than water hemlock), and irregularly lobed. Leaflet-edges are also spiny-toothed. [2] X Research source A. dawsonii can be more easily distinguished by the yellow flowers, plus the conspicuous whorl of slashed or toothed bracts. The leaves, compared with white angelica, are slightly more finely toothed, more lanceolate (almost similar to C. maculata ), and less irregularly-lobed. Great or Purple Angelica ( Angelica atropurpurea ) is another species that may be thought of as being very similar in appearance to water hemlock; however the leaves tell a much different story; The leaves are actually what botanists call bipinnate . This means that there are double the pinnate leaves on a single leaf; rather, leaflets are divided into subleaflets, still keeping that pinnate shape from each leaf lobe. Water hemlock is \"2 or 3 times pinnate\" which means there is an additional one or two leaves in addition to the main leaflet that would normally make up a true pinnate (feather-shape) leaf. [3] X Research source [4] X Research source Mature purple angelica are also predominantly purple (the stems), where water hemlock only has purple streaks running down from the nodes. It has the characteristic sheath found at the base of each leaf, and tends to grow much taller; to 8 ft (2.4 m) tall. Flowers are greenish-white to pale yellow. The vast majority of angelicas are non-poisonous, rather seen as medicinal plants. The only species that is known to be poisonous is Angelica lineariloba or Sierra Angelica. The best way to distinguish this plant is by its narrow, feathery leaves, conspicuous sheaths at the base of each leaf and petiole (from where flowers are borne), and that it prefers higher elevations and rocky soil in the Sierra Nevadas than wetland areas typical of water hemlock. [5] X Research source"
    },
    {
      "title": "Distinguish from Cow Parsley (Anthriscus sylvestris).",
      "content": "Distinguish from Cow Parsley ( Anthriscus sylvestris ). Another member of the Carrot Family, cow parsley can be distinguished from water hemlock by its noticeably finely-divided, fern-like leaves. With mature plants, the stalks are predominantly red to reddish-purple, unlike the reddish or purplish streaking from the nodes you find with water hemlock."
    },
    {
      "title": "Distinguish from Caraway (Carum carvi).",
      "content": "Distinguish from Caraway ( Carum carvi ). Caraway is a cultivated plant of the carrot family, but can also grow wild as a weed. This species has leaves that are very finely divided, looking very similar to carrot leaves."
    },
    {
      "title": "Distinguish from Bulbous Water Hemlock (Cicuta bulbifera).",
      "content": "Distinguish from Bulbous Water Hemlock ( Cicuta bulbifera ). Closely related to water hemlock not only by family, but genus as well, bulbous water hemlock can be distinguished by its much more feathery, linear leaflets, which are sparsely toothed. Upper leaves are smaller and simple, with small bulbs (bulblets) produced in their axils. This species is also poisonous."
    },
    {
      "title": "Distinguish from Poison Hemlock (Conium maculatum).",
      "content": "Distinguish from Poison Hemlock ( Conium maculatum ) . All parts are very poisonous. A European native that is easily confused with water hemlock simply by name. Because water hemlock is also poisonous, some people also call it \"poison hemlock\" even though this other similar species in the family Apiaceae carries that same common name! You will need to focus primarily on the distinguishing features that set these two species apart: C. maculatum is generally taller, has notable purplish splotches on the stems, sheaths or stipules that narrow into a point as it goes up the leaf stem. The leaves themselves are much more divided than Cicuta maculata; called \"pinnately compound.\" This means that each leaf is made up of several leaflet pairs arranged on opposite sides of the main leaf stalk. Each leaflet is segmented and around 1⁄8 inches (0.32 cm) to 1⁄4 inches (0.64 cm) long."
    },
    {
      "title": "Distinguish from Giant Hogweed (Heracleum mantegazzianum).",
      "content": "Distinguish from Giant Hogweed ( Heracleum mantegazzianum ). Giant hogweed is an introduced noxious weed from Asia, and one that grows to be much larger than water hemlock. It too is within the family Apiaceae , and actually can be more easily confused with cow parsnip (see below) than water hemlock due to size and leaf structure. H. mantegazzianum grows to over 18 ft (5.5 m) in ideal conditions. The first year it will produce vegetation, or continue to produce vegetation until 2 to 5 years later where it will produce flowers, then die afterwards. Giant hogweed produces a single hollow stem that may be as wide as 6 in (15 cm) at the base. These stems also have purple blotches and stiff hairs arising from blisters or bumps that appear along the stem. The leaves of H. mantegazzianum are huge. They measure 10 ft (3.0 m) long and over 5.5 ft (1.7 m) wide. The leaves themselves are alternate, 3-part compound (or with 3 deeply cut leaflets), with deep irregular palmate lobes, and sharp, coarse teeth on all margins. Further up the stem in flowering plants the leaves are smaller but similar shape and often not divided but still deeply 3-lobed. Vegetative plants form rosettes of these huge leaves. Flowers are also enormous, umbels measuring from 2.5 ft (0.76 m) to almost 4 ft (1.2 m) across. They are also white. This plant has serious toxic qualities that causes severe photodermatitis. Skin exposed to the plant's sap first, then the sun, will cause severe skin rashes, blisters, and possibly permanent scarring or discolouration."
    },
    {
      "title": "Distinguish from Cow Parsnip (Heracleum lanatum).",
      "content": "Distinguish from Cow Parsnip ( Heracleum lanatum ). Cow parsnip is also rather large, and like water hemlock, native to North America. It does not get as tall as giant hogweed, only growing 3 ft (0.91 m) to 6 ft (1.8 m) tall. Stems are large and woolly-hairy. Leaves are 3-part compound, palmately compound, coarsely toothed, and almost heart-shaped. They are also quite large, 16 in (41 cm) long and 12 in (30 cm) wide. Leaflets are not as deeply divided as giant hogweed, but more ovate, and divided into 3 or 5 lobes, with broad acute tips. [6] X Research source Flowers are in large compound umbels, which are flat-topped, and white."
    },
    {
      "title": "Distinguish from Wild Carrot or Queen Anne's Lace (Daucus carota).",
      "content": "Distinguish from Wild Carrot or Queen Anne's Lace ( Daucus carota ). This plant has hairy stems, and leaves that are lace-like, finely-dissected and hairy; they look much like garden carrot leaves. Roots are edible, whitish in colour, and look very much like a typical garden carrot. The umbel, when it dries and goes into seed, folds into itself into the shape of a bird's nest. A distinct characteristic of most plants is that in the center of flower umbels, there is a small, red flower."
    },
    {
      "title": "Distinguish from Red Elderberry (Sambucus racemosa).",
      "content": "Distinguish from Red Elderberry ( Sambucus racemosa ). The young shoots of this species can be easily confused with water hemlock. Red elderberry is a rather large shrub in its more mature form. But with young stalks, where the leaves of water hemlock are alternate, red elderberry is opposite. Elderberry leaves are more rounded (less lance-shaped), and are not with 2 or 3 extra leaflets on a several-times pinnate leaf. Leaf margins are also smoother."
    },
    {
      "title": "Distinguish from Water Parsnip (Sium suave).",
      "content": "Distinguish from Water Parsnip ( Sium suave ). Probably the most-often mistaken species for water hemlock. Water parsnip is found in the same areas as water hemlock, and is also a native species to North America, but in order to differentiate this species from water hemlock, look carefully at the leaves. The leaves of water parsnip are only once pinnate, and usually with more narrow leaflets than water hemlock."
    },
    {
      "title": "Distinguish from Western Hemlock (Tsuga heterophylla).",
      "content": "Distinguish from Western Hemlock ( Tsuga heterophylla ). Western Hemlock looks nothing like water hemlock; in fact, it's a large coniferous tree (grows 30 m (98 ft) to 50 m (160 ft) tall) found in the West Coast from Oregon to British Columbia. It was named so because it has a similar smell to the European forb poison hemlock."
    },
    {
      "title": "Avoid ingesting the roots or sap.",
      "content": "Avoid ingesting the roots or sap. Water hemlock is most toxic when the roots are eaten or the sap is ingested. The oily sap contains a cicutoxin that affects the central nervous system, causing extremely violent convulsions and death from respiratory failure within a few hours. Small doses of this sap are lethal, and symptoms of poisoning occur rapidly within 15 to 30 minutes after ingestion."
    },
    {
      "title": "Keep your livestock safe.",
      "content": "Keep your livestock safe. Livestock have been known to eat the leaves of water hemlock without significant adverse effects, however it is not recommended to go ahead and allow animals to graze on these plants when the risk of pulling up and eating the roots is quite high."
    },
    {
      "title": "Know that the results can be deadly.",
      "content": "Know that the results can be deadly. Rabies can be confused with ingestion of water hemlock due to the classic frothing at the mouth. This is followed by tremors, uneasiness, and severe pain in the abdominal area. Grinding of the teeth and clamping of the jaws often occur, with the tongue likely becoming lacerated as a result. These seizures may come in bouts, with relaxation periods in between where loss of muscle control and laboured breathing are experienced. Death soon follows by a matter of a few hours. Larger doses can kill a human or large bovine in a matter of minutes."
    }
  ]
}