{
  "url": "https://www.wikihow.com/Make-Fairy-Dust",
  "title": "How to Make Fairy Dust",
  "steps": [
    {
      "title": "Gather the materials you will need.",
      "content": "Gather the materials you will need. Making fairy dust to sprinkle outside simply requires glitter, in any colors you like, and a non-toxic powder. [1] X Research source The powder you use can vary. You can use talcum powder, sidewalk chalk, which you will need to grind into a powder, or salt. You may also want to get a fun container, such as a small decorative bottle, to hold the fairy dust. Whatever you use to hold the fairy dust, it's a good idea to use something with a sturdy lid. The amounts of glitter and powder you will need varies depending on how much fairy dust you want to make but the ratio of glitter of talcum powder should be 2 to 1. Any glitter will work for this method but buying super fine glitter will make the best fairy dust."
    },
    {
      "title": "Combine the glitter and powder in a bowl.",
      "content": "Combine the glitter and powder in a bowl. Mix the two together until they are completely combined."
    },
    {
      "title": "Put the fairy dust into a small bottle or container.",
      "content": "Put the fairy dust into a small bottle or container. Be sure to close the container securely, so that the fairy dust doesn't get accidentally spilled in your house. You may need to use a funnel to get the fairy dust into a container, depending on how small the opening is. If you don't have one, simply roll up a small piece of paper into a funnel shape and use a piece of tape to keep it in that shape. Cut the bottom of the funnel shape with a pair of scissors, making sure that the bottom of the funnel will fit into the container you want to put the fairy dust in."
    },
    {
      "title": "Give the fairy dust to your child.",
      "content": "Give the fairy dust to your child. Make sure that they play with it outside, as throwing this fairy dust inside will make a horrible mess. Most kids will enjoy simply throwing small handfuls into the air and watching the sparkles fly through the air! Do not let your child eat this fairy dust. It is not edible and could cause problems they ingest it."
    },
    {
      "title": "Gather the materials you will need.",
      "content": "Gather the materials you will need. Edible fairy dust is simply made with sugar and food coloring. [2] X Research source Figure out how much fairy dust you want to make, this will determine how much sugar to use. Perhaps you can try this method for the first time with one cup of sugar. You will also need a bowl to mix the fairy dust in, a pan to cook it in, and a container to store it in. Some people like to put edible fairy dust in a sugar or salt shaker, so that it can be used to dust the fairy dust on food. A shaker like this should be available in most kitchen supply stores."
    },
    {
      "title": "Mix the sugar and food coloring in a bowl.",
      "content": "Mix the sugar and food coloring in a bowl. The ratio of sugar to food coloring will vary, depending on how much fairy dust you are making. Start by adding just a few drops of food coloring to the sugar and mix until the color is spread evenly throughout the sugar. If the color is to your liking simply stop adding food color at this point. If you would like a stronger color, add a few more drops and mix again. You can keep adding color gradually until the color of the sugar is bright enough."
    },
    {
      "title": "Pour the colored sugar onto a pan and put it into an oven preheated to 350 degrees.",
      "content": "Pour the colored sugar onto a pan and put it into an oven preheated to 350 degrees. Cook the sugar for approximately 10 minutes. The sugar is cooked so that the color becomes fixed into the sugar. In essence, the heat of the oven will dry out the food coloring, making it less messy and permanently colored."
    },
    {
      "title": "Pull the sugar out of the oven and let cool to room temperature.",
      "content": "Pull the sugar out of the oven and let cool to room temperature. Once cooled, break the sugar apart if it has melted together at all. You can break the sugar apart by putting it in a strong plastic bag and then hitting the bag with a meat tenderizer or some other heavy kitchen tool, such as a rolling pin."
    },
    {
      "title": "Put the sugar in a container, such as a sugar or salt shaker.",
      "content": "Put the sugar in a container, such as a sugar or salt shaker. The sugar \"fairy dust\" should keep indefinitely, as it is simply sugar covered in food coloring. You can store it in your kitchen cabinet at room temperature."
    },
    {
      "title": "Shake the \"fairy dust\" onto your kids favorite food.",
      "content": "Shake the \"fairy dust\" onto your kids favorite food. The fairy dust will make any meal more colorful and magical. This \"fairy dust\" is great dusted onto a wide variety of foods. It can be added to buttered toast, ice cream, or cereal, anything that will be made more delicious with the addition of a little color and a little sweetness."
    }
  ]
}