{
  "url": "https://www.wikihow.com/Change-Glow-Plugs",
  "title": "How to Change Glow Plugs",
  "steps": [
    {
      "title": "Find the glow plugs in the engine compartment.",
      "content": "Find the glow plugs in the engine compartment. They are usually on top of the cylinder head."
    },
    {
      "title": "Remove the glow plug wires.",
      "content": "Remove the glow plug wires. The glow plug wires are beneath the engine's valve covers. You will find one end attached to the top of the glow plug and the other attached to the engine. Remove the wire attached to the glow plug. Remove the small nut that holds the wires to the glow plugs with a wrench. Push the wire aside. Repeat this process to remove each glow plug wire."
    },
    {
      "title": "Remove the glow plugs carefully, one at a time.",
      "content": "Remove the glow plugs carefully, one at a time. [1] X Research source Loosen each glow plug from their sockets using a ratchet. [2] X Research source"
    },
    {
      "title": "Clean each electrical contact and nut.",
      "content": "Clean each electrical contact and nut. Similar to battery contacts, glow plug wires can become dirty, which can result in a poor electrical connection."
    },
    {
      "title": "Use reamer and ream the glow plug hole for each glow plug.",
      "content": "Use reamer and ream the glow plug hole for each glow plug. [3] X Research source This is just to clean out the glow plug hole, so ream only long enough to remove any buildup."
    },
    {
      "title": "Replace each plug and tighten them down with a ratchet.",
      "content": "Replace each plug and tighten them down with a ratchet. Tighten them just to the point of slight resistance. If you tighten them too much, the next time you need to change the glow plugs you might break one off trying to remove it. This can result in a costly repair."
    },
    {
      "title": "Reattach the electrical wires to each glow plug with a nut using the wrench.",
      "content": "Reattach the electrical wires to each glow plug with a nut using the wrench."
    }
  ]
}