{
  "url": "https://www.wikihow.com/Read-a-Boring-Book",
  "title": "How to Read a Boring Book",
  "steps": [
    {
      "title": "Create well-defined goals for the reading.",
      "content": "Create well-defined goals for the reading. Having clear-cut, well-defined goals increases the chances of success in almost any endeavor. When it comes to reading, you may not be aware of your goals going into the book. However, you can easily create your own goals as you go along. If you're reading a book for class, you probably have a set number of pages or chapters to get through. This can help you have a clear end in sight. If you're reading for pleasure and find yourself struggling, try setting daily reading goals for yourself. You can choose a set number of pages or chapters, and keep yourself motivated by reminding yourself you're only reading a fraction of the book that day. Challenge yourself to learn something from the text. You can learn a great deal from reading, whether it's fiction, nonfiction, or historical texts - even the boring ones."
    },
    {
      "title": "Break up the reading into manageable chunks.",
      "content": "Break up the reading into manageable chunks. If a book is hard to get through, it may seem even more daunting to look at the book as a single work of literature spanning hundreds of pages. Instead of trying to marathon the book from cover to cover, try breaking it up into smaller sections - say, a few chapters every day. As you work your way through the day's section(s), try taking breaks between chapters so you can refresh your mind and rest your eyes before you continue. [1] X Research source Take breaks along the way to help you stay focused. However, make sure you decide beforehand how many breaks you'll take and how often. Don't take breaks whenever you feel like it. Challenge yourself to get through a set reading goal (like the end of a long chapter, or after completing two relatively short chapters). Put your bookmark at the end of that group of chapters. That way you'll be able to see where the end point is as you turn each page, and you'll be more motivated to make it all the way to your resting point."
    },
    {
      "title": "Reduce or eliminate distractions.",
      "content": "Reduce or eliminate distractions. A boring book may tempt you to reach for your cellphone, check your social media, or flip on the television. However, breaking your focus like this will only make it more difficult to get through the book. Instead of giving in to temptation, force yourself to continue without distractions until you get through that day's reading. Find a quiet place where you won't be disturbed (if possible). Try turning off or silencing your cellphone. Keep the television turned off, and stay away from your computer or tablet or have some quiet relaxing music that helps you to focus. If you don't have your own quiet space or if you like to read on the bus, try wearing earplugs while you read. You can use noise-reducing earplugs, or wear headphones and listen to something that will block out noise without distracting you. Instrumental music works best - try something soothing but upbeat, like jazz or certain classical composers."
    },
    {
      "title": "Approach the text with a clear head.",
      "content": "Approach the text with a clear head. Sometimes a boring book can seem even more boring if you're tired, distracted, or unfocused. Try getting into a good reading mindset before you pick up the book. That way you'll be less likely to lose interest or look for reasons to quit for the day. Try to read when you're most awake. Reading a boring book while you're nodding off on the couch will not get you very far. Sometimes writing things out helps you clear your mind and remove distractions. Try doing this before you get started on your reading for the day. Take a few deep breaths before you begin. This can also have a calming, head-clearing effect for some people."
    },
    {
      "title": "Annotate the margins and underline/highlight.",
      "content": "Annotate the margins and underline/highlight. Underlining/highlighting passages is a great way to engage with the text and find your place if you need to refer back to the text at a later date. Annotating the margins with notes, questions, or observations is another great way to stay engaged, as it forces you to ask questions of the text and look for significant passages. Some things to look for as you read include: definitions or relevant terms (especially those you're not familiar with) methods and results (for text books) cause-and-effect relationships references to earlier material, as this will probably be an important concept"
    },
    {
      "title": "Synthesize material and put it in your own words.",
      "content": "Synthesize material and put it in your own words. Another good learning tool to help you stay focused is to extract important material from the text and re-phrase it in your own words. This forces you to pay close attention and to actually process what you read, rather than passively skimming the text. Reading actively requires you to extract and bring together related pieces of information from the text. By doing this, you may find that a passage from the middle or end of the book is directly related to an earlier section in ways you might have missed. As you read, try to paraphrase difficult passages in your own words. This has been shown to help students retain information. [2] X Research source"
    },
    {
      "title": "Force yourself to ask/answer comprehensive questions.",
      "content": "Force yourself to ask/answer comprehensive questions. In addition to synthesizing material, you should force yourself to ask questions of the text. Then try to find the answer, which may come from reading onward or from quickly referring back to previous pages or chapters (in which case underlining/highlighting/annotating will come in handy). Try to decipher what the author is trying to accomplish with each chapter you read. How does it stand alone, and how does it fit into the larger context of the book's intended goal(s)? How does each chapter you read build off of the previous chapters? Are they related, or do they seem disconnected? Was this a deliberate choice by the author? Ask yourself, \"Can I learn anything from this text?\" Surely the answer is yes; it's just a matter of figuring out what it is you can learn. Ask yourself questions about any passages or sections that are difficult/confusing. Try to answer those questions before moving on, either by reflecting on the material you've just read or browsing through your underlined and annotated sections from earlier in the book."
    },
    {
      "title": "Know that there's always a payoff.",
      "content": "Know that there's always a payoff. No matter how boring a book may seem in the moment, there's always something that makes it worth reading. Remember that any published piece of writing was deemed to be important, interesting, and well-written by someone who professionally edits books, so if you haven't found that payoff yet it's still ahead somewhere. [3] X Research source The payoff is coming at some point. It may not arrive until the end or near the end, but there is almost always a payoff at some point. Whether it's the thrill you experience when the action finally delivers a plot twist, the new knowledge you'll take away from the book, or the realization that the book was actually about something much deeper than you'd realized all along, there's definitely something to be gained by finishing the book. If you don't finish the book, you may never know why so many people consider it a classic."
    },
    {
      "title": "Think about how much money you'd waste by not finishing.",
      "content": "Think about how much money you'd waste by not finishing. Not finishing a book is essentially a waste of money. This may not be a problem if you borrowed the book from a friend or through your local library, but if you purchased that book you're missing out on a return for your investment. If you bought the book, you may have invested $10 to $20 in that book (possibly more if it's a hard-cover copy). If you only read the first few chapters of the book, you effectively wasted most of the money you spent on it. Try to think about the book as any other form of entertainment. You wouldn't buy tickets to a play or a sports game and leave after 10 minutes, so why do the equivalent with a book? Even if it's not a waste of money, and you are reading if for school, think of the consequences it will have on your grade if you don't read it."
    },
    {
      "title": "Try to learn dedication as a life skill.",
      "content": "Try to learn dedication as a life skill. Working through a boring book has its rewards, and those rewards extend beyond the satisfaction of finishing the text. Think of it as training for adulthood and an exercise in maturity or self-discipline. [4] X Research source Think of getting through a boring book as training for life. There will be times in life when you have to do something unenjoyable. If you decided that you didn't feel like finishing your work assignments at your place of employment, you'd be fired pretty quickly. If you don't do the assignments you're given in school, your grades will suffer."
    },
    {
      "title": "Give yourself a reward when you finish.",
      "content": "Give yourself a reward when you finish. If you're really struggling to finish a book, try giving yourself some kind of tangible incentive. Reward yourself with something you like at the end, or withhold something you like from yourself until you finish the book. Having an enjoyable reward in sight might be the \"carrot on the stick\" you need to keep working until you reach the end. You might decide that when you finish the book you will treat yourself to a nice dinner, an ice cream treat, or a fancy bottle of wine (if you're old enough to drink). You may also want to try withholding certain unnecessary treats/perks from yourself until you finish. For example, you may decide not to have any dessert foods until you finish the book."
    }
  ]
}