{
  "url": "https://www.wikihow.com/Sadfishing",
  "title": "What is Sadfishing?",
  "steps": [
    {
      "title": "\"Sadfishing\" means making sad posts on social media to “fish” for sympathy.",
      "content": "\"Sadfishing\" means making sad posts on social media to “fish” for sympathy. It refers to people who exaggerate their emotional problems in order to gain likes or comments. These posts tend to be vague or confusing, leaving viewers with more questions than answers. Sadfishing has a negative connotation, and people generally view it as disingenuous, attention-seeking behavior. [1] X Research source Rebecca Reid coined the term in a 2019 article that criticized model Kendall Jenner’s decision to “open up” about her struggle with acne on Instagram. The post turned out to be a paid brand deal with a skincare company. In her article, Reed uses this situation as an example of “sadfishing” because Jenner posted images of her clear, glowing skin, instead of unfiltered photos showcasing her skin before treatment. [2] X Research source"
    },
    {
      "title": "“Sadfishing” doesn't refer to people genuinely opening up about their struggles.",
      "content": "“Sadfishing” doesn't refer to people genuinely opening up about their struggles. Sometimes, people post about difficult things they’re going through to express themselves, connect with their community, or ask for help. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The term “sadfishing” does not refer to these genuine shows of vulnerability. It only refers to exaggerated, disingenuous, or cryptic posts made to drive up follower engagement."
    },
    {
      "title": "How to tell the difference",
      "content": "How to tell the difference If you’re trying to figure out whether someone’s post is sadfishing or a sincere cry for help, these are some signs that the poster is genuinely struggling: They’ve been withdrawing or isolating themselves socially You've noticed a change in the type of posts they make, especially if the posts suddenly have a much more negative tone [4] X Research source They're posting about giving their possessions away or stating that they won’t be here for much longer They’ve been posting about depression symptoms, such as sleep disturbances, loss of interest in normal activities, lack of energy, reduced appetite, feelings of worthlessness, or thoughts of self-harm [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "",
      "content": "Sadfishing might look like : Someone posting a cryptic message like “I can never do anything right,” or \"At least now I know who my real friends are,\" without any context or further explanation. A celebrity or influencer making a post about their struggle with body positivity that turns out to be a paid advertisement for a problematic product, like “slimming” tea or a weight loss supplement Someone posting a “sad” selfie or tearful picture without any further information, resulting in tons of concerned comments from followers Sadfishing does not look like : Someone posting about their struggle with anxiety in order to raise awareness about treatment options, or destigmatize discussions of mental health issues. Someone posting about a difficult event, such as a major break-up or losing a loved one, to share this important piece of info with the people in their life Someone posting a genuine cry for help because their mental health problems have become severe, and they don’t know what to do"
    },
    {
      "title": "Most people who sadfish are genuinely experiencing difficult emotions.",
      "content": "Most people who sadfish are genuinely experiencing difficult emotions. In fact, some research suggests that oversharing on social media is linked to feelings of depression, loneliness, and low self esteem. [6] X Research source Not everyone who sadfishes is experiencing a serious mental health condition, but they are likely searching for connection online, possibly because they’re lacking it in their real life. Factors that may be related to sadfishing include: Depression or anxiety : These conditions can cause difficult emotions and increased stress levels. [7] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If someone is struggling to manage their symptoms, they may turn to social media for support. Personality disorders : Conditions like Histrionic Personality Disorder involve symptoms like exaggerated displays of emotion and increased attention-seeking behavior, which could lead to sadfishing on social media. [8] X Research source Other personality disorders such as Borderline Personality Disorder (BPD) or Narcissistic Personality Disorder (NPD) may have similar effects. Anxious Attachment Style : Some research shows that those who have an anxious attachment style may be motivated to use social media to decrease feelings of loneliness. [9] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Low social support : If someone feels like they don’t have friends or family members to turn to in difficult circumstances, they may be more inclined to search for this support online. [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Don't accuse someone of sadfishing.",
      "content": "Don't accuse someone of sadfishing. It can be frustrating to encounter posts that seem like sadfishing, but falsely accusing someone who is actually struggling has severe consequences. It's always best to respond with empathy and concern, rather than judgment. In fact, adolescents who open up about mental health struggles online may end up being bullied if others suspect them of sadfishing. This only adds to their distress and exacerbates their symptoms. [11] X Research source If you're a parent, teach your child not to accuse others of sadfishing, and to show patience and understanding if a peer posts about their mental health."
    },
    {
      "title": "Take all posts about depression or suicidality seriously.",
      "content": "Take all posts about depression or suicidality seriously. It’s impossible to distinguish between sadfishing and a genuine cry for help, so it is always best to air on the side of caution. If someone in your life is making concerning posts about their mental health, follow up with them and offer your support . Show as much empathy, concern, and understanding as possible. [12] X Research source Reach out to the person directly, and tell them that they can talk to you about what they’re going through without fear of judgment. [13] X Research source Encourage them to seek out treatment with a therapist or counselor. Let them know that you can help them find resources and schedule appointments. Call 911 if you have an immediate concern about their physical safety. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Make an effort to connect with this person in a genuine way.",
      "content": "Make an effort to connect with this person in a genuine way. Many people sadfish because they’re feeling a genuine lack of support or connection in their life. Reaching out to them and offering to spend time together can go a long way! Just be sure to contact them directly via a text or phone call, rather than commenting publicly on their post. [15] X Research source Here are some examples of what to say: “Hey, I saw your post, and I’m so sorry you haven’t been feeling well emotionally lately. Are you free to grab a cup of coffee this week? I’m here for you!” “I saw your post about what you’ve been going through, and I wanted to tell you I’m here for you. Are you free to meet up and spend some time together?” “Hey, I saw your post earlier today, and I wanted to make sure you know you can talk to me about anything. I’d love to catch up in-person if you’re free.”"
    },
    {
      "title": "If you’re a parent, talk to your child about their feelings.",
      "content": "If you’re a parent, talk to your child about their feelings. It’s important to address sadfishing if you notice it on your child’s accounts, since it often hints at deeper emotional issues like loneliness, anxiety, or low self-esteem. [16] X Research source Talking about these things can help your child process them. Ask them if they’ve been having trouble at school, or if things at home have been stressing them out. [17] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Simply setting reasonable limits on your child’s social media use can also help address sadfishing. Plus, research shows that too much time on social media can result in negative effects for children and teens, such as sleep disruption, exposure to bullying, and even depression or anxiety. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Encourage your child to explore offline activities, like hobbies, sports, and spending time with friends in-person. These things can help boost their mood and self-esteem! [19] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Journal about your emotions.",
      "content": "Journal about your emotions. If you feel tempted to share vulnerable information about your mental health on social media, you’re likely looking for an outlet to express and process difficult feelings. Journaling is a healthy, cathartic way to work through these feelings, without the negative consequences that can come from oversharing on social media. [20] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Lean on friends and family members.",
      "content": "Lean on friends and family members. You may feel compelled to sadfish because you’re feeling a lack of connection with the people in your life, and you’re searching for a substitute on social media. Unfortunately, sadfishing doesn’t quell these feelings of loneliness—in fact, it tends to increase them. [21] X Research source Instead of seeking out connection online, make an effort to spend more quality, face-to-face time with loved ones. This can help you feel the warmth, love, and support you’ve been lacking!"
    },
    {
      "title": "Talk to a therapist or counselor.",
      "content": "Talk to a therapist or counselor. Sadfishing often stems from real feelings of loneliness, anxiety, or insecurity. And, though this is not always the case, oversharing on social media can also be associated with mental health conditions like depression. [22] X Research source If any of these issues factor into your tendency to sadfish, a licensed therapist or counselor can help. Ask a trusted friend or family member for a referral if they work with a therapist, or check out online directories to choose the right therapist for you. [23] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    }
  ]
}