{
  "url": "https://www.wikihow.com/Searing-Smite-5e",
  "title": "What Is the Searing Smite Spell in D&D 5e? Everything You Need To Know",
  "steps": [
    {
      "title": "Searing Smite is a 1st-level spell that deals fire damage and ignites foes.",
      "content": "Searing Smite is a 1st-level spell that deals fire damage and ignites foes. Essentially, the Searing Smite spell adds a little heat to a plain old weapon attack—and lets you deal extra damage to the enemies you choose to target. While Searing Smite doesn’t do a ton of extra damage right away, the fact that it can set enemies on fire means you can potentially keep dealing damage over time—making it a fairly useful spell to have in your arsenal! [1] X Research source Casting time: Bonus action Range: Self Components: Verbal Duration: Up to 1 minute School: Evocation Save: Constitution Concentration: Yes Ritual: No"
    },
    {
      "title": "Searing Smite lets the caster deal 1d6 fire damage with a melee attack.",
      "content": "Searing Smite lets the caster deal 1d6 fire damage with a melee attack. You can use a bonus action to cast Searing Smite. The next time your PC lands a melee attack, they’ll deal 1d6 fire additional fire damage to their target (in addition to the damage from the regular attack). Then, the target ignites in flames and must make a Constitution (CON) saving throw at the start of each subsequent turn for the spell's duration. [2] X Research source Searing Smite can be upcast at higher levels. While it’s usually a level 1 spell, upcasting it increases the initial fire damage by 1d6 per level. So, for example: Casting Searing Smite at 2nd level deals 2d6 fire damage, 3rd level deals 3d6 damage, and 4th level deals 4d6 damage, all the way up to 9d6 damage at 9th level. Saving throws determine a creature’s ability to withstand a harmful effect—and Constitution saving throws specifically measure a creature’s hardiness and physical resilience."
    },
    {
      "title": "Targets that fail their saving throws remain ignited for the duration.",
      "content": "Targets that fail their saving throws remain ignited for the duration. When you hit a target with Searing Smite, they’re automatically ignited—but their CON save determines how long they remain on fire. If the target makes a successful Constitution saving throw at the start of their turn, the spell ends and they’re no longer ignited. If they continue failing each saving throw, the spell lasts for its entire duration, which is 1 minute (and they remain ignited). [3] X Research source Remember that effects capable of dousing flames (like water) can end the spell. Targets can also choose to spend an action dousing the flames if they’re hit with Searing Smite in combat. Because it lasts up to 1 minute, Searing Smite is classified as a Concentration spell, meaning your PC must focus on maintaining it (rather than casting other Concentration spells) for the duration."
    },
    {
      "title": "You can attack an enemy after casting Searing Smite.",
      "content": "You can attack an enemy after casting Searing Smite. Because Searing Smite only takes a bonus action to cast, you can use your PC’s full action afterward to attack a foe in battle, making it an easy, convenient spell. However, it’s important to remember that Searing Smite only affects your next successful melee attack after casting; you can’t keep hitting enemies and dealing 1d6 fire damage after doing it once already. [4] X Research source If you miss an attack roll after casting Searing Smite, the spell remains active; it’ll last as long as you’re still concentrating on it and take effect the first time you successfully hit an enemy with a melee weapon. However, it’s important to remember that the spell’s 1-minute duration applies regardless of whether it’s on your weapon or you’ve managed to hit an enemy and cause ongoing fire damage. Therefore, the sooner you hit an enemy after casting the spell, the more damage potential you’ll get out of it—since it’ll spend more time slowly damaging an ignited enemy."
    },
    {
      "title": "The Searing Smite spell can apply to attacks of opportunity.",
      "content": "The Searing Smite spell can apply to attacks of opportunity. In D&D 5e, you can take attacks of opportunity on enemies that leave your PC’s melee range in combat. Attacks of opportunity take a reaction, and if you hit, you can deal extra damage to a fleeing enemy. Because the rules of Searing Smite state that you’ll deal fire damage “the next time you hit a creature with a melee attack,” and opportunity attacks qualify as melee attacks, they work with Searing Smite. [5] X Research source Searing Smite can do more than ignite enemies; it can also ignite objects. When you make a melee attack on an object with Searing Smite activated, you can apply both the initial damage and the lingering burning effect to that object."
    },
    {
      "title": "You must cast Searing Smite before knowing whether an attack will hit.",
      "content": "You must cast Searing Smite before knowing whether an attack will hit. Basically, you can’t wait to find out if an attack will land before deciding to cast Searing Smite. If you’re going to use it to attack an enemy, you must cast Searing Smite before making your attack roll (and discovering the outcome of that roll). Thankfully, even if your first attack misses, it’s possible to maintain concentration on Searing Smite and use it on a future attack. [6] X Research source Other spells (like Divine Smite) let you wait until you know your attack will land—but Searing Smite does not. Remember that Searing Smite doesn’t apply to ranged weapons (like bows, slings, or thrown weapons). You can only use it with melee weapons!"
    },
    {
      "title": "Use Searing Smite against creatures vulnerable to fire damage.",
      "content": "Use Searing Smite against creatures vulnerable to fire damage. While extra fire damage is helpful in almost any situation, Searing Smite can be especially handy against creatures vulnerable to fire damage. That’s because “vulnerability” to a specific damage type means creatures take twice as much of it—so you can finish off an enemy vulnerable to fire quickly with Searing Smite. [7] X Research source Common creatures vulnerable to fire in D&D include: Trolls. Trolls are large, monstrous giants capable of regenerating their health in battle. However, fire and acid can prevent them from regenerating. Awakened Shrubs. Awakened shrubs are sentient plant creatures that druids can create. However, because they’re made of plant matter, they can catch fire (and burn) quickly. Mummies. Mummies are fearsome undead creatures that typically linger in tombs and lost temples, and because they’re covered in linen wraps, they’re vulnerable to fire. Ice Mephits. Ice mephits are small elemental creatures; they’re vulnerable to fire because they’re essentially made of ice."
    },
    {
      "title": "Set enemies on fire with Searing Smite to distract them in combat.",
      "content": "Set enemies on fire with Searing Smite to distract them in combat. If an enemy catches fire, they’ll often react to try and douse the flames—which takes an action to do. In other words, setting an enemy on fire can be a clever way to force them to waste an action; instead of attacking your PC or casting a powerful spell, they have to stop themselves from taking fire damage. [8] X Research source You can also use Searing Smite to start a fire somewhere quickly! While other spells can start fires (like Fire Bolt or Create Bonfire), Searing Smite can be a handy alternative if no other spells are available. DM Tip: Ask yourself whether the creature a PC just ignited with Searing Smite would immediately extinguish the fire or keep fighting. In most cases, it’s probably a good idea to douse the flames and stop that enemy from taking even more damage. However, it’s possible you might be running an enemy more focused on attacking the PCs than protecting themselves—so use your best judgment on a case-by-case basis!"
    },
    {
      "title": "Stack Searing Smite with other damage-dealing spells simultaneously.",
      "content": "Stack Searing Smite with other damage-dealing spells simultaneously. If you’re playing a paladin character, their Divine Smite ability (a second-level paladin feature) can deal extra radiant damage while striking an enemy. Because Divine Smite is a feature that can be used while taking the attack action and Searing Smite is a spell that costs a bonus action to cast, the two can be used in a single attack—to deal even more damage to enemies. [9] X Research source Alternatively, pair the Booming Blade spell with Searing Smite. Booming Blade takes an action to cast; once used to strike a target, it causes the target to take 1d8 thunder damage if they try to move. Booming Blade is available to artificers, sorcerers, warlocks, and wizards. However, if you have a paladin PC, you can learn it using the Magic Initiate feat (and pair it with Searing Smite)."
    },
    {
      "title": "Avoid using Searing Smite on enemies with high Constitution scores.",
      "content": "Avoid using Searing Smite on enemies with high Constitution scores. In D&D, Constitution is an ability score that measures your PC’s vitality, health, and durability. Because a Constitution save is required to end the effects of Searing Smite, enemies with a high Constitution score are more likely to shrug off the fire damage. If you see an enemy escape some other Constitution effect easily in battle, think twice before targeting them with Searing Smite. [10] X Research source"
    },
    {
      "title": "Paladins and rangers are the only classes with Searing Smite.",
      "content": "Paladins and rangers are the only classes with Searing Smite. Searing Smite is included on the paladin’s spell list, so choosing this spell is easy if you’re playing a paladin! They’re warriors devoted to upholding a sacred oath and specialize in dealing lots of damage in a single hit—which Searing Smite can do. On the other hand, ranger characters have access to Searing Smite after it was added as an optional ranger spell in the Tasha’s Cauldron of Everything sourcebook. [11] X Research source"
    },
    {
      "title": "Searing Smite is very useful, dealing lots of damage to enemies.",
      "content": "Searing Smite is very useful, dealing lots of damage to enemies. It’s a good choice against enemies with lots of hit points (which measure how much damage a creature can take) and a handy supplement for characters that primarily use weapons to deal damage. Searing Smite is especially helpful for low-level paladins (because it’s a level 1 spell) who want to be even more effective against powerful foes. [12] X Research source Rangers and paladins don’t have as many spell slots as other classes with spellcasting abilities, so you might prefer not to cast it when trying to conserve your spell slots. Nonetheless, since it only costs a bonus action to cast, Searing Smite can be incredibly helpful in a pinch."
    }
  ]
}