{
  "url": "https://www.wikihow.com/How-Well-Do-You-Know-Me-Questions",
  "title": "How Well Do You Know Me Questions",
  "steps": [
    {
      "title": "See how well your friends know you with a variety of fun questions.",
      "content": "See how well your friends know you with a variety of fun questions. Sure, your pals may know all the tea in your personal life—but how well do they really know you? Toss around a few of these interesting questions and see what you discover: “If I could travel anywhere, where would I go?” \"Am I a morning person or a night owl?\" \"Who is my celebrity crush?\" \"What's my favorite podcast?\" \"Would I rather have hands for feet, or feet for hands?\" \"Would I rather live by the ocean or in the mountains?\" \"What's my favorite ice cream flavor?\" “What is my favorite movie?” “What is my favorite food?” \"What is my favorite restaurant?\" \"Would I rather live in the heart of a bustling city, or out in the secluded country? \"If I had a time machine, what time would I visit and why?\" \"If I were an animal, what animal would I be?\" \"What is my favorite sport to play?\" \"If I could meet one historical figure, who would it be?\" “What's my favorite TV show?” \"What are my plants' names?\" \"Would I rather be an astronaut or a deep sea diver?\" \"Who was my favorite teacher growing up?\" “What is my favorite song or artist?” “Am I a dog or a cat person?” “Do I have any allergies?”"
    },
    {
      "title": "Get to know your partner better with these fun questions.",
      "content": "Get to know your partner better with these fun questions. No plans? No problem! Whip out a variety of fun, get-to-know-you questions with your partner and see where the conversation goes. Chances are, you'll both learn something new about one another! “How did we meet?” \"What's my star sign?\" \"Do I prefer sweet or savory foods?\" “What food do I hate?” \"Do I prefer dark, milk, or white chocolate?\" “What is my middle name?” \"What has been my most embarrassing moment?\" \"What would be my dream vacation?\" \"What size shoe do I wear?\" “When is my birthday?” “What are my parents' names?” \"Do I like talking on the phone, texting, or chatting in person more?\" \"What pets did I have growing up?\" “What are my talents?” “What's my favorite smell?” “What is one of my best childhood memories?”"
    },
    {
      "title": "Take your conversation with your partner to a new level.",
      "content": "Take your conversation with your partner to a new level. No matter how well you know your partner (or how well you think they know you), there's always something new that you can learn. Break the ice and take an even deeper dive as you discover more about your partner with these questions: \"What's something that always cheers me up when I'm sad?” “What is my biggest insecurity?” \"Do I like talking on the phone, texting, or chatting in person more?\" \"If I had the choice to become immortal, would I do it?\" “If I could bring anyone back to life, who would it be?” “Who was my childhood hero?” “What does my ideal life look like?” “What is my biggest fear?” “What is my biggest secret?” “What is my biggest insecurity?” “What is my biggest pet peeve?” “What's something that always cheers me up when I'm sad?” “What do I like most about you?”"
    }
  ]
}