{
  "url": "https://www.wikihow.com/Blink-Camera-Blinking-Green",
  "title": "Blink Camera Blinking Green: Why It Happens & How to Fix It",
  "steps": [
    {
      "title": "Not enough power.",
      "content": "Not enough power. Check that your camera has battery life or power. The Blink Mini compact camera requires a connection via USB to a 5V 1 Amp power supply."
    },
    {
      "title": "The internet is not working properly.",
      "content": "The internet is not working properly. You can search the internet for \" Internet Speed \" and use any results to test your Internet speed; you need a minimum of 2Mb/s to send and receive images from your camera. [1] X Research source If your internet is slow, use the tips in this wikiHow article to make it faster like rebooting your router, which is often a very effective troubleshooting step to get your Blink camera working again. [2] X Research source"
    },
    {
      "title": "The password is incorrect.",
      "content": "The password is incorrect. If you recently changed the Wi-Fi password, your Blink camera will be unable to access the network or reconnect. To fix this, open the app (the Blink Home Monitor app) and tap Change Wi-Fi next to your camera to enter the new password."
    },
    {
      "title": "Blink's servers might be down.",
      "content": "Blink's servers might be down. Go to https://downdetector.com/status/blink-security/ or check online to see if the servers are offline. If the servers are offline, your Blink camera won't work."
    },
    {
      "title": "Consider environmental effects.",
      "content": "Consider environmental effects. Harsh weather conditions, like strong storms or intense sunlight, can interfere with your camera's ability to function and cause the green light to blink. Also consider light sources. Extreme brightness or complete darkness can change how your camera functions."
    },
    {
      "title": "Clean dirt and debris from the camera.",
      "content": "Clean dirt and debris from the camera. Spider webs, dust, and dirt can cause your camera to stop working properly and start a blinking green light."
    },
    {
      "title": "Power-cycle it and the Sync Module (if you have it).",
      "content": "Power-cycle it and the Sync Module (if you have it). Simply remove the back cover and batteries from your camera, wait 10 seconds, then reinsert them. [4] X Research source If you have a Sync Module, unplug it from the power source for 10 seconds, then plug it back in. [5] X Research source"
    },
    {
      "title": "Reset the camera.",
      "content": "Reset the camera. You can try resetting the camera if nothing else works. While it's plugged in, press the small button on the bottom of the camera using a small tool, like a paperclip or small screwdriver (safety pins or thumbtacks are not recommended for this). If pressing the button while the camera is on doesn't work, try these steps: Unplug the camera. Press and hold the Reset button as you plug the camera back in and it powers on. Release and press the Reset button again when the camera turns on. All settings will reset to factory settings and you will need to reconfigure the camera to use it. [6] X Research source"
    },
    {
      "title": "Contact Blink support.",
      "content": "Contact Blink support. Go to Blink's support page to get the phone numbers to call or the instructions on submitting a web ticket. It's not entirely impossible that you received a faulty unit. If it's still under warranty, you could get a free camera!"
    }
  ]
}