{
  "url": "https://www.wikihow.com/Embed-a-SQL-Query-in-Microsoft-Excel",
  "title": "How to Embed a SQL Query in Microsoft Excel",
  "steps": [
    {
      "title": "Go to Data tab and select From Other Sources as shown in the screen shot below.",
      "content": "Go to Data tab and select From Other Sources as shown in the screen shot below."
    },
    {
      "title": "Select “From Data Connection Wizard” in the drop down.",
      "content": "Select “From Data Connection Wizard” in the drop down."
    },
    {
      "title": "Data Connection Wizard will open.",
      "content": "Data Connection Wizard will open. Select “ODBC DSN” from the available option and click “Next”."
    },
    {
      "title": "Connect to ODBC Data Source window appears.",
      "content": "Connect to ODBC Data Source window appears. Where a list of database available in our organization will be displayed. Select the appropriate database and click on “Next”."
    },
    {
      "title": "Select Database and Table window appears.",
      "content": "Select Database and Table window appears."
    },
    {
      "title": "We can select the database and the table from where we wish to pull the data.",
      "content": "We can select the database and the table from where we wish to pull the data. So, select the database and table as appropriate in our case."
    },
    {
      "title": "Select Finish in “Save Data Connection File and Finish” window.",
      "content": "Select Finish in “Save Data Connection File and Finish” window. This window will pull up the File Name based on our selection in previous screens."
    },
    {
      "title": "Import Data window appears where we can select options as per our need and click OK.",
      "content": "Import Data window appears where we can select options as per our need and click OK."
    },
    {
      "title": "Select “From Data Connection Wizard” in the drop down.",
      "content": "Select “From Data Connection Wizard” in the drop down."
    },
    {
      "title": "Go to Data tab and Click on Connections.",
      "content": "Go to Data tab and Click on Connections. Click on Properties in the following window."
    },
    {
      "title": "Go to Definitions tab in the following window.",
      "content": "Go to Definitions tab in the following window."
    },
    {
      "title": "Write SQL query in “Command Text” and Click OK.",
      "content": "Write SQL query in “Command Text” and Click OK. Excel will display the result as per the query."
    },
    {
      "title": "Now go to Microsoft Excel and validate if the results are as per the SQL Query written.",
      "content": "Now go to Microsoft Excel and validate if the results are as per the SQL Query written."
    }
  ]
}