{
  "url": "https://www.wikihow.com/Recover-Deleted-Text-Messages-on-Android-Without-App",
  "title": "Easily Recover Deleted Texts on Android without an App",
  "steps": [
    {
      "title": "Open Messages.",
      "content": "Open Messages. It's the default messaging app on your Samsung Galaxy phone."
    },
    {
      "title": "Tap ⋮.",
      "content": "Tap ⋮ . This three-dot menu icon is near the top right corner of your screen and will drop down a menu."
    },
    {
      "title": "Tap Trash or Recycle Bin.",
      "content": "Tap Trash or Recycle Bin . You'll see either wording depending on your region. A list of all the text threads you've deleted and individually deleted messages will appear here."
    },
    {
      "title": "Long-tap on the message you want to restore.",
      "content": "Long-tap on the message you want to restore. If you tap on it too quickly, you'll see the message in a new window. Once you long-tap a message, you'll see it highlighted to indicate that it is selected. You can tap more messages to restore them as well."
    },
    {
      "title": "Tap the Restore icon.",
      "content": "Tap the Restore icon. It looks like a curved arrow pointing in a counterclockwise motion and is in the lower-left corner of your screen."
    },
    {
      "title": "Open Messages.",
      "content": "Open Messages. It's the messaging app from Google, so it's usually the default one for many non-Samsung Androids, including the Pixel. This method only recovers archived messages. Deleted messages are permanently gone."
    },
    {
      "title": "Tap the menu icon (☰ or ⋮).",
      "content": "Tap the menu icon ( ☰ or ⋮ ). Depending on your device, you'll see either the three-dot or three-lined menu icon in the top left corner or top right corner of your screen."
    },
    {
      "title": "Tap Archived.",
      "content": "Tap Archived . You'll see this near the middle of the menu. All your deleted text messages will appear."
    },
    {
      "title": "Press and hold to select your message.",
      "content": "Press and hold to select your message. The message will open in a new window if you simply tap it. Go back to the list view and long-tap it."
    },
    {
      "title": "Tap the Restore icon.",
      "content": "Tap the Restore icon. It looks like a folder with an upwards-pointing arrow in it. [1] X Research source The message will again appear in your conversation!"
    },
    {
      "title": "Ask your carrier.",
      "content": "Ask your carrier. If you signed up through your carrier to have your text messages backed up, you could recover your deleted messages. However, if you don't pay extra for this service or your carrier doesn't offer it, you most likely cannot recover deleted messages."
    },
    {
      "title": "Reach out to the sender.",
      "content": "Reach out to the sender. You can try this if nothing else works. It's not the most ideal plan, but the other person can re-send the text message that you accidentally deleted."
    },
    {
      "title": "Archive instead of deleting.",
      "content": "Archive instead of deleting. Lots of services offer these two different features. Archiving will not delete the text, but hide it from your view. Deletion, in this case, is generally a permanent action that you want to avoid."
    },
    {
      "title": "Back up with Google Drive.",
      "content": "Back up with Google Drive. Chances are high that if you have an Android phone, you have a Google account. Set up Google Drive to back up your texts so you'll never lose one again. To do this, open your phone's Settings, go to Google > Backup , and make sure the toggle next to \"Backup by Google One\" is on. Each Google One backup includes compatible apps, photos & videos, SMS messages, call history, device settings, and Google account data."
    },
    {
      "title": "Use a 3rd party app to backup and recover texts.",
      "content": "Use a 3rd party app to backup and recover texts. You also have the option to use 3rd party apps to make sure you never lose deleted texts! Apps like WhatsApp, Pulse, and more offer to back up your texts. You can also sign up for free backup services like SMS Backup & Restore ."
    }
  ]
}