{
  "url": "https://www.wikihow.com/Calculate-an-Installment-Loan-Payment",
  "title": "How to Calculate an Installment Loan Payment",
  "steps": [
    {
      "title": "Find your loan information.",
      "content": "Find your loan information. The loan information is in your loan documents. If you are estimating a payment before applying to a loan you can just plug in estimates. Speak with the loan originator if you have problems locating any details. Note that typically the tax is not included in the loan principle unless it is specifically rolled into the loan. There are two types of taxes. One is a property tax and the other is a transfer tax. Either party may pay either tax. [3] X Research source In the United States for non-foreclosure properties, the seller generally pays the transfer tax, on some foreclosures the buyer pays. Both sides usually pay their prorated portions of the property tax due up to the date of sale for the seller and from the date of sale for the buyer. [4] X Research source A lender can roll these taxes into the loan if the property appraises high enough to allow enough equity or there is enough of a down payment to roll them in and have the required down still."
    },
    {
      "title": "Learn the equation to calculate your payment.",
      "content": "Learn the equation to calculate your payment. The equation to find the monthly payment for an installment loan is called the Equal Monthly Installment (EMI) formula. It is defined by the equation Monthly Payment = P (r(1+r)^n)/((1+r)^n-1). The other methods listed also use EMI to calculate the monthly payment. [5] X Research source r: Interest rate . This is the monthly interest rate associated with the loan. Your annual interest rate (usually called an APR or annual percentage rate) is listed in the loan documents. To get the monthly interest rate that you need, simply divide the annual interest rate by 12. For example, an 8% annual interest rate would be divided by 12 to get a monthly interest rate of 0.67%. This would then be expressed as a decimal for the equation by dividing it by 100 as follows: 0.67/100=0.0067. So 0.0067 will be the monthly interest rate used in these calculations. n: Number of Payments . This is the total number of payments made over the life of the loan. For example, in a three year loan paid monthly n = 3 x 12 = 36. P: Principal . The amount of the loan is called the principal. This is typically the final price after tax of the asset purchased less any down payment."
    },
    {
      "title": "Plug your information into the equation.",
      "content": "Plug your information into the equation. In the above example n = 36, we will use 0.67% for the monthly interest rate (from an annual 8%), and $3,500 for the principal. So filling this out, Monthly Payment = $3,500*(0.08(1+0.0067)^36)/((1+0.0067)^36-1). Write out the formula with your numbers even if you feel comfortable working with it. It can eliminate simple math errors. Solve the parentheses first. Simplify the first part of the equation to $3,500*(0.0067(1.0067)^36)/((1.0067)^36-1). Handle the exponents. This then becomes $3,500*((.0067(1.272)/(1.272-1)) Finish the parts still in parenthesis. This results in $3,500*(0.008522/0.272) Divide and Multiply the rest. The result is $109.66."
    },
    {
      "title": "Understand what that number means.",
      "content": "Understand what that number means. In this example, the formula resulted in a payment of $109.66. That means you would make 36 equal payments of $109.66 for a loan of $3,500 at an 8% interest rate based on our example. Try changing some numbers in order to understand the impact of different interest rates or term length of the loan on the monthly payment amount."
    },
    {
      "title": "Open Microsoft Excel.",
      "content": "Open Microsoft Excel."
    },
    {
      "title": "Identify your loan information.",
      "content": "Identify your loan information. This is part of any method used to calculate a payment for an installment loan. You will need to know the total amount financed or principal, the number of payments and the interest rate. Write these down or enter them into cells in Excel to use later."
    },
    {
      "title": "Choose the cell where you want the payment.",
      "content": "Choose the cell where you want the payment. The cell you click on in Excel does not matter unless you want the information in a certain place. This is based on user preference."
    },
    {
      "title": "Use PMT formula.",
      "content": "Use PMT formula. In the cell where you want the payment listed, type the = sign or click the fx button in Excel. The fx button is on the top part of the screen below the primary toolbar unless you have customized Excel. [6] X Research source"
    },
    {
      "title": "Choose either manual or dialog box aided entry.",
      "content": "Choose either manual or dialog box aided entry. If you click the fx, enter PMT into the search box and select the PMT function. It will bring up a dialog box to enter the information. You can also choose to enter the data by hand into the equation “=PMT(Rate, Nper, Present Value, Future Value, Type)”. Clicking the fx button is preferred if you need help remembering the formula. [7] X Research source"
    },
    {
      "title": "Enter the information into the popup box.",
      "content": "Enter the information into the popup box. After you clicked fx and selected PMT, you then enter the information into this dialog box. Rate is the monthly interest rate changed and it is 0.67% in our example. This is the annual rate of 8%, listed as the APR in loan paperwork or documentation, divided by 12 (8%/12=0.67%). This will also need to be expressed as a decimal by dividing the number by 100, so it will be 0.67/100, or 0.0067, when used in the equation. Nper is the number of periods in the loan. So if it is a 3 year loan paid monthly that is 36 payments (12 x 3 = 36). Pv is the present value of the loan or the amount you are borrowing, we will assume $3,500 again. Fv is the future value of the loan after 5 years. Typically, if you plan on paying off the full value, this is entered as a 0. There are very few cases where you would not enter a \"0\" in this box. A lease is an exception where Fv is the residual value of the asset. Type you can leave this blank in most cases, but it is used to change the calculation if you make the payment at the beginning or end of the period. If you were to type this into the Excel cell without using the fx dialog box, the syntax is =PMT(Rate,Nper,PV,FV,Type). In this case “=PMT(0.0067,36,3500,0)”."
    },
    {
      "title": "Read the result:",
      "content": "Read the result: This results in a payment of $109.74. It comes out as a negative number since you are paying money versus receiving it. If you want to switch the sign to positive number enter -$3,500 instead of $3,500 for the PV."
    },
    {
      "title": "Search for Installment Loan Payment Calculator.",
      "content": "Search for Installment Loan Payment Calculator. You can do this search through Google, Bing or your favorite search engine. Choose a reputable website that does not ask for any personal information. There are plenty that are easy to use that fit this profile."
    },
    {
      "title": "Locate the required information.",
      "content": "Locate the required information. Each one works a bit differently, but they will all ask for the same information. The interest rate, loan amount and number of payments are listed in the loan documents. If you are estimating payments for a loan you are considering, many of the sites also include probable interest rates for that type of loan. [8] X Research source"
    },
    {
      "title": "Enter the Information.",
      "content": "Enter the Information. Enter the information into the boxes or cells in the loan calculator. Every site works a bit differently, but almost all of them make it easy to enter the data."
    },
    {
      "title": "Locate the Result:",
      "content": "Locate the Result: After you enter the data, the calculator will provide the monthly payment for your loan. It is always wise to double check this and make sure it makes sense. For a 12 month loan of $1,000 at a 5% interest rate, a monthly payment of $500 would not make sense. Check a second site to confirm the number if you are at all uncertain."
    },
    {
      "title": "Adjust the inputs.",
      "content": "Adjust the inputs. Try to change some of the original data like interest rate or total loan amount to understand how each one impacts the monthly payment. This will make you a much smarter consumer if you are still searching for a loan."
    }
  ]
}