{
  "url": "https://www.wikihow.com/Handle-a-Cat-That-Suddenly-Attacks-You",
  "title": "How to Handle a Cat That Suddenly Attacks You",
  "steps": [
    {
      "title": "Act calmly.",
      "content": "Act calmly. Reacting strongly can increase the cat's stress and interest in attacking you. It may even make the cat's prey instinct kick in more, spurring them on to bite down harder. [1] X Research source Instead, stop moving and reacting to the cat. This will take away all the fun the cat gets from the attack. If you don't \"play\" with the cat any further, they will likely lose interest and release their claws or teeth."
    },
    {
      "title": "Press towards the cat.",
      "content": "Press towards the cat. If the cat has their claws or teeth in you, then you need to work on getting the cat to remove them. Instead of pulling away, try pushing toward the cat further. This will hopefully confuse the cat, prompting them to let go. [2] X Research source Pressing towards the cat will get the cat to release, because prey don't usually move toward the cat after an attack. While cat bites are typically small, they're also deep, and the bacteria from the cat's mouth can get into the wound and cause an infection. If you get bitten hard enough to break your skin, wash the wound with soap and water right away and then see a doctor. [3] X Research source"
    },
    {
      "title": "Do not",
      "content": "Do not use physical punishment. Hitting or smacking the cat will only increase the stress and aggression they feel. While physical resistance may be your first response when being attacked, resist that urge. You can, however, use a strong and stern voice to admonish the attacking cat. This will show the cat your displeasure while not increasing their attacking instinct."
    },
    {
      "title": "Make a sharp or unexpected noise.",
      "content": "Make a sharp or unexpected noise. Making a loud noise can shock the cat into releasing their grip if they're unwilling to give up on their attack. Try making a loud noise or throw something across your room that will make a loud noise when it hits the floor. You can try to shock the cat by simply clapping very loudly."
    },
    {
      "title": "Restrain",
      "content": "Restrain the cat. If all else fails, you may need to restrain the cat. This can usually be done most easily during an attack by scruffing the cat . Holding the cat by the scruff will disable the cat and allow you to get control of them. Scruffing a cat must be done with caution. Holding the cat by the loose skin at the back of the neck in the right way is not painful, but doing it wrong can injure the cat. [4] X Research source Ask your veterinarian how to scruff a cat and try it on a cat that is docile. This will assure that you know how to do it before you have to scruff a cat who is out of control."
    },
    {
      "title": "Remove yourself from the situation.",
      "content": "Remove yourself from the situation. Once you have gotten the attacking cat off of you, walk away from them. Do not interact with the cat at all and just move away from them. This will help to diffuse the situation. An aggressive cat is likely to continue their behavior if they get a reaction from the attack. This is especially helpful in dealing with redirected aggression in cats. Redirected aggression occurs when the cat becomes upset because of another animal, a person, or an event, but is unable to direct their aggression towards the stimulus. As a result, the cat will redirect their aggression to the first person, animal, or thing that they can. [5] X Research source Removing yourself is also useful when dealing with a kitten who is playing too roughly. Withdrawing your attention if the cat plays too roughly will show them that the fun stops when they play too hard. [6] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source"
    },
    {
      "title": "Allow the cat to leave the area.",
      "content": "Allow the cat to leave the area. Do not keep an aggressive cat in a room if they don't want to stay. Allow them to leave if they want to so that they can go off on their own and cool down. For example, cats may act aggressively if they are scared, so letting them flee instead of keeping them in a fearful situation will reduce their stress and allow them to stop being aggressive. Sometimes a cat will attack because they did not want to be interacted with. If this is the case for you, then you should allow the cat to get the alone time that they wanted."
    },
    {
      "title": "Isolate the cat.",
      "content": "Isolate the cat. If the cat is wild and you fear they will continue to attack you, or injure themself, you may need to isolate them. This can be done most effectively and humanely by locking them in a room by themself until they have completely calmed down. If you place an aggressive cat in a room by themself for longer than an hour or so, you should supply a litter box, food, and water for them."
    },
    {
      "title": "Have your cat's health assessed.",
      "content": "Have your cat's health assessed. Aggression in cats can sometimes be caused by medical problems. If your cat is feeling unwell or suffering, it could make them angry or unpleasant. To make sure that a health problem is not the cause of your cat's aggression, bring them to a veterinarian. Some medical problems that can cause aggression in cats include dental disease, arthritis, and hyperthyroidism."
    },
    {
      "title": "Change factors than may be causing aggression.",
      "content": "Change factors than may be causing aggression. If your cat's health is fine, then their aggression has another cause. Assess their living conditions to figure out what is causing their anger. The aggression may be caused by factors such as dirty litter, territory disputes with other cats, lack of socialization, or previous trauma. If you think your cat is unhappy about one of these things, change it. It is best to figure out the source of your cat's aggression as soon as possible once aggression starts. This will help you to stop the cat's aggression from becoming habit."
    },
    {
      "title": "Train",
      "content": "Train your cat not to attack. Once you have eliminated any health or situational problems that are causing your cat to attack, work on training them not to attack anymore. This training should include interrupting aggressive behavior before it escalates. Never use physical punishment or physical contact when training your cat not to attack. This will likely cause the cat to become more fearful and unsettled, thus increasing the likelihood of an attack. If your cat is food focused, then treats can be used to reward non-aggressive behavior. For example, if your cat is aggressive toward strangers, give your visitors treats they can use to reward the cat for staying calm."
    },
    {
      "title": "Keep your cat out of aggression-inducing situations.",
      "content": "Keep your cat out of aggression-inducing situations. If you have figured out what triggers your cat's aggression, try to keep them out of those situations. For example, if your cat is triggered by strangers in your home, keep them sequestered away when strangers come to your home."
    },
    {
      "title": "Calm your cat with pheromone products.",
      "content": "Calm your cat with pheromone products. Pheromones are a chemical form of communication within a species. Some pheromones have a calming effect, and there are cat-specific products, such as collars and sprays, that incorporate this pheromone in order to give your cat a calmer demeanor. Try using one or more of these products on your cat to relax them. [7] X Research source"
    },
    {
      "title": "Get your cat professional help.",
      "content": "Get your cat professional help. If you have tried to ease your cat's aggression and have not had any success, then it's time to call in a professional. Contact your veterinarian and see what they can do about your cat's aggression. You can also contact a board certified veterinary behaviorist to help your cat overcome its aggression. Your veterinarian may suggest giving your cat medication in combination with behavioral training. This can ease your cat's stress and minimize aggressive outbursts."
    }
  ]
}