{
  "url": "https://www.wikihow.com/Operate-a-Scissor-Lift",
  "title": "How to Operate a Scissor Lift",
  "steps": [
    {
      "title": "Climb into the scissor lift through the gate on the side rail.",
      "content": "Climb into the scissor lift through the gate on the side rail. To enter the scissor lift, unhook the chains or open the gate on the side of the platform. Step on the base of the scissor lift and climb under the top rail to enter the machine. Once inside of the scissor lift, either close and lock the gate or reattach the chains back on to their corresponding hooks to secure the lift. Some gates use a latch to lock the guard rail in place. If you can’t open the door, look for a locking mechanism where the door meets the frame of the machine and flip it up to unlock it. Never operate a scissor lift without securing the gate on the side rail."
    },
    {
      "title": "Put the key into the ignition to turn the lift on.",
      "content": "Put the key into the ignition to turn the lift on. Scissor lifts use a key to start the lift and turn it off. Take your key and insert it into the ignition next to the large red button on the control panel. Turn the key to the right to turn the lift on. The control panel is the small box with the joystick inside of the lift. [1] X Research source"
    },
    {
      "title": "Use the big red button (Emergency stop or \"E-Stop\") to stop the machine at any time.",
      "content": "Use the big red button (Emergency stop or \"E-Stop\") to stop the machine at any time. If you ever need to shut off the power to the lift or lose control of the joystick, press the large red button next to the key. This is the emergency shut off button, and pressing it will immediately cut the power to the battery. [2] X Research source If you need to restart the machine after using the emergency shut off button, simply pull the button out and use the key to restart the scissor lift."
    },
    {
      "title": "Flip the horizontal switch to the left to turn the hydraulics on.",
      "content": "Flip the horizontal switch to the left to turn the hydraulics on. There are 2 switches on the control panel. Find the horizontal switch that flips to the left and right. Set this switch to the left to turn the hydraulic system on and allow the scissor lift to move up and down. On some scissor lifts, each switch position is labelled. On these lifts, flip the horizontal switch to the “Platform” or “Up/Down” position. [3] X Research source"
    },
    {
      "title": "Use the vertical switch to set the speed of the lift to “slow.”",
      "content": "Use the vertical switch to set the speed of the lift to “slow.” There is rarely a good reason to set the vertical switch to the “fast” setting, which is the up-position. To ensure that the machine raises and lowers slowly and remains under your control, flip the vertical switch to its lowest position. On some lifts, this switch position will be labeled “slow.” [4] X Research source You’re more likely to have an accident or lose control of the lift if it’s moving quickly. The fast setting is usually reserved for warehouse workers that only use a scissor lift to access higher shelves in a specific location where the lift doesn’t need to be driven."
    },
    {
      "title": "Push the joystick forward to raise the scissor lift.",
      "content": "Push the joystick forward to raise the scissor lift. With the switch in the left-most position, push the joystick forward to raise the platform. If you want to stop moving the platform, move the stick to the center to stop raising the platform. Alternatively, you can release the joystick and allow it to pop back to the neutral position. The joysticks on scissor lifts will almost always flip back to the center so that the lift stops moving when you release the joystick. When going up, stay alert and look above and around you to ensure that you don’t strike anything while moving up. Make sure that nobody is standing nearby the lift while you’re raising it."
    },
    {
      "title": "Pull the joystick back to lower the lift back down.",
      "content": "Pull the joystick back to lower the lift back down. To lower the lift, simply pull the stick back towards you. The platform will continue to lower so long as you keep the joystick held back. To stop moving down, either push the joystick to the center position or release the handle. Before you move a lift down, look over the rails to make sure that it’s safe. The rails fold on one another as a scissor lift lowers, and a person may be injured if they’re touching the lift when it starts moving. As you move down, look down to keep an eye out for people passing by. Do not lower a scissor lift if someone is within 20 feet (6.1 m) of the lift."
    },
    {
      "title": "Lower the scissor lift all the way down before driving it.",
      "content": "Lower the scissor lift all the way down before driving it. Before you drive anywhere, lower the lift as low as it can go. Your scissor lift will be more likely to tip over if you drive it while the platform is raised. Never drive the lift if the platform is raised. Depending on where you live, it is usually a safety violation to move a scissor lift if the platform is raised."
    },
    {
      "title": "Set the horizontal switch all the way to the right.",
      "content": "Set the horizontal switch all the way to the right. To shut off the hydraulic power and shift the lift into drive mode, identify the horizontal switch on your control panel. Flip this switch all the way to the right. If the controls are labeled, this position is usually labeled “drive.” [5] X Research source You cannot raise or lower the platform while the lift is in drive mode, so always lower the platform before using this switch."
    },
    {
      "title": "Set the vertical switch to the “slow” position to stay safe.",
      "content": "Set the vertical switch to the “slow” position to stay safe. When you drive the lift, the speed of the lift is controlled by the vertical switch. Flip this switch all the way to the lowest position to ensure that you maintain control of the lift while you’re driving it. [6] X Research source The “fast” position is usually used to navigate rows in a warehouse where the lift doesn’t need to go left or right."
    },
    {
      "title": "Push the joystick forward or backward to drive the lift.",
      "content": "Push the joystick forward or backward to drive the lift. With the horizontal switch flipped all the way to the right, push the joystick forward to drive forward. If you want to go in reverse, pull the joystick backwards. Always wait for the lift to come to a complete stop before swapping between forward and reverse. [7] X Research source"
    },
    {
      "title": "Use the toggle on the top of the joystick to move left or right.",
      "content": "Use the toggle on the top of the joystick to move left or right. If you want to change directions, press the toggle switch on top of the joystick with your thumb. If you want to turn left, press the left side of the switch down. If you want to turn right, press the right side of the switch down. Hold the switch in place to continue rotating the lift as you drive. [8] X Research source Scissor lifts can’t turn at sharp angles; it usually takes multiple control inputs to turn the lift around sharp corners."
    },
    {
      "title": "Move slowly and take breaks between movements to stay safe.",
      "content": "Move slowly and take breaks between movements to stay safe. Scissor lifts can be kind of awkward to drive, especially if you aren’t used to using them. To stay safe while driving a scissor lift, only use one control input at a time and carefully monitor the speed and direction of the lift as it moves. Release the joystick in between inputs to allow the scissor lift to stop moving before changing directions. Never change directions without letting the lift come to a complete stop first. While driving the lift, always look at the ground where you’re driving the lift to watch out for obstructions or changes in the texture of the floor. If you’re outside, look up once every 2-3 seconds to make sure that you aren’t at risk of running into a powerline or tree. If you move the joystick back and forth while changing directions at the same time, you may knock the scissor lift over or fall off of the platform. In addition, you may run into an obstruction or hole if you move too quickly, which can disrupt the lift or knock you off."
    },
    {
      "title": "Wear a safety harness and connect it to the strap on the platform.",
      "content": "Wear a safety harness and connect it to the strap on the platform. Get a safety harness from a construction supply store or a scissor lift manufacturer. Put the harness on and clip it in the center and on the sides to secure it. Pull the straps on each side to tighten it to your frame. On the floor of the platform, look for a retractable length of nylon with a hook on the end. Clip this hook to your safety harness to stay safe if you fall. [9] X Research source The nylon strap will extend 6 feet (1.8 m) before locking, so you have plenty of room to move around on the platform."
    },
    {
      "title": "Monitor the battery or fuel gauge to ensure you don’t get stuck.",
      "content": "Monitor the battery or fuel gauge to ensure you don’t get stuck. There is a gauge next to the switches on your control panel that measures how much fuel or electricity is left. Monitor this gauge carefully while operating your lift to ensure that you don’t run out of fuel or electricity while you’re raised up in the air. [10] X Research source If you do run out of energy while the platform is raised, you’ll need someone else to charge the battery or fill the tank for you before you can get back down. (If this isn't practical there should be a manual pressure relief valve on the scissor lift allowing it to be lowered regardless of battery or fuel status - consult the manual or manufacturer for this.) The vast majority of scissor lifts are electric."
    },
    {
      "title": "Operate the scissor lift on firm, flat surfaces.",
      "content": "Operate the scissor lift on firm, flat surfaces. Never use a scissor lift on grass, gravel, or unstable ground. Scissor lifts tend to become quite unstable if they’re on an uneven surface, which is a serious safety hazard. Only use a scissor lift on asphalt, concrete, or hardwood surfaces. [11] X Research source"
    },
    {
      "title": "Inspect the scissor lift before using it to check for wear and tear.",
      "content": "Inspect the scissor lift before using it to check for wear and tear. Before using a scissor lift, always walk around the exterior of the machine. Inspect each wheel to look for punctures or tears. Check each tire to ensure that your wheels are properly inflated. Check the rails that lift the platform for cracks or obstructions to ensure that the machine is safe to operate. [12] X Trustworthy Source State of Indiana Official site for state-approved sources related to life in Indiana, including laws, services, and culture Go to source If you’re unsure if a scissor lift is safe to use, have a certified mechanic inspect the machine before using it."
    },
    {
      "title": "Get certified as a scissor lift operator if you want to really stay safe.",
      "content": "Get certified as a scissor lift operator if you want to really stay safe. If you’re operating a scissor lift for your employer, they are legally required to train you on how to use the scissor lift. If you’re renting a scissor lift, consider taking a safety class in your area to earn an operator certification. While this certification isn’t normally required to use a scissor lift, it’s a good way to ensure that you don’t make a serious mistake when using the machine. [13] X Trustworthy Source US Occupational Safety and Health Administration U.S. government agency responsible for setting and enforcing workplace safety standards Go to source Operator certifications for scissor lifts usually take less than a week to earn. In some states and countries, you are required to take a class on scissor lifts before you are allowed to operate one. However, these safety certifications are optional everywhere else. While it changes depending on where you live, scissor lifts are usually considered to be a type of scaffolding. Standing on scaffolding does not typically require a certification. [14] X Trustworthy Source US Occupational Safety and Health Administration U.S. government agency responsible for setting and enforcing workplace safety standards Go to source"
    }
  ]
}