{
  "url": "https://www.wikihow.com/Bleed-a-Master-Cylinder",
  "title": "How to Bleed a Master Cylinder",
  "steps": [
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. Bleeding from the bench is much easier than bleeding using the pump method, which takes a very long time and may not work. It is also much less expensive than taking your master cylinder into a mechanic, who will quickly (and expensively) do it with vacuum pumps. It is also necessary if you are installing a new master cylinder. To bleed your master cylinder from the bench, gather the following supplies: [1] X Research source Your master cylinder with bleed kit. Fresh brake fluid. A workbench or table with a fixed vise. If you have neither of these, it will be more cost-effective to go to the next method, which does not require a specialized workspace. A wooden or plastic dowel. Make sure this is strong, because you don't want it to snap while you're working."
    },
    {
      "title": "Remove your master cylinder from the packaging.",
      "content": "Remove your master cylinder from the packaging. Set aside the bleed kit that comes with the cylinder, as you will need it later. If the new part didn't come with a reservoir, be sure to remove the one from the old part."
    },
    {
      "title": "Mount your master cylinder in the vise.",
      "content": "Mount your master cylinder in the vise. Steadiness is key when bleeding your master cylinder in this way. Before doing anything else, mount your master cylinder in the vise on your workbench or table, and make sure it is level. [2] X Research source Hold the master cylinder by its flared mount, and make sure it is level. This way, the air will leave properly, and it will fill with brake fluid evenly without gaps. It needs to be firmly secured, but not so tight you crush or damage cast aluminum parts. Make sure the plastic fittings are not crushed or blocked when putting the cylinder in the vise. If your table does not have a pre-installed vise clamp, you can buy a separate vise that clamps on to the table if you do not have one pre-installed. If you like the appearance of this table, it might be best not to use it, as vise clamps leave a mark on wood or metal. If you have no other usable tables, wedge a rag in between the vise clamps to avoid leaving a mark. This may not work, so proceed at your own risk."
    },
    {
      "title": "Prepare the bleeding kit.",
      "content": "Prepare the bleeding kit. This should come with your master cylinder, and consists of two rubber hoses and two plastic threaded inserts. The inserts will be threaded on one side, and the other will be a smooth adapter for taking the hose. Check the color of your hose, too. If you have opaque hose, you might want to replace it with clear hose, because then you can see the air bubbles passing through the fluid more easily. You can also opt not to use the bleeding kit, as it isn't necessary. However, this guide will assume that you are using the bleeding kit."
    },
    {
      "title": "Screw the inserts into the outputs of your cylinder.",
      "content": "Screw the inserts into the outputs of your cylinder. These are located on the side of the cylinder past the flared mount. Install these into the bosses (the threaded holes) without cross threading them. Make sure they are finger tight."
    },
    {
      "title": "Insert the rubber hoses.",
      "content": "Insert the rubber hoses. Once you have attached the inserts into the cylinder, you can attach the rubber hoses to these inserts."
    },
    {
      "title": "Place the ends of the rubber hoses into a container.",
      "content": "Place the ends of the rubber hoses into a container. This container will be used for catching the excess brake fluid, so make sure you don't mind that it gets dirty. Consider attaching the hoses to the container in some way. Once you begin pumping, they will begin flailing about and spray blake fluid everywhere if they are not anchored down in some way. An old coffee can works especially well for this, as does any cylindrical container with a wide, flared opening."
    },
    {
      "title": "Fill the attached reservoir with brake fluid.",
      "content": "Fill the attached reservoir with brake fluid. If your reservoir runs out of brake fluid at any time during your bleed, you'll have to start from the beginning. [3] X Research source You should only put clean brake fluid that is less than two years old into the reservoir. Make sure it's in between the \"max\" and \"min\" marks and covers the ends of the hoses. Brake fluid is very hygroscopic, which means it absorbs moisture and will degrade, and this damages the seals. Do not reuse brake fluid"
    },
    {
      "title": "Begin pumping the master cylinder.",
      "content": "Begin pumping the master cylinder. Make sure you do this slowly to avoid allowing air into the apparatus, or allowing the wooden dowel to snap. Don't bottom out the piston, otherwise this might allow the entrance of air. You have to pinch the rubber hoses closed each and every time you release pressure on the cylinder."
    },
    {
      "title": "Push in the cylinder and pinch the hoses.",
      "content": "Push in the cylinder and pinch the hoses. This will compress the brake fluid, so it will shoot out when you release the hoses. This also prevents air from entering the master cylinder by not providing a vacuum for it to fill."
    },
    {
      "title": "Release the hoses and let the brake fluid out of the master cylinder, then immediately pinch the hoses again.",
      "content": "Release the hoses and let the brake fluid out of the master cylinder, then immediately pinch the hoses again."
    },
    {
      "title": "Repeat this until there is no more air in the fluid.",
      "content": "Repeat this until there is no more air in the fluid. You will know you're finished pumping when there are no more air bubbles rising in the reservoir or present in the container of spent brake fluid."
    },
    {
      "title": "Remove the master cylinder from the vise with the bleeding kit still attached.",
      "content": "Remove the master cylinder from the vise with the bleeding kit still attached."
    },
    {
      "title": "Begin installing the master cylinder in your vehicle.",
      "content": "Begin installing the master cylinder in your vehicle. [4] X Research source When installing it in the vehicle, keep it level and remove the bleeding kit as you install the lines. If you did this right, you shouldn't need to bleed the entire system, but you may want to to flush the system of old fluid. [5] X Research source"
    },
    {
      "title": "Remove the inserts and hoses, then place the caps on your master cylinder.",
      "content": "Remove the inserts and hoses, then place the caps on your master cylinder. These should have come with the cylinder, and will prevent leakage."
    },
    {
      "title": "Replace the cap on the master cylinder's reservoir.",
      "content": "Replace the cap on the master cylinder's reservoir. Otherwise brake fluid will leak out from the reservoir."
    },
    {
      "title": "Test the brakes before returning the vehicle to service.",
      "content": "Test the brakes before returning the vehicle to service. You need to make sure that your brakes actually work before you begin driving your car. If you've done it right, the brakes should feel clean and crisp when you pump them. If you've done it wrong, the brakes will feel \"squishy\" when you pump them from your car, indicating there is still air in the master cylinder. If the break pedal feels soft after installing the master cylinder, follow the instructions for the method on bleeding the master cylinder from the car, or this guide on bleeding brake lines ."
    },
    {
      "title": "Gather your supplies.",
      "content": "Gather your supplies. Unlike with bleeding a separate or new master cylinder, you can do this without gathering new parts or equipment. You will need: A brake bleed screwdriver or wrench. You will have to loosen the screws that hold the hoses in place in order to bleed the master cylinder. Pliers. You will need these to pinch the hose attached to your master cylinder in between pumps WD-40 or other water-displacing solvent. Your brake bleed screw may be caked with oil or other contaminants and be difficult to unscrew. You'll use the WD-40 to remove this material and allow yourself to loosen the screw. A helper. He or she will pump your brakes while you fiddle with the hoses and screws underneath your car."
    },
    {
      "title": "Jack up the car.",
      "content": "Jack up the car. [6] X Research source This will allow you to get underneath it to work with the master cylinder. Immobilize the car by blocking the wheels, and make sure it won't roll by parking it on a flat surface. [7] X Research source"
    },
    {
      "title": "Place a container or jar underneath the master cylinder's bleeder nozzle or the place for the hose attachment.",
      "content": "Place a container or jar underneath the master cylinder's bleeder nozzle or the place for the hose attachment. This container will be used for catching the excess brake fluid, so make sure you don't mind that it gets dirty. Consider attaching the hoses to the container in some way. Once you begin pumping, they will begin flailing about and spray blake fluid everywhere if they are not anchored down in some way. An old coffee can works especially well for this, as does any cylindrical container with a wide, flared opening."
    },
    {
      "title": "Ask your helper to slowly pump your brake pedal several times.",
      "content": "Ask your helper to slowly pump your brake pedal several times. Have him or her indicate to you what he or she is doing by calling out \"down\" when pressing the brake pedal and \"up\" when letting it go."
    },
    {
      "title": "Have your helper press and hold down the brake pedal.",
      "content": "Have your helper press and hold down the brake pedal. Now you will begin doing some work on the master cylinder."
    },
    {
      "title": "Detach the hoses connecting the brakes and the master cylinder.",
      "content": "Detach the hoses connecting the brakes and the master cylinder. This isolates your master cylinder and keeps you from bleeding your brakes as well. You're trying to bleed your master cylinder, and not your brakes, so you don't want to affect the latter by messing with the former. Likely, brake fluid will instantly fly out. This is why you want to have a container attached. Before your helper releases the pedal, make sure you have the hoses back on."
    },
    {
      "title": "Examine the brake fluid.",
      "content": "Examine the brake fluid. If there is air in the fluid, you will see air bubbles in what was discharged. This is also why it is important to have a container or jar, because without collecting the fluid, you will have no idea whether there is fluid in the brakes or not."
    },
    {
      "title": "Reattach the hoses to the master cylinder.",
      "content": "Reattach the hoses to the master cylinder. Failing to do so will allow air back in to the cylinder."
    },
    {
      "title": "Have your helper release the pedal.",
      "content": "Have your helper release the pedal."
    },
    {
      "title": "Repeat until the air is out of the master cylinder.",
      "content": "Repeat until the air is out of the master cylinder. Don't forget to continue topping up the master cylinder with brake fluid. Otherwise, you may introduce air into it and have to begin again."
    }
  ]
}