{
  "url": "https://www.wikihow.com/Formally-Address-British-Royalty-and-Aristocracy-in-Person",
  "title": "A Guide to Greeting the British Royal Family & Aristocracy",
  "steps": [
    {
      "title": "Address the King or Queen as “Your Majesty.”",
      "content": "Address the King or Queen as “Your Majesty.” After your first response using “Your Majesty,” address the King as “Sir” and the Queen as “Ma’am,” using a short ‘a,’ as in “ham.” [1] X Research source For example, if the King asks you, \"How are you enjoying the United Kingdom?\" respond with, \"It's wonderful, Your Majesty.\" If the King asks you another question, end that next response with “Sir.” Avoid addressing a Queen or King as “Your Royal Highness.” Note that the correct title for the King is \"His Majesty the King.\" Avoid \"King of England,\" as that is just one of many titles that refer to a specific country."
    },
    {
      "title": "Address all other members of the royal family as “Your Royal Highness.”",
      "content": "Address all other members of the royal family as “Your Royal Highness.” This honorific applies to both male and female royalty. After the first presentation or introduction, address male royals as “Sir” and female royals as “Ma’am.” [2] X Research source When speaking directly to the royal, replace any “you” or “your” in the conversation with “Your Royal Highness” or “Your Royal Highness’s.” If you mention a royal family member in the third person, always use a full title (such as \"The Prince of Wales\") or \"His/Her Royal Highness.\" Referring to someone by name (for example, \"Prince William\") may be considered rude."
    },
    {
      "title": "Greet royalty with a small bow or curtsy.",
      "content": "Greet royalty with a small bow or curtsy. If you’re a man, bow your head slightly at the neck. If you’re a woman, give a small curtsy by putting your hands by your side, placing one foot behind the other, and bending slightly. Perform this greeting when the royal family member passes by you or when you are presented to them, and repeat this greeting when they leave. [3] X Research source Bows are traditionally expected by men and curtsies by women, but in the modern age either is acceptable for any gender. Deep curtsies are not a faux pas, but they are uncommon and difficult to do gracefully. Deep bows from the waist, on the other hand, are never performed in this situation. Technically, only those who have the British monarch as their head of state must bow or curtsy—although even they are not strictly required to. Citizens of other countries, such as American citizens, may bow or curtsy, but they are not expected to. [4] X Research source"
    },
    {
      "title": "Opt for a small nod or bob instead of a bow or curtsy.",
      "content": "Opt for a small nod or bob instead of a bow or curtsy. Give a small and respectful nod when a royal passes by or you are introduced to them. Alternatively, give a short bob by keeping your back straight, your hands at your sides, bowing your head, and dropping your knees slightly. [5] X Research source"
    },
    {
      "title": "Shake hands only if the offer is extended.",
      "content": "Shake hands only if the offer is extended. The Royal Family's website states that shaking hands is also an acceptable form of greeting, alone or in addition to one of the modes above. However, wait for the Royal Family Member to extend their hand first and use only a light touch with one hand. [6] X Research source Do not initiate any physical contact yourself. If you are wearing dress gloves (which is certainly not required), men should remove the gloves before shaking hands, while women may leave them on. [7] X Research source"
    },
    {
      "title": "Let the royal personage take the lead in the conversation.",
      "content": "Let the royal personage take the lead in the conversation. Wait until they greet you before you speak. Avoid changing the subject, and do not ask any personal questions. Let them guide the conversation to a natural end. [8] X Research source Foreigners should resist the urge to speak \"proper\" if it comes across as an imitation of an English accent. The King and his relatives have spoken with thousands of people around the world and do not expect you to speak as they do."
    },
    {
      "title": "Contact the Royal Household if you have further questions.",
      "content": "Contact the Royal Household if you have further questions. The staff of the Public Information Office at the Royal Household is happy to answer questions on proper etiquette. If you are not sure of the preferred title for a particular royal or the expectations for hosting a particular event, enquire by post or telephone. [9] X Research source Call (+44) (0)20 7930 4832, Monday to Friday from 9:00 AM – 5:00 PM GMT. Address a letter to: Public Information Officer Buckingham Palace London SW1A 1AA"
    },
    {
      "title": "Address dukes and duchesses as “Your Grace.”",
      "content": "Address dukes and duchesses as “Your Grace.” If the Duke or Duchess is a member of the King or Queen’s family, such as a son or daughter, refer to them as “Your Royal Highness.” If speaking in the third person, refer to a Duke and Duchess as “His Grace” and “Her Grace.” [10] X Research source In spoken conversation, it’s best to avoid using titles like “Duke” or “Duchess” unless you are of the same social standing. If you are making a formal introduction, however, you may say \"His/Her Grace the Duke/Duchess,\" followed by the rest of the title. Dukes and duchesses belong to the highest grade of peerage in the aristocracy."
    },
    {
      "title": "Refer to lower noble ranks as “Lady” and “Lord.”",
      "content": "Refer to lower noble ranks as “Lady” and “Lord.” Follow “Lady” or “Lord” with the aristocrat’s last name. [11] X Research source Following the Duke and Duchess, lower ranks of peerage include (in order): Marchioness and Marquis Countess and Earl Viscountess and Viscount Baroness and Baron (the wife of a baron is not given the title of baroness unless she is a baroness in her own right, although she is still always referred to as “Lady”) [12] X Research source"
    },
    {
      "title": "Address baronets and knights by “Sir” or “Dame.”",
      "content": "Address baronets and knights by “Sir” or “Dame.” A baronet or male knight is addressed as “Sir + (first name),” with their wife addressed as “Lady + (surname).” A female knight is addressed as “Dame + (first name),” but her husband remains “Mr. Surname.” [13] X Research source"
    },
    {
      "title": "Address an aristocrat’s children by a courtesy title.",
      "content": "Address an aristocrat’s children by a courtesy title. Address the son of a duke or marquess as \"Lord\" followed by his first name. Address the daughter of a duke, marquess, or earl as \"Lady,\" followed by her first name. [14] X Research source If meeting a peer's heir apparent (generally the eldest son), look up his title. He will often use a secondary title of his father's, which is always of a lower rank. In all other cases, the child has no special title (\"The Hon.\" is used only in writing). [15] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source Great-grandchildren in the male line of the monarch are not considered princes or princesses. Use the courtesy titles “Lord” or “Lady” unless they have a title of their own."
    }
  ]
}