{
  "url": "https://www.wikihow.com/Get-Into-Create-a-Sim-While-Playing-the-Sims-3-Game",
  "title": "How to Get Into Create a Sim While Playing the Sims 3 Game",
  "steps": [
    {
      "title": "Ensure your game is updated.",
      "content": "Ensure your game is updated. This cheat is only available in later versions of Sims 3. If you are using the base game and have never updated it, you won't be able to access the cheat. Make sure that your computer is connected to the internet. Click the \"Game Updates\" tab on the Sims 3 Launcher and then click the \"Update Now\" button. The patch will be downloaded and applied to your game."
    },
    {
      "title": "Save your game.",
      "content": "Save your game. Using this cheat can cause glitches to appear in your game, so it's always wise to save before cheating just in case something goes wrong and you need to revert."
    },
    {
      "title": "Open the command console.",
      "content": "Open the command console. You can open this at any time by pressing Ctrl + Shift + C. If that doesn't open the console, some users have reported that the Windows key + Ctrl + Shift + C works instead. [1] X Research source"
    },
    {
      "title": "Type .",
      "content": "Type . testingcheatsenabled true and press Enter. This will enable special menus when you Shift-click things in the game."
    },
    {
      "title": "Switch Sims so that you aren't controlling the Sim you want to edit.",
      "content": "Switch Sims so that you aren't controlling the Sim you want to edit. You will not see the option if you try to edit your active Sim."
    },
    {
      "title": "Hold Shift and click the Sim you want to edit.",
      "content": "Hold Shift and click the Sim you want to edit. Select \"Edit Sim in Create a Sim\" from the menu hat appears. You cannot edit Pregnant Sims, Imaginary Friends, Ghosts, Vampires, or Mummies."
    },
    {
      "title": "Wait for the Create a Sim (CAS) tool to open.",
      "content": "Wait for the Create a Sim (CAS) tool to open. This will likely take a few minutes."
    },
    {
      "title": "Make your changes.",
      "content": "Make your changes. Be aware that doing this will occasionally cause glitches, as the game was not designed to support this. Not all of your changes will take effect when you finish, and your game may crash when exiting CAS. Editing a Sim in CAS will reset it to the beginning of its age stage. For example, if you have a Young Adult Sim that's a day away from becoming an Adult, editing her in CAS will revert her to the beginning of her Young Adult stage."
    }
  ]
}