{
  "url": "https://www.wikihow.com/Treat-Canker-Sores-(Home-Remedies)",
  "title": "How to Treat Canker Sores (Home Remedies)",
  "steps": [
    {
      "title": "Make and use a saline rinse.",
      "content": "Make and use a saline rinse. Take 1 teaspoon of sea salt or table salt with 1 cup of warm water. Stir the solution then use it to rinse your mouth several times. This helps to disinfect your mouth. It also helps to relieve the pain. After rinsing your mouth with the salt water, collect a pinch of salt and place it directly on the canker sore. This is usually a very painful process, but it's one of the best ways to speed up healing. You can do this 4 to 5 times a day. [2] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Dehydrate your canker sore with Milk of Magnesia.",
      "content": "Dehydrate your canker sore with Milk of Magnesia. Pour about a teaspoon of Milk of Magnesia into a spoon. Take a clean cotton swab and soak it in the Milk of Magnesia. Dab the canker sore and let the solution sit on the sore for 5-10 seconds with your mouth open. The magnesium hydroxide will dehydrate the canker sore and speed up the healing process. Repeat this 7-8 times a day. [3] X Research source Batista AL, Lins RD, de Souza Coelho R, do Nascimento Barbosa D, Moura Belém N, Alves Celestino FJ. Clinical efficacy analysis of the mouth rinsing with pomegranate and chamomile plant extracts in the gingival bleeding reduction. Complement Ther Clin Pract. 2014 Feb;20(1):93-8 Milk of magnesia is available in most pharmacies - usually in the aisle with products for constipation."
    },
    {
      "title": "Use alum powder to shrink your canker sore.",
      "content": "Use alum powder to shrink your canker sore. Buy some alum powder (in the baking or spice section of your grocery store). Pour out a small amount (about the size of a pencil eraser) onto a spoon. Take a cotton swab and dip the tip into water and then into the alum. Apply directly onto the canker sore. Leave it on your sore for 1-2 minutes. It may burn a bit. Have a glass of water nearby to rinse out your mouth. Alum is used as an astringent to shrink the tissues. In addition, alum may stimulate the immune system, though that may be little help if your canker sore is not caused by a virus. Do this 1 to 2 times a day. Alum is used in baking and cooking, so if you swallow some, it isn’t a problem."
    },
    {
      "title": "Use aloe gel to soothe the pain.",
      "content": "Use aloe gel to soothe the pain. Using a cotton swab, apply aloe gel directly to the canker sore. Leave it on for 1 to 2 minutes. Most likely the aloe will dissolve in your saliva. If not, rinse afterwards. You can repeat this treatment 4-5 times a day."
    },
    {
      "title": "Place baking soda on your canker sore.",
      "content": "Place baking soda on your canker sore. Make a paste with about a tablespoon of baking soda and a few drops of water. Use a cotton swab and dab the paste onto the canker sore. Let the solution sit on the sore for 5-10 seconds with your mouth open. The baking soda speeds healing and increases the pH of the mouth, reducing the risk of bacterial infection. Repeat this 7-8 times a day. [4] X Research source Batista AL, Lins RD, de Souza Coelho R, do Nascimento Barbosa D, Moura Belém N, Alves Celestino FJ. Clinical efficacy analysis of the mouth rinsing with pomegranate and chamomile plant extracts in the gingival bleeding reduction. Complement Ther Clin Pract. 2014 Feb;20(1):93-8"
    },
    {
      "title": "Make a tea rinse.",
      "content": "Make a tea rinse. To make sage tea, use 1 level teaspoon of sage per cup of hot water. You can make the chamomile tea in the same way, or use 1 bag per cup of hot water. When the teas are cooled down, mix them equally and then rinse your mouth out. Both sage and chamomile are known to be anti-bacterial and anti-inflammatory, reducing the risk of infection and general discomfort. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source You can also hold a chamomile tea bag against your canker sore. The chemical bisabolol in the tea will act as an anti-inflammatory and will reduce your canker sore's redness. [6] X Research source"
    },
    {
      "title": "Get some deglycyrrhizinated licorice (DGL) lozenges.",
      "content": "Get some deglycyrrhizinated licorice (DGL) lozenges. You can buy these from your local herb or health food store. Let the lozenge rest on the canker sore until it dissolves. The DGL speeds healing and decreases the size of the canker sore. DGL is commonly used to treat ulcers in the digestive system. Don’t use lozenges with children, because it may be a choking hazard. Also, DGL is an acquired taste, so have that glass of water nearby."
    },
    {
      "title": "Use a cayenne pepper cream to reduce the pain.",
      "content": "Use a cayenne pepper cream to reduce the pain. Mix a tsp of cayenne pepper with a couple drops of water. Use a cotton swab to apply the mixture to your canker sore. It may sound terrifying, but the capsaicin in the cayenne pepper triggers sensors in your body that alert you to pain. So after the spicy taste fades away, your body will basically ignore your canker sore for 30 minutes to 1 hour. [7] X Research source"
    },
    {
      "title": "Dab some coconut oil on your canker sore.",
      "content": "Dab some coconut oil on your canker sore. While coconut oil has not been medically proven to get rid of canker sores, it does have anti-inflammatory and anti-microbial properties. So it can't hurt, but it can taste good! [8] X Research source"
    },
    {
      "title": "Eat B12 rich foods.",
      "content": "Eat B12 rich foods. B12 deficiency can lead to damaged nerve and blood cells, which are needed to repair the membrane tissue on the inside of your mouth. If your diet lacks an adequate B12 source, you may experience canker sores. Eat seafood like sardines, salmon, tuna, cod, scallops, and shrimp. Beef and lamb are good sources of B12. You can also get your daily dose of B12 from yogurt."
    },
    {
      "title": "Eat more folic acids.",
      "content": "Eat more folic acids. Our bodies need folic acid to make DNA and other genetic material, including the lining of your mouth. Beans, in general, and lentils are a strong source of folates. Dark, leafy green vegetables like turnip greens, spinach, and asparagus can be added to most meals to give you that much needed folic acid boost."
    },
    {
      "title": "Add some iron-rich foods to your meals.",
      "content": "Add some iron-rich foods to your meals. Iron is responsible for the maintenance of many of our body’s functions. Most importantly, iron helps our bodies create healthy oxygen carrying red blood cells, which are needed to repair damaged tissues. Seafood, beef, turkey, chicken, ham, lentils, beans, and spinach are all great sources of iron."
    },
    {
      "title": "Add some zinc to your diet.",
      "content": "Add some zinc to your diet. Zinc is a nutrient that people need to stay healthy. It is found throughout the body and aids cellular regeneration. Without zinc, you’ll have problems healing wounds, clotting, and fighting off even the weakest of infections. Pumpkin, sesame, lentils, and cashews are tremendous sources of zinc."
    },
    {
      "title": "Leave it alone.",
      "content": "Leave it alone. You are probably hyper aware of your canker sore. Every time you open your mouth, your teeth brush past your open wound, irritating it further and sending waves of pain throughout your body. Do your best to avoid further irritating your canker sore. Chew your food on the other side of your mouth, far away from your sore. Do your best to keep your tongue away from it. Don’t pick at it. Don’t squeeze it. Just leave it alone and let your body heal."
    },
    {
      "title": "Deal with your braces.",
      "content": "Deal with your braces. If you have braces, you probably get canker sores on occasion. The pointing metal of your orthodontia can rip through the lining of your cheek in one fell swoop. You'll want to talk to your orthodontist about this issue, but there is a home remedy you can try. Melt 1 tbsp of beeswax and mix it with 2 tsp of coconut oil. After it has cooled, take a small clump of it and press it against troublesome parts of your braces. Don't put too much, but just enough to stop that jagged edge from hurting you further. [9] X Research source"
    },
    {
      "title": "Avoid oral care products with sodium lauryl sulfate (SLS).",
      "content": "Avoid oral care products with sodium lauryl sulfate (SLS). Many dentists encourage their patients to avoid toothpastes and mouth washes with this harsh organic compound. It is often used in cleaning products. Tom’s of Maine and Burt’s Bees don't use sodium lauryl sulfate in their products."
    },
    {
      "title": "Stay away from foods with a lot of harsh acids.",
      "content": "Stay away from foods with a lot of harsh acids. Orange juice, for example, contains a lot of vitamin C, which is normally good for your health, but it also has a lot of citric acid, which will further irritate your canker sore causing it to heal more slowly. [10] X Research source Avoid tomatoes and tomato juice. Pass on peppers too."
    },
    {
      "title": "Skip “pointy” foods.",
      "content": "Skip “pointy” foods. This might seem silly, but many canker sores are the result of foods with sharp edges like chips, bread crusts, biscotti, pretzels, popcorn, and anything else that could cause further damage to the inside lining of your mouth."
    },
    {
      "title": "Give up your tobacco products.",
      "content": "Give up your tobacco products. Chewing tobacco, in particular, often causes canker sores. The harsh chemicals in the tobacco irritate the skin, so it only makes sense to give up tobacco when you are suffering from a nasty canker sore. Cigarettes have the same effect too. [11] X Research source"
    },
    {
      "title": "Consult a physician.",
      "content": "Consult a physician. Do so if your canker sore does not go away after 4 days or if you have experienced chronic canker sores. Call your doctor if your canker sore is larger than a dime. There are many chronic causes of canker sores that you and your physician will be able to discuss. Vitamin deficiency is often a cause of chronic canker sores, but depression, hormonal imbalance, and immune disorders like Systemic Lupus Erythematosus (SLE), Crohn’s disease, ulcerative colitis, and a rare condition called Bechet’s disease can also cause ulcers too. SLE is an autoimmune disease where there is oral involvement in about 50% of cases. These oral ulcers look like irregularly shaped raised white plaques.Treatment for these lesions include topical or intralesional glucocorticoids. Behcet's disease is another rare disease that leads to mouth ulcers. It is a neutrophilic inflammatory disorder with recurrent oral and genital ulcers, Recurrent ulcers along with lesions in the genital, eye, or skin are required for the diagnosis. The mucocutaneous manifestations of Behcet’s disease can be treated with colchicine. Inflammatory bowel disease is also known to be associated with mouth ulcers, particularly aphthous stomatitis. This form of mouth ulcers is the most common cause of mouth ulcers. Risk factors for mouth ulcers include family history, trauma, hormonal factors, food or drug hypersensitivity, immunodeficiencies, and emotional distress. Treatment for oral ulcers involve triamcinolone in an over the counter treatment called Orabase. There are no tests for canker sores. Doctors can tell just by looking at it, if it is a form of cold sore or if it is a canker sore. Canker sores are shallow crater-like spots on the mucus tissue of the mouth. They are immediately recognizable by their round shape, reddish edge, and general whitish/grayish color."
    },
    {
      "title": "Report the facts to your physician.",
      "content": "Report the facts to your physician. Be sure to note the number and longevity of your canker sores. They’ll be able to determine if you have a chronic condition. If you’ve had a couple in a week or so, your doctor will likely tell you to focus on your eating habits and environment. If you’ve had a couple constantly for months, then your doctor will probably run a spectrum of blood and urine tests to check for a myriad of conditions including vitamin deficiency. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Follow your doctor's advice.",
      "content": "Follow your doctor's advice. Normally, your doctor will simply ask you to monitor your canker sores and to use many at-home or over-the-counter remedies. In the most extreme cases, your doctor may prescribe certain oral steroids that will reduce inflammation and the pain. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source In even more extreme cases, your doctor may choose to cauterize the wound. There are two cauterizing chemicals that your doctor may use. The first is Debacterol. It is a topical solution chemically designed to cauterize your canker sore and to reduce the healing time to about a week. The second is silver nitrate. Like debacterol, silver nitrate will chemically cauterize the wound, but it hasn’t been shown to speed the healing process. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}