{
  "url": "https://www.wikihow.com/Turn-on-a-Scorpio-Man-Through-Text",
  "title": "11 Ways to Turn on a Scorpio Man through Text",
  "steps": [
    {
      "title": "Scorpions like to be in charge so let him set the mood.",
      "content": "Scorpions like to be in charge so let him set the mood. If you try to turn him on while he's at work or busy, he might just get annoyed. Let him know where your head is at, but give him the chance to reciprocate in a similar fashion before you run with it. A light, teasing text helps you find out when he might be open to something a little hotter. \"Hey, sexy... 😉 How's your day going?\" \"If you think that was hot, just wait until later.\" \"I'm trying to be good, I wouldn't want to distract you at work... or would I? 😈 \" \"Let me know when you want your surprise...\""
    },
    {
      "title": "As an intense water sign, Scorpio craves emotional intimacy.",
      "content": "As an intense water sign, Scorpio craves emotional intimacy. He needs to capture your heart and mind as well as your body. Texting him about how completely he's taken over your every thought will give him tingles. [1] X Research source \"I can't imagine spending time with anyone but you.\" \"I can tell you thing I've never told another soul.\" \"Anyone else pales in comparison to you.\""
    },
    {
      "title": "A little guessing game gets a Scorpio guy's engine revving.",
      "content": "A little guessing game gets a Scorpio guy's engine revving. If you have something sexy to tell him, don't just say it directly—make him guess it! Scorpio guys love a little mystery so it'll make the ultimate reveal even hotter and really turn him on. \"Guess what I'm wearing for our date tonight...\" \"Every time I think of you, one word pops into my mind. Guess what it is 😉 \" \"I'll give you 3 guesses what I want to do tonight... and the first 2 don't count 😘 \""
    },
    {
      "title": "A Scorpio man loves a little game of cat and mouse.",
      "content": "A Scorpio man loves a little game of cat and mouse. Scorpio is co-ruled by Mars, an aggressive and dominant planet, which means this guy's all about the conquest. He'll get really hot under the collar if you rile him up with a little sexy teasing. [2] X Research source \"What?! I would never... I'm completely innocent! 😇 \" \"I'm so distracted today and it's all your fault!\" \"You're a bad influence, mister! I've always been such a good girl!\""
    },
    {
      "title": "A Scorpio guy feels powerful when he knows something no one else does.",
      "content": "A Scorpio guy feels powerful when he knows something no one else does. Power is a big turn-on for him. Besides, he's super secretive himself, so if you're telling him something no one else knows, he'll feel a deep, intimate bond with you. Telling a secret also makes you vulnerable, which is an even bigger turn-on for a Scorpion. [3] X Research source \"Ok, I'll tell you the story... but you have to promise not to repeat it. I've never told anyone about this before.\" \"Can I tell you something I've never told anyone else before?\" \"OMG, I can't believe I told you that. No one knows I did that but you!\" Reader Poll: We asked 261 wikiHow readers if they think Scorpios are generally more mysterious or open, and 91% agreed that Scorpios are mysterious and it may take a while to get to know them . Sharing secrets can definitely help! [Take Poll]"
    },
    {
      "title": "A Scorpio guy is always open to spicy flirtation.",
      "content": "A Scorpio guy is always open to spicy flirtation. A playful sexy comment from out of nowhere will really take him off guard—in a good way. If you take a mundane situation and flip it on its head, your Scorpion's imagination will take off. He says, \"Hey, can I ask you a favor?\" You reply, \"I'll do whatever you want 😉 \" He says, \"I'm free this afternoon. Wanna meet up?\" You reply, \"I'm all yours 😈 \""
    },
    {
      "title": "Scorpio gets excited about the thrill of competition.",
      "content": "Scorpio gets excited about the thrill of competition. He can be super competitive (thank his co-ruling planet Mars for that) and he likes to come out on top—a sexy bet really pushes all the right buttons. He'll take your bet and might even up the ante, so make sure you're ready to deliver whatever you offer. \"If the Braves win, I'll watch the next game with you wearing your jersey... and nothing else.\" \"I bet a hot oil massage you can't get a reservation at that restaurant tonight.\" \"I bet a striptease you won't score a goal in this game.\""
    },
    {
      "title": "A Scorpio guy gets turned on when you reveal something so private.",
      "content": "A Scorpio guy gets turned on when you reveal something so private. The influence of Pluto, co-ruler of his sign, gives a Scorpio guy an intense interest in the human subconscious. Don't worry about your dream being too wild—nothing's too wild for a Scorpio guy. In fact, the wilder it is, the more turned on he'll likely be. \"So you were in my dream last night... wanna hear about it?\" \"You were in my dream last night. Let's just say I woke up very satisfied 😈 \" \"Last night I dreamed you tied me up.\""
    },
    {
      "title": "This makes him feel like he's in control, which Scorpio men love.",
      "content": "This makes him feel like he's in control, which Scorpio men love. Make it something silly and fun so he understands the game. He'll get turned on by the thought that you're doing something only because he allowed you to (even if you were already planning on doing it). [4] X Research source You can always soften the language a bit if you're not comfortable explicitly asking for his permission. \"Can I have a glass of wine with dinner tonight?\" \"May I ask you a question?\" \"May I cook you dinner tonight?\""
    },
    {
      "title": "Scorpio men are extremely visually stimulated.",
      "content": "Scorpio men are extremely visually stimulated. If you really want to turn him on, this is the way to go. Don't think you have to send him full nudes, though. Your sizzling Scorpio loves a little mystery, so it's totally okay if you don't feel comfortable baring it all. Try some of these tantalizing teases: If you're wearing provocative underwear, take a pic revealing just the waistband against your skin. Pose nude, but in a position where nothing NSFW is revealed. Dangle a pair of sexy underwear from one finger and take a picture of your hand. Take an extreme closeup of a random bare part of your body (such as your inner elbow or your calf) and ask him to guess what it is."
    },
    {
      "title": "A Scorpio guy won't judge you and would love to make your fantasy come true.",
      "content": "A Scorpio guy won't judge you and would love to make your fantasy come true. Scorpio is the sexiest, most passionate sign in the zodiac. He loves fantasies—the kinkier, the better. Chances are, he's already done it (or at least thought about it) and he'll get excited just thinking about how to fulfill you in new ways. \"My biggest fantasy is having sex in a public place.\" \"I've always fantasized about being tied up.\" \"I've never told anyone this, but I've always fantasized about having a threesome.\""
    }
  ]
}