{
  "url": "https://www.wikihow.com/Type-Faster",
  "title": "Use Touch Typing to Type Faster",
  "steps": [
    {
      "title": "Get to know the keyboard.",
      "content": "Get to know the keyboard. Most keyboards use the QWERTY layout, but AZERTY and QWERTZ are also common. Look at your keyboard to see what layout you have and where buttons like \"Shift\" and \"Enter\" are. [1] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 31 July 2019. Practice memorizing the positions of the letter keys and common punctuation marks. You need to know their location without looking down if you want to become a fast typist. However, some of this knowledge comes from time as you continuously type without looking at the keyboard."
    },
    {
      "title": "Learn how to hold your hands.",
      "content": "Learn how to hold your hands. Hold your hands and fingers in the position shown. Let each finger return to its start position after each keystroke. Angle your right hand to the left at a 145-degree angle. Angle your left hand to the right at a 45-degree angle. In brief, your hands should arch up slightly from the wrists, and your fingers should rest lightly on the \"home row\" of the keyboard. [2] X Research source The home row keys along with the fingers that you should hit each letter with are as follows: Your left index finger rests on the letter F and hits the characters: F, C, V, G, T, and 6. Your left middle finger rests on the letter D and hits the characters: D, R, 5, and X. Your left ring finger rests on the letter S and hits the characters: Z, E, 4, and 3. Your left pinkie rests on the letter A and hits the characters: A, \\, Caps Lock, 2, 1, W, Q, Tab, Shift, and Ctrl. Your right index finger rests on the letter J and hits the characters: 6, 7, U, J, N, M, H, Y, and B. Your right middle finger rests on the letter K and hits the characters: K, I, 8, and the comma key. Your right ring finger rests on the letter L and hits the characters: L, the full stop key, O, and 9. Your right pinkie finger rests on the semi-colon (;) key and hits the characters: semi-colon, P, /, 0, ', -, =, [, ], #, Shift, Enter, Backspace, and the Ctrl key. Your left and right thumb rests on and presses the space bar."
    },
    {
      "title": "Create a proper typing and working space.",
      "content": "Create a proper typing and working space. Set up somewhere comfortable, well-lit, and ventilated. Never type on your lap, but use a desk or table. Being comfortable is vital when typing for long periods. Get these right before going any further. [3] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 31 July 2019."
    },
    {
      "title": "Use correct posture.",
      "content": "Use correct posture. You should be seated with a straight back, feet planted flat on the floor, and feet shoulder-width apart. Your wrists should be at the same level as the keyboard so that your fingers can arch over the keys easily. You should tilt your head down slightly when looking at the screen. Your eyes should be around 45–70 centimetres (18–28 in) from the screen. [4] X Research source Most office chairs are adjustable. Tinker with your setup until you find the right seat height. Your elbows should not touch the desk, but should instead be by your side and bent at a right angle."
    },
    {
      "title": "Do not slump.",
      "content": "Do not slump. It is important not to let your form slip as you go. Keep your posture and body position correct to avoid aching wrists, which will only slow you down and upset your rhythm! Do not let your shoulders and back hunch up. Try to keep relaxed but upright. [5] X Research source"
    },
    {
      "title": "Get your baseline speed.",
      "content": "Get your baseline speed. You can estimate your typing speed in many ways. WPM (Words per minute) is a classic system to measure your typing speed. Just type “what is my WPM” into a search engine and click one of the top links for a test. Doing this will give you a starting point for your efforts. [6] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 31 July 2019. Have a score as a benchmark to help you measure your progress over time. You want this number to be higher the longer you practice touch typing. Sometimes, you will see your score presented as WAM (words a minute) rather than WPM. These terms have no difference. Remember, a consistent time frame is best when gauging WPM. Typing for more or less time can change your WPM, so be consistent with the test you choose each time you check your progress."
    },
    {
      "title": "Practice touch typing online.",
      "content": "Practice touch typing online. There are thousands of online resources that will help you practice touch typing. A few are https://www.keybr.com/ , https://www.typing.academy/ , and https://www.turtlediary.com/typing-tutorials.html . Stick with it and do not look at your hands. Not looking at your hands will teach your fingers where the keys are through repetition. If you cannot look away from the keyboard, type with a light cloth such as a hand towel draped over your hands. You might find you are slower than at the start, but stick with it. Once you touch type, you will reach much higher speeds than with your original technique."
    },
    {
      "title": "Practice, practice, practice.",
      "content": "Practice, practice, practice. After you have mastered finger and body posture, the only way to improve is by practicing. [7] X Research source Take some time every day to practice touch typing and improve your speed and accuracy. Over time, your WPM will steadily increase. [8] X Expert Source Luigi Oppido Computer & Tech Specialist Expert Interview. 31 July 2019. Set aside ten minutes a day when you can type without stopping. Soon you will notice you make fewer and fewer errors each time. Practice with dictation when you can't get online. If you do not know what to type or can't access an online resource, one good way to practice is by listening to something and typing it out as you go. There is no end to what you can type, and this can be a great way to make practice engaging. Try listening to something that interests you. eBooks, lectures online, and radio talk shows are all good options. A TV show also works! Be imaginative and try to make practice enjoyable."
    },
    {
      "title": "Monitor your progress.",
      "content": "Monitor your progress. Re-test yourself and keep track of your score each week. You will soon notice an upward trend! Do not get obsessed with your WPM score, rather think about how comfortable you are and how much easier you are finding it to type quicker."
    },
    {
      "title": "Consider formal training.",
      "content": "Consider formal training. Many specially designed programs can help you learn to touch type quickly. These include guided sessions and games in which your typing speed and accuracy control the outcome. If you are in a hurry to improve your typing, consider investing in one. You'll have to pay for these programs if you decide the free courses aren't helping you enough."
    },
    {
      "title": "Never give up.",
      "content": "Never give up. Stick with it, and you might be able to rival the fastest touch typists, who can easily top 150 WPM over sustained periods, and upwards of 200 in short bursts. Proficient typing skills can be useful both for work and for study. The quicker you can type accurately, the sooner you will get that element of your task done."
    }
  ]
}