{
  "url": "https://www.wikihow.com/What-Is-the-Opposite-Color-of-Blue",
  "title": "What Color is Opposite of Blue? (RYB, RGB & CMYK Color Systems)",
  "steps": [
    {
      "title": "Orange is the opposite of blue in the most common color wheel.",
      "content": "Orange is the opposite of blue in the most common color wheel. When you look at most color wheels, you’ll notice that blue and orange sit directly across from each other. This makes them “complementary,” or opposite colors. [1] X Research source The most common color wheel is called the RYB (red, yellow, blue) wheel because all the colors on it are derived from combining these 3 primary colors. There’s one big caveat, though, which is that “opposite” colors can change depending on which color system and which color wheel you’re using. More on this in a minute!"
    },
    {
      "title": "Opposite colors are across from each other on a color wheel.",
      "content": "Opposite colors are across from each other on a color wheel. A color wheel is one way we organize colors and show how each of them are related. Color wheels are usually made by identifying primary colors (colors that can’t be made by mixing other colors ), then filling in the gaps between them with secondary colors (colors made by mixing primary colors), then tertiary colors (colors made by mixing a primary and secondary color). [2] X Research source Once you’ve filled all these colors into a wheel, the “opposite” colors are the ones that sit directly across from each other on a wheel. Opposite colors are also “complementary,” because it’s thought that they work well together ."
    },
    {
      "title": "Different color systems have different opposite colors.",
      "content": "Different color systems have different opposite colors. The opposite colors of a color system depend on those first primary colors you picked to make your color wheel. But if you start with different primary colors, you’ll end up with different complementary colors, since the colors are placed differently on the wheel. [3] X Research source There are many different systems, and ways to label those systems. Most commonly, though, we have traditional color theory , where the primary colors are red, yellow, and blue, and modern color theory , where the primary colors are red, green, and blue."
    },
    {
      "title": "Orange is the opposite of blue in the RYB system.",
      "content": "Orange is the opposite of blue in the RYB system. The traditional RYB system uses red, yellow, and blue as primary colors to create a color wheel. With these colors, orange is opposite, or complementary to, blue. [4] X Research source RYB is one of the oldest systems, and was made to suit artists that used physical paints, describing how they mixed colors to make other colors—starting with red, yellow, and blue paints."
    },
    {
      "title": "Yellow is the opposite of blue in the RGB system.",
      "content": "Yellow is the opposite of blue in the RGB system. The RGB system uses red, green, and blue as primary colors, and when these are put together to make a color wheel, yellow is opposite, or complementary to, blue. [5] X Research source RGB is used primarily to display colors on televisions and computer screens."
    },
    {
      "title": "Red is the opposite of blue in CMYK.",
      "content": "Red is the opposite of blue in CMYK. CMYK is a little trickier. It uses cyan, magenta, and yellow (as well as black, or the K) as primary colors. When you mix magenta and yellow together, you get red, which sits at the opposite side of the color wheel from blue. [6] X Research source CMYK was made for printing. Since printing involves adding different colors together to make new colors, it was discovered that the CMYK colors worked best for making the widest range of subtle, vibrant colors on paper."
    },
    {
      "title": "Sky blue",
      "content": "Sky blue This is a stark, bright blue, the color of the sky on a cloudless day. RYB opposite: Reddish orange RGB opposite: Basketball orange CMYK opposite: Powdery orange"
    },
    {
      "title": "Aquamarine",
      "content": "Aquamarine Aquamarine is a light blue color that’s slightly tinted green, like sea glass. RYB opposite: Halloween orange RGB opposite: Pinkish red CMYK opposite: Powdery red"
    },
    {
      "title": "Royal blue",
      "content": "Royal blue Royal blue is a deep, rich, dark blue, almost cobalt. RYB opposite: Halloween orange RGB opposite: Greenish yellow CMYK opposite: Brownish yellow"
    },
    {
      "title": "Navy blue",
      "content": "Navy blue Navy blue is a deep, dark blue tinged with black. RYB opposite: Light orange RGB opposite: Yellow CMYK opposite: Brownish yellow"
    },
    {
      "title": "Powder blue",
      "content": "Powder blue Powder blue is a very light, whitish pastel blue. RYB opposite: Light, reddish orange RGB opposite: Light red CMYK opposite: Powder red"
    },
    {
      "title": "Determine which color system you’re choosing.",
      "content": "Determine which color system you’re choosing. We explained earlier that different color systems, like RGB, RYB, and CMYK, have different color wheels, and so have different opposite, or complementary colors. Before you find your opposite color, determine which color system you’re working in. Remember, RYB is often used for traditional art like painting, RGB is often used for displaying color on computer screens, and CMYK is the standard for printed colors."
    },
    {
      "title": "Look at colors across from each other on that system’s color wheel.",
      "content": "Look at colors across from each other on that system’s color wheel. Next, all you have to do is pull up your color wheel, find your starting color, then trace a straight line across from that color. The straight line will point to that color’s opposite. For example, in RYB : Green is the opposite of red. Purple is the opposite of yellow. Orange is the opposite of blue. Check out Ferrum’s color wheel explainer to see more examples of color wheels in different color systems."
    },
    {
      "title": "Subtract the color’s RGB code from white’s RGB code.",
      "content": "Subtract the color’s RGB code from white’s RGB code. To find the opposite of a color using RGB hex codes, simply pinpoint your color and take note of the RGB code, which is a 3-number code that tells you the value of how much red, green, and blue are in a color. White’s RGB code is 255, 255, 255. For example, to find the opposite of a teal blue (0, 220, 200), we’d subtract each of those numbers from the corresponding RGB white numbers. So, 255-0=255; 255-220=35; 255-200=55. Meaning our resulting color is 0,35,35, which is a vibrant green. Then, use a tool like HTMLColorCodes to plug in the RGB code and convert it to a hex code, which is just another way of expressing the color balance of a given color."
    },
    {
      "title": "Opposite colors are pleasing because of how our eyes perceive them.",
      "content": "Opposite colors are pleasing because of how our eyes perceive them. The answer to this age-old question has a lot of biology behind it. Our eyes contain cells called “photoreceptors” that tell our brain what colors we’re seeing. But these cells can get tired from looking at one color too long. Basically, complementary colors activate different cells at the same time, which leads to a more exciting and less tiring experience for your eyes. [7] X Research source The colors both pop and balance each other, or at least that’s what your brain is thinking! It’s a tricky sort of illusion that’s happening all the time, even if we don’t realize it. On the other hand, “clashing” colors that don’t go together stimulate similar cells, making them fatigue more quickly, and giving an unbalanced effect. You can demonstrate complementary colors yourself! Look at a blue screen for 30-60 seconds, then at a white wall. Your eyes will show orange (or yellow), blue’s complementary color. This is because your eye’s “blue cells” get tired, but the “orange” cells take it easy. Then, when you look away, the blue cells take their break, and the orange cells activate to make up the difference."
    }
  ]
}