{
  "url": "https://www.wikihow.com/Stop-Being-Scared-After-Watching-Scary-Movies",
  "title": "How to Stop Being Scared After Watching Scary Movies",
  "steps": [
    {
      "title": "Watch the movie in the morning to make it seem less scary.",
      "content": "Watch the movie in the morning to make it seem less scary. Instead of watching the movie after sunset, turn it on at the beginning of your day. By the time it's time for bed, you'll have a whole day's worth of activities to distract you. As a result, you won't be as scared of the movie. [1] X Research source You are more likely to get scared of a horror movie if you watch it when it's dark outside. This doesn't mean you have to skip the popcorn!"
    },
    {
      "title": "Avoid watching scary movies by yourself.",
      "content": "Avoid watching scary movies by yourself. Oftentimes scary movies seem worse when you are alone and don't have as many distractions. To avoid this, always watch scary movies with at least 1 other person. The more the merrier! This way, you are less likely to be scared after the movie is over."
    },
    {
      "title": "Talk to yourself or others throughout the movie to ease your mind.",
      "content": "Talk to yourself or others throughout the movie to ease your mind. Discuss the plot, setting, and characters with your friends or family members if you are watching the movie with others. If you are watching the film by yourself, make comments like “How silly” as the movie plays. This way, you offer reassurance to yourself (and others) and breakthrough any tension created from the plot. [2] X Research source Making comments about the movie can help reduce stress and make you feel more relaxed. You can say things like, “Did you see how slow she ran!” or “Nice hairstyle,” with a sarcastic tone. Get ideas from other wikiHow readers for how you'd survive the scary movie at the wikiHow forum—check out the post, \"I survived! Take that horror movie.\""
    },
    {
      "title": "Laugh",
      "content": "Laugh during the scary part of the movie so you don't get spooked. When the music gets intense and you know something scary is coming, laugh or say something funny. Do this even if you don't think the part of the movie is comical. Laughing alleviates the tension, and the scary moments won't seem as traumatic. [3] X Research source This also lightens the mood overall, so if you are watching a movie with other people, they will likely relax too."
    },
    {
      "title": "Watch the special features to educate yourself on the film.",
      "content": "Watch the special features to educate yourself on the film. If you see how the movie was made, it often seems less realistic and scary. Most DVDs offer behind-the-scenes features, and you can look up director specials online. The special features usually go in-depth in describing the storyline and detailing the characters, which can make it seem more unrealistic. You can also read movie reviews to help you better understand the movie."
    },
    {
      "title": "Remind yourself that the movie is not real and you are safe.",
      "content": "Remind yourself that the movie is not real and you are safe. Say to yourself, “This is fake,” and “I am safe,” over and over again until you believe it. This may take some repetition and self-trust, but it is helpful to reassure yourself that the movie is a work of fiction. [4] X Expert Source Samantha Fox, MS, LMFT Marriage & Family Therapist Expert Interview. 19 January 2021. You can remember parts of the movie that are especially cheesy or unrealistic to help convince yourself. Lock your doors if that puts your mind at ease. [5] X Research source Even scary movies advertised as “based on a true story” are exaggerated and intensified to make it more convincing. For example, maybe the villain has bad makeup so you know his real identity the whole time. Or, maybe the characters in the movie are unrealistic in real life, like a swamp monster or a zombie. These details can help convince you that the movie is fictitious."
    },
    {
      "title": "Do brief exercises for 5-10 minutes to get rid of any extra energy.",
      "content": "Do brief exercises for 5-10 minutes to get rid of any extra energy. After you watch a horror movie, you are in a state of “fight or flight.” Exercise can help reduce stress. Do things like dance around, jog in place, do jumping jacks , or have a pillow fight. After you let off some steam, you likely will feel less tense and scared. Avoid over-exercising before bed. It may be even more difficult to sleep if you are stimulated."
    },
    {
      "title": "Distract your mind with an uplifting TV show, movie, or book.",
      "content": "Distract your mind with an uplifting TV show, movie, or book. An easy way to stop being scared is to distract yourself. Immediately turn on a different movie or TV show, and make sure it's a lighthearted subject with a positive tone. This way, you'll focus on the good and not feel worried and anxious. Select a comedy or inspiring documentary, for example. You can also read a book, flip through a magazine, or draw . Additionally, focus on positive upcoming events to keep yourself distracted. Maybe you have an exciting date night or concert to look forward to."
    },
    {
      "title": "Spend time with friends or family so you don't feel alone.",
      "content": "Spend time with friends or family so you don't feel alone. If you watched a movie with others, continue spending time with them. If you watched the movie by yourself and are scared afterward, reach out to a friend or family member. Invite them over to hang out, for example. If you are alone, you are more likely to feel scared and worried. Having other people around will reassure you. You can cook a meal, chat about your day, or play a game, for example."
    },
    {
      "title": "Sleep with a night light turned on if it makes you feel safer.",
      "content": "Sleep with a night light turned on if it makes you feel safer. Plug a nightlight into a nearby outlet, and turn it on before you go to bed. This way, you can see in the dark and know no ghosts or a boogeyman are coming for you. Try to only use this after you watch the movie, so you don't depend on the night light every time you go to sleep. For example, you can use a decorative night light, like one shaped like a moon or star, or you can use a simple night light."
    },
    {
      "title": "Play relaxing music if you are having trouble falling asleep.",
      "content": "Play relaxing music if you are having trouble falling asleep. Background music can lull you to sleep, even if you are worried after watching a scary movie. Before you go to bed, turn on nature sounds like waves crashing on a beach or birds in the forest. Then, let yourself drift off to sleep peacefully. Also listen to instrumental sleepytime music, such as “Brahms Lullaby.” You can listen to this in headphones or through a sound system."
    },
    {
      "title": "Tell yourself “It's just a movie” if you wake up in the middle of the night.",
      "content": "Tell yourself “It's just a movie” if you wake up in the middle of the night. If you can fall asleep but wake up out of fear, remind yourself that you simply had a nightmare and it is not real. Then, repeat to yourself that the scary feelings are just from the movie. Do this until you believe it and fall back asleep. Take some deep breaths as you repeat this to yourself. This will help you relax so you can go back to bed."
    },
    {
      "title": "Ask a friend or family member to have a sleepover so you're not alone.",
      "content": "Ask a friend or family member to have a sleepover so you're not alone. If you cannot get to sleep no matter how hard you try, you may feel better if you sleep around someone else. Ask a friend, relative, or roommate if you can sleep on their floor, or ask them to sleep in your room. This way, you can more comfortably go to sleep knowing you aren't alone and are safe. [6] X Research source Do this if you truly are afraid and nothing else seems to work. Additionally, bring extra pillows, blankets, snacks, and activities to make it a slumber party! This way, you can have fun while forgetting about your fears."
    }
  ]
}