{
  "url": "https://www.wikihow.com/Use-Moldavite",
  "title": "How to Use Moldavite for Healing & Transformation",
  "steps": [
    {
      "title": "Cleanse and charge your moldavite to activate it before use.",
      "content": "Cleanse and charge your moldavite to activate it before use. New crystals need to be activated by being cleansed and charged before they can benefit you. First, cleanse your glassy gem by exposing it to moonlight or sunlight, burning sage, or another crystal like selenite or clear quartz (see here for more complete cleansing instructions) . Then, charge the stone by burying it overnight to absorb earth and moon energy. [1] X Research source It’s important to cleanse crystals regularly so that they’re clear of any lingering energy from their previous owner or previous uses. “Crystals do not judge anything as good or bad,” explains hypnotherapist and energy healer Karuna Jain. So, they can hold both positive and negative energies. Alternately, hold your moldavite in your left hand (the hand that receives energy) in the sunlight to simultaneously cleanse and charge it."
    },
    {
      "title": "Program your crystal with a clear intention.",
      "content": "Program your crystal with a clear intention. Visualize how moldavite will help you heal or accomplish your goals. Hold the crystal and make yourself comfortable in a calm space. Close your eyes and imagine yourself using the moldavite to achieve your desires or overcome adversities in your life. [2] X Research source Be specific in your intentions. Vague wants or desires are harder to manifest than focused, distinct outcomes. You don’t have to choose just one thing to get moldavite’s help with. As long as your intentions are genuine, it can help you with all of them."
    },
    {
      "title": "Work with moldavite in short sessions at first.",
      "content": "Work with moldavite in short sessions at first. Moldavite is a high-energy stone that can be overstimulating at first. Many users feel the “moldavite flush”—a warm sensation in your hand that spreads through your whole body—during their first session. It sometimes takes days or weeks to acclimate to the high vibrations, so begin with short moldavite sessions until you’re used to the energy. [3] X Research source Your first session might only consist of holding the crystal, feeling the flush, and putting it back down to introduce yourself to its power. As you get more comfortable with the stone, you can lengthen your sessions and begin using it for more specific purposes. Other sensations like tingling chakras, light-headedness or dizziness, or an out-of-body feeling may accompany the moldavite flush."
    },
    {
      "title": "Keep moldavite nearby at all times—in your office, room, or pocket.",
      "content": "Keep moldavite nearby at all times—in your office, room, or pocket. Moldavite elevates your consciousness and removes mental blocks, so keeping it near you can unlock creativity. Wear, carry, or set it near you while working on a creative project like journaling, painting, or making music. Moldavite helps you awaken your inner truth and express yourself through this type of work. [4] X Research source If you’re feeling unproductive at work, place the moldavite crystal on your desk or workspace to help motivate you. If you’re wanting to experience the stone’s energies while on the go, carry a piece of moldavite in your pocket and touch it when you need a boost of creative energy."
    },
    {
      "title": "Wear moldavite jewelry to stay shrouded in its high-vibration field.",
      "content": "Wear moldavite jewelry to stay shrouded in its high-vibration field. Wearing the crystals as jewelry may amplify its benefits and boost your good luck and the likelihood of “coincidences” while you go about your day. Some people may feel overstimulated or ungrounded when they wear it for too long, so it’s best to gradually adapt to wearing it all day long. [5] X Research source For the best results, set your moldavite in silver jewelry. Make sure that the stone is touching your skin rather than hanging over a piece of clothing. If you don’t have jewelry, carry moldavite in your purse, backpack, or pocket to get the same effect. Moldavite is most commonly found and used in jewelry, but it can work for you as a standalone stone as well."
    },
    {
      "title": "Display moldavite in your home to boost your well-being.",
      "content": "Display moldavite in your home to boost your well-being. Moldavite conducts the energies of renewal, nutrition, and wellness. Keep moldavite in rooms like the kitchen, a child’s room, or a space where you plan to begin a new project to boost their energy and encourage success. It’s also a strong protector against negative energy or bad spirits in your home. [6] X Research source Moldavite channels Wood Energy, one of the elements of feng shui. It's associated with living spaces and southeast corners of rooms and houses."
    },
    {
      "title": "Sleep with the moldavite under your pillow or close to your bed.",
      "content": "Sleep with the moldavite under your pillow or close to your bed. Sleeping with moldavite can help you perform dreamwork, or the skill of healing or gathering insight through dreams. To aid your dreamwork, place moldavite under your pillow or wear moldavite jewelry overnight. The moldavite will keep you centered with loving energy while you sleep and dream. [7] X Research source Some people find moldavite too stimulating to use at night, while others only feel the need to use it periodically. Try keeping moldavite on your nightstand or bedside table so you can grab it between dreams to calm or focus your energy if needed. Moldavite’s high vibrations may also ward off negative spirits and nightmares while you sleep."
    },
    {
      "title": "Combine the moldavite with other crystals to amplify their energies.",
      "content": "Combine the moldavite with other crystals to amplify their energies. While meditating or carrying moldavite, hold or wear a second crystal to combine their energies. This approach is considered to be especially effective with other translucent crystals, like quartz. Some popular and powerful crystal combos include: Moldavite and rose quartz: Rose quartz balances the Heart Chakra. It is a love crystal that “helps to bring up the energy of love within your heart,” explains Jain. It also bolsters your sense of kindness, comfort, and self-compassion. Moldavite and clear quartz: Clear quartz is a grounding stone that enhances good energy and opens the Crown Chakra (it also cleanses moldavite!). [8] X Research source Moldavite and black tourmaline or obsidian : This combination is ideal for physical healing and medicinal purposes."
    },
    {
      "title": "Meditate with moldavite to deepen your practice or do shadow work.",
      "content": "Meditate with moldavite to deepen your practice or do shadow work. Moldavite is useful for contemplation and interpreting spiritual signals. To gain deeper clarity while you meditate , simply hold the stone in your hand or wear moldavite jewelry during your meditation session. Alternatively, place moldavite in the corners of your mindfulness room while you meditate. Your awareness of the spiritual world and your inner consciousness will skyrocket! [9] X Research source Gaze at your moldavite’s transparent, glassy surface while concentrating or meditating to increase your communication with the frequencies of the universe. If you’d like to engage in shadow work —which puts you in touch with your hidden or repressed self—hold your moldavite or place it near you while meditating on your fears, hesitations, or traumas. The stone will bring these parts of you to light so you can heal and transform."
    },
    {
      "title": "Meditate with moldavite near your heart to open your heart chakra.",
      "content": "Meditate with moldavite near your heart to open your heart chakra. Moldavite benefits all chakras but has a special connection to the heart. Wear a moldavite necklace that dangles near your heart or hold moldavite to your heart or chest during meditation. As your chakra becomes unblocked, you’ll gain clarity on your personal feelings and desires. [10] X Research source The Heart Chakra is green, which is why moldavite and other green gems are useful for opening it up . When your Heart Chakra is blocked, you might feel overly judgmental or dominating in your relationships. These emotions are a good sign that it’s time to unblock your chakra with the help of moldavite."
    },
    {
      "title": "Meditate with moldavite on your head to open the upper chakras.",
      "content": "Meditate with moldavite on your head to open the upper chakras. Moldavite’s spiritual powers may help to soothe and balance the Third Eye and Crown Chakras. Hold your stone to the Third Eye Chakra (located between your eyes) during meditation to unlock new visions, thoughts, and ideas. Meditate on the Crown Chakra (at the crown of your head) to access ascended states of consciousness. [11] X Research source When your Crown Chakra is open and balanced, all of your other chakras will open up too. Try taping your moldavite to your forehead during meditation or sleep to heal your Third Eye Chakra."
    },
    {
      "title": "Gaze into or place intentions on the moldavite to aid manifestation.",
      "content": "Gaze into or place intentions on the moldavite to aid manifestation. When manifesting , state your intentions aloud and focus them onto the moldavite crystal. Gaze into the stone while visualizing your desired outcome. The moldavite’s high vibrational energy and creative forces are believed to help transform dreams and intentions into tangible realities."
    },
    {
      "title": "Moldavite is believed to accelerate healing by stimulating cellular regeneration.",
      "content": "Moldavite is believed to accelerate healing by stimulating cellular regeneration. Some groups claim that moldavite has powerful physical healing properties. They believe that the crystal can quicken cellular repair and energize the entire body to rebalance energy flow and promote optimal physical health. While none of these claims have been scientifically proven, incorporating moldavite in your daily life or meditative practices may help to heal the following conditions: [12] X Research source Allergic reactions and sensitivities Circulation problems Digestive disorders Headaches and migraines Joint and muscle pain Reproductive issues Respiratory issues Skin irritations and rashes Vertigo and dizziness"
    },
    {
      "title": "Moldavite is believed to help inner mental and emotional transformation.",
      "content": "Moldavite is believed to help inner mental and emotional transformation. In spiritual practices, moldavite is referred to as the “stone of transformation,” meaning that it’s believed to have healing and transformative powers when applied to one’s emotions or mental state. Specifically, using moldavite crystals in your daily life or meditative practices may help to: [13] X Research source Purge and heal suppressed emotions using moldavite’s high-frequency vibration. Ease sadness, grief, and heartache by connecting moldavite to the heart chakra. Break down resistance to change with the stone’s disruptive energy. Enhance inward insight , self-discovery, and a search for inner truths. Facilitate healthy detachment by raising awareness of emotional patterns. Open the heart to increased compassion for oneself and others. Rekindle excitement , creativity, and passion by activating the lower chakras."
    },
    {
      "title": "Cleanse the moldavite regularly through smudging or other methods.",
      "content": "Cleanse the moldavite regularly through smudging or other methods. Since moldavite is such a powerful agent in absorbing negative energies, it’s crucial to cleanse it regularly. Keep moldavite cleansed and charged so it’s always refreshed and ready to aid your healing or meditation. Choose the cleansing option below that works best for you and your stone: Smudging : Hold it in the smoke of a lit sage stick and visualize negative energy releasing. Saltwater bath: Soak it in sea saltwater overnight and rinse. Sunlight: Place it in direct sunlight for 4-6 hours. Repeat monthly. Moonlight: Leave it out overnight under a full moon. Repeat monthly. Sound: Clap or ring a bell over the stone. Repeat for 2-3 minutes. Earth: Bury the stone in dirt for 24 hours. Mark the spot and dig it up afterward. Meditation: Hold the stone and meditate on a white light cleansing its impurities. Other stones: Place the moldavite next to a clear quartz or selenite crystal so that both stones touch. Leave for as long as you feel is necessary."
    },
    {
      "title": "Moldavite is a green and glassy stone formed by meteorites hitting the Earth.",
      "content": "Moldavite is a green and glassy stone formed by meteorites hitting the Earth. Moldavite is a rare gemstone with a vivid green color and rich history. It’s believed that the first moldavite stone was formed about 15 million years ago when a meteorite impacted the Earth in the present-day Czech Republic. The heat of this collision melted the sand and rock around the meteorite, catapulting the earth into the air where it cooled into glass that was later named as moldavite. [14] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source"
    },
    {
      "title": "Moldavite is thought to symbolize transformation, fortune, and fertility.",
      "content": "Moldavite is thought to symbolize transformation, fortune, and fertility. Due to moldavite’s origins as a meteorite crashing into Earth, it’s been imbued with a sense of mysticism and extra-terrestrial energy. It’s often called the “stone of transformation,” since it’s tied to spiritual awakening, change, and self-discovery. Others call moldavite the “stone of the Holy Grail” due to its connection to spiritual evolution and cosmic powers. [15] X Research source In Czech folklore, moldavite is believed to bring good fortune and fertility. It was often used as part of a woman’s dowry gift or as a wedding decoration to bless new marriages. Moldavite’s stunning green color also connects it to the heart chakra (which is often associated with the color green). Followers of spiritualism believe that moldavite has a rare ability to open, activate, and heal the heart. [16] X Research source In modern astrology , moldavite is thought to be helpful to all zodiac signs. Since the stone is thought to have come from the stars themselves, it may carry a special energy for each and every zodiac sign. Moldavite is not considered a main birthstone, nor is it associated with any particular month. However, its transformative and fertile qualities (alongside its green hue) make it a natural birthstone for those born in the springtime months (i.e., March, April, and May)."
    },
    {
      "title": "Physical properties",
      "content": "Physical properties Accelerated spiritual growth and evolution Removal of energetic blockages in the body Reduction of stagnant energies in the body Clearing of old emotions from the heart Chest expansion and relief Detoxification of the cells, blood, and organs Note that these are believed physical properties of the moldavite stone. No scientific evidence has shown that moldavite crystals have a demonstrable effect on any physical ailments or health issues."
    },
    {
      "title": "Mental properties",
      "content": "Mental properties Opening, activation, and balancing of the upper chakras Expanded mental clarity and intuition Enhanced inner vision and psychic ability Improved connection to higher states of consciousness Accelerated inner development Increased likelihood of positive synchronicities and serendipitous events"
    },
    {
      "title": "Emotional properties",
      "content": "Emotional properties Aid in releasing old wounds, traumas, and believed limitations Transformation of anger, resentment, and fear into love, joy, and peace Identification and release of unhealthy emotional patterns Enhanced self-love and emotional freedom"
    },
    {
      "title": "Spiritual properties",
      "content": "Spiritual properties Opening of the heart chakra to greater levels of compassion Activation of one’s higher purpose Increased experiences of spiritual awakening Enhanced connection with spirit guides or guardian angels Invitation of positive change, growth, and inner purification"
    },
    {
      "title": "Where can you get moldavite?",
      "content": "Where can you get moldavite? Moldavite exists in very finite quantities, and it’s primarily mined in the Czech Republic. You can buy moldavite from reputable jewelry sellers online or in your area. However, moldavite is one of the rarest, most expensive, and most frequently counterfeited crystals. For these reasons, avoid any price deals that seem too good to be true and make sure to buy from a reputable seller. [17] X Research source"
    },
    {
      "title": "How can you tell if moldavite is real?",
      "content": "How can you tell if moldavite is real? One of the key features of a genuine moldavite stone is its lechatelierite inclusions, which look like gas bubbles, swirls, or grains of silica glass embedded into the stone. Real moldavite is often described as having a wavy appearance. Some counterfeiters make fake lechatelierite by etching artificial glass with hydrofluoric acid, but this process is only completed by highly sophisticated counterfeiters. [18] X Research source You can also examine the stone’s finish and coloring. Real moldavite has a matte finish, while polished or shiny moldavite is likely a fake (although some counterfeit gems may also have a matte finish). Genuine moldavite crystals will also have a pale olive green tone, while an unnaturally vivid green color may indicate that it’s made from manufactured glass."
    },
    {
      "title": "Can moldavite get wet?",
      "content": "Can moldavite get wet? Yes, it’s fine for moldavite to get wet, but you should avoid submerging it in liquids or exposing it to water for long periods of time. You can wear your moldavite crystal for short periods in the ocean, pool, or shower without it being deactivated or damaged. Just be sure to wipe your moldavite dry after getting it wet. [19] X Research source"
    },
    {
      "title": "What is the moldavite flush?",
      "content": "What is the moldavite flush? Moldavite flush is the term used to describe the intense bodily sensation that some people experience when they first touch a moldavite stone. Many individuals have claimed to feel tingling in their hands, vibrations in their chest, general disorientation, and intense heat flush over their face or entire body. This phenomenon is only believed to happen when a person first touches the stone, and it doesn’t seem to happen to everyone. [20] X Research source The moldavite flush, if real, is likely caused by the high vibrations that the crystal is thought to emit."
    }
  ]
}