{
  "url": "https://www.wikihow.com/Uninstall-Facebook-Messenger",
  "title": "How to Delete Messenger from Your Phone or Tablet",
  "steps": [
    {
      "title": "Find the Facebook Messenger app icon.",
      "content": "Find the Facebook Messenger app icon. This app icon resembles a blue speech bubble with a white bolt of lightning in it. You'll find it on one of your iPhone's Home Screens."
    },
    {
      "title": "Tap and hold the Messenger app icon.",
      "content": "Tap and hold the Messenger app icon. After a second, your phone will vibrate and pull up a menu for the Messenger app. [1] X Research source"
    },
    {
      "title": "Tap Remove App.",
      "content": "Tap Remove App . It's at the top of the menu. The button has red text and has an icon of a minus sign inside a circle."
    },
    {
      "title": "Tap Delete App.",
      "content": "Tap Delete App . It's the option with red text. If you tap Remove from Home Screen , the app will still be installed on your phone but can only be accessed from your App Library."
    },
    {
      "title": "Tap Delete.",
      "content": "Tap Delete . The app will be removed from your device. If you want to reinstall it, you'll have to do so from the App Store."
    },
    {
      "title": "Find the Messenger app in your App Library.",
      "content": "Find the Messenger app in your App Library. Simply swipe all the way to the right past all of your Home Screens to find the App Library. Tap the search bar at the top of the screen and type \"Messenger.\""
    },
    {
      "title": "Tap and hold the Messenger app icon.",
      "content": "Tap and hold the Messenger app icon. After a second, your phone will vibrate and pull up a menu for the Messenger app."
    },
    {
      "title": "Tap Delete App.",
      "content": "Tap Delete App . It's the option with red text."
    },
    {
      "title": "Tap Delete.",
      "content": "Tap Delete . The app will be removed from your device. If you want to reinstall it, you'll have to do so from the App Store."
    },
    {
      "title": "Open the Google Play Store.",
      "content": "Open the Google Play Store. Tap the Google Play Store app icon, which resembles a multicolored triangle on a white background."
    },
    {
      "title": "Tap your profile icon.",
      "content": "Tap your profile icon. It's in the upper-right corner of the screen."
    },
    {
      "title": "Tap Manage apps & devices > Manage.",
      "content": "Tap Manage apps & devices > Manage . This will open a list of all the apps installed on your phone."
    },
    {
      "title": "Select Messenger - Text and Video Chat for Free.",
      "content": "Select Messenger - Text and Video Chat for Free . Scroll down until you find the Messenger option, then tap it. Doing so opens the Messenger app page."
    },
    {
      "title": "Tap UNINSTALL.",
      "content": "Tap UNINSTALL . It's at the top of the Messenger app page. [2] X Research source"
    },
    {
      "title": "Tap OK when prompted.",
      "content": "Tap OK when prompted. Doing so will confirm your choice and remove Facebook Messenger from your Android."
    },
    {
      "title": "Open Settings .",
      "content": "Open Settings . Tap the Settings app icon, which resembles a white gear on a light-blue background. [3] X Research source On Samsung Galaxy phones, the Settings app icon resembles a stylized, white gear on a purple background."
    },
    {
      "title": "Tap Apps & notifications.",
      "content": "Tap Apps & notifications . It's near the top of the menu, though you may have to scroll down to see this option on some phones. Doing so opens a list of your currently installed apps. [4] X Research source On some phones (such as a Samsung Galaxy), this menu just says Apps ."
    },
    {
      "title": "Select the Facebook Messenger app.",
      "content": "Select the Facebook Messenger app. Scroll through your available apps until you find the Facebook Messenger app, then tap it. You may have to tap See all apps or App info before you can find the Facebook Messenger app."
    },
    {
      "title": "Tap UNINSTALL.",
      "content": "Tap UNINSTALL . It's usually near the top of the screen. [5] X Research source If you just see DISABLE here, tap it instead."
    },
    {
      "title": "Tap UNINSTALL or OK when prompted.",
      "content": "Tap UNINSTALL or OK when prompted. This will remove the Messenger app from your Android."
    },
    {
      "title": "Deactivate your Facebook account.",
      "content": "Deactivate your Facebook account. In order to see the option to deactivate your Messenger account, you'll need to deactivate your Facebook account first. You can do this in the Accounts Center if you have access, otherwise through Facebook's settings. Check out our in-depth guide to deactivating your Facebook account if you're not sure how to do this."
    },
    {
      "title": "Open the Messenger app on your mobile device.",
      "content": "Open the Messenger app on your mobile device. You can't deactivate your Messenger account on the computer."
    },
    {
      "title": "Tap the menu button, then tap Settings.",
      "content": "Tap the menu button, then tap Settings . The menu button looks like three horizontal lines."
    },
    {
      "title": "Tap on Accounts Center.",
      "content": "Tap on Accounts Center . If you don't see Accounts Center or it doesn't allow you to deactivate your Messenger account this way, follow these steps: Tap your profile picture in the corner of the screen. Tap Account settings > Account ownership and control > Deactivation or deletion > Continue to Facebook account deactivation and deletion . Tap Continue to account deactivation and enter your password. To delete your account, tap Continue to account deletion ."
    },
    {
      "title": "Navigate to account deactivation in the Accounts Center.",
      "content": "Navigate to account deactivation in the Accounts Center. To do this, tap on these menu items: Personal details > Account ownership and control > Deactivation or deletion > Continue to Facebook account deactivation and deletion ."
    },
    {
      "title": "Deactivate your Messenger account.",
      "content": "Deactivate your Messenger account. To do this, tap Continue to account deactivation then enter your password. If you'd rather delete your account, tap Continue to account deletion . [6] X Research source"
    },
    {
      "title": "Why do I still see the Messenger icon in the Facebook app after uninstalling it?",
      "content": "Why do I still see the Messenger icon in the Facebook app after uninstalling it? The Facebook app will show the Messenger icon even if you don't have Messenger installed. If you tap the Messenger icon, however, nothing shows up. There is no way to remove the Messenger icon inside the Facebook app. If you want to completely remove yourself from Facebook Messenger, you'll also have to delete your Facebook account."
    },
    {
      "title": "Why can't I delete Facebook Messenger from my Android?",
      "content": "Why can't I delete Facebook Messenger from my Android? Some apps, such as System apps or pre-installed apps, cannot be deleted from Android phones. If Facebook Messenger came pre-installed on your factory-new Android phone, you may not be able to remove it."
    }
  ]
}