{
  "url": "https://www.wikihow.com/Use-a-Katana-Properly",
  "title": "How to Use a Katana Properly",
  "steps": [
    {
      "title": "Position your hands at the top and bottom of the handle.",
      "content": "Position your hands at the top and bottom of the handle. Hold the katana in front of you so it’s perpendicular to the ground. Keep your dominant hand 1 inch (2.5 cm) from the top of the handle, and wrap your fingers and thumb so they’re on opposite sides of the handle. Place your nondominant hand at the bottom of the handle before wrapping your fingers and thumb around it. Make sure the backs of your hands face out away from the sword on their respective sides. Keep a grip that’s firm enough so the katana doesn’t slip, but loose enough so you can easily maneuver around. [1] X Research source Don’t touch your hands together or else you’ll cut with a hacking motion and you won’t be as accurate. Keep at least 3–4 inches (7.6–10.2 cm) between them. Avoid keeping your thumbs on top of the handle since you won’t get a proper grip on the sword."
    },
    {
      "title": "Stand in front of your target so you can reach it with the end of your blade.",
      "content": "Stand in front of your target so you can reach it with the end of your blade. Traditional targets for practicing with a katana include bamboo or rolled tatami mats. Stand with your feet shoulder-width apart and pointed toward the target. Fully extend your arm with the katana and take a few steps so the blade extends 4–5 inches (10–13 cm) past the front of the target. [2] X Research source Other targets you can try include pieces of paper or filled plastic bottles. You can also practice without a target if you just want to perfect your form. Make sure there’s nothing around your target that could damage the blade or get cut by the sword. Aim to keep other items at least 10 ft (300 cm) away."
    },
    {
      "title": "Hold the blade above your head so it’s near parallel to the ground.",
      "content": "Hold the blade above your head so it’s near parallel to the ground. Keep your elbows slightly bent as you raise the blade over your head. Leave your feet firmly planted on the ground and your body pointing toward the target. When you have the blade near horizontal, stop your backswing and hold it in place. [3] X Research source You can also cut down at an angle if you want to strike the target from the side. Point the tip of the blade closer to the side where you want to start your cut. The cutting edge of the katana will point up while it’s over your head."
    },
    {
      "title": "Push the top of the handle forward to help the blade arc.",
      "content": "Push the top of the handle forward to help the blade arc. Don’t start your swing until you’re ready to go through the full swing in a single fluid motion. Straighten your dominant arm and wrist so the blade starts swinging in a forward motion. As you fully extend your arm, the katana blade will start to move forward and gain speed so it’s more likely to cut through your target. [4] X Research source It’s okay to break down the steps of your swing and go slowly while you’re practicing."
    },
    {
      "title": "Step forward as you bring the blade down toward the target.",
      "content": "Step forward as you bring the blade down toward the target. Once you bring your hands in front of your head, take a step with the leg on the same side of your body as your dominant hand to get more power. Try to step forward by 3–4 inches (7.6–10.2 cm) so it extends the reach of your blade as well. As you step, continue the forward motion of the blade so you don’t hesitate during your strike. [5] X Research source If you’re bringing the blade down at an angle, step forward with the foot that’s on the opposite side as the end of your cut. For example, if you’re cutting from right to left, step forward with your right foot."
    },
    {
      "title": "Slice into the target at a 45-degree angle.",
      "content": "Slice into the target at a 45-degree angle. Slightly turn your hands to readjust the angle of the blade as you’re about to make contact with your target. Keep swinging through the full motion to cut through your target as cleanly as possible. Try to keep the cut at a 45-degree angle so it makes an angled cut and makes the best contact with the blade. Stop the blade so it’s at least 2 feet (61 cm) off of the ground and doesn’t get damaged. [6] X Research source If you’re swinging to practice form, try to stop your movement when you have the blade at chest level. That way, you’re able to develop better control of the sword."
    },
    {
      "title": "Swing the blade horizontally from your side for a mid-level attack.",
      "content": "Swing the blade horizontally from your side for a mid-level attack. Maintain your grip on the handle so your dominant hand is on top and your nondominant hand is at the end. Hold the katana on the side of your body that you want to strike from so the blade points up at a 45-degree angle. When you want to strike, straighten your dominant arm so the blade swings out in front of you at chest level. Try to keep the blade parallel to the ground and end your swing when the blade is in front of your opposite shoulder. [7] X Research source You can do horizontal strikes using only your dominant hand but you may not have as much control over the blade."
    },
    {
      "title": "Tilt the blade upside-down to strike from below.",
      "content": "Tilt the blade upside-down to strike from below. Position the katana so it’s at a 45-degree angle pointing toward the ground behind you and the cutting edge faces forward. Keep your dominant hand near the guard on the handle and the nondominant one at the end of the handle. When you’re ready to strike, fully extend your dominant arm and swing it forward. End your strike at chest level so the cutting edge of the blade faces up. [8] X Research source Keep your nondominant wrist loose so you can easily control and maneuver the blade. You may need to cross your dominant arm over your nondominant one if you’re striking from the other side of your body."
    },
    {
      "title": "Use the side or back of the blade to block incoming hits.",
      "content": "Use the side or back of the blade to block incoming hits. If you try to use the cutting edge to deflect incoming blows, you may damage or chip the katana. Try to block the strike near the center of the katana so it lands along the sides or back of the blade where there’s thicker metal. Avoid blocking the strike with the last 1 foot (30 cm) of the blade’s pointed end since you may lose your balance or grip easier. [9] X Research source Try to sidestep away from blows while you’re blocking so you can get out of the way of the attack."
    },
    {
      "title": "Keep the blade at a 45-degree angle in front of you to block overhead strikes.",
      "content": "Keep the blade at a 45-degree angle in front of you to block overhead strikes. When you expect an attack from overhead or at an angle, hold your katana so your hands are about 1 foot (30 cm) above your head. Point the tip of the blade at a 45-degree angle to the ground in front of you so the strike slides off the katana more easily. Make sure the cutting edge faces down so you don’t damage the sword. [10] X Research source Keep the cutting edge perpendicular to the ground so it doesn’t point back at you. Place your nondominant palm against the side of the katana blade to help you support it, but be careful not to touch the cutting edge, or you could hurt yourself."
    },
    {
      "title": "Hold the blade upside-down to protect against low and side attacks.",
      "content": "Hold the blade upside-down to protect against low and side attacks. Keep your wrists loose as you rotate the blade around so it’s easier to position correctly. Move your katana to the side where you’re expecting the strike, and turn the blade so the tip points to the ground and the cutting edge faces away from you. Lock your wrists and plant your feet firmly to prepare for the strike so the blade doesn’t move once it’s hit. [11] X Research source Practice with a sparring partner so you can learn how to properly deflect hits."
    },
    {
      "title": "Push the katana’s guard from the scabbard with your nondominant thumb.",
      "content": "Push the katana’s guard from the scabbard with your nondominant thumb. Hold onto the scabbard with your nondominant hand so your thumb rests on top. Put your thumb against the circular guard around the handle of the katana and lightly push it forward. You will feel some friction before the blade slides easily within the scabbard. [12] X Research source The scabbard holds the blade tightly in place near the guard so the katana doesn’t slip out accidentally. Be careful not to push the blade out too far or it could fall out from the scabbard."
    },
    {
      "title": "Pull the blade out by its handle.",
      "content": "Pull the blade out by its handle. Reach across the front of your body using your dominant hand and hold onto the handle 1 inch (2.5 cm) from the guard. Push the handle down lightly as you pull it out so the cutting edge doesn’t get caught on the scabbard when you remove it. Pull the blade straight out and slowly point the tip out in front of you so the blade faces down. [13] X Research source The katana will have a sharp cutting edge and a dull edge along the back."
    },
    {
      "title": "Wrap your hand around the end of the scabbard when you sheathe it.",
      "content": "Wrap your hand around the end of the scabbard when you sheathe it. Cup the bottom of the scabbard near the opening on the end so your nondominant hand makes a U-shape. Wrap your thumb around the top of the scabbard to hold it firmly in place so it doesn’t move around while you try to insert the katana. [14] X Research source Never try to resheathe the katana without holding onto the scabbard since the blade could easily slip from place."
    },
    {
      "title": "Guide the tip of the katana into the hole in the scabbard.",
      "content": "Guide the tip of the katana into the hole in the scabbard. Slowly and carefully turn the tip of the blade toward the scabbard so the cutting edge points up. Set the blunt edge of the sword on your fingers underneath the scabbard’s opening and use your dominant hand to push the tip inside. Keep your grip firmly on the scabbard even after you put the tip in. [15] X Research source Be careful moving the tip of the katana toward you so you don’t accidentally cut or stab yourself."
    },
    {
      "title": "Push in the katana until there’s 1 in (2.5 cm) of blade exposed.",
      "content": "Push in the katana until there’s 1 in (2.5 cm) of blade exposed. Slowly guide the rest of the blade into the scabbard using your dominant hand. Don’t let the cutting edge scrape the top of the scabbard since it could dull the blade. Continue pushing the blade in until you feel friction, which is usually when there’s about 1 inch (2.5 cm) left to insert. [16] X Research source Don’t try to force the blade into the scabbard since you could damage the blade."
    },
    {
      "title": "Press the guard against the scabbard with your nondominant thumb.",
      "content": "Press the guard against the scabbard with your nondominant thumb. Hook the thumb on your nondominant hand around the guard of the blade and pull it into the scabbard. Don’t try to force the blade into position or else you could damage the tip. Keep pushing the guard until you can’t see the blade anymore and the katana doesn’t move around in the scabbard. [17] X Research source"
    },
    {
      "title": "Practice in an area with enough space around you to handle your blade.",
      "content": "Practice in an area with enough space around you to handle your blade. Look for an open area where you have at least 8–10 feet (2.4–3.0 m) of empty space around you. Hold the katana straight out in front of you while it’s still in its scabbard, which is the protective case around the blade, and point it forward. Turn in a circle and make sure there’s nothing in the path of the sword as you move it around, or else you may cut into it. Don’t swing your katana anywhere that you could hit someone or something that you aren’t intending to cut. Try practicing in your yard if you have the space to move around. Check local laws and regulations to find out the legality of bringing a katana in public since it may not be allowed in your area."
    },
    {
      "title": "Use a wooden or bamboo sword while you practice if you don’t want a real blade.",
      "content": "Use a wooden or bamboo sword while you practice if you don’t want a real blade. While you need a real blade to cut through your target, practicing with one can be more dangerous if you’re inexperienced. Search for a bokken that’s the same size and length as your katana that you can use while practicing your form while striking and blocking. Whenever you feel comfortable switching to a real blade, use extra caution so you don’t hurt yourself or anyone else. [18] X Research source You can buy bokkens online or from martial arts stores. Even though bokkens don’t have a cutting edge, they will still hurt someone if you hit them with it. The thinner edge of the wooden blade is considered the cutting edge while the wider flat edge is the back of the blade."
    },
    {
      "title": "Look for a class at a martial arts school to improve your katana skills.",
      "content": "Look for a class at a martial arts school to improve your katana skills. Check for dojos or martial arts instructors in your area that specialize in using Japanese swords so you can learn the correct techniques. Compare the prices, the lessons, and the amount of time you spend in each class to see what style works best for what you want to learn. If you have any questions, call the instructor and ask them anything you’re concerned about. When you find a style you want to study, enroll in the class so you can start learning. Many dojos or instructors have strict rules for practices and uniforms, so make sure you follow them completely so you can stay in the course."
    }
  ]
}