{
  "url": "https://www.wikihow.com/Use-a-Fountain-Pen",
  "title": "How to Use a Fountain Pen",
  "steps": [
    {
      "title": "Hold the pen properly.",
      "content": "Hold the pen properly. Remove the lid from the pen and hold it in your dominant hand, pinching it gently between your thumb and index finger. The barrel should rest against your middle finger. Rest your other fingers on the paper to stabilize your hand. It’s important to hold a fountain pen properly, because this will prevent your hands from getting tired as you write, and it will facilitate the writing process. When you write, you can either post the cap on the back of the pen, or remove it completely if you have small hands. [1] X Research source"
    },
    {
      "title": "Place the nib on the paper.",
      "content": "Place the nib on the paper. This may sound simple, but because of the construction of a fountain pen, this is more complicated than with a ballpoint pen. Because a fountain pen has a pointed nib rather than a rounded end, you must position the nib on the paper properly in order to write, and this is called the sweet spot. Angle the pen at a 45-degree angle and place the nib against the paper. Make a few strokes with the pen, rotating the pen slightly in your hand as necessary until you find the spot where the pen writes smoothly and without scratching or skipping."
    },
    {
      "title": "Keep your hand rigid to write.",
      "content": "Keep your hand rigid to write. When writing, there are two ways you can control the pen: with your fingers or with your hand. With a ballpoint pen, you can get away with controlling the pen with your fingers rather than your hand, because the rounded tip means you'll always be able to write. But with a fountain pen, you need to control the pen with your hand so you don’t lose the sweet spot. To do this: Hold the pen in your hand and keep your fingers and wrist rigid as you move your arm and shoulder to move the pen. Practice a few strokes in the air first, and then start making a few strokes against a piece of paper until you get the feel for writing with your hand."
    },
    {
      "title": "Apply gentle pressure.",
      "content": "Apply gentle pressure. You don’t need to press hard with a fountain pen, but you do need to apply the nib to the paper with some pressure in order to draw up the ink. Gently press the pen into the paper and begin practicing writing with the fountain pen. Use light strokes as you write, because pressing too hard can damage the nib and disrupt the ink flow. Writing with your hand instead of your fingers will also help ensure that you don’t apply too much pressure."
    },
    {
      "title": "Determine what kind of fountain pen you have.",
      "content": "Determine what kind of fountain pen you have. There are three types of fountain pens on the market today: cartridge, converter, and piston. The different types refer to the different ink delivery methods, and the method will determine how you refill your pen when the ink runs out. Cartridge pens are the most common today, and they are the easiest to refill. To write with this type of pen, you simply purchase pre-filled ink cartridges, so when one runs out, all you do is replace the cartridge. Converter cartridges are reusable cartridges that get inserted into a cartridge pen. These are great for people who don’t mind refilling the ink and don’t want to throw away a cartridge every time the ink runs out. Piston pens are similar to converter cartridges, but the pen comes with its own built-in refilling system, so you don’t have to replace the reusable cartridge with a separately purchased converter."
    },
    {
      "title": "Change the cartridge on a cartridge pen.",
      "content": "Change the cartridge on a cartridge pen. Unscrew the cap from the pen, and then unscrew the barrel (the body) from the nib. Remove the empty ink cartridge. With your new ink cartridge: [2] X Research source Insert the small end inside the nib. Push the cartridge onto the nipple until it clicks, which occurs when the inside of the nib punctures the cartridge to access the ink. If the pen won’t write immediately, sit it in a vertical position to allow gravity to pull the ink down into the nib. This can take about an hour. [3] X Research source"
    },
    {
      "title": "Refill ink in a piston pen.",
      "content": "Refill ink in a piston pen. Remove the cap from the nib, and, if necessary, the cap off the back of the pen that covers the end knob. Twist the knob (most likely in a counter-clockwise direction) to extend the piston toward the front of the pen. When that’s done: [4] X Trustworthy Source Science Direct Online archive of peer-reviewed research on scientific, technical and medical topics Go to source Dip the entire nib into an ink jar, making sure to cover the hole on the back of the nib. Turn the piston knob in a clockwise direction to draw ink into the chamber. When the chamber is full, pull the pen out of the ink. Turn the piston in a counter-clockwise direction again and let a few drops of ink back into the bottle. This will help remove air bubbles. Clean the nib with a cloth to remove any excess ink."
    },
    {
      "title": "Refill the ink in a converter cartridge.",
      "content": "Refill the ink in a converter cartridge. Converters work in one of two ways, either with a piston mechanism or an air-bladder mechanism (also called squeeze converters). To refill an air-bladder pen, dip the nib into the ink bottle and: [5] X Research source Slowly press the converter at the back of the pen, and wait for air bubbles to appear in the ink. Slowly release the converter and wait for the ink to be drawn into the chamber. Repeat until the chamber is full."
    },
    {
      "title": "Choose the right nib for everyday writing.",
      "content": "Choose the right nib for everyday writing. There are many different types of fountain pen nibs, and they are appropriate for different situations and to create different effects. For everyday writing, opt for: A round nib, which is great for making uniform lines A small nib, which will create thinner lines A firm nib that doesn’t have a lot of flex between the two tines, so the tines won’t spread out under pressure to create a broader stroke"
    },
    {
      "title": "Choose nibs for decorative writing.",
      "content": "Choose nibs for decorative writing. To write in cursive, italics, or calligraphy, you won’t use the same nib as you would for everyday writing. Instead, look for: Stub and italic nibs, which are wider and flatter than round nibs. These are able to create both wide and narrow strokes, because vertical strokes will be as wide as the nib and horizontal strokes will be as thin. A wider nib, which will create wider strokes. Nibs typically come in five sizes: extra-fine, fine, medium, broad, and double broad. A flexible or semi-flexible nib, which allows you to control how narrow or broad a stroke will be by applying more or less pressure."
    },
    {
      "title": "Understand the different nib materials.",
      "content": "Understand the different nib materials. Fountain pen nibs are also available in a variety of different metals, and each of these has unique properties. The most common metals for nibs are: Gold, which has lots of flexibility, so you can control the width of the stroke Steel, which has more spring, meaning you can press harder without separating the tines, so your stroke won’t get broader when you press harder"
    },
    {
      "title": "Flush the nib and feed.",
      "content": "Flush the nib and feed. For the best performance from your fountain pen, you should flush the pen and nib every six weeks or so, or any time you change the ink type or color. To flush the pen: Unscrew the cap, then unscrew the nib to remove it from the pen. Remove the ink cartridge. If there's still ink in there, put a piece of tape over the opening to keep the ink from drying out. Hold the nib under room-temperature running water to flush out ink. Then place the nib in a bowl of clean water, nib-down. As the water becomes inky, replace it with clean water. Repeat until the water remains clear. Wrap the nib in a piece of soft and lint-free cloth, such as microfiber cloth. Place it nib-down in a cup and let it dry for 12 to 24 hours. When it’s dry, reassemble the pen."
    },
    {
      "title": "Take care of the nib.",
      "content": "Take care of the nib. To keep the nib from becoming clogged, always store the pen nib-up when you aren't using it. To prevent damage to the nip and scratching to the pen, store the pen in a protective case."
    }
  ]
}