{
  "url": "https://www.wikihow.com/Turn-Off-Read-Receipts-on-Instagram",
  "title": "Can You Turn Off Instagram Read Receipts? Read DMs Secretly",
  "steps": [
    {
      "title": "Open Instagram and tap the Messages icon.",
      "content": "Open Instagram and tap the Messages icon. You want the messages to load (but wait to open or read them!)."
    },
    {
      "title": "Turn on Airplane Mode.",
      "content": "Turn on Airplane Mode. You also want to make sure that Wi-Fi is off when you turn on Airplane Mode. The Wi-Fi symbol should be greyed out or have a line through it. If you have an Android , swipe down to open the Quick Settings panel (swipe down a second time if you don't see the Airplane Mode icon). Tap the airplane icon to turn on Airplane Mode. If you have an iPhone , swipe down from the top of your screen to open Control Center, then tap the airplane icon."
    },
    {
      "title": "Read any messages on Instagram.",
      "content": "Read any messages on Instagram. Go back to your app and tap the messages in your Inbox that you want to read. When Airplane Mode is on, your phone doesn't send any outside signals! So Instagram won't be able to update that you're reading messages."
    },
    {
      "title": "Log out and close the app.",
      "content": "Log out and close the app. Although force-closing the app (so it's not running in the background) might work on its own, you want to log out to be safe. Go to Settings > Log out (the Settings menu is in the three-line menu). To close the app, swipe up from the bottom of your screen (or tap the three lines) and swipe the Instagram app right to close it (or tap Close All if you see that)."
    },
    {
      "title": "Turn off Airplane Mode.",
      "content": "Turn off Airplane Mode. Now that you've logged out and closed Instagram, you can turn Airplane Mode off by repeating the steps you took to turn it on. For Android, swipe down to open the Quick Settings panel (swipe down a second time if you don't see the Airplane Mode icon). Tap the airplane icon to turn off Airplane Mode. For iPhone, swipe down from the top of your screen to open Control Center, then tap the airplane icon. Your phone will reconnect to the internet and you can log back into your Instagram account."
    },
    {
      "title": "Open Instagram and go to your profile.",
      "content": "Open Instagram and go to your profile. Tap the camera-looking app and tap your profile picture to see your profile. Tapping a notification takes you to the Instagram message and will mark it with a read receipt, which you don't want. It's best to turn off message notifications if you want to avoid sending a read receipt but are in the habit of tapping every notification. Do this so new messages and message requests won't send you notifications that you might accidentally tap! You'll need to use Airplane Mode to read messages without sending a read receipt until Instagram allows you to disable read receipts in the app."
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . This three-line menu icon is in the top right corner of your profile."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's next to a gear icon."
    },
    {
      "title": "Tap Notifications.",
      "content": "Tap Notifications . You'll see this near the top of the menu next to a bell icon."
    },
    {
      "title": "Tap Messages and Calls.",
      "content": "Tap Messages and Calls . This menu option is near the middle of the menu."
    },
    {
      "title": "Turn off notifications for Message Requests and Messages.",
      "content": "Turn off notifications for Message Requests and Messages. Tap the circle next to \"Off\" to ensure it's off."
    },
    {
      "title": "Go to the profile page of the person who sent you the message.",
      "content": "Go to the profile page of the person who sent you the message. By restricting the profile, their message to you will move to \"Message Requests\" and they won't get a read receipt when you look at their message."
    },
    {
      "title": "Tap ⋮ (Android) or … (iPhone/iPad).",
      "content": "Tap ⋮ (Android) or … (iPhone/iPad). You'll see this three-dot menu icon in the top right corner of their profile."
    },
    {
      "title": "Tap Restrict.",
      "content": "Tap Restrict . Confirm your choice to restrict that sender so their message to you goes to the \"Message Requests\" inbox. View \"Message Requests\" by going to your inbox (tapping the Messenger icon when you open Instagram) and tapping Requests ."
    },
    {
      "title": "Open Instagram and go to your profile.",
      "content": "Open Instagram and go to your profile. Tap the camera-looking app and tap your profile picture to see your profile. This method helps you turn off active status, so no one will see that you're online and your read receipts won't show others that you've read their message. [1] X Research source"
    },
    {
      "title": "Tap ☰.",
      "content": "Tap ☰ . This three-line menu icon is in the top right corner of your profile."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . It's next to a gear icon."
    },
    {
      "title": "Tap Privacy.",
      "content": "Tap Privacy . It's next to an icon of a lock."
    },
    {
      "title": "Tap Activity Status.",
      "content": "Tap Activity Status . You'll see this at the bottom of your screen next to an icon of a profile silhouette and a checkmark."
    },
    {
      "title": "Tap the toggle next to \"Show Activity Status\" to turn it off .",
      "content": "Tap the toggle next to \"Show Activity Status\" to turn it off . If the switch is greyed out and pointing left, then the feature is off and you shouldn't send read receipts when you open DMs. [2] X Research source"
    },
    {
      "title": "You can read the notification from your phone's screen without tapping it.",
      "content": "You can read the notification from your phone's screen without tapping it. If it's a longer message, you won't be able to read it all, though. However, reading the message preview from your phone's screen won't trigger a read receipt. Just don't tap the notification to open Instagram because that will trigger a read receipt!"
    }
  ]
}