{
  "url": "https://www.wikihow.com/Use-Shower-Cream",
  "title": "How to Use Shower Cream",
  "steps": [
    {
      "title": "Use a shower cream if your skin is normal, dry, or sensitive.",
      "content": "Use a shower cream if your skin is normal, dry, or sensitive. Look at your skin to see if your complexion looks even, with no oily or patchy spots, which means it’s normal. If it’s not, check if your skin feels tight, itchy, or rough, and notice if you have any cracking or flaking. These are signs of dry skin. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Similarly, consider if your skin easily gets irritated, which means it may be sensitive. [2] X Research source Since shower creams add moisture to your skin, they’re a great option if your skin needs more nourishing. Shower creams may not be the best option for oily skin, as they contain oils. You might prefer to use a regular shower gel or moisturizing soap, instead. [3] X Research source"
    },
    {
      "title": "Look for a product that contains an oil or emollient you want.",
      "content": "Look for a product that contains an oil or emollient you want. Shower creams contain oils or emollients that add moisture to your skin and leave behind a thin protective barrier. Read the product labels to identify which oils or emollients the shower creams contain. Pick a product with an oil or shea butter for softer skin and a thin layer of protection. To lock in moisture, get a product that contains petroleum jelly. [4] X Research source For instance, many shower creams contain oils like sunflower oil, jojoba oil, almond oil, coconut oil, or soybean oil. However, they may also contain shea butter or petroleum jelly instead. Oils and shea butter sink beneath the surface of your skin to add moisture. Also, they create a protective barrier on your skin that’s usually water-permeable. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Petroleum jelly creates a protective barrier on your skin, but it isn’t water-permeable. This means it keeps moisture in, but it doesn’t allow your skin to breathe. Also, it prevents additional moisture, like from a lotion, from reaching your skin."
    },
    {
      "title": "Choose a product with fewer ingredients to avoid feeling sticky.",
      "content": "Choose a product with fewer ingredients to avoid feeling sticky. Since shower creams leave behind a layer of moisture, they might make your skin feel sticky. If this bothers you, look for a product that only contains 1 oil or emollient. This way, you won’t have several layers of moisturizers left on your skin after you bathe. [6] X Research source Dry skin is less likely to feel sticky than normal or oily skin. If your skin already contains a lot of natural oils, the moisturizers from the shower cream are likely to just sit on top of your skin."
    },
    {
      "title": "Avoid fragrances if your skin is dry or sensitive.",
      "content": "Avoid fragrances if your skin is dry or sensitive. Although fragrances can enhance your experience, they aren’t a great idea if you have sensitive skin. Unfortunately, fragrances can irritate your sensitive skin, leaving behind itchy, dry, or red skin. Choose a fragrance-free formula instead. [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Check the label to see if the product is fragrance-free. You can also look to see if it’s marked as safe for sensitive skin. Additionally, the ingredients list will tell you if it contains a fragrance."
    },
    {
      "title": "Use your hands for the simplest, cleanest option.",
      "content": "Use your hands for the simplest, cleanest option. Most applicators can attract bacteria, but your hands are an exception. They’re easy for you to wash, so you don’t need to worry about bacterial growth. Additionally, your hands are likely a softer option than other applicators. Unless you just prefer an applicator, just use your hands to apply the shower cream. [8] X Research source Your hands may be a good applicator if your skin is extremely dry or you have a skin condition. Keep in mind that you may use more product if you use your hands to apply it."
    },
    {
      "title": "Choose a sponge or loofah to exfoliate your skin and make a lather.",
      "content": "Choose a sponge or loofah to exfoliate your skin and make a lather. If you like to create a nice lather, then sponges or loofahs are your best choice. You may also prefer a sponge or loofah because they’re good exfoliators that rub off your dead skin cells, leaving behind smooth skin. [9] X Research source Sponges and loofahs can be abrasive, so they may irritate your skin. If you have dry or sensitive skin, it may be better to stick with your hands or use a washcloth."
    },
    {
      "title": "Use a washcloth if you want a soft, easy to wash applicator.",
      "content": "Use a washcloth if you want a soft, easy to wash applicator. You can get a fresh washcloth every day, so you might use one if you like having an applicator but are worried about bacteria growing on it. Additionally, washcloths are soft, so you may like how they feel on your skin. [10] X Research source A soft washcloth may be best for dry or sensitive skin, if you don’t want to use your hand. Launder your washcloth after each use."
    },
    {
      "title": "Wet your skin with warm water so the cream spreads easily.",
      "content": "Wet your skin with warm water so the cream spreads easily. Stand under your shower stream or use your hand or applicator to dampen your skin. Stay under the water for just a few seconds, as spending too long in the shower can dry out your skin. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you’re in the shower, step out of the stream when you apply the shower cream. Limit your showers to just 5-10 minutes because long showers can dry out your skin."
    },
    {
      "title": "Pour about 1 tsp (4.9 mL) of shower cream onto your hand or applicator.",
      "content": "Pour about 1 tsp (4.9 mL) of shower cream onto your hand or applicator. Open the shower cream and pour it out into your hand or onto your sponge, loofah, or washcloth. Then, close the bottle before placing it back down. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source You only need about a dime-sized amount of shower cream. It doesn't take much to wash your body, unless you’re very dirty. In fact, using too much can leave a film on your skin and may block your pores. [13] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Rub your hands together or squeeze your applicator to create a lather.",
      "content": "Rub your hands together or squeeze your applicator to create a lather. If you’re using your hands, you just need so rub them together to create some friction. For a loofah or sponge, squeeze them in the middle to make them get foamy. With a washcloth, ball it up and squeeze it to make a slight lather. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Keep in mind that a washcloth won’t create much of a lather, so just give it 1 or 2 squeezes. Additionally, natural and organic bath creams typically don’t create as much of a lather."
    },
    {
      "title": "Smooth the shower cream over your skin.",
      "content": "Smooth the shower cream over your skin. Start at your neck and work your way down to your toes. This way, you don’t accidentally have shower cream flow down onto areas that you’ve already washed. Plus, it helps you move from the cleanest parts of your body down to the dirtiest. [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If necessary, add more shower cream to your hand or applicator as needed. Do not apply the shower cream to your face or genitals. These are sensitive areas, so you need to use products formulated to clean them. For your genital area, you may just use mild, fragrance-free soap to cleanse it daily."
    },
    {
      "title": "Rinse your skin with warm water.",
      "content": "Rinse your skin with warm water. Stand under the shower stream and let the water rinse off all of the shower cream. If your in a bath, rinse your sponge, loofah, or washcloth thoroughly to remove any remaining shower cream. Then, use the applicator to help rinse your body until your skin is clean. [16] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Remember not to use hot water, as it can dry out your skin."
    },
    {
      "title": "Step out of the shower and pat yourself dry with a towel.",
      "content": "Step out of the shower and pat yourself dry with a towel. Stand on a bath rug or towel so that you don’t create a slippery puddle. Then, use a clean, dry towel to blot your skin. Try not to rub your skin, as it may cause irritation. [17] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Be careful not to slip as you’re stepping out of the shower or bath. Shower creams can create a slippery surface."
    },
    {
      "title": "Apply moisturizer after washing with shower cream to treat dry skin.",
      "content": "Apply moisturizer after washing with shower cream to treat dry skin. Although shower cream already contains a moisturizer, it doesn’t replace your normal moisturizer. Smooth on a body lotion, cream, or butter to add additional moisture to your skin and provide a layer of protection. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Body creams and butters contain more moisture than body lotion. If you use a shower cream that contains petroleum jelly, your moisturizer won’t soak into your skin very well."
    }
  ]
}