{
  "url": "https://www.wikihow.com/Use-Aqueous-Cream-BP",
  "title": "How to Use Aqueous Cream BP",
  "steps": [
    {
      "title": "Consult your dermatologist before using aqueous cream.",
      "content": "Consult your dermatologist before using aqueous cream. Talk to your doctor if you're interested in using aqueous cream to treat your dry skin. Aqueous cream is not commonly prescribed outside of Britain and a few other countries, so your dermatologist may recommend another product."
    },
    {
      "title": "Order aqueous cream online if it’s not available near you.",
      "content": "Order aqueous cream online if it’s not available near you. If aqueous cream is not available in stores in your country (such as in the U.S.), visit an online drugstore that’s based in another country (such as England) and have the product shipped to you."
    },
    {
      "title": "Use aqueous cream for dry skin.",
      "content": "Use aqueous cream for dry skin. Aqueous cream is an effective treatment for dry, itchy skin. Replace your typical face or body wash with it if other soap products leave your skin too dry. [1] X Research source Aqueous cream is not recommended to treat eczema."
    },
    {
      "title": "Use aqueous cream only as a soap substitute.",
      "content": "Use aqueous cream only as a soap substitute. Aqueous cream used to be recommended for use as a leave-on moisturizer, but that is no longer advised. It can actually irritate your skin if left on for ten or more minutes, and it may make eczema symptoms worse. Use it only as a substitute for face or body wash."
    },
    {
      "title": "Place a non-slip mat in the tub if you plan to use it in the shower.",
      "content": "Place a non-slip mat in the tub if you plan to use it in the shower. Using aqueous cream in the shower can cause the bottom of the tub to become slippery. If you’re planning to cleanse some of your body with it while in the shower, place a non-slip mat along the bottom of the tub. [2] X Research source"
    },
    {
      "title": "Remove makeup with an oil-based makeup remover.",
      "content": "Remove makeup with an oil-based makeup remover. Before you cleanse with the aqueous cream, remove any skin or eye cosmetics. Apply an oil-based makeup remover to a cotton pad and gently wipe your skin until all the makeup is off your face."
    },
    {
      "title": "Squeeze a dime-sized amount into your palm.",
      "content": "Squeeze a dime-sized amount into your palm. If you’re just washing your face, start by squeezing a dime-sized amount of the cream into your hand. Use about twice as much if you’re planning to wash large portions of your body. [3] X Research source"
    },
    {
      "title": "Rub the cream between your fingers with warm water.",
      "content": "Rub the cream between your fingers with warm water. Turn on the faucet and add enough warm water to your fingers to get them wet, but not to rinse away the cream in your palm. Gently rub the cream between your damp fingers. Aqueous cream does not lather the way that soap does, so it will just feel like a thin, oily film. [4] X Research source"
    },
    {
      "title": "Apply the cream to your face with circular strokes.",
      "content": "Apply the cream to your face with circular strokes. Using your fingertips, gently apply the cream to your face. Rub it in with circular strokes along your cheeks, chin, nose, and forehead. Avoid getting any of the cream in your eyes and nose. [5] X Research source"
    },
    {
      "title": "Rub aqueous cream onto your body in the direction of hair growth.",
      "content": "Rub aqueous cream onto your body in the direction of hair growth. If you’re using the cream on some or all parts of your body, rub it onto your skin in the same direction that the hair grows. Avoid using it in or right around any bodily orifices. [6] X Research source"
    },
    {
      "title": "Rinse your face or body with warm water.",
      "content": "Rinse your face or body with warm water. Splash warm water on your face or stand under a warm shower while gently rubbing the product off of your skin. Rinse your skin until you no longer feel an oily film coating it."
    },
    {
      "title": "Use aqueous cream once or twice a day.",
      "content": "Use aqueous cream once or twice a day. You can use aqueous cream up to twice a day, but cut back on the number of times you use it if you experience any redness or itchiness. If reducing your usage to once a day or every other day doesn’t eliminate the problem, stop using it and consult your doctor. [7] X Research source"
    },
    {
      "title": "Apply aqueous cream in the direction of hair growth.",
      "content": "Apply aqueous cream in the direction of hair growth. If you're using the cream in place of a shaving gel or cream, rub it onto your skin in the direction that the hair grows. Rubbing it on in the opposite direction can irritate the hair follicles."
    },
    {
      "title": "Use a disposable razor.",
      "content": "Use a disposable razor. The cream will likely clog up your razor, so use one you don't mind tossing in the trash afterward. If you can afford to do so, purchase disposable razors that are specifically geared toward sensitive skin. [8] X Research source"
    },
    {
      "title": "Glide the razor slowly over your skin against the hair growth.",
      "content": "Glide the razor slowly over your skin against the hair growth. Shave in the opposite direction that the hair grows, and go very slowly. Moving too quickly is likely to irritate your skin or even lead to cuts. [9] X Research source"
    },
    {
      "title": "Rinse with warm water and pat your skin dry.",
      "content": "Rinse with warm water and pat your skin dry. When you're finished, rinse your face, legs, or other freshly shaved areas with warm water. Pat your skin dry (rather than rubbing it) with a soft towel."
    }
  ]
}