{
  "url": "https://www.wikihow.com/Stop-Being-Paranoid",
  "title": "How to Deal with Paranoia: 15 Tips to Overcome Your Anxiety",
  "steps": [
    {
      "title": "Overcome pessimism.",
      "content": "Overcome pessimism. [1] X Research source One of the reasons you may be paranoid is that you tend to assume the worst in any situation instead of being realistic about possible outcomes. You may think everyone is talking about you, that everyone hates your new haircut, or that your new boss is out to get you. However, it's highly possible that none of this is true. The next time you have a very pessimistic thought, stop and do the following: Ask yourself how likely it is that the pessimistic thought you're having will come true. When you're expecting the worst, consider all of the possible outcomes of a situation, not just the most negative ones. Then, you'll see that there are many possibilities in virtually every situation. Try to combat each pessimistic thought you have with two realistic thoughts. For example, if you're worried that everyone is laughing about your shoes, consider that 1) it's unlikely that a pair of shoes will keep everyone laughing throughout the day, and 2) it's more likely that a new, hilarious cat meme is making its way around the office messaging system."
    },
    {
      "title": "Stop obsessing over every little thing.",
      "content": "Stop obsessing over every little thing. Part of being paranoid means not just considering that everyone is against you or out to get you, but it also means thinking about this constantly. The more you think about the same negative thing, the more you indulge in your paranoid thoughts, and the more you become convinced that they are likely to be accurate. Though it's impossible to stop obsessing completely, there are a few tricks that can help you minimize your obsessive thoughts: Give yourself a designated \"worry time.\" Spend this time sitting down with your paranoid thoughts, evaluating them, and trying to minimize them. If a worry comes up during a different part of the day, just try to mentally move it to your \"worry time.\" Keep a journal that tracks your paranoid thoughts. Reread it weekly. This can help you not only unload some of your paranoid feelings in a more healthy fashion, but it can also help you see that some of your paranoid fears were completely unfounded when you read back over what you've written. You may see that you worried about X happening on a certain date. Once the date passes, and X didn't happen, you may be able to accept that many of your paranoid beliefs are unwarranted."
    },
    {
      "title": "Confide in a close friend.",
      "content": "Confide in a close friend. Having someone you can talk to about your paranoid feelings can help you get your worries out in the open and get a different perspective. Even the act of vocalizing some of your fears can help you see how they may be illogical. If you tell your friend that you think your group of friends really hates you, your friend will be able to provide rational and concrete examples that prove you wrong. Just make sure you pick one of your more rational and even-keeled friends. You don't want someone who might encourage your paranoid behavior and make you feel worse."
    },
    {
      "title": "Stay busy.",
      "content": "Stay busy. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Another way to avoid being paranoid is to not give yourself a lot of time to wallow or sit around thinking about what everyone else is thinking about you. Though staying busy can't help you escape your problems, it can help you focus your energies on more productive outlets, such as pursuing your interests or attaining your personal goals. If you spend even a few hours a week pursuing something that you really love, whether it's yoga or coin collecting, you're guaranteed to be less absorbed in your paranoid thoughts."
    },
    {
      "title": "Put yourself in someone else's shoes.",
      "content": "Put yourself in someone else's shoes. This exercise really helps. If you put yourself in the shoes of the people you're so worried about, it'll help you see that many of your fears are unfounded. For a simple example, let's say you head to a party and tell yourself, \"Everyone will probably notice that I'm wearing the same outfit that I wore to that party three weeks ago.\" Ask yourself if you remember what anyone else was wearing at that other party; the chances that you remember what anyone was wearing are very slim. Ask yourself what the chances are that all of the people you're worried about are thinking about you as much as you're worried about them thinking about you. Do you spend hours thinking about how much you don't like those other people? Probably not."
    },
    {
      "title": "See if your paranoia is rooted in anxiety.",
      "content": "See if your paranoia is rooted in anxiety. If you have anxiety, then you may be plagued by worry and a constant fear that something may go wrong. Anxiety may even trigger your paranoid thoughts, though these two conditions are different. Anxiety may cause you to worry that you're suffering from a fatal illness; on the contrary, paranoia may lead you to believe that your doctor purposefully made you sick. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If anxiety is in fact the main cause of your problems, then you may want to seek medical help or take actions to stop anxiety. [4] X Trustworthy Source National Institute of Mental Health Informational website from U.S. government focused on the understanding and treatment of mental illness. Go to source"
    },
    {
      "title": "Seek professional help if it's necessary.",
      "content": "Seek professional help if it's necessary. There's a difference between occasionally worrying that all of your friends are talking about you and letting this thought completely consume you. There's also a difference between knowing that your thoughts are irrational on some level and suffering from serious delusions that everyone is really out to hurt you. If you feel like your paranoid feelings are taking over your life and preventing you from enjoying your everyday interactions or socializing, then talk to a psychologist or other mental health professional to get help for your condition. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Stop caring what other people think.",
      "content": "Stop caring what other people think. If you want to be able to socialize without constantly worrying about how others perceive you, then you have to slowly learn to stop caring about what people think. Of course, this is easier said than done, but once you start believing in yourself and get comfortable around others, you'll see that every little thing you do, say, or wear doesn't really matter to anyone around you. Work on being less self-conscious. Self-conscious people worry about the subjective experiences of others, which is something no one really has control over. Recognize that no matter what someone thinks of you, they have the power to think it. Sometimes, other people make comments about us that reflect what we think of ourselves. Even in these situations, it doesn't make the opinion a fact. Aim to shrug off these comments and stop questioning yourself every time someone states a subjective opinion of you. Work on accepting yourself unconditionally. [6] X Research source No matter if you did just trip over a rug or if your hair is sticking up, you're still human. All human beings are flawed creatures. Embrace your natural quirks and quit thinking everyone else is perfect except for you. Need a reality check? Visit YouTube and watch a few klutzy videos to remind yourself that all humans make mistakes - and sometimes these mistakes are laughable."
    },
    {
      "title": "Put yourself out there.",
      "content": "Put yourself out there. Many paranoid people are so afraid that no one likes them or wants to hang out with them that they're more likely to spend time alone or at home instead of in a social setting. If you never put yourself out there, then you'll only expect the worst because you won't ever experience the positive aspects of social interaction. Make a goal of getting out of the house and hanging out with people fairly often, or at least once or twice a week. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source The more time you spend socializing, the more comfortable you'll be with the people around you and the less likely you'll be to imagine that they all hate you."
    },
    {
      "title": "Take note of all the kindness around you.",
      "content": "Take note of all the kindness around you. After hanging out with a group of friends or even just talking to a neighbor on your street or chatting with the check-out girl at your local grocery store, you should come away with at least a few positive impressions of your fellow citizens of the world. At the end of every day or week, write down all of the good things that happened when you interacted with other people, all of the positive ways they made you feel, and all of the reasons why these interactions benefited your life. [8] X Research source When you're feeling paranoid, review this list. Reminding yourself of all the concrete reasons why you should have more faith in others' intentions can help you ease your paranoid thoughts."
    },
    {
      "title": "Learn to accept criticism.",
      "content": "Learn to accept criticism. You may think that a person hates you when he's just giving you constructive criticism and telling you how to improve. If your teacher gives you a poor grade on an essay, read the feedback and try to see if she has a valid point instead of assuming that you got the bad grade because your teacher just doesn't like you. If you've been given some hurtful criticism, remember that it is entirely up to you how to receive it. You can cry or dwell on it for weeks, or you can think of it as an opportunity to refine yourself. Write down the critical comment and ponder its validity. If there is even the slightest chance that the critical remark is warranted, then you need to think hard about whether this is an aspect of yourself you want to change, or whether you are willing to stay the same."
    },
    {
      "title": "Accept that there are mean people in the world.",
      "content": "Accept that there are mean people in the world. Unfortunately, not everyone you meet or interact with is going to like you or be nice to you. But that doesn't mean you shouldn't put yourself out there! In fact, being aware of the fact that there are mean, careless, or bitter people out in the world will make you appreciate all of the good people in your life even more. If someone is just outright rude to you for no reason, then you need to learn to accept that this is a result of that person's insecurities and personal issues, and not because of something you did. Remind yourself that it takes all kinds of people to make the world. Not everyone is going to be your best friend, but that also doesn't mean everyone wants to be your worst enemy."
    },
    {
      "title": "Confront your partner if you think he or she is cheating on you.",
      "content": "Confront your partner if you think he or she is cheating on you. If you're worried that your current partner is cheating on you - especially if you've had this concern about every person you've dated - then, chances are, your worries are rooted in paranoia. Ask yourself if you have any concrete evidence that this may be happening or if all of your concerns are in your head. Be open and talk to your partner about it. Tell him or her that you know your feelings are irrational and that you want help dealing with them. Don't accuse your partner of cheating or check in every two seconds when you're not together to make sure he or she is not cheating. This will only make your partner feel like there's a lack of trust in the relationship. Maintain your own identity. If you get too obsessed with the person you're dating or start depending on him or her too much, then you'll be even more likely to be paranoid because you'll feel completely dependent on that person's loyalty. Maintain other relationships outside of a romantic one."
    },
    {
      "title": "Question whether your friends are really talking about you.",
      "content": "Question whether your friends are really talking about you. Ask yourself what you and your group of friends talk about when one of you isn't around - do you spend all of your time gossiping and talking about how much you hate that person? Unless you're in a really gossipy or mean group of friends, then most likely not. Ask yourself how likely it is that people talk about you the second you leave. Do your friends invite you to hang out? Send you text messages? Compliment you? Ask you for advice? If so, then why would you think that they completely hate you?"
    },
    {
      "title": "Combat paranoia on the job.",
      "content": "Combat paranoia on the job. [9] X Research source A common paranoid worry that people tend to have at work is that they're always on the brink of being fired or that their boss hates him or her. If this is you, then ask yourself about what evidence you actually have that you're going to lose your job. Do you get to work on time? Put in your hours? Show improvement? If so, then why would you get fired? If you've had no warning signs and people around you aren't getting fired left and right, then it's very likely that your worries are all in your head. Help yourself feel better by making a list of all the great contributions you've made in the workplace. Make a list of all of the compliments or positive feedback that your boss has given you. Now, write down anything negative you were told. You'll see that the positive far outweighs the negative, and, if they don't make an action plan to shift your work efforts in a positive direction."
    },
    {
      "title": "Remember that not everyone is looking at you when you step out.",
      "content": "Remember that not everyone is looking at you when you step out. Another form of paranoia is ego-driven. You may think that as soon as you step into the halls or into a party, that everyone is staring at you, laughing at you, or making fun of you behind your back. Ask yourself how often you stare at a random person who arrived on the scene; chances are, like most people, you are too concerned with how you look and how others perceive you to pay all that much attention to anyone else."
    }
  ]
}