{
  "url": "https://www.wikihow.com/Tell-if-You-Have-an-Ear-Infection",
  "title": "How to Tell if You Have an Ear Infection",
  "steps": [
    {
      "title": "Determine if you have pain in your ear.",
      "content": "Determine if you have pain in your ear. Pain in your ear is one sign that you might have a middle ear infection. This pain is typically more severe when you are lying down, especially if you are lying on the side of the infected ear. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You may also have a headache, which can make it hard to differentiate the pain in your ear specifically. Laying down or leaning your head to either side can help you pinpoint where the pain is coming from. If you have an outer ear infection (otitis externa), the pain may increase if you pull on your ear, or if you press on your tragus – the small bump in front of your ear. If you have a middle ear infection, then you probably will not notice an increase in pain by pressing on the tragus."
    },
    {
      "title": "Check for drainage of fluid from your ear.",
      "content": "Check for drainage of fluid from your ear. The eustachian tubes drain normal secretions from your middle ear. If these tubes become swollen or inflamed, they can't work properly. Fluid builds up in your middle ear, leading to a middle ear infection. You may notice this accumulated fluid running out of your ear. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Fluid from an outer ear infection is typically clear and odorless. If the fluid is discolored or includes pus, this may be a sign that the infection has progressed. See your doctor immediately if the fluid drainage seems excessive, or if the fluid is bloody. This may be a sign of more extensive damage to your ear. Fluid is not as common with an inner ear infection, so the absence of fluid doesn't necessarily mean you don't have an ear infection."
    },
    {
      "title": "Notice any redness or itching inside your ear.",
      "content": "Notice any redness or itching inside your ear. If your ear is itching, this may be an early sign that you have an outer ear infection. [3] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Your ear canal may also appear redder than normal. As the infection progresses, the redness will become more extensive and the itching may grow more intense. It can help to get someone else to look in your ear and see if it appears redder than normal. If only one ear seems to be infected, they can compare it with your good ear."
    },
    {
      "title": "Determine whether you have a loss of hearing.",
      "content": "Determine whether you have a loss of hearing. If your ear is clogged with fluid, it may result in hearing difficulties. You will likely be better able to tell if you listen to something with the uninfected ear, then plug that ear and listen with the ear you believe is infected. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source With an inner ear infection, rather than sounds seeming muffled, they will simply sound quieter than they normally would. Inner ear infections are also commonly accompanied by tinnitus , a ringing or humming in your ears. [5] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If you suspect a child or other individual has an ear infection, you may notice that they don't respond to you as they did before. This could be an indication that they don't hear you."
    },
    {
      "title": "Evaluate if you've been feeling nauseous or eating less.",
      "content": "Evaluate if you've been feeling nauseous or eating less. Nausea or loss of appetite may be a sign of either an inner ear or middle ear infection. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Nausea may also be caused by the dizziness that is common with an inner ear infection. A child with an ear infection may be fussier than normal, but refuse to eat. Changes in sleep patterns are also common. You may also feel lethargic or generally sick, which would also lead to a loss of appetite."
    },
    {
      "title": "Test your balance and vision.",
      "content": "Test your balance and vision. If you feel dizzy or have trouble maintaining your balance, you might have an inner ear infection. The easiest way to check this is to sit or stand still and look around you. If the room appears to be moving or spinning around you, that's a sign of vertigo. Vertigo is one of the main symptoms of an inner ear infection. [7] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source A change in vision, such as double vision or difficulty focusing, may also be a sign of an inner ear infection. See your doctor if you have dizziness or vertigo and it doesn't go away or improve within 2 or 3 days."
    },
    {
      "title": "Take your temperature to see if you're running a fever.",
      "content": "Take your temperature to see if you're running a fever. Middle ear infections are frequently accompanied by a fever of 100 F (38 C) or higher. However, a fever may indicate numerous other viruses or infections. A fever by itself doesn't necessarily mean you have an ear infection, unless it is accompanied by other symptoms. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source If you've been taking over-the-counter medication for a cold or allergies, you may not be running a fever because of the effects of the medication. Wait until the medication wears off and take your temperature again. If your temperature is less than 102.2 F (39C), you typically can simply wait and see if the infection goes away on its own. Most mild ear infections improve within a day or two and clear up without medical treatment within a week or two."
    },
    {
      "title": "See your doctor if symptoms don't improve within 48 to 72 hours.",
      "content": "See your doctor if symptoms don't improve within 48 to 72 hours. Most ear infections will go away on their own. However, if your symptoms don't get any better, or if your condition gets worse, make an appointment with your doctor. [9] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Contact your doctor immediately if you also have a fever of 102.2 F (39 C) or higher, or if the fluid draining from your ear contains blood or pus."
    },
    {
      "title": "Tell your doctor if you've been swimming recently.",
      "content": "Tell your doctor if you've been swimming recently. If you've been swimming, particularly in a natural body of water, such as a lake or a river, you may have an outer ear infection. An outer ear infection is commonly called \"swimmer's ear\" because it is typically caused by exposure to bacteria found in water and soil. [10] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Even if you haven't been swimming, you can also contract an outer ear infection if you habitually put cotton swabs in your ears. These can damage the thin layer of skin that lines your ear canal, leading to infection."
    },
    {
      "title": "Describe your symptoms and recent health to your doctor.",
      "content": "Describe your symptoms and recent health to your doctor. If you have pain in either or both of your ears, drainage of fluid, and muffled hearing, you likely have an ear infection. You may also have a sore throat, or be running a fever. Ear infections are often the result of a recent illness, particularly a cold or an upper respiratory infection. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have most of the common symptoms of an ear infection, your doctor may be able to make a diagnosis without doing an extensive examination of your ear. However, many common symptoms are the same as for other conditions. You are more susceptible to ear infections if you've been suffering from allergies. You also have a greater risk of getting an ear infection if you smoke, or live with someone who smokes. Tell your doctor all of the symptoms you're experiencing, even if you feel they are unrelated. This will enable your doctor to better assess whether the problem is an ear infection, or a combination of conditions."
    },
    {
      "title": "Allow your doctor to examine your ear.",
      "content": "Allow your doctor to examine your ear. Doctors typically use an instrument called a pneumatic otoscope to look in your ear and detect whether there is fluid behind the eardrum. The doctor will gently puff air against your eardrum. Normally, this would cause your eardrum to move. However, if your ear is filled with fluid, your eardrum won't move. [13] X Research source Your doctor may conduct other tests if your infection is more advanced, if you have recurring ear infections, or if your ear infection has not responded to previous treatments."
    },
    {
      "title": "Try a warm compress to lessen the pain.",
      "content": "Try a warm compress to lessen the pain. Most ear infections will go away on their own within a week or two. In the meantime, placing a washcloth dampened with warm water on your ear may help it feel a little better. [14] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source The warm compress can also help the fluid in your ear loosen and drain. Leave the warm compress on your ear for 10 to 15 minutes, then take it off. After it's been off for 20 to 30 minutes, you can put another one on. Repeat this cycle as often as you want throughout the day."
    },
    {
      "title": "Ease pain and swelling with anti-inflammatory medications.",
      "content": "Ease pain and swelling with anti-inflammatory medications. Over-the-counter medications, such as ibuprofen (Advil or Motrin) or acetaminophen (Tylenol) can help relieve pain. These medications also reduce inflammation, which can enable the fluid to drain more easily on its own. [15] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Follow the instructions on the bottle to take these medications unless your doctor tells you a different dosage."
    },
    {
      "title": "Use auto-insufflation to adjust the air pressure in your ear.",
      "content": "Use auto-insufflation to adjust the air pressure in your ear. You may know of this technique as \"popping your ears.\" To do it safely, tilt your head back slightly. Close your mouth and pinch your nose, then gently exhale. [16] X Research source This technique forces air back through the eustachian tubes in your ears and can help the fluid drain more readily. It may take some practice to get the technique right, but don't keep doing it repeatedly if you don't feel any relief the first time. You may damage your ears."
    },
    {
      "title": "Take an antibiotic if prescribed by your doctor.",
      "content": "Take an antibiotic if prescribed by your doctor. For some types of ear infections, your doctor may start you on a round of antibiotics. This is particularly likely if you are also running a fever of 102.2 F (39 C) or higher. [17] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Continue taking the full cycle of antibiotics, even if your condition improves or the ear infection seems to have cleared up. Otherwise, the infection may return."
    },
    {
      "title": "Seek advanced treatment for recurring ear infections.",
      "content": "Seek advanced treatment for recurring ear infections. If you have an ear infection that doesn't respond to treatments, or if it keeps coming back, this may be a sign of a more serious problem. Your doctor may do additional tests to determine the source of the infection. [18] X Research source For recurrent ear infections, the doctor may place tiny tubes in your ears. These tubes pierce your eardrum and drain the fluid. This procedure is more common in young children who have persistent ear infections."
    }
  ]
}