{
  "url": "https://www.wikihow.com/We-Restrict-Certain-Activity-to-Protect-Our-Community",
  "title": "How to Fix “We Restrict Certain Activity” on Instagram",
  "steps": [
    {
      "title": "Instagram thinks you're spam and limits how you interact with posts.",
      "content": "Instagram thinks you're spam and limits how you interact with posts. Typically, Instagram will display this error message if it detects things such as liking and unliking lots of posts, following multiple accounts at the same time, or logging in from various devices. When the error message appears, it means you can’t interact with other posts for the time being."
    },
    {
      "title": "Quick or excessive interactions",
      "content": "Quick or excessive interactions When you like multiple posts or follow a lot of different accounts in a short period of time, Instagram may think that you’re a bot that’s spamming other people and put a restriction on your account to protect its users."
    },
    {
      "title": "Inappropriate posts or stories",
      "content": "Inappropriate posts or stories The Instagram community guidelines do not allow posts that portray illegal activity, nudity, graphic violence, bullying, abuse, or any type of spam content. If Instagram mistakenly thinks one of your posts breaks these rules, your account will get restricted. [1] X Research source You may also get restricted if Instagram detects messages in your DMs that it deems bullying or harassment."
    },
    {
      "title": "Third-party apps that violate Instagram rules",
      "content": "Third-party apps that violate Instagram rules Third-party apps that take data from Instagram or that claim to give you more likes and followers are not allowed on Instagram. If you connect one of these apps or an app gets mistaken as spammy, then Instagram will restrict what you can do on your account. [2] X Research source"
    },
    {
      "title": "Suspicious logins or activity on your account",
      "content": "Suspicious logins or activity on your account For security, Instagram will lock and restrict your account if it thinks you’re being hacked . If Instagram detects you are logging in and out repeatedly or using the app from unfamiliar devices, then it may restrict the activity on your account. [3] X Research source"
    },
    {
      "title": "Slow down how often you interact with posts.",
      "content": "Slow down how often you interact with posts. While you have the restriction on your account, avoid liking or commenting on every post that you see. If your account allows you, it’s okay to leave a like or comment on a post here and there. Avoid mass-following or unfollowing accounts because Instagram may confuse you as a bot."
    },
    {
      "title": "Remove any posts that violate Instagram guidelines.",
      "content": "Remove any posts that violate Instagram guidelines. Scroll through your feed or look through your Story for any posts that have been flagged or could go against the community guidelines. Click on the 3 dots near the top of the post and select Delete from the list to remove the post completely . [4] X Research source Alternatively, you may be able to archive the post by tapping on “Archive” instead. Archiving your post keeps it saved to your account but hides it from your main feed."
    },
    {
      "title": "Try removing links from your profile.",
      "content": "Try removing links from your profile. Instagram may accidentally flag links on your profile as spam, and some users have had luck removing restrictions just by getting rid of the link. Edit your profile and remove any links that are present. Then, try logging out and signing back into your account. If the fix works, try adding the link back to your account or putting in a new link."
    },
    {
      "title": "Ensure you have a stable Internet connection.",
      "content": "Ensure you have a stable Internet connection. Double-check your device to ensure you’re connected to Wi-Fi or mobile data. If you’re in an area with a weak signal, try finding a spot with a stronger connection. Once your device connects, try refreshing Instagram to see if it lifts the restrictions. [5] X Research source"
    },
    {
      "title": "Limit Instagram access for third-party apps.",
      "content": "Limit Instagram access for third-party apps. Go to your profile page and click on the 3 lines in the top right corner to open your account settings. Scroll down to App website permissions and then click on Apps and Websites . Scroll through the active apps and tap Remove next to the apps you’d like to remove. [6] X Research source"
    },
    {
      "title": "Reset your password from a new device.",
      "content": "Reset your password from a new device. Many users suggest that Instagram will confuse changing your password on the same device as someone trying to hack your account, so they recommend using a new device to reset your password . [7] X Research source Click on the 3 lines in the top right corner of your profile page. Select Accounts Center from the settings menu. Choose Password and Security from the list and select “Change password.” Type in your old password, followed by your new password. Log out and then log back into your account on your original device."
    },
    {
      "title": "Secure and verify your account if you notice suspicious activity.",
      "content": "Secure and verify your account if you notice suspicious activity. If Instagram notifies you of a suspicious log-in attempt , then access your account settings from your profile page. If you haven’t already, update your password to something you haven’t used for any other account. Then, turn on the 2-factor authorization setting so you have to enter a code each time you log in. [8] X Research source Check the devices where you’re logged in under your settings → Accounts Center → Password and security → Where you’re logged in. If you see a device you don’t recognize, tap on it and select “Log out.”"
    },
    {
      "title": "Take a break from Instagram until the restrictions pass.",
      "content": "Take a break from Instagram until the restrictions pass. If nothing else is working, you may just have to wait it out until Instagram lifts the restrictions on your account. If you’re trying to connect with your friends, message them or reach out through another social media app for the time being."
    },
    {
      "title": "Report continued issues to Instagram support.",
      "content": "Report continued issues to Instagram support. If you don’t think you’ve violated any of Instagram’s guidelines or if your account has been restricted for more than a few days, send a report ticket to Instagram to determine the cause of the issue. If there’s a bug, then they’ll be able to help you access your account again. [9] X Research source Tap on the 3 lines in the top right corner of your profile page. Select More info and support and tap Help . Choose Report a problem . Pick Report problem without shaking and follow the prompts to submit the issue to support."
    },
    {
      "title": "Activity restrictions may last a few hours or up to a few days.",
      "content": "Activity restrictions may last a few hours or up to a few days. Most times, the “We restrict certain activity” error disappears soon after you resolve issues with your account. However, you may still see an error pop up for a couple of days afterwards if Instagram detects a larger issue."
    },
    {
      "title": "Can I still view posts and stories if I have an account restriction?",
      "content": "Can I still view posts and stories if I have an account restriction? Yes, you can still browse your feed and look at other people’s posts while you have the error message. However, you won’t be able to like or comment on the posts. If you want to like it or want to leave a comment, be sure to find the post again later after the restriction on your account lifts."
    },
    {
      "title": "What happens if someone restricts you on Instagram?",
      "content": "What happens if someone restricts you on Instagram? Your comments won’t appear on their posts and you won’t see them online. Unlike the “We restrict certain activity” error, you can individually restrict other users on Instagram. Once you restrict a person, you always appear offline to them, and you don’t leave read notifications in messages. When they try to leave a comment, they’re the only one who can see it unless you approve it. [10] X Research source"
    },
    {
      "title": "What are other common Instagram error messages?",
      "content": "What are other common Instagram error messages? Instagram may have a variety of error messages depending on where you encounter the issue. Some other common messages you may see and how to fix them include: Unable to comment or like: “Action Blocked” Slow down how quickly you interact with posts, or refresh your feed to ensure the post is still present. Login issues: “Sorry, there was a problem with your request.” Make sure you’re using the right password for your account, and change your password if you need to. Upload issues: “There was an issue with uploading your photo or video.” Double-check that you’re connected with mobile data or Wi-Fi. Explore feed not loading: “Couldn’t refresh feed” Close out of the app and try reopening it again. Alternatively, try clearing the cache . Messaging errors: “Message not sent” or “Couldn’t send your message. Try again” Make sure you’re connected to the internet. Try signing out and logging back in or updating the app before sending your message again. Hashtag errors: “This hashtag has been banned” Use a different hashtag because the one you used is not allowed anymore. Profile changes not saving: “Changes to your profile information or bio not saving” Avoid using any special characters or special formatting in your bio, and double-check your Internet connection. Account disabled or deactivation: “Your account has been disabled for violating our terms” Reach out to Instagram support to find out why your account has been disabled and to repeal the decision."
    }
  ]
}