{
  "url": "https://www.wikihow.com/Treat-an-Exposed-Tooth-Root",
  "title": "How to Treat an Exposed Tooth Root",
  "steps": [
    {
      "title": "Use desensitizing toothpaste twice a day.",
      "content": "Use desensitizing toothpaste twice a day. Regular brushing won’t replace the lost gum tissue, but improving your oral hygiene can prevent further damage until your dentist can properly treat your exposed tooth roots. If you have an exposed tooth root, brushing and eating may be painful. Desensitizing toothpastes help numb the pain from exposed roots to improve your quality of life. After a few days of using this toothpaste, the pain should be greatly reduced. Make sure any toothpaste you use is infused with fluoride to strengthen your teeth. Don’t brush your teeth more than 3 times per day, however. Brushing too often can push your gums back further and expose more of the tooth root. There are several types of desensitizing toothpaste available, like Sensodyne, which is a well-known brand. Look for the ADA seal on any product you use so you know it’s American Dental Association-approved."
    },
    {
      "title": "Use a soft-bristled toothbrush to prevent gum abrasion.",
      "content": "Use a soft-bristled toothbrush to prevent gum abrasion. A hard-bristled toothbrush is very rough on your gums and teeth. This is not only painful if you have an exposed root, but can also physically push your gums back and make the problem worse. Use only a soft-bristled brush to protect your gums from receding. If your gums are receding only because you were using a hard brush, then switching to a soft one may allow them to extend back down again. Consult your dentist if you aren’t sure which toothbrush is best for you."
    },
    {
      "title": "Press down with mild pressure when you brush.",
      "content": "Press down with mild pressure when you brush. Applying too much pressure when you brush is another reason for receding roots. You don’t need to press down hard to clean your teeth. Use light pressure and work in a circular motion across each tooth. [1] X Research source Brush especially lightly over exposed root areas. This will avoid pushing the gums back further and causing pain. If you occasionally notice blood when you spit after brushing, then you’re probably brushing too hard."
    },
    {
      "title": "Clean your teeth with scaling and root planing.",
      "content": "Clean your teeth with scaling and root planing. If your gum recession is due to poor oral hygiene, then the dentist’s first step may be a thorough cleaning called scaling and planing. The dentist uses tools to remove all the plaque and buildup under your gum line. Once this is removed, the gum can reattach to the tooth. This may be enough for your gums to cover the exposed root again. [2] X Research source Your gums will be sore for a few days after this treatment. Eat soft foods and drink cool beverages to help with the pain. You also have to practice good oral hygiene at home for this treatment to be successful. It won’t work on its own."
    },
    {
      "title": "Have your dentist apply bonding resin to the root.",
      "content": "Have your dentist apply bonding resin to the root. For more advanced gum recession, the dentist can cover the exposed root with a clear resin. This resin protects the root from damage and helps with the pain. First, the dentist will numb the area with an analgesic. They will then spread the resin over the root and leave it to bond. [3] X Research source Listen to your dentist’s instructions on caring for the resin after the procedure. It may need time to harden completely, so brush gently around the area for a few days. A bonding resin may not be effective if the gum recession is too advanced. In that case, your dentist may recommend a gum graft instead."
    },
    {
      "title": "Receive a gum graft to cover the exposed root.",
      "content": "Receive a gum graft to cover the exposed root. For advanced gum recession, the dentist will do a gum graft to cover the exposed root. This is a procedure where the dentist takes a piece of gum from the roof of your mouth and stitches it over the exposed root. The new piece of gum fuses with the old gum and heals over the root. While this sounds scary, the procedure is common and should fix the exposed root permanently if you practice good oral hygiene afterward. The dentist will apply a numbing analgesic, but may give you a sedative. Have someone else bring you to the appointment in case you can’t drive afterward. Follow all of your dentist’s instructions for aftercare while you heal. You will probably have to eat soft foods for a few days and brush gently to avoid opening the wound."
    },
    {
      "title": "Ask your dentist about a prescription fluoride to strengthen your teeth.",
      "content": "Ask your dentist about a prescription fluoride to strengthen your teeth. Fluoride gels administered with a tray may help to strengthen your teeth and prevent further decay. Your dentist can give you a fluoride treatment in their office, or send you home with a prescription for a fluoride treatment. [4] X Trustworthy Source American Dental Association World's largest dental professional organization and advocate for proper oral health Go to source Fluoride is also available as an oral medication."
    },
    {
      "title": "Limit your intake of acidic, sugary, and sticky foods to prevent inflammation.",
      "content": "Limit your intake of acidic, sugary, and sticky foods to prevent inflammation. Some foods are very acidic and gradually eat away at your enamel and gums. These include sugary drinks, snacks, and fruit juices. Sticky foods are especially harmful. Gummy candies get stuck in your teeth and eat away at the enamel. Limit your consumption of foods like these to prevent further gum recession. If you do eat junk food, go for options that don’t stick to your teeth. Chocolate washes out of your mouth much faster than gummy worms, for instance. [5] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source"
    },
    {
      "title": "Quit smoking",
      "content": "Quit smoking , or don't start at all if you don't, to reduce your risk of receding gums. People who smoke are at a greater risk for receding gums and exposed roots. If you’ve experienced gum recession or want to avoid it, quitting smoking is a good step to take. This can be difficult, but it is worth it for the health benefits. If you don’t smoke, then don’t start. [7] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Since nicotine is a drug, you may experience some minor withdrawal symptoms like headaches, cravings, and irritability. Nicotine patches and gum are helpful to wean you off smoking and reduce withdrawal symptoms. Another method for quitting is gradually reducing your smoking until you stop completely. Try to cut back by 1 cigarette every 2 days, for example. This may be easier for you than going cold turkey. Smoking has numerous other health risks, so quitting will have many other benefits for your overall health."
    },
    {
      "title": "Work to stop grinding your teeth if you have that habit.",
      "content": "Work to stop grinding your teeth if you have that habit. Grinding your teeth is another cause of gum recession because grinding pushes the gums back over time. If you have a habit of tooth grinding, do your best to cut back. Try to notice throughout the day if you start grinding and remind yourself to stop. Make sure your teeth don’t touch when you’re not chewing. [8] X Research source If you grind your teeth in your sleep, then you may not be able to consciously stop it. Talk to your dentist about getting a bite guard to protect your teeth at night. Grinding is often a reaction to stress. Try taking steps to reduce your stress to see if it helps your grinding."
    },
    {
      "title": "See your dentist for a regular checkup every 6 months.",
      "content": "See your dentist for a regular checkup every 6 months. Regular dental checkups are a very important part of your oral health. Catching gum recession early is the best way to stop it from getting worse, and the dentist can find any problems at your regular checkups. Keep your annual checkup schedule so your mouth stays in good shape. Even if you don’t like going to the dentist, going regularly is better in the long run. Major dental work from a neglected problem is much more unpleasant than an occasional checkup."
    }
  ]
}