{
  "url": "https://www.wikihow.com/Use-a-Laminator",
  "title": "How to Use a Laminator",
  "steps": [
    {
      "title": "Choose a pouch small enough to fit in the laminator.",
      "content": "Choose a pouch small enough to fit in the laminator. Lamination pouches come in a variety of sizes. When choosing a size, make sure it's small enough to fit in your machine. That means that the folded side of the pouch needs to be smaller than the area you feed the pouch into. However, ensure your paper can fit completely inside the pouch. [1] X Research source If your project is small, try using a smaller sheet so you don't waste part of the pouch."
    },
    {
      "title": "Select a thicker pouch for added durability.",
      "content": "Select a thicker pouch for added durability. Pouches range in thickness from 3 millimeters to 14 millimeters. The thicker pouches provide more protection. However, always check the directions for your machine, as many machines cannot handle very thick pouches. [2] X Research source Most machines will handle pouches in the 3-5 millimeter thickness."
    },
    {
      "title": "Trim the paper to the shape you want it.",
      "content": "Trim the paper to the shape you want it. If you want to cut out the white around an object on the paper, it's best to do it before you laminate it. Cut carefully around the edges until you're happy with how it looks."
    },
    {
      "title": "Lay the paper in the laminating pouch.",
      "content": "Lay the paper in the laminating pouch. A laminating pouch is 2 sheets held together by 1 folded edge. Open the pouch up and place the edge of the paper up against the inside of the folded edge. On the other edges, make sure to leave a little space between the edge of the paper and the edge of the pouch for the laminator to seal the edges. Close the pouch. [3] X Research source Don't cut the pouch before inserting it in the machine, as that can cause jams."
    },
    {
      "title": "Space multiple small pieces out in a pouch, if necessary.",
      "content": "Space multiple small pieces out in a pouch, if necessary. If you have multiple pieces, carefully space them out inside the pouch, leaving a bit of room between them. You will need to be able to cut between them and still have a bit of laminated edge around each piece. [4] X Research source Some laminators warn against using multiple pieces in 1 pouch, so read your instruction booklet to find out more about your machine before attempting this."
    },
    {
      "title": "Turn the laminator on and wait for it to heat up.",
      "content": "Turn the laminator on and wait for it to heat up. The laminator may heat up in as little as 30 seconds, but it can take as long as 10-15 minutes with larger machines. Typically, the laminator will have an indicator light to tell you when it's warmed up. [5] X Research source Laminators use heat to activate the glue in the lamination pouches, so you must wait for it to get warm!"
    },
    {
      "title": "Adjust the temperature based on the thickness of the pouch.",
      "content": "Adjust the temperature based on the thickness of the pouch. You need more heat for a thicker pouch. Check the chart that came with your laminator to see what temperature you need to use with the pouch thickness you've chosen. Change the temperature to match. [6] X Research source If you have a fancy laminator, it may adjust the temperature on its own. Alternatively, if you have a cheaper laminator, you may not have heat settings, and the laminator may only handle thinner pouches. Some machines only have 3-millimeter and 5-millimeter options."
    },
    {
      "title": "Match the speed to the thickness of the pouch.",
      "content": "Match the speed to the thickness of the pouch. More expensive laminators may allow you to change how fast the pouch goes through the laminator. Typically, pick a lower speed for a thicker pouch, but check the chart that came with the laminator to see the best speed for the thickness you chose. The laminator automatically grabs the pouch and feeds it through the machine, and the speed is how fast the machine does that. [7] X Research source Cheaper laminators will likely not have this option, which is another reason you may only be able to use thicker pouches with these."
    },
    {
      "title": "Place the folded edge of the pouch into the rolling part of the machine.",
      "content": "Place the folded edge of the pouch into the rolling part of the machine. Carefully pick up the pouch, trying not to move the papers inside around. Feed the edge into the slot in the machine between the rollers. Don't force it in. It will grab the edge and roll it through itself. [8] X Research source Feed the pouch in as straight as you can. If you put it in at an angle, you may end up crumpling it. Some machines have guides along the edge to help you. [9] X Research source"
    },
    {
      "title": "Wait until the pouch has gone completely through the machine.",
      "content": "Wait until the pouch has gone completely through the machine. This will take a minute or two, so be patient. Don't try to force it through the machine faster, as you'll likely cause a jam."
    },
    {
      "title": "Let the page cool before trimming it.",
      "content": "Let the page cool before trimming it. The page will come out hot from the laminator, so let it sit for a minute or two. Then, trim around the edges of your paper. Typically, the seal will hold a bit better if you leave a little of the plain lamination around the outer edge of the paper. [10] X Research source"
    },
    {
      "title": "Laminate 2 sheets of paper together for an easy way to create a 2-sided project.",
      "content": "Laminate 2 sheets of paper together for an easy way to create a 2-sided project. Instead of printing on both sides of a piece of paper, which can lead to ink bleed through, print it on 2 separate sheets. Line up the sheets back-to-back in the pouch, and laminate that way. You'll end up with a 2-sided sheet! [11] X Research source When trimming this paper, make sure to leave a little of the lamination around the outside of the sheet. If you trim it right up to the edge, the sheets will come apart. In some cases, that may be what you want; you get 2 sheets that are just laminated on the front, which can save you money if don't need to laminate the back."
    },
    {
      "title": "Use a basic filing folder to move a pouch with several paper pieces.",
      "content": "Use a basic filing folder to move a pouch with several paper pieces. If you're afraid your pieces will move around, place the open end of the pouch in the folder. Leave about 2 to 3 inches (5.1 to 7.6 cm) of the sheet out of the folder on the folded edge end. Pick up the folder and pouch together. Use the folder to hold the pieces in place while you guide the folded edge into the machine. [12] X Research source Keep holding the folder in place, but let the page slip down into the machine. Don't allow the folder to go through the machine."
    },
    {
      "title": "Use the release button if your paper jams.",
      "content": "Use the release button if your paper jams. Sometimes, the pouch may crinkle, leading to a jam. If it does, try not to let it feed through the whole machine. Press the \"release\" button on the machine to pull out the paper. [13] X Research source Some machines may require that you turn the power off before removing the jammed paper so always check your instruction manual. This can happen if you accidentally put it in at an angle, for instance."
    }
  ]
}