{
  "url": "https://www.wikihow.com/Teach-Your-Child-to-Chew-with-Their-Mouth-Closed",
  "title": "How to Teach Your Child to Chew with Their Mouth Closed",
  "steps": [
    {
      "title": "Begin teaching your child how to chew properly at an early age.",
      "content": "Begin teaching your child how to chew properly at an early age. It’s much easier to teach a child to chew with their mouth closed when they are young than to address the issue a few years later when it is a full-blown habit and they do it to spite the parents. Use your parental judgment to determine what is the right time—most parents crack down around preschool age or whenever open-mouth chewing becomes an issue. There are pros and cons to starting earlier or later—younger children are more moldable, but need more constant reminding and teaching. Older children can understand closed mouth chewing better, but it can be more difficult to change their habits."
    },
    {
      "title": "Take the time to talk to your child about table manners.",
      "content": "Take the time to talk to your child about table manners. Communication is key - take the time to talk to your toddler, when they're in a good mood, about table manners and what good behavior or behaviors are expected. [1] X Research source Your toddler is not expected to sit through a 30 minute lecture on what good table manners are, but gentle reminders every day or before and during mealtimes will be helpful. It can also help to use visual cues for your toddlers such as raising your hand (not too high, just in level with your face) when they start chewing with an open mouth. This can give them a gentle, non-verbal reminder that they should close their mouths. [2] X Research source"
    },
    {
      "title": "Set proper chewing expectations and examples.",
      "content": "Set proper chewing expectations and examples. Most children will not intuitively chew with their mouth closed, so you'll need to instruct them and tell them why it’s important. Telling your child why we chew with our mouths closed and setting expectations that everyone at the dinner table will chew with their mouths closed makes it easier for children to want to follow the new rule. Show your child how it is done by taking small bites and slowly putting each bite in your mouth. Teach them the proper technique and make sure they know exactly what to do. Take advantage of resources to show your child proper table etiquette. Picture books, such as “How Dinosaurs Eat Their Food” and “Dinner with Olivia” are effective for teaching toddlers and preschoolers the right technique and why it is so important."
    },
    {
      "title": "Be a role model for your child.",
      "content": "Be a role model for your child. Be an example to your child by always chewing with you mouth closed and making a point of waiting to speak until you finish chewing. When this happens, point out to your child that you waited to talk. Have dinners together (every night or at least very regularly) with at least one adult eating with the children. Encourage older children to chew with their mouths closed as well, to set a positive example for the younger children from all members of the family."
    },
    {
      "title": "Keep a close eye on your child during mealtimes to make sure they chew with their mouth closed.",
      "content": "Keep a close eye on your child during mealtimes to make sure they chew with their mouth closed. It will take a while for this new eating style to become a true habit, and children will need lots of reminders. To make things easier, consider creating a signal or buzzword to remind children to chew with their mouth closed. Depending on the ages of the child, this can be as simple as raising a hand when they chew with their mouth open or pointing to your mouth to remind them of the proper way to eat. When your child doesn't chew with their mouth closed, take a minute to remind them of the proper technique."
    },
    {
      "title": "Be patient.",
      "content": "Be patient. Younger children will need consistent reminders and may take longer to adapt to the new habit. This is most likely just due to their age, not their personality. Slow things down at dinner by encouraging everyone to take smaller, slower bites and show proper chewing technique. You may need to stop your young child after every bite to remind them to close their mouth, but repetitious reminders can lead to strong results."
    },
    {
      "title": "Reward proper chewing.",
      "content": "Reward proper chewing. As with most teaching exercises, children react to rewards. Positive reinforcement and praise when they eat an entire meal with their mouth closed can be incredibly powerful. Consider making a sticker chart for each meal your child eats with their mouth closed, or offer incentives like later bedtimes or fun play dates if they chew with their mouth closed for a certain number of days in a row. Rewards are dependent on the age and personality of each child, so use your parental judgment to create a system that works best for your child. You can also reward smaller children by serving their favorite foods at mealtime. This not only creates a positive connection between chewing with their mouth closed and mealtime, but makes them excited to eat every day."
    },
    {
      "title": "Consider creating consequences if necessary.",
      "content": "Consider creating consequences if necessary. If you are teaching an older child to chew with their mouth closed, or if your child is chewing with their mouth open out of spite, consider imposing consequences. Let the child know that proper manners are required . These can sometimes create a negative association with mealtimes, but can also be powerful motivators to encouraging good behavior. Again, tailor the consequences to each child. Possible options include removing the child from the dinner table, making them eat alone, or taking away a toy or fun activity."
    },
    {
      "title": "Understand that some toddlers may be suffering from a condition that keeps them from chewing with their mouth closed.",
      "content": "Understand that some toddlers may be suffering from a condition that keeps them from chewing with their mouth closed. Some toddlers may have difficulty breathing while eating, which is why they need to chew with their mouth open. Conditions such as enlargement of the adenoids, inflammation of the epiglottis and throat infections may cause a child to chew with their mouth open."
    },
    {
      "title": "Look for enlarged adenoids.",
      "content": "Look for enlarged adenoids. The adenoids are a patch of soft tissue located just behind the nasal passage which helps to trap bacteria and other harmful organisms in entering the throat and the body. This usually shrinks by the age of 5. [3] X Research source Sometimes, when the adenoids are enlarged, the child will have difficulty breathing through the nose. The child will constantly keep their mouth open in order to breathe well, especially when eating. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Understand that inflammation of the epiglottis could cause your child to chew with their mouth open.",
      "content": "Understand that inflammation of the epiglottis could cause your child to chew with their mouth open. The epiglottis is a soft tissue structure that is part of the throat. It protects the windpipe or trachea from food particles being inhaled when eating. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Pediatric epiglottitis is different from the same condition in adults in that the epiglottis is more forward located in the throat, thereby becoming more prone to bacterial infections. The most common cause of epiglottitis in children is the Haemophilus influenza type B bacteria. When an infection in the epiglottis sets in, it is almost always accompanied by inflammation. When this happens in children, there will be fever, sore throat, high pitched breathing sound or stridor, difficulty chewing with mouth closed and difficulty swallowing. There will be evident drooling and a general restless behavior. If you suspect that your child may suddenly have developed an inflamed epiglottis, seek medical help immediately as this is potentially life threatening."
    },
    {
      "title": "Look for signs of infection.",
      "content": "Look for signs of infection. Other infections in or affecting the throat, such as the common cold, common sore throat or tonsillitis are some common infections of the throat that may cause your toddler to chew with the mouth open. Infections and inflammation of the soft tissue in the throat, coupled with cold symptoms usually make it difficult for anyone to breathe normally, much more in a toddler. So before worrying why your toddler is not eating normally “like all the other kids”, try to be an observant parent first and find out if there is a reason behind the problem."
    }
  ]
}