{
  "url": "https://www.wikihow.com/Treat-Dog-Worms-With-Food-and-Herbs",
  "title": "How to Treat Dog Worms With Food and Herbs",
  "steps": [
    {
      "title": "Try chamomile or its cousin pineapple weed.",
      "content": "Try chamomile or its cousin pineapple weed. These two herbs are great for preventing and expelling round- and whipworms. They also have many other health benefits as well, not the least of which are their ability to calm and act as an anti-inflammatory. Use a ¼ teaspoon of tincture directly into the mouth per 30 pounds every few hours. If you brew your own tea, use 1T every few hours. If you brew your own, make it strong: 4 tea bags (or 2T bulk flowers) to each cup of boiling water. Chamomile is non-toxic so you can give this to your pup fairly liberally without fear of side effects. [1] X Research source"
    },
    {
      "title": "Use turmeric.",
      "content": "Use turmeric. This ancient herb's anti-parasitic properties are fortified by the fact that it also provides an environment that is not conducive to their growth while also healing worm-infested areas in your dog's digestive track. [2] X Research source Administer 1/8 to ¼ teaspoon per 10 pounds of weight every day. Make sure that your furry friend drinks plenty of water too so that it doesn't get constipated. Take once a day, after meals, for 1 week. Then for large dogs, administer it after meals daily every other week for two months. Long-term usage can be harmful so do not go over the two-month limit."
    },
    {
      "title": "Give cloves a try.",
      "content": "Give cloves a try. While their effectiveness is amplified when used in combination with other methods (e.g. wormwood or black walnut), cloves taken daily after meals can help eliminate those pesky worms. [3] X Research source For small dogs, use ¼ of a whole dry clove crushed and mixed into food 1 x daily for one week. Skip a week, then repeat the same dosage formula for the third week. For medium size dogs, use ½ of a whole dry clove and repeat the same dosage formula as that of small dogs. For large dogs use 1 whole dry clove and repeat the dosage formula as that of small dogs."
    },
    {
      "title": "Consider black walnut carefully.",
      "content": "Consider black walnut carefully. Made from the hull of the black walnut tree, this herb is excellent for eliminating heart and intestinal worms. While it is safer than most commercial de-wormers, it can be toxic if overused so great care must be taken. Think of it as your next-to-last resort herbal treatment. As the tannins and alkaloids may be dangerous to your pooch, please be certain to consult your veterinarian for use and dosage amounts."
    },
    {
      "title": "Use wormwood with a great deal of caution.",
      "content": "Use wormwood with a great deal of caution. There are sites that will recommend this herb but be very, very careful. Known to have serious negative effects on a dog's nervous system, liver and kidneys, this should only be used under the direct supervision of a veterinarian. [4] X Research source"
    },
    {
      "title": "Make and administer parsley water.",
      "content": "Make and administer parsley water. This helps keep your dog's digestive system happy and healthy during the de-worming process. Parsley is full of nutrients and also acts as a diuretic to help flush out all those worms that are desperately hanging on. Boil 1 quart of water and add one bunch of fresh parsley. Reduce heat and let simmer for 3 minutes. Strain, jar, and refrigerate the parsley water. Administer 1 T per 10 lbs of body weight once a day for 10 days. For dogs with renal issues, substitute Rooibos tea for parsley. Known to support the immune system and inhibit cancer and other diseases, Rooibos has zero tannin and is much healthier for dogs suffering from renal issues."
    },
    {
      "title": "Utilize the power of pumpkin seeds.",
      "content": "Utilize the power of pumpkin seeds. The amino acid cucurbitacin in pumpkin seeds paralyzes works and expels them from the digestive tract. These seeds are very potent and effective, particularly against tape- and hookworm. [5] X Research source Grind up pumpkin seeds into a fine powder and add one teaspoon for each 10 – 15 lbs. of body weight daily. Do this for two weeks and then add wheat bran to the dog's diet; soak the bran in water and add an eighth teaspoon per 10 lbs. of body weight to larger animals and just a pinch for smaller ones. You can even feed the seeds to him directly as a treat. Just make sure you use the same measurement guidelines. Also be sure to use unsalted, organic pumpkin seeds."
    },
    {
      "title": "Get on the grapefruit seed bandwagon.",
      "content": "Get on the grapefruit seed bandwagon. These incredibly healthy seeds have many positive effects on the bodies of both humans and dogs. Proven to fight 800 bacterial and viral strains, it also supports the immune system, fights cancer, and, in this instance, are a natural for killing, weakening, and repelling parasites. Grind up the seeds to a find powder. Sprinkle 8 mg for every 2.2 pounds of body weight (OBW) onto your dog's food. There are no restrictions as to how long to continue this treatment as grapefruit seeds are highly beneficial to your dog's overall health. Try GSE (grapefruit seed extract). Purchase this at your local health food store. For a minimal dosage, give your pooch .5 drops for every 2.2 pounds OBW orally. For maximum dosage, give your dog 10-15 drops per every 10 pounds OBW."
    },
    {
      "title": "Grind up papaya seeds.",
      "content": "Grind up papaya seeds. Rich in papain, an enzyme that will destroy the worms' outer coating and cause them to get weak and lose their hold on the intestinal wall, papaya seeds are also a great digestive aid. Grind the papaya seeds into a fine powder. Sprinkle 8 mg for every 2.2 pounds of body weight (OBW) onto your dog's food. There are no restrictions as to how long to continue this treatment as grapefruit seeds are highly beneficial to your dog's overall health."
    },
    {
      "title": "Feed your dog the papaya.",
      "content": "Feed your dog the papaya. If your dogs will eat it, the flesh of the papaya is also rich in papain. You might want to use this in combination with another method – even the papaya seeds. That way they will get all the health benefits and not rely solely on a small amount of papaya to do the job. There is a reason you only want to feed them a small amount. Feeding them a lot can lead to the same problems you can have with all fruits: too much in one end can lead to a loose result on the other. Feed your best friend fresh or dried papaya. Try to make it organic though. That will have the most papain and be the healthiest option for your dog."
    },
    {
      "title": "Feed your dog dried figs.",
      "content": "Feed your dog dried figs. Rich in the enzyme ficin, eating figs will destroy the worms' outer coating and cause them to get weak and lose their hold on the intestinal wall. Same general fruit warning: too much of a good thing can lead to too much of a bad thing. Feed your dog dried figs in moderation. One or two as a treat after meals is fine."
    },
    {
      "title": "Add food grade diatomaceous earth (DTE).",
      "content": "Add food grade diatomaceous earth (DTE). Food grade DTE is a talcum-looking powder that consists of fossilized marine phytoplankton. Their microscopic, razor-like edges slice and scrape, dehydrating parasites (i.e. worms) and thus killing them. [6] X Research source For small dogs, sprinkle 1t on their food once daily. For dogs over 55 pounds, sprinkle 1T on their food once daily. Make sure you mix it well as it is so dusty that inhaling it can cause irritation in your pooch's respiratory system."
    },
    {
      "title": "Drip Oregon grape tincture in their mouths.",
      "content": "Drip Oregon grape tincture in their mouths. The root of this plant is used for a variety of health-related applications and has been scientifically proved to be effective against parasitic worms. This is due to the presence of berberine, an anti-microbial alkaloid. You can get this at your local health food store (it may be labeled as an extract). Administer 12 drops per 20 pounds OBW. Do not use with diabetic animals, those with acute liver disease, or those that are pregnant or nursing."
    },
    {
      "title": "Cleanse their digestive systems.",
      "content": "Cleanse their digestive systems. While you're eliminating worms from your furry friend it's important to keep in mind foods that, while not qualifying as cures, greatly assist in getting rid of the parasites while simultaneously enhancing your dog's overall health. Feeding them these foods will help heal their insides while promoting a healthy immune system as well. Carrots, beets, and turnips. ½ T per day of these root vegetables will scrape the mucus lining of the intestines in a healthy, safe way (worms live in the mucus). The vegetables are neither digested nor absorbed and do not change in pH balance. In combination with a de-worming cure, they help flush away the detritus and return your dog's digestive system to a healthy, happy state. Apple cider vinegar will help your animal's digestive track heal and reduce the irritation left by worms. It also improves their coat, boosts their immune system, and helps them absorb the most nutrients from their food. Feed 1t daily. Add a half capsule of cayenne pepper per 50 lbs of body weight to food daily. This can be stepped up to a half capsule per 25 lbs of body weight twice a day for one week for quicker results."
    }
  ]
}