{
  "url": "https://www.wikihow.com/Use-Turtle-Wax",
  "title": "How to Use Turtle Wax",
  "steps": [
    {
      "title": "Wash your car",
      "content": "Wash your car before you wax it. Clean your car as thoroughly as you can on the outside. Use all the basic cleaners, such as soap and water for the body and window cleaner for your windows. By the time you finish, the body of your vehicle should be shiny and free of dirt. The turtle wax will work best when your car is spotless. [1] X Research source Start washing your car at the wheels. Any dirt that’s collected onto the wheels of your car could splash up onto the body while you wash. Tending to the wheels before washing the rest of the car minimizes the chance of splatter. [2] X Research source Wash your car in a shady area. If you leave your car in the sun during washing, the heat, water, and leftover soap will stain the car. Choosing a shady spot to wash your car minimizes the risk of staining. [3] X Research source Spray detailer onto your car after washing. Detailer adds extra sheen to your car and keeps it safe from stains. Use a soft towel to rub the detailer after spraying. [4] X Research source"
    },
    {
      "title": "Use a soft cloth to polish any scratches on your car.",
      "content": "Use a soft cloth to polish any scratches on your car. Abrasive polish will eliminate any scuffs and scratches on your car. You can find abrasive polish at your local hardware store. Completely cover the damaged area with polish. Use straight, linear movements to wipe the polish away once it begins to turn clear. This should take only a minute or 2."
    },
    {
      "title": "Rub turtle wax over the paint with a foam applicator.",
      "content": "Rub turtle wax over the paint with a foam applicator. Use just enough turtle wax to cover the surface. Keep rubbing the wax into the car using linear motions until it creates a light film."
    },
    {
      "title": "Keep your work area no bigger than 4 square feet (0.37 m2) at a time.",
      "content": "Keep your work area no bigger than 4 square feet (0.37 m 2 ) at a time. Some types of turtle wax take only a few seconds to dry and must be buffed quickly. Swipe a foam pad back and forth over the body of your car until it begins to fade into the surface. Applying turtle wax is similar to applying lotion to your skin; you have to work it into the car until it becomes shiny and smooth."
    },
    {
      "title": "Wipe off the turtle wax with a clean cloth in smooth linear motions.",
      "content": "Wipe off the turtle wax with a clean cloth in smooth linear motions. Doing this will create a clean stroke, which will leave your car looking neat. You don’t want visible streaks on a newly washed and waxed car. Wipe gently. Wait between 10 and 15 minutes before buffing the turtle wax off."
    },
    {
      "title": "Clean fog off of your bathroom mirror with a spritz of turtle wax.",
      "content": "Clean fog off of your bathroom mirror with a spritz of turtle wax. Dampen an applicator with a few sprays of turtle wax and gently wipe it onto your mirror. After letting the turtle wax fully dry, wipe it off with a clean, soft cloth. Turtle wax usually takes about 10 minutes to dry once applied. The wax should leave the mirror free of fog during your next few showers. [5] X Research source"
    },
    {
      "title": "Rejuvenate metal fixtures and appliances with a thin layer of turtle wax.",
      "content": "Rejuvenate metal fixtures and appliances with a thin layer of turtle wax. Turtle wax can be applied to a wide range of metal objects in your home for various reasons. Simply spray the wax onto a metal surface and rub it in. Let it dry for 10 minutes, then wipe it away. You’ll then notice your fixtures and/or appliances look like new! [6] X Research source Apply the turtle wax to the side of your refrigerator, dishwasher, or any metallic material in your home that has gotten scratched up over the years. [7] X Research source Polish your household sinks. Turtle wax is just as effective on kitchen metal as it is car metal! Give your kitchen faucets one spray of turtle wax the next time they become spotty or dull. The turtle wax will restore the faucet’s sheen once it is wiped off. [8] X Research source Clean your outdoor grill with a light coat of turtle wax. The exterior of your outdoor grill can be polished and cleaned with the help of turtle wax. Spray on the turtle wax, then let it dry and wipe it clean. The grill will become less resistant to staining and rust thanks to the turtle wax. Spritz a little turtle wax onto any slightly rusty areas in your home, such as your bathroom counters, to clean off the rust."
    },
    {
      "title": "Loosen up sticky or old drawer railings with a spritz of turtle wax.",
      "content": "Loosen up sticky or old drawer railings with a spritz of turtle wax. The next time you open up a stubborn drawer, rub a bit of turtle wax onto the metal railing the drawer slides on with a clean, soft cloth. Let the wax dry for 10 minutes before wiping it off. The drawer should roll back and forth more easily on its newly waxed railings; if not, re-apply the wax. [9] X Research source"
    },
    {
      "title": "Spray a light film of turtle wax onto your shower walls to prevent mildew.",
      "content": "Spray a light film of turtle wax onto your shower walls to prevent mildew. If you’ve noticed mildew growing on your outdoor decor or inside your shower, you can eliminate it with a little turtle wax. Spritz the wax onto the surface of the object, wait for 10 minutes, then wipe it back off once it’s dried. [10] X Research source"
    },
    {
      "title": "Eliminate moisture stains from wood with a single spray of turtle wax.",
      "content": "Eliminate moisture stains from wood with a single spray of turtle wax. Spray your table once with turtle wax. Wait 10 minutes for the wax to dry, then wipe it away with a clean, soft cloth. Once cleaned off, the wax will take the stains with it, leaving behind a cleaner table."
    },
    {
      "title": "Spray wax onto patent leather footwear to polish it.",
      "content": "Spray wax onto patent leather footwear to polish it. Turtle wax can keep your leather footwear shiny and spotless. Give your shoes 1 or 2 spritzes of turtle wax the next time you notice them becoming dingy. After letting it dry for 10 minutes, wipe the turtle wax off your shoes with a clean cloth. They’ll be ready to wear the next time you need them!"
    }
  ]
}