{
  "url": "https://www.wikihow.com/Superpower-Ideas",
  "title": "50+ Cool, Unique, & Creative Superpower Ideas",
  "steps": [
    {
      "title": "Umbrakinesis",
      "content": "Umbrakinesis Umbrakinesis refers to the power to control shadows and darkness with one’s mind. It’s also known as darkness manipulation. [1] X Research source Heroes and villains with umbrakinesis use their power to blind or confuse opponents, create shadow beings, and travel through shadows as if they were portals. Characters with this power: Shade (DC Comics), Cloak (Marvel Comics), Raven (DC Comics), and Shikamaru Nara ( Naruto )."
    },
    {
      "title": "Pocket dimension creation",
      "content": "Pocket dimension creation This power lets its wielder create small dimensions. Within these dimensions, they can control the environment, which helps in battles as they can bend the world to their advantage. They may also imprison others within these dimensions. [2] X Research source Characters with this power: Doctor Strange (Marvel Comics), Alpheus (DC Comics), and Jora ( One Piece )."
    },
    {
      "title": "Probability manipulation",
      "content": "Probability manipulation Probability manipulation, also known as luck manipulation, is the power to change the likelihood of events. Characters with this power can bend reality in their favor in improbable ways, such as increasing the odds they survive a life-threatening injury or rigging a lottery system in their favor. They could also simply increase the probability that they win a fight. [3] X Research source Characters with this power: Scarlet Witch (Marvel Comics), Hazard (DC Comics), and Discord ( My Little Pony )."
    },
    {
      "title": "Power absorption",
      "content": "Power absorption Power absorption lets characters take on the powers of others, including powers used against them in a fight. Besides draining the powers of others, heroes or villains with power absorption powers can sometimes wield multiple powers at once. [4] X Research source Characters with this power: Rogue (Marvel Comics), Parasite (DC Comics), and Agatha Harkness (Marvel Cinematic Universe)."
    },
    {
      "title": "Memory theft",
      "content": "Memory theft Put a unique twist on your original character by granting them the power of memory theft. This ability allows them to take memories from others—either to stop them from remembering or realizing something or to learn from the memories themselves. [5] X Research source Characters with this power: Blindspot (Marvel Comics), Olivia Moore ( iZombie ), Azazel ( The Mortal Instruments )."
    },
    {
      "title": "Technopathy (Cyberkinesis)",
      "content": "Technopathy (Cyberkinesis) Technopathy is the ability to manipulate and communicate with technology. It is distinct from cyberpathy, which is the ability to control computers. Give a character this power if you want them to have an army of machines under their influence, or be able to trigger technology in their environment during battles. [6] X Research source Characters with this power: Omega Sentinel (Marvel Comics), Danny Phantom ( Danny Phantom ), and Oracle (DC Comics)."
    },
    {
      "title": "Photographic reflexes",
      "content": "Photographic reflexes When a character has photographic reflexes, they can imitate movements after watching them once. It’s also known as adoptive muscle memory. This power is most useful in hand-to-hand combat, parkour, and using weaponry that requires precision (such as throwing knives). A limitation is that they must see the movement performed, and this power usually doesn’t extend to imitating powers like flight. [7] X Research source Characters with this power: Taskmaster (Marvel Comics), Echo (Marvel Comics), and Monica Dawson ( Heroes )."
    },
    {
      "title": "Astral projection",
      "content": "Astral projection Astral projection is the ability to project your consciousness outside of your body. [8] X Research source The power allows a character to travel beyond physical limitations and even through different astral planes inhabited by spirits or consciousnesses. This is useful for gaining information and overcoming the limitations of the material world. However, the body left behind may be vulnerable to attack. Characters with this power: Avatars ( Avatar: The Last Airbender ), David Haller/Legion (Marvel Comics), and Doctor Strange (Marvel Comics)."
    },
    {
      "title": "Time manipulation",
      "content": "Time manipulation Time manipulation is a versatile power that lets characters control time, whether to travel through it or to freeze, slow, or reverse it. Heroes and villains use time manipulation to their advantage. For example, a hero may freeze time during a battle to try to save more people. A villain may rewind time to undo their defeat. [9] X Research source Characters with this power: Sailor Moon ( Sailor Moon ), Quicksilver (Marvel Comics), and Epoch (DC Comics)."
    },
    {
      "title": "Persuasion",
      "content": "Persuasion The power of persuasion is almost like a superhuman charm, or a form of mind control. Give characters this ability, and they’ll be able to bend others to their will with ease. This is helpful for disarming minions or enemies, allowing them to avoid unnecessary conflict. [10] X Research source Characters with this power: Obi-Wan Kenobi ( Star Wars ), Hitoshi Shinso ( My Hero Academia ), and Wonder Girl (DC Comics) via her lasso."
    },
    {
      "title": "Intangibility",
      "content": "Intangibility Intangibility lets characters phase through matter. It’s handy when they must quickly move from one space to the next. It can also allow them to travel secretly or escape imprisonment with ease, or let objects like bullets go through them without damage. [11] X Research source Characters with this power: Shadowcat (Marvel Comics), Boo ( Super Mario Bros. ), and Doctor Manhattan (DC Comics)."
    },
    {
      "title": "Precognition",
      "content": "Precognition Precognition is the ability to sense events before they happen. Heroes may use this power to prevent crimes or correct their own mistakes before making them. Villains may use it to set traps, anticipating their opponent’s moves. [12] X Research source Characters with this power: Dream Girl (DC Comics), Destiny (Marvel Comics), and John Smith ( The Dead Zone )."
    },
    {
      "title": "Shape-shifting",
      "content": "Shape-shifting As the name suggests, shape-shifting is the power to change forms at will. Characters with this ability can become an existing person, animal, or being or turn themselves into a new creature. They may pretend to be someone else to trick other characters, or take on the abilities of the creature they become. [13] X Research source Characters with this power: Camilo ( Encanto ), Mystique (Marvel Comics), Beast Boy (DC Comics)."
    },
    {
      "title": "Cold and heat resistance",
      "content": "Cold and heat resistance Craft characters with superhuman powers of cold and heat resistance to enable them to withstand common attacks. These powers, when combined, let characters survive extreme environments. They also give them immunity from fire or freezing attacks. [14] X Research source Characters with this power: Larfleeze (DC Comics), Garou ( One-Punch Man ), and Ko-Matoran ( Bionicle )."
    },
    {
      "title": "Enhanced senses",
      "content": "Enhanced senses Unlike other superpowers, enhanced senses build on abilities that many non-superhumans already have. However, these senses become a power when enhanced to a fantastic degree. Examples include enhanced hearing that lets a character spy on far-away conversations or enhanced sight that lets a character see through walls. [15] X Research source Characters with this power: Daredevil (Marvel Comics), Timber Wolf (DC Comics), and Spock ( Star Trek )."
    },
    {
      "title": "Pyrokinesis",
      "content": "Pyrokinesis Pyrokinesis is the power to create and control fire with your mind. Characters with pyrokinesis use their psychic ability to burn enemies in battles and wreak destruction on their environment. If they have this power, they may be fireproof themselves. [16] X Research source Characters with this power: Prince Zuko ( Avatar: The Last Airbender ), Human Torch (Marvel Comics), and Heatwave (DC Comics)."
    },
    {
      "title": "Illusion projection",
      "content": "Illusion projection The superpower of illusion projection lets characters create and control illusions. They may create illusions to confuse opponents in battle or to change other characters’ emotional states. However, the illusions they create may not be perfect replications of real people or spaces. [17] X Research source Characters with this power: Enchantress (DC Comics), Mastermind (Marvel Comics), and Luna ( Fate: The Winx Saga )."
    },
    {
      "title": "Summoning",
      "content": "Summoning Summoning is a superpower that lets characters raise beings or people from the dead (or from fiction), usually to assist them in battles. They could also be able to summon objects. However, summoning may have a cost or limitation that makes this superpower less useful. [18] X Research source Characters with this power: Spawn (Image Comics), Magik (Marvel Comics), and Alucard ( Castlevania )."
    },
    {
      "title": "Oxygen manipulation",
      "content": "Oxygen manipulation One of the lesser-known superpowers, oxygen manipulation allows characters to control oxygen gas. This power has many applications, from using pulses of air to attack opponents to deoxygenizing others. [19] X Research source Characters with this power: Oxygen (DC Comics), Crystal (Marvel Comics), and Roy Mustang ( Fullmetal Alchemist )."
    },
    {
      "title": "Communication with animals",
      "content": "Communication with animals Grant a character the power to communicate with animals so they can control an animal army—or use pigeons and mice as their spy network in a big city. Depending on which animals they can communicate with, heroes with this power have varying degrees of usefulness. They may speak animal languages or understand animals telepathically. [20] X Research source Characters with this power: Aquaman (DC Comics), Animal Man (DC Comics), and Nature Girl (Marvel Comics)."
    },
    {
      "title": "Spatial manipulation",
      "content": "Spatial manipulation Spatial manipulation is a superpower that allows its users to change space and distance. They may use it to shorten the distance between two far-away points. They could also weaponize their ability to protect objects or people by creating a vacuum around them. [21] X Research source Characters with this power: Bill Cipher ( Gravity Falls ), Doctor Strange (Marvel Comics), and Manifold (Marvel Comics)."
    },
    {
      "title": "Weather control",
      "content": "Weather control Weather control is a superpower that involves manipulating the weather. Usually, it’s used to generate tornadoes, lightning, and other bad weather that will damage or confuse opponents. This superpower is sometimes based on its character’s emotions—when they’re happy, the weather is pleasant, but when they’re upset, storms appear. [22] X Research source Characters with this power: Storm (Marvel Comics), Weather Witch (Marvel Comics), and Pepa Madrigal ( Encanto )."
    },
    {
      "title": "Reality warping",
      "content": "Reality warping Reality warping allows you to alter reality at will. Characters with this superpower are godlike beings, speaking or manipulating reality to be whatever they want it to be. They might use this power to disarm enemies or to try and craft a utopia. They could also destroy their world’s reality. [23] X Research source Characters with this power: Scarlet Witch (Marvel Comics), God Hand ( Berserk ), and Captain Atom (DC Comics)."
    },
    {
      "title": "Elemental manipulation",
      "content": "Elemental manipulation Popularized by the Avatar: The Last Airbender franchise, elemental manipulation is a dynamic superpower. Heroes and villains with this power are able to summon and control the four classical elements: water, air, earth, and fire. It’s useful in battles, but can also be wielded for practical applications like building or cleaning. [24] X Research source Characters with this power: Aang ( Avatar: The Last Airbender ), Isis (DC Comics), and Iceman (Marvel Comics)."
    },
    {
      "title": "Psychometry",
      "content": "Psychometry A superhero or detective character would benefit from psychometry, the superpower where one learns an object’s history by touching it. This power lets characters learn the origins of magical objects, solve mysteries, and even gain the ability to use objects. [25] X Research source Characters with this power: Longshot (Marvel Comics), Theo Crain ( The Haunting of Hill House ), and Luke Skywalker ( Star Wars )."
    },
    {
      "title": "Liquefaction",
      "content": "Liquefaction Liquefaction is a superpower that can be useful, but also look rather silly. A character with liquefaction ability can turn into a liquid (such as water), helping them dodge attacks and creep through narrow spaces. This ability may be their undoing if an enemy captures and contains them in their liquid state. [26] X Research source Characters with this power: Hydro-Man (Marvel Comics), Mercury (Marvel Comics), and Popsicle ( Sky High )."
    },
    {
      "title": "Wall crawling",
      "content": "Wall crawling While superheroes like Spiderman make wall-crawling look cool, the power can also come off as funny because of its animal nature. Characters with wall-crawling superpowers are able to adhere to and scale walls with ease. When they use their power, they may resemble a lizard. [27] X Research source Characters with this power: Nightcrawler (Marvel Comics), Catwoman (DC Comics), and Count Dracula ( Dracula )."
    },
    {
      "title": "Super bouncing",
      "content": "Super bouncing Some superheroes have the power to jump really high—others have to bounce. The superpower of super bouncing lets characters fling themselves to large heights or distances. They may also bounce bullets or other weapons off themselves. Still, the rag-doll nature of their bounciness can look ridiculous. [28] X Research source Characters with this power: Bouncing Boy (DC Comics), Roundhouse (DC Comics), Hardball (Marvel Comics)."
    },
    {
      "title": "Flatness",
      "content": "Flatness Flatness is a superpower that lets a character turn themselves into a two-dimensional (2D) figure. They may use their power to slip through cracks or dodge attacks. Depending on how flat they can become, they may be able to appear invisible from certain angles—though they might look funny from the side. [29] X Research source Characters with this power: Folded Man (DC Comics), Flatman (Marvel Comics), and Elastigirl ( The Incredibles )."
    },
    {
      "title": "Superhuman digestion",
      "content": "Superhuman digestion Eating a lot of food may seem like a superpower, but being able to digest any substance is a real exceptional ability. Give a character superhuman digestion to allow them to eat weapons thrown their way, such as missiles. They may even be able to eat their enemies to defeat them in battle, as silly as that sounds. [30] X Research source Characters with this power: Matter-Eater Lad (DC Comics), Kirby ( Kirby ), and Gums ( One-Punch Man )."
    },
    {
      "title": "Super ventriloquism",
      "content": "Super ventriloquism Ventriloquism is the ability to throw your voice, making it sound as if it’s coming from another person or a dummy. Super ventriloquism takes the ability to the next level. This superpower allows its wielders to convincingly project their voice (or an impression) out of another character. How useful this is outside of voice-acting is debatable. [31] X Research source Characters with this power: The Ventriloquist (DC Comics), Superman (DC Comics), and Krypto (DC Comics)."
    },
    {
      "title": "Squirrel control",
      "content": "Squirrel control One variation of the animal control superpower, squirrel control lets characters control squirrels. They may form a squirrel army or use squirrels to distract their enemies—though it’s hard to make the fluffy creatures appear intimidating. They could also use the squirrels to access small or high spaces. [32] X Research source Characters with this power: Squirrel Girl (Marvel Comics)."
    },
    {
      "title": "Understanding babies",
      "content": "Understanding babies A lot of people feel like they understand babies, but it becomes a superpower when a character can telepathically communicate with babies. Their senseless babbling becomes coherent to characters with this power, although what they learn from the babies is probably limited. [33] X Research source Characters with mind-reading superpowers or omnilingualism could theoretically understand babies. These include Phoenix (Marvel Comics), Kylo Ren ( Star Wars ), and Edward Cullen ( Twilight Saga )."
    },
    {
      "title": "Telepathic radio frequencies",
      "content": "Telepathic radio frequencies This superpower lets a character pick up and generate radio frequencies with their mind. While it can be cool if they use the frequencies to deafen and distract their opponents, this power is also like being a human radio. Characters with this power can play music by tuning into radio frequencies—but so can radios. [34] X Research source Characters with this power: Ulysses Archer (Marvel Comics), Static (DC Comics), and Feedback ( Ben 10 )."
    },
    {
      "title": "Detachable limbs",
      "content": "Detachable limbs While there are situations where having the ability to detach your limbs is useful, as superpowers go, it’s a strange one. A character with detachable limbs can drop an arm or leg when they’re caught in a hold or trap. Typically, they can grow back the limbs they detach, similar to a starfish or lizard. [35] X Research source Characters with this power: Arm-Fall-Off-Boy (DC Comics), Dead Girl (Marvel Comics), Lorne ( Angel )."
    },
    {
      "title": "Acid projection",
      "content": "Acid projection Characters with acid projection superpowers are able to generate acid that they can spray or spit onto their opponents. Certain insects can spray or spit acid in real life—but regular humans can’t. However, characters with this power may not be immune to the effects of their own acid. [36] X Research source Characters with this power: Goop ( Ben 10 ), Reptile ( Mortal Kombat ), and Katsuyu ( Naruto )."
    },
    {
      "title": "Gerontokinesis (Age Manipulation)",
      "content": "Gerontokinesis (Age Manipulation) Gerontokinesis is the power to manipulate the age of living things, including oneself or others. Potential applications are limited to aging things forward or backward as a form of attack or assistance. A superhero with this power may enhance themselves by aging to their physical and mental peak, or go in disguise by aging themselves into a baby or older adult. [37] X Research source Characters with this power: Extant (DC Comics), Half-Life (Marvel Comics), and Cryto ( Charmed )."
    },
    {
      "title": "Plant manipulation",
      "content": "Plant manipulation Plant manipulation is a superpower that involves controlling plants. Superheroes with plant manipulation abilities may grow plants to create structures or tie up and choke enemies. This superpower can also be used for restoring the natural environment. [38] X Research source Characters with this power: Layla Williams ( Sky High ), Plantman (Marvel Comics), and Poison Ivy (DC Comics)."
    },
    {
      "title": "Sonic scream",
      "content": "Sonic scream The sonic scream is a superpower that lets its wielder emit powerful sound waves. The waves can deafen opponents and even cause destruction to objects or buildings. Characters with this power turn their voice into a weapon—they may even be able to direct their sonic scream at specific targets. [39] X Research source Characters with this power: Silver Banshee (DC Comics), White Noise (Marvel Comics), and Black Canary (DC Comics)."
    },
    {
      "title": "Bioluminescence",
      "content": "Bioluminescence Bioluminescence is another superpower found in the natural world. It’s the ability to produce light from your body, usually through a chemical reaction. A character with this power may glow to blind or distract opponents or even trigger seizures. [40] X Research source Characters with this power: Dolphin (DC Comics), Kamran (Marvel Comics), and Prism (Marvel Comics)."
    },
    {
      "title": "Necromancy",
      "content": "Necromancy A character with necromancy is able to raise and manipulate the dead, or communicate with the deceased. Associated with dark magic, this superpower is useful for heroes investigating murders or resurrecting fallen friends. Villains may use necromancy powers to create an army of the undead. [41] X Research source Characters with this power: T'Challa/Black Panther (Marvel Comics), Neron (DC Comics), and Lady Death (Chaos! Comics)."
    },
    {
      "title": "Regeneration",
      "content": "Regeneration Regeneration is a superpower that lets you rapidly heal by regenerating damaged cells and lost blood. This superpower lets characters fight for long periods of time. Where it gets weird is when characters can regenerate their entire bodies from a small piece of themselves, such as a toe. [42] X Research source Characters with this power: Captain America (Marvel Comics), Doctor Manhattan (DC Comics), and Hulk (Marvel Comics)."
    },
    {
      "title": "Elasticity",
      "content": "Elasticity Elasticity is a superpower where characters are able to stretch and contort themselves as if they were elastic. They may stretch to avoid attacks or get through tight spaces. They may also be able to pick locks or capture others by contorting themselves in specific ways. [43] X Research source Characters with this power: Elastigirl ( The Incredibles ), Plastic Man (DC Comics), and Mister Fantastic (Marvel Comics)."
    },
    {
      "title": "Power bestowal",
      "content": "Power bestowal Power bestowal is a superpower that lets a character give other characters temporary or permanent powers. While it’s useful in the context of a superhero team, the character may not be able to give themselves any powers. Additionally, a character with power bestowal may take away the chance for other characters to have unique origin stories for their abilities. [44] X Research source Characters with this power: Wizard Shazam (DC Comics), Power Broker (Marvel Comics), and Leon Nunez (Marvel Comics)."
    },
    {
      "title": "Self-destruction",
      "content": "Self-destruction Self-destruction is the power to destroy one’s self, usually in a blast that destroys others around you. Some characters with the superpower of self-destruction can regenerate or undo their own destruction, while others do not survive and can only use their power once. It’s also known as self-detonation. [45] X Research source Characters with this power: The Human Bomb (DC Comics), Nitro (Marvel Comics), and Kami ( Dragon Ball Z )."
    },
    {
      "title": "Blood manipulation",
      "content": "Blood manipulation The blood manipulation superpower allows characters to control blood. Characters with this power may use blood to strike others with it by animating it into a sharp or forceful weapon. They could also speed up healing by clotting blood near wounds. Others may simply cause nosebleeds or unconsciousness. [46] X Research source Characters with this power: Bloodwork (DC Comics), Carnage (Marvel Comics), and Michael Asher (Marvel Comics)."
    },
    {
      "title": "Hibernation",
      "content": "Hibernation Characters with the superpower of hibernation are able to hibernate like animals, going into a coma-like state. They may use this power to play dead or survive in a barren landscape. However, people with this superpower tend to be vulnerable in their hibernation state. [47] X Research source Characters with this power: Annie Leonhart ( Attack on Titan ), Squirrel Girl (Marvel Comics), and Pennywise ( It )."
    },
    {
      "title": "Puzzle manipulation",
      "content": "Puzzle manipulation Puzzle manipulation is the power to easily solve puzzles, or to create and control jigsaw puzzle pieces. Characters use this superpower to solve puzzles with their mind or turn jigsaw puzzle pieces into weapons. Since this is something some regular humans are good at, it’s not the most impressive power. [48] X Research source Characters with this power: The Puzzler (DC Comics), Norisuke Higashikata ( JoJo’s Bizarre Adventure ), and Cluemaster (DC Comics)."
    },
    {
      "title": "Sleep inducement",
      "content": "Sleep inducement Sleep inducement is the power to put people to sleep. It may be activated by touching the people or hitting them with a psychic wave of drowsiness. While gentler than other superpowers, it can be underwhelming. [49] X Research source Characters with this power: Professor X (Marvel Comics), Miss Martian (DC Comics), and The Sandman (DC Comics)."
    },
    {
      "title": "Ghost vision",
      "content": "Ghost vision Characters with the power of ghost vision are able to see ghosts, also known as mediumship. They may be able to talk to the ghosts. While this can be helpful when trying to learn information from the dead, it’s not very useful in combat situations. Characters with this superpower may even find it annoying or distracting. [50] X Research source Characters with this power: Hulk (Marvel Comics), Doctor VooDoo (Marvel Comics), and John Constantine (DC Comics/Vertigo Comics)."
    },
    {
      "title": "Super digging",
      "content": "Super digging Super digging or burrowing is the power to dig extremely fast and deep, usually into the Earth. This is useful for traveling underground or escaping conflict by tunneling away. It could also be a helpful superpower if a character needs to find something buried. Beyond that, there aren’t many applications. [51] X Research source Characters with this power: Mulch Diggums ( Artemis Fowl ) and Tusky Husky ( Krypto the Superdog )."
    },
    {
      "title": "Musical inducement (Broadway Force)",
      "content": "Musical inducement (Broadway Force) If a character has musical inducement powers, they can manipulate those around them so they break into song and dance. This is useful to prevent an attack or distract an opponent, but usually has limitations on how long it lasts. This superpower can also be useless if people can’t hear because they’re deaf or out of earshot. [52] X Research source Characters with this power: The Music Meister (DC Comics), the Blue Fairy ( Once Upon A Time ), and Sweet ( Buffy the Vampire Slayer )."
    },
    {
      "title": "Think of interesting superpower combinations.",
      "content": "Think of interesting superpower combinations. Many fictional characters have multiple superpowers that complement each other. Think of two superpowers that you feel would work well together. For example, weather control and cold resistance could be combined so a hero is able to create a blizzard without feeling its effects. Or, a character could have communication with animals and necromancy—making them capable of talking to animals’ ghosts."
    },
    {
      "title": "Read popular science articles for inspiration.",
      "content": "Read popular science articles for inspiration. Read pop-science articles from sources like Popular Science or magazines with a science section. These publications summarize cool or unusual results from academic journal articles in ways the general public can understand. Consider how such findings might translate to a superpower. For example, one Popular Science article discusses the possibility of regrowing adult teeth. Perhaps a superhero could have the power to grow their teeth into long fangs at will, turning them into a weapon."
    },
    {
      "title": "Explore a new angle of an existing superpower.",
      "content": "Explore a new angle of an existing superpower. Consider a unique use for a popular power that hasn’t been explored deeply or at all. For example, some characters have the superpower of manipulating their age to make themselves younger or older. What if they used this ability to create an elderly civilian identity, then aged themselves backward to fight crime? Besides thinking of unique applications of powers, brainstorm potential downsides to powers. These could be silly or serious—and will help humanize characters with superhuman abilities."
    },
    {
      "title": "Use a superpower generator tool to brainstorm.",
      "content": "Use a superpower generator tool to brainstorm. If you want a randomly generated list of superpower ideas, use a superpower generator tool online. RanGen’s Super Power Generator lets you select power types and power amounts to get specific results, such as psychic or elemental abilities. Another option is Random Lists’ Random Superpowers generator ."
    }
  ]
}