{
  "url": "https://www.wikihow.com/Stop-Your-Friends-from-Making-Fun-of-You",
  "title": "How to Stop Your Friends from Making Fun of You",
  "steps": [
    {
      "title": "Learn to laugh at yourself.",
      "content": "Learn to laugh at yourself. It can be really hard to do this when you're feeling embarrassed and self-conscious , but it is a very important step. Kids can be very cruel at times, and are often much more thoughtless in their dealings with each other than adults generally are. If you become visibly upset, it brings out the mean streak in some people – and they will tease you even worse. [1] X Research source It's especially important to learn to laugh it off if you've made an obvious, public mistake, like spilling a drink, tripping over something, or dropping something you are carrying. Notice how popular kids handle this situation. Typically, they'll make a joke out of it right away (“What is wrong with me today? I'm tripping all over everything!”) They'll probably still get teased by their friends for being a ditz – this happens in the “cool” cliques, too. Then, after a minute, they'll roll their eyes and tell their friends to knock it off...and they'll all start talking about something else. Let yourself off the hook. Everyone does something embarrassing once in awhile. Try to put it out of your head, and genuinely move on – this will cue the people around you that it's not a thing, any longer. This will feel unnatural at first, so you just have to force yourself to do it. It gets easier with a little practice!"
    },
    {
      "title": "Act confident.",
      "content": "Act confident. You don't necessarily need to feel confident all the time, but do your best to look that way; if you appear more confident, you are less likely to be made fun of. People find confidence intimidating. If they can't predict what you're going to say, they aren't going to risk teasing you – they know they'll look like an idiot if you have a clever comeback. [2] X Research source Try to slow down your speech. When you're nervous, you tend to speak faster...slow it down, and you will come across as more confident. [3] X Research source Watch your body language. It may sound clichéd, but try to stand straight with your shoulders back and your chin up. Not only will this make you look more confident, you'll actually feel more confident as well. [4] X Research source Strike up a conversation with your elderly next-door neighbor, or one of your mom's friends, or your friend's little brother. Talk to people who you know won't tease you, and when your friends aren't around to make you nervous. The more practice you have, the easier it will be to talk to people in more stressful situations. Keep in mind that people probably aren't paying as much attention to you as you think. All the kids around you – including the most popular – are completely self-obsessed. They're too busy worrying that they will say something dumb around someone they like, or that their friends will notice they're having a bad hair day, to be paying a lot of attention to you. So don't automatically worry that everyone is looking at you when you enter a room. In most cases, they aren't."
    },
    {
      "title": "Own it.",
      "content": "Own it. Sometimes you can turn teasing into an advantage, if it's something that really doesn't bother you very much, or if you suspect you're being teased because someone is jealous of you. A great example of this is when guys tease their guy friends for dressing up, especially if they think he's trying to impress a girl. Instead of getting upset, he can simply own it by saying something like, “Yep, it's a new hat, all right...and I look good in it, too!”"
    },
    {
      "title": "Blow it off.",
      "content": "Blow it off. There is a trick to this approach, but if you can master it, it is extremely effective in a lot of different types of uncomfortable social situations. When you're being teased, Instead, play it cool and look mildly annoyed but not angry. Inside, try thinking something like, “Okay, kids. Fun's enough, grow up already.” Don't ignore their banter completely, or it will look like you are upset and taking things too seriously. Don't agree with them and put yourself down, or it will encourage them to be more mean."
    },
    {
      "title": "Learn to tease back.",
      "content": "Learn to tease back. An important life skill is the ability to joke back with others without being too mean. A certain amount of making fun is a part of life. If you can joke a bit, and give as good as you get, others won't pick on you so much. [5] X Research source Some people tease their friends, and their boyfriends or girlfriends, out of affection – they really do think they are being funny. They will admire you if you can tease them back without getting upset."
    },
    {
      "title": "Throw it back at them, in a light-hearted way.",
      "content": "Throw it back at them, in a light-hearted way. [6] X Expert Source Katie Styzek School Counselor Expert Interview. 25 November 2020. If a friend has suddenly started teasing you about a boy, for example, you could say, “Why are you suddenly so interested in my love life, anyway?” Or, if they have been poking fun of your new look, you can say something like, “When did my hair cut become the most fascinating thing this group has to talk about?” [7] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source"
    },
    {
      "title": "Take notes",
      "content": "Take notes . Pay attention when you are around someone who is good at deflecting criticism, and can toss back witty remarks when they are being teased. Notice how they deal with it, what kind of things they say, and the reaction they get. When you're being teased, you can think to yourself, “What would this person say in this situation?”"
    },
    {
      "title": "Use the “Yes, and...”",
      "content": "Use the “Yes, and...” method. Your friends might be teasing you because they sense that you are changing, and they are afraid you will outgrow them. They are mocking you because it is easier than evolving along with you – change can be scary. If you can match their joke by taking it even further, it shows them that you are still the same person inside and there is no need to feel threatened. Your friend teases you for wearing a new leather jacket, saying, “What's up, Fonzie?” You say, “Yeah, and ...I'm not stopping there. Tomorrow I'm jumping my motorcycle over a shark tank.” You're wearing a new scarf. Your friend says, “Dude! Is that your girlfriend's scarf?” You say, “Sure is! And ...I'm wearing her undies, too.”"
    },
    {
      "title": "Tell them it bothers you.",
      "content": "Tell them it bothers you. [8] X Expert Source Katie Styzek School Counselor Expert Interview. 25 November 2020. A little bit of teasing is normal among friends, but if it is happening so often that it bothers you, it's probably gotten out of hand. Your friends may not even know how much it bothers you. Be sure to confront each friend alone, away from the group. If you try to shut it down while it's happening, it may just make the teasing worse. Be clear about your expectations. Was there a particular incident that bothered you? What could he or she have done differently, that would have been okay with you? Try simply saying, \"Hey, that's not funny.\" when your friend says something hurtful. [9] X Expert Source Katie Styzek School Counselor Expert Interview. 25 November 2020. Remember teasing is part of some people's personalities – your friend might not be able to avoid teasing you ever again. Don't try to force them to make a promise you know they won't be able to keep. You'll both end up resenting each other. Try to be specific. If there is a specific subject you'd like to make off-limits, ask if she will avoid teasing you about it. Or, if there is a certain friend who always seems to egg your friend on, ask your friend if she has ever noticed this happening – ask her to look out for it, in the future. Avoid blaming your friend, as this will just make them defensive. Avoid saying things like, “Why are you always so mean to me?” Instead, try something like, “It really bothers me when people tease me about my weight – would you please back me up when everyone starts doing that?” Let them know that as long as they are trying to work on things, you'll let them off the hook. Say something like, “We've been friends for ages, right? This is the only thing that bugs me...if you can just try to pay attention in the future, we're good.” If you know you sometimes overreact to teasing, or you're having difficulty laughing things off when you know you should – tell your friend you are working on it. Say, “I know I can be really sensitive sometimes, and I'm trying to work on it. Can you maybe go easy on me, until I develop a thicker skin?” [10] X Research source But don't let them off the hook, if they are being a jerk. Sometimes people cover their bullying by telling their victim, “Hey, lighten up!” or “Get a sense of humor!” Don't blame yourself, if this is what's happening."
    },
    {
      "title": "Ask them if something is bothering them.",
      "content": "Ask them if something is bothering them. Some people tease because they have a problem with you and they aren't brave enough to confront you about it. They will try to slip it into the conversation, pretending it's a joke. If you suspect this is the situation, take your friend aside one-on-one and just ask them if there is something they want to talk about. Tell them their teasing has come across as kind of mean spirited, lately, and you'd like to know the reason why. [11] X Research source Use this approach with friends who suddenly start teasing you, or if their normal light teasing has become cruel. It might be that there is a miscommunication between you two, and once you clear it up, the teasing will stop completely."
    },
    {
      "title": "Figure out why they're doing it.",
      "content": "Figure out why they're doing it. Sometimes friends tease you because they feel threatened by you, if they think you are becoming more popular than they are. They are just trying to get attention from the group, even if it's negative attention. They think if they make you feel small, they will look better. [12] X Research source If you are suddenly getting teased more than usual, and you can't figure out why, it might be because people are beginning to see you as more attractive or more confident than you used to be – in this is the case, cheer up, it could be a good thing! Think about whether something has happened in your friend's life to make them feel insecure. They may be lashing out to deflect attention away from themselves. It might not be you at all."
    },
    {
      "title": "Be willing to let it go.",
      "content": "Be willing to let it go. Avoid making too big a deal out of it, and don't demand an apology. A good friend will apologize without being asked, once they realize you are truly upset. But if you try to force them to feel bad when they don't think it's a big deal, they will only resent you for it. If you want to remain friends, tell them that as long as they tone down the teasing, things will be okay between you. [13] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source If they continue to tease you after agreeing to change, you may need to think about ending the relationship. Having toxic people in your life causes a lot of unnecessary stress."
    },
    {
      "title": "Go on the offensive.",
      "content": "Go on the offensive. As the saying goes, “The best defense is a good offense.” If you think you can pull it off, one way to avoid being teased is to stop it before it starts. If you always get teased by a certain person in 4th period, for example, try addressing them right when you sit down. In a casual, joking tone, say something like, “Oh, right – it's 2:00. It must be time to talk about my hair again.” The trick is to make your tormenter look like they are being boring and predictable. [14] X Research source If you can get the other person's friends to laugh with you, you can deflect their teasing onto the bully instead. People who pick on others a lot usually run in groups where they all tease each other, too. The last thing a bully wants is to be embarrassed in front of his friends."
    },
    {
      "title": "Take control of the situation.",
      "content": "Take control of the situation. If you feel confident you can handle a more aggressive tactic, you can try to take back control of the conversation. You may be able to calm them down if you can figure out their underlying motive for harassing you. Also, if you can figure out why they are bullying you, you may be able to find another way to work things out that doesn't involve fighting. [15] X Research source Every time the bully asks a question, reply by asking her to explain herself. (“Why do you believe that?” or “What makes you think I did that?”) Be careful not to lose your temper or come across as sarcastic, as this will only make them angrier."
    },
    {
      "title": "Avoid making fun of anyone, ever.",
      "content": "Avoid making fun of anyone, ever. You immediately lose the moral high ground if you are caught teasing other people, even if you are teasing the friends who are the worst at teasing you. If you start to tease them, they will just think it's part of the game. Some kids actually enjoy teasing and don't mind giving it or getting it – these are usually tough girls with four older brothers. The minute you start making fun of other people, you become fair game. Defend yourself, but don't be cruel."
    },
    {
      "title": "Report them.",
      "content": "Report them. If the situation gets too bad, and you can't find a way to get it under control, you may need to talk to a parent or teacher. [16] X Expert Source Katie Styzek School Counselor Expert Interview. 25 November 2020. They may be able to find a way to deal with the situation without anyone knowing it was you who said something. [17] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source You have to be careful with this approach, because if the bully finds out you reported them, they will treat you even worse. Your safety and your mental well-being are more important than your reputation. If you think a bully might become violent, you owe it to yourself – and to the other kids who are being abused – to say something."
    }
  ]
}