{
  "url": "https://www.wikihow.com/Use-Retin-A",
  "title": "How to Use Retin A",
  "steps": [
    {
      "title": "Understand what Retin-A is used for.",
      "content": "Understand what Retin-A is used for. The product has proved to be beneficial for several skin disorders, particularly acne. Retin-A helps to unclogs pores and reduce skin peeling. It can also be useful in reduce the appearance of wrinkles and skin damage due to sun exposure; however, Retin-A cannot cure acne, reverse wrinkles or repair sun damage. [1] X Research source Retin-A has long been recognized as beneficial for the treatment of mild to moderate acne, including blackheads, whiteheads, cysts and lesions in teenagers and adults. [2] X Research source In addition, the appearance of wrinkles are greatly diminished (though they do not disappear) with extended use and increased strength of Retin-A. Darkened skin, also known as sun spots, will also lighten with continued use of Retin-A. [3] X Research source Studies have further shown Retin-A improves the roughness of skin by smoothing or exfoliating the skin surface. [4] X Research source"
    },
    {
      "title": "Know how Retin-A works.",
      "content": "Know how Retin-A works. Retin-A (generic name: tretinoin) is a derivative of vitamin a and is a member of a group of medications called retinoids that impact the growth of skin cells. Retin-A works by changing the growth patterns and inter-cell attachments of skin cells. It inhibits the development of microcomedones, small plugs in the skin due to dead skin cells gathering inside the pore and clogging it. The development of microcomedones is typically recognized as a precursor to acne; thus, Retin-A works to prevent this from happening and can decrease the number and severity of pimples that do develop. The medication also facilitates quicker healing of acne pimples. In addition, Retin-A decreases the “stickiness” of skin cells in sebaceous follicles or oil glands."
    },
    {
      "title": "Consult a doctor.",
      "content": "Consult a doctor. If you think Retin-A might be a good option for your skin problems, you should make an appointment with your primary health practitioner who can then recommend you to a dermatologist if needed. Dermatologists are physicians that specialize in the skin and in particular, skin disorders. Primary care doctors can and often do prescribe Retin-A if its an uncomplicated case, so you may not need to see a dermatologist. Your doctor will be able to choose to most appropriate treatment for you based on your symptoms and particular skin type. Be sure to notify your doctor of any other conditions and medical history, especially if you have or had other skin conditions, such as eczema. [5] X Research source"
    },
    {
      "title": "Learn about the different types of Retin-A.",
      "content": "Learn about the different types of Retin-A. Retin-A comes in a topical liquid, gel, and cream formula. Gels are generally better for acne because they have less emollient properties; however, gels can dry the skin, so if you have dry skin, the cream form of Retin-A is likely the best option. [6] X Research source Retin-A comes in different medicated strengths, The gel is available as 0.025% or 0.01%. The cream comes as 0.1%, 0.05%, or 0.025%. The liquid comes as 0.05%. Your doctor will generally prescribe a lower strength to begin with and increase strength or dosage as needed. This graduation is to prevent side effects. [7] X Research source"
    },
    {
      "title": "Be informed about potential side effects.",
      "content": "Be informed about potential side effects. Mild side effects from using Retin-A are to expected; however, if any of the following side effects become severe, intolerable, or hinder your daily functioning, contact your doctor immediately. Note that most side effects occur during the first two to four weeks of use of Retin-A; in most cases, side effects decrease with continued use. The most common and scientifically documented side effects include: [8] X Research source [9] X Research source Skin dryness Blisters and redness of skin Itching, peeling, and scaling A warming or burning sensation Initial increase in acne"
    },
    {
      "title": "Know the contraindications.",
      "content": "Know the contraindications. Since this medication is absorbed through the skin, pregnant women should not use Retin-A because it has been proven to be very teratogenic (can cause birth defects). [10] X Research source If you are using Retin-A to treat acne, do not use other acne products while using Retin-A because they may increase skin irritation. Avoid using peeling products or products that contain peeling agents such as benzoyl peroxide, resorcinol, salicylic acid, or sulfur or other acids. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Read the instructions on the prescription.",
      "content": "Read the instructions on the prescription. Generally, Retin-A is used daily at bedtime, or once every two to three days. For best results, use it at night. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source [13] X Research source Make sure you confirm with your physician and the pharmacist as to the correct dosage as well as the appropriate method and frequency of use. Feel free to ask the doctor or pharmacist any questions you may have."
    },
    {
      "title": "Wash your hands and the affected skin area(s).",
      "content": "Wash your hands and the affected skin area(s). Wash your hands and face thoroughly with mild soap and water. Try not to use abrasive soap or anything with \"microbeads\" or other exfoliants. Pat your skin dry. [14] X Research source [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Make sure your skin is completely dry. Wait 20 – 30 minutes before applying Retin-A to ensure it is dry."
    },
    {
      "title": "Apply the medication with your fingertips.",
      "content": "Apply the medication with your fingertips. You could also use a cotton swab or cotton pad, especially if you are using Retin-A in liquid form. Use about a pea-sized amount of Retin-A (whether it be the liquid, gel or cream) or enough to cover the entire affected area lightly. The coverage should be thin and sparing, rather than slathered on the skin. In general, you shouldn't need much more than a pea-sized amount if you're applying it to a specific area. Wash your hands after application. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Apply the medication to the affected skin only. Do not apply to your entire face and/or neck. Take caution when applying Retin-A. You don't want it to get into the areas around your mouth and directly under eyes. If you do get it in your eye flush with water. Use clean lukewarm water, and flush for 10 to 20 minutes. If irritation persists contact your doctor. Wash your hands thoroughly when you are done applying. This will help you avoid transferring residual Retin-A to other people, on other parts of your skin, or accidentally rubbing into your eyes or in your mouth, all of which can be harmful."
    },
    {
      "title": "Use Retin-A consistently.",
      "content": "Use Retin-A consistently. It's important that you use Retin-A regularly in order to receive the most benefits from it. Try using it at the same time every evening. This will help make it part of your nightly routine. Retin-A won't work as a one time treatment when you have a pimple. Its action is a long-term remodeling of the skin. [17] X Research source Note that your acne may worsen during the first seven to 10 days, but should improve in the first few weeks after continuous use. In some cases, it takes even eight to 12 weeks to notice improvement. [18] X Research source Never double the dose or application. If you miss a dose and are using it every day, skip the missed dose completely. Do not double the dose. Similarly, don't apply more Retin-A than the pea-sized amount or use it more than once a day. This will not improve your skin, but only increase the likelihood of experiencing side effects. [19] X Research source [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Avoid UV exposure.",
      "content": "Avoid UV exposure. Retin-A can make you more sensitive to the sun. Take care to avoid prolonged sun exposure as well as things like tanning booths and sunlamps. Use a sunscreen daily of at least SPF 30 to prevent sunburn or irritation during the day. Wear protective clothing, like a hat, long sleeves, and pants, when outdoors and in the sun. If you get a sunburn, wait until your skin has completely healed from the sunburn before using Retin-A. [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use a moisturizer if your skin gets too dry.",
      "content": "Use a moisturizer if your skin gets too dry. Consult your doctor about which moisturizers to use if your skin does become too dry due to using Retin-A. Generally water-based moisturizing creams, gels or lotions work best if you are using Retin-A for acne. If using Retin-A for wrinkles or sunspots, oil-based creams and lotion are fine to use. Do not apply any creams or topical medications until one hour after using Retin-A. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Contact your physician.",
      "content": "Contact your physician. Note that most people do not experience serious side effects when using Retin-A; however, if you experience any of the following, you should get in touch with your doctor immediately: [23] X Research source [24] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Blistering, crusting, burning or swelling of the skin Dizziness, headache, confusion, anxiety or depression Drowsiness, slow speech or facial paralysis Allergic reaction, including hives, swelling, difficulty breathing If you become pregnant while using Retin-A"
    }
  ]
}