{
  "url": "https://www.wikihow.com/Use-Apple-TV",
  "title": "How to Use Apple TV",
  "steps": [
    {
      "title": "Unpack your Apple TV.",
      "content": "Unpack your Apple TV. Your Apple TV comes with the Apple TV box, power cable, remote, and lightning cable used to charge the remote. Set it up near your television, with access to a power outlet. If using a wired network (optional), be sure to set it up near a modem or router. [1] X Research source The Apple TV does not come with an HDMI cable or Ethernet cable. You will need to purchase an HDMI cable and Ethernet cable (optional) separately. Be sure to purchase an HDMI 2.0 cable or higher if you want 4K support. If you want to use a wired connection, you will need to purchase an Ethernet cable. Don't place the Apple TV on top of other electronic equipment and don't place objects on top of the Apple TV. Doing so could cause overheating or interference with the wireless signal."
    },
    {
      "title": "Connect the HDMI cable.",
      "content": "Connect the HDMI cable. Insert one end of the cable into the HDMI port in the back of the Apple TV box. Then connect the other end of the HDMI cable into an HDMI port on your television. If there are multiple HDMI ports on your television, be sure to note which HDMI port you are connecting to. Note: this wikiHow will describe a direct connection to your television. If using a receiver, refer to the manufacturer's instructions that came with your receiver. Generally, you will connect the Apple TV to an available HDMI port on the back of your receiver. Then you will connect a second HDMI cable from the \"HDMI Out\" (or similar) port on the back of the receiver. Then connect the other end of the HDMI cable to an available HDMI port on your television. Apple TV also provides a TOSLink digital audio output. If you are using that, connect one end of the TOSLink cable to Apple TV box, and the other end to the TOSLink digital audio input on your television."
    },
    {
      "title": "Connect the ethernet cable (optional).",
      "content": "Connect the ethernet cable (optional). Apple TV has built-in 802.11 Wi-Fi that you can connect to your wireless network during the setup. However, using a wired connection will provide a faster and more reliable connection. If you are using a wired network, connect an Ethernet cable to the ethernet port on the back of the Apple TV box. It's the port that resembles a phone jack. Then connect the other end of the Ethernet cable to a LAN port on your modem or router."
    },
    {
      "title": "Connect the power cord and plug it in.",
      "content": "Connect the power cord and plug it in. Once your other connections are in place, plug the small end of the power cord with two round holes into the Apple TV box power port. Then plug the other end into a nearby power outlet."
    },
    {
      "title": "Turn on your television.",
      "content": "Turn on your television. It's time to jump into the world of Apple TV! Using your television's remote, set your television to the HDMI input source that your Apple TV is connected to. If this is your first time using your Apple TV, you should see the setup screen. If you do not, check to make sure everything is plugged in correctly. Also, check that you've selected the correct input or source on your television. Use your television remote to select the input or source that corresponds to the HDMI port that your Apple TV is connected to."
    },
    {
      "title": "Swipe up, down, left, or right on the glass Touch surface to navigate.",
      "content": "Swipe up, down, left, or right on the glass Touch surface to navigate. This allows you to scroll through menus and the Home screen. Swipe multiple times to scroll quickly. If you are using an older white or aluminum Apple TV remote, press the up, down, left, or right sections of the black ring to navigate instead. Note that there is a free app in the App Store (cleverly named \"Remote\") that gives you all the functions of the Apple Remote, and more. If you have an iPhone or iPad, it's a great addition to the Apple TV experience."
    },
    {
      "title": "Press the center or the Touch surface to select an item.",
      "content": "Press the center or the Touch surface to select an item. This can be a menu option or an app on the Home screen. If you have a white or aluminum Apple TV remote, press the button in the center of the black ring to select an item."
    },
    {
      "title": "Press the \"Menu\" button to pull up the menu.",
      "content": "Press the \"Menu\" button to pull up the menu. If you are already on a menu screen, pressing Menu takes you back to the previous menu screen. Press and hold Menu to return to the main menu. Press and hold Menu while watching a movie to access closed captioning"
    },
    {
      "title": "Press the \"Play/Pause\" button while watching a video to pause the video or resume a paused video.",
      "content": "Press the \"Play/Pause\" button while watching a video to pause the video or resume a paused video. It's the button that has an icon that resembles a triangle with two lines next to it."
    },
    {
      "title": "Press the Apple TV/Home button to open the Apple TV app.",
      "content": "Press the Apple TV/Home button to open the Apple TV app. It's the button that has an icon that resembles a TV. This opens the Apple TV app. Press it a second time to return to the Home screen. Double-tap the Apple TV/Home button to enter multitasking mode. This displays all the apps you recently used. Swipe left or right on the Touch surface to cycle through all the different apps. Press the Touch surface to resume using the app. If you want to close an app, go to the app and swipe up on the Touch surface."
    },
    {
      "title": "Wake up your Apple TV by pressing the \"Menu\" or \"Apple TV/Home\" button.",
      "content": "Wake up your Apple TV by pressing the \"Menu\" or \"Apple TV/Home\" button. If your Apple TV is currently asleep or turned off, you can wake it up by pressing either the Menu button or Apple TV/Home button."
    },
    {
      "title": "Press the microphone button to use Siri.",
      "content": "Press the microphone button to use Siri. If you have Siri enabled on your Apple TV, press and hold the button that has an icon that resembles a microphone to activate Siri. Speak your voice commands while holding the button."
    },
    {
      "title": "Pair your Apple TV remote.",
      "content": "Pair your Apple TV remote. To pair a remote with Apple TV, hold the Apple TV remote about 3 inches from the Apple TV and point it at the Apple TV box. Press and hold the Menu and Volume Up buttons for about 5 seconds. If asked to do so, place the Apple TV remote on top of the Apple TV Box to finish pairing. If you have a white or aluminum remote, press and hold the Menu button and the Right arrow for 6 seconds."
    },
    {
      "title": "Press the volume up and down buttons to adjust the volume.",
      "content": "Press the volume up and down buttons to adjust the volume. This adjusts the audio volume for your Apple TV. Note that the Apple Remote is not a universal controller. You'll still want to control volume and other functions with your television or receiver's remote."
    },
    {
      "title": "Select your language.",
      "content": "Select your language. When you first connect your Apple TV, it asks you to select your language. Use the Touch surface or black ring to navigate the menu. Press down on the Touch surface or press the button in the center of the black ring to select your language. If you select the wrong language, press Menu on the remote to go back to the previous menu screen."
    },
    {
      "title": "Select your country.",
      "content": "Select your country. The next menu screen asks you to select which country you are from. Use the Apple TV remote to select a country from the menu."
    },
    {
      "title": "Select Continue to accept the Data & Privacy policy.",
      "content": "Select Continue to accept the Data & Privacy policy. This screen informs you that when you see the icon that resembles two people shaking hands, Apple is collecting information needed to keep the service running. You cannot opt-out of this. Select Continue to acknowledge and continue on. If you want to learn more about what kinds of data Apple collects, select Learn More at the bottom of the screen."
    },
    {
      "title": "Select Use Siri or Don't Use Siri.",
      "content": "Select Use Siri or Don't Use Siri . Siri is Apple's automated voice assistant. If your Apple TV model is Siri enabled, you can use Siri voice commands to control your Apple TV. Select Use Siri to activate Siri. If you don't want to use Siri, you can select Don't Use Siri to not activate and set up Siri. You can still use the remote to control your Apple TV without Siri. If you enable Siri, you will then be asked if you want to allow Apple to store audio recordings. If you select Store Audio Recordings , Apple may store some of your Siri voice commands to review and improve the service. If you do not want Apple to store your audio recordings, select Not Now ."
    },
    {
      "title": "Select Set Up with Device or Set Up Manually and set up your device.",
      "content": "Select Set Up with Device or Set Up Manually and set up your device. If you have an iPhone, iPad, or iPod, you can use it to set up your wireless and Apple ID on your Apple TV. If you want to use your iOS device to set up your wireless connection and Apple ID, select Set Up With Device . If you do not want to use an iOS device to set up your wireless connection and Apple ID, select Set Up Manually to continue. Setting Up with your Device: If you select \"Set up with Device\", hold your iPhone or iPad close to your Apple TV box and unlock it. Tap Set Up in the pop-up at the bottom of the screen. Then enter the 4 digit number displayed on your TV screen. Wait a few minutes for your Apple TV to finish setting up. Setting Up your Apple TV manually: . If you are setting up your Apple TV manually, use your remote to select your Wi-Fi network. Use the on-screen letters, numbers, and characters to enter your Wi-Fi password and select Continue . Then use the on-screen letters, numbers, and characters to enter the email address and password associated with your Apple ID and select Continue . If you don't have an Apple ID, you can create one or select Skip this step."
    },
    {
      "title": "Select if you want to require a password for purchases (recommended).",
      "content": "Select if you want to require a password for purchases (recommended). If you have children or roommates, it's recommended you select Always require to prevent them from purchasing movies and apps without your permission. If you live by yourself or with people you trust, you may want to select Never Require just for the sake of convenience. You can also select Require after 15 minutes ."
    },
    {
      "title": "Sign in with your TV provider.",
      "content": "Sign in with your TV provider. Some cable, satellite, and internet TV providers have Apple TV apps that you can download. You need to sign in with your TV provider to use those apps. If you want to sign in with your TV provider, select Sign In and then sign in with the email or username and password associated with your TV provider account. If you don't want to sign in with your TV provider, select Not Now ."
    },
    {
      "title": "Set your Apple TV room settings.",
      "content": "Set your Apple TV room settings. If you have (or are planning on purchasing) an Apple TV for multiple rooms in your house, you can use the following steps to select which room the Apple TV is in and if you want to use one Home screen for all Apple TV units. Select if you want to use one Home screen on all Apple TVs. If you have more than one Apple TV in your house, you can select Turn On to keep your Home screen and apps up-to-date on all Apple TVs in your house. If you don't want this feature turned on, select Not Now . Select which room the Apple TV is in. You can select options like, Living Room , Bedroom , Master Bedroom , Home Theater , Game Room , Entertainment Room , or you can select Add New Room and enter the name of the room the Apple TV is located in."
    },
    {
      "title": "Select Enable Location Services or Disable Location Services.",
      "content": "Select Enable Location Services or Disable Location Services . Location Services allows the Apple TV to track its approximate location. Some apps require this information to be able to function properly. If you want to allow apps to use information gathered from Location Services, select Enable Location Services . If you do not wish to activate this feature, select Disable Location Services . If you enabled Location Services, you will be asked if you want to download the Arial Screensaver app. Select Automatically Download to download it, or select Not Now to skip this step."
    },
    {
      "title": "Select whether or not you want to send analytics.",
      "content": "Select whether or not you want to send analytics. Both Apple and third-party app developers would like to collect analytical data while you use their apps and services. This information is used to improve their apps and services. Sharing this information is entirely optional. Use the following steps to select whether or not you want to send analytics to Apple or app developers: If you want to send Apple analytics, select Send to Apple . If you don't want to send analytics to Apple, select Don't Send . If you want to send analytics to app developers, select Share with App Developers . If you don't want to share this data, select Don't Share ."
    },
    {
      "title": "Select Agree to agree to the Terms & Conditions.",
      "content": "Select Agree to agree to the Terms & Conditions. You must agree to the Terms & Conditions in order to use Apple TV. If you want to read the Terms and Conditions, you can select options A through D on the right-hand side. Select Agree to agree to the Terms & Conditions. Your Apple TV is now set up."
    },
    {
      "title": "Open apps on your Apple TV.",
      "content": "Open apps on your Apple TV. Apple TV comes with a few apps pre-installed. You can use the Apple TV app to browse movies and TV shows. You can use the Photos app to view photos on your iCloud. The Podcast app allows you to listen to podcasts on your TV. You can also download additional apps from the App Store. To open an app, select the app on your Home screen. Press and hold the Menu button on the remote to return to the Home screen at any time."
    },
    {
      "title": "Download apps from the App Store.",
      "content": "Download apps from the App Store. Apple TV comes with a few Apple apps pre-installed. If you want to use third-party apps, you need to download them from the App Store. It has a blue icon with a white \"A\". Apps include video streaming apps like Netflix, YouTube, Hulu, Disney Plus, Max (formerly known as HBO Max), and more. You can also download music streaming apps like Spotify, Pandora, and IHeartRadio. There are apps for different sports leagues, as well as apps for news and finance. You can even download games for your Apple TV. Use the following steps to download apps from the App Store: [2] X Research source Open the App Store app. Use the category tabs at the top to browse apps or select the magnifying glass to search for apps by name. Select an app you want to download. Select the white icon with a cloud to download the app or select the icon with the price to purchase the app."
    },
    {
      "title": "Use Siri to make voice commands.",
      "content": "Use Siri to make voice commands. Not all Apple TV models have Siri enabled, but most Apple TV 4K models do. If you have Siri enabled, you can use voice commands on your Apple TV. To use Siri voice commands, press and hold the button with the microphone on your remote and speak your command. You can tell Siri to open an app or play a movie. You can also ask questions like \"What's the weather for today?\"."
    },
    {
      "title": "Organize the Home screen.",
      "content": "Organize the Home screen. It's always a good idea to keep your Home screen organized. You can move apps and even put them in folders. To move an app on the Home screen, use the remote to highlight the app. Press and hold the Touch surface until the app starts shaking. Then you can move the app using the Touch surface on the remote. You can even put the app in a folder with another app by placing it on top of that app."
    },
    {
      "title": "Delete apps.",
      "content": "Delete apps. The Apple TV has limited storage space. If your Apple TV is starting to get full or your Home screen is starting to get cluttered, you can delete apps on the Home screen. To delete an app, select the app on the home screen and press and hold the Touch surface until the app starts shaking. Press the pause/play button on the remote to open a menu. Select Delete at the top of the menu."
    },
    {
      "title": "Use AirPlay to stream content from other Apple devices.",
      "content": "Use AirPlay to stream content from other Apple devices. Many apps and streaming services support Apple AirPlay. This allows you to stream content from one device, such as an iPhone, iPad, or Mac to your Apple TV. You can also mirror the screen from your Mac, iPhone, or iPad to your TV. To use AirPlay start stream media through an app like Netflix, YouTube, or Hulu on your iPhone, iPad, or Mac. This can be a movie, TV show, video, music, or podcast. Then tap the AirPlay icon. It's the icon that resembles a TV screen on a triangle-shaped stand. Then tap your Apple TV. [3] X Research source To mirror your screen from your iPhone or iPad to your Apple TV, swipe down from the upper-right corner on your iPhone or iPad to open the Control Center. Then tap Mirror Screen . Tap your Apple TV. To mirror your Mac screen to your Apple TV, click the AirPlay icon in the menu bar at the top-right of your Mac screen. Then click your Apple TV device."
    },
    {
      "title": "Use Home Sharing.",
      "content": "Use Home Sharing. With Home Sharing, you can browse and play your entire Apple Music, Movies, TV Shows, or iTunes library. To use Home Sharing on your Apple TV, make sure both your Apple TV and computer are connected to the same wireless network. Make sure you have Apple Music, TV Shows, Movies, or Photos app open on your Mac, or iTunes for Windows on a Windows computer Select the green \"Computers\" button on the Home screen of your Apple TV. Any relevant content on your computer can be accessed there.[Image:Use Apple TV Step 11.jpg|center]] To access all content stored on your iCloud, select the Movies, Music, TV Shows, or Photos app on the Home screen of your Apple TV."
    },
    {
      "title": "Play games on your Apple TV.",
      "content": "Play games on your Apple TV. There are many games in the App Store that you can purchase and play on your Apple TV. If you have a subscription to Apple Arcade, you can use the Apple Arcade app to play the games that are available with your subscription. While you can play with your remote, the best way to play is with an Xbox One or PlayStation 4 controller. Put the controller in Bluetooth pairing mode and pair it with the Apple TV box. The Bluetooth pairing option is in the \"Bluetooth\" menu under \"Remotes and Devices\" in the \"Settings\" menu. The Xbox One and PlayStation 4 controllers are the only controllers the Apple TV supports. [4] X Research source To put an Xbox One controller in pairing mode, press and hold the Xbox button until it starts flashing. Then press the synchronize button on the top-center-left of the controller. To put a PlayStation 4 controller in pairing mode, press and hold the PlayStation button and the Share button until the light bar starts flashing."
    },
    {
      "title": "Access the Settings menu.",
      "content": "Access the Settings menu. The Settings menu has an icon that resembles two gears on the Home screen. The Settings menu has a variety of menus that you may need to access and make changes to at one point or another. The Settings menu has the following menu options: General: The General menu has general settings for your Apple TV. This includes information about your Apple TV, accessibility settings, restriction settings, screensaver and appearance settings, as well as privacy settings. Users and Accounts: This menu allows you to manage Apple TV user profiles as well as Apple ID settings. Here you can manage your iCloud settings, and TV provider settings. Video and Audio: This menu allows you to adjust your audio and visual settings. This includes adjusting your video and audio formats, resolution, and quality. Remotes and Devices: This menu allows you to change your remote settings, including remapping some of the remote buttons. This is also where you can find your AirDrop and Bluetooth settings to pair your Apple TV with other devices, such as headphones and game controllers. Apps: This menu contains app settings, including app permissions. Network: This menu is where you manage your internet connection settings. If you need to connect to a different wireless network, this is where you do it. System: This where you can find your system settings. Here you can find how much storage you have used, and update your system. Sleep: This option puts your Apple TV in sleep mode."
    }
  ]
}