{
  "url": "https://www.wikihow.com/Use-a-Fujifilm-Disposable-Camera",
  "title": "How to Use a Fujifilm Disposable Camera",
  "steps": [
    {
      "title": "Advance the film in the camera by turning the scroll wheel to the right.",
      "content": "Advance the film in the camera by turning the scroll wheel to the right. Before taking a photo, you need to advance the film inside of the camera to an empty frame. To do this, put your thumb on the horizontal scroll wheel embedded in the camera next to the viewfinder. Use your thumb to turn the wheel to the right. Continue scrolling the wheel until it won’t turn any further. [1] X Research source The scroll wheel on a Fujifilm waterproof camera is bright green and located on top of the camera. Your camera won’t take a photo if you don’t turn the scroll wheel all the way before snapping a shot. The scroll wheel is often referred to as the thumb wheel."
    },
    {
      "title": "Turn the flash on by sliding the button on the front of the camera up.",
      "content": "Turn the flash on by sliding the button on the front of the camera up. If it’s dark out and you think you’ll need an additional light source, turn the flash on. To do this, look at the front of the camera and find the large button with 4 grooves on it next to the lens. Slide it up to charge the flash. You will hear a high-pitched sound as the flash charges. Wait 2-5 seconds for this sound to end. Once the sound is gone, the flash is ready. [2] X Research source You can do this before or after you turn the scroll wheel—it doesn’t really matter. Only turn the flash on if you’re shooting in low-light conditions and you’re trying to capture something 8–36 feet (2.4–11.0 m) in front of you. If you don’t want to use flash, simply ignore this button and leave it in the off position. Some Fujifilm disposable cameras don’t have a built-in flash."
    },
    {
      "title": "Raise the camera up to your eye and look through the viewfinder.",
      "content": "Raise the camera up to your eye and look through the viewfinder. The viewfinder is the transparent rectangle on the back of the camera that you look through. Hold the viewfinder up to your dominant eye and look through it to frame your photo. Adjust the camera to change the composition of your subject so that the people, landscape, or still life are framed in an interesting way. [3] X Research source Pay attention to the light source. Generally speaking, you want the light to hit your subject at an angle. Avoid shooting directly into or away from light sources. In photography the rule of thirds is a good general rule for framing your subject. Try using this rule by adjusting the location of the camera to put your subject in one third of composition, either vertically or horizontally."
    },
    {
      "title": "Press the button on top of the camera to take a photo.",
      "content": "Press the button on top of the camera to take a photo. Hold the camera as steadily as you can. To take your photo, press the button on top of the camera all the way down. Once you hear a click, the shutter has finished opening and closing and your photo has been taken. Release the button to finish taking your photo. [4] X Research source On the waterproof models, there is a lever on the front of the camera instead of a button on top. To take a photo with a disposable waterproof camera, pull the lever down all the way until it clicks and release it."
    },
    {
      "title": "Continue using your camera until you run out of film.",
      "content": "Continue using your camera until you run out of film. Every Fujifilm disposable camera comes with 27 exposures. To determine how many photos you have left, look at the top of the camera next to the button you use to capture photos. There is a transparent piece of plastic with a number printed underneath it. This number indicates how many photos you have remaining. [5] X Research source Don't forget to turn the scroll wheel before taking each picture. Once your camera is out of film, you cannot take any more photos. Some Fujifilm cameras don’t have an indicator to show how many photos are remaining."
    },
    {
      "title": "Get your film developed at a photo lab or drug store.",
      "content": "Get your film developed at a photo lab or drug store. Once you’ve finished using your camera, take it to a photography lab to get the film developed. Alternatively, you can take the camera to a local drug store or pharmacy so long as they have a photo development department. If you don’t have a store that develops photos near you, mail the camera to a company that will develop your film remotely before mailing it back to you. [6] X Research source Some photo labs may be able to develop your film in as little as 1 hour, but some stores may require a few days if they’re incredibly busy. Pick up your photos once they’ve been developed. It typically costs $8.00-20.00 to develop the film inside of a disposable camera. With the right supplies, you can even develop the film at home."
    },
    {
      "title": "Get a QuickSnap 35 mm camera with flash for general shooting.",
      "content": "Get a QuickSnap 35 mm camera with flash for general shooting. Fujifilm’s standard 35 mm camera is the most common model on the market. The flash makes shooting at night or in overcast conditions easier, but you can turn it on and off between shots as needed. The flash can be turned on before each shot by flipping the button embedded in the front of the camera next to the lens. [7] X Research source 35 mm refers to the focal length of the lens. Essentially, it’s how wide the angle of the camera is. 35 mm is the standard default setting for most disposable cameras. Fujifilm used to make an outdoor model with no built-in flash. This was an extremely popular camera among creative photographers, but Fujifilm has since discontinued it."
    },
    {
      "title": "Buy a QuickSnap waterproof camera to shoot in wet conditions.",
      "content": "Buy a QuickSnap waterproof camera to shoot in wet conditions. Fujifilm’s second-most popular camera is their waterproof camera. It can be completely submerged in up to 17 feet (5.2 m) of water and still take high-quality photos. This makes it a great option if you’re traveling to a rainy destination or don’t want to worry about the camera getting ruined at the beach. [8] X Research source The QuickSnap waterproof camera comes with a built-in strap so that you don’t lose it if you’re in the water. The QuickSnap comes in versions with 400 or 800 ISO film. [9] X Research source The higher the ISO, the grainier the image typically is. However, images shot at a lower ISO are more likely to end up out of focus. There is no flash built into Fujifilm’s waterproof cameras."
    },
    {
      "title": "Use a Superia camera for the highest-quality images possible.",
      "content": "Use a Superia camera for the highest-quality images possible. The Fujifilm Superia camera is generally considered to be Fujifilm’s best disposable camera, but it’s a lot harder to find and typically costs a little more since the film in the camera is high-quality. It also comes with a built-in flash for shooting in low-light conditions. Superia is also the name of one of the manufacturer’s brands of film, so make sure that you’re buying a disposable camera and not just the film if you’re buying it online. The QuickSnap cameras use 400 ISO film, while the Superia uses 800 ISO film. To compensate for the higher ISO, the Superia uses a higher shutter speed so the images are typically more accurate."
    }
  ]
}