{
  "url": "https://www.wikihow.com/View-a-Friends-Wishlist-on-Steam",
  "title": "See a Friend’s Wishlist on Steam Using Desktop or Mobile Apps and the Web",
  "steps": [
    {
      "title": "Access Steam.",
      "content": "Access Steam. To use your browser, visit the Steam website at https://store.steampowered.com . Click Login at the top-right corner and enter your username and password. To use the Mac or PC app , download it from https://store.steampowered.com/about if you haven’t already. Open the app by clicking the dark blue Steam icon, and enter your username and password into the popup window."
    },
    {
      "title": "Hover over your capitalized username.",
      "content": "Hover over your capitalized username. It is located in the horizontal menu bar near the top left or center of the screen. This is not the smaller, uncapitalized username next to your user icon in the uppermost right of the screen."
    },
    {
      "title": "Click Friends in the drop-down menu.",
      "content": "Click Friends in the drop-down menu. [1] X Research source"
    },
    {
      "title": "Click on your friend’s username.",
      "content": "Click on your friend’s username. This will take you to their profile."
    },
    {
      "title": "Click on Games in the column to the right.",
      "content": "Click on Games in the column to the right. It should be found under their Level and Current Online Status. If you don’t see a link to Games, your friend has changed their privacy settings and you won’t be able to see their wishlist or other information about their gameplay. [2] X Research source The Games link can load slowly depending on how many games your friend plays. If you see a blank or partially blank page, try waiting a bit longer or reload the screen."
    },
    {
      "title": "Click on Wishlist.",
      "content": "Click on Wishlist . Above the list of games your friend owns, you will find the Wishlist tab."
    },
    {
      "title": "Search, Filter, and Sort.",
      "content": "Search, Filter, and Sort. If your friend is interested in a lot of games, it may be helpful to organize them using the search bar and drop-down menus above their wishlist! The Search bar will automatically update as you type. The Options menu allows you to filter by platform, price, discount, and more. The Sort menu defaults to Date Added, with the most recent games your friend added first."
    },
    {
      "title": "Open the Steam app on your Android, iPhone, or iPad.",
      "content": "Open the Steam app on your Android, iPhone, or iPad. Tap the dark blue Steam icon to launch and login using your credentials."
    },
    {
      "title": "Navigate to your Friends screen.",
      "content": "Navigate to your Friends screen. The app should automatically open to the Friends screen after login. If so, you will see a list of friends’ usernames. If not, tap on the hamburger menu icon in the upper left corner and tap Friends in the menu."
    },
    {
      "title": "Tap Games.",
      "content": "Tap Games . It is located in the left sidebar under the user’s icon and online status; you will have to scroll to find it."
    },
    {
      "title": "Tap the drop-down menu.",
      "content": "Tap the drop-down menu. It is located near the top of the screen."
    },
    {
      "title": "Tap Wishlist and then Done.",
      "content": "Tap Wishlist and then Done . This displays your friend’s wishlist. Directly above the list, you can filter the games using the Options drop-down menu, or change the order of the games with the Sort drop-down menu."
    }
  ]
}