{
  "url": "https://www.wikihow.com/Stretch-for-a-Scorpion-in-Cheerleading",
  "title": "How to Stretch for a Scorpion in Cheerleading",
  "steps": [
    {
      "title": "Stretch every day.",
      "content": "Stretch every day. Stretching every day is essential to becoming flexible enough to do a scorpion. Spend 10 to 20 minutes stretching your back, legs, and arms every day. To prevent injury, be sure you begin with gentle stretches before moving into more extreme stretches."
    },
    {
      "title": "Do a backbend",
      "content": "Do a backbend . A backbend is a great exercise to do when you’re working up to a scorpion, which requires an extreme back arch. A backbend stretches your back and is a good warm up. To do one: Begin by standing with your legs shoulder-width apart. Raise your arms above your head with your hands flat so they are parallel with the ceiling. Slowly bend backward and push your thighs forward. Make sure to keep your arms locked as you move closer to the ground. Plant your hands and keep your feet firmly in place when you reach the ground. You should be looking in between your hands."
    },
    {
      "title": "Perform a bow stretch",
      "content": "Perform a bow stretch . This exercise stretches your back as well as your core muscles. It will help you improve the arch in your back and stomach, which will help you accomplish the scorpion. Lay on the ground on your belly and bend your knees so that your toes are pointing toward you. #*Lift your torso off the ground, and reach back to grab your toes. Hold the stretch for 30 seconds, then slowly release it and lower your torso and legs back to the ground."
    },
    {
      "title": "Work on your splits",
      "content": "Work on your splits . Mastering your splits will help prepare you for a scorpion. Practice both the side split and the front split to ensure your legs are as limber as possible. [1] X Research source For a side split, stand with a wide, straight-legged stance. Spread your legs slightly more than shoulder-width apart, and lower yourself down to the ground. For a front split, put one leg out in front of you, and one leg behind you. Place your hands on the floor and slowly slide your front leg forward until your reach the floor, keeping your toes pointed. For an additional challenge, when you’re in the front splits, bend your back knee so your foot points toward you. This will help you achieve your scorpion."
    },
    {
      "title": "Try planks",
      "content": "Try planks . Plank exercises strengthen your core muscles and improve your balance too. There are tons of variations, so once you get the basics down you can try a side plank or a marching plank. [2] X Research source Lay flat on the floor on your stomach. Place your palms flat on the ground underneath your shoulders, and flex your feet so that your toes are touching the floor. Keep your abs tight and raise your body off the ground, so that your weight is resting on your hands and feet. Be sure to keep your back straight. Try to hold the plank for 30 seconds."
    },
    {
      "title": "Take a yoga class.",
      "content": "Take a yoga class. Doing yoga increases both your balance and your flexibility. Look for a cheap or free class in your area, and sign up. Follow along with the instructor, and ask them to make sure you are using the right technique. You could also get a yoga DVD or follow along with online tutorials. [3] X Research source"
    },
    {
      "title": "Walk the balance beam",
      "content": "Walk the balance beam . A great way to improve your balance is to use a balance beam. Walk along the beam and practice keeping your center of gravity over the beam. Keep practicing until you no longer need to hold your hands out for support and can walk the entire length of the beam in under 6 seconds. [4] X Research source"
    },
    {
      "title": "Stand on one foot.",
      "content": "Stand on one foot. Work up to balancing on one foot for a minute. Use a little support if needed. Then switch, and balance on the other foot. It’s important to exercise both sides so that one side doesn’t become weaker than the other. [5] X Research source"
    },
    {
      "title": "Use a wobble board.",
      "content": "Use a wobble board. Stand on the board with your feet shoulder-width apart. Tighten your abs and rock backward, forward, and side to side. This will help you keep your balance, and prevent you from falling, while doing a scorpion. Keep trying until you can balance for one minute or longer. [6] X Research source"
    },
    {
      "title": "Do squats",
      "content": "Do squats . Stand with your hips and knees apart, your arms out, back straight, and abs tight. Bend your knees and hips, slowly lowering yourself until your thighs are parallel to the floor. Rise back up slowly, squeezing the muscles in your backside. Repeat the desired number of times. [7] X Research source"
    },
    {
      "title": "Take a tai-chi class.",
      "content": "Take a tai-chi class. Those who do tai-chi have incredible strength and balance. Do an Internet search to find a class in your area, or look for a personal instructor. Focus on your breathing and balance while following along with the moves. [8] X Research source"
    },
    {
      "title": "Take up ballet.",
      "content": "Take up ballet. Ballet dancers also have amazing balance. Find online tutorials and videos, or sign up for a ballet class. Not only will you improve your balance, you’ll also increase your flexibility and learn new moves. [9] X Research source"
    },
    {
      "title": "Do neck rolls.",
      "content": "Do neck rolls. Stretch out your neck to avoid kinking it when you do the scorpion. Gently tilt your head to one side then roll it down in a circular motion, sweeping from one side, toward your chest, then to the other side. Then, roll your neck back so you are looking up at the ceiling or sky, and sweep it back to the starting position."
    },
    {
      "title": "Stretch your shoulders.",
      "content": "Stretch your shoulders. It’s important to stretch your shoulders and upper chest so you can reach your foot to complete the scorpion. Sit on the floor and put your arms behind you with your fingers facing the rear. Straighten your arms as you slide your hands away from your body. Hold for 30 seconds, then slowly walk your hands forward."
    },
    {
      "title": "Touch your toes.",
      "content": "Touch your toes. Stand straight up and keep your knees and legs straight. [10] X Expert Source Eric Christensen, DPT Physical Therapist Expert Interview. 17 March 2021. Keep your back and neck straight, and bend at the waist. Reach over until you can touch your toes. Try to hold the stretch for 30 seconds. [11] X Research source This can help stretch your hamstrings. [12] X Expert Source Eric Christensen, DPT Physical Therapist Expert Interview. 17 March 2021."
    },
    {
      "title": "Do a straddle stretch.",
      "content": "Do a straddle stretch. Start by sitting on the ground with your legs spread out in front of you. Open your legs as wide as you can but keep your knees and legs straight. Keep your back straight and lean over to one side to touch your toes. Repeat on the other side. [13] X Research source You can also reach out in front of you with your arms and try to touch the ground."
    },
    {
      "title": "Do a butterfly stretch.",
      "content": "Do a butterfly stretch. Sit on the ground and bend your knees to the sides so that the bottoms of your feet are touching. Gently press down on your knees to stretch your hips. You can also lean over and reach your arms out in front of you so that they touch the floor."
    },
    {
      "title": "Try a wall bridge.",
      "content": "Try a wall bridge. Stand a few feet away from the wall and place your hands on the wall behind your head by bending backward. Walk yourself down to the ground. [14] X Research source"
    },
    {
      "title": "Rock out your back.",
      "content": "Rock out your back. Lay on your back and bring your knees in toward your tummy. Hold your legs with your arms so that you are curled up in a ball. Rock back and forth to stretch your back muscles."
    },
    {
      "title": "Do a seal stretch.",
      "content": "Do a seal stretch. Lay flat on your tummy then use your arms to hold your torso up. Tip your head back. This stretches your chest, abdominal, and back muscles. A snake or cobra stretch is another name for this pose. [15] X Research source [16] X Expert Source Eric Christensen, DPT Physical Therapist Expert Interview. 17 March 2021. If that stretches your muscles too far, support your body with your elbows and forearms and work up to using your hands to support your weight."
    },
    {
      "title": "Stand with your legs slightly apart.",
      "content": "Stand with your legs slightly apart. You should be facing forward, with your arms at your sides. If you are attempting the scorpion for the first time, you may want to have a spotter there to assist you, or stand near a dresser or other flat, stable surface you can use for balance."
    },
    {
      "title": "Grip the outside of one of your feet with the hand on the same side.",
      "content": "Grip the outside of one of your feet with the hand on the same side. Bend your leg backward at the knee so that you can reach your foot. Use the hand on the same side of your body to grip your foot (e.g., if you are bending your left leg, grip it with your left hand). Keep the knee on your other leg locked for stability."
    },
    {
      "title": "Push your leg up behind you.",
      "content": "Push your leg up behind you. Use your leg muscles to stretch your leg as high as it will go behind you. Don’t use your hand to pull your muscles, just use it to guide your foot into the correct position."
    },
    {
      "title": "Turn your elbow outward.",
      "content": "Turn your elbow outward. As your leg raises higher, turn the elbow on the hand gripping your foot outward so that it points forward, in front of your head."
    },
    {
      "title": "Grip your foot with your other hand.",
      "content": "Grip your foot with your other hand. Reach behind you and grab your foot with your other hand, so that both hands are now holding your foot. Your elbows should be above your head, pointing in front of you."
    },
    {
      "title": "Push your leg higher.",
      "content": "Push your leg higher. Try to push your leg as high as it will go. This is the scorpion."
    },
    {
      "title": "Use a sports band to practice.",
      "content": "Use a sports band to practice. If you can’t quite reach your toes yet, use a sports band to help you stretch. Hold the band in both hands behind your legs like you would with a skipping rope. Put the band around the top of one foot (near your toes) and pull your leg up behind you."
    }
  ]
}