{
  "url": "https://www.wikihow.com/Use-Vlc-to-Rip-Multiple-Episodes-from-a-DVD",
  "title": "How to Use Vlc to Rip Multiple Episodes from a DVD",
  "steps": [
    {
      "title": "Open VLC and insert the DVD you want to rip.",
      "content": "Open VLC and insert the DVD you want to rip. If you insert the disc first, the default media player will most likely open. In the case that the default player is not VLC, close it, then open VLC. You'll be able to find this with an orange traffic cone icon in your Start menu (Windows) or Applications folder in Finder (Mac)."
    },
    {
      "title": "Click Media.",
      "content": "Click Media . It's in the menu bar running along the top of the program window or at the top of your screen."
    },
    {
      "title": "Click Convert/Save.",
      "content": "Click Convert/Save . You can also keypress Ctrl + R (Windows) or Cmd + R (Mac)."
    },
    {
      "title": "Click the Disc tab.",
      "content": "Click the Disc tab. By clicking this tab, you're pointing VLC to look at your disc drives for the input."
    },
    {
      "title": "Click DVD to select it.",
      "content": "Click DVD to select it. This ensures you have the right settings for a DVD instead of an Audio CD."
    },
    {
      "title": "Click the box next to \"No disc menus\" to select it.",
      "content": "Click the box next to \"No disc menus\" to select it. VLC can occasionally glitch trying to convert a looping menu, so checking this box can help prevent possible issues."
    },
    {
      "title": "Select the title and chapters you want to copy.",
      "content": "Select the title and chapters you want to copy. Under the header, \"Starting Position,\" you can choose what to rip. Mimic these selections for the \"Audio and Subtitle\" section if you want more than just the visual copied."
    },
    {
      "title": "Click Convert/Save.",
      "content": "Click Convert/Save . It's at the bottom of the \"Open Media\" window and will open a \"Convert\" window instead. [1] X Research source"
    },
    {
      "title": "Click Browse.",
      "content": "Click Browse . The default profile that VLC applies is generally what you want, but you can tweak the settings as you like. Once you click Browse , you can name and choose the save location for your file."
    },
    {
      "title": "Choose a name and location for your ripped episodes, then click Save.",
      "content": "Choose a name and location for your ripped episodes, then click Save . Make sure the correct file extension is applied before continuing; if not, go back to the \"Open Media\" screen and make sure you selected \"DVD\" at the top."
    },
    {
      "title": "Click Start.",
      "content": "Click Start . You'll see a progress bar at the bottom of the window showing you the progress of the rip. [2] X Research source Once it's done, you'll find your ripped copy in the location you chose earlier."
    }
  ]
}