{
  "url": "https://www.wikihow.com/Soften-Stiff-New-Sheets",
  "title": "How to Soften Stiff New Sheets",
  "steps": [
    {
      "title": "Place the sheets in the washing machine.",
      "content": "Place the sheets in the washing machine. After removing your new sheets from their packaging, place them directly into the washing machine. If they are queen size or larger, you may want to wash the top and bottom sheets separately to give them enough room in the machine."
    },
    {
      "title": "Add one cup of baking soda.",
      "content": "Add one cup of baking soda. Instead of your normal laundry detergent, add one cup of baking soda to the machine. It's important to omit the detergent, as it tends to lock chemicals into the sheets. These chemicals contribute to the stiffness of the sheets, so it's better to remove them."
    },
    {
      "title": "Wash on a regular cycle.",
      "content": "Wash on a regular cycle. Set the machine to a regular cycle using warm water, and turn the washer on."
    },
    {
      "title": "Add a cup of vinegar during the rinse cycle.",
      "content": "Add a cup of vinegar during the rinse cycle. When it's time for the rinse cycle, turn the temperature of the machine to cold and add a cup of white vinegar. This will help to soften the sheets further, but is completely optional. The baking soda will work on its own. [1] X Research source"
    },
    {
      "title": "Line dry the sheets.",
      "content": "Line dry the sheets. When the rinse cycle is finished, remove the sheets from the machine and hang outside to dry in the sun. This will help to soften them further. If you don't have space to dry them outside, place in the dryer and dry on a low setting - drying at too high a temperature can cause shrinkage."
    },
    {
      "title": "Wash again.",
      "content": "Wash again. Once the sheets are dry, you can wash them a second time using the regular amount of detergent. Although washing them twice sounds like a lot of work, it really helps to soften the sheets. Dry outside or in the dryer, then iron them (if you like) and place them directly on the bed."
    },
    {
      "title": "Remember that your sheets will become softer every time you wash them.",
      "content": "Remember that your sheets will become softer every time you wash them. Good quality sheets will become softer after every washing, drying and ironing cycle. For ultimate softness (and durability) buy good quality cotton sheets with a high thread count."
    },
    {
      "title": "Use fabric softener.",
      "content": "Use fabric softener. In addition to a cup of baking soda, you can add the recommended amount of your favorite fabric softener to the machine when you wash your new sheets. This provides extremely soft sheets. Alternatively, you can just use the softener on its own. [2] X Research source"
    },
    {
      "title": "Use turpentine.",
      "content": "Use turpentine. Add half a cup of turpentine to the washing water with the sheets and wash on a regular cycle using warm water. Rinse thoroughly to remove most of the turpentine. Hang the sheets outside or on a clothes horse to dry. It is very important that you do not put the sheets in the dryer after washing with turpentine as turpentine is combustible and could cause a fire."
    },
    {
      "title": "Use Epsom salts.",
      "content": "Use Epsom salts. Fill a laundry tub with cold water and add 50g of Epsom salts. Stir the sheets around in the tub for two minutes (use a wooden spoon if you don't want your hands to get cold!) Leave the sheets to soak overnight in the Epsom salts mixture. The following morning, rinse the sheets out thoroughly, then hang them outside to dry. [3] X Research source"
    },
    {
      "title": "Use borax.",
      "content": "Use borax. Fill a laundry tub with cold water and add 6 tablespoons (88.7 ml) of borax to the tub. Add the sheets to the water, stir them around and leave them to soak overnight. Rinse thoroughly the next morning and hang outside to dry."
    },
    {
      "title": "Use salt.",
      "content": "Use salt. Fill a laundry tub with cold water and throw in 2 handfuls of salt. Add the sheets and leave them to soak overnight. Wash, rinse, and dry as usual."
    },
    {
      "title": "Finished.",
      "content": "Finished."
    }
  ]
}