{
  "url": "https://www.wikihow.com/Unlock-iPhone-Passcode-Without-Computer",
  "title": "6 Ways to Access a Locked iPhone without a Computer",
  "steps": [
    {
      "title": "Try to enter your passcode several times.",
      "content": "Try to enter your passcode several times. After you enter your passcode incorrectly a few times, you’ll see a screen that says “iPhone Unavailable.” It will ask you to try again after a certain amount of time has passed (e.g., 1 minute). [2] X Research source Your iPhone needs to be connected to a cellular or Wi-Fi network for this to work."
    },
    {
      "title": "Tap Forgot Password?.",
      "content": "Tap Forgot Password? . This option will appear at the bottom right corner of the screen. You might need to wait a moment for it to become available."
    },
    {
      "title": "Tap Start iPhone Reset.",
      "content": "Tap Start iPhone Reset . Select this option to confirm that you want to reset your iPhone. Be aware that this will erase all the content and settings on your iPhone, and you’ll need to restore it from a backup or set it up as a new device."
    },
    {
      "title": "Enter your Apple ID password.",
      "content": "Enter your Apple ID password. This will sign you out of your Apple ID on your iPhone."
    },
    {
      "title": "Tap Erase iPhone.",
      "content": "Tap Erase iPhone . This will erase all the data and settings on your phone. If you have an eSIM, you’ll see the option to either keep or erase it. Wait for your iPhone to finish erasing itself. It will restart automatically when it’s done."
    },
    {
      "title": "Restore your iPhone",
      "content": "Restore your iPhone or set it up again. After your iPhone restarts, follow the prompts to set it up again. If you backed up your iPhone using iCloud or your computer, you can restore it now. If you don’t have a backup, you’ll need to set your phone up from scratch. During the set up or restore process, you’ll have the chance to create a new passcode. Make sure to select one you’ll remember."
    },
    {
      "title": "Use this method if you recently changed your passcode.",
      "content": "Use this method if you recently changed your passcode. If you recently changed your passcode and you’ve forgotten the new one, you can temporarily use your old one to unlock your iPhone. This will only work if you’re using iOS 17 and you made the change within the past 72 hours. [3] X Research source"
    },
    {
      "title": "Enter your passcode incorrectly 5 times.",
      "content": "Enter your passcode incorrectly 5 times. This should trigger the iPhone Unavailable screen."
    },
    {
      "title": "Tap Forgot Passcode?.",
      "content": "Tap Forgot Passcode? . This option will appear at the bottom right corner of the screen. You may need to wait a moment for it to become available."
    },
    {
      "title": "Tap Enter Previous Passcode.",
      "content": "Tap Enter Previous Passcode . If you changed your passcode within the past 72 hours, you should see this option. If not, or if you’ve forgotten your old passcode, you’ll need to reset your device completely using the iPhone Reset option."
    },
    {
      "title": "Type in your old passcode and set a new one.",
      "content": "Type in your old passcode and set a new one. As soon as you enter your old passcode, you’ll be prompted to set up a new one. Make sure to choose one you can easily remember. If you want to expire your old passcode sooner than 72 hours for security reasons, you can do so by going to Settings > Face ID & Passcode . Enter your new passcode, then tap Expire Previous Passcode Now ."
    },
    {
      "title": "Try to enter your passcode 5 times.",
      "content": "Try to enter your passcode 5 times. If your iPhone is running iOS 15.2-iOS 16, you can reset your phone from the Security Lockout or iPhone Unavailable screen, which doesn't require a computer. To get started, make 5 attempts to enter your passcode. Your phone will temporarily lock you out after 5 incorrect attempts, and you’ll have to wait a few minutes before you can try again. [4] X Research source Your iPhone will also need to be connected to Wi-Fi or a mobile network for this to work. If you have an eSIM or digital SIM on your iPhone, contact your service provider first to find out how to set up your eSIM again after you’ve reset the phone. Keep in mind that this method will erase everything on your iPhone. If you have your data and settings backed up, you’ll be able to restore them after you’re done."
    },
    {
      "title": "Keep entering the passcode until a \"Security Lockout\" screen appears.",
      "content": "Keep entering the passcode until a \"Security Lockout\" screen appears. After the initial lockout, you’ll need to wait for a certain amount of time before you can try to log in again. Keep trying to enter your passcode until you see \"Security Lockout\" with an Erase iPhone option at the bottom right corner. In some cases, your screen may say \"iPhone Unavailable\" instead of \"Security Lockout.\" Either way, keep trying until the Erase iPhone option appears."
    },
    {
      "title": "Tap Erase iPhone.",
      "content": "Tap Erase iPhone . You’ll see this option at the bottom right side of the screen, next to Emergency."
    },
    {
      "title": "Confirm by tapping Erase iPhone again.",
      "content": "Confirm by tapping Erase iPhone again. A new screen will appear asking you if you want to erase all your content and settings. Select Erase iPhone again to proceed, or tap Cancel to go back."
    },
    {
      "title": "Enter your Apple ID password.",
      "content": "Enter your Apple ID password. You’ll need to log in using the same Apple ID you used to set up your iPhone. When you’re prompted, enter your Apple ID password to sign out of your Apple ID on the iPhone. [5] X Research source If you can’t remember your password, you may need to change it on another device."
    },
    {
      "title": "Tap Erase iPhone one more time.",
      "content": "Tap Erase iPhone one more time. Once you enter your password, you may be prompted to tap Erase iPhone again. Wait for your phone to finish erasing itself, after which it will restart automatically. [6] X Research source"
    },
    {
      "title": "Follow the instructions to restore your phone.",
      "content": "Follow the instructions to restore your phone. Once your phone is done resetting, follow the onscreen prompts to set it up again. This will also give you the opportunity to set a new passcode that’s easier to remember! If you like, you can also set up an alternative method for unlocking your phone, such as Face ID or Touch ID. [7] X Research source However, not all iPhone models support these methods."
    },
    {
      "title": "Open the Find My app on another device.",
      "content": "Open the Find My app on another device. You don’t need a computer to unlock your iPhone and reset the passcode with Find My, but you will need a different device that supports the Find My app (such as another iPhone or an iPad). You can use Find My to remotely erase your locked iPhone so you can unlock it and set it up again. To get started, launch the Find My app. [8] X Research source You’ll need to be logged in with the same Apple ID that you used to set up your locked device. This will only work on iPhones that already have Find My enabled . Keep in mind that this method will erase all the content and settings on your iPhone. You’ll need to set your phone up again or restore it from a backup after you’re done."
    },
    {
      "title": "Tap Devices at the bottom of the screen.",
      "content": "Tap Devices at the bottom of the screen. You’ll see a map showing the current locations of your devices as well as an expandable list of all the Apple devices connected to your account. [9] X Research source"
    },
    {
      "title": "Select your iPhone from the list of devices.",
      "content": "Select your iPhone from the list of devices. Find your iPhone in the list and tap on it. A new menu will appear."
    },
    {
      "title": "Choose Erase This Device.",
      "content": "Choose Erase This Device . Tap on the red Erase This Device link at the bottom of the device menu. [10] X Research source"
    },
    {
      "title": "Tap Continue.",
      "content": "Tap Continue . If you want to proceed, tap the blue Continue button. If you change your mind, tap Cancel in the top right corner of the \"Erase iPhone?\" screen instead. [11] X Research source"
    },
    {
      "title": "Select Erase.",
      "content": "Select Erase . You’ll be prompted to confirm your choice by tapping Erase in the top right corner of the next screen. You’ll also be given the option to enter your phone number on this screen, but you don’t need to do that unless your phone is lost and you want it to display your contact number in case someone finds it."
    },
    {
      "title": "Enter your Apple ID and password.",
      "content": "Enter your Apple ID and password. You’ll need to log in to confirm the reset. On the next screen, type in your Apple ID and password, then tap Erase one more time. [12] X Research source"
    },
    {
      "title": "Set your iPhone up again after erasing it.",
      "content": "Set your iPhone up again after erasing it. Your iPhone will be erased and reset next time it connects to a Wi-Fi or cellular network. If it’s not connected to a network, you’ll see an Erase Pending message on the screen. Once the reset process is complete, you’ll need to set your iPhone up again and create a new passcode or other login method. When you erase an iPhone this way, it will go into Activation Lock mode. You’ll need to enter your Apple ID and password to unlock it before you can set it up again. [13] X Research source If you’ve forgotten your Apple ID or password, you’ll need to reset them on another device. [14] X Research source If you change your mind, you can cancel the process if your phone is offline and hasn’t started erasing yet. Select your iPhone in the list of devices on Find My and tap Cancel Erase , then enter your Apple ID and password again."
    },
    {
      "title": "Log into iCloud",
      "content": "Log into iCloud with your Apple ID and password. This method is similar to the Find My method, but you can use it to reset your iPhone passcode from any device—even an Android phone or tablet. To get started, open a browser and navigate to https://www.icloud.com/find . Click the Sign In button and enter the Apple ID and password you used to set up your iPhone. [15] X Research source"
    },
    {
      "title": "Select your iPhone in All Devices.",
      "content": "Select your iPhone in All Devices . You’ll see a menu of all your devices on the left side of the screen. Click the phone you want to unlock. A new window displaying options and information about your phone will open. If the All Devices menu is collapsed, click the green box on the right side of the menu to expand it."
    },
    {
      "title": "Select Erase This Device.",
      "content": "Select Erase This Device . You’ll see this option near the bottom of the device menu."
    },
    {
      "title": "Select Next to confirm.",
      "content": "Select Next to confirm. A window will pop up warning you that all the content and settings on the phone will be erased. Click Next to confirm, or click the X in the top left corner of the popup to go back to the menu."
    },
    {
      "title": "Type in your Apple ID and password.",
      "content": "Type in your Apple ID and password. You’ll be prompted to log in with your Apple ID to continue. If you’re not using a trusted device, you may need to perform some additional verification steps, such as answering your security questions or having a verification code sent to your phone number or another device. [16] X Research source"
    },
    {
      "title": "Follow the prompts to confirm and reset your iPhone.",
      "content": "Follow the prompts to confirm and reset your iPhone. Once you confirm that you want to erase your iPhone, the erasing process will begin. After all the data is erased from your phone, it will go into Activation Lock mode. You’ll need to log in with your Apple ID and password to set the phone up again. Your phone won’t erase until it’s turned on and connected to Wi-Fi or a cellular network. If your iPhone isn’t currently online, you can always select your device in iCloud and click Stop Erase Request to cancel the process."
    },
    {
      "title": "Activate Siri",
      "content": "Activate Siri by saying “Hey Siri” or clicking the Home button. If you have an older iPhone, you may be able to unlock it without a passcode by hacking in with Siri. This method exploits an old weakness in Siri’s security settings that has been fixed in more recent updates. You’ll only be able to do it if your locked iPhone is using a version of iOS between 8.0 and 10.1 and has a Home button."
    },
    {
      "title": "Ask Siri what time it is.",
      "content": "Ask Siri what time it is. Once Siri is active, say, “What time is it?” Even if your phone is locked, the Clock widget should open."
    },
    {
      "title": "Open the Clock app.",
      "content": "Open the Clock app. Once the widget appears, tap it to open up the Clock app."
    },
    {
      "title": "Tap the World Clock icon.",
      "content": "Tap the World Clock icon. It’s the icon that looks like a globe with grid lines."
    },
    {
      "title": "Select the + button.",
      "content": "Select the + button. At the top right corner of the World Clock screen, tap on the + sign. This will allow you to add a new city to your list."
    },
    {
      "title": "Type some text into the Search bar and select it.",
      "content": "Type some text into the Search bar and select it. Instead of selecting a new city from the list, start typing in the search bar at the top of the screen. Then, double tap the text to select it."
    },
    {
      "title": "Tap the selected text to open a menu.",
      "content": "Tap the selected text to open a menu. Once the text you typed in is selected, tap it again to open a menu with editing options. [17] X Research source"
    },
    {
      "title": "Select Share….",
      "content": "Select Share… . You may need to navigate with the > button in the Edit menu to find the Share… option. Once you find it, tap on it to open the Share menu."
    },
    {
      "title": "Tap Messages.",
      "content": "Tap Messages . This will open a new text message window."
    },
    {
      "title": "Enter any word into the \"To\" field and tap return.",
      "content": "Enter any word into the \"To\" field and tap return . Type any word or jumble of letters into the To: field, then tap return on your keyboard to highlight the text."
    },
    {
      "title": "Tap the + button.",
      "content": "Tap the + button. Once your text is selected, tap + to the right of the To: field. This will bring up a menu for creating a new contact on your iPhone."
    },
    {
      "title": "Select Create New Contact.",
      "content": "Select Create New Contact . Choose Create New Contact from the options in the menu."
    },
    {
      "title": "Tap Add Photo.",
      "content": "Tap Add Photo . You’ll see this option on the left side of the New Contact screen."
    },
    {
      "title": "Select Choose Photo.",
      "content": "Select Choose Photo . A menu will pop up asking you to either take a new photo or choose one that’s already on your phone. Tap Choose Photo ."
    },
    {
      "title": "Open any album in your photo library.",
      "content": "Open any album in your photo library. Once the Photos app opens, tap any album in your library to open it."
    },
    {
      "title": "Press the Home button.",
      "content": "Press the Home button. As soon as the album opens, press the Home button on your phone. This will unlock your phone and take you to the Home Screen. From there, you can open your Settings app and reset your passcode! This is one of several methods for unlocking an older iPhone using a glitch in the Siri app. If it doesn’t work for you, consider trying one of the following: Unlock your phone by setting an alarm with Siri, then forcing the lock screen to crash Ask Siri to set a reminder for you, then access the Home Screen through the Reminders app Ask Siri to launch an app you don’t have, then access the Home Screen through the iTunes store"
    }
  ]
}