{
  "url": "https://www.wikihow.com/Write-a-Check-on-a-US-Bank-to-a-Canadian-Payee",
  "title": "How to Write a Check on a US Bank to a Canadian Payee",
  "steps": [
    {
      "title": "Fill out the check correctly.",
      "content": "Fill out the check correctly. This may seem like a no-brainer, but when you're trying to send a check abroad, even the smallest error in date, amount, or payee can cause complications. Follow all of the standards correctly to make sure no unforeseen circumstances prevent the check from being cashed. There aren't any notes or differences you'll need to make for the check to be cashed and accepted by a standard Canadian bank."
    },
    {
      "title": "Consider sending a certified check.",
      "content": "Consider sending a certified check. Although your personal check will work just fine, a certified check can be issued by your bank. These are as good as cash and directly drafted and backed by the bank. These are useful when the person receiving the money wants a guarantee that the money is covered by a person they are not entirely familiar with. This may cost a small fee, but generally if you have an account at the bank, it should not cost any processing fee but each bank can differ."
    },
    {
      "title": "Understand the conversion rate.",
      "content": "Understand the conversion rate. Every USD is worth approximately 1.31 Canadian dollars, but this rate can fluctuate. For example, $20 USD would be $26.18 CAD. Therefore, if the person or organization you're writing the check to is expecting a certain amount in Canadian dollars, make sure the amount is correct. Note the currency you're using. The currency of the check is based on the bank that it is drawn from. If the funds are drawn from a U.S. bank, the funds are denoted in U.S. dollars (USD). If the funds are drawn from a Canadian bank, they are based in Canadian dollars (CAD)."
    },
    {
      "title": "Know what fees might be involved.",
      "content": "Know what fees might be involved. Sometimes your bank may charge you a percentage, or flat fee per foreign transaction. These fees can come from your bank or the bank cashing the check, depending on their individual policies. This could make it so you end up paying considerably more than you had originally intended, if there is a large tacked on to the final amount. Sometimes if your bank charges a fee, you can get around it by using special accounts or services tailored for foreign transactions. Make sure you know what options are available before writing the check. If you are writing many checks and are hit with fees, sometimes as much as $40 dollars per check, this can really affect your bottom line. You will also want to know whether the receiver will have to pay a fee so you can accommodate for this in your transaction."
    },
    {
      "title": "Understand hold and wait periods to cash and send foreign transactions.",
      "content": "Understand hold and wait periods to cash and send foreign transactions. Every bank will have their own regulations, but there can be a holding period before the funds are released, sometimes as much as 28 days. If you are making a time-sensitive payment, make sure you know the holding period of both the Canadian recipient, and your own bank. If both banks have a waiting period, these will need to be taken into account. [1] X Research source If you are in a time-sensitive situation, you may want to look into other methods like wiring the money, credit cards, or online services like PayPal."
    },
    {
      "title": "Know how conversion rates will affect your payment.",
      "content": "Know how conversion rates will affect your payment. Sometimes you may think you're paying a certain amount to the payee, but the conversion rate will make the payment too much or not enough. Make sure you understand how the cross border payment will affect the amount using a calculator that is current on conversion rates. Sometimes conversion rates can be beneficial or detrimental to a deal depending on the valuation of respective currency."
    },
    {
      "title": "Send an electronic check.",
      "content": "Send an electronic check. An electronic check simplifies the process by taking away the need for any sort of paper check. E-checks pass through an Automatic Clearing House (ACH) and will grant a Canadian merchant the ability to accept funds from an American consumer with a valid checking account. Different companies will have their own ACH that the funds pass through. Use one with experience sending money from the U.S. to Canada, like DebitWay or Sage."
    },
    {
      "title": "Use a money order.",
      "content": "Use a money order. Money orders are as good as cash. They may charge a nominal fee, but will have no issue being written or cashed on either side, since it is written on a subsidiary of the bank. This too may cost a fee, but if you weigh against a check cashing fee, it may save you money."
    },
    {
      "title": "Consider a wiring service to send money across the border.",
      "content": "Consider a wiring service to send money across the border. You can wire money directly into their bank account if you have the proper information. You can also use a wiring service, like Western Union. Western Union is a great and common way to send money to Canada. They will charge a fee, it is fast and can be picked up by the recipient at any Western Union location. [2] X Research source"
    },
    {
      "title": "Use PayPal or electronic money transfers.",
      "content": "Use PayPal or electronic money transfers. PayPal is an easy way to send money all over the world. They will charge a nominal fee if it is a business transaction. They will also have a conversion option so you can clearly see how much money is being exchanged. PayPal can take a few days to reach their bank account, so you'll want to communicate accordingly."
    }
  ]
}