{
  "url": "https://www.wikihow.com/Speak-Huttese",
  "title": "How to Speak Huttese",
  "steps": [
    {
      "title": "Learn some Huttese greetings.",
      "content": "Learn some Huttese greetings. Greetings are some of the most useful words in any language, including Huttese. Have a look at a Huttese dictionary or word-list online, and pull out a few of the most useful greetings and salutations, such as: [2] X Research source Achuta (“Hello”) Bo shuda (“Greetings”) [3] X Research source Chowbaso (“Welcome”) Gooddé da lodia! (“Good day to you!”) Mee jewz ku (“Goodbye”)"
    },
    {
      "title": "Memorize words for friends and foes.",
      "content": "Memorize words for friends and foes. Learning how to refer to yourself and other people (or droids, or alien life-forms) is also key to mastering any language. Familiarize yourself with some pronouns, and learn some nouns for the types of beings you are likely to discuss in Huttese. [4] X Research source The known Huttese pronouns are jee (“I/me”), jee-jee (“we/us”), chuba (“you”), and cheekta (“her”). You might also find use for words like bukee (“boy”), footoo (“fellow”), cheeka (“woman”), nek (“man”), ulwan (“smuggler”), murishani (“bounty hunter”), and jeedai (“Jedi”). You could refer to a friend as ma pateessa (“my friend”), while an enemy might be wermo (“fool” or “idiot”), sleemo (“slime-ball”), or peedunkey (“punk”)."
    },
    {
      "title": "Get familiar with a few common nouns.",
      "content": "Get familiar with a few common nouns. Words for places and things are also very useful. Get to know a few nouns that might come up in everyday conversation on Tatooine, such as: [5] X Research source See'ybark (“sailing barge”) Blasto (“weapon” or “blaster”) E'nachu (“food”) [6] X Research source Gopptula (“ransom”) Planeeto (“planet”)"
    },
    {
      "title": "Master some basic verbs.",
      "content": "Master some basic verbs. In addition to the simplest of verbs (such as sa for “is/are”), you'll need words to express a variety of actions. Learn some Huttese verbs, such as: [7] X Research source Boska (“search” or “go”) Stuka (“see”) Dwana (“sell”) Cheeska (“cheat”) Winkee (“sleep”)"
    },
    {
      "title": "Acquaint yourself with some adjectives.",
      "content": "Acquaint yourself with some adjectives. Huttese is an expressive language with lots of colorful descriptors. You'll get the most out of Huttese if you have a rich vocabulary of adjectives. For example: [8] X Research source Gusha (“lucky”) Lapti (“fancy”) Shado (“fast”) Double-crossing (“dopa-meeky”) Goola (“bad”) Grancha (“large”) Azalus (“dangerous”)"
    },
    {
      "title": "Learn other useful words.",
      "content": "Learn other useful words. Once you have a basic vocabulary, you can build phrases by using helping words like conjunctions, prepositions, imperatives, interrogatives, articles, and particles. A few additional useful words in Huttese include: [9] X Research source An (“and”) Che (“for”) Ta (“the”) Du (“a/an”) Coo (“who/which”), coo sa (“Who is . . . ?” or “Which is . . . ?”) Choy (“what”) Jopay (“when”) Konchee (“where”) Tagwa (“yes”) No (“nobata”) Out (“nenoleeya”) In (“noleeya”) Hagwa (“don't”)"
    },
    {
      "title": "Pick up some Huttese phrases.",
      "content": "Pick up some Huttese phrases. Huttese can come in handy when you want to greet a fellow Star Wars fan, close a business deal Tatooine-style, or engage in some playful banter. You can find a list of Huttese phrases broken down by category here: http://www.nerdgirlarmy.com/2011/02/speak-in-huttese-language-of-jabba-hut.html . A few helpful phrases include: Achute, my pee kasa Susan. (“Hello, my name is Susan.”) Hi chuba na daga? (“What do you want?”) Bargon wan chee kospah. (“There will be no bargain.”) Bona nai kachu. (“You're in trouble now!”)"
    },
    {
      "title": "Learn the Huttese counting system.",
      "content": "Learn the Huttese counting system. Since the Hutts have only 4 fingers on each hand, they count in base 8 rather than base 10 . This means that they only use the digits 0-7, with 8 being the equivalent of our 10. [10] X Research source This is very useful to know if you are negotiating ransom price for your favorite chuba doompa dopa-maskey ulwan (low-down, two-faced smuggler). The known numbers in Huttese are: Bo (1) Dopa (2) Duba (3) Fwanna (4) K'wanna (5) Kita (6) Goba (7) Our 8-15 are the Huttese equivalent of 10-17. These numbers are hunto, biska, boboba, goboba, joboba, soboba, koboba, and foboba. The only other known Huttese number is 100 (144 in base 8): jujumon."
    },
    {
      "title": "Practice Huttese pronunciation.",
      "content": "Practice Huttese pronunciation. For the most part, Huttese is pronounced as it is written. However, the language has 1 or 2 sounds that may be unfamiliar to an English speaker. For example, an X is pronounced like a kissing sound or a loud smack of the lips. [11] X Research source This sound appears in the phrase Ap-xmasi keepuna (“Don't shoot!”). Watch and listen closely to characters speaking Huttese in the Star Wars films and spinoff shows, and try to approximate the harsh and guttural sounds of Huttese speech."
    },
    {
      "title": "Check out a book on conlangs that discusses Huttese.",
      "content": "Check out a book on conlangs that discusses Huttese. If you're interested in a more academic and in-depth look at the characteristics of Huttese and other invented languages, pick up a book on fictional languages or conlangs. Books on this topic may be available through your local library, a bookstore near you, or an online book retailer. For example, you might take a look at The Art of Language Invention: From Horse-Lords to Dark Elves , by David J. Peterson. For a discussion on how Huttese relates to the real Quechua language of Peru, check out the Encyclopedia of Fictional and Fantastic Languages , by Tim Conley and Stephen Cain."
    },
    {
      "title": "Join a conlang discussion group.",
      "content": "Join a conlang discussion group. There are many online communities dedicated to the discussion of fictional languages like Huttese. In these groups, you can learn and share new phrases and discuss what little is known of Huttese grammar. For example, check out the r/conlangs community on Reddit: https://www.reddit.com/r/conlangs/?rdt=33940 You can also sign up for the Brown University Conlang Mailing List: https://listserv.brown.edu/archives/cgi-bin/wa?A0=CONLANG"
    },
    {
      "title": "Explore the Star Wars Languages Wiki.",
      "content": "Explore the Star Wars Languages Wiki. This Fandom wiki contains information about all of the languages used in the Star Wars universe, including Huttese. Explore the wiki and join conversations with other fans and Star Wars scholars about the Huttese language here: http://starwarslanguages.fandom.com/wiki/Star_wars_languages_Wiki ."
    },
    {
      "title": "Attend conventions with workshops or panels on conlangs.",
      "content": "Attend conventions with workshops or panels on conlangs. Sci-fi conventions can be a great place to meet not only other fans, but also people who specialize in studying and creating fictional languages. Do a search for “sci-fi convention with conlang panel” or similar to find out about events that may be coming up. If you attend a conlanging panel or workshop, bring a list of your questions about Huttese. Even if you don't encounter any Huttese experts, you might get a lively discussion going!"
    }
  ]
}