{
  "url": "https://www.wikihow.com/Stop-Being-Racist",
  "title": "How to Stop Being Racist",
  "steps": [
    {
      "title": "Recognize that racism isn't binary.",
      "content": "Recognize that racism isn't binary. It's not that you either are or aren't racist—racism is a lot more nuanced than that. You can even be friends with people of different races while still being affected by unconscious bias. Chances are good that over time you've been exposed to subtle messages that people of color are somehow less than people who are white. Even if you reject those messages consciously, they still have an impact on how you see race, and you can't overcome racism until you recognize that. [1] X Research source While you may only think of white people as being affected by bias, people of any background can be racist. For example, a black person might have unconscious biases against people from Latin or Asian communities."
    },
    {
      "title": "Understand the connection between race and privilege.",
      "content": "Understand the connection between race and privilege. It can be hard to realize that having a certain skin color can provide you with some advantages in life, especially if you've been through a lot of struggles. However, racial privilege doesn't necessarily mean you've had it easy. Instead, it means the color of your skin isn't likely to be a factor in why your life might be tough. Learning to recognize this privilege can make you more empathetic to people of color, and with time, you can even leverage your privilege to speak out against racism. [2] X Research source For example, if you're white, you may have never thought to question why TV characters, toys, and even bandages reflect your skin color. However, people with darker skin haven't been equally represented in those (and many other) areas. Once you're aware of this, you may choose to support brands that offer more inclusive options. White privilege also means that a white person may receive a lesser sentence for the same crime as a person of color. Being aware of this might lead you to vote for political candidates who support fair sentencing. [3] X Research source Although white privilege is most prevalent, privilege doesn't necessarily apply only to white people: In some cultures, people of color who have lighter skin tones may be considered \"better\" than people with darker skin. [4] X Research source"
    },
    {
      "title": "Begin questioning your unconscious biases as you notice them.",
      "content": "Begin questioning your unconscious biases as you notice them. As you learn more about racism, you'll likely start to recognize thoughts or feelings that are based on racial bias. It will feel uncomfortable to challenge yourself at first, but just try to keep an open mind—even simply identifying when you have these thoughts will help you overcome them. [5] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For example, if you're commuting to work and catch yourself feeling nervous when you see someone in a head covering, you might stop and tell yourself, \"This person isn't any more dangerous to me than anyone else on the train.\""
    },
    {
      "title": "Avoid stereotyping people you meet.",
      "content": "Avoid stereotyping people you meet. If you want to overcome racism, don't make race-related assumptions about a person's interests or abilities. Instead, treat everyone you meet as an individual, and get to know them on their own merit. You'll often be surprised at people's complexity when you do this, and you'll be less likely to treat them in a way that would be seen as racist. [6] X Research source For instance, if you catch yourself automatically assuming that a black teenager listens to rap music, you might stop and ask yourself, \"Did I ask them what kind of music they like, or am I just jumping to that conclusion because of the color of their skin?\" They might very well like rap, but you might be surprised to discover they also love 90s death metal or Broadway show tunes."
    },
    {
      "title": "Don't blame people of color for being oppressed.",
      "content": "Don't blame people of color for being oppressed. There are a number of political and social factors that have contributed to racism across the world, like discriminatory practices in the justice system or housing markets. This type of insititutional racism often leaves people of color at a disadvantage—they may be less likely to get high-paying jobs, may find it hard to secure homes in safe neighborhoods, and are more likely to be incarcerated. [7] X Trustworthy Source Kansas University Center for Community Health and Development Community-based research center focused on supporting public health development and education Go to source If you haven't experienced these obstacles, it might be easy to say something like, \"Well people in bad neighborhoods should get better jobs so they can move out.\" However, this doesn't take into account the real struggle that people of color face when it comes to things like education—the schools in their neighborhoods might not get the same funding as schools in an affluent neighborhood, making it harder to get the skills they need for a successful career."
    },
    {
      "title": "Acknowledge cultural differences instead of ignoring them.",
      "content": "Acknowledge cultural differences instead of ignoring them. As you're getting to know more people of color, you might notice things about their lives that are different than yours. It's okay to recognize those and even to talk about them! Just be careful not to assume that all people with a certain skin color like or do the same things. [8] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For instance, you may notice that several of your black friends have huge family reunions. These are a fun annual tradition in many black families! However, when you meet someone new who happens to be black, you shouldn't automatically assume that their family has an annual reunion. Saying things like, \"I don't see color,\" makes it hard to celebrate the differences that make us special. Try talking to your friends and coworkers to learn more about things like their favorite cultural foods, their religious practices, or their holiday celebrations. Learning more about your friends' cultures can bring you closer to them. However, remember to focus more on what you have in common, rather than how you're different."
    },
    {
      "title": "Be open to growing from your mistakes.",
      "content": "Be open to growing from your mistakes. If someone points out that you said or did something racist, try not to get defensive, but also try not to get too frustrated with yourself. Overcoming racism is a lifelong journey, and we all have growing to do. Just take it as a learning opportunity and keep trying to do better. [9] X Research source For instance, if someone points out that you said something that perpetuates a harmful stereotype about race, apologize, even if you feel embarrassed. Then, on your own time, do a little research to find out what was offensive about what you said, and be sure not to repeat that again."
    },
    {
      "title": "Stop using racial slurs.",
      "content": "Stop using racial slurs. If you grew up hearing and using racist language, it can be hard to unlearn it, but it's an essential step toward becoming anti-racist. Slurs with racial connotations are hurtful, and they often perpetuate harmful stereotypes about the people they refer to. [10] X Research source In addition to obviously hateful slurs, also examine phrases that have a racial meaning. For example, the word \"gyp\" is often used to refer to a bad deal, but it's derived from the word \"gypsy,\" and is a slur against Romani people. [11] X Research source Similarly, don't display symbols that have racist connotations, like Nazi memorabilia or cartoon depictions that exaggerate the features and characteristics of a particular race. Avoid cultural appropriation as well—it can be offensive to borrow someone else's culture for a costume, like wearing a Native American headdress to a music festival if that's not part of your heritage."
    },
    {
      "title": "Avoid constantly mentioning someone's race.",
      "content": "Avoid constantly mentioning someone's race. Sometimes, racist actions are a lot more subtle than dropping the n-word. These are called microaggressions, and they may include things like teasing someone about their race; referring to someone as \"articulate\" or \"well-spoken\" (because it hints at the assumption that people of their race usually aren't those things); asking to touch a person's hair; or asking where a person is 'really' from. If you notice yourself doing any of these, or if someone points them out, apologize and keep trying to do better. [12] X Research source Even if you mean well, constantly calling attention to a person's race can make them feel ostracized, and it may even create a hostile environment."
    },
    {
      "title": "Become friends with people from different backgrounds.",
      "content": "Become friends with people from different backgrounds. Shunning racist beliefs and actions is a great start toward overcoming racism, but the best way to become anti-racist is to actively engage in conversations and friendships with people from all walks of life. This will help you broaden your perspective, making it easier to understand the challenges faced by many people of color today. [13] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source Be sure to get to know your new friends more deeply than just asking questions about their culture. Remember, it's not their job to be an encyclopedia on race, so don't expect them to spend all their time educating you. Instead, simply treat them as a valued friend. Don't just befriend someone because they're a different race, because that will be obvious and is actually kind of racist in itself. Instead, be open to forming friendships with people of color because you actually like them for who they are. You don't always have to greet everyone you meet with open arms—some people might give you a bad feeling, and it's important to trust your instincts. However, once you're in a safe environment, take some time to reflect on whether the person's skin color contributed to that feeling."
    },
    {
      "title": "Support media and art created by people of color.",
      "content": "Support media and art created by people of color. To expand your understanding of race even more, try reading books, watching movies, and listening to speeches by people of color. This can help you get a better perspective on their experiences, even if the subject isn't explicitly about race. [14] X Research source If you're not sure where to start, check out this TED-approved list of books by black authors: https://ideas.ted.com/62-great-books-by-black-authors-recommended-by-ted-speakers/ . Be open to supporting businesses in your community that are owned by people of color, as well!"
    },
    {
      "title": "Don't overcompensate to seem non-racist.",
      "content": "Don't overcompensate to seem non-racist. When you're first learning about racism, you might sometimes be struck by the need to prove how open-minded you are to the people around you. For instance, you might act overly friendly towards a person of color so they know you're totally not racist. This kind of thing, while not as hurtful as overt racism, isn't quite the answer either—it can still make people of color feel like you're focusing on their race, and it will be harder to make a genuine connection with them if you're not being completely authentic. [15] X Research source Try not to worry too much about how other people see you. It's a lot more important to actually become anti-racist than whether you're perceived that way. [16] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source"
    },
    {
      "title": "Speak out against overt racism.",
      "content": "Speak out against overt racism. Being silent in the face of obvious bias or discrimination can send the message that you support those actions. You don't necessarily have to seek out and contradict everything racist in the world, but if you're witnessing racism in front of you, speak up to stop it. This might be uncomfortable, especially at first, but allies can be a powerful asset in the fight against racism. [17] X Trustworthy Source Greater Good Magazine Journal published by UC Berkeley's Greater Good Science Center, which uses scientific research to promote happier living Go to source For instance, you might say something like, \"I'm not sure why you feel that way, but I completely disagree.\" [18] X Research source Look for ways to challenge racism in institutions, as well. For instance, if you notice discriminatory practices in your school, workplace, or community, call attention to them and fight to have them changed. [19] X Research source To help encourage larger-scale changes, you might join anti-racist protests or support anti-racist legislation."
    }
  ]
}