{
  "url": "https://www.wikihow.com/Thicken-Soup",
  "title": "How to Thicken Soup",
  "steps": [
    {
      "title": "Pour in a dash or so of cream for a classic thickener.",
      "content": "Pour in a dash or so of cream for a classic thickener. Cream is one of the easiest thickeners to use in soup. Add it near the end of cooking the soup. Let it simmer gently for about 10 minutes, and the soup will thicken up with the cream. [1] X Research source Try a couple of spoonfuls up to a 1 cup (240 mL), depending on how creamy you want it. If you leave the cream in too long and the soup boils, it can curdle in your soup, which is why it's best to add it at the end. Half and half or even whole milk will also work for this purpose."
    },
    {
      "title": "Spoon in yogurt for a creamy, tangy base.",
      "content": "Spoon in yogurt for a creamy, tangy base. Use plain yogurt. Both whole milk and fat free will work, though you'll get a richer soup with whole milk. Spoon it into the soup near the end, and let it simmer for a few minutes to thicken. [2] X Research source Yogurt will change the flavor of your soup more dramatically than cream, as it is much tangier. It works well in spring-type soups, such as potato soup, tomato soup, butternut squash soup, and avocado soup."
    },
    {
      "title": "Use coconut milk or cream for a vegan option.",
      "content": "Use coconut milk or cream for a vegan option. If you crave creaminess but don't want to use milk or eggs, coconut milk is an excellent choice. Coconut milk tends to be more stable than cream, so you can add it any time during the cooking process, though near the end is probably best. [3] X Research source Coconut cream is much thicker than coconut milk, so choose which one to use based on how thick you want your soup. Coconut can add a subtle coconut flavor for the soup, which works really well in soups with Asian flavors, such as Thai soups."
    },
    {
      "title": "Stir in whole, beaten eggs for a creamy, savory addition.",
      "content": "Stir in whole, beaten eggs for a creamy, savory addition. Beat a couple of eggs in a bowl, thoroughly whisking them until they are fully incorporated and light and frothy. Take a small cup of broth from the soup. Pour it in a gentle into the egg mixture while you whisk vigorously at the same time. Once the hot soup is incorporated, pour the whole mixture back into the soup. [4] X Research source Pouring hot soup into the eggs is known as tempering them, which keeps them from curdling in your soup."
    },
    {
      "title": "Put chunks of bread in your soup for an easy thickener.",
      "content": "Put chunks of bread in your soup for an easy thickener. Choose a light bread, such as plain white bread, the inside of French bread, or sourdough. Rip it into chunks that are about 2 to 3 inches (5.1 to 7.6 cm) wide or just throw in a whole slice if it's pre-sliced. Let the soup simmer until the bread dissolves. [5] X Research source Another option is bread crumbs. Just stir in small amounts until you reach the thickness you want. Corn tortillas or tortilla chips also work well. Stale bread is great for this purpose."
    },
    {
      "title": "Pour in instant or quick oats for a hearty soup.",
      "content": "Pour in instant or quick oats for a hearty soup. If a recipe calls for bread, you can substitute 1 ⁄ 2 cup (120 mL) of oats per slice of bread. Otherwise, try adding 1 ⁄ 2 cup (120 mL) at a time. Let it boil for 10 minutes or so, then check the consistency before adding more. [6] X Research source This addition works best in soups like potato or garlic. It will also work in tomato, but you should go slowly when adding oats, as it can overpower the flavor of the tomato."
    },
    {
      "title": "Mix flour or cornstarch with water for hearty meat soups.",
      "content": "Mix flour or cornstarch with water for hearty meat soups. Mix (1 tablespoon (15 mL) of cool water with 1 tablespoon (12.5 g) of cornstarch or flour for 1 cup (240 mL) of soup. Beat it together thoroughly until there are no lumps. Pour it into the hot soup near the end to thicken it. Allow the soup to simmer for 10 minutes or so, while you stir it often. [7] X Research source"
    },
    {
      "title": "Add instant potato flakes to thicken chowders and potato soups.",
      "content": "Add instant potato flakes to thicken chowders and potato soups. If your potato-leek soup is too thin, potato flakes can come to the rescue. Scoop out a bit of the broth, and stir the flakes into it. Pour the mixture back into your soup, and let it cook for a few minutes. Check the back of the potato flake package for water to flake ratios."
    },
    {
      "title": "Create a beurre manie for a simple, buttery solution.",
      "content": "Create a beurre manie for a simple, buttery solution. In a bowl, add equal parts softened butter and flour. Knead them together with your hands or a pastry blender. Work it together until you have fine crumbles, and then add it to the soup a little at a time. [9] X Research source Start with a spoonful or 2 of this mixture. Stir it in, and then let it simmer for a few minutes before checking the consistency."
    },
    {
      "title": "Make a roux",
      "content": "Make a roux to add depth of flavor to your soup. A roux is simply equal parts butter and flour. Melt the butter in a pan over medium or medium-low heat, and add the flour to it. Stir it constantly until it reaches a golden brown, and then add some of the hot broth from the soup. Stir until the liquid is incorporated. If it's still too thick, add more liquid. Once it's liquidy enough to pour or scrape, add it into the soup and whisk it in thoroughly. [10] X Research source Some soups start with a roux, or call for a much darker roux. For instance, gumbo starts with a very dark roux."
    },
    {
      "title": "Bring your soup to a gentle boil.",
      "content": "Bring your soup to a gentle boil. Simmering the soup over low heat is fine as long as you can see bubbles forming on the surface. The liquid needs to be boiling so that some of it will evaporate, leaving a thicker soup. If it's not boiling, raise your heat to medium. If you are in a big hurry, you can turn the burner up to high. [11] X Research source Turn down the heat if your soup starts to burn."
    },
    {
      "title": "Remove the lid from your soup so the liquid can evaporate.",
      "content": "Remove the lid from your soup so the liquid can evaporate. Use a towel or pot holder to pick up the lid to make sure you don't get burned. Additionally, lean away from the escaping steam, which will be very hot. Once the lid is off, continue to cook the stew. [12] X Research source When the lid is on the pot, it collects the steam as it rises from your soup instead of letting it evaporate away. Keep in mind that this can make the flavor of your soup more concentrated. For example, you might notice that it tastes saltier."
    },
    {
      "title": "Separate the soup into smaller pots to speed up the process.",
      "content": "Separate the soup into smaller pots to speed up the process. This step is optional, but it can help you finish cooking your soup faster. Use a large ladle to remove soup from a large soup pot, then pour the soup into one or more smaller pots. Heat the smaller pots on your other stove-top burners to reduce it quickly. [13] X Research source It's up to you how many smaller pots you want to use. For example, you might prefer to just use one small pot so that your dinner will be ready quicker, leaving the rest of the soup for leftovers."
    },
    {
      "title": "Stir the soup as it boils to keep it from burning.",
      "content": "Stir the soup as it boils to keep it from burning. Use a large plastic or wooden spoon to occasionally stir the soup so that it won't stick to the sides of the pot. As you stir, check the soup's thickness to see if it meets your preferences. [14] X Research source Stand back away from the pot, and avoid leaning over it. Since the liquid is evaporating, hot steam will be rising from the pot, and you could get burned."
    },
    {
      "title": "Remove the soup from the heat when it reaches your desired thickness.",
      "content": "Remove the soup from the heat when it reaches your desired thickness. Put the soup on a cool burner or on a cooling pad. Allow the soup to cool down for a few minutes before you serve it. As it cools, stir the soup occasionally to keep it from sticking to the sides of the pot. [15] X Research source"
    },
    {
      "title": "Puree nuts to add richness, flavor, and protein.",
      "content": "Puree nuts to add richness, flavor, and protein. In a food processor or spice grinder, thoroughly blend up a handful or 2 of nuts. Grind them into a crumbly paste, and then stir them into the soup. [16] X Research source You can use walnuts, pecans, or cashews, to name a few."
    },
    {
      "title": "Scoop out and blend part of the soup for an easy, flavorful fix.",
      "content": "Scoop out and blend part of the soup for an easy, flavorful fix. Use a ladle to remove some of the soup ingredients from the pot, such as potatoes, vegetables, lentils, beans, or rice. Transfer them into a blender or food processor, then blend them until they're smooth. Then, return the puree back to the pot and stir until the soup is blended. [17] X Research source Although any of the ingredients can be pureed, it's easiest to blend root vegetables, like carrots and potatoes. Plus, these veggies make great thickeners."
    },
    {
      "title": "Use a stick blender to easily puree the soup in the pot.",
      "content": "Use a stick blender to easily puree the soup in the pot. A stick blender will let you conveniently puree part of your soup without having to scoop any of it out. Simply put the stick blender into the pot and turn it on. Run it for 15-30 seconds at a time, then stir to check the consistency. Continue to puree the soup until it reaches the consistency you want. [18] X Research source"
    }
  ]
}