{
  "url": "https://www.wikihow.com/Store-Firewood",
  "title": "How to Store Firewood",
  "steps": [
    {
      "title": "Seek out a location close to your home.",
      "content": "Seek out a location close to your home. When storing firewood, it's important to keep convenience in mind. Firewood can be heavy to carry from outside into your home, and this can be especially stressful during the colder months. Seek out an appropriate space away from the home to avoid infestations from termites and carpenter ants, but nearby enough for convenience. [1] X Research source Keep in mind, if there aren't any appropriate spaces very close to your home, you can invest in a wheelbarrow to make transferring the firewood easier."
    },
    {
      "title": "Find a location off of soil.",
      "content": "Find a location off of soil. When firewood is stored directly on the ground, it will rot quicker. Bacteria and bugs can get into the firewood, causing it to go bad. Look for a place off of soil. Surfaces like concrete, asphalt, and clean gravel can be good surfaces for firewood. If you can't find any appropriate surfaces, you can use sticks to elevate firewood off of the ground. You can also lay down a tarp underneath firewood."
    },
    {
      "title": "See if there's room in an outdoor non-wooden storage shed.",
      "content": "See if there's room in an outdoor non-wooden storage shed. If you have an outdoor storage shed, this a great place to store firewood. Inside a shed, firewood will be protected from things like rain. The shed will also provide a barrier between firewood and the soil. If possible, store firewood in an outdoor shed. Be careful of termites and carpenter ants taking up a home in wooden sheds as they can cause significant structural damage. [2] X Research source You can also store firewood in your garage."
    },
    {
      "title": "It is never recommended to store firewood inside homes.",
      "content": "It is never recommended to store firewood inside homes. Bugs, including termites and carpenter ants, can hitch a ride on the wood and cause significant property damage to wooden structures. [3] X Research source You can store firewood in an old trunk, if you have one. Some fireplaces have compartments built into the wall next to them where you can store firewood. Make sure firewood you store indoors is fully dry . If you chopped or collected your own firewood, you should store it outside until it dries. It takes firewood around six months to fully dry out. [4] X Research source"
    },
    {
      "title": "Elevate firewood with 2 by 4 or 4x4 pressure treated boards, if necessary.",
      "content": "Elevate firewood with 2 by 4 or 4x4 pressure treated boards, if necessary. If you can't find an area outdoors off of the soil, you can easily elevate firewood using 2 by 4 boards. You can buy boards at any hardware store and create a quick storage area for your firewood. [5] X Research source Lay the boards on the ground about 15 inches apart. Lay down as many rows of boards as you need to stack all your firewood. Lay your firewood over the boards, keeping them parallel to the boards. The boards should elevate the firewood off the ground slightly, preventing it from touching the soil."
    },
    {
      "title": "Use a tarp to protect your firewood from moisture.",
      "content": "Use a tarp to protect your firewood from moisture. You should always lay a tarp down over your firewood. You can buy a tarp at any hardware store. Simply lay the tarp over the firewood and tie it down to secure it. You can also weigh the tarp down with something like bricks. [6] X Research source It's important to allow for some air circulation, as you don't want your firewood to get too dry. You should leave the sides of your stack open to allow for airflow."
    },
    {
      "title": "Stack firewood effectively.",
      "content": "Stack firewood effectively. When stacking firewood, make sure to do so effectively. Stacking your firewood incorrectly can cause it to rot quicker. You should always stack your firewood rather than throwing it in a pile. This will promote air circulation and keep firewood from drying out. Never stack firewood against a wall when stacking it outdoors. This can leave firewood vulnerable to moisture and bacteria. Always leave a few inches of space between your firewood and a wall. Never place firewood against the side of a wooden structure, including your house, because this will invite termites and carpenter ants to feast on your home."
    },
    {
      "title": "Do not put a tarp over firewood before it's dry.",
      "content": "Do not put a tarp over firewood before it's dry. Wet firewood needs to dry out before it can be stored safely. Wet wood needs to be exposed to open air to dry out. If you've just collected firewood, refrain from putting a tarp over it. If it's going to rain, it's appropriate to cover wet firewood with a tarp. Just make sure to leave the sides of firewood pile uncovered."
    },
    {
      "title": "Makes sure your firewood is ready before using it.",
      "content": "Makes sure your firewood is ready before using it. You do not want to throw wet firewood into your fireplace. Before using your firewood, make sure it's adequately dry. [7] X Research source Dry firewood will be gray with cracks along the edges. Dry firewood will also be much lighter than wet firewood."
    },
    {
      "title": "Check any local regulations regarding firewood storage.",
      "content": "Check any local regulations regarding firewood storage. It's possible your city or neighborhood may have regulations about storing firewood. Look over local codes in your area before choosing a storage method for your firewood. You want to make sure you store your firewood legally."
    }
  ]
}