{
  "url": "https://www.wikihow.com/Speak-Korean",
  "title": "How to Speak Korean",
  "steps": [
    {
      "title": "Learn Hangeul, the Korean alphabet.",
      "content": "Learn Hangeul, the Korean alphabet. The alphabet is a good place to start when you're learning to speak Korean, especially if you hope to progress to reading and writing later on. Korean has a fairly simple alphabet, although it may seem strange to most English speakers at first because it is completely different than the Roman alphabet. [3] X Research source Hangeul was created during the Joseon Dynasty in 1443. Hangeul has 24 letters, consisting of 14 consonants and 10 vowels. However, if you include 16 diphthongs and double consonants, there are 40 letters in total. Korean also uses around 3,000 Chinese characters, or Hanja, to represent words of Chinese origin. Unlike Japanese Kanji, Korean Hanja are used in more limited contexts like academic writing, religious (Buddhist) texts, dictionaries, newspaper headlines, classical and pre-WWII Korean literature, and family names. In North Korea, the use of Hanja is almost non-existent. [4] X Research source"
    },
    {
      "title": "Learn to count.",
      "content": "Learn to count. Knowing how to count is an essential skill in any language. Counting in Korean can be tricky, as Koreans use two different sets of cardinal numbers, depending on the situation: Korean and Sino-Korean, which originated from Chinese and has some of its characters. [5] X Research source Use the Korean form for numbers of items (between 1 and 99) and age, e.g. 2 children, 5 bottles of beer, 27 years old. Ending consonants are not aspirated, meaning there is no ending breath at the end of the syllable. Here's how to count to ten in the Korean form [6] X Research source : One = 하나 pronounced \"hana\" Two = 둘 pronounced \"dul\" Three = 셋 pronounced \"set Four = 넷 pronounced \"ne(t)\" Five = 다섯 pronounced \"da-seo(t)\" Six = 여섯 pronounced \"yeo-seo(t)\" Seven = 일곱 pronounced \"il-gob\" Eight = 여덟 pronounced \"yeo-deolb\" Nine = 아홉 pronounced \"ahob\" Ten = 열 pronounced \"yeol\" Use the Sino-Korean form for dates, money, addresses, phone numbers, and numbers above 100. Here's how to count to ten in Sino-Korean [7] X Research source : One = 일 pronounced \"il\" Two = 이 pronounced \"ee\" Three = 삼 pronounced \"sam\" Four = 사 pronounced \"sa\" Five = 오 pronounced \"oh\" Six = 육 pronounced \"yug\" Seven = 칠 pronounced \"chil\" Eight = 팔 pronounced \"pal\" Nine = 구 pronounced \"gu\" Ten = 십 pronounced \"sib\""
    },
    {
      "title": "Memorize simple vocabulary.",
      "content": "Memorize simple vocabulary. The wider the vocabulary you have at your disposal, the easier it is to speak a language fluently. Familiarize yourself with as many simple, everyday Korean words as possible - you'll be surprised at how quickly they build up! When you hear a word in English, think about how you would say it in Korean. If you don't know what it is, jot it down and look it up later. It's handy to keep a little notebook on you at all times for this purpose. Attach little Korean labels to items around your house, such as the mirror, the coffee table and the sugar bowl. You'll see the words so often that you'll learn them without realizing it! [8] X Research source It is important to learn a word or phrase from ‘Korean to English’ as well as ‘English to Korean.’ That way you will remember how to say it, not just recognize it when you hear it."
    },
    {
      "title": "Learn some basic conversational phrases.",
      "content": "Learn some basic conversational phrases. By learning the basics of polite conversation, you'll very quickly be able to interact with Korean-speakers on a simple level. Try learning the words/phrases for: Hello = 안녕 pronounced \"anyeong\" (in a casual way) and \"anyeong-haseyo\" in a formal way. Yes = 네 pronounced \"ne\" in any situation where you would be speaking formally, or 응 \"eung\" if you're speaking with someone informally. No = 아니요 pronounced \"aniyo\" Thank you = 감사합니다 pronounced \"gam-sa-hab-nee-da\" My name is... = 저는 ___ 입니다 pronounced \"joneun ___ imnida\" but the sentence \"내 이름은 ___ 예요\" pronounced \"nae ileumeun ____yeyo\" can also be used. How are you? = 어떠십니까? pronounced \"otto-sib-nikka\" Pleased to meet you = 만나서 반가워요 pronounced \"mannaso bangawo-yo\" Goodbye when other party is staying = 안녕히 계세요 pronounced \"an-nyounghi kye-sayo\" Goodbye when other party or both of you are leaving = 안녕히 가세요 pronounced \"an-nyounghi ga-seyo\""
    },
    {
      "title": "Understand the forms of polite speech.",
      "content": "Understand the forms of polite speech. It is important to learn the difference between the degrees of formality in Korean speech. Korean differs from English in that verb endings change depending on the age and rank of the person being addressed, as well as the social setting. It is important to understand how speech formality functions, in order to properly navigate polite speech. There are three major types in the degrees of formality: Informal - Used to address people of the same age or younger, especially among close friends. Polite - Used to address people older than the speaker, a stranger, or a co-worker. It is used in formal social situations. Honorific - Used in very formal settings such as on the news or in the army. Rarely used in normal speech."
    },
    {
      "title": "Study basic grammar.",
      "content": "Study basic grammar. In order to speak any language correctly, it is necessary to study the grammar particular to that language. There are several distinct differences between English grammar and Korean grammar, for example: Korean uses the subject - object - verb order, and the verb always comes at the end of the sentence. In Korean, it is pretty common to omit the subject of a sentence when the subject being referred to is known by both the readers and the speakers. The subject of the sentence may be inferred from the context or may have been referred to in an earlier sentence. [9] X Research source In Korean, adjectives function like verbs in that they can be altered and may take on different forms to indicate the tense of a sentence. [10] X Research source"
    },
    {
      "title": "Work on your pronunciation.",
      "content": "Work on your pronunciation. Korean pronunciation is vastly different from English, and it takes a lot of practice to be able to pronounce words correctly. One of the major mistakes English speakers make is to assume that the pronunciation of Romanized Korean letters is identical to the same letter's pronunciation when speaking English. Unfortunately for language learners, this is not the case. It is best to not learn with romanization because it slows your learning. [11] X Research source In English, whenever a word ends in a consonant, the speaker always makes a little sound after saying that last letter. It is very faint and difficult to hear for a person with a ‘non-Korean ear’ to hear. For example, when an English speaker says “ship” there is a tiny sound of breath following the ‘p’ when their mouth opens. [12] X Research source In Korean, they do not have that final ‘breath’ sound, as they just keep their mouths closed. [13] X Research source"
    },
    {
      "title": "Don't be discouraged!",
      "content": "Don't be discouraged! If you're serious about learning to speak Korean, keep at it - the satisfaction you'll get from mastering a second language will far outweigh the difficulties you encounter along the way. Learning a new language takes time and practice, it won't happen overnight."
    },
    {
      "title": "Find a native speaker.",
      "content": "Find a native speaker. One of the best ways to improve your new language skills is to practice speaking with a native speaker. They will easily be able to correct any grammar or pronunciation mistakes you make and can introduce you to more informal or colloquial forms of speech that you won't find in a textbook. [14] X Research source If you have a Korean-speaker who is willing to help, that's great! Otherwise, you can place an ad in the local paper or online or investigate whether there are any pre-existing Korean conversation groups in the area. If you can't locate any Korean-speakers nearby, try finding one on Skype. They might be willing to exchange 15 minutes of Korean conversation for 15 minutes of English. Popular Korean messaging apps are a good way to practice, as well, because it will help you to learn more slang and to read Hangul quickly."
    },
    {
      "title": "Consider signing up for a language.",
      "content": "Consider signing up for a language . If you need some extra motivation or feel you would learn better in a more formal setting, try signing up for a Korean language course. Look out for language courses advertised at local colleges, schools or community centers. If you're nervous about signing up for a class by yourself, drag a friend along. You'll have more fun and also someone to practice with between classes!"
    },
    {
      "title": "Watch Korean films and cartoons.",
      "content": "Watch Korean films and cartoons. Get your hands on some Korean DVDs (with subtitles) or watch Korean cartoons online. This is an easy, entertaining way to get a feel for the sound and structure of the Korean language. If you're feeling particularly proactive, try pausing the video after a simple sentence and repeat what has just been said. This will lend your Korean accent an air of authenticity! If you can't find any Korean films to buy, try renting them from a movie rental store, which often have foreign language sections. Alternatively, see if your local library has any Korean films or ask if they would be able to source some for you."
    },
    {
      "title": "Find apps designed for Korean children.",
      "content": "Find apps designed for Korean children. Translate \"learn the alphabet\" or \"games for babies and/or children\" into Korean and then cut and paste the Hangeul Korean results into the app store search bar. The apps are simple enough for a child to use; so, you don't need to read or speak Korean to operate the app. It is also less expensive than buying DVDs. The apps teach the right way to write Korean letters; and, most have song and dance routines; also, there are puzzles and games to learn common everyday Korean vocabulary. Be careful not to buy an app that is for Korean children to solely learn English."
    },
    {
      "title": "Listen to Korean music and radio.",
      "content": "Listen to Korean music and radio. Listening to Korean music and/or radio is another good way to surround yourself in the language. Even if you can't understand everything, try to pick out keywords to help you get the gist of what's being said. Korean pop music is sang primarily in Korean, but some English words are sprinkled in too. Fans will often write out English translations, so you can understand the message of the song. Get a Korean radio app on your phone, so you can listen on the go. Try downloading Korean podcasts to listen to while exercising or doing housework."
    },
    {
      "title": "Consider taking a trip to South Korea.",
      "content": "Consider taking a trip to South Korea. Once you feel comfortable with the basics of Korean speech, consider taking a trip to Korea. What better way to immerse yourself in the Korean language than a journey to its native land!"
    }
  ]
}