{
  "url": "https://www.wikihow.com/Use-Computer-Headphones",
  "title": "How to Use Computer Headphones",
  "steps": [
    {
      "title": "Locate the headphone jack on your computer or speakers.",
      "content": "Locate the headphone jack on your computer or speakers. The location will vary depending on the computer you are using. Most laptops have headphone jacks along one of the sides. Desktops may have a jack on the front or back of the computer. It will typically have a small headphone icon. If the headset prong is color-coded, it will be green. [1] X Research source If you're using a desktop computer, your speakers may have a headphone jack if your computer does not. If your headphones connect via USB, click here."
    },
    {
      "title": "Plug the headphones firmly into the headphone jack.",
      "content": "Plug the headphones firmly into the headphone jack. Make sure that the plug is completely inserted, or the sound may not come through both ears. If your headphones use a 1/4 inch (6.3 mm) plug, typically found on professional and studio headphones, you'll need an adapter, a sound card , or an amplifier in order to use them."
    },
    {
      "title": "Locate the microphone jack (optional).",
      "content": "Locate the microphone jack (optional). If you headphones include a microphone, it will usually have a separate prong. If the prong is color-coded, it will be pink. The microphone jack on the computer is typically located near the headphone jack. Older computer's may not have a microphone jack. If this is the case, you'll need a sound card or other digital processor ."
    },
    {
      "title": "Plug the headphone's USB plug into your computer.",
      "content": "Plug the headphone's USB plug into your computer. Make sure to plug it directly into your computer, and not into a USB hub."
    },
    {
      "title": "Switch audio outputs (if necessary).",
      "content": "Switch audio outputs (if necessary). Usually when you plug your USB headphones into your computer, it will automatically switch so that audio plays through the headphones. This doesn't always happen however, and you may have to manually make the switch. If you have a program currently playing audio, it may continue playing on the speakers after you switch to headphones. Windows - Right-click on the Volume button in your system tray and select \"Playback devices\". Select your headphones from the list, click Set default and then Apply . Mac - Hold the ⌥ Opt key and click the Volume button in the Menu bar. Select your headphones from the list of devices."
    },
    {
      "title": "I can only hear audio out of one side.",
      "content": "I can only hear audio out of one side. This is typically caused by the headphone jack not being properly inserted. The jack will need to be inserted all the way in order for the headphones to play from both ears. [2] X Research source Examine the cables on the headphones as well. Frayed cables could be causing problems with the headphones. Cables will typically start fraying near the connectors."
    },
    {
      "title": "I'm not hearing any audio at all.",
      "content": "I'm not hearing any audio at all. If your headphones aren't picking up any audio, but you know that they work on other devices, something may be wrong with your computer's sound processor. Click here for instructions on troubleshooting Windows sound issues . Click here for instructions on troubleshooting Mac sound issues ."
    },
    {
      "title": "My headset isn't being recognized when I plug it in.",
      "content": "My headset isn't being recognized when I plug it in. This may be caused by a few different issues: Try plugging the headset into a different USB port. If it works, then the first USB port you tried is likely malfunctioning. Visit the headset manufacturer's website and download the drivers for the headset. Windows may be having difficulty find the software on its own."
    },
    {
      "title": "Determine if you need an amplifier.",
      "content": "Determine if you need an amplifier. Amplifiers are designed to provide more power to your headphones. Different situations may require different amplifier setups. [3] X Research source Earbuds and small headphones likely will not benefit from an amplifier. Noise-canceling headphones also do not benefit from an amp, as they have built-in to handle the noise-canceling feature. Professional and studio headphones may require an amp in order to hear at acceptable levels if they are \"high-impedance\" headphones. These headphones require more power in order to output at suitable volumes. Portable users with over-the-ear headphones will benefit from a pocket amp, while desktop users will benefit from an amp with a built-in digital-to-analog converter (DAC)."
    },
    {
      "title": "Use a portable amplifier for your portable MP3 player.",
      "content": "Use a portable amplifier for your portable MP3 player. If you have a set of good, over-the-ear headphones, you'll get better sound out of your MP3 player if you use a portable headphone amplifier. These are small devices that you charge at home. DACs do not benefit portable players, so don't use an amplifier/DAC combo. Plug the amplifier into the headphone jack of your portable MP3 player, and then plug the headphones into the amplifier. Adjust the volume through the amplifier. Raise the volume on your MP3 to a few notches below maximum, and then use the amplifier to adjust the volume to a comfortable level. This will provide the best quality sound."
    },
    {
      "title": "Use an amplifier and DAC on your computer for high-quality headphones.",
      "content": "Use an amplifier and DAC on your computer for high-quality headphones. An amplifier will provide more power to your headphones, allowing for a better range of volumes. The DAC (digital-to-analog converter) is what translates the digital audio into an analog signal that the headphones can play. All computers have a DAC built-in to the motherboard, and a sound card acts as a DAC as well. These built-in DACs are usually sufficient for most basic uses, but you'll want an external one if you listen to loss-less music or do audio editing on the computer. If you are using an external DAC, you'll get the best quality by connecting it to your motherboard using an S/PDIF (TOSLINK) cable. If your motherboard doesn't support this, you can connect most DACs using USB. If you need surround sound processing for video games, you'll be better off with an internal sound card instead of a DAC. If your amplifier and DAC are separate, connect the DAC to your computer, the amplifier to the DAC, and then your headphones to the amplifier."
    }
  ]
}