{
  "url": "https://www.wikihow.com/Write-a-Tutorial",
  "title": "How to Write a Tutorial",
  "steps": [
    {
      "title": "Find a problem to fix.",
      "content": "Find a problem to fix. If there is something that you are interested in or that you want to know how to do, it is likely that it is on someone else’s mind too. Brainstorm some interesting topics to write about."
    },
    {
      "title": "Research existing tutorials",
      "content": "Research existing tutorials . If you really want your tutorial to be read, it is best to pick a topic that hasn’t been written about too often. Look online for existing tutorials and see what you will be competing with. [1] X Research source Alternatively, you can use a different perspective or put a different spin on a subject that has existing tutorials. The more specific you make it, the less likely there are to be duplicates. For instance, write a tutorial about making brownies with peanut butter cups in the batter as opposed to a tutorial on making brownies."
    },
    {
      "title": "Narrow your topic.",
      "content": "Narrow your topic. If your topic is too broad, you will find it difficult to cover everything important. Many people will lose interest because they need to wade through material that isn’t relevant to what they are interested in. If you have a broad topic, try to think about a way to define it more narrowly. For example, instead of writing a tutorial on how to use Microsoft Word, write a tutorial on how to insert chapter breaks in a Word document."
    },
    {
      "title": "Keep it short and simple.",
      "content": "Keep it short and simple. Don’t use big words or go off on irrelevant tangents. Be sure that the reader can quickly skim the article and get the point. [2] X Research source For example, if you are writing a tutorial on how to clean up a stain simply say “apply dishwashing soap to rag.” Do not give the chemical name for the type of soap and go through a list of alternative soaps and why they don’t work as well."
    },
    {
      "title": "Describe each step thoroughly.",
      "content": "Describe each step thoroughly. Don't skimp on the details. Describe each step as clearly and precisely as possible. Don’t leave anything to the imagination. [3] X Research source"
    },
    {
      "title": "Write instructions in a friendly tone.",
      "content": "Write instructions in a friendly tone. Pretend that you are having a conversation with a friend. Try not to sound like you are talking down to the reader or that you believe you are smarter than them. Make your writing seem natural; like something you would say out loud when speaking to someone. Keep your audience in mind—it is likely someone trying to learn about the topic. Say something like “write useful notes in the margin” instead of “enumerate analytical and thematic observations on adjacent pieces of the text.” Avoid using technical jargon unless you are defining a term."
    },
    {
      "title": "Credit your sources.",
      "content": "Credit your sources. Some of the material in your tutorial may be protected by a copyright . If you use images, information, or other materials from another source, then you will need to credit that source. Otherwise you may be violating copyright laws, not to mention the ethical implications of taking credit for someone else's work, images, and/or ideas."
    },
    {
      "title": "Include images or videos.",
      "content": "Include images or videos. It will be a lot easier to follow your directions if you have pictures or videos that show what you are doing. Screenshots are often good illustrations. Try to have an image for each step. To take screenshots press Print screen and Ctrl. You can clean them up in a photo editing software program like Photoshop or Gimp . Some programs will allow you to write additional directions on the image. With these you can, for example, point to a particular button the reader should press. You can use programs like Camtasia or an open source program like Camstudio to make a video. If you are filming a video tutorial, show your audience more than just your face. Include some screen shots, pictures, or images of you physically performing the task that will help your viewer conceptualize the process. [4] X Research source"
    },
    {
      "title": "Provide multiple methods.",
      "content": "Provide multiple methods. It is good to list several ways to do things. That way, if people have trouble with one method, they have other options. Make it clear how to complete the given task using each method."
    },
    {
      "title": "Give examples.",
      "content": "Give examples. For less concrete topics, it can be important to give examples that will make what you are saying clearer. Don’t, however, let your article become overburdened with examples so that it becomes long or bulky. If, for example, you are writing a tutorial about how to introduce yourself to new people, you could provide several examples of specific things you could say to break the ice."
    },
    {
      "title": "Explain why the subject matters.",
      "content": "Explain why the subject matters. People are more likely to read your tutorial if they know what it can do for them. In the introduction, explain the benefits of learning the skill. If, for example, you are explaining a photo processing program, tell the reader some of the fun things it can do with pictures."
    },
    {
      "title": "Record video tutorials in a quiet spot.",
      "content": "Record video tutorials in a quiet spot. If you are doing a video tutorial, be sure to record it some place with few distractions. A basement, far removed from the sound of nearby traffic, is ideal. [5] X Research source"
    },
    {
      "title": "Speak clearly and slowly.",
      "content": "Speak clearly and slowly. For any audio and visual tutorials, it is important that you not speak fast. The slower that you speak, the easier it is for your viewers to understand you. Clearly enunciate your words. [6] X Research source"
    },
    {
      "title": "Write a title.",
      "content": "Write a title. The title should clearly describe what the tutorial is about. It should be brief and precise, while also avoiding “clickbait.” Consider the title “How to insert page numbers in Microsoft Word.” If you left out “Microsoft Word,” the title would not be precise enough and the reader wouldn’t know which program you were working with. Consider the title “How to insert footnotes, endnote, references, and citations in Microsoft Word.” Footnotes and endnotes are all types of references and simply be labeled references. So, for a brief title, you would write “How to insert references in Microsoft Word.”"
    },
    {
      "title": "Write an introduction.",
      "content": "Write an introduction. Write a quick paragraph in which you clearly tell the reader what you are writing about. Explain to them why this subject will be useful. Try to get them excited. It can help to include a picture of the finished product at the end of the introduction. If you give the reader some idea of what they’re working toward, you’re more likely to get them excited about the tutorial."
    },
    {
      "title": "Include clear steps.",
      "content": "Include clear steps. Each step should be clear and brief. Try to include a picture that illustrates each step. Do not leave anything to the imagination."
    },
    {
      "title": "Split up complicated steps.",
      "content": "Split up complicated steps. If you find that the step is getting overly long or complicated, ask whether it would be better to split up into two separate steps. You should be able to summarize the gist of each step in a sentence. It is better to have multiple short steps than one long one. [7] X Research source Keep the chronological order of the steps in mind and make it clear to the reader if multiple steps should occur at the same time."
    },
    {
      "title": "Practice what you preach.",
      "content": "Practice what you preach. After you finish, try following your own tutorial. Perform each step. Ask yourself if there was anything you needed to do to finish the project that wasn’t included in the step. If so, add that step to your tutorial."
    },
    {
      "title": "Write an FAQ section.",
      "content": "Write an FAQ section. A “frequently asked questions” (FAQ) section can be a good way to add more information without interrupting the flow of your steps. Consider if there are any terms or subjects that you discuss in the tutorial that might not be obvious to all readers. If so, discuss this in the FAQ section. For example, if your task involves using a computer program the reader might not be familiar with, you can use the FAQ section to point to them where they can download the program. [8] X Research source Ask someone to follow your tutorial and see if they have any questions at the end. If they do, include the questions and answers in the FAQ section."
    },
    {
      "title": "Follow the same outline for video tutorials.",
      "content": "Follow the same outline for video tutorials. Even if you are recording a video tutorial, you need to have a draft written out. If you wing it, you will likely go off topic. As with a written tutorial, you should have an introduction and several clearly defined steps. You might want to do a conclusion, summarizing problems or explaining questions your audience might have. [9] X Research source"
    },
    {
      "title": "Think about your audience as you review the tutorial.",
      "content": "Think about your audience as you review the tutorial. Who is your audience? Is the tutorial meant for beginners or for advanced users? Consider what additional information your audience might need to understand your tutorial."
    },
    {
      "title": "Reread and edit your article.",
      "content": "Reread and edit your article. Even the best writer needs to read a piece several times over to catch all their errors. Try to set the article aside for a few days and then go over it again so that you can look at it with fresh eyes. [10] X Research source Check for the basics, like spelling and grammar. Make sure the tutorial flows logically and is easy to understand. Consider having another person look at your tutorial to see if they can spot typos. They can also tell you if there is anything else you need to add to the tutorial to make it clearer."
    },
    {
      "title": "Publish your tutorial.",
      "content": "Publish your tutorial. You can publish your tutorial on your website, wikiHow, or on your blog. If you made a video tutorial you can upload it on YouTube ."
    },
    {
      "title": "Keep on revising.",
      "content": "Keep on revising. Just because your tutorial is published doesn’t mean that you are done. Once you get comments, it should be clear that there are more ways to improve on your article. Pay attention to comments and consider where you can add or subtract to the tutorial to answer readers’ concerns. [11] X Research source"
    }
  ]
}