{
  "url": "https://www.wikihow.com/The-Penny-Method-Dating",
  "title": "What Is the Penny Method in Dating?",
  "steps": [
    {
      "title": "In the penny method, one person slowly reduces the amount of affection they give to their partner.",
      "content": "In the penny method, one person slowly reduces the amount of affection they give to their partner. Sometimes called “penny dating” or the “piggy bank method,” the penny method involves one romantic partner slowly cutting back on the amount of time and affection they give to their significant other. The main idea behind the penny method is that the amount of attention decreases steadily over time—so, the relationship starts with them investing 100% of their energy, but they then slowly reduce that amount over the course of the relationship. [1] X Research source The idea of the penny method was first popularized in a viral TikTok video by influencer Erika Tham . In her post, Tham explains that, to understand the method, you should first “imagine a girl as a piggy bank. In order to get her interested, you have to put in $100 bills at first.” [2] X Research source “But putting in $100 bills is a lot of work and you don’t always want to be doing that,” Tham continues to explain in her video. “Eventually, you reduce them to $90.” [3] X Research source As Tham goes on to describe, the girl (or partner) will definitely feel this reduction in effort, but will “sound crazy” if she tries to bring it up because it’s only 10% less than what was given before. [4] X Research source Then, the penny-methoding partner will bump their effort back up to 95% (or $95, following the piggy bank analogy). Their significant other will then feel like they’ve gained 5% or $5 from their partner, but they’ve actually lost 5% or $5 from their partner’s initial effort. This cycle continues, with one person gradually weaning their partner off of their energy and effort until they’re so accustomed to the bare minimum (aka, pennies ) that they’d be excited to receive a nickel or dime."
    },
    {
      "title": "Love bombing",
      "content": "Love bombing If you’re dating someone who starts off the relationship with an intense amount of affection, they may be a love bomber . Look out for anyone who’s immediately showering you with gifts or making sweeping declarations like “I think this is love” or “we’re meant to be together” when it’s too early in the relationship for those statements to be realistic. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source In some cases, these grand gestures may be inauthentic and may be being used as a way to win you over and influence your personal feelings, rather than giving you the chance to get to know this other person authentically and determine your own emotions."
    },
    {
      "title": "Reduction in effort",
      "content": "Reduction in effort Sometimes, strong feelings at the beginning of a relationship may be genuine—rather than a form of love bombing. But if you notice a reduction in effort after the love bombing period, however, that’s a strong sign that there’s manipulation happening. If someone you’re dating is coming on super strong at the beginning and then begins to pull back their affection, they may be employing the penny method. [6] X Research source This sign is especially incriminating if there’s no communication about the pullback in effort so you’re left feeling confused. If someone has a valid reason for reducing their energy, like being ill or facing a life challenge, then there may be more room for interpretation here. Keep in mind that a healthy relationship should progress in the opposite way—it begins with a small spark and two people just beginning to get to know each other. As time goes on and feelings grow, the amount of energy and time dedicated to one another should be growing, not shrinking. [7] X Trustworthy Source New York State Government Official website for the State of New York Go to source"
    },
    {
      "title": "Rollercoaster-like behavior",
      "content": "Rollercoaster-like behavior The give-and-take nature of the penny method may feel like an emotional rollercoaster when you’re on the receiving end of it. On good days, you may feel like everything is going really well, that this person really likes you, and that you’re blissfully happy in the budding relationship. On bad days (or weeks), however, you may get little communication from your romantic interest or stop hearing from them altogether. [8] X Research source They may even come back with an excuse like “I was busy at work” or “a family member was ill” to test how much of this behavior you’re willing to take. Of course, there’s an argument that people do get busy at work and relatives do get ill. While it is true that someone may have to take a step back due to crises happening in their lives, it’s not too much to expect that they at least check in with you and let you know what’s going on…before dropping off the face of the Earth for a week or more."
    },
    {
      "title": "Simultaneous manipulative behaviors",
      "content": "Simultaneous manipulative behaviors Look for any other manipulative behaviors , as these things rarely happen in isolation. If someone is trying to “penny method” you, then it’s highly likely that they’re trying to influence or control you in other ways. Be wary of other manipulative tendencies like: [9] X Research source Lying, denying, or attempting to deceive you. Unwarranted crying outbursts or fits of rage. Withholding affection or communication when they don’t get their way. Giving guilt trips, ultimatums, or the “silent treatment” to get their way. Doling out unkind judgements, ridicule, or criticism (coupled with “just kidding” even when the jokes are clearly aggressive or cruel). Minimizing your feelings or rationalising their own bad behaviors, e.g., “I don't know what you're talking about. You must have imagined it.”"
    },
    {
      "title": "The penny method is extremely toxic and harmful to relationships.",
      "content": "The penny method is extremely toxic and harmful to relationships. The very basis of the penny method is manipulative and cruel, and it can severely impact the relationship itself and the receiving person’s sense of self-worth. It’s nearly impossible to have a healthy relationship after it’s begun with or involves the penny method—in most cases, the relationship will either end or continue down a path of emotional abuse and manipulation. [10] X Research source A victim of this method may feel confused and filled with self-doubt throughout the relationship, and these feelings may even affect their sense of reality in future relationships."
    },
    {
      "title": "There are many reasons for using the penny method, including an unhealthy attachment style.",
      "content": "There are many reasons for using the penny method, including an unhealthy attachment style. Every individual is different, and there are a lot of complex psychological possibilities behind why someone might use a manipulative tactic such as the penny method. On one end of the spectrum are people who use it simply because they enjoy the thrill of the chase in dating, but end up bored when the other person returns their energy and interest. [11] X Research source These people may not be ill-intentioned or even conscious of what they’re doing, but their actions are definitely hurtful and harmful. Others may use the penny method as a form of self-protection due to an unhealthy attachment style . They’re scared of getting hurt or rejected themselves, so they’ll test their partner’s limits to see how much they’ll put up with before ending the relationship. [12] X Research source These individuals may or may not consciously realize the manipulative and mutually harmful behaviors they’re resorting to in order to protect themselves. Finally, some individuals who use the penny method may do so as a way to maintain their “roster” or keep multiple potential mates within their grasp at all times. Rather than committing themselves to one relationship, they’re giving the bare minimum to many so that they’ll always have someone on the back burner."
    },
    {
      "title": "",
      "content": "The penny method (as well as other toxic dating patterns) is harmful to both parties in a relationship—including the person playing these manipulative games! As long as the penny method is being used, neither individual will be able to build a trusting and healthy romantic connection. It can take a lot of time, energy, and self-improvement to build a healthy relationship , but here are some key tips to help you get there: [13] X Research source Communicate with your partner . Instead of playing games or testing your partner, let them know what you need and what you’re able to give. Talk openly with one another and work as a team to strengthen your bond . Walk away if you’re not feeling it—but don’t ghost. It’s okay to realize that you’re not interested in continuing a relationship with someone for whatever reason—but you need to end things there and then in order to avoid stringing someone else along. But don’t ghost them! Just say something like, “Hey, you’re great, but I just don’t see a long-term relationship here.” Walk away if you feel like you’re being manipulated. If you think you’re dating someone who’s using the penny method or is otherwise behaving in a toxic way , you should strongly consider leaving the situation. Then, you may want to do some soul-searching and consider why you allowed that type of behavior to happen in order to avoid repeating history—however, you should absolutely not blame yourself for your ex’s behavior. [14] X Research source"
    },
    {
      "title": "",
      "content": "Dating just seems to get more and more complex, especially with TikTok and other social media sources making “therapy speak” and relationship-related buzzwords more widely known and popularized. As a result, you may have begun to hear some of the following dating terms thrown around more often, so you can use this cheat sheet to understand exactly what’s going on in your (or everyone else’s) love life: [15] X Research source Situationship : An informal or unestablished romantic and sexual relationship. Love Bombing : The act of lavishing someone with affection in order to manipulate them in the early stages of a relationship. Ghosting : The act of ending a personal relationship suddenly and without any explanation or communication. Mixed Signals : A term referring to someone’s thoughts and feelings being inconsistent or a misalignment between their actions and words. Taxi Cab Theory : A theory hypothesizing that men date like taxi cabs—when they’re ready to settle down, their light goes on, and they’ll commit to the next girl they date. If their light isn’t on yet, they’re unlikely to settle down even with their perfect woman."
    }
  ]
}