{
  "url": "https://www.wikihow.com/Survive-a-Nuclear-Attack",
  "title": "How to Survive a Nuclear Attack",
  "steps": [
    {
      "title": "Make a plan.",
      "content": "Make a plan. If a nuclear attack does happen, it won't be safe to venture outside for food — you should stay sheltered for at least 48 hours, preferably longer. Having food and medical supplies on-hand can put your mind at-ease, and allow you to focus on other aspects of survival."
    },
    {
      "title": "Stock up on non-perishable food.",
      "content": "Stock up on non-perishable food. Non-perishables can last several years, whether it's in storage or in sustaining you after an attack. Choose items that contain a lot of carbohydrates, so you get more caloric bang for your buck, and store them in a cool, dry place. [2] X Research source White rice Wheat Beans Sugar Honey Oats Pasta Powdered milk Dried fruits and vegetables Build your supply slowly. Every time you go to the grocery store, pick up one or two more items for your food storage. Eventually, you should be able to build up a multi-month supply. Make sure you have a can opener for canned items."
    },
    {
      "title": "Store water",
      "content": "Store water . Consider keeping a water supply in food-grade plastic containers. Clean the containers with a bleach solution, then fill them with filtered and distilled water. [3] X Research source Aim to have one gallon per person per day. For purifying water in the event of an attack, keep basic household bleach and potassium iodide (Lugol's solution) on-hand."
    },
    {
      "title": "Get communication supplies.",
      "content": "Get communication supplies. Being able to stay informed , as well as alerting others to your position, can be vitally valuable. Here's what you might need: [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source A radio: Try to find one that's crank- or solar-powered. If you have to go with a battery-operated model, be sure to keep spare batteries on-hand. Consider getting an NOAA weather radio as well — this will broadcast emergency information 24 hours a day. [5] X Research source A whistle: You can use this to signal for help. Your cell phone: Cell service may or may not be maintained, but you'll want to be ready if it is. If you can, find a solar charger for your model."
    },
    {
      "title": "Stock up on medical supplies.",
      "content": "Stock up on medical supplies. Having a few medical items available could be the difference between life and death if you're injured in the attack. You'll need: A basic first aid kit : You can purchase these pre-packaged, or make one yourself. You'll need sterile gauze and bandages, antibiotic ointment, latex gloves, scissors, tweezers, a thermometer and a blanket. [6] X Research source A first aid instruction booklet: Purchase one from an organization like the Red Cross, or assemble your own with materials you print off from the internet. You should know how to bandage wounds, administer CPR, treat shock, and treat burns. Prescription medications or supplies: If you take a specific medication every day, try to make sure you have a small emergency supply built-up."
    },
    {
      "title": "Get other miscellaneous items.",
      "content": "Get other miscellaneous items. Round out your emergency preparedness kit with the following: A flashlight and batteries Dust masks Plastic sheeting and duct tape Garbage bags, plastic ties and wet wipes for personal sanitation A wrench and pliers, to shut off utilities such as gas and water"
    },
    {
      "title": "Keep an eye on the news.",
      "content": "Keep an eye on the news. A nuclear attack will unlikely come out of the blue from an enemy nation. Such an attack would likely be preceded by a deteriorating political situation. A war with conventional weapons between nations that both have nuclear weapons, if not ended swiftly, may escalate towards nuclear war ; and even limited nuclear strikes in one region carry the likelihood to escalate towards an all-out nuclear war elsewhere. Many countries have a rating system to denote the imminence of attack. In the USA and Canada, for example, it may be useful to know the DEFCON ( DEF ense CON dition) level. [7] X Research source"
    },
    {
      "title": "Assess your risk and consider evacuation if a nuclear exchange is looking likely.",
      "content": "Assess your risk and consider evacuation if a nuclear exchange is looking likely. If evacuation is not an option, then it should at least affect the kind of shelter you will construct for yourself. Learn your proximity to the following targets and plan appropriately: [8] X Research source Airfields and naval bases, especially those known to house nuclear bombers, ballistic missile submarines, or ICBM silos. These are certain to be attacked even in a limited nuclear exchange. Commercial ports and runways over 10,000 feet (3,048 meters) long. These are likely to be attacked even in a limited nuclear exchange, and certain to be attacked in an all-out nuclear war. Centres of government. These are likely to be attacked even in a limited nuclear exchange and certain to be attacked in an all-out nuclear war. Large industrial cities and major population centres. These are likely to be attacked in the event of an all-out nuclear war."
    },
    {
      "title": "Learn about the different types of nuclear weapons:",
      "content": "Learn about the different types of nuclear weapons: [9] X Research source Fission (A-Bombs) are the most basic nuclear weapon and are incorporated into the other weapon classes. This bomb's power comes from splitting heavy nuclei (plutonium and uranium) with neutrons; as the uranium or plutonium split each atom releases great amounts of energy - and more neutrons . The daughter neutrons cause an extremely fast nuclear chain reaction. Fission bombs are the only type of nuclear bomb used in war so far. This is the most likely type of bomb to be used by terrorists. Fusion (H-Bombs), using the incredible heat of a fission bomb 'spark plug', compress and heat deuterium and tritium (isotopes of hydrogen) which fuse, releasing immense amounts of energy. Fusion weapons are also known as thermonuclear weapons since high temperatures are required to fuse deuterium and tritium; such weapons are usually many hundreds of times more powerful than the bombs that destroyed Nagasaki and Hiroshima. The bulk of the US and Russian strategic arsenal are these types of bombs."
    },
    {
      "title": "Seek shelter immediately.",
      "content": "Seek shelter immediately. Aside from the geopolitical warning signs, your first warnings of an imminent nuclear attack will most likely be an alarm or warning signal; if not, it will be the blast itself. The bright light from a detonation of a nuclear weapon can be seen tens of miles away from ground zero. If within the vicinity of the blast (or ground zero), your chances of survival are virtually nonexistent unless you are in a shelter that provides a very (VERY) good blast protection. If you are a few miles out, you will have about 10-15 seconds until the heat wave hits you, and maybe 20-30 seconds until the shock wave does. Under no circumstances should you look directly at the fireball. On a clear day, this can cause temporary blindness at very large distances. [14] X Research source Ehrlich 1985, p. 167, gives a distance of 13 miles on a clear day and 53 miles on a clear night for a one-megaton weapon. However, the actual damage radius is highly variable depending on the size of the bomb, the altitude of the explosion, and even the weather conditions at the time of the blast. [11] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source If you can't find shelter, seek a depressed area nearby and lay face down, exposing as little skin as possible. If there is no shelter of this kind, dig as fast as possible . Even around 8 kilometers (5 miles) you will suffer third degree thermal-burns; still at 32 kilometers (20 miles) the heat can burn the skin off your body. The wind itself will peak at around 960 kilometers per hour (600mph) and will level anything or anybody caught in the open. Failing the above options, get indoors, if, and only if, you can be sure that the building will not suffer significant blast and heat damage. This will, at least, provide some protection against radiation. Whether this will be a viable option depends on the construction of the building and how close you will be to the likely ground zero of a nuclear strike. Stay well away from any windows, preferably in a room without one; even if the building does not suffer substantial damage, a nuclear explosion will blow out windows at enormous distances. For an example, one (albeit abnormally large) nuclear test in the Novaya Zemlya archipelago in Russia was known to knock out windows in Finland and Sweden. If residing in Switzerland or Finland, check if your home has an atomic shelter . If not, determine where your village/town/district atomic shelter is and know how to get there. Remember: anywhere in Switzerland, you'll be able to find an atomic shelter. When the sirens sound in Switzerland, you are advised to inform those who may not be able to hear it (e.g. the deaf ) and then listen to the National Radio Services (RSR, DRS and/or RTSI). Don't be surrounded by anything flammable or combustible. Substances like nylon or any oil based material will ignite from the heat."
    },
    {
      "title": "Remember that radiation exposure could cause large numbers of deaths.",
      "content": "Remember that radiation exposure could cause large numbers of deaths. [12] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Initial (prompt) radiation. This is radiation released at the moment of detonation, and it is short-lived and travels short distances. With the large yields of modern nuclear weapons, it is thought that this will kill few who would not be killed by the blast or heat at the same distance. [17] X Research source Ehrlich, p. 175; Langford, p. 106. For, unlike the blast and heat effects, the prompt radiation dose received decreases in relation to the square of the distance from the blast. Ehrlich points out that a 100 kt weapon would only give 1/500th the lethal dose of radiation at the 5 psi overpressure distance. Residual radiation. Known as radiation fallout . If the detonation was a surface blast or the bomb hits the earth, large amounts of fallout are produced. The dust and debris kicked into the atmosphere rains down, bringing with it dangerous amounts of radiation. The fallout may rain down as contaminated black soot known as \"black rain,\" which is very fatal and may be of extreme temperature. Fallout will contaminate anything it touches. Once you have survived the blast and the initial radiation (for now at least; radiation symptoms have an incubation period), you must find protection against fallout."
    },
    {
      "title": "Know the three different types:",
      "content": "Know the three different types: [14] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Alpha particles. These consist of 2 protons and 2 neutrons (a helium nucleus) ejected at high speed from the nucleus of a decaying atom. Alpha particles are stopped by the outer layer of your skin or a few centimeters of air. They present a minimal threat outside your body. However, alpha-emitting materials can do serious damage if ingested or inhaled. Beta particles: These consist of a high-speed electron, again ejected from the nucleus of a decaying atom. They are more penetrating than alpha particles and may cause \"Beta burns\" if materials are in direct contact with the skin for prolonged periods of time. These burns are similar to sunburn . Gamma rays: Gamma rays are the most penetrating of the three main types of radiation. They will penetrate any kind of clothing and requires large masses of materials for shielding. Therefore gamma radiation will cause severe damage to the body even when outside the body. A shelter's PF against radiation will tell you how many times less a person inside the shelter will receive radiation compared to open space. For example, PF 300 means that you will receive 300 times less radiation in the shelter than in the open. Avoid exposure to Gamma radiation. Try not to spend more than 5 minutes exposed."
    },
    {
      "title": "Begin reinforcing your shelter from the inside by stacking dirt around the walls or anything else you can find.",
      "content": "Begin reinforcing your shelter from the inside by stacking dirt around the walls or anything else you can find. If in a trench, then create a roof, but only if materials are nearby; don't expose yourself when not necessary. Canvas from a parachute or tent will help stop fallout debris from piling on you, though it will not stop Gamma rays. It is impossible, at a very fundamental physical level, to completely shield from all radiation. It can only be reduced to a tolerable level. Use the following to help you determine the amount of material you'll need to reduce radiation penetration to 1/1000: [19] X Research source Wiseman, p. 280. Steel: 21 cm (0.7 feet) Rock: 70-100 cm (2-3 ft) Concrete: 66 cm (2.2 ft) Wood: 2.6 m (8.8 ft) Soil: 1 m (3.3 ft) Ice: 2 m (6.6 ft) Snow: 6 m (20-22 ft)"
    },
    {
      "title": "Plan on staying in your shelter for a minimum of 48 hours (2 days).",
      "content": "Plan on staying in your shelter for a minimum of 48 hours (2 days). Under no circumstances leave the shelter in the first forty-eight hours. [20] X Research source Wiseman, p. 280. The reason for this is to avoid the \"fission products\" created by a nuclear blast. The other major products of nuclear fission are Cesium and Strontium. These have longer half lives of 30 years and 28 years respectively. They also are very well absorbed by living things and can make food products dangerous for decades. These materials can be carried by the wind thousands of miles, so if think you are safe in a remote area, you are not."
    },
    {
      "title": "Ration your supplies.",
      "content": "Ration your supplies. You will need to ration to survive, obviously; therefore you will eventually expose yourself to the radiation (unless you are in a specific shelter with food and water). Processed foods are okay to eat, so long as the container has no punctures and is relatively intact. Animals may be eaten, but they must be skinned carefully with the heart, liver and kidneys discarded. Try not to eat meat that is close to the bone, as bone marrow retains radiation. How to Eat Dove or Pigeon How to Eat Wild Rabbit Plants in a \"hot zone\" are edible; those with edible roots or undergrowth (such as carrots and potatoes) are highly recommended. Use an edibility test on the plants. See How to Test if a Plant Is Edible . Open water may have received fallout particles and is harmful. Water from an underground source, such as a spring or covered well, is your best bet. (Consider making a basic pit-style solar still, as described in How to Make Water in the Desert .) Use water from streams and lakes only as a last resort. Create a filter by digging a hole about 1 foot from the bank and drawing the water which seeps in. It may be cloudy or muddy so allow the sediments to sit, then boil the water to ensure safety from bacteria. If in a building, the water is usually safe. If there is no water (there most likely won't be), use the water already in the pipes by opening the faucet at the highest point of the house to let in air, then open a faucet at the lowest point of the house to drain the water. See also How to Get Emergency Drinking Water from a Water Heater ."
    },
    {
      "title": "Wear all clothing (hats, gloves, goggles, closed sleeve shirt, etc.",
      "content": "Wear all clothing (hats, gloves, goggles, closed sleeve shirt, etc. ), especially when outside, to help prevent Beta burns. Decontaminate by shaking your clothes constantly and washing, with water, any exposed skin; settled residue will eventually cause burns."
    },
    {
      "title": "Treat radiation",
      "content": "Treat radiation and thermal burns. [17] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Minor burn: Also known as a Beta burn (though it may be from other particles). Immerse Beta burns in cold water until the pain subsides (usually 5 minutes). If skin starts to blister, char or break, wash it with cold water to remove contaminants, then cover with a sterile compress to prevent infection. Do not break the blisters! If the skin does not blister, char or break, don't cover it, even if it covers a large portion of the body (almost like sunburn). Instead, wash the area and cover it with petroleum jelly or a solution of baking powder and water, if available. Moist (uncontaminated) earth will also do. Severe burn: Known as a thermal burn, as it comes mostly from the high intensity blast heat, rather than ionizing particles, though it can be from the latter. This can be life threatening; everything becomes a factor: water loss, shock , lung damage, infection, etc. Follow these steps to treat a severe burn. Protect burns from further contamination. If clothing covers the burn area, gently cut and remove the cloth from the burn. DO NOT try to remove cloth which has stuck or fused onto the burn. DO NOT try to pull clothes over the burn. DO NOT put any ointment on the burn. Gently wash the burned area with water ONLY. Do NOT apply creams or ointments. Do NOT use a normal sterile medical dressing not specifically intended for burns. As non-adhesive burn dressings (and all other medical supplies) are likely to be in short supply, an expedient alternative is to use plastic wrap (also known as saran wrap, food wrap, and cling film), which is sterile, does not stick to burns, and is readily available. Prevent shock. Shock is the inadequate flow of blood to the vital tissues and organs. If untreated, it can be fatal. Shock results from excessive blood loss, deep burns, or reactions to the sight of a wound or blood. The signs are restlessness, thirst, pale skin and rapid heartbeat. Sweating may occur even if the skin feels cool and clammy. As it worsens, they breathe short fast gasps, with a vacant stare. To treat: maintain proper heartbeat and respiration by massaging the chest and positioning the person for adequate respiration. Loosen any constrictive clothing and reassure the person. Be firm yet gentle with self confidence."
    },
    {
      "title": "Feel free to assist people with radiation sickness, also called Radiation Syndrome.",
      "content": "Feel free to assist people with radiation sickness , also called Radiation Syndrome. This is not contagious, and everything depends on the amount of radiation one received. Here is a condensed version of the table: [18] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Familiarize yourself with radiation units.",
      "content": "Familiarize yourself with radiation units. (Gy (gray) = the SI unit used to measure the absorbed dose of ionizing radiation. 1 Gy = 100 rad. Sv (Sievert) = the SI unit of dose equivalent, 1 Sv = 100 REM. For the purpose of simplification, 1 Gy is usually equivalent to 1 Sv.) [19] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Less than 0.05 Gy: No visible symptoms. 0.05-0.5 Gy: Temporarily decreased red blood cell count. 0.5-1 Gy: Decreased production of immunity cells; susceptible to infections; nausea, headache, and vomiting may be common. This amount of radiation is usually survivable without any medical treatment. 1.5-3 Gy: 35% percent of exposed die within 30 days. (LD 35/30) Nausea, vomiting, and loss of hair all over the body. 3-4 Gy: Severe radiation poisoning, 50% fatality after 30 days (LD 50/30). Other symptoms are similar to the 2–3 Sv dose, with uncontrollable bleeding in the mouth, under the skin and in the kidneys (50% probability at 4 Sv) after the latent phase. 4-6 Gy: Acute radiation poisoning, 60% fatality after 30 days (LD 60/30). Fatality increases from 60% at 4.5 Sv to 90% at 6 Sv (unless there is intense medical care). Symptoms start half an hour to two hours after irradiation and last for up to 2 days. After that, there is a 7 to 14 day latent phase, after which generally the same symptoms appear as with 3-4 Sv irradiation, with increased intensity. Female sterility is common at this point. Convalescence takes several months to a year. The primary causes of death (in general 2 to 12 weeks after irradiation) are infections and internal bleeding. 6-10 Gy: Acute radiation poisoning, near 100% fatality after 14 days (LD 100/14). Survival depends on intense medical care. Bone marrow is nearly or completely destroyed, so a bone marrow transplant is required. Gastric and intestinal tissue are severely damaged. Symptoms start 15 to 30 minutes after irradiation and last for up to 2 days. Subsequently, there is a 5 to 10 day latent phase, after which the person dies of infection or internal bleeding. Recovery would take several years and probably never complete. Devair Alves Ferreira received a dose of approximately 7.0 Sv during the Goiânia accident and survived, partially due to his fractionated exposure. 12-20 REM: Death is 100% at this stage; symptoms appear immediately. The gastrointestinal system is completely destroyed. Uncontrollable bleeding from the mouth, under the skin and the kidneys occurs. Fatigue and general illness takes its toll. Symptoms are the same as before with increased intensity. Recovery not possible. More than 20 REM. The same symptoms set in instantly, with increased intensity, then cease for several days in the \"walking ghost\" phase. Suddenly, gastrointestinal cells are destroyed, with a loss of water and excessive bleeding. Death begins with delirium and insanity. When the brain can't control bodily functions like breathing or blood-circulation, one dies. No medical therapy can reverse this; medical help is for comfort only. Unfortunately, you have to accept that a person may soon die. Though harsh, don't waste rations or supplies on those dying of radiation sickness. Keep rations for the fit and healthy, should supplies be in demand. Radiation sickness is prevalent among the very young, the old or sick."
    },
    {
      "title": "Guard critical electrical equipment against EMP.",
      "content": "Guard critical electrical equipment against EMP . A nuclear weapon detonated at a very high altitude will generate an electromagnetic pulse so powerful that it can destroy electronic and electrical devices. At the very least, unplug all devices from electrical sockets and antennas. Placing radios, flashlights in a SEALED metal container (a \"Faraday cage\") may protect from EMP, providing the items being protected are not in contact with the enclosure. The metal shield must surround the protected item completely - and it helps if it is grounded. The items to be protected should be insulated from the conductive shell, since the EMP field washing over the shield can still induce voltages in solid state circuit boards. A metalized \"space blanket\" (costing about $2.00 USD) wrapped securely around a device wrapped in newspaper or cotton may act as a Faraday shield, helpful if one is far from the blast. Another method is to wrap a cardboard box in copper or aluminum foil . Place the item in there and plug the device into the ground."
    },
    {
      "title": "Be prepared for subsequent attacks.",
      "content": "Be prepared for subsequent attacks. Most likely, a nuclear attack will not be a singular event. Be prepared for another strike or strikes by enemy nations, or an invasion by the attacking party. Keep your shelter intact, unless the materials used are absolutely necessary for survival. Collect any excess clean water and food that is available. However, if the attacking nation does attack again, it will likely be in another part of the country. If all else fails, live in a cave."
    }
  ]
}