{
  "url": "https://www.wikihow.com/Why-Can%27t-I-Remember-My-Childhood-and-Teenage-Years",
  "title": "Here’s Why You Can’t Remember Your Childhood or Teenage Years",
  "steps": [
    {
      "title": "Childhood amnesia is totally normal.",
      "content": "Childhood amnesia is totally normal. Babies and young children are constantly learning, but their brains don’t store experiences into long-term memory like adult brains do. As for older folks, research shows that adults of all ages—from their 20s to their 70s—are equally bad at remembering specific details from their early lives. [1] X Research source Research suggests that 7-year-olds can recall memories from as early as age 3. However, by the time they turn 9, most of those memories are already gone. [2] X Research source You actually remember lots of information you learned in childhood: colors, shapes, numbers, or the days of the week, and so on. What’s missing is the context—where you were, who you were with, and what you were doing while you were learning. [3] X Research source"
    },
    {
      "title": "It’s normal for many memories to fade over time.",
      "content": "It’s normal for many memories to fade over time. You might remember going to prom, for instance, but what did you wear? What did the venue look like, exactly, and what songs did they play? You may not have a clue. As time goes on, we not only forget specific details of past events, but the vividness of those memories fades as well, like a poster losing color from years of sunlight. [4] X Research source On the other hand, an event is emotionally significant to you, you might remember it perfectly. Your brain holds onto impactful memories and slowly discards the rest."
    },
    {
      "title": "Having no memories from your teenage years is unusual.",
      "content": "Having no memories from your teenage years is unusual. If you have zero recollection of your adolescence—or long periods of it, like high school—you may be dealing with an underlying health issue. Depression during adolescence has been associated with memory loss. Other disorders can affect memory too. Reach out to a physician or mental health professional if you’re concerned about your situation. Many causes of memory problems, such as depression or neurological disorders, are highly treatable."
    },
    {
      "title": "Chronic stress can impact your ability to form memories.",
      "content": "Chronic stress can impact your ability to form memories. Witnessing domestic violence, having a parent who’s incarcerated, being bullied in school, and struggling with identity issues can all be sources of chronic stress in children and teenagers. When stress persists over long periods of time, it can impact the hippocampus and amygdala—two parts of the brain that play important roles in forming and storing memories. [5] X Research source When your’re under stress, your brain may not store memories as well as it would if you were relaxed or felt safe. [6] X Research source"
    },
    {
      "title": "Childhood trauma can make you block certain memories altogether.",
      "content": "Childhood trauma can make you block certain memories altogether. Experiencing physical, emotional, or sexual abuse can trigger an overwhelming fear response in your brain. Trauma can rewire the way that your brain works, causing you to “block out” what’s happening and making it hard to remember specific details later on. [7] X Research source Trauma affects adults and children alike, but childhood trauma can be especially damaging since it may negatively impact a person’s development. Everyone responds differently to trauma. Many people recall traumatic events very clearly, even if others remember little or nothing."
    },
    {
      "title": "Traumatic events can be difficult to recall—or impossible to forget.",
      "content": "Traumatic events can be difficult to recall—or impossible to forget. To illustrate this contradiction, imagine that someone’s been in a car accident. A survivor may recall the accident itself with perfect clarity, like they’re watching a movie. This is called a flashbulb memory, and it happens when something horrifying stays with us forever. [8] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source But what happens next—being pulled from the wreck and rushed to the hospital—might be a total blur. These are called “fragmented memories,” because we can only recall them in bits and pieces, or not at all. [9] X Research source Experiencing traumatic events while growing up could make entire periods of your childhood and adolescence seem “blurry” in your memory. For example, someone may clearly remember losing a parent at a young age, but the months that followed may be a total blank. You may have the same “blank” spots in your memory if you experienced a major trauma while you were growing up."
    },
    {
      "title": "Your mental health can impact memory.",
      "content": "Your mental health can impact memory. It’s no secret that depression and anxiety can make life difficult, but they can also cause forgetfulness and memory loss. [10] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you’re suffering from a mood disorder, you find may it hard to recall specific details from your life, including your childhood and teenage years. Talk to a therapist, psychiatrist, or other mental health professional if you’re struggling with your mental health."
    },
    {
      "title": "Some health conditions can affect memory.",
      "content": "Some health conditions can affect memory. Neurological disorders, learning disabilities, and even sleep deprivation can impact your ability to form new memories or recall them on demand. People living with epilepsy, for instance, may have trouble storing and retrieving long-term memories, while someone with ADHD may have a hard time focusing and retaining new information. [11] X Research source Certain medicines and treatments can also impact memory. Electroconvulsive therapy, for example, is known to cause long-term memory loss, while some antihistamines may impair concentration and prevent memories from being stored. [12] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Talk to a neurologist or other medical professional if you’re worried that your memory troubles might be caused by a health condition."
    },
    {
      "title": "Look at old photos and videos.",
      "content": "Look at old photos and videos. Find ones from periods of your life that you’re struggling to remember. School portraits, yearbook photos, family vacation albums, and home movies can jog your memory and help you piece together a timeline of your growing up. [13] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Find photos and videos that are emotionally significant to you. If you struggle to remember middle school, for example, search for photos from that time that depict important people, places, and events—like your teachers or the house you lived in."
    },
    {
      "title": "Find a TV show, book, or piece of music you liked at the time.",
      "content": "Find a TV show, book, or piece of music you liked at the time. Old cartoons, comics, songs, novels, and movies can transport you to a previous chapter in your life. For example, watching a certain movie might help you remember the first time you saw it, including where you were and who you were with. Try different things to see which ones trigger your memory. [14] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source You can also watch or read something that someone you knew used to enjoy. If your friend was a huge fan of a specific band, for instance, you can listen to some of that band’s music to see what memories come up. If you have a journal from when you were growing up, read it. You may be amazed by what you remember."
    },
    {
      "title": "Visit a place that was important to you.",
      "content": "Visit a place that was important to you. Spend a day in the town where you grew up or the park where you used to skate. Find your old bus stop from middle school and retrace your walk home. By reliving these experiences, you might start to recall specific moments, things, and people from your past. [15] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If possible, bring someone with you who knew you back then, whether its a sibling or an old friend. Share your feelings and memories with them and compare notes."
    }
  ]
}