{
  "url": "https://www.wikihow.com/Unlock-Rosalina-in-Mario-Kart-Wii",
  "title": "How to Unlock Rosalina in Mario Kart Wii",
  "steps": [
    {
      "title": "Play Super Mario Galaxy",
      "content": "Play Super Mario Galaxy on your Wii, and create a save file. The easiest way to unlock Rosalina is to use a Super Mario Galaxy save file. Try borrowing a copy from a friend if you don't have the game yourself. If you can't get hold of a copy, you can use the Mirror Mode method. Super Mario Galaxy will save automatically when you complete a stage, or select \"Save & Quit\" from the Pause menu."
    },
    {
      "title": "Race 50 times.",
      "content": "Race 50 times. After you have a Super Mario Galaxy save file on your Wii, you'll need to play 50 races to unlock Rosalina. You don't need to win the races, and they can be against your friends or against the computer. Make sure you're doing races and not Time Trials or Battle Mode."
    },
    {
      "title": "Exit the game.",
      "content": "Exit the game. If you're sure you've played 50 races but Rosalina hasn't appeared, exit the game back to the Wii's main menu."
    },
    {
      "title": "Start Mario Kart again and select your License.",
      "content": "Start Mario Kart again and select your License. Once you select your License, a notification that you've unlocked Rosalina should appear. If it doesn't, it means you haven't completed 50 races since adding the Super Mario Galaxy save file. [1] X Research source"
    },
    {
      "title": "Unlock Mirror Mode.",
      "content": "Unlock Mirror Mode. If you don't have access to Super Mario Galaxy, you'll need to unlock and beat Mirror Mode. Mirror Mode is unlocked after getting a Gold Trophy in every 150cc Cup. 150cc is the fastest mode in Mario Kart Wii and the AI gets much tougher, which means getting Gold Trophies on all the Cups can be pretty difficult. Click here for some tips on performing advanced techniques in Mario Kart Wii. Beat the Mushroom and Flower Cups to unlock the Star Cup. Beat the Shell and Banana Cups to unlock the Leaf Cup. Beat the Star Cup to unlock the Special Cup. Beat the Leaf Cup to unlock the Lightning Cup."
    },
    {
      "title": "Get at least one Star on all eight Cups in 150cc Mirror Mode.",
      "content": "Get at least one Star on all eight Cups in 150cc Mirror Mode. Mirror Mode takes all of the regular tracks and reverses the turns so that rights become lefts and vice-versa. Star rankings are determined by a number of factors as you complete the four races in each cup. Basically, race as fast and as cleanly as possible and you shouldn't have much difficulty getting a single Star, but keep the following in mind: [2] X Research source Avoid hitting walls and obstacles (you can hit a couple per race and still get one Star). Avoid going off-road. Don't fall off the track. Falling off twice during a cup will essentially guarantee no Stars. Stay in 1st place as much as possible. Avoid using items to catch up. Get at least 50 points by the end of the Cup."
    },
    {
      "title": "Exit the game after getting at least one Star on all eight Cups.",
      "content": "Exit the game after getting at least one Star on all eight Cups. If you've gotten your Star for all of the Cups, but Rosalina isn't appearing, exit the game all the way back to the Wii main menu."
    },
    {
      "title": "Start Mario Kart Wii and select your License.",
      "content": "Start Mario Kart Wii and select your License. You'll receive a notification that Rosalina is now available. If you don't get this message, then you likely did not get a Star on at least one of the 150cc Mirror Mode Cups."
    }
  ]
}