{
  "url": "https://www.wikihow.com/Solve-a-Problem",
  "title": "How to Solve a Problem",
  "steps": [
    {
      "title": "Define the problem.",
      "content": "Define the problem. Find the real problem, not just the symptoms that result from the problem. When defining the problem, do not consider things that are extraneous matters, only what the actual problem is. You can consider the other issues later. Become familiar with the problem and understand it fully. [1] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source For example, if your room is constantly messy, the problem might not be that you’re a messy person. It might be that you lack containers or places to put your items in an organized way. Try to be as clear and thorough as possible when defining the problem. If it is a personal issue, be honest with yourself as to the causes of the problem. If it is a logistics problem, determine exactly where and when the problem occurs. Determine whether the problem is real or self-created. Do you need to solve this problem or is this about something you want? Putting things in perspective can help you navigate the problem-solving process."
    },
    {
      "title": "Make important decisions first.",
      "content": "Make important decisions first. Recognize the decisions you need to make and how they will contribute to solving your problem. Making decisions can help you move forward in solving your problems, so start by deciding on what to focus on, what needs to get done, and how you will go about doing it. [2] X Research source For example, you might have several problems to solve and need to decide which ones to tackle first. Solving one problem may ease tension or take stress off of another problem. Once you make a decision, don’t doubt yourself. Be willing to look forward from that point on without wondering what would have happened had you chosen something else."
    },
    {
      "title": "Simplify the problem.",
      "content": "Simplify the problem. An overly-complicated problem can feel overwhelming and be difficult to solve. If there are multiple problems, break them down into smaller parts and deal with them individually. If you can break the problem down into the smallest terms, this will help you in understanding it and finding a solution. [3] X Research source For example, if you need to turn in many assignments to pass a class, focus on how many you have to do and approach them one by one. Try to combine and solve problems together whenever possible. For example, if you're running out of time to study, try listening to a recorded lecture while walking to class or flip through note cards as you're waiting for dinner. Try journaling about the problem to help get clarity around it. It can even help you separate emotion from fact, which may help you in the decision-making process. [4] X Expert Source Rachel Clissold Certified Life Coach Expert Interview. 26 August 2020."
    },
    {
      "title": "Outline what you know and don't know.",
      "content": "Outline what you know and don't know. Familiarize yourself with the knowledge and information you already have. Then, seek out what you need. Inform yourself of all possible information, then organize it in a meaningful way. [5] X Research source For example, if you’re trying to pass a cumulative test, figure out what you already know and what you need to study for. Review everything you already know, then start learning more information from your notes, textbook, or other resources that may help you."
    },
    {
      "title": "Anticipate future outcomes.",
      "content": "Anticipate future outcomes. Come up with a Plan B (or more) so you’re not locked into one solution. Once you’ve come up with possible solutions, think about how each one would play out. Consider possible outcomes and how they would affect you and those around you. Create a best-case scenario and a worst-case scenario in your imagination. [6] X Research source Pay attention to know these scenarios make you feel."
    },
    {
      "title": "Allocate your resources.",
      "content": "Allocate your resources. Your resources may include time, money, effort, travel, etc. If solving the problem is a top priority, you may need to allocate more resources toward solving the problem than you otherwise would. Think about what resources you have that you can give toward solving your problem. [7] X Research source For example, if you have a deadline, you may skip cooking dinner or going to the gym so that you can give that time to your project. Cut down on unnecessary tasks whenever possible. For example, you might get your groceries delivered to you to save on shopping time. You can spend that time instead on other tasks."
    },
    {
      "title": "Brainstorm different solutions.",
      "content": "Brainstorm different solutions. Think of different ways to solve your problem. Knowing that there is more than one way to approach the problem can help you realize that you have choices. Once you’ve thought of some alternatives, decide which ones are plausible and which ones you can forget about. [8] X Research source If you’re making a complex decision, write down your alternatives. This way, you won’t forget any options and will be able to cross off any that aren’t plausible. For example, you might be hungry and need something to eat. Think about whether you want to cook food, get fast food, order takeout, or sit down at a restaurant."
    },
    {
      "title": "Try different approaches to a problem.",
      "content": "Try different approaches to a problem. If you’re solving a straightforward problem, then analytical or logical skills will aid you best. Other times, you may need to rely on your emotions to guide you. Often, problems require a combination of thinking skills, your feelings, and maybe even your gut to come to a solution. Don't be afraid to utilize these ways of approaching problems, but play around with them and see what works best for you. [9] X Research source Problems like accepting the job across the country that offers good pay but takes you away from your family may require different ways of approach. Consider the logical solution, but also consider your thoughts, feelings, and the way the decision affects others."
    },
    {
      "title": "Get advice from others.",
      "content": "Get advice from others. If your problem is not immediate, ask advice from other people. Maybe you know someone who has faced a similar problem in the past who can weigh in and give you some feedback. Whether you follow their advice or not is up to you, however, it can be helpful to gain some different perspective. For example, if you’re buying a home and not sure how to make your final decision, talk to other homeowners about their thoughts or regrets about buying a home."
    },
    {
      "title": "Monitor your progress.",
      "content": "Monitor your progress. If you’re working toward a goal, notice how things are coming along. If you’re making progress and going in a positive direction, keep going. If you’re realizing your approach isn’t the best, then think about solving the problem in a different way. You may need to come up with some new strategies to better solve your problem. [10] X Research source For example, if you’re having financial difficulties, notice how your efforts are affecting the money coming in and the money you’re spending. If keeping a budget helps, keep with it. If using cash exclusively is a headache, try something else. Keep a journal where you record your progress, successes, and challenges. You can look at this for motivation when you are feeling discouraged."
    },
    {
      "title": "Calm",
      "content": "Calm your emotions. Making a decision or solving a problem can be difficult if you feel anxious or nervous about how it will go. If your fear is clouding your ability to solve a problem, take a moment to feel calm. Take a few slow, deep breaths to help calm your nervous system and com back into the present moment. [11] X Expert Source Rachel Clissold Certified Life Coach Expert Interview. 26 August 2020. If you're feeling overwhelmed, try writing down a list of everything you need to do. When you get it all out of your head and onto paper, it can be easier to decide what you need to do next. [12] X Expert Source Rachel Clissold Certified Life Coach Expert Interview. 26 August 2020. The first step is often the scariest. Try doing something small to start. For example, if you're trying to become more active, start going for daily walks."
    },
    {
      "title": "Address any underlying problems.",
      "content": "Address any underlying problems. An obvious problem might have some underlying problems that would be better to resolve. If you’ve solved a similar problem like the current one in the past yet it keeps coming up, explore whether there may be some underlying causes. You may be able to solve a problem for good. [13] X Research source For example, if you’re overwhelmed by having a long to-do list, maybe the problems isn’t the list, but not saying “no” to things you can’t do. If you're feeling stressed, angry, or overwhelmed, you may be burned out. Make a list of things that cause stress or frustration. Try to cut down on these in the future. If you start feeling overwhelmed again, it may be a sign that you need to cut back."
    },
    {
      "title": "Work with a therapist.",
      "content": "Work with a therapist. if you find yourself constantly struggling to make decisions or doubting yourself after you solve a problem, you might benefit from working with a mental health professional. You might struggle with low self-esteem, which can make you doubt yourself or feel defeated. Your therapist can provide insight and challenge you to see yourself in a more positive and realistic way. [14] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Find a therapist by calling your local mental health clinic or your insurance provider. You can also get a recommendation from a physician or friend."
    }
  ]
}