{
  "url": "https://www.wikihow.com/Steam-Broccoli-Without-a-Steamer",
  "title": "How to Steam Broccoli Without a Steamer",
  "steps": [
    {
      "title": "Rinse and cut up a head of broccoli.",
      "content": "Rinse and cut up a head of broccoli. Run water over the broccoli to clean the broccoli , and dry with paper towels. [2] X Research source Use a sharp kitchen knife to chop the florets into bite-size pieces, and then toss them in a metal colander . [3] X Research source Aim to make the florets roughly similar in size so they cook evenly. You can discard the stalks or chop them up—they’re quite tasty and tender when steamed properly!"
    },
    {
      "title": "Add 1 in (2.5 cm) of water to a stock pot and boil on high heat.",
      "content": "Add 1 in (2.5 cm) of water to a stock pot and boil on high heat. [4] X Research source Since there’s a small amount of water in the stock pot , it won’t take more than a few minutes to start boiling."
    },
    {
      "title": "Lower the colander of broccoli onto the stock pot and add the lid.",
      "content": "Lower the colander of broccoli onto the stock pot and add the lid. Reduce to a low heat as soon as you put the lid on. [5] X Research source Check that the water isn’t touching the bottom of the colander. Make sure the lid is on snugly so the steam can’t escape."
    },
    {
      "title": "Check the broccoli after 4 minutes.",
      "content": "Check the broccoli after 4 minutes. [6] X Research source The broccoli is ready if it’s bright green and easy to pierce with a fork. If the broccoli isn’t ready, put the lid back on and check again 1 minute later. Repeat once more if necessary. Steamed broccoli can turn drab green, mushy, and unappetizing quickly, so check every minute after the first 4 minutes of steaming. See how other wikiHow readers prefer to steam their broccoli on the \"How do you steam broccoli?\" forum post ."
    },
    {
      "title": "Serve the steamed broccoli after seasoning it to taste.",
      "content": "Serve the steamed broccoli after seasoning it to taste. Remove the colander from the stock pot and pour the broccoli into a serving dish. If desired, stir in some butter or olive oil and seasonings. Try adding lemon juice, balsamic vinegar, or toasted almond slivers to your steamed broccoli. [7] X Research source"
    },
    {
      "title": "Clean the broccoli and cut it into bite-size pieces.",
      "content": "Clean the broccoli and cut it into bite-size pieces. Rinse the broccoli under running water, dry with paper towels, and then use a sharp kitchen knife to cut the florets into bite-size pieces. [8] X Research source"
    },
    {
      "title": "Put the broccoli in a microwave-safe bowl and add water.",
      "content": "Put the broccoli in a microwave-safe bowl and add water. For instance, choose a microwave-safe plastic bowl, ceramic bowl, or small casserole dish. Add 2.5 Tbsp (37.5 ml) of water for every 1 lb (450 g) of broccoli. [9] X Research source The broccoli doesn’t need to be in a single layer, as the steam will rise through all the broccoli once the dish is covered."
    },
    {
      "title": "Cover the bowl tightly to trap in the steam.",
      "content": "Cover the bowl tightly to trap in the steam. If you have a microwave-safe lid , use that to cover your broccoli. If you don’t have a lid for your dish, use plastic wrap or a microwave-safe plate to cover the bowl. [10] X Research source"
    },
    {
      "title": "Microwave on high for 3 to 4 minutes.",
      "content": "Microwave on high for 3 to 4 minutes. After 2.5 minutes of cooking, carefully remove the hot bowl from the microwave and take off the lid or covering. If the broccoli is bright green and easily pierced with a fork, it’s done. Otherwise, re-cover it and cook it for another 30 seconds. [11] X Research source Keep checking every 30 seconds after the first 2.5 minutes since broccoli can go from perfectly steamed to overcooked quickly. Always be cautious when uncovering a bowl of steaming veggies. The hot steam will escape quickly and could burn you if you’re not careful. Open the bowl away from you to avoid exposing yourself to the steam."
    },
    {
      "title": "Season the broccoli as desired and serve as a side dish.",
      "content": "Season the broccoli as desired and serve as a side dish. When the broccoli is steamed just right, add any desired seasonings —for instance, stir in butter and sprinkle with garlic salt—and serve directly from the microwave bowl or transfer to a serving dish. [12] X Research source Try stirring in a splash or two of soy sauce to give the finished broccoli an enhanced flavor that pairs well with white rice."
    },
    {
      "title": "Wash, dry, and chop up a head of broccoli.",
      "content": "Wash, dry, and chop up a head of broccoli. Rinse the broccoli with water and pat dry with paper towels. Use a sharp kitchen knife to separate the florets from the stalks, cutting them into bite-size pieces. [13] X Research source “Bite size” means the florets should be cut into about 1 in (2.5 cm) pieces. Take a quick look through the head of broccoli after washing it to make sure there aren’t any bugs hiding out!"
    },
    {
      "title": "Add 1⁄2 in (1.3 cm) of water to a medium pan.",
      "content": "Add 1 ⁄ 2 in (1.3 cm) of water to a medium pan . Adding more water than this will cause the broccoli to boil and give it a different texture. [14] X Research source Opt for a pan or skillet that has a lid, as this will make things easier later on."
    },
    {
      "title": "Place the pan over high heat and wait for the water to boil.",
      "content": "Place the pan over high heat and wait for the water to boil. Since there’s only a small amount of water in the pan, it shouldn’t take long."
    },
    {
      "title": "Use tongs to add the broccoli to the pan.",
      "content": "Use tongs to add the broccoli to the pan. Cover the pan's surface evenly, being careful not to splash up any boiling water."
    },
    {
      "title": "Cover the pan with a lid and cook over high heat for 3 minutes.",
      "content": "Cover the pan with a lid and cook over high heat for 3 minutes. Don’t lift the lid or shake the pan, as this could disrupt the steaming process. If your pan doesn’t have a lid, place a heat-resistant dinner plate over the pan. [15] X Research source"
    },
    {
      "title": "Reduce the heat to low and steam the broccoli for 3 more minutes.",
      "content": "Reduce the heat to low and steam the broccoli for 3 more minutes. Don’t remove the lid to check the broccoli, as this can release all your precious steam. [16] X Research source"
    },
    {
      "title": "Serve the steamed broccoli.",
      "content": "Serve the steamed broccoli. Carefully remove the lid, stir in your preferred seasonings or dressings, and serve from the pan or transfer to a serving dish. The broccoli should be a bright green and easily pierced with a fork when fully cooked. [17] X Research source Use the lid as a shield when lifting it off the pot by pulling it towards your body. This will help deflect the steam away from your face. Toss your broccoli with garlic oil and asiago cheese for a rich flavor. [18] X Research source"
    }
  ]
}