{
  "url": "https://www.wikihow.com/Soothe-the-Esophagus",
  "title": "Safe and Effective Ways to Soothe Esophagus Pain",
  "steps": [
    {
      "title": "Eat soft foods that are easy to digest.",
      "content": "Eat soft foods that are easy to digest. If your esophagus is inflamed for any reason, then soft foods are best. These slide down your esophagus easily without causing any more pain or damage. If you’re feeling any pain or discomfort, switch to a soft-food diet until you feel better. [1] X Trustworthy Source Cedars Sinai Hospital Website of one of the world's leading hospitals Go to source Good foods to eat are steamed vegetables, pudding, soft and watery fruit, soft bread, and tender meat. Problem foods include crunchy bread and crackers, stringy or tough meat, fruit with tiny seeds, and coarse vegetables. Avoid these until you’re feeling better. Take small bites to avoid filling your esophagus too much."
    },
    {
      "title": "Stop eating when you feel full.",
      "content": "Stop eating when you feel full. Eating too much puts a lot of stress on your esophagus and could trigger acid reflux. Even if your meal is delicious, stop eating when you start feeling full to avoid any discomfort. You can always have leftovers later! [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Eating slowly helps you avoid overeating because you’ll feel full sooner. Try to take small bites and chew slowly so you don’t eat too fast. If you have trouble stopping yourself from eating, try having smaller meals instead. Without a lot of food in front of you, you won’t feel as tempted."
    },
    {
      "title": "Stay sitting or standing upright after you eat.",
      "content": "Stay sitting or standing upright after you eat. If you lay back after eating, some of the acid in your stomach could back up into your esophagus. Remain sitting or standing upright until all that food is digested. This should take about 2-3 hours. [3] X Research source Also avoid eating a lot within 3 hours of going to bed, since you'll be laying down. Eating at night is a major cause of late-night heartburn."
    },
    {
      "title": "Avoid common acid reflux trigger foods.",
      "content": "Avoid common acid reflux trigger foods. If your esophagitis is caused by acid reflux, then there are a few foods that tend to make this worse. Cut the following foods out of your diet and see if it makes you more comfortable. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Fatty, fried, greasy, and spicy foods. Acidic foods like citrus fruits, tomatoes, and garlic Caffeine, chocolate, and peppermint. Some other triggers might be unique to you. Cut out any foods that make your symptoms worse."
    },
    {
      "title": "Don’t have carbonated drinks while you’re eating.",
      "content": "Don’t have carbonated drinks while you’re eating. Carbonated drinks can push acids into your esophagus and trigger heartburn. This is a common problem if you drink it while you’re eating. Hold the seltzer until you’ve digested your meal. [5] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you’re very prone to heartburn, then cutting out carbonated drinks entirely might help. Sugary drinks like soda are bad for you anyway. It’s best to avoid them altogether."
    },
    {
      "title": "Chew sugar-free gum after eating to protect your esophagus.",
      "content": "Chew sugar-free gum after eating to protect your esophagus. Chewing gum might not seem like a solution for heartburn, but it is! This stimulates saliva production, which coats your esophagus and protects it from acid. If you often feel acid pain after meals, this might work for you. [6] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Avoid peppermint flavors, since peppermint can trigger heartburn."
    },
    {
      "title": "Drink some herbal tea if you feel heartburn starting.",
      "content": "Drink some herbal tea if you feel heartburn starting. This isn’t proven, but there are a few herbal teas that have some success in soothing acid reflux. Specifically, chamomile, licorice, and ginger could work. Try sipping on one of these teas if your acid reflux is acting up. [7] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If your esophagus is sore, let the tea cool off before drinking it. Hot drinks could make the pain worse. Chamomile is in the ragweed family, so don’t drink it if you have a ragweed allergy."
    },
    {
      "title": "Take an OTC antacid to control acid reflux.",
      "content": "Take an OTC antacid to control acid reflux. If you have occasional acid reflux, then an antacid could be all you need. You can get this medication from any pharmacy without a prescription. Pick up a box and take it if you feel any heartburn coming on. [8] X Research source Common antacids include Maalox, Mylanta, Pepto Bismol, or Tums. Always read the instructions for the medication you’re taking and don’t take more than the recommended dose."
    },
    {
      "title": "Soothe your throat if it hurts.",
      "content": "Soothe your throat if it hurts. If you're having pain in your throat, try gargling every 2 hours with lukewarm salt water. That will help treat any infection that might be present. [9] X Expert Source Ritu Thakur, MA Natural Health Care Professional Expert Interview. 25 July 2019. You can also make a decoction of turmeric, cinnamon, and ginger, and sip it like soup to get rid of pain and infection in your throat. [10] X Expert Source Ritu Thakur, MA Natural Health Care Professional Expert Interview. 25 July 2019. Licorice roots are also very effective in soothing throat pain and infection. [11] X Expert Source Ritu Thakur, MA Natural Health Care Professional Expert Interview. 25 July 2019."
    },
    {
      "title": "Raise the head of your bed if you often have nighttime pain.",
      "content": "Raise the head of your bed if you often have nighttime pain. Nighttime heartburn is a common problem, especially if you have acid reflux. Try propping the head of your bed up about 6–8 in (15–20 cm) with wooden blocks. This tilts your body forward and keeps acid contained in your stomach. [12] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you can’t raise your bed, you could also put a foam wedge under your torso to lift yourself up at night. [13] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Don’t try to lift yourself up with pillows. This could actually make acid reflux pain worse."
    },
    {
      "title": "Lose weight if you have to.",
      "content": "Lose weight if you have to. Being overweight can put you at a higher risk for esophagitis. If you’re overweight, talk to your doctor to design the most effective dieting and exercise regimen to get yourself to a healthy weight. [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Avoid extreme or crash diets. These aren’t safe, and many people gain all the weight back when they return to eating normally. [15] X Research source"
    },
    {
      "title": "Reduce your stress",
      "content": "Reduce your stress to relieve acid reflux. Stress can actually make acid reflux and other stomach problems worse. If you often feel stressed, then some relaxation might be what you need. [16] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Relaxation techniques like meditation, yoga, and deep breathing are good exercises to reduce your stress levels. Try doing one of these each day. Doing things you enjoy is also great to improve your mood. Make some time for your hobbies to distract yourself from stress."
    },
    {
      "title": "Quit smoking to improve your GI health.",
      "content": "Quit smoking to improve your GI health. Smoking irritates your esophagus and can make your pain worse, so matter what’s causing it. If you smoke, then it’s best to quit as soon as possible. If you don’t, then avoid starting at all. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Secondhand smoke is harmful too, so don’t let anyone smoke in your home. If you need help quitting, talk to your doctor for guidance."
    },
    {
      "title": "Drink a full glass of water if you take a pill.",
      "content": "Drink a full glass of water if you take a pill. Sometimes, a pill getting stuck in your esophagus causes inflammation. If you regularly take medication, then this could be the problem. Flush the pill through your esophagus with a full glass of water to prevent it from getting stuck. [18] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Also stay upright for 30 minutes after taking the pill to make sure it passes into your stomach. If pills keep causing trouble for you, you could ask your doctor to switch you to a liquid medication instead."
    },
    {
      "title": "See your doctor if you have consistent heartburn pain.",
      "content": "See your doctor if you have consistent heartburn pain. If you regularly have heartburn or pain in your esophagus, then you don’t have to just live with it! This condition is usually treatable, and might even be completely curable. Make an appointment with your doctor to get to the bottom of the problem and discuss treatments. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Your doctor will probably talk about the problem with you before doing an exam, so answer all of their questions as well as you can. The doctor may also do an endoscopy to look inside your esophagus. They’ll put a small camera down your throat to check for any damage. This sounds scary, but you’ll be sedated and shouldn’t feel any pain."
    },
    {
      "title": "Take prescription acid-reducers if you have acid reflux.",
      "content": "Take prescription acid-reducers if you have acid reflux. If OTC antacids aren’t helping you, then your doctor will probably try a prescription-strength medication to fight acid in your stomach. These either neutralize acid or block your stomach from producing too much of it. [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source There are many medication types your doctor might try. Proton pump inhibitors and H-2 blockers prevent your body from producing too much acid. Antacids neutralize acids in your stomach and esophagus. Follow all your doctor’s instructions for taking the medication correctly."
    },
    {
      "title": "Reduce inflammation from chronic esophagitis with steroids.",
      "content": "Reduce inflammation from chronic esophagitis with steroids. If your esophagus is damaged or there isn’t a clear cause for the pain, then your doctor might try a steroid treatment to eliminate inflammation. This is usually in a liquid that you’ll drink, but you might also inhale it with an inhaler. The medication coats your esophagus to protect and strengthen it. [21] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Oral steroids can also help heal your esophagus, but these are more likely to cause side effects than liquid or gas forms. [22] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Take antibiotics if you have an infection.",
      "content": "Take antibiotics if you have an infection. In some cases, esophagitis comes from an infection in your stomach or esophagus. If your doctor thinks an infection is to blame, they'll prescribe antibiotics to kill the bacteria causing it. Take this medication exactly as your doctor tells you to so the infection clears up. [23] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Always take the entire course of antibiotics to make sure the infection is totally gone. The doctor might also give you steroids if the infection caused any damage in your esophagus."
    },
    {
      "title": "Switch to a different medication if a drug is causing esophagitis.",
      "content": "Switch to a different medication if a drug is causing esophagitis. A few medications can irritate your esophagus. These include some antibiotics, potassium chloride, pain relievers, quinidine, and osteoporosis medications. If you regularly take medication and your doctor thinks this is causing your problem, they'll switch you over to something different to see if it helps. [24] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Drinking a full glass of water and staying upright when you take a pill also helps with drug-induced esophagitis. Never stop taking medications unless your doctor tells you to."
    },
    {
      "title": "Get tested for any food allergies if there is no clear cause.",
      "content": "Get tested for any food allergies if there is no clear cause. In some cases, a food allergy causes inflammation in your esophagus. If other dietary changes don’t help, visit an allergist to get tested for food allergies. If you do have any allergies, avoid these foods to soothe your esophagus. [25] X Research source If your doctor can’t find a particular food allergy but suspects your condition is coming from an allergy, they’ll probably tell you to gradually cut foods out of your diet to locate which food is the problem."
    }
  ]
}