{
  "url": "https://www.wikihow.com/Use-Facebook-Marketplace-on-Android",
  "title": "A Guide to Using Facebook Marketplace on Android",
  "steps": [
    {
      "title": "You can find Facebook Marketplace in the Facebook app.",
      "content": "You can find Facebook Marketplace in the Facebook app. There is no separate app for Facebook Marketplace. It's all in the same app. There are two ways to access Facebook Marketplace from within the Facebook app: Tap the icon that resembles a storefront at the top of the Facebook app. Alternatively, tap your profile icon in the upper-right corner, then tap Marketplace below \"Your Shortcuts.\" If you don't see Marketplace under \"Your Shortcuts,\" scroll down and tap See more at the bottom of the list of Shortcuts. If you don't have the Facebook app on your phone or tablet, you can download it for free from the Google Play Store."
    },
    {
      "title": "Browse Facebook Marketplace.",
      "content": "Browse Facebook Marketplace. When you open Facebook Marketplace in the Facebook app, you will see various items on the front page. You can scroll to view all the items and tap something you are interested in to see more info. Tap For you at the top to view a list of recommended items. Tap Local to view a list of items being sold in your area. If you are interested in something specific, tap the magnifying glass icon at the top and use the search bar to search for items by name."
    },
    {
      "title": "Tap More.",
      "content": "Tap More . It's the fourth tab at the top of the screen. This displays a list of categories. This also displays options for viewing your shipped items, Buy & Sell groups, Marketplace discussions, deals, and saved items."
    },
    {
      "title": "Select a category to view.",
      "content": "Select a category to view. You'll see the most popular categories listed below \"Top categories.\" Scroll down further to view all categories. Tap a category you are interested in to see all the items listed in that category."
    },
    {
      "title": "Search the marketplace for a specific item.",
      "content": "Search the marketplace for a specific item. If you know what you're looking for, you can use the search bar at the top of the page to search the marketplace. Tap the search bar at the top. Enter keywords to search. Tap the search button on your keyboard."
    },
    {
      "title": "Tap an item to view its details.",
      "content": "Tap an item to view its details. If you find an item you're interested in, tap on its title or picture to open the item details."
    },
    {
      "title": "View a description of the item.",
      "content": "View a description of the item. All the information about the item is listed below \"Description.\" Tap See more to view the full description."
    },
    {
      "title": "Check the sales preferences.",
      "content": "Check the sales preferences. In some cases, a seller may be willing to ship or deliver an item. In most cases, they will want to meet in person to make the exchange. You can check what area they are willing to meet in under the \"Meetup preferences\" header. Make sure this is an area you are willing to travel to. If the seller is willing to deliver the item, make sure you are within the area they are willing to deliver to."
    },
    {
      "title": "Send the user a message.",
      "content": "Send the user a message. If you want to purchase the item or ask questions, you'll need to send the seller a message. Enter a message in the space below \"Send seller a message\" and tap Send . The default message is \"Is this still available?\". You will need to wait for the seller to reply to ask questions and arrange a time to pick up the item. All messages will be handled over Facebook Messenger ."
    },
    {
      "title": "Tap Save at the bottom.",
      "content": "Tap Save at the bottom. It's the icon that resembles a heart below the message box. This saves the item so that you can return to it later. To view your saved items, open Facebook Marketplace. Tap More at the top and then tap Saved ."
    },
    {
      "title": "Tap the Sell tab.",
      "content": "Tap the Sell tab. This button is located in the upper-left corner of the marketplace. This is where you can create listings, check the performance of your listings, and see if you have any unanswered chat responses."
    },
    {
      "title": "Tap + Create listing.",
      "content": "Tap + Create listing . It's the blue button at the top of the page. This allows you to create a new listing."
    },
    {
      "title": "Select a listing type.",
      "content": "Select a listing type. The listing types are as follows: One Item: Select this if you have a single item to sell, such as a piece of clothing, furniture, or an electronic device. Multiple Items: Select this if you have multiple items for sale. This could be if you are trying to clean out some space or have a collection of items to sell. Vehicle: Select this option to sell a vehicle, such as a car, truck, or boat. Home for sale or rent: Select this option if you want to list a living space, such as a house, apartment, or condo."
    },
    {
      "title": "Add photos or a video of your item to your post.",
      "content": "Add photos or a video of your item to your post. To do so, tap Add photos/video in the box on the right at the top of the page. Alternatively, you can tap Record a video in the box on the left to record a video of the item. It's recommended that you include multiple photos of the item from different angles. Videos must be no more than one minute."
    },
    {
      "title": "Enter a title for your item.",
      "content": "Enter a title for your item. Enter the item you are selling in the field labeled \"Title.\" If you are selling a vehicle, you will need to enter the vehicle type, year, make, model, and number of owners instead. If you are selling or renting a property, you will need to select whether the property is for sale or rent. You will also need to select the type of property it is, as well as the number of bedrooms and bathrooms. Additionally, you will need to include the property address."
    },
    {
      "title": "Enter your asking price.",
      "content": "Enter your asking price. Tap the \"Price\" field and enter a price for the item you're selling."
    },
    {
      "title": "Select the condition the item is in.",
      "content": "Select the condition the item is in. Tap one of the options below \"Condition\" to select a condition for the item. The options are as follows: New: Select this option if the item is brand new and has never been used. Used - Like New: Select this option if the item has been slightly used but is still in the same condition as when it was new. Used - Good: Select this option if the item has been used, but is still in really good condition. Used - Fair: Select this option if the item has been used and has some minor damage or scuff marks."
    },
    {
      "title": "Add a description of the item.",
      "content": "Add a description of the item. Use the field labeled \"Description\" to provide a detailed item description. You can include details such as the color, model number, and any features the item has. If the item's condition is less than perfect, you should also explain what type of damage the item has. If you are selling or renting a property, you can add additional information such as square feet, laundry type, parking type, air conditioning type, and heating type. You can also select any amenities the property has (i.e., balcony, basement, cable TV, etc)."
    },
    {
      "title": "Select additional listing options.",
      "content": "Select additional listing options. To display additional listing options, tap More listing options . Additional listing options are as follows: Category: Use this drop-down menu to select a category for the item. Delivery: This allows you to select delivery options, such as the area you are willing to deliver to. Boost listing after publishing: Tap this toggle switch to boost the listing. You will be required to pay to boost the item. This will turn the listing into a Facebook ad that will reach more people. Additional listing options: Tap this option for a longer form that allows you to change the quantity, add variants, add an SKU number, and more."
    },
    {
      "title": "Select additional pages and groups to list the item in.",
      "content": "Select additional pages and groups to list the item in. If you want to list the item on any pages or groups you are a part of, tap List in more places and then tap the checkbox next to the pages or groups you want to list the item."
    },
    {
      "title": "Hide the item from friends (optional).",
      "content": "Hide the item from friends (optional). If you don't want the listing to appear to your friends, tap the toggle switch next to \"Hide from friends.\""
    },
    {
      "title": "Tap Publish.",
      "content": "Tap Publish . It's the blue button at the bottom. This publishes your listing and lists it on Marketplace. Any interested buyers will message you on Facebook Messenger. You can check the performance of your listing under the \"Sell\" tab as well as any unanswered messages. If you are selling multiple items, tap Add listing at the bottom instead. This will add the listing and take you to the page for the next listing."
    },
    {
      "title": "Make sure you are of age to use Facebook Marketplace.",
      "content": "Make sure you are of age to use Facebook Marketplace. To access Facebook Marketplace, you must be an adult according to the laws of your own country. You cannot access Facebook Marketplace if you are under 18 years old. If you are listed as a minor on Facebook and need to change your age, you'll need to verify your identity. To do so, you will need to take a selfie and upload an ID. Go to https://www.facebook.com/help/contact/515009838910929 , click Get Started , and follow the prompts to verify your ID."
    },
    {
      "title": "Check that Facebook Marketplace is available in your country.",
      "content": "Check that Facebook Marketplace is available in your country. Facebook Marketplace is not available in all countries. If your country is not listed in the list of available countries, you cannot use Facebook Marketplace. [1] X Research source You can view a list of available countries here ."
    },
    {
      "title": "Make sure you are using your main profile.",
      "content": "Make sure you are using your main profile. Facebook is not available for additional profiles or pages . If you have additional profiles or admin any pages, make sure you switch to your main account to use Facebook Marketplace."
    },
    {
      "title": "Make sure your Facebook isn't new or inactive.",
      "content": "Make sure your Facebook isn't new or inactive. If your account is new or has been inactive for a while, you may not be able to access Facebook Marketplace. If your account is brand new, you may need to wait a couple of days or a couple of weeks to access Facebook Marketplace."
    },
    {
      "title": "Check that your listing follows the Commerce Guidelines and Community Standards.",
      "content": "Check that your listing follows the Commerce Guidelines and Community Standards. Items such as sexual content, drugs, tobacco, alcohol products, illegal items, recalled products, and weapons are prohibited. Job listings, services, medical devices, pets and animals, animal products, gambling, event tickets, gift cards, and vouchers are also prohibited. [2] X Research source"
    },
    {
      "title": "Make sure you aren't banned or suspended from Facebook Marketplace.",
      "content": "Make sure you aren't banned or suspended from Facebook Marketplace. If you previously ran afoul of the Commerce Guidelines or Community Standards, you may be banned or temporarily suspended from Facebook Marketplace."
    }
  ]
}