{
  "url": "https://www.wikihow.com/Treat-Tropical-Fish-with-White-Spot-Disease-(Ich)",
  "title": "How to Treat Tropical Fish with White Spot Disease (Ich)",
  "steps": [
    {
      "title": "Distinguish white spot disease between freshwater fish and saltwater fish.",
      "content": "Distinguish white spot disease between freshwater fish and saltwater fish. The disease works in the same way for both freshwater and saltwater fish but have different life cycle durations and different cures. In both types of water, the protozoan parasite attaches itself to fish in order to carry out its life cycle. In the wild, ich is less of a problem as few parasites are ever able to find a host. When they do, the parasites eventually fall off of the fish and the fish is able to swim away and heals its wounds. However, in an enclosed tank, ich parasites can easily attach itself to fish, multiplying and infesting, which eventually leads to the decimation of an entire tankful of fish. In freshwater, ich is known as ichthyophthiriasis . In saltwater, ich is known as cryptocaryon irritans and is often confused with other parasites that produce white spots. Saltwater ich can take longer than freshwater ich to replicate but only have 12 to 18 hours to find a host before they die as opposed to freshwater ich which can last up to 48 hours without a host."
    },
    {
      "title": "Understand that stress is a factor that affects the likelihood of ich.",
      "content": "Understand that stress is a factor that affects the likelihood of ich. Since ich is fairly common, most fish have developed a good immunity against it. However, stress can suppress the immune system of a fish and that's when ich is most prevalent. Stress can be caused by: Incorrect water temperatures and bad water quality. Other tank inhabitants. New tank inhabitants. An improper diet. Shipping and handling of fish during transport Your own home environment, especially if your home is prone to loud noises, banging or shaking doors, or have a lot of traffic around the tank."
    },
    {
      "title": "Learn to identify symptoms of ich.",
      "content": "Learn to identify symptoms of ich. Symptoms of ich can be seen on your fish as well as in the way your fish behaves. The most obvious sign of ich is the appearance of little white dots that resemble grains of salt which gave the disease its name. [1] X Research source The common signs and symptoms of ich are: White spots on the body and gills of fish. The spots may even join together to form white patches. Sometimes, the ich is only found on the fish's gills. Excessive flashing. Your fish may excessively rub against plants or rocks in the tank in attempt to get rid of the parasites or because the disease is causing the fish irritation. Clamped fins. This means your fish constantly folds its fins against its body instead of letting them fan out and rest freely by its sides. Laboured breathing. If your fish is gasping at the surface of the water or hovering near the tank's filter, it's probably suffering from a lack of oxygen. The ich on its gills makes it difficult for your fish to absorb oxygen from the water. Loss of appetite. If you fish is not eating or spitting back out its food, this may be a sign of stress and disease. Reclusive behaviour. Animals often hide when they're feeling ill and any change in normal behaviour is often a sign of stress or disease. Your fish might hide out in the decor or not be as active as usual."
    },
    {
      "title": "Treat your fish for ich when the parasite is most vulnerable.",
      "content": "Treat your fish for ich when the parasite is most vulnerable. Ich can only be killed when it is not attached to the fish which is when the fully matured parasite drops off of the fish's skin in order to replicate itself into more ich-infecting units. Anytime the parasite is attached to the fish, it is protected from chemicals and treatment is not effective. There are several stages to the ich life cycle: Trophont stage: This is when the ich parasite is visible on your fish. It burrows under your fish's mucus coating forming a cyst which protects it from chemicals so that any treatment becomes ineffective. In a typical tank with a temperature of 75 to 80ºF (24 to 27ºC), the trophont stage or feeding stage will last a few days before the fully developed cyst drops off the fish. Tomont or tomite stage: At this stage, treatment of ich is possible. The parasite or tomont will float for several hours in the water until it attaches itself on a plant or some other surface. Once attached, it begins to divide or replicate rapidly inside the cyst. In a few days, it will burst open and new organisms will start swimming out in search of a new host. Freshwater tomont can replicate as fast as 8 hours while saltwater tomont may take up to 3 to 28 days to replicate. Thermonts or swarmer stage: Freshwater swarmers must find a host or fish within a 48 hours or it will die while saltwater swarmers only have 12 to 18 hours. For this reason, one way to ensure a tank is clear of ich is to leave it uninhabited for a week or two."
    },
    {
      "title": "Observe the temperature of your tank.",
      "content": "Observe the temperature of your tank. Higher temperatures speed up the life cycle the parasite. A tank with a higher temperature will take a couple of days for the cycle to complete while one with a lower temperature may take weeks to complete. Never increase the temperature of your tank drastically. This can stress your fish and some fish do not tolerate higher temperatures. Most tropical fish are can withstand temperatures as high as 86ºF (30ºC). Always consult your tropical fish expert or learn about your fish to find out what temperatures they can tolerate."
    },
    {
      "title": "Raise the temperature of the water to 86ºF (30ºC).",
      "content": "Raise the temperature of the water to 86ºF (30ºC). Slowly increase the temperature by 2ºF (1ºC) per hour until it reaches the correct temperature. And maintain this temperature for at least 10 days. High temperatures speed up the life cycle of ich and can also prevent tomont from replicating. Make sure that the other fish in the tank can handle the higher temperatures beforehand. If your fish can handle temperatures higher than 86ºF (30ºC), raise the temperature to 89ºF (32ºC) for 3 to 4 days and then decrease it back to 86ºF (30ºC) for another 10 days. Be sure your tank has enough oxygen or aeration as water holds less oxygen at higher temperatures. At the same time, you can treat the water with salt or medicine everyday. Always be sure your fish can handle a rise in temperature. Observe how your fish react to a slowly heating tank or read up on how high of a temperature your fish can tolerate."
    },
    {
      "title": "Increase oxygen or aeration in the tank to improve your fish's immune system and quality of life.",
      "content": "Increase oxygen or aeration in the tank to improve your fish's immune system and quality of life. Since ich inhibits a fish's ability to breathe and absorb oxygen, increasing aeration can help boost your fish's immune system and also save it from suffocating to death. There are several ways to increase oxygen in your tank: Decrease the water level so that when your filtered water hits the surface, it creates more oxygen. Place more airstones in the tank or move them closer to the surface of the water. Use bubble disks to create bigger bubble streams. [2] X Research source Use powerheads to not only increase oxygen but also improve water movement in the tank. [3] X Research source"
    },
    {
      "title": "Use aquarium salt to treat ich in freshwater aquariums.",
      "content": "Use aquarium salt to treat ich in freshwater aquariums. Dissolve 1 teaspoon per 1 gallon (4 L) of water in a small amount of tank water separately and then add the mixture to the tank. Leave the salt in the freshwater aquarium for 10 days. Salt disrupts the fluid regulation of ich and also helps develop your fish's natural mucous or slime coats to protect it from ich parasites. Combine salt with heat to further effectively kill off ich. Use aquarium salt that is specifically design for fish and not table salt which is not iodine-free. Never use medication along with salt and heat as the salt and medication can react and restrict oxygen within the tank. Change 25% of the tank water every few days and only add the correct amount of salt to water taken out. However, if the treatment is over, do partial water changes but don't add anymore salt."
    },
    {
      "title": "Do 25% daily partial water changes.",
      "content": "Do 25% daily partial water changes. Partially changing the water everyday can help remove some trophonts and tomites from the tank and also add oxygen to the water. Be sure to use treated water so the extra chlorine won't stress your fish or agitate your fish's wounds. If water changes stress your fish, decrease the amount of water or frequency that you change."
    },
    {
      "title": "Use medicine products to treat your tank.",
      "content": "Use medicine products to treat your tank. There are many products available at your local pet store that can help treat ich. Always follow the instructions labelled on the medication for the correct dosage amounts and if it's safe to use on your type of fish, especially if you have invertebrate fish such as snails, shrimp, and clams. Always perform a water change and vacuum your gravel before you administer the medicine. Medicine is more effective in a clean tank without other dissolved organics or nitrates to get in the way. Always remove the carbon from your filter as the carbon can neutralize or entrap medicines added to the tank."
    },
    {
      "title": "Use copper to treat saltwater fish with ich.",
      "content": "Use copper to treat saltwater fish with ich. Since saltwater ich lasts much longer in their tomite phase, copper is often added to the tank for 14 to 25 days and works similarly as salt to destroy ich. However, using copper requires you to put in the exact and correct dosage and diligently check copper levels in your tank daily with a copper ion test kit. Do not use copper to treat freshwater fish because it could kill them. [4] X Research source Always follow the instructions on the product. Remove the carbon from your filter as the carbon can neutralize or entrap medicines added to the tank. Copper combines with calcium carbonate or magnesium carbonate based rocks, sand, and gravel so be sure to only use copper in a bare tank. Copper is highly toxic for invertebrates, reefs, and plants. Separate invertebrates, reefs, and plants and treat them with other safe methods."
    },
    {
      "title": "Use stronger chemicals to treat saltwater ich.",
      "content": "Use stronger chemicals to treat saltwater ich. These methods can be dubbed as dangerous alternatives to treating ich. Some even damage your fish and must be constantly monitored so levels don't reach to a point where your fish might die from the chemical. Always read the label of these chemical medicines and wear protective clothes like gloves and goggles when handling them. Some treatments are: Malachite green: Similar to chemotherapy in humans, malachite green works to damage all cell's ability to produce energy which is vital for metabolic processes. This chemical doesn't differentiate from a fish's cell to the cell of an ich parasite. Formalin: Formalin kills microorganisms by reacting with a cell's proteins and nucleic acids which alter the cell's function and structure and often used to preserve biological specimens. It can damage your filter system, deplete oxygen levels and kill invertebrates or weaker fish."
    },
    {
      "title": "Never buy fish from a tank where any fish displays symptoms of white spot disease.",
      "content": "Never buy fish from a tank where any fish displays symptoms of white spot disease. Before purchasing your tank inhabitants, it's always best to observe every fish in the store for signs of disease. Even if the fish you want doesn't seem to show signs of ich, it is still exposed to and may carry on ich into your aquarium at home. Some fish have very good immune systems and may just act as carriers to the disease. By introducing a carrier to ich, you are exposing your resident or current tank inhabitants to ich who may or may not have similarly strong immune systems as your new fish."
    },
    {
      "title": "Quarantine any new fish for 14 to 21 days.",
      "content": "Quarantine any new fish for 14 to 21 days. Set up a separate smaller tank so you can observe your new fish for signs of disease. If there are any diseases present, treatment will be much easier but always do the full treatment dosage amounts. Don't think that a small tanks means you only need to do a reduced amount of treatment. When you add new fish to a quarantine tank or any tank, never add the water it was previously in into your aquarium. This reduces the likelihood of transferring tomites into your tank."
    },
    {
      "title": "Use separate nets for separate tanks.",
      "content": "Use separate nets for separate tanks. This prevents the introduction of diseases to other tanks. Similarly, use different sponges and other cleaning tools for each tank. If you can't afford multiple nets, sponges, and cleaning tools, allow for each item to completely dry before using it on another tank. Ich cannot survive in a dry environment."
    },
    {
      "title": "Buy plants only from tanks without fish.",
      "content": "Buy plants only from tanks without fish. Plants in tanks with fish carry more diseases than those grown and sold separately. Alternatively, you can quarantine tanks for 10 days without fish and treat them with ich treatments to be sure that it isn't infected."
    }
  ]
}