{
  "url": "https://www.wikihow.com/Trace-Your-Ancestry",
  "title": "How to Trace Your Ancestry",
  "steps": [
    {
      "title": "Ask questions.",
      "content": "Ask questions. Find out as much as you can about your family history. Look through old photo albums, and ask your family members what they know. Ask for the names of grandparents, great-grandparents, and other relatives, as far back as they can remember. Determine the names, locations, and timelines of the ancestors you want to know about. Make sure to get the exact spelling. Learn about any spelling changes that may have taken place over the years. Perhaps your ancestors changed their names when they moved to a new country or community. Family members can be the simplest way to the past. Do not assume that your parents, grandparents, and other relatives have already told you everything that they know. Older relatives may remember further back."
    },
    {
      "title": "Build on prior research.",
      "content": "Build on prior research. Find out whether your family has done any genealogy research before. Look for any existing (online or physical) documents that tell about your family. Also, look for pictures that can give you a sense of what life was like back when the photo was taken. Look for family trees, records, and research projects that might give you a solid starting point."
    },
    {
      "title": "Make a family tree to organize what you know.",
      "content": "Make a family tree to organize what you know. Start with yourself, and map out everything that you know about your family history. Trace the chain of ancestry backward through your parents, your grandparents, your great-grandparents, and beyond. Add birthdays, death dates, marriages, locations, and any other relevant information."
    },
    {
      "title": "Make a simple \"direct route\" list first.",
      "content": "Make a simple \"direct route\" list first. Branch into the past from you to your mother and father, then their parents, and then their grandparents By the time you list your great-grandparents, you already have 15 people on your \"tree\". To start your quest, find out as much as you can about those 15 people. Try running a simple web search. Find out when and where these ancestors were born. Note when these people married, and how many children they had. Figure out when and where these people died."
    },
    {
      "title": "Search the census records.",
      "content": "Search the census records. Use the US Census online at Ancestry.com. Start with the most recent ancestors: find their names on each census, and work backward into the past. The online censuses are indexed – so if you put in the name and birthday, it may bring up the correct person along with other possibilities. As you start building the family tree, note the details that suggest other areas to search – e.g. someone's occupation. If your family member doesn't show up on the census, try editing the search. Add or remove words to clarify the results. Search for their maiden name as well as the married name of female ancestors. The census records may confirm or suggest a marriage date. Be aware that the spelling of names may have changed. Some ancestors may not have been able to read or write well, and they may have used uncommon spellings. Old censuses may indicate whether or not a person was literate."
    },
    {
      "title": "Narrow down your search results.",
      "content": "Narrow down your search results. After checking the census history, try a search of all records. It may help to narrow the records down to marriage and divorce, or immigration, or military. Search any census category that might include your ancestors. Try using tax and voter lists."
    },
    {
      "title": "Use naturalization papers.",
      "content": "Use naturalization papers. If your ancestors came from another country, you may need to look for their immigration and naturalization papers. Naturalization papers have two parts: the papers and the final application. Unless you have that second paper, you can't be sure they were naturalized. They could have waited several years between the two, and the final paper could be in a different courthouse – even a different part of the country. Use the census to trace where your ancestors lived, and look for naturalization records in those places. Consult the passenger lists of ships. If your ancestors immigrated across the sea, you might be able to figure out exactly when if you find their name."
    },
    {
      "title": "Track down physical records.",
      "content": "Track down physical records. If you know where your ancestors were married, go to that location (church, courthouse, etc.) and ask for access to their records. Marriage certificates often feature the names of the parents of the bride and groom's parents. This may be a useful clue to get you on track. See if the location was used for other ancestors, and look for their records as well."
    },
    {
      "title": "Find your ancestors' gravestones.",
      "content": "Find your ancestors' gravestones. If you know where your deceased relatives are buried or commemorated, visit the cemetery in person. Look for clues: birth and death dates, names that don't match your records, or other relatives buried nearby. Don't be afraid to travel to distant cemeteries if your ancestors lived and died in various places. You might find it valuable to physically trace your ancestry by making it a journey."
    },
    {
      "title": "Use baptism records to suggest birthdays.",
      "content": "Use baptism records to suggest birthdays. If your ancestors' church baptized children, look through the baptism records. If you don't know an ancestors exact date of birth, the baptism can help you approximate when a given family member was born. Most baptisms are done soon after birth. You should also be able to find marriage and death records in the church archives. Church records are not always complete. If the church is far from you, call before you travel."
    },
    {
      "title": "Explore online ancestry-research services.",
      "content": "Explore online ancestry-research services. In most cases, you will pay someone to go out and research your family tree. You will need to provide as much relevant information as possible, including names, locations, dates, professions, and connections. This can be a great option if you don't have the time, energy, or inclination to do the legwork yourself. [1] X Research source Be careful. Some of these services are scams. Read reviews and inform yourself before you pay any money."
    },
    {
      "title": "Contact local ancestry research groups.",
      "content": "Contact local ancestry research groups. Find out if there is a genealogy research group in your area, or the area where your ancestors lived. These groups may have some records of your family. Many of these societies are based online, although they may also keep physical records."
    },
    {
      "title": "Use free trials.",
      "content": "Use free trials. Websites such as ancestry.com are build to find this sort of information, and their free trials can help you dive quickly into the past. Each trial gives you access to a large database for a short period of time. You will need to be motivated, and you will need to dedicate a brief and intense effort to your research. However, you might be able to learn a lot."
    },
    {
      "title": "Consider DNA testing.",
      "content": "Consider DNA testing. [2] X Research source There are a number of services that run saliva samples through lab tests to isolate hereditary genetic factors. You may be able to tell, for instance, that you have genes only found in a specific part of the world. These services are usually more expensive than paying someone to look through the records. For the price, however, you might be able to learn much deeper information."
    }
  ]
}