{
  "url": "https://www.wikihow.com/Top-10-Pranks-to-Do-at-Home",
  "title": "10+ Easy & Hilarious Pranks to Play on Your Family & Friends",
  "steps": [
    {
      "title": "Tape a large plastic bug on the inside of a lampshade.",
      "content": "Tape a large plastic bug on the inside of a lampshade. This is a classic, easy prank that can make your family members jump. All you need to do is tape a plastic bug or spider to the inside of a lampshade. When someone turns on the light, they’ll think there’s a creepy crawler hanging out inside! [1] X Research source"
    },
    {
      "title": "Put flour in someone’s hair dryer for a white powdery surprise.",
      "content": "Put flour in someone’s hair dryer for a white powdery surprise. For this one, pour about ¼ cup (30 g) of flour inside your family member’s hair dryer. When they turn it on after they shower, the flour will puff out in a huge cloud all over their head!"
    },
    {
      "title": "Tape a harmonica to someone’s car so it whistles while they drive.",
      "content": "Tape a harmonica to someone’s car so it whistles while they drive. Before everyone else has woken up for the day, go out and tape a harmonica to your family member’s exhaust pipe on their car. When they drive off to go to work or school, they’ll wonder where the loud whistling noise is coming from! Alternatively, tape the harmonica to your family member or friend’s bumper. This won’t make as much noise as the exhaust pipe, but it might confuse them for longer!"
    },
    {
      "title": "Fill a Boston cream donut with mayonnaise instead of cream.",
      "content": "Fill a Boston cream donut with mayonnaise instead of cream. Buy a cream-filled donut (or make one yourself ) and scrape out all of the cream from the inside. Then take a piping bag , fill it with mayonnaise, and pipe it inside the hole. When someone bites into it, they’ll get a gross surprise! [2] X Research source If you get a box of donuts, eat the rest of them (or give them away) and fill the box with bananas and other fruits and veggies. When someone opens the box looking for a sweet treat, they’ll be immediately disappointed!"
    },
    {
      "title": "Fill a sterile cup with apple juice and drink it throughout the day.",
      "content": "Fill a sterile cup with apple juice and drink it throughout the day. Buy one of those medical drug-testing cups and pour apple juice inside to look like a urine sample. Then leave the cap off, drink it in the living room, and savor the disgusted and confused looks of all your family members! [3] X Research source"
    },
    {
      "title": "Place confetti on the tops of all of the fan blades.",
      "content": "Place confetti on the tops of all of the fan blades. Get a bag of paper confetti and carefully place the flakes on top of all the blades on one of the fans. When someone flips the switch or pulls the string to turn on the fan, all the confetti will come cascading down! [4] X Research source Do this prank on the fan in your living room to get everyone at once, or put it all on the fan in your sibling's or parents’ room to get a specific person."
    },
    {
      "title": "Wrap grapes in silver foil to look like chocolate Easter eggs.",
      "content": "Wrap grapes in silver foil to look like chocolate Easter eggs. If Easter is just around the corner, this might be the perfect prank. You only need to wrap grapes in silver foil or old chocolate egg wrappers to look like Easter treats. Then hand them out to all your family members or put them in a bowl and wait for the next unsuspecting victim! [5] X Research source"
    },
    {
      "title": "Change the language on someone’s phone or computer.",
      "content": "Change the language on someone’s phone or computer. Sneakily steal one of your family member’s phones for a few minutes and change its language. Once you put it back, they’ll be confused and frustrated when nothing on their phone makes sense! [6] X Research source Android: Open Settings and go to “System” > “Languages & Input” > “Languages.” Select another language from the list, then drag the new language to the top of the list. [7] X Research source iPhone: Open the Settings app. Go to “General” > “Language & Region” > “Add Language…” and select a language (that they don’t speak) from the list. [8] X Research source"
    },
    {
      "title": "Put baby carrots or other objects in your fridge’s ice dispenser.",
      "content": "Put baby carrots or other objects in your fridge’s ice dispenser. Open the door to your fridge’s ice dispenser and swap out the ice with an object of your choice. You can use jelly beans, brussels sprouts, plastic spiders, or other small items. When your family member tries to get ice in their drink, they’ll get a cup full of baby carrots instead! [9] X Research source If your fridge doesn’t have a dispenser, try putting jelly beans or other small items in your ice cubes before you freeze them."
    },
    {
      "title": "Tape balloons all over every window and door.",
      "content": "Tape balloons all over every window and door. Blow up colorful balloons and attach plastic wrap around any glass doors and windows facing the front of the house. Place the balloons between the plastic wrap and the glass to make it look like your house is filled with them! For extra points, fill an entire room with balloons, like a bathroom or someone’s bedroom."
    },
    {
      "title": "Replace all the photos in your house with photos of Danny Devito.",
      "content": "Replace all the photos in your house with photos of Danny Devito. Print out pictures of Danny Devito, your favorite celebrity, or yourself, and replace all the picture frames in your house with them. You can do this slowly over time and wait for one of your family members to figure it out, or replace all of the photos at once for a more shocking surprise! [10] X Research source Alternatively, edit all of your photos to include a celebrity in your household’s greatest vacation pictures and family photos."
    },
    {
      "title": "Fill a small cup with glitter and put it on top of a cracked door.",
      "content": "Fill a small cup with glitter and put it on top of a cracked door. All you need to do is fill a plastic or styrofoam cup with glitter and open a door just enough so you can rest the cup between the door frame and the top of the door. When someone opens it, they’ll get covered in sparkles! This prank is a little more messy than the rest, so make sure to help clean up afterward."
    },
    {
      "title": "Place dye tablets or food coloring in the sink faucets.",
      "content": "Place dye tablets or food coloring in the sink faucets. Unscrew the aerator from the tip of the sink faucet and pop one of those tablets of dye used for coloring Easter eggs or pour a couple of drops of food coloring inside . Screw the aerator back on, and when a family member turns on the tap, their hands will be covered in whatever color you choose! [11] X Research source"
    },
    {
      "title": "Put a straw inside a mustard packet and slip it into a tasty drink.",
      "content": "Put a straw inside a mustard packet and slip it into a tasty drink. Get a packet of mustard, ketchup, or whatever sauce you’d like and snip off the corner with a pair of scissors. Stick a straw inside and wrap a piece of tape around the packet’s opening to secure it. When someone isn’t looking, replace their straw with the booby-trapped one! [12] X Research source"
    },
    {
      "title": "Hook up a wireless mouse to someone’s computer.",
      "content": "Hook up a wireless mouse to someone’s computer. If you have a family member who works from home or someone who spends a lot of time on the computer, plug a wireless mouse into their USB port. When they’re online, wiggle the mouse around and listen to how frustrated they get from the other room!"
    },
    {
      "title": "Switch all of the furniture in 2 people’s bedrooms.",
      "content": "Switch all of the furniture in 2 people’s bedrooms. This might work best if you have 2 or more siblings you can mess with. When neither of them is home, move all of their furniture from one room to the other. When they get home, they’ll be so confused and wonder how all of their stuff got there!"
    },
    {
      "title": "Hide small plastic ducks all around the house.",
      "content": "Hide small plastic ducks all around the house. Buy a bag of 200 small plastic ducks and place them all around everyone’s rooms. Put them in cabinets, inside the sugar and flour containers, in socks or shoes, and on top of every picture frame to confuse your parents, siblings, and other family members! For bonus points, label each duck from 1 to 220, skipping numbers 180 to 200. That way, your family will be searching for (or silently expecting to find) the last 20 forever."
    },
    {
      "title": "Wrap everything your parents or sibling(s) own in wrapping paper.",
      "content": "Wrap everything your parents or sibling(s) own in wrapping paper. This prank might take a lot of time, tape, and wrapping paper, but it’s totally worth it. Just imagine your family member’s reaction when they come home from a long day of work or school…only to find everything in their room carefully wrapped like a present. [13] X Research source Try to wrap everything, including any pens, pencils, door handles, and plant pots. Alternatively, use newspaper, aluminum foil, or large-scale pictures of you!"
    },
    {
      "title": "Empty an egg or two without breaking the shell and ask for an omelet.",
      "content": "Empty an egg or two without breaking the shell and ask for an omelet. This prank is not only funny, it will blow your family member’s mind. Take a room-temperature egg and put a small piece of tape on the top and bottom. Use a needle to gently poke a hole in the top of the egg, holding it over a bowl to catch any liquid that comes out. [14] X Research source Poke a hole through the bottom and wiggle the needle around to widen it. Swirl the end of the needle around inside the egg to break up the yolk. Flip the egg so the narrow end is on top and blow air into the hole. Once all of the egg is in the bowl, rinse the inside and outside of the egg with water. Let the egg dry completely before removing the tape and putting it in the fridge. Ask a family member to make you an omelet and watch for their reaction!"
    },
    {
      "title": "Stick googly eyes to everything in your house.",
      "content": "Stick googly eyes to everything in your house. Take a bag of stick-on googly eyes and attach them to all the appliances, objects, and pictures in your house. This fun prank will have your parents and siblings finding the jiggly eyes for weeks! [15] X Research source"
    }
  ]
}