{
  "url": "https://www.wikihow.com/Start-Spotify-Jam-on-Discord",
  "title": "Listen to Music on Spotify with Friends on Discord",
  "steps": [
    {
      "title": "Make sure your Spotify is connected with your Discord.",
      "content": "Make sure your Spotify is connected with your Discord. While you can start a jam in Spotify and share the link with others to listen in, you can also stream your music on Discord for others to enjoy. Follow these steps to connect Spotify to Discord : Go to Settings > Connections and click the \"Spotify\" icon. Log into Spotify and make sure the toggles are enabled."
    },
    {
      "title": "Listen to music on Spotify.",
      "content": "Listen to music on Spotify. If the music isn't playing, you won't be able to invite others."
    },
    {
      "title": "Navigate to the chat where you want to share your music.",
      "content": "Navigate to the chat where you want to share your music. You can't share your music while hanging out in a voice chat, so make sure you're in a text chat with someone. You can invite specific people or entire channels."
    },
    {
      "title": "Click +.",
      "content": "Click + . You'll find this plus icon to the right of the chat field."
    },
    {
      "title": "Click Invite @[NAME]/#[CHANNEL] to Listen to Spotify.",
      "content": "Click Invite @[NAME]/#[CHANNEL] to Listen to Spotify . You'll see a preview of the invite and can add a personalized comment. People that you've invited can click Join to listen along to your music. In a Jam, listeners can add songs to the playlist queue, but they do not have that power if they are listening in with Discord. You can see how many people are listening as well as see their profile icons in the bottom left of your app. [1] X Research source Although this isn't the same as a Jam on Spotify, users listening along can send you a message or request in the channel to add or remove songs to the queue"
    },
    {
      "title": "Spotify isn't connecting to Discord.",
      "content": "Spotify isn't connecting to Discord. Disconnect and reconnect your Spotify account in \"Connections.\""
    },
    {
      "title": "Spotify isn't showing up as my status.",
      "content": "Spotify isn't showing up as my status. Make sure you have the toggle enabled for \"Display Spotify as your status\" in the \"Connections\" menu."
    },
    {
      "title": "They've joined the Listening party, but don't hear anything.",
      "content": "They've joined the Listening party, but don't hear anything. If listeners don't have Spotify accounts, they might encounter some errors. Also, check that Discord has permission to share your audio."
    },
    {
      "title": "Spotify is randomly pausing.",
      "content": "Spotify is randomly pausing. Check your internet connection since a weak or poor connection can cause songs to stutter and pause."
    },
    {
      "title": "Listen to a playlist or song on Spotify.",
      "content": "Listen to a playlist or song on Spotify. This will allow you to start a Jam; you can start or join a Jam on your computer, tablet, or smartphone. While you can invite others to listen to your playlist on Spotify from Discord, listeners cannot add or remove songs from the queue like they can using this method."
    },
    {
      "title": "Click ••• or tap the speaker icon.",
      "content": "Click ••• or tap the speaker icon. Using a computer, this three-dot menu icon is next to a song title or playlist name. The speaker icon will be visible once you start playing a song on your phone or tablet."
    },
    {
      "title": "Click or tap Start a Jam.",
      "content": "Click or tap Start a Jam . You'll immediately see options to share the Jam."
    },
    {
      "title": "Click or tap Share Link.",
      "content": "Click or tap Share Link . You can share the link with your contacts directly or use other apps, like Gmail or Messenger. You can also copy the QR code and send it to others to scan so they can join your Jam session. [2] X Research source"
    }
  ]
}