{
  "url": "https://www.wikihow.com/Style-Your-Hair-(Male)",
  "title": "How to Style Your Hair (Male)",
  "steps": [
    {
      "title": "Determine your facial shape",
      "content": "Determine your facial shape . It's generally understood that not every hairstyle will look good on everyone. This largely has to do with facial shape and features. A useful way to find your facial shape is to stand in front of a mirror and mark the outline of your face (not including your hair or ears) using a bar of soap or makeup pencil. You should be able to see a definitive shape."
    },
    {
      "title": "Choose a style that complements your facial shape.",
      "content": "Choose a style that complements your facial shape. Once you have determined your face shape, try to find a hairstyle that suits the shape. This may require patience, as you may find that you need to grow your hair longer in order to style it appropriately. Here are suggestions for styles based on your face shape:"
    },
    {
      "title": "Figure out your hair type",
      "content": "Figure out your hair type . Is your hair wavy, straight, textured, or curly? Is it fine, medium, or thick? Certain hairstyles will work better with your hair's natural tendencies and can make styling easier."
    },
    {
      "title": "Pick a hairstyle that matches your hair type.",
      "content": "Pick a hairstyle that matches your hair type. While some of these styles work with any hair texture, most work best with a specific hair type. Evaluate what your hair naturally tends to do and find a hairstyle that complements those tendencies. If you have straight hair of any consistency, consider choosing the Prohibition High-and-Tight, let it grow out (as long as it isn't fine), flow and comb it, or crop it. The Prohibition High-and-Tight features very short sides while fading hair shorter into your nape and sideburns. The top should be a little longer, about an inch and a half. To style, use a gel to keep the top combed into place. Don't choose this look if you have wavy or curly hair. To let your hair grow out for a messy look, simply let your hair grow past your shoulders. Styling is simple, just towel dry your hair and apply a little texture cream. The flow and comb starts with a square cut, but is longer on the sides and the top. Apply a mousse to your wet hair , then comb the hair back. Avoid this if you have curly hair. Cropped hair is essentially cut short evenly across the sides and the top. You don't really need styling products with this low-maintenance cut. If you have curly or wavy hair, consider choosing a pompadour , let it grow out, or crop it. The pompadour is simply a classic haircut. The blended cut should be done to a ratio of 2 to 1, top to sides. This basically means that you should leave the sides shorter than the top, but not drastically shorter. Style with a pomade and comb the top into place. Avoid this look if you have very fine, straight, or thin hair . To let your hair grow out for a messy look, simply let your hair grow past your shoulders. Styling is simple, just towel dry your hair and apply a little texture cream. For more of a bed-head look, ask your stylist to add texture and style with a hair gel. Cropped hair is essentially cut short evenly across the sides and the top. You don't really need styling products with this low-maintenance cut. If you have a receding hairline , just keep your hair short. If you're feeling adventurous, you could shave everything off and possibly grow a beard or goatee."
    },
    {
      "title": "Try a variety of styles.",
      "content": "Try a variety of styles. There is no hard and fast rule about hairstyle. While these suggestions may help, you should ultimately find a style that makes you feel comfortable and like yourself. Don’t be afraid to try out different styles every month or so until you find one that you really like."
    },
    {
      "title": "Choose a sideburn length.",
      "content": "Choose a sideburn length. The average length of classic sideburns is the middle point of your ear, but this can be adjusted according to your facial features and head shape. Whatever length you choose, the sideburns should match your hairstyle. So, if you have short hair, the sideburns should be kept short and well trimmed. Sideburns can be longer and thicker with a longer, looser hairstyle. [7] X Research source Longer sideburns can actually make your face look narrower, while sideburns that are shorter than mid-ear length can have the opposite effect. Typically, shorter sideburns work well with longer faces, while longer sideburns can elongate shorter faces. [8] X Research source"
    },
    {
      "title": "Consider your situation.",
      "content": "Consider your situation. If you are choosing a new everyday style, it’s best to keep details about your life in mind. Consider the needs of your workplace, how much time you have to style your hair, and how much effort you are willing to put in to your daily look. Regardless of the hairstyle you choose, it should work with your personality. You'll need to be comfortable with your new style, so don't pick a style that doesn't match your own personal tastes. If your stylist recommends a hairstyle that you don't feel comfortable with, politely tell them how you feel and find something else."
    },
    {
      "title": "Get a new haircut.",
      "content": "Get a new haircut. It helps if you can go to a stylist that you're already familiar with, but if you need to find a new stylist, ask friends or coworkers for recommendations or check the internet and look at the ratings and reviews for local salons. Bring photos of hairstyles you like and ask the stylist if the look would work with your facial shape."
    },
    {
      "title": "Part your hair.",
      "content": "Part your hair. When you're deciding where to place your part, think about your face shape and your natural part. If you have a round face, don't part your hair in the middle - it will emphasize the roundness. If you have a sharp jaw and high cheekbones, a part that's far to one side will highlight these qualities. In general, a part that's a few inches off-center works well for most people. Experiment to see what you like best. You can use your fingers or a comb to part your hair. Keep in mind that finger-combing will result in a wavier, more natural look, while using a fine-toothed comb will make your hairstyle more sleek and structured."
    },
    {
      "title": "Comb your hair",
      "content": "Comb your hair . Unless you're spiking your hair out in every possible direction, you'll notice that most hairstyles have one primary direction in which the hair is combed. You can comb it forward, back, up, to the side, or straight down. Experiment with a few different ways and see what works best for you. Note that most men only style and comb the top portion of their hair, unless their hair is on the long side of medium or longer . The back and sides of most men's haircuts are short enough that they don't require much day-to-day styling."
    },
    {
      "title": "Select hair products.",
      "content": "Select hair products. Unfortunately, most of us need more than water and a comb to style our hair. Start off with less expensive brands while you're experimenting with different types of products. When you find something you like (such as hair clay ), then you can try to find the right brand for you. Here are a few possible products you can purchase, as well as the sort of look they'll help you achieve:"
    },
    {
      "title": "Apply the appropriate styling products and set with hairspray (optional).",
      "content": "Apply the appropriate styling products and set with hairspray (optional). Depending on the product and hairstyle, you may want to apply the styling product before you comb your hair. If you're worried about your hair drooping or losing its structure throughout the day, mist it with hairspray as soon as you're finished styling. You can choose a product with light or strong hold (just remember that \"strong hold\" means \"more alcohol,\" which can make your hair look more brittle). Be sure to keep the hairspray at least six inches away from your hair when spraying it. Avoid spraying too much or your hair might clump together and look hard. Hair wax is also a simple way to set your hairstyle. Just rub a little bit of wax between your fingers until it softens and then pinch it between strands of hair to work it in."
    },
    {
      "title": "Consider your styling needs and situation.",
      "content": "Consider your styling needs and situation. Why are you styling your hair? Are you going to prom? Meeting your girlfriend's parents? Just want cool hair? Make the look match the situation. Keep in mind that formal events call for more traditional hairstyles. Your cousin may not want you to wear a high Mohawk to her wedding. It may be best to choose a style that is close to your everyday style for an important event; this will help you feel more comfortable during the event."
    },
    {
      "title": "Use quality products.",
      "content": "Use quality products. If you started using cheap products for your daily style, you may want to consider springing for better quality products for your special occasion. Cheap products are more likely to cause build-up or undesired effects such as making your hair look either too dry or too oily. Be sure to use the products a couple of times before the special occasion so that you know how your hair reacts to the product."
    },
    {
      "title": "Ask for input.",
      "content": "Ask for input. If you are going to a formal event, such as prom or a wedding (as a guest or a member of the wedding party), you may want to ask someone for styling help for the event. A professional stylist, a parent, or even your date may be able to offer suggestions for what would look nice on you."
    },
    {
      "title": "Make everything crisp and neat.",
      "content": "Make everything crisp and neat. The most important aspect of your special-event hairstyle is that it should look like you spent time trying to make your hair look perfect. Your part should be made with a comb so that it looks sharp. You should use product to keep the hair where you intend for it to be. A quality hair product that adds a bit of shine or a wet look often works for events."
    },
    {
      "title": "Make a “refresher” plan.",
      "content": "Make a “refresher” plan. If the event that you are attending is going to last more than an hour or two, you may need to refresh your hair to keep it looking neat. This can be as simple as keeping a small comb in your inside jacket pocket, wetting it in the men’s room, and running it through your hair. This will likely re-activate your styling product (particularly hair gel) and can help you make it to the end of the event still looking snazzy."
    }
  ]
}