{
  "url": "https://www.wikihow.com/When-Is-Enough-Enough",
  "title": "17 Signs Enough is Enough: Expert Advice on When to Walk Away",
  "steps": [
    {
      "title": "It’s a red flag if your partner depletes you emotionally.",
      "content": "It’s a red flag if your partner depletes you emotionally. While all relationships go through periods of stress in our relationships, more times than not, your partner is supposed to make you feel safe and recharge your emotional battery. If you notice yourself feeling constantly irritable or fatigued after time with them, they may be straining your mental, physical, and spiritual health. It’s your right to have a healthy and meaningful life so seriously consider if the relationship is worth it. To fix an emotionally draining relationship , have a conversation with your s.o and try to figure out the core of your relationship’s problem. To narrow it down, it can help to each rank the success of your relationship on a scale of 1-10 in various areas. [1] X Research source For example, if you both rate your partnership to have an 8 in physical affection, and a 9 in trust, but a 3 in communication, this is a sign you need to work on making each other feel more understood. However, these high scores in other areas show your relationship is fixable. Meanwhile, if you each rate 4’s across the board, it’s a sign you feel below average pretty often and it may be time to end things. In addition, if you have widely different scores (i.e. one gives a 7, the other a 2), you may need to re-discuss how you each see your relationship."
    },
    {
      "title": "A relationship will struggle if you both don’t have a clear sense of self.",
      "content": "A relationship will struggle if you both don’t have a clear sense of self. While a little codependence is necessary to grow as a couple, feeling like you’ve lost your identity can create bitterness and resentment. If you notice yourself losing self-image, passion for individual interests you used to have, or neglecting time for friends outside of your partner, you may be losing yourself in your relationship. Remember: you can’t be a good partner if you don’t have a firm grasp on your own extraordinary value. [2] X Research source While losing yourself in your relationship for years can be a sign that enough is enough, you can often avoid it with a bit of time apart and self-care. Schedule at least 1 day a week where you do something by yourselves and avoid canceling other social plans to be with your partner. [3] X Research source"
    },
    {
      "title": "Lack of joy is a key sign that enough is enough.",
      "content": "Lack of joy is a key sign that enough is enough. If you find yourself stressed, depressed, or angry more often than you do fulfilled or content, your relationship may have too much friction to stay afloat. Specific signs you may not be happy with your partner include: constantly finding excuses not to spend time together, not having positive things to say when people ask about your relationship, and a lack of physical or verbal affection for each other. [4] X Research source Oftentimes, unhappy relationships come from a failure to meet each other’s emotional needs. Communicate your relationship needs to your partner by offering specific examples and avoiding blaming or judgemental language. For example, instead of saying “You never show me you care about me” which is vague and confrontational, you might say “It would make me feel more loved if you told me something you liked about me each day.” This way, your partner has a clear blueprint to be more affectionate."
    },
    {
      "title": "It may be time to end things if your future plans don’t align.",
      "content": "It may be time to end things if your future plans don’t align. While compromise is key to a healthy relationship, you and your partner must have similar plans for the future to grow as a couple. If you see your lives moving in completely opposite directions (wanting to settle down in different cities, you want kids while they don’t), it’s better to end things sooner rather than later. Breaking up sucks, but you deserve to accomplish everything you want out of life without the pressure of appeasing someone else. [5] X Research source Find out what your goals are for your relationship by making a list of things you want and separating it into categories of “willing to compromise” and “dealbreakers.” Then, communicate this list to your partner. For example, you may want to live in Denver, but be open to moving somewhere else while you refuse to raise your child with a specific religion and won’t budge on that belief."
    },
    {
      "title": "Poor communication is a primary reason people end relationships.",
      "content": "Poor communication is a primary reason people end relationships. If you and your partner aren’t actively listening to each other, it can make you feel frustrated and misunderstood which can lead to distance and hostility. Signs your communication is lacking include: shutting down during emotional conversations, yelling or screaming, passive-aggressiveness, being dismissive of each other’s concerns, and defensiveness. [6] X Research source Luckily, quality communication is like a superhero in relationships; it can save dynamics that feel broken. To communicate better, use “I feel” statements. “I feel” statements show you’re taking responsibility for your own emotions, which makes your partner less likely to get defensive. For example, instead of saying “You make me feel lonely and distant” (which your partner might take as a criticism of their values), you might say “I feel lonely when you zone out during our conversations.” This makes it clear which exact behavior is causing a rift between you. In addition, practice active listening by validating each other’s feelings, then restating each other’s thoughts in your own words. For example, if your partner says “I’ve had a rough day at work,” you might respond “Your job today was stressful.”"
    },
    {
      "title": "If your partner is overly controlling or jealous, it may be best to leave.",
      "content": "If your partner is overly controlling or jealous, it may be best to leave. Respecting each other’s privacy is key to a healthy relationship. If your partner refuses to let you out of your sight, violates your personal space, or tries to make decisions for you without your permission (telling you who you should/shouldn’t be friends with, what you should wear, etc), it may be best to say enough is enough. They need to work on their control issues and you’re entitled to more respect. [7] X Research source Healthy boundaries are the best way to prevent possessiveness in your relationship. Establish your boundaries by clearly yet kindly defining what you are and aren’t okay with, and outlining the consequences if your partner violates this boundary. For example, you might say “I understand that you may not like my friends, but I refuse to let you forbid me from seeing them. If you continue to do so, I don’t think we can live together.”"
    },
    {
      "title": "Without trust, it’s nearly impossible to build a healthy relationship.",
      "content": "Without trust, it’s nearly impossible to build a healthy relationship. If you’re constantly suspicious of each other, you accuse each other regularly of being unfaithful, or you’re unable to shake feelings of anxiety, doubt, and jealousy whenever your partner is around somebody else, it’s best to listen to your gut, and walk away. Trust is the foundation of a healthy partnership and you deserve to be with someone who makes you feel unconditionally supported. [8] X Research source Not all trust issues are malicious. If one of you has faced abandonment in the past, you may be projecting that pain onto your partner. Overcome these trust issues by recognizing your past trauma, communicating it to your s.o, and talking to a therapist to help you work through it."
    },
    {
      "title": "If your partner isn't dependable, they aren't ready for a relationship.",
      "content": "If your partner isn't dependable, they aren't ready for a relationship. As much as romantic partnerships are about affection and communication, they’re also about responsibility. If your partner refuses to take accountability for their actions, makes excuses, or tries to shift the blame onto others, this could point to an overall immaturity that they need to work on before they’re ready to commit to you. Consider taking a break; their irresponsibility isn’t fair to you. You can help hold each other more accountable by attending couples counseling. Having an objective presence like a therapist there to mediate and remind you of past words and behaviors makes it harder to deflect and allows you to confront past mistakes in a safe environment. [9] X Research source"
    },
    {
      "title": "It’s a red flag if you want affection but you aren’t receiving it.",
      "content": "It’s a red flag if you want affection but you aren’t receiving it. If you’re the one who’s always initiating conversations and physical affection (kisses, hugs, etc.) or you’re the one who’s always making plans while your partner just goes along for the ride, this could point to a lack of effort on your significant other’s part. This lack of effort can make you feel undervalued and it’s worth considering whether or not the relationship is worth it. When in doubt, talk to your partner about this problem. They may not even be aware they’re doing it and sometimes just bringing it to their attention kindly yet clearly is enough. Also, pay attention to your partner’s attachment style. Some people are naturally avoidant and may need to regularly distance themselves from intimacy. It’s nothing personal; your partner may just be wired that way. You can identify your attachment style by taking the quiz here . Reader Poll: We asked 1111 wikiHow readers, and 66% of them agreed that the most relatable sign that their relationship isn’t in the best place is there's little to no physical or emotional intimacy . [Take Poll]"
    },
    {
      "title": "If sex is infrequent or unenjoyable, there’s a problem.",
      "content": "If sex is infrequent or unenjoyable, there’s a problem. Physical affection is not only pleasurable and great for relieving stress. [10] X Research source It’s also key to enhancing communication and making you both feel wanted and valued. [11] X Research source If neither of you have been “in the mood,” there’s likely a greater core issue at play that needs to be dealt with if you want to move forward as a couple. Remember: it’s totally fair to want more physical affection. Oftentimes, we neglect physical intimacy because we feel pressured and/or forget to prioritize closeness. Improve your sex lives by making time for romance and other activities that encourage closeness (taking a dance class together, cuddling while watching a movie, etc.) In addition, communicate your sexual desires and insecurities openly with each other. The less you bottle them in, the less power they hold over you and the more physical intimacy feels warm and playful rather than heavy or scary."
    },
    {
      "title": "Cheating is a pretty major red flag.",
      "content": "Cheating is a pretty major red flag. It violates both the trust and respect of your relationship. Maybe your partner has come clean and outright told you they were intimate with somebody else. Maybe you picked up on it through clues like them being more secretive or spending a lot of time away from home. [12] X Research source Either way, the action is inexcusable and it’s perfectly reasonable to walk away from the relationship after your partner has been disloyal. If you want to make the relationship work, remember when coping to give yourself time to heal. In addition, while you may forgive your partner, recognize and explain to them that the future of your relationship may never be the same. It will take a lot for this breach of trust to be restored. [13] X Research source"
    },
    {
      "title": "If all you two do is argue, it may be time to say enough is enough.",
      "content": "If all you two do is argue, it may be time to say enough is enough. Every relationship goes through hiccups and misunderstandings. However, if, for the past several months, all you can remember is disagreement, this may be more of a sign of incompatibility and/or contempt than miscommunication. If you’ve tried to stop these arguments but they just keep coming, it may be time to end the partnership and find someone who makes you feel more at peace. [14] X Research source Stop the fights in your relationship by voicing your frustrations to your partner immediately rather than sitting on them and letting them build resentment. [15] X Research source In addition, avoid using accusatory language (“you always,” “I can’t believe you”) and try to use humor or affection to diffuse the situation any time things get too tense. For example, you might ask to pause and give each other a hug anytime things get heated."
    },
    {
      "title": "Broken promises can cause a lot of disappointment in a relationship.",
      "content": "Broken promises can cause a lot of disappointment in a relationship. Committing to something/someone and failing to follow through can weaken your faith in each other. [16] X Research source Plus, if breaking promises is a consistent habit, it can signal an overall lack of responsibility and self-control. Regardless of how intense the commitment is, if your partner keeps saying they’ll change their behaviors but doesn’t, it may be worth re-examining the relationship. If you’re struggling to forgive your partner after they’ve broken a promise, communicate your hurt feelings to them. Then, let them go. Remember that holding a grudge only hurts you in the long run since you’re the one who must bottle that pain in. It can help to hold some sort of ceremony when releasing your grudges. Try writing down your grudge on a piece of paper. Then, when you’re ready to let it go, tear the paper up or burn it with a candle to symbolize it being taken away."
    },
    {
      "title": "It’s a red flag if you don’t feel like your best self around your partner.",
      "content": "It’s a red flag if you don’t feel like your best self around your partner. If you notice yourself being patient, kind, and trusting around your friends and co-workers but blunt, anxious, and insecure around your partner, your partner is triggering an emotional response in you that makes you feel uncomfortable. [17] X Research source Oftentimes, this is unintentional. However, your relationship should be a reminder of how wonderful you are. if you don’t like yourself, it’s probably best to walk away. Learn to work through your emotional triggers by labeling your emotions as they come to you. It can help to verbalize “I’m feeling sad” or “I’m feeling excited” as it happens instead of bottling it in. In addition, keep a journal to track your emotions and recognize what each one feels like."
    },
    {
      "title": "A relationship can’t work if you don’t accept each other as you are.",
      "content": "A relationship can’t work if you don’t accept each other as you are. Unconditional love requires you and your partner to support each other for exactly the people you are right now, not your potential or the people you think they could be if you just did x, y, or z. If you keep trying to change each other’s views on religion, family, politics, or anything in between, it will only create more distance which will prevent your relationship from thriving. There’s only one you; you don’t need to change that person for anybody. [18] X Research source The best way to prevent yourself from trying to change people is to set realistic expectations for your loved ones. Before asking your partner to do something, ask yourself: is this request unkind, unreasonable, and/or does it ask them to compromise their core values? If the answer is yes, it’s best to drop it."
    },
    {
      "title": "End the relationship if you’re experiencing abuse.",
      "content": "End the relationship if you’re experiencing abuse. While certain red flags can be overlooked, blatant verbal, emotional, or even physical mistreatment is unacceptable and dangerous. It signals a level of disrespect and lack of boundaries that likely cannot be remedied by just the two of you. Recognize that you deserve better and try to leave as soon as you safely can. Abuse isn’t always obvious. Learn to identify all types of abuse from verbal (malicious comments about appearance or personality) to financial (taking money from you without asking, requesting huge loans, etc.) Leaving an abusive relationship can feel difficult and scary. Reach out to a support group beforehand (friends, family, etc.) to help you transition and cut your partner out of your life if necessary. Remember: abuse is never your fault! If you’re dealing with an abusive physical relationship where you worry for your or your loved ones’ safety, contact The National Domestic Violence Hotline ASAP."
    },
    {
      "title": "Listen to your body and the universe to know when enough is enough.",
      "content": "Listen to your body and the universe to know when enough is enough. Love and commitment (or lack thereof) are feelings at the end of the day. If something has felt off in your relationship for a long time, don’t ignore these warning signs. Your body is wise, so trust your intuition and recognize that you don’t always need a concrete explanation to know if a relationship will work. [19] X Research source However, if all you have to go off of is a gut feeling, it may help to talk to your partner, therapist, or other loved ones to try to get to the bottom of what the problem is and determine if it can be worked through. If you do decide to end your relationship , do so quickly and kindly. Try to keep the focus on your feelings and why you don’t think it can work, rather than what you think your partner may have done wrong."
    }
  ]
}