{
  "url": "https://www.wikihow.com/Split-Your-Estate-Fairly-Between-Your-Beneficiaries",
  "title": "How to Split Your Estate Fairly Between Your Beneficiaries",
  "steps": [
    {
      "title": "Identify your assets.",
      "content": "Identify your assets. Before you can divide your estate fairly, you need to identify what is in your estate. Consider which of the following assets you own: [1] X Research source Real estate. This includes your home, secondary residences, plots of land, etc. If you own it, then it is part of your estate. Business interests. You might be the owner or partner of a business. Find your operating documents and see if you can transfer your business interest after death. Personal property. All of your personal effects, including furniture, clothing, jewelry, books, guns, computers, etc. Intellectual property. If you own creative works, then they are assets. For example, if you wrote a novel, then you own the copyright. Trusts and other property you may own without your name on it."
    },
    {
      "title": "Create a list of financial assets.",
      "content": "Create a list of financial assets. You probably have multiple financial accounts, which are also part of your estate. Identify the following: [2] X Research source Life insurance policies. Retirement accounts, such as IRAs, Roth IRAs, and employer-sponsored plans. Investment accounts, including brokerage accounts and mutual funds. Bank accounts, including checking, savings, money markets, and CDs. Money owed to you. You might have made a loan. Whoever owes you money will owe your estate. You can count this amount as part of your estate."
    },
    {
      "title": "Find assets that won’t pass through probate.",
      "content": "Find assets that won’t pass through probate. You might not have a will, but you might already have a skeletal estate plan. Some assets, such as life insurance and retirement accounts, don’t get distributed through probate. [3] X Research source Instead, you name a beneficiary on the policy, and this person inherits from you. Also look for any account or property with a survivorship feature. For example, you might have a bank account with right of survivorship with your spouse. This means that, at death, the account passes automatically to your spouse without having to go through probate. The same can be true of real estate owned in this way. As you create your estate plan, consider whether you want to maintain the right of survivorship feature or want to change the beneficiary designation on your life insurance policy and retirement accounts."
    },
    {
      "title": "Obtain a copy of your divorce decree.",
      "content": "Obtain a copy of your divorce decree. If you divorced, then a judge divided your marital property. For example, a judge might have given your ex half of your retirement account. You need to know this before you divide your estate between your beneficiaries. Ask your divorce attorney for a copy of the divorce decree if you don’t have it. You might also need to go to the court clerk to obtain a copy of your divorce decree. Read the decree carefully to see what you no longer own."
    },
    {
      "title": "Have property appraised.",
      "content": "Have property appraised. You need to know the current value of your assets. This is easy with cash and investments. However, other assets will need to be appraised. Find a qualified appraiser. A qualified appraiser should be a member of one of the national associations, which include the American Society of Appraisers (ASA), the Appraisers International Society (AIS), and the International Society of Appraisers (ISA), among others. [4] X Trustworthy Source Gemological Institute of America Nonprofit institute responsible for gemological research and education and setting gemstone buying and selling standards Go to source Keep detailed records about the value of the asset. However, realize that some assets will change in value over time and may need to be appraised again."
    },
    {
      "title": "Define “fair.”",
      "content": "Define “fair.” The easiest definition of fair is “equal.” If you have three children, you might want each one to get a third of your estate. However, you might define fair differently, depending on your circumstances. Consider the following: If one of your beneficiaries is disabled, they may need more resources to take care of themselves after you are gone. You might consider establishing a trust for their care. One beneficiary might be your spouse, who you want to give a larger portion of your estate to than you give to your children. Some of your beneficiaries might be your step-children. In this situation, they will probably inherit from their biological parents. You probably will want to leave them less than you leave to your biological children. You might have given one beneficiary gifts during your life. For example, you might have provided the down payment for a child’s home. [5] X Research source One beneficiary might have been instrumental in growing a family business. It makes sense to leave them the business instead of your other children. One of your beneficiaries might waste money because of a gambling or substance abuse addiction. In this case, a trust can help ensure that they cannot spend the money unless they meet certain conditions."
    },
    {
      "title": "Divide your estate equally, if necessary.",
      "content": "Divide your estate equally, if necessary. Total up the value of your estate and then divide it in a roughly equal way. If your estate consists mostly of cash, then it’s easy. However, most of your wealth may be tied up in land, homes, and vehicles. You have some options: Divide up assets based on their value. For example, you might have two children. Your major assets include a home worth $200,000, a summer home worth $100,000, and a retirement account worth $100,000. You can leave one child your home and the other assets to the second child. This results in an equal distribution. Instruct your executor to divide assets equally. In essence, you are kicking the can down the road and leaving it to your executor to divide the property. Instruct your executor to sell everything and then distribute the proceeds to your beneficiaries equally. [6] X Research source Remember that some assets won’t pass through probate, such as life insurance policies, retirement accounts, and some investment accounts. Accordingly, you’ll need to change the beneficiary designations so that things are equal. That said, in community property states (like California or Nevada), your spouse may still receive a payout, even if they were not your beneficiary."
    },
    {
      "title": "Ask your heirs if they want sentimental gifts.",
      "content": "Ask your heirs if they want sentimental gifts. Something small, like a doll house, might not have much monetary value. However, it could be your youngest daughter’s favorite toy from childhood, and she might resent you if you don’t give it to her. You can head off disagreements after your death if you ask your beneficiaries what they want. In your will or trust, you can identify who gets what property using a separate memorandum. Make sure you mention the memorandum in your will or trust. [7] X Research source It might be easiest to give sentimental objects away during your life, particularly if they aren’t worth much. However, problems can arise if the sentimental gift is valuable. For example, think twice before giving a child the family’s summer camp because they always loved it near the lake. This is a major gift, which the other beneficiaries may resent."
    },
    {
      "title": "Hire a lawyer to help you create a fair estate plan.",
      "content": "Hire a lawyer to help you create a fair estate plan. Unless your estate is very simple, you will benefit from an estate planning attorney’s advice. They can carefully analyze your estate and help you decide how to divide it. Obtain a referral from your local or state bar association. Once you have a name, call up the lawyer and schedule a consultation. Ask how much the consultation will cost. The lawyer will probably send you a form to fill out on which you list your assets. The lawyer needs this information to help you decide how to divide the assets between your beneficiaries. Fill out the form as completely as possible."
    },
    {
      "title": "Leave assets using appropriate testamentary vehicles.",
      "content": "Leave assets using appropriate testamentary vehicles. A will or living trust are both popular ways of leaving your assets to your beneficiaries. However, they may not be appropriate in all situations. Part of creating an estate plan is to settle upon appropriate vehicles. A lawyer can help you identify if other options are appropriate. For example, if you have a disabled heir, then you should probably use a special needs trust. By doing so, your heir can still qualify for government disability benefits. If you have children from a first marriage, you might want to create a QTIP trust. This trust allows your surviving spouse to live in property and gain income from assets while living, but the assets pass to your children upon your spouse’s death."
    },
    {
      "title": "Don’t forget the effect of taxes.",
      "content": "Don’t forget the effect of taxes. Taxes can reduce the amount of a gift, so you should consider their effect if you want to make an equal distribution of your estate. Talk about the effect of taxes with your estate planning attorney. For example, you might have given money to a child during your lifetime. If you treat it as a loan that must be paid back, then there will be certain tax consequences. [8] X Research source Your heirs may be subject to inheritance taxes on their gifts. Putting your money and property into trusts and LLCs may be able to reduce the tax burden on your estate."
    },
    {
      "title": "Update your estate plan regularly.",
      "content": "Update your estate plan regularly. You might draft a will or trust 30 years before you die. In the interim, a lot can change which will require you to update the plan. Meet regularly with your estate planning attorney to go over changes in your finances or family. Your attorney can advise you about whether you need to change designations. Updating your estate plan is particularly important if you are trying to divide your estate equally. For example, the value of your investments might soar or crash. Also, you might have sold an asset that you were intending to give to a beneficiary. In these situations, you may need to revise your estate plan to keep things equal. You should also update your estate plan if you move to a different state or if tax laws change. [9] X Research source"
    },
    {
      "title": "Set expectations in advance.",
      "content": "Set expectations in advance. Your beneficiaries might assume they will all get an equal share of your estate. If you are giving unequal shares, you should explain why. Write a letter to your beneficiaries or have a meeting where you talk about how you are leaving assets. [10] X Research source The worst thing you can do is blindside someone after death. Also, some of your heirs might be expecting to inherit a certain amount of money or property. They may even be making decisions right now based on those expectations. It’s only fair to let them know the truth before you die. If they aren’t inheriting as much as they expect, tell them now."
    },
    {
      "title": "Divide the estate equally.",
      "content": "Divide the estate equally. You don’t have to divide the estate equally. However, your children might judge how much you love them based on how much you leave them. If your goal is to reduce conflicts between children, then you probably should divide the estate equally unless one child is disabled. Don’t listen if one child tells you it’s okay that you give another child more. They may be hiding their true feelings. [11] X Research source If you're worried about fighting or resentment, write out explanations and justifications for your gifts. Leave behind messages stating why each person is receiving each gift."
    },
    {
      "title": "Choose your executor or trustee wisely.",
      "content": "Choose your executor or trustee wisely. After your death, your executor is responsible for administering your estate through probate. Similarly, a trustee will distribute assets according to your trust. You should choose someone who is unbiased and who you can trust. Ask your lawyer. Avoid naming a beneficiary as executor or trustee. Your other beneficiaries might think you are showing favoritism. Instead, you could name a trust company as your trustee. [12] X Research source"
    }
  ]
}