{
  "url": "https://www.wikihow.com/Zoom-in-on-Facebook",
  "title": "How to Zoom in on Facebook",
  "steps": [
    {
      "title": "Open your Android's Settings.",
      "content": "Open your Android's Settings. It's the app showing ⚙."
    },
    {
      "title": "Tap Accessibility.",
      "content": "Tap Accessibility . It's listed under the \"System\" heading."
    },
    {
      "title": "Tap Vision.",
      "content": "Tap Vision . You should find it under the \"Categories\" heading."
    },
    {
      "title": "Tap Magnification Gestures.",
      "content": "Tap Magnification Gestures . You'll find it toward the end of the page."
    },
    {
      "title": "Slide the \"Off\" button to the On position.",
      "content": "Slide the \"Off\" button to the On position. It will turn blue and say \"On.\""
    },
    {
      "title": "Tap the Home button.",
      "content": "Tap the Home button. It's the oval-shaped button at the bottom of your phone screen."
    },
    {
      "title": "Open the Facebook app.",
      "content": "Open the Facebook app. It's the blue app with a white \"f\" inside. Sign into Facebook if you haven't already."
    },
    {
      "title": "Tap the screen three times with one finger.",
      "content": "Tap the screen three times with one finger. Your phone should now be in full-screen zoom. Spread two or more fingers out to zoom closer, and pinch in with two fingers to zoom out. Drag and move two or more fingers to make the zoom window scroll around the page. You can also triple-tap and hold one finger anywhere on the screen to magnify its content for a short time. Drag your finger to view different magnified areas on the screen. Once you release your finger, the magnifying effect will disappear."
    },
    {
      "title": "Open your iPhone or iPad's Settings.",
      "content": "Open your iPhone or iPad's Settings. It's a gray app with gears pictured that can be found on your Home Screen."
    },
    {
      "title": "Tap General.",
      "content": "Tap General . It's located in the upper half of the page."
    },
    {
      "title": "Tap Accessibility.",
      "content": "Tap Accessibility . It's in the upper half of the page."
    },
    {
      "title": "Tap Zoom.",
      "content": "Tap Zoom . It's listed under the \"Vision\" heading."
    },
    {
      "title": "Tap Zoom Region.",
      "content": "Tap Zoom Region . You'll find it at the bottom of the screen."
    },
    {
      "title": "Tap Full Screen Zoom.",
      "content": "Tap Full Screen Zoom . You will see a check-mark displayed next to it. The entire screen will zoom in when you activate the zoom feature."
    },
    {
      "title": "Tap the Back button.",
      "content": "Tap the Back button. It's in the upper-left corner."
    },
    {
      "title": "Slide the \"Zoom\" button to the On position.",
      "content": "Slide the \"Zoom\" button to the On position. It will turn green."
    },
    {
      "title": "Press the Home button.",
      "content": "Press the Home button. It's the big circle located at the bottom of your phone screen."
    },
    {
      "title": "Open the Facebook app.",
      "content": "Open the Facebook app. It's blue and has the letter \"f\" in it. Sign in with your Facebook password if necessary."
    },
    {
      "title": "Tap the screen twice with three fingers.",
      "content": "Tap the screen twice with three fingers. You'll need to perform this action quickly in order for it to work. You will be zoomed into the full screen. Tap the screen twice again, with three fingers, to zoom back out. To read the content that's being magnified, use three fingers to scroll side to side and up and down. To zoom in further or zoom out, triple-tap the screen with three fingers; a menu of options will appear. Drag your finger on the line with the two magnifying glasses to the desired zoom level. Moving it to the left (toward the magnifying glass with the \"-\" inside) will make content on the screen appear smaller. Moving it to the right (toward the magnifying glass with the \"+\" inside) will make content appear larger. Tap anywhere outside the screen to close the menu of options."
    },
    {
      "title": "Go to www.facebook.com in your browser.",
      "content": "Go to www.facebook.com in your browser. Sign in with your Facebook password if necessary."
    },
    {
      "title": "Follow the steps below if you are a PC user.",
      "content": "Follow the steps below if you are a PC user. If you are a Mac user, you may skip this step. Press Ctrl-+ to zoom in. Repeat to achieve the magnification effect desired. Press Ctrl-- to zoom out. Press Ctrl-0 to set the zoom back to normal."
    },
    {
      "title": "Use the following commands if you are a Mac user.",
      "content": "Use the following commands if you are a Mac user. Hit Option-Command-8 to turn the zoom feature on. Press the combination of keys again to turn the zoom feature off. Hit Option-Command-+ to zoom in. Hit Option-Command-- to zoom out."
    }
  ]
}