{
  "url": "https://www.wikihow.com/Take-Care-of-Crayfish",
  "title": "How to Take Care of Crayfish",
  "steps": [
    {
      "title": "Buy or catch a crayfish.",
      "content": "Buy or catch a crayfish. You can often find crayfish for purchase at marine shops that sell tropical fish, as well as some pet stores. Before you start shopping around, do a little reading on the different species and their individual needs. It’s a good idea to start with a single crayfish until you have an understanding of how to properly look after them. [1] X Research source Crayfish usually go for $20, or more. With the rarer varieties, they can for $30 or even more! In some parts of the world, you can catch crayfish in streams or other shallow bodies of water. Just grab a small net and start hunting under rocks until you spot one that will make a suitable pet."
    },
    {
      "title": "Set up a tank",
      "content": "Set up a tank to house your crayfish. Generally speaking, the tank you choose should be large enough to hold at least 5–10 gallons (19–38 L) for each crayfish inside. However, a 15–20 US gal (57–76 L) tank is ideal, especially for larger varieties. An air bubbler or long bubble wall is also a must, as it’s possible for crayfish to drown if they stay submerged for too long without a separate source of oxygen. [2] X Research source Crayfish thrive in cool conditions like mud flats and riverbeds, so stay away from heated aquariums. Look for tanks that feature built-in aeration and filtration units to keep the water clean and circulating properly."
    },
    {
      "title": "Fill the tank with fresh, well-balanced water.",
      "content": "Fill the tank with fresh, well-balanced water. Crayfish prefer water with a neutral pH (around 7.0). Ideally, the temperature of the water should remain somewhere between 70–75 °F (21–24 °C). You should have no problem keeping the water at the right temperature if you’ve set up your tank indoors. [3] X Research source A pH testing kit can come in handy for determining how acidic or basic the water in your tank is. You can typically find these kits in the fish section at pet stores, or wherever pool supplies are sold. Avoid adding objects like seashells to your tank, as foreign minerals can throw off the pH of the water."
    },
    {
      "title": "Change the water in the tank",
      "content": "Change the water in the tank at least once a week. Crayfish generate large amounts of waste products that can be taxing on standard aquarium filtration systems. This means you’ll need to stay on top of your water changes in order to ensure that you crayfish enjoys a clean living environment. To change the water in your tank, first drain ¼-½ of its total volume, then slowly top it off with fresh, clean water. [4] X Research source If your tank doesn’t have a filter, it may be necessary to increase the frequency of your water changes to twice a week. Stick to mounted tube or sponge filters only. Crayfish like to dig, which can end up jamming undergravel filters."
    },
    {
      "title": "Incorporate a few natural environmental features.",
      "content": "Incorporate a few natural environmental features. Add elements like rocks, water plants, or lengths of PVC pipe to the bottom of your tank. That way, your crayfish will have a place to play, burrow, or hide away for a while. Large structures like hollow rocks, gerbil tubes, or enclosed containers are particularly good for making crayfish feel safe, especially during their vulnerable shedding period. Shut off any surrounding light sources or keep one side of the tank covered to minimize the amount of light that gets in. Crayfish like it dark. [5] X Research source"
    },
    {
      "title": "Give your crayfish a small amount of shrimp pellets once a day.",
      "content": "Give your crayfish a small amount of shrimp pellets once a day. Sinking shrimp pellets or lobster bites should make up the majority of your crayfish’s diet. Pellet-type foods are high in protein and contain all the nutrients crayfish need to grow and develop healthy shells. Sprinkle the pellets around all of your pet’s favorite hiding spots to make it easy for it to get to them. Crayfish can also have frozen aquarium foods occasionally, such as daphnia, bloodworms, and brine shrimp. Never feed your crayfish live or uncooked shrimp. Shrimp carry diseases that can be fatal to crays. [6] X Research source"
    },
    {
      "title": "Use vegetables to supplement your crayfish’s diet.",
      "content": "Use vegetables to supplement your crayfish’s diet. Every now and then, cut some leaf lettuce, cabbage, zucchini, or cucumber into small strips and drop them to the bottom of the tank. Offerings like peas, carrots, and sweet potatoes are also okay. Crayfish love munching on plant matter, so don’t be surprised if they disappear in a hurry! [7] X Research source It’s perfectly fine for crayfish to eat spoiled or decaying organic matter. In fact, treating your crayfish to veggies that are going bad is a great way to kill two birds with one stone."
    },
    {
      "title": "Avoid overfeeding your crayfish.",
      "content": "Avoid overfeeding your crayfish. One or two shakes of shrimp pellets or a smattering of vegetables per day should be more than enough to keep your crayfish satisfied. Remove any uneaten portions of food soon after feeding your crayfish. Anything left sitting at the bottom of the tank will quickly decompose, dirtying the water and making more frequent changes necessary. [8] X Research source If you're caring for more than one crayfish (which isn’t recommended), it’s okay to double the amount of food you administer. Still, keep an eye out for leftovers and scoop them out whatever remnants you find quickly. Overeating can actually be bad for crayfish, as it causes their exoskeletons to become soft and weak."
    },
    {
      "title": "Protect your crayfish from other fish.",
      "content": "Protect your crayfish from other fish. Crayfish do best when given the run of a spacious tank. However, they’ll generally live in relative harmony with small fish like goldfish, barbs, mollies, swordtails, and neon tetras. Crayfish may display some aggressive tendencies from time to time, but they’re usually too slow to catch and eat the much-faster fish. Crayfish typically only attack sickly fish that sink toward the bottom of the tank. If you discover your crayfish devouring one of its tankmates, chances are it was close to death anyway. There is a more aggressive option if you plan to keep crayfish in a community tank, to cut half of the inner claw to prevent any nipping or aggressive action with a sterilized knife or scissor. This still allows the crayfish to pick up food. Every few months, carefully cut the tips of their claws to ensure they don't start nipping fins again. While crayfish don’t pose much of a threat to other fish, the reverse isn’t always true. Large species like cichlids and catfish have been known to attack crays, often resulting in the injury or death of one or both creatures. It's not recommended that you keep more than one crayfish in a tank. If you do, it will be important to make sure they have plenty of space to themselves, and that they’re the same species. Crayfish of different species are more likely to try to kill each other."
    },
    {
      "title": "Provide your crayfish with the right conditions as it molts.",
      "content": "Provide your crayfish with the right conditions as it molts. Every few months, your crayfish will shed its outer shell to make room for a new one large enough to accommodate its growing body. You may be tempted to remove the old shell afterwards, but don’t. It will feed on the shell for several days in order to extract the nutrients and minerals it needs to create a strong new layer of armor. [9] X Research source Don’t bother feeding your crayfish in the first 3-5 days after it molds. During this time, it will only eat the old exoskeleton. [10] X Research source Add a few drops of potassium iodine to the tank when your crayfish begins exiting its shell. Molting crayfish have been known to die off as a result of iodine deficiency. You can find potassium iodine at any store that stocks aquatic pet accessories. [11] X Research source Your crayfish will be especially vulnerable to malnutrition and attacks from other fish with its soft body exposed."
    },
    {
      "title": "Keep your tank covered to make sure your crayfish doesn’t get out.",
      "content": "Keep your tank covered to make sure your crayfish doesn’t get out. Crayfish are natural explorers, which means they can turn into little escape artists when no one is looking. Ideally, you should opt for a tank with a removable lid to guarantee that your cray stays confined. If that’s not an option, use small pieces of sponges to seal off any openings near the top of the tank, especially around the filter. Don't use pieces of plastic, or aluminum foil, which that will be harmful to crays if they eat it. Be vigilant about blocking off all potential escape routes. If your crayfish manages to find a way out of its tank, it can dehydrate and die in just a few hours. Never put a runaway crayfish back in its tank immediately. Instead, place it in a shallow container with just enough water to cover it. Its gills will need time to get acclimated to the water again—otherwise, it can actually drown when fully submerged. [12] X Research source"
    }
  ]
}