{
  "url": "https://www.wikihow.com/Stop-Being-Selfish",
  "title": "How to Stop Being Selfish",
  "steps": [
    {
      "title": "Practice putting yourself last.",
      "content": "Practice putting yourself last. If you're a selfish person, then chances are that you're always looking for #1, well, first. You've got to change that as soon as you can if you want to start living a life filled with joy and free of selfishness. [2] X Research source The next time you're doing something, whether you're in line at a buffet or waiting for your seat on the bus, stop and let other people have what they want first, whether it's food, comfort, or ease. Don't be the person who always thinks me, me, me and has to get everything first. Remember that other people are every bit as special as you are, and that other people deserve to get what they want, too. Make a goal of putting yourself last in at least three situations this week. See how much better you feel when you're not constantly thinking about how you can benefit at any given time. Of course, once you level out, you shouldn't always put yourself last or you may find yourself in a situation where people are taking advantage of you. But it's a good practice to do if you're always putting yourself first. If you are unable to put yourself last even once, then you may have a problem that you have not acknowledged."
    },
    {
      "title": "Put yourself in someone else's shoes.",
      "content": "Put yourself in someone else's shoes. Walking a mile in another man's shoes can change your life for eternity. Of course, you won't be able to actually do this, but you can put in the effort into thinking about the other people around you and considering how they might be feeling in any given situation. [3] X Research source Consider how your mother, your friend, your boss, or a random person on the street may be feeling before you take action, and you may find that the world isn't as clean cut as you thought it was. The more you practice empathy and wondering what other people are going through, the sooner you'll be able to give up your selfishness. For example, before you start yelling at your waitress for giving you the wrong order, think about how she might be feeling. She might be tired from being on her feet for ten hours in a row, overwhelmed from having to work too many tables, or just feeling sad about something else; is it really necessary for you to make her feel terrible just to get what you want?"
    },
    {
      "title": "Remember that you're not more important than anyone else.",
      "content": "Remember that you're not more important than anyone else. Selfish people are constantly thinking that they are the center of the universe and that the world should revolve around them. Well, you need to drop that thought like a bad habit. Whether you're Madonna or Donna the hairdresser, you should think of yourself as the same as everyone else, not as somehow better because you've got more money, more looks, or more talent than the person standing next to you. Practice being humble and modest. The world is a huge and absolutely amazing place, and you are just one tiny part of it. Don't think that you somehow deserve more than other people because you are \"you.\""
    },
    {
      "title": "Don't let your past dictate your future.",
      "content": "Don't let your past dictate your future. Okay, so maybe all of your friends, coworkers, and neighbors think of you as the most selfish person in the world. You may be finding it difficult to break out of that pattern or to have other people view you as something other than what they expected you to be. Well, stop thinking that way and learn to move forward and to become a new person. Sure, other people who know you may be surprised that you're being selfless or that you've stopped obsessing over yourself; this gives you all the more reason to continue to be an unselfish person. Other people may question your motives when you try to do something selfless. This should encourage you to be less selfish even more often. Don't give in and think that you were born selfish and that you won't be able to change."
    },
    {
      "title": "Ask yourself about what you want vs.",
      "content": "Ask yourself about what you want vs. what you need. Selfish people are always repeating that mantra, \"I want, I want, I want…\" thinking that everything in the world should be theirs and that they should deserve every little thing that they dream about. Stop and ask yourself whether you really needed those five sweaters, or whether you really needed to choose the movie or restaurant when you were hanging out with your partner. If you dig deep enough, you'll find that most of the things that you thought were absolutely necessary were actually very easy to live without. It will feel good to simplify your life and to give up some of the things you thought you needed. If you only get one new sweater instead of five, you'll only have to worry about losing one sweater. This is a great skill when you're learning to compromise. You may be more willing to concede to other people if you realize that the thing you really wanted is more like that thing that you'd just really like to have one day. Keep in mind that selfishness can also manifest as not wanting to give up your time. Some people are generous with their possessions, but not with their time."
    },
    {
      "title": "Enjoy giving the spotlight to others.",
      "content": "Enjoy giving the spotlight to others. Selfish people cringe when someone else goes in the spotlight because they always want it for themselves. If you want to stop being selfish, then you have to not only give up the spotlight, but you have to enjoy letting other people take it. Stop trying to be the bride at every wedding and let other brides have their time in the spotlight. Be proud of other people for achieving things instead of wishing it was you. Let go of feelings of jealousy or bitterness and relish in the success of others. If you're always wishing to be the one who is the most successful, then ask yourself if you're missing something in your life that keeps you from being content with what you're already achieving."
    },
    {
      "title": "Take in criticism.",
      "content": "Take in criticism. People who are selfish are always thinking that their way of living life is best and that anyone who tries to give them feedback is just trying to do them harm or has ulterior motives. Sure, you can't believe all of the criticism that comes your way, but if you focus enough, you might see that a lot of people are telling you the same thing. You can even work on asking for feedback when you're struggling instead of just accepting it when it comes your way. That takes strength of character."
    },
    {
      "title": "Make a gratitude list.",
      "content": "Make a gratitude list. Make a habit of writing down all of the things you're grateful for every Sunday or at least once a week. Take the time to think of each and every individual thing that makes your life really great, and don't spend all your time focusing on the things you don't have, or the things you wish you had, or all of the \"If only\" chants that can ruin your day and your life. Think of things that are going well for you, from your health to your plethora of friends, and feel happy about what you've got. [4] X Research source Selfish people are never satisfied and always want more, more, more. If you want to stop being selfish, you have to feel like you already have enough amazing things in your life. Any additional joys or gifts should come as a bonus. Time is also a factor. Make sure to acknowledge the time you have had to yourself, and be willing to help others with the extra time that you have. Being unwilling to give up some of your time will eventually result in you not having any friends if you keep it up."
    },
    {
      "title": "Do favors for your friends just because.",
      "content": "Do favors for your friends just because. Doing a favor for your friends just so they will do you a favor is selfish. Doing a favor for your friends just because they need the help, or because it'll feel good to help someone else, is the right way to go about it. If you want to stop being selfish, then look for opportunities to help your friends, just because they need the help, not for any ulterior motives. You don't want to be that person who has a reputation of helping people only when he needs something from them; that's just as bad as not helping at all. Take the time to listen to your friends and to observe them in action. They may be in need of a favor but may be too embarrassed to ask for help with it."
    },
    {
      "title": "Take the time to really listen.",
      "content": "Take the time to really listen. Selfish people are notoriously bad listeners. This is because they are too busy talking about their own struggles, their own problems, and their own setbacks to take the time to listen to what their friends are saying. If you're the kind of person who picks up the phone, talks at someone for half an hour, and then says goodbye, then you're not taking the time to listen to what other people are telling you. [5] X Research source Any conversation should have about a 50/50 exchange of ideas, and if you're monopolizing every conversation you have, then you've got to work on honing your listening skills the next time you talk to people. Selfish people are more focused on themselves than on other people, which is why they don't really take the time to listen to other people."
    },
    {
      "title": "Show an interest in people.",
      "content": "Show an interest in people. Listening to people is a great way to show interest in them. Another thing you can do is to ask people questions, from their opinions on the local news to their experiences as children. You don't have to interrogate them to show a casual interest in them as human beings, and to let them see that you really do care what they think about or what they're struggling with. When people talk, don't just nod and wait your turn to talk, but slow down and ask them questions if they're talking about something that they feel passionate about. [6] X Expert Source Arda Ozdemir, MA Life Coach Expert Interview. 14 March 2019. You can show an interest in people without overwhelming them. The next time you talk to someone, set out to talk 20% less and to ask a few more questions than you normally would and see how it makes you feel."
    },
    {
      "title": "Volunteer your time.",
      "content": "Volunteer your time. Volunteering can open up your world and make you see that there are so many people out there who are so much less fortunate than you are. You may think that you don't have all the things you need until you spend time in a soup kitchen or teach adults how to read. Though you shouldn't volunteer just to make yourself feel good, you should give your time to make meaningful connections with other people and to see the world outside yourself. You may find that you actually are addicted to the feeling of helping others. Soon you'll stop thinking about all the things you don't have because you'll be wondering when you can commit to other people."
    },
    {
      "title": "Get a pet.",
      "content": "Get a pet. Though you shouldn't get a pet if you're the kind of person who has killed your last ten goldfish, having a pet will make you feel like there is someone who is depending on you for survival, and that you have the power to help another creature. Go to a shelter and pick out a cute kitty or puppy and make it your best buddy. You'll see that as you plan to walk your dog, feed your pet, or just spend some quality cuddling time with the new addition to your home, that you don't have as much time for all of those selfish thoughts. Dogs require a lot of responsibility. Taking on responsibilities -- especially in the name of serving others -- will definitely help you stop being selfish."
    },
    {
      "title": "Help people you know during their times of need.",
      "content": "Help people you know during their times of need. When your friends, family, or even your neighbors are struggling, you should be there for them. Maybe your co-worker has had a death in the family, or your neighbor has been sick for months; take the time to make them a home-cooked meal, call them, or give them a card and ask how you can help. People may be reluctant to say that they need help even if they obviously do. It's up to you to figure out when you can really help without being intrusive."
    },
    {
      "title": "Learn to share.",
      "content": "Learn to share. Selfish people have hated sharing from the moment they were given their first rubber ducky. So, it's time to get that selfish gene out of your system. Learn to share your stuff, whether you let your friend have half of your sandwich, or you let your friend raid your wardrobe to find something perfect to wear for a first date. Pick something that you love so much that you couldn't possibly imagine sharing it, and then offer it to your friend. Giving up your possessions like that can be scary at first, but it'll get you on the road to being less selfish. Food is a big one. Selfish people hate to share food. Though you should have enough for yourself, ask yourself if you really need that extra cookie or five, or if it's okay to offer them to your friends or roommates."
    },
    {
      "title": "Join a team.",
      "content": "Join a team. Being part of a team is a great way to become less selfish, whether you're on a project for work, part of your school's debate team, or a member of a bowling league in your community. Just being part of a group and learning to balance the needs of each individual member with the needs of the whole group can help you realize how important it is to give up some of your selfishness. Being a leader of this team can help you become even less selfish. You'll see that the needs of any group can be more important than the needs of any individual, and that some compromise is inevitable for making people happy."
    },
    {
      "title": "Stop talking about yourself.",
      "content": "Stop talking about yourself. Selfish people go on and on and on about their needs, their struggles, and their desires. The next time you have a conversation with a friend, do a personal recap afterwards and see what percentage you spent talking all about you, you, you. If you feel like everything you said was about yourself instead of the world around you and that your friend hardly got a word in edgewise, then it's time to turn that behavior around. [7] X Expert Source Arda Ozdemir, MA Life Coach Expert Interview. 14 March 2019. It's okay to ask for advice, talk about your day, and mention your wants within a reasonable realm, but it's not okay if you're known to be the person who can't see past themselves in any social situation. For one thing, if you have a reputation for only talking about yourself, people will get the message and won't want to hang out with you."
    },
    {
      "title": "Give a small gift.",
      "content": "Give a small gift. Give your friends, significant other, family member, or neighbor a small gift as a token of your love and appreciation. Selfish people hate to spend money on others, give items to others, or to acknowledge others in general, and you've got to stop the mentality that, if you don't do something for yourself, you might as well not do anything at all. Even if your friend's birthday isn't coming up and there are no special occasions on the horizon, giving a little gift can put a smile on your friend's face -- in fact, an unexpected gift can make a person even happier than an expected one. Make a goal of giving one small gift a month to show people how much you appreciate them. It'll actually make you feel better, too! If your budget is tight, then you can also give some of your time to help someone."
    },
    {
      "title": "Learn to compromise.",
      "content": "Learn to compromise. If you want to stop being selfish, then you've got to learn to compromise. This means seeing that it's better to be happy than to get what you want, that other people have needs too, and that you can't always get what you want. You don't want to have a reputation for being so stubborn that people wouldn't even think about approaching you with a difficult situation. Learn to listen to people, to weigh the pros and cons of any situation, and to be able to see the situation from another person's perspective. [8] X Research source Don't focus blindly on getting your way. Focus on understanding the situation from both sides. Ask yourself, \"Who wants it more?\" Do you really want this particular thing so badly, or are you just being stubborn for the sake of it? Not everything can be a priority for you. Make sure to hear the other person out and consider their perspective before you respond."
    },
    {
      "title": "Thank people.",
      "content": "Thank people. Selfish people think that they deserve the best treatment and that they deserve to be spoiled, and that's just not the case. If someone does something nice for you, whether they are complimenting you or giving you a ride to class, you should be grateful and thank them for their actions instead of just acting like it's perfectly normal that they want to do favors for you. Don't expect kindness or understanding and be grateful when it comes your way. Selfish people think they \"deserve\" the best treatment at all times. It's time to stop and think about all of the people who have really made your life better."
    },
    {
      "title": "Give up the control.",
      "content": "Give up the control. Selfish people think that they have to choose every movie, plan every vacation, and get their way in every school or work-related project. Well, it's time to take a step back and to let some other people do some of the deciding. Sure, it may be scary to go to that new Thai place instead of your favorite usual Italian restaurant, and sure, you may not like letting your coworker have so much control over your latest report; but you've got to trust that other people know what they're doing and to let them get their way, too. Giving up control can help you relieve stress and be happier, too. Think about how much easier your life will be if you're not obsessing over planning every little thing so that it goes your way. Giving in to the other person's schedule sometimes may also help to make things easier and relieve some stress."
    },
    {
      "title": "Spend time with people who are not selfish.",
      "content": "Spend time with people who are not selfish. Join others who are kind and reciprocate kindness. Being with other selfish people, will not help you become a better person. We are very much defined by the company we keep. If you spend all of your time with other people who only care about themselves, then yeah, you won't be a very considerate person. But if you spend time around an inspiring, giving person, you will be inspired to act in a less selfish way."
    },
    {
      "title": "Don't interrupt people.",
      "content": "Don't interrupt people. Let them finish their sentence. Remember that your points can always wait. If it's urgent (like if you have to leave) say \"excuse me\". Selfish people often think that what they have to say is so important, and that what others have to say is so unimportant, that they can just jump in with their opinions at any time. Well, this is not the case. In fact, your opinion will be much better received if you wait your turn. Furthermore, you may change your opinion if you actually take the time to hear people out."
    },
    {
      "title": "Remember birthdays.",
      "content": "Remember birthdays. Someone's feelings are bound to be hurt if you happen to forget their special day. Fortunately, you can always make it up to them if you forget. Still, though, remembering a birthday is about more than just remembering the special day. It's about recognizing people for being special and letting them know how much they mean to you. On the other side of the coin, don't be that person who gets incredibly upset if someone forgets your birthday. These things happen and there's no point in acting like everyone should remember your every move."
    },
    {
      "title": "Keep in touch with your friends",
      "content": "Keep in touch with your friends , family, and relatives. Selfish people find it easy to lose touch with people because they know that they will always come back to them. Don't think that your time is so important that you can't call your parents or spend your lunch hour with a friend and then expect other people to be at your beck and call when you do need them. Give people the basic consideration of wanting to know how they're doing just because."
    },
    {
      "title": "Compliment other people",
      "content": "Compliment other people . Don't just go on about how great you are. Take the time to let people know how great they are, whether you're talking about their fashion sense, their personalities, or great decisions they've recently made. Or just compliment a perfect stranger if you're waiting in line and like the stranger's coat. Don't give phony compliments just to suck up to people; give compliments because they really deserve them. [9] X Research source"
    },
    {
      "title": "Don't butt in front of people in line.",
      "content": "Don't butt in front of people in line. Also, if you see someone in a walker or a wheelchair, slow down or help them instead of just cutting in front of them. Nothing can be so important that you want to do it absolutely first. Wait your turn and let other people get their pick without acting like what you have to do that day is so important that you can't possibly wait five minutes just standing in line."
    },
    {
      "title": "Be on time.",
      "content": "Be on time. If at all possible, call if you know you are going to be late. Selfish people are known to keep other people waiting and to not care if they are wasting the time of anyone else; paradoxically, they think that their time is so important that nobody could ever keep them waiting. So, be courteous and give other people the respect that they deserve by showing up when you say you'll show up."
    }
  ]
}