{
  "url": "https://www.wikihow.com/Take-Care-of-a-Leopard-Gecko-That-Won%27t-Eat",
  "title": "How to Take Care of a Leopard Gecko That Won't Eat",
  "steps": [
    {
      "title": "Check the temperature of the gecko's enclosure.",
      "content": "Check the temperature of the gecko's enclosure. The environment you have provided for your gecko can influence your gecko's appetite. If the temperature is too hot or too cold, your gecko may not eat. Try to correct the temperature in the gecko's enclosure. [1] X Expert Source Audra Barrios Marine Biologist & Reptile Specialist Expert Interview. 18 August 2020. Geckos are cold blooded and cannot regulate their own body temperature. You will have to provide both cool and hot areas in the enclosure to keep your gecko healthy and eating properly. [2] X Expert Source Audra Barrios Marine Biologist & Reptile Specialist Expert Interview. 18 August 2020. The hottest spot in your gecko's enclosure should be between 90 and 93 degrees Fahrenheit. Your gecko needs to cool off as well. Provide an area in the enclosure that is around 74 degrees Fahrenheit. During the winter months and cooler temperatures, it is normal for your gecko to have a reduced appetite."
    },
    {
      "title": "Eliminate stress from your gecko's environment.",
      "content": "Eliminate stress from your gecko's environment. If your gecko is feeling too stressed out, it may not eat. [3] X Expert Source Audra Barrios Marine Biologist & Reptile Specialist Expert Interview. 18 August 2020. Many factors can cause your gecko stress, try to make your gecko's enclosure and life as stress free as you can. [4] X Research source Transferring your gecko to a new environment may have caused it stress. If your gecko has stopped eating after a move, it should regain its appetite after becoming accustomed to its new home. Other geckos in the enclosure may be bullying the one who is not eating. Bullied geckos may have scratches on it or will be herded around the enclosure by the bully. Separation is the only way to prevent this."
    },
    {
      "title": "Check for signs that your gecko is eating.",
      "content": "Check for signs that your gecko is eating. It can be difficult to actually catch your gecko while it is eating, which may give the impression that it is not eating. There are two main methods to make sure that your gecko is eating, without actually seeing it eat. Weigh your gecko. In an average adult gecko, fluctuations of around a gram or two in weight are normal. If it starts continuously losing weight however, this is good evidence that it is not eating enough. Losing weight is often a sign of parasites. This needs to be treated by an exotic vet. Be sure to take a poop sample. When cleaning the cage, look for signs of defecation. If your gecko is regularly having bowel movements, this is a good indication that your gecko is eating."
    },
    {
      "title": "Feed your gecko some of its favorite foods.",
      "content": "Feed your gecko some of its favorite foods. Geckos can be picky eaters and they definitely have foods that are better suited to their diets than others. Try feeding your gecko some of the following foods to stimulate its appetite: [5] X Research source Safe insects include crickets, mealworms (not for the main diet because of lack of nutrition and hard exoskeleton), waxworms (treats only, very addictive), silkworms and dubia roaches. Make sure the insects you offer aren't too large as this can cause injury to your gecko. If the insect is larger than the space between the gecko's eyes, it's too large. Use live insects as food. The motion can attract the attention of your gecko. Try feeding your gecko in the evening or at night as this can mimic their hunting routine in the wild."
    },
    {
      "title": "Look for signs of illness.",
      "content": "Look for signs of illness. Your gecko may have stopped eating if it has fallen ill or is suffering from an injury. If you suspect your gecko to be ill, you should take it to your veterinarian for an examination. [6] X Expert Source Audra Barrios Marine Biologist & Reptile Specialist Expert Interview. 18 August 2020. Carefully examine your gecko for any of the following signs: [7] X Research source A skin infection may be identified by any area that is red, swollen, or emitting pus. A respiratory issue can be identified by plugged nostrils, laboured breathing, or any unusual noises during respiration. This is caused by dust or high humidity. Metabolic Bone Disease (from lack of calcium and d3) may cause your gecko to have weakness in its legs and jaw or the inability to stand. It may also cause swelling in the abdomen as it can become impacted from the inability to have a bowl movement. Your gecko's eyes may also become cloudy if it is ill or have an infection."
    },
    {
      "title": "Expect younger geckos to have a smaller appetite.",
      "content": "Expect younger geckos to have a smaller appetite. Life-cycles can have an impact on how much, or how little, your gecko wants to eat. If you know how old your gecko is, you can gain some understanding as to what is the normal amount of food your gecko should be eating. [8] X Research source Freshly hatched geckos may not eat for up to a week. Young geckos may eat once or twice a day. Older geckos appetite may slow down considerably. Lessened appetites are normal in these older geckos and are not necessarily indicative of a medical issue. It may only need to eat once every two days. Females, however, are prone to reproductive problems which can interfere with appetite. They often lay infertile eggs, even without a male, during the spring. These can be re-absorbed or cause egg binding (which can kill the gecko and requires vet treatment). If you have a female give her an area in which she can lay eggs so that she doesn't feel inhibited. If the problem persists, then always get her checked by a veterinarian experienced with the species. [9] X Research source"
    },
    {
      "title": "Hand feed your gecko.",
      "content": "Hand feed your gecko. You may be able to feed your gecko by hand, if it is comfortable with you picking it up. There are a few methods of food preparation that may work better than others. Some experimentation may be required to find which method your gecko likes the best. [10] X Research source Fruit nectars can be applied to a cotton swab. The cotton swab is then placed near the gecko's mouth. If your gecko finds it appealing, it should begin licking and feeding from the nectar on the cotton swab. You may simply hold your gecko in one hand and a prey item in the other. Introduce the prey item to the gecko, holding it up to its mouth. Your gecko may take interest and start eating. If your gecko doesn't take live prey items from your hand, you may need to crush the prey before presenting it. Once crushed, the prey is gently rubbed on the gecko's lips to encourage it to eat. Do not force feed your gecko."
    },
    {
      "title": "Schedule an appointment with your veterinarian.",
      "content": "Schedule an appointment with your veterinarian. Diagnosing any medical issue on your own can be difficult. If you notice that your gecko is not eating, you should take it for a visit to your veterinarian for a proper examination. [11] X Expert Source Audra Barrios Marine Biologist & Reptile Specialist Expert Interview. 18 August 2020. Your veterinarian will be able to accurately diagnose and will work with you to help restore your geckos appetite and health. You may need to bring a fresh stool sample. Keep any gecko that you suspect to be ill separate from other geckos you may have. This will keep any potential diseases from spreading to healthy geckos."
    }
  ]
}