{
  "url": "https://www.wikihow.com/What-Is-Pillow-Face",
  "title": "What Causes Pillow Face? The Risks of Too Much Filler (& How to Prevent It)",
  "steps": [
    {
      "title": "Pillow face means looking puffy or bloated after getting too many fillers.",
      "content": "Pillow face means looking puffy or bloated after getting too many fillers. When they’re done properly, dermal fillers help add volume to make your face look younger . However, using too much can change your face contours and make them look rounder. The common signs of a pillow face are: [1] X Research source Puffy “chipmunk” cheeks or under-eyes Round or undefined facial contours Unnaturally smooth skin Disproportionate or unbalanced features Restricted facial movement or inability to emote"
    },
    {
      "title": "Overfilling",
      "content": "Overfilling Usually, injectors only use small amounts of dermal fillers so they subtly enhance your appearance. If you use too much filler at once or if you are in for frequent filler appointments, the filler can build up under your skin and distort the look of your face. [2] X Research source"
    },
    {
      "title": "Filler migration",
      "content": "Filler migration When too much filler is used or if it’s injected incorrectly, there’s a chance that it may migrate or move over time. When filler moves under your skin, it can create uneven proportions or puffiness in other places on your face. [3] X Research source"
    },
    {
      "title": "Incorrect filler placement",
      "content": "Incorrect filler placement Experienced injectors and cosmetic surgeons know where to place fillers so they properly accentuate your features. If they don’t have a ton of experience, they may inject the filler into the wrong spot and create an uneven or puffy face shape. [4] X Research source"
    },
    {
      "title": "Low-quality fillers",
      "content": "Low-quality fillers Licensed injectors use the highest-quality fillers for treatments, but others may use products that are not mixed properly. Different dermal fillers also work better on specific areas of your face, so they can cause pillow face if they’re used in the wrong spots. [5] X Research source"
    },
    {
      "title": "Dissolve the fillers with hyaluronidase injections.",
      "content": "Dissolve the fillers with hyaluronidase injections. Hyaluronidase is an enzyme that breaks down hyaluronic acid dermal fillers and returns your face to its natural shape. Contact an injector or cosmetic surgeon to schedule an appointment. They’ll inject the hyaluronidase into your skin where you got fillers, and the results will be noticeable within a few days. [6] X Research source Getting hyaluronidase injections can also remove some of the natural hyaluronic acid your body produces, but it will come back once the enzyme fully breaks down. After dissolving your fillers, wait about 1-2 weeks if you plan on getting more injections."
    },
    {
      "title": "Wait for the fillers to go down on their own.",
      "content": "Wait for the fillers to go down on their own. Dermal fillers are temporary, so your face will return to its normal shape over time. Hyaluronic acid fillers usually last around 6-18 months, but they may go down sooner in areas that move a lot, such as around your mouth. Other fillers may take a couple of years to fully disappear. [7] X Research source If you don’t want to wait for fillers to go down, talk to a dermatologist or cosmetic surgeon to see if there are other surgical options for removing them."
    },
    {
      "title": "Choose a licensed injector when you get fillers.",
      "content": "Choose a licensed injector when you get fillers. When you’re looking for someone to give you dermal fillers, research injectors in your area that have experience doing the procedure you want. Check their websites for accreditation from the American Board of Cosmetic Surgery (ABCS). Then, read reviews and look at before and after pictures to see if people are happy with their results. [8] X Research source Make sure the injector works in a sterile surgical facility to ensure you don’t get an infection. If an injector makes you feel uncomfortable for any reason or doesn’t open up about their credentials, it’s best to find another person to do it."
    },
    {
      "title": "Use the correct fillers for the areas of your face.",
      "content": "Use the correct fillers for the areas of your face. Different types of fillers are made for specific areas of your face to achieve the best results. Some fillers are softer so it’s easier to emote and move, while others are firmer to add more definition to your face. Double-check that your injector uses the proper fillers for the look you’re trying to achieve. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Hyaluronic acid (HA): cheeks, under-eyes, wrinkles, marionette lines, smile lines, and acne scars Brand names: Juvederm, Restylane, Belotero Calcium hydroxylapatite: jaw line, cheeks, deep wrinkles Brand name: Radiesse Poly-L-lactic acid: deep wrinkles Brand name: Sculptra Polymethylmethacrylate (PMMA): deep wrinkles around your mouth and deep acne scars Brand name: Bellafill"
    },
    {
      "title": "Start with less filler and use more if you need it.",
      "content": "Start with less filler and use more if you need it. Fillers are meant to have a subtle look, so take a conservative approach when you first get them. Get a small dose of filler and wait a few weeks to see if you’re happy with the results. It may take multiple appointments to get the results you want, but it’s a lot easier to add more filler than it is to remove it. [10] X Research source"
    },
    {
      "title": "Follow any post-treatment care you’re given.",
      "content": "Follow any post-treatment care you’re given. Your injector will give you instructions on taking care of your face after injections so you get the results you want. They’ll also schedule follow-up appointments within a couple of weeks so they can check how the fillers look and make any corrections that they need to. [11] X Research source"
    },
    {
      "title": "Chemical peels",
      "content": "Chemical peels Chemical peels are acidic solutions that you apply to your face to remove the outermost layers of skin. After the chemical peel sits on your skin, it can help remove fine lines and wrinkles from your face. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Chemical peels may make your face red and sensitive like a sunburn for up to a week. While the strongest chemical peels should be done by a dermatologist, you can do chemical peels at home with weaker products. Avoid chemical peels if you have really sensitive skin or if you have abnormal scarring."
    },
    {
      "title": "Botox",
      "content": "Botox Botox injections, or botulinum toxins, relax your facial muscles so your skin gradually smoothes out and removes deep wrinkles . Many people use Botox to treat sagging skin around their neck or lines around their eyes and forehead. [13] X Research source Similar treatments include Dysport and Xeomin."
    },
    {
      "title": "Ultherapy",
      "content": "Ultherapy Ultrasound therapy, or Ultherapy, uses ultrasound waves to stimulate collagen growth deep within your skin tissue. Collagen naturally makes your skin firmer and adds more elasticity, so it can help lift sagging skin near your brows, neck, and chin. [14] X Research source Ultherapy is non-invasive and doesn’t require any injections or surgery."
    },
    {
      "title": "Radiofrequency microneedling",
      "content": "Radiofrequency microneedling Radiofrequency (RF) microneedling uses small needles that send radio frequencies deep into your skin tissue. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Adebola Dele-Michael, MD, FAAD, a dermatologist, agrees that, “radiofrequency treatments are very, very good in boosting the collagen levels in the skin.” RF microneedling is mostly painless, but you may feel small pin pricks during the procedure. You may also have slight bruising or redness for a day or two afterwards."
    },
    {
      "title": "Fat grafting",
      "content": "Fat grafting Fat grafting takes body fat from another part of your body so it can be injected into sunken or sagging areas on your face. Fat grafting usually works best for adding volume to your cheeks, under-eyes, and temples, but it’s an effective treatment for any part of your face. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Thread lifts",
      "content": "Thread lifts During a thread lift, a cosmetic surgeon inserts a dissolvable thread under your skin that lifts sagging or wrinkled areas on your face and neck. The threads also help collagen grow naturally in your skin to help make it firmer. [17] X Research source Thread lifts work best for shaping your cheeks, jawline, nasolabial folds (smile lines), and neck. Thread lifts can last for up to 3 years."
    },
    {
      "title": "Facelift",
      "content": "Facelift Facelifts are full procedures where a cosmetic surgeon pulls your skin tighter to remove wrinkles and removes any excess so it doesn’t sag. Facelifts are the best option if fillers or non-invasive solutions aren’t working, and still leave your face with a natural look. [18] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Facelifts are a good option if you have jowls along your jawline, loose neck skin, deep folds around your mouth, or drooping skin. Even though it’s a more intense surgery, you’ll usually fully recover within 2 weeks."
    },
    {
      "title": "Wash your face twice a day.",
      "content": "Wash your face twice a day. Washing your face helps remove dirt and natural oils that could cause irritation or skin damage. In the morning and at night, wet your face and lather in a gentle facial cleanser to remove any impurities. Splash water on your face to remove the cleanser and gently pat your face with a clean towel when you’re done. [19] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Wash your face after doing strenuous activity that makes you sweat as well. Avoid exfoliating scrubs or using a lot of force when you clean your face because it may cause more irritation."
    },
    {
      "title": "Apply moisturizer daily.",
      "content": "Apply moisturizer daily. Moisturizers help keep your skin from drying out so your skin stays healthy. Moisturizer can also help temporarily hide wrinkles and fine lines when you apply it, so put on a thin layer after each time you wash your face. [20] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Incorporate vitamin C serum into your skincare routine.",
      "content": "Incorporate vitamin C serum into your skincare routine. Vitamin C is an antioxidant and helps your body produce collagen, so it can help tighten your skin when it’s wrinkled or starting to sag. Use vitamin C serum by applying a few drops to an applicator and rubbing it into your skin every day. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Make sure the vitamin C serum you use comes in an opaque bottle because light causes it to break down and become less effective."
    },
    {
      "title": "Use retinol weekly to minimize wrinkles.",
      "content": "Use retinol weekly to minimize wrinkles. Licensed esthetician Alicia Ramos states that retinol, “prompts your body to produce more new, healthy skin-cells and it actually increases the life of your collagen, the part of your skin known to make it look youthful and full.” She continues that retinol “will smooth out your skin, reduce the appearance of wrinkles, and may even help to reduce sun-spots or other pigmentation problems.” Apply retinol in a thin layer at night so it works while you’re sleeping. [22] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Retinol is an exfoliator and may make your skin more sensitive. Only use it once a week, and apply a thin layer of moisturizer first if you feel irritation."
    },
    {
      "title": "Wear sunscreen or an SPF product outside.",
      "content": "Wear sunscreen or an SPF product outside. Board certified dermatologist Kaveri Karhade states “Wearing sunscreen as early as possible is one of the best ways to keep your skin young.” She explains that collagen breaks down as we get older, and direct exposure to sunlight can make it disappear even faster. Use lotion or moisturizers that already have SPF when you do your skincare routine so you don’t have to apply sunscreen separately. If you’re doing strenuous activity and sweating, be sure to reapply sunscreen every couple of hours for continued protection."
    },
    {
      "title": "Avoid repetitive facial expressions.",
      "content": "Avoid repetitive facial expressions. Smiling, frowning, squinting, furrowing your brow, and moving other parts of your face can all cause wrinkles to form over time. Try to maintain a neutral expression throughout the day to keep wrinkles from forming. [23] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Look for ways to limit certain expressions. For example, if you always squint when it’s sunny outside, wear a pair of sunglasses so you can fully open your eyes."
    },
    {
      "title": "Limit smoking and drinking alcohol.",
      "content": "Limit smoking and drinking alcohol. Smoking and alcohol both can dehydrate your skin and speed up how fast it ages. Try to cut back as much as possible so your skin can maintain a youthful glow. [24] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    }
  ]
}