{
  "url": "https://www.wikihow.com/Spot-Car-Scams-on-Craigslist",
  "title": "How to Spot Car Scams on Craigslist",
  "steps": [
    {
      "title": "Watch out for ads with a very low or unusual price.",
      "content": "Watch out for ads with a very low or unusual price. If the price is significantly lower than you’d expect it to be, this is a red flag. Check the Kelly Blue Book price to get a ballpark range for what the price ought to be. If it’s considerably lower, such as 25% less or more, then the ad is likely a scam. A very specific price can also be a red flag, such as $2,347 or something along these lines. [1] X Research source If the seller suggests shipping the car to you for an additional charge or including shipping in the sale price, this is likely a scam. [2] X Research source"
    },
    {
      "title": "Check the listing for severe grammar issues.",
      "content": "Check the listing for severe grammar issues. If the car’s description is poorly written and difficult to understand, it might have been written by a scammer. Pass on any cars with descriptions that are chock full of grammatical, spelling, or other errors. [3] X Expert Source Scott Nelson, JD Police Sergeant, Mountain View Police Department Expert Interview. 2 April 2020. For example, steer clear of an ad that reads something like, “new sidan for weel driv plus exxtras.”"
    },
    {
      "title": "Perform a reverse image search of the car photo.",
      "content": "Perform a reverse image search of the car photo. Copy the image’s url and paste it into Google’s image search, or download and save the image and then drag and drop it into the search bar after clicking on the camera button next to the search bar. Then, review the results to determine if the same photo is posted elsewhere. If you find multiple listings that use the same image, the ad is likely a scam. [5] X Research source By doing a reverse image search, you may even find that the image is a stock photo and not an image of a real car for sale."
    },
    {
      "title": "Copy and paste the car description into Google to spot duplicates.",
      "content": "Copy and paste the car description into Google to spot duplicates. Place the description in quotation marks to find duplicate listings. Some scammers will post multiple ads using the exact same language, so this is an easy way to weed out fake ads. [6] X Research source Be wary if the language is very similar to other ads as well. Look at other aspects of the ad to check for red flags."
    },
    {
      "title": "Compare the price of the car in the ad with the website listing.",
      "content": "Compare the price of the car in the ad with the website listing. If the seller also has a website or Facebook page, make sure that the prices listed for the car are the same on both sites. If the price listed on one of the outlets is lower, negotiate from this price instead of from the higher price. [7] X Research source For example, if the car is listed for $2,500 on the seller’s Facebook page and $3,000 on the Craigslist post, negotiate down from $2,500 rather than from $3,000."
    },
    {
      "title": "Email the seller if there’s no location or phone number listed in the ad.",
      "content": "Email the seller if there’s no location or phone number listed in the ad. The ad should clearly indicate where the car is located and provide a contact phone number for the seller. If there’s no location or phone number listed, this may be a red flag. However, you can email the seller to see if they will provide a location and phone number. If they refuse to tell you where the car is located of give you a phone number, this is likely a scam. [8] X Research source Another red flag is a location that doesn’t make sense, such as “in the mountains of Orlando.”"
    },
    {
      "title": "Be especially wary of sellers who tell a sad story.",
      "content": "Be especially wary of sellers who tell a sad story. Sob stories are often used by scammers to rush a sale, so be wary if the seller tells you one or mentions other circumstances unrelated to the car. For example, if the seller tells you a story about being laid off and needing money quickly to pay their bills, this is a red flag. Other things to watch out for include: [9] X Research source Saying they’re about to be deployed and need to sell the car in a hurry. Claiming they have other buyers interested, so they need a decision right away. Calling you repeatedly to ask if you’ve made a decision."
    },
    {
      "title": "Avoid sellers who claim to be handling the sale for someone else.",
      "content": "Avoid sellers who claim to be handling the sale for someone else. If the seller says they’re handling the sale of the car for a neighbor, elderly parent, or someone else, be cautious. This is often a red flag and it may indicate that the car was stolen. Always ask to see the title and seller’s ID to ensure that the car you’re looking at belongs to the person who is selling it. [10] X Research source A seller may also claim to have less knowledge about the vehicle under the veil of this story, which could result in not getting clear answers to your questions about the car."
    },
    {
      "title": "Research any website that the seller directs you to for payment.",
      "content": "Research any website that the seller directs you to for payment. The safest option is to pay the seller with cash, so be cautious if they direct you to a website to make your payment. Sellers will often provide an escrow website address to increase the buyer’s sense of security, but this does not mean they are not scamming you. Evaluate the site thoroughly to ensure that it is a legitimate website. [11] X Research source Avoid sellers that claim to be associated with eBay or eBay Motors as well. This is a common scam and they may even send you emails and links to websites that look like they’re coming from eBay. [12] X Research source"
    },
    {
      "title": "Avoid curbstone dealers who suggest meeting at their houses.",
      "content": "Avoid curbstone dealers who suggest meeting at their houses. A curbstone dealer is someone who sells a car in front of their house. The person might be a dealer with an actual car lot, but they may move a car to their house and park it out front to increase the perceived value of the car. People tend to be less critical of cars that appear to be being sold by the previous owner, especially if the person lives in a nice neighborhood. [13] X Research source If you do decide to look at a car at someone’s house, bring a friend or family member along with you. If you don’t know much about cars, bring someone along who knows about cars."
    },
    {
      "title": "Call the seller to evaluate their knowledge and professionalism.",
      "content": "Call the seller to evaluate their knowledge and professionalism. Talking on the phone with a seller is a good way to feel out their character and ask more questions about the car. Ask about the condition of the car, any issues it has, and request a test drive if you’re interested. [14] X Research source As an added bonus, some sellers will also be willing to reduce the price further if they perceive you as a serious buyer."
    },
    {
      "title": "Meet the seller in a public place to conduct the final sale transaction.",
      "content": "Meet the seller in a public place to conduct the final sale transaction. If you decide to buy a car from a Craigslist seller, it’s best to make your payment with cash and in person. Request to meet with the person in a public place or at the bank to ensure that you will have witnesses if the person attempts to rob you. [16] X Research source Never pay the person using a wire transfer or using Western Union as this is a common scam tactic."
    },
    {
      "title": "Refuse to pay any amount of money for a car you’ve never seen.",
      "content": "Refuse to pay any amount of money for a car you’ve never seen. If you haven’t seen the car, it may not exist. Stick to cars that are close enough to your location that you can go look at them. Avoid cars that are located in another state or country, or even vehicles that are a few hours away. Try to purchase only from local dealers so that you can bring the car in to them if there’s a problem. [17] X Research source Be especially wary of sellers who say they will ship the vehicle to you. [18] X Research source"
    },
    {
      "title": "Compare the number on the odometer to other age-related features.",
      "content": "Compare the number on the odometer to other age-related features. The average person puts 13,000 miles (21,000 km) per year on a vehicle, so a car that is 3 years old would likely have around 40,000 miles (64,000 km) on it. If the car has considerably fewer miles, then the seller may have tampered with the odometer. Note the appearance of the interior and the condition of the tires. If the interior or tires are well-worn, then the car’s odometer may be inaccurate. [19] X Research source Keep in mind that elderly people and teenagers tend to drive around 8,000 miles (13,000 km) per year, so this could also account for lower mileage. Ask questions about the previous owner if the mileage seems low."
    },
    {
      "title": "Search for the car’s history using the vehicle identification number.",
      "content": "Search for the car’s history using the vehicle identification number. Scammers may provide you with a forged report that leaves important details out of the car’s history. Do not accept a report that the seller provides. Instead, look up the car’s history using the vehicle identification number (VIN). You can search the VIN on a website like Carfax and get a full report. [20] X Research source Be wary of any cars that were involved in accidents or that had ongoing issues."
    },
    {
      "title": "Request to take the car on a longer test drive if the seller rushes it.",
      "content": "Request to take the car on a longer test drive if the seller rushes it. Scammers often try to avoid letting potential buyers take the car for a full test drive since this may reveal issues with the car. If the seller tries to rush the test drive, tell them you would like to drive it a little longer and in different conditions to see how well it works. If they say no or try to convince you that a longer test drive is not necessary, don’t buy the car. [22] X Research source During the test drive, drive the car at slow and fast speeds, pay attention to how well it brakes and turns, and note any unusual sounds."
    },
    {
      "title": "Ask to get the car assessed by your mechanic before you buy it.",
      "content": "Ask to get the car assessed by your mechanic before you buy it. Unless you are car savvy yourself, it can be difficult to spot issues with a car. Bring along a friend who knows a lot about cars or ask the seller to meet you at your mechanic’s garage to check the car for any serious issues. [23] X Research source For example, a mechanic will be better equipped to check the engine for major issues and tell if the seller may have tampered with the car in any way."
    }
  ]
}