{
  "url": "https://www.wikihow.com/Stay-Organized",
  "title": "The Best Strategies for Being Organized and Productive",
  "steps": [
    {
      "title": "Put everything away the moment you finish with it.",
      "content": "Put everything away the moment you finish with it. This is one of the easiest ways to stay organized. Sure, it's great that you organized your home, your office space, or anything else in your life that needed to be put in its place, but that won't mean much if every time you come home, you throw your keys, the mail, umbrella, or other countless items wherever you feel like it because you're tired and you'll get to it later. Making a conscious effort to do this as much as you can will make a huge difference in how organized everything will look -- and how much better you'll feel. Of course, it may not be realistic to expect you to put everything in its place the second you get to work or the moment you walk in the door. It can help a lot to have a \"random bin\" near the entrance of your front door so you can toss the items into the bin, knowing that you'll have to organize them as soon as possible. However, you can't let this bin pile up: you should make a goal of keeping it as empty as possible and going through it every morning and/or night, depending on how often you toss things in. A lot of the trouble with this is mental. You may think that you don't possibly have the energy to sort through your mail or your school backpack, but if you just say, \"I'm going to spend five quick minutes organizing this stuff,\" you'll see that the task is manageable. And the longer you let things pile up, the less manageable everything will feel."
    },
    {
      "title": "Make your bed when you wake up.",
      "content": "Make your bed when you wake up. This may sound like a small point, but if you make an effort to put this into your routine, you'll be much more able to stay organized. An unmade bed is a sign of a disordered life, and the sooner you make the bed, the better you'll feel about facing your day. Seeing a neatly-made bed before you start your daily tasks can make you feel like your life is in order and that you're capable of facing the day. If your bed isn't made, it's much more likely that the rest of your bedroom will look chaotic, and that you won't be able to stay as organized as you'd like. If you leave your bed unmade, that's like giving yourself an invitation to leave your clothes piled on the floor, your makeup spilled all over your dresser, and letting old papers you don't need pile up on your desk. If your bed is made, it's a signal that you'll make sure that the rest of the room is up to par with the bed in terms of organization."
    },
    {
      "title": "Make a to-do list for the day.",
      "content": "Make a to-do list for the day. You should make a goal of creating a to-do list toward the beginning of every day. This will set your priorities for you, keep you focused, and will make you feel accomplished for doing the things you set out to do. However, different forms of list making work for different people, so you shouldn't feel compelled to do exactly what wikiHow or other websites tell you to do; find a list-making method that works for you and stick to it. Here are some things to keep in mind as you make your lists: Consider making a weekly to-do list. Then, break up the things you need to get done each day so that all of the stuff you have to do feels less overwhelming. You'll feel a lot better about getting through that long list if you decide that you only have to get three things done on Monday. Make a \"top 3\" list for the day. These are the things you really have to get done to feel better and to move forward. Don't do something easier and more fun, like returning a friend's phone call, when there are more pressing things to attend to, like paying those electric bills. Don't feel compelled to write down every little thing you have to do. This can actually lead you to feel a bit more overwhelmed. If you have some of the easier tasks firmly planted in your head and go about doing them, you'll feel better about checking them off your list. Avoid making an incredibly long list. Though your list can include some \"reach\" items that you'd like to do this week but can do the following week without the world ending, you should stick to the things you actually have time to accomplish. If you write down 40 tasks, then you'll just feel bogged down and overwhelmed and won't know where to start. When you make your daily or weekly list, you can separate the items in terms of urgency. You can label them, \"Things I have to get done today,\" \"Things that need to get done this week\" or \"Things I have to do by the end of the month.\" or \"things that need to be done by the end of today\" This will help you put things in perspective and will help you prioritize your tasks."
    },
    {
      "title": "Keep your planner up-to-date.",
      "content": "Keep your planner up-to-date. Maybe you had an awesome planner when you first decided to get organized, but now you barely glance at it. Well, you need to get back into the habit of filling out your calendar on a weekly basis and of knowing what you have to do when. Having everything written down can help you plan future events and will give you a sense of what the week ahead has in store for you. You may not realize that you're going to have a busy week and that you'll need to budget your time accordingly until you notice that you've written \"dentist appointment,\" \"work project due\" and \"baby shower\" down for the same week. Make a habit of checking your planner every morning, updating it as needed, and even crossing off the things you had to do. Using colorful pens, markers, and highlighters can help as well, especially aesthetically. If you like using your phone or computer better, there are countless apps that can also help you schedule your time and to stay organized. Some of them cost money but people swear that they're worth it. Some of the most common apps are RescueTime, CalenGoo, Freckle, Things, and Mindnode. See if one of them works for you. [1] X Research source Doing this digitally, even if you just plug things in on your iPhone, has the added advantage of you using a feature that sends you a reminder when you have an important event coming up."
    },
    {
      "title": "Remember that drawers are your friend.",
      "content": "Remember that drawers are your friend. If you want to stay organized, then you should stick to using drawers, boxes, and other forms of organization to keep everything in your home together. [2] X Expert Source Christel Ferguson Professional Organizer Expert Interview. 17 December 2018. You might have set them out for this purpose and then forgotten to use them, and it's important to make sure you stick to the organizational method you've set up for yourself. Devote 5 minutes a day to inspecting the cubbies, drawers, and boxes you've created and make sure that everything is where it should be. Consider having a little cubby or drawer to organize the things you keep on the table in front of the TV. This could be where you place your remote, stray pens, magazines, and anything else you occasionally use in that room. This can look better than just throwing lose odds and ends on the table. Consider having a drawer on your bookshelf for loose items. You may not have the perfect place for extra CDs, odd-sized books, albums, or other loose items that don't quite fit on your shelves but don't belong anywhere better. Using one of these on your shelves can help everything stay organized. Use plastic trays under your kitchen and bathroom sinks. People tend to just throw plastic bags, cleaning supplies, detergent, and other household items under their kitchen sinks as well as a hodgepodge of beauty products and other paper products under the kitchen sink. Investing in just a few plastic drawers that can each be designated for certain items (such as a drawer for cleaning supplies or extra shower supplies) can help you feel more organized."
    },
    {
      "title": "Devote 10-15 minutes a day to organization.",
      "content": "Devote 10-15 minutes a day to organization. This doesn't sound so bad, does it? Find a time to take a 10-15 minute \"organization break\" from whatever you're doing to go around your house or office to make sure everything is in order. Is your desk as orderly as it could be? Have you folded and put away your clean laundry? Did you empty the dishwasher? Did you tie up all those loose ends at work? Take a walk around the house as well as one last peek at your calendar to make sure that you're not neglecting anything. Making this an important part of your day can help you stay organized. If this really sounds painful, you can do it with the TV and radio on. It won't take much effort to organize your side table while you're watching TV, will it? Though multi-tasking big tasks is not a good idea because it makes it hard for you to fully focus on one task, there are ways that you can cheat when you're trying to organize stuff around the house. While you're checking in with your mom on the phone, fold your laundry. When you're on hold with the credit card company, do those dishes. Find ways to make the best use of your time."
    },
    {
      "title": "Keep a notepad handy.",
      "content": "Keep a notepad handy. You can use a physical notepad or one on your phone or another electronic device if that's how you prefer to take notes. Having one nearby can help you write down anything that comes to mind -- such as the fact that you need to pick up paper towels, or a new way to organize a project for work -- so you don't completely forget the brilliant thought you just had. Make a habit of writing down any stray useful thoughts you are likely to forget and check in with that notepad often. Writing down your thoughts can also help you feel more in control of your daily tasks."
    },
    {
      "title": "Keep a journal.",
      "content": "Keep a journal. No, keeping a journal won't help you organize the stuff under your kitchen sink, and it probably won't substitute for filing all of those pesky papers on your desk. But keeping a journal can help you stay organized in another big way -- by giving you time to slow down and to write down your thoughts. You may feel constantly overwhelmed or like you're spinning out of control, desperately trying to check off a few items from your to-do list, because you never pause to take a break. Writing can help you do that. Writing down your thoughts and feelings, even if they have nothing to do with how to organize your life better, can make you feel more in control of your life, and can help you slow down long enough to get centered."
    },
    {
      "title": "Buy less stuff.",
      "content": "Buy less stuff. This is one of the easiest ways of simplifying your life. You may feel like you're not organized because you're always introducing new items into your environment. The next time you see a super sale, ask yourself if you really need the items, or if you already have something just like it or something that is almost as good. And if you really are committed to buying something, make sure you have enough space for it and that you'll know exactly where to put it before you bring it into your home. It's okay to splurge occasionally, but if you're routinely bringing new items into your home without having a place to put them, you won't be able to stay organized."
    },
    {
      "title": "Dispose of the stuff you don't need.",
      "content": "Dispose of the stuff you don't need. Decluttering is one of the easiest ways to stay organized. [3] X Expert Source Christel Ferguson Professional Organizer Expert Interview. 17 December 2018. Make a weekly or monthly habit of going through your stuff and making piles of things you no longer need and clothes and other items that need to be given away. If you look at something and don't know what it is, can't remember the last time you wore or used it, or just know it's taking up way too much space, then it may be time for it to go. If your items are worth donating, then donate them, and if you have to admit they are total junk, then you'll have to get rid of them. You'll feel more organized and in control of the things you do need once you do this. It's okay to hold on to a few items for sentimental reasons, but you can't make this an excuse for throwing nothing away. You can keep the stuffed teddy bear your first boyfriend gave you, but maybe get rid of the next ten stuffed animals he added to your collection. When it comes to donating clothes, a general rule of thumb is that you should get rid of anything you haven't worn in a year. This may sound harsh, but why do you want to hold on to something you haven't touched for that long? Unless you have some special-occasion clothing that you need to save for that next wedding, you should get rid of anything you know you won't be wearing again. Get rid of any duplicate items that are just taking up space. [4] X Expert Source Christel Ferguson Professional Organizer Expert Interview. 17 December 2018."
    },
    {
      "title": "Say no more often.",
      "content": "Say no more often. Another way to stay organized is to learn to say no to all of the people who are asking you to take on more responsibility. Sure, sometimes you may want to take on an additional task or to truly help someone out, but you shouldn't say yes just because you feel too guilty to say no, or because you get an ego boost from being needed. The next time someone asks you to do something you don't want to do, just apologize, say you have too much on your plate, and try to come up with a compromise if you really want to. At the end of the day, you'll feel more in control if you're not trying to cram eighty different things into your schedule. If you're a person who is struggling to stay organized, then one of the prime reasons may be that you have too much on your plate as it is. Why make that worse? Don't let people guilt you into doing something you don't want to do. Sure, there are times when a friend in need really needs you, but this should be an exception, not a rule."
    },
    {
      "title": "Treat time like money.",
      "content": "Treat time like money. Just like you should keep a budget to make sure you're spending wisely, you should think of your time as a commodity. How much of it do you have? How much of it do you want? How much of it are you spending on things you don't really care about? Break down how you spend your days -- cooking dinner, going to work, watching television, exercising, and see if there's anything you can cut out of your routine to make room for something you want to do more. For example, if you wish you exercised more, then maybe you should cut down those three-times-a-week phone calls with your best friend and go for a run during that time instead. You may feel like you don't have a free moment during the week until you write down exactly how you spend your time. Then you may find that you spend over ten hours a week watching television! While you may feel like you barely have time to decompress or watch TV, this time does add up. Though some TV watching can be educational, and watching some TV to relax never killed anyone, if you're struggling to find time to finish your work, revise your novel, look for new jobs, or to do just about anything, then this can be where you make up the time."
    },
    {
      "title": "Plan your meals in advance.",
      "content": "Plan your meals in advance. Another way people get bogged down and lose sight of their priorities is when it comes to making dinner. If you spend a lot of time buying groceries and preparing meals, then it can help to make a meal schedule for the week. You can leave one or two nights open for picking up food or going out to eat, if that's what you're into, but if you have a general idea of what you'll be cooking each day, you would have to run out to the store multiple times a week or spend twenty minutes looking for something to make from the stuff in your fridge and cabinets. Making a weekly meal calendar on your fridge, or in a separate planner, can help you be more on top of your cooking schedule, and it will save you time and earn you organizational points in the process."
    },
    {
      "title": "Do your errands sensibly.",
      "content": "Do your errands sensibly. This is another way to help you stay organized. You may feel that you're rushing around from place to place to get everything done without time to come up for air. Well, if you make your to-do list before you do it, you may find that there are ways that you can double up or to have someone help you accomplish these tasks if you just go about it a little differently. This can save you time and will help you stay organized in the process. If you only needed to pick up five items from the store, which happens to be next to your yoga studio, go to a yoga class and take a quick trip to the store afterwards instead of breaking it up into two separate trips. This will help you knock items off your to-do list and to move on with your day. Delegate when you can. If you know your husband is going to the pharmacy in the afternoon anyway, ask him to pick up your favorite shampoo. You can help him get something he needs later in return."
    },
    {
      "title": "Tell your friends and family about it.",
      "content": "Tell your friends and family about it. One way to stay organized is to hold yourself accountable to your friends and family. If you plan on doing a spring cleaning this month, tell your family that you intend to do it. If you plan on finally sending out your wedding invitations by the end of the week, tell your friends so they can eagerly check their mailboxes. Saying that you'll get a task done is different from writing it down, because it makes you feel like you'll be letting people down if you don't do it. This isn't meant to make you put a ton of pressure on yourself. However, it is meant to make you feel like you will stay organized as you go about your daily tasks."
    },
    {
      "title": "Set deadlines for yourself.",
      "content": "Set deadlines for yourself. This is similar to telling the people close to you that you'll get something done in order to make yourself stick to your plan. For example, if you've been talking about donating your clothes to Goodwill for weeks, call them and make an appointment. If you know they'll be coming by on 3 pm on Friday to pick up your stuff, you'll have to have it ready before then! Set as many deadlines as you can for yourself, making sure that they will help you stick to your plan instead of stress you out. If you want to take it to the next level, tell your boss that you'll get that report done by the end of the week. That'll definitely hold you accountable!"
    },
    {
      "title": "Avoid perfection.",
      "content": "Avoid perfection. One of the reasons that you may be struggling to stay organized is because you spend way too much time on one task and then leave no time for the other five things you had to do that day. Instead of making sure that you do Task A perfectly, make sure that you do a great job of it, but give yourself enough time to move on. One way to do this is to say, \"I'm going to spend another 45 minutes on this project, and then I'll turn it in.\" Giving yourself time deadlines will help you manage your time and will make it easier for you to feel on top of things because you'll have time do to everything you wanted to do. One of the signature qualities of organized people is that they know when they've made an \"An effort\" and move on. It's mostly not worth it to bring that task up to an \"A+\" unless it really means something to you."
    },
    {
      "title": "Delegate as much as you can.",
      "content": "Delegate as much as you can. Learning to delegate is a big step if you want to follow through on your organized life style. Just because you want to stay organized, it doesn't mean that you want to do every little thing yourself. If you're determined to keep your household in shape, then you should make sure that your kids, significant other, roommates, or anyone else sharing the space with you also does their share of tasks; if you want to keep things running smoothly at work, make sure all of the employees are contributing toward your goals with helpful tasks. If you plan on doing everything on your own, it'll be harder to follow through on what you say you'll do. Don't be afraid to ask for help. If you feel overwhelmed by tending to your garden, ask a friend to help you. If you feel like you can't study for a math exam alone, ask a smart friend for help. Knowing when you can't do something alone can help you stay on top of things; getting help is far better than flailing."
    },
    {
      "title": "Reward yourself for tasks you've accomplished.",
      "content": "Reward yourself for tasks you've accomplished. If you want to continue to follow through on staying organized, then you should reward yourself for a job well done. Don't just do one task and move on; reward yourself with whatever works best, whether it's a frozen yogurt at the shop down the street or a fifteen-minute break to read your favorite gossip blog. Life isn't all about doing work and getting stuff done, and if you never stop to let yourself know what a great job you're doing, or take a break from time to time, then you're likely to feel overwhelmed. If you want to stay on top of things, then you have to know when to take a break! You can even build some rewards into your \"to do\" list. Maybe after you do the first two things, you can take a short walk. Maybe after you finally get that project done, you can go to your friend Mindy's party. If you approach your tasks this way, not only will you be more likely to be more organized and to get everything done, but you'll also have more fun along the way!"
    }
  ]
}