{
  "url": "https://www.wikihow.com/Start-a-Compare-and-Contrast-Essay",
  "title": "How to Start a Compare and Contrast Essay",
  "steps": [
    {
      "title": "Understand the structure of a compare and contrast essay.",
      "content": "Understand the structure of a compare and contrast essay. Most compare and contrast essays bring one or both subjects into sharper focus, lead to a new way of viewing something, or show that one subject is better than the other. To compare and contrast effectively, your essay should make new connections or distinctions between two subjects. [1] X Research source If your instructor has already given you your topic, you may be contrasting two things that could go into the same category, but are different from each other. For example, cats and dogs are both animals, but they are different from each other in many ways. The pro-life view on abortion, and the pro-choice view on abortion could both fit under the category of a human rights issue, but they are two very distinct views or positions."
    },
    {
      "title": "Make a list of similarities and differences.",
      "content": "Make a list of similarities and differences. Take out a piece of paper or start a new document on a word processor. Create two columns for each subject for the similarities and two columns for each subject for the differences between each subject. For example: Two separate lists for the similarities between cats and dogs, and the differences between cats and dogs. [2] X Research source Try to write as many similarities and differences you can think of. For example: cats and dogs are both domesticated animals. But cats have different temperaments than dogs, and cats are known to be indoor pets, while dogs tend to need to be walked and played with outside on a constant basis. Think about at least one or two meaningful differences and similarities between the two subjects. For example, a compare and contrast between abortion rights could lead to meaningful notes like: The pro-life stance views fetuses are full formed humans and are often based in religious beliefs, while the pro-choice stance views fetuses as undeveloped eggs and are often based in scientific beliefs. To focus your list, choose categories (or possible supporting points for your paper) to classify the similarities and differences between the two subjects. For example, for the abortion rights topic, you may choose categories like: legal details, women's rights, scientific stance, and religious beliefs. You can then separate each item on the list into these categories."
    },
    {
      "title": "Create a Venn diagram of your topic.",
      "content": "Create a Venn diagram of your topic. Take out a piece of paper and draw two large overlapping circles, one for each subject or item. In the center area where the two circles overlap, list the traits the two items have in common. Assign each of the areas that do not overlap. In these areas, you can list the traits that make the subjects different. Be specific when listing words or phrases for each subject or each perspective on the same subject. [3] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Once you are done listing 10-15 differences and 5-7 similarities, circle the most important items in each list. Then, match at least three opposites from one circle to the other circle. Review the list and look for three different categories that describe these traits. For example, for the abortion rights topic, you may have “scientific studies of the fetus” on the pro-choice side, and “belief in life of the fetus” on the pro-life side. One possible category could then be the debate of the life of a fetus."
    },
    {
      "title": "Answer the 5 W's and H questions.",
      "content": "Answer the 5 W's and H questions. Try to answer the questions journalists traditionally ask: Who? What? Where? When? Why? and How? Apply these basic questions to your topic to get a sense of each topic or perspective. [4] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source If you're compare and contrasting two historical periods or events, you may ask: When did they occur (the dates and the duration)? What happened or changed during each event? Why are they significant? Who were the important people involved? How did the events occur, and what consequences did they have later in history? If you're compare and contrasting two ideas or theories, you may ask: What were they about? How did they originate? Who created them? What is the central focus, claim, or goal of each theory? How do the theories apply to situations/people/things, etc.? What kind of evidence is used to support each theory? If you're compare and contrasting two pieces of art, you may ask: What does each piece of art describe or depict? What is their tone or mood? What themes do they address? Who created them? When were they created? How do the creators of the artworks describe their own work? Why do you think the artworks were created as they were? If you're compare and contrasting two people, you may ask: Where is each person from? How old are they? What, if anything, are they known for? How do they identify themselves in terms of gender, race, class, etc? Do the two people have any relationship to each other? What does each person do? Why is each person interesting? What are the defining features of each person?"
    },
    {
      "title": "Note any gaps in your knowledge or research.",
      "content": "Note any gaps in your knowledge or research. Your instructor may require you to do in depth research on a complex topic, like abortion rights, or you may be writing from a purely opinion based perspective, such as why you love cats more than dogs. Once you complete your brainstorm, you should be able to identify aspects of the essay that you may need to do more reading or research on if your topic is academic and/or based in current events and social issues. Your instructor may also ask for a discussion of more than one similarity and difference between the two topics or two perspectives. Identify any gaps in your knowledge and prepare to do research so you can better compare and contrast the two topics in your essay."
    },
    {
      "title": "Compose your thesis statement",
      "content": "Compose your thesis statement . The thesis of your compare and contrast essay will help you create a focused argument and act as a road map for you, and for your reader. Go for specific and detailed, over vague and general. [5] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Your thesis should note the key similarities and differences of both subjects. For example: “Dogs and cats are both seen as ideal, domesticated pets, but their temperaments and breeding set them apart.” Your thesis should also be able to answer the question, “So what? Why should anyone care about the positives and the negatives of owning a cat or a dog?” A reader may also wonder why you chose to look at cats and dogs, and not other domesticated pets like birds, reptiles, or rabbits. Your thesis statement is much stronger if you address these questions, and a stronger thesis can lead to a stronger essay. The revised thesis may look like: “Dogs and cats are both considered ideal, domesticated pets, and prove more popular than other domesticated animals like birds or rabbits, but the low maintenance and particular temperament of cats makes them better pets for a variety of households.” A more concise thesis, which allows for a more open discussion of both options, may look like: “Both cats and dogs make excellent domesticated pets, but an appropriate choice depends on the pet owner's lifestyle, finances, and living accommodations.”"
    },
    {
      "title": "Organize your paper by the block method.",
      "content": "Organize your paper by the block method. In the block method, each paragraph in the essay addresses one topic only from the pair of topics and looks at the shared traits or aspects you came up with during your brainstorm. [6] X Research source The organization for this method is as follows: Introduction: Introduce the general topic, then introduce the two specific topics. End with your thesis, which addresses what is going to be covered in the essay. Body paragraph 1: Begins with the topic sentence for topic 1. For example: “Cats are easier to maintain and less expensive to care for than dogs.” Leads into Aspect 1: Lifestyle, with at least two details. For example, how cats do not have to watched during the day, and are easier to get care if the owner travels or is often not home. Leads into Aspect 2: Cost, with at least two details. For example, how food and healthcare are less expensive for cats and how cats are less likely to cause property damage to the owner's home. Leads into Aspect 3: Living accommodations, with at least two details. For example, how cats do not take up a lot of space and they are less intrusive as they do not require daily walks or constant play. End the paragraph with a transition sentence. Body paragraph 2 will follow the same structure, with three Aspects and two supporting details for each aspect. Body paragraph 3 can follow the same structure as Body paragraph 2 and 3. Or it can be a paragraph that develops the comparison made in the previous two paragraphs. You can use scientific data, crowd sourced feedback, or a personal experience. For example, you may have been in a position where you had to compare and contrast adopting a dog or a cat and made your decision based on your lifestyle, finances, and living situation. This could serve as a personal experience to back up your previous arguments. Conclusion: Contains a summary of your main points, a restating of your thesis, an evaluation of your analysis and any future developments that may sway your compare and contrast to one topic over the other."
    },
    {
      "title": "Use a point by point structure.",
      "content": "Use a point by point structure. In the point by point method, each paragraph contains the arguments for only one aspect of both topics. [7] X Research source The organization for this method is as follows: Introduction: Introduce the general topic, then introduce the two specific topics. End with your thesis, which addresses what is going to covered in the essay. Body paragraph 1: Begins with topic sentence for Aspect 1. For example: “Cats are easier on the pet owner's lifestyle and finances.” Leads into Topic 1, Aspect 1: Cats, with two details supporting cats in the argument. For example, how cats do not have to watched during the day, and are easier to get care if the owner travels or is often not home. Leads into Topic 2, Aspect 1: Dogs, with two details contrasting dogs to the previous argument. For example, how dogs are pack animals and shouldn't be left alone for long periods of time, and how it can be difficult to find care for a dog when the owner is away. Ends with a transition sentence. Body paragraph 2 will follow the same structure, with a discussion of Topic 1 and Topic 2 in relation to Aspect 2, for example: “Cats are less expensive to own and care for.” There should be two supporting details for each topic. Body paragraph 3 will follow the same structure, with a discussion of Topic 1 and Topic 2 in relation to Aspect 3, for example: “Cats need less special house accommodations than dogs.” There should be two supporting details for each topic. Conclusion: Contains a summary of your main points, a restating of your thesis, an evaluation of your analysis and any future developments that may sway your compare and contrast to one topic over the other."
    },
    {
      "title": "Be assertive and clear.",
      "content": "Be assertive and clear. Avoid apologizing to your reader by saying you are not an expert on the two topics or your opinion does not matter. Don't lead with a phrase like, “In my humble opinion”, or “I could be wrong, but I believe.” Instead, you should move confidently in your introduction, keeping in mind your thesis statement and the essay outline you created. [8] X Research source You should also avoid announcing your intentions in a straightforward and formal way. For example, skip statements like “In this paper, I will” or “The purpose of this essay is to”. Instead, your reader should be able to perceive the purpose of your essay through the first two sentences in your beginning paragraph."
    },
    {
      "title": "Create a hook for your first sentence.",
      "content": "Create a hook for your first sentence. A hook, or attention grabber, can help to engage your reader right away, especially if your topic is dry or complex. Try to create a hook using these starting points: [9] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source An interesting or surprising example: This could be a personal experience of when a cat proved to be a better pet than a dog, or a scientific study that shows the differences between cats and dogs. A provocative quotation: This could be from a source you used for your essay or one that feels relevant to your topic. A vivid anecdote: An anecdote is a very short story that carries moral or symbolic weight. Think of an anecdote that might be a poetic or powerful way to start your essay. You can also look through your research for your essay for any note worthy anecdotes. A thought provoking question: Think of a question that will get your reader thinking and engaged in your topic. For example: “Did you always wish you had a cat but ended up with a dog when you were growing up?”"
    },
    {
      "title": "Revise your introduction once you complete the essay.",
      "content": "Revise your introduction once you complete the essay. Another technique is to write a temporary introduction, with your thesis statement, and then revise it or rewrite it once you finish your essay. If you feel stumped by the introduction, as you aren't sure what you are going to argue in detail or how your main argument is going to take shape, try writing your introduction last. [10] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source The writing process can be an important way to organize your ideas, think through certain points, and refine your thoughts. Writing or revising the introduction once you are done your essay will ensure the introduction matches the body of your essay."
    }
  ]
}