{
  "url": "https://www.wikihow.com/Stop-Armpit-Sweating",
  "title": "How to Stop Armpit Sweating",
  "steps": [
    {
      "title": "Diagnose the problem specifically.",
      "content": "Diagnose the problem specifically. Before you go buy more of the same old deodorant at the store, you need to think a bit about what exactly your problem is, to get the right product for the job. For some people, the biggest problem with sweaty pits is body odor, while for others the biggest problem is unsightly sweat stains and the resulting embarrassment. [1] X Research source If you struggle from body odor and sweat stains, you need to use an approach that addresses these problems individually. Applying deodorant will do nothing to stop your armpits from sweating though it will mask the odor. You can't stop your body from perspiring completely without medical procedures, which are typically only performed in extreme cases. Sweat regulates your body's temperature and, as such, is necessary to your overall health."
    },
    {
      "title": "Buy an appropriate product for your problem.",
      "content": "Buy an appropriate product for your problem. Depending on your problem, you may either need commercial deodorant, antiperspirants, or a hybrid product, or you may need to talk to your doctor about more powerful prescription anti-perspirant products on the market. [2] X Research source If you've got a problem with body odor , you need to use deodorant that uses gentle, natural ingredients that will mask the odor, and practice other good hygiene practices that will remedy the problem. Read the section for general hygiene tips. If you've got a problem with sweat stains , most commercial anti-perspirants that use aluminum chloride hexahydrate are effective at controlling the amount of sweat that your underarms produce. If you would like some additional protection against sweat stains showing on your clothes, you could also use sweat pads that stick to the underarms of your clothing."
    },
    {
      "title": "Try making your own natural deodorant treatments",
      "content": "Try making your own natural deodorant treatments . There are all-natural commercial deodorants, but you can also create your own natural deodorant to control sweat produced in your underarms. Mix equal parts of baking soda and water to create a sweat-controlling paste, then let it sit for 20-30 minutes. After that time, rinse off the mixture with water. Try using apple vinegar or other malt vinegar to neutralize the armpits' natural odor-causing bacteria. This in turn creates a drying effect in your underarm, which conditions your armpits to sweat less and to stay dry. Try a mixture of lemon juice and tomato pulp before bed. Let sit for 15 minutes. Make a paste from ground walnut leaves and eucalyptus. Some people think that sage tea helps to act as a \"coolant,\" keeping the body from sweating."
    },
    {
      "title": "Apply your products properly.",
      "content": "Apply your products properly. Contrary to popular belief, the best time to apply antiperspirant is at night since doing so gives your body time to fully absorb it. Apply antiperspirant after you bathe but allow your skin to dry completely before doing so, and allow the product to dry completely before putting clothes on, as well. [3] X Research source Apply a thin layer of deodorant or antiperspirant (about 2 strokes up and 2 strokes down) to your dry underarms. [4] X Research source Depending on your body type and the exact product, you may only need to reapply deodorant or antiperspirant once every 1-3 days. Check the product label and, if in doubt, talk to your doctor if you think you may sweat abnormally often. [5] X Research source [6] X Research source If you've noticed that you're already sweaty, don't apply products over the sweat, which won't do anything to control odors. Instead, you need to wash your armpits using soap and water, try to cool yourself down, then apply fresh product under your arms."
    },
    {
      "title": "Shower more regularly.",
      "content": "Shower more regularly. Controlling underarm sweat requires more than just products and remedies. Keeping your body clean and dry is essential to controlling your underarm sweat throughout the day. If you struggle with it, it's a good idea to shower your body, or at least your underarms, at least once and as many as two times a day to keep it in check. During the summer time, if you live in a humid climate, try to keep a little time between a hot shower and getting dressed, if you struggle with underarm sweat. Let yourself completely dry and let your body cool down before you put clothes on, or you may immediately start sweating."
    },
    {
      "title": "Wash your shirts after every use.",
      "content": "Wash your shirts after every use. Especially if you've sweated in a shirt, it's essential that you thoroughly wash your clothes between wearings. Again, underarm body odor is not caused by sweat, exactly, it's caused by the bacteria left from dried sweat, which produces an unpleasant odor. If you don't wash sweat from clothes, the bacteria from the sweat you leave builds up over time, making the smell worse. It's very important to change clothes regularly and keep them clean. If you really sweat a lot, change your shirt more often, even if it's in the middle of the day. If you know you might get sweaty at work, keep a pressed shirt if your bag, ready to go if necessary."
    },
    {
      "title": "Wear undershirts.",
      "content": "Wear undershirts. Clean white t-shirts can do a lot to absorb extra sweat, keeping it away from your outer shirt layer. If you're a big sweater, consider layering your clothes so that the sweat won't come through to your outer shirt as easily. Like your outer shirts, it's also important to keep these washed and clean regularly to avoid unpleasant smells."
    },
    {
      "title": "Shave your armpits.",
      "content": "Shave your armpits. If you have a big sweating problem, it's sometimes true that shaving your armpits can help, somewhat. While shaving your pits won't make your armpits cooler, or produce less sweat, it will keep the sweat from collecting in your armpits, which can make the sweat stains more pronounced, and the odor more prevalent. [7] X Research source It's important to know that body hair, including armpit and even facial hair, actually helps to cool your body in hot temperatures collecting the sweat you secrete, which cools as it evaporates. Shaving body hair might make the sweat less present in your armpits, but it might also make your body sweat slightly more."
    },
    {
      "title": "Change your diet.",
      "content": "Change your diet. Strong-smelling foods and some food families will affect the way your sweat smells, according to recent studies. If you already tend toward sweatiness, it's important to be aware of dietary issues that might be making it worse. [8] X Research source Onions, garlic, and other foods in the alliaceous family will cause sulfurous, pungent sweat upon drying. Some spices, like asafetida, cumin, and curry powder will likewise be detectable in the underarms, as well as cruciferous vegetables like cabbage or broccoli. Diets high in red meat, dairy, or alcohol produce distinctive-smelling sweat that many people become acclimated to over time. Capsaicin, found in hot peppers, will stimulate the nerve receptors in your mouth in the same way that actual heat does, tricking your body into thinking that you're hot. Your hypothalamus will send out a signal to sweat."
    },
    {
      "title": "Exercise to lower your body-mass index (BMI).",
      "content": "Exercise to lower your body-mass index (BMI). If you have more mass on your body, your body will sweat more to keep itself cool. If you're really struggling with underarm sweat, it may be something you can remedy by incorporating cardiovascular exercise into your routine and losing some weight . Get all your sweating out with exercise. [9] X Research source The best and quickest way to lose weight is to increase your physical activity and decrease the number of calories you consume in a day to a stable level. try to incorporate leaner proteins, like legumes, lean chicken, and eggs to replace fried foods, dairy, and red meat, and increase the number of whole grains and vegetables in your diet. Stay well hydrated throughout the day and try to start exercising small. Start going on long walks in the morning and at night, then showering to remove the sweat from your body and cool down."
    },
    {
      "title": "Talk to your doctor about treatment options.",
      "content": "Talk to your doctor about treatment options. Axillary hyperhidrosis is the clinical name for excessive sweating, and various treatment options available, with consultation from your general practitioner. It's likely that you'll first be recommended specific aluminum-based topical treatments, but there are a variety of other more aggressive treatments available, if the situation is severe. [10] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source In some cases, an oral anticholinergic such as Rubinol or glycopyrrolate will be recommended, which helps to curb sweating, particularly in the underarms. Talk to your doctor about onabotulinumtoxina injections. This treatment method is minimally invasive, and supposedly effective, offering an average efficacy rate of six-eight months."
    },
    {
      "title": "Consider iontophoresis treatment.",
      "content": "Consider iontophoresis treatment. This type of electrotherapy involves, typically, two to four 20-minute sessions per week. Water is used to conduct a small electric current on your skin, which can help to reduce sweating for several weeks or months. While the treatment has mixed results and is somewhat uncomfortable, it's effective in about 70% of cases for armpits. https://www.aad.org/public/diseases/a-z/hyperhidrosis-treatment"
    },
    {
      "title": "Think about thoracis sympathectomy as a last resort for treatment.",
      "content": "Think about thoracis sympathectomy as a last resort for treatment. This treatment uses a small endoscopic instrument that is inserted below the armpit to interrupt the sympathetic nerves that cause you to sweat. This treatment is effective, but risky, with side effects that include complications in breathing, nerve damage and/or causing other parts of your body to sweat excessively. [11] X Research source"
    },
    {
      "title": "Consider Botox as a longer-term solution.",
      "content": "Consider Botox as a longer-term solution. Theoretically, Botox injections can and have been used to control underarm sweat for up to six months, with success reported among many people. You may only wish to consider it if you have a problem with severe underarm sweating, though, as treatments can run from $700, and they can be very painful. [12] X Research source There's no proven medical link between Botox and sweating, and it's not generally recommended to seek this as treatment by the medical community. Still, it's used by some."
    }
  ]
}