{
  "url": "https://www.wikihow.com/Use-a-SIM-Card-to-Switch-Phones",
  "title": "How to Use a SIM Card to Switch Phones",
  "steps": [
    {
      "title": "Check the size of the SIM card each phone uses.",
      "content": "Check the size of the SIM card each phone uses. SIM cards come in three major sizes, and your phones may use different sizes. This is especially true if the phones were made several years apart. Most carriers will provide you with the correct size SIM card for free. [1] X Research source A Standard SIM is 15mm by 25 mm. A Micro SIM is 12mm by 15mm. A Nano SIM is 8.8mm by 12.3mm. You can cut larger SIMs down with a special SIM cutter tool, or just ask your carrier for the correct size. If the SIM you have is too small to fit into the new phone, you can get an adapter card—these cars let you place a smaller SIM (such as a Nano SIM) inside a card that's larger (Micro or Standard)."
    },
    {
      "title": "Get a new SIM if you are switching carriers.",
      "content": "Get a new SIM if you are switching carriers. If the phone you're switching to is from the same carrier or it's unlocked, you shouldn't need a new SIM. But if you're switching from one carrier to another, you'll need a SIM card for your new carrier. The SIM card is free when signing up for a new plan, and some carriers may even provide all three sizes of your SIM card just in case. [2] X Research source Phone carriers used to operate only two types of networks: GSM and CDMA . It used to be true that most CDMA phones didn't require SIM cards, but that's no longer the case—unless you're using an older CDMA model, you'll definitely need a SIM. If the new phone is from a different carrier than the SIM you have, the SIM may still work if the phone is carrier-unlocked. But if the phone is locked to a specific carrier or account, you'll need to have the carrier unlock the phone."
    },
    {
      "title": "Back up your contacts (optional).",
      "content": "Back up your contacts (optional). The most convenient way to back up your contacts on an Android or iPhone is to sync them to your Google account or to your iCloud account . [3] X Research source This way, the same contacts will be available on any phone you use upon logging in with the same Google or Apple account. But if you're using an Android, have contacts save to your phone's memory, and would rather save them to your SIM card so they will already be on your new phone, you can export them to your SIM card on many Androids. [4] X Research source It's no longer possible to transfer contacts directly to a SIM on an iPhone."
    },
    {
      "title": "Remove the phone's case if there is one.",
      "content": "Remove the phone's case if there is one. If you're using a protective phone case or cover, you'll need to remove it to get the SIM card out. There's no need to remove your glass screen protector (if you have one)—just the case. Although it may not be required depending on the models, turning off both phones before you begin can help ensure that removing and inserting a SIM card goes smoothly. If your phone has an eSIM (and electronic SIM card), you can't physically remove it from a phone. If you need to transfer your eSIM to a new phone, your carrier will need to do the swap. Give your carrier a call for assistance."
    },
    {
      "title": "Locate the SIM card.",
      "content": "Locate the SIM card. Depending on the type of phone you have, the SIM card can be located in different spots: iPhone: iPhones have SIM trays, which are located in different places depending on the model. [5] X Research source Look for the small hole on a rectangular panel: Left side: iPhone 12 (all models). Right side: iPhone 11 (all models), iPhone XS & Max, iPhone XR, iPhone X, iPhone SE (all models), and all models of iPhone 8, 7, 6, 5, and 4. Android: If your Android has a removable battery, you'll usually find the SIM card behind the battery or otherwise inside the battery cover. If not, you'll have a SIM tray on one of the phone's edges. The location is different depending on your Android, but you can identify the SIM tray by locating the small round hole on a rectangular panel."
    },
    {
      "title": "Remove the SIM card",
      "content": "Remove the SIM card from the old phone. Removing the SIM is pretty easy once you figure out where it is. When removing the SIM, try to avoid touching the gold contacts on the bottom side. [6] X Research source If there is a SIM tray , you should have a SIM tool that came with your phone. It's usually a small oval-shaped tool with one pointed protruding end that's has the diameter of a paperclip. If you don't have the original tool, you can use a paperclip—just extend one end of the paperclip so it's pointed outright, and then insert it into the hole on the SIM tray. Push in gently until the tray pops out. Then, lift the SIM card from its place inside the tray, or just flip the phone over so it falls onto a soft surface. If the SIM is behind your battery, you can either slide it out or press it in a little to pop it out, depending on your phone. If you wind up damaging your SIM card during the swap, you can usually get a replacement SIM at no cost from your provider."
    },
    {
      "title": "Insert the SIM card into the new phone.",
      "content": "Insert the SIM card into the new phone. If the new phone also has a SIM tray, open it now. If there's a battery cover, remove the cover and locate the SIM slot. The SIM has a small notch at one corner that acts as a guide—this means it will only fit into the tray or slot one way, making it simple to insert properly. Slide the tray back in or replace the battery and cover when finished. [7] X Research source If the SIM is too small for the tray or slot in the new phone, get an adapter card kit—these kits are cheap and come with adapters that accommodate all three SIM sizes."
    },
    {
      "title": "Turn on the new phone and go through the setup process.",
      "content": "Turn on the new phone and go through the setup process. If you're setting up a new smartphone, you'll be taken through an initial setup process. During this process, your SIM will typically be activated for your new phone automatically. When activating a new phone , you'll be asked to sign in with a Google or iCloud account/Apple ID. [8] X Research source If you backed up your contacts from your old phone to your Google or iCloud account, make sure you sign in with the same account info as you used on the old phone. This ensures that your contacts sync to your new phone. [9] X Research source If your phone was already set up, you'll usually get service a few moments after you insert your SIM card. Just insert the SIM card, power it on if it wasn't on already, then wait to see if you connect. You'll see the signal bars appear in the phone's notification area, and you'll usually see the carrier name next to them."
    },
    {
      "title": "Contact your carrier if you cannot connect.",
      "content": "Contact your carrier if you cannot connect. If your SIM is still not activating in the new phone, you'll likely need to contact the carrier. Since the phone isn't connected, you'll need to either call from another line or visit a carrier store to have the phone activated."
    }
  ]
}