{
  "url": "https://www.wikihow.com/Use-a-Scientific-Calculator-For-Algebra",
  "title": "How to Use a Scientific Calculator For Algebra",
  "steps": [
    {
      "title": "Use the basic operation symbols to perform basic operations.",
      "content": "Use the basic operation symbols to perform basic operations. These operations include addition (+), subtraction (-), multiplication (×), and division (÷). You have to hit the equals (=) sign to complete a calculation using these symbols. Use these functions the same way you would on a basic calculator. For example, to find 12/4, enter 12 ÷ 4 = {\\displaystyle 12\\div 4=} ."
    },
    {
      "title": "Change the order of operations using the parentheses keys.",
      "content": "Change the order of operations using the parentheses keys. This will override the calculator’s order of operations. Hit the beginning parentheses before you hit your first number, and hit the ending parentheses after you hit your last number. The calculator will complete that calculation before you enter your next functions. If you need, you can also nest parentheses, though be sure that you can keep track of them."
    },
    {
      "title": "Fix your mistakes.",
      "content": "Fix your mistakes. If you accidentally hit a wrong key, hit the D E L {\\displaystyle \\mathrm {DEL} } button. This will clear the last button you pressed, but will not clear any calculations you’ve made."
    },
    {
      "title": "Clear your work.",
      "content": "Clear your work. To clear the line, hit the C L E A R {\\displaystyle \\mathrm {CLEAR} } button. Chances are, you can scroll up to see past calculations. You can hit delete with each line to get rid of these."
    },
    {
      "title": "Explore all the functions on the calculator.",
      "content": "Explore all the functions on the calculator. To use some functions, you might have to use the 2 n d {\\displaystyle \\mathrm {2nd} } key. These functions are listed above the button, similar to how symbols are listed above the number keys on a keyboard. To use these functions, hit the 2nd key first. Getting the syntax right for some operations may involve switching the order between the operation and the number. For the TI-30X IIS, one of the 2nd functions is to turn off the calculator. Simply press 2 n d O N {\\displaystyle \\mathrm {2nd} \\ \\mathrm {ON} } ."
    },
    {
      "title": "Make a fraction.",
      "content": "Make a fraction. While there are buttons to do this, fractions are much easier to type in manually. The reason is that most scientific calculators only output in decimal format. For example, to evaluate 4/5 + 6/7, type in 4 ÷ 5 + 6 ÷ 7 = {\\displaystyle 4\\div 5+6\\div 7=} to get approximately 1.657. Use parentheses for more complex operations. To convert back to fractions, use 2 n d P R B {\\displaystyle \\mathrm {2nd} \\ \\mathrm {PRB} } to get the answer in mixed fractions."
    },
    {
      "title": "Square a number.",
      "content": "Square a number. Do this using the x 2 {\\displaystyle x^{2}} button. Type in the number you want to square, then hit that button. For example, to square the number 12, type 12 x 2 = {\\displaystyle 12\\ x^{2}=} . To find powers of any number, use the ∧ {\\displaystyle \\wedge } key. For example, type 3 ∧ 5 = {\\displaystyle 3\\wedge 5=} to get 243."
    },
    {
      "title": "Find a square root.",
      "content": "Find a square root. Type 2 n d x 2 {\\displaystyle \\mathrm {2nd} \\ x^{2}} to display the square root. To find the square root of 9, type 2 n d x 2 9 = {\\displaystyle \\mathrm {2nd} \\ x^{2}\\ 9=} ."
    },
    {
      "title": "Find logarithms.",
      "content": "Find logarithms. There are two buttons for logarithms. The L O G {\\displaystyle \\mathrm {LOG} } is the logarithm base 10. Use whichever one is appropriate. For example, to find the logarithm base 10 of 100, simply type L O G 100 = {\\displaystyle \\mathrm {LOG} \\ 100=} ."
    },
    {
      "title": "Use the exponential function.",
      "content": "Use the exponential function. The exponential function e x {\\displaystyle e^{x}} is found by typing 2 n d L N {\\displaystyle \\mathrm {2nd} \\ \\mathrm {LN} } . If you need to use Euler's number only, use e to the first power. For example, to find the natural log of e, type in L N 2 n d L N 1 = {\\displaystyle \\mathrm {LN} \\ \\mathrm {2nd} \\ \\mathrm {LN} \\ 1=} ."
    },
    {
      "title": "Find trigonometric functions.",
      "content": "Find trigonometric functions. Sine, cosine, and tangent come standard with any scientific calculator. To use these buttons, be sure that you know whether to use degrees or radians. To convert, use the D R G {\\displaystyle \\mathrm {DRG} } button to highlight DEG or RAD. Other calculators will generally have a button that converts between these two systems. For example, if you wanted to find the sine of 60 degrees, make sure that you are in degree mode by checking the lower right of the display. Then, type S I N 60 = {\\displaystyle \\mathrm {SIN} \\ 60=} ."
    },
    {
      "title": "Find the reciprocal of a number.",
      "content": "Find the reciprocal of a number. Do this using the x − 1 {\\displaystyle x^{-1}} button. On some calculators, it may be labeled as 1 / x {\\displaystyle 1/x} instead. Type in the number you want to find the reciprocal of, then hit the reciprocal button. For example, to find the reciprocal of 3, type 3 x − 1 = {\\displaystyle 3\\ x^{-1}=} ."
    }
  ]
}