{
  "url": "https://www.wikihow.com/Write-a-Literature-Review-for-a-Research-Paper",
  "title": "How to Write a Literature Review for a Research Paper",
  "steps": [
    {
      "title": "Locate the most recent work in the field.",
      "content": "Locate the most recent work in the field. In general, a literature review should be up-to-date so your reader knows the current state of the field. Start by looking for the most recent publications in the field you’re working on. Use these works to get an idea of where the field currently lies. [1] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Your library search engine is the best source for recent or classic work. If your topic is the effect of racism on hiring, try searching keywords like “employment,” “discrimination,” “racism,” and “United States.” The librarians in your library are there to help, so don’t hesitate to ask if you need any assistance finding work to read. Remember that newer publications aren’t necessarily better than older ones. But it’s important to find new work so your review is up-to-date. You could also check the bibliographies in the work you're already using or ask your professor for reading suggestions if you need more ideas. [2] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source"
    },
    {
      "title": "Identify the main argument of each work you read.",
      "content": "Identify the main argument of each work you read. Most of the work you’ll be reading for your literature review will present an argument, or at least a perspective. Finding and identifying the argument of each work you use is a very important part of your lit review, so be sure to write these down as you’re reading your sources. [3] X Research source Try to state each argument as simply as possible. Sum up the author’s point in a sentence, if you can. In most cases, you won’t have to read the entire work to understand the author’s argument. Some state their arguments at the beginning very clearly. Only read enough so you can identify that argument so you don’t make too much work for yourself."
    },
    {
      "title": "Critique the sources and evidence that each author uses.",
      "content": "Critique the sources and evidence that each author uses. For a lit review, it’s not enough to simply state the author’s argument. You also have to evaluate that argument. Look at the sources and evidence the author uses to determine the strength of the argument. When you're writing your review, note how the evidence helps or hurts the author's arguments. [4] X Research source One way you could evaluate a source on employment discrimination is by looking at the evidence. One source might use mostly newspaper articles for evidence, which aren’t always reliable. Another might use statistical data and government studies, which are usually more reliable, and therefore this source is more convincing. The evidence that the author uses should also be easy to find, and they should provide clear citations and links if possible. If you can't track down the sources the author is using, then their argument is suspect. [5] X Research source"
    },
    {
      "title": "Examine any personal bias the author may have.",
      "content": "Examine any personal bias the author may have. Bias can also determine whether or not a work is useful. A biased author might overstate their conclusions, make people they like look better, or leave out evidence that doesn't support their argument. This all hurts the author's argument. Check for bias in the work you use and note it in your lit review. [6] X Research source If you’re researching music in 20th-century Europe, for example, a musician might say that they had a huge impact on the scene. The fact that this person was a musician at the time could make their opinion biased. Remember that all people have bias, so a biased work isn't necessarily useless. But it's something to note in your lit review to show that you've evaluated all your sources carefully. Personal bias is another important part of evaluating sources."
    },
    {
      "title": "Summarize each source so writing your review is easier.",
      "content": "Summarize each source so writing your review is easier. When you’re done evaluating your sources, come up with a quick summary for each one. Note each work’s arguments and evidence, as well as its significance for the field. [7] X Trustworthy Source Purdue Online Writing Lab Trusted resource for writing and citation guidelines Go to source This way, you’ll have a quick reference guide while you write your review and won’t have to keep flipping through your notes. It’s best to take notes while you’re reading and jot down each author’s argument, sources, bias, and your own thoughts on the work. This keeps all of your information in a nice, compact place."
    },
    {
      "title": "Group all of your sources into categories.",
      "content": "Group all of your sources into categories. When you read all of your sources, you’ll probably start seeing different themes. Some authors might agree with one another, some might directly argue with each other, and some might offer completely different perspectives. Identifying these categories and themes is an important part of a lit review, so make note of them and group your sources into these fields before writing. [8] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Sticking with the employment discrimination topic, you might come across some authors who say this is a big problem, and others who don’t think it’s so severe. You might also see some authors acknowledging discrimination but attributing it to different causes."
    },
    {
      "title": "Write your lit review in essay-format.",
      "content": "Write your lit review in essay-format. A lit review is not a list or unorganized summary. It's a formal essay within a larger paper, and it has an introduction, body, and conclusion like any other essay. Plan to write your review in this style to get full credit. [9] X Research source If you need help organizing your thoughts, you could always start with a bullet-point list. This is great to get started. However, you'll need to polish this into an actual essay. Generally the lit review doesn't need a different format from the rest of the paper, so don't change anything unless your professor tells you to."
    },
    {
      "title": "Place the lit review between the introduction and body of your paper.",
      "content": "Place the lit review between the introduction and body of your paper. Generally, a lit review is its own section and comes right after the main introduction for your research paper. This shows the reader where the literature currently stands, and sets up the intervention that you'll make with your research paper. Unless you're told otherwise, plan on putting the review right after your intro and before the start of your main body paragraphs. [10] X Research source Use section headings like \"Introduction\" and \"Literature Review\" to keep yourself organized. You can leave these in if your professor tells you it's okay. Some professors may give you a specific outline to base your review or paper around. Always follow their instructions so you get full credit."
    },
    {
      "title": "Structure your review chronologically if you want to show change over time.",
      "content": "Structure your review chronologically if you want to show change over time. Once you start writing your review, you have a few options for how to organize it. One of the most common choices is chronological, where you proceed in time order that the works were published. This is a great way to show how coverage of a topic changed over time. [11] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source This is helpful for works of history, sociology, and other social sciences where work changed considerably over time. Try to make some larger statements as you write chronologically. You could say, “Prior to the 1950s, scholars didn’t take employment discrimination seriously. In the 1960s and 1970s, new work emerged arguing that it was a major problem that millions of people experience.” This helps move your reader along. If you can, tie a chronological lit review to larger historical developments. For example, you could note that the Civil Rights Movement in the 1960s led scholars to analyze discrimination more closely."
    },
    {
      "title": "Break down the review by theme if the field is currently divided.",
      "content": "Break down the review by theme if the field is currently divided. In some cases, a methodological or thematic approach is better. This means that your review is broken down by theme and the authors are grouped together by the conclusions they draw. [12] X Research source A thematic approach might work better for medical or scientific topics, since there is often a lot of disagreement going on at the same time within these fields. Your topic could be different approaches to the treatment of cancer, with a section on each proposed treatment regimen. You could still work chronologically within a thematic organization. When you move on to a new theme, for example, start with the author who first introduced that concept or conclusion."
    },
    {
      "title": "Read some academic articles for ideas.",
      "content": "Read some academic articles for ideas. If you’re stuck on how to frame your question or research, the best guide is other research papers. Most academic articles start with some kind of literature review to give readers an idea of the state of the field. Try looking on your library’s database for academic articles in the field you’re working on and reading the lit review sections. This should give you ideas on how to frame your own research questions. [13] X Research source There are also systematic reviews, or article-length literature reviews that analyze all the relevant work in a topic. Journals periodically publish pieces like this. These can be great resources for more sources and ideas."
    },
    {
      "title": "Make a broad statement about where the literature stands in your intro.",
      "content": "Make a broad statement about where the literature stands in your intro. A literature review should have an introduction with a thesis statement, just like any other essay. In general, your job with a lit review is synthesizing where the field you’re studying currently stands. Use your research and source summaries to come up with a general statement about the field, which serves as your thesis. Start off your review with a few sentences explaining the field and what the main ideas are within it. [14] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Your research might show you that most writers agree that employment discrimination is a problem, but aren’t united on what the causes are. Your opening statement could be, “Scholars are in widespread agreement that African-Americans face discrimination on the job. However, they are divided on the causes. The most common explanations they give are racism among hiring managers, a lack of educational opportunity, and structural disadvantages that produce less past work experience.” Your statement doesn’t have to show agreement. It’s perfectly fine to say something like “Child psychologists are currently divided on how homework influences grade-schoolers’ development. Some see it as a crucial intellectual exercise, while others criticize it as busywork that has no real benefit.”"
    },
    {
      "title": "Organize your body paragraphs around the themes that you identified.",
      "content": "Organize your body paragraphs around the themes that you identified. After introducing the literature review, then proceed with your body paragraphs. Organize these according to the themes and categories that you identified while evaluating your sources. [15] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source This keeps your review nice and organized so your reader can follow your arguments and assessment. If you're organizing your essay chronologically, you could break down paragraphs by decade. The first paragraph could explain how authors discussed a problem in the 1960s, then your second one moves to the 1970s, and so on. This also works if you're proceeding thematically. You could have a paragraph about authors who support one conclusion and another about authors who disagree."
    },
    {
      "title": "Provide key information about each source in your review.",
      "content": "Provide key information about each source in your review. When you present each source, no matter how you organize your review, make sure you reader understands the author’s main ideas. [16] X Research source State the main argument and perspective for each source when you introduce it. Then explain some of the evidence that the author uses to support their points. Remember to show how each work fits in your main narrative as well. If it’s not clear why a work fits the theme you’ve placed it in, you might lose credit. Quotes are always good to demonstrate a point, but make sure you don’t overuse them. 1 or 2 quotes per work is plenty. Stick with your own words for the analysis."
    },
    {
      "title": "Critique the works to show what their shortcomings are.",
      "content": "Critique the works to show what their shortcomings are. No work is perfect, and you shouldn’t uncritically accept what each author states in their work. Another important part of a lit review is giving your own assessment of each work. State whether each work is convincing, and what the author might be leaving out. [17] X Research source You could say, “This author overall concludes that racism is not a major component of employment discrimination. This might be true on the job, but it ignores systemic racism, which could lead to disparate outcomes for those who experience it.” Be fair when you’re criticizing authors. They’ve probably researched the topic, and though you don’t agree with their conclusions, it’s not fair to act like they don’t know what they’re talking about."
    },
    {
      "title": "Conclude with some questions for further research.",
      "content": "Conclude with some questions for further research. Any literature review leaves some uncertainty at the end. Since you’ve researched the field, conclude by stating the shortcomings or unanswered questions that are still remaining. This shows that you’ve critically engaged with the material and drawn your own conclusions. [18] X Research source You can make suggestions no matter what the review shows. If the field is divided, you could say “We clearly need more research to solve these disagreements.” If a field is united, you could say “Perhaps some more diverse voices or perspectives could complicate this field and drive it in new directions.” If this lit review is part of a larger research paper, then conclude by stating how your research solves some of these problems."
    },
    {
      "title": "Stick with the length that your professor assigns.",
      "content": "Stick with the length that your professor assigns. There is really no set length for a lit review, and it depends on the assignment. Generally, a lit review takes up a small percentage of the overall paper, so try to keep it proportional to the work. When in doubt, ask your professor what the ideal length is. [19] X Research source For a 10-20-page paper, the lit review can be a few pages. Try not to go over 2-3 unless your professor tells you to. In an MA thesis or PhD dissertation, the lit review might make up a whole chapter of over 20 pages."
    }
  ]
}