{
  "url": "https://www.wikihow.com/String-a-Recurve-Bow",
  "title": "How to String a Recurve Bow",
  "steps": [
    {
      "title": "Purchase a bow stringer.",
      "content": "Purchase a bow stringer. This cheap tool is 100% necessary to string your recurve bow without damaging the limbs. Choose one designed for a recurve bow (not a longbow), and intended for your bow's length and draw weight. Confirm that the ends of the stringer fit snugly over your bow's limb tips. Some sources recommend the \"pocket and saddle\" design for recurve bows, but \"double pocket\" stringers are also common. [1] X Research source This guide covers both types."
    },
    {
      "title": "Place the string over the bow tips.",
      "content": "Place the string over the bow tips. Slide the string's large loop over the bow's upper limb, positioning the string on the correct side of the bow. Fit the smaller loop into the notch on the lower limb, double-checking that it fits snugly. Since the bow is in a relaxed position, the string should have plenty of slack. The lower limb is on the heavier side of the handle. The bow's draw weight is usually marked on the lower limb."
    },
    {
      "title": "Fit the stringer pocket over the lower limb tip.",
      "content": "Fit the stringer pocket over the lower limb tip. If your stringer has two pockets, the larger one fits over the lower limb. This should cover the small string loop, keeping it secure in the groove. If this doesn't feel secure, wrap a rubber band tightly around the string loop. [2] X Research source"
    },
    {
      "title": "Place the small pocket or saddle onto the upper limb.",
      "content": "Place the small pocket or saddle onto the upper limb. If your stringer has two pocket, place the small pocket over the upper limb tip. If your stringer has a saddle (a leather or rubber pad) on one end, slide this over the top limb and just behind the string loop. Position the saddle about 3 inches (8 cm) from the tip, just behind the string loop. [3] X Research source Some saddles can be secured against the bow, while others require you to hold it in place. The dimpled surface should press against the limb to reduce friction."
    },
    {
      "title": "Hold the bow horizontally.",
      "content": "Hold the bow horizontally. Hold the bow grip with your non-dominant hand. Hold it horizontally so your dominant hand is near the upper limb, holding the loose string loop in place. Position the bow so its limb tips point upward, with the bowstring and stringer underneath."
    },
    {
      "title": "Step on the bow stringer.",
      "content": "Step on the bow stringer. Bend at the waist to lower the bow until the stringer (but not the string) touches the ground. Step on it with both feet, about shoulder-width apart. [4] X Research source Use the balls of your feet, not the arches, or the cord may slip. If using a saddle bow stringer, use one hand to keep the saddle in place. You may use one foot, but planting both feet gives you extra stability. This is particularly helpful for children and shorter adults."
    },
    {
      "title": "Draw up on the bow.",
      "content": "Draw up on the bow. Take up the slack in the bow stringer and confirm you have a secure grip. Be prepared to pull upward, bending the bow limbs back toward the ground. Read the next step before you start this motion."
    },
    {
      "title": "Slide the large loop onto the notch.",
      "content": "Slide the large loop onto the notch. At the same time you pull up on the bow, slide the loose string loop up until it fits into the notch near the tip of the bow. If you have trouble with this, the stringer may be too long. Shorten it by tying knots near the bottom pouch."
    },
    {
      "title": "Confirm the string is secure.",
      "content": "Confirm the string is secure. Run your finger over the string loop to confirm it's secure in the groove. Keep your finger over the string for the rest of this process, so you can stop if the string starts to slip off. [5] X Research source"
    },
    {
      "title": "Lower the bow slowly.",
      "content": "Lower the bow slowly. Slowly lower the bow until the stringer is slack. Do not rush this step, or a loose string could slip off and slingshot the limb into your face."
    },
    {
      "title": "Check the string.",
      "content": "Check the string. Immediately turn the bow so its limbs face away from you. Double check the string loops once again. If they aren't secure, stand on the stringer again to repeat this process. Keep your head back and turn it away from the string, in case the loose string snaps off. [6] X Research source Do not point the limbs at a nearby person, or a mishap could cause an injury."
    },
    {
      "title": "Remove the bow stringer.",
      "content": "Remove the bow stringer. If you used a rubber band in an earlier step, remove this as well. For best results, adjust your bow according to the instructions below before you shoot. When you're ready to unstring the bow, attach the bow stringer the same way you did before. Step on the stringer and draw the bow up, then slide the upper string loop off the notch and down onto the limb. Slowly relax the bow."
    },
    {
      "title": "Adjust the nocking point height.",
      "content": "Adjust the nocking point height. Imagine a line running from the top of your arrow rest to your bowstring, hitting the string at a 90º angle. Position your nocking point on the string about ½\" (1.25 cm) above this line, so your arrows are perfectly horizontal when nocked. [7] X Research source"
    },
    {
      "title": "Shoot in a new string.",
      "content": "Shoot in a new string. If your bow or string are brand new, the string will stretch out a little. Expect it to adjust to its final stretch over the course of your first one or two shooting sessions. Alternatively, you can leave the bow strung overnight once to help it settle. [8] X Research source Don't spend too much time adjusting the brace height (described below) until the string had adjusted. Flemish twist strings stretch out more than endless loop strings."
    },
    {
      "title": "Test the brace height.",
      "content": "Test the brace height. The brace height is the distance between the handle of the bow and the string. Measure this distance, then shoot a few arrows to see how your bow feels. A high brace height will slow down your arrows, while a lower brace height will make a loud, jarring noise on release. [9] X Research source Ask someone to stand on the side and watch as you shoot. The noise and vibration are easier to judge from the side."
    },
    {
      "title": "Adjust brace height.",
      "content": "Adjust brace height. If you think brace height needs adjustment, unstring the bow. Twist the string a few times to flex the limbs further, increasing brace height. Untwist the string a few times to lower brace height. [10] X Research source Measure carefully and write down the number each time, along with notes about how the bow fires. You'll probably have to make several adjustments to find the perfect point, but after that you're set. Most recurve bows shoot best with a brace height between 7.5 and 9.75 inches (19–25 cm). [11] X Research source Replace the string with a smaller or larger string if you can't get it near this range, or if you have to twist more than 20 or 30 times. [12] X Research source If you're having trouble getting your arrows to fly straight, buy a T-square to measure nocking point height and brace height more accurately."
    }
  ]
}