{
  "url": "https://www.wikihow.com/Tie-a-Karate-Belt",
  "title": "How to Tie a Karate Belt",
  "steps": [
    {
      "title": "Fold the belt exactly in half to find the center.",
      "content": "Fold the belt exactly in half to find the center. Hold your belt out in front of you and match the ends together so they’re even. Run your hands along the length of your belt to smooth it out before you start. [1] X Research source White belts will often have a tag on one end of the belt. As you progress in colors, your belts won’t have a tag anymore."
    },
    {
      "title": "Place the center of the belt at your navel.",
      "content": "Place the center of the belt at your navel. Unfold the belt so that it’s in one long line again, keeping your hands on the center. Wrap the belt around your stomach, placing the center directly on your belly button. Make sure that both sides of the belt are even so you know it’s positioned correctly. [2] X Research source If you can’t tell if your belt is even, try standing in front of a mirror to double check."
    },
    {
      "title": "Wrap the two ends around your waist and back to the front.",
      "content": "Wrap the two ends around your waist and back to the front. As you bring the ends of the belt around to your back, switch hands so you’re now holding the opposite ends. Cross them over each other behind you, then bring the two ends back around to your front. [3] X Research source This part can be a little tricky, especially if you’re just starting out. Don’t give up! Make sure the ends are still even in front of you."
    },
    {
      "title": "Overlap the ends on top of each other on your stomach.",
      "content": "Overlap the ends on top of each other on your stomach. Pick one end and fold it over the center, laying it on the belt over your stomach. Do the same thing to the other end so that they’re crossed over each other directly over your belly button. [4] X Research source If there are any wrinkles in your belt, smooth them out so it’s flat."
    },
    {
      "title": "Tuck the top end underneath all the layers of the belt.",
      "content": "Tuck the top end underneath all the layers of the belt. Take the end of the belt that’s on the very top and pull it underneath all the layers of your belt. Grab the end that you just pulled underneath and pull it up towards you directly against your stomach to create a small knot. [5] X Research source Make sure this knot is tight against your waist, but not so tight that you can’t move around or breathe. If the ends of the belt are uneven, slide your belt around on your waist to fix it before you move on."
    },
    {
      "title": "Fold the bottom end underneath the top end to tie a knot.",
      "content": "Fold the bottom end underneath the top end to tie a knot. Grab the end of the belt that’s sticking out from underneath all of the layers and cross it under the top end. Pull the bottom end up through the middle of the cross you created, then pull the bottom end up to tighten the knot. Make sure the ends are hanging evenly. [6] X Research source If your belt is too tight, you can adjust it by loosening the last knot you just made. Make sure your final knot sits directly over your belly button."
    },
    {
      "title": "Place the belt on your stomach, keeping the left side longer than the right.",
      "content": "Place the belt on your stomach, keeping the left side longer than the right. Hold the belt up in front of your belly button, but only leave about 1 forearm’s length of slack on the right side. Keep the left side super long to work with later. [7] X Research source The right side won’t move much throughout the tying process, so keep a good grip on it."
    },
    {
      "title": "Wrap the left end of the belt around yourself twice.",
      "content": "Wrap the left end of the belt around yourself twice. Holding the right end in place, wrap the left side around you once, then wrap it around again. Tuck the right end of the belt underneath the left end as you wrap to hold it in place. [8] X Research source If your belt is short, you may be able to only wrap it around once. Wrapping the belt behind you instead of crossing it over creates a flatter, smoother line in the back."
    },
    {
      "title": "Slide both ends to the center of your belly button.",
      "content": "Slide both ends to the center of your belly button. Grab both ends of your belt and pull them over until they’re both centered over your naval. If the sides are uneven, slide your belt around on your waist until they’re both the same length. [9] X Research source You don’t need to undo your belt to do this, so try to just shimmy it instead of taking it off."
    },
    {
      "title": "Bring the longer end underneath all the layers of the belt.",
      "content": "Bring the longer end underneath all the layers of the belt. Grab the end of the belt that you wrapped around your body and push it up under all of the layers of the belt on your stomach. Pull it up through the layers, then pull it tight to make a loose knot. [10] X Research source"
    },
    {
      "title": "Fold the bottom end underneath the top end to tie a knot.",
      "content": "Fold the bottom end underneath the top end to tie a knot. Grab the bottom end of the belt, or the right side, and cross it underneath the top end out in front of you. Pull the bottom end up through the center of the cross, then pull the bottom end up to make a knot. Make sure the ends are hanging evenly. [11] X Research source You can loosen the knot if you need to by grabbing the center and pulling it apart."
    }
  ]
}