{
  "url": "https://www.wikihow.com/Use-Color-Replacement-in-MS-Paint",
  "title": "2 Easy Ways to Change the Color of Images in MS Paint",
  "steps": [
    {
      "title": "Open the Microsoft Paint app.",
      "content": "Open the Microsoft Paint app. Click the Start menu and type \"paint\" to quickly find it. You can also find it in your list of apps. If you don't have Paint, you can download it for free from the Microsoft Store . This works best for simple images and colors without any gradient."
    },
    {
      "title": "Open an image if necessary.",
      "content": "Open an image if necessary. While Paint's color replacement feature can't handle complex colors, you can open a simple Paint project or clip art to edit if need be: [1] X Research source Click File in the top-left corner of the Paint window. Click Open in the drop-down menu. Go to the location of the image you want to open. Click the image. Click Open . If you aren't opening an existing file, create the Paint project you want to use before proceeding."
    },
    {
      "title": "Select the eyedropper tool.",
      "content": "Select the eyedropper tool. Click the eyedropper-shaped icon in the \"Tools\" section at the top of the Paint window."
    },
    {
      "title": "Left-click the color you want to replace.",
      "content": "Left-click the color you want to replace. This will assign the color to the \"Color 1\" section at the top of the Paint window. You can zoom in to get a better view of the color by clicking + in the bottom-right corner of the window."
    },
    {
      "title": "Select the eyedropper tool again.",
      "content": "Select the eyedropper tool again. Click its icon in the \"Tools\" section to do so. Skip this step if the color you want to replace the first color with isn't on the canvas."
    },
    {
      "title": "Right-click the color you want to use to replace the first color.",
      "content": "Right-click the color you want to use to replace the first color. This will add it to the \"Color 2\" box, signifying that the \"Color 1\" box's color will be replaced with the \"Color 2\" box's color. [2] X Research source If you skipped the last step, you'll instead click the Color 2 box at the top of the page and then click the color you want to use from the palette at the top of the window."
    },
    {
      "title": "Select the eraser tool.",
      "content": "Select the eraser tool. Click the pink, eraser-shaped icon in the \"Tools\" section. If you have Generative erase enabled on the left side, click it to disable it. [3] X Research source"
    },
    {
      "title": "Hold right-click and drag across the color you want to replace.",
      "content": "Hold right-click and drag across the color you want to replace. This will cause the \"Color 2\" box's color to replace the \"Color 1\" box's color without altering any of the other colors on the canvas. Do not use the left mouse button for this step. Doing so will cause the eraser tool to erase anything you drag it across instead of just erasing the color you selected as the one to replace."
    },
    {
      "title": "Open the Microsoft Paint app.",
      "content": "Open the Microsoft Paint app. Click the Start menu and type \"paint\" to quickly find it. You can also find it in your list of apps. If you don't have Paint, you can download it for free from the Microsoft Store. This works best for simple images and colors without any gradient."
    },
    {
      "title": "Open an image if necessary.",
      "content": "Open an image if necessary. While Paint's color replacement feature can't handle complex colors, you can open a simple Paint project or clip art to edit if need be: Click File in the top-left corner of the Paint window. Click Open in the drop-down menu. Go to the location of the image you want to open. Click the image. Click Open . If you aren't opening an existing file, create the Paint project you want to use before proceeding."
    },
    {
      "title": "Select the eyedropper tool.",
      "content": "Select the eyedropper tool. Click the eyedropper-shaped icon in the \"Tools\" section at the top of the Paint window."
    },
    {
      "title": "Left-click the color you want to replace.",
      "content": "Left-click the color you want to replace. This will assign the color to the \"Color 1\" section at the top of the Paint window. You can zoom in to get a better view of the color by clicking + in the bottom-right corner of the window."
    },
    {
      "title": "Select the eyedropper tool again.",
      "content": "Select the eyedropper tool again. Click its icon in the \"Tools\" section to do so. Skip this step if the color you want to replace the first color with isn't on the canvas."
    },
    {
      "title": "Right-click the color you want to use to replace the first color.",
      "content": "Right-click the color you want to use to replace the first color. This will add it to the \"Color 2\" box, signifying that the \"Color 1\" box's color will be replaced with the \"Color 2\" box's color. If you skipped the last step, you'll instead click the Color 2 box at the top of the page and then click the color you want to use from the palette at the top of the window."
    },
    {
      "title": "Select the eraser tool.",
      "content": "Select the eraser tool. Click the pink, eraser-shaped icon in the \"Tools\" section."
    },
    {
      "title": "Hold right-click and drag across the color you want to replace.",
      "content": "Hold right-click and drag across the color you want to replace. This will cause the \"Color 2\" box's color to replace the \"Color 1\" box's color without altering any of the other colors on the canvas. Do not use the left mouse button for this step. Doing so will cause the eraser tool to erase anything you drag it across instead of just erasing the color you selected as the one to replace."
    }
  ]
}