{
  "url": "https://www.wikihow.com/Use-a-Fax-Machine",
  "title": "How to Use a Fax Machine",
  "steps": [
    {
      "title": "Position the fax machine.",
      "content": "Position the fax machine. Place the fax machine on a flat surface close to power outlets and a telephone jack. Be sure that the paper feed is facing outward. This will help prevent the incoming faxes and scanned documents from getting stuck between the wall and the machine and prevent them from getting damaged. To fax a document, get a Fax Machine. Enter the document and the phone number of the Fax you wish to send it to, and press send. Or get an online fax service like efax.com or jfax.com and enroll. Or plug your all-in-one printer into a phone line, install the software suite, and use the software included."
    },
    {
      "title": "Connect the power source.",
      "content": "Connect the power source. Plug the fax machine into the nearest wall outlet. Ensure that the connection is sound and the plug fits into the outlet properly. Once the fax machine is connected to the power source, be sure that it remains off for the remainder of the set-up."
    },
    {
      "title": "Secure the phone line.",
      "content": "Secure the phone line. A fax machine uses a telephone line to send and receive data to create and print documents. They will not work through an internet-based phone line. Be sure to have an active phone line and a phone number for the fax machine so your machine can transmit and receive signals to create the documents. [1] X Research source Call your cable and telephone provider to set-up a landline if needed."
    },
    {
      "title": "Connect the phone cable.",
      "content": "Connect the phone cable. A standard phone cable should be connected into the fax machine's phone jack, which is typically on the back of the machine. The other end of the cord should be secured directly into the nearest phone jack in the wall. Double check to see that the cord is connected to the machine and the wall's phone jack."
    },
    {
      "title": "Add paper and ink.",
      "content": "Add paper and ink. The fax will require a supply of paper and ink to create and print the incoming documents. Be sure you have these supplies on hand. Before inserting the paper, fan or flip through the paper stack to make sure they do not stick together. This will help prevent paper jams. Each machine will house a certain type, size, and number of ink cartridges. Be sure to review the machine's instructions to decide what ink best works with your machine."
    },
    {
      "title": "Check the connection.",
      "content": "Check the connection. Once your fax machine is connected and the paper and ink have been inserted, turn the machine on and check the telephone connection. The connection must be secure in order to use the fax machine. Check that the landline is properly connected by picking up the fax machine's receiver if it is available on your device. The receiver should resemble a telephone. Listen for the humming noise of a dial tone, which will indicate that the connection is secure. If the fax does not have a receiver, you can connect a phone through the external phone jack on the fax machine. You should hear the humming noise of a dial tone if the connection is sound."
    },
    {
      "title": "Turn on the machine.",
      "content": "Turn on the machine. Be sure that the machine is turned on and that the telephone cord is securely in place before sending a document. You may wish to check the receiver for a dial tone to ensure that the connection is secure."
    },
    {
      "title": "Use a cover sheet.",
      "content": "Use a cover sheet. A cover sheet is a great way to guarantee that your document gets to the correct person. This is particularly helpful when sending faxes to a business where several employees may be using the same device. A cover sheet should include the name of the recipient, their fax number and yours, your contact information, and the number of pages the recipient should expect to receive in the fax. Including the page count on the cover sheet is useful for the recipient so they will know if they received all the necessary pages."
    },
    {
      "title": "Order the documents properly.",
      "content": "Order the documents properly. Be sure to add page numbers and to put the document's pages in the order that you wish for them to be received. You do not want the recipient to puzzle the pages together. This can cause confusion and may interfere with the intended meaning behind the document. Ordering the pages and numbering them will ensure an efficient transfer of information."
    },
    {
      "title": "Insert the documents in the scanner.",
      "content": "Insert the documents in the scanner. Most fax machines will require that you place the document either face-up or face-down into the scanner portion of the fax machine. There is no standard method across all devices. Most fax machines will indicate which method to use with an easy-to-read symbol on the front of the device. [2] X Research source"
    },
    {
      "title": "Dial the recipient's fax number.",
      "content": "Dial the recipient's fax number. Using the key pad on the front of the fax, dial the recipient's fax number, including the area code. If you are faxing a document internationally, you must insert the country code. If there is a corporate number that is used for dialing externally (often “7” or “9”), be sure to hit that digit prior the area or country code and the fax number."
    },
    {
      "title": "Send the documents.",
      "content": "Send the documents. Once you have dialed the number, most fax machines will require that you hit a “send” or “start” button to transmit the document. Watch as the document is transmitting in case there is an error or a paper jam. When the document transfer has been successful, the fax with print out a progress report or confirmation page. If you receive an error message, try sending the document again."
    },
    {
      "title": "Check the connection.",
      "content": "Check the connection. Be sure the fax machine is turned on. It is also important to make sure that the fax machine is connected to a power source and the phone jack in order to receive faxes. You may wish to pick up the receiver and listen for the dial tone to ensure proper connection."
    },
    {
      "title": "Inspect the paper and ink supply.",
      "content": "Inspect the paper and ink supply. You will want to provide enough paper and ink in the fax machine. If you receive a lot of documents via fax machine, be sure to check these supplies frequently. Otherwise, this may prevent you from receiving a document in its entirety or delay its arrival."
    },
    {
      "title": "Listen for the ringtone.",
      "content": "Listen for the ringtone. The fax machine will ring or make a dial-up sound when it is receiving an incoming document. The machine is set to automatically process these documents, so you are not required to do anything at this time. Avoid pressing buttons on the machine during this time or else the connection can be disturbed or disconnected."
    },
    {
      "title": "Review the document.",
      "content": "Review the document. Once the fax machine has successfully received the document, it will print out the pages in the order that they were placed by the sender. Review the coversheet to ensure that you are the intended recipient and that all of the pages were successfully transmitted and printed."
    },
    {
      "title": "Follow-up with the sender.",
      "content": "Follow-up with the sender. If you wish to confirm that you received the fax, or if you are worried that you did not receive all the necessary information, you may wish to follow-up with the sender via phone or email. The contact information may be listed on the coversheet, so refer to this page if you don't have the sender's information handy."
    }
  ]
}