{
  "url": "https://www.wikihow.com/Walk-in-High-Heels",
  "title": "The Best Way to Confidently Walk in Heels",
  "steps": [
    {
      "title": "Take small steps.",
      "content": "Take small steps. The design of heels forces your stride to be shorter than usual. Keep yourself upright by taking smaller steps to combat this. How much smaller you step depends on how tall your heels and legs are, so experiment at home before you wear your heels in public. [1] X Research source Avoid compensating by bending your knees. Instead, move your legs like you would when you’re not walking in heels. Generally speaking, the taller the heel, the shorter the stride is."
    },
    {
      "title": "Walk from heel to toe.",
      "content": "Walk from heel to toe. If you’re new to heels, you may naturally want to walk toe to heel—resist that temptation! Place your heel down first, then roll to your toe in one fluid motion. Once your weight is on the balls of your feet, shift forward like you’re walking on your toes and take the next step. [2] X Research source Walking from your toe to your heel is less stable, looks unnatural, and could cause injury."
    },
    {
      "title": "Walk slowly.",
      "content": "Walk slowly. Moving quickly in heels can look awkward and increase your chances of tumbling over. Instead, slow down a little. Make each small step deliberate and as natural as possible. It may feel like you’re walking unusually slowly, but you’ll look confident and relaxed to an onlooker! Try not to stiffen up if you feel off balance during your slow stride."
    },
    {
      "title": "Maintain good posture",
      "content": "Maintain good posture . Keep your head up and your shoulders back as you walk in heels. Stand up straight and tighten your core to take some pressure off your feet. [3] X Research source This will help you keep your balance, especially since heels tend to make you lean forward. Simply imagine there’s a piece of invisible string holding your head upright—if you slouch, the string snaps. Pull your shoulders back and keep your arms relaxed at your sides, swinging them slightly as you walk. If you don’t have good posture, your lower back arches to compensate for your heels, resulting in lower back pain."
    },
    {
      "title": "Spread your toes inside your shoe with each step.",
      "content": "Spread your toes inside your shoe with each step. When you roll fluidly from your heel to your toes, spread your toes slightly inside your shoe. This will give you more grip and evenly distribute your weight, helping you maintain your balance as your weight shifts."
    },
    {
      "title": "Imagine yourself walking in a straight line.",
      "content": "Imagine yourself walking in a straight line. Choose a point straight ahead to focus on, and avoid looking down at your feet. Then, pretend you’re walking along an invisible line or tightrope, placing one foot directly in front of the other as you walk. [4] X Research source Look up how models walk on the catwalk online, and try mirroring their posture and walking pattern as you practice."
    },
    {
      "title": "Practice standing in heels to make walking easier.",
      "content": "Practice standing in heels to make walking easier. Not only do you need to learn how to walk in heels, but you should also be aware of how to stand in heels. Stand with one heel resting next to the arch of your other foot at a slight angle. Place all of your weight on the foot that’s straight. When that foot gets tired, shift your weight onto the front foot. [5] X Research source"
    },
    {
      "title": "Break in new heels",
      "content": "Break in new heels at home before wearing them in public. Even if your heels are a perfect fit for you, stiff materials like leather need to be broken in first. Try wearing your heels around the house for short spurts at a time—an hour here, an hour there. Doing this also lets you practice walking in your new heels before venturing out. [6] X Expert Source Katie Quinn Image Consultant Expert Interview. 14 April 2020. Practice pivoting, stopping, and climbing stairs in your heels. Think of how you might need to walk outside the house, then try those scenarios in the comfort of your living room. Expose your heels to different surfaces, practicing on hardwood, cobble, carpet, and even your driveway. Try to avoid buying a new pair of heels and wearing them to the office right away, as this can lead to sore feet and blisters."
    },
    {
      "title": "Invest in cushion inserts or rub relief strips.",
      "content": "Invest in cushion inserts or rub relief strips . As you break in your new heels, note where the shoes rub or hurt your feet. Consider buying cushion inserts or insoles to counteract pain in the ball of your foot. Try rubbing relief strips if the shoes are rubbing your skin raw on your heels or under your ankles. These provide extra padding between your foot and the shoe, helping relieve any discomfort. [7] X Research source Insoles and strips can also help a bigger shoe fit a smaller foot. [8] X Expert Source Kathi Burns, CPO® Board Certified Professional Organizer Expert Interview. 31 December 2019."
    },
    {
      "title": "Opt for a thicker heel over pencil-point stilettos on most days.",
      "content": "Opt for a thicker heel over pencil-point stilettos on most days. Stilettos are notoriously painful, but they don’t have to be! The key is not wearing them every single day. For most days, opt for a chunkier heel that provides better support and balance. [9] X Expert Source Susan Kim Professional Stylist Expert Interview. 30 April 2019 The thicker heels are, the less likely they’ll cause painful ankle wobbling. [10] X Research source Additionally, consider wearing a platform heel with an ankle strap, as the extra strap can help support weaker ankles."
    },
    {
      "title": "Choose heels with thicker soles.",
      "content": "Choose heels with thicker soles. Shoes with thin, flimsy soles can cause the bottom of your feet to hurt pretty quickly. There’s just not enough cushion between your foot and the hard ground. Opt for heels with thicker soles, like platform heels, to keep the bottoms of your feet protected. [11] X Expert Source Susan Kim Professional Stylist Expert Interview. 30 April 2019."
    },
    {
      "title": "Give your feet a break.",
      "content": "Give your feet a break. When wearing high heels, the best advice to prevent pain is to sit down whenever possible. Take a seat, keep your back straight, and cross your legs. This will give your feet a break and stop any pain or discomfort from building. Avoid taking your heels off when you rest. Feet naturally swell in heels, and taking the shoes off may make them harder to put back on."
    },
    {
      "title": "Try not to wear high heels too often.",
      "content": "Try not to wear high heels too often. Although high heels look absolutely fabulous, wearing them too much often causes blisters, bunions, and back pain. [12] X Research source Avoid this by giving your feet the rest they need. Wear high heels every other day and choose a sensible flat instead. If wearing high heels every day is mandatory for your job, try switching up the height of your heels. This prevents too much pressure or friction from concentrating on one particular spot."
    },
    {
      "title": "Shop for heels at midday to get the perfect fit.",
      "content": "Shop for heels at midday to get the perfect fit. Your feet swell in the afternoon. Because of this, shopping during lunch hours may cause you to buy a larger size heel than you need. In the morning, your feet haven’t started to swell yet, so shopping then may cause you to buy heels that are too small. At midday, your feet are between those 2 states, making it the perfect time to shop for heels."
    },
    {
      "title": "Get the right size by having your feet measured annually.",
      "content": "Get the right size by having your feet measured annually. Your shoe size fluctuates over time, especially after major life changes like weight loss or giving birth. Make it a practice to get your feet sized professionally by a shop clerk every year. The best time to have it done is when you’re already out shoe shopping. Make sure the shop clerk measures your foot's length and width. [13] X Research source Once your foot is measured, you’ll know which heels will fit; however, this isn’t a magical fix! Never buy a heel without trying it on first. If the shoe isn’t comfortable in the store, it probably won’t be at home. [14] X Expert Source Katie Quinn Image Consultant Expert Interview. 14 April 2020."
    },
    {
      "title": "Start with a small heel and work your way up.",
      "content": "Start with a small heel and work your way up. It's probably not a good idea to choose a pair of 4 inch (10.2 cm) stilettos if you're not used to walking in heels—it's better to work your way up, increasing the height as you get used to them. There are many types of heels to choose from, varying in height, thickness, and shape. Training your feet by starting with small heels will allow your ankles to develop the strength they need to walk safely and gracefully in high heels. [15] X Expert Source Kathi Burns, CPO® Board Certified Professional Organizer Expert Interview. 31 December 2019. Begin with a shoe that has a low heel of about 2–3 inches (5.1–7.6 cm). Try to wear wider heels (rather than skinny spikes or stilettos), as these will provide more balance. Closed-in shoes are easier to walk in than strappy sandals, as they provide more support around the ankle and heel. High-heeled wedges are the easiest high shoes to walk in, as the heel is fully attached to the shoe's sole, giving you increased balance and comfort."
    },
    {
      "title": "Invest in a quality pair of heels.",
      "content": "Invest in a quality pair of heels. Quality heels offer better support, stability, padding, and comfort than a cheap pair. While the expense may not seem feasible in the short term, your feet will thank you long term. Well-made shoes also mold to your feet better over time, allowing you to walk more comfortably. High-quality materials last longer, too. While you may cringe at the higher price tag, quality heels are a better investment all-around."
    }
  ]
}