{
  "url": "https://www.wikihow.com/Stop-Talking-to-Yourself-in-Your-Head",
  "title": "How to Stop Talking to Yourself in Your Head",
  "steps": [
    {
      "title": "Talk out loud to work through your thoughts and get over them.",
      "content": "Talk out loud to work through your thoughts and get over them. Often, your internal dialogue is a natural response to a question, problem, or decision you’re facing. Instead of fighting the self-talk, just talk out loud to yourself. It may feel silly, but the self-talk will go away and you’ll have an easier time resolving whatever you’re dealing with. [1] X Research source This process applies to that small narrator in the back of your head that shows up when you’re thinking through a problem or get bored. If you are actually hearing a voice that isn’t there, talk to a doctor to see if there’s something else going on."
    },
    {
      "title": "Try paying attention to your self-talk for a few seconds instead of ignoring it.",
      "content": "Try paying attention to your self-talk for a few seconds instead of ignoring it. Everyone talks in their head occasionally. You do this to process what you’re experiencing, weigh decisions, or as a defense mechanism when you’re nervous. Ignoring this self-talk probably won't make it go away, but acknowledging it for a few seconds may actually help it stop. Close your eyes and follow the self-talk for 5-10 seconds. Then, go back to what you were doing to see if it goes away. [3] X Research source Listening to your self-talk makes you aware that you’re doing it. In addition, it makes you think through what you’re actually saying to yourself, which makes you process what you’re thinking and may make the self-talk stop."
    },
    {
      "title": "Make some meaningless sounds to interrupt your self-talk.",
      "content": "Make some meaningless sounds to interrupt your self-talk. Making a few random noises for 20-30 seconds will often get your self-talk to calm down. Try making the sound of a clock tick-tocking, a motor revving up, or a plane taking off. Interrupting your internal dialogue with noises that don’t mean anything will break your train of thought and get you out of your head. [4] X Research source This sounds kind of goofy, but that’s kind of the point. Internal narration and private thoughts are often complex and elaborate. Simple silly sounds have the ability to break your thought process and reorient your headspace."
    },
    {
      "title": "Run through your senses and say what you’re experiencing out loud.",
      "content": "Run through your senses and say what you’re experiencing out loud. One way to override your brain and refocus is to perform a sensory loop. To do this, assess everything you’re sensing right now and either recite it out loud or in your head. Say, “I am seeing…” and describe what you see. Then say, “I am smelling…” and describe what you smell. Repeat this process with what you feel, hear, and taste. [5] X Research source Figuring out how to describe what you’re experiencing will force you to be present and keep that self-talk from getting out of hand."
    },
    {
      "title": "Try doing some meditation or yoga to declutter your thoughts.",
      "content": "Try doing some meditation or yoga to declutter your thoughts. Meditation and yoga can help you be more mindful and quiet out-of-control thoughts in your head. Try doing 15-30 minutes of meditation or yoga whenever your self-talk is bothering you. [6] X Research source Set aside time to do meditation or yoga every day if this is a persistent problem for you."
    },
    {
      "title": "Strike up a conversation with someone to get you out of your head.",
      "content": "Strike up a conversation with someone to get you out of your head. Talking to someone else can help you feel more engaged with the present. Try chatting with a friend, coworker, family member if you need to distract yourself from your thoughts. Actively listen to what they're saying so your attention doesn't drift back to your self-talk. [7] X Research source"
    },
    {
      "title": "Do something you enjoy to calm down negative self-talk.",
      "content": "Do something you enjoy to calm down negative self-talk. Play a game, complete some crossword puzzles, or go for a walk. Doing something you enjoy can help distract your mind and keep you focused on positive, happy things. Try to set aside time every day to work on a hobby or project you enjoy. [8] X Research source Many people naturally use self-talk to critique themselves as a way of coping with anxiety or self-doubt. This is perfectly natural, but doing too much of this can make it hard to make decisions or relax. Doing something you enjoy puts you in a positive headspace which pushes out any negative self-talk you’re experiencing."
    },
    {
      "title": "Replace negative self-talk with positive thoughts.",
      "content": "Replace negative self-talk with positive thoughts. If your self-talk is making you anxious, nervous, or indecisive, try replacing some of the negative thoughts with more positive ones. [9] X Expert Source Julia Lyubchenko, MS, MA Adult Counselor & Certified Hypnotherapist Expert Interview. 29 April 2020. Being more aware of the negative things you say to yourself and then replacing those things with positive, or at least neutral, statements can help relieve anxiety and boost your confidence. Whenever you catch yourself talking to yourself negatively, stop and try rephrasing your thoughts. [10] X Research source For example, if you catch yourself thinking, \"I'm a total failure,\" stop and reframe that thought into something more positive, like, \"I'm actually not a total failure. I do fail sometimes, but I've also succeeded at things too. Failure happens sometimes, but I should keep trying.\""
    },
    {
      "title": "Talk to a doctor or therapist if your self-talk interferes with your daily life.",
      "content": "Talk to a doctor or therapist if your self-talk interferes with your daily life. If your self-talk is keeping you from going about your daily business or being happy, it’s best to talk to a doctor or therapist about this. [11] X Expert Source Julia Lyubchenko, MS, MA Adult Counselor & Certified Hypnotherapist Expert Interview. 29 April 2020. Negative self-talk is a common symptom of several mental health issues, but these problems are treatable. Talk to your therapist or doctor about what you’re experiencing to get the treatment you need. [12] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source If your self-talk makes it hard to complete regular tasks or perform at school or work, you may be dealing with an anxiety disorder. If your self-talk is highly critical or hopeless, you may be experiencing depression."
    },
    {
      "title": "Go to therapy to improve your overall mental health.",
      "content": "Go to therapy to improve your overall mental health. Your doctor or therapist may suggest talk therapy. By talking to a professional, you’ll work through the issues you’re experiencing and find healthy ways of coping with the symptoms you’re experiencing. [13] X Expert Source Julia Lyubchenko, MS, MA Adult Counselor & Certified Hypnotherapist Expert Interview. 29 April 2020. Ask your doctor for a referral or contact a therapist in your area to make an appointment. Keep a regular schedule and see your therapist regularly to improve over time. [14] X Research source Talk therapy is the most popular option, but your doctor may suggest art therapy or group therapy. In art therapy, you work through your thoughts and emotions by making art and talking about it with a therapist. In group therapy, you share with and listen to other people with similar issues."
    },
    {
      "title": "Talk to your family and be open about what you’re going through.",
      "content": "Talk to your family and be open about what you’re going through. Going through a mental health issue alone can be scary, but it doesn’t need to be. Talk to your parents, partner, siblings, and close friends if you’re comfortable with it. The people that care about you will support you and it’ll be much easier to grow if you’re open about what you’re experiencing. [15] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source"
    },
    {
      "title": "Explore medication as an option if therapy isn’t enough.",
      "content": "Explore medication as an option if therapy isn’t enough. Talk to your doctor or therapist about medication. Unless you’ve been diagnosed with schizophrenia, medicine is typically a last resort. However, it may help you get back to feeling like yourself. Work with your doctor or therapist to assess your options and find what works best for you. [16] X Trustworthy Source Mental Health Foundation UK charity working towards good mental health for all. Go to source"
    },
    {
      "title": "See a doctor as soon as you can if you’re hearing voices that aren’t there.",
      "content": "See a doctor as soon as you can if you’re hearing voices that aren’t there. If you’re hearing voices that are indistinguishable from the voices of real people or the voice in your head has a distinct personality, you may be dealing with a more serious mental health issue. Your doctor will be able to help you figure out what's going on and causing you to hear these voices. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source The treatment for this will depend on what you're diagnosed with, but it may include medication."
    }
  ]
}