{
  "url": "https://www.wikihow.com/Wear-Compression-Socks",
  "title": "How to Wear Compression Socks",
  "steps": [
    {
      "title": "Ask your doctor which compression level is right for you.",
      "content": "Ask your doctor which compression level is right for you. Compression socks come in 4 main compression levels. Each level is measured in millimeters of mercury, or mmHg. Socks rated at a higher mmHg will have a higher compression level. [1] X Expert Source Vlad Gendelman, MD Board Certified Physician Expert Interview. 17 July 2020. Mild compression socks are rated 8-15 mmHg. For moderate compression, try a sock rated 15-20 mmHg. Firm compression socks have a rating of 20-30 mmHg. For extra firm compression, opt for a sock with a rating of 30-40 mmHg."
    },
    {
      "title": "Measure your ankle.",
      "content": "Measure your ankle. The first measurement you will need to take is the circumference of your ankle. Take a tape measure and place it around the narrowest part of your ankle. The tape measure should be positioned just above your anklebone. Record the measurement."
    },
    {
      "title": "Measure the widest part of your calf.",
      "content": "Measure the widest part of your calf. The second measurement you will need is the circumference of your calf. Take a tape measure and place it around the widest part of your calf. Take note of the measurement."
    },
    {
      "title": "Measure the length of your calf.",
      "content": "Measure the length of your calf. The final measurement you will take is the length of your calf, from the bend in your knee to the bottom of your heel. Sit on a chair and position your leg in a 90-degree angle. Measure the distance from the bend of your knee to the floor. Record the measurement."
    },
    {
      "title": "Measure the widest part of your thigh and leg length.",
      "content": "Measure the widest part of your thigh and leg length. If your doctor prescribed thigh high compression socks, you will need to measure the widest part of your thigh. You will also need to measure your leg length by measuring the distance between the floor and the bottom of your buttocks."
    },
    {
      "title": "Compare your measurements to the manufacturer’s sizing chart.",
      "content": "Compare your measurements to the manufacturer’s sizing chart. Once you have completed all three measurements, you can use them to decide what size compression sock is right for you. Compare the measurements to the sizing chart listed on the manufacturer’s website or on the compression sock package. Size up if you are between sizes."
    },
    {
      "title": "Measure again if you lose or gain weight.",
      "content": "Measure again if you lose or gain weight. A change in body weight may signal it’s time for a different size of compression sock. If you lose or gain weight, make sure you measure yourself again and purchase new socks if necessary. [2] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source"
    },
    {
      "title": "Turn the upper half of the sock inside out.",
      "content": "Turn the upper half of the sock inside out. Reach into the compression sock with one hand and grab the toe of the sock. Then use your hands to turn the upper half of the compression sock inside out. [3] X Research source"
    },
    {
      "title": "Place your foot in the sock.",
      "content": "Place your foot in the sock. Once you have the compression sock turned inside out, gently place your foot in the toe of the sock. Then slide the stocking up over your heel. Make sure the top of the stocking remains inside out. [4] X Research source"
    },
    {
      "title": "Slide the sock up your leg.",
      "content": "Slide the sock up your leg. Once your heel is securely inside the sock, gently slide the sock up your leg. Do this as slowly and gently as possible to prevent tearing holes in the stocking or stretching it out. [5] X Research source"
    },
    {
      "title": "Do not pull on the top of the sock.",
      "content": "Do not pull on the top of the sock. Pulling on the top of a compression sock may cause the sock to rip. Never attempt to put on compression socks by pulling them on by the top of the sock. This can also cause unwanted stretching of the fabric."
    },
    {
      "title": "Use gloves to help you.",
      "content": "Use gloves to help you. If you have trouble sliding the compression sock up or down your leg, try wearing a pair of rubber gloves. The gloves can help create some resistance, which will make putting compression socks on or taking them off a bit easier. [6] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source"
    },
    {
      "title": "Take the sock off by folding it down.",
      "content": "Take the sock off by folding it down. When it’s time to take off your compression sock, fold it down gently until it reaches the top of the ankle. Then insert your finger or thumb inside the back of the stocking on your heel. Use your finger or thumb to pop the stocking off your heel and then slide the rest of the stocking off your foot. [7] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source"
    },
    {
      "title": "Put the socks on when you wake up each morning.",
      "content": "Put the socks on when you wake up each morning. Your legs are less swollen when you wake up, which means the compression socks will be easier to put on. Try putting the socks on as soon as you wake, even before you get out of bed. [8] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source"
    },
    {
      "title": "Wear the socks all day long.",
      "content": "Wear the socks all day long. To get the most from your compression socks, you will want to wear them for the entire day. Wearing the compression socks all day long will help improve circulation, keeping blood flowing steadily while you are awake. [9] X Research source"
    },
    {
      "title": "Remove the socks before bed.",
      "content": "Remove the socks before bed. Unless your doctor has instructed you otherwise, you should take the compression socks off before you go to bed each night. Do not sleep in compression socks unless your doctor instructs you to do so. You should also remove compression socks before bathing. [10] X Trustworthy Source University of Wisconsin Health Integrated healthcare system of the University of Wisconsin focused on treating and providing support to patients and public health initiatives Go to source"
    },
    {
      "title": "Hand wash new socks before you wear them.",
      "content": "Hand wash new socks before you wear them. When you buy a new pair of compression socks, make sure you hand wash the socks before putting them on. This will make the fabric more flexible, which means the socks will be easier to put on. Try hand washing them in cool water with a mild laundry detergent. [11] X Research source"
    },
    {
      "title": "Replace compression socks every 3-6 months.",
      "content": "Replace compression socks every 3-6 months. Since you will be wearing compression socks most of the time, they will wear out over several months. To make sure your compression socks are still doing their job, replace them every 3-6 months with a new pair. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Replace socks that are stretched out or have holes in them, regardless of how old they are."
    },
    {
      "title": "Wash compression socks regularly.",
      "content": "Wash compression socks regularly. If possible you should wash compression socks after each use. Hand wash the socks in cool water and use a mild laundry detergent. Allow them to air dry."
    }
  ]
}