{
  "url": "https://www.wikihow.com/Use-Aluminum-Foil",
  "title": "How to Use Aluminum Foil Properly: Tips & Safety Guide",
  "steps": [
    {
      "title": "Cook with aluminum foil.",
      "content": "Cook with aluminum foil. If you're cooking with a grill or an oven, you can wrap meat, vegetables, and other dishes in aluminum foil to retain moisture and flavor. The added bonus of cooking with aluminum foil is that you can simply throw away the foil afterward – no pots or pans to scrub. Grill fish or vegetables. Add seasonings to raw fish or vegetables, and then wrap securely. Place on the hot grill. When the dish is done cooking: open the foil, put the fish or vegetables on a platter, and throw away the foil. The convenience of this method is that there is nothing else to clean up. Roast a turkey . Place the raw turkey on a baking pan, and tent it with aluminum foil. This will retain the juices in the turkey while baking, so as to cook completely through without burning. Remove the tent for the last hour of roasting, so that the turkey skin gets browned and crisp. Line a baking pan with heavy-duty aluminum foil. Then, add the meat and/or veggies, along with the sauce of your choosing. Secure the foil so that it is tightly folded over the stew. Put in the oven and cook. When dinner is ready, remove the roast, and then toss away the foil without having any pots to wash or scrub."
    },
    {
      "title": "Do not use aluminum foil in a microwave.",
      "content": "Do not use aluminum foil in a microwave. Aluminum deflects the electromagnetic waves that cook food so efficiently in a microwave oven. This might cause your food to cook unevenly, and it might even damage the appliance. Remember: metal and microwaves do not mix! [1] X Research source"
    },
    {
      "title": "Keep food warm or cold.",
      "content": "Keep food warm or cold. Aluminum foil is a great insulator, meaning that it is great for keeping hot foods hot and cold foods cold. Use it to wrap leftovers or pack your lunch. Individually wrap each food item into a sheet of heavy-duty aluminum foil. Bend the foil into a \"tent\" shape, and fold the ends down tightly to trap heat. If you wrap your meal well, it should hold the same temperature for hours."
    },
    {
      "title": "Preserve food with aluminum foil.",
      "content": "Preserve food with aluminum foil. Aluminum foil has the lowest moisture-vapor transfer rate of almost any wrapping material. This means that it is extraordinarily good at keeping food from drying out. Foil is also great for retaining the odor of smelly foods. [2] X Research source Wrap leftovers in an airtight seal of aluminum foil, then store in the freezer or refrigerator until you are ready to eat again. If you don't have access to a freezer or refrigerator, you can still use aluminum foil to keep food fresh. Store the wrapped-up food items in a cool, dark, dry place. Aluminum foil is even better than plastic wrap at retaining odor and moisture. Just make sure that you carefully seal each item so that it's as airtight as possible! This will make the food less prone to freezer burn."
    },
    {
      "title": "Soften brown sugar.",
      "content": "Soften brown sugar. Wrap a clump of hardened brown sugar in aluminum foil. Then, bake it in a 300-degree oven for five to 10 minutes to melt down the clumps. [3] X Research source"
    },
    {
      "title": "Remove static in the dryer.",
      "content": "Remove static in the dryer. Crush aluminum foil into homemade \"dryer balls\" in order to reduce static cling when you tumble-dry your clothes. Compress the foil into two or three balls, each about two inches in diameter. Make sure that each ball is tight and smoothly-pressed so that it won't snag on the garments in the dryer. This can be a cheap and chemical-free alternative to commercial dryer sheets. [4] X Research source You can continue to use the same dryer balls for months. When the balls start to come apart, replace them with freshly-crumpled foil. Be aware that the aluminum dryer ball will not soften your clothing like a commercial dryer sheet. Furthermore, it might make your dryer a bit noisier. Consider whether these downsides are worth the cost-effectiveness."
    },
    {
      "title": "Line your ironing board with aluminum foil.",
      "content": "Line your ironing board with aluminum foil. A standard ironing board is designed to absorb heat and moisture. Aluminum foil will trap heat and moisture around your clothing, which should speed up the ironing process. Be aware of the risks of trapping high heat and moisture: if you aren't careful, you will greatly increase the chance of burning yourself. [5] X Research source Use this method to steam garments that aren't iron-safe. Lay the clothing on the aluminum foil, and hold the iron 1-2 inches above the fabric. Continually press the \"steam\" button to quickly steam out the wrinkles."
    },
    {
      "title": "Polish tarnished metal.",
      "content": "Polish tarnished metal. First, line the inside of a bowl with aluminum foil. Then, fill the foil with warm water; one tablespoon of salt; one tablespoon of baking soda; and one teaspoon of dish soap. Soak your tarnished metal items: jewelry, silverware, coins, etc. Let the mixture do its work for ten minutes. Then, remove the metal items and dry them off. [6] X Research source"
    },
    {
      "title": "Sharpen scissors.",
      "content": "Sharpen scissors. Fold a piece of aluminum foil until it is five or six layers thick. Then, cut it repeatedly with a pair of dulled scissors. This should gently sharpen the blades and increase the lifespan of the tool. [7] X Research source"
    },
    {
      "title": "Slide heavy furniture on foil pads.",
      "content": "Slide heavy furniture on foil pads. Before you move a piece of furniture, cut up pieces of aluminum foil. Slide the foil pieces beneath the legs with the dull side down. These foil patches should help the furniture slide smoothly across the floor."
    },
    {
      "title": "Clean pots and pans.",
      "content": "Clean pots and pans. Use crumpled-up aluminum foil like you would use steel wool. Scrub hard with the foil ball, and it should pick up most caked-on and burnt material. It may not be as effective as an actual cleaning product, but it will suffice in a pinch. Use foil to clean any metal: grills, bicycle parts, etc. [8] X Research source"
    },
    {
      "title": "Entertain cats.",
      "content": "Entertain cats. Pull out a piece of foil, and crush it into a ball with your hands. Toss it to your cat, and watch them enjoy themselves tossing it and holding it in their teeth. This can save you from spending money on rubber balls. The method is also great for kittens, as you can make the foil balls as large or small as you want. Place a piece of aluminum foil on couch cushions to keep your animals off. Once they land on the seat and hear the crackling noise on the surface, they may learn to keep off it."
    },
    {
      "title": "Use aluminum foil for crafts.",
      "content": "Use aluminum foil for crafts. Foil can be a shiny, decorative material, and it can also serve as an easy-to-clean workspace for messy craft materials. Get creative and imagine all of the ways that you can use aluminum foil! Wrap gifts with decorative foil. Foil products may come in various colors and patterns. This can be a cheap and creative way to wrap things! Use foil for crafts instead of paper. Cut it into shapes and letters. It's easy to fold, and it can add a shiny flair to your projects! Paint on foil instead of paper or canvas to create an interesting piece of art, or use crumpled foil as a painting tool and create interesting textures on another surface. Mix paint on aluminum foil. When you paint, line a metal roller pan with aluminum foil before pouring in the paint. This way, the cleanup is a breeze: just throw out the foil!"
    },
    {
      "title": "Make a fire.",
      "content": "Make a fire. You can use aluminum foil, cotton, and a AA battery to start a fire within minutes. [9] X Research source Cut out an aluminum foil, about a four inches long and half an inch wide. Cut away the foil in the center of the strip to make a thin, two millimeter-wide slit, roughly 3/4 inches long. Wrap the thin connector in the middle with cotton. Then, attach each end of the foil strip to opposite ends of the AA battery. The cotton should quickly catch on fire. [10] X Research source Add more kindling once the cotton sparks. Build the fire and tend it as it grows. Always practice fire safety!"
    }
  ]
}