{
  "url": "https://www.wikihow.com/Stop-Loving-Your-Ex",
  "title": "How to Stop Loving Your Ex",
  "steps": [
    {
      "title": "End all communication with this person--at least for now.",
      "content": "End all communication with this person--at least for now. Some couples are lucky enough to be able to stay friends after a breakup. But if you're still in love with your ex, then you are absolutely not ready for a friendship; at least not yet. Though not communicating with or seeing this person may seem impossible, it will be even more painful for you to try to fake a friendship when what you really want is to get back together. [1] X Expert Source Julia Yacoob, PhD Clinical Psychologist Expert Interview. 11 August 2021. [2] X Research source Fight the temptation to try to win this person back by continuing to talk and spend time together. If your ex doesn't love you anymore, then nothing you do or say will make him or her love you again. The best thing you can do for yourself is to keep your ex out of sight and out of mind. If you go to the same school, live in the same town, or share the same core group of friends as your ex, it may be difficult to avoid running into him or her on occasion. If you do, be polite and say hello, but try to keep your conversations brief and light-hearted. Block, unfollow, or mute your ex on social media so you won’t be constantly reminded of their existence and tempted to reach out. Reader Poll: We asked 691 wikiHow readers about how they use social media after a breakup, and 50% of them said that they block their ex and make their profile private . [Take Poll]"
    },
    {
      "title": "Don't ignore your feelings.",
      "content": "Don't ignore your feelings. It's great that you've decided it's time to get over your ex, but the worst thing you can do for yourself, especially in the early stages of a breakup, is to ignore whatever feelings you're experiencing. It's perfectly normal, and acceptable, to feel angry, scared, confused, hurt, jealous, or insecure after losing the person you love. But instead of trying to suppress these emotions, acknowledge the fact that they're there and that feeling down is a natural part of life. Acknowledging your emotions can help you sort through them more clearly and more quickly than if you keep them bottled up. [3] X Research source If you feel like you need to cry, then cry. If you need to scream, then scream. Do whatever it takes to let your emotions out, even if you feel like you're being overly dramatic or emotional. Keeping your feelings locked up will only cause them to come back and haunt you in the future."
    },
    {
      "title": "Try not to obsess over his or her positive qualities.",
      "content": "Try not to obsess over his or her positive qualities. When we love people, we tend to idealize them and only focus on their positive qualities. When we reminisce about them, we only remember the good memories and the positive feelings they elicited. There's nothing wrong with remembering your ex fondly, but if you want to stop being in love with him or her, you'll need to dig deep into your memory and try to identify aspects of his or her personality, or of the relationship, that bothered you. Obviously you broke up for a reason, meaning that there was something missing in the relationship. Even if you can't think of one negative quality in this person, the simple fact that you are broken up should be enough. No matter how great this person may be, the fact that they don't want to be with you anymore means that you are not right for each other."
    },
    {
      "title": "Find an emotional outlet.",
      "content": "Find an emotional outlet. Whether it is talking to a close friend or relative, writing in a journal, or expressing yourself through art, find a healthy outlet to express how you feel. Talking to a friend who has gone through a similarly difficult breakup may help put things in perspective and remind you that you are not alone. [4] X Research source Having the freedom to vent to your friends is great, but know your limits. Talking about a breakup only helps up to a certain point; after awhile, it will only fuel your obsession and cause you to overanalyze the situation (not to mention the fact that your friends will probably start to get annoyed)."
    },
    {
      "title": "Stop looking for answers.",
      "content": "Stop looking for answers. Lots of people waste hours upon hours trying to figure out what went wrong in the relationship--they often blame themselves for pushing the other person away, leading to feelings of inadequacy and rejection. Sometimes, though, there is no answer for why you broke up other than the fact that you and your ex simply weren't right for each other."
    },
    {
      "title": "Don't have sex with your ex.",
      "content": "Don't have sex with your ex. A night of passionate sex with your ex will only make falling out of love with him or her more difficult. Resist the temptation (however strong it may be) to sleep together, keeping in mind that no matter how great it may be, you will feel infinitely worse about the breakup afterwards. [5] X Research source"
    },
    {
      "title": "Make some small, positive changes in your life.",
      "content": "Make some small, positive changes in your life. Trying to get over somebody feels in some ways counterintuitive, because the more you try not to think about them, the harder it seems to get them off of your mind. Improving the circumstances in your life, on however small of a scale, can do wonders for healing your wounds after a breakup and for getting your mind off of the person that broke your heart. [6] X Research source Now that you are single, it's time to focus on yourself and think about the aspects of your life that you would like to improve. Are you happy with your career or your performance in school? Are you happy with your body? What about your living situation? The goal is to improve your lifestyle so that it is better now than it was when you were in a relationship. Though it may seem difficult, it is possible. You will have to do some soul searching to figure out where to focus your efforts, though. You don't have to make large, life-altering changes. Even small efforts like redecorating your room can help boost your mood in the long run."
    },
    {
      "title": "Try to appreciate the perks of being single.",
      "content": "Try to appreciate the perks of being single. Everybody wants to find somebody to love and who loves them. Have faith that eventually, you'll find somebody who makes you happy, but until then, appreciate the freedom and excitement that comes with single life. [7] X Research source Spend time doing the things that you enjoy doing that perhaps your ex didn't enjoy doing. Make plans to go out with friends and remember to approach every situation with a positive attitude; be open to meeting new people, visiting new places, and creating new memories."
    },
    {
      "title": "Give yourself plenty of time.",
      "content": "Give yourself plenty of time. Despite your best efforts, it's going to take some time to get over being in love with your ex. Remember that there is nothing wrong with that, and that sometimes, the best medicine is to just let a little bit of time pass. [8] X Research source No matter how horrible you may feel right now, seek comfort in the fact that it will only continue to get easier from this point on. Eventually you'll start to feel normal again, and if you just make the effort, be happier than you ever could have imagined."
    }
  ]
}