{
  "url": "https://www.wikihow.com/Tell-Someone-They-Are-Wrong",
  "title": "How to Tell Someone They Are Wrong",
  "steps": [
    {
      "title": "Weigh the pros and cons.",
      "content": "Weigh the pros and cons. Ask yourself what you have to gain by pointing out that they are wrong. If it is not much, consider not saying anything at all and saving your confrontational effort for battles that actually matter. [1] X Research source For example, if you and your significant other alternate on who does the dishes and they say they did them last but you know they are wrong, it may not be worth an argument over such a small thing. However, if it is a repeated habit of theirs to not remember such that you are regularly contributing more than they are, then it is more worth bringing up. Other situations that likely aren't worth it include their being wrong about something very trivial, such as if they said something happened about four days ago when you know that it happened two days ago exactly. If it will not change the future course of the conversation in a meaningful way it is often best to let things like that go. If it is a particularly emotional issue and you find yourself having trouble thinking straight about the pros and cons in your head, make a list with a pen and paper."
    },
    {
      "title": "Figure out the right time.",
      "content": "Figure out the right time. No one likes to lose face in front of a crowd; if you are going to tell them they are wrong, pull them aside and do it privately. This means that sometimes you will have to wait for a more opportune time; it may not always be the best decision to confront them right on the spot. If you bring up issue later once the conversation is private, be sure to frame it in a neutral way to get the conversation off to a good start. For example, rather than saying something along the lines of \"hey, remember that thing you were wrong about earlier? I need to talk to you about that\" or \"remember that silly thing you said earlier? What is with that?\" try to use more neutral language such as \"hey remember that thing we were disagreeing on earlier? Can we chat about that for a minute?\""
    },
    {
      "title": "Keep calm.",
      "content": "Keep calm. Even if you have a lot to gain or even if it will feel great to tell them they are wrong, be sure to tell them with a level head. You do not want to put them on the defensive or get them upset, unless that is actually your goal, it will most likely undermine your real goal, which is to get them to see your viewpoint on the matter. [2] X Expert Source Maya Diamond, MA Master's in Somatic Psychology & Relationship Coach Expert Interview. 17 January 2019."
    },
    {
      "title": "Be prepared.",
      "content": "Be prepared. Before you speak up about them being wrong, make sure that you have carefully considered the issue and know in fact that you are right. Think about what they might say in response to you to defend themselves, and come up with a list of responses to their counterpoints so that you can be more likely to convince them that they are wrong, should they refuse to believe you."
    },
    {
      "title": "Stay open-minded.",
      "content": "Stay open-minded. Think about how sure you feel that you are right, and know that there is a good chance that they feels similarly strong about their position. Remember that although you think that you are right and that they are wrong, there is a chance that you are actually the one who is wrong. [3] X Research source As you decide whether to speak up, keep in mind that there is a chance that you are mistaken and prepare yourself to listen carefully to their counter arguments."
    },
    {
      "title": "Take their perspective.",
      "content": "Take their perspective. Think about why they think they’re right. In doing so, you will be more confident that they are in fact wrong, realize that they are right, or get a better sense of the specific issues to pinpoint when explaining to them why they’re wrong."
    },
    {
      "title": "Know who you’re talking to.",
      "content": "Know who you’re talking to. The reality is there isn’t going to be a one-size-fits-all answer for the best way to tell someone they are wrong because people have different personalities that may make some approaches better than others in some cases. Sometimes the best approach will be to be friendly but other people’s ego’s may rebut any friendly attempt you make. Sometimes being assertive and not backing down and driving the point home will be what it will take to convince them they’re wrong. For example, if they’re stubborn, being passive and friendly you likely won't get through to them. In cases like this, you will may need to be more assertive and forceful. On the other hand, if they’re sensitive to criticism, being assertive and forceful may be particularly off-putting for them."
    },
    {
      "title": "Point to behavior, not character.",
      "content": "Point to behavior, not character. Do not make them being wrong about their intelligence or other aspect of their character. This will be more likely to put them on the defensive; if you isolate their specific action or thought (whatever they’re wrong about) from their character, they will more easily see the err of their ways as their identity and self-esteem is not so wrapped up in the exchange. [4] X Research source For example, rather than saying something that makes a character judgment like \"you've definitely not been paying attention or there is something wrong with your memory because I did the dishes last\" say something that focuses more precisely on the specific wrongness, like \"I believe you're actually wrong about who did the dishes last time.\""
    },
    {
      "title": "Show how to be right.",
      "content": "Show how to be right. People will be more inclined to believe you that they are wrong if you offer an alternative that is right. If you just point out that they are wrong but do not follow up beyond that, without any alternative, they will be more likely to stick to their guns. [5] X Research source Speak with authority but also remain modest in your conversation. Again, the main idea here is that you do not want them to get on the defensive. [6] X Research source"
    },
    {
      "title": "Ease them into it.",
      "content": "Ease them into it. Do not be aggressive, let them know softly by saying something like “I think you may be mistaken here” rather than “you are absolutely dead wrong on that”; the former is more abrasive and will more likely lead to an automatic aggressive response by them, such as refusing to take your position seriously. [7] X Research source"
    },
    {
      "title": "Don't get worked up.",
      "content": "Don't get worked up. The angrier or more exasperated you seem, the more power they will have. Stay calm and if they just won't accept the facts, consider walking away. It's often not worth a fight to prove someone wrong. Be comfortable knowing that you are right and that in some cases it doesn't matter what anyone else thinks. [8] X Research source"
    },
    {
      "title": "Try the sandwich technique.",
      "content": "Try the sandwich technique. Try sandwiching their being wrong between two positive qualities about them, or weaving in other things they were right about. With this technique, they may not feel too negatively about your correcting their being wrong. Take an example where your roommate is wrong about their belief that he did the dishes last, and it is a frequent enough occurrence that you decide to bring it up. You might say something along the lines of \"When you do the dishes they always come out nice and clean but I think you're wrong that you did them last. I remember doing them yesterday while you were playing that sweet song on the guitar. Do you remember that?\" Be sure to drive home the point that the real reason for the conversation is to let them know that he was wrong about something. Do not spend too much of the conversation on what he did well, otherwise he may focus too much on that or not get the take home message you intend to leave them with; this will undermine the use of the sandwich technique. [9] X Trustworthy Source Harvard Business Review Online and print journal covering topics related to business management practices Go to source However, avoid being condescending, too. It is a fine line to walk; you will be less likely to be perceived as being condescending if the 'bread' layers of your sandwich are genuine."
    }
  ]
}