{
  "url": "https://www.wikihow.com/Soak-Oats",
  "title": "How to Use Soaked Oats to Make Delicious, Nutritious Oatmeal",
  "steps": [
    {
      "title": "Find whole oats for a healthy option.",
      "content": "Find whole oats for a healthy option. Cut oats often lose fatty acids and other nutrients while being stored. Pick whole oats if you are most interested in your oatmeal's health benefits. The fresh taste of whole oats can complement overnight oatmeal well. [1] X Research source Whole oats must be rolled at home so don't choose this option unless you own an oat grinder."
    },
    {
      "title": "Buy rolled oats for preservation.",
      "content": "Buy rolled oats for preservation. Rolled oats preserve the taste and nutrients in the oats. Before being stored, rolled oats are steamed and flattened into flakes. When soaked overnight, they absorb flavors easily. [2] X Research source Rolled oats are easily found at most grocery stores, unlike whole oats."
    },
    {
      "title": "Pick steel cut oats for heartier oatmeal.",
      "content": "Pick steel cut oats for heartier oatmeal. Steel cut oats are chopped up into small pieces before being stored. During the packaging process, they are neither steamed nor rolled. Their flavor is heartier and creamier than rolled or whole oats because they remain firm after absorbing water. [3] X Research source"
    },
    {
      "title": "Avoid purchasing quick or instant oats.",
      "content": "Avoid purchasing quick or instant oats. Although you can make soaked oats from quick or instant brands, they are most likely to taste mushy. Neither has nutritional value thanks to their cheap processing and added preservatives. They are the cheapest but also the least ideal option for overnight oatmeal."
    },
    {
      "title": "Combine oats, water, and lemon juice in a bowl.",
      "content": "Combine oats, water, and lemon juice in a bowl. The ratio between oats and water should be one to one. If you add one cup (8 oz) of oatmeal to your bowl, for example, you should match it with one cup (8 oz) of water. Add enough lemon juice to taste: in most cases, one tablespoon (0.5 oz) will suffice. [4] X Research source Although fresh lemon juice tastes best, bottled lemon juice can work as a substitute."
    },
    {
      "title": "Add apple juice or apple cider vinegar for a sweeter taste (optional).",
      "content": "Add apple juice or apple cider vinegar for a sweeter taste (optional). Add in the sweeter liquid one teaspoon at a time until you reach your desired sweetness. Do not add enough liquid to submerge the oats. [5] X Research source Add a minimal amount of vinegar to your oatmeal, as too much can make it taste tart. Because the oats will absorb the liquid, less is more."
    },
    {
      "title": "Mix in chia seeds for texture.",
      "content": "Mix in chia seeds for texture. Most toppings will not be added until the oats have soaked overnight. Chia seeds, however, absorb liquid well and stay firm after soaking. For a thicker texture, pour in chia seeds one tablespoon (0.5 oz) at a time. [6] X Research source Check out more overnight oat recipes from wikiHow users on the “Best overnight oats recipe ideas” forum ."
    },
    {
      "title": "Stir the mixture until the oats are slightly damp.",
      "content": "Stir the mixture until the oats are slightly damp. The oats should not be wet or submerged in water but damp. If you accidentally add too much water, slowly add oats until your mixture reaches a thicker texture. Stir in a little water at a time if your oats appear too dry."
    },
    {
      "title": "Cover the oats and soak them in the fridge for 12 hours.",
      "content": "Cover the oats and soak them in the fridge for 12 hours. Place a plastic wrap over your bowl of oats and place it in the fridge. Allow your oats to soak for at least twelve hours before serving. The longer your oats can soak, the more flavor they will absorb. Avoid keeping prepared oatmeal in the fridge for any longer than 5-7 days. Freezing is not recommended. [7] X Research source"
    },
    {
      "title": "Place the soaked oats in a saucepan.",
      "content": "Place the soaked oats in a saucepan. Your oats are ready to cook immediately after they are finished soaking. Add 1/3 cup (2.67 oz) of milk to the saucepan to give your oats a creamier taste. Begin at a low stove setting and gradually increase to a medium setting as your oatmeal simmers. [8] X Research source If your oatmeal begins to boil, your oatmeal is too hot. Turn the stove down to a lower setting."
    },
    {
      "title": "Stir the oatmeal as it thickens in the pot.",
      "content": "Stir the oatmeal as it thickens in the pot. Cook your oats in the saucepan for at least four to six minutes. The oatmeal will continue thickening as long as you continue heating it. Taste the oatmeal as you cook so you know when you reach your ideal texture. [9] X Research source"
    },
    {
      "title": "Add toppings to your oatmeal.",
      "content": "Add toppings to your oatmeal. Turn off the heat and place your oatmeal in bowls for serving. Fruit, jam, nut butter, yogurt, cinnamon, maple syrup, and nuts can all make tasty toppings. Lay out a topping bar for you and anyone else eating the oatmeal so they can add whatever toppings they like."
    },
    {
      "title": "Sweeten your oatmeal with sugar.",
      "content": "Sweeten your oatmeal with sugar. Soaked oats require more seasoning than other oatmeal to taste sweet. Use brown or raw sugar to sweeten your oatmeal, as it has a richer flavor than granulated sugar. [10] X Research source Finish seasoning the oatmeal with a pinch of salt."
    }
  ]
}