{
  "url": "https://www.wikihow.com/Stop-Being-in-Love-With-a-Person-You%27ll-Never-Meet",
  "title": "How to Stop Being in Love With a Person You'll Never Meet",
  "steps": [
    {
      "title": "Keep busy.",
      "content": "Keep busy. [1] X Expert Source Julia Yacoob, PhD Clinical Psychologist Expert Interview. 15 July 2021. Stay occupied during your spare time so that you don’t give yourself a lot of time to think about them. Take up new hobbies, pick up old ones, ask friends out for coffee or dinner, join a club, take a class, or volunteer. Fill your days and nights so that you’re enjoying life and aren’t spending much time thinking of them. [2] X Research source You will notice that thinking of them is regressive – you will think of them less and less over time."
    },
    {
      "title": "Change your routine.",
      "content": "Change your routine. You might have a routine of texting them every morning, or talking on the phone every night, and come to expect that is what you’ll do every day. Change your routine so that you don’t expect to talk, text, or video chat with them at certain times throughout the day. [3] X Expert Source Julia Yacoob, PhD Clinical Psychologist Expert Interview. 15 July 2021. If you normally talk in the morning, try exercising instead. Or if you always text at lunch, plan to read a book instead. [4] X Research source Your routine won’t change effortlessly, and that is okay. Stick with it and before you know it, what was work will be your new routine. If they try to continue with routines that involve you, such as phone calls or texts, you can explain that you no longer wish to speak with them on the phone, for example, or you may take a more thorough approach and block them on social media. [5] X Expert Source Julia Yacoob, PhD Clinical Psychologist Expert Interview. 15 July 2021. If you choose to block them, block their phone number so that they may not call or text you also."
    },
    {
      "title": "Focus on why it would not work out.",
      "content": "Focus on why it would not work out. It may help you to look at all of the reasons why a relationship with this person is not realistic. Try making a list of all of the reasons why it would not work out. You might include: Distance, such as living in different states, countries, or even different continents. Differences in lifestyle, personality, or interests. For example, maybe the person you are in love with is an outgoing sports enthusiast who loves to attend parties and other social events. If you are more of an introvert who likes to watch movies and hang out at home with just a few people at a time, then your lifestyles, personalities, and interests might not mesh well. Different relationship goals, such as wanting marriage while the other person may not be interested in a monogamous relationship at all."
    },
    {
      "title": "Say goodbye.",
      "content": "Say goodbye. You don’t have to actually say goodbye to them, but you do need to say goodbye to the relationship. Reconcile with yourself that you need to stop being in love with them, and that it’s time to let go. This can be a painful process, but it’s necessary because it signals that you’ve made a decision to stop being in love and move on. [6] X Research source You can say goodbye, you can write it in a letter, or a poem, or simply process it internally by thinking about it. If you share a friend or hobby group, you may decide that you want to maintain a friendship with them. If that’s the case, explain to them that you’re ending the romantic part of your relationship but look forward to a mature and healthy friendship. If you think it would be better to cut all ties, it’s up to you whether you want to explain that you want no further contact with them."
    },
    {
      "title": "Get rid of reminders.",
      "content": "Get rid of reminders. [7] X Expert Source Julia Yacoob, PhD Clinical Psychologist Expert Interview. 15 July 2021. While you’ll never meet, you might have exchanged letters, trinkets, gifts, or other items. You need to get rid of these reminders so that you can begin the process of healing and falling out of love. Box the items up and throw them away or ask someone else to discard them for you. This should happen at the same time that you say goodbye to allow yourself a clean slate. [8] X Research source"
    },
    {
      "title": "Plan how to start the conversation or letter.",
      "content": "Plan how to start the conversation or letter. Before you contact the person to tell him or her that you want to end the relationship, take some time to plan out what to say. Try writing out what you want or need to say ahead of time. There are several different ways that you can start this conversation. Some potential opening lines that you might use include: \"I need to talk to you about something important...\" \"Do you have time to talk about something important? I want to discuss…\" \"I don't know the best way to start, but...\" \"I'm heartbroken about this, but...\""
    },
    {
      "title": "Send an email.",
      "content": "Send an email. This is probably the least personal way to end the relationship, but it does allow you to write your thoughts out carefully and choose your words intentionally. Ending the relationship via email also gives you an opportunity to speak without interruption or rebuttal. This method also gives the recipient time to reflect on what you’ve written before they respond. Don’t write extensively about what went wrong. Instead, simply say that you need to end the relationship and what it is you expect going forward, be it no communication, limited communication, or a thriving friendship."
    },
    {
      "title": "Send a direct message.",
      "content": "Send a direct message. Ending a relationship over chat is a bit more complicated because you need to make sure that you and the other person are both able to chat at the same time without interruptions. You’ll still tell the other person that you are ending the relationship and what you expect going forward. The difference is that chat or direct message facilitates a conversation, which will allow the other person an opportunity to respond to what you’re saying. If you think that they won’t take your ending the relationship well, you might consider writing an email instead of allowing them to respond to you in a direct message."
    },
    {
      "title": "Speak on the phone or video chat.",
      "content": "Speak on the phone or video chat. You may decide that you want to speak to the other person, either on the phone, or over video chat, so that you can have the closest conversation possible without being face-to-face. On the phone or in video chat you’ll still need to focus on your decision to end the relationship and your expectations. Don’t be accusatory or rude because that’s unproductive and will just provoke anger or hurt in them. If you are nervous that they will try to talk you out of ending the relationship, opt to send an email instead of the more personal routes of conversation."
    },
    {
      "title": "Get closure.",
      "content": "Get closure. When ending a relationship, especially with someone who you love, obtaining closure can be an important step in the healing process. Closure lets you both know that you appreciate your experiences together, but that that it’s time for both of you to move forward without one another. Communicate with the person that you love and tell them not only how you’re feeling, but that you need to restrict or cut off communication, and that you wish them the best. [9] X Research source Sometimes it’s not possible to have a conversation that brings you satisfying closure. That’s okay. That lack is a closure in and of itself. Move forward and focus on healing yourself."
    },
    {
      "title": "Decide what sort of relationship you’re looking for.",
      "content": "Decide what sort of relationship you’re looking for. Make a list of what you’re looking for in a relationship, such as companionship, partnership, someone to share life events with, someone to talk with, and so on. This will help you figure out if you’re looking for an online or face-to-face relationship. You may discover that you actually want physical companionship as well, which will help you stop being in love with the person you’ll never meet. [10] X Research source"
    },
    {
      "title": "Consider your self-esteem.",
      "content": "Consider your self-esteem. If you have fallen into a habit of thinking that no one will be attracted to you or that no one in your town or city is available, an Internet relationship can be an easy substitute for dealing with personal issues. Instead of focusing your energies on a relationship, spend that time and energy working on yourself and your self-esteem. Take two minutes every day to quietly think about that which you appreciate about yourself, such as your sense of humor, your eyes, your intellect, or even your shopping savvy. Make an effort to be kinder to others. You will have a better opinion of yourself the kinder you are to others. [11] X Research source"
    },
    {
      "title": "Learn from your experiences.",
      "content": "Learn from your experiences. Even though this relationship hasn’t met your needs, it was still a good learning experience. Whether you've learned that you can be loved, that your personality is relationship-worthy, or that long-distance relationships are just plain hard sometimes, the important thing is to not let the whole situation be a wasted experience. [12] X Research source Consider what was good about your relationship. Was it educational? Or did it help you mature emotionally? Was it nice to have a confidant? Thinking about the positive aspects will help you figure out what you want in future relationships. [13] X Research source Similarly, consider what needs you had that weren’t met in the relationship. Was it difficult to coordinate schedules? Or did you have different life goals? Lastly, consider what did and did not make you happy in your relationship. Thinking about these aspects of your relationship will help you identify your needs and what you want in future relationships."
    },
    {
      "title": "Reallocate your resources.",
      "content": "Reallocate your resources. Being in love with a person who you’ll never meet is a good learning experience and has the potential to meet many of your emotional needs. However, it also uses up so many of your emotional, financial, and time resources. Choose to reallocate those resources to dating locally. Because you’ll be able to meet people locally, your resources will be much better invested. [14] X Research source Go on a local dating website Or look at a national website, but select your geographic area Or look to local hobby groups Ask a friend to set you up with someone Join a local recreational sports league"
    },
    {
      "title": "Accept that you feel may conflicted.",
      "content": "Accept that you feel may conflicted. You may feel an internal conflict when you decide to end your relationship to pursue dating locally. Choosing to date locally can be intimidating, especially if you’re in love with someone who you’ll never meet. You have an emotional and intellectual connection with that person, but seek a physical connection as well. Recognize that you feel conflicted, accept that it’s okay, and give yourself permission to seek happiness in a local relationship. [15] X Research source It’s good and healthy to admit that you’ll never meet this person for whom you have feelings. Maintaining even the slightest hope that you’ll meet them may only intensify your inner conflict."
    },
    {
      "title": "Break the cycle.",
      "content": "Break the cycle. Ending a love relationship can be painful, and it’s not something that you want to feel again intentionally. Refrain from starting another relationship with someone else that you won’t meet. If necessary, stop using the Internet for a while to prevent opportunities for falling into a similarly difficult relationship. [16] X Research source Find new games to play, new message boards with which to interact, and new groups to join. You learned from previous experience that it was important to meet the person who you love, so you want to avoid starting a similar relationship with someone in these new groups or communities."
    }
  ]
}