{
  "url": "https://www.wikihow.com/Start-a-Formal-Email",
  "title": "How to Start a Formal Email: Everything You Need to Know",
  "steps": [
    {
      "title": "Decide how formal you need to be.",
      "content": "Decide how formal you need to be. Even if you are writing a \"formal\" email, how formal that email is depends on the person who's receiving it. For instance, you wouldn't use the same level of formality when writing a professor that you would when applying for a job. When you're first contacting someone, it's better to be more formal than you need to be, just to be on the safe side. Keep in mind that, although email is a casual form of communication, if you're writing one in a business situation, it still should follow the format of a formal written letter."
    },
    {
      "title": "Find the person's name.",
      "content": "Find the person's name. Do some research to dig up the person's name if you don't already know it. Knowing the person's name makes the greeting seem more personable, even while you are employing formal techniques for your email. [1] X Research source"
    },
    {
      "title": "Follow the person's lead.",
      "content": "Follow the person's lead. If the person has emailed you already, it's fine to copy their greeting style. For example, if they use \"Hi\" and your first name, it's acceptable to reply in the same style, by using \"Hi\" and the person's first name when you address the email."
    },
    {
      "title": "Fall back on \"Dear.\"",
      "content": "Fall back on \"Dear.\" \"Dear\" (followed by the person's name) is an old standby for a reason. It's formal without being stuffy, and because it's used so often, it often becomes invisible in a greeting, which is a good thing. You don't want your greeting to stick out because it's inappropriate."
    },
    {
      "title": "Try \"Greetings,\" when you don't know the person's name.",
      "content": "Try \"Greetings,\" when you don't know the person's name. Greetings is a relatively formal greeting that you can use in business emails, particularly if you don't know the person's name. However, it's always better to find out the person's name if possible. [2] X Research source You can also use \"To Whom It May Concern\" if the email is especially formal and you don't know the person's name. However, this greeting can be off-putting to some people."
    },
    {
      "title": "Consider \"Hi\" or \"Hello\" in slightly less formal emails.",
      "content": "Consider \"Hi\" or \"Hello\" in slightly less formal emails. Emails tend to be less formal than letters in general, so you can get away with something like \"Hi\" in a somewhat formal email. For example, if you're emailing your professor, particularly one you actually interact with, \"Hi\" or \"Hello\" should work just fine. [3] X Research source"
    },
    {
      "title": "Skip \"Hey.\"",
      "content": "Skip \"Hey.\" While \"Hi\" may be acceptable in a semi-formal email, \"Hey\" is probably not. It's a very informal greeting, even in speech, so you should avoid it in any type of formal email. Even if you know your boss fairly well, for instance, it's probably best to skip \"Hey\" when emailing them. [4] X Research source"
    },
    {
      "title": "Use a title in place of a name when necessary.",
      "content": "Use a title in place of a name when necessary. Sometimes, when you're writing to a person, you only know their title within the company or organization. In that case, you can just the person's title in place of the person's name, such as \"Dear Hiring Manager,\" \"Dear Hiring Committee,\" or \"Dear Professor.\""
    },
    {
      "title": "Add the person's honorific to make it more formal.",
      "content": "Add the person's honorific to make it more formal. When possible, add \"Mr.,\" \"Mrs.,\" \"Dr.,\" or \"Professor\" before the person's name to make it more formal. Also, use the person's last name or full name to be more formal, rather than just the person's first name."
    },
    {
      "title": "Place the greeting on the first line.",
      "content": "Place the greeting on the first line. The top line should be the greeting you've chosen, followed by the person's name. Use a title for the person when possible, such as Mr., Mrs., or Dr., followed by their first and last name. [5] X Research source"
    },
    {
      "title": "Use a comma.",
      "content": "Use a comma. Generally, you'll use a comma after the greeting. In formal letters, you can use a colon, but that is usually too formal for an email, even a formal one. A comma will suffice in most instances, though you might use a colon if you are writing a cover letter in an email."
    },
    {
      "title": "Move to the next line.",
      "content": "Move to the next line. The greeting goes on its own line at the top, so once you've written it, hit the return key to move to the next line. If you're using line breaks instead of indentions to make paragraphs, you'll need to leave a blank line between the greeting and the first paragraph. [6] X Research source"
    },
    {
      "title": "Introduce yourself in the opening sentence, if necessary.",
      "content": "Introduce yourself in the opening sentence, if necessary. If you are writing someone for the first time, you should provide an introduction, even if you know the person in real life. Giving the person a clue to who you are encourages them to keep reading. For example, you could write, \"My name is Jessica Hills, and I am the marketing director for XYZ Company.\" You could also include how you know the person: \"My name is Robert Smith, and I'm in your marketing class (Marketing 101 that meets Tuesdays and Thursdays at noon).\" If you already know the person and have written them before, you can use the first sentence as a greeting. For instance, you could say, \"Thank you for getting back to me so quickly,\" or \"I hope you are doing well.\""
    },
    {
      "title": "Get to the point.",
      "content": "Get to the point. Most formal emails need to get to the point quickly. That means that your first or second sentence should introduce the reason why you're writing to the recipient. Remember to be as concise as possible when describing your purpose. For example, you could write, \"I'm writing to ask for your assistance with a marketing problem,\" or \"I'm writing to you because I'm having trouble in class, and I was hoping you'd have suggestions for extra material I could read to help.\""
    }
  ]
}