{
  "url": "https://www.wikihow.com/Update-Emoji-on-an-iPhone",
  "title": "How to Update Emoji on an iPhone",
  "steps": [
    {
      "title": "Plug your iPhone into a charger.",
      "content": "Plug your iPhone into a charger. When installing system updates, it's best to ensure that your iPhone will keep a full charge for an uninterrupted download. [1] X Research source"
    },
    {
      "title": "Connect to a wireless network.",
      "content": "Connect to a wireless network. You'll want to be connected to a wireless network before installing any system updates. Since system updates can be large, avoid installing on limited data plans. If you do so mistakenly, you can always check your data usage ."
    },
    {
      "title": "Open your iPhone's Settings.",
      "content": "Open your iPhone's Settings. This will be indicated by the icon of a cog in a grey box. [2] X Research source"
    },
    {
      "title": "Scroll down and tap General.",
      "content": "Scroll down and tap General . [3] X Research source"
    },
    {
      "title": "Tap Software Update.",
      "content": "Tap Software Update . This wil be located at the very top of the page. [4] X Research source You will see a 1 in a red circle if there is an update available."
    },
    {
      "title": "Tap Download and Install.",
      "content": "Tap Download and Install . This will begin installing the update. [5] X Research source If there is no update available, you'll see the message: Your software is up to date . If your software is up to date but you still can't see new emojis, your iPhone model may have stopped receiving new software updates. Older iOS devices will not receive newer system updates. They will only support the emojis released during their current update."
    },
    {
      "title": "Wait for your update to download and install.",
      "content": "Wait for your update to download and install. Depending on your connection speed and size of the update, this process can take up to an hour. Your iPhone will reboot during the installation process. The Apple logo will display as it's being installed."
    },
    {
      "title": "Unlock your phone.",
      "content": "Unlock your phone. Once your system is updated, your iPhone will be ready to use. If you need to return to an old update for any reason, you can revert to a previous iOS version ."
    },
    {
      "title": "Open an app that uses your keyboard.",
      "content": "Open an app that uses your keyboard. You can check your new emoji characters by opening your keyboard."
    },
    {
      "title": "Tap the emoji button.",
      "content": "Tap the emoji button. You'll see this on the bottom left of the keyboard. It will look like a smiley face. If you have multiple keyboards installed, you may need to press and hold the Globe button to select \"Emoji.\" If you're not seeing the emoji keyboard, you may need to enable it. Tap Settings → General → Keyboard → Keyboards → Add New Keyboard → Emoji ."
    },
    {
      "title": "Find your new characters.",
      "content": "Find your new characters. It may not be immediately apparent which characters are new, as they are not highlighted anywhere. You'll find the new characters mixed in with the old ones in their respective categories. You can now use new emojis to send heart symbols or reactions to friends."
    }
  ]
}