{
  "url": "https://www.wikihow.com/Warm-Autumn-Color-Palette",
  "title": "A Complete Guide to the Warm Autumn Color Palette",
  "steps": [
    {
      "title": "The Warm Autumn color palette features muted, deep, and warm shades.",
      "content": "The Warm Autumn color palette features muted, deep, and warm shades. Colors that look muted or dusty—like moss green—flatter a True Autumn, matching the mild contrast of your features. [1] X Research source Rich, warm, and deep colors like burgundy or chocolate complement the warm, golden undertones of your skin, eyes, and hair. [2] X Research source Example colors for a Warm or True Autumn are below. Rich or muted reds, such as brick red or maroon Autumnal oranges and yellows, such as copper or mustard yellow Neutral or rich browns, such as beige or sable Deep or muted greens, such as olive or deep forest green Golden yellows, such as butter or dark corn Earthy and neutral hues, such as mocha or smoky gray Deep or dusty purples, such as plum or dusty lilac"
    },
    {
      "title": "Avoid bright or neon colors and blue undertones.",
      "content": "Avoid bright or neon colors and blue undertones. Icy colors are better suited for Winters—if you’re a Warm Autumn, blue undertones and bright or pastel colors can wash out your features by clashing with your natural golden undertones. True or Warm Autumns also have low to medium contrast between their features, so neon colors may wear you (instead of the other way around). [3] X Research source Your color season is just a guideline. At the end of the day, wear whatever colors make you feel happy and confident."
    },
    {
      "title": "For your office wardrobe, opt for neutrals like gray and beige.",
      "content": "For your office wardrobe, opt for neutrals like gray and beige. Warm Autumns are washed out by the usual business neutrals, black and navy. Swap these high-contrast neutrals for richer and softer shades that will complement your soft features: warm gray, rich brown, and muted plum or dark forest green. For lighter neutrals, find professional attire in beige, taupe, khaki, and off-white creams. [4] X Research source Accent neutral outfits with accessories or layers in more eye-catching colors like olive, blue-gray, or dusty rose. [5] X Research source Rich fabrics like suede and wool match the depth of the Warm Autumn palette. More casual materials include snakeskin and corduroy. [6] X Research source"
    },
    {
      "title": "Mix shades in the same color family to create a tonal outfit.",
      "content": "Mix shades in the same color family to create a tonal outfit. As a Warm Autumn, you have soft to medium contrast between your features. Match this subtle contrast with a tonal outfit that has depth, but isn’t so contrasting that it overpowers you. [7] X Research source Choose your favorite hue from the Warm Autumn color palette and look for clothing and accessories in slightly different shades of that color. Wear them together for a fashionable tonal look. To avoid creating a monotonous outfit, mix textures and materials. Add further contrast with different-colored accessories. [8] X Research source A good texture for True Autumns is leather—especially in the fall. Consider adopting a brown leather jacket as a staple when the temperatures drop. [9] X Research source"
    },
    {
      "title": "Wear analogous colors together, not complementary ones.",
      "content": "Wear analogous colors together, not complementary ones. When assembling an outfit, pair colors that are analogous, or next to one another on the color wheel. Complementary colors, which are opposites on the color wheel, are too high-contrast for Warm Autumns. [10] X Research source Examples of analogous colors include green, yellow-green, and yellow, or red, red-orange, and orange. When you’re building your wardrobe and looking for analogous colors, pick muted, warm shades over bright or cool ones."
    },
    {
      "title": "For dressy occasions, look for gold and emerald dresses.",
      "content": "For dressy occasions, look for gold and emerald dresses. Certain metallics can wash you out, but a gold dress gives Warm Autumns a natural glow. Emerald green is another option when choosing evening wear . It’s particularly flattering in a diffuse fabric like brushed velvet. In spring and summer, consider off-white creams or dusty rose and olive dresses."
    },
    {
      "title": "Choose hair colors that are warm, rich, and deep.",
      "content": "Choose hair colors that are warm, rich, and deep. If you’re thinking of dyeing your hair, consider shades like chestnut, honey brown, or deep chocolate brown. More of a redhead? Opt for classic auburn or the trendy cowboy copper hue. For blonds, a golden blonde is your best option to match the warmth and golden undertones of your skin and eyes. [11] X Research source"
    },
    {
      "title": "Stick to neutral, matte makeup that enhances your natural glow.",
      "content": "Stick to neutral, matte makeup that enhances your natural glow. True Autumns have warm features and golden undertones. Enhance these with matte or satin-finish foundation and concealer that has yellow or pink undertones, depending on your skin color. Use a yellow-based bronzer to contour and highlight your soft features. For eye, cheek, and lip shades, look for muted and matte colors from the Warm Autumn palette. [12] X Research source Because Warm Autumn is washed out by black, pick mascara and eyeliner in shades of dark brown or dark gray. For a pop of color, opt for teal, maroon, or forest green. Example lipstick and blush colors that suit a Warm Autumn include summer fig and porcelain rose. When you want a more dramatic look, go for a deep berry color on the lip or a golden metallic eyeshadow."
    },
    {
      "title": "Select gold and bronze metals and warm or raw stones.",
      "content": "Select gold and bronze metals and warm or raw stones. As a True Autumn, you look best when flattered by accents that bring out your warm undertones. Look for gold necklaces, earrings, and rings that convey the same richness and warmth as your palette. When it comes to stones, warm pieces like amber and agate recall the honeyed hues of autumn. Raw stones like quartz may also suit you, as they have less shine. [13] X Research source Choose yellow or rose gold over white gold or platinum, which may be too bright for your complexion. Other metal options include bronze and copper."
    },
    {
      "title": "Warm hue",
      "content": "Warm hue As the name implies, the Warm Autumn color palette is overwhelmingly warm. Most of the colors in the palette fall near the warm end of the hue scale, not the cool end—meaning they have more yellow than blue undertones. Thus, there are few blue colors in the Warm Autumn palette. [14] X Research source Unlike in art, where hue refers to a pure pigment, in Seasonal Color Analysis, hue refers to the temperature of a color—whether it’s warm or cool—as determined by whether it has more yellow or blue undertones. [15] X Research source Colors with neither warm nor cool undertones are neutral and fall in the middle of the hue scale."
    },
    {
      "title": "Slightly darker value",
      "content": "Slightly darker value The Warm Autumn color palette is close to the middle of the value scale, meaning the colors on the palette range from light to dark. Examples include the colors camel and chocolate. However, the palette does lean toward the darker side of the scale, as there are more dark colors than light. [16] X Research source Value is determined by the ratio of lightness (tints) to darkness (shades) in a color—in other words, whether it’s closer to white or black. [17] X Research source Autumn color palettes tend to be darker with more shades, while Spring color palettes typically have more tints, making them brighter overall."
    },
    {
      "title": "Medium-low chroma",
      "content": "Medium-low chroma On the chroma scale, the Warm Autumn color palette leans toward medium-low. This means it has more muted/soft colors than bright/saturated/clear ones. [18] X Research source Chroma can be used to determine if you’re a Warm (True) Autumn by deciding if saturated colors flatter your or if muted colors suit you better. When a color is muted, it has gray added to it."
    },
    {
      "title": "Warm Autumns tend to have deep brown, auburn, or warm blonde hair.",
      "content": "Warm Autumns tend to have deep brown, auburn, or warm blonde hair. If you have brown hair, it’s probably golden brown and either medium or dark in tone. [19] X Research source If you have red hair, it’s likely a warm auburn or rich red tone. [20] X Research source If you’re a dark blonde, you could be an Autumn if your hair has warm, golden undertones—though the other hair colors are more common. [21] X Research source"
    },
    {
      "title": "True Autumns have skin with warm undertones.",
      "content": "True Autumns have skin with warm undertones. The actual skin color of a Warm or True Autumn could range from fair with yellow undertones to medium or dark brown with golden undertones. Your undertones are more important than your skin color for determining your season. [22] X Research source Makeup artist Yuka Arora says to look at the color of your veins on the inside of your wrist—if they appear green, you probably have warm undertones. Another way to determine your undertones is to hold swatches of fabric against your skin. Autumnal colors like soft orange or olive green should make your skin seem to glow. [23] X Research source"
    },
    {
      "title": "Warm Autumns likely have warm-toned eye colors.",
      "content": "Warm Autumns likely have warm-toned eye colors. Most Warm Autumns have hazel, brown, or green eyes, though there are exceptions to every season. [24] X Research source You’re likely a Warm or True Autumn if you have hazel, golden brown, olive green, or medium to dark brown eyes. You may also be a Warm Autumn if you have warm blue eyes. [25] X Research source Another sign you’re a True Autumn is if there’s low to medium contrast between your features. Look at a photo of your face with a black-and-white filter. You should see mostly shades of gray, not swatches of black juxtaposed with white. If you’re having trouble determining if you’re a Warm Autumn, consider receiving a professional Seasonal Color Analysis session to determine your season . [26] X Research source"
    },
    {
      "title": "Look to True Autumn celebrities for makeup and styling inspiration.",
      "content": "Look to True Autumn celebrities for makeup and styling inspiration. Like any color season, there are many famous women and men that are Warm Autumns. Use their hair, makeup, and styling in street-style photos and on the red carpet to inspire your own wardrobe and beauty choices. Keep in mind that celebrities’ seasons are based on speculation, not professional Seasonal Color Analysis sessions. Julianne Moore [27] X Research source Jenna Fischer Julia Roberts Halle Bailey [28] X Research source Sofia Vergara Shailene Woodley Jane Seymour Jessica Alba Madison Beer Beyoncé Jennifer Lopez [29] X Research source Isla Fisher Christina Milian Taron Egerton [30] X Research source Brendan Fraser"
    },
    {
      "title": "Soft Autumns have low contrast between features and neutral undertones.",
      "content": "Soft Autumns have low contrast between features and neutral undertones. Unlike Warm Autumns which have low to medium contrast between their skin tone, hair, and eyes, Soft Autumns have very little contrast. Their soft features match one another. Another key difference between Soft and True Autumns is that Soft Autumns have neutral undertones that are neither warm nor cool. They can lean either way with their color palette. [31] X Research source Soft Autumn usually has the least contrast between features of the three types."
    },
    {
      "title": "Deep (Dark) Autumns have high contrast between features.",
      "content": "Deep (Dark) Autumns have high contrast between features. Their features tend to be darker than Soft or Warm Autumns, particularly their hair and eyes. While they have the warmth of a True Autumn, the Deep Autumn color palette is generally brighter and clearer than the other two Autumn seasons. This is because it’s the closest to Winter of the three Autumn subsets. [32] X Research source While all Autumns have warm features and warm or neutral undertones, True Autumn tends to be the warmest overall."
    },
    {
      "title": "Warm Autumn is darker and softer than Warm Spring.",
      "content": "Warm Autumn is darker and softer than Warm Spring. While these seasons are similar because of their warmth, their overall features are different. Warm or True Springs are flattered by bright and light colors that match the brightness of their features. Warm or True Autumns are best suited to darker, rich, and soft shades that aren’t too bright or saturated. Neither season is flattered by black or white. [33] X Research source"
    },
    {
      "title": "Cool seasons like Summer and Winter have cool undertones.",
      "content": "Cool seasons like Summer and Winter have cool undertones. Unlike Autumns and Springs, Summer and Winter seasons have cool and even bluish undertones. Light and Soft Summers may have neutral undertones that are slightly pink, but their overall features lean lighter and brighter than Autumns or Springs. Typically, you have to decide which warm or cool season you are—not whether you’re warm or cool. [34] X Research source"
    }
  ]
}