{
  "url": "https://www.wikihow.com/Taylor-Swift-Email",
  "title": "The Best Ways to Contact Taylor Swift and Her Team",
  "steps": [
    {
      "title": "Email Taylor Nation.",
      "content": "Email Taylor Nation. The best way to contact Taylor Swift’s team or store is to contact Taylor Nation themselves. Taylor Nation is the marketing team and official fan club for Taylor Swift. They work with 13 Management (Taylor’s publicity team) to give fans the best Swiftie experience possible. If you want to get in touch with them, simply email taylorswift@umgstores.com . [1] X Research source Make sure to include your full name and order number in your email. Keep in mind that this email address is specifically for merch orders through Taylor Swift’s website . Team members likely won’t be able to help you contact Taylor directly."
    },
    {
      "title": "Contact Taylor Swift on Twitter and Instagram.",
      "content": "Contact Taylor Swift on Twitter and Instagram. Taylor Swift and her team are known for being active with fans on social media. While there’s no guarantee that you’ll get a DM, comment, or like from the pop star, it’s still worth a shot! Send Taylor Swift or Taylor Nation a private message on Twitter or Instagram, or tag them in a post that shows off your Swiftie status. Taylor’s Twitter (X) is @taylorswift13 and Instagram is @taylorswift . Taylor Nation’s Twitter (X) is @taylornation13 and Instagram is @taylornation . Back in the day, Taylor was extremely active on Tumblr . While she hasn’t openly used the blogging site in years, some Swifties theorize that she still “taylurks” or looks for fans on the site."
    },
    {
      "title": "Taylor Swift doesn’t officially accept fan mail.",
      "content": "Taylor Swift doesn’t officially accept fan mail. With her rise to fame and the progression of social media, Taylor has traded traditional fan mail for DMs and social media posts. However, some Swifties speculate there are still ways to send her messages the old-fashioned way. Try sending a letter to these addresses. There’s no guarantee that Taylor or her team will see them, but it doesn’t hurt to try! Taylor Swift Entertainment 242 West Main Street PMB 412 Hendersonville, TN 37075 13 Management 718 Thompson Lane Suite 108256 Nashville, TN 37204-3600 [2] X Trustworthy Source Better Business Bureau Nonprofit organization dedicated to promoting marketplace trustworthiness by educating consumers and reviewing businesses Go to source"
    },
    {
      "title": "It may be difficult to contact Taylor Swift’s manager.",
      "content": "It may be difficult to contact Taylor Swift’s manager. There’s some debate on who Taylor’s manager actually is. You may be familiar with the 2019 debacle that caused Taylor to split with former manager Scooter Braun. Since then, Taylor’s kept the names of her team members on the down low; however, there are some people you might be able to contact: Rick Barker is one of Taylor’s former managers and can be contacted through his website or social media profiles. [3] X Research source Robert Allen is Taylor’s tour manager and may be able to be contacted through LinkedIn (although there are no guarantees). Douglas Baldridge is the general counsel at 13 Management (Taylor’s management); his contact information is unknown. Erica Worden is Taylor’s personal assistant and road manager and may be able to be contacted via LinkedIn . Tree Paine is Taylor’s publicist and might be able to be contacted through email at tree.paine@premiumpr.com, LinkedIn , or Twitter (X) at @treepaine. [4] X Research source"
    }
  ]
}