{
  "url": "https://www.wikihow.com/Tell-Someone-You-Have-Feelings-for-Them",
  "title": "How to Tell Someone You Have Feelings for Them",
  "steps": [
    {
      "title": "Figure out your own feelings first.",
      "content": "Figure out your own feelings first. [1] X Research source It's important to first ask yourself whether your feelings are really strong enough to warrant taking things to the next level. There are many different levels and types of attraction. In some cases, your feelings may not be strong enough to warrant moving forward with them; in other situations, it's better to wait a while and see. If you feel you really want to admit your feelings however, you owe it to yourself to follow through with it. [2] X Expert Source Cristina Morara Dating Coach Expert Interview. 29 September 2020."
    },
    {
      "title": "Consider your chances.",
      "content": "Consider your chances. It's probably not the sort of thing you want to be thinking about realistically when you first become attracted to someone, but it is nonetheless important to consider just how likely your crush is to return your feelings. Have they shown you any signs of attraction beyond friendship, or have they turned you away whenever things have gotten personal? Weighing the risk of sharing your feelings is important if you don't want to risk the friendship. [3] X Expert Source Cristina Morara Dating Coach Expert Interview. 29 September 2020. You can do more harm than good by letting a friend know your real feelings, especially if the whole thing is approached incorrectly."
    },
    {
      "title": "Find out if your crush is already interested in somebody else.",
      "content": "Find out if your crush is already interested in somebody else. Finding out about your crush's other potential interests is an important part of weighing your own chances. Letting someone know you have feelings for him is a big risk, especially if you really value the existing relationship you share together. With that in mind, it's a good idea to make sure someone hasn't beaten you to the chase before going in yourself. Even if someone might be interested in you otherwise, there's very little chance he'll strike up a relationship if he's actively pursuing someone else at the time. Note the difference between real interest and passing attraction. If your friend has called a member of the opposite sex 'good-looking' or even 'hot', that doesn't necessarily mean he's wanting to date them. On the contrary, he may even be testing you to see if you'll react when he says something like that."
    },
    {
      "title": "Check your crush for signs of attraction.",
      "content": "Check your crush for signs of attraction. Signs of attraction, whether conscious or unconscious, will usually shine through in a given interaction, even if it's just a friendship on the surface level so far. If your crush likes you, chances are you'll be able to sense it on some level. Does he go out of his way to shower you with attention and compliments? If your crush is a girl, does she avert her gaze a lot when she's around you, or laugh and smile more than usual when you're talking to her? [4] X Expert Source Cristina Morara Dating Coach Expert Interview. 29 September 2020. Not only will sensing mutual attraction give you a better idea of what your potential chances are, knowing the attraction is there will make you feel more confident when it comes time to admit your feelings."
    },
    {
      "title": "Make sure there are no outstanding issues in your current friendship.",
      "content": "Make sure there are no outstanding issues in your current friendship. Even if the two of you are both attracted to one another, admitting attraction is bringing new business into your relationship, and it should be avoided for the time being if you still have current issues to attend to. If you had a recent fight as friends, it would be a good idea to hold off on admitting your feelings until the dust has settled and you've resolved your current differences. If you're starting a relationship together, you want to get it started off on the right foot."
    },
    {
      "title": "Make sure your lives are relatively stable.",
      "content": "Make sure your lives are relatively stable. Could you imagine someone admitting they have a crush on you if you were in the middle of going through a family tragedy? Even if you had feelings in return for that person, you wouldn't be able to deal with it at the time. Knowing when to strike is a key part of making the approach work. [5] X Research source"
    },
    {
      "title": "Dress your best.",
      "content": "Dress your best. 'Dressing up' doesn't have to mean getting glamorous or ritzy. What it does mean, however, is that you should put slightly more effort into your appearance than you usually do. [6] X Research source This isn't so much for your crush's benefit as for your own. We always feel our most confident when we're looking our best. If this means taking an extra few minutes to soak up steam in the shower, or wearing your favourite shirt, then so be it. In the end, you want to do everything you can to set your mind at rest. Although confidence-boosting is the biggest reason why you should try to look good, it goes without saying that your crush is all that more likely to accept you if you put some added effort into your appearance!"
    },
    {
      "title": "Use confident body language.",
      "content": "Use confident body language. [7] X Research source Confident body language is a positive vicious cycle. While it goes to show other people that you're feeling confident, using body language like good posture, eye contact and smiling will serve to make you feel even more confident. Even before you meet up with your crush, you should try making a habit of expressing confident body language. You should notice a firm change in the way you feel before too long."
    },
    {
      "title": "Make a list of reasons why you would be great for your crush.",
      "content": "Make a list of reasons why you would be great for your crush. A relationship is a two-way street, and both sides need to be getting something out of it. That means you should have a good idea what you'll be bringing into a relationship if it works out in your favour. Start by making a list of things you love most about yourself. Which of these things would benefit a relationship? Do you love your smile? Your crush probably does too. Do you like to laugh? Are you really clever or funny? Now's not the time to be modest! Reflect upon this list and try to imagine how happy you could make the other person. If you know you have a lot to offer, you'll feel more confident when it comes time to admit your feelings. [8] X Research source If you need any help thinking up things, you should try talking to a friend (who isn't your crush) about what things most stand out about you."
    },
    {
      "title": "Stay calm and upbeat.",
      "content": "Stay calm and upbeat. The worst injury anyone can cause their chances of starting a relationship with their crush is by doubting themselves. When you self-doubt, it shows in the way you act and carry yourself. You won't be able to act casual if you're worried about 'what-if' situations as you close in. [9] X Research source Taking a deep breath is a helpful way to calm your nerves if they're acting up on you. It will take the edge off the stress, and give you a respite from the physical anxiety. Positive self-talk works as well. For example, try thinking something along these lines to yourself: \"I have nothing to fear. I am worth my crush's time. Everything's going to work out just the way I want it.\" Keep telling yourself that until you start believing it. Whether you think it's plausible or not, positive self-talk tends to be a self-fulfilling prophecy, as the confidence you'll gain from it will have a major impact on how the interaction plays out."
    },
    {
      "title": "Ask your crush to meet up with you.",
      "content": "Ask your crush to meet up with you. It's becoming more and more common for people to confess their crushes online, or via text message. Talking through a screen will work in a pinch, but it robs the conversation of its full importance. Because so many of the signs of attraction come across through body language, you'll stifle your chances by keeping it online. [10] X Research source Ask your crush out by saying something like \"Hey-- I was thinking of going to the beach sometime this weekend. Would you be interested in coming with?\" Keep it casual; admitting your feelings doesn't have to be the main point of hanging out with them. If you enjoy their company enough, it won't feel out of place to get together."
    },
    {
      "title": "Hang out casually.",
      "content": "Hang out casually. A big mistake many people make when it comes to approaching their crushes is that they put too much weight on the act. If the experience of being around you is extremely serious and sombre, your crush isn't exactly going to be open to starting a relationship with you, even if he's already attracted to you. [11] X Research source A casual hangout could be anything from going to the mall or rock concert, to something quieter like the park or beach. Activities that limit interaction like a movie aren't as well suited for something like this, as it won't give you near as much opportunity to confess your feelings. Going to dinner is a very common type of casual hangout. If you go for food, the type of restaurant you go to will help decide the type of atmosphere. Something ritzy and formal may be inauthentic if you're not used to going to fancy restaurants. Go somewhere the two of you will feel comfortable and relaxed."
    },
    {
      "title": "Make eye contact.",
      "content": "Make eye contact. Exhibiting all forms of positive, confident body language is an important trick when it comes to attracting someone, but nothing's quite as important as holding eye contact while you admit romantic feelings to your crush. Eye contact is a way of making the emotions feel real; a lot of unconscious communication goes on with eye contact. Suffice to say, holding your crush's gaze while you admit your feelings will keep him focused on what you're saying. Make a point of holding eye contact when your crush is speaking to you. Hold your crush's gaze while you admit your feelings. It may be appropriate to look away after you have confessed and are waiting for a response. Averting your gaze may help your crush to relax while he prepares a response."
    },
    {
      "title": "Tell your crush how you feel.",
      "content": "Tell your crush how you feel. Wait until you feel very comfortable with your crush to let him know how you feel. [12] X Research source This is the point you've been waiting for, and you're most likely feeling frazzled at the thought of it. But worry not-- actually telling your crush is in itself a fairly simple action. With solid eye contact in place, tell your crush how you feel. Express it in simple terms, so that there's no room for interpretation. If you try to dress it up, you'll only distract from the point you're trying to make. Stay confident, and treat the experience like a positive thing. You can list some reasons why you like them as well if you'd like. Use the following as an example: \"You know, I don't know if it's already totally obvious, but I really like you. In a way that's more than a friend. I hope you feel the same way about me too.\" Reader Poll: We asked 937 wikiHow readers about the best ways to ask out or confess feelings to a friend, and 81% agreed that it’s best to have a face-to-face conversation about your romantic interest. [Take Poll]"
    },
    {
      "title": "Express your feelings non-verbally.",
      "content": "Express your feelings non-verbally. One method that tends to work fairly well is actually not to say anything at all. Instead, expressing your feelings non-verbally can say as much as any number of words. While a non-verbal expression will usually be followed by some confirmation that you do have real feelings for this person, letting your feelings through in a more subtle way can be a perfect way to break the ice. [13] X Research source Physical touching is risky if your existing relationship has never included it, but it's much more likely to succeed if you go into it with confidence in yourself. Something as light as reaching for their hand, or more bold like a direct kiss, will leave little room for interpretation that you're interested. Giving a gift also works, especially if you're a male in pursuit of a female. Gift-giving is often seen as chivalrous, and definitely pushes past the boundaries of 'just friends' provided the gift is special enough. Buying flowers is a good place to start if you can't think of something more specific, but it's always best to pick out a gift that really relates to the specific connection and experiences you've shared together. [14] X Research source Non-verbal ways of expressing your feelings are always best accompanied with some sort of verbal affirmation. Don't just take her hand or give her a gift; let her know exactly why you've done that, and make it clear the ball's now in her court."
    },
    {
      "title": "Express your intentions.",
      "content": "Express your intentions. Now that you've made your feelings known to your crush, it's time to go into a bit more detail as to where you'd like your relationship to go. Simply telling someone you're attracted to him isn't an end unto itself; if you see it going anywhere, you should arrange plans to see one another on a more regular, romantic basis, provided that's what you're looking for. Be specific about what you want. [15] X Research source You might try formally asking your crush on a first date. Try saying something like \"If you agree that there's something special between us, maybe you'd be interested in going out with me sometime? It would be great to get a chance to get to know each other on a deeper level.\" Gauging by the reaction of your crush as you told him your feelings, you should have a better idea whether things are going to work out."
    },
    {
      "title": "Let your crush respond.",
      "content": "Let your crush respond. The anticipation and nerve-wracking nature of admitting your feelings to someone is rarely about how you're going to do it, but the ways in which you think the other person might react. If you've admitted your feelings and possibly expressed clear intentions, the other person is bound to have some sort of response in store for you. Whether it's a positive or negative one will depend on the success of your advance, and the feelings they've had (or haven't had) for you all along. All the same, it is necessary you give your crush some time to properly respond to you. [16] X Research source Stay calm throughout. Even in the worst reactions, it's better to keep a brave face and remain strong rather than let your emotions get the best of you. Breaking down into tears was never a good look on anyone."
    },
    {
      "title": "Work damage control, if necessary.",
      "content": "Work damage control, if necessary. If you get news you don't want to hear, it's important to remember that it's not the end of the world. As hard as it is to believe at the time, you'll feel much better about it as times goes on, and possibly even realize that you were better off without taking things to the next level. Even so, doing some damage control is often the best next step. Let your crush know that you care about him as a friend still, and you don't want to lose the friendship. Take some time to yourself if you feel you need to heal. [17] X Research source Remind your crush that you care about him on multiple levels and aren't purely trying to get a relationship out of him. For example, you can say: \"I know this might change things for us, but I want you to know I really value having you as a friend, and I don't want to lose you, even if you don't feel the same way about me.\""
    }
  ]
}