{
  "url": "https://www.wikihow.com/Talk-on-the-Phone",
  "title": "How to Talk on the Phone",
  "steps": [
    {
      "title": "Have some conversation topics in mind before picking up the phone to call someone.",
      "content": "Have some conversation topics in mind before picking up the phone to call someone. You can even write them down if you want. Don't write a whole sentence; the last thing you want to do is read from a script! Write just a few words to remind you of what you wanted to talk about. [1] X Research source If you don't have any thing in particular you want to talk to your friend or family member about, here are some ideas: Read the newspaper or watch the news and see what's happening around the world. That way you can talk about some current events. Talk about a movie or show you've both seen that you liked or disliked and what you both think about it. Share a funny or interesting incident that happened to you, either recently or a long time ago. Ask them about any noteworthy happenings going on in their life right now or recently."
    },
    {
      "title": "Determine how long this call might be.",
      "content": "Determine how long this call might be. Casual phone calls can vary greatly in length, and who you're talking to is a big factor in that. If it's someone you haven't talked to in a while, or who you don't get to see often, that probably necessitates a longer conversation. If it's a friend you see every week, you probably don't have much to catch up on, so the call won't need to be very long. The benefit of knowing ahead of time roughly how long you want this call to be is that you can avoid ending the call too short or staying on too long, by preparing topics of conversation appropriately."
    },
    {
      "title": "Do not talk too much.",
      "content": "Do not talk too much. If you don't have too much to say, let the other person talk most of the time, and simply keep the conversation going. Don't interrupt when the other person is talking, let him/her have his/her say. A big part of having a successful causal phone conversation is simply good listening skills . [2] X Research source It can also help to have some questions ready to ask, especially when the conversation falls silent. Some possible questions include: How was your day? How's work been going? How was your weekend? Have you been working on any projects recently? Seen any good movies recently?"
    },
    {
      "title": "Know when and how to end the phone call.",
      "content": "Know when and how to end the phone call. You don't want to wear out a pleasurable chat. The goal is to hang up the phone with the other person thinking, \"what a nice chat I should call him/her again sometime.\" [3] X Research source When to end the call can usually be felt by noticing more frequent pauses in the conversation and that you've run out of interesting topics. The personality of the person you're talking to, and how often you see and/or talk to them, are both going to be big factors in how long the conversation will go on. Once you get the feeling that the conversation is coming to a natural ending point, end the call gracefully, similarly to if you were talking to someone in person and had to leave. The structure of the calls end should look like: a positive statement about the chat, optionally add what you're about to do next, next let them know you'd like to talk again, and finally say goodbye. For example: \"It was good to talk to you. I've got to go prepare dinner, but let's speak again soon. Goodbye.\" Of course, in between each statement, let the other person respond first."
    },
    {
      "title": "Keep in mind what the purpose of the call is.",
      "content": "Keep in mind what the purpose of the call is. A formal call can be anything from setting up a dentist appointment to calling a client or customer for you job. What the purpose of the call is will determine how you will prepare for the call. Most formal calls fall into the following categories. [4] X Research source Customer call: From front desk receptionists or a sales team members, there are a number of jobs in which you'll have to make and receive many calls from current and prospective customers and clients. Appointment call: Sometimes, you'll need to make a call to make an appointment, for anything from seeing the dentist to getting your oil changed. Work call: This includes anything from calling work to call in sick to calling your boss to talk about a recent work development."
    },
    {
      "title": "Plan out all the key things you need to say and talk about in this call.",
      "content": "Plan out all the key things you need to say and talk about in this call. Once you've determined what the purpose of the call is, you'll need to plan out what needs to be said. There will be certain key topics and questions that you'll need to hit at some point during the phone call, so it's best to prepare ahead of time. [5] X Expert Source Katherine Kirkinis, Ed.M., MA Career Coach & Psychotherapist Expert Interview. 14 October 2020. [6] X Research source"
    },
    {
      "title": "Keep your statements short and simple.",
      "content": "Keep your statements short and simple. It's often best to let the other person lead the conversation, especially if it's a customer or higher up at your work. Remember that a successfully phone call is a dialogue, not just you getting across what you need to say. Allow time for the other person to respond to your statements and questions, and follow up on their responses rather than just jumping into the next topic. [7] X Research source"
    },
    {
      "title": "Stay polite and at least semi-formal.",
      "content": "Stay polite and at least semi-formal. For formal phone calls, you're going to want to have a different tone to your speech than a casual call, just as you speak differently at your friends house than at a meeting. Here are some basic formal phone call tips: Don't use slang or informal speech. Use the other person's appropriate title when greeting them. If you need to put a customer on hold, ask them permission first. Speak clearly and slowly enough to be heard. If you miss what the other person said, don't say \"what?\" Say \"I'm sorry, I didn't catch that,\" or \"pardon?\""
    },
    {
      "title": "Pay attention to your own body language.",
      "content": "Pay attention to your own body language. Just because you can't see the other person's body language doesn't mean your own isn't important. It may help you to pace around while you talk, or gesture with your free hand. Smiling while you talk will both help you come across as friendly and open, and make you feel more friendly and open. Some people also find it helpful to look in the mirror while they speak on the phone."
    },
    {
      "title": "Relax.",
      "content": "Relax. Before you make the call or answer the phone, take a few deep breaths with your eyes closed. If you have any little routine's that help you relax, put them to use before and/or during the call. [8] X Research source"
    },
    {
      "title": "Practice.",
      "content": "Practice. As with all things, practice makes perfect. If you really want to get better at talking on the phone without getting nervous, get a job that heavily involves phone calls. Over time, it will go from something that induces apprehension and dread to something you can do without even thinking about it. You can also practice by calling your friends or family just to talk. Plan for the conversations to be short so you don't have to worry about carry it on too long. [9] X Research source"
    },
    {
      "title": "Use canned lines.",
      "content": "Use canned lines. If you have to make calls for your job on a regular basis and you have trouble sometimes overcoming phone call anxiety, it can be helpful to prepare some lines. It's best not to rely on these as a crutch, but they can be useful when you're getting started. They can help you get the dialogue going and give you something to fall back on when you're unsure of what to say. [10] X Research source For calling customers, these lines can be something like \"I hope you've enjoyed doing business with us,\" or \"thank you for calling *blank*, how can I help you?\""
    }
  ]
}