{
  "url": "https://www.wikihow.com/Type-an-Arrow-in-Microsoft-Word-on-PC-or-Mac",
  "title": "How to Type an Arrow in Microsoft Word on PC or Mac",
  "steps": [
    {
      "title": "Open a Microsoft Word document on your computer.",
      "content": "Open a Microsoft Word document on your computer. You can either open a document by launching Word, then going to File > Open or by double-clicking the file in your file manager. Alternatively, you can open the Word app, and start a new, blank document ."
    },
    {
      "title": "Click the INSERT tab.",
      "content": "Click the INSERT tab. You can find this button next to HOME in the upper-left corner of the document. It will open your INSERT tools on the toolbar ribbon. [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click the icon next to Symbol.",
      "content": "Click the icon next to Symbol. The Symbol option is listed next to a blue \" Ω \" icon on the INSERT toolbar. You can see a list of all the available symbols here. On some versions, this button may be labeled Advanced Symbol . In this case, click on it to see the full list of symbols you can insert."
    },
    {
      "title": "Click More Symbols at the bottom.",
      "content": "Click More Symbols at the bottom. This will open the full list of symbols you can use in a new pop-up window. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Double-click the arrow icon you want to insert.",
      "content": "Double-click the arrow icon you want to insert. Find the arrow you want to type in the Symbol window and click on the icon to select it. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source If you cannot find the arrow you want, select Wingdings from the font selection menu and you'll see more symbols. While double-clicking the symbol will insert it into your document, you can single-click it to see more information, like its Alt Code . To use Alt Code in your writing, your keyboard must have a separate section for the number pad (0-9 that's not the same as the numbered keys at the top of your keyboard). Press and hold Alt as you enter the code on your number pad (you may need to have Num Lock enabled or press the Fn key as well). Common alt code for arrows includes: [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Alt + 2 + 4 ( ↑ ), Alt + 2 + 5 ( ↓ ), Alt + 2 + 6 ( → ), and Alt + 2 + 7 ( ← )."
    },
    {
      "title": "Click the Close button.",
      "content": "Click the Close button. You can find this button in the bottom-right corner. It will close the Symbol window. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source You can alternatively use the equation menu . [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    }
  ]
}