{
  "url": "https://www.wikihow.com/Wash-Duvets",
  "title": "How to Clean a Duvet at Home",
  "steps": [
    {
      "title": "Wash the duvet in a large, front-loading washer using a gentle cycle.",
      "content": "Wash the duvet in a large, front-loading washer using a gentle cycle. Duvet inserts are bulky but delicate, so using a large-capacity, front-loading washer ensures it gets cleaned and doesn’t get damaged from a top-loading machine’s agitator arm. Then, select the washer’s gentle or delicate cycle. Using a normal cycle can agitate the duvet too much and damage it. [1] X Research source Check the duvet’s care instructions label to ensure it’s machine washable. Generally, duvets made of cotton or a cotton blend are machine washable. If your duvet isn’t machine washable, take it to a professional dry cleaner to wash it. If you don’t have a large-capacity, front-loading washer, go to your local laundromat. Most laundromats have one. Always wash the duvet insert and the duvet cover separately. Washing the insert with the cover on can damage the insert and lead to longer drying times."
    },
    {
      "title": "Add ½ of the recommended amount of gentle detergent to the washer.",
      "content": "Add ½ of the recommended amount of gentle detergent to the washer. All you need is a mild laundry detergent to clean your duvet; harsh soaps with bleach can damage the filling inside the insert and strip away natural oils in down and feather comforters. Just add ¼ to ½ of the recommended amount of the detergent into the laundry machine to prevent soap residue from building up inside the duvet. [2] X Research source For a natural option, add ½ cup (136 g) of baking soda along with your detergent of choice at the beginning of the wash cycle. Then, add ½ cup (118 ml) of white vinegar at the beginning of the first rinse cycle. This combination helps freshen and soften your duvet. [3] X Research source If you have a white duvet, adding baking soda and vinegar also helps to brighten your insert."
    },
    {
      "title": "Run the duvet through 2 rinse cycles.",
      "content": "Run the duvet through 2 rinse cycles. Rinsing your duvet with just water after washing it ensures that you remove all of the soap on the duvet. If you still feel soapy residue or see suds inside the machine, just give it another rinse. [4] X Research source"
    },
    {
      "title": "Dry the duvet on low heat, fluffing it by hand every 30 minutes.",
      "content": "Dry the duvet on low heat, fluffing it by hand every 30 minutes. If your duvet is dryer-safe, place it inside a large-capacity dryer and turn it to the low, gentle, or air-dry setting. After about 30 minutes, stop the dryer and spread out the duvet to keep the filling from twisting or matting together. Just keep drying and fluffing until the duvet is dry. [5] X Research source It can take 3 hours or more for the duvet to completely dry. Most duvets made out of synthetic materials are safe to dry in the dryer, while down or feather comforters are more likely to be air dry only. If your duvet is air dry only, place it on a clothes drying rack or laundry line to dry outside. Or, place it in a well-ventilated room inside to dry."
    },
    {
      "title": "Add 3 wool dryer balls or clean tennis balls to help distribute the filling.",
      "content": "Add 3 wool dryer balls or clean tennis balls to help distribute the filling. If your duvet gets matted even after periodically hand-fluffing it, throw a few dryer balls or tennis balls into the dryer. The balls help to evenly distribute the filling inside your duvet as it dries. [6] X Research source"
    },
    {
      "title": "Hang the duvet to air dry for 24 hours.",
      "content": "Hang the duvet to air dry for 24 hours. Even if your duvet feels dry to the touch after taking it out of the dryer, there might be some moisture deep inside the filling. Hanging your duvet outside allows this final bit of moisture to evaporate and helps prevent a musty or mildewy smell from setting into your duvet. [7] X Research source If you can’t hang your duvet outdoors, place it in a well-ventilated room indoors. Simply drape it across a drying rack or the backs of several kitchen chairs. Setting an oscillating fan next to the duvet can help speed up the drying process, too. [8] X Research source"
    },
    {
      "title": "Wash the cover on a gentle cycle using mild detergent.",
      "content": "Wash the cover on a gentle cycle using mild detergent . Remove the duvet cover from the duvet insert and place it in your washing machine. Select your machine’s gentle cycle and the warmest water the duvet cover can handle according to its care instructions. Then, add mild laundry detergent into the machine. [9] X Research source Check your duvet cover’s care instructions before washing it to ensure you follow any special instructions. If you’re washing your duvet cover with other linens or clothes, make sure they’re of similar colors."
    },
    {
      "title": "Dry the cover in the dryer on a low heat cycle.",
      "content": "Dry the cover in the dryer on a low heat cycle. Transfer the duvet cover to your dryer and select your machine’s low heat, gentle, or air-dry setting. When the duvet cover is dry, simply put the cover back on your duvet insert . [10] X Research source If your duvet cover isn’t dryer safe, place it on a clothesline or drying rack outside or indoors to air dry."
    },
    {
      "title": "Wash your duvet insert once per year.",
      "content": "Wash your duvet insert once per year. Unlike your duvet cover, you need to wash your duvet insert pretty infrequently. The duvet cover helps prevent body oils, dirt, and sweat from accumulating inside the duvet insert. However, with time, dirt builds up and your duvet insert needs a refreshing wash. [11] X Research source If you use the same duvet all year, wash it 3 to 4 times per year to keep it clean and free from dirt, sweat, and bacteria."
    },
    {
      "title": "Wash your duvet cover every 2 weeks.",
      "content": "Wash your duvet cover every 2 weeks. To keep your duvet cover fresh and clean, wash it about as often as your sheets, which is about every 2 weeks. Cleaning your duvet cover frequently gets rid of bacteria, dead skin cells, sweat, and other unwanted dirt to help you get a good night’s sleep. [12] X Research source If you regularly sit or lounge on your bed, wash your duvet cover more often."
    },
    {
      "title": "Keep a duvet cover on your duvet insert to keep it clean.",
      "content": "Keep a duvet cover on your duvet insert to keep it clean. Placing a duvet cover on your duvet protects the insert from spills and keeps it from accumulating dirt and bacteria as quickly. While you need to wash duvet covers much more frequently than duvet inserts, they are easier to clean and maintain. [13] X Research source"
    },
    {
      "title": "Hang the duvet insert outside to air out every 3 months.",
      "content": "Hang the duvet insert outside to air out every 3 months. Hanging your duvet outside a few times each year helps it stay fresh and keeps musty odors away. Just choose a sunny, dry, and breezy day to put your duvet out on a clothesline or clothes drying rack. If you don’t have an outdoor space to freshen your duvet, put it in a large-capacity dryer with a dryer sheet for 10 minutes."
    },
    {
      "title": "Rub the stain with mild detergent or stain remover.",
      "content": "Rub the stain with mild detergent or stain remover . When you spot a stain on your duvet, clean it as soon as possible. Shake or pinch away the filling from the spot. Then, use your hands or a clean white cloth to rub detergent and warm water into the stain. Or, apply a stain remover. [14] X Research source Just keep rubbing the stain until it’s gone."
    },
    {
      "title": "Rinse the stain with water and dry it with a hair dryer.",
      "content": "Rinse the stain with water and dry it with a hair dryer. Hold the stained spot under warm water to rinse out the detergent or stain remover. Just make sure to hold back the filling so it doesn’t get wet. Then, use your hair dryer’s low heat setting to dry the area off. [15] X Research source"
    },
    {
      "title": "Fill your bathtub with warm water and add a bit of mild detergent.",
      "content": "Fill your bathtub with warm water and add a bit of mild detergent. If you don’t have a large washing machine or don’t want to go to the laundromat, it’s easy to wash your duvet insert by hand. Just fill your bathtub or a large container with warm water and mix in a small amount of detergent. [16] X Research source"
    },
    {
      "title": "Add in the duvet section-by-section, rubbing it in the soapy water.",
      "content": "Add in the duvet section-by-section, rubbing it in the soapy water. Pull a corner of the duvet insert into the warm, soapy water and knead it with your hands. Keep pulling more of the duvet in the water and rubbing it with your hands until the entire duvet is submerged. [17] X Research source"
    },
    {
      "title": "Rinse the duvet with water and hang it up to air dry.",
      "content": "Rinse the duvet with water and hang it up to air dry. Drain the soapy water in the tub. Then, turn on the water and rinse the duvet until it feels free of soap residue and you no longer see any suds. Gently wring out the water and then place the duvet on a drying rack or clothesline outside to dry. [18] X Research source If you don’t have space outside, set the duvet in a well-ventilated room and next to a fan to dry."
    }
  ]
}