{
  "url": "https://www.wikihow.com/Tune-a-Guitar",
  "title": "How to Tune a Guitar",
  "steps": [
    {
      "title": "Use a digital tuner for a quick and easy option.",
      "content": "Use a digital tuner for a quick and easy option. Digital tuners are usually small, battery-powered devices with microphones able to pick up the notes of your guitar. Turn it on, then play an open E string. A light will flash when the string is tuned to the correct note. Adjust the string if necessary until the note is in tune, then repeat with the other strings. [1] X Research source If you have an electric guitar, you can usually plug a cord directly into the tuner to check your tuning, instead of using the tuner's microphone."
    },
    {
      "title": "Try a tuner app for convenience.",
      "content": "Try a tuner app for convenience. There are many guitar tuner apps available, and with smartphones at everyone's fingertips, these can be a great option to keep things simple or to use when you don't have another tuner. These apps work similarly to digital tuners, using your smartphone's built-in microphone. [2] X Research source Play an open E string and adjust until your app shows the note is at the correct pitch. Repeat for the other strings."
    },
    {
      "title": "Add a tuner to your stompbox rig.",
      "content": "Add a tuner to your stompbox rig. If you use effects pedals with your electric guitar, there are models that work just like one of these. Instead of altering the guitar's tone when you activate them, they serve as a digital tuner. Many also allow you to tune silently, which is a great option, particularly if you are playing live. Play an open string, and the tuner will light up to indicate when the pitch is correct. [3] X Research source Many multi-effects units include built-in tuners."
    },
    {
      "title": "Snap on a headstock tuner.",
      "content": "Snap on a headstock tuner. These clamp directly to your guitar's headstock, and you can leave them in place while you play. Instead of picking up the tones with a microphone, they detect the notes by the vibrations running through the guitar's wood. Play each string you want to tune, and the tuner will alert you when the note is correct. [4] X Research source"
    },
    {
      "title": "Open a browser and use an online tuner.",
      "content": "Open a browser and use an online tuner. If you're sitting near a computer, you can easily find a guitar tuner online by searching for one. Most tuner sites allow you to select the string you want to tune, listen to a tone of the correct pitch, and adjust the string as needed until it sounds the same. [5] X Research source This method does not use a microphone. You'll just have to rely on your ear to make sure the notes played on the web browser match the open guitar strings, adjusting as needed. If you can't access an online tuner, you can also strike a set of tuning forks or blow a slide whistle. Adjust each guitar string until it matches to pitch of the corresponding tuning fork or note on a slide whistle."
    },
    {
      "title": "Practice listening to two notes at the same pitch.",
      "content": "Practice listening to two notes at the same pitch. Unlike a piano or any other instrument which can play each pitch only one way, a guitar can play multiple notes of the same pitch. This means that you can tune a guitar by matching these notes together. Practice playing and listening to two notes of the same pitch together, like the fifth fret on the fourth string and the open third string. [6] X Research source When the notes are tuned correctly, they will sound identical. If the notes are not tuned to the exact same pitch, you will hear a wavering sound called “beating.” To tune, adjust one of the strings up or down until this beating slows and then disappears."
    },
    {
      "title": "Tune the sixth through third strings.",
      "content": "Tune the sixth through third strings. Start by assuming that your sixth string (the low E) is in tune. Play the note at the fifth fret on the sixth string, and the fifth string open. Listen to see if the notes sound the same. If not, adjust the fifth string until it matches the note played at the fifth fret on the sixth string. [7] X Research source Repeat this pattern by playing the fifth string at the fifth fret with the open fourth string, then the fourth string at the fifth fret with the open third string. Adjust the strings as necessary. Strings 6-3 will then be tuned to each other."
    },
    {
      "title": "Finish by tuning the second and first strings.",
      "content": "Finish by tuning the second and first strings. The pattern varies when tuning the second string. Play the third string at the fourth fret and the open second string. Adjust the second string as necessary until the note is correct. Then play the second string at the fifth fret together with the first string and tune in the same way. [8] X Research source"
    },
    {
      "title": "Memorize the pattern for checking tuning by identical pitches.",
      "content": "Memorize the pattern for checking tuning by identical pitches. Think of “55545” as an easy way to remember the notes you should fret and pair with the next string (open) in order to tune your guitar. Once you learn how to tune in this way, you can start with either the low E string and go up, or the high E string and go down. [9] X Research source"
    },
    {
      "title": "Practice playing harmonics.",
      "content": "Practice playing harmonics. The same pitches can be produced by harmonics on different strings, allowing you to tune the guitar to itself. The benefit of this technique is that the harmonics will ring out by themselves once you play them. Your playing hand will be free to adjust strings as necessary while still hearing the tone. [10] X Research source Guitar harmonics are high-pitched notes produced by lightly touching strings (not depressing them to the fret) at various places. Tuning by harmonics is also a relatively quiet method."
    },
    {
      "title": "Tune the sixth through third strings with harmonics.",
      "content": "Tune the sixth through third strings with harmonics. Assume that the sixth string is in tune. Play the harmonic on the sixth string above the fifth fret and another harmonic on the fifth string above the seventh fret. Listen to see if the pitches are the same. Adjust the fifth string if they are not. [11] X Research source Repeat this pattern by playing a harmonic on the fifth string above the fifth fret together with one on the fourth string above the seventh fret. Then play a harmonic on the fourth string above the fifth fret, and another on the third string at the seventh fret. Adjust the fourth and third strings if needed."
    },
    {
      "title": "Play a harmonic on the sixth string above the seventh fret.",
      "content": "Play a harmonic on the sixth string above the seventh fret. Then play the second string open. The pitches should be the same if the guitar is tuned. If they are not the same, then adjust the second string up or down until they match. [12] X Research source"
    },
    {
      "title": "Tune the first string with harmonics.",
      "content": "Tune the first string with harmonics. Play the harmonic on the second string above the fifth fret, and another on the first string at the seventh fret. Adjust the first string if necessary until the pitches are the same. Alternatively, you can play a harmonic on the fifth string at the seventh fret (or on the sixth string above the fifth fret), and the first string open. Choose whichever method is most comfortable to you. [13] X Research source"
    },
    {
      "title": "Remember standard tuning with a silly acronym.",
      "content": "Remember standard tuning with a silly acronym. In standard guitar tuning, the strings are tuned EADGBE. Each letter corresponds to a string, from the low sixth to the high first. It's easy to remember this order with a fun acronym, like: [14] X Research source Every Angry Dog Gets Bit Eventually Eddie Ate Dynamite, Good Bye Eddie Evenings After Dinner Gertrude Baked Eggplant"
    },
    {
      "title": "Adjust the pitch of strings by turning the tuning pegs.",
      "content": "Adjust the pitch of strings by turning the tuning pegs. Follow each string to its corresponding tuning peg. In most cases, turning the pegs counterclockwise will raise the pitch of the string. Do this if it is lower than the desired note (flat). Turn a peg clockwise to lower a string if the pitch is too high (sharp). [15] X Research source You only need to turn the tuning pegs a little at a time. This will make it easier to find the precise pitches you need."
    },
    {
      "title": "Double-check your guitar after tuning all the strings.",
      "content": "Double-check your guitar after tuning all the strings. Once you've tuned your guitar by any method, play some notes and chords to make sure everything sounds right. Sometimes notes are off because the guitar moved slightly as the pressure changed from adjusting strings, or simply because a tuner or your ear wasn't 100% accurate. If this is the case, just check the strings again and readjust any that are off. [16] X Research source"
    },
    {
      "title": "Get your guitar to concert pitch if you are playing with other people.",
      "content": "Get your guitar to concert pitch if you are playing with other people. Tuning a guitar to itself is just fine for solo play and practice. Though the notes relative to each other will sound in tune, it means the whole guitar might be a little sharp or flat relative to other instruments. To be in tune with other people, you'll want to be in “concert pitch,” or tuned to the precise notes EADGBE. [17] X Research source Use a digital tuner, tuning forks, or a slide whistle to find the precise pitches you need."
    }
  ]
}