{
  "url": "https://www.wikihow.com/Treat-Cavities",
  "title": "How to Treat Cavities",
  "steps": [
    {
      "title": "Tooth pain, sensitivity, or visible holes in your teeth are common.",
      "content": "Tooth pain, sensitivity, or visible holes in your teeth are common. However, when a cavity is first forming, you might not have any symptoms at all. If you notice that there’s a certain spot in your mouth that all of the sudden becomes painful or more sensitive, make an appointment with your dentist to get checked out. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "No, a cavity will only continue to get worse.",
      "content": "No, a cavity will only continue to get worse. Since a cavity is a hole in your tooth, leaving it untreated will only make the hole bigger. It’s important to start treating your cavity as soon as you notice the signs, like increased tooth pain, sensitivity, or swelling. [2] X Research source Leaving a cavity untreated for too long can even cause you to lose your tooth."
    },
    {
      "title": "No, but you can treat your pain levels.",
      "content": "No, but you can treat your pain levels. Unfortunately, you’ll need a dentist to treat your cavity for you. While you wait for an appointment, you can take an over the counter pain reliever, brush with sensitive-teeth toothpaste, and avoid any drinks that are too hot or too sweet (since that can cause you pain). [3] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Oil pulling is sometimes recommended as an at-home treatment for cavities. However, there is no scientific evidence to back this up, and experts don’t recommend it. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Get a fluoride treatment.",
      "content": "Get a fluoride treatment. Fluoride is a naturally occurring mineral that helps strengthen the outside of your tooth. If you have a small cavity that you caught early, you can go into your dentist and ask for a fluoride treatment. If your cavity is very mild, fluoride may be able to reverse it. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Maintain good oral hygiene.",
      "content": "Maintain good oral hygiene. Bacteria causes cavities to get worse. Try to keep brushing your teeth twice per day and flossing at least once a day. Avoid sugary sweets, and limit the amount of snacking you do throughout the day. [6] X Research source"
    },
    {
      "title": "For mild cavities, they will give you a filling.",
      "content": "For mild cavities, they will give you a filling. If you caught your cavity early on, a dentist will be able to treat it with a filling. First your dentist will numb your mouth so you can’t feel anything, then they will take a glass, quartz, or metal filling and use it to fill the hole in your tooth. It will stop your cavity from getting worse, and it should take away any pain or discomfort in your mouth. [7] X Research source"
    },
    {
      "title": "When cavities reach your inner tooth, you may need a root canal.",
      "content": "When cavities reach your inner tooth, you may need a root canal. Root canals are usually saved for severe cavities that have eaten through the outer layer of enamel. During this procedure, your dentist will numb your mouth so it doesn’t hurt and then use a small drill to remove the diseased pulp. Then, they will fill the hole with a filling. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "If your tooth is severely decayed, it may need to be removed.",
      "content": "If your tooth is severely decayed, it may need to be removed. Unfortunately, if your cavity is severe enough, your dentist may have to numb your mouth and then extract the tooth completely. It shouldn’t hurt, and you may be able to get an implant to replace your missing tooth. [9] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Brush and floss every day.",
      "content": "Brush and floss every day. Cavities are caused by bacteria that get into our mouths every day. When you brush your teeth every morning and night and floss at least once a day, you can get rid of a lot of the bacteria that might give you a new cavity. [10] X Research source For extra protection, rinse your mouth with mouthwash afterwards. [11] X Research source Tu Anh Vu, DMD. Dentist. Personal interview. 7 May 2020."
    },
    {
      "title": "See your dentist twice per year.",
      "content": "See your dentist twice per year. Your dentist can give you a checkup and make sure your teeth are in good shape. They can also give you a deep clean and get rid of any plaque buildup on your teeth that might lead to cavities later on. [12] X Research source Tu Anh Vu, DMD. Dentist. Personal interview. 7 May 2020."
    },
    {
      "title": "Ask your dentist about fluoride and sealants.",
      "content": "Ask your dentist about fluoride and sealants. Fluoride treatments make your outer teeth stronger, leaving them less prone to cavities. Sealants fill in any deep holes or crevices in your teeth that might be prone to bacteria buildup. If you think those might help you, talk to your dentist about them. [13] X Research source"
    }
  ]
}