{
  "url": "https://www.wikihow.com/Win-Death-by-Ai-Every-Time",
  "title": "5 Tried-and-True Ways to Win Death by AI Every Single Time",
  "steps": [
    {
      "title": "Tell the AI that the danger happened in a dream.",
      "content": "Tell the AI that the danger happened in a dream. No matter the prompt, you can twist it around to turn it into a dream. You can be as descriptive as you want, or you can just say that you woke up and it was all a dream. If you are too vague, the AI could potentially turn the tables and make it so you don't actually survive the prompt. One way to guarantee that you'll win is to include the word \"unharmed\", i.e., \"I wake up in my bed unharmed. It was all a dream.\""
    },
    {
      "title": "Convince the AI that your competency can get you out of the situation.",
      "content": "Convince the AI that your competency can get you out of the situation. For certain situations, you can tell the AI that you actually have a degree of competency that would allow you to survive the situation. For example, if you have the prompt where you're stuck in a room with a ticking bomb, tell the AI that you're a bomb squad technician and that you know how to successfully diffuse a bomb."
    },
    {
      "title": "Simply tell the AI that you would survive.",
      "content": "Simply tell the AI that you would survive. Most of the time you can suggest to the AI that you would survive the prompt, and it will allow itself to be suggested. This method doesn't always work, but as long as you're adamant in your answer that you would live, the AI usually agrees. For example, if the prompt is that you're hurtling down a hill and your bike's brakes give out, you can tell the AI that you sprout wings from your back and you fly away to a safe location."
    },
    {
      "title": "Let the AI fill in the blanks for you.",
      "content": "Let the AI fill in the blanks for you. While this isn't the most fun method of getting a win every time, simply tell the AI that you \"do something, then solve the problem instead.\" [1] X Research source The AI will make up a story about what happened, but you will always end up surviving at the end."
    },
    {
      "title": "Make up your own twist endings.",
      "content": "Make up your own twist endings. Many of the responses that the AI gives to players' answers include a twist at the end. In order to force the AI to let you survive, write a twist into your answer. You can be as detailed as you want, or simply write \"I resign to my fate, but then, in a twist of fate…\". The AI will fill in the blanks and write an ending where you end up surviving."
    },
    {
      "title": "Go to https://deathbyai.gg.",
      "content": "Go to https://deathbyai.gg . Death by AI is a game you can play in your browser on your computer or phone, or you can download it on your iPhone or iPad from the App Store ."
    },
    {
      "title": "Start or join a lobby.",
      "content": "Start or join a lobby. Click the purple Start button to start your own lobby. If you're joining someone else's game, click Join Game instead. You'll need the room code to enter someone else's lobby."
    },
    {
      "title": "Enter your name and pick an avatar.",
      "content": "Enter your name and pick an avatar. Use the arrow buttons to scroll through the possible avatar choices."
    },
    {
      "title": "Invite others to play.",
      "content": "Invite others to play. If you are playing with other people, invite them to play by sharing the room code with them. Similar to Jackbox, users can join in via the browser on their phone or computer. Players can also join in on the app on an Apple device, if they have it."
    },
    {
      "title": "Start the game.",
      "content": "Start the game. If you started the lobby, click the yellow Start >> button. If you joined the game, you'll have to wait for the lobby VIP to start the game."
    },
    {
      "title": "Pick a prompt.",
      "content": "Pick a prompt. Click the circular arrow icon to cycle through prompts, or click the pencil to write your own. The VIP will pick the first prompt. The chance to pick the prompt will cycle through the other players after the first round."
    },
    {
      "title": "Write your answer.",
      "content": "Write your answer. You have 60 seconds to write an explanation about how you would survive the deadly encounter described in the prompt. When you're done, click Confirm to submit your answer. Once all players have submitted (or time runs out), the game will move to the next stage."
    },
    {
      "title": "View the outcome.",
      "content": "View the outcome. The AI chatbot will write a scenario based on the answer you gave it to determine if you survive or not. The user who's turn it is must click or tap the Continue >> button. The VIP can also click or tap Continue >> button regardless of whose turn it is."
    },
    {
      "title": "Click Continue >> to move to the next round.",
      "content": "Click Continue >> to move to the next round. The VIP must be the one to click this button. Other players must wait. The game continues this way for 5 rounds. After the fifth round, the player(s) with the highest score wins."
    },
    {
      "title": "Certain words cannot be used.",
      "content": "Certain words cannot be used. There are certain words you can't use, such as \"survive,\" \"win,\" \"safe,\" \"safety,\" and \"alive.\" To get around this, use synonyms of those words. A great word to include is \"unharmed,\" as this usually forces the AI to create an ending where you don't die."
    },
    {
      "title": "There are still some bugs in the game.",
      "content": "There are still some bugs in the game. Sometimes, the AI will write a response that makes it sound like you win, but it will still say that you didn't survive. This is likely the result of a bug."
    },
    {
      "title": "Try not to focus on winning every round.",
      "content": "Try not to focus on winning every round. Once you learn how to win every time, you might find that the game is no longer fun. If this is the case, try to write silly or wacky answers just to see how the AI responds. You can get some really funny responses this way!"
    }
  ]
}