{
  "url": "https://www.wikihow.com/Stop-Bleeding-from-Shaving",
  "title": "How to Stop a Shaving Cut from Bleeding",
  "steps": [
    {
      "title": "Wash the cut with cool water and a clean washcloth.",
      "content": "Wash the cut with cool water and a clean washcloth. The first step to tackling any minor cut or wound is to make sure the area is clean. Wet a clean washcloth with cool water and use it to wipe away the blood. Then, gently wash the area with soap and pat dry. [1] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Always use cool water to do this, as the colder temperature of the water can actually help stop the bleeding. Make sure you wash your hands before cleaning the cut."
    },
    {
      "title": "Apply pressure to the cut.",
      "content": "Apply pressure to the cut. Todd says to “use a clean cloth or bandage to apply pressure directly to the cut” until it stops bleeding. This helps a blood clot to form, which prevents the cut from bleeding more. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Depending on the size of the cut and how much it’s bleeding, this could take as long as 15 minutes. Todd also recommends elevating the wound at this point, especially if the cut is on your leg or arm—“raise the affected area above the level of your heart.”"
    },
    {
      "title": "Place ice or a cold compress to the cut.",
      "content": "Place ice or a cold compress to the cut. Use an ice cube or ice pack to numb the area, prevent swelling, and stop bleeding. Applying a cold compress to the cut helps constrict the blood vessels, making it bleed less. [3] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Similarly, try holding a wet green tea bag to the cut. [4] X Research source Research has shown that tea bags can help tighten the skin and restrict bleeding. [5] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Apply petroleum jelly to the cut.",
      "content": "Apply petroleum jelly to the cut. The easiest way to stop bleeding and promote healing with a razor cut is to use petroleum jelly (or Vaseline). This moisture-rich product is chemical-free and acts as a barrier, stopping blood from getting out and preventing germs from getting in. [6] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If you don’t have petroleum jelly on hand, use an unused, unscented lip balm. If you nick yourself shaving often, consider investing in a styptic pencil (also known as an alum block). Simply rub the end of the pencil onto the cut. [7] X Research source As Todd explains, “a styptic pencil contains alum, which helps to stop bleeding by constricting blood vessels.” Some advise using aloe vera gel instead of petroleum jelly as it’s been proven to treat wounds. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source However, aloe vera gel is best used to moisturize the skin as a preventative measure against shaving cuts. Avoid using a topical antibiotic unless instructed to by a doctor, as these could hinder the healing process of non-infected wounds. [9] X Research source"
    },
    {
      "title": "Apply a bandage, if needed.",
      "content": "Apply a bandage, if needed. If you have a larger shaving cut or it's in a place that rubs against your clothes, consider using a bandage or small piece of gauze to protect it. [10] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Todd instructs that “once the bleeding has stopped, cover the cut with a sterile bandage to protect it from further injury.”"
    },
    {
      "title": "Wash the cut regularly and reapply treatments.",
      "content": "Wash the cut regularly and reapply treatments. Repeat these steps until your cut starts to close. Taking care of the small wound and ensuring it’s clean and moisturized can prevent further bleeding and help it heal nicely. Todd also recommends avoiding shaving over the cut—“once the bleeding has stopped, avoid shaving over the cut until it has fully healed to prevent further injury and bleeding.”"
    },
    {
      "title": "Most minor cuts take one week or less to heal.",
      "content": "Most minor cuts take one week or less to heal. If you cut or nick yourself while shaving, don’t panic—it happens! While the cut may seem inconvenient now, it’ll be gone before you know it. Shaving cuts and nicks typically heal within a week. [11] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "If the wound is large or continues to bleed, seek medical attention.",
      "content": "If the wound is large or continues to bleed, seek medical attention. In most cases, a shaving cut or nick will heal on its own; however, there are cases where larger cuts need extra care. See a doctor if: [12] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source The cut is longer than 3 ⁄ 4 in (1.9 cm), more than 1 ⁄ 4 in (0.64 cm) deep. The cut continues to bleed after applying pressure for 15 minutes."
    },
    {
      "title": "Yes, petroleum jelly can stop a cut from bleeding.",
      "content": "Yes, petroleum jelly can stop a cut from bleeding. Also known as petroleum jelly, petroleum jelly (and other products containing petroleum jelly) protects the skin and hinders bleeding in small cuts. The wax-like product acts as a moisturizing barrier, preventing blood from escaping the cut and keeping bacteria out. [13] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Applying petroleum jelly or petroleum jelly to the cut regularly helps promote healing and prevent scarring. Keep in mind that petroleum jelly is a “quick fix.” Even minor cuts should still be washed and treated regularly. [14] X Research source"
    },
    {
      "title": "Soften your skin with warm water before you shave.",
      "content": "Soften your skin with warm water before you shave. Having soft, moisturized skin can make shaving easier and help prevent cuts. So, make sure to soak the area you wish to shave in warm water before shaving. We suggest hopping in the shower or bath before getting started. [15] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Similarly, moisturize often with fragrance-free moisturizers or aloe vera gel . A healthy, soft skin barrier makes shaving that much easier! [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Use gentle pressure with the razor.",
      "content": "Use gentle pressure with the razor. You don’t need to press hard on the razor while shaving. Let the blades glide over your skin. It’s better to go over an area twice than push down really hard and cut yourself. [17] X Research source"
    },
    {
      "title": "Shave in the same direction your hair grows.",
      "content": "Shave in the same direction your hair grows. While shaving “against the grain\" may be tempting, avoid doing so. This can make it easier to nick yourself. [18] X Research source Plus, it also increases your chances of ingrown hairs. [19] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Change razors regularly.",
      "content": "Change razors regularly. Nicks and cuts are most likely to happen with a dull razor blade. [20] X Research source To prevent this, change or swap out your razor every 5 to 7 shaves. [21] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Use shaving gel.",
      "content": "Use shaving gel. Ensuring your razor has something to glide against can help reduce your risk of shaving cuts. Shaving gels and lotions are designed to reduce friction between your skin and the razor blades. So, always shave with it! [22] X Research source If you don’t have shaving gel, Rivas recommends using soap instead. While it isn’t as ideal as shaving gel, it’s better to “lather up” with soap than nothing at all."
    },
    {
      "title": "Switch to an electric razor.",
      "content": "Switch to an electric razor. If you nick or cut yourself with a regular razor, consider switching to an electric razor for a short while (or however long you want). This can help give your skin a break and help your cut heal without sacrificing hair-free skin. [23] X Research source This tip is most helpful for those shaving facial hair; however, there are electric razors and trimmers on the market designed for shaving body hair."
    }
  ]
}