{
  "url": "https://www.wikihow.com/Tell-if-You-Have-Mouth-Cancer",
  "title": "How to Tell if You Have Mouth Cancer",
  "steps": [
    {
      "title": "Look for ulcers and sores on your lips, tongue, cheeks and the floor of your mouth.",
      "content": "Look for ulcers and sores on your lips, tongue, cheeks and the floor of your mouth. Mouth ulcers are very common and are not a surefire sign of mouth cancer in and of themselves. However, when mouth ulcers are combined with other symptoms and their development follows a certain pattern, they may indicate cancer. [1] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Look for mouth ulcers which have not healed in over two or three weeks. [2] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Look for mouth ulcers that recur in the same areas of the mouth over and over again. Look for mouth ulcers with irregular borders, that bleed at the slightest touch."
    },
    {
      "title": "Check for color changes or colored patches inside your mouth.",
      "content": "Check for color changes or colored patches inside your mouth. Look for color changes on the surface/sides of the tongue, lips and inside of the cheeks that last for more than two weeks. [3] X Trustworthy Source Cancer Research UK U.K.-based cancer research and advocacy charity Go to source These color changes may be red, white, grey or dark in color. You may also notice velvety white and red patches inside your mouth."
    },
    {
      "title": "Identify feelings of numbness or pain in any part of your mouth.",
      "content": "Identify feelings of numbness or pain in any part of your mouth. You might experience a numb sensation in any area of the mouth, face and neck region as a symptom of cancer. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You may also feel a non-stop pain/tenderness in a particular area of your mouth. If you experience any of these two symptoms with or without swelling/lumps, then you should visit your doctor immediately"
    },
    {
      "title": "Look for rough, crusted patches around your mouth and lips.",
      "content": "Look for rough, crusted patches around your mouth and lips. These crusted patches may feel rough to the touch, have irregular borders and bleed without provocation. [5] X Research source"
    },
    {
      "title": "Inspect your teeth to check for any changes in their alignment.",
      "content": "Inspect your teeth to check for any changes in their alignment. Examine your teeth carefully to check for any changes in their alignment. Also look for any loose teeth, as this can also be an indication of mouth cancer. [6] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source One good way to tell if the alignment of your teeth has changed is to try wearing your dentures (if you use them). Difficulty in fitting the dentures inside your mouth is a good indication that your teeth have moved."
    },
    {
      "title": "Feel for lumps or swelling on the side of your face and neck.",
      "content": "Feel for lumps or swelling on the side of your face and neck. Look for any abnormal lumps, swelling or bumps that are present on the side of your face or on your neck. [7] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source Press gently along the sides of your neck for any pain, tenderness or lumps. Visually examine the skin for any abnormal growths or moles. Pull out your lower lip using your thumb and index finger and check for any lumps or irregular growths. Do the same for the upper lip. Put your index finger inside your cheeks and your thumb outside and check for any pain, change in texture, swelling or lumps in the cheeks by gently rolling and squeezing the skin with your fingers."
    },
    {
      "title": "Think about whether you have any difficulty eating or speaking.",
      "content": "Think about whether you have any difficulty eating or speaking. If you experience any difficulty while speaking or chewing food (in addition to the other symptoms) it may be an indication of mouth cancer. More specific symptoms include: [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Being unable to swallow foods or liquids or feeling pain when swallowing. Experiencing a loss of taste when eating. Feeling as if something is caught in your throat when swallowing. Difficulty moving the tongue and jaw due to stiffness."
    },
    {
      "title": "Listen for any changes in your voice.",
      "content": "Listen for any changes in your voice. Cancer of the mouth can put pressure on the vocal chords, causing changes in the sound of your voice. [9] X Trustworthy Source Cancer Research UK U.K.-based cancer research and advocacy charity Go to source Usually, your voice will become more hoarse. You may also feel pain in your throat while talking, eating or even at rest."
    },
    {
      "title": "Watch out for ear pain or swollen neck glands.",
      "content": "Watch out for ear pain or swollen neck glands. [10] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Check for swollen glands (lymph nodes) in the neck by pressing on the lymph nodes, which are located at the base of your lower jaw, under your ear lobes. [11] X Research source The glands will feel swollen and painful to the touch. This is due to the fact that mouth cancer affects the drainage of the lymph nodes. You may also experience pain in the ears, as the cancer causes pressure against the inside of the ears. This usually indicates that the cancer has spread and become more advanced."
    },
    {
      "title": "Keep track of any weight or appetite loss.",
      "content": "Keep track of any weight or appetite loss. As mouth cancer often causes pain when eating or swallowing, you may find it difficult to maintain your normal eating patterns. This reduced food intake can lead to weight loss. [12] X Trustworthy Source Cancer Research UK U.K.-based cancer research and advocacy charity Go to source In addition to difficulty eating, the illness may cause a loss of appetite, which can contribute to further weight loss."
    },
    {
      "title": "Use a small mirror to inspect the inside of your mouth.",
      "content": "Use a small mirror to inspect the inside of your mouth. It can be difficult to get a good view of the inside of your mouth in a wall mirror, so try using a small hand-held mirror to perform the self-examination — preferably one that fits inside your mouth."
    },
    {
      "title": "Conduct the self-examination in a well-lit room.",
      "content": "Conduct the self-examination in a well-lit room. Light is also important in getting a good view of your mouth, so make sure to do the examination in a well-lit room, near a bright lamp. You could also use a small, hand-held torch to illuminate the inside of your mouth."
    },
    {
      "title": "Make sure your hands are clean before you perform the examination.",
      "content": "Make sure your hands are clean before you perform the examination. Clean your hands with soap and dry them thoroughly before performing the self-exam, as you don't want to introduce any dirt or bacterial into your mouth. [13] X Research source"
    },
    {
      "title": "If you suspect you might have mouth cancer, schedule an appointment with your doctor or dentist.",
      "content": "If you suspect you might have mouth cancer, schedule an appointment with your doctor or dentist. If you identify some of the signs and symptoms of mouth cancer described above, it is important that you make an appointment with your doctor or dentist as soon as possible in order to undergo testing and confirm the presence of cancer. [14] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source As with all types of cancer, early detection is key in successful treatment. [15] X Trustworthy Source World Health Organization Health information and news provided by the World Health Organization Go to source"
    },
    {
      "title": "Understand what measures you can take to avoid mouth cancer.",
      "content": "Understand what measures you can take to avoid mouth cancer. If you have reassured yourself that you do not have mouth cancer but wish to prevent it from developing in future, there are a number of measures you can take: [16] X Trustworthy Source University of Rochester Medical Center Leading academic medical center in the U.S. focused on clinical care and research Go to source Avoid smoking or using tobacco products. Avoid drinking excessive amounts of alcohol. Protect your lips from the sun using SPF. See you dentist for a check-up every six months."
    }
  ]
}