{
  "url": "https://www.wikihow.com/Take-a-Cold-Shower",
  "title": "How to Take a Cold Shower",
  "steps": [
    {
      "title": "Keep the shower water at about 60° Fahrenheit (15° celsius).",
      "content": "Keep the shower water at about 60° Fahrenheit (15° celsius). This is the ideal temperature to experience the health benefits of cold showers, which include increased circulation, boosted metabolism, improved immune system, and relief from depression symptoms. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source To put this in perspective, a typical shower is between 98° F (37° C) and 105° F (40° C), so a 60° F shower will definitely take some getting used to. If you’re having a hard time sticking out the colder temperature at first, don’t worry! We’ll go over tips to help you take a cold shower like a pro below."
    },
    {
      "title": "Start out slow with very short cold showers.",
      "content": "Start out slow with very short cold showers. You don’t need to take a super long cold shower to experience therapeutic benefits. In fact, standing under the cold water for just 30 seconds can have the desired effects. [2] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source When it comes to cold showers, a little bit goes a long way! Plus, if you do this on a regular basis, you’ll likely get more accustomed to the feeling, and it will get easier over time. When you get used to 30-second cold showers, try adding 10 extra seconds over the next several days, eventually working your way up to 3-6 minute sessions. [3] X Research source"
    },
    {
      "title": "Try alternating between cold and hot water.",
      "content": "Try alternating between cold and hot water. If you’re having a hard time taking a shower in consistently cold water, try alternating between hot and cold temperatures. This provides you some relief from the cold water, and it mimics the experience of a “contrast bath,” which many athletes use to recover after heavy training sessions. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Typical contrast bathing involves sitting in a tub of cold water for 1 minute, then a tub of hot water for 1-2 minutes, then repeating this process several times. [5] X Research source To adapt this for your shower, start by standing underneath the cold water for 1 minute, then turn on the hot water for about 2 minutes. Repeat a few more times, making sure to end with the cold water. Alternating between hot and cold temperatures increases blood flow and oxygenation, which is thought to promote healing and reduce swelling if you have an injury, or if you’ve just done an intense workout. [6] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Shower in hot water, then finish off with cold water.",
      "content": "Shower in hot water, then finish off with cold water. If you just don’t want to let go of your hot showers, don’t worry—you don’t have to! Start by showering under hot water as you normally would. While you scrub your body and wash your hair, keep the temperature warm and toasty. Then, when you’re all done, turn the shower handle until the water is ice cold, and stand under it for the last few seconds of your shower. [7] X Research source Try starting out with 30 seconds of cold water, then gradually increase the duration over the next several days. Your body will adapt over time, and eventually you’ll be able to finish your showers strong with 2-5 minutes of cold water. [8] X Research source"
    },
    {
      "title": "Go all-in and try a full-length cold shower.",
      "content": "Go all-in and try a full-length cold shower. Enduring a cold shower can be a mental game, and for some people, the best course of action is to jump in. If you’re this kind of person, try doing your normal shower routine from start to finish under cold water. This is definitely the most jarring and hardcore option, but after a minute or two under the cold water, your body should adjust to the temperature and become more comfortable! [9] X Research source"
    },
    {
      "title": "Improve circulation",
      "content": "Improve circulation When you step into a cold shower, the icy temperature shocks your body and puts it into survival mode. This stimulates your circulatory system and increases blood flow throughout your body, which is good for your overall health. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Increase metabolism",
      "content": "Increase metabolism When you’re exposed to super cold temperatures, your body starts to shiver, which burns a small amount of calories and boosts your metabolism. [11] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Research also shows that cold water may reduce insulin resistance and improve insulin sensitivity, which can have a protective effect against obesity, diabetes, and other metabolic diseases. [12] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Although cold showers may temporarily boost your metabolism, they shouldn’t be the only method you use if you’re trying to lose weight. They can be a good supplement to your routine, but you’ll also want to eat a balanced diet and exercise regularly to see results!"
    },
    {
      "title": "Boost immune system",
      "content": "Boost immune system Research suggests that taking cold showers may bolster your immune system and help you fight off illnesses and common colds. [13] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source In fact, one study found that the practice of taking cold showers led to a 29% decrease in people calling out sick from work, compared to the control group that did not take cold showers. [14] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Reduce inflammation, swelling, and pain",
      "content": "Reduce inflammation, swelling, and pain If you’ve ever twisted your ankle or bumped into something and gotten a bruise, you’ve probably used an ice pack to bring swelling down and relieve pain. Taking a cold shower can have a similar effect on your body. [15] X Research source The cold temperature reduces inflammation and soreness, which can result in quicker recovery times after a minor injury or a super intense workout. [16] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Reduce symptoms of depression",
      "content": "Reduce symptoms of depression Cold showers trigger the release of endorphins, which are chemicals that relieve stress and improve your mood. As a result, taking cold showers on a regular basis may have a positive effect on your mental health. In fact, in one clinical study, participants who took a 5 minute cold shower on a daily basis reported a decrease in their symptoms of depression. [17] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you’re dealing with depression, cold showers can be a great addition to your routine, but they shouldn’t be your only form of treatment. Make sure to keep taking any medications your doctor has prescribed to treat your depression. If you haven’t talked to a healthcare professional about your symptoms, seek out treatment with a licensed therapist or doctor. [18] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Cold showers are not suitable for people with certain health conditions.",
      "content": "Cold showers are not suitable for people with certain health conditions. Cold showers are generally considered safe for people who are in good health, but they can be risky for people with certain medical diagnoses. Because of this, it’s a good idea to talk to your doctor before trying it out. If you have cardiac issues, such as an arrhythmia or any type of heart disease, you should avoid cold showers altogether, since they put stress on your heart. [19] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You should also avoid cold showers if you’ve been diagnosed with cold urticaria, which is a condition in which your skin develops itchy welts (hives) when exposed to cold temperatures. [20] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you have Raynaud’s disease, which causes numbness and decreased blood flow to the fingers and toes as a result of cold temperatures, you should also avoid taking cold showers. [21] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Take slow, deep breaths to calm down during the shower.",
      "content": "Take slow, deep breaths to calm down during the shower. The cold water will probably make you take short, shallow breaths at first. Try to focus on drawing in a deep breath, then slowly letting it out while you’re under the cold water. [22] X Research source See if you can finish washing different parts of your body with just 1 or 2 deep breaths. You’ll probably be moving pretty quickly during your shower, so this is totally possible!"
    },
    {
      "title": "Listen to your favorite music to distract yourself.",
      "content": "Listen to your favorite music to distract yourself. Make a playlist of 2 or 3 of your favorite songs that inspire you. If you work out, the music you work out to is perfect to play during your shower to help you get through it. [23] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Try singing along or dancing a bit to your favorite music during your shower to further distract yourself from feeling cold. Just be careful not to slip when the shower floor gets wet and soapy."
    },
    {
      "title": "Tell yourself you love cold showers to change your attitude.",
      "content": "Tell yourself you love cold showers to change your attitude. Repeat to yourself, “I love cold showers. Nothing can stop me today after this!” Telling yourself these positive phrases will help you feel motivated about your shower. [24] X Research source Try saying this to yourself in the mirror as well. It’s amazing what positive self-talk can do to improve your attitude."
    },
    {
      "title": "Visualize you’re somewhere beautiful to help relax yourself.",
      "content": "Visualize you’re somewhere beautiful to help relax yourself. Close your eyes and imagine that you’re under a beautiful forest waterfall during your shower. In your mind’s eye, you can look out under the water and see the rushing river before you, flowing between the trees of a beautiful green forest. [25] X Research source If you’re more of a beach person, visualize that you’re under a waterfall near your favorite beach instead. Imagine the ocean waves rolling in toward you as you clean yourself with the pure, cool water. Continue using whatever combinations of these calming techniques work to help you enjoy your cold showers more."
    }
  ]
}