{
  "url": "https://www.wikihow.com/Wisest-Wizard",
  "title": "How to Play the Wisest Wizard Drinking Game with Friends",
  "steps": [
    {
      "title": "Crack open a can of beer to start the game.",
      "content": "Crack open a can of beer to start the game. Make sure you have a few cases of beer to start playing with a large group of friends. Every person starts as a “Level 1 Wizard in Training” when they open their first can. [1] X Research source While Wisest Wizard is normally played as a drinking game, you can try a sober version by using soda or sparkling water instead."
    },
    {
      "title": "Tape a new beer on top of the previous can when you finish it.",
      "content": "Tape a new beer on top of the previous can when you finish it. As soon as your first beer is empty, set a fresh can on top of the first and wrap a strip of duct tape around them to start forming your wizard staff. Adding another can to your staff is called “leveling up” and the number of cans determines your “level.” [2] X Research source Try to line the cans up perfectly when you stack and tape them so your wizard staff is easier to hold and maneuver. As you finish drinks and add more cans to your wizard staff, it becomes more difficult to handle and drink because of its length."
    },
    {
      "title": "Take a shot to fight a boss after every 3 or 5 levels.",
      "content": "Take a shot to fight a boss after every 3 or 5 levels. To fight a boss, just pour yourself a shot of liquor. You must finish the shot and defeat the boss before you can start drinking another beer or level up. Name the bosses after the type of liquor you’re drinking. If you have Jose Cuervo, then you may call it “Boss Jose” or “Boss Cuervo” during the game."
    },
    {
      "title": "Earn Wizard status when your staff is as tall as you.",
      "content": "Earn Wizard status when your staff is as tall as you. As you keep building your staff, set it down on the floor and compare its height to yours. If you’re the same height as your staff, then you can call yourself a Master Wizard instead of a Wizard in Training. [3] X Research source"
    },
    {
      "title": "Win the game if you have the longest wizard staff at the end of the night.",
      "content": "Win the game if you have the longest wizard staff at the end of the night. When you run out of beers or when you just want to call it a night, check which person has the tallest staff. That person becomes the true Wisest Wizard and wins! [4] X Research source Alternatively, set a time limit for the game and whoever has the longest staff when time is up wins."
    },
    {
      "title": "Play White Wizard to battle other players with your staff.",
      "content": "Play White Wizard to battle other players with your staff. When 2 players both have reached level 10 and finished their drink, they become White Wizards. Find a large open space outdoors where you can swing the staves around without hitting anything. Whoever breaks the other person’s staff first is the winner. [5] X Research source The player with the broken staff gets demoted back to the level based on the longest piece of their staff. If there are 5 cans still attached together, then the player drops down to level 5."
    },
    {
      "title": "Add a penalty if someone uses the word “drunk.”",
      "content": "Add a penalty if someone uses the word “drunk.” Rather than using the word “drunk” or “intoxicated,” tell others that you’re “feeling wise” instead. If a person uses the word “drunk,” make them take a sip from their drink for slipping up. Additionally, instead of saying you need another drink, say the phrase “I need to level up.”"
    },
    {
      "title": "Play other drinking games to add levels to your staff.",
      "content": "Play other drinking games to add levels to your staff. Many people like to play beer pong , or “Wizards Chess,” to have extra fun during Wisest Wizard. Play the game with the standard rules, and whoever wins gets to add 2 empty cans to their staff without having to drink them."
    },
    {
      "title": "Create custom rules if you have the longest staff and level up.",
      "content": "Create custom rules if you have the longest staff and level up. If you have the longest staff after you level up, then create a funny rule that all the other players have to follow until you finish your next drink or until someone else has a longer wizard staff than you. Some example rules are: Taking a sip if you say a specific word Choosing a player to drink any time you drink Taking a sip if you’re the last person to touch the floor"
    }
  ]
}