{
  "url": "https://www.wikihow.com/Survive-a-Flood",
  "title": "How to Survive a Flood",
  "steps": [
    {
      "title": "Identify where to go during an evacuation.",
      "content": "Identify where to go during an evacuation. Sit down with your family to establish a plan of action. Pick several meeting spots in case you need to leave home, such as a friend’s home in a safe town or a shelter in your area. Make sure everyone in the family knows where these locations are and how to get there. Make sure the shelters and the routes to them are through high ground. [1] X Research source Call your local Red Cross chapter, emergency management office, or planning and zoning department. These coordinators will have designated shelters, such as schools or stadiums."
    },
    {
      "title": "Create a family communications plan.",
      "content": "Create a family communications plan. Print out blank plans on fema.gov. Write down contact information, neighborhood meeting spots, and personal identification details. It’ll make everyone easier to find in case of an emergency. It’s better to text during the flood. Texts have a better chance of getting through and don’t tie up lines needed for emergencies. [2] X Trustworthy Source Federal Emergency Management Agency Federal agency responsible for coordinating responses to disasters and states of emergency Go to source"
    },
    {
      "title": "Assemble an emergency supplies kit.",
      "content": "Assemble an emergency supplies kit. Ready a kit that includes basic necessities. A good kit will have enough food and water for everyone for at least three days. Pack at least three gallons of water per person so everyone can drink a gallon a day. Bring a week’s worth of any special medications your family needs and a first aid kit. Pack at least one clothing change for each person. Include warm clothing and waterproof gear. [3] X Research source Remember to check your food supplies every year. Replace expiring food. Bring personal identification documents such as passports, driver’s licenses, birth certificates, and bank account numbers. Also pack some extra cash. Store these in a waterproof container. Think of what you and your family will need to complete your kit. You may include items like a can opener, duct tape, pet supplies, baby supplies, and sanitary items."
    },
    {
      "title": "Evacuate dangerous areas immediately.",
      "content": "Evacuate dangerous areas immediately. You may have only a short time to escape. Act quickly, utilizing your planned route. Head to designated shelters during flood warnings. When emergency services tell you to leave, listen to their instructions. Some people think they can ride out the storm, but keep yourself safe by taking proper precautions. Leave everything behind. Don’t stop to move valuables. Grab your emergency kit and go. Always follow the instructions given by your local emergency management officials."
    },
    {
      "title": "Move to higher ground away from water.",
      "content": "Move to higher ground away from water. Whether you are on foot or have to abandon your car, higher ground is your best option. Get away from areas with storm drains, streams, creeks, or rivers. If you’re stuck at home, head for the roof if you can do so safely. [4] X Research source . If you are in a mid- or high-rise, climb up to a high floor in the building using the stairs. Do not use the elevator, and keep yourself posted with your cell phone or a weather radio."
    },
    {
      "title": "Avoid crossing through water.",
      "content": "Avoid crossing through water. Water up to your ankles is enough to be dangerous. You cannot see how deep the water is the rest of the way. Six inches (15.24 cm) of water is enough to reach the bottom of cars and cause stalling. 12 inches (30.48 cm) will float away most vehicles. Never try crossing standing water. [5] X Research source Keep in mind the motto, “Turn around, don’t drown.” When you’re in doubt about the water depth, don’t risk it. Children and pets should always be kept out of the water. It can get very deep or fast, and it’s difficult for even adults to escape once caught in it. The water also will be very dirty. If you have to go through water, bring a stick. Use it to measure the water’s depth and feel for stable ground. [6] X Research source"
    },
    {
      "title": "Stay out of moving water.",
      "content": "Stay out of moving water. Moving water is never safe to approach. The current is usually stronger than it appears and even a slight current is strong enough to carry off adults and vehicles. Most flood deaths come from people trying to drive through water. Don’t risk it. [7] X Research source . Don’t drive around barricades. They’re there for your safety. If your car does get stuck in water, open the windows, breaking them if you have to. Once water enters the car, you’ll be able to open the door and escape. [8] X Research source"
    },
    {
      "title": "Swim backwards to survive moving water.",
      "content": "Swim backwards to survive moving water. Turn over on your back instead of fighting the tide. Keep your feet positioned upstream, using them to push away from obstacles floating with you. Try to find something to hold onto, such as a strong branch or roof. Once you do this, point your feet downstream and yell for help. [9] X Research source Never go under debris. Keep your head above water and avoid the debris or pass over it. Yelling for help makes it easier for rescuers to spot you. Wave an arm if you have the strength. Don’t give up until someone comes for you."
    },
    {
      "title": "Insure your house against flooding.",
      "content": "Insure your house against flooding. Flood insurance can save you a lot of hassle if your home or business is damaged. Check with your insurance company for policy details. If you are in a high-risk area for floods, you should be insured. People in other areas may choose flood insurance to protect against water damage. [10] X Research source"
    },
    {
      "title": "Barricade your home against floodwater.",
      "content": "Barricade your home against floodwater. Sealing your basement makes it more resistant to water. Fill in cracks and spread sealant over the walls. Keep the gutters on your house clean, too. Levees and floodwalls may also be built to help hold back floodwater. [11] X Research source Install a sump pump. When the pump senses water on the floor, it pumps it out of your home. Make sure the pump drains properly and maintain its battery-powered backup with fresh batteries."
    },
    {
      "title": "Reduce flood damage to utilities and valuables.",
      "content": "Reduce flood damage to utilities and valuables. Raise up your furnace, water heater, and electric panels. They should be installed on top of blocks or set higher in the wall than normal. This will better prevent them from getting wet. Before a flood occurs, store all valuables, such as expensive rugs, appliances, and important documents, on a higher floor in your home. [12] X Research source Disconnect your utilities when there’s potential for a flood. Shut off the main valves and breakers. Unplug all electrical appliances unless you are standing in water. [13] X Research source Take care of valuables before flooding begins. You may not have time to do this once the water starts rising."
    },
    {
      "title": "Listen to the news for flood risk warnings.",
      "content": "Listen to the news for flood risk warnings. Flooding information can be found on your local news or weather station’s TV channel or website. Tune in to monitor changes in the weather. Also, listen to local radio stations for periodic updates. [14] X Research source A flood watch means that flooding may happen in your area. A flood warning means flooding is happening or will occur soon."
    },
    {
      "title": "Watch known flood areas.",
      "content": "Watch known flood areas. Keep an eye on dangerous areas such as drainage channels, canyons, and streams. These tend to overflow quickly in flash floods and are very dangerous. Stay far away from them and recognize any that are near you. They may cause flooding before there are any news reports. [15] X Research source"
    },
    {
      "title": "Monitor the local water conditions if you get advanced warning of possible flooding rain.",
      "content": "Monitor the local water conditions if you get advanced warning of possible flooding rain. You can view this at the Storm Prediction Center (SPC) website. You can access this here ."
    },
    {
      "title": "Listen to the authorities for directions.",
      "content": "Listen to the authorities for directions. If you are evacuated, don’t attempt to go home until the authorities say it’s safe to do so. Floodwaters can persist for some time even after the immediate threat is gone. In addition, listen for the authorities to say that water from the community water supply is safe to drink. [16] X Research source Stay tuned to news sources on the radio, TV, and online."
    },
    {
      "title": "Watch out for damaged areas.",
      "content": "Watch out for damaged areas. Roads and other paths will have been eroded. Stay off of bridges. The soil under usual routes will be muddy and less able to support the weight of vehicles. Find alternate routes over high ground or wait for the authorities to indicate which roads are safe. [17] X Research source Buildings that were hit by floodwaters are also dangerous. They may have unseen damage and collapse on you. Stay away from them."
    },
    {
      "title": "Avoid downed electrical lines and flooded areas.",
      "content": "Avoid downed electrical lines and flooded areas. Assume any downed power lines or electrical wires are live. Don’t approach them. Assume any floodwater you see is also dangerous. Stillwater may be contaminated with gas, oil, and sewage. They may also have become electrified. [18] X Research source Don’t try to enter buildings surrounded by floodwater."
    },
    {
      "title": "Turn off all electrical and gas lines.",
      "content": "Turn off all electrical and gas lines. Your home may have suffered structural damage, including wet electrical wires and gas leaks. Don’t depend on standard power sources. Instead, inspect your home for damage using a flashlight. When possible, have a professional repair the damage. [19] X Research source If you smell gas or hear hissing, get away from your home immediately. Don’t use candles or lanterns until you’re certain the gas lines are secure."
    },
    {
      "title": "Use a stick to check for snakes.",
      "content": "Use a stick to check for snakes. Dangerous animals may have washed into your home or taken shelter there. Overturn hidden areas with a stick or pole as you search for damage. The last thing you need is to have a pet or family member bitten by a snake. Have an animal control specialist come help remove them. [20] X Research source"
    },
    {
      "title": "Take pictures of your home for insurance purposes.",
      "content": "Take pictures of your home for insurance purposes. This may be the last thing you think of, but it’s important to document the damage. Get movies or pictures of your entire house. Use a disposable camera if you have to so you can get accurate pictures of the damage. Continue capturing the necessary documentation as you clean. Contact your insurance agent for more information. Doing this will make insurance claims, disaster assistance applications, and income tax deductions much easier to complete down the road."
    },
    {
      "title": "Make repairs to your home.",
      "content": "Make repairs to your home. Your house may be unsafe to occupy. A sump pump, wet-dry shop vacuum, or water pump will remove standing water. Have a professional check your home for structural damage. Get someone to repair leaks in the septic system and gas supply before going back into your home. Follow up with electrical repair work for damaged wiring. [21] X Research source Companies like Servpro specialize in flooding repairs and restoration."
    },
    {
      "title": "Clean your home.",
      "content": "Clean your home. Mud and water that washed into your home can contain sewage and dangerous chemicals. In addition, leftover water leads to mold. Open up all the door and windows. Scrub affected areas with hot water and a cleaner like a heavy-duty laundry or dish detergent. Follow up by disinfecting with a 10% bleach and water solution. Wash your hands after cleaning. [22] X Research source Fans are useful for blowing air out of your home or drying out hidden areas like corners."
    }
  ]
}