{
  "url": "https://www.wikihow.com/Treat-Botulism-in-a-Duck",
  "title": "How to Treat Botulism in a Duck",
  "steps": [
    {
      "title": "Watch for the symptoms.",
      "content": "Watch for the symptoms. Botulism poisons the duck, causing what's sometimes known as \"Limberneck Disease.\" It causes paralysis, starting with the duck having trouble taking off or going under the water. The duck's legs will be paralyzed, and you may see the duck trying to move only with its wings. The duck's eyelids and neck will droop. The paralysis may also be accompanied by diarrhea."
    },
    {
      "title": "Move the duck.",
      "content": "Move the duck. Once you realize a duck is sick, move it away from the area where it was infected. You should provide some basic shelter for the duck. Leaving the duck where it is means the duck will continue to be infected with the bacterium. You have to move it away from the source if it's going to recover. [1] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source However, not all ducks will recover. Only a duck that didn't get a lethal dose of the bacterium will be able to recover. [2] X Trustworthy Source State of Michigan Official website for the State of Michigan Go to source"
    },
    {
      "title": "Provide plenty of fresh water.",
      "content": "Provide plenty of fresh water. When you first notice the symptoms, it's important to provide fresh water for that duck. The water may help flush out the bacterium. If the duck won't drink, use a syringe to give the duck fresh water. [3] X Research source"
    },
    {
      "title": "Give an antitoxin.",
      "content": "Give an antitoxin. The two main antitoxins are Trivalent (A, B, E) Botulinum Antitoxin and Heptavalent (A, B, C, D, E, F, G) Botulinum Antitoxin. You can get the first from the CDC (your local office), and you will likely need to get the second through a vet, who will get it from the CDC. [4] X Research source The second is recommended for more types of botulism. [5] X Research source Ducks are most often affected by Type C Botulism, which generally doesn't cause problems for people, dogs, or cats. Sometimes, they are affected by Type E Botulism. [6] X Research source Generally, this treatment is not used. It's not very practical, as it must be given early on, when symptoms aren't as obvious."
    },
    {
      "title": "Treat wounds.",
      "content": "Treat wounds. Botulism can sometimes be caused by a wound that lets the bacterium into the blood. If your duck has wounds, you should have a vet look at them, as they may need to be treated surgically. [7] X Research source"
    },
    {
      "title": "Wait 2 days.",
      "content": "Wait 2 days. Most ducks who are going to recover from botulism will do so withing 2 days. If your duck makes it that long, it will likely be fine. [8] X Research source"
    },
    {
      "title": "Understand how botulism is produced.",
      "content": "Understand how botulism is produced. Often, ducks get botulism from living, drinking, and eating in stagnant water. The water grows the bacterium, and the ducks ingest it. Ducks can also get botulism from eating from eating small, dead invertebrates, as well as maggots that feed on the carcasses. Bad food and dying plant life can also give botulism to ducks. [9] X Research source"
    },
    {
      "title": "Control the fly population.",
      "content": "Control the fly population. Limiting flies limits the number of maggots in the area, which can carry the bacterium. Flies can spring up for a number of reasons, especially if the ducks are being raised around other livestock. [10] X Research source Control manure. Manure is one of the biggest fly attractions. Make sure to remove manure at least 2 times a week. It's also important to dry out manure, as the moisture attracts flies. To dry it out, spread it out thinly in a sunny area, and then scoop it up once it's dried. [11] X Research source Clean up spills quickly. Both feed spills and manure spills can attract flies. Clean them up to help keep flies at bay. [12] X Research source Avoid having drainage ditches with weeds. These murky areas can attract flies. [13] X Research source Introduce fly-eating species. For instance, a small form of wasp, the fly parasitoids, has young that eat the pupa of flies, and they don't bother humans. [14] X Research source"
    },
    {
      "title": "Remove carcasses.",
      "content": "Remove carcasses. If several ducks have died of botulism, it's important to remove the animals quickly. Other ducks can catch it from the dead animals, and it can infect the water even more. The best solution is to burn the animals or bury them away from other ducks."
    },
    {
      "title": "Remove dead fish.",
      "content": "Remove dead fish. Dead fish can cause some of the same problems as dead ducks. If dead fish are in a pond with the ducks, it's best to remove them if possible."
    },
    {
      "title": "Take care of shallow water.",
      "content": "Take care of shallow water. Shallow water tends to be stagnant, and in warm weather especially, it can breed botulism. It's best to either drain the water off or flood the area to avoid these shallow breeding grounds."
    }
  ]
}