{
  "url": "https://www.wikihow.com/Write-a-Business-Process-Document",
  "title": "How to Write a Business Process Document",
  "steps": [
    {
      "title": "Gather a knowledgeable team.",
      "content": "Gather a knowledgeable team. At the beginning and throughout the process document creation process, you will need to work with a team relevant to the process you are outlining. Make sure to involve the people who carry out the process and their immediate superiors, as well as any upper-level management who need to approve changes to the process as you go. Try using meetings or informal focus groups with these people at the beginning when modeling the process. This will ensure that you don't miss any crucial steps or parts of the process. [1] X Research source Another option is to bring in subject-matter experts from outside the business organization who can provide knowledgeable and unique input. [2] X Research source"
    },
    {
      "title": "Outline the specific process.",
      "content": "Outline the specific process. It's important to avoid writing the BPD for the entire organization in one shot. This is about compartmentalizing smaller processes so they can be put together to form the larger document. Narrow down your focus from major, business-wide processes to an individual activity handled by a small team. Then, cut up the activity into definable processes, or tasks, and focus on only one of those. [3] X Research source For many assignments, you will be writing several individual process documents. There should be one for each of the processes in a complex operation, but repeatable processes can have material duplicated from a singular document. As a general rule, it's better to make each document cover as small a process as possible. This makes the process, and the list of people who must understand it, as clear as can be."
    },
    {
      "title": "Focus on the scope of the process.",
      "content": "Focus on the scope of the process. Your process is outlined by the effect that it has on the business as a whole. So, to get started, you'll need to clearly define the desired outcome of the process. From there, identify the start and end points of the process. What exactly happens to start the process and what determines when the process has ended? From here you can begin to carve out the intermediate steps, their order, and who performs each one. [4] X Research source Be sure to describe the impact, positive and negative, that the process has on the organization. A typical scope: This process pertains to flight record-keeping. Unrelated records, such as the details of aviation maintenance or quality control checks, are not pertinent within the scope of this process."
    },
    {
      "title": "Name the business process descriptively.",
      "content": "Name the business process descriptively. The name of the business process being narrowed down should be clear enough that it encapsulates exactly what is being done. It should not be wordy, however. If naming conventions aren't clear, there could be confusion between one BPD and another that comprise a larger process. A poorly named business process would be Filing . A well named business process would be Flight record-keeping"
    },
    {
      "title": "Decide on an overall format.",
      "content": "Decide on an overall format. Your process document will need to follow a specific format so that the same format can be duplicated on other process documents. There are many formats used for business processes, and all depict their processes slightly differently. The one that you use will depend on what makes the most sense for your process. For example, one of the most well-defined and commonly-used forms of business process modeling is simply referred to as Business Process Modeling Notation (BPMN). This systems uses shaped \"flow objects\" to indicate specific types of tasks and \"connecting objects\" to show the relationships between them. In addition, \"swim lanes\" are used to show partitions in the process, like different departments responsible for parts of the process. This notation is used frequently and is therefore suited for collaboration and standardization across an organization. However, different process call for different modeling techniques. For example, Unified Modeling Language (UML) diagrams are more effective for modeling complex logic processes and are more suitable for software system modeling than BPMN. [5] X Research source"
    },
    {
      "title": "Sketch notes on the key components of the process being documented.",
      "content": "Sketch notes on the key components of the process being documented. Brainstorm about all the potential steps in the process, paying special attention, for the sake of clarity, to the descriptions of the tasks. Ensure the description of the process includes what the process will look like when successfully completed. For instance, the rudimentary notes for keeping track of flight records could be the following: Printing out the form XYZ Determine personnel responsible for filling out specific sections of form XYZ Create chain of custody for form XYZ Determine method for integration of form XYZ into filing system"
    },
    {
      "title": "Create a working draft of the process.",
      "content": "Create a working draft of the process. Work with your group to create a first draft of the process diagram, including each step, the order of the steps, and the relationships between them. Make sure that your draft can be seen by everyone and easily edited. This way, feedback can be obtained from anyone involved in the process, to ensure there are no missed steps. To achieve this, you can use sticky notes, a whiteboard, or collaborative software like Google Docs. [6] X Research source Regardless of the format you decided on, it may be beneficial to utilize typical flow diagrams symbols at this stage (e.g. squares are steps, diamonds are questions, ovals are start/end points)."
    },
    {
      "title": "Outline the technical tools for the process.",
      "content": "Outline the technical tools for the process. These items can include computers, software, technology, vehicles and even simple gear like a broom and dustpan. If appropriate, you can also include where that equipment is located, how to procure it, the potential cost related to the project, and where to return/store when the process is finished. Example: Upon completion of the flight, pilots shall utilize flight record computer system on airplane tablets to print out form XYZ."
    },
    {
      "title": "Construct a decision matrix.",
      "content": "Construct a decision matrix. A decision matrix should be a simple way to determine which decisions can be made, and which people are part of the decision-making process. The final step in some decision matrices is an executive-level endorsement or confirmation of a decision made at lower levels. [7] X Research source For instance, the decision matrix for maintenance could involve line leaders, shift leaders, multiple manager levels, up to even the plant manager."
    },
    {
      "title": "Write an introduction.",
      "content": "Write an introduction. A simple introduction to the document can explain background information as to why the process is important to the overall operation of the company. The target audience can be identified, as well as the overall scope of the work. This can also include a statement of what happens if this process is not completed, or completed poorly. If there is pertinent industry terminology pertinent to the process, there can be a section that covers abbreviations and terminology. [8] X Trustworthy Source Official UK government website Official website for the public sector of the UK government Go to source The introduction can be a simplified method for delivering the overall concept to new employees who may not be able to follow the entire BPD. A sample introduction could start similar to the following: This introduction provides pertinent background data and justification for improving the flight record-keeping within Blackhawk Inc. At Blackhawk Inc, improvement of the flight record-keeping is mandatory, and this process will ensure standardization."
    },
    {
      "title": "Outline your document with consistent notation and symbols.",
      "content": "Outline your document with consistent notation and symbols. Using whatever notes and outlines you have, write a step-by-step guide to how the process is completed. This is the meat of the BPD. When constructing your process model, be sure to adhere to whatever format you have chosen clearly and consistently throughout the model. At this stage, the model should be created using process modeling software or another type of software so that a polished final product can be created. [9] X Research source"
    },
    {
      "title": "Assign the roles related to specific processes.",
      "content": "Assign the roles related to specific processes. The decision-makers are people directly responsible, those who are involved in checking quality control, and even those who provide the final approval. During the role identification process, it's entirely possible unassigned roles may be discovered. Resolve any conflicts when there are multiple people with redundant or conflicting roles. If possible, identify the amount of time each process requires. [10] X Research source www.cio.ca.gov/opd/pdf/itla/21/BPM-Guide.docx A potential breakdown could be as follows: Pilots shall fill out post-flight form XYZ, and note any irregularities (00:30). Pilots shall place form XYZ in the maintenance inbox, signing the check-in form (00:05). Maintenance shall sign-off form XYZ when all irregularities are inspected and corrected. Maintenance shall turn over form XYZ to flight record clerical staff for proper filing (00:05)."
    },
    {
      "title": "Link job titles to roles.",
      "content": "Link job titles to roles. Identify the individuals who will be involved in each of the processes. Define each worker's individual role. Rather than specific named individuals, it's better to identify job titles for this. Excluding specific names ensures the document remains relevant when an employee moves on from the company, and re-emphasizes the process over the person. [11] X Research source www.cio.ca.gov/opd/pdf/itla/21/BPM-Guide.docx An improper linkage: Mr. Johnson in Office 123 will separate and file documents. A proper linkage: Flight record clerical staff will separate and file documents."
    },
    {
      "title": "Add an exceptions and emergencies management section.",
      "content": "Add an exceptions and emergencies management section. There needs to be a basic guideline for how to complete the process when unexpected factors come into play. This section should also explain which people are permitted to request changes, those who can permit the changes, and who will ultimately implement whatever change is approved. [12] X Research source Multi-national businesses should focus on the exception process, including caveats for language and legal issues unique to the region. If changes are approved on a wide-scale, include whatever suggestion form is being used to accept changes. Example: When pilot tempo does not permit timely completion of form XYZ, co-pilots can fill out the form."
    },
    {
      "title": "Test your model.",
      "content": "Test your model. When you've completed your business process document, you'll need to check to see that you've accurately depicted every possible eventuality and gotten the sequence of actions right. To test it, have your team use the model to carry out a demonstration of the business process under a variety of real-life conditions. Doing so will help you weed out inaccuracies, endless loops, or missing pieces in your model. [13] X Research source"
    }
  ]
}