{
  "url": "https://www.wikihow.com/Use-Lemon-Grass",
  "title": "How to Use Lemon Grass",
  "steps": [
    {
      "title": "Keep pieces small for eating and larger for flavoring.",
      "content": "Keep pieces small for eating and larger for flavoring. Use the entire stalk, which will be cut and prepped in different ways depending on the dish. The tough, bigger pieces of lemon grass are meant to flavor dishes. These larger pieces generally are not eaten. Consider straining large pieces out before serving. However, some people enjoy sucking on them for their flavor."
    },
    {
      "title": "Discard the dry, outermost stalks and cut off the top third of the inner stalks.",
      "content": "Discard the dry, outermost stalks and cut off the top third of the inner stalks. [1] X Research source"
    },
    {
      "title": "Trim each root tip until the purple rings are visible.",
      "content": "Trim each root tip until the purple rings are visible. [2] X Research source"
    },
    {
      "title": "Keep fresh lemon grass in the refrigerator for up to 3 weeks.",
      "content": "Keep fresh lemon grass in the refrigerator for up to 3 weeks. Store it in a plastic bag that's securely sealed. You can freeze lemon grass for as long as 6 months."
    },
    {
      "title": "Pair lemon grass with other spices and ingredients to add exotic flavor to recipes.",
      "content": "Pair lemon grass with other spices and ingredients to add exotic flavor to recipes. Lemon grass is often coupled with coconut milk , chiles, cilantro, and garlic."
    },
    {
      "title": "Bruise the bulb by smashing it with the side of a wide knife or cleaver, then mince the bulb for use in a variety of recipes.",
      "content": "Bruise the bulb by smashing it with the side of a wide knife or cleaver, then mince the bulb for use in a variety of recipes. Bruising will free the aromatic oils for cooking. [3] X Research source"
    },
    {
      "title": "Add very thin slices of lemon grass to salads.",
      "content": "Add very thin slices of lemon grass to salads. Slicing thinly breaks the stalk's tough fibers so that the pieces can be chewed and swallowed with ease. [4] X Research source"
    },
    {
      "title": "Cut the bulb diagonally in rounds measuring about 1/4 inch (.5 cm) long.",
      "content": "Cut the bulb diagonally in rounds measuring about 1/4 inch (.5 cm) long. Add the rounds to stir fries."
    },
    {
      "title": "Slice the stalk at an angle to create sections approximately 1 inch (2.5 cm) in length.",
      "content": "Slice the stalk at an angle to create sections approximately 1 inch (2.5 cm) in length. Bruise the pieces and toss them into simmered recipes such as soups."
    },
    {
      "title": "Make a paste by pounding thin slices of lemon grass.",
      "content": "Make a paste by pounding thin slices of lemon grass. Add the paste to curry dishes and other recipes."
    },
    {
      "title": "Flavor vodka with lemon grass.",
      "content": "Flavor vodka with lemon grass. Clean and bruise a lemon grass stalk. Steep the stalk for 3 to 4 days in a nearly full bottle of vodka. Shake the bottle occasionally. Take out the stalk after steeping."
    },
    {
      "title": "Make tea with lemon grass by steeping pieces in hot water.",
      "content": "Make tea with lemon grass by steeping pieces in hot water. [5] X Research source"
    }
  ]
}