{
  "url": "https://www.wikihow.com/Use-a-Magic-Eraser",
  "title": "How to Use a Magic Eraser",
  "steps": [
    {
      "title": "Perform a spot test before you use the magic eraser on a surface.",
      "content": "Perform a spot test before you use the magic eraser on a surface. The sandpaper-like surface of a magic eraser can damage the finish on some surfaces, like varnished wood or glossy paint. Wet the magic eraser, then test it on a small spot before you start your project to make sure it won’t leave any damage. [2] X Research source"
    },
    {
      "title": "Wet the magic eraser when you’re ready to use it.",
      "content": "Wet the magic eraser when you’re ready to use it. Magic erasers can actually be used dry, but adding a little water to the sponge will help it absorb dirt more easily, much like wetting a towel before wiping down counters. [3] X Research source After you wet the eraser, squeeze out any excess water, just like you would with a regular sponge."
    },
    {
      "title": "Wipe down the surface you want to clean.",
      "content": "Wipe down the surface you want to clean. For most dirt and grime, you’ll see a noticeable difference just by wiping the sponge across the surface. However, you might have to scrub stubborn stains like rust or mildew. [4] X Research source"
    },
    {
      "title": "Use a magic eraser to make shoes look like new.",
      "content": "Use a magic eraser to make shoes look like new. It can be hard to remove scuff marks and other stains from shoes, but a magic eraser can remove signs of wear from your favorite sneakers. Gently buff materials like suede with the sponge, then wipe down the rubber around the soles. [5] X Research source"
    },
    {
      "title": "Clean your refrigerator",
      "content": "Clean your refrigerator inside and out with a magic eraser. Magic erasers are great at removing the grimy fingerprints that build up on the outside of your fridge, as well as food spills, mildew, and other stains that can accumulate over time. [6] X Research source Try using a small piece of magic eraser on the gasket around your refrigerator door to see a surprising difference!"
    },
    {
      "title": "Remove paint or nail polish stains once they’ve dried.",
      "content": "Remove paint or nail polish stains once they’ve dried. Dried paint and nail polish can be really stubborn, but a little scrubbing with a magic eraser will usually remove them completely. This is especially effective for paint that has dripped on hard floors and hinges. A magic eraser is a great way to remove nail polish stains from surfaces that might be discolored by nail polish remover, like carpet or linoleum."
    },
    {
      "title": "Clean up wall art left by kids around the house.",
      "content": "Clean up wall art left by kids around the house. If your little artists have drawn with crayons or markers all over your walls, use a magic eraser to wipe them away. Just remember to do a spot test, since the sponge may dull the glossy finish on some paints. [7] X Research source Magic erasers can even remove permanent marker stains! Just scrub a little extra until it's gone."
    },
    {
      "title": "Scrub away dried-on food from your stove or microwave.",
      "content": "Scrub away dried-on food from your stove or microwave. Once food splatters have dried on your stovetop or inside your microwave, they can seem impossible to clean, but if you scrub them with a magic eraser, your cooking surfaces will seem like new again. Use a magic eraser to clean the drip trays under your burners to get your stovetop looking like new again!"
    },
    {
      "title": "Remove mildew",
      "content": "Remove mildew , mineral buildup, and soap scum from your bathroom. Whether you’re tackling a stubborn ring around the toilet or a residue you can’t seem to clean from your shower walls, using a magic eraser in the bathroom will make everything sparkling clean, without the harsh chemicals used in most other cleaning products."
    }
  ]
}