{
  "url": "https://www.wikihow.com/Stop-Stressing-over-Exam-Results",
  "title": "How to Stop Stressing over Exam Results",
  "steps": [
    {
      "title": "Spend a quiet moment alone.",
      "content": "Spend a quiet moment alone. After you finish taking the test, do not immediately talk to your friends about the test. Instead, take a quiet walk--outside if possible. Calm down and breathe deeply. Remember that you did the best you could in the present circumstances. For example, say to yourself: I prepared as well as I could with the time and resources I had. I demonstrated the knowledge I hold in the present moment. I am proud of my work."
    },
    {
      "title": "Do not compare answers.",
      "content": "Do not compare answers. After you finish taking the test, do not ask your friends what their answers were. They could be wrong or right so comparison is not helpful. Additionally, you might stress over not matching their answers but be right all along. [1] X Trustworthy Source Mind U.K.-based mental health charity focused on providing advice and resources to anyone facing mental health problems. Go to source Instead, congratulate yourself for the things you did well and learn from the areas where you think you could have done better. [2] X Research source"
    },
    {
      "title": "Visit a good friend.",
      "content": "Visit a good friend. After an exam, it is nice to meet with a friend, preferably not one who has taken the exam. Your friend can help support you and reduce your stress. You also can do a fun activity together that can take your mind off the test. [3] X Research source When meeting your friend, agree to only discuss the exam for five minutes or not at all. It is important for you to release your stress rather than dwelling on the exam. [4] X Research source"
    },
    {
      "title": "Avoid ruminating about your performance.",
      "content": "Avoid ruminating about your performance. Rumination means that you keep replaying or obsessing about negative situations. Unfortunately, rumination can lead to depression and anxiety. [5] X Research source If you are ruminating about your performance, try the following steps: Identify your fear. What scares you? Are you afraid of failing the test? Are you afraid your performance will impact your college entrance possibilities? Journalling can help you pinpoint your fear. Ponder the worst-case scenario. Can you handle failing? Usually the answer is yes. Realizing you could handle the worst-case scenario removes the power from your initial worry. Realize what you cannot control. You cannot control your results. Stop trying. Turn mistakes into learning moments. Maybe you did not write your essay well. What can you do to improve? If you're in university, visit the writing center. Additionally, you could check out books on how to write essays. You also could ask your teacher for feedback. Practice mindfulness. Try to keep your mind in the present. Look around you while you walk (versus at your smartphone). Breathe in the scents. Try therapy. If you find yourself ruminating without stop, see a counselor. Counselors can help you learn additional strategies to stop rumination."
    },
    {
      "title": "Reward yourself for your hard work.",
      "content": "Reward yourself for your hard work. After the exam, do something you enjoy. This will help take your mind off the exam. Visit a favorite cafe or shop. Alternatively, you could take a relaxing walk or buy yourself a treat. You also take a soothing bath or read a non-academic book."
    },
    {
      "title": "For parents:",
      "content": "For parents: Avoid discussing the results: Discussions about the marks you expect your child to score can increase your worries, stress and anxiety levels. It can also make your child feel that you will love and value him only if he meets your expectations. Don’t have unrealistic expectations and don’t be over-excited: Although your child may be good in studies, the fact is, not every child can be a topper. So, don’t get over-excited by expecting your child to be among the toppers. It is okay if your child secures good marks, as academics is one of the many facets of life. Stop worrying about social norms and expectations: Your child’s exam results do not define your social status or standing in the society. So, don’t fret and worry about what your friends and relatives will say if your child doesn’t score well. Don’t indulge in comparison: Don’t compare your child with his peers, or his own achievements of the current year with previous performances to come to a conclusion about the marks he may obtain."
    },
    {
      "title": "For students:",
      "content": "For students: Engage in conversation while waiting for the results: Post-exam discussions and thinking about how you answered the questions can dent your confidence and cause you to worry. In such a situation, instead of keeping your fears to yourself, try to speak with family members or friends about how you are feeling. Don’t be embarrassed to tell them the causes of your distress. In case you don’t feel comfortable revealing your feelings to others, you can seek help from numerous online resources. The day prior to the announcement of the results: Stress levels are highest on the day before, and the few hours prior to the announcement of results. During this period, avoid taking stimulants like coffee or energy drinks, which can increase the stress level. Also, try to stay away from social media and other sites where there is a lot of excited discussion about results, as reading what others say may sometimes perturb you. Read your favourite book, watch a movie, go for a walk or engage in some physical activity to take your mind off the results and relax. If things don’t go as planned: ‘DO NOT PANIC’. Scoring low marks is not the end of the world. You can appear in exams again the next year and achieve a better result. Speak to your parents and teachers, or those you confide in, and find out what you should do next. There are many famous achievers who didn’t succeed in their first attempt, but that did not dishearten them. They kept trying until they succeeded. So, motivate yourself and pull up your socks for a better result the next time."
    },
    {
      "title": "Exercise.",
      "content": "Exercise. Take a brisk walk or jog. Consider swimming. Exercising is not only helpful for your physical health; it also can reduce stress. Doing some form of low to moderate intensity exercise can reduce fatigue, improve alertness and concentration, and enhance overall cognitive function. This is very helpful after an exam when stress has depleted your energy. As few as five minutes of aerobic exercise can stimulate anti-anxiety effects. [6] X Research source When stress affects the brain, with its plentiful nerve connections, the rest of your body feels the impact. If your body feels better, your mind will as well. Physical activity produces endorphins, chemicals in your brain that act as natural painkillers. Exercise also helps you sleep. [7] X Research source"
    },
    {
      "title": "Consider getting a massage.",
      "content": "Consider getting a massage. After an exam, it is very possible that your back and neck will be sore from studying so much. Getting a massage can relax your muscles, calm your mind, and also produce endorphins. You can visit a massage therapist or ask a friend to give you a back rub. Acupuncture is another option for relieving stress and producing endorphins. [8] X Research source"
    },
    {
      "title": "Eat a healthy, balanced meal.",
      "content": "Eat a healthy, balanced meal. After a stressful exam, you might be tempted to celebrate with pizza or ice cream. Unfortunately, high-fat foods will make you feel tired and less able to cope with stress. Plus, because stress can increase your blood pressure and raise cholesterol levels, high-fat foods will make your body feel worse. To prevent stress, your body needs a balanced, healthy meal. Low-fat meals with high fiber, rich carbohydrates, and many fruits and vegetables are best. They will calm you and supply nutrients to strengthen your immune system. [9] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Good food choices would be: [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source High-fiber, carbohydrate-rich foods. Carbohydrates cause your brain to produce more serotonin, a hormone that relaxes you. Consider baked sweet potatoes, minestrone soup, or sautéed vegetables over rice. Sushi also is a fun, healthy option. [11] X Research source Fruits and vegetables. High stress can weaken your immune system. Have you ever noticed that you get sick around exam time? Stress could be a factor. By increasing your consumption of antioxidant-rich fruits and vegetables, you can boost your immune system. Healthy choices are acorn squash and carrots or citrus fruits. [12] X Research source"
    },
    {
      "title": "Recognize stress symptoms.",
      "content": "Recognize stress symptoms. Sometimes, despite trying your hardest to stay relaxed, you might still feel stressed about your results. If this is the case, talk to a trusted adult or counselor about your feelings. Ask about ways to reduce your negative feelings and stress. [13] X Research source Symptoms of stress include: Sleeplessness Fatigue Forgetfulness Unexplained aches and pains Poor appetite Loss of interest in activities Increased anxiety and irritability Increased heart rate Migraines or headaches Blurred vision Dizziness"
    },
    {
      "title": "Remind yourself of your positive qualities.",
      "content": "Remind yourself of your positive qualities. Our brain has a negative bias. This means it tends to have greater activity when we are thinking about negative things. Depressing thoughts can impact our mood more than positive thoughts. [14] X Research source To prevent negative thinking, make a list of all the things you like about yourself. What do you do well? What do you enjoy? How are you a nice person? By considering the positive things about you, you will begin to feel better."
    },
    {
      "title": "Receive your results.",
      "content": "Receive your results. When you receive your results, take deep breaths. If you did as well as you wanted, celebrate. If you feel you could have done better, there are many ways to improve. Remember, your test results do not define who you are or how valuable you are as a person. They are a marker of one day’s performance in your life. Stay calm. Remember that while your exam results are important, you always have additional options. You might be able to retake the exam. If the exam is part of a class, there might be other tests or papers that contribute to your grade. Putting your test in perspective can help you relax."
    },
    {
      "title": "Prepare for future exams.",
      "content": "Prepare for future exams. If you performed well, repeat the same study techniques for your next exam. If you did not score as well as you hoped, be proactive for the next exam. First, think about how you prepared for this exam and what you could do differently. Consider the following alternatives: Talk with your instructor. Ask him or her what you could do better next time. Your teacher will have insight into your strengths and weaknesses. Hire a tutor. If you need to take this or a similar exam again, consider getting professional help. Having personalized attention can improve your confidence and help you learn more quickly. Start a study group. If there are other people taking this exam again, consider studying together. Pool your study books and flashcards. Quiz one another. Having peer support can make you feel less overwhelmed. Ask a parent or friend to help you study. If you need a study partner to quiz you, ask a parent or friend to help. They can do flashcards with you or ask you to explain essay answers."
    }
  ]
}