{
  "url": "https://www.wikihow.com/Treat-Ringworm",
  "title": "How to Treat Ringworm",
  "steps": [
    {
      "title": "Apply an antifungal cream or lotion.",
      "content": "Apply an antifungal cream or lotion. If you have a mild case of ringworm, you can use an antifungal cream on the infection. This may help relieve symptoms and clear the ringworm. [2] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Creams or lotions such as clotrimazole or terbinafine can help treat your ringworm. Apply the cream or lotion as indicated on the packaging or by your doctor. Usually you need to treat the area for 2–3 weeks. You can purchase antifungal creams at most pharmacies and some grocery stores or larger retailers."
    },
    {
      "title": "Dab diluted apple cider vinegar on ringworm infected skin area.",
      "content": "Dab diluted apple cider vinegar on ringworm infected skin area. Apple cider vinegar is another food with antimicrobial properties that may kill some fungi. Dabbing apple cider vinegar onto your ringworm for a few days may remove it from your skin, but its ability to fully treat ringworm is unproven and needs more research. [3] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Mix equal parts water and apple cider vinegar, then moisten a cotton ball or pad with the mixture and dab it directly on to the affected area. Never use pure, undiluted vinegar on ringworm. Apply the apple cider vinegar 2–3 times per day for 1–3 days. Stop immediately and see your doctor if the ringworm gets worse, more irritated, inflamed, or develops an open sore."
    },
    {
      "title": "Use diluted lavender or tea tree oils.",
      "content": "Use diluted lavender or tea tree oils. Tea tree and lavender oils both have powerful antifungal properties. Applying either of these oils may stop fungi from developing and kill ringworm completely, although more clinical study is needed to confirm their efficacy against ringworm specifically. Tea tree oil may be the best home remedy option available. [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source However, there is growing interest in lavender oil as an antifungal agent as well. [5] X Research source Mix a few drops of tea tree oil or lavender oil with coconut oil. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Use the diluted solution twice daily on the affected area. It can take up to 4 weeks for tea tree or lavender oil to heal ringworm. Do not pure pure or undiluted essential oils directly on your skin as they can be irritating or make your ringworm worse."
    },
    {
      "title": "Practice good hygiene.",
      "content": "Practice good hygiene. Good hygiene is integral to preventing ringworm and treating it. From washing your hands to only using your own personal items, simple measures of good hygiene can help you heal this fungal infection, keep it from spreading to others, and may help keep you from being re-infected. [7] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Basic good hygiene to prevent ringworm or keep it from getting worse includes changing your clothes (including socks and underwear) every day, washing your bedding regularly, washing your hands after touching or treating your ringworm, keeping your hygiene items to yourself, and showering soon after sweating or exercising."
    },
    {
      "title": "Keep yourself clean.",
      "content": "Keep yourself clean. Ringworm comes from a parasite that feeds on skin cells on the outer layer of your skin. By showering daily (and after sweating or exercising) and washing your hands frequently, you may be able to prevent ringworm. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Use a mild cleanser to wash skin or a simple hand soap to keep your hands clean after using the bathroom or touching shared surfaces. If using a shower in a gym or other type of locker room, wear shower shoes to keep from contracting ringworm on your feet or other area. [9] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source"
    },
    {
      "title": "Shampoo with an antifungal product for scalp ringworm.",
      "content": "Shampoo with an antifungal product for scalp ringworm. If you have ringworm on your scalp, use an antifungal shampoo such as Nizoral or ketoconazole . This may be easier and more effective than using other home methods. You should see your doctor if you have scalp ringworm, as you usually need oral prescription medications in addition to the shampoo. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source A shampoo with tea tree oil may also help. Tea tree oil has antifungal properties, but more study is needed to confirm its efficacy for ringworm specifically. Never use undiluted tea tree oil on your skin. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Dry skin thoroughly before wearing clothing.",
      "content": "Dry skin thoroughly before wearing clothing. Be sure to allow your skin to dry completely after a shower (especially between your toes). This can eliminate a damp environment that promotes fungus growth. [12] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You can dry your skin using a towel or let your skin air dry. Use talcum powder , cornstarch, or rice powder to help keep your skin dry. This can absorb excess sweat. Reduced perspiration may help skin stay fungus-free."
    },
    {
      "title": "Avoid sharing personal items.",
      "content": "Avoid sharing personal items. Ringworm is highly contagious. Don’t share your personal towels, clothing, or grooming equipment or borrow them from others. This may help prevent ringworm or avoid re-infection. [13] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Towels or clothing may provide a medium for spreading a fungus like ringworm since it can stick to the fabric. Hairbrushes and combs can also spread ringworm, so don’t share or borrow these items."
    },
    {
      "title": "Avoid overdressing to stay cool.",
      "content": "Avoid overdressing to stay cool. No matter what time of year, try not to wear too much clothing. Wearing clothing appropriate to the weather can keep you from sweating, and sweating excessively is one of the conditions that leads to ringworm. [14] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source In the summer, wear soft and lightweight clothing. Cotton is a good option that will allow your skin to breathe. Layer your clothing in winter. If you get too hot or start to sweat, this can make it easier to remove items of clothing without getting too cold. Merino wool is a good option for winter that can keep you warm and dry."
    },
    {
      "title": "Visit your doctor.",
      "content": "Visit your doctor. If home treatments do not improve or heal your ringworm, or if you have ringworm of the scalp, see your doctor. Your doctor can develop a treatment plan and heal any underlying or related conditions you may develop from ringworm, including a skin infection. [15] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Your regular doctor or a dermatologist can diagnose and develop a treatment plan for ringworm. [16] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Your doctor will conduct a physical exam to check for signs of ringworm and will also likely ask for a health history, including if you’ve been exposed to any people or animals with ringworm. You may find it difficult to heal ringworm at home if you have a weakened immune system or diabetes and may need to see a doctor. [17] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Get tests and a diagnosis.",
      "content": "Get tests and a diagnosis. Your doctor may likely be able to diagnose ringworm simply by looking at it. They may order additional tests to help confirm a diagnosis and formulate a treatment plan. [18] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source If your case isn’t clear cut, your doctor may take some skin scraping to examine under a microscope. This can help them identify the fungus and more definitively diagnose ringworm."
    },
    {
      "title": "Use prescription antifungal creams.",
      "content": "Use prescription antifungal creams. Depending on the severity of your case, your doctor may prescribe an antifungal cream. More powerful than over the counter creams or lotions, prescription antifungal creams may help alleviate your ringworm more effectively. [19] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Make sure to follow your doctor’s instructions when using a prescription antifungal cream."
    },
    {
      "title": "Take oral medications.",
      "content": "Take oral medications. Some doctors prefer to prescribe oral medications for ringworm, especially for ringworm of the scalp or if you have ringworm on many parts of your body. Make sure you tell your doctor about any medical problems you have, any allergies, any medications you take, and if you are pregnant or planning to become pregnant. Take these pills as directed by your doctor to most effectively treat your ringworm. [20] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source The most common antifungal oral medications are terbinafine, itraconazole, griseofulvin, and fluconazole. Oral antifungal medications are usually taken for 1–3 months and are available at most pharmacies. Make sure to follow the indications on the prescription for maximum efficacy. You may experience some side effects from these medications including skin rash, itching or hives, swelling of the face, lips, or tongue, and/or skin irritation or burning. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Tell your doctor if you have any side effects that are more than mild. If you have a ringworm on your scalp, your doctor may suggest pairing an oral antifungal with antifungal shampoo. [22] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you have ringworm on your nails, your doctor may suggest pairing an oral antifungal with an antifungal nail paint. Your doctor may take blood tests before, during, or after your treatment course."
    }
  ]
}