{
  "url": "https://www.wikihow.com/Write-a-Net-Ionic-Equation",
  "title": "How to Write a Net Ionic Equation",
  "steps": [
    {
      "title": "Know the difference between molecular and ionic compounds.",
      "content": "Know the difference between molecular and ionic compounds . The first step in writing a net ionic equation is identifying the ionic compounds of the reaction. Ionic compounds are those that will ionize in an aqueous solution and have a charge. [2] X Research source Molecular compounds are compounds that never have a charge. They are made between two non-metals and are sometimes referred to as covalent compounds. [3] X Research source Ionic compounds can be between metals and nonmetals, metals and polyatomic ions, or multiple polyatomic ions. If you are unsure of a compound, look up the elements of the compound on the periodic table . [4] X Research source Net ionic equations apply to reactions involving strong electrolytes in water. [5] X Research source"
    },
    {
      "title": "Identify the solubility of a compound.",
      "content": "Identify the solubility of a compound. Not all ionic compounds are soluble in an aqueous solution and therefore, will not dissociate into individual ions. You must identify the solubility of each compound before proceeding with the rest of the equation. Below is a brief summary of the rules of solubility. Seek out a solubility chart for more details and exceptions to these rules. Follow these rules in the order stated below: All Na + , K + , and NH 4 + salts are soluble. All NO 3 - , C 2 H 3 O 2 - , ClO 3 - , and ClO 4 - salts are soluble. All Ag + , Pb 2+ , and Hg 2 2+ salts are insoluble. All Cl - , Br - , and I - salts are soluble. All CO 3 2- , O 2- , S 2- , OH - , PO 4 3- , CrO 4 2- , Cr 2 O 7 2- , and SO 3 2- salts are insoluble (with some exceptions). All SO 4 2- salts are soluble (with some exceptions)."
    },
    {
      "title": "Determine the cation and anion in a compound.",
      "content": "Determine the cation and anion in a compound. Cations are the positive ions in a compound and are generally the metals. Anions are the negative, non-metal ions in the compound. Some non-metals are capable of forming cations, but metals will always form cations. [6] X Research source For example, in NaCl, Na is the positively charged cation because it is a metal while Cl is the negatively charged anion because it is a non-metal."
    },
    {
      "title": "Recognize polyatomic ions in the reaction.",
      "content": "Recognize polyatomic ions in the reaction. Polyatomic ions are charged molecules that are bound so tightly together that they do not dissociate during chemical reactions. [7] X Research source It is important to recognize polyatomic ions as they have a specific charge and do not break down into their individual components. Polyatomic ions can be both positively and negatively charged. If you are in a standard chemistry course, you will likely be expected to memorize some of the most common polyatomic ions. Some common polyatomic ions include CO 3 2- , NO 3 - , NO 2 - , SO 4 2- , SO 3 2- , ClO 4 - , and ClO 3 - . [8] X Research source There are many more and can be found in tables in your chemistry book or online."
    },
    {
      "title": "Balance the complete molecular equation.",
      "content": "Balance the complete molecular equation. Before writing a net ionic equation, you must first make sure your starting equation is completely balanced . To balance an equation, you add coefficients in front of compounds until there is an equal number of atoms for each element on both sides of the equation. Write the number of atoms that comprise each compound on either side of the equation. Add a coefficient in front of elements that are not oxygen and hydrogen to balance each side. Balance the hydrogen atoms. Balance the oxygen atoms. Re-count the number of atoms on each side of the equation to make sure they are equal. For example, Cr + NiCl 2 --> CrCl 3 + Ni becomes 2Cr + 3NiCl 2 --> 2CrCl 3 + 3Ni."
    },
    {
      "title": "Identify the states of matter of each compound in the equation.",
      "content": "Identify the states of matter of each compound in the equation. Oftentimes, you will be able to identify keywords in a problem that will tell you the state of matter for each compound. There are some rules to help you determine the state of an element or compound. If no state is provided for an element, use the state found on the periodic table. If a compound is said to be a solution, you can write it as aqueous, or ( aq ). If there is water in the equation, determine whether or not the ionic compound will dissolve using a solubility table. If it has high solubility, the compound will be aqueous ( aq ), if it has low solubility, it will be solid ( s ). If there is not water, the ionic compound is a solid ( s ). If the problem mentions an acid or a base, they will be aqueous ( aq ). For example, 2Cr + 3NiCl 2 --> 2CrCl 3 + 3Ni. Cr and Ni in their elemental forms are solids. NiCl 2 and CrCl 3 are soluble ionic compounds, therefore, they are aqueous. Rewritten, this equation becomes: 2Cr ( s ) + 3NiCl 2( aq ) --> 2CrCl 3( aq ) + 3Ni ( s ) ."
    },
    {
      "title": "Determine what species will dissociate (separate into cations and anions) in solution.",
      "content": "Determine what species will dissociate (separate into cations and anions) in solution. When a species or compound dissociates, it separates into its positive (cation) and negative (anion) components. These will be the components that get balanced at the end for the net ionic equation. Solids, liquids, gases, molecular compounds, low solubility ionic compounds, polyatomic ions, and weak acids will not dissociate. The oxides and hydroxides with alkali or alkaline earth metals will dissociate completely. High solubility ionic compounds (use solubility table) and strong acids will ionize 100% (HCl ( aq ) , HBr ( aq ) , HI ( aq ) , H 2 SO 4( aq ) , HClO 4( aq ) , and HNO 3( aq ) ). [9] X Research source Keep in mind, although polyatomic ions do not dissociate further, if they are a component of an ionic compound they will dissociate from that compound."
    },
    {
      "title": "Calculate the charge of each dissociated ion.",
      "content": "Calculate the charge of each dissociated ion. Remember that metals will be the positive cation, while non-metals will be the negative anion. Using the group number on the periodic table to determine which element will have which charge. You must also balance the charges of each ion within the compound. In our example, NiCl 2 dissociates into Ni 2+ and Cl - while CrCl 3 dissociates into Cr 3+ and Cl - . Ni has 2+ charge because Cl has a minus charge, but there are 2 atoms of it. Therefore, it must balance the 2 negative Cl ions. Cr has a 3+ charge because it must balance the 3 negative Cl ions. Remember that polyatomic ions have their own specific charge."
    },
    {
      "title": "Re-write the equation with the soluble ionic compounds broken down into their individual ions.",
      "content": "Re-write the equation with the soluble ionic compounds broken down into their individual ions. Anything that will dissociate or ionize (strong acids) will simply separate into its two distinct ions. The state of matter will remain ( aq ), but you must ensure the equation remains balanced. Solids, liquids, gasses, weak acids, and low solubility ionic compounds will not change state or separate into ions. Simply leave them as they are. Molecular substances will simply disperse in solution, so their state will change to ( aq ). Three exceptions that do not become ( aq ) are: CH 4( g ) , C 3 H 8( g ) , and C 8 H 18( l ) . Continuing our example, the total ionic equation looks like this: 2Cr ( s ) + 3Ni 2+ ( aq ) + 6Cl - ( aq ) --> 2Cr 3+ ( aq ) + 6Cl - ( aq ) + 3Ni ( s ) . When Cl is not in a compound, it is not diatomic; therefore, we multiplied the coefficient by the number of atoms in the compound to get 6 Cl ions on both sides of the equation."
    },
    {
      "title": "Remove the spectator ions by canceling out identical ions on each side of the equation.",
      "content": "Remove the spectator ions by canceling out identical ions on each side of the equation. You can cancel only if they are 100% identical on both sides (charges, subscripts, etc.). Rewrite the action without any of the canceled species. Spectator ions do not participate in the reaction, but they are present. Finishing the example, there are 6Cl - spectator ions on each side that can be canceled out. The final net ionic equation is 2Cr ( s ) + 3Ni 2+ ( aq ) --> 2Cr 3+ ( aq ) + 3Ni ( s ) . To do a check to see if your answer works, the total charge on the reactant side should equal the total charge on the product side in the net ionic equation."
    }
  ]
}