{
  "url": "https://www.wikihow.com/Win-at-Craps",
  "title": "How to Win Big at Craps: Surefire Strategies & Tips",
  "steps": [
    {
      "title": "Always prioritize the safest bets on the table.",
      "content": "Always prioritize the safest bets on the table. If you have a massive bankroll and can stand to lose lots of money for the thrill of a few big wins, you can probably make high-risk, high-reward bets to your heart's content. Otherwise, it's smart to take only the safest bets - the ones that offer the smallest house edge. By doing so, you minimize your risk - while the house will still have a mathematical advantage, it will be as low as possible."
    },
    {
      "title": "Take (relatively safe) pass bets.",
      "content": "Take (relatively safe) pass bets. Though there are many, many betting possibilities in the game of craps, the safest bets are, luckily, fairly simple. The simplest, most fundamental bet in the game of craps, the pass bet, is also one of the very safest, with a low house edge of 1.41% . Pass bets pay even money - in other words, if you bet $10, you win $10. [1] X Research source With a pass bet, if the come out roll is 7 or 11, you win, while if the come out roll is 2, 3, or 12, you lose. If another number is rolled, this number becomes the \"point\" and the shooter continues rolling. If a 7 is rolled before the point is rolled again, you lose, while if the point is rolled again before a 7, you win. Don't make pass bets after the come out roll - this is allowed, but the value of the bet diminishes."
    },
    {
      "title": "For the absolute lowest house edge, take don't pass bets.",
      "content": "For the absolute lowest house edge, take don't pass bets. The don't pass bet is almost the opposite of the pass bet - 2 or 3 on the come out roll win, 7 or 11 lose (12 pushes). If a point is established, you win if a 7 comes before the point and lose if the point comes first. The don't pass bet can be considered one of the single safest bets on the table as the house edge for this bet is only 1.36 %. However, note that most players generally make pass bets, so if you make don't pass bets, you'll win when they lose and vice versa. This can create the table dynamic of you \"going against\" everyone else, which some people like and some don't. Like pass bets, don't pass bets pay even money."
    },
    {
      "title": "Maximize your winnings with odds bets.",
      "content": "Maximize your winnings with odds bets. Odds bets are somewhat unique in that they are truly fair - the house has no edge at all on these bets. However, odds bets can only be made on top of other bets, so, if you make an odds bet, the house still has an edge (albeit a diminished one) on your overall wager. Odds bets usually have a maximum bet amount that is some multiple of your pass or don't pass bet - 2X, 3X, 5X, etc. By taking the maximum odds bet every time you make a pass or don't pass bet, you maximize your winning potential and lower the house edge on your overall wager. Making an odds bet after a pass bet is betting that the point will be thrown before a 7. The odds bet pays 2 to 1 on points of 4 and 10, 3 to 2 on a 5 and 9, and 6 to 5 on a 6 and 8. [2] X Research source Making an odds bet after a don't pass bet is called \"laying the odds\" and is the opposite of a normal odds bet - you're betting that a 7 will be rolled before the point. Laying the odds against a 4 or 10 pays 1 to 2, 2 to 3 against a 5 or 9, and 5 to 6 against a 6 or 8. [3] X Research source"
    },
    {
      "title": "Consider also making come and don't come bets.",
      "content": "Consider also making come and don't come bets. Come and don't come bets are essentially the same as pass and don't pass bets, except they're made at any point other than the come out roll. In other words, the roll after the come bet functions as the come out roll for the come bet. The conditions for winning a come or don't come bet are the same as those for pass or don't pass bets, respectively. The odds on both are mathematically identical."
    },
    {
      "title": "Avoid risky bets with major house edges.",
      "content": "Avoid risky bets with major house edges. Certain bets carry high house edges and are to avoided by serious gamblers at all costs. Only take these bets for their entertainment value - the thrill of risking your money on a long shot. In particular, put bets and proposition (prop) bets offer very unfavorable house edges, so avoid making these bets if you're looking to make money. Put bets are essentially pass bets that \"skip\" the come out roll. In other words, you won't win on a 7 or 11 on the first roll and so on. Since much of a pass bet's value is in the come out roll, put bets can have house edges of as high as 33.3% . However, one mitigating factor is that odd bets can be made on top of put bets, lowering the house edge on the overall wager. Proposition (or \"prop\") bets are basically bets made on the next roll of the dice. You bet on a specific number, and if the next roll comes up that number, you win. Prop bets are very risky and thus offer high payouts. However, the house edge is large (from about 5% - 17%, depending on the number you choose), so these bets aren't effective ways to make money."
    },
    {
      "title": "Realize that, in casinos, the house will always have an edge.",
      "content": "Realize that, in casinos, the house will always have an edge. The idea that it's possible to \"win\" at any form of gambling is somewhat of a falsehood. Though it's absolutely possible to leave the craps table with more money than you came to it with, it's crucial to understand that craps, like every game in the casino, has a built-in house edge . This means that the structure of payouts is mathematically designed to make money for the casino in the long term. Basically, if you play for long enough, while you may have ups and downs, you'll always lose money to the casino. Thus, you'll never, ever want to play craps with money you can't afford to lose. Always consider the absolute worst-case scenario before heading to the craps table."
    },
    {
      "title": "Look for \"downtown\" tables.",
      "content": "Look for \"downtown\" tables. In the gambling Mecca of Las Vegas, the casinos on the famous \"Strip\" are renowned for their glitz and glamour, while the casinos in Vegas' lower-rent downtown area, to attract visitors, are known to offer slightly better odds in the form of more-favorable payout systems. Today, when it comes to craps, the terms \"downtown table\" and \"strip table\" don't necessarily refer to the actual location of the table, but, rather, the payout system being used. If you can, opt for a table using the \"downtown\" payout system for a small but not insignificant advantage. There are many minute differences between \"downtown\" and \"strip\" tables. For instance, on a downtown table, while a $3.00 place bet on a 6 or 8 pays $3.50, while on a strip table, the house rounds this amount down and pays out only $3.00. Additionally, proposition bets of 2,3,11 and 12 have ever-so-slightly higher payouts on downtown tables ( 30 to 1 for 2 & 12 and 15 to 1 for 3 and 11) than on strip tables ( 29 to 1 and 14 to 1 , respectively)."
    },
    {
      "title": "Look for games with experienced dice setters.",
      "content": "Look for games with experienced dice setters. \"Dice setting\" is a technique for rolling dice that (theoretically) allows the shooter to control the outcome of the roll to a small degree. The actual usefulness of dice setting is a topic of some debate among gambling experts. [4] X Research source Generally, it's thought that, if dice setting does give the shooter an advantage, this advantage is very minute and only becomes evident over the course of thousands of rolls. Still, if you can manage to find a table with a dice setter, it certainly won't hurt your chances to follow his or her bets. If you're trying this method, bet with the dice setter on low-risk bets. That is, if s/he bets pass, you should bet pass, if s/he bets don't pass, you should bet don't pass, and so on for come bets. Generally, you'll want to stick with these low-risk bets. Don't follow the dice setter on high-risk bets - no amount of dice-shooting skill is likely to cancel out the long odds of winning such a bet."
    },
    {
      "title": "If legal, look for craps games outside casinos.",
      "content": "If legal, look for craps games outside casinos. \"Street craps\", an improvised, informal version of craps, can be played virtually anywhere with just a few dice and willing participants. The primary advantage of street craps over casino craps is that there is no house to take an edge on your bets. Rather, it's up to the players to \"cover\" each others' bets by wagering against each other. Also, since street craps is usually played without an actual craps table, the betting system is usually simplified and somewhat improvisational. Depending on the game, you may be able to make up your own prop bets and set payouts on the fly. This means that, if you're a shrewd gambler, street craps can conceivably be more lucrative than casino craps. Note however, that, often, gambling outside of a licensed casino or gambling hall can be considered a crime . Before looking for a street craps game, be sure to check local laws in your area to make sure you're not breaking any."
    },
    {
      "title": "Budget.",
      "content": "Budget. Many gamblers end up spending far more money than they originally intended to. Avoid having this happen to you by set a hard, inflexible budget for your gambling session. Set aside a certain amount of money that you can stand to lose as your bankroll for the day. Use your bankroll - and only your bankroll - to finance your craps games. Use your money wisely, making conservative bets, rather than risking it all on one roll of the dice. Doing so helps ensure that you'll have more money throughout the day and won't need to withdraw more to keep playing. It can be easier to budget smartly if you have a healthy attitude towards gambling in general. Think of your gambling session as a form of entertainment, rather than a way to make money. This way, you'll be satisfied even if you lose money, while any money you win will be a \"pleasant surprise.\""
    },
    {
      "title": "Set win and loss limits for yourself.",
      "content": "Set win and loss limits for yourself. Knowing when to stop gambling is crucial. No matter how much you may win, if you play forever, you'll eventually lose all of your money to the house. To prevent this sort of over-reach, set hard, inflexible cash limits that, if passed, will end your gambling for the day. For instance, you might decide to stop as soon as you win or lose 50% of your starting bankroll. This way, if you hit your upper limit, you're prevented from losing any payout you receive by gambling for too long. Conversely, if you hit your lower limit, you'll still have money reserved for your next session."
    },
    {
      "title": "Quit while you're ahead.",
      "content": "Quit while you're ahead. As mentioned above, if you play for long enough, the casino will take your money. Because of this, it's a smart idea to cash out when you're ahead. Resist the perennial gambler's temptation to boost your winnings further by playing just \"one more roll\", as innumerable payouts have been squandered this way."
    },
    {
      "title": "Don't get too caught up in the thrill of it all.",
      "content": "Don't get too caught up in the thrill of it all. Above all, the best tool a craps player can have is a cool, rational head. It's easy to get swept away by the rush of excitement that comes with a winning roll, but try not to. If you're at a rowdy table, making a few great rolls can make you feel like a celebrity, but your present odds will always be the same regardless of your past luck. Stick to your betting plan and your budget at all times. Other than this, enjoy yourself. Craps can be one of the funnest, most exciting games in the casino - especially if you win!"
    }
  ]
}