{
  "url": "https://www.wikihow.com/Stop-Your-Dog-from-Eating-Your-Plants",
  "title": "How to Stop Your Dog from Eating Your Plants: A Step-By-Step Guide",
  "steps": [
    {
      "title": "Move houseplants out of reach.",
      "content": "Move houseplants out of reach. One way of keeping dogs from eating houseplants is simply to move them to a location that is out of the dog's reach. This can be achieved with the use of tables or plant stands. Houseplants that grow in vines should be trimmed back to stay out of reach of the dog or placed totally out of reach. [2] X Research source You may also be able to build cages around the plants using chicken wire or other products that will cut off access to plants."
    },
    {
      "title": "Train your dog to leave plants alone.",
      "content": "Train your dog to leave plants alone. Using a motion-sensitive repellent, you can train dogs to stay away from plants. When your dog approaches your houseplants, a motion-sensitive device will trigger, scaring the dog away from the plants, and reinforcing the idea that he should probably leave them alone. These devices come in many varieties, sometimes with an air horn or both an air horn and a chemical deterrent. Other varieties may shoot a stream of water to discourage the dog, though these may not be as desirable for use indoors. [3] X Research source Consider clicker training as well. Clickers can help your dog understand commands more quickly as well as get their attention quickly. Clickers are available at pet stores, and many dog training academies will give instruction on clicker training. (See elsewhere in this article for information on clicker training.)"
    },
    {
      "title": "Spray houseplants with diluted lemon juice.",
      "content": "Spray houseplants with diluted lemon juice. Many dogs avoid the smell of citrus, so if you dilute lemon juice half with water and use a spray bottle to mist it onto your plants, this might deter your dog from eating your houseplants. If you do not want to spray the diluted lemon juice solution onto your plants, you can place lemon slices in the pots as an effective alternative. [4] X Research source Empty spray bottles can be purchase at dollar or home stores. Be sure to change lemon wedges regularly so they don't spoil."
    },
    {
      "title": "Keep the dog confined.",
      "content": "Keep the dog confined. If your dog tends to eat your houseplants when you are not there to discourage him from doing so, keep the dog confined to spaces where there aren't any houseplants while you aren't available to supervise. [5] X Research source This can be a room with a door you can close or a pet crate. Always be sure to keep the dog's well-being in mind when crating, as extended periods spent in crates can have adverse effects. [6] X Research source If you aren't sure how to crate train your dog, read this helpful wikiHow article on the subject. Many different types of crates are available, and dogs should have toys, food, and water with them inside. Pay attention to your dog's behavior while confined, as some dogs may get stressed out from confinement. Never use crates as punishment—dogs should only be crated if they are comfortable and happy there. You can encourage your dog to be comfortable in his crate by feeding him his meals in it and leaving its door open all the time so that he can go in and out as he pleases when you're home."
    },
    {
      "title": "Remove toxic houseplants.",
      "content": "Remove toxic houseplants. Some houseplants are toxic to dogs. If you are having a hard time getting your dog to stop eating indoor plants, consider getting rid of toxic plants so that your dog does not actually ingest them and become ill. Here are some common houseplants that are poisonous to dogs: [7] X Research source Castor bean Daffodil Elephant Ear Hyacinth Narcissus Oleander Rosary Pea"
    },
    {
      "title": "Use remote punishment.",
      "content": "Use remote punishment. If you let your dog near outdoor plants that you don't want him to eat, use remote punishment to condition him to avoid them as you can for indoor plants as well. This punishment could be administered by the dog's owner or caretaker standing at a distance so the dog does not know the punishment is coming from them or via the use of remote punishment products, such as motion-sensitive alarms, water sprayers or other deterrents. [8] X Research source An electric fence or dog run can keep your dog in a specific space while outside. Do not use any technique that will cause your dog pain or injury. Shock collars are not recommended by veterinary experts, especially not as training devices."
    },
    {
      "title": "Try clicker training.",
      "content": "Try clicker training . Use a clicker (available at pet stores) to let your dog know when he does what you want him to do. Make noise with the clicker at the instant your dog does the behavior you want him to do and immediately reward him with a high-value treat, such as a piece of cheese or meat or his favorite cookie. Give him lots of praise. [9] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source To keep the dog from eating your plants outside using the clicker, bring him outside and if he approaches the plants, signal him to come to you and give a click and a treat the moment that he does so. This way, you are rewarding the recall and not the plant-eating. [10] X Research source"
    },
    {
      "title": "Spray plants with unpleasant-tasting substances.",
      "content": "Spray plants with unpleasant-tasting substances. Bitter Apple and Bitter Yuck are commercially available sprays meant to be sprayed on anything you want to discouraging your dog from chewing on. These sprays are available at pet stores and online. Other sprayable pet deterrents may be available from veterinarians or pet stores as well. You can also use chili pepper sauce diluted with water in a spray bottle to mist on plants you want to discourage dogs from eating. Vinegar and ammonia will also work to keep dogs away from areas where they are not welcome, but these substances cannot be sprayed directly on plants or they will die. Instead, spray the ground near the off-limits area to create a barrier. [11] X Research source Always be sure to use non-toxic substances to keep dogs away id it is used in a manner where dogs may ingest them. Be sure to follow all safety information in using deterrents."
    },
    {
      "title": "Spread items your dog will not want to walk upon.",
      "content": "Spread items your dog will not want to walk upon. Use aluminum foil, pine cones, chicken wire, or any other items to create a barrier in front of plants the dog is eating. The dog will not like the feeling of these items underfoot, so he will be less likely to cross the barrier and eat the plants. [12] X Research source Chicken wire also discourages digging. Be sure that any items you spread that the dog may tread upon will not hurt him."
    },
    {
      "title": "Cover or block the plants.",
      "content": "Cover or block the plants. Using something like bird netting, cover the plants that the dog tries to eat to keep him from being able to do so. This netting is easily found at home stores and farm supply stores. You can also use chicken wire or other fencing material to block access to the plants the dog tries to eat. [13] X Research source Chicken wire or fencing may also help keep other unwanted animals out of your garden."
    },
    {
      "title": "Consider getting rid of toxic plants.",
      "content": "Consider getting rid of toxic plants. If you cannot keep your dog from eating your plants, you might wish to consider getting rid of some plants that can be especially harmful to dogs. Common ornamental plants that are poisonous to dogs include: [14] X Research source Azaleas Daphne Golden Chain Jasmine Red Sage Laurels Rhododendrons Wisteria Yew"
    },
    {
      "title": "Play with the dog.",
      "content": "Play with the dog. Dogs may exhibit unwanted behaviors due to a lack of exercise. [15] X Expert Source Ty Brown Dog Trainer Expert Interview. 4 June 2020. If you make it a point to play with your dog regularly to expend his excess energy, he will likely be less interested in eating plants in the yard or in the house. Games that force the dog to move around a lot while you mostly stand still are best. They include fetching, frisbee catching/fetching, chasing a toy on a rope or stick that you move, catching bubbles, and many more. [16] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Be sure dogs have access to water during play. Always keep safety in mind when playing with your dog."
    },
    {
      "title": "Walk the dog.",
      "content": "Walk the dog. [17] X Expert Source Ty Brown Dog Trainer Expert Interview. 4 June 2020. Walking your dog not only gives him some great exercise, it also stimulates his mind because of unfamiliar sights and sounds you may encounter on the walk. Use an extendable leash that is retractable, giving the dog lots of room to investigate what he encounters. During the walk, try to walk faster than your normal pace for 30 minutes. Older or out-of-shape dogs may need to start with a shorter walk and work up to a faster, longer walk. [18] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Pay attention to signs that display rules for walking dogs in public areas. Be sure to clean up after your dog when walking."
    },
    {
      "title": "Run your dog.",
      "content": "Run your dog. For a more significant workout that will expend more of your dog's energy and hopefully discourage him from eating plants, try running your dog. You can run the dog by taking him with you on the leash while you are in-line skating or bicycling. [19] X Trustworthy Source American Society for the Prevention of Cruelty to Animals Leading organization dedicated to the prevention of animal cruelty Go to source Always be careful when running your dog—he may have to learn to pay close attention to you during the run instead of stopping to smell things or relieve himself. Take regular breaks to allow him to relieve himself. Younger dogs whose bones are not fully formed may need some time to develop before a run is appropriate. Enlist the help of a dog trainer for leash training if your dog has trouble getting used to running."
    }
  ]
}