{
  "url": "https://www.wikihow.com/Upgrade-from-Economy-to-Business-Class-on-Cathay-Pacific",
  "title": "How to Upgrade from Economy to Business Class on Cathay Pacific",
  "steps": [
    {
      "title": "Check your eligibility with your reference number and last name.",
      "content": "Check your eligibility with your reference number and last name. After booking a Cathay Pacific flight, go to their official Upgrade Bid page and provide your last name (family name) and booking reference number. Not all flights are eligible for Upgrade Bid, but if yours is, you’ll be offered the chance to submit a bid on the next page. You can also be invited to bid for an upgrade by Cathay Pacific. If you’re interested in getting these invites, make sure you provide an accurate email address that you check often when buying a ticket. [1] X Research source NOTE : You can only use Upgrade Bid and the other methods in this article to jump up one class, not two (unless you pay the full difference in ticket prices , which we show how to do below). You can’t upgrade from Economy to Business Class unless your flight lacks the intermediate Premium Economy Class."
    },
    {
      "title": "Make a strong bid offer based on the listed minimum and maximum.",
      "content": "Make a strong bid offer based on the listed minimum and maximum. The bid page for your flight will provide a minimum and maximum allowable bid. When you make a bid, the “bid gauge” will indicate the relative strength of your bid. The stronger your bid, the better your chance of “winning” the upgrade! [2] X Research source If you decide you want to raise, lower, or cancel your bid, you can keep making adjustments until 26 hours before your flight’s listed departure time (as long as your bid hasn't already been accepted). [3] X Research source When using Upgrade Bid, you're bidding against other Cathay Pacific ticket holders for available upgrades on your particular flight. Cathay Pacific is frustratingly vague about their bid evaluation criteria, but it’s safe to assume that the higher your bid, the better your odds of success."
    },
    {
      "title": "Keep a close eye on your email around 50 hours before your flight.",
      "content": "Keep a close eye on your email around 50 hours before your flight. If your bid is successful, Cathay Pacific will send you a confirmation email and charge the payment method you selected. Enjoy your successful bid and upgrade! [4] X Research source In rare instances you may not be informed of a successful bid until the day before your flight. You won’t be charged anything if your bid is unsuccessful. You also won’t be notified by Cathay Pacific."
    },
    {
      "title": "Sign up for a Cathay membership and earn Asia miles from flying.",
      "content": "Sign up for a Cathay membership and earn Asia miles from flying. Sign up for a free account on Cathay , Cathay Pacific's benefits membership program. As a member, you’ll earn Asia Miles when you fly with Cathay Pacific and their oneworld partners, including Air Canada, American Airlines, British Airways, and many more. When you collect enough Asia miles, you can redeem them for class upgrades. [5] X Research source Provide your Asia Miles membership information each time you book a flight to earn miles. See the entire list of participating airlines at https://www.asiamiles.com/en/earn-miles/airlines.html ."
    },
    {
      "title": "Earn at least 11,000 Asia Miles so you can get an upgrade.",
      "content": "Earn at least 11,000 Asia Miles so you can get an upgrade. You’ll accrue Asia Miles each time you fly with a participating carrier, so check your account often to keep tabs on how many miles you’ve earned. To upgrade from Economy to Business on a Cathay Pacific flight (that doesn’t have Premium Economy), you’ll need the following number of miles: [6] X Research source 11,000 Asia Miles for a flight of up to 750 mi (1,210 km). 19,500-22,500 Asia Miles for a flight of up to 2,750 mi (4,430 km). 40,500 Asia Miles for a flight of up to 5,000 mi (8,000 km). 59,000 Asia Miles for a flight of up to 7,500 mi (12,100 km). 77,000 Asia Miles for a flight of over 7,500 mi (12,100 km)."
    },
    {
      "title": "Buy an Economy ticket and redeem your Asia Miles to upgrade.",
      "content": "Buy an Economy ticket and redeem your Asia Miles to upgrade. Provide your Asia Miles membership information when buying your ticket on the Cathay Pacific site or with a Cathay Pacific agent. If there’s a seat in Business Class available on your chosen flight, you’ll automatically be given the option to upgrade your purchased ticket. Simply agree to redeem your miles and you’re good to go! [7] X Research source"
    },
    {
      "title": "Enroll in the Cathay rewards program.",
      "content": "Enroll in the Cathay rewards program. Sign up for free and you’ll automatically start at the Green level and earn points each time you fly with Cathay Pacific and their airline partners. Earning points unlocks new club tiers—Silver, Gold, and Diamond—and access to a range of amenities and benefits."
    },
    {
      "title": "Earn your way up to Gold or Diamond level to access seat upgrades.",
      "content": "Earn your way up to Gold or Diamond level to access seat upgrades. It takes 300 points to go from Green to Silver, 600 points to reach the Gold level, and 1200 points to reach the Diamond level. Only Gold and Diamond members can use their points to get a “Bookable Upgrade” to the next available cabin class. [8] X Research source Your points reset every year (on the anniversary of your initial signup) and every time you upgrade or downgrade. For example, you have to earn 600 points each year to stay in Gold. This also means you have to make sure to use your points before they expire!"
    },
    {
      "title": "Redeem your upgrade once you’ve earned 1000-1600 points.",
      "content": "Redeem your upgrade once you’ve earned 1000-1600 points. With 1000 points (which puts you in a Gold membership), you can get up to 4 one-level upgrades on Cathay Pacific flights of up to 3,700 mi (6,000 km) in distance. With 1600 points (Diamond level), you can get up to 4 one-level upgrades on Cathay Pacific flights of any length. Here’s the process: [9] X Research source Book up to 4 Economy (not Economy Light) tickets on one Cathay Pacific flight, one ticket on four flights, or another combination thereof. Choose flights with no Premium Economy level if you want to be able to upgrade from Economy to Business. At least 3 days before your departure date, log into your Cathay account and click Redeem flight award, then Upgrade awards."
    },
    {
      "title": "Contact Cathay Pacific or your travel agent to upgrade your ticket.",
      "content": "Contact Cathay Pacific or your travel agent to upgrade your ticket. Say, for example, you bought an Economy Class round-trip ticket from Chicago to Hong Kong for $1500 USD, and a Business Class ticket for the same round trip costs $8500 USD. If you’re willing to pay the full $7000 USD difference, contact Cathay Pacific (or your travel agent) or go to Manage Bookings to upgrade your existing ticket. [10] X Research source In addition to the difference in ticket price, expect some associated upgrade fees. Discuss these with your Cathay Pacific contact or travel agent. To change your bookings online, sign into the Manage booking tool with your Cathay membership or email address. Keep in mind that not all flights allow you to change your booking, especially if there are no seats available or it's last minute. NOTE : This method is your only option if you want to upgrade from Economy to Business on a flight that also has the intermediate Premium Economy class."
    },
    {
      "title": "Pay for an upgrade when you check in at the airport.",
      "content": "Pay for an upgrade when you check in at the airport. When you get to the Cathay Pacific check-in counter or the online check-in tool , check if there are any available seats in Business class so you can upgrade your current ticket from Economy. Here again, expect to pay the listed price difference between the tickets, plus some extra fees. Improve your odds by arriving at the airport well ahead of your flight—this is often an “early bird gets the worm” situation!"
    },
    {
      "title": "Ask for a discounted upgrade when using any of the above methods.",
      "content": "Ask for a discounted upgrade when using any of the above methods. There’s not much of a chance that asking nicely will work, but it doesn’t hurt to try! In addition to being very polite and straightforward with your request, e.g., \"Thanks for all your help so far. By the way, is there any chance you could offer me a discount on the upgrade amount?\" Taking the following measures might increase your odds from “yeah, right” to “maybe, but don’t count on it”: [11] X Research source Join Cathay Pacific’s rewards program. Even if you don’t have enough points to earn an upgrade, being a Cathay member may give you a better chance of snagging a “courtesy” discount than if you’re a non-member. Volunteer to take a different flight. If you have the flexibility to take either an earlier or later flight, you might ease an overbooking situation and be rewarded with a discounted upgrade. Fly solo. Your odds of snagging a discounted upgrade for a single ticket are already slim and will become practically non-existent if you try to get discounts for multiple tickets."
    },
    {
      "title": "How much is it to upgrade from Economy to Business in Cathay?",
      "content": "How much is it to upgrade from Economy to Business in Cathay? The price to upgrade from Economy to Business class on a Cathay Pacific flight varies greatly from flight to flight. There's no one specific amount you can expect to pay."
    },
    {
      "title": "Does Cathay Pacific offer bids for upgrades?",
      "content": "Does Cathay Pacific offer bids for upgrades? Yes! Cathay Pacific allows passengers to upgrade their flights through a number of methods, including using their Upgrade Bid option (on flights with empty seats only), cashing in Asia Miles, spending Status Points, and paying the difference between the two tickets."
    },
    {
      "title": "Is bidding for a flight upgrade worth it?",
      "content": "Is bidding for a flight upgrade worth it? It can be worth it to bid for a flight upgrade if the price of a strong bid is less than the cost difference between the two class ticket prices. For example, if you purchased an Economy class ticket for $700, and a Business class ticket cost $1500, the bid would only be worth it if it was less than the $800 difference. You can check the strength of your bid using the gauge on Cathay Pacific's Upgrade Bid page ."
    },
    {
      "title": "Does Cathay Pacific give free upgrades?",
      "content": "Does Cathay Pacific give free upgrades? The only time Cathay Pacific upgrades Economy or Premium Economy class passengers to Business class free of charge is if they overbook. In that case, Cathay Pacific is at fault for overselling seats, making it their responsibility to ensure everyone who booked a ticket makes it to their destination – even if they have to be moved to a higher cabin class!"
    },
    {
      "title": "Can I upgrade 2 cabin classes on Cathay Pacific?",
      "content": "Can I upgrade 2 cabin classes on Cathay Pacific? No, you can't upgrade 2 cabin classes on a Cathay flight. This means if you're in Economy class on a flight that has a Premium Economy class above you instead of Business class, you won't be able to upgrade to Business for that flight."
    }
  ]
}