{
  "url": "https://www.wikihow.com/Tame-a-Wild-Rabbit",
  "title": "How to Tame a Wild Rabbit",
  "steps": [
    {
      "title": "Be ready for it to run.",
      "content": "Be ready for it to run. Rabbits are naturally prey animals, so they experience more stress more than other animals. This means that your wild rabbit will likely run from you if you try to approach it. Its first survival defense is to run away to a place of safety. Do not attempt to stop the rabbit from running away. This will only make it more stressed. This can lead to its death, since rabbits can suffer a heart attack or go into shock, which causes its gut to go into stasis, which will cause its starvation. [3] X Research source The Textbook of Rabbit Medince. Frances Harcourt Brown. Publisher: Butterworth-Heinneman"
    },
    {
      "title": "Lie down with it.",
      "content": "Lie down with it. In order for the rabbit to get used to you and not see you as hostile, you should decrease your height when approaching it. This will make it seem less threatening to it. If she does approach you, do not react to it at first. Sit immobile for as long as it takes, which may be hours. It may also take multiple tries over many days, as she gets used to you."
    },
    {
      "title": "Avoid smelling like other animals.",
      "content": "Avoid smelling like other animals. If you smell like other animals that are predators of rabbits, such as dogs or cats, she may not approach you. Put on freshly washed clothes and wash your hands before going outside to ensure you don't smell like any other animal."
    },
    {
      "title": "Leave a trail of food.",
      "content": "Leave a trail of food. When you are trying to get the rabbit to trust you, leave a trail of tasty food the rabbit will like to lead it towards you. This includes leafy green like arugula, dandelion leaves, and carrot slices. This will help it trust you and go towards taming it. [4] X Research source"
    },
    {
      "title": "Talk gently to it.",
      "content": "Talk gently to it. When you are trying to tame it, talk to the rabbit in a calm, gentle, low voice. This will help soothe it and not cause extra alarm. Never shout at the rabbit or make loud noises. This will cause it to run away and hide."
    },
    {
      "title": "Deal with a scared rabbit.",
      "content": "Deal with a scared rabbit. If you do manage to scare the rabbit, she may completely freeze. A rabbit uses this reflex to fool predators into thinking she is dead or to help it hide. If the rabbit approaches you in this manner, she is not happy to see you and does not want you to pick it up. She is actually terrified. You may be tempted and be able to pick it up in this catatonic state, but this is not a good way to help the rabbit. This will likely send it into shock and cause major problems for it. This can cause a heart attack or shock and eventual death. [5] X Research source The Textbook of Rabbit Medince. Frances Harcourt Brown. Publisher: Butterworth-Heinneman"
    },
    {
      "title": "Avoid lifting them up.",
      "content": "Avoid lifting them up. If you do pick it up, do not lift the rabbit in the air. Since rabbits are ground dwellers, picking it up is extremely terrifying. This can also lead to heart attack or shock for it. You may also permanently injure the rabbit's legs if you pick it up."
    },
    {
      "title": "Pick the right trap.",
      "content": "Pick the right trap. If you want catch the rabbit without handling it, which may be a better and less frightening option, think about making a humane trap for it. Talk to a local wildlife society or animal welfare charity to see if they have one. You can also purchase one at a pet store. You can also make a simple box trap with a cardboard box that will close once the rabbit enters it. To make this kind of trap, prop a box up on a stick, and poke a hole in the cardboard box. Then, tie a carrot or other treat from a string and loop it through the hole and tie it to the stick. When the rabbit enters the box and grabs the treat, the string will pull the stick and the box will come down. [6] X Research source"
    },
    {
      "title": "Place tasty food inside.",
      "content": "Place tasty food inside. To lure the rabbit inside the cage, put down some tasty treats for him inside of it. This includes carrots, leafy greens, or dandelion leaves. [7] X Research source"
    },
    {
      "title": "Put it in a safe location.",
      "content": "Put it in a safe location. If you want the rabbit to come to your trap, you need to put it somewhere that is well sheltered and protected. This will make the rabbit feel safe enough to come to your trap and eat the food you left in it."
    },
    {
      "title": "Put it out at the right time.",
      "content": "Put it out at the right time. Rabbits are typically most active at sunrise and sunset, so make sure your traps are fresh and ready at these times. Make sure you check the traps after these times to see if you managed to catch them. [8] X Research source"
    },
    {
      "title": "Relocate the trap.",
      "content": "Relocate the trap. Once you catch the rabbit, cover the trap with a blanket so she feels safe. Pick up the trap and then move it to a new location where you want the rabbit to be and open the trap so she can run out. Make sure wherever you send it is safe for rabbits. You can ask your local wildlife rescue organization or animal control facility for advice."
    }
  ]
}