{
  "url": "https://www.wikihow.com/Tell-when-Your-Girlfriend-Is-on-Her-Period",
  "title": "How to Tell when Your Girlfriend Is on Her Period",
  "steps": [
    {
      "title": "Mood swings.",
      "content": "Mood swings. These symptoms, as well as the others listed below, are all signs that your girlfriend is either experiencing PMS (premenstrual syndrome) or the first couple days of her period. Starting around 14 days before her period, your girlfriend may experience changes in her serotonin levels. These changes may cause irritability, sadness, or mood swings. [1] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source PMS usually begins 14 days before someone's period, and its symptoms subside a few days into menstruation (when bleeding begins). Menstrual cycles are usually regular, so this cycle should occur around the same time every month. If your girlfriend is in a bad mood, try not to assume that it's because she's on her period. There are a lot of other reasons she may be upset, and making assumptions or referencing her period might make the situation worse."
    },
    {
      "title": "Food cravings.",
      "content": "Food cravings. During PMS and the first couple days of her period, your girlfriend will experience fluctuating levels of the hormones progesterone and estrogen. This can lower her blood sugar levels, so she may need extra snacks to get her energy back. Lower serotonin levels can also cause food cravings, since your body needs carbs to create serotonin. [2] X Research source"
    },
    {
      "title": "Fatigue and trouble sleeping at night.",
      "content": "Fatigue and trouble sleeping at night. Changing hormone levels can cause your girlfriend to feel sleepier than usual, especially if she's dealing with a low mood. Your girlfriend may also experience insomnia in the days leading up to her period, as fluctuating progesterone levels can cause her body temperature at night to increase. This can make it difficult to fall asleep or stay asleep throughout the night. [3] X Research source"
    },
    {
      "title": "Changes in sexual desire.",
      "content": "Changes in sexual desire. In the days leading up to her period, your girlfriend might feel an increase in sexual desire due to changing hormone levels. About 14 days before their period, a person who menstruates' levels of testosterone and estrogen will rise, which can increase their libido. [4] X Research source During the actual period, a person may be more interested in sex due to the increased blood flow to their vagina. It's also possible that your girlfriend may be less interested in sex during her period due to the physical discomfort she is experiencing."
    },
    {
      "title": "Stomach pains and cramps.",
      "content": "Stomach pains and cramps. If you notice your girlfriend clutching her stomach in pain or applying a heating pad to her stomach, that's a big sign she is on her period. During their period, people who menstruate experience contractions in their uterus. These are pretty painful and result in cramps and stomach pain. [5] X Research source She might also be taking painkillers like Advil, Midol, or Pamprin to reduce the pain."
    },
    {
      "title": "Headaches.",
      "content": "Headaches. People who menstruate experience headaches during their period and the days leading up to it due to a change in estrogen and progesterone levels. During this time, your girlfriend's estrogen and progesterone levels are lower than usual, which can trigger headaches. If you notice her complaining about an unusually bad headache, she may very well be on her period. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Breast tenderness or swelling.",
      "content": "Breast tenderness or swelling. Fluctuation in progesterone and estrogen levels during your girlfriend's period can also cause these symptoms. As these hormone levels lower, your girlfriend's breasts might be more sensitive or swollen, and she may not be up to strenuous activities like running. [7] X Research source"
    },
    {
      "title": "Breakouts and acne.",
      "content": "Breakouts and acne. Fluctuating hormones can also trigger breakouts and acne. As estrogen and progesterone levels drop, your girlfriend's skin releases more sebum. This can clog pores and lead to breakouts like pimples, whiteheads, and blackheads. [8] X Research source"
    },
    {
      "title": "If you're in a serious relationship, respectfully ask.",
      "content": "If you're in a serious relationship, respectfully ask. If the two of you are in an intimate relationship, this is totally acceptable. You might want to know simply out of concern for her wellbeing, or it's also possible that you're interested in having sex and want to broach the subject. Approach the subject with care and don't push the issue if she doesn't want to talk about it. Say something like, \"Hey, I noticed you've been dealing with cramps this week. Are you on your period? No worries if you don't want to talk about it\" or \"Is everything alright? I hope you know you can tell me anything.\" The same risks apply when having sex while your girlfriend is on her period and when your girlfriend is not. Just talk about it first so that you both know what you're comfortable with. If you decide to go for it, consider laying out a towel. You can also opt for non-penetrative sex and other ways to be intimate during this time if you're not super comfortable with period sex."
    },
    {
      "title": "If she doesn't want to talk about it, you may not be able to know for sure.",
      "content": "If she doesn't want to talk about it, you may not be able to know for sure. If you've only been dating for a little while, it's possible your girlfriend isn't ready to share health information like this with you. Everyone is different, and your girlfriend might just be a little more private. Respect her decision if she doesn't want to talk about her period with you, and let her know you've always got her back. [9] X Research source Offer your support in a general sense if she doesn't want to share if she's on her period. Try, \"I'm here for you if you need anything!\" or \"You've always got me.\""
    },
    {
      "title": "Offer support.",
      "content": "Offer support. Your girlfriend is likely going through a lot right now, from difficult emotions to painful cramps. Simply knowing that you're there for her if she needs anything will go a long way. Offer to help in any way you can, and she'll likely really appreciate it. [10] X Research source Surprise her with chocolate or her favorite snacks when you see her. Keep a stash of tampons or other menstrual products at your house. Offer to grab pain medications like Advil, Midol, or Pamprin at the store."
    },
    {
      "title": "Be extra compassionate.",
      "content": "Be extra compassionate. During her period, your girlfriend may be less open to going out or spending time together. Try your best not to take this personally, and be patient with her. She might be experiencing pain or feeling down, and the best way to help her through that is by being respectful, kind, and understanding. [11] X Research source Be patient with your girlfriend if she's a little more moody than usual. Avoid triggering subjects that might make her mood worse. Consider waiting to bring up difficult subjects, like relationship issues, until her period has passed. Even if you know she's on her period, avoid mentioning it when she's in a bad mood. Something like, \"You're so mean when you're on your period\" might really hurt her feelings or upset her."
    },
    {
      "title": "Ask her what she needs.",
      "content": "Ask her what she needs. If you're not sure the best way to help, you can always talk to your girlfriend about it. Everyone's cycle is different, so her specific needs will be unique to her. Ask her specifically if there's anything you can do for her so that she can express her needs openly. \"Hey, I know you've been dealing with a lot this week. Is there anything I can do to help?\" \"I'm here for you if you need anything.\" \"I hope you know I'm always here for you! Let me know if I can help.\""
    },
    {
      "title": "Encourage her to see a doctor if her symptoms are severe.",
      "content": "Encourage her to see a doctor if her symptoms are severe. If your girlfriend experiences depression, anxiety, or suicidal ideation for a few weeks out of every month, it's possible that she may have Premenstrual Dysphoric Disorder. This is a more severe form of PMS. If you notice these signs, encourage her to visit a doctor. [12] X Research source You might say, \"I've noticed that you've been feeling really low the past couple of days. Do you think a doctor might be able to help figure out what's going on?\""
    },
    {
      "title": "The Menstrual Phase.",
      "content": "The Menstrual Phase. The entire menstrual cycle lasts about 28 days (though anywhere between 21 to 35 days is normal). This cycle is recurring and follows the same 4 phases each time, and a person's period occurs during the menstrual phase. This phase usually lasts about 5 days, and it describes when the uterine lining is shed through the vagina. During this time, the person who menstruates will usually bleed. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source 5 days is the average, but it's normal for menstruation to last between 2 to 7 days."
    },
    {
      "title": "The Follicular Phase.",
      "content": "The Follicular Phase. This phase typically starts on day 6 of the cycle, and lasts for about 14 days. During this time, the pituitary gland releases a follicle-stimulating hormone. This hormone causes the ovaries to release follicles, which contain small eggs. After 10-14 days, 1 egg will mature. [14] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "The Ovulation Phase.",
      "content": "The Ovulation Phase. This phase usually begins about 14 days into someone's cycle. During this time, the lining of the uterus thickens and the ovaries release the egg. The egg is then pushed through the fallopian tube, where it can be fertilized by sperm. [15] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "The Luteal Phase.",
      "content": "The Luteal Phase. This phase usually starts 15 days into a person's cycle, and lasts until the 28th. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source After ovulation, the egg turns into what's called the corpus luteum. The corpus luteum releases progesterone and estrogen, which thickens the lining of the uterus so the egg can implant. If no sperm fertilizes the egg, then the corpus luteum reabsorbs into the body. This decreases progesterone levels, which causes the uterine lining to shed. [17] X Research source"
    }
  ]
}