{
  "url": "https://www.wikihow.com/Start-Using-Dropbox",
  "title": "How to Start Using Dropbox",
  "steps": [
    {
      "title": "Go to https://www.dropbox.com/register in a web browser.",
      "content": "Go to https://www.dropbox.com/register in a web browser. This will open the Dropbox sign-up page. If you already have a Dropbox account, skip to the next part."
    },
    {
      "title": "Fill out your account information.",
      "content": "Fill out your account information. Enter the following information in the top-right side of the page: Full name - Type in your first and last name, separated by a space. Email - Type in a working email address (e.g., an email address that you can access with ease and to which you have the password). You'll use this email address to log into Dropbox. Password - Type in a password for your Dropbox account. You'll use this password to log into Dropbox."
    },
    {
      "title": "Check the \"I agree to Dropbox Terms\" box.",
      "content": "Check the \"I agree to Dropbox Terms\" box. This is below the \"Email\" field."
    },
    {
      "title": "Click Sign up for free.",
      "content": "Click Sign up for free . It's a blue button below the \"I agree\" box. Doing so will create your Dropbox account. At this point, you can download Dropbox to your computer. If you choose to do so, go to the last part of this article for instructions on installation and use."
    },
    {
      "title": "Open the Dropbox website.",
      "content": "Open the Dropbox website. Go to https://www.dropbox.com/home/ on a computer. This will open your Dropbox home page if you're already logged into Dropbox. If you aren't logged in, first enter your email address and password in the \"Email\" and \"Password\" fields, then click Sign in to continue."
    },
    {
      "title": "Review your \"My files\" page.",
      "content": "Review your \"My files\" page. You won't have any files here now, but this is where your files will appear after uploading some."
    },
    {
      "title": "Review the sorting options.",
      "content": "Review the sorting options. These are in the top-left corner of the page: Sharing - Any files or folders that you allow other Dropbox users to view/edit will appear here. File requests - View pending file requests, which are invitations you can send to people's email addresses to ask for certain files to be uploaded. You can also see uploaded files from file requests here. Deleted files - View files that you've deleted within the last 30 days. You can delete files here before 30 days are up to remove them permanently, or you can restore them."
    },
    {
      "title": "Make sure you're on the \"My files\" page.",
      "content": "Make sure you're on the \"My files\" page. If you clicked into any of the sorting options, click My files in the upper-left corner of the page to return to the \"My files\" page."
    },
    {
      "title": "Click Upload files.",
      "content": "Click Upload files . It's a blue button in the top-right side of the page. Doing so will open a File Explorer window (Windows) or a Finder window (Mac) where you can select files and folders to upload."
    },
    {
      "title": "Select files or folders to upload.",
      "content": "Select files or folders to upload. Click a file to select it (or click and drag the cursor across multiple files to select them), then click Open in the bottom-right corner of the window. Your selected items will begin uploading. You may first have to select a file's folder on the left side of the File Explorer or Finder window to find the file. To select individual files separately of each other, hold down Ctrl (Windows) or ⌘ Command (Mac) while clicking each file you want to select."
    },
    {
      "title": "Wait for your files to finish uploading.",
      "content": "Wait for your files to finish uploading. Once your files have been uploaded into Dropbox, you'll be able to access them from any computer or mobile device on which you're logged into Dropbox."
    },
    {
      "title": "Create a new folder.",
      "content": "Create a new folder. Click the New folder link on the right side of the page, type in a name for your folder, and press ↵ Enter . Once you've created your folder, you can click on its name to open it, or you can click and drag files into it to add them to the folder."
    },
    {
      "title": "Download a file.",
      "content": "Download a file. Click the checkbox to the left of a file, then click the Download link on the right side of the page. The file will download onto your computer. You can select multiple files for download by checking each one individually. You can also download folders."
    },
    {
      "title": "Exit Dropbox.",
      "content": "Exit Dropbox. Close the tab or window in which Dropbox is currently open to close the Dropbox page. You can return to it at any time, or you can use one of the mobile or desktop versions of Dropbox to upload files."
    },
    {
      "title": "Download Dropbox.",
      "content": "Download Dropbox. You can do so by searching for Dropbox in the App Store (iPhone) or the Google Play Store (Android)."
    },
    {
      "title": "Open Dropbox.",
      "content": "Open Dropbox. Tap the Dropbox app icon, which resembles a blue, open box on a white background. This will open the Dropbox sign-in page."
    },
    {
      "title": "Tap Sign In.",
      "content": "Tap Sign In . It's at the bottom of the screen."
    },
    {
      "title": "Enter your email address and password.",
      "content": "Enter your email address and password. Tap the \"Email\" field, type in your Dropbox account email address, and then tap the \"Password\" field and type in your Dropbox account password."
    },
    {
      "title": "Tap Sign In.",
      "content": "Tap Sign In . It's below the \"Password\" field. As long as your sign-in credentials are correct, this will take you to your Dropbox home page. You may have to tap Skip in the top-right corner of the screen a few times before you get to your Dropbox Home page."
    },
    {
      "title": "Review the Home page.",
      "content": "Review the Home page. This page shows your recent files, as well as notifications and a gear you can tap to open your Dropbox settings. You can always navigate back to the Home page by tapping Home in the bottom-left corner of the screen. On some Android platforms, this tab is called Recents instead."
    },
    {
      "title": "Review the other tabs.",
      "content": "Review the other tabs. There are three other tabs at the bottom of the screen: Files - This is where all of your uploaded files and folders will appear. Everything here will be organized by file type (e.g., FILES for documents and PHOTOS for photos). Photos - This tab is reserved specifically for the photos in your Dropbox. Offline - Any files or folders that you choose to make available offline will appear here. You can access these even when you have no Internet or cellular data connection. On Android, you must first tap ☰ in the top-left corner of the screen to see these options."
    },
    {
      "title": "Tap +.",
      "content": "Tap + . It's in the bottom-middle of the screen (iPhone) or in the bottom-right corner of the screen (Android). A pop-up menu will appear."
    },
    {
      "title": "Tap Upload Photos or Create or Upload File.",
      "content": "Tap Upload Photos or Create or Upload File . Both of these options allow you to upload a file from your phone. On Android, tap Upload photos or videos or Upload files . If you tap Create or Upload File , tap Upload File in the next page, then select a file location before continuing."
    },
    {
      "title": "Select a file to upload.",
      "content": "Select a file to upload. Tap the file(s) that you want to upload to Dropbox, then tap Next in the top-right corner of the screen. On Android, just tap the file(s) you want to upload, then tap UPLOAD in the bottom-right corner of the screen."
    },
    {
      "title": "Tap Choose a Folder….",
      "content": "Tap Choose a Folder… . This option is below the \"UPLOAD TO\" heading."
    },
    {
      "title": "Tap Set Location.",
      "content": "Tap Set Location . It's in the bottom-right corner of the screen."
    },
    {
      "title": "Tap Upload.",
      "content": "Tap Upload . It's in the top-right corner of the screen. Doing so will prompt the file to begin uploading to your Dropbox account. You can also change the file name before tapping Upload ."
    },
    {
      "title": "Download a photo.",
      "content": "Download a photo. Tap and hold a photo, then tap Save to Camera Roll in the pop-up menu. You can't download other files in Dropbox for mobile, but you can save photos to your camera roll if you like. On Android, tap v in the top-right corner of the screen, tap Export , and tap Save to device ."
    },
    {
      "title": "Open Dropbox's installation page.",
      "content": "Open Dropbox's installation page. Go to https://www.dropbox.com/install/ in your computer's browser."
    },
    {
      "title": "Click Download Dropbox.",
      "content": "Click Download Dropbox . It's a blue button in the middle of the page. Doing so will prompt the Dropbox installer to download onto your computer."
    },
    {
      "title": "Install Dropbox.",
      "content": "Install Dropbox. This process will differ depending on your computer's operating system: Windows - Double-click the DropboxInstaller file, click Yes when prompted, and then wait for Windows to install Dropbox. Mac - Double-click the Dropbox DMG file, verify the download , double-click the Dropbox icon, select \"I already have a Dropbox account\", and click Continue ."
    },
    {
      "title": "Sign in if prompted.",
      "content": "Sign in if prompted. Enter your Dropbox account's email address and password if Dropbox asks you to. If you just created an account, you shouldn't have to enter your account information."
    },
    {
      "title": "Select files to move to Dropbox.",
      "content": "Select files to move to Dropbox. This will vary depending on your computer's operating system: Windows - Open Start , click the File Explorer icon, select a file location on the left side of the window, select a file or folder, and press Ctrl + C . Mac - Open Finder , select a file location on the left side of the window, select a file or folder, click Edit , and click Copy' ."
    },
    {
      "title": "Open Dropbox.",
      "content": "Open Dropbox. To do so: Windows - Open Start , type dropbox into Start, and click the Dropbox icon. Mac - Open Spotlight , type dropbox into Spotlight, and click the Dropbox icon."
    },
    {
      "title": "Move your copied files into Dropbox.",
      "content": "Move your copied files into Dropbox. Press Ctrl + V on Windows, or press ⌘ Command + V on Mac. This will copy your files into the Dropbox folder, from which point they will upload to your Dropbox account. Once your files finish uploading, they're available to access from any computer or mobile device on which you're logged into Dropbox."
    }
  ]
}