{
  "url": "https://www.wikihow.com/Wash-Out-Hair-Dye",
  "title": "Easy Ways to Wash Out Hair Color",
  "steps": [
    {
      "title": "Rinse your initial hair dye with lukewarm water and don't shampoo for 2 days.",
      "content": "Rinse your initial hair dye with lukewarm water and don't shampoo for 2 days. Run water over your hair under a sink or faucet until the excess dye is gone and the rinsed water looks completely clear. [1] X Research source Once your hair is rinsed, leave it unwashed for 2 days—that gives your strands time to seal in the color. [2] X Research source Hot water opens your hair cuticles and allows more hair dye to leak and fade from your strands. [3] X Research source That’s why it’s better to rinse your hair with lukewarm (or even cool) water. When you do start washing your hair, stick with color-extending shampoos and color-extending conditioners to help protect your color, along with dry shampoo . [4] X Research source"
    },
    {
      "title": "Apply a color remover to dry hair to quickly strip the color away.",
      "content": "Apply a color remover to dry hair to quickly strip the color away. Beginning at your roots, apply the color remover to the entire length of your hair. Let the product sit for around 30 minutes before washing it out with shampoo. [5] X Research source Always double-check the label on your color remover before applying it to your hair. Some brands and products have more specific instructions."
    },
    {
      "title": "Wash your hair frequently with hot water to fade the color.",
      "content": "Wash your hair frequently with hot water to fade the color . You know the cardinal rules of applying hair dye—shampoo sparingly and avoid hot water, which both cause your dye to fade. [6] X Research source With this in mind, shampoo your hair in a hot shower as frequently as possible to maximize the potential fading. Shampooing too frequently can leave your hair dry and prone to breakage while also leaving your scalp uncomfortable and dry. Space out your shampoo sessions a little more if your hair and scalp are starting to feel the heat. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Blow-dryers and heat-styling tools can also make your hair extra dry. [8] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Try to avoid these items while you’re fading your hair dye."
    },
    {
      "title": "Lighten your strands",
      "content": "Lighten your strands with a vitamin C and shampoo paste. Crush up 5-10 vitamin C tablets and mix them with a standard portion of anti-dandruff or clarifying shampoo. Apply the mixture all over your strands and cover it up with a plastic shower cap. Then, let the vitamin C soak into your hair for 30 minutes before rinsing it out. [9] X Research source Vitamin C tablets can lighten your hair, but it may take multiple sessions before you get the results you want."
    },
    {
      "title": "Coax the dye out of your hair naturally with olive oil.",
      "content": "Coax the dye out of your hair naturally with olive oil. Lather your hair with olive oil before you head to bed—just make sure that your strands are completely covered. Then, just wrap up your hair in a towel and go to sleep. The next morning, hop in the shower to shampoo and rinse your hair. [10] X Research source If you don’t have olive oil on hand, any kind of vegetable oil will work in its place."
    },
    {
      "title": "Switch to anti-dandruff shampoo for a dye-stripping clean.",
      "content": "Switch to anti-dandruff shampoo for a dye-stripping clean. Over the next few trips to the shower, lather your dyed hair up with anti-dandruff shampoo instead of your usual product. Leave the shampoo in your hair for a couple minutes longer than you usually would before rinsing it out. Then, coat your hair with conditioner so it doesn’t dry out. [11] X Research source Anti-dandruff shampoo can really dry out your hair, so it’s super important to apply conditioner each time. Anti-dandruff shampoo works best for fading semi-permanent hair dye. For an extra dye-stripping kick, combine equal amounts of baking soda and anti-dandruff shampoo together into a pasty shampoo. Rub the mixture all over your hair and leave it there for up to 5 minutes."
    },
    {
      "title": "Fade your hair dye gradually with clarifying shampoo.",
      "content": "Fade your hair dye gradually with clarifying shampoo . Lather your hair up with clarifying shampoo the next 10-15 times you hop into the shower. Over time, the shampoo clears away the color from your strands. [12] X Research source Clarifying shampoo is designed to remove build-up from your hair—not hair dye. While it will fade your hair dye eventually, it won’t yield any overnight results."
    },
    {
      "title": "Strip the dye from your hair with a dish soap-shampoo mixture.",
      "content": "Strip the dye from your hair with a dish soap-shampoo mixture. Squeeze a few drops of dish soap into your shampoo and lather it into your hair. Wait 10 minutes for the mixture to soak into your hair before rinsing and applying your usual conditioner. [13] X Research source You’ll need to wash your hair with dish soap several times before you notice any major results. [14] X Research source Dish soap dries out your hair a lot too, so be sure to apply conditioner each time you use it."
    },
    {
      "title": "Lighten your hair naturally",
      "content": "Lighten your hair naturally with lemon juice . Fill a large bowl with 4 c (950 mL) of water and 5 US tbsp (74 mL) of lemon juice. Pour the lemon water all over your strands and give it 30 minutes to soak in. [15] X Research source Always rinse out your hair after the 30-minute mark—lemon juice is super acidic and leaves your hair feeling dry. To give your hair a boost, apply your go-to conditioner after trying this treatment."
    },
    {
      "title": "Lift your hair dye gradually with chamomile tea.",
      "content": "Lift your hair dye gradually with chamomile tea . Before your next shower, whip up a mug or 2 of chamomile tea, giving it 10 minutes to steep. When you’re ready to rinse out your shampoo, use the cooled chamomile tea instead of regular shower water. [16] X Research source Use chamomile tea to rinse your hair for multiple showers and see if you notice a difference."
    },
    {
      "title": "Apply a honey mixture to your hair",
      "content": "Apply a honey mixture to your hair for a lightening boost. Mix equal amounts of honey and warm water together and massage the mixture directly into your hair. Then, wrap up your hair in a towel and wait 30 minutes for the treatment to soak in. Once time is up, jump in the shower and wash out the honey with shampoo. [17] X Research source Honey treatments work especially well with a fresh dye job."
    },
    {
      "title": "Spend some time out in the sun to fade your hair over time.",
      "content": "Spend some time out in the sun to fade your hair over time. Is there sun in the forecast? Take advantage of the bright weather by heading outside for a while. Leave your hair down as much as possible so it can soak up a ton of rays and start to fade. [18] X Research source Sun fading can take a long time to yield any real results, and some people don’t notice any major difference after spending lots of time outside. If you’re looking for quick results, you might have better luck with a color remover or shampoo-based treatment."
    },
    {
      "title": "Clean your skin naturally with a little bit of lemon juice.",
      "content": "Clean your skin naturally with a little bit of lemon juice . Soak a cotton ball in lemon juice and scrub down the dye stain. It might take a few minutes, but the constant rubbing will eventually lift away some of the dye. [19] X Research source"
    },
    {
      "title": "Wipe down the dye with makeup remover.",
      "content": "Wipe down the dye with makeup remover . Makeup remover is designed to go on your skin, so it’s far less likely to cause any irritation. Grab a bottle of makeup remover or just use a wipe to clear the leftover dye away from your skin. [20] X Research source This is a pretty gentle option, so it might not clear away more extreme stains."
    },
    {
      "title": "Rub over the stain with hand sanitizer.",
      "content": "Rub over the stain with hand sanitizer . It doesn’t get much simpler than this—just squeeze a dollop of sanitizer onto the stain, rub it all over, and give it a couple of minutes to soak in. When you wipe off the hand sanitizer, the dye will start to disappear with it. [21] X Research source Don’t be discouraged if you don’t see results at first—it may take a few rounds before you notice any major improvements."
    },
    {
      "title": "Scrub baking soda-based toothpaste",
      "content": "Scrub baking soda-based toothpaste into the stain. Squeeze a small glob of toothpaste on your fingertip and rub it all over the dye stain on your skin. For extra scrubbing power, apply the toothpaste with a rag or soft-bristled toothbrush instead. [22] X Research source Only use baking soda-based toothpaste for this—gel products won’t work."
    },
    {
      "title": "Blot the dye away",
      "content": "Blot the dye away with nail polish remover. Soak a cotton ball in acetone and gently dab it onto the dye stain. Make sure you go as quickly as you can—acetone tends to be irritating, so you don’t want it sitting on your skin for very long. Once you’ve cleared away all the dye, rinse the nail polish remover off. [23] X Research source Patch-test a tiny section of the stain with the acetone first to make sure your skin doesn’t have a bad reaction."
    },
    {
      "title": "Massage a mixture of dish soap and baking soda into the dye stain.",
      "content": "Massage a mixture of dish soap and baking soda into the dye stain. Mix equal amounts of baking soda and dish soap together to create a gritty paste. After wetting your hands, rub the paste directly into the dye stain to clear it away. [24] X Research source"
    },
    {
      "title": "Remove brown or black dye stains with oxygen bleach and chlorine bleach.",
      "content": "Remove brown or black dye stains with oxygen bleach and chlorine bleach . Pre-teat your garment with detergent and rinse it out completely before soaking it in a diluted oxygen bleach solution for 1 hour. If the stain still doesn’t go away, soak the clothing item in a diluted chlorine bleach solution for 15 minutes. Bleach might not be the best option for bright clothes or garments made with certain materials (like silk). [25] X Research source If you can’t treat your garment with bleach, wash it with a commercial color remover instead. To protect your synthetic clothing, keep your water temperature less than 160 °F (71 °C). Make a diluted oxygen bleach mixture by stirring 1-2 tbsp (28.3-56.7 g) of product into 1 US gal (3.8 L) of water. [26] X Research source Check your chlorine bleach bottle to find the correct dilution for your laundry."
    },
    {
      "title": "Get rid of bright dye stains using dish soap, ammonia, and white vinegar.",
      "content": "Get rid of bright dye stains using dish soap , ammonia , and white vinegar . Lay the garment in a cleaning solution prepared with 1 US qt (0.95 L) of warm water, 1 ⁄ 2 tsp (2.5 mL) of dish detergent, and 1 US tbsp (15 mL) of ammonia. After about 15 minutes, lift the clothing out of the mixture and rub along the back section of the stain to loosen it from the fabric. Let the garment soak for an extra 15 minutes before rinsing it out with clean water. For extra stain-fighting power, immerse the item in a diluted vinegar mixture for a half hour. [27] X Research source The back section of the stain might be on the inside of the garment. Is the stain still there? Wash it with either chlorine or oxygen bleach, depending on what the care label allows."
    },
    {
      "title": "Spot-treat dye stains with rubbing alcohol.",
      "content": "Spot-treat dye stains with rubbing alcohol . Dip a clean cloth in rubbing alcohol and blot the stain—with any luck, the dye will soak into the rag. Using warm water, rinse off the clothing item and stick it in a warm wash cycle. [28] X Research source If you don’t have any rubbing alcohol on hand, use a little bit of hairspray instead."
    },
    {
      "title": "Confirm that the stain is gone before tumble-drying the garment.",
      "content": "Confirm that the stain is gone before tumble-drying the garment. Reapply the stain treatment if the dye doesn’t come out right away—it might take several tries before you notice any major results. Heat sets stains into fabric, so don’t tumble-dry the clothing item until you’re absolutely sure that the stain is gone. [29] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source"
    },
    {
      "title": "Erase carpet and upholstery stains with dish soap, vinegar, and rubbing alcohol.",
      "content": "Erase carpet and upholstery stains with dish soap, vinegar , and rubbing alcohol . Treat the stain for 30 minutes with a mixture of 1 US tbsp (15 mL) of dish soap, 1 US tbsp (15 mL) of white vinegar, and 2 c (470 mL) of cool water. Using a clean cloth or sponge, blot up the mixture with cool water and go over it again with rubbing alcohol. As you soak up the alcohol, watch as the dye gets pulled out of your upholstery or carpet. If the dye doesn’t go away, treat the stain with a mixture of 1 tsp (4.9 mL) dish detergent, 1 US tbsp (15 mL) of ammonia, and 2 c (470 mL) of warm water for 30 minutes. For better results, switch out your cleaning cloth every 5 minutes with a new, freshly-soaked rag."
    },
    {
      "title": "Use diluted bleach to get rid of tile stains.",
      "content": "Use diluted bleach to get rid of tile stains. Grab a clean washcloth and dip it in a diluted bleach mixture. Then, drape the rag over the dye stain until it completely fades. To get rid of any leftover bleach, wipe down the clean tile with water. [30] X Research source Dilute your bleach by adding 4 tsp (20 mL) of it to 1 US qt (0.95 L) of lukewarm water. [31] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source This remedy works on different types of tiles, but it never hurts to be cautious. Rub a tiny bit of diluted bleach on your tile and grout to make sure the cleaning mixture doesn’t harm the material first. [32] X Research source"
    },
    {
      "title": "Clean a dye-stained porcelain sink with dish soap.",
      "content": "Clean a dye-stained porcelain sink with dish soap . Create some sudsy water with your dish soap and pour a little bit on top of your dye stains. Wait 5-10 minutes for the dish soap to work its magic and strip away the dye. If the stain doesn’t completely fade away, blot up the old water and pour a new batch of sudsy water on top. [33] X Research source Nail polish remover is another quick and easy solution for a dye-stained sink."
    }
  ]
}