{
  "url": "https://www.wikihow.com/Sync-Apple-Books",
  "title": "How to Sync Apple Books",
  "steps": [
    {
      "title": "Open Settings .",
      "content": "Open Settings . You'll find this grey gear app icon on one of your Home screens or inside the Utilities folder. You'll need to repeat these steps for both your iPhone and iPad to sync books on each device."
    },
    {
      "title": "Tap your name.",
      "content": "Tap your name. This is next to your profile picture at the top of the menu."
    },
    {
      "title": "Tap iCloud.",
      "content": "Tap iCloud . It's next to an icon of a cloud in the second grouping of menu options."
    },
    {
      "title": "Tap the toggle next to \"Books\" to turn it on .",
      "content": "Tap the toggle next to \"Books\" to turn it on . This setting turns on iCloud Books for all devices using that Apple ID."
    },
    {
      "title": "Tap the toggle next to \"iCloud Drive\" to turn it on .",
      "content": "Tap the toggle next to \"iCloud Drive\" to turn it on . All your notes, bookmarks, and annotations will be stored in your iCloud Drive."
    },
    {
      "title": "Tap Apple ID.",
      "content": "Tap Apple ID . You'll see this in the top left corner of your screen and you'll return to the Apple ID page of the Settings menu."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . You'll see this in the top left corner of your screen and you'll return to the main page of the Settings menu."
    },
    {
      "title": "Tap Books.",
      "content": "Tap Books . It's in the sixth grouping of menu options next to an icon of an open book."
    },
    {
      "title": "Tap the toggle next to \"Reading Now\" to turn it on .",
      "content": "Tap the toggle next to \"Reading Now\" to turn it on . This option is under the \"Syncing\" header."
    },
    {
      "title": "Tap the toggle next to \"iCloud Drive\" to turn it on .",
      "content": "Tap the toggle next to \"iCloud Drive\" to turn it on . Now your Books on your iPhone, iPad, and iPod Touch will sync across other iOS devices."
    },
    {
      "title": "Click the Apple Logo .",
      "content": "Click the Apple Logo . It's usually in the top left corner of your screen."
    },
    {
      "title": "Click System Preferences.",
      "content": "Click System Preferences . This option is the second option in the menu that drops down."
    },
    {
      "title": "Click iCloud.",
      "content": "Click iCloud . You'll see this next to an icon of a cloud in the third row. If you're not signed in, sign in now."
    },
    {
      "title": "Click the box next to \"iCloud Drive\" to enable it.",
      "content": "Click the box next to \"iCloud Drive\" to enable it. After you've enabled iCloud Drive, you'll see another button appear."
    },
    {
      "title": "Click Options next to \"iCloud Drive.",
      "content": "Click Options next to \"iCloud Drive. \" You won't see this box if you don't have iCloud Drive enabled."
    },
    {
      "title": "Click to check the box next to \"Books\" to enable it.",
      "content": "Click to check the box next to \"Books\" to enable it. It's under the \"Documents\" tab."
    },
    {
      "title": "Click Done.",
      "content": "Click Done . The System Preferences window will close, but to completely sync your Books, you'll need to enable sync within the Books app on Mac."
    },
    {
      "title": "Open Books.",
      "content": "Open Books. You'll find this in the Applications folder in Finder or on the Dock."
    },
    {
      "title": "Hover over Books and click Preferences.",
      "content": "Hover over Books and click Preferences . When you hover your mouse over \"Books\" in the menu at the top of your screen, a menu will drop-down."
    },
    {
      "title": "Click the General tab.",
      "content": "Click the General tab. It's the icon if a light switch you'll find near the top of the window."
    },
    {
      "title": "Click to check the box next to \"Sync bookmarks, highlights, and collections across devices.",
      "content": "Click to check the box next to \"Sync bookmarks, highlights, and collections across devices. \" You'll see this to the right of the header, \"Sync.\" After you've enabled this setting, your books and any notes should sync across all your Apple devices. If your books aren't syncing after you've enabled these settings across all your devices, uninstall and reinstall the Books app. If that doesn't solve your issue, go to Settings > iCloud and switch off iCloud for a few moments before switching it back on. [1] X Research source"
    }
  ]
}