{
  "url": "https://www.wikihow.com/Store-Onions",
  "title": "How to Store Onions",
  "steps": [
    {
      "title": "Store late-season onions.",
      "content": "Store late-season onions. The onions you harvest in the spring and summer are not hardy enough to store. They should be eaten within a few weeks of harvesting. Plan to store onions that are harvested in the fall, since these varieties are able to last through the winter. [1] X Research source If you grow your own onions, plan to store onions that you plant during the spring. Onions are ready to harvest for storage in the late summer or early fall, when the top of the plant begins to fall over and dry up."
    },
    {
      "title": "Store pungent onions.",
      "content": "Store pungent onions. Pungent onions, as opposed to mild onions, have sulfurous compounds that cause you to tear up when you chop them and also help preserve the onions through the winter. Mild onions don't have this self-preservation system, so they should be eaten a few weeks after they're harvested. The following varieties of globe onions do well in long-term storage: [2] X Research source Yellow onions such as ebenezer, yellow globe, downing yellow globe, and yellow globe danvers. White onions such as Southport white globes. These should only be stored if their necks are small. Red onions including wethersfield and Southport red globe."
    },
    {
      "title": "Dry the onion skins.",
      "content": "Dry the onion skins. After the onions are harvested, spread them out in a ventilated area so that the skins can harden. Do not remove the leaves. Allow the onions to cure for two to four weeks. [3] X Research source Dry the onions in an area away from sunlight and humidity. Sunlight can taint the taste of the onions and make them bitter. Lay a tarp in your garage or a shed. The environment should be dry, warm and breezy. The onions are finished curing when their stems are no longer green. The onions' skin should be withered around the stem and wrapped tightly around the onions."
    },
    {
      "title": "Trim the onions.",
      "content": "Trim the onions. Once the stems are completely dry, use sharp scissors or a knife to trim the roots from the onions. Discard onions that still have green stems at this point, as well as those that are bruised or have broken paper. Cut the leaves at least an inch above the bulb, or leave them intact and braid the leaves together."
    },
    {
      "title": "Choose a cool, dark place to store your onions.",
      "content": "Choose a cool, dark place to store your onions. The space should have a temperature maintained between 40 to 50° Fahrenheit, or 4 to 10° Celsius. Many people opt to store their onions in a root cellar or basement. If the space is too warm, your onions will begin to sprout. If the location you chose is too cold, the onions will start to rot. [4] X Research source"
    },
    {
      "title": "Keep the storage space dry.",
      "content": "Keep the storage space dry. Onions easily absorb moisture, and the wetness in the air will rot your produce. The humidity level should be kept at 65 to 70 percent. [5] X Research source"
    },
    {
      "title": "Make sure the space is well ventilated.",
      "content": "Make sure the space is well ventilated. Keeping air flowing around the onions will help prevent molding and rotting. For good ventilation, hang the onions in mesh baskets, netted bags or pantyhose. If you decide to use pantyhose as a storage option, tie a knot between each bulb. Use the bulbs from the bottom, cutting the onion out below the knot so the onion above it stays secure. You can also use string or twist ties in between the onions to keep them separate."
    },
    {
      "title": "Try storing your onions in pantyhose.",
      "content": "Try storing your onions in pantyhose. Yes, you heard right — pantyhose. Tie off the bottom of the pantyhose, introduce an onion into the sleeve, and tie off the pantyhose again just above the onion. Introduce the next onion into the sleeve and repeat until the pantyhose sleeve is tied off with as many onions as it can fit. [6] X Research source Storing onions in this way allows them to breathe properly. Any moisture they may have already come in contact with will soon evaporate, giving your angiosperms a longer shelf life."
    },
    {
      "title": "Use thick-necked bulbs first.",
      "content": "Use thick-necked bulbs first. The thick-necked bulbs are the oldest and will not last as long as the younger, smaller onions."
    },
    {
      "title": "Inspect stored onions regularly.",
      "content": "Inspect stored onions regularly. Take a moment every now and then to browse over your onions. Throw out any that have started to rot. You can still eat onions that have started to sprout. Just chop away the green part before using them in a recipe. [7] X Research source If an onion is slimy or discolored, don't risk eating it. Save extra bulbs to plant in the spring."
    },
    {
      "title": "Store peeled onions in the freezer.",
      "content": "Store peeled onions in the freezer. Chop your onions and place them in a flat layer on a cookie sheet and freeze. After they are frozen, remove the onions from the sheet and store them in Ziploc bags or storage containers in the freezer. One of the down sides of this option is limited storage space. [8] X Research source"
    },
    {
      "title": "Wrap leftover onions and store them in the refrigerator.",
      "content": "Wrap leftover onions and store them in the refrigerator. When cooking, partial onions often remain from preparing the meal. To properly store these remnants for use later, wrap the onion in plastic and place in the vegetable drawer in the refrigerator. [9] X Research source"
    }
  ]
}