{
  "url": "https://www.wikihow.com/Treat-a-Viral-Infection",
  "title": "How to Treat a Viral Infection",
  "steps": [
    {
      "title": "Get plenty of rest.",
      "content": "Get plenty of rest. Your body needs rest to fight off the virus. When your body gets infected with a virus, it works overtime to keep functioning while also fighting off your infection. Because of this, it's important to rest. Take a day or two off work or school and do low-energy activities like watching a movie or sleeping in bed. [1] X Research source Other low-energy activities you can do if you can’t sleep include: Reading a book, catching up on your favorite TV show, listening to music in bed, and calling someone on the phone. Be aware that antibiotics are not effective against viral infections and that, in general, you need to simply rest and allow your body to combat the virus."
    },
    {
      "title": "Drink lots of fluids.",
      "content": "Drink lots of fluids. Viral infections frequently lead to dehydration. When you become dehydrated, your symptoms will get worse; it's a vicious cycle that you should try to break out of by drinking plenty of liquids. Drink water, tea, natural juice, and drinks with electrolytes to stay hydrated. Try to stay away from alcohol or caffeinated beverages, as these types of drinks can actually dehydrate you further."
    },
    {
      "title": "Isolate yourself for a couple of days.",
      "content": "Isolate yourself for a couple of days. You don't want to get anyone else sick. Viruses are contagious, which means that you can actually pass the virus to others, making them sick as well. Being around other people can also put you at risk of being exposed to other microorganisms like bacteria, which could make you more sick than you already are. Take at least two days off of work or school to avoid getting other people sick. If you absolutely have to go into work or school, wear a mask to prevent others from becoming infected. The mask will prevent contagious particles from spreading through the air, especially if you are coughing or sneezing."
    },
    {
      "title": "Use a humidifier so you can breathe.",
      "content": "Use a humidifier so you can breathe. The humid air can help ease your congestion and cough. It's especially helpful to use a humidifier in your room at night as you try to fall asleep. This will help you to sleep better, and a better quality sleep equates to improved healing capacity. Be sure that your humidifier is clean to prevent any air contamination (such as with molds) that could potentially worsen your symptoms rather than improve them."
    },
    {
      "title": "Suck on lozenges or gargle saltwater for a sore throat.",
      "content": "Suck on lozenges or gargle saltwater for a sore throat. Sometimes a virus will leave you suffering from a sore throat. If that happens, consider purchasing lozenges from your local pharmacy or drugstore. Not only does sucking on something help to ease throat pain, but many lozenges also contain local anesthetic to slightly numb your throat and to further reduce pain. Gargling saltwater (a quarter to half of a teaspoon of salt in one cup of water is recommended) is another way to ease the pain of a sore throat. Reader Poll: We asked 126 wikiHow readers and 63% of them said that they like to use lozenges to relieve a sore throat . [Take Poll]"
    },
    {
      "title": "Try to eat some chicken soup.",
      "content": "Try to eat some chicken soup. Chicken soup really can help you feel better. If you have ever wondered why people always give their kids chicken noodle soup when they are sick, it's because chicken soup is a wonder when it comes to recovering from a virus. Not only does chicken soup act as an anti-inflammatory, it also temporarily helps to relieve congestion by unblocking your nasal passages. You can also add onions, garlic, and other veggies to your soup to boost its vitamin and mineral count."
    },
    {
      "title": "Eat foods that are rich in vitamin C.",
      "content": "Eat foods that are rich in vitamin C. Vitamin C is considered a powerful immune system boosters. Because of this, it is recommended to increase your intake of vitamin C while you are dealing with a virus. [2] X Research source Aside from taking a vitamin C supplement, you can also: Eat fruits that have high amounts of vitamin C. These include grapefruit, kiwi, strawberries, lemon, lime, blackberries, oranges, papaya, pineapple, pomelo, and raspberries. [3] X Research source Eat vegetables that are rich in vitamin C. These include Brussel sprouts, broccoli, onions, garlic, red and green peppers, tomatoes, and radishes. You can also consider making vegetable soup, if you don’t like eating raw veggies. [4] X Research source"
    },
    {
      "title": "Increase the amount of zinc you get each day.",
      "content": "Increase the amount of zinc you get each day. Zinc activates your immune system to fight against infection. Most people choose to take a 25 mg zinc supplement before one meal each day, but you can also add zinc-rich foods to your diet. These foods include spinach, mushrooms, beef, lamb, pork or chicken, and cooked oysters. Zinc has been shown to be most effective when taken for two to three days at the beginning of a cold or flu. Start taking zinc as soon as you think you may be getting sick. You can also purchase lozenges that contain zinc, which you can suck on. You can buy these and other zinc supplements at your local pharmacy. Do not take zinc supplements if you take antibiotics (such as tetracyclines, fluoroquinolones), Penicillamine (a drug used in Wilson’s disease), or Cisplatin (a medication used in cancer), due to the fact that zinc decreases the efficiency of these drugs."
    },
    {
      "title": "Consume more echinacea.",
      "content": "Consume more echinacea. Echinacea is often made into a tea or taken as a supplement. When consumed, it helps to increase the number of leukocytes (white blood cells that boost your immunity) and other immune-related cells in your body. You can consume echinacea by drinking tea or juice made from the plant, or by taking supplements bought at a pharmacy or health foods store. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Other natural remedies to consider include eucalyptus, elderberry, honey, and reishi and shiitake mushrooms."
    },
    {
      "title": "Take over-the-counter pain relievers.",
      "content": "Take over-the-counter pain relievers. These drugs can help fight pain and fever caused by a viral infection. [6] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source If you have a cold or the flu, chances are some of your symptoms include a fever and a headache. Acetaminophen (Tylenol) and Ibuprofen (Advil) work to reduce the pain you feel. Acetaminophen also helps to bring your fever down. You can get these drugs at any pharmacy. The regular, adult dose for Acetaminophen is 325-650 mg tablets, one tablet every four hours. Read the bottle to learn about other doses, such as those for children. [7] X Research source The regular, adult dose for Ibuprofen is 400-600 mg, once every six hours until your symptoms ease up. [8] X Research source"
    },
    {
      "title": "Consider a nasal spray to unblock your nose.",
      "content": "Consider a nasal spray to unblock your nose. Saline sprays can help you feel less congested. [9] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source There are different types of nasal sprays on the market and its important to be able to distinguish between them. Saline sprays are safe for all ages and can hydrate your nasal passages. There is evidence that using a saline spray may reduce nasal secretions and the use of decongestants. Nasal decongestants, such as Afrin, are only recommended if you have severe congestion problems, because using a nasal spray too often can cause your symptoms of congestion to rebound after you stop using the spray. They should be used no longer than three days in a row to avoid rebound, and should not be used on children. Corticosteroid nasal sprays, such as Flonase, are generally used to treat chronic symptoms, as it may take several days before you notice any improvement. Still, they can sometimes be helpful in combatting the symptoms of a viral infection. Talk to your doctor, and do not use corticosteroid medication on children under four. [10] X Research source"
    },
    {
      "title": "Opt for a cough syrup if you have severe symptoms.",
      "content": "Opt for a cough syrup if you have severe symptoms. Just make sure the ingredients aren't in other medicines you're taking. [11] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source When considering an over-the-counter cough syrup, the main thing to look at is the list of ingredients. In particular, look for the presence of decongestants, antihistamines, and/or pain relievers combined with the cough syrup on the ingredient list. The reason you want to be aware of this is so that you do not double up on your medications and accidentally overdose (for instance, if a pain killer is included in your cough syrup, you will not want to take an over-the-counter pain killer on top of that). Over-the-counter preparations are safe in adults, as long as careful attention is paid to not accidentally double up on any of the ingredients with other medications. Avoid using cough syrups in children under the age of two. Examples of terms to watch for include antitussive, which is a cough suppressant; mucolytic, which breaks up and loosens mucus."
    },
    {
      "title": "See a doctor if you have a weakened immune system.",
      "content": "See a doctor if you have a weakened immune system. Some conditions could make your infection worse. While viral infections are generally not super dangerous, they can be to people who already have a weakened immune system or chronic respiratory problems such as asthma or COPD. If you have cancer, diabetes, HIV/AIDS, or another immunity disorder, you should talk to your doctor immediately if you develop a viral infection. [12] X Research source"
    },
    {
      "title": "Seek professional medical care if you have a more severe virus.",
      "content": "Seek professional medical care if you have a more severe virus. Your doctor will advise you on the best treatment. [13] X Research source Certain viruses require professional medical care and treatment, in order to give you the best chance of a cure moving forward. Signs that you have a more severe illness and should see your doctor include: [14] X Research source Developing a rash A high fever generally more than 103°F (39.4°C) Getting worse after starting to feel better Prolonged symptoms for longer than 10 days A cough that brings up colored phlegm Wheezing or trouble breathing"
    },
    {
      "title": "Get vaccinated to prevent viruses in the future.",
      "content": "Get vaccinated to prevent viruses in the future. There are vaccines against a number of viruses. Talk to your doctor about getting vaccinated against certain viruses. There is no vaccine for the common cold, but you should get vaccinated against the flu virus every season. There are vaccines for other viruses, such as HPV (Human Papilloma Virus), chickenpox, and shingles. Be mindful of the fact that getting vaccinated involves getting a shot or two; however, this should not deter you — the benefits of the vaccine are worth the short period of discomfort the shot causes."
    }
  ]
}