{
  "url": "https://www.wikihow.com/Survive-Being-Lost-in-the-Forest",
  "title": "How to Survive Being Lost in the Forest",
  "steps": [
    {
      "title": "Take deep breaths and stay calm.",
      "content": "Take deep breaths and stay calm. Panic will hinder you from finding your way out of the woods if you are lost, so take a moment to collect yourself before moving forward. Close your eyes and take deep breaths to reduce your anxiety. If it helps, sit down and rest for a moment while you calm down. [1] X Research source"
    },
    {
      "title": "Retrace your steps mentally.",
      "content": "Retrace your steps mentally. Think back to the path you took to your current position. Ask yourself if you walked in a straight line or zigzag pattern, and if you travelled uphill or downhill. If you have a map, look at it and try to trace the path you took. [2] X Research source"
    },
    {
      "title": "Check for your phone for a signal and preserve its battery life.",
      "content": "Check for your phone for a signal and preserve its battery life. If you are lost in the forest, it will likely be difficult to get a signal on your phone. Check to see if you have reception and make an emergency call if you do, or use the GPS features on your phone to figure out your whereabouts. Put the phone on battery saver mode or turn it off when you are not using it to keep battery power for as long as possible. If you do not get a signal on your phone at first, check again later at different location points in the forest."
    },
    {
      "title": "Search for familiar sights or sounds.",
      "content": "Search for familiar sights or sounds. If you are lost in the woods, try to identify your position by observing your surroundings carefully. Look for any landmarks that you might recognize, such as mountains, and try to remember what direction they were in relation to you. Listen for familiar sounds that might give you clues about where you are, such as traffic or running water."
    },
    {
      "title": "Mark your trajectory.",
      "content": "Mark your trajectory. Choose a direction to walk in and leave a trail behind you. If the path you take leads you in the wrong direction, you will be able to find your way back, if necessary. Use twigs, stones, or other noticeable markers. [3] X Research source Follow the path that you think has the best chance of leading you out of the forest. If you are unsure, choose the path that looks the most clear and easy to navigate. Do not travel more than an hour or two before turning back to ensure that you can make it back to your starting point."
    },
    {
      "title": "Call out to get someone’s attention.",
      "content": "Call out to get someone’s attention. Even if you don’t hear any signs of people nearby, it is worthwhile to call out for help in case someone hears it. Call out as often as possible, 3 times in a row each time, which will allow people to listen more carefully if they can’t make out your voice the first time. If people are out looking for you, they will be listening intently for signs that you’re around. [4] X Research source Yell things like, “Can anybody hear me?” or “I’m lost and I need help!” If you have a whistle with you, blow it often as well. Follow the 3-time rule and add a vocal call after each whistle to increase the chance of being heard."
    },
    {
      "title": "Make your shelter visible.",
      "content": "Make your shelter visible. Do your best to draw attention to your location by laying out any bright items that you have, preferably across tree branches so they’re high. Keep a fire burning, which will be visible at night. To make your fire visible during the day, throw fresh grass or leaves on it to make it smoky. [5] X Research source During the day, you can also use a mirror to flash up at the sun and send out a glaring reflection that will be visible up to 100 metres (330 ft) away."
    },
    {
      "title": "Find a clear spot that is safe from the wind.",
      "content": "Find a clear spot that is safe from the wind. Look for a spot in the woods that is sheltered from the wind by trees. Make sure that the ground where you will start the fire and the surrounding area is clear of dry vegetation. This will eliminate the risk of your fire spreading. Start the fire on clear ground, or on a layer of stones."
    },
    {
      "title": "Collect tinder materials.",
      "content": "Collect tinder materials. Browse through the surrounding area to find dry, easy-to-burn materials to start your fire. Dead leaves, grass, pine needles, and shredded tree bark make excellent tinder. Inner bark, found under the outer layer, can be used as tinder but it must be torn or scraped off a tree, then dried enough to be burnable. [6] X Research source"
    },
    {
      "title": "Find kindling.",
      "content": "Find kindling. Birch tree bark, which is the white, papery, outer layer of the tree, is the best bet for kindling as it burns exceptionally well even in damp conditions. Thicker tree bark, such as cedar and juniper, will be more difficult to light but is good for maintaining a fire. Small twigs, leaves, and large pieces of tree bark are good choices for kindling."
    },
    {
      "title": "Find dead, dry wood logs.",
      "content": "Find dead, dry wood logs. You will need an assortment of wood logs, ranging in size, to maintain your fire. Find pieces of wood that are dried out and free of mold. If you have an axe or large knife, cut bigger trunks of wood into smaller pieces that will fit on the fire. Once your fire is started, you can place damp pieces of wood near the heat to dry out for future use. Logs that are about 15–20 inches (38–51 cm) long are the ideal size."
    },
    {
      "title": "Start a fire with tinder and kindling.",
      "content": "Start a fire with tinder and kindling. Build a fire by placing tinder on the ground, wadded into a cluster that is approximately 4 inches (10 cm) in diameter. Start piling kindling around it in a teepee-like structure, leaving a small opening on one side. Reach into the opening to light the tinder by: Using a lighter or matches Using sticks Using an emergency fire starter"
    },
    {
      "title": "Add wood logs to the fire.",
      "content": "Add wood logs to the fire. Once the tinder and kindling catch fire, add 4 or 5 pieces of wood to the fire in a teepee-like formation. Make sure that there is enough air circulation through the pieces of wood to give your fire enough oxygen to keep burning. Monitor the fire and add a log or 2 every couple of hours, or whenever it looks like it is dwindling."
    },
    {
      "title": "Find a large branch and lean it against a tree.",
      "content": "Find a large branch and lean it against a tree. Look for a thick, sturdy branch that has broken off of a tree. The branch should be taller than you. Lean the branch up against a large sturdy tree, at an angle that will accommodate your height when sitting. [7] X Research source Dig the bottom end of the branch about 3–4 inches (7.6–10.2 cm) into the ground to ensure that your shelter will be sturdy. If you have any rope or string, secure the branch to the tree as tightly as possible. You can also use shoelaces or thin strands of bark. Avoid using a damp or rotten branch."
    },
    {
      "title": "Prop smaller branches along the larger branch at 45 degree angles.",
      "content": "Prop smaller branches along the larger branch at 45 degree angles. Find smaller branches that are also thick and sturdy. Prop these branches up against the larger branch to form an inverse \"V\" shaped shelter. Dig the bottom parts of these branches about 2–3 inches (5.1–7.6 cm) into the ground and secure them to the larger branch with rope, string, shoelaces, or bark, if possible. [8] X Research source"
    },
    {
      "title": "Make pine resin glue.",
      "content": "Make pine resin glue. Look for evergreen trees such as pine, spruce, fir, or cedar and inspect their bark carefully. If you see sap running own, collect it in whatever container you have available. Add an equal amount of finely ground grass or crushed charcoal to the sap and heat the mixture over your fire until it is liquified. [9] X Research source If you don't have charcoal, you can also use the remains of charred logs. Allow the pine resin glue to cool before using it as an adhesive. Do not let your mixture boil while it is heating over the fire."
    },
    {
      "title": "Cover the shelter with any materials you can find.",
      "content": "Cover the shelter with any materials you can find. Cover your shelter with a large object like a tarp, plastic sheet, or blanket and secure it in place with string, rope, or shredded bark. Otherwise, glue leaves, bark, spare clothing, or any other materials you come across to your shelter frame to cover it. Be careful not to place too much weight on your shelter, which may not be able to hold under the pressure. [10] X Research source"
    },
    {
      "title": "Collect water from rain, snow, or other precipitation.",
      "content": "Collect water from rain, snow, or other precipitation. Set out an open container to catch rain, snow, hail, or dew. Choose a spot that is clear of tall trees that may obstruct the fall of precipitation. Large leaves can also be used to collect water and funnel it into another container. [11] X Research source"
    },
    {
      "title": "Get water from a stream, river, or lake.",
      "content": "Get water from a stream, river, or lake. Look for clear-running water in a stream, river, or lake. Opt for a smaller body of water if possible, since larger lakes or rivers will more than likely be polluted. Remember that water isn't necessarily safe to drink because it looks clean, and should be disinfected. [12] X Research source"
    },
    {
      "title": "Filter the water to remove dirt or debris.",
      "content": "Filter the water to remove dirt or debris. Pass the water you've collected through some sort of filter to remove gunk and debris, if necessary. Pour the water through a coffee filter, t-shirt, clean sock, or other porous material. You should still disinfect the water to remove harmful bacteria. [13] X Research source"
    },
    {
      "title": "Boil water over a fire to disinfect it.",
      "content": "Boil water over a fire to disinfect it. Water can be boiled in an aluminum, glass, or ceramic container. Use two large sticks or other similar things to hold the container just above the fire. Let it heat for 5 minutes to completely disinfect the water. [14] X Research source In a pinch, you can attempt to boil water in a paper, plastic, or tree bark container. Make sure the container is entirely full and that the flames do not touch the vessel. [15] X Research source"
    },
    {
      "title": "Make a solar water still with a plastic sheet.",
      "content": "Make a solar water still with a plastic sheet. Dig a hole in the ground that is slightly taller and wider than your container and place the container in the middle. Place leaves or other vegetation around the container and lay the plastic sheet over the hole. Weigh down the edges of the plastic with rocks and place a rock in the middle of the plastic, just over the container, so that the plastic is angled down. [16] X Research source Condensation will form under the plastic and roll down into the container. The water formed will be distilled and should be safe to drink. To be safe, you can boil it along with other water you collect. You may have to let condensation form for a day or two to collect a sizable amount of water."
    },
    {
      "title": "Roast and eat certain insects.",
      "content": "Roast and eat certain insects. Bugs that are not hairy and have fewer than 6 legs are usually not poisonous and can be eaten. Collect them in a jar or other container and roast them over the fire. Stay away from brightly colored insects as they are usually poisonous, such red ladybugs. Crickets are an ideal food source, and they can be trapped in several different ways . About 15 large crickets would be enough to meet your basic nutritional requirements for a day."
    },
    {
      "title": "Look for berries that you recognize.",
      "content": "Look for berries that you recognize. Look for recognizable wild berries like blueberries or blackberries, which are safe to eat. Pick and collect the berries in any bag or container that you may have. Avoid eating any berries that you are not familiar with, as they may be poisonous. [17] X Research source"
    },
    {
      "title": "Find, wash, and eat wild lettuce.",
      "content": "Find, wash, and eat wild lettuce. Wild lettuce is fairly common in North American forests. It has slim, lobed leaves that are approximately 12 inches (30 cm) long. Look for this plant along trails, near rivers, and in shady parts of fields. [18] X Research source Rinse and dry the lettuce before eating it."
    },
    {
      "title": "Avoid foraging for mushrooms.",
      "content": "Avoid foraging for mushrooms. You will likely come across a variety of wild mushrooms in the forest, but you should not take the risk of eating any of them. It can be very difficult to distinguish between different types of wild mushroom, and some may cause illness or even death if ingested. Most wild mushrooms are also difficult to digest and may cause you gastrointestinal distress. [19] X Research source"
    }
  ]
}