{
  "url": "https://www.wikihow.com/Treat-Fluid-Retention",
  "title": "How to Treat Fluid Retention",
  "steps": [
    {
      "title": "See your doctor.",
      "content": "See your doctor. The first thing you should do if you are retaining fluid is to see your doctor. Your doctor can perform a physical exam and tests to determine the cause of your fluid retention. There are many different conditions that can cause fluid retention including: [1] X Research source A heart condition, such as heart failure or cardiomyopathy Kidney failure Underactive thyroid Cirrhosis of the liver An issue with your lymphatic system Deep vein thrombosis Excess fat in your legs A burn or other type of injury Pregnancy Being overweight Being undernourished"
    },
    {
      "title": "Investigate hormones",
      "content": "Investigate hormones as a potential cause. For women, it's not uncommon to experience some water retention in the days leading up to your period, due to hormonal shifts within the body. [2] X Research source Birth-control medication can also cause fluid retention. So can any other type of medical hormonal treatment, including hormone replacement therapy. If you're experiencing fluid retention leading up to your period, the retention will likely end shortly after your cycle has concluded. However, if the retention is uncomfortable or persistent, a doctor may prescribe you a diuretic. This pill will increase water processing through your body and let you pee out the fluid that you've retained. [3] X Research source"
    },
    {
      "title": "Ask your doctor about side effects of medication.",
      "content": "Ask your doctor about side effects of medication. If your diet is healthy and you do not lead a sedentary lifestyle, your fluid retention could be a side effect of one or more medications you're currently taking. If your body continues to retain fluid for more than a few days, schedule an appointment and speak with your doctor regarding ways to reduce fluid retention as a medication side effect. Medications most likely to cause water retention include: [4] X Research source Antidepressants Chemo therapy medicine Some pain relievers High blood pressure medications"
    },
    {
      "title": "Ask your doctor if you could be experiencing heart failure or kidney failure.",
      "content": "Ask your doctor if you could be experiencing heart failure or kidney failure. Both of these serious medical conditions can cause the body to retain fluid. [5] X Trustworthy Source American Academy of Family Physicians Organization devoted to improving the health of patients, families, and communities Go to source In these cases, fluid retention is sudden and severe: you'll notice a palpable, rapid change and a large amount of fluid being retained, especially in the lower portion of your body. If you're concerned about heart failure or kidney disease, contact your doctor as soon as possible. These are potentially life-threatening conditions, and the sooner a doctor can diagnose heart failure or kidney disease, the more effectively they can be treated."
    },
    {
      "title": "Walk",
      "content": "Walk and move around through the day. For individuals who lead a largely sedentary lifestyle, or anyone who works at a job which requires them to remain seated for multiple hours, gravity can draw fluids into the lower extremities of your body. This can lead to water retention in your feet, ankles, and legs. Avoid this by walking frequently throughout the day. Keep your blood circulating, and your lower extremities will not retain water. [6] X Research source This also occurs during long plane rides, during which passengers remain immobile for many hours. If you're on an international flight, plan to stand up and stretch or walk around at least a few times."
    },
    {
      "title": "Elevate and compress swollen extremities.",
      "content": "Elevate and compress swollen extremities. If you're concerned that you may be retaining water in your feet, ankles , and lower legs, you can elevate the swollen parts of your body. This will let gravity drain some of the retained fluid from your feet and allow fluid to distribute through your body. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source For example, if your feet are swollen in the evening, recline on a sofa or bed with your feet on a pillow."
    },
    {
      "title": "Wear compression stockings",
      "content": "Wear compression stockings . If you find that your feet and ankles regularly retain fluid while you are sitting down or standing—for example, at work—you can purchase a pair of compression support stockings. These exert pressure on your feet and lower legs, and don't allow fluid to build up in these areas. [8] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Support socks or tights are relatively common. You should be able to purchase a pair at your local drug store."
    }
  ]
}