{
  "url": "https://www.wikihow.com/Truth-or-Dare-Adults",
  "title": "The Best Truth or Dare Questions & Challenges for Adults",
  "steps": [
    {
      "title": "Make everyone laugh with a silly story or challenge.",
      "content": "Make everyone laugh with a silly story or challenge. Sometimes, the best truths and dares are the ones that are the goofiest and leave your friends in utter stitches! Try one or more of these funny questions and dares to set the mood: Truths: What’s the weirdest thing you’ve ever eaten? What’s the strangest dream you’ve ever had? What’s the most embarrassing thing you’ve ever done? Have you ever peed yourself? What’s your craziest party story? [1] X Research source What’s the biggest lie you’ve ever told? Where’s your favorite place to fart in public? Have you ever walked in on your parents doing it? What would you do if you got locked in a store overnight? What’s the strangest thing you do while drunk? What’s the most disgusting thing you’ve ever done? Do you believe in aliens? Dares: Breakdance for 45 seconds. Post on social media only using your feet. Close your eyes, sit on someone’s lap and guess who it is. Only say “yes” for the next hour. Serenade the person on your left. Give a dramatic Shakespeare reading. Eat a raw egg. Walk around the room like a chicken. Give a personalized insult to everyone in the room. Exchange an item of clothing with the person on your left. Call a parent and tell them you’ve eaten your vegetables. Juggle 3 things of the group’s choice. Pretend to be the person to your left for 5 minutes. Try to make the group laugh as quickly as possible. Do you have any favorite truth or dare questions? Share them with the class over at our \"What are the best truth or dare questions in your opinion?\" forum !"
    },
    {
      "title": "Spice things up if you’re playing with a significant other.",
      "content": "Spice things up if you’re playing with a significant other. Feeling a little kinky? Then, don’t be afraid to toss a few sexier questions into the mix. These are perfect if you’re playing with a girlfriend , boyfriend , partner, or crush (or really anyone who you know can handle the dirt). Truths: What’s your biggest turn-off? What’s your biggest turn-on? What’s the largest age gap you’ve had with a partner? [2] X Research source Which sexual act are you best at? Are you a part of the mile-high club? What’s your favorite body part? [3] X Research source Have you ever gone skinny dipping? Where’s the weirdest place you’ve had sex? Have you ever faked it? What’s the most embarrassing thing that’s ever happened to you during sex? Do you have any fetishes? Do you do it with the lights on or off? What’s your craziest one-night stand story? What’s your guilty pleasure in the bedroom? Dares: Send your ex a message that you miss them. Ask a stranger for advice on a weird rash you’ve discovered on your butt. Seductively eat a banana while locking eyes with the person on your right. Do a seductive dance for the group. Close your eyes, pick a random phone contact and leave them a dirty message. Put an ice cube in your pants. Search the dirtiest thing you can think of online and show it to the person beside you. Tell one dirty secret no one knows about you. Do your best, sexy crawl."
    },
    {
      "title": "Add a little drama to the game to keep things interesting.",
      "content": "Add a little drama to the game to keep things interesting. Don’t hold back on your truths or dares (especially when playing with close friends). Dive deep into your history and ask them super personal questions or make them do the most scandalous things. Truths: What’s the last lie you told? What’s your biggest regret? [4] X Research source Who do you text the most? What’s your biggest secret? [5] X Research source Who’s the worst dressed in the room? Who was your worst kiss? [6] X Research source Have you ever cheated on someone? Have you ever ghosted somebody? What’s the boldest pick-up line you’ve ever used? Who would you most like to date in this room? How would you rate your looks on a scale of 1 to 10? Have you ever broken the law? Who are you most jealous of? Who would you like to kiss in this room? What’s your guilty pleasure? If you could get back with an ex, who would you get back with? What’s your toxic trait? Is love or money more important? Dares: Empty your wallet or purse in front of the group. Reveal where you think everyone in the group will be in 10 years. Share your phone’s search history. Whisper a secret to the person on your right. Post a random baby scan on social media. Say what you love most about everyone in the room. Tell a stranger your darkest secret. Show a picture of your most cringy outfit. Read your last text messages out loud. Say something dirty to the person on your right. Post your oldest selfie to social media. Add your exes to a group chat and ask what went wrong."
    },
    {
      "title": "Stick to a stereotypical question to keep it simple.",
      "content": "Stick to a stereotypical question to keep it simple. If you’re not feeling too daring, opt for a truth or dare that’s got just a bit of edge. These questions are relatively easy to answer and complete, making them perfect for first-timers or party starters—a perfect way to get to know one another and ease into a more intense game. Truths: What’s a secret you’ve never told anyone? Do you have a favorite sibling? Do you have a favorite friend? What’s your biggest fear? Do you have a hidden talent? What’s the worst thing you’ve ever done? Who’s your least favorite person in this room? Who would you call to help you bury a body? What’s one thing you’d never do, even for 1 million dollars? When was the last time you lied? [7] X Research source When was the last time you cried? [8] X Research source What’s the worst thing you’ve ever said to somebody? What’s your biggest insecurity? What’s your most embarrassing childhood memory? Dares: Let someone in this room post on your social media. Get an item from the kitchen and try to sell it to us in 2 minutes. Let the other players go through your phone for 1 minute. Drink a shot of pickle juice. Call your crush. Try to lick your elbow. Let another person draw on you with a permanent marker. Drink a mystery drink made by someone in the room. Let the group DM someone from your account. Keep 3 ice cubes in your mouth until they melt. Yell out the first word that comes to mind. Eat something of the group’s choice without using your hands. Let someone in the room touch up your makeup. Talk in a British accent for 10 minutes. Say 3 honest things to the group. Let someone shave a part of your body. Do 50 squats."
    },
    {
      "title": "Keep things interesting with an out-of-this-world challenge.",
      "content": "Keep things interesting with an out-of-this-world challenge. Why be normal when you can be weird? Liven up the game with a weird question or an absurd challenge that’d make anyone buckle. The stranger, the better! Truths: What’s the weirdest place you’ve peed? Have you ever peed in the shower? What’s the strangest meal you’ve ever made? What’s your favorite gross food combination? What’s the oddest rumor you’ve heard about yourself? What’s one thing you only do when you’re alone? How many selfies do you take a day? [9] X Research source What gives you the ick? What’s the longest you’ve ever gone without showering? Do you have a weird celebrity crush? What’s the most surprising thing in your bag? Dares: Smell everyone’s armpits and rank them from worst to best. Eat a banana peel. Kiss a pillow like it’s your crush. Quack like a duck for 10 minutes. Crack an egg on your head. Shower with your clothes on. Write a love song about an object in the room. Show your favorite picture of yourself. Eat a raw piece of garlic. Twerk for 1 minute. Give a foot massage to the person on your left. Howl at the moon like a wolf. Play air guitar for 2 minutes. Let someone tickle you, and try not to laugh. Swap shoes with the person on your right."
    },
    {
      "title": "Keep things exciting with your significant other with a flirtatious challenge.",
      "content": "Keep things exciting with your significant other with a flirtatious challenge. If you’re playing a game of Truth or Dare with your partner , why not spice things up with a few flirts or cheeky remarks? Ask spicy or flirtatious questions to make their heart flutter, or keep it real with genuine questions about your relationship. Truths: What do you love most about my body? What do you fear most in our relationship? What did you think about me when we first met? What’s the kinkiest thing you want us to try? How did you envision your future partner as a kid? Where do you think we’ll be in 10 years? What’s your ideal romantic evening like? What’s your favorite thing we do together? If we met earlier in life, do you think we’d be together? What do you love most about me? What are your 3 favorite positions? How would you define cheating? What do you think the key to a happy relationship is? Have I ever made you cry? What do you really think about my friends? Dares: Take off one piece of clothing. Flirt badly with your partner for 1 minute. Give your partner a lap dance. Tell me a secret you’ve never told me before. Go skinny dipping. Let your partner choose your lock screen, and keep it for a week. Draw a romantic portrait of your partner. Write a romantic poem about your partner. Go to the window and scream, “I’m in love!” Do a dramatic reading of dirty texts you’ve sent your partner. Act out you and your partner’s first kiss. Give your partner a foot massage."
    },
    {
      "title": "",
      "content": "Playing Truth or Dare is simple, and there are only a few rules! Follow the steps below to get your game and laughter started: Gather a group of friends of at least 2 people total. Sit together in a circle, facing one another. Take turns going around the circle asking each other, “Truth or dare?” The person being asked must choose an option. Choose a truth question or dare challenge from the list above based on what the participant picks. They must answer truthfully or do the dare you requested! Continue around the circle one-by-one so everyone gets a turn to ask \"Truth or dare?\" and complete a question or challenge."
    },
    {
      "title": "Set clear boundaries.",
      "content": "Set clear boundaries. Before starting the game, professional dating coach and matchmaker Laura Bilotta suggests discussing what topics are off limits. For example, you or your partner may have a past relationship that's painful to talk about, or perhaps you've recently had an argument and want to avoid any triggers. Ask each other what's off-limits before you begin to keep things fun."
    },
    {
      "title": "Set a flirtatious tone.",
      "content": "Set a flirtatious tone. The best Truth or Dare games for partners are light and fun. So, Bilotta advises to stick with silly or flirtatious questions that make you both laugh. You can learn plenty about each other through lighthearted questions and dares that aren't too deep, heavy, or serious!"
    },
    {
      "title": "Have a safe word for when things get uncomfortable.",
      "content": "Have a safe word for when things get uncomfortable. It’s okay to skip a question if it makes you uncomfortable. Bilotta recommends having a word you and your partner can say to change the question or challenge (like “skip”). Choose any word you like—just make sure to communicate it to your partner ahead of time."
    }
  ]
}