{
  "url": "https://www.wikihow.com/Things-to-Do-at-a-Sleepover",
  "title": "30 Things to Do at a Sleepover",
  "steps": [
    {
      "title": "Set up your camping gear indoors to avoid worrying about the weather.",
      "content": "Set up your camping gear indoors to avoid worrying about the weather. Who says you have to set up a tent outside? Ask your friends to bring their sleeping bags and blankets, then huddle in your tent for a night of glamping fun. [1] X Research source Make s’mores inside by melting your marshmallows in the microwave ."
    },
    {
      "title": "Playing Mad Libs is a fun way to make zany, crazy stories.",
      "content": "Playing Mad Libs is a fun way to make zany, crazy stories. Get some Mad Libs sheets before your guests arrive, then hand them out to each person. Take turns coming up with verbs, nouns, and adjectives to complete the stories, then read them out loud one by one."
    },
    {
      "title": "Spice up a movie night with popcorn that has something extra.",
      "content": "Spice up a movie night with popcorn that has something extra. Make microwave popcorn , then set out everything your friends might want to add in: M&Ms , chocolate , gummy bears , and jelly beans make great popcorn additions! [2] X Research source Or, stick to savory popcorn by sprinkling in some popcorn flavoring ."
    },
    {
      "title": "Pick a movie that everyone likes, then get cozy on the couch.",
      "content": "Pick a movie that everyone likes, then get cozy on the couch. For a classic sleepover vibe, pick a scary movie and turn off all the lights while watching. Or, if you and your friends want something more lighthearted, go for a comedy or a sweet rom-com. [3] X Research source Can’t decide what to watch? Have everyone come up with a movie option, then put it to a vote. The movie with the most votes wins!"
    },
    {
      "title": "Enjoy a homemade treat that you and your friends make together.",
      "content": "Enjoy a homemade treat that you and your friends make together. If you and your pals are bakers by nature, make it into an activity! Get all the ingredients you’ll need beforehand, then spend the first hour of your sleepover baking a delicious cake to enjoy."
    },
    {
      "title": "Get cozy in the wintertime with personalized hot chocolate for everyone.",
      "content": "Get cozy in the wintertime with personalized hot chocolate for everyone. Spread out everything your guests will need, including mugs , marshmallows , whipped cream , and sprinkles . You can either use pre-made hot chocolate mix , or (if you’re feeling fancy), you can make your own hot chocolate . [4] X Research source"
    },
    {
      "title": "Bust out a classic sleepover idea to make a fort and get cozy.",
      "content": "Bust out a classic sleepover idea to make a fort and get cozy. Grab some blankets, then drape them over chairs and furniture until you have a cute hideaway for you and your friends. Set up some string lights for a glowy effect to build the perfect fort to hang out in. [5] X Research source"
    },
    {
      "title": "Entertain your guests with their favorite board games or card games.",
      "content": "Entertain your guests with their favorite board games or card games. Gather around the table and pick out your favorite game, then make sure everyone is familiar with the rules. If you really love board games, ask each of your guests to bring their favorite game with them, then play them all throughout the night! [6] X Research source Not sure what to pick? Try one of these classics: Pandemic Catan Cards Against Humanity Reader Poll: We asked 1809 wikiHow readers what their favorite type of party game is, and 51% said games that make people laugh. [Take Poll]"
    },
    {
      "title": "Help your guests relax by planning a fun, DIY spa day.",
      "content": "Help your guests relax by planning a fun, DIY spa day . Have relaxing supplies on hand, like face masks , robes , and fuzzy slippers . Laze the night away by eating fruit and sipping on bubbly water for the ultimate relaxation. [7] X Research source Check out more ideas for things to do at a sleepover on wikiHow’s “Ideas for things to do at a sleepover?\" forum page ."
    },
    {
      "title": "Test out your nail art skills and get creative with nail polish.",
      "content": "Test out your nail art skills and get creative with nail polish. Have your friends pick their favorite colors of nail polish , then take turns painting each other’s nails. If you’re feeling adventurous, use stamps or stickers to add fun, colorful designs. [8] X Research source"
    },
    {
      "title": "Turn dessert into a fun activity with a sundae bar.",
      "content": "Turn dessert into a fun activity with a sundae bar. If you and your friends have a sweet tooth, indulge a little by letting everyone make their own sundae. Set out vanilla ice cream and toppings like whipped cream , sprinkles , chocolate sauce , caramel sauce , and marshmallows . [9] X Research source"
    },
    {
      "title": "Get your friends to taste foods or condiments and guess what they are.",
      "content": "Get your friends to taste foods or condiments and guess what they are. Blindfold one of your friends, then set up dishes with food items like ketchup, mustard, soda, ice cream, and soy sauce. Have the blindfolded friend taste a dish, then try to guess what it is! [10] X Research source Don’t make your friends eat anything too gross—stick to foods that are tasty to eat, but hard to guess."
    },
    {
      "title": "Have your friends show off their talents and pick a winner.",
      "content": "Have your friends show off their talents and pick a winner. It doesn’t have to be anything crazy—someone could sing, or show off their favorite dance move! At the end of the show, give out candy to whoever had the most impressive talent. [11] X Research source If one of your friends doesn’t want to participate, that’s okay! Have them judge each of the talents and award the best one."
    },
    {
      "title": "Strut down the “runway” to show off your sleeping attire.",
      "content": "Strut down the “runway” to show off your sleeping attire. When it’s time to get ready for bed, make things more exciting by rolling out the “runway” (or one of your old blankets). Put on some music and ask each of your friends to walk down the runway one by one."
    },
    {
      "title": "Decorate sleep masks for a fun party favor to take home.",
      "content": "Decorate sleep masks for a fun party favor to take home. Buy some blank sleep masks , then get some fabric markers . Have each of your friends create their own designs for a personalized gift that will remind them of all the fun you had."
    },
    {
      "title": "Make memories and new outfits by tye dyeing shirts together.",
      "content": "Make memories and new outfits by tye dyeing shirts together. Grab a plain white T-shirt for all of your guests, then head outside to keep the mess contained. Use rubber bands and bottles of tye dye to create a fun memento that your friends can take home. [12] X Research source"
    },
    {
      "title": "Make your own necklaces or earrings to wear home.",
      "content": "Make your own necklaces or earrings to wear home. Get a few jewelry bead kits and grab some needle nose pliers to keep handy. Help your friends make their own necklaces or make beaded earrings for fun accessories to take with them."
    },
    {
      "title": "A fun twist on Charades, playing Celebrity is a great party game.",
      "content": "A fun twist on Charades, playing Celebrity is a great party game. Split your group into 2 teams and have everyone write down the name of a celebrity. For the first round, have 1 person say anything besides the person’s name to get their team to guess. For the second round, have 1 person say 1 word to get their team to guess. For the final round, have 1 person act out motions to get their team to guess. [13] X Research source In each round, switch back and forth between teams so everyone gets a chance to go."
    },
    {
      "title": "Use fabric markers to decorate pillowcases for you and your guests.",
      "content": "Use fabric markers to decorate pillowcases for you and your guests. Before the sleepover, buy plain white pillowcases and some fabric markers . When your guests arrive, spread the pillowcases out on a flat surface and use the markers to create fun designs. [14] X Research source"
    },
    {
      "title": "Make your friends guess whether you’re telling the truth or not.",
      "content": "Make your friends guess whether you’re telling the truth or not. Go around the room and say something about yourself. The catch is: you can either say something true (fact) or something made up (fiction). Ask your friends to guess whether you’re telling a lie or not! Make sure to give everyone a turn to play. [15] X Research source"
    },
    {
      "title": "Use makeup in a hilarious way during a blindfolded makeover.",
      "content": "Use makeup in a hilarious way during a blindfolded makeover. Pair up your guests with each other, and start out by blindfolding 1 person. Give them makeup items and tools, like lipstick , eyeshadow , blush , and foundation . The blindfolded person has to put the makeup on the other person, and then they switch! Whoever has the most hilarious makeover at the end wins. [16] X Research source"
    },
    {
      "title": "Use cans of Silly String to chase each other around outside.",
      "content": "Use cans of Silly String to chase each other around outside. Buy a small can of Silly String for each of your guests, then head outdoors to keep the mess outside. [17] X Research source Make sure to clean up the Silly String and throw it away at the end of the night. It will make your parents happy!"
    },
    {
      "title": "Turn dinner into a fun activity by letting your guests make personal pizzas.",
      "content": "Turn dinner into a fun activity by letting your guests make personal pizzas. For an easy way to make pizza, grab some pita bread and spread some tomato sauce on top. Add all of your favorite toppings, and don’t forget the cheese! Then, bake your pizzas in the oven at 425 °F (218 °C) for 8 minutes, or until all the cheese has melted. [18] X Research source Great toppings to hand on hand include pepperoni, black olives, onions, peppers, and basil."
    },
    {
      "title": "Cool down on a hot summer night with a water balloon fight.",
      "content": "Cool down on a hot summer night with a water balloon fight. Fill up a few dozen water balloons with the hose outside, then hand them out to your friends. Try not to get hit by a water balloon as you toss them around your yard. [19] X Research source"
    },
    {
      "title": "Head outside at night to look up at the stars.",
      "content": "Head outside at night to look up at the stars. Since you’re already going to stay up late anyway, why not use that to your advantage? Take your friends outside and see how many constellations or shooting stars you can spot. Bring pillows and blankets outside to stay warm and cozy the whole time."
    },
    {
      "title": "Take funny photos with your friends by making a photobooth.",
      "content": "Take funny photos with your friends by making a photobooth. Set up a white sheet and some streamers to make your very own photo booth. Keep props around, like funny hats or fake mustaches , and use your phone to snap silly pics throughout the night. [20] X Research source"
    },
    {
      "title": "Set up clues and hidden prizes to do a fun scavenger hunt.",
      "content": "Set up clues and hidden prizes to do a fun scavenger hunt . Before your guests arrive, hide a few fun items, like candy or makeup throughout your home. When your guests get there, give them each a clue sheet and have them look around for the prizes that you hid earlier. [21] X Research source"
    },
    {
      "title": "Bust out the karaoke machine and sing the night away.",
      "content": "Bust out the karaoke machine and sing the night away. You can buy a karaoke machine or just rent one for the night. Pick out your favorite songs and take turns belting them out with your best pals! If one of your friends is feeling shy, offer to sing a duet with them."
    },
    {
      "title": "Enjoy a cute, delicious treat with a personalized cupcake.",
      "content": "Enjoy a cute, delicious treat with a personalized cupcake. Whip out your apron and bake some cupcakes before your friends arrive, then set out the frosting and the sprinkles . Give everyone time to decorate their cupcakes before showing them off and taking pics."
    },
    {
      "title": "Do a fun drawing game by playing Exquisite Corpse.",
      "content": "Do a fun drawing game by playing Exquisite Corpse. Start with a blank sheet of paper, and fold it into thirds. Have one person draw the legs and feet of a person, then hand the paper to another friend. Have that person draw the torso of a person without looking at the legs. Finally, hand the paper off to a final friend and have them draw the head. [22] X Research source When you unfold the paper, you’ll have a mishmashed version of a crazy looking monster!"
    }
  ]
}