{
  "url": "https://www.wikihow.com/Tell-if-a-Dog-Is-Microchipped",
  "title": "How to Tell if a Dog Is Microchipped",
  "steps": [
    {
      "title": "Look for a tag on the dog's collar.",
      "content": "Look for a tag on the dog's collar. If the dog is wearing a collar take a look to see if it has a specific tag that says the dog is microchipped. Microchips are made by different manufacturers, and these companies usually issue a metal tags to place on the dog's collar to alert interested parties that the dog is chipped. [4] X Research source The tag is supplied in part to let anyone that finds a dog know that it is chipped in order to scan them but it is also a visual deterrent to potential thieves thinking of stealing the dog, since the dog has permanent ID as belonging to someone else. [5] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source If the dog does not have an official ID tag on their collar, look for a bespoke collar tag bearing wording such as \"I am microchipped\" or \"microchipped.\" Know that this is not the same as a tag engraved with the dog's name and phone number. The purpose of this tag is purely to alert the finder that the dog is chipped and should be scanned. This type of tag usually does not carry personal details."
    },
    {
      "title": "Feel for the microchip.",
      "content": "Feel for the microchip. If the dog has lost their collar or there is no tag on the collar, try gently feeling for the presence of the microchip. The microchip is encased in a perspex coat that is the size and shape of a grain of rice. Microchips are injected under the skin in the loose skin of the neck at the centerline between the shoulder blades. Therefore this is the ideal place to start feeling. [6] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Run your fingertips over the skin between the shoulder blades and neck. Apply gentle pressure to see if you can detect a firm rice-grain sized object just under the skin. Microchips do bed in, which means they can migrate slightly from the original implant site. To reduce the chance of missing a microchip, work in a methodical manner working up and down between shoulder and head and then left to right working side to side from the shoulders up the neck until every inch is covered. This is not a foolproof method. If you can't feel a chip it does not mean the dog is definitely not chipped because the chip may be present but have shifted location or is embedded too deeply to feel."
    },
    {
      "title": "Get a definitive answer by getting the dog scanned.",
      "content": "Get a definitive answer by getting the dog scanned. Even if the dog doesn't have a tag that says it has a chip and you don't feel one, it's best to scan the dog to find out. It is worth scanning for a microchip if you are trying to get the contact details of a lost dog's owner. [7] X Expert Source Ray Spragley, DVM Veterinarian Expert Interview. 29 June 2021."
    },
    {
      "title": "X-ray the dog.",
      "content": "X-ray the dog. Microchips show up on x-ray. While this is not routinely used as a method to check if a chip is present, in cases where a chip was implanted and has stopped working, taking a radiograph of the dog is a quick and easy way to check the chip is still in place but not working."
    },
    {
      "title": "Check the scanner.",
      "content": "Check the scanner. First, the operator needs to check that the scanner is working by pressing the 'on' button and passing the sensor over a test chip. If the scanner bleeps and displays a number it is working. If the batteries are dead the display will either remain blank or display a message \"low battery.\" If the scanner is working but has not scanned a microchip after a set period of time it displays the message \"no chip found.\""
    },
    {
      "title": "Scan the dog's shoulders.",
      "content": "Scan the dog's shoulders. Turn on the scanner and hold it one inch above the skin. Move the scanner in up and down sweeps from the shoulder to neck and then from side to side. When the scanner activates, make a note of the number."
    },
    {
      "title": "Check other places on the dog's body.",
      "content": "Check other places on the dog's body. If no chip is found with a methodical scanning pattern over the shoulders, don't give up. Pass the scanner over the remainder of the body. This includes under the sternum and around the armpits, just in case it has migrated to an unusual location."
    }
  ]
}