{
  "url": "https://www.wikihow.com/When-Should-You-End-a-Long-Distance-Relationship",
  "title": "When Should You End a Long-Distance Relationship? How to Tell When Long-Distance Isn't Working",
  "steps": [
    {
      "title": "Communication is super important in a long-distance relationship.",
      "content": "Communication is super important in a long-distance relationship. Since you two don’t see each other often, talking daily is probably one of the highlights of your day. If your partner has been backing out of your FaceTime dates or phone calls, that’s a red flag—it could mean that your partner isn’t interested in the relationship anymore, or it could be that they’re just not making you a priority in their life. [1] X Research source Some people can go days without talking to their partner, which is okay, too. If you and your partner just prefer to wait a while in between chats, it’s not necessarily a red flag. On the flip side, if you find yourself dodging your partner’s calls or texts, it might also be time to end the relationship. If you’re no longer excited to chat with them at the end of a long day, this relationship may have run its course, and that’s okay."
    },
    {
      "title": "You might feel a little smothered by your partner.",
      "content": "You might feel a little smothered by your partner. If they constantly demand to text or call you, even when you’re busy, that’s a red flag. It shows that they might be a little controlling, and they probably don’t trust you very much. If this is the case, you may want to rethink the relationship and examine just how healthy (or unhealthy) your partnership is as a whole. [2] X Research source If this is the only issue in your relationship, you might want to sit down and have a conversation with your partner about it. Talking about how often you two will communicate can avoid any fights in the future."
    },
    {
      "title": "You might be the only one calling, planning visits, or sending mail.",
      "content": "You might be the only one calling, planning visits, or sending mail. It’s normal for one partner to pick up the slack in a relationship from time to time, but if your partner hasn’t made much of an effort at all lately, that’s a red flag. It takes two to tango, and it also takes two to make a long-distance relationship last. [3] X Research source Long-term partners sometimes get used to the effort that their partner is giving to the relationship. If you’re feeling taken advantage of or unappreciated and your partner isn’t willing to change, it’s time to move on."
    },
    {
      "title": "They might text or call you all the time about your whereabouts.",
      "content": "They might text or call you all the time about your whereabouts. Trust is very important in any relationship, but it’s doubly so in a long-distance one. Since you two don’t see each other daily, your partner only has your word to go on. If you feel like you’re constantly being questioned about what you’re doing and who you’re with, it might be time to end the relationship. [4] X Research source A lot of times, partners will tell you that things will be different when you two are together in person. However, that’s rarely the case—if someone can’t trust you when they’re far away, they’re not going to trust you when you’re in the same area."
    },
    {
      "title": "If they’ve done questionable things in the past, this could be an issue.",
      "content": "If they’ve done questionable things in the past, this could be an issue. If you feel insecure or like your partner might cheat on you while they’re away, that’s a red flag. Some people have a hard time in long-distance relationships, and they’ll use your distance as an excuse to cross the boundaries of the relationship. If that happens, you’re well within your rights to end the relationship and move on. [5] X Research source You might feel like you constantly have to check up on your partner about what they’re doing, just to make sure they’re staying faithful. This is never a good feeling, and it puts a lot of unnecessary stress and pressure on you."
    },
    {
      "title": "Letting big conflicts get swept under the rug can lead to resentment.",
      "content": "Letting big conflicts get swept under the rug can lead to resentment. If you often feel like it’s not even worth it to argue with your partner about something, that’s not a good sign. In healthy relationships, couples usually talk things out until they both feel better. Unfortunately, if you and your partner have stopped arguing about things, it might be a sign that your relationship has run its course. [6] X Research source This is also true if your partner gives you the silent treatment or ignores you when you two disagree about something. Communication is so important, especially in long-distance relationships, and a lack of it shows that your partnership might not be in the best shape."
    },
    {
      "title": "What does your partner do after school or work?",
      "content": "What does your partner do after school or work? Who do they hang out with on a daily basis? What do they like to do for fun on the weekends? If you don’t know the answer to any of those questions and you’ve been stonewalled every time you ask, that’s a red flag. Talking about the “boring” details in an LDR is very important because it gives you a taste of your partner’s life. Without those details, you’ll only grow further apart. [7] X Research source"
    },
    {
      "title": "In LDRs, visiting each other often can make the relationship last much longer.",
      "content": "In LDRs, visiting each other often can make the relationship last much longer. If you two don’t have any plans to visit each other or you’re dragging your feet about making them, it’s time to think about the relationship. This is also true if your partner has promised to come and visit you but never actually makes the plans to do so, since that could mean that they don’t actually want to see you. [8] X Research source Traveling for visits takes a lot of time and money, which many people don’t have. If that’s the issue, give your partner a little slack, and try to make plans that work for the both of you (like meeting halfway)."
    },
    {
      "title": "You might differ when it comes to kids, living situations, or careers.",
      "content": "You might differ when it comes to kids, living situations, or careers. If you and your partner have wildly different future plans, there’s a chance that your relationship might not work. It’s important to talk about these things early, so try to chat with your partner about what they see themselves doing in 5 years (and 10 years, and 20 years). If your goals don’t align, it could be time to move on. [9] X Research source There are some things you can compromise on, like how big of a house you live in or how close to the city you are. But some things aren’t negotiable, like whether or not you want kids."
    },
    {
      "title": "If you two are serious, you should be planning for the future together.",
      "content": "If you two are serious, you should be planning for the future together. If you find out that your partner is making plans about housing or their career without cluing you in, it might mean that they don’t see a future with you. All of your goals should be working toward living together in the same area, and if that’s not what your partner is doing, it might be time to exit this relationship. [10] X Research source Hearing about plans your partner has made without you can be jarring. You can talk to your partner about how the situation made you feel, and then you can decide to end the relationship if they don’t see a problem with it."
    },
    {
      "title": "Maybe you tell them about your new job, and they seem pretty lackluster.",
      "content": "Maybe you tell them about your new job, and they seem pretty lackluster. Or, you share some exciting news about your hobby, and your partner couldn’t care less. In healthy relationships, significant others support and uplift each other, and they’re excited when they hear good news. If your partner can’t even muster up the effort for a “good job,” it might be a sign that they aren’t the best partner. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Think back to when your partner told you good news about their life. You were probably excited for them simply because you love them, right? It doesn’t matter whether or not they’re “interested” in the news—they should be interested simply because it’s you telling them."
    },
    {
      "title": "Some people just aren’t meant to be in LDRs, and that’s okay.",
      "content": "Some people just aren’t meant to be in LDRs, and that’s okay. If you feel like your long-distance partner is keeping you down or holding you back, it’s time to end the relationship. This is especially true if you’re young or still in school—you don’t want to look back on these years and think that you wasted them with someone you didn’t truly love. [12] X Research source Again, it’s worth talking to your partner about your feelings if this is the reason why you’re considering breaking up. You never know—they might be feeling the same way. Reader Poll: We asked 653 wikiHow readers, and 58% of them agreed that the most effective way to set expectations and boundaries in a long distance relationship is to ​​talk through your doubts, uncertainties, and fears together . [Take Poll]"
    },
    {
      "title": "Long-distance partners can still be satisfied sexually!",
      "content": "Long-distance partners can still be satisfied sexually! When you aren’t together in person, you might try sexting, phone sex, or video chats. If your partner isn’t willing to do that with you and you don’t feel satisfied with your intimacy levels, you’re within your rights to end the relationship. Keep in mind, though, that some people just aren’t comfortable with sexual contact that isn’t in person. [13] X Research source If your sex life is the only issue in your relationship, it’s worth sitting down with your partner and coming up with a solution that satisfies both of you. However, if this problem is coupled with a few (or a lot) of others, it’s up to you to decide whether or not you’d like to continue the relationship."
    },
    {
      "title": "When your partner isn’t nearby, cheating can sometimes feel easier.",
      "content": "When your partner isn’t nearby, cheating can sometimes feel easier. While cheating is never a good option, if you feel like you can’t remain faithful to your long-distance partner, it’s time to exit the relationship. You’ll save your partner (and you) a whole lot of heartbreak if you break up before you actually step outside the relationship, so there’s no shame in it! [14] X Research source If you’ve already cheated on your partner and you feel like you could do it again, it’s definitely time to end things. Evaluate your feelings for the person. [15] X Research source Think about whether a strong connection or love existed between you. Or did you rationalize yourself into the relationship by thinking they will be a good partner because of a certain quality they possess. [16] X Research source If there was never anything that strong to hold onto from the beginning, it might be in your best interest to let it go. [17] X Research source"
    }
  ]
}