{
  "url": "https://www.wikihow.com/What-Is-a-Sleeper-Build",
  "title": "What Does Sleeper Build Mean on Social Media?",
  "steps": [
    {
      "title": "If you’ve got a buff, toned body but it’s not obvious, it’s a sleeper build.",
      "content": "If you’ve got a buff, toned body but it’s not obvious, it’s a sleeper build. You know those guys and girls who are super buff, have bulging muscles, and walk around in tight clothes showing their hard work off? A sleeper build is kind of the opposite. People with sleeper builds are really toned and built, but they dress with loose-fitting clothes and only look bulky when they flex. [2] X Research source In sleeper build vids, the person plays it off at the beginning like they’re weak or skinny and then they show off their muscles out of nowhere."
    },
    {
      "title": "“Sleeper” is old school slang for something surprisingly good.",
      "content": "“Sleeper” is old school slang for something surprisingly good. It was originally a sports term for a player who didn’t look competent but was actually an all-star. These days, “sleeper” can be applied to basically anything unassuming but secretly powerful or good. [3] X Research source You might say that a really short basketball player who looks kind of nerdy is a sleeper if they go into the game and drop 30 points. An old car might be a sleeper if it’s got a bad paint job and a missing bumper but its got a brand new fancy engine under the hood."
    },
    {
      "title": "Improve your diet to cut any excess weight.",
      "content": "Improve your diet to cut any excess weight. Getting a sleeper build isn’t rocket science, but you do need to put in a bit of effort. If you’re even a little overweight, you won’t be able to surprise everybody when you flex. Start by cutting out excess carbs and eat a diverse diet full of fruits, vegetables, and lean proteins like chicken and fish. [4] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Eat regular meals and avoid skipping breakfast or eating late at night before bed. Don’t do any crash diets or use any trendy TikTok hacks. Healthy eating may be boring, but it’s the only tried and true method. [5] X Research source"
    },
    {
      "title": "Lift weights and prioritize lower rep counts with bigger weights.",
      "content": "Lift weights and prioritize lower rep counts with bigger weights. There are different kinds of strength training out there for you to choose, but bodybuilding is ideal for a sleeper build. Use free weights and machines, and focus on performing a smaller number of reps with heavier weights. [6] X Research source You’ll want to incorporate the bench press, pull-ups , barbell rows, and bicep curls to build your shoulders, arms , and chest. https://www.wikihow.com/What-Is-a-Sleeper-Build Build your lower body up with dumbbell squats, lateral lunges, and free weight calf raises. https://www.wikihow.com/What-Is-a-Sleeper-Build Tighten and tone your core with cable crunches, leg raises, and Russian twists. https://www.wikihow.com/What-Is-a-Sleeper-Build"
    },
    {
      "title": "Continue eating right and lifting weights until you’ve got your look.",
      "content": "Continue eating right and lifting weights until you’ve got your look. Want a test to see if you’ve got a sleeper build? Throw on a baggy T-shirt and look in a mirror. Then, lift a sleeve up and flex. Does it look like you go from zero to bicep hero? If so, you’ve got a sleeper build! If not, keep working out and eating healthy. You’ll get there soon. [7] X Trustworthy Source EatRight.org Organization associated with the Academy of Nutrition and Dietetics providing advice about food, health, and fitness Go to source Don’t get discouraged! It can take months before you’ll see real results depending on where your starting point is. It tends to be a little easier to pull off the “sleeper build” look if you’ve got broad shoulders and you’re a little on the skinnier side."
    },
    {
      "title": "Dress up in clothes that’ll hide your muscles.",
      "content": "Dress up in clothes that’ll hide your muscles. Anything that doesn’t showcase your pecs and abs will work, but a lot of TikTokers will play it up by wearing loose-fitting clothes or dressing a bit like a dork. Don’t cover up your forearms, though. Show a little skin so that the viewer thinks you’re a lot skinnier than you actually are. [8] X Research source If you’ve got an impressive 6-pack, you could even try puffing your stomach out a bit to make it look like you’ve got a belly."
    },
    {
      "title": "Pick an upbeat song with a strong, expressive drop.",
      "content": "Pick an upbeat song with a strong, expressive drop. The “big reveal” is going to be all the more impactful and impressive if you show your bod off right when the song in the background gets deeper or faster. Choose something with a huge drop. [9] X Research source Basically any hip hop or EDM song can work so long as it’s slow in the beginning and then has a really loud, vibrant turn."
    },
    {
      "title": "Reveal your 6-pack abs or robust biceps and abs as the beat drops.",
      "content": "Reveal your 6-pack abs or robust biceps and abs as the beat drops. At the start of the TikTok, stand around sheepishly like you’re not doing anything impressive. You might turn back and forth like you’re nervous, or stand in front of the camera unmoving. Then, right as the beat drops, pull your shirt off or cut to a second shot of you wearing athletic-wear and flex on them! [10] X Research source Lean into the camera as you’re flexing a bit to really emphasize the size difference in your muscles. A lot of people will put “#sleeperbuild” in the hash tags. Add it to your video so people can find it!"
    }
  ]
}