{
  "url": "https://www.wikihow.com/Tuck-for-Swimming",
  "title": "How to Tuck for Swimming",
  "steps": [
    {
      "title": "Shave or wax your pubic area.",
      "content": "Shave or wax your pubic area. In order for tape to stick to your skin well—and not cause a lot of pain coming off—you’ll need to remove the hair around your genitals. If you’re shaving, first trim away any excess hair with a sharp pair of scissors (very carefully!) or an electric clipper. Take a warm shower or soak the area in warm water for about 10 minutes to soften the hair, then lather on some shaving gel or cream. Carefully shave with a clean, sharp razor, moving against the grain of the hair. Be extra careful when shaving your testicles (balls). While you won’t get quite as close a shave, there’s less risk of nicking yourself if you use an electric razor or clippers. Alternatively, you could give yourself a wax , which is a bit more painful, but less likely to cause accidental cuts or scrapes. To minimize irritation, don’t put tape on freshly shaved skin. Shave 1-2 days before you plan to tuck."
    },
    {
      "title": "Get a roll of medical tape.",
      "content": "Get a roll of medical tape. You can get medical tape online or in a drugstore. Look for waterproof options so that the tape won’t come undone while you’re swimming. Don’t use duct tape or any other type of tape that’s not designed for use on your skin, since it could cause severe irritation. You can also use skin-friendly fashion tape (like the kind designed to lift breasts or hold swimwear in place) or a prefab tape tuck kit."
    },
    {
      "title": "Lie down and gently push your testicles up into your body.",
      "content": "Lie down and gently push your testicles up into your body. This part is totally optional, but it will give you a tighter, smoother-looking tuck. Lie down in a comfortable spot with your knees drawn up. Gently press on your testicles with 2 or 3 fingers and try to guide them up into the inguinal canals. These are the spaces in your body that your testicles move into when you’re cold. It can help to take a cool bath or shower first, since this will cause your testicles to naturally retract a bit. If you experience pain or nausea, stop. Try again later, or skip pushing up your testicles altogether. As an alternative, gently push them out to either side so your penis can nestle in between them. [1] X Research source"
    },
    {
      "title": "Pull your penis back between your legs.",
      "content": "Pull your penis back between your legs. Reach around from behind and take hold of your penis. If you’re lying down, you might have to lift your hips off the bed or floor to do this. Pull your penis and scrotum back and tuck them between your butt cheeks. [2] X Research source It’s normal to get aroused while you’re doing this, but you won’t be able to tuck while your penis is erect. If it happens, take a break and wait for the feeling to pass. Then, try again. [3] X Research source"
    },
    {
      "title": "Place a piece of toilet paper or gauze over your penis and scrotum.",
      "content": "Place a piece of toilet paper or gauze over your penis and scrotum. This will prevent the tape from sticking directly to the delicate skin on your genitals. Alternatively, use a gauze pad or some other type of breathable bandage."
    },
    {
      "title": "Secure your penis in place with 3 pieces of tape.",
      "content": "Secure your penis in place with 3 pieces of tape. Grab a strip of medical tape that’s about 12 inches (30 cm) long. [4] X Research source Secure the tape at the top of your pubic bone, then pass it back between your legs. Secure the other end at the top of your butt. Add 2 more pieces of tape on either side of the first one, running parallel to it. The tape should be tight enough to securely hold your tuck, but not so tight that you’re in pain. You might need to practice a bit to get the right level of tightness so that your tuck is both comfortable and secure. [5] X Research source If you’re sweating, pat your skin dry with a clean, dry towel before you apply the tape. That will help it stick better. If you want a little extra reinforcement, run another strip of tape around the underside of each butt cheek to your hip on both sides."
    },
    {
      "title": "Pull up your swimsuit or bikini bottom.",
      "content": "Pull up your swimsuit or bikini bottom. It may help to already have your swimsuit bottom partway on before you start. Once you’re pretty sure everything is secure, tug it up the rest of the way. Pull it tight and check the fit to make sure your groin area looks nice and smooth. [6] X Research source For an extra-smooth tuck, go for a bottom that’s a little tight. Thick bikini bottoms made from compression material, such as Lycra or spandex, work great for this purpose."
    },
    {
      "title": "Choose a gaff in the same size as your regular underwear.",
      "content": "Choose a gaff in the same size as your regular underwear. A gaff is a type of compression underwear designed to smooth out bulges in your crotch area and keep your genitals tucked away. Finding the right size gaff is pretty easy! Typically, they’re sized just like standard underwear. If you’re not sure of your size, measure around your waist first, then compare the seller’s size chart with your measurement. If you’re worried about the gaff showing under your swimsuit, pick one that’s thong-shaped or specially designed for use with swimwear, like the Lili Gaff. [7] X Research source In a pinch, a regular tight thong made of thick material will work as a basic gaff."
    },
    {
      "title": "Lie on your back with the gaff pulled halfway up.",
      "content": "Lie on your back with the gaff pulled halfway up. You can also stand, but lying down will help prevent you from losing your balance. Pull your gaff up to your knees so that you can easily pull it up the rest of the way once everything is tucked into place. [8] X Research source"
    },
    {
      "title": "Push your genitals back between your legs with one hand.",
      "content": "Push your genitals back between your legs with one hand. If you want, gently push your testicles up inside your body first. To do this, use 2-3 fingers to very carefully push your testicles up into the inguinal canals—those spaces they tend to move into naturally when you’re really cold. You can also just push them off to either side. Carefully pull your penis back between your legs and tuck it snugly between your butt cheeks. [9] X Research source For extra security, some people prefer to tape first before putting on a gaff. However, you may find that doing just one or the other is enough."
    },
    {
      "title": "Pull the gaff up with your free hand.",
      "content": "Pull the gaff up with your free hand. Keep your genitals in place with one hand and work your gaff the rest of the way up your hips with the other. You may need to fiddle with the gaff a little to make sure it feels snug enough and everything is where it needs to be. [10] X Research source If anything hurts, undo the tuck and try again. A little discomfort is normal, but your tuck shouldn’t be painful!"
    },
    {
      "title": "Put on your swimsuit over the gaff.",
      "content": "Put on your swimsuit over the gaff. Once you’re satisfied with how your gaff is sitting, simply slip on your suit or bikini bottom over it. You might need to experiment to find a suit that looks good with your gaff of choice. For instance, it will likely work best with a swimsuit that matches the color and cut of your gaff. [11] X Research source"
    },
    {
      "title": "Search online for stores that sell trans-friendly swimwear.",
      "content": "Search online for stores that sell trans-friendly swimwear. Today, there are more options for inclusive swimwear styles than ever! If you don’t want to mess with tape or a gaff, look for a swimsuit that’s already designed to help hide your junk. Companies like Rubies, Rebirth Garments, TomboyX, and Outplay all make swimsuits for trans bodies. [12] X Research source You can also find trans-friendly swimwear on sites like Etsy. Much like a gaff, these suits are typically designed with thick, stretchy material that will smooth out your crotch area and help you keep your tucked genitals in place."
    },
    {
      "title": "Wear a tight swimsuit or bikini bottom in place of a gaff.",
      "content": "Wear a tight swimsuit or bikini bottom in place of a gaff. If the material is thick and tight enough, a regular swimsuit bottom on its own might be enough to keep everything in place. Experiment with simply tucking everything out of the way and putting on your suit. Alternatively, try layering 2 snug swimsuit bottoms. [13] X Research source For instance, you could put on a thong bikini bottom under a swimsuit with more coverage. To tuck, lie down on your back with your swimsuit bottom pulled up to your knees. If you like, very gently guide your testicles into the inguinal canals (a pair of holes or “sockets” in your lower abdomen, behind your pubic bone), or just move them to either side of your penis. Pull your penis back between your legs and hold it in place. Once you’re tucked, pull your swimsuit bottom up with your free hand."
    },
    {
      "title": "Get a swimsuit with a skirt or ruffle.",
      "content": "Get a swimsuit with a skirt or ruffle. If you’re still feeling self-conscious about what’s going on down there, some extra coverage can make a big difference. Put on a swimming skirt or a suit with ruching or ruffles in front. You can also throw some denim cutoffs on over your swimsuit bottom for a cute and stylish look!"
    },
    {
      "title": "Pee before you tuck.",
      "content": "Pee before you tuck. Once you tuck, going to the bathroom becomes a real challenge—especially if you use tape! Even if you don’t really feel like you need to go, use the bathroom right before you tuck. Once you’ve tucked, you’ll need to untuck before you can pee again."
    },
    {
      "title": "Take extra tape with you.",
      "content": "Take extra tape with you. Before you hit the pool or beach, throw some extra medical tape in your bag. Then, if the need arises, you can always redo your tuck after you go to the bathroom. Don’t forget to bring a towel, too! If you’ve been swimming, you’ll need to dry off before you reapply the tape."
    },
    {
      "title": "Avoid taping if you need to stay tucked for a long time.",
      "content": "Avoid taping if you need to stay tucked for a long time. If you’re planning a long day in the water, consider using gaff or compression swimwear instead of tape. That way, you won’t have to worry about retaping yourself every time nature calls. [14] X Research source Taping is also more likely to cause irritation and pain than other tucking methods, so you might want a gentler option for long-term wear."
    },
    {
      "title": "Try to go regularly throughout the day.",
      "content": "Try to go regularly throughout the day. Unfortunately, holding in your pee can put you at risk of health problems, such as urinary tract infections (UTIs). As challenging or uncomfortable as it may be, do your best to get to the bathroom as soon as you feel the urge. If that’s not possible, try to plan a few bathroom breaks into your day so you aren’t waiting too long. Doctors recommend going at least once every 3 hours to keep your bladder healthy. [15] X Research source If you don’t feel safe or comfortable using the bathrooms wherever you’re swimming, it might help to ask a supportive friend to go with you. [16] X Research source You can also use apps like Refuge Restrooms, Loo Locator, or Gender Neutral Toilet Finder to help you find the nearest gender-inclusive restroom."
    },
    {
      "title": "Stay hydrated, even if it means more bathroom breaks.",
      "content": "Stay hydrated, even if it means more bathroom breaks. You might be tempted to avoid drinking or eating before you tuck, but doing so can put you at risk of dehydration and other health problems. If you can, eat and drink like you normally would before and during the time that you’re tucked. It’s especially important to stay hydrated if you’re going to be basking on a sunny beach!"
    },
    {
      "title": "See your doctor if you develop symptoms of a bladder infection.",
      "content": "See your doctor if you develop symptoms of a bladder infection. Even if you’re careful, you can still sometimes get a UTI after tucking. If you have symptoms like burning when you pee, pain in your lower abdomen, or pee that smells bad or looks cloudy or bloody, call your doctor right away. Most UTIs clear up quickly with a short course of antibiotics. If you have symptoms of a UTI, don’t wait to get help. If you go too long without treatment, the infection could get more serious or become chronic."
    }
  ]
}