{
  "url": "https://www.wikihow.com/Transport-Cut-Flowers",
  "title": "How to Transport Cut Flowers",
  "steps": [
    {
      "title": "Store your flowers in a cool place.",
      "content": "Store your flowers in a cool place. The recommended temperature is between 34 and 75 degrees Fahrenheit (1 to 24 degrees Celsius). You can keep your flowers in the fridge before your event or at a venue to keep them fresh longer. If you do this, make sure the temperature of the fridge is cool but not close to freezing. Also, be sure to remove any fruits or vegetables from the refrigerator, as they emit a gas called ethylene that can harm your cut flowers. [1] X Research source"
    },
    {
      "title": "Recut the flowers.",
      "content": "Recut the flowers. Cutting one or two inches off the stems of your flowers or other cut plants can help to extend their life and keep them fresh as you transport them. When you cut the flower stems, do so while they are submerged in water. You can fill up a shallow basin of water for this purpose. Cutting them in water ensures no air gets into the stem. Use very sharp shears or scissors to avoid pinching the stem instead of slicing it neatly. You want to cut each stem at around a 45-degree angle. You will need to recut the flowers every 24 to 48 hours to maintain freshness."
    },
    {
      "title": "Trim off any lower leaves.",
      "content": "Trim off any lower leaves. You want your stems to be free from leaves that don’t serve a purpose in your arrangement. [2] X Research source You want to trim these leaves because leaves that stay damp could rot and cause mold or bacteria to grow around the base of your arrangement."
    },
    {
      "title": "Wrap your flowers’ lower stems with rubber bands.",
      "content": "Wrap your flowers’ lower stems with rubber bands. If your flowers are already arranged, you can wrap rubber bands around each arrangement. If they aren’t, you can simply wrap according to flower type. The rubber bands just keep your flowers in manageable bundles as your transport them and assure you don’t lose any of the arranging you’ve already done."
    },
    {
      "title": "Wrap the flowers to keep them moist.",
      "content": "Wrap the flowers to keep them moist. For this, you should use cotton wool that you’ve soaked in room temperature water. You want to use a material that will hold the water for a long period of time. If you want, you can add a small amount of a floral preservative to the water that you soak your cotton wool in."
    },
    {
      "title": "Cover the cotton wool with plastic.",
      "content": "Cover the cotton wool with plastic. You can use any kind of plastic wrap or plastic bag for this to seal in moisture and keep your flowers in place. Once you’ve wrapped around the cotton wool with plastic wrap, secure over it with a rubber band."
    },
    {
      "title": "Lay flowers flat in shallow boxes.",
      "content": "Lay flowers flat in shallow boxes. This method works best for flowers with hardier blooms or for greenery that will accompany the flowers in your floral arrangements. Gently lay flowers flat in the boxes. Make sure all the blooms face the same way. If you plan on stacking your boxes, close them well, first, so that your flowers don’t get crushed by the boxes above them."
    },
    {
      "title": "Use cardboard boxes with cut-outs.",
      "content": "Use cardboard boxes with cut-outs. This works best for more delicate flowers and arrangements that are already complete. Find cardboard boxes with lids that are the same height as the stems of your arrangements. In the lid of each box, use a box cutter to cut a hole just large enough for your bouquet to fit into. Put each of your bouquet arrangements into a hole, making sure they fit snugly and won’t fall over as you drive."
    },
    {
      "title": "Transport flowers in buckets.",
      "content": "Transport flowers in buckets. [3] X Research source If you’re transporting in buckets, you don’t need to wrap the stems of your flowers with cotton wool and plastic. Fill five-gallon buckets halfway with water, and put your bouquets in them upright. To keep the bucket upright, place heavy items on each side of the bucket. of bleach per 1 US quart (0.95 L) of water in the flower vase or bucket. Alternatively, use 3 drops of bleach and 1 teaspoon (4 g) of sugar per 1 US quart (0.95 L) of water.”|}}"
    },
    {
      "title": "Keep your flowers shaded and cool.",
      "content": "Keep your flowers shaded and cool. In your vehicle, don’t place flowers in an unventilated trunk or in the direct sunlight from the windows. Place them on the floor to keep them upright. Keep the inside of the vehicle cool, so the flowers remain fresh."
    }
  ]
}