{
  "url": "https://www.wikihow.com/Use-Alcohol-to-Treat-a-Cold",
  "title": "How to Use Alcohol to Treat a Cold",
  "steps": [
    {
      "title": "Make a hot toddy.",
      "content": "Make a hot toddy. A hot toddy is a popular cold remedy. Pour 1 ounce (30 milliliters) of whiskey and 1 to 2 tablespoons of honey into a mug, then squeeze in the juice of 3 lemon wedges. Add 8 ounces (240 milliliters) of boiling water and stir to mix. Poke 8 to 10 cloves into a lemon wedge and plop it into the mug. Honey and lemon both have antibacterial properties and may help treat the respiratory tract infections caused by bacteria which usually occur after catching the common cold (viral infection). Secondary bacterial infections can occur after having the common cold. [1] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Mix a honey-ginger-lemon tonic and add some whiskey.",
      "content": "Mix a honey-ginger-lemon tonic and add some whiskey. Peel a 1 inch (2.54 centimeter) piece of ginger root and chop it into small pieces. Add it to 8 ounces (240 milliliters) of water, along with the juice of half a lemon and 1 teaspoon of honey. Bring everything to a boil in a small saucepan, then pour the mixture through a strainer into a mug. Add 1 ounce (30 milliliters) of whiskey and stir. Drink the tonic while it is still hot. [2] X Research source"
    },
    {
      "title": "Make a cough syrup out of bourbon.",
      "content": "Make a cough syrup out of bourbon. If you’re coughing or suffering from a sore, scratchy throat, try this recipe for relief. Pour 2 ounces (60 milliliters) of bourbon and the juice of half a lemon (about 2 ounces/60 milliliters) into a mug. Put the mug into the microwave and heat for 45 seconds. Add 1 tablespoon of honey, stir, and heat for another 45 seconds. Drink your cough syrup while it is still hot. [3] X Research source For a watered down version, add 2 to 4 ounces (60 to 120 milliliters) of water. Do not drink more than one serving of this or you will agitate your throat and nose, potentially making your congestion worse."
    },
    {
      "title": "Try a gaelic punch.",
      "content": "Try a gaelic punch. Mix the zest of six lemons with ¾ cup (12 tablespoons) of sugar. Wait one to two hours, then mix again and add 8 ounces (250 milliliters) of boiling water. Stir the mixture until the sugar dissolves. Strain the whole mix, then add 750 milliliters (about 3.2 cups) whisky. Finally, add another 32 ounces (4 cups) of water. Sprinkle some nutmeg over it and drop six thin lemon slices, each studded with four cloves, into the mix. Drink hot. [4] X Research source"
    },
    {
      "title": "Brew some hot toddy tea.",
      "content": "Brew some hot toddy tea. The traditional hot toddy is also available in a flavorful tea variant. To get started, boil 8 ounces (240 milliliters) of water and add in ¼ teaspoon of ground ginger, 3 whole cloves, 1 cinnamon stick, and 2 bags of green or orange tea. Let it brew for 5 minutes, then take out the tea bags. [5] X Research source Reheat the tea in the microwave for 1 minute, then add 2 tablespoons of honey and 1 tablespoon of lemon juice. Pour 1 or 2 ounces (30 – 60 milliliters) of whiskey into the cup. Stir everything with a spoon and drink while warm."
    },
    {
      "title": "Brew some berry-rum tea.",
      "content": "Brew some berry-rum tea. A hot and flavorful mixture of herbal tea and booze can help you treat your cold. Brew a bag of berry-flavored herbal tea in 6 ounces (180 milliliters) of boiling water for two to three minutes. Discard the tea bag, then add 1 ½ ounces (45 milliliters) of white rum, ½ tablespoon of lemon juice, and 1 teaspoon of honey. Stir everything together, then garnish with a lemon twist (or some lemon peel). [6] X Research source"
    },
    {
      "title": "Try a whisky chai.",
      "content": "Try a whisky chai. Whisky chai is a tasty beverage that combines traditional chai tea with a bit of whisky. To get started, mix 16 powdered cloves, one teaspoon ginger, eight powdered cardamom pods (without seeds), 20 powdered black peppercorns, a pinch of nutmeg, and two powdered cinnamon sticks. In a medium saucepan, simmer one quart (one liter) of whole milk. Stir in the spices. Let the spices and milk mingle for 10 minutes. [7] X Research source Strain the mixture after 10 minutes, then return it to the saucepan. Stir in three ounces (89 milliliters) whisky. Drink the whisky chai while hot."
    },
    {
      "title": "Drink with moderation.",
      "content": "Drink with moderation. Drinking alcohol to treat a cold cannot replace modern medicine or rest. Drinking too much alcohol can cause liver damage in the long run and can also make cold symptoms, such as congestion, sore throats, and coughing, much worse. [8] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source These remedies are best used occasionally."
    },
    {
      "title": "Be aware that alcohol can weaken the immune system.",
      "content": "Be aware that alcohol can weaken the immune system. Drinking too much alcohol can weaken your immune system, making it easier for you to get sick. When you are already sick, your immune system is weaker than normal. This means that drinking alcohol while sick may make it even more difficult for you to recover. [9] X Research source"
    },
    {
      "title": "Know that alcohol can dehydrate you.",
      "content": "Know that alcohol can dehydrate you. When you are sick, you need to stay hydrated by drinking plenty of fluids; this helps improve sore throats and congestion. Certain fluids, such as alcohol and caffeine, can dehydrate you instead, making things like congestion, sore throats, and coughing worse. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Check your medication for compatibility with alcohol.",
      "content": "Check your medication for compatibility with alcohol. Many medicines used to treat colds react negatively with alcohol. [11] X Research source Combined with alcohol, they could cause dizziness, drowsiness, fainting, headaches, nausea, and vomiting. Check the user instructions you got with your medicine before drinking, and check the warning label. Common cold-related medicines that should not be taken with alcohol include: aspirin acetaminophen (Tylenol) ibuprofen (Motrin, Advil) naproxen (Aleve) cough syrups (Robitussin Cough, Robitussin A-C) azithromycin (Azomax, Zithromax) [12] X Research source"
    }
  ]
}