{
  "url": "https://www.wikihow.com/Stop-Skipping-Class",
  "title": "How to Stop Skipping Class",
  "steps": [
    {
      "title": "Speak with your professor.",
      "content": "Speak with your professor. Skipping even one class can get you behind on your work. Speak with your professor as soon as possible in order to get caught up, as well as to make it clear to them that although you may have skipped a class (or many classes), you are still making an effort to learn the material and get a good grade. E-mailing them is a good way to do this initially, as it allows you to think carefully as to what you want to say. [1] X Research source Try to follow up by going to your professor's office hours. This will make an even greater impression on them, and they will want to help you pass the class even more. Even if you've skipped more classes than you have attended, and you think there's no way you can pass at this point, it is always worth a shot to speak with your professor and see if there is any way you can pass the class."
    },
    {
      "title": "Speak with your parents.",
      "content": "Speak with your parents. Yep, you read that right. Although you might want to avoid getting in trouble, being honest with your parents about poor attendance will motivate you to not stop making the same mistakes. This will also give your parents some foresight, so if you do end getting bad grades, they will not be totally shocked all at once."
    },
    {
      "title": "If depression and/or anxiety are preventing you from going to class, get help.",
      "content": "If depression and/or anxiety are preventing you from going to class, get help. Depression and anxiety are two of the main reasons why college students end up skipping many classes during a semester. Skipping one class leads to more worry and sadness, which leads you to feel overwhelmed, which prevents you from getting to your next class, and this just further creates a negative feedback loop. Dealing with depression and anxiety is very difficult to do by oneself, so get help as soon as you can. And remember, no matter how overwhelmed you feel by college, hurting yourself is never the solution. College can be tough, but remember that it's only temporary. [2] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Make sure you don't oversleep.",
      "content": "Make sure you don't oversleep. Set your alarm loud, and have your coffee ready to brew immediately upon waking up if necessary. Do some stretching and wash your face with cold water. Try to avoid the snooze button altogether. If you can break yourself from the snooze addiction, not only will getting to class be easier, but you will likely find yourself feeling more well rested. Repeatedly being woken up by the snooze button is a form of fragmented sleep, which has been proven to not actually make you feel more rested. [3] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If you take a nap in the afternoon, set your alarm to let you sleep for either 20 minutes or 90 minutes, and don't use the snooze button! You snooze you lose!"
    },
    {
      "title": "Prepare for your class in advance.",
      "content": "Prepare for your class in advance. Be sure to prepare all necessary homework, read textbook sections beforehand, and have all of your class materials prepared. However, if you fail at this step, don't let it be an excuse to not go to class! Going to class unprepared is better than not going at all."
    },
    {
      "title": "Get to class early.",
      "content": "Get to class early. Walking into class late can feel uncomfortable, and the mentality of \"I'm already late to class, I may as well just skip it,\" can be entirely avoided by going to class early. However, once again, don't let failing at this step be an excuse! You are in college, so your professors and peers do not really care that you are walking into class twenty minutes late."
    },
    {
      "title": "Know your schedule like the back of your hand.",
      "content": "Know your schedule like the back of your hand. Even if you think you know when and where your next class is, double check. This is especially important during the first two weeks of class. [4] X Research source"
    },
    {
      "title": "Tell yourself that you can go to class, and will now decide to do it.",
      "content": "Tell yourself that you can go to class, and will now decide to do it. This step may sound obvious, but it's still the main reason why some students skip many classes. Going to class isn't actually that bad! Getting to class may not give the same immediate reward as staying in your dorm and sleeping or hanging out with your friends, but remind yourself that skipping class has consequences. Going to class and making the most out of it can be surprisingly gratifying. Make the decision today to not skip any more classes. You can do it!"
    }
  ]
}