{
  "url": "https://www.wikihow.com/Test-a-Microwave%27s-Magnetron",
  "title": "How to Test a Microwave's Magnetron",
  "steps": [
    {
      "title": "Fill a glass measuring cup with 2 c (470 ml) of water.",
      "content": "Fill a glass measuring cup with 2 c (470 ml) of water. Use a measuring cup made of glass or Pyrex since it will be the safest to use. Add room-temperature water to the cup until it’s level with the 2 cups (470 ml) mark on the side. [1] X Research source Avoid using cold water since it could make the test results inaccurate. You may also use a microwave-safe plastic container if you don’t have a glass measuring cup."
    },
    {
      "title": "Measure and record the water’s temperature.",
      "content": "Measure and record the water’s temperature. Dip the end of a food thermometer in the cup of water and stir it around. Continue stirring until the reading stops at a consistent temperature. Write down the starting measurement so you don’t forget it. If you don’t stir the water, you could get an inaccurate reading."
    },
    {
      "title": "Put the measuring cup in your microwave on high for 1 minute.",
      "content": "Put the measuring cup in your microwave on high for 1 minute. Set the cup of water in the middle of the microwave’s rack so it gets heated evenly. Allow your microwave to run through its entire cycle before opening the door. [2] X Research source Check the microwave’s manual if you don’t know how to change the settings."
    },
    {
      "title": "Check if the water’s temperature raised by 35–65°F (19–36°C).",
      "content": "Check if the water’s temperature raised by 35–65°F (19–36°C). Stir the thermometer in the water until you get a consistent reading. Record your measurement and compare it to the first one. If the water temperature rose by 35–65°F (19–36°C), then your magnetron works great! [3] X Research source If the temperature doesn’t increase by at least 35°F (19°C), then the magnetron may be faulty and you will have to replace it."
    },
    {
      "title": "Unplug your microwave.",
      "content": "Unplug your microwave. Never take apart or work on your microwave while it’s still plugged in since you could get shocked or electrocuted. Locate the plug for your microwave and disconnect it from power completely. If you have a microwave mounted over your stove, look inside of a cabinet above it for the outlet."
    },
    {
      "title": "Unscrew the casing from each side of the microwave to remove it.",
      "content": "Unscrew the casing from each side of the microwave to remove it. Look for the screws on the top, back, bottom, and sides of your microwave. Use a screwdriver with an insulated handle to turn the screws counterclockwise until they’re loose. Once you remove all of the screws, carefully lift the casing off of the microwave and set it aside. [4] X Research source You do not need to remove the door or the button panel to access the magnetron. Organize the screws in small dishes for each side so you don’t lose them. Don’t touch any wires inside the microwave since they could possibly still have a charge. If you want, wear rubber gloves for an additional layer of protection."
    },
    {
      "title": "Place an insulated screwdriver against the capacitor’s terminals to discharge it.",
      "content": "Place an insulated screwdriver against the capacitor’s terminals to discharge it. Locate a small metal box near the back of your microwave that has a black cylinder sticking out from the side, which is the capacitor. Find the metal prongs that stick out from the end of the capacitor and have wires connected to them. Hold onto your screwdriver’s insulated handle and make sure you aren’t touching any metal. Slide the screwdriver next to the capacitor and press the metal part against the terminals. You may hear a click or snapping sound once you discharge it. [5] X Research source If you want to minimise the risk of electric shock whilst discharging the capacitor, wear some insulated gloves as well. Sometimes, the metal box with the capacitor has the image of a lightning bolt on it to mark that it’s dangerous. Avoid using an uninsulated tool to discharge the capacitor since you could seriously injure yourself. If you have trouble finding the capacitor, check the microwave’s manual or contact a professional repair person to help you."
    },
    {
      "title": "Disconnect the wires and plugs from the magnetron.",
      "content": "Disconnect the wires and plugs from the magnetron. Look for the magnetron, which looks like 2 large metal boxes stacked on top of each other near the back of the machine. Find where the wires or plugs connect to the sides of the magnetron and carefully pull them out by hand. If they have locking tabs, pinch the tabs so you can pull the wires out without damaging them. [6] X Research source Your microwave may have multiple magnetrons, so be sure to unwire all of them. Since you discharged the capacitor, the wires and components won’t have any voltage."
    },
    {
      "title": "Loosen the screws holding the magnetron down.",
      "content": "Loosen the screws holding the magnetron down. Locate the mounting screws holding the base of the magnetron inside of the microwave. Use your screwdriver to turn the screws counterclockwise until you’re able to pull them out by hand. Carefully grab the magnetron and guide it straight out from the microwave. [7] X Research source There may be other supports or baffles around the magnetron. Unscrew and remove them as well if they prevent you from pulling out the magnetron."
    },
    {
      "title": "Set your multimeter to the lowest ohms setting.",
      "content": "Set your multimeter to the lowest ohms setting. Look at the multimeter’s dial and locate the section labeled with the omega symbol (Ω), which is used for measuring ohms and resistance. Turn the dial to the smallest resistance listing so you get the most accurate reading from the magnetron. [8] X Research source You can buy a multimeter from your local hardware store."
    },
    {
      "title": "Hold the multimeter leads against the prongs on the magnetron.",
      "content": "Hold the multimeter leads against the prongs on the magnetron. Find the 2 metal prongs sticking out from the side of the magnetron. Take one of the leads from your multimeter and hold it against the side of the prong. Then put the second lead on the other prong, making sure the multimeter leads don’t touch one another. [9] X Research source It doesn’t matter which prong you choose since the measurement will be the same."
    },
    {
      "title": "Check for a reading below 1 ohm to determine if the filament is good.",
      "content": "Check for a reading below 1 ohm to determine if the filament is good. Look at the multimeter’s screen and take note of the reading. If the resistance stays below 1 ohm, then the electric filament inside the magnetron functions properly. If you get a higher reading or if the screen reads “OL”, then the magnetron is faulty and should be replaced. Your magnetron still may not work properly even if it has a good filament, so keep testing it."
    },
    {
      "title": "Turn the multimeter to the highest ohms setting.",
      "content": "Turn the multimeter to the highest ohms setting. Rotate the dial on your multimeter to the highest option for testing resistance. It’s okay to leave the leads against the magnetron’s prongs while you change settings. [10] X Research source"
    },
    {
      "title": "Place one of the leads against the magnetron’s metal casing.",
      "content": "Place one of the leads against the magnetron’s metal casing. Leave one of the leads against a prong on the magnetron. Take the other lead and place it anywhere on the metal box surrounding the prongs. Make sure you press the lead firmly against the box, or else you won’t get an accurate reading. [11] X Research source Make sure the leads don’t slip or come loose while you’re taking your measurement."
    },
    {
      "title": "Look for an open line reading to see if the magnetron works properly.",
      "content": "Look for an open line reading to see if the magnetron works properly. Read the screen on the multimeter to find your reading. If it says “OL” or “Open Line”, then the magnetron works properly! If you register any other reading, then replace the magnetron. If the magnetron reads any resistance, the electrical current won’t be able to move through it as easily. You can buy magnetrons online or from appliance stores for around $35–100 USD."
    }
  ]
}