{
  "url": "https://www.wikihow.com/Tell-Wool-Yarn-from-Acrylic-Yarn",
  "title": "How to Tell Wool Yarn from Acrylic Yarn",
  "steps": [
    {
      "title": "Read the label.",
      "content": "Read the label. It sounds obvious, but this will be the most reliable and accurate way to find out. The label will tell you what the yarn is made out of: wool, acrylic, cotton, and so forth. The label will also tell you how information like how many yards of yarn are in the skein, how much the skein weighs, and what size needle you should use for that yarn. [1] X Expert Source Jen Webber Knitting Specialist Expert Interview. 4 August 2020."
    },
    {
      "title": "Touch the yarn and feel how soft or coarse it is.",
      "content": "Touch the yarn and feel how soft or coarse it is. Wool yarn tends to be much softer than acrylic yarn. Acrylic yarn tends to feel a little coarse. This is easier if you have another yarn that you know is wool or acrylic to use as comparison. The touch test is not very reliable. Many acrylic yarns can feel soft and silky. A soft and silky texture can also indicate silk or rayon, instead of wool."
    },
    {
      "title": "Look for a hairy texture.",
      "content": "Look for a hairy texture. Acrylic yarn may feel rough, but it won't look hairy. Wool yarn may have some longer fibers sticking out of it. Keep in mind that acrylic-wool blends may also have some hairy fibers. Yarn made from other natural fibers may also have a hairy look to it."
    },
    {
      "title": "Note the price difference.",
      "content": "Note the price difference. If you can't find what the yarn is made out of on the label, look at the price; it may be a good indicator of whether or not the yarn is real wool. Acrylic yarn tends cost much less than wool yarn. Keep in mind, however, that some factors may increase the price of acrylic yarn, such as thickness, added sequins or tinsel, or blended fibers."
    },
    {
      "title": "Cut two pieces of yarn that are several inches long.",
      "content": "Cut two pieces of yarn that are several inches long. Make sure that both pieces of yarn come from the same skein. In this method, you will be \"felting\" the yarn. If the yarn fuses together easily, it is made from wool. If it does not fuse together easily, it is made from acrylic."
    },
    {
      "title": "Untwist the first few inches of each piece of yarn and separate the loose threads into two, even groups.",
      "content": "Untwist the first few inches of each piece of yarn and separate the loose threads into two, even groups. Yarn is made by twisting thinner pieces of yarn together. In order to felt the yarn, you will need to untwist it. Gently roll the yarn back and forth between your fingers until the threads loosen, and pull them apart into two, even groups. For example, if the yarn has 6 threads, separate it into 2 groups of 3 threads. Do this for both pieces of yarn."
    },
    {
      "title": "Shorten one set of threads on each piece of yarn.",
      "content": "Shorten one set of threads on each piece of yarn. Each piece of yarn will have one long set of threads, and one short set of threads. You will be twisting the longer threads together to fuse the yarn together."
    },
    {
      "title": "Overlap the long threads on both pieces of yarn until the short threads touch.",
      "content": "Overlap the long threads on both pieces of yarn until the short threads touch. Lay the two pieces of yarn down on the table so that frayed ends are facing each other. Move them towards each other until the long threads overlap and the short threads touch."
    },
    {
      "title": "Dampen the long threads.",
      "content": "Dampen the long threads. You can do this simply by dipping them in water, or misting them lightly with a spray bottle. You can also lick them."
    },
    {
      "title": "Rub and roll the overlapped long threads between your fingers until the yarn dries.",
      "content": "Rub and roll the overlapped long threads between your fingers until the yarn dries. As you roll, the long threads may come together. Don't worry if they don't come together easily or at all. This is part of the test!"
    },
    {
      "title": "Judge the results.",
      "content": "Judge the results. If the two pieces have fused together easily, and are difficult to pull apart, the yarn is made from wool. If the two pieces did not fuse together easily, and they come apart, the yarn is acrylic. [2] X Research source Felted wool may look dull and feel a little stiff, especially if it was soft and silky to begin with. [3] X Research source"
    },
    {
      "title": "Find a sink to work over.",
      "content": "Find a sink to work over. This way, you will have water handy in case the flame goes out of control. Make sure that there is nothing near by that can catch on fire, such as curtains, towels, or detergents. [4] X Research source If you can't work over a sink, try to work over a bowl of water."
    },
    {
      "title": "Create a flame.",
      "content": "Create a flame . You can do this simply by lighting a candle or starting a lighter."
    },
    {
      "title": "Cut off a piece of yarn.",
      "content": "Cut off a piece of yarn. The yarn should be about the length of your finger."
    },
    {
      "title": "Use a pair of tweezers to hold the yarn above the flame until it burns.",
      "content": "Use a pair of tweezers to hold the yarn above the flame until it burns . Take note of how the yarn burns, and what it smells like. If the yarn smells like burning hair, it is wool. If the yarn smells like chemicals or burning plastic, it is acrylic. [5] X Research source [6] X Research source Wool yarn will burn quicker than acrylic yarn."
    },
    {
      "title": "Blow the flame out and let the yarn cool before examining the end.",
      "content": "Blow the flame out and let the yarn cool before examining the end. Take a look at how the yarn looks like. If the yarn is wool, the burnt end will have turned to ash. It may crumble and turn to dust if you touch it. If the yarn is acrylic, the end will have melted and turned hard. It may look black or dark brown. [7] X Research source [8] X Research source"
    },
    {
      "title": "Cut a 2 inch (5.08 centimeters) long piece of yarn.",
      "content": "Cut a 2 inch (5.08 centimeters) long piece of yarn. The color of the yarn does not matter. The bleach will dissolve real wool, and it won't do anything to acrylic."
    },
    {
      "title": "Place the yarn into a small glass jar.",
      "content": "Place the yarn into a small glass jar. Make sure that your jar has a lid, as you will need to seal it in order for this to work."
    },
    {
      "title": "Add 1 tablespoon (30 milliliters) of bleach into the jar.",
      "content": "Add 1 tablespoon (30 milliliters) of bleach into the jar. The bleach should completely cover the yarn. If you are using a larger jar, you may need more bleach. Keep adding bleach until it covers and soaks the yarn."
    },
    {
      "title": "Close the jar tightly and wait a few hours to overnight.",
      "content": "Close the jar tightly and wait a few hours to overnight. You may notice a slight fizzing after a few minutes. Don't worry. This is normal, and an indicator that the yarn is made of wool, or another natural fiber."
    },
    {
      "title": "Check the jar and examine the results.",
      "content": "Check the jar and examine the results. If the yarn has disappeared, it was made from wool. If the yarn is still there, take a closer look. A 100% acrylic yarn will be mostly unchanged, although it may have faded a little. Yarn made from an acrylic-wool blend will appear somewhat damaged. It may be faded, ragged, or thinner than when you first put it in."
    }
  ]
}