{
  "url": "https://www.wikihow.com/Stop-a-Car-with-No-Brakes",
  "title": "How to Stop Manual & Automatic Cars without Brakes",
  "steps": [
    {
      "title": "Turn your hazard lights on to warn other drivers.",
      "content": "Turn your hazard lights on to warn other drivers. While they may not be able to figure out what the problem is, your hazard lights will tell other drivers to proceed with caution and pay attention to what your vehicle is doing. Your hazard light button should be somewhere on your dashboard, and the symbol for them is an orange triangle inside an orange triangle."
    },
    {
      "title": "Take your foot off the gas and/or turn off the cruise control.",
      "content": "Take your foot off the gas and/or turn off the cruise control. Lifting off the gas will begin to slow the car down, just by virtue of friction and gravity. Also, your cruise control system should turn off as soon as you touch the brake or clutch, but to be safe, make sure to switch it off manually."
    },
    {
      "title": "Shift into a lower gear.",
      "content": "Shift into a lower gear. If you're driving a manual, press the clutch and downshift into the next gear down. This will begin to slow the car. Keep shifting down as you feel the car slow down. If you're in an automatic, use the gear selector to shift to second. Then, shift to first (also sometimes marked as \"L\" or \"lower\"). [1] X Research source While you may be feeling panicked, you don't need to downshift all at once. Let the car slow down naturally if you're not in danger of hitting something. Most automatics have a second and first gear on the gear selector. If you have tap-to-shift, shift into manual \"M\" (generally to the right or left of \"Drive\" on console-shift vehicles or the bottom gear on column-shift vehicles) and press the minus button to shift down. Again, if you can’t go directly into the lowest range, try gradually shifting down."
    },
    {
      "title": "Pull over to the side of the road.",
      "content": "Pull over to the side of the road. Look for a place to get off the road. You want to cause as little damage as possible to you and other vehicles, so get away from the main thoroughfare if possible. If you're on the freeway, get off it if you can. [2] X Research source If you can't get off the freeway, use the shoulder."
    },
    {
      "title": "Pump the brakes to try to stop.",
      "content": "Pump the brakes to try to stop. When your brakes fail, often they will only partially fail. You may still have some brakes in place, and pumping the brakes may be enough to slow you to a complete stop. After pumping a few times, press the brakes all the way to the floor to see if you have any pressure left. [3] X Research source Pump quickly to build up friction."
    },
    {
      "title": "Try the emergency (parking) brake at lower speeds.",
      "content": "Try the emergency (parking) brake at lower speeds. If you still aren't stopped, pull up on the emergency brake. That's usually the large lever that's next to the driver's seat in most cars, though in some, it may be a pedal you push. The emergency brake may still be working even if your other brakes aren't. [4] X Research source Pull the parking brake slowly, holding the release button as you do if your car has one. If you tug on it too quickly, you may cause your wheels to lock. If you have an electric parking brake, they may lock anyway. It's a good idea to try to slow the car before pulling the emergency brake. If your tires do lock, you can skid at high speeds. If you feel or hear your tires lock, release a small bit of pressure from the brake application and hold it there."
    },
    {
      "title": "Open your windows to create air resistance in your car.",
      "content": "Open your windows to create air resistance in your car. This action won't stop the car on its own. However, it may help to slow you down a little. Plus, it enables you to shout to other passengers and drivers as needed. Roll all the windows down that you can."
    },
    {
      "title": "Turn up a hill to slow yourself down.",
      "content": "Turn up a hill to slow yourself down. If you can, look for a road that's going uphill, even if it's only slightly. If your car isn't braking, the slope may slow it down enough to come to a stop. For instance, even going up an on-ramp may slow you down, but be sure to stay out of the way of other cars if possible. [5] X Research source However, don't try to turn into an uphill driveway, as you may not stop before you hit buildings."
    },
    {
      "title": "Turn the key to the \"off\" position if you can't stop.",
      "content": "Turn the key to the \"off\" position if you can't stop. If other methods fail, turning the engine off can at least cut your speed off. Wait until you've slowed down as much as you possibly can before trying this method, as suddenly shutting the engine off can make you swerve. It can also damage your engine, though, so leave this as a last resort. Do not turn your engine to \"lock,\" though, as that will also lock your wheel. You still need to be able to steer."
    },
    {
      "title": "Drag your car as a last resort.",
      "content": "Drag your car as a last resort. If you absolutely can't stop your car another way, try dragging it along or over something to slow it. For instance, run the car along a curb or wall barrier, which will slow it, though it will likely destroy it in the process. You can also try driving in a straight line across mud or gravel. If you turn, though, it can cause the car to flip."
    },
    {
      "title": "Keep your eyes on the road and continue to steer.",
      "content": "Keep your eyes on the road and continue to steer. Pay attention to what’s in front of you, and maneuver to avoid heavy traffic, pedestrians, and dangerous obstacles. You may be close to stopping, but you could still cause damage if you're not paying attention."
    }
  ]
}