{
  "url": "https://www.wikihow.com/Urinate-Standing-Up-as-a-Female",
  "title": "How to Pee Standing Up as a Woman: With and without a Device",
  "steps": [
    {
      "title": "Move your clothing out of the way.",
      "content": "Move your clothing out of the way. When you’re first practicing this method, take off everything from the waist down just in case you make a mess. When you’re using this technique out in the wild, either pull your pants and underwear down, or pull your underwear to the side."
    },
    {
      "title": "Stand in front of a toilet or in a shower stall.",
      "content": "Stand in front of a toilet or in a shower stall. Stand with your feet about 2 feet (0.6 m) apart to get the right stance. If you’re in a public restroom, aim for a toilet. If you’re by yourself, head to a shower stall to contain any mess you might make. If you’re outdoors, just position yourself in a relatively private area where the ground is flat."
    },
    {
      "title": "Use 1 finger on each hand to pull your labia minora apart.",
      "content": "Use 1 finger on each hand to pull your labia minora apart. Place your fingers slightly in front of your urethra (which is located between your clitoris and vagina). Gently pull your fingers up and forward just a little, while putting even pressure on both sides. The goal here is to expose the urethra to avoid any leakage or spills. As you get more advanced, you can use 2 fingers on 1 hand instead of 1 finger on either hand. Simply make a “V” shape with your pointer and middle finger, then use those fingers to spread your labia minora apart."
    },
    {
      "title": "Push your hips forward as you start peeing.",
      "content": "Push your hips forward as you start peeing. Now it’s time to relax and let loose. As you start peeing, gently rock your hips forward to aim your stream well away from you. Push hard at the beginning of your flow and then once again at the end to cut down on any dribbles. Experiment a bit with posture. You may find it helpful to bend your knees a bit or arch your back."
    },
    {
      "title": "Wipe yourself with toilet paper.",
      "content": "Wipe yourself with toilet paper. Even while peeing standing up, it’s still important to clean up afterwards. Use a bit of toilet paper if you have it to wipe your vulva, and take care of any drips or drops you left on the toilet, too. If you’re practicing this method in the shower, rinse the tub or shower floor out afterwards. The first time you try this technique, you’ll probably find that your urine spray goes everywhere. That’s okay! Just like most things, this takes time and practice, and you will get better at it."
    },
    {
      "title": "Move your clothing out of the way.",
      "content": "Move your clothing out of the way. When you use a stand-to-pee device , you still need to have full access to your vulva. Either pull your pants and underwear down or move your clothing to the side before you start. [1] X Research source There are lots of different brands of stand-to-pee devices, and all are relatively similar. Popular ones include Shewee , Sunany , and pStyle . In a pinch, you can even make your own stand-to-pee device out of a plastic bottle."
    },
    {
      "title": "Place the stand-to-pee device over your vulva.",
      "content": "Place the stand-to-pee device over your vulva. Grab the device by the base, then place it securely against your body. Make sure the back end of the device almost touches your bum, while the front end completely covers your vulva. This may seem like overkill, but you want to catch as much urine as possible to avoid any spillage. [2] X Research source Your urethra, or where the pee comes out, is located between the clitoris and the vagina."
    },
    {
      "title": "Pee into the funnel, directing the stream away from you.",
      "content": "Pee into the funnel, directing the stream away from you. It’s time to relax and let your urine flow. If you have trouble, give yourself a few moments—when you’re used to peeing sitting down all the time, it can be tough to allow yourself to pee while standing. As you pee, the flow will go into the device and out the bottom end. [3] X Research source Be sure to point the end of the funnel well away from you (and away from your feet). If you’re peeing into a toilet, put the seat up before you start. This will help prevent any urine from getting on the toilet seat."
    },
    {
      "title": "Shake out the device once you’re done.",
      "content": "Shake out the device once you’re done. Once you’ve stopped peeing, gently remove the device from your body and give it a few shakes to dislodge any excess urine. If you have toilet paper, wipe your vulva and the device to avoid any drips. [4] X Research source Once you’ve used the device, use water to rinse it out as soon as possible. As soon as you can, wash it out with soap and water to avoid any germs."
    },
    {
      "title": "Pick a private spot to go pee.",
      "content": "Pick a private spot to go pee. If you’re going to the bathroom in the woods or while you’re camping, it’s important to choose a secluded area. Find somewhere off-trail where other people can’t see you so you won’t be interrupted. [5] X Trustworthy Source US National Park Service Agency responsible for the maintenance and promotion of national parks and monuments Go to source When peeing outdoors , aim for rocky areas rather than plants and grass. The salt from your urine can harm fragile plants, but it won’t do much to rocky, dry areas."
    },
    {
      "title": "Keep hand sanitizer with you.",
      "content": "Keep hand sanitizer with you. Before you pee standing up, it's essential that you wash your hands. You're going to be touching your genital area and you don't want germs from your hands to cause a urinary tract infection. Because vulvas have short urethras, it's easy for germs to move up to the bladder. [6] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If soap and water aren't available, use hand sanitizer to protect yourself. Plus, public restrooms can be pretty gross. Use hand sanitizer afterwards to disinfect your hands from anything you might have touched."
    },
    {
      "title": "Bring wet wipes to use when you’re done.",
      "content": "Bring wet wipes to use when you’re done. A travel-sized pack of wet wipes goes a long way when peeing while standing up. If you’re using the two-finger method, there’s a chance that your hands could get urine on them. Use your wipes to clean up any spills or leaks when you’re done. Always throw wet wipes in the garbage, not down the toilet. Flushing wet wipes can cause blockages in the sewer systems, leading to an overflowing toilet."
    }
  ]
}