{
  "url": "https://www.wikihow.com/Tie-Kilt-Shoes",
  "title": "How to Tie Kilt Shoes",
  "steps": [
    {
      "title": "Put your shoes on and pull the laces to tighten them.",
      "content": "Put your shoes on and pull the laces to tighten them. Make sure that the laces are threaded through each of the holes in the shoe. The laces should cross over each other at every pair of holes. Pull the laces tight by tugging on them, just as you would to start tying ordinary shoes. If you don’t have special ghillie brogues, you can improvise them by cutting the tongue out of ordinary dress shoes. [1] X Research source Wear your ghillie brogues with long socks, with the ribs running vertically, garters, and, of course, a kilt ."
    },
    {
      "title": "Twist the laces around each other 3-6 times in the front.",
      "content": "Twist the laces around each other 3-6 times in the front. An easy way to do this is to hold one lace straight, and wrap the other one around it. Start twisting them about 1 inch (2.5 cm) above the shoe top. This will make a vertical twisted rope of laces. [2] X Research source You can decide if you want to twist 3 times, to have the eventual bow closer to your shoe, or more like 6 times, to have it farther up your leg. Whatever you prefer. [3] X Research source"
    },
    {
      "title": "Bring the laces around to the back of your ankle.",
      "content": "Bring the laces around to the back of your ankle. Wrap one lace around each side of your leg, so that they meet at the back. They should meet about 3 inches (7.6 cm) above your ankle. [4] X Research source They should be tight enough around your leg that they stay up, but not so tight that they pinch."
    },
    {
      "title": "Twist the laces together behind your leg.",
      "content": "Twist the laces together behind your leg. Twist them between 2-4 times, however many you prefer. Again, you can hold one lace still and wrap the other around it. [5] X Research source A good guideline is to have fewer twists in the back of the leg than in the front."
    },
    {
      "title": "Make a simple overhand knot at the front or side of your leg.",
      "content": "Make a simple overhand knot at the front or side of your leg. Wrap one lace around each side of your leg so that they meet either at the outer side of your leg, or at the front of your leg. Tie a simple overhand knot, like you do to start tying your shoes ordinarily. Just pass one lace around the other one. If you’d like to tie your bow at the outer side of your ankle, instead, tie your half-hitch there. [6] X Research source It’s more traditional to tie your knot on the side of the leg, but you can also do it in the front if you like the way it looks."
    },
    {
      "title": "Tie your bow at the side of your leg if you’d like.",
      "content": "Tie your bow at the side of your leg if you’d like. This is the more traditional place to tie the bow. Once you’ve made your overhand knot at the side of the leg, tie your bow there, just like you were tying shoes . [7] X Research source Make sure that both loops of the bow are the same size."
    },
    {
      "title": "Tie a bow at the front of your leg if you’d prefer.",
      "content": "Tie a bow at the front of your leg if you’d prefer. Tying the bow at the front gives a nice, symmetrical look, and some people prefer it to the more-traditional side bow. Right where you’ve done your overhand knot at the front, tie a bow, just as you do when you’re tying regular shoes. The bow should be about 3 inches (7.6 cm) above your ankle. [8] X Research source If you do it any higher up your leg than that, the bow will start to slip down your ankle. [9] X Research source"
    }
  ]
}