{
  "url": "https://www.wikihow.com/Zip-a-Folder",
  "title": "How to Zip a Folder",
  "steps": [
    {
      "title": "Place the file you want to zip in a place where you have easy access.",
      "content": "Place the file you want to zip in a place where you have easy access. You may want to use the \"desktop\" or a folder in the \"documents\" section."
    },
    {
      "title": "Consider creating and zipping a new folder, if you want to compress multiple files.",
      "content": "Consider creating and zipping a new folder, if you want to compress multiple files. This will save space and work if you are planning to send files over email. It will also allow you to keep files together so you don't lose them. Create a new folder on your desktop or in a documents folder by pressing your right mouse button. Select \"New Folder\" and name it according to your file type or project. Creating and zipping a folder is also useful for data storage, email inbox storage and email transmission times."
    },
    {
      "title": "Select the item that you would like to compress.",
      "content": "Select the item that you would like to compress. You will usually use a mouse to do this."
    },
    {
      "title": "Hold down the right button on the mouse.",
      "content": "Hold down the right button on the mouse. A list of options will pop up. If you don't have a right mouse button, hold down \"Shift\" and \"F10\" to get the same list of options."
    },
    {
      "title": "Choose the \"Send To\" option in the list of right-click options.",
      "content": "Choose the \"Send To\" option in the list of right-click options."
    },
    {
      "title": "Move your cursor right, into the list of \"Send To\" options.",
      "content": "Move your cursor right, into the list of \"Send To\" options. Choose \"Compressed Folder.\" Wait while the folder compresses."
    },
    {
      "title": "Look for a new icon in the folder.",
      "content": "Look for a new icon in the folder. It should say the previous folder's name and a \".zip\" file extension name."
    },
    {
      "title": "Attach this file to an email, place it on a hard drive or simply keep it in the folder.",
      "content": "Attach this file to an email, place it on a hard drive or simply keep it in the folder. A person who receives a .zip file must double click on the folder to unzip the file. After completing this, they will be able to access all of the files in the original folder."
    },
    {
      "title": "Create a new folder on your desktop or in a documents folder.",
      "content": "Create a new folder on your desktop or in a documents folder."
    },
    {
      "title": "Name the folder according to the project or file subject.",
      "content": "Name the folder according to the project or file subject."
    },
    {
      "title": "Add the files you want to compress to that folder.",
      "content": "Add the files you want to compress to that folder."
    },
    {
      "title": "Select the folder using your mouse or track pad.",
      "content": "Select the folder using your mouse or track pad."
    },
    {
      "title": "Right click on the folder.",
      "content": "Right click on the folder. Scroll down and click on the option \"Compress Folder Name.\" If you do not have a mouse with a right mouse button, press the \"Control\" button and the track pad bar at once. Scroll down with your track pad and click on the \"Compress\" option."
    },
    {
      "title": "Wait for the folder to be compressed.",
      "content": "Wait for the folder to be compressed. Then, send or store the zipped file. Anyone who receives the file will need to double click on the .zip file to unzip and use it."
    }
  ]
}