{
  "url": "https://www.wikihow.com/Steam-Clean-a-Microwave",
  "title": "How to Steam Clean a Microwave",
  "steps": [
    {
      "title": "Prepare a solution of 1 part water to 1 part vinegar.",
      "content": "Prepare a solution of 1 part water to 1 part vinegar. In a microwave safe bowl or mug, add 1 cup (240 ml) of water with 1 cup (240 ml) of white or apple cider vinegar. Stir it up until it’s mixed and place it in the center of the microwave. [1] X Research source A standard 2 cups (470 ml) measuring cup works perfect, but you can use any microwave-safe dish. If you are sensitive to or don’t like the smell of vinegar, you can use less or add a few drops of any scented essential oil to cover the smell and still have great results. [2] X Research source Or, substitute lemon, lime, or orange juice for the vinegar. [3] X Research source Depending on the size of your microwave, you can use more or less water and vinegar as long as you keep the 1:1 ratio."
    },
    {
      "title": "Wipe the debris out of your microwave before you steam it.",
      "content": "Wipe the debris out of your microwave before you steam it. Use a damp paper towel to wipe out any cooked on food and other debris that is inside of your microwave. Otherwise, it may get cooked on and this can make it harder to clean your microwave."
    },
    {
      "title": "Microwave the vinegar and water solution on high for 5 minutes.",
      "content": "Microwave the vinegar and water solution on high for 5 minutes. The solution will boil, heating up the microwave and releasing a lot of steam. It’s fine if it boils over a little, you are going to wipe it clean anyways. If you place a small wooden spoon or toothpick in the dish with the solution, it helps the solution to boil by giving the bubbles a place to form. [4] X Research source"
    },
    {
      "title": "Remove the solution from the microwave using a heat-resistant mitt.",
      "content": "Remove the solution from the microwave using a heat-resistant mitt. The solution and the dish will be very hot, so be very careful when handling it and move it slowly to avoid injury. Be sure to place the hot dish on a heat-resistant mat or trivet after you remove it so you don’t damage your countertop."
    },
    {
      "title": "Wipe down the microwave with a wet sponge or paper towels.",
      "content": "Wipe down the microwave with a wet sponge or paper towels. The steam and the heat from the vinegar and water solution will have loosened all the particles from the walls, top, and bottom of the microwave. All that mess will wipe clean easily without any scrubbing. [5] X Research source"
    },
    {
      "title": "Use the sponge or paper towels to clean the exterior of the microwave.",
      "content": "Use the sponge or paper towels to clean the exterior of the microwave. Wipe the exterior clean of grease or stuck on food with the saturated sponge or paper towels that you used to clean in the interior. You can follow up with a glass cleaner or a fresh vinegar and water solution to clean up any streaking and make your microwave look beautiful."
    },
    {
      "title": "Mix a solution of water and lemon essential oil in a small spray bottle.",
      "content": "Mix a solution of water and lemon essential oil in a small spray bottle. Add 2 fluid ounces (59 ml) of water and 3 drops of lemon essential oil to a clean small spray bottle and shake it to mix it all together. [6] X Research source You can add 2 or 3 more drops of lemon essential oil if you want a strong lemony scent."
    },
    {
      "title": "Remove any debris from the microwave before you steam it.",
      "content": "Remove any debris from the microwave before you steam it. Get a paper towel wet with water and then wring it out. Wipe out the inside of the microwave with the paper towel to remove any cooked on food and other debris."
    },
    {
      "title": "Spray the inside of the microwave liberally with the solution.",
      "content": "Spray the inside of the microwave liberally with the solution. Be sure that you soak the entire interior of the microwave with the lemon water solution. Get in the corners and don’t forget the top where a lot of food splatter hides from view. [7] X Research source If you run out of solution, just quickly whip up another batch and keep spraying."
    },
    {
      "title": "Place a wet sponge inside and microwave for 2 minutes.",
      "content": "Place a wet sponge inside and microwave for 2 minutes. Soak a sponge with clean water and place it in the center of the oven. Close the door and microwave on high for 2 minutes, allowing for the microwave to heat up and for the sponge to release steam. Make sure the sponge is very wet before you microwave it. The water from the sponge is what’s going to produce the steam that will loosen all the bits of food and grease from the walls of the microwave."
    },
    {
      "title": "Cool the sponge for at least 5 minutes until you can handle it.",
      "content": "Cool the sponge for at least 5 minutes until you can handle it. The sponge will be very hot from microwaving it and still have scalding water inside of it, so wait at least 5 minutes before you try to pick it up. Don't let it cool to room temperature or the inside of the microwave will dry and the food and grease will harden again."
    },
    {
      "title": "Use the cooled sponge to wipe down the microwave.",
      "content": "Use the cooled sponge to wipe down the microwave. Wipe down the walls, bottom, and top of the microwave. The lemon solution and steam should have loosened everything and it will wipe clean without scrubbing. [8] X Research source If there are still stuck-on bits of food or grease, repeat the process one more time from the beginning and it should wipe clean easily."
    },
    {
      "title": "Wipe out the microwave with a damp paper towel.",
      "content": "Wipe out the microwave with a damp paper towel. Wet a paper towel with plain water and wring it out. Then, use the damp paper towel to wipe any cooked on food and other debris out of the microwave before you steam it."
    },
    {
      "title": "Cut a lemon in half and place it open-side down on a plate or bowl.",
      "content": "Cut a lemon in half and place it open-side down on a plate or bowl. You can use lemons that are a little past their prime and starting to shrivel and any microwave safe plate. Cut the lemon across the wide part in the middle and place it cut-side down onto the plate. If you don’t have a lemon, you can substitute a lime in its place. [9] X Research source"
    },
    {
      "title": "Add 1 tablespoon (15 ml) of water and microwave on high for 2 minutes.",
      "content": "Add 1 tablespoon (15 ml) of water and microwave on high for 2 minutes. Microwaving the lemon in water will create a lemony steam that will loosen dried on food particles and oils. You can add more or less water depending on the size of your microwave and your dish, but 1 tablespoon (15 ml) should be enough to create the lemony steam you need to clean the microwave."
    },
    {
      "title": "Remove the plate and set aside on a trivet or oven mat to cool.",
      "content": "Remove the plate and set aside on a trivet or oven mat to cool. The plate, lemons, and water will be very hot, so be sure to use heat-resistant oven mitts or hot pads when handling it. [10] X Research source When moving the plate, do so slowly to avoid any spills that could result in injury."
    },
    {
      "title": "Wipe down the microwave while it is still hot and full of moisture.",
      "content": "Wipe down the microwave while it is still hot and full of moisture. As soon as you remove the plate with the lemons from the microwave, wipe down the walls, top, and bottom with wet paper towels or a wet sponge. You can chop up the lemon into small bits and run it through your garbage disposal with hot water. [11] X Research source This will clean the garbage disposal blades and make the kitchen smell great. [12] X Research source"
    }
  ]
}