{
  "url": "https://www.wikihow.com/Start-a-Boiler",
  "title": "How to Start a Boiler",
  "steps": [
    {
      "title": "Familiarize yourself with the boiler operating instructions.",
      "content": "Familiarize yourself with the boiler operating instructions. Depending on the make and model of your boiler, its startup procedure may vary. Many boilers list general startup instructions on a label attached to the front jacket panel. Always follow boiler directions for safe startup and usage. [1] X Research source Improper boiler startup or operation could result in damage to the boiler, exposure to hazardous materials, fires, or an explosion. If your boiler does not have startup instructions attached, check its user manual or look up a digital manual online with a keyword search for the boiler’s make and model. Because there are many different boiler designs, a manual diagram of your boiler will make locating parts on it easier."
    },
    {
      "title": "Check for gas and water leaks.",
      "content": "Check for gas and water leaks. Smell the area around the boiler for gas. Some gas may be heavier than air, so check close to the floor for the smell of gas as well. There should be no water leaks or standing water around the boiler. Water can cause the electrical components of your boiler to malfunction dangerously. If you smell gas, do not turn on any appliances, light switches, or phones. All people in the building should exit it. Call your gas supplier from outside or a neighbor’s phone to receive further instructions. If any part of the boiler has been submerged in water, do not activate it. In this situation, call a boiler specialist to inspect it and replace ruined parts. If there's a water leak, turn off power to the boiler and repair the leak immediately. Dry the area, then return power to the boiler."
    },
    {
      "title": "Open the relief valve and fill the water tank.",
      "content": "Open the relief valve and fill the water tank. The relief valve is generally found coming off the top side of the boiler cylinder. While the boiler is off and cold, open the valve to release air in the top of the tank. Fill the tank with soft water to the indicated level. Close the relief valve. Some boilers may require the addition of certain chemicals, like ones that prevent rust, to the water. These and their use should be listed on the label attached to the boiler or in the user manual. [2] X Research source"
    },
    {
      "title": "Check the thermostat(s) and valves, then set the thermostat(s) to low.",
      "content": "Check the thermostat(s) and valves, then set the thermostat(s) to low. Turn the control switch on the boiler to the “On” position. This will activate the control valves for the steam or boiler water and the thermostat(s). Verify that these are working properly. Set the thermostat(s) to the lowest temperature possible. Some boilers may have more than one thermostat, like those that have both an operating thermostat and an upper operating thermostat. Boilers with multiple thermostats may have specific startup settings for each one. Check the instructions attached to the boiler or its user manual to verify the startup settings."
    },
    {
      "title": "Turn off power to the boiler and remove the front jacket panel.",
      "content": "Turn off power to the boiler and remove the front jacket panel. Shut off the boiler’s power. Use a screwdriver to remove the front jacket panel. Set the panel aside and store the screws somewhere they won’t be lost, like in a plastic baggie."
    },
    {
      "title": "Turn off the gas to the boiler.",
      "content": "Turn off the gas to the boiler. Behind the jacket panel you should find a gas control knob or switch. Turn knobs clockwise or flick switches to the “Off” position to turn off the gas. Wait at least five minutes, then smell the area for gas. Should you smell gas, don’t turn on anything (including phones or light switches), evacuate the building, and call the gas company for instructions. Some boilers may require the manual main steam or boiler water supply valve to be opened while switched off and cold. Generally, heat supply should be introduced gradually. Open valves slowly."
    },
    {
      "title": "Restore gas to the boiler then turn it on.",
      "content": "Restore gas to the boiler then turn it on. Turn gas knobs counterclockwise or flip switches to the “On” position. Return power to the boiler. Note the current temperature of your thermostat(s). Generally, boilers shouldn’t be heated more than 100°F (37.8°C) per hour. [3] X Research source Many in-home boilers have auto igniters and should not be lit by hand. If your boiler doesn’t have this feature, follow the lighting instructions in your boiler’s user manual. Unless your boiler has a clearly indicated manual lighting procedure, you should not attempt to manually light your boiler. Even with an auto igniter, you'll still need to remove the front jacket panel to control the gas supply and adjust certain settings."
    },
    {
      "title": "Increase the boiler temperature gradually.",
      "content": "Increase the boiler temperature gradually. If your target temperature is less than 100°F (37.8°C), set your thermostat(s) to that temperature. If not, increase your boiler temperature by increments less than 100°F every hour until you reach your target temperature. Boilers with multiple thermostats may have ideal ranges for each thermostat. This information should be indicated on the attached label directions or in the user manual. Boilers should not pulse or make a hammering noise. These can cause damaging strain and vibrations in the boiler. In these instances, turn off power to the boiler, shut off its gas, and consult a professional."
    },
    {
      "title": "Reattach the jacket panel.",
      "content": "Reattach the jacket panel. Fit the jacket panel back into place on the boiler. Replace the screws with your screwdriver. Check the gauge readings against the specifications listed on the nameplate of the boiler. Gauges should never exceed nameplate ranges. If your boiler fails to start, reset the thermostat to the lowest temperature, turn off power to the boiler, and turn off the gas. At this point, you’ll need to troubleshoot or call a professional."
    },
    {
      "title": "Check the boiler’s connections and fuses.",
      "content": "Check the boiler’s connections and fuses. The electrical components of boilers can be fragile. You may have jostled a connection. Make sure all connections are well fastened. Starting your boiler can also blow fuses, so check these as well. [4] X Research source"
    },
    {
      "title": "Verify the high limit for temperature or pressure.",
      "content": "Verify the high limit for temperature or pressure. Some boilers may have an adjustable limit for temperature or pressure. These limits are sometimes set lower than the boilers ideal operating temperatures. Check limit settings on the boiler control box or behind the jacket panel."
    },
    {
      "title": "Investigate the gas supply.",
      "content": "Investigate the gas supply. If neither connections, fuses, nor limits are stopping your boiler for starting, you may have problem with your gas supply. Check that the gas is turned on at your meter. Verify with your gas company that you have service. Once gas is restored, prep your boiler for startup. [5] X Research source"
    },
    {
      "title": "Call a boiler repair or maintenance professional if problems persist.",
      "content": "Call a boiler repair or maintenance professional if problems persist. If after troubleshooting your boiler still will not start, call a boiler professional. You should also seek a professional’s opinion if you notice irregularities with your boiler. The consequences of a malfunctioning boiler can be severe."
    }
  ]
}