{
  "url": "https://www.wikihow.com/Stop-Getting-Vertigo",
  "title": "How to Stop Getting Vertigo: Treatment Options & Mythbusting",
  "steps": [
    {
      "title": "Receive a diagnosis.",
      "content": "Receive a diagnosis. Visit your doctor to determine what is causing your vertigo. Vertigo is often related to two inner ear disorders known as benign paroxysmal positional vertigo (BPPV) and Méniére's disease, but it could be a number of other conditions. Don't try to treat yourself for BPPV or Méniére's disease unless you've received a diagnosis and are certain that's what you have. Treatments for these disorders won't work to mitigate vertigo caused by other underlying issues. Here are a few other conditions that may lead to vertigo: [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Other inner ear disorders such as vestibular neuritis or labyrinthitis Head injuries and ear injuries Migraine headaches Decreased blood flow in the arteries that supply blood to the vein Brain tumors Stroke Complications from drinking alcohol or taking medications"
    },
    {
      "title": "Have the doctor identify which ear is causing your trouble.",
      "content": "Have the doctor identify which ear is causing your trouble. You'll need to figure out which ear is causing the problem, since the treatment you get may be different depending on which side is affecting you. Pay attention to when you get dizzy. If you get dizzy when you roll to the right in bed, then it's probably your right ear that's affecting you. [2] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source If you can't figure out which ear is causing the problem, ask your doctor."
    },
    {
      "title": "Try the Epley maneuver",
      "content": "Try the Epley maneuver if you have BPPV. The Epley maneuver is a series of head movements that return the crystals that have come loose in your inner ear to the right place. [3] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source The Epley maneuver can be easily performed by a physician without any special equipment. The Epley maneuver is an effective treatment for BPPV when it is performed properly. Once your doctor shows you how to do the Epley maneuver, you can do it on your own at home next time you get vertigo. You may watch videos online to learn the different head adjustments to make. Stabilize your neck for the 48 hours after doing the Epley maneuver. Don't do the Epley maneuver if you aren't sure you have BPPV. If you have an underlying problem, you need to make sure you get the proper treatment. [4] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source"
    },
    {
      "title": "Regulate body fluids to treat Méniére's disease.",
      "content": "Regulate body fluids to treat Méniére's disease. You can relieve symptoms and decrease the frequency of episodes of vertigo caused by this inner ear disorder by controlling your body's fluid retention. [5] X Research source Try the following methods for doing so: [6] X Research source Limit salt consumption and foods with MSG. Consider taking diuretic medication that reduces fluid retention. Look into taking betahistine hydrochloride. This drug is said to reduce the frequency and severity of vertigo attacks by raising blood flow around the inner ear. [7] X Research source It is primarily used in the treatment of Méniére's disease. Ask your doctor for more information about this treatment."
    },
    {
      "title": "Look into surgery.",
      "content": "Look into surgery. If nonsurgical treatments are ineffective, there are surgical procedures that can cure vertigo caused by certain inner ear disorders. [8] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If your vertigo is caused by one of the following disorders, it can be cured with surgery: BPPV Ménière's disease Vestibular neuronitis Chronic labyrinthitis"
    },
    {
      "title": "Sleep with your head propped up.",
      "content": "Sleep with your head propped up. The most common type of vertigo, BPPV, happens when tiny calcium carbonate crystals in one part of your inner ear float to another part of your inner ear, disrupting your equilibrium and triggering the uncomfortable dizzy sensation of vertigo. The crystals can get dislodged during the night when you move your head in certain ways, and sleeping with your head slightly elevated will prevent this from happening as often. [9] X Research source [10] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Sleep on your back instead of your side or stomach, and prop your head up with an extra pillow while you're sleeping."
    },
    {
      "title": "Don't lower your head beneath your shoulders.",
      "content": "Don't lower your head beneath your shoulders. If you have BPPV, motions like this can dislodge the crystals in your inner ear and lead to vertigo. [11] X Research source It can help to become more aware of your body movements and take measures to avoid bending over. If you need to pick something up, bend your knees to lower yourself down instead of bending at the waist. Don't do exercises that require being upside down or bending forward."
    },
    {
      "title": "Don't extend your neck.",
      "content": "Don't extend your neck. The movement you use when you extend your neck, as when you're reaching for something, can cause the crystals to get dislodged, too. Try not to stretch your neck upward. When you do stretch your neck, move your head slowly; don't let your head bob around. [12] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Avoid sudden movements.",
      "content": "Avoid sudden movements. Any jerky movements you make that cause your head to move about can lead to vertigo, especially when you're particularly prone to getting it. Avoid activities that put you in a situation in which your head might move around quickly. [13] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Don't ride roller coasters or other rides that cause your head to whip back and forth. Avoid sports that put you at risk of sudden head movements. Stick to swimming, walking and jogging instead of high-impact sports."
    },
    {
      "title": "Consume more ginger.",
      "content": "Consume more ginger. This cure-all superfood treats numerous ailments, including some instances of vertigo. [14] X Research source Take ginger capsule supplements on a daily basis, or eat some of the food by itself. Ginger is a common successful treatment for many vertigo-sufferers."
    },
    {
      "title": "Stop smoking",
      "content": "Stop smoking . Smoking tobacco has been shown to decrease the efficacy of treatments for vertigo. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Cut back on smoking and using other tobacco products so you'll have fewer episodes of vertigo as well as less severe symptoms."
    },
    {
      "title": "Get your eyes checked.",
      "content": "Get your eyes checked. Dizziness spells can be much worse with poor eyesight. [16] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Make sure your eyes are in the clear with regular checkups at your optometrist. Make sure that you have working glasses or contacts in an accurate prescription as well."
    },
    {
      "title": "Monitor your diet.",
      "content": "Monitor your diet. Too much salt can aggravate some types of vertigo, endolymphatic hydrops or migraine-associated vertigo. [17] X Trustworthy Source American Psychological Association Leading scientific and professional organization of licensed psychologists Go to source Limit your alcohol consumption and avoid smoking. Incorporate more fruits and vegetables, and try to cut the amount of sodium you have. Drink lots of water and be sure to include food rich in vitamins and minerals in your diet. Caffeine probably does not have an effect on tinnitus (ear-ringing sometimes associated with vertigo). It's usually best to stick to your current caffeine intake instead of making a dramatic change. Monitor your blood pressure if you have heart issues since it may lead to vertigo."
    },
    {
      "title": "Develop an exercise program.",
      "content": "Develop an exercise program. Many sufferers of vertigo symptoms have found that exercise is helpful in treating vertigo. [18] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Start slowly, and begin by moving your head slowly from side to side while standing. Easy stretches and walking also often help alleviate the symptoms of vertigo. You can also ask a healthcare professional for more specific exercises based on your specific type of vertigo. Using the wrong type of exercise can backfire, so it's best not to try them without a diagnosis. [19] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source"
    },
    {
      "title": "Don't expect magnets to cure vertigo.",
      "content": "Don't expect magnets to cure vertigo. Home remedies involving magnets are based on fads, not science. That may change in future, as early research has found that patients with vertigo react differently to the strong magnets in an MRI machine. [20] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source This has not been developed into a treatment, or even a solid idea for one."
    },
    {
      "title": "Don't use swimmer's ear medication to treat vertigo.",
      "content": "Don't use swimmer's ear medication to treat vertigo. Swimmer's ear is a type of infection, usually treated with an antibiotic. Only take swimmer's ear medication if you have multiple symptoms of swimmer's ear, not just vertigo. [21] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    }
  ]
}