{
  "url": "https://www.wikihow.com/Solve-Fraction-Questions-in-Math",
  "title": "How to Solve Fraction Questions in Math",
  "steps": [
    {
      "title": "Add fractions with the same denominator by combining the numerators.",
      "content": "Add fractions with the same denominator by combining the numerators. To add fractions, they must have the same denominator. If they do, simply add the numerators together. [2] X Research source For instance, to solve 5/9 + 1/9, just add 5 + 1, which equals 6. The answer, then, is 6/9 which can be reduced to 2/3."
    },
    {
      "title": "Subtract fractions with the same denominator by subtracting the numerators.",
      "content": "Subtract fractions with the same denominator by subtracting the numerators. If you need to subtract fractions, they must have the same denominator, just like if you were adding them. All you have to do is subtract the smaller numerator from the larger numerator to solve the problem. [3] X Research source For instance, to solve 6/8 - 2/8, all you do is take away 2 from 6. The answer is 4/8, which can be reduced to 1/2."
    },
    {
      "title": "Find a common multiple",
      "content": "Find a common multiple to add or subtract fractions without the same denominator. If the fractions don't have the same denominator, you'll need to find a common multiple of both denominators and convert each fraction so they have the same denominator. To do this, multiply both the numerator and denominator by the number that will convert it to the common multiple. Then, add or subtract the numerators to find the answer. [4] X Research source For example, if you need to add 1/2 and 2/3, start by determining a common multiple. In this case, the common multiple is 6 since both 2 and 3 can be converted to 6. To turn 1/2 into a fraction with a denominator of 6, multiply both the numerator and denominator by 3: 1 x 3 = 3 and 2 x 3 = 6, so the new fraction is 3/6. To turn 2/3 into a fraction with a denominator of 6, multiply both the numerator and denominator by 2: 2 x 2 = 4 and 3 x 2 = 6, so the new fraction is 4/6. Now, you can add the numerators: 3/6 + 4/6 = 7/6. Since this is an improper fraction, you can convert it to the mixed number 1 1/6. On the other hand, say you're working on the problem 7/10 - 1/5. The common multiple in this case is 10, since 1/5 can be converted into a fraction with a denominator of 10 by multiplying it by 2: 1 x 2 = 2 and 5 x 2 = 10, so the new fraction is 2/10. You don't need to convert the other fraction at all. Just subtract 2 from 7, which is 5. The answer is 5/10, which can also be reduced to 1/2."
    },
    {
      "title": "Multiply fractions straight across.",
      "content": "Multiply fractions straight across. Fortunately, multiplying fractions is pretty easy. If the fractions aren't already in the lowest terms, reduce them. Then, all you need to do is multiply the numerator by the numerator and the denominator by the denominator. [5] X Research source For instance, to multiply 2/3 and 7/8, find the new numerator by multiplying 2 by 7, which is 14. Then, multiply 3 by 8, which is 24. Therefore, the answer is 14/24, which can be reduced to 7/12 by dividing both the numerator and denominator by 2."
    },
    {
      "title": "Divide fractions by flipping the second fraction upside down and multiplying straight across.",
      "content": "Divide fractions by flipping the second fraction upside down and multiplying straight across. To divide fractions, start by making the fraction you want to divide by a reciprocal. Do this by turning it upside down so the numerator becomes the denominator and the denominator becomes the numerator. Then, multiply both numerators and both denominators together. [6] X Research source For example, to solve 1/2 รท 1/6, flip 1/6 upside down so it becomes 6/1. Then just multiply 1 x 6 to find the numerator (which is 6) and 2 x 1 to find the denominator (which is 2). So, the answer is 6/2 which is equal to 3."
    },
    {
      "title": "Note that the numerator is on the top and the denominator is on the bottom.",
      "content": "Note that the numerator is on the top and the denominator is on the bottom. Fractions refer to parts of a whole, and the top number in a fraction is called the numerator. This tells you how many parts of the whole you're working with. The bottom number in a fraction is referred to as the denominator and tells you how many parts make up a whole. [7] X Research source For instance, in 3/5, 3 is the numerator so there are 3 parts and 5 is the denominator so there are 5 total parts. In 7/8, 7 is the numerator and 8 is the denominator."
    },
    {
      "title": "Turn a whole number into a fraction by putting it over 1.",
      "content": "Turn a whole number into a fraction by putting it over 1. If you have a whole number and need to convert it to a fraction, you can use the whole number as the numerator. Always use 1 as the denominator since every undivided whole has a single part. [8] X Research source If you need to turn 7 into a fraction, for instance, write it as 7/1."
    },
    {
      "title": "Reduce fractions if you need to simplify them.",
      "content": "Reduce fractions if you need to simplify them. Start by finding the greatest common factor (GCF) of the numerator and denominator. The GCF is the largest number that both the numerator and denominator can be divided by. Then, just divide both the numerator and the denominator by the greatest common factor to reduce the fraction. [9] X Research source For example, if you have the fraction 15/45, the greatest common factor is 15, since both 15 and 45 can be divided by 15. Divide 15 by 15, which is 1, so that's your new numerator. Divide 45 by 15, which is 3, so that's your new denominator. This means that 15/45 can be reduced to 1/3."
    },
    {
      "title": "Learn to turn mixed numbers into improper fractions.",
      "content": "Learn to turn mixed numbers into improper fractions . A mixed number has both a whole number and a fraction. To solve certain fraction questions more easily, you might need to turn the mixed number into an improper fraction (meaning the number on top is larger than the number on the bottom). You can do this by multiplying the whole number by the denominator and adding this number to the numerator. Put the new numerator over the denominator. [10] X Research source Say you have the mixed number 1 2/3. Stary by multiplying 3 by 1, which is 3. Add 3 to 2, the existing numerator. The new numerator is 5, so the mixed fraction is 5/3."
    },
    {
      "title": "Figure out how to convert improper fractions into mixed numbers.",
      "content": "Figure out how to convert improper fractions into mixed numbers . Sometimes, you might have the opposite problem and need to make an improper fraction a mixed number. Start by figuring out how many times the numerator can go into the denominator using division. This becomes your whole number. Find the remainder by multplying the whole number by the divisor (the number you're dividing by) and subtracting the result from the dividend (the number you're dividing up). Put the remainder over the original denominator. [11] X Research source Say that you have the improper fraction 17/4. Set up the problem as 17 รท 4. The number 4 goes into 17 a total of 4 times, so the whole number is 4. Then, multiply 4 by 4, which is equal to 16. Subtract 16 from 17, which is equal to 1, so that's the remainder. This means that 17/4 is the same as 4 1/4."
    }
  ]
}