{
  "url": "https://www.wikihow.com/Why-Is-My-Toilet-Bubbling-when-the-Shower-Is-Running",
  "title": "What Causes a Gargling Toilet during a Shower & How to Fix It",
  "steps": [
    {
      "title": "Blocked drain pipe",
      "content": "Blocked drain pipe This is the most common reason you’d be hearing bubbling coming up every time you shower. Your toilet and shower drains are close to one another, so the pipes link up under the bathroom floor. But if something is stuck in the drain pipe, the water in the shower won’t have anywhere to go and it’ll push air up through your toilet’s drain. [1] X Research source"
    },
    {
      "title": "Clogged sewer main",
      "content": "Clogged sewer main If there’s a blockage in your home’s main sewer line where the drains all link up, it can do all kinds of funny things to your home’s plumbing. One of the main symptoms will undoubtedly be a gargling sound when you’re running the shower. [2] X Research source"
    },
    {
      "title": "Blocked vent stack",
      "content": "Blocked vent stack The vent stack introduces air into your plumbing system so that the water can drain freely. However, if there’s a dead bird or a bundle of leaves in the vent stack, it can make it difficult for the water to drain appropriately. This can lead to bubbling sounds when you shower. [3] X Research source If you can see your roof, look for a PVC pipe that’s just sticking up out of the air. That’s your vent stack."
    },
    {
      "title": "Poorly installed plumbing lines",
      "content": "Poorly installed plumbing lines If you’re in a newer building, this is a sign that the plumbing was installed incorrectly. It could be that there isn’t adequate pressure in the pipes, or that gravity isn’t working as intended because the pipes are installed at the wrong angle. [4] X Research source Hire a plumber or contact your home builder to get this problem diagnosed and resolved. This isn’t a DIY job."
    },
    {
      "title": "If you’re not having other issues, it’s likely the toilet pipe at fault.",
      "content": "If you’re not having other issues, it’s likely the toilet pipe at fault. The fact that your toilet is bubbling specifically and you’re noticing it is a good sign that your main problem is connected to the toilet drain. If there are no other symptoms elsewhere with your plumbing, the odds are very high that the problem is in (or very close) to your toilet. [5] X Research source It’s possible there’s a blockage in your shower drain pipe and it’s pushing air up through the nearby toilet. However, you’d probably notice the water draining a little slowly in the shower, first."
    },
    {
      "title": "If you are having other plumbing issues, it’s likely a vent stack blockage.",
      "content": "If you are having other plumbing issues, it’s likely a vent stack blockage. If the vent stack has a blockage, you’re going to notice problems elsewhere, since your entire plumbing system will rely on that vent stack. Run water in your other bathrooms, sinks, or hose connections to see if the water is working correctly. You may notice: [6] X Research source Gurgling sounds in other drains or toilets. Slow water draining. A strong sewage odor coming from drains when no water is running. Drains that clog repeatedly even when you clear the blockages."
    },
    {
      "title": "If your neighbors are also having issues, it’s probably the water main.",
      "content": "If your neighbors are also having issues, it’s probably the water main. If you’re friendly with any of your neighbors and you’ve got their phone number, ring them up to casually ask if they’re running into any weird plumbing issues. If they are, there’s probably something going on with your block’s sewage main. Call your city’s water management department to report the issue. It could be that the main sewage pipe is clogged up, there’s a problem with the city’s water service in general, or the sewage pipe is broken."
    },
    {
      "title": "Plunge your toilet as an attempt at a quick fix.",
      "content": "Plunge your toilet as an attempt at a quick fix. Cover your shower drain with tape or stuff a rag inside of the opening. Then, plunge your toilet like it’s clogged for 1-2 minutes. Then, try running your shower to see if the bubbling goes away. If it was just a minor block up, you may get lucky and fix it with a quick plunging. Covering the drain is important because you’ll artificially increase the pressure in both the toilet and shower. This gives the plunger the leverage it would normally need to push the blockage down."
    },
    {
      "title": "Cover your shower drain and snake the toilet with a drain auger.",
      "content": "Cover your shower drain and snake the toilet with a drain auger . Stick duct tape over the shower drain or stuff a rag inside the opening. Then, grab a drain auger and insert the end in your toilet bowl. Crank the handle on your auger to push the snake down the pipe. Continue until you reach resistance and find your blockage. Then, push the end of the auger a little further until the blockage frees up and retract your snake. [7] X Research source If the problem persists, try snaking your shower drain. The blockage might actually be in that pipe. If you don’t feel resistance anywhere and you fully extend the snake all the way, the problem is probably elsewhere."
    },
    {
      "title": "Hire a roofer to clear a blockage in your vent stack.",
      "content": "Hire a roofer to clear a blockage in your vent stack. The vent stack is the PVC pipe that just sticks up from your roof. Contact a local roofer (or a plumber with a roofing license, if you can find one) and explain that you think you’ve got blockage in your vent stack. They’ll get up on your roof and either snake the pipe or resolve the problem for you. [8] X Research source Animals get stuck and die in these pipes or leaves can fall in and buildup, so this isn’t a particularly rare problem. You can snake the vent stack yourself if you have roof access and a flat roof. But if you don’t, do not attempt this yourself. If you’re up on the flat roof, bring a flashlight and look in the vent pipe (it’ll be a 4–6 in (10–15 cm) wide PVC pipe). If you can reach inside to remove the blockage, do that. Otherwise, snake it with a drain auger like a normal drain."
    },
    {
      "title": "Contact your city if the water main is the primary issue.",
      "content": "Contact your city if the water main is the primary issue. You won’t be able to fix any issues with your city’s sewage line—they just don’t make commercial drain augers that reach that far, and you won’t be able to fix the problem most of the time anyway. Call your water department to report the problem. They’ll send a crew out to inspect your sewage line."
    }
  ]
}