{
  "url": "https://www.wikihow.com/Turn-Off-Web-Guard",
  "title": "How to Turn Off Web Guard",
  "steps": [
    {
      "title": "Open the T-Mobile app on your phone.",
      "content": "Open the T-Mobile app on your phone. If you don't have the T-Mobile app installed, you can download it from the Apple App Store or the Google Play Store."
    },
    {
      "title": "Log in with your T-Mobile account information.",
      "content": "Log in with your T-Mobile account information. If you haven't set up your T-Mobile account and password yet, tap the \"Sign Up\" button and follow the prompts. You'll need to be the account holder in order to change the Web Guard settings."
    },
    {
      "title": "Tap the Menu (☰) button in the upper-left corner.",
      "content": "Tap the Menu (☰) button in the upper-left corner. This will open the app menu."
    },
    {
      "title": "Select \"Profile Settings\" from the menu.",
      "content": "Select \"Profile Settings\" from the menu. Your account profile information will be displayed."
    },
    {
      "title": "Tap the \"Family Controls\" option.",
      "content": "Tap the \"Family Controls\" option. You'll have to scroll down to find it."
    },
    {
      "title": "Select \"No Restrictions\" and tap \"Save.\"",
      "content": "Select \"No Restrictions\" and tap \"Save.\" This will disable the Web Guard restrictions."
    },
    {
      "title": "Visit the T-Mobile website on your computer.",
      "content": "Visit the T-Mobile website on your computer. Visit account.t-mobile.com from your computer's web browser."
    },
    {
      "title": "Log in with your T-Mobile ID.",
      "content": "Log in with your T-Mobile ID. You'll need to enter your T-Mobile ID and password to continue. If you don't have one yet, click the \"Sign Up\" link to get one. You'll need to be the account holder in order to change the Web Guard settings."
    },
    {
      "title": "Click \"Profile\" in the upper-left corner.",
      "content": "Click \"Profile\" in the upper-left corner. This will open your profile settings."
    },
    {
      "title": "Select the \"Family Controls\" option.",
      "content": "Select the \"Family Controls\" option. You may have to scroll to find this."
    },
    {
      "title": "Select \"No Filtering\" in the Web Guard section.",
      "content": "Select \"No Filtering\" in the Web Guard section. When you click \"Save,\" Web Guard will be disabled. [1] X Research source"
    }
  ]
}