{
  "url": "https://www.wikihow.com/Use-Spermicides",
  "title": "How to Use Spermicides",
  "steps": [
    {
      "title": "Spermicides are put into the vagina before sex to prevent pregnancy.",
      "content": "Spermicides are put into the vagina before sex to prevent pregnancy. Spermicides come in many different forms, including foams, gels, creams, suppositories, and more. The ingredient in the spermicide, nonoxynol-9 (N-9), kills the sperm when it comes into contact with the spermicide. [1] X Trustworthy Source American College of Obstetricians and Gynecologists Professional association of OB/GYNs focused on education and public outreat initiatives Go to source"
    },
    {
      "title": "Spermicides are only about 70% effective at preventing pregnancy.",
      "content": "Spermicides are only about 70% effective at preventing pregnancy. Typically, people use spermicides alongside other methods of pregnancy prevention, like condoms. However, keep in mind that spermicides do not prevent STDs and STIs. [2] X Research source If you’re going to use another method of birth control along with spermicides, double check the directions on the spermicide to see if it’s latex-safe. If not, spermicide can weaken latex, causing birth control methods like condoms to fail."
    },
    {
      "title": "Insert the spermicide 10 to 15 minutes before having sex.",
      "content": "Insert the spermicide 10 to 15 minutes before having sex. Spermicides need a couple of minutes to start working. Plan ahead and use your spermicide at least 10 or 15 minutes before you start having vaginal sex. [3] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Stand with 1 leg up on a chair.",
      "content": "Stand with 1 leg up on a chair. To make application easier, either lie back with your knees bent, or stand with one foot up on a chair. This position will open up your vagina and relax your muscles. [4] X Research source"
    },
    {
      "title": "Insert the spermicide with an applicator or your finger.",
      "content": "Insert the spermicide with an applicator or your finger. In order to work, spermicide needs to go deep into your vagina. If your spermicide has an applicator, load it with spermicide and then insert it into your vagina, getting as close to the cervix as you can. If not, use your fingers to insert the spermicide into your vagina. [5] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Different spermicides may have different methods of application. Always read the instructions on your spermicide before you use it. For most spermicides, the applicator will have a dosage line that you fill to. However, you should always double check your specific spermicide for directions."
    },
    {
      "title": "Have sex within 60 minutes of using spermicide.",
      "content": "Have sex within 60 minutes of using spermicide. After 1 hour, spermicides become less effective. If you’re going to have sex, do it within 60 minutes of application. [6] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Reapply spermicide every time you have sex.",
      "content": "Reapply spermicide every time you have sex. Typically, spermicides are only effective for 1 round of sex. If you have sex again, even if it’s with the same partner, reapply your spermicide. [7] X Trustworthy Source American College of Obstetricians and Gynecologists Professional association of OB/GYNs focused on education and public outreat initiatives Go to source"
    },
    {
      "title": "Do not wash out or remove the spermicide after sex.",
      "content": "Do not wash out or remove the spermicide after sex. In order to let the spermicide work, don’t put anything else in your vagina for at least 6 hours. Don’t wash out your vagina either, as that can make the spermicide less effective. [8] X Trustworthy Source American College of Obstetricians and Gynecologists Professional association of OB/GYNs focused on education and public outreat initiatives Go to source"
    },
    {
      "title": "Spermicide gel, cream, or jelly",
      "content": "Spermicide gel, cream, or jelly Gel , cream, and jelly spermicides usually come with an included applicator inside. To apply them, simply fill the applicator up to the fill line, then insert it into your vagina. Gently press the plunger to release the spermicide inside of yourself. [9] X Research source Many people prefer these spermicides because they also act like a lubricant."
    },
    {
      "title": "Spermicide foam",
      "content": "Spermicide foam Spermicide foams are similar to creams and jellies in that they usually come with an applicator. To use a spermicide foam, shake the can 20 to 30 times, then fill up the applicator. Insert the applicator deep into your vagina, then press the plunger to insert it into yourself. [10] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Spermicide suppositories",
      "content": "Spermicide suppositories Suppositories are small spermicide pills that are inserted into the vagina. To use one, hold the suppository near your vagina and use a clean finger to push it up inside yourself as far as it will go. [11] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source After about 15 minutes, the suppository will melt into a spermicidal cream."
    },
    {
      "title": "Spermicide film",
      "content": "Spermicide film Spermicidal film is similar to a suppository, but it comes as a small, square film instead of a pill. To apply it, get into a comfortable position and fold the film over 1 finger. Insert the film deep into your vagina, then wait 15 minutes before having sex. [12] X Research source Spermicidal films will melt into a spermicidal gel."
    },
    {
      "title": "Spermicide sponge",
      "content": "Spermicide sponge Spermicidal sponges are small, white plastic sponges coated in spermicide. You can insert the sponge into your vagina up to 24 hours before having sex. To use it, insert the sponge into your vagina as deep as you can using 1 finger. Leave the sponge inside your vagina for 6 to 8 hours after having sex. [13] X Research source After 6 to 8 hours, remove the sponge and throw it away."
    },
    {
      "title": "Spermicide cap",
      "content": "Spermicide cap Spermicidal caps sit inside your vagina and prevent sperm from entering through the cervix. To use a cap, squeeze spermicide gel or cream into the cap, then fold the cap and insert it into your vagina as deep as you can. Leave it inside yourself for at least 6 hours after having sex. [14] X Research source You can leave the cap inside of you for up to 48 hours. After that, remove the cap with your fingers."
    },
    {
      "title": "Spermicide condoms",
      "content": "Spermicide condoms Spermicide condoms are just like regular condoms, but they’re coated in a spermicidal gel. You can use spermicidal condoms just like you’d use regular condoms without any added steps. [15] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Some people may experience irritation after using spermicides.",
      "content": "Some people may experience irritation after using spermicides. While it’s not very common, some people are sensitive to the chemicals inside of spermicide. You or your partner may feel irritation, itching, or burning on your vagina or penis. If a spermicide causes redness or irritation, stop using it and switch to a different method of birth control. [16] X Trustworthy Source American College of Obstetricians and Gynecologists Professional association of OB/GYNs focused on education and public outreat initiatives Go to source"
    }
  ]
}