{
  "url": "https://www.wikihow.com/Treat-Gastroparesis-Naturally",
  "title": "How to Treat Gastroparesis with Natural Remedies",
  "steps": [
    {
      "title": "Talk to your doctor or dietitian before you make changes to your diet.",
      "content": "Talk to your doctor or dietitian before you make changes to your diet. Making sudden changes to your diet will affect your gastroparesis, so visit with your doctor or see a dietitian to discuss your options. They’ll be able to help you come up with a diet that works for you and helps to ease the symptoms of your gastroparesis. [1] X Research source Your doctor or dietitian can help you find new foods that will improve your symptoms."
    },
    {
      "title": "Eat foods that have a low fat content to speed up digestion.",
      "content": "Eat foods that have a low fat content to speed up digestion. Because fat takes longer to digest, eating foods that have a high fat content will make your gastroparesis symptoms much worse. When you’re putting together your diet, choose low-fat foods to help improve your health and decrease your symptoms overall. [2] X Research source Examples of low-fat food options include cottage cheese, Greek yogurt, egg whites, lean meats such as chicken or turkey breast, and fresh fruit. Avoid foods that are high in fat like red meat and cheese."
    },
    {
      "title": "Limit foods with lots of fiber to improve your symptoms.",
      "content": "Limit foods with lots of fiber to improve your symptoms. Insoluble fiber is found in many foods and because it is more difficult for your body to digest, eating insoluble fiber will make your gastroparesis symptoms worse. Limit the amount of foods with insoluble fiber that you eat to a 1 serving a day, or avoid them entirely if you can. [3] X Research source Insoluble fiber is found in whole wheat or bran products, green beans, potatoes, cauliflower, and nuts. Examples of foods that don’t have insoluble fiber include tofu, meat, dairy, white bread, and white rice. Because a low-fiber diet can cause constipation, and because fiber is an important part of a healthy diet, talk to your doctor before you cut out all foods with fiber in them."
    },
    {
      "title": "Choose foods that are softer and easier to digest.",
      "content": "Choose foods that are softer and easier to digest. Select foods that are easy to chew and swallow and have a simpler structure so they’re easier for your stomach to break them down. Because gastroparesis affects your stomach’s ability to digest food, choosing foods that are easier to break down will make your symptoms less severe. A few examples of easy-to-digest foods include: [4] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source White bread Soup Watermelon Peaches Pears Fruit juices Potatoes Apples without skin Mushrooms Lettuce Yogurt"
    },
    {
      "title": "Blend or puree your foods so they’re easier to digest.",
      "content": "Blend or puree your foods so they’re easier to digest. Blending your food turns it into almost a liquid, which means it will move through your stomach and digestive system faster, minimizing your gastroparesis symptoms. Use a blender to make tasty smoothies with fresh fruits and vegetables or blend your foods before you eat them. [5] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source You can also purchase pureed fruit and vegetables for an option that’s easier to digest."
    },
    {
      "title": "Get your nutrition from liquid sources as much as you can.",
      "content": "Get your nutrition from liquid sources as much as you can. Liquids such as protein shakes, juice, and soup are rich in nutrients as well as vitamins and minerals and are much easier to digest than solid food. Minimize your gastroparesis symptoms by including more liquids that are dense in nutrients. [6] X Research source Be mindful of the fat content of nutrient-dense liquids so you don’t make your symptoms worse. Drink clear soups, broths, or sports drinks for their nutrients as well as their electrolytes."
    },
    {
      "title": "Drink 1 cup (240 mL) of ginger tea a day to help with digestion.",
      "content": "Drink 1 cup (240 mL) of ginger tea a day to help with digestion. Ginger contains gingerol and shogaol, both of which aid in digestion and will ease your gastroparesis symptoms. Make a tasty ginger tea by bringing 1.5 cups (350 mL) of water to a boil, adding about 2 tablespoons (10 grams) of fresh ginger root, and letting it steep for about 10 minutes. [7] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source Allow the tea to cool down a little before you drink it. If you don’t have fresh ginger, use dried."
    },
    {
      "title": "Avoid coffee, alcohol, and carbonated beverages.",
      "content": "Avoid coffee, alcohol, and carbonated beverages. Coffee and alcohol will make your gastroparesis symptoms much worse. Carbonated beverages such as soda contain lots of air, which affects digestion and will exacerbate your gastroparesis symptoms. Avoid drinking them entirely to help reduce your symptoms. [8] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Chew your food thoroughly before you swallow to make it easier to digest.",
      "content": "Chew your food thoroughly before you swallow to make it easier to digest. Chew your food until it’s almost liquid and there aren’t any lumps in it. For softer foods such as berries of cooked vegetables, break them up by chewing them 5-10 times. For tougher foods such as meat, start breaking them down by chewing each bite up to 30 times so it’s easier on your digestive system, which will reduce the symptoms of your gastroparesis. [9] X Trustworthy Source National Institute of Diabetes and Digestive and Kidney Diseases Health information from the National Institute of Diabetes and Digestive and Kidney Diseases, a division of the U.S. National Institutes of Health Go to source Taking the time to count your chews can force you to chew your food enough."
    },
    {
      "title": "Eat 5-6 small meals to minimize stress on your digestive system.",
      "content": "Eat 5-6 small meals to minimize stress on your digestive system. Eating 2-3 large meals a day is taxing on your digestive system and will increase the severity of your gastroparesis symptoms. Eat multiple, smaller meals throughout the day so your stomach doesn’t have to produce as much stomach acid or work as hard to digest your food, which will help with your symptoms. [10] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source Focus on small, but nutritionally dense meals that don’t include lots of fat or fiber. For example, Greek yogurt with some fresh berries could be a great small meal."
    },
    {
      "title": "Go for a light walk after you eat to help digest your food.",
      "content": "Go for a light walk after you eat to help digest your food. Exercise boosts your metabolism and will also help move food through your stomach and digestive system, which will make your gastroparesis symptoms feel better. When you finish a meal, take a short 10-15 minute walk to help your body process it. [12] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source Don’t overexert yourself or do intense exercise after you eat or you could make your symptoms worse."
    },
    {
      "title": "Avoid lying down for 2 hours after you eat.",
      "content": "Avoid lying down for 2 hours after you eat. Lying down makes it more difficult for your stomach to process the food that you eat and will make your symptoms worse. After you finish a meal, give your body enough time to process it and empty your stomach before you lie down on the couch or in bed. [13] X Research source"
    },
    {
      "title": "Quit smoking or avoid secondhand smoke so you don’t irritate your stomach.",
      "content": "Quit smoking or avoid secondhand smoke so you don’t irritate your stomach. Smoking causes damage to your stomach lining and affects your digestion, both of which will exacerbate your gastroparesis symptoms. If you do smoke, quit as soon as you can to improve your symptoms. [14] X Research source If you’re around others who smoke, try to avoid breathing in the secondhand smoke. [15] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "See your doctor for a gastroparesis diagnosis.",
      "content": "See your doctor for a gastroparesis diagnosis. The symptoms of gastroparesis can mimic a variety of other conditions, so see your doctor to get confirmation of what’s causing your symptoms. They can also help identify and treat any underlying issues that might be contributing to your gastroparesis, such as diabetes or an infection. [16] X Research source Your doctor may conduct a variety of tests to determine if you have gastroparesis. One common test is the gastric emptying study, in which you consume food mixed with a small amount of radioactive tracer material, which can then be traced through your digestive tract. Your doctor may also perform an endoscopy, in which a tiny camera is passed into your stomach and small intestines through your throat to look for signs of gastroparesis or other conditions, such as peptic ulcers. Ultrasounds and stomach X-rays can also be useful tools for diagnosing gastroparesis."
    },
    {
      "title": "Consult your doctor if dietary changes aren’t working.",
      "content": "Consult your doctor if dietary changes aren’t working. If you’ve been treating gastroparesis with diet and lifestyle changes and your symptoms aren’t getting better, see your doctor. They can recommend additional or alternative treatments that may help. [17] X Trustworthy Source Cedars Sinai Hospital Website of one of the world's leading hospitals Go to source For example, if you have severe nausea and vomiting, they can prescribe anti-nausea medications, such as prochlorperazine (Compro) or diphenhydramine (Benadryl). Other medications, such as metoclopramide (Reglan) or erythromycin, can help stimulate the movement of your stomach muscles. Talk to your doctor about the potential risks and side effects of these medications. For extremely severe cases of gastroparesis that prevent you from eating or drinking altogether, your doctor may recommend implanting a feeding tube or using a gastric venting tube to help reduce pressure in your stomach."
    },
    {
      "title": "Create a treatment plan with your doctor if you have diabetes.",
      "content": "Create a treatment plan with your doctor if you have diabetes. Diabetes is a common cause of gastroparesis. Unfortunately, gastroparesis can often contribute to further complications with your diabetes, such as unpredictable changes in your blood sugar. [18] X Research source To prevent potentially serious problems, you’ll need to work closely with your doctor to manage both your diabetes and your gastroparesis. [19] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source Your doctor may recommend changing your insulin schedule in order to manage your blood glucose levels better. For example, they might recommend taking insulin more often or giving yourself injections after meals instead of before. You may also benefit from additional medications to help you manage your gastroparesis."
    },
    {
      "title": "Call your doctor right away if you have symptoms of a bezoar.",
      "content": "Call your doctor right away if you have symptoms of a bezoar. A bezoar, or a large mass of hardened, undigested food in your stomach, is a rare but potentially dangerous complication of gastroparesis. While most bezoars don’t cause any symptoms, sometimes they can block the passageway between your stomach and small intestine and cause serious digestive problems. See your doctor as soon as possible if you experience symptoms such as: [20] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Bloating Cramps Loss of appetite Nausea and vomiting Unexplained weight loss Symptoms of intestinal bleeding, such as bloody, red, or black stools [21] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    }
  ]
}