{
  "url": "https://www.wikihow.com/Use-a-Typewriter",
  "title": "How to Operate an Old-Time Typewriter",
  "steps": [
    {
      "title": "Insert the paper.",
      "content": "Insert the paper. The first thing you want to do with a typewriter is insert the paper. Take two 8x11 inch, standard size sheets, of white paper. Place one atop the other. [1] X Research source Look at the top of your typewriter. There should be a long cylinder running across the typewriter. This is the roller also known as the \"platen\". Just behind the roller is a small, flat angled piece of machinery that tilts back slightly. This is the paper table. You want to place the top of your sheet of paper between the roller and paper table. There should be a small knob on the side of the roller. This is the roller knob. Turn this knob counterclockwise. This should feed the paper into to the roller. You should keep turning the knob until the top of the paper is just behind the keys."
    },
    {
      "title": "Set the carriage.",
      "content": "Set the carriage. The carriage of a typewriter is a part of the typewriter that moves the roller across the page. Each time you hit a key, the carriage moves the roller slightly to the left. You want to start off with the carriage as far to the left as the typewriter will allow. Slide the roller over to the left. The carriage should stop the roller at the appropriate place to set the margins. [2] X Research source"
    },
    {
      "title": "Type.",
      "content": "Type. Now you can begin typing. Typing on a typewriter is somewhat tricky. Each key causes a stamp to strike against the paper. You want to type hard enough to make the letters stamp on in a clear fashion. You should also type somewhat slowly if you've never used a typewriter before. [3] X Research source"
    },
    {
      "title": "Return the carriage as you type.",
      "content": "Return the carriage as you type. Eventually, you will hear the typewriter make a dinging noise. This means you have reached the end of the line you're currently writing on. You need to return the carriage to begin a new line. [4] X Research source On one side of your typewriter, there will be a carriage return lever. This is a metallic lever. Carriage level either move downward or to the side. Press your carriage level in the correct direction for your typewriter. This should get the paper to transfer to the next line. From here, push the roller to the right until the carriage stops it. Then, resume typing."
    },
    {
      "title": "Correct any mistakes.",
      "content": "Correct any mistakes. You may make some typos when using a typewriter. Some typewriters feature backspace keys; this key often has an image of an arrow pointing to the left. Backspacing and typing over a mistake works, but this mars your text, and it is hard on the typewriter platen. The last reason is why you are using two sheets of paper. T [5] X Research source You can use whiteout to remove the unwanted letter or phrase. Then, feed the paper back into the roller until you reach the line where the typo occurred. Adjust the roller until the paper is positioned in such a way that you can type the correct letter or sentence over the whited-out portion of the page. Most electric typewriters have an autocorrect feature that functions somewhat like a backspace key. If your typewriter has an autocorrect feature, you can use this to fix typos. You can usually only correct single letter typos, however. If you notice you typed the wrong letter, hit the autocorrect key. The typewriter will move back a space and imprint a whited-out version of that letter over the black ink. You can then type the correct letter."
    },
    {
      "title": "Remove the paper.",
      "content": "Remove the paper. When you've finished a page, you can remove the paper. Turn the knob near the roller clockwise until the paper comes out of the typewriter. [6] X Research source"
    },
    {
      "title": "Transfer data to a computer, if necessary.",
      "content": "Transfer data to a computer, if necessary. If you want an electronic backup of the work you did on a typewriter, use a scanner to scan all the pages you typed. If you do not have a scanner, you can go to a local print shop and use one there for a small fee. You can then email the pages to yourself so you have a copy. [7] X Research source"
    },
    {
      "title": "Gather the right supplies.",
      "content": "Gather the right supplies. Typewriters need to be kept clean in order to be functional. Before you start the process of cleaning your typewriter, gather the following supplies: [8] X Research source Cotton rags Gentle liquid cleanser Hard-bristled paint brushes A vacuum with a crevice tool. Car wax Typewriter oil"
    },
    {
      "title": "Clean off the surface of your typewriter with a gentle cleanser.",
      "content": "Clean off the surface of your typewriter with a gentle cleanser. To start, clean the surface of the typewriter with a gentle cleanser. You do not want to use anything with too many chemicals, especially if your typewriter is older. Dilute the cleanser with water slightly before you begin the cleaning process. [9] X Research source Dab a rag in the cleanser. Scrub the exterior of the typewriter until you've removed all dust and debris. Go slowly and use a light amount of force on the typewriter. Typewriters are often old machines, and you do not want to accidentally scratch the surface or damage the paint during the cleaning process. From here, take your hard-bristled paint brushes. Dust your typewriter's keys, removing any loose paint or debris from the keys. Take the crevice tool of your vacuum and run it over the keyboards, gently inserting the tool between the spaces in the keys. This will suck up any debris or dust that fell inside the typewriter while you were dusting the keys."
    },
    {
      "title": "Lubricate the keys and moving parts.",
      "content": "Lubricate the keys and moving parts. Typewriter oil, which you can buy online or at some hardware stores, can be used to keep the typewriter running smoothly. Use a very small amount of oil. A small amount of lubrication goes a long way. Squeeze a moderate amount of oil onto the moving parts, as well as the interior parts of the keys. [10] X Research source Be very careful not to use too much. Less than a drop of oil should be sufficient."
    },
    {
      "title": "Polish the typewriter.",
      "content": "Polish the typewriter. If you want your typewriter to look shiny and new after you clean it, use some car wax to give it a nice gleam. Place some car polish on a rag and buff it into the exterior of the typewriter until it looks shiny and new. [11] X Research source As with cleaning your typewriter, be gentle. Harsh movements can cause you to damage the typewriter's exterior, so do not buff with a lot of force."
    },
    {
      "title": "Cover the typewriter when you're not using it.",
      "content": "Cover the typewriter when you're not using it. You want to make sure your typewriter is exposed to as little dust and debris as possible. Too much dust and outside material can affect a typewriter's functionality. When you're not using the typewriter, cover it. If your typewriter has a carrying case, place it inside when it's not in use. If you don't have a carrying case, you can keep your typewriter in a drawer or another small, enclosed space free of dirt and debris."
    },
    {
      "title": "Pull the paper release lever forward if you do not plan to use the typewriter for a while.",
      "content": "Pull the paper release lever forward if you do not plan to use the typewriter for a while. The paper release lever is the lever that you press on some typewriters to release the paper. Not all typewriters have a release lever, but if yours does, you should pull it forward when the typewriter is out of use. If you do not use your typewriter frequently, it's a good idea to leave the lever forward. If the lever is left closed for a long time, this can cause flat spots to appear on the roller. Flat spots can crinkle the paper and cause a messy appearance when you're typing.<"
    },
    {
      "title": "Store your typewriter at the right temperature.",
      "content": "Store your typewriter at the right temperature. Typewriters are susceptible to damage if they're not stored properly. Typewriters should be stored at temperatures around 40 to 75 degrees Fahrenheit. Keep your typewriter in an air-conditioned room during the hot months. If you do not have air conditioning, store your typewriter in the coolest room in your home, such as the basement. Cool temperature can also have a negative effect on a typewriter. Do not store your typewriter in a cold place, like your garage, during the winter. Make sure your typewriter stays inside where it is warm."
    }
  ]
}