{
  "url": "https://www.wikihow.com/Write-a-Story-About-a-Hero",
  "title": "How to Write a Story About a Hero",
  "steps": [
    {
      "title": "Identify your hero's goal or purpose.",
      "content": "Identify your hero's goal or purpose. Think about who your hero is and what they want. Identify their reason for being, what they value most, and what is missing from their life. Understanding and developing your hero's motivations will be the driving force for your entire story, so it's important to make this as detailed as possible. [1] X Expert Source Grant Faulkner, MA Professional Writer Expert Interview. 8 January 2019. For example, perhaps your hero has to find a special resource that will allow them to repair a machine that cleans all of the water for their village. Or, perhaps someone the hero loves has been kidnapped and they need to seek out and fight the villain who took this person from them."
    },
    {
      "title": "Develop traits that will make your hero likable.",
      "content": "Develop traits that will make your hero likable. A good hero is not only someone with extraordinary abilities, it is also someone people look up to and would love to have as a friend. Think about what makes your hero likable and how you can incorporate these traits into your story. [3] X Expert Source Grant Faulkner, MA Professional Writer Expert Interview. 8 January 2019. For example, your hero might be the son of a blacksmith who is skilled at sword fighting, but incredibly humble about their abilities and unwilling to enter competitions. Or, your hero might be a beautiful young princess who prefers blue jeans to ball gowns and who isn't above working alongside her own staff when there's a crisis."
    },
    {
      "title": "Give your hero flaws to make them more realistic.",
      "content": "Give your hero flaws to make them more realistic. A perfect hero will be less likable and also harder for readers to relate to. It's important to give your hero some flaws as well. Your hero needs to seem human even if they're an immortal, such as a god or goddess. Think about what your hero's weaknesses might be and how you could weave those into your story. [4] X Research source For example, your hero might be clumsy, gullible, hot-tempered, or impatient."
    },
    {
      "title": "Identify how your hero will grow from their experiences.",
      "content": "Identify how your hero will grow from their experiences. Demonstrating your hero's growth is an important part of writing a story about a hero. [5] X Research source Think about what changes your hero needs to make to overcome their biggest obstacle or to obtain the object of their quest. Knowing this ahead of time will help you to plan your story out and provide your hero with opportunities to develop the skills they need to be successful. [6] X Expert Source Grant Faulkner, MA Professional Writer Expert Interview. 8 January 2019. For example, perhaps your hero needs to gain self-confidence and overcome a fear of public speaking. To give them practice, they might have a couple of opportunities where they will have to get the attention of a small crowd or a room full of people. This could be leading up to a scene where they have to speak in front of thousands of people to achieve their objective."
    },
    {
      "title": "Introduce the ordinary world of your hero.",
      "content": "Introduce the ordinary world of your hero. Even if the world your hero lives in is far from ordinary to your readers, it is still the ordinary world for your hero. Describe the world that they live in and show them going about their normal day-to-day activities in that world. Explain their roles and responsibilities in the world and what a typical day looks like for your hero. [7] X Expert Source Grant Faulkner, MA Professional Writer Expert Interview. 8 January 2019. For example, the ordinary world in Toy Story is Andy's bedroom when the toys are alone and come to life. Woody serves as Andy's toy when Andy wants to play with him, and Woody also conducts toy meetings when Andy is not around. [8] X Research source"
    },
    {
      "title": "Include an initial conflict or call to adventure.",
      "content": "Include an initial conflict or call to adventure. This is the first problem that your hero will face. It might not be life-threatening, but it will be a problem for your hero nonetheless. Describe how that problem comes about and show how your hero responds to it. This is a good opportunity to show some of your hero's likable traits and their flaws. [9] X Expert Source Grant Faulkner, MA Professional Writer Expert Interview. 8 January 2019. The conflict or call to adventure in Toy Story is when Woody is replaced by Buzz Lightyear. Woody feels rejected and his visible hurt feelings add to his likeability, but he is also very jealous of all of the attention Buzz is getting. Woody's jealousy is one of his flaws. [10] X Research source"
    },
    {
      "title": "Show that the hero is hesitant to go on the adventure.",
      "content": "Show that the hero is hesitant to go on the adventure. After you describe what adventure or conflict your hero is faced with, show how they refuse or deny it. This may take the form of your hero directly refusing to go on an adventure, or it might be a different kind of denial, such as denying their feelings or denying the truth about something. Your hero might cite practical reasons for refusing the call, but often the hero refuses to go on an adventure out of fear. [11] X Research source In Toy Story , Woody refuses the call to adventure by denying that Buzz is Andy's new favorite toy. He also denies his own feelings and that he is jealous of Buzz. Woody's fear of no longer being the favorite is what drives him to deny what is actually happening. [12] X Research source"
    },
    {
      "title": "Provide a mentor or guide for your hero.",
      "content": "Provide a mentor or guide for your hero. When your hero finally starts to accept that they might need to go on the adventure, they will need someone to guide them. Usually, the hero's mentor will be someone with much more experience than they have. However, it might also be a peer who has a different skill set than they do and who they can learn from. [13] X Research source In Toy Story , Woody's mentor is Buzz. Even though Buzz is new to Woody's world, he has different abilities than Woody does. Woody learns new things from Buzz while they are in the outside world. Another good example of a hero's guide or mentor in a story is Obi-Wan Kenobi in Star Wars. He teaches Luke the ways of the Jedi so that Luke can go on his adventure. [14] X Research source"
    },
    {
      "title": "Describe the hero as passing the point of no return.",
      "content": "Describe the hero as passing the point of no return. This is also known as “crossing the threshold.” At this point in the story, the hero must go on the adventure to stop something terrible from happening or because they have no choice. Explain what happens to your hero or to someone in your hero's world that forces them to pursue their quest. [15] X Research source For example, in Toy Story , Woody is forced to go on his adventure after Buzz falls out the window. Buzz falling out the window and Woody encountering him in the car after that happens is when they are over the threshold. [16] X Research source"
    },
    {
      "title": "Make your hero encounter tests, allies, and enemies.",
      "content": "Make your hero encounter tests, allies, and enemies. Your hero needs to undergo tests to grow. Introducing your hero to new allies and enemies will provide them with assistance and resistance as they work towards their ultimate objective. Think about how you can integrate tests, allies, and enemies into your hero's journey to move the story forward and make it more interesting. [17] X Research source For example, in Toy Story , Woody and Buzz are tested when they have to work together to find Andy in the arcade. In the arcade, they also meet some new friends, such as the aliens in the claw machine. They also face off with an enemy: Sid, the kid next door who tortures toys. [18] X Research source"
    },
    {
      "title": "Show the hero approaching the special world or heart of the story.",
      "content": "Show the hero approaching the special world or heart of the story. As the story progresses, your hero will get closer and closer to their objective. Describe how your hero glimpses the objective and what still stands in their way. These obstacles might be external, such as an enemy or difficult task, or they might be internal, such as overcoming their pride and asking for help. For example, in Toy Story , Woody and Buzz end up in Sid's bedroom and Woody can see his home from where they are. However, the other toys are still leery of him and he cannot return home until he lets go of his jealousy and works with Buzz to get back."
    },
    {
      "title": "Provide the hero with their biggest challenge yet.",
      "content": "Provide the hero with their biggest challenge yet. At this point in the story, the hero must face the biggest challenge of their journey. This might involve defeating a powerful enemy or obtaining a special item. Describe what your hero must do to overcome this challenge. This is a great opportunity to show how your hero has grown through their adventures. [19] X Research source For example, your hero might demonstrate a skill that their mentor tried to teach them, but they struggled to master until this moment. In the example of Toy Story , Woody's greatest challenge is teaming up with Buzz and the other toys in Sid's room to stop Sid from hurting any more toys. They come up with a plan together and work as a team to scare off Sid. [20] X Research source"
    },
    {
      "title": "Allow the hero to obtain the object of their quest.",
      "content": "Allow the hero to obtain the object of their quest. After your hero has overcome their biggest challenge, they can obtain the item or other object of their quest. This might be a physical item, such as a key or magic sword, or something symbolic, such as earning the respect of an important figure in their life or gaining a meaningful title. For example, in Toy Story , Woody and Buzz escape from Sid's home and Woody has overcome his jealousy of Buzz. They've developed a meaningful friendship as a result of their adventures."
    },
    {
      "title": "Steer your hero back towards their home, but with a final test.",
      "content": "Steer your hero back towards their home, but with a final test. Although your hero has overcome the major obstacle in their story, you may also include one last test for your hero to endure. This test can help to emphasize the hero's growth over the course of your story and provide closure on something that the hero has been struggling to achieve in the background of the story. For example, in Toy Story , Woody's final test is when he has to trust in Buzz and accept his help to get back to Andy. Buzz uses his special skills to get them to the car, and Woody shows that he is no longer jealous of Buzz. He is amazed by him and gladly accepts his help. [21] X Research source"
    },
    {
      "title": "Demonstrate how your hero has changed after their experiences.",
      "content": "Demonstrate how your hero has changed after their experiences. Your hero may undergo a symbolic or actual death as a result of their ordeal, and then they must also undergo a resurrection. This is when you show how your hero has changed as a result of where they have been and what they have done. For example, Woody compliments Buzz rather than poking fun at him showing that he has grown from the beginning of the story when he was jealous of Buzz and picking fights with him. In some stories, such as Harry Potter and the Deathly Hallows , the hero actually dies temporarily. Harry Potter dies, has a vision or visits a place between life and death, and then he is resurrected with new strength to defeat Lord Voldemort."
    },
    {
      "title": "Bring your hero back home with their quest completed.",
      "content": "Bring your hero back home with their quest completed. After your hero has completed the final task, describe the new normal of the hero's world. This might look much like the beginning of the story, but with a small, yet noticeable improvement that the hero's successful adventure has created. For example, in Toy Story , the new normal is much like the beginning of the story. However, instead of Woody running the toy meeting on his own, he is co-running it with Buzz. This shows that their friendship is still intact and that there is peace and harmony in Andy's room."
    }
  ]
}