{
  "url": "https://www.wikihow.com/Throw-a-Christmas-Party-at-Your-House",
  "title": "How to Host a Stress-Free Holiday Party at Your Home in 4 Simple Parts",
  "steps": [
    {
      "title": "Plan early.",
      "content": "Plan early. You need to give yourself enough time to work out all the details of the party. Try to start your planning around six weeks before Christmas. This will not only give you enough time to plan the party, it also will allow you to invite your guests early so that they won’t plan anything else for that day."
    },
    {
      "title": "Choose a date and time.",
      "content": "Choose a date and time. Don’t plan your party too close to Christmas. Many of your guests may be leaving town to visit family, so if you plan your party the day before Christmas, many people may not be able to come. Instead, try to hold the party at least five days before Christmas. The weekend is usually the best time to hold the party, because your guests won’t have to go to work in the morning. Also decide if you want your party to be during the afternoon or a night. Most parties are held in the evening, but try to choose what is best for you and your guests. Get some input from your guests if you aren’t sure when people would be able to make it."
    },
    {
      "title": "Choose a location.",
      "content": "Choose a location. If you are holding a Christmas party for your coworkers, you may be able to hold the party in the office. However, if you’re holding the party for family or friends, you will need to either hold the party at your house, find someone who is willing to host the party, or rent out a location. Renting out a space can be expensive, so if you feel comfortable holding the party at your house, this may be the most convenient and cost-effective solution."
    },
    {
      "title": "Decide whether you want to do a gift exchange.",
      "content": "Decide whether you want to do a gift exchange. Decide in advance whether you want your guests do a gift exchange like Secret Santa or White Elephant. This is not a necessary part of the party, but it can add some excitement and give your guests an activity to bond over. [1] X Research source To do a Secret Santa, give your guests the name of another guest, preferably a person that they already know, to buy a gift for. You can also put names in a hat and choose a name. If you get your own name put it back in the hat and try again. For White Elephant, all guests bring a small or funny gift that anyone could enjoy. Then each guest picks whichever present he or she wants during the party."
    },
    {
      "title": "Send out invites.",
      "content": "Send out invites. Once you have pinned down the details of the date and time of your party, send out invitations either by email or mail. Make sure that the invitations include the date, time and address of the party. Also make sure that the invitations tell your guests to RSVP, so you will have a sense of how many people will be at the party. If you decide to do a gift exchange, give your guests the information on what they need to bring."
    },
    {
      "title": "Budget the party.",
      "content": "Budget the party. Draw up a general budget of your party. Unless you are renting a space, providing food and drinks will probably be the most expensive aspect of your party. Decide if you are going to have catered food, or if you are going to prepare food. If you are doing catering, call up the caterers and ask for an estimate for the number of people you are inviting. If you are preparing food yourself, estimate the approximate cost of ingredients for dishes you plan to make. You can consider holding a potluck-style party where each guest brings a dish if you trying to cut down the cost. Consider if you need to rent anything like chairs, tables or coat racks to accommodate guests. Consider the Christmas-specific decorations you will have at your party, such as the Christmas tree, as well as garlands, stockings, or other small pieces of décor."
    },
    {
      "title": "Arrange catering.",
      "content": "Arrange catering. If you have decided to go the catering route, call the restaurant or service you are getting your food from. Make sure that the catering company offers a wide range of food so that everyone will be able to find something they like. Tell them the date of the party, and ask them how you should proceed in getting their catering delivered. Catering companies will do all the hard work of preparing and delivering the food, so that all you will need to do is pay."
    },
    {
      "title": "Pick appetizers to prepare.",
      "content": "Pick appetizers to prepare. If you have decided to prepare food on your own, decide on a menu that will appeal to all your guests. Make sure to have one or two vegetarian options. You don’t have to offer your guests a full meal. Finger foods are ideal for Christmas parties because they are easy to eat and are often easy to prepare as well. Make sure to provide desserts as well as savory items. Some good examples of tasty and easy to make foods are: deviled eggs, veggies and dip, bruschetta, pigs in blankets, and gingerbread and Christmas cookies."
    },
    {
      "title": "Decide on drinks.",
      "content": "Decide on drinks. Many Christmas parties serve alcoholic beverages. Decide if you want alcohol at your party. You may decide to buy alcohol and mixers at the store, or you may want to prepare a large batch of alcoholic punch or a batch of your favorite cocktail. Do what you feel is best for your party. Be sure to pick up enough drinks for everyone that's attending the party."
    },
    {
      "title": "Prepare what you can the day before.",
      "content": "Prepare what you can the day before. Depending on what you decide to serve, try to prepare your food as early in advance as you can. If the food must be fresh, prepare it the morning of your party. Remember that if you are serving hot foods, you can always warm them in the oven or nuke them in the microwave before serving. [2] X Research source"
    },
    {
      "title": "Buy food at the supermarket.",
      "content": "Buy food at the supermarket. Even if you want to prepare most of your food, there are still things that you will probably want to buy. These include drinks like soda or alcohol, and also snacks like chips and cheese and crackers. You also may want to buy fresh fruit or veggies like strawberries that your guests can enjoy. While you are at the supermarket, remember to buy any plates, napkins, cups or utensils your guests will need to eat."
    },
    {
      "title": "Clean the space.",
      "content": "Clean the space. If your party is at a rented venue, the space should already be ready and set up. However, if you are holding the party at your house or your office, you will likely need to do some major cleaning. Start by cleaning all surfaces and putting everything in its place. Then take a step back and assess if there is enough room for your guests. If the room feels too cluttered or crowded to hold a large number of people, start to move things into other rooms to make sure there is enough space for everyone."
    },
    {
      "title": "Put out tables and chairs.",
      "content": "Put out tables and chairs. You will need to put out long tables for holding food. You also should make sure that there are enough chairs to hold about a fourth of your guests. Your guests are going to mingle and walk around, so you don’t need to have as many chairs as you have guests. However, aim enough chairs or couches for elderly guests or for guests who get tired of standing."
    },
    {
      "title": "Place the Christmas tree in a central location.",
      "content": "Place the Christmas tree in a central location. The Christmas tree is the most important focal point of a Christmas party. Place the tree so that it’s in a prominent, central location while still not being in the way. Decorate the tree with lights, garlands, and ornaments, and place a star at the very top. Remember to plug the lights into an outlet and turn them on before the start of the party."
    },
    {
      "title": "Decorate the rest of the space.",
      "content": "Decorate the rest of the space. Make sure the rest of the space follows a Christmas theme by putting out stockings, tinsel, mistletoe, red and green ornaments, and any other decorations that fit the Christmas spirit. [3] X Research source Don’t skimp on the decorations—a good Christmas party needs plenty of Christmas décor."
    },
    {
      "title": "Set up a kids area.",
      "content": "Set up a kids area. If your friends or coworkers are bringing their kids, you will want to set up an area with games or fun activities for them. This will keep kids entertained, occupied and out of trouble! [4] X Research source Set the kids area slightly apart from the hustle and bustle of the party. Consider the ages of the kids coming to the party when picking out games. For instance, Monopoly would be too complex for three year olds, while older children would be bored by toys designed for younger children."
    },
    {
      "title": "Set up the food and drinks.",
      "content": "Set up the food and drinks. Set up food at a long table, with savory appetizers at one end and desserts on the other. Make sure that there are plenty of plates, napkins and utensils at each side of the table so that guests can help themselves. [5] X Research source Also consider putting out toothpicks if you are serving food like fruit or shrimp cocktail, which are easier to spear than to eat with you fingers or with forks. If you are serving hot food, heat it up 30 minutes before guests are scheduled to arrive."
    },
    {
      "title": "Turn on music.",
      "content": "Turn on music. Make a playlist of your favorite Christmas songs, mixed in with other party music. Use speakers to play the music at a normal volume. When making your playlist, think about your audience. Consider that your coworkers and your older relatives may be at the party, and play music that is not too aggressive or too inappropriate. If you don’t know what kind of music to play, consider having a site like Pandora make a playlist for you. If you are planning a large party at a venue, consider hiring a professional DJ."
    },
    {
      "title": "Turn down the lights.",
      "content": "Turn down the lights. Glaring lights can kill a cheerful holiday vibe. Dim overhead lights, and turn on any standing lamps or other light sources. Consider hanging Christmas lights along the walls to give your party a twinkling, warm light. You also can put candles on tables and shelves; just make sure that the candles are held in jars, or other safe containers. Also make sure to monitor the candles after you light them, and keep them out of reach of children."
    },
    {
      "title": "Greet your guests as they come in.",
      "content": "Greet your guests as they come in. Part of your role as host is to greet each guest as they join the party. Warmly greet them and ask them how they are. Let them know where everyone is, and that they should help themselves to food and drinks. [6] X Research source Say something like, “Hi Jasmine, so glad you were able to make it! Come in, everyone is in the living room. Help yourself to food!” You can also give your greetings a personal touch by asking or saying something pertaining to each individual. For instance say, “How’s your new job going?” or “Is Chris going to be able to make it?”"
    },
    {
      "title": "Hang up coats.",
      "content": "Hang up coats. Also ask your guests as they come in if you can take their coat and/or purses. Either put them on a coat rack, or put them in an unused room so that your guests will be able to pick them up later. [7] X Research source"
    },
    {
      "title": "Enjoy yourself.",
      "content": "Enjoy yourself. Once all your guests have arrived, go mingle with everyone. Try to chat with at least all of your guests a little bit, and have some food. Remember to smile, and try to enjoy yourself. Remember that everyone who accepted your invitation appreciates the effort that you went through to put on this party. [8] X Research source"
    },
    {
      "title": "Don’t drink too much.",
      "content": "Don’t drink too much. There’s always one person who drinks a little too much at Christmas parties: make sure that person isn’t you. As host, you are the most critical person at this party, so you don’t want to drink too much and lose focus. [9] X Research source Even if you feel like drinking could help you feel less nervous, try not to have more than one or two drinks."
    },
    {
      "title": "Make an announcement to welcome everyone.",
      "content": "Make an announcement to welcome everyone. About fifteen minutes after everyone has arrived, make an announcement or propose a toast. This is a way of thanking everyone for coming and showing how much it means to you that they are at your party. You can say something like, “I just wanted to say, thank you all for coming! It’s so nice to see all of you together. Here’s to a great holiday season!”"
    },
    {
      "title": "Introduce guests to one another.",
      "content": "Introduce guests to one another. As host, part of your job is to make sure that your guests are comfortable. It could be that some of your guests only know a couple people at the party, and they may not know how to meet other guests. Make sure to introduce guests who may not know each other and get them started on a conversation. [10] X Research source An easy way of introducing people is to say something like, “Hey Alyssa, have you met Sally? She was in my class at UMass.”"
    },
    {
      "title": "Do a gift exchange about halfway through the party.",
      "content": "Do a gift exchange about halfway through the party. If you are doing a gift exchange, start it about midway through the party. This gives time for your guests to eat, drink and chat with guests. [11] X Research source Make an announcement like, “Alright, is everyone ready to do Secret Santa?” Give your guests instructions about how to exchange gifts. Say something like, “Everyone gather over to this side of the room, and bring your gifts. I’m going to read out who everyone’s Secret Santa is, and when I call your name, go ahead and exchange your gift!”"
    },
    {
      "title": "Bring the party to a close.",
      "content": "Bring the party to a close. At the end of the night, start to wind down the party. Use subtle methods like turning down the music, or putting away food, to signal that the party is over. As your guests leave, smile and thank them for coming. [12] X Research source"
    }
  ]
}