{
  "url": "https://www.wikihow.com/Use-Spotify-to-DJ-at-a-Party",
  "title": "Using Spotify's DJ Mode to Play Music at Parties",
  "steps": [
    {
      "title": "Sign up for Spotify.",
      "content": "Sign up for Spotify. Spotify offers two types of accounts: a free version and Premium . You'll need to buy the Premium account to avoid ads between songs (ads will definitely ruin the party vibe along with the flow of your playlist). Premium costs $9.99 per month. Premium also offers higher quality audio (320kbps) than the free version. If you already have a free account, go into your account settings to upgrade to a Premium account . You won't need to change any of your login info. [1] X Research source"
    },
    {
      "title": "Download Spotify.",
      "content": "Download Spotify. The sound quality and buffering speed are better on Spotify's downloaded application (as opposed to their web browser). You can download Spotify for both Macs and PCs. If you use a Linux or Chromebook, though, you’ll have to use the web player. You can also use the Spotify app on your phone (although you might want to avoid downloading your playlist in this scenario since the songs will take up a ton of space on your phone). You can use the web browser if you don’t want to take up space on your computer, but the audio quality and usability is better through the app. It is important for a DJ to have reliable equipment, and having the application downloaded is one way of doing this."
    },
    {
      "title": "Create a new playlist.",
      "content": "Create a new playlist. Go to File --> New Playlist. The playlist will appear in the list on the left hand side. Title it a memorable name that relates to the party you’re DJing. You could try something like: Ella and James Wedding Mix Pool Party Vibes Fire in February: Chicago House"
    },
    {
      "title": "Add music to the new playlist.",
      "content": "Add music to the new playlist. Consider the occasion of the party before you start dragging your favorite songs to the playlist. Most DJs include upbeat music that facilitates a dancing crowd. Select songs that you find particularly upbeat. To add songs, just drag a track you like into the playlist. Spotify automatically imports all music files on your computer into Spotify. To find your stored music, click on the tab that reads \"Local Files.\" Now, you can drag files from iTunes or other applications into your playlist. To search for specific songs, type the song or artist name into the search bar (on the upper left side) to find matches. Search your friends' playlists for additional music suggestions. Type the name of a friend into the search bar and view playlists that they're sharing on Spotify to get ideas. Go to Spotify's Top Lists to find popular and trending music. You can also adjust the result to filter different countries, daily or weekly, and by date. Consider separating your playlist into categories. For instance, create a playlist for the ceremony, and title it \"ceremony.\" Then, do the same for cocktail hour and for the reception."
    },
    {
      "title": "Make the playlist collaborative (if you want to).",
      "content": "Make the playlist collaborative (if you want to). Right-click on the name of the playlist and choose \"Collaborative Playlist.\" Now, when your friends view the playlist, they'll be able to add music to it as well. You can share the link with specific people over Spotify or by copying the URL (just right-click on the playlist, copy the HTTP link, and paste it into a message or email)."
    },
    {
      "title": "Sort through and organize your music selection.",
      "content": "Sort through and organize your music selection. Put yourself in the partygoers’ shoes while you look over your playlist. Vibes tend to change as the party carries on, so you want to be prepared. For example, don't start with crowd faves like “P.Y.T.” or “All Night Long.\" Save those for the middle of the party when the vibe starts shifting into a higher gear. If you’re not sure where to start, Motown soul hits are a good way to kick things off. Play some older funkier soul music to start the night with positive vibes. As the party gets going, throw in classic party tracks like hip-hop or The Bee Gees. Once the dance floor begins to get a good crowd, you should start playing the heavy hitters and crowd faves. Depending on the gig, you should shoot for about 3 hours of music. The climax of the party will probably be in the last quarter of those 3 hours."
    },
    {
      "title": "Plan on a playlist without wifi.",
      "content": "Plan on a playlist without wifi. Some venues may not offer wifi, so you need to be prepared for this. Spotify Premium offers an “Offline Mode” that you can select through “File” in the menu bar. Before selecting offline mode, download your playlist and any other materials you think you might need. Toggle the “Available Offline” to green at the top right of your playlist. This downloads the full playlist onto your device. Keep your computer powered and connected to the wifi while your playlist is being downloaded. The green arrow will indicate when the download is complete. [2] X Research source You can only download playlists you’ve created or ones that you are following. You might want to add extra songs to your playlist in case party guests have song requests."
    },
    {
      "title": "Ask about the party's audio system and prep, as needed.",
      "content": "Ask about the party's audio system and prep, as needed. Contact the venue or party coordinator for details about the audio system. They might have surround sound, a Bluetooth speaker, or nothing at all. If they don't have any audio system, the easiest device to bring is a portable speaker (Bluetooth or cabled). If they have a stereo or speaker you can connect to, bring the following adapter cables (just in case): RCA to 1/8\" cable. These are excellent for connecting your device to an old stereo system that only uses RCA inputs. An RCA audio cable has two prongs that are color coated (red and white). 1/8\" cable. These cables can be plugged into headphone jacks (from your computer) into auxiliary jacks on their system. 1/4\" converter for the 1/8\" cable. The converter could be useful if you need to plug your device into an amplifier or a P.A."
    },
    {
      "title": "Set Spotify to crossfade songs.",
      "content": "Set Spotify to crossfade songs. Crossfade is a classic DJing technique that allows you to play the upcoming track without any gap in audio. The songs will fade into each other and create a dance party atmosphere. Go to Edit --> Preferences. Scroll down to the Playback section. Select both \"AutoMix\" (or \"Gapless Playback\" depending on the device) and \"Crossfade Tracks.\" These selections are called Spotify DJ Mode. You can adjust the timing of the crossfade to your liking. On Apple devices, go to “Settings” or click the gear icon in the lower right corner to access the Playback settings."
    },
    {
      "title": "Adjust the equalizer.",
      "content": "Adjust the equalizer. You can modify the sound of your playlist to fit the atmosphere and setting of the room where you're DJing. Go to Settings > Playback to find the equalizer options. Experiment with the equalizer settings before the party gets started until you find what you like. You can either adjust the equalizer manually, or choose one of Spotify's presets: Bass Booster Dance Hip Hop Electronic R&B [3] X Research source"
    },
    {
      "title": "Follow your instincts and adjust to accommodate the crowd.",
      "content": "Follow your instincts and adjust to accommodate the crowd. If your playlist is about to go in a direction you’re not feeling, make adjustments. The job of a DJ is to reflect the feelings and desires of the crowd. Watch how the crowd reacts to your selections and determine if one style of music works better than another."
    },
    {
      "title": "Add song requests to your playlist (if you want to).",
      "content": "Add song requests to your playlist (if you want to). If you decide to take requests, you can either add them to the playlist, or to the queue so that it plays as the next song. To add it to the queue, right-click on the song and choose \"Queue\" from the drop-down menu that appears. To view the queue, click on it in the left hand menu. \"Play Queue\" should appear in the top section directly under the inbox."
    }
  ]
}