{
  "url": "https://www.wikihow.com/Use-Kik-on-Your-Computer",
  "title": "Using Kik on a Computer: Everything You Need to Know",
  "steps": [
    {
      "title": "Install BlueStacks Android emulator.",
      "content": "Install BlueStacks Android emulator. BlueStacks is a free app for Windows and macOS that allows you to run Android apps on your computer. [1] X Research source Use the following steps to download and install BlueStacks : Go to https://www.bluestacks.com/ in a web browser. Click Download . Open the BlueStacks installation file in your Downloads folder. Follow the instructions to complete the installation. An alternative to BlueStacks is Andy, which you can download from https://www.andyroid.net ."
    },
    {
      "title": "Open BlueStacks.",
      "content": "Open BlueStacks. Once installed, you'll find BlueStacks in your Windows Start menu or Mac Launchpad. If it's your first time using BlueStacks, follow the on-screen instructions to sign into your Google account."
    },
    {
      "title": "Type kik into the search bar and click the magnifying glass.",
      "content": "Type kik into the search bar and click the magnifying glass. The search bar is at the top-left corner of BlueStacks. A list of matching results will appear. [2] X Research source If you don't see a search bar at the top of the screen, open the Google Play Store and type kik into the search bar at the top, and then press Enter to search for Kik with the Google Play Store."
    },
    {
      "title": "Click Install in App Player.",
      "content": "Click Install in App Player . It's the green button on the left-hand side. This will install the Kik Messenger app inside BlueStacks."
    },
    {
      "title": "Click the App Player icon.",
      "content": "Click the App Player icon. It's the icon that looks like a stack of papers in the menu bar to the left. It may take a minute or two to open the App Player. If you see any ads for games or other apps, click the \"x\" icon in the upper-right corner to close the ad."
    },
    {
      "title": "Open Kik.",
      "content": "Open Kik. It's the green icon that says \"kik\" in white letters."
    },
    {
      "title": "Log in or create an account.",
      "content": "Log in or create an account. If this is your first time opening Kik in BlueStacks, you will need to log in or create an account. To log in, click Log In and then sign in with your username or email and password. If you don't have a Kik account, click Join and follow the instructions to create an account. [3] X Research source Kik only lets you log in on one device at a time. Logging in on your computer will log you out of Kik on your phone or tablet (and vice-versa). [4] X Research source You may be asked to complete a simple puzzle to prove that you are a real person upon signing in or creating an account."
    },
    {
      "title": "Click NOT NOW at the top-right of the \"Find Your Friends\" screen.",
      "content": "Click NOT NOW at the top-right of the \"Find Your Friends\" screen. You're skipping this step since you're using an emulator, not your phone. This is the step that would normally upload your phone contacts so you know which of your friends has Kik. Click I'M SURE when prompted to confirm this choice."
    },
    {
      "title": "Find people to chat with.",
      "content": "Find people to chat with. Now that you've installed and set up Kik on your computer, you can text people, send photos and videos , and more. Check out How to Use Kik to learn more about Kik's many features, and use the following steps to find people to chat with: To search for a group , click FIND A GROUP at the center of the screen to search for public chats based on certain topics. Search for a group by interest, click a group's name in the search results, then click JOIN PUBLIC GROUP to join. To find a particular user , click the + at the bottom-right corner, select Find People , and then use the search bar at the top to search by name or username."
    }
  ]
}