{
  "url": "https://www.wikihow.com/Start-a-Trend",
  "title": "How to Start a Trend",
  "steps": [
    {
      "title": "Think about the type of trend you want to start.",
      "content": "Think about the type of trend you want to start. There are many different types of trends: fashion trends, slang trends, new dances or social media trends. Some are easier than others to pull off, and all take a great deal of effort to popularize."
    },
    {
      "title": "Think about the qualities of your trend.",
      "content": "Think about the qualities of your trend. You’ll want it to have a couple of qualities: mainly originality and simplicity. Creative, simple and accessible trends catch on because many people notice the trend and are able to participate. Make sure your idea is original. While many trends build on current styles and ideas, good trends represent something unique. You’ll need to come up with an idea that is not only unusual, but makes people wish they had thought about it before. The trend needs to be something that truly interests you too, and not just something new for the sake of being new. Make sure it’s original and authentic to who you are as a person. Keep your trend simple. The more complicated a trend is and the more steps people have to follow, the less they will be interested. Trends like slap bracelets, the Macarena and reaction videos are simple, easy to make, learn or buy, and none of them take a lot of work for normal people to participate in. Try to angle for the same simplicity with your trend."
    },
    {
      "title": "Tailor the trend to your environment.",
      "content": "Tailor the trend to your environment. You'll want to make sure that your trend is relatable and interesting to those around you. It will only catch on if other people find it interesting, so make sure it makes sense for the setting you spend your time in, whether it's school, an office, or an internet forum."
    },
    {
      "title": "Think about current fashions.",
      "content": "Think about current fashions. A fashion trend will be simple and original, just like any other type of trend. You'll want to build on current fashions to come up with something new and cool, but not too strange or off the wall."
    },
    {
      "title": "Try mixing and matching.",
      "content": "Try mixing and matching. Contrast is an important part of trends: stripes with solids, sporty with chic, basics with gaudier accessories. Think of ways items that don’t normally go together, or patterns that are normally seen to clash. Each of these could be a potential trend."
    },
    {
      "title": "Look to older fashions.",
      "content": "Look to older fashions. Many trends of the past few years have been completely original, but others are a twist on old fashions that have gone out of style. Look back through old yearbooks or magazines and see what kind of trends were popular back then, like letterman jackets, saddle shoes or colorful patterns. See if there’s a way to put a new spin on an old fad to bring it back. [1] X Research source"
    },
    {
      "title": "Don’t forget hair and makeup!",
      "content": "Don’t forget hair and makeup! While most trends are based on clothing or accessories, lots of trends are hair or makeup based. See if there are some unique ways to style or color your hair, or watch some makeup tutorials to do better and bolder eye makeup."
    },
    {
      "title": "Make your trend affordable.",
      "content": "Make your trend affordable. While big diamonds, large name brand logos and expensive shoes have certainly been trends in the past, they’re not likely to gain much as wide of popularity as something more affordable. If the measure of success of a trend is the number of people who take part, then cheaper is better! The trend will be accessible and inclusive for almost everyone."
    },
    {
      "title": "Imagine how the trend will take off.",
      "content": "Imagine how the trend will take off. The most important part of starting a trend is getting it to spread, so you have to be realistic about how likely your trend is to catch on. If it’s simple, original and affordable, it should be viable as a trend. Imagine your friends taking part, or what people would look like if they all wore your trend."
    },
    {
      "title": "Think about any backlash you could create.",
      "content": "Think about any backlash you could create. Fashion trends can cause issues if they're too wild or strange. Many people don't like change, and will find any reason to shut your trend down. Make sure the trend is appropriate. Schools and offices have dress codes, and sometimes they're very strict. Make sure that your trend conforms to these codes, and also use common sense. Trends that involve lots of bare skin or suggestive clothing items will likely get you in trouble. Be careful with symbols. If your trend involves any type of religious, political or pop-culture symbols, be aware that you may upset those around you. People may not hold your viewpoint on political or religious issues, and may target you if your trend offends their sensibilities. Stay conservative to avoid being made fun of. If your trend is too strange, others will make fun of you and the trend won't catch on. Extreme hair cuts, excess accessories or other very original looks may make you a target for bullies. Go back to the drawing board if necessary. If your fashion trend offends others or attracts bullies, scrap it and start over again. Making the perfect trend is about trial and error, so don't be too upset about failed trends. Start back at the beginning and try again."
    },
    {
      "title": "Pick your platform.",
      "content": "Pick your platform. There are many different social media platforms, and all of them have their own trends. Whether you use Twitter, Facebook, Instagram or Reddit, pick a platform that is most suited to your sense of style, humor and personality. [2] X Expert Source Rut Nastiti Social Media Expert Expert Interview. 14 April 2023. [3] X Research source"
    },
    {
      "title": "Think about about your trend format.",
      "content": "Think about about your trend format. Social media trends, like all other trends, revolve around simplicity and originality. Think about other popular trends on your social network of choice, and how they became popular. Your trend could be a caption on a certain type of photograph, a short .gif clip of a film scene, or a \"hashtag\", or short description of your message."
    },
    {
      "title": "Make sure your trend is relatable.",
      "content": "Make sure your trend is relatable. The most important part of creating viral content online is making sure that many people relate to it. [4] X Expert Source Rut Nastiti Social Media Expert Expert Interview. 14 April 2023. The more people that relate to and understand your trend, the more people will share it and pass it on. Make sure the subject matter is specific, but don't make the focus too narrow. [5] X Research source For example, you could caption a photo with a blurb about how bored you are at high school instead of being bored at your own specific high school. High school students all around the world will relate to the more general photo, but only students at your school would relate to, and share, the photo with a caption about your school. Start hashtags about well known celebrities or TV shows instead of more obscure ones. While you may love an obscure or lesser known celebrity or show, less people will be able to understand and latch onto your social media post. Comment on well known figures in your post to make sure it gets shared more often."
    },
    {
      "title": "Be funny.",
      "content": "Be funny. A great deal of social media content is humorous. Funny pictures, jokes and .gif images get shared more than other, more serious content, so the funnier you can be, the more chance you'll have of your trend taking off. [6] X Research source"
    },
    {
      "title": "Think of a word.",
      "content": "Think of a word. You'll want your word to sound exciting. Slang exists to make the language more exciting, so pick words that seem cool to you. \"Cool\" may be subjective, of course, but think of other slang words and what makes them roll off of the tongue. Many have lots of consonants, some are related to songs or movies, and most of them are short and easy to pronounce. [7] X Research source"
    },
    {
      "title": "Think of what you want your word to describe.",
      "content": "Think of what you want your word to describe. Many slang words are simple synonyms for \"good\": \"awesome,\" \"rad,\" \"dope,\" \"sick,\" \"wicked,\" etc. Others describe things that are bad: \"bogus,\" \"bummer,\" \"lame,\" \"weak,\" etc. Keep the subject of your word simple, and you'll be able to get more people to use it."
    },
    {
      "title": "Make sure your word doesn't offend.",
      "content": "Make sure your word doesn't offend. While you may think your new slang sounds great, it's possible that it may sound like an offensive word, or sound like an offensive word in another language. Double check with others around you to make sure it doesn't sound aggressive or bad, and search your word on the internet to see if it has other, bad meanings."
    },
    {
      "title": "Use your trend.",
      "content": "Use your trend. The hardest part of creating a trend is getting is getting it to spread. Luckily, you'll be able to create visibility for your trend by using it yourself. Whether it's a type of social media post, a dance or an outfit, simply using or wearing your trend will expose people to your idea and let them see it often."
    },
    {
      "title": "Be confident.",
      "content": "Be confident. You trend may seem strange at first, especially if you’re mixing fashions that don’t normally go together or using a strange word that no one's heard before. As time goes on, and you use your trend more and more, it will “normalize” in people’s eyes and it won’t seem as strange anymore, letting it catch on. [8] X Research source"
    },
    {
      "title": "Stay casual.",
      "content": "Stay casual. Don’t show off your trend too much. You need to wear or use your trend often, but don't constantly show it off or make a big deal out of. Don’t ask other people to comment on your trend or tell them that they should use it too. Act as you normally would. [9] X Research source"
    },
    {
      "title": "Mix it up.",
      "content": "Mix it up. While your trend may be great on its own, people will tire of it after a while if they see it too often. Change it up a bit to show the variability of your trend, whether it's a fashion item, a word or a social media post. This will show people that your trend is versatile and accessible. If your trend involves an accessory or a type of jewelry, buy the item in a couple of different colors or patterns. Mixing it up will keep people watching to see what’s next with the trend, and show them that it’s versatile. If your trend is a slang term, use it in all of the contexts you can. If your slang term means \"good,\" use it to describe \"good\" parties, \"good\" ideas and \"good\" weather."
    },
    {
      "title": "Never announce that you are starting a trend.",
      "content": "Never announce that you are starting a trend. If you make it too obvious that you’re specifically out to set a trend, people will see through you and the trend won’t catch on. Don’t be ostentatious or show off your trend too much when you start wearing or using it. Just act normal, as if you’re doing things you'd normally do."
    },
    {
      "title": "Ask your friends to take part.",
      "content": "Ask your friends to take part. A trend won’t catch on until people decide that it’s a cool thing to do or wear. People have to see others taking part before they become comfortable enough to participate, so this is where your friends come in. Ask them from the beginning if they’d be willing to wear the style. If they say yes, show them what they need to do, and tell them to wear or use it every once in a while to increase visibility of the trend and help it “catch on”."
    },
    {
      "title": "Don’t all use/wear the trend at the same time.",
      "content": "Don’t all use/wear the trend at the same time. If you all use the trend too much, too soon, it may lead to an overload and make it seem as if you’re all trying to hard. In the worst case, it you may all become separated from the rest of your school or workplace if the trend doesn’t take off: you’ll be those people who tried to start a “weird” trend."
    },
    {
      "title": "Answer questions from others.",
      "content": "Answer questions from others. People are going to ask you lots of questions about the trend, especially if it is a little wild. This is a good way to spread your trend and make it more popular. If it's a fashion trend, people may ask you why you are wearing what you’re wearing. In this case, tell them that you thought it was interesting, or thought it was something a little different. Don’t tell them that you’re out to “set a trend”: this will come off as fake and the trend will be less likely to spread. Be ready to ask questions about where you bought clothes or accessories. If people like the idea, you’ll want to share how to buy or make what you’re wearing. Be friendly and help them out as much as possible. If your trend is a social media post, people online may ask you what it means. Tell them about your trend if they ask. For slang trends, there may be a lot of people who are confused about what you mean. If they ask you what the word means, tell them, but also be sure to use it in contexts that are easily understood."
    },
    {
      "title": "Watch it spread!",
      "content": "Watch it spread! If you’ve gotten enough friends on board and your idea is unique enough, chances are you’ll see other people start to do it as well. Keep using your trend and take pride in knowing that you created it."
    }
  ]
}