{
  "url": "https://www.wikihow.com/Use-Clove-Oil-for-Tooth-Pain",
  "title": "How to Use Clove Oil for Tooth Pain",
  "steps": [
    {
      "title": "Buy high quality 100% pure clove oil to use for tooth pain.",
      "content": "Buy high quality 100% pure clove oil to use for tooth pain. Try to buy an organic product if you can. Only pure oil will provide the benefits you want, so don’t settle for a mix. Check the label and read the ingredients to make sure the product you pick contains only clove oil. [1] X Research source You can purchase clove oil from a local health food store or online."
    },
    {
      "title": "Soak a cotton swab with clove oil and apply it to your tooth and gums.",
      "content": "Soak a cotton swab with clove oil and apply it to your tooth and gums. Clove oil can be used directly on your tooth to help ease the pain. Grab a cotton swab and dip one end in the clove oil. Apply it directly to the tooth and around the gum where you are experiencing pain. [2] X Research source If the nerve of the tooth is exposed in your mouth, make sure you are extra gently in the area. This oil does not taste the best. It may take some getting used to. Try to swallow as little of this oil as possible."
    },
    {
      "title": "Wait 20 minutes, then rinse your mouth with salt water.",
      "content": "Wait 20 minutes, then rinse your mouth with salt water. Set a timer for 20 minutes. Don’t drink or eat anything while the clove oil is in your mouth. Similarly, try not to swallow any of the oil. After letting it sit for 20 minutes, rinse your mouth out with a solution of 1/2 tsp (3 g) of salt and 6 fluid ounces (180 mL) of warm water. Finish with a warm water rinse to remove the salt water taste. [3] X Research source The salt water can also help with tooth pain, and it’s okay to use it every 2-3 hours throughout your day. [4] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Rinse your mouth out with salt water before using the compress.",
      "content": "Rinse your mouth out with salt water before using the compress. Mix 1/2 tsp (3 g) of salt into 6 fluid ounces (180 mL) of warm water. Take a sip and swish it around your mouth. Spit the salt water out into your sink and rinse with warm water. This will cleanse your mouth and pre-treat the tooth. [5] X Research source The salt will help sanitize your mouth. Save the unused portion of your salt water to rinse your mouth after using the compress."
    },
    {
      "title": "Pour 1⁄2 teaspoon (2.5 mL) of olive oil into a bowl.",
      "content": "Pour 1 ⁄ 2 teaspoon (2.5 mL) of olive oil into a bowl. The olive oil will dilute the clove oil so that it doesn’t taste as strong. This will also reduce your risk of irritation from the clove oil since you won’t be applying as much to your tooth and gums. Use a measuring spoon to transfer the olive oil from the bottle to the bowl. [6] X Research source Use extra virgin olive oil, if you have it."
    },
    {
      "title": "Add 2-3 drops of clove oil to the bowl and stir.",
      "content": "Add 2-3 drops of clove oil to the bowl and stir. Use an eyedropper if your bottle doesn’t have a top that lets you measure out drops. Carefully add the drops of clove oil to the olive oil, making sure you don’t add too much. Then, use a spoon to stir the oils until they’re mixed. [7] X Research source"
    },
    {
      "title": "Soak a cotton ball in the oil mixture.",
      "content": "Soak a cotton ball in the oil mixture. Dip the cotton ball into the oils and let it absorb the mixture. Make sure the cotton ball gets saturated in oils so that it will effectively treat your tooth ache. [8] X Research source Use a large cotton ball so that it applies more oil to your tooth and gums."
    },
    {
      "title": "Place the cotton ball over your tooth and bite down.",
      "content": "Place the cotton ball over your tooth and bite down. Check that the entire tooth and the gums around it make contact with the cotton ball. Then, bite down just hard enough to keep the cotton ball in place. Don’t bite down so hard it hurts. [9] X Research source"
    },
    {
      "title": "Leave the compress on your tooth for 20 minutes.",
      "content": "Leave the compress on your tooth for 20 minutes. Set a timer for 20 minutes, then try to relax while the oils work. Afterwards, remove the cotton ball and rinse your mouth out with the warm salt water solution. Finish by rinsing your mouth with warm water. [10] X Research source"
    },
    {
      "title": "Try fresh whole cloves.",
      "content": "Try fresh whole cloves. In addition to clove oil, you can also use clove in its whole herbal form. Take one to three whole pieces of clove and place them on the tooth right next to the painful one in your mouth. Wait a few minutes for the clove pieces to soften, then gently bite down on them, releasing the clove oils. Leave them in the area for 20 minutes. [11] X Research source Afterwards, rinse your mouth out with a warm salt water solution. The cloves can taste really strong and cause tingling in your mouth. This is normal. The taste should disappear in your mouth about 10 minutes. You can buy whole cloves at most grocery stores."
    },
    {
      "title": "Use ground cloves.",
      "content": "Use ground cloves. In addition to its whole form, you can also use ground clove as well. Measure out ⅛ teaspoon of ground cloves into a bowl. Mix in ¼ teaspoon of olive oil and stir together until mixed. Take a cotton swab and dip it into the mixture, then apply the clove infused oil to the painful tooth and the surrounding gum. [12] X Research source Leave it on the tooth for 20 minutes. After this, rinse your mouth out with warm salt water. You can also just add a pinch of the ground clove directly in your mouth on the area of your painful tooth. Your saliva will mix with the clove and help your tooth. You can buy ground cloves in the baking section of most grocery stores."
    },
    {
      "title": "Make a clove-infused mouth rinse.",
      "content": "Make a clove-infused mouth rinse. Clove infused water can also help your tooth pain. Put 10 to 15 whole pieces of clove in a pot of water. Let it simmer on the stove for 15 minutes. Remove it from the heat and let it sit until it cools to room temperature. Strain the cloves out and pour the infused water into a cup. Rinse your mouth with it, swishing it around your teeth for a minute or so. Spit the rinse into a sink. You can use the remaining mouth rinse for days after you make it. Keep it in a sealed bottle and use it every time you feel pain in your teeth. It will also help kill bacteria and leave your mouth feeling refreshed. If the taste is too much, you can add sage or thyme to the mixture."
    },
    {
      "title": "See your dentist if your toothache lasts longer than 2 days.",
      "content": "See your dentist if your toothache lasts longer than 2 days. A toothache that won’t go away may be a sign that something is wrong with your tooth. For instance, you may have a cavity, loose filling, or broken tooth. If left untreated, these issues can become serious and lead to dental problems. Fortunately, your dentist can diagnose and treat your condition so you find relief. [13] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Let your dentist know that you’re experiencing tooth pain and may have a problem with your tooth. When you get to your appointment, tell your dentist that you’ve been using clove oil as a treatment."
    },
    {
      "title": "Visit your dentist immediately for fever or signs of an infection.",
      "content": "Visit your dentist immediately for fever or signs of an infection. Sometimes your tooth can become infected. Since the infection may spread or worsen, it’s important to get prompt treatment. Your dentist can give you medication or perform a dental procedure to help you recover as soon as possible. Call your dentist if you notice the following signs of an infection: [14] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source Fever Swelling Pain when you chew or bite down Red gums Foul-tasting discharge Trouble breathing Problems with swallowing"
    },
    {
      "title": "Get a physical exam and X-ray to determine the cause of your toothache.",
      "content": "Get a physical exam and X-ray to determine the cause of your toothache. First, your doctor will look at your tooth and may tap on it with a dental tool. They’ll look for signs of tooth damage in the affected tooth and the teeth around it. Then, they’ll likely take X-rays of your tooth to help make a proper diagnosis. [15] X Research source Your doctor may decide not to do an X-ray if they can see the cause of your toothache without it. However, the X-ray will help them understand how to best treat your tooth. Getting a dental X-ray is a simple, painless procedure."
    },
    {
      "title": "Discuss your treatment options so you can get relief.",
      "content": "Discuss your treatment options so you can get relief. Your doctor will explain exactly what is wrong with your tooth, then they’ll tell you the best ways to treat it. Typically, your dentist will treat your toothache in 1 of the following ways: [16] X Research source If you have a cavity, they will remove the decayed part of your tooth and put in a filling. If an existing filling is loose, they’ll replace the filling. If your tooth has broken, they may put in a filling or a crown. In some cases, you may need a root canal before your new crown can be seated."
    }
  ]
}