{
  "url": "https://www.wikihow.com/Sync-a-Hotmail-Account-on-an-iPhone",
  "title": "How to Sync a Hotmail Account on an iPhone: Complete Tutorial",
  "steps": [
    {
      "title": "Open Settings.",
      "content": "Open Settings. It's a gray app that contains gears (⚙️) and is typically located on your home screen."
    },
    {
      "title": "Scroll down and tap Mail.",
      "content": "Scroll down and tap Mail . It's in the section of the menu that lists other Apple apps like Notes and Contacts."
    },
    {
      "title": "Tap Accounts.",
      "content": "Tap Accounts . It's at the top of the menu."
    },
    {
      "title": "Tap Add Account.",
      "content": "Tap Add Account . It's at the bottom of the list of accounts."
    },
    {
      "title": "Tap Outlook.com.",
      "content": "Tap Outlook.com . It's near the bottom of the menu."
    },
    {
      "title": "Enter your Hotmail email address.",
      "content": "Enter your Hotmail email address. Type it in the field provided."
    },
    {
      "title": "Tap Next.",
      "content": "Tap Next ."
    },
    {
      "title": "Enter your password.",
      "content": "Enter your password. Type the password associated with your Hotmail account into the field on the screen. If you haven't used your Hotmail account in a while, or you've forgotten your password, log into the Outlook.com website from your computer for help reactivating your account or resetting your password ."
    },
    {
      "title": "Tap Sign In.",
      "content": "Tap Sign In . It's the blue button on the right side of the screen."
    },
    {
      "title": "Tap Yes.",
      "content": "Tap Yes . Doing so allows the Mail app to access your Hotmail account."
    },
    {
      "title": "Select the data to sync.",
      "content": "Select the data to sync. Slide the buttons next to the listed apps to the \"On\" (green) position to sync your Hotmail data to your iPhone. You can sync: Mail Contacts Calendars Reminders Notes"
    }
  ]
}