{
  "url": "https://www.wikihow.com/Teach-Your-Dog-to-Speak",
  "title": "How to Teach Your Dog to Speak",
  "steps": [
    {
      "title": "Grab some training treats that your dog enjoys.",
      "content": "Grab some training treats that your dog enjoys. If you have a normal, prepackaged treats that your dog enjoys, use those. You can also use their normal kibble if they’re a hungry little puppy and you’ve been wary of using unhealthy treats yet. Whatever it is, pick something your dog really loves; the better the reward, the easier it will be to teach your dog. [1] X Trustworthy Source The Humane Society of the United States National organization devoted to the promotion of animal welfare Go to source If your dog loves to play, you can try using their favorite toy and playing with them when they bark. Most people, however, will find that treats are the most effective way to teach a dog. Try to avoid using processed human food as treats. A little organic turkey meat or carrot is fine every now and then, but relying entirely on human food can mess with their diet and reinforce their love of human grub. As you practice over time, mix it up every now and then. Use a variety of treats to keep your dog from getting bored by the same reward."
    },
    {
      "title": "If you are clicker training, use the clicker instead of a treat.",
      "content": "If you are clicker training , use the clicker instead of a treat. Clicker training is entirely optional, but if you’ve been using a clicker to train your dog, use it here. Instead of the treat, use the sound of the clicker to reward your dog. If you’re still in the early stages of clicker training where you’re using treats and the clicker, continue to use both as your reward. [2] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Clicker training is just as efficient as non-clicker training—it’s just a matter of personal preference. [3] X Research source If you’re new to clicker training, stick with it and start by using the clicker and the treat. Your dog will slowly start to associate the clicker sound with the treat and they’ll eventually mean the same thing to your pup."
    },
    {
      "title": "Show them the treat and bring them to you.",
      "content": "Show them the treat and bring them to you. Your dog needs to see the treat and be intrigued by it. Once they come over and realize you’ve got a treat, hold the treat away from them and give them a second to relax in front of the reward. [4] X Research source If your dog isn’t interested enough by the treat that they wander off after a few seconds of you not giving them a treat, your reward isn’t high-value enough. If you’re building on other skills, get them into a “sit” position for this so that you reinforce two behaviors at once."
    },
    {
      "title": "Tantalize them with the treat until they finally make some noise.",
      "content": "Tantalize them with the treat until they finally make some noise. Keep the treat visible and easy to see. Your dog may be confused for a minute, or whimper a little. They may even try to sit, lie down, or roll over to get the treat. Just hold out and keep the treat visible until they bark. [5] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Don’t tease or mess with your dog; just hold the treat up. If you induce an anxiety-related bark and then reward your dog, you may accidentally reinforce the idea that barking when they’re scared is a good thing. If your dog doesn’t bark at all here, you have two options. One is to simply put the treat away (at least for a minute) and try again once your dog stops paying attention. The other option is to do something that makes your dog bark (ring the doorbell, make an abrupt noise)."
    },
    {
      "title": "As soon as your dog barks, give them the treat and praise them.",
      "content": "As soon as your dog barks, give them the treat and praise them. After one bark, give them the reward, pet them repeatedly, and say, “Good dog!” or, “That’s so good!” Really make a show of it to get your dog excited about what they’ve just done. [6] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source If you wait too long to give them the treat, they may not immediately associate the bark with the treat. If you’re clicker training, press the clicker as soon as they bark. If you’re still using edible treats, give the treat and press the clicker at the same time."
    },
    {
      "title": "Practice in short bursts and keep giving your pup love for barking.",
      "content": "Practice in short bursts and keep giving your pup love for barking. You don’t need to engage in giant training sessions to reinforce this one. Barking is a natural behavior for a dog, so little 5- to 10- minute training lessons are just fine. [7] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Show the treat, wait for your pup to bark, and then give them the treat as the reward. If you had to make a noise or do something to get them to bark, slowly transition to simply showing the treat without the other stimulus. If you’re working on other commands and tricks at the same time as you’re teaching “speak,” go ahead and start incorporating “speak” once your dog understands that you want them to bark when you just show them the treat."
    },
    {
      "title": "Use “speak” or “talk” to start tying the behavior to the command.",
      "content": "Use “speak” or “talk” to start tying the behavior to the command. Now that your dog knows barking will get them treats, name the behavior. Say \"speak\" or \"talk\" just before they bark. You might also consider adding a hand signal (like pointing up, or making a fist), since dogs can learn visual cues just as easily as sound-based cues. Practice several times saying \"speak\" or \"talk\" just before your dog barks. [8] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source"
    },
    {
      "title": "Keep using the treat and the command word to train your pup.",
      "content": "Keep using the treat and the command word to train your pup. Now that your dog is starting to associate a word with barking, say \"speak\" or \"talk\" and wait for her to bark. Be sure to say the command only once to avoid changing the command. When your dog barks, offer the reward. Do this over and over again until your dog seems to be catching on. [9] X Research source You never want to repeat the command because it can trick your dog into thinking the command word is “speak speak speak” instead of just “speak,” for example. If your dog doesn’t get it the first time, pause, look away, lower the treat, and try again in a few minutes."
    },
    {
      "title": "Swap the treat out for the command word as they master the move.",
      "content": "Swap the treat out for the command word as they master the move. Whenever your dog fluidly interprets “speak” to mean “now is the time to bark,” you know it’s time to remove the treat. Continue to verbally praise your dog, but remove the food-based treat. As your dog gets better at the maneuver, you can fade the praise out, too. [10] X Research source If you’re clicker training, now is the time to slowly stop using the clicker."
    },
    {
      "title": "This will reinforce the command so your dog really internalizes it.",
      "content": "This will reinforce the command so your dog really internalizes it. Take your dog to the front porch or sidewalk and practice “speak” out there where there are birds and other ambient noises. Once they master the move out front, take them to the park where they’ll be tempted to run around. Then, you can practice the move in front of other dogs or toys. Once your dog knows “speak” everywhere, they’ve 100% mastered the command! [11] X Trustworthy Source American Kennel Club The American Kennel Club (AKC) is a purebred dog pedigree registry in the United States. The AKC advocates for the responsible ownership of dogs and promotes purebred dog events, such as the Westminster Dog Show. Go to source Now, you can start teaching your dog to bark at specific threats or whenever they want to go outside. Use the “speak” command whenever a stranger approaches, or whenever you’re about to let them out to use the bathroom to teach them how to let you know they need to go."
    },
    {
      "title": "Once your pup masters “speak,” you can move on to something else.",
      "content": "Once your pup masters “speak,” you can move on to something else. Return to “speak” periodically to ensure that your dog doesn’t forget about it. Now is the perfect time to teach the “quiet” command! This works basically in reverse—present a stimulus that’ll make your dog bark and then wait for them to be quiet. Then, reward them!"
    }
  ]
}