{
  "url": "https://www.wikihow.com/Throw-Cards-Accurately",
  "title": "How to Throw Cards Accurately",
  "steps": [
    {
      "title": "Grip the card correctly for an overhand toss.",
      "content": "Grip the card correctly for an overhand toss. The throwing style with the most power and potential for accuracy is an overhand toss, used by expert card throwers the world around. One of the earliest public practitioners was a stage magician named Howard Thurston, who used an overhand toss to put power and accuracy into his tosses, wowing audiences. Finding a grip that works for you and feels comfortable is the most important part of learning to throw accurately. [1] X Research source Most grip variations are named after famous card throwers: The Thurston grip involved pinching the short side of the card between your index and middle finger, so the bulk of the card faces in toward your palm. All the other fingers should be up and out of the way. The Hermann grip, named after another magician, involves pinching the card between your thumb and your middle finger in the center of the card about a third of the way down, letting the index finger wrap all the way to the opposite edge at the corner to help control the spin. The bulk of the card should be facing your palm."
    },
    {
      "title": "Hold your hand palm-side up.",
      "content": "Hold your hand palm-side up. The basic toss with the most accuracy happens by bending the card up next to the side of your head and release it with a flick of your wrist. To do this and get the right kind of spin on the card, you need to turn your palm up and grip the card using the grip style of your choice."
    },
    {
      "title": "Curve your wrist and wind your arm up over your shoulder.",
      "content": "Curve your wrist and wind your arm up over your shoulder. Curve your wrist in so the card tucks into your wrist, and bend your elbow, drawing your hand up next to your head to get your arm ready for the throw. Your pinkie finger should be just about even with your ear when your arm is cocked and ready. To learn the appropriate motion and practice, just curve your wrist up without putting your whole arm into it and try tossing the card with enough spin. When you've gotten used to it practicing the toss, bring the card up beside your head to put more power into your tosses."
    },
    {
      "title": "Snap your wrist forward.",
      "content": "Snap your wrist forward. In one fast, smooth motion, swing your arm forward from your shoulder and step into throw like throwing a baseball to get the most power and accuracy out of the card. At the end of that motion, unroll your wrist, spreading your middle and ring finger slightly to release the card. [2] X Research source"
    },
    {
      "title": "Keep practicing.",
      "content": "Keep practicing. Practice the motion, try to get it as smooth as possible, getting a clean release of the card. Keeping the motion as smooth as possible is the key to getting the card to spin and cut through the air, rather than floating on it and moving everywhere with the breeze. When you practice this motion, pay particular attention to how you're unrolling your wrist into a smooth line with the rest of your arm as you toss the card. Like many things, it's all in the wrist, but the power comes from your elbow."
    },
    {
      "title": "Grip the card correctly.",
      "content": "Grip the card correctly. Another common and accurate throwing style pioneered by powerful card thrower Ricky Jay and others is the frisbee-style toss, which can be super-accurate and super-powerful when gripped and tossed correctly. While you can also frisbee-toss a card using the Ferguson or the Thurston grip, it's more common to use Ricky Jay's style of holding the card: To learn the Ricky Jay grip, place your index finger on one corner of the card and place your thumb on top. Fold your three other fingers along the bottom of the long edge of the card. This grip is a bit like a hybrid of the other two styles. Your thumb on top should be on the other side of the card as your middle finger, pinching the card, much like the Hermann grip."
    },
    {
      "title": "Curl the card back into your wrist.",
      "content": "Curl the card back into your wrist. Curl the card back into your wrist, much as before, but hold your wrist parallel with the ground, your pinkie facing down as when you hold a frisbee. You can also wrap your arm around your body so the card is closer to your armpit on the opposite side of your body from the hand holding the card. Ricky Jay actually lifts his throwing hand up over his head, almost as if he's going to do an overhand throw, but the mechanics are more like a frisbee toss than an overhand throw, or some combination of the two. It looks as if the card is going to touch the ear on the opposite side of his head. [3] X Research source"
    },
    {
      "title": "Keep it in the wrist.",
      "content": "Keep it in the wrist. There should be almost no arm movement whatsoever when you first start out, to get the mechanics of the spin right. To practice, grab a hold of your arm and practice launching the cards with wrist movement alone. After practicing and being able to throw cards without missing, you could try moving your arms for extra speed."
    },
    {
      "title": "Flick your wrist forward.",
      "content": "Flick your wrist forward. Unwind, keeping your arm as straight and level as possible relative to the ground to keep the card from wobbling side to side, and snap your wrist forward to throw the card. In general, you can practice just using your wrist to toss the cards accurately, much as in the overhand throw. The mechanics are much the same, just oriented in a different direction. It's still all in the wrist, but the power comes from your elbow."
    },
    {
      "title": "Release the card.",
      "content": "Release the card. When your fingertips are pointing at the target you want to hit, let the card go with a final vigorous flick of your wrist, extending your fingers quickly and straight to release the card and get it spinning in the direction you want. It'll take some practice to get the whole maneuver put together correctly, but learning to throw accurately involves a careful attention to the details."
    },
    {
      "title": "Focus on spin.",
      "content": "Focus on spin. A card thrown accurately moves on the motion of its spin. Cards don't fly through the air stock straight like when Gambit throws them in an X-Men comic. To get the most sticking power and accuracy out of your throws, spin the card as much as possible. Practice extending your wrist and your fingers in one fluid motion, as quickly as possible. At the apex of your toss, speed up your motion just slightly, really putting some flick into your wrist. This'll be the difference between a lame duck and a cutting card."
    },
    {
      "title": "Aim at an appropriate target.",
      "content": "Aim at an appropriate target. Popular targets for card-throwing involve a lot of Styrofoam and fruit. Experienced card throwers can stick a playing card into a potato from several paces away, and melons, apples, Styrofoam backing, cardboard, and other surfaces. Practice tossing until you can get the corner to stick in firmly. Don't throw cards at anyone's face or body. Even if you're not throwing with much power yet, a card in the eye can be extremely dangerous. Be very careful and only practice by throwing cards at appropriate targets."
    },
    {
      "title": "Experiment with different grips.",
      "content": "Experiment with different grips. There's no one correct way of throwing cards, so practicing will be a matter of experimenting with different grips and techniques and seeing what works right for you. Try picking your favorite parts of each technique and welding them together into your own hybrid style of throwing. Make it work for you. Watch Ricky Jay throw cards on YouTube to watch closely the kind of motion he uses and the snap he gets into his cards. Go see a magician or card expert in action to learn more and pick up all the tricks of the trade you can."
    },
    {
      "title": "Build strength in your wrist",
      "content": "Build strength in your wrist . To get better at any sleight-of-hand tricks, especially card throwing, it's a good idea to spend some time building dexterity and strength in your wrists and forearms. The stronger your wrists and hands, the better and more accurately you'll be able to throw cards. It's a good idea to stretch out your wrists after you throw cards, and to loosen them up before. To do this, get down on your knees and put your palms flat on the ground, curling your wrists around so your fingers are pointing back at yourself. Stretch out your wrists by bringing your butt toward the ground and keeping your palms flat."
    },
    {
      "title": "Use new cards.",
      "content": "Use new cards. It's much easier to throw new, stiff, crisp cards, than old ones that you've been playing rummy with for years. If you want to make it easy on yourself, get some new good-quality cards that'll stand up to throwing, and replace them regularly to get the most accuracy and power out of your throws."
    }
  ]
}