{
  "url": "https://www.wikihow.com/Tell-if-One-Leg-Is-Shorter",
  "title": "How to Tell if One Leg Is Shorter",
  "steps": [
    {
      "title": "Understand that most LLD are caused by a problem with the connective tissues and muscles.",
      "content": "Understand that most LLD are caused by a problem with the connective tissues and muscles. Favoring a leg can develop structures differently, resulting in what appears to be uneven legs."
    },
    {
      "title": "Lay on your back with your legs straight out and your arms at your sides.",
      "content": "Lay on your back with your legs straight out and your arms at your sides. Rock your hips from side to side gently for about a minute. This should help relax your hips, back and legs. [1] X Research source"
    },
    {
      "title": "Ask a friend to grab your ankles from the bottom.",
      "content": "Ask a friend to grab your ankles from the bottom. Their thumbs can be near the top shin, and their other fingers should grasp right above your heel. [2] X Research source"
    },
    {
      "title": "Ask the friend to perform light traction.",
      "content": "Ask the friend to perform light traction. They should lift and pull toward themselves gently for about 15 seconds. Repeat once. [3] X Research source"
    },
    {
      "title": "Have the person compare the positioning of the anklebones.",
      "content": "Have the person compare the positioning of the anklebones. If they are about even, it is likely the legs are a similar length. Move on to other tests in the next section. [4] X Research source"
    },
    {
      "title": "Do some range of motion exercises in your lower extremities if either of these tests come up with a discrepancy.",
      "content": "Do some range of motion exercises in your lower extremities if either of these tests come up with a discrepancy. Start with a pelvic exercise. Lie on your back and bend your knees one at a time. Lift your feet up and wrap your arms between your thighs and calves. Lift your knees toward you by tucking your pelvis and release. Repeat 15 times. [5] X Research source Move to your hips. Lay on your side with a chair just over your feet. Bring one foot up to rest on the chair. Lift your other leg carefully up to meet the bottom of the chair. Be sure to hold a solid position with the rest of your body by engaging the abs. Repeat 20 times. Then, switch sides. [6] X Research source Work on your knees. Sit in a chair with your knees and legs bent at a 90-degree angle. Lift one leg until it is straight and hold for five seconds. Lower it slowly. Repeat 10 times and then move to the next leg. [7] X Research source Move to your soleus muscles. Sit in a similar way in your chair. Place a weight on top of each thigh. Lift your heel until you are on your toes, keeping your foot from rocking left or right. Slowly lower it to the ground. Repeat 10 times and then switch legs. [8] X Research source"
    },
    {
      "title": "Repeat the tests you and your friend just performed, starting out with hip rocking.",
      "content": "Repeat the tests you and your friend just performed, starting out with hip rocking. Then, do traction and test for leg symmetry. Your leg and back muscles may be looser and less likely to look off balance. [9] X Research source"
    },
    {
      "title": "Move on to additional leg length testing if this didn’t release muscles and change the look of your leg lengths.",
      "content": "Move on to additional leg length testing if this didn’t release muscles and change the look of your leg lengths."
    },
    {
      "title": "Find a friend who would like to assist with the tests.",
      "content": "Find a friend who would like to assist with the tests. Eventually these tests should be completed by a doctor or physical therapist, who will be able to suggest treatments or other tests."
    },
    {
      "title": "Lay in a supine position on your back with your legs extended.",
      "content": "Lay in a supine position on your back with your legs extended. Arms should rest at your sides."
    },
    {
      "title": "Rock your hips from side to side for 15 seconds.",
      "content": "Rock your hips from side to side for 15 seconds."
    },
    {
      "title": "Have your friend perform gentle traction on your legs.",
      "content": "Have your friend perform gentle traction on your legs. They should grasp the ankles, lift the legs and pull gently away for 15 to 30 seconds."
    },
    {
      "title": "Compare the anklebones by placing the thumbs directly over them and seeing if the thumbs are at an even level.",
      "content": "Compare the anklebones by placing the thumbs directly over them and seeing if the thumbs are at an even level."
    },
    {
      "title": "Flex the feet to see if the soles of the feet match up.",
      "content": "Flex the feet to see if the soles of the feet match up."
    },
    {
      "title": "Sit up and extend your legs.",
      "content": "Sit up and extend your legs. Test to see if the anklebones and soles match up. If they don’t, there may be a discrepancy in the legs."
    },
    {
      "title": "Bend your knees and bring them to the exact same position on the bed.",
      "content": "Bend your knees and bring them to the exact same position on the bed. The friend can test to ensure the feet are even. Compare the height of the knees. If one knee is higher than the other, it indicates a long or short femur bone."
    },
    {
      "title": "Visit a doctor to repeat these tests with a trained professional.",
      "content": "Visit a doctor to repeat these tests with a trained professional. You may need to undergo x-ray tests to prove a leg discrepancy. Your LLD may be treated with a lift or physical therapy. [10] X Research source"
    }
  ]
}