{
  "url": "https://www.wikihow.com/Treat-Mites-and-Lice-in-Guinea-Pigs",
  "title": "How to Treat Mites and Lice in Guinea Pigs",
  "steps": [
    {
      "title": "Don't use flea medication.",
      "content": "Don't use flea medication. Most flea medications have ingredients that make them poisonous to guinea pigs. If you suspect that your pig has lice or mites, don't just use flea medication on them. Take them to the vet instead. [2] X Research source"
    },
    {
      "title": "Get a shampoo or spray for static mites.",
      "content": "Get a shampoo or spray for static mites. If your guinea pig has static mites – which makes it look like your pig has dust in their fur – you'll need a special spray or shampoo. You should take your pig to the vet to find out for sure what type of mites it has. If your vet determines that it's static mites, they can give you the shampoo or spray you need. [3] X Research source"
    },
    {
      "title": "Use a shampoo with ivermectin for sarcoptic mange.",
      "content": "Use a shampoo with ivermectin for sarcoptic mange. Guinea pigs with sarcoptic mange need treatments that get to where the mites are under the pig's skin. Take your guinea pig to the vet to determine if they have sarcoptic mites and get the right type of shampoo. [4] X Research source"
    },
    {
      "title": "Administer an oral de-wormer or injection for sarcoptic mites.",
      "content": "Administer an oral de-wormer or injection for sarcoptic mites. Because sarcoptic mites live under your guinea pig's skin, you'll also need either an oral de-wormer or an injection to treat this condition. Your vet will be able to prescribe the correct de-wormer. Your vet will give the injection if needed. [5] X Research source"
    },
    {
      "title": "Administer oral or injectable meds for lice.",
      "content": "Administer oral or injectable meds for lice. Lice are very contagious, so you want to make sure your pig gets treatment right away. Your vet will likely prescribe an oral or injectable medication. It should be administered two to four times total, with two weeks in between treatments. [6] X Research source If you have more than one guinea pig, you'll need to take them all in to get treated."
    },
    {
      "title": "Replace your pig's bedding every four days.",
      "content": "Replace your pig's bedding every four days. If your guinea pig has been diagnosed with mites or lice, you should remove all of the bedding in their cage. Spray the cage with whatever spray your vet gives you and then replace the bedding."
    },
    {
      "title": "Look for “dust” on your guinea pig.",
      "content": "Look for “dust” on your guinea pig. If you notice that your guinea pig seems to have dust in its fur, it might have static mites. Try blowing or brushing away the dust – if it doesn't move, your guinea pig likely has static mites. [7] X Research source"
    },
    {
      "title": "Check for bald patches.",
      "content": "Check for bald patches. If your guinea pig has bald patches and is biting its skin, it likely has sarcoptic mites. These mites burrow under your guinea pig's skin and cause itching and pain, which your pig will try to get rid of by biting their skin. Take your pig to the vet right away if you notice this behavior."
    },
    {
      "title": "Use clear tape on your pig.",
      "content": "Use clear tape on your pig. If you notice that your guinea pig is scratching a lot, you can use clear tape to see if there are lice on your pig. Press a strip of tape onto your pig's back and then pull it off and look at it under a magnifying glass. You should be able to see some lice or eggs on the tape. Even if you don't see lice under a magnifying glass, take your guinea pig in any way. The vet will have more powerful – and better – ways of diagnosing your guinea pig."
    },
    {
      "title": "Bathe your guinea pig regularly.",
      "content": "Bathe your guinea pig regularly. You should bath your guinea pigs once every one to two months. Use a guinea pig shampoo, which you can find in most pet stores. If you have multiple pigs, you should bathe them more often. [8] X Research source"
    },
    {
      "title": "Use anti-mange shampoo.",
      "content": "Use anti-mange shampoo. The anti-mange shampoo will help to prevent your pig from getting sarcoptic mites. The treatment for sarcoptic mange, caused by sarcoptic mites, is pretty intense, with multiple treatments and lots of potential pain for your pig, so prevention is a really good idea. [9] X Research source If you are introducing a new guinea pig to an established cage, wash it with this shampoo before introducing it to its cage mates, just in case it is carrying any mites."
    },
    {
      "title": "Clean your guinea pig's cage regularly.",
      "content": "Clean your guinea pig's cage regularly. You should replace your pig's bedding every week or so. When you replace the bedding, make sure you wipe down your pig's cage, too. Keeping your guinea pig's home clean will help prevent mites and lice. Bedding can sometimes carry mites. To prevent this, freeze the bedding for 24 hours before you use it in your guinea pig's cage. Make sure that it thaws completely before use."
    },
    {
      "title": "Lower your guinea pig's stress.",
      "content": "Lower your guinea pig's stress. A stressed guinea pig may be susceptible to worse infestations since its immune system is weaker. Try to reduce any sources of stress in the cage. [10] X Research source Keep the cage in a quiet part of the house where the guinea pig will not be bothered by other pets. Avoid overhandling your guinea pig. Make sure that it has plenty of time to unwind after a play session. Guinea pigs are social creatures. They will be happier and more relaxed if they have another guinea pig living with them."
    },
    {
      "title": "Give the guinea pig plenty of Vitamin C.",
      "content": "Give the guinea pig plenty of Vitamin C. Vitamin C can help boost your guinea pig's immune system and help it fight off mites more effectively. You can add a Vitamin C supplement to its water or feed it foods like citrus and leafy greens. You can also buy Vitamin C enriched pellets to supplement its diet."
    }
  ]
}