{
  "url": "https://www.wikihow.com/Throw-a-Curveball",
  "title": "A Step-by-Step Guide to Throwing the Perfect Curveball",
  "steps": [
    {
      "title": "Grip the ball between your thumb and middle finger.",
      "content": "Grip the ball between your thumb and middle finger. As Price instructs, place your middle finger along the bottom seam of the baseball and your thumb along the back seam. Leave your index finger off the ball. [1] X Expert Source Jim Price Baseball Coach Expert Interview. 22 July 2022. Hold the baseball such that the curves of the seams are close to your palm, with one on top and one on the bottom of your palm. [2] X Research source As Hess advises, for right-handed people, place your middle finger on the top right seam and your thumb on the bottom left seam. Lefties, do the opposite. [3] X Expert Source Isaac Hess Baseball Coach & Instructor Expert Interview. 14 April 2020. Instead of using your index finger to grip the ball, you'll be using it to point at where you want the ball to go."
    },
    {
      "title": "Keep your grip hidden in your glove.",
      "content": "Keep your grip hidden in your glove. If the hitter knows you're about to throw a curveball, they'll be prepared for the change in speed and drop. Hide your pitch until you wind up to throw it to surprise them. [4] X Research source Cover your hand gripping the ball with your glove, so no one on the other team can see what you’re about to throw. The basic curveball grip can be easy for experienced hitters to spot, even during the wind-up. Practice hiding your grip so your curveballs are harder to read. Similarly, you can also hide the ball by angling your body differently before you throw the pitch. [5] X Research source"
    },
    {
      "title": "Wind up for the pitch by lifting your non-dominant knee to your chest.",
      "content": "Wind up for the pitch by lifting your non-dominant knee to your chest. Place your dominant foot on the rubber. Lift your opposite knee and rotate your hips forward as you throw the ball. Level your elbow with or above your arm, bent at a 90-degree angle. This is similar to how you’d throw a traditional fastball . [6] X Research source A basic, four-seam fastball will have your middle and pointer fingers on top of the ball on the seam that runs left and right across the ball when the ball is facing you. For a fastball, your thumb is directly on the smooth leather of the bottom of the ball, in between the seams."
    },
    {
      "title": "Snap the release to throw the pitch.",
      "content": "Snap the release to throw the pitch . Keep your palm facing inward towards your body, and release the ball as your arm extends and you step forward with the opposite foot. As your arm comes down from the throw, bring it toward your opposite hip. [7] X Research source Snap quickly from top to bottom rather than moving your hand in an arc across your body. The harder the snap, the more bite or action you'll have on the ball. When you release the ball, rotate your thumb up and middle finger down as though you were going to snap your thumb and middle finger together. The ball will move in the direction your middle finger is pointing. Never twist your wrist when throwing a curveball. Keep your wrist stiff. When releasing, rotate your arm downward as if doing a karate chop or shaking someone’s hand. [8] X Research source"
    },
    {
      "title": "Practice, practice, practice!",
      "content": "Practice, practice, practice! As Hess says, practicing is the best way to improve your ability with a curveball. [9] X Expert Source Isaac Hess Baseball Coach & Instructor Expert Interview. 20 March 2020. Master the basic curveball and its form before you move on to more complicated versions. Remember, the spinning action of the throw is achieved by gripping the ball without pressure from the index finger and snapping as the ball is released. Keep this movement in mind as you throw, and keep practicing to get it just right. When practicing curveballs, focus more on its curve than throwing a strike. Once you've mastered the curve, you can work on accuracy."
    },
    {
      "title": "Grip the ball between your thumb, forefinger, and middle finger like a classic curveball.",
      "content": "Grip the ball between your thumb, forefinger, and middle finger like a classic curveball. Grasp the ball with the bottom seam between your index and middle fingers, and place your thumb along the back seam. Hold the baseball so that the curves of the seams are close to your palm, with one on top front and one on bottom rear of the ball. [10] X Research source The “front” of the ball refers to the part traveling away from you when thrown, while the “rear” refers to the part facing you after the ball is thrown. For right-handed people, place your middle finger on the right seam on top and your thumb on the left seam on the bottom. If you’re left-handed, do the opposite."
    },
    {
      "title": "Keep your hand position hidden in your glove.",
      "content": "Keep your hand position hidden in your glove. As with most pitches, make sure your grip isn't visible to the other team. [11] X Research source Hide your hand behind your glove until you wind up to throw the pitch. This way, the batter won’t be able to tell what pitch you’re about to throw. If you have difficulty hiding your pitch before the wind-up, try positioning your ball as deeply in your mitt as possible before taking your grip."
    },
    {
      "title": "Wind up for the pitch by bringing your non-dominant knee up.",
      "content": "Wind up for the pitch by bringing your non-dominant knee up. Put your dominant foot on the rubber in a parallel position. Lift your opposite knee and rotate your hips forward as you throw the ball. Level your elbow with or above your arm, bent at a 90-degree angle. [12] X Research source Use your index finger to point at the target. As with the basic curveball, use your index finger to point where you want the ball to go. This time, though, it'll also help steady your middle finger."
    },
    {
      "title": "Release the ball with a snap as you throw.",
      "content": "Release the ball with a snap as you throw. Keep your palm facing inward toward your body, and release the ball as you step forward with the opposite foot. As your arm comes down from the throw, snap it toward your opposite hip. [13] X Research source As you release the ball, rotate your thumb upward and your middle finger downward, as though you were snapping your thumb and middle finger together."
    },
    {
      "title": "Try modifying your grip to confuse the batter.",
      "content": "Try modifying your grip to confuse the batter. If you slightly change the positioning of your fingers, you can change how the ball breaks, confusing the hitter even more. Regular curve balls are known as 12-6 throws because the ball breaks in the angle formed by the 12 and 6 numbers on a clock. [14] X Research source Try these variations to make your throw break differently: A 12-6 curveball breaks downward more sharply. Place your index and middle fingers between the seams and your thumb on the bottom of the ball. Release the ball as your hand passes your head instead of following the arm motion all the way through to do an abbreviated snap. To account for the sharp break, throw a 12-6 higher than you would a normal curveball. [15] X Research source A 10-4 curveball starts up and close to the hitter, then breaks low and away. Start your grip as you would for a traditional curveball, then slide your index and middle fingers down toward your thumb. Place the majority of the pressure on your middle finger, and turn your wrist outward from your body as you throw. [16] X Research source"
    },
    {
      "title": "Grip the ball with a bent index finger at the seam.",
      "content": "Grip the ball with a bent index finger at the seam. Hold the ball with your middle finger along the bottom seam and your thumb along the back seam. Grasp the baseball so that the curves of the seams are close to your palm, with one on top and one on the bottom. Bend your index finger inward before laying it on the ball, so your nail and top knuckle are resting on the ball and your middle knuckle is pointing at the target. [17] X Research source For right-handed people, place your middle finger on the right seam on top and your thumb on the left seam on the bottom. If you’re left-handed, do the opposite. Getting comfortable with a knuckle curveball grip can take practice. Acclimate yourself to how it feels by practicing the grip without throwing the ball. [18] X Research source This kind of curveball is considered more advanced than other kinds, so don’t be discouraged if it takes some time to master! Price suggests that this type of pitch can also be called a spike ball and gives you a tighter spin on the pitch. [19] X Expert Source Jim Price Baseball Coach Expert Interview. 22 July 2022."
    },
    {
      "title": "Use your index knuckle to point at your target.",
      "content": "Use your index knuckle to point at your target. As with the straight curve, your index finger points at the target and steadies your middle finger, but the bent knuckle will help give the pitch more torque. Look at the batter and level the ball (and your index knuckle) to them. This will help your ball curve towards them."
    },
    {
      "title": "Keep your grip hidden in your baseball glove.",
      "content": "Keep your grip hidden in your baseball glove. With a knuckle curveball, this is extra important since your finger placement makes it more obvious at a glance. Make sure the ball is deep in your glove before taking hold of it with the knuckle curveball grip. Once you get the hang of the grip, aim to point the ball at the batter or your target while the ball is hidden in your glove. This way, the batter will be even more surprised about the throw. [20] X Research source"
    },
    {
      "title": "Wind up the ball to prepare for the pitch.",
      "content": "Wind up the ball to prepare for the pitch. Place your dominant foot on the rubber in a parallel position. Then, lift your opposite knee and move your hips forward as you throw the ball. Level your elbow with or above your arm at a 90-degree angle (same as a normal fastball pitch). [21] X Research source"
    },
    {
      "title": "Snap the release as you throw the ball.",
      "content": "Snap the release as you throw the ball. Keep your palm facing toward your body and begin releasing the ball as you step forward with the opposite foot. Let go of the ball shortly after it passes your head. As your hand comes down, snap it toward your opposite hip, twisting your thumb upward and your middle finger downward to put a spin on the ball. [22] X Research source"
    }
  ]
}