{
  "url": "https://www.wikihow.com/Surprise-Your-Mother",
  "title": "How to Surprise Your Mother",
  "steps": [
    {
      "title": "Spend quality time together.",
      "content": "Spend quality time together. Whether you want to surprise your mother for a birthday, Mothers' Day, or just because, quality time together trumps material gifts every time. Organizing an outing together might not be the most shocking surprise you could possible organize, but it might be the most meaningful. Put your phone away and give your mother some quality time and attention. Talk to her. Listen to her. Be with her. Organize a quiet day together, having afternoon tea at the house and talking. Go for a walk in a nearby park and spend the evening watching family movies, or movies your mother likes. Go through old picture books. It doesn't have to be complicated. Gather photos, old family video, or other trinkets and go through them together. If you're feeling really ambitious, you could edit a family video compilation for her and have the premiere. Go for a walk around an exciting part of town your mother doesn't often visit and show her around, or go on a long hike, bike trip, or run together if your mother is the adventurous type. Take your mother to church, or to visit other relatives she may not get the chance to see often. Whatever you do, just arrange to spend the day–all day–together. Consider buying breakfast or lunch at your mom's favorite restaurant."
    },
    {
      "title": "Clean the house without being asked.",
      "content": "Clean the house without being asked. An excellent way to surprise mom is to make the day less stressful by cleaning up the house, especially if it's not a chore you often undertake without being told to in advance. Even spending a little bit of time tidying up can make a big difference. It'll mean a lot. First make sure she is asleep so she will be surprise when she wakes up. Start in your room to make sure you get that all the way done while you have time. Take your clothes to the laundry and tidy up your belongings, putting things in the right place. Then, move to the living room and other areas to finish as much as you can before your mom sees. If you don't have time to do a serious cleaning, just organizing books, straightening pillows, and picking up can look great. Dishes, garbage, and dealing with recycling are all added bonus steps. Clean up the kitchen, then wipe down the counter tops to give them a little sparkle. If you get the chance, finish by running the vacuum. You'll be the favorite of the siblings."
    },
    {
      "title": "Do some outdoor chores.",
      "content": "Do some outdoor chores. If you've cleaned up indoors, you might move outside to do anything that needs to be done. Cleaning up outdoor toys, or other yard clutter, is a good place to start before moving onto yard maintenance and other tasks. Mowing the lawn is a classic, though it might be more of a favor for dad, depending on how the chores are split up around your house. Depending on the season, raking leaves, shoveling snow, and trimming any bushes around the house can also be a great way of letting your parents take it easy and making the house look great."
    },
    {
      "title": "Organize a family dinner with surprise guests.",
      "content": "Organize a family dinner with surprise guests. It might take some negotiating, but calling up some of your mom's closest friends, or some of your extended family members that your mother enjoys spending time with can be a great way of surprising her for a special occasion, especially if you organize a dinner yourself and don't force her to host. If you’re organizing around mother’s day and the spring weather is nice, make it a picnic. Organize plenty of food and drink and bring your mother to a pre-planned spot where fun guests are waiting. It'll be a great and memorable experience. Plan a simple meal that you can prepare ahead of time and get it ready. Set the table and prepare everything for the evening, so your mother won't need to scramble when surprise guests arrive. Let her talk and visit with them, and take care of the other stuff yourself. Prepare a thoughtful toast before the dinner, as tribute to your mom, if the occasion is right. You'll bring the house down. If a big dinner with friends and family would stress your mom out, keep things simple. Show up with a pizza, six pack of beers, and Tremors 2 on VHS. Have a goofy quiet evening hanging out and joking around, just the two of you."
    },
    {
      "title": "Write her a letter.",
      "content": "Write her a letter. One of the cheapest and most heartfelt ways to tell your mother how much she means to you is to write it down. If you want to surprise your mother with something meaningful, it doesn't need to be any more complicated than a sincere letter. Write down funny memories, stories, and thank you's. Let her know how you feel. Get some nice cardstock that you can fold into a greeting card and decorate it with drawings and funny pictures for added flair. She'll love it. Alternatively, hang little notes all around the house, in places where she’ll be sure to notice. Make each one a separate \"thank you\" for something she does every day that goes unnoticed."
    },
    {
      "title": "Make her a gift.",
      "content": "Make her a gift. Homemade gifts will always trump store-bought things. Making your mom a little trinket, a card, or a picture is a great and easy way to surprise her and show her that you care. [1] X Research source Weave a simple bracelet or necklace, or get more complicated with crocheting or knitting , if you're feeling ambitious. Collect a bunch of drawings that you've made and bind them into a book. Dedicate it to her and give her the one and only copy. Go for a walk and collect flowers, then present her with a bouquet of pretty greenery for the table."
    },
    {
      "title": "Go classic with breakfast in bed",
      "content": "Go classic with breakfast in bed . As long as you don't make a racket and burn the toast, one of the best ways to surprise your mom is preparing breakfast in bed. Set an alarm to get up at least an hour before your mother typically wakes and get the coffee going. The trick to pulling off the breakfast in bed is going simple. It's probably not a good idea to try eggs Benedict, which is difficult and messy to eat, and it takes a long time to make. Try running out for some fancy pastries the night before and hiding them, so you can surprise mom in bed with coffee and croissants. Even making some cinnamon toast or making up a fruit salad can be a great breakfast."
    },
    {
      "title": "Find out what she would never ask for.",
      "content": "Find out what she would never ask for. Moms can be stubborn and selfless. Figuring out what kind of a gift would really knock mom's socks off can be hard to figure out, but surprising her might take doing some digging. Maybe she's always wanted to see Greece, but has never mentioned it. Secret tip: try to get in touch with her old friends, like college roommates, or childhood neighbors. Find out what she always used to talk about doing when she was a young adult. try to find out what she wanted to see, do, and be. Use that to figure out a big surprising gift for her. Use dad for info. Presumably, he should be listening to mom the most. try to figure out what she's interested in lately and keep him from spilling the beans."
    },
    {
      "title": "Buy her a spa package.",
      "content": "Buy her a spa package. If you want to up the ante, sending your mom to a day spa where she can get pampered professionally is hard to beat. Talk to your dad or some of your siblings to find out when she's got a free day that you could schedule for a spa package and organize everything. Look into local options and nearby places that she might enjoy. [2] X Research source If you want to keep things cheap, you can usually pick between the services offered. If she's been stressed lately, a massage might be in order. If she loves getting her hair and nails done, go for the beauty treatment."
    },
    {
      "title": "Have flowers delivered.",
      "content": "Have flowers delivered. Make an order with a local florist and have flowers delivered to your mom's house, or while she's at work. To keep thing cheap, check out specials that the florist is running and try to avoid the major flower-gifting holidays for the best deals. Avoid roses, which are usually super-expensive and less colorful than a seasonal arrangement. Your mom's not a flower fan? Try signing her up for Birch Box, to get an assortment of hand creams, lotions, and other new products delivered in sample-sizes for her to try."
    },
    {
      "title": "Go out for a fancy meal and a show.",
      "content": "Go out for a fancy meal and a show. If your mom gets a kick out of concerts, plays, or other stage shows, organize a night for the two of you so you can take in the city life. Score some tickets ahead of time and book reservations at a restaurant with cocktails and small plates for before the show. You could even schedule a car to take you, so you don't have to worry about a thing. If the idea of three forks and a Broadway show makes your mother cringe, change up the pace. Take her to a juke joint for happy hour, order some wings, then hit up the dollar theatre for a midnight screening of Rocky Horror . Make her feel young."
    },
    {
      "title": "Give her a scrapbook",
      "content": "Give her a scrapbook . If your mom is the nostalgic type, it's hard to beat a professional-looking scrapbook of trinkets, pictures, and memories. A little bit of planning can take your scrapbook up to the next level. Collect old family photographs and get in touch with your grandparents to snag some old pictures of your mom that she might not have seen in a while. Cellphone pics printed out from last week is one thing, but pictures of her from prom? From childhood vacation? That's the ticket. Alternatively, it might be a good idea to set your mom up with scrapbooking supplies of her own if she enjoys little projects. Hook her up with pages, books, pictures, and other supplies and let her organize her own."
    },
    {
      "title": "Get the yard landscaped.",
      "content": "Get the yard landscaped. If your mother lives with a yard, it's likely yard chores are a drag. Even moms with green thumbs aren't crazy about having to mow every week during summer, pick up leaves in the fall, and do other maintenance activities. If your mom's always wanted a garden, but never gotten the chance, you can talk to a local landscape architect to price a professional job and organize it. Even just having the yard mowed and cleaned up could be a nice treat. Make sure a project like this fits in with your mother's actual desires for her house and the yard. You might want to organize and price the project, offer to pay for it, and set things up for a consultation, without actually going through with an expensive landscaping project she might be unhappy with."
    },
    {
      "title": "Get the house cleaned professionally.",
      "content": "Get the house cleaned professionally. While your mom's out, have a professional cleaning service come and tidy up, do a thorough cleaning, and make their escape before your mom gets back. She won't need to be embarrassed about the state of affairs in the family room if she never sees it happen. If you play your cards right, you might even be able to take credit for the cleaning."
    },
    {
      "title": "Organize a family trip.",
      "content": "Organize a family trip. If you want to pull out the heavy surprise artillery, planning out a trip for the family might fit the bill. Road trip to Yellowstone? Disney World? Cruise to the Caribbean? Tour of wine country? Pilgrimage to Comi-Con? Whatever your family's interests, being the one to get the ball rolling on a big trip can cut the stress and up the fun. Alternatively, pool the money up with your siblings and get your dad in on the scheme as well. Organize a solo trip for you mom, to a place she’s always wanted to go, and send her solo to have some quality time by herself."
    }
  ]
}