{
  "url": "https://www.wikihow.com/Wash-Knitted-Blankets",
  "title": "How to Wash Knitted Blankets",
  "steps": [
    {
      "title": "Pick a gentle detergent.",
      "content": "Pick a gentle detergent. When washing a knitted blanket you should use a gentle detergent, especially if the blanket is made of a delicate yarn such as cotton or linen. Some knitters recommend Soak Wash or Eucalan. [1] X Research source"
    },
    {
      "title": "Put your knitted blanket in a mesh laundry bag.",
      "content": "Put your knitted blanket in a mesh laundry bag. If you keep your blanket in a mesh laundry bag while it’s in the washing machine, this will help to protect it from becoming too agitated, felting to other items or catching on anything. [2] X Research source"
    },
    {
      "title": "Machine-wash blankets made of synthetic fibres and pant fibres.",
      "content": "Machine-wash blankets made of synthetic fibres and pant fibres. Knitted blankets made of synthetic material (such as polyester, acrylic and rayon) or plant fibre yarns (cotton and linen) can be safely machine washed unless they are particularly delicate. [3] X Research source You can also find machine-washable wool yarns, but check the label carefully, as most wools need to be hand-washed. [4] X Expert Source Jen Webber Knitting Specialist Expert Interview. 4 August 2020. Be sure to read the label on your blanket or yarn for washing and drying instructions. A chart containing the various symbols found on yarn labels and their meanings can be found here: https://www.allfreeknitting.com/Knitting-Tutorials/Yarn-Care-Symbols-infographic It sometimes requires a few washes for the dye in a knitted blanket to set completely. You might like to wash your blanket without any other items for the first few washes just to be safe. You can also soak the blanket in citric acid to help the dye set. [5] X Research source"
    },
    {
      "title": "Customise your machine wash to your yarn.",
      "content": "Customise your machine wash to your yarn. While many yarns can be machine washed, they shouldn't all be treated identically. If you’re washing a knitted blanket made of plant fibre yarn such as cotton or linen, it’s best to wash it in cold water and on a gentle cycle. [6] X Research source In contrast, synthetic fibres such as acrylic can be washed as normal with your other items."
    },
    {
      "title": "Tumble-dry your knitted blanket.",
      "content": "Tumble-dry your knitted blanket. Synthetic yarns, linen and some cotton yarns can be safely tumble dried. However, linens should be tumble dried on a low temperature. [7] X Research source If you’re unsure what yarn you’re using, or whether tumble drying will be safe, you can air dry your blanket instead. Tumbling your knitting in a mechanical dryer can cause your knots and stitches to come undone, so it's best to lay your knit blankets flat to dry, whenever possible. [8] X Expert Source Jen Webber Knitting Specialist Expert Interview. 4 August 2020."
    },
    {
      "title": "Use a gentle detergent suited to hand washing.",
      "content": "Use a gentle detergent suited to hand washing. Items requiring hand washing need an especially soft touch. Pick a detergent that will be gentle on both the blanket and your hands, and one that is suited for the yarn you're working with. This will enable you to wash your blanket, without damaging its colour, texture or shape. You should be able to find machine-friendly wool washes in the supermarket, as well as gentle, alcohol-free detergents. Baby shampoo is another good alternative for delicate yarns. Soak Wash or Eucalan are also recommended for washing knitted items. [9] X Research source"
    },
    {
      "title": "Hand-wash blankets made of delicate fibres.",
      "content": "Hand-wash blankets made of delicate fibres. If your knitted blanket is made of animal hair yarns such as wool, alpaca and cashmere, or an unidentified yarn, it will need to be hand washed. Delicate cotton yarns should also be hand washed. The label on your blanket or yarn may also provide helpful and specific instructions as to cleaning and drying. A chart containing the various symbols found on yarn labels and their meanings can be found here: https://www.allfreeknitting.com/Knitting-Tutorials/Yarn-Care-Symbols-infographic If you put most yarns in the washing machine, the wool will felt, causing it to shrink. [10] X Expert Source Jen Webber Knitting Specialist Expert Interview. 4 August 2020."
    },
    {
      "title": "Soak the blanket in cold water.",
      "content": "Soak the blanket in cold water. Gently soak the blanket in a large bowl or sink using cold water mixed with detergent. Move it around in the bowl gently, so that the blanket absorbs the water and soap. Be careful not to press on the blanket or agitate it too much - this could stretch it out or felt it to other items. Wash your knitted blanket by itself when washing it for the first time, to ensure the dye is set and it doesn’t stain any other items. If the blanket continues to bleed colour, soak it in citric acid. [11] X Research source"
    },
    {
      "title": "Rinse the blanket.",
      "content": "Rinse the blanket. Rinse your blanket with cold, fresh water until the garment is free of any soapy suds. Be especially careful to not wring out your knitted blanket - this can lead to stretching and felting. Instead, gently squeeze out the water once you’ve finished cleaning the blanket. [12] X Research source"
    },
    {
      "title": "Ventilate woollen blankets.",
      "content": "Ventilate woollen blankets. If you have a woollen blanket, you may like to ventilate it instead of washing it, as wool is a really delicate yarn to wash and takes a long time to dry. Simply shake your woollen blanket and hang it in an area with good airflow. [13] X Research source"
    },
    {
      "title": "Air-dry your knitted blanket.",
      "content": "Air-dry your knitted blanket. Animal hair yarns and delicate cotton yarns need to be air-dried. Gently remove excess water by squeezing the blanket, then roll it up in a towel to absorb leftover moisture. Remove from the towel and allow to dry. [14] X Research source If your blanket is cotton lay it flat on a towel to dry. This will ensure it doesn’t stretch out or become saggy. [15] X Research source If your blanket is woolen, hang it on a clothesline or horizontal clothes rack. You may also like to leave your woollen blanket in direct sunlight for a few minutes, as this helps to counteract any musty odors. However don’t leave it out any longer than this. [16] X Research source You can also shape the blanket as it dries, to make sure that it dries to your liking."
    }
  ]
}