{
  "url": "https://www.wikihow.com/Turn-Off-Dark-Mode-on-Word",
  "title": "5 Simple Ways to Disable Dark Mode in Microsoft Word",
  "steps": [
    {
      "title": "Open Microsoft Word on your PC.",
      "content": "Open Microsoft Word on your PC. If needed, you can download Microsoft Word from Microsoft."
    },
    {
      "title": "Click File.",
      "content": "Click File . This can be found in the top tool-bar, next to Home . [1] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source A new page will open."
    },
    {
      "title": "Click Options.",
      "content": "Click Options . This will be at the bottom-left corner, in the left panel. [2] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source The Word Options window will open."
    },
    {
      "title": "Click the \"Office Theme\" drop-down menu.",
      "content": "Click the \"Office Theme\" drop-down menu. This can be found underneath the header Personalize your copy of Microsoft Office ."
    },
    {
      "title": "Select Colorful.",
      "content": "Select Colorful . This is the default theme for Microsoft Office. The top taskbar will be blue while the rest of the elements will be in Light mode. To make every element white, select White . You can also select Dark Gray or Black (to return to Dark mode). If you want your page to stay white regardless of theme, check the box next to Never change the document page color ."
    },
    {
      "title": "Click OK.",
      "content": "Click OK . This disables dark mode and restores your theme to light mode. [3] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Open Microsoft Word.",
      "content": "Open Microsoft Word. If you don't have Microsoft Word , you'll need to download it into your Mac computer."
    },
    {
      "title": "Click the Word menu.",
      "content": "Click the Word menu. This will be on the top toolbar, between the Apple logo and File . [4] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Preferences.",
      "content": "Click Preferences . You can find this at the top of the menu. [5] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click General.",
      "content": "Click General . This will be underneath the Authoring and Proofing Tools header. [6] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source"
    },
    {
      "title": "Click Turn off Dark Mode.",
      "content": "Click Turn off Dark Mode . Under the Personalize header, you can also select Dark Mode has a dark page color or Dark Mode has a white page color . [7] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Microsoft Word will return to light mode. On newer Macs, you can also click the Apple logo → System Settings… → General → Light . This will apply Light mode to all applications on your Mac, including Microsoft Word."
    },
    {
      "title": "Log into https://www.office.com in a web browser.",
      "content": "Log into https://www.office.com in a web browser. If you want to turn off dark mode in the web version of Microsoft Word , it's easy. Click Sign in to enter your login details. If you have your browser set to dark mode, you can change your browser settings or continue with the steps below to change Microsoft Word only. [8] X Research source"
    },
    {
      "title": "Open a document in Microsoft Word.",
      "content": "Open a document in Microsoft Word. Click Microsoft Word in the left panel, then select a new or existing document."
    },
    {
      "title": "Click View.",
      "content": "Click View . This is in the top toolbar, between Review and Help ."
    },
    {
      "title": "Click Dark Mode.",
      "content": "Click Dark Mode . This looks like a white and black circle. If you're in dark mode, you'll be switched to light mode. To turn on dark mode again, click Dark mode . In dark mode, click Switch Background to toggle the page color between black and white."
    },
    {
      "title": "Open the Microsoft Word app.",
      "content": "Open the Microsoft Word app. This looks like a blue notebook next to a W . Microsoft Word is available for Android in the Google Play Store ."
    },
    {
      "title": "Tap your profile picture.",
      "content": "Tap your profile picture. This will be in the top-left corner, next to Home ."
    },
    {
      "title": "Tap Settings.",
      "content": "Tap Settings . A new window will open."
    },
    {
      "title": "Tap Theme.",
      "content": "Tap Theme . This will be underneath the Display Preferences header."
    },
    {
      "title": "Tap Light.",
      "content": "Tap Light . The Microsoft Word app will return to Light mode. You may need to restart the app to apply the new theme."
    },
    {
      "title": "Open the Settings app.",
      "content": "Open the Settings app. This looks like a cog icon. [9] X Trustworthy Source Microsoft Support Technical support and product information from Microsoft. Go to source Microsoft Word is available for iOS in the App Store , but you'll need to adjust your device settings. There's currently no way to change the Word app alone. Make sure to update your iPhone or iPad ."
    },
    {
      "title": "Tap Display & Brightness.",
      "content": "Tap Display & Brightness . This will be underneath Control Center ."
    },
    {
      "title": "Tap Light.",
      "content": "Tap Light . The Word app will follow your system settings. You'll return to the Light version of Microsoft Word."
    }
  ]
}