{
  "url": "https://www.wikihow.com/Unblock-Facebook",
  "title": "How to Unblock Facebook",
  "steps": [
    {
      "title": "Learn some basic terms.",
      "content": "Learn some basic terms. When it comes to accessing websites that are blocked on your network, there are a few terms that will be useful to have a basic understanding of. Server - This is a computer located somewhere else that is processing your request for a webpage and sending you the data. All websites are stored (hosted) on servers. Proxy - This is a server that acts as a \"middleman\" for your webpage requests. You tell the proxy server what website you want, and then the proxy retrieves the website data and sends it on to you. VPN - VPN stands for Virtual Private Network, and acts like a \"tunnel\" through the internet to a server. This server then handles all of your webpage requests. It is similar to a proxy but much more secure (and costly). Encryption - When you connect to a website using a secure connection, such as with a VPN, your data is scrambled, or \"encrypted\". This prevents someone from intercepting your data and stealing your information."
    },
    {
      "title": "Know the consequences.",
      "content": "Know the consequences. Chances are that Facebook and other sites are blocked for a reason. If you use any of these methods at school, you can face suspension or expulsion if discovered. If you use these methods at work and are found out, you may be reprimanded or terminated."
    },
    {
      "title": "Understand what a proxy website does.",
      "content": "Understand what a proxy website does. A proxy website is a proxy server that is running a website interface. You visit the proxy website and enter in the address you want to access. The proxy server retrieves the information and then transfers it to your browser. Your network only sees the data being sent to and from the proxy website, and not to and from Facebook. [1] X Research source Logging into Facebook using this method is not secure, and should only be used to view pages. If you want to log into your own account, or use any website where you need to log in securely, use one of the other methods in this article."
    },
    {
      "title": "Find a list of proxy websites at home.",
      "content": "Find a list of proxy websites at home. There are lots of websites that list tons of proxy websites you can use, but these are typically blocked by your network administrator. You'll want to visit these listing sites at home so that you can see them. Popular listing sites include: [2] X Research source Proxy.org Web-Proxy-List.co.uk Webproxylist.biz"
    },
    {
      "title": "Make a list of 15 proxies to try.",
      "content": "Make a list of 15 proxies to try. Network administrators are constantly adding new proxies to their block lists, and new proxy websites come out every day. You'll want a decent list of sites to try so that if one is blocked you can try the next."
    },
    {
      "title": "Visit the first proxy site on your list on the blocked network.",
      "content": "Visit the first proxy site on your list on the blocked network. If the proxy website is blocked, try the next one on your list. Continue until you find a proxy site that is not blocked by your network administrator. There's a very good chance that using the proxy website will alert the network administrator, and you may find that same site blocked tomorrow."
    },
    {
      "title": "Enter the Facebook URL into the field.",
      "content": "Enter the Facebook URL into the field. Proxy websites typically have a field that you can enter a website's address into. Type in facebook.com or paste in the address for a Facebook page and click the button to load the site."
    },
    {
      "title": "Browse Facebook.",
      "content": "Browse Facebook. Once you've loaded the site in the proxy, you can start using it. Because the information is being displayed through the proxy in your browser, certain elements on the page may not load properly. This usually means that the layout won't look correct, or videos won't play."
    },
    {
      "title": "Sign up for a VPN service.",
      "content": "Sign up for a VPN service. VPN services offer servers that you can connect to which you then process your network traffic. You connect directly to the VPN and all data is automatically encrypted, meaning your network only sees an encrypted connection to the VPN, not any of the sites you visit while connected. You'll need to be able to setup the VPN connection on your computer or mobile device in order to connect to it. This is fine for your own laptop or phone, but may be difficult or impossible on a computer that you don't own. You'll want to pick a reputable VPN service, as you are trusting them with your data. There are free VPN services, but as with any free service if you aren't paying for the product you are the product."
    },
    {
      "title": "Connect to your VPN service.",
      "content": "Connect to your VPN service. The process for this varies depending on the operating system and type of device you are using. You likely won't be able to do this on any device that you do not own, as these functions are typically locked down. Click here for detailed instructions on connecting to a VPN for a variety of different devices . Connecting to a VPN affects all of the internet traffic on your device, including chat programs and video games."
    },
    {
      "title": "Open Facebook in your web browser.",
      "content": "Open Facebook in your web browser. Once you are connected, you can open your web browser and browse to Facebook. Since you're connecting to a VPN, it may take a little longer than normal to load websites. As long as you trust your VPN provider, you can log into Facebook without having to worry about your account being compromised."
    },
    {
      "title": "Enable the personal hotspot function on your smartphone.",
      "content": "Enable the personal hotspot function on your smartphone. You must have a cellular plan that supports personal hotspots. This method will share your phone's cellular data connection with the computer you are using, allowing you to bypass the regular network. Click here for instructions on creating a hotspot on an iPhone . Click here for instructions on creating a hotspot on an Android phone."
    },
    {
      "title": "Connect your smartphone to the computer via USB.",
      "content": "Connect your smartphone to the computer via USB. This is the easiest way to share your connection, though you can also turn your device into a wireless access point and connect via Wi-Fi."
    },
    {
      "title": "Select your phone from the computer's Network menu.",
      "content": "Select your phone from the computer's Network menu. Click the Network icon in your System Tray (Windows) or menu bar (OS X) and select your phone. The computer will connect to the phone's network so that it can use the internet."
    },
    {
      "title": "Browse to Facebook on the computer.",
      "content": "Browse to Facebook on the computer. Once the computer has connected to the phone's network, you can use your web browser to open Facebook. Since you're connecting through you're cellular data plan, you are safe to log into Facebook securely."
    },
    {
      "title": "Monitor how much data you are using.",
      "content": "Monitor how much data you are using. When you load a webpage on your computer, it loads the desktop version, which typically requires much more data to be transferred than the mobile version of a website. This can become a problem if you have a low data cap or are close to using your monthly allowance. Click here for instructions on checking your data usage on iPhone . Click here for instructions on checking your data using on Android."
    },
    {
      "title": "Understand the process.",
      "content": "Understand the process. If you have a computer at home that you can leave on while you're at work or school, you can use it to create your own private proxy server. Since you're connecting to your own computer (which you trust), you can safely log into any website that requires a secure login. You can use this method to create a webpage that you can then access from the blocked network, or you can configure a portable browser to connect directly to the proxy server. Both will be covered here. This is by far the most secure method, should bypass most blocks, and won't cost you anything (other than electricity and internet costs for your home computer)."
    },
    {
      "title": "Download and install XAMPP on your home computer.",
      "content": "Download and install XAMPP on your home computer. This is a free, open-source web server program that is easy to install and configure. Click here for detailed instructions on installing XAMPP ."
    },
    {
      "title": "Download and install PHProxy on your home computer.",
      "content": "Download and install PHProxy on your home computer. This is a free, open-source proxy utility for your new webserver. You can download PHProxy from sourceforge.net/projects/poxy/ . Extract the ZIP file that you downloaded and copy the folder to your \"www\" or \"htdocs\" folder in the XAMPP installation directory. This is all you need to do to install PHProxy. Test it out by opening your browser and visiting https://localhost/phproxy/ . If the PHProxy page appears, you've placed the folder in the correct location."
    },
    {
      "title": "Password-protect your PHProxy server.",
      "content": "Password-protect your PHProxy server. If you just let PHProxy server run after installing it, anyone will be able to connect to it and use it, which is bad news. You can use Apache's \".htaccess\" function to create a username and password that will be required to access PHProxy. Click here for detailed instructions on creating an .htaccess file."
    },
    {
      "title": "Open Port 80 for your home computer.",
      "content": "Open Port 80 for your home computer. This is often the most complicated step, as it requires adjusting your router's settings, and the process varies from router to router. Ports control the flow of data into and out of your network. In order to connect to your server from another location, you'll need to open port 80 to allow incoming connections. Click here for detailed instructions on opening ports . You will need to know the IP address of your home computer when opening the port ."
    },
    {
      "title": "Find your home network's public IP address.",
      "content": "Find your home network's public IP address. This is the address that identifies your network on the internet, and you will use it to connect to your server from another location. You can quickly determine your public IP address by opening Google on your home computer and typing my ip ."
    },
    {
      "title": "Connect to your proxy server from another computer.",
      "content": "Connect to your proxy server from another computer. Now that everything is configured and you know your home network's public IP address, you can connect to your proxy through any web browser. [3] X Research source Type https:// homeIPaddress /phproxy , replacing homeIPaddress with your home network's public IP address. Enter your username and password that you specified in the .htaccess file. Once you load PHProxy in your browser, you can use it to access any blocked sites, including Facebook. Since you're connecting through your home computer, you can securely log in to any site that requires a username and password."
    },
    {
      "title": "Use a portable browser (optional).",
      "content": "Use a portable browser (optional). You can configure a portable web browser to connect directly to your PHProxy server. This will allow you to use all of the browser functions without having to connect through the PHProxy website interface. A portable browser can be placed on a USB drive, which you can then plug into any computer to use. Download Firefox Portable from portableapps.com . Run the setup file and choose your USB drive as the installation location. Launch Firefox from your USB drive and click the Menu (☰) button. Select \"Options\" and then click the \"Advanced\" section. Click the Network tab and then click Settings... Select \"Manual proxy configuration\" and then enter your PHProxy information. Enter the PHProxy address into the \"HTTP Proxy\" field and make sure the Port is set to 80. Check the \"Use this proxy server for all protocols\" box. Run the portable Firefox on any computer to automatically connect directly to your PHProxy server."
    }
  ]
}