{
  "url": "https://www.wikihow.com/Use-Kohl%27s-Cash",
  "title": "How to Use Kohl's Cash",
  "steps": [
    {
      "title": "Look for Kohl’s Cash promotional periods.",
      "content": "Look for Kohl’s Cash promotional periods. You can only earn Kohl’s Cash during certain promotional periods, although these usually happen frequently. To find out when Kohl’s is running a promotion, check its website, look for flyers in the mail, or look for advertisements in Kohl’s stores. [1] X Research source"
    },
    {
      "title": "Make the required purchases at Kohl’s.",
      "content": "Make the required purchases at Kohl’s. To earn Kohl’s Cash rewards, you typically have to make purchases in a Kohl’s store or through its website that total over a certain dollar amount. You can earn $10 in Kohl’s Cash for every $50 you spend in store or online. [2] X Research source The rewards keep stacking up. For instance, with this promotion, if you spend $53 dollars, you can get $10 in Kohl’s Cash. If you spend $102, you can get $20 dollars in Kohl’s Cash. There are usually some restrictions on the purchases that count toward earning Kohl’s Cash. For instance, sale and clearance products will probably not count toward the purchase amount threshold you need to meet or exceed in order to earn the rewards. Kohls may round purchases of at least $48 dollars up to $50 so that you can still earn the $10 in Kohl’s Cash. Ask a cashier for details."
    },
    {
      "title": "Receive your Kohl’s Cash rewards.",
      "content": "Receive your Kohl’s Cash rewards. If you are shopping in a brick-and-mortar Kohl’s store, the cashier can just hand you certificates for the Kohl’s Cash you have earned. If you are shopping online, your Kohl’s Cash will be sent to you at the email address you used during the checkout process. [3] X Research source If you use the Kohl’s app, the email you receive will provide instructions on how to add the Kohl’s Cash you have earned to your wallet, if you want to."
    },
    {
      "title": "Have your Kohl’s Cash ready to use in-store or online.",
      "content": "Have your Kohl’s Cash ready to use in-store or online. You will need to hang onto your Kohl’s cash, whether you received it as a physical certificate, an email, or an entry in your Kohl’s app Wallet. You’ll need to show your Kohl’s Cash to a cashier or enter a unique code online if you want to use the rewards. [4] X Research source Keep the physical certificates in a safe place if you plan on using them. If you have an emailed Kohl’s Cash certificate, you can show the barcode to a cashier or print the certificate out. Kohl’s Cash stored via the Kohl’s app should show up automatically, but double-check your app to make sure it’s there before attempting to use it."
    },
    {
      "title": "Make purchases at Kohl’s.",
      "content": "Make purchases at Kohl’s. To use your Kohl’s Cash, you’ll have to return to a Kohl’s store or shop on its website. The Kohl’s Cash amount you have will be applied to the total amount of your purchase, reducing it overall. For instance, if you buy $67 worth of merchandise at a Kohl’s store and have $10 in Kohl’s Cash, your total will be reduced to $57! [5] X Research source If you are shopping in a brick-and-mortar store, make sure to let the cashier know you want to use your Kohl’s Cash. If you are shopping on Kohls.com and want to use your Kohl’s Cash, you will have to enter the 15-digit code and 4-digit PIN printed on the rewards certificate or email when prompted to during the checkout process. If you are shopping from the Kohl’s App, any Kohl’s Cash you have stored there will be applied automatically to your purchase."
    },
    {
      "title": "Check your Kohl’s Cash balance.",
      "content": "Check your Kohl’s Cash balance. You don’t have to use all of your Kohl’s Cash at once. To find out your remaining balance, go to the bottom of the Kohls.com website and look for the \"My Account\" tab. Click on \"Gift Card Balance and Kohl's Cash Balance\" and follow the prompts. [6] X Research source Your Kohl’s Cash balance will also be stated on your Kohl’s App account, if you use it."
    },
    {
      "title": "Combine Kohl’s Cash with discounts.",
      "content": "Combine Kohl’s Cash with discounts. Kohl’s Cash isn't actually cash, but it isn't as restricted as many coupons are, either. This means that you can typically use it in combination with sales, coupons, and other discounts that are available. Reap the savings! [7] X Research source However, certain brands or items may be excluded for various reasons. Check with Kohl’s customer service if you ever have a question about what the final price of an item will be. Kohl’s Cash will be applied first to your order, before any other discounts. For instance, imagine you are shopping during a promotion to get 10% off your total purchase. If your initial total is $70 and you have $10 in Kohl’s Cash, your final total will be $54 ($70-$10 = $60; 10% x $60 = $6; $60-$6 = $54)."
    },
    {
      "title": "Return purchases if needed.",
      "content": "Return purchases if needed. You are allowed to return purchases made using Kohl’s Cash. You will be refunded the cost you paid for the returned item (that is, the store price minus any discounts you received), and given a new Kohl’s Cash certificate that must be used within 30 days. [8] X Research source You can also return purchases you made that earned Kohl’s Cash. However, your Kohl’s Cash balance will be reduced by a corresponding amount. If you return an item you purchased that earned Kohl’s Cash, and you have already used the Kohl’s Cash, then the refund you receive for the returned item will be reduced by the amount of Kohl’s Cash that you earned and used. For instance, imagine you bought a coffee maker for $65, and you earned $10 in Kohl's Cash. You use that Kohl's Cash on a future purchase of a $32 shirt to bring its cost down to $22. If you decide to return the coffee maker, you will only receive $55 (the original price minus the $10 in Kohl's Cash you already used on the shirt)."
    },
    {
      "title": "Use your Kohl’s Cash before it expires.",
      "content": "Use your Kohl’s Cash before it expires. Kohl’s Cash that you receive as a certificate or electronically will have a stated expiration date. If you don't use the rewards by that date, unfortunately the Kohl’s Cash will no longer be valid. [9] X Research source"
    }
  ]
}