{
  "url": "https://www.wikihow.com/Write-a-Screenplay",
  "title": "How to Write a Screenplay",
  "steps": [
    {
      "title": "Brainstorm premises for your story using “what if” statements.",
      "content": "Brainstorm premises for your story using “what if” statements. The premise of your screenplay is the core of your story, so choose an idea that you’re excited to pursue. Frame your premise as a “what if” question to help you pick out some of the central conflict. [1] X Research source Look for inspiration from your own life, the news, books, or even from other movies so you can find something that really sparks your interest. [2] X Research source For example, the question “What if Peter Pan grew up and forgot about Neverland?” is the premise for the movie Hook . As another example, the question “What if an ordinary boy found out he was actually a powerful wizard?” is a good premise for Harry Potter . Write your ideas on a notepad or on your phone whenever they come to mind. You never know when inspiration will strike."
    },
    {
      "title": "Choose a protagonist and antagonist for your story.",
      "content": "Choose a protagonist and antagonist for your story. The protagonist is the main character of your story and who the audience should root for throughout your script. Provide your character with an overarching goal to achieve by the end, but give them a personality flaw they need to overcome to reach it. [3] X Research source Conversely, the antagonist should actively try to foil your protagonist’s plans. Brainstorm a character that directly goes against your main character’s goal to keep your villain interesting. [4] X Research source For example, in Die Hard , John McClane wants to save his wife and the hostages held captive by Hans Gruber. Your antagonist doesn’t have to necessarily be another character. It can also be a monster or the wilderness. For example, in The Revenant , the main character must survive harsh winter weather to make it back to his camp."
    },
    {
      "title": "Give your story constant conflict to create your character’s arc.",
      "content": "Give your story constant conflict to create your character’s arc. If your protagonist easily gets what they want right at the beginning of your story, your screenplay won’t be as interesting as it could be. Brainstorm your protagonist’s goal and the steps they need to take to get there. Then come up with conflicts that challenge your character and push them out of their comfort zone. These conflicts can be from your antagonist or poor decisions your character makes. By the end of your script, let your character reach their goals but go through some changes along the way. [5] X Research source Have your protagonist fail frequently to make them more believable and add some additional conflict. Let your character start in a place where they’re comfortable but needing something that pushes them into unfamiliar territory. That way, they’ll have to adapt and give things up to get what they want. [6] X Research source"
    },
    {
      "title": "Write a 1–2 sentence logline to summarize your story idea.",
      "content": "Write a 1–2 sentence logline to summarize your story idea. Your logline sells your premise and is what you’ll tell other people to get them excited about your idea. Include your protagonist, their overall goal, and what stands in their way. Workshop a few different ways to write your logline and tell them to a few people to see if they’re interested in your premise. [7] X Research source For example, a logline for the film Ratatouille might be, “A rat who wants to be a chef must work with an amateur cook to avoid being caught by the suspicious head chef.” As another example, the logline for The Lord of the Rings could be, \"A young man, with the help of a small group of friends, must take a ring across the country to defeat an evil ruler.\""
    },
    {
      "title": "Jot down all your scene ideas on separate note cards.",
      "content": "Jot down all your scene ideas on separate note cards. Brainstorm some events or problems that you want your protagonist to encounter throughout your screenplay. Whenever you have a new idea, grab a new notecard and write it down. [8] X Research source Capture the main elements of the scene in about 7 words and print in large letters so they’re easier to read. Aim to have between 40–60 index cards when you’re finished. Some screenwriting software, such as WriterDuet and Final Draft, have digital index cards you can work with. At this stage, no idea is a bad idea. If you think something might be fun or cool to include in your screenplay, write it on a card and worry about if it fits with the story later on. Try using differently colored index cards for separate characters or action sequences so they’re easier to sort through."
    },
    {
      "title": "Organize your scenes in the order you want them in your script.",
      "content": "Organize your scenes in the order you want them in your script. Lay your index cards out on a table or tack them up onto a corkboard so you can see all of the sequences. Rearrange the sequences to see what flows well dramatically from one scene to the next. Since you’re still in the early stages of outlining, feel free to add or remove cards if you need them for your story. [9] X Research source Most movies and shows will be in chronological order of events, but you can try putting in events as flashbacks or flash-forwards to add twists to your movie, such as Eternal Sunshine of the Spotless Mind or Inception ."
    },
    {
      "title": "Break your story into a new act when your character reaches high or low points.",
      "content": "Break your story into a new act when your character reaches high or low points. Film scripts usually have 3 acts that each have multiple sequences. In the setup, or Act I, introduce your story world and protagonist. At the end of Act I, have your character make a decision that pushes them towards their goal and changes their life. During Act II, or the confrontation, show your protagonist working to reach their goal and how the antagonist wants to stop them. Build the end of Act II up to the climactic confrontation between your characters before entering the resolution, or Act III, to wrap up your story. [10] X Research source Act II is usually the longest of the 3 acts and will make up about half of your screenplay. If you’re writing a television script, place your act breaks right where you would cut to a commercial."
    },
    {
      "title": "Set a goal date in 5–6 weeks for when you want to finish your screenplay.",
      "content": "Set a goal date in 5–6 weeks for when you want to finish your screenplay. It’s always easier to work on something when you give yourself a deadline, so it can help keep you focused. Screenwriters usually take about 5–6 weeks to write a script, so aim to finish within that time frame. Mark the deadline on your calendar and set reminders for yourself so you can strive towards your goal. [11] X Research source Ask other people to hold you accountable to your goals to help you feel more motivated to finish on time."
    },
    {
      "title": "Work on 1–2 pages every day.",
      "content": "Work on 1–2 pages every day. Look for some time in your schedules where you can set aside a bit of time to write each day so you can get into a daily routine. Find a place free of distractions and focus solely on your screenplay so you can easily meet your end goal. At a rate of 1–2 pages per day, you can usually have your screenplay done within 2 months. [12] X Research source Don’t get discouraged if you don’t hit your goal every day. Writing can be really tough since it takes a lot of creativity. Even professional writers get stuck from time to time."
    },
    {
      "title": "Give each character a unique voice through their dialogue.",
      "content": "Give each character a unique voice through their dialogue. Use dialogue to help drive your scenes forward and present new information for the characters. Avoid having characters say things that the reader would already know, or else it might seem to on the nose. As you introduce a new character, keep their voice distinct from other characters so they don’t sound alike. [13] X Research source Try covering up the character’s names and guessing which characters are talking passed on their speaking style. If the dialogue all sounds the same, then rework it so each person feels unique."
    },
    {
      "title": "Keep each scene to 3 pages or less.",
      "content": "Keep each scene to 3 pages or less. Always write your scenes to move the story forward in some way, whether that’s through lines of dialogue or character actions. To keep your screenplay exciting and the action moving, determine the main point of the scene you’re writing. Cut the beginning of the scene so you enter at the latest moment possible. End the scene as soon as you can after the main action so the plot moves forward. [14] X Research source It’s okay to break this rule a few times especially during your first draft since you can always revise your scenes later on."
    },
    {
      "title": "Write without going back to edit.",
      "content": "Write without going back to edit. While it can be really tempting to get everything just right on the first pass, try your best not to go back and fix things. Let your ideas flow freely and just write what comes to your head at the moment. Have fun with your creativity and allow yourself to make changes to your story on the fly. [15] X Research source If you have an idea that isn’t in your outline, just include it in your draft. You never know if it will work with the rest of your story until you try it out."
    },
    {
      "title": "Aim to write between 90–130 pages if you’re writing a movie.",
      "content": "Aim to write between 90–130 pages if you’re writing a movie. Think of each page of your screenplay as 1 minute of time on screen as a general guideline. Even though some movies are shorter than 90 minutes and longer than 130 minutes, try to stay within the guidelines for your first script since it will be more widely accepted by professionals. [16] X Research source"
    },
    {
      "title": "Finish a television script between 22–75 pages.",
      "content": "Finish a television script between 22–75 pages. The length of a television episode depends on the genre format you’re writing. If you’re writing an episode for a sitcom, then keep it between 22–45 pages since it will fill a half-hour time slot. If you’re working on a dramatic show, then it’s okay for you to write a 45- to 75-page script so it’s about an hour long. Page lengths for TV scripts are more strictly enforced than feature film scripts."
    },
    {
      "title": "Set your script aside for 2 weeks to get some distance from it.",
      "content": "Set your script aside for 2 weeks to get some distance from it. You just spent a lot of time with your script and characters, so it can feel pretty difficult going back to edit. After you finish, take a break from your script and leave it alone. After about 2 weeks, you’ll have fresh eyes and be able to catch things you may not have seen before. [17] X Research source You can start working on another project right away or just relax and celebrate that you finished a draft."
    },
    {
      "title": "Reread your script to find parts that don’t make sense.",
      "content": "Reread your script to find parts that don’t make sense. Read your script out loud so it’s easier to find your mistakes. Focus on bigger issues first, such as confusing passages, unclear motivations, and themes that don’t quite land how you want them to. As you go through the script, mark or highlight the areas you want to revise. [18] X Research source Avoid focusing on issues like grammar and spelling right away since you can fix those later on."
    },
    {
      "title": "Cut or rework scenes that don’t add something new to the plot.",
      "content": "Cut or rework scenes that don’t add something new to the plot. Every scene in your script should move your character closer to their goal or reveal new information for your protagonist. As you work through each of your scenes, ask yourself how the scene relates back to the overall plot. If you can’t find a good reason to include the scene, then you may not need it in your script. [19] X Research source For example, a character walking home after work doesn’t add anything to the story. However, if the character runs into a romantic interest while they’re walking home, it can add to your character’s story."
    },
    {
      "title": "Read your dialogue out loud to see if it sounds natural and realistic.",
      "content": "Read your dialogue out loud to see if it sounds natural and realistic. Someone will have to perform the dialog you wrote, so act it out yourself to see if it’s easy to say. If you find yourself stumbling over your words or if your dialogue sounds robotic, you may need to rework the phrasing so it’s easier to understand. [20] X Research source For example, a 10-year-old character saying, “I do not think this will work out well,” sounds a little stilted. Instead, you might edit the dialogue to “I don’t think that’s gonna go well.”"
    },
    {
      "title": "Have someone you trust read through your screenplay for feedback.",
      "content": "Have someone you trust read through your screenplay for feedback. It’s always nice to have another set of eyes on your screenplay, so talk to your friends, parents, or teachers to see if they’ll give you feedback. Ask them to pinpoint any issues they see in your script and let them know if you have any specific questions. When they finish reading, ask about what parts were too confusing or hard to follow. [21] X Research source"
    },
    {
      "title": "Continue your rewrites until you’re happy with your script.",
      "content": "Continue your rewrites until you’re happy with your script. It can take a bit of time to perfect your screenplay to get it exactly where you want it, so don’t expect to be finished after 1 or 2 drafts. Keep reworking and revising the screenplay until it’s as clear as possible and ask for feedback after each revision. Even though it may take a bit of time to polish, you’ll be happier with your final script. [22] X Research source Work on revisions in separate documents so you can look at a fresh new page each time. You can still cut and paste bits you like from the old versions into the new ones."
    },
    {
      "title": "Use 12-point Courier font for your entire screenplay.",
      "content": "Use 12-point Courier font for your entire screenplay. Courier is the industry-standard font for screenplays, so avoid using anything else. You can work in a standard word processor, or you can try using software specifically made for screenwriting since it will automatically choose the right fonts and formats. [23] X Research source Popular free screenwriting software you can try includes WriterDuet and Celtx. You can also pay for screenwriting software that has more features, such as Final Draft, Fade In, or Highland."
    },
    {
      "title": "Put your title, name, and contact information on the front page.",
      "content": "Put your title, name, and contact information on the front page. Come up with a title for your screenplay and write it in all caps in the center of the page. Add a line break after the title and type the phrase “written by” in all lowercase. Then put another line break before putting your first and last name. In the bottom-left corner of the page, put your information, like your phone number and a professional email address. [24] X Research source You do not need to include your mailing address on the title page of your screenplay."
    },
    {
      "title": "Write scene headings in all caps when you introduce a new location.",
      "content": "Write scene headings in all caps when you introduce a new location. The scene headings, or “slug lines,” let your reader know where the action of a scene takes place. Start the heading with “INT.” for interior locations and “EXT.” if the scene takes place outside. Then, write the name of the location followed by a hyphen. After that, include the time when the scene takes place using words like “DAY,” “NIGHT,” or “MORNING.” [25] X Research source For example, you may have scene headings like “INT. CLASSROOM - DAY” or “EXT. PARKING LOT - NIGHT.” If you want to specify a room, just add it after the location. For example, you could write, “INT. TYLER’S HOUSE - BEDROOM - NIGHT.” Keep your scene headings 1.5 inches (3.8 cm) in from the left of the page. [26] X Research source"
    },
    {
      "title": "Describe settings and what characters are doing in action blocks.",
      "content": "Describe settings and what characters are doing in action blocks. Use the present tense in your action blocks to give visual details about what’s happening in your scene. Establish the location and let the reader know what your characters are doing. Only focus on what the audience would be able to see or hear in the scene since you can explain them visually. [27] X Research source For example, rather than saying the “The pie smells good,” you could try something like, “Alex walks up to the pie and takes in a big whiff. He licks his lips at the scent, ready to dig in.” Whenever you’re introducing a character for the first time, write their name in all caps and give a brief visual description. For example, you could write, “SYDNEY, 23, walks through campus in baggy sweatpants sipping a coffee.” Keep action lines single-spaced, 1.5 inches (3.8 cm) in from the left, and 1 in (2.5 cm) in from the right."
    },
    {
      "title": "Center character names and dialogue on the page when someone speaks.",
      "content": "Center character names and dialogue on the page when someone speaks. Whenever a character is about to talk, start a new line in the center of the page. Write the character’s name in all caps before adding another line break. Then write down what the character says as dialogue below their name. [28] X Research source If a character isn’t on screen while they’re talking, then put (O.S.) after their name to signify they’re off-screen. Place character names and dialogue 3.7 inches (9.4 cm) and 2.5 inches (6.4 cm) from the left edge respectively. [29] X Research source You can also add parentheticals on the line after a character’s name to convey the mood or tone of their voice. For example, it could say something like “(frightened)” or “(tense).” Keep the parentheticals 3.1 inches (7.9 cm) in from the left margin."
    },
    {
      "title": "Align transitions on the right side of the page.",
      "content": "Align transitions on the right side of the page. Transitions help you move from scene to scene so your reader knows you’re about to change locations. Start a new line at the end of the scene. Use the phrase “CUT TO:”, “DISSOLVE TO:”, or “FADE OUT:” to show how you want to switch from the previous sequence to the next one. [30] X Research source Leave the transitions 1 inch (2.5 cm) from the right edge of the page. Always start the next line after a transition with a new scene heading."
    },
    {
      "title": "Add page numbers to the top-right corner starting on the second page.",
      "content": "Add page numbers to the top-right corner starting on the second page. You don’t need page numbers on your title page or on the actual first page of your script. On the second page of your script, put “2.” in the top-right corner. Keep numbering the rest of the pages the same way. [31] X Research source Keep the page numbers 0.5 inches (1.3 cm) from the top of the page and flush with the right margin."
    }
  ]
}