{
  "url": "https://www.wikihow.com/Style-Scene-Hair",
  "title": "How to Style, Cut, and Dye Scene Hair: Easy Tips & Tricks",
  "steps": [
    {
      "title": "Gather the necessary tools.",
      "content": "Gather the necessary tools. What you need will depend on the natural texture and thickness of your hair. [1] X Expert Source Danielle Chiz Professional Hair Stylist Expert Interview. 3 August 2021. However, here are some items that can be used to create scene hairstyles: Blow-dryer: Blow out curly or wavy hair to make it mostly straight before flat ironing. Flat iron: Necessary to achieve the silky-straight look on the bottom of hair, as well as flattened bangs; can also be used to add curl to the ends of hair. Curling iron or wand: Use it to make bottom strands curly or wavy. Rat-tail or fine-toothed comb: Use to tease, backcomb or \"rat\" hair for volume on top. Hairspray: You'll need this to tease your hair, as well as to set the style. Heat protectant: It's necessary to apply this before blow drying or straightening hair, especially if you do it often. Root lifter or volumizer: If you have thin hair, you can use this to add a bit of volume. Follow the directions on the bottle. Dry shampoo: This can help re-volumize dirty or oily hair if you don't have time to wash it."
    },
    {
      "title": "Straighten your hair.",
      "content": "Straighten your hair. Scene hair is centered on sleek, straight locks that can be thinned down or ratted out. Even if you plan on curling the bottom parts of your hair, you probably want to straighten them first, then curl. [2] X Research source Here are some things to keep in mind: If you have curly or wavy hair, blow dry it 10 or 15 minutes after you get out of the shower. Use a round brush or paddle brush to separate sections, and spray on a heat protectant before you start. After you've blow dried your hair (or if you have mostly straight hair to begin with), spritz on another layer of heat protectant and smooth it out with a flat iron. Work in sections - if your hair is thick, clip up the top portion and work out the bottom first. (You might have to work in 4 or 5 stages if you have ultra-thick hair. Just start from the bottom and keep moving up in manageable sections.)"
    },
    {
      "title": "Tease the top.",
      "content": "Tease the top. Once your hair is straight, you can focus on teasing the top portions so they'll look volumized and big. [3] X Research source Here's how to do it. Put hairspray on the section you want to tease. Don't totally soak your hair with hairspray - one spritz per area should be enough. Grab a section of hair, and backcomb it with a rat-tail or fine-toothed comb. Pull the bottom of the section out and away from your hair, so that it's somewhat horizontal. Then, starting at the end, comb backwards toward the scalp in small sections. Do 3 or 4 combs over one part, then move up. Keep doing this for each piece you want to tease. After you've teased every section you want, set with hairspray."
    },
    {
      "title": "Smooth over teased hair.",
      "content": "Smooth over teased hair. Because the hair that you teased is probably sticking straight up by now, you'll want to smooth it back down so that you have the volume without looking crazy. Use a regular comb to gently comb each section downward."
    },
    {
      "title": "Curl the ends.",
      "content": "Curl the ends. If you want to curl up the ends of your layers (using a flat iron or curling iron), do it after you're finished teasing. You can flip up the ends of your layers, or even curl the longer sections at the bottom of your hair. Do whatever you think looks good!"
    },
    {
      "title": "Add accessories (optional).",
      "content": "Add accessories (optional). If you want to add bows, bobby pins, headbands or other accessories to your hair, now's the time. A lot of girls like to put a cute bow on the side of their bangs, or use bobby pins to put up random sections of hair. Look around the internet for ideas on how to use accessories. See if you can find any blogs or Tumblers that feature scene hair."
    },
    {
      "title": "Make bouffant hair.",
      "content": "Make bouffant hair. Split the hair in parts and clip them up. Put hairspray right on your scalp and then tease each section. Don't fully brush your hair but brush it swiftly and easy. Add more hairspray and you'll be done. If you want your hair to be bigger, use a crimper on the layers you are teasing, but don't crimp the top layer of your hair. Don't crimp a lot but do remember to tease the back too."
    },
    {
      "title": "Know the silhouette.",
      "content": "Know the silhouette. In general, scene hair is full and teased out on top, and thinner on bottom (or on hair that falls lower than your jawbone). The steps in this section can help you get the basic shape of scene hair."
    },
    {
      "title": "Get choppy layers.",
      "content": "Get choppy layers. Scene hair usually features layers, especially to create volume on top. [4] X Expert Source Danielle Chiz Professional Hair Stylist Expert Interview. 3 August 2021. How many layers and where you put them are up to you, but here are some suggestions: [5] X Research source Get short layers in the back and longer layers in front. Keep a long distance between layers, such as having the bottom layer of your hair long, and the next layer situated 3 or 4 inches (7.6 or 10.2 cm) up from that. Cut your layers so that they frame your face."
    },
    {
      "title": "Do big, side swept bangs (or fringe).",
      "content": "Do big, side swept bangs (or fringe). A lot of scene hairstyles for girls and guys have bangs parted far to the side (above the end of one eyebrow) and swooping over the forehead, sometimes even covering the eyebrows. Bangs are usually teased out (see Styling below). [6] X Research source Keep your bangs straight. Though some scene styles feature curls on other parts of hair, the bangs are usually kept straight. See more information on this under Styling."
    },
    {
      "title": "Razor the ends.",
      "content": "Razor the ends. To keep a sharp, angular look on your ends, have them razored or buy a pair of razoring scissors at a beauty supply store. [7] X Research source"
    },
    {
      "title": "Thin the bottom of your hair (optional).",
      "content": "Thin the bottom of your hair (optional). If you have really thick hair, consider asking a stylist to thin out the bottom layer. This will make it easier to style."
    },
    {
      "title": "Use extensions (optional).",
      "content": "Use extensions (optional). If you have shorter hair but want the long scene strands around your shoulders, consider using hair extensions. You can have them applied professionally, or purchase clip-on extensions at a beauty supply store."
    },
    {
      "title": "Add some color to your hairstyle (optional).",
      "content": "Add some color to your hairstyle (optional). You don't have to dye your hair to make it scene, but it's a fun way to express your style. In this section, you'll see some suggestions on where to add dye to your hair; for information on the process itself, see the Related wikiHows at the bottom of the page."
    },
    {
      "title": "Dye the tips.",
      "content": "Dye the tips. Dyeing the tips of your hair along a straight line is called \"dipping\" (because some people actually do dip-dyes). This is a low-risk way to add color to your hair, because if you don't like it, you can always cut it off instead of having to wait for it to grow out. Try doing it in a color that's opposite the rest of your hair (blond tips if you have dark hair, or dark tips if you have light hair), or in a bright color such as blue or purple. [8] X Research source"
    },
    {
      "title": "Add streaks.",
      "content": "Add streaks. Select streaks of your hair to dye a color that contrasts with the rest of your hair. You can do streaks in one color, or in several colors, and make them narrow or wide. If you work or go to school somewhere that doesn't allow you to have dyed hair, streaks might be a good choice. You can place them strategically, so that they won't show up when you put your hair into a ponytail."
    },
    {
      "title": "Dye a whole section of your hair.",
      "content": "Dye a whole section of your hair. A popular scene look is dyeing an entire section of your hair a different color than the rest of it; for example, making your bangs and front layers blond, and keeping the rest of your hair black. For something a little more subtle, you could dye the underside of your hair a bright color, and keep the rest of it a more natural shade. [9] X Research source"
    },
    {
      "title": "Dye all of your hair.",
      "content": "Dye all of your hair. If you want to go all-out, you can dye your entire head of hair a bright color. Note that most unnatural colors are semi-permanent, so you'll have to re-dye regularly to keep the look up. [10] X Research source Black hair is good for any length, on any gender. Try red, blonde or black if you don't want to be too outstanding."
    },
    {
      "title": "Figure out what might look good on you.",
      "content": "Figure out what might look good on you. Try wearing a shirt that's the same color as what you're interested in. If it seems to go well with your skin tone and eyes, it will probably look good in your hair. If it makes you look washed-out and tired, try something else."
    },
    {
      "title": "Pay attention to damage control.",
      "content": "Pay attention to damage control. Dying, straightening and teasing can all cause harsh damage to your hair. In order to keep your scene hair looking stylish and healthy, make sure you take steps to care for it."
    },
    {
      "title": "Use a quality shampoo and conditioner.",
      "content": "Use a quality shampoo and conditioner. Try to find products that are meant for your type of hair (such as oily hair, thick hair, curly hair, and so on). [11] X Research source If you've dyed your hair, buy shampoo that's specifically meant for color-treated locks. It will help your dye job last longer. Also, if you have dyed hair, wash it in water that's as cold as you can stand. Hot water will make your dye fade out faster, as well as making the shade slightly off. If possible, try to find shampoo that doesn't contain sodium lauryl sulfate or sodium laureth sulfate. These compounds are alcohols that dry out your hair."
    },
    {
      "title": "Deep condition your hair once a week.",
      "content": "Deep condition your hair once a week. Schedule a deep conditioning treatment for your hair on the same day every week. Browse around for one that suits your hair type and budget. If you need something simple to start with (and you live in North America), try Aussie 3-Minute Miracle. [12] X Research source"
    },
    {
      "title": "Always use a heat protectant when you blow dry or straighten your hair.",
      "content": "Always use a heat protectant when you blow dry or straighten your hair. Find a product you like, and use it religiously whenever you apply heat to your hair. Your ends will thank you for it."
    },
    {
      "title": "Trim up split ends.",
      "content": "Trim up split ends. The only way to get rid of split ends is to cut them off. If you notice your ends starting to fray, book an appointment with your stylist or trim them yourself. Either way, make sure the cut is high enough to remove all of the damaged hair. [13] X Research source"
    },
    {
      "title": "Wash hair regularly.",
      "content": "Wash hair regularly. You're probably going to use a lot of styling product if you want to have scene hair, and it's important to wash it out. Every other day or every third day should be sufficient. [14] X Expert Source Danielle Chiz Professional Hair Stylist Expert Interview. 3 August 2021."
    },
    {
      "title": "Try volumizing powder.",
      "content": "Try volumizing powder. Instead of damaging your hair further with teasing, a way that's better for your hair is to use a volumizing powder. You can find them online and in stores that sell hair care products. To apply, start by lifting the section of hair you want to tease."
    },
    {
      "title": "Sprinkle on some volumizing powder.",
      "content": "Sprinkle on some volumizing powder."
    },
    {
      "title": "Rub it into your roots.",
      "content": "Rub it into your roots. Rub upwards to help the make the hair full of volume."
    },
    {
      "title": "Repeat these steps for the top layers of your hair.",
      "content": "Repeat these steps for the top layers of your hair. This is a more comfortable way to tease hair."
    }
  ]
}