{
  "url": "https://www.wikihow.com/Trampoline-Games",
  "title": "The Best Games to Play on the Trampoline: 30+ Options",
  "steps": [
    {
      "title": "",
      "content": "Have two players stand on opposite sides of the trampoline (they can stand outside of the trampoline if they prefer). Then, they take turns throwing a ball over the head of the “monkey” in the middle. Whenever the monkey catches the ball, they swap places with whoever threw the ball they caught and play starts over. Number of players: 3+ Equipment requirements: A ball of any kind. Ideal age: 4+"
    },
    {
      "title": "",
      "content": "Divide players into two teams and use a piece of chalk to draw a midline on the trampoline. Then, play a normal game of dodgeball ! Set out 2-5 soft balls on the midline, call out, “Go!” and watch the players rush to the midline to scoop the balls up. Then, players try to hit their opponents to knock them out. Number of players: 4+ Equipment requirements: Soft balls for dodgeball. Ideal age: 8+. Younger kids tend not to have the coordination to play dodgeball effectively and safely."
    },
    {
      "title": "",
      "content": "Players all enter the trampoline and a player from the outside throws a beach ball up into the trampoline. Players work together to keep the ball in the air for as long as possible. You can even mix it up by requiring players to use their heads, elbows, or arms (like a volleyball) only. Number of players: 2+ Equipment requirements: A beach ball. Ideal age: 4+"
    },
    {
      "title": "",
      "content": "Have any number of players get on the trampoline. Then, have someone standing outside of the trampoline throw a soft object (like a ball or a stuffed animal) at one of the players. The players must then keep the “hot potato” airborne and toss it around until music stops or the player outside of the trampoline counts down. Whoever is holding the hot potato at the end is knocked out and a new round begins. [1] X Research source Number of players: 2+ Equipment requirements: Any soft object or ball. Ideal age: 6+"
    },
    {
      "title": "",
      "content": "Fill up a bunch of water balloons and set them on the floor of the trampoline. Have players get on the trampoline and have them jump. The last player to get wet wins. Alternatively, you could have the players jump while one player outside of the trampoline throws water balloons at the players. Number of players: 2+ Equipment requirements: Water balloons Ideal age: 6+"
    },
    {
      "title": "",
      "content": "Get a bunch of balls of varying sizes and set them on the trampoline. Players get on the trampoline. The moment one of the balls touches someone, that player is “out” and leaves the trampoline. Play continues until one player is left standing. Number of players: 2+ but this game is most fun with at least 4 players. Equipment requirements: Any kind of ball. Ideal age: 4+"
    },
    {
      "title": "",
      "content": "Two players get on the trampoline and at least one player stands outside of the trampoline with any kind of soft ball (or water balloon). The players all announce “bombs away!” and the player(s) outside of the trampoline throw the balls vertically into the trampoline. When a player is hit with a ball, they’re out. Play continues until there’s one player standing. Number of players: 3+ Equipment requirements: Soft balls or water balloons. Ideal age: 6+"
    },
    {
      "title": "",
      "content": "A player stands on the trampoline. Then, another player on the outside of the trampoline throws a tennis ball over them. The player on the trampoline tries to jump and catch the ball in mid-air. Number of players: 2 Equipment requirements: A tennis ball. Ideal age: Any"
    },
    {
      "title": "",
      "content": "Sprinkler jumps in the yard are a blast, but a trampoline just takes things up another level entirely. Either set a sprinkler up underneath the trampoline and watch the players go nuts, or hook up a sprinkler designed specifically for trampolines and see who can stay dry the longest. Number of players: Any Equipment requirements: Sprinkler Ideal age: Any"
    },
    {
      "title": "",
      "content": "Players hop on the trampoline and someone in charge of refereeing the contest stands outside of the trampoline. The ref shouts “Go” and each player must stand (or bounce!) on one leg. The moment a player lets their second leg (or any other part of their body) hit the trampoline floor, they’re out. The winner is the last one standing. Number of players: 2+ Equipment requirements: None. Ideal age: 4+"
    },
    {
      "title": "",
      "content": "For much younger kids, combine the joy of bubbles with the fun of the trampoline. Blow bubbles at the players and see who can pop all of the bubbles before they fly away. Number of players: Any Equipment requirements: Bubbles. Ideal age: 2-6"
    },
    {
      "title": "",
      "content": "This is based on the telephone game where players sit in a circle and take turns saying everything the prior person said. On the trampoline, the first player starts by jumping and making a pose. Then, the next player does the same pose and either adds to it or bounces once and does a different pose. Each player repeats the previous poses until someone messes the chain up. They lose and the game restarts with them doing the first pose. Number of players: 2+ Equipment requirements: None. Ideal age: 6+"
    },
    {
      "title": "",
      "content": "A player volunteers to play the “egg.” They get into the middle of the trampoline in a ball with their arms wrapped around their knees and their knees tucked into their chest. Then, other players begin jumping and try to “crack” the egg by getting the egg-player to unravel their arms and legs. Once someone cracks the egg, another player becomes the new egg and a fresh round starts. [2] X Research source Number of players: 3+ Equipment requirements: Ideal age: 8+. Younger players are too likely to get hurt if someone accidentally jumps on them."
    },
    {
      "title": "",
      "content": "Yes, like the pool game! One player starts off with their eyes closed and calls out “Marco.” The other players must respond with “Polo” and the player with the closed eyes must use their ears to follow the voices/noises and tag someone else to “free themselves” and make the other player blind. Number of players: 2+ Equipment requirements: None. Ideal age: 8+"
    },
    {
      "title": "",
      "content": "Use painter’s tape or chalk to draw a cross and divide the trampoline into four different sections of equal size. One player sits in the middle of the cross and counts to 10. The remaining players all pick a quadrant. When they finish counting to 10, the player in the middle points at the quadrant they think has the most people in it (but still keeping their eyes closed). The players in the chosen quadrant are knocked out and the player in the middle counts to 10 again. The winner is whoever is last to survive. Number of players: 3+, but more is better. Equipment requirements: Tape or chalk. Ideal age: 3+"
    },
    {
      "title": "",
      "content": "All players begin by bouncing up and down. Then, one person calls out, “One, two, three, four. I declare a bum war!” Then, everyone must bounce once on their booty, and pop back up to keep bouncing on their feet. Anyone who falls or doesn’t get enough air is knocked out. Number of players: Any Equipment requirements: None. Ideal age: 4+"
    },
    {
      "title": "",
      "content": "Two players bounce in rhythm together. They say, “Rock, paper, scissors, bounce!” and take a big bounce. Then, they play rock-paper-scissors in mid-air using their bodies! Curl up in a ball for “rock,” stretch all four limbs out for “paper,” or cross your legs for “scissors.” Number of players: 2 Equipment requirements: None. Ideal age: 6+"
    },
    {
      "title": "",
      "content": "Throw on a song that everyone enjoys and give each player a chance to do a funny or cool pose in mid-air. Players can compete to score the most points based on how judges (i.e. an adult nearby) vote. Number of players: Any Equipment requirements: None. Ideal age: 3+"
    },
    {
      "title": "",
      "content": "This one is pretty self-explanatory. Players play a song of their choosing and take turns dancing. The judges can be all onlookers, or you can designate one judge to run the entire contest. Number of players: Any Equipment requirements: None. Ideal age: 3+"
    },
    {
      "title": "",
      "content": "This is an especially fun game for younger kids. An adult or older child stands outside of the trampoline and sings the “Ring around the rosy” song. The children walk, skip, or jump in a circle. When the singer gets to “We all fall down,” everyone on the trampoline lays down and bounces. Number of players: Any Equipment requirements: None. Ideal age: Under 6"
    },
    {
      "title": "",
      "content": "Freeze bounce is basically red light, green light on a trampoline. All the players begin bouncing until a player from outside yells, “Freeze!” Then, the players have to stop moving. The last player to hit the trampoline or the last player to stop moving is “out” and gets off the trampoline. Play continues until one player remains. Number of players: 2+ Equipment requirements: None. Ideal age: 4+"
    },
    {
      "title": "",
      "content": "A player stands outside of the trampoline and shouts instructions. The players’ job is to ignore any instruction where the instruction doesn’t begin with “ Simon says …” Play continues until a player messes up by ignoring a legitimate Simon instruction, or by following the instruction when Simon didn’t say to do it. Number of players: Any Equipment requirements: None. Ideal age: Any."
    },
    {
      "title": "",
      "content": "For a looser “game,” simply hold a jump contest. Select one or more people (adults or kids) to judge the contest. Then, each player takes a turn trying to perform the most impressive, interesting, or highest jump. You can even hand out awards for things like “Funniest jump” or “Most expressive jump.” Number of players: Any Equipment requirements: None Ideal age: Any"
    },
    {
      "title": "",
      "content": "Pick a player to stand outside of the trampoline with a bucket full of water balloons. Then, players get on the trampoline and start jumping. The last player to get hit with a water balloon is considered the winner. Number of players: Any Equipment requirements: Water balloons. Ideal age: 6+"
    },
    {
      "title": "",
      "content": "Choose one player to be the “dead man”. They sit in the middle of the trampoline, close their eyes, and count to 10. While they count, the other players crawl, roll, or jump to hide from the dead man. Then, once they hit 10, the dead man crawls (they aren’t allowed to stand or get up!) and tries to touch the other players. The last player to get touched wins. Number of players: Any Equipment requirements: None. Ideal age: 6+"
    },
    {
      "title": "",
      "content": "If you have a game of Twister lying around, spread the sheet out and put it on the trampoline. Play a normal game of Twister and watch the players lose their minds trying to keep stable on the trampoline. If you don’t have Twister (or you want to make the game less difficult), you can use chalk or painter’s tape to create large shapes on the trampoline. [3] X Research source Number of players: 2+ Equipment requirements: Twister (or chalk/painter’s tape) Ideal age: 6+"
    },
    {
      "title": "",
      "content": "Grab a piece of chalk and draw out hopscotch squares on the trampoline. Be sure to leave plenty of space around the edge of your drawing in case players fall. Then, have players take turns trying to complete your hopscotch course . Number of players: Any Equipment requirements: None. Ideal age: 3+"
    },
    {
      "title": "",
      "content": "Host a little competition with a target practice game that hooks up directly to your trampoline. You could pick up their dart game to see who has the best aim or scoop up a basketball target game to see who has the best jump shot. Number of players: Any Equipment requirements: Trampoline game of your choosing. Ideal age: Depends on game. Can adults join? Yes."
    },
    {
      "title": "",
      "content": "Cut up some pool noodles and wrap one end of each noodle in duct tape to make the handle for a “sword.” Have players take turns trying to win sword fights by knocking their opponent over while they both bounce. Just make sure nobody goes for the head and that everyone is taking the sword fight in good fun. Number of players: Any Equipment requirements: Pool noodles, scissors, duct tape. Ideal age: 8-13"
    },
    {
      "title": "",
      "content": "You can draw a mid-court line in chalk or painter’s tape, but this is really the most fun if you set up a freestanding net bigger than the width of your trampoline so that it feels like a real game. Number of players: 2-4 Equipment requirements: Volleyball, volleyball net. Ideal age: 6+"
    },
    {
      "title": "",
      "content": "Buy an attachable basketball hoop for your trampoline’s safety net and play! You could play Horse , set up a 1v1 tournament, or simply shoot around for fun. If you do want to do a 2v2 tournament, you might set it up so that players have to dribble before bouncing somewhere new, or make a rule that players cannot jump in the same spot more than once (to replicate traveling rules). Number of players: Any Equipment requirements: Basketball and attachable basketball hoop. Ideal age: Any"
    },
    {
      "title": "",
      "content": "Only do this with a child-safe bat and ball to avoid any injuries. Have the child bounce on the trampoline and either play catch or have them try to hit your underhand pitches. Number of players: 2 Equipment requirements: Bat and ball Ideal age: 4-8 Can adults join? As the pitcher, yes."
    }
  ]
}