{
  "url": "https://www.wikihow.com/Write-a-Vignette",
  "title": "How to Write a Vignette",
  "steps": [
    {
      "title": "Understand the purpose of a vignette.",
      "content": "Understand the purpose of a vignette. A vignette should express a certain moment, mood, aspect, setting, character, or object. Most of all, it should be short, but descriptive. [1] X Research source In terms of length, a vignette is typically 800-1000 words. But it can be as short as a few lines or under 500 words. A vignette will usually have 1-2 short scenes, moments, or impressions about a character, an idea, a theme, a setting, or an object. You can use the first second, or third point of view in a vignette. But most vignettes are told in just one point of view, instead of alternating points of view. Remember you only have a short amount of space on the page for the vignette. So don’t waste valuable time confusing your reader with many points of view. The vignette form can also be used by physicians to create a report on the status of a patient or a procedure. In this article, we will be focusing on a literary vignette, not a clinical vignette. [2] X Research source"
    },
    {
      "title": "Don’t feel restricted to one structure or style in a vignette.",
      "content": "Don’t feel restricted to one structure or style in a vignette. A vignette is an open form. This means you do not need to write within a certain structure or a specific plot. So, you can have a clear beginning, middle, and end, or you can skip beginnings and endings altogether. A vignette also does not require a main conflict or a resolution of a conflict. This freedom gives some vignettes an unfinished or unresolved tone. But unlike other traditional storytelling forms like the novel or the short story, a vignette does not have to tie up all the loose ends. In a vignette, you are not limited by a certain genre or style. So you can combine elements of horror and romance, or you can use poetry and prose in the same vignette. Feel free to use simple and minimal language, or lush, detailed prose."
    },
    {
      "title": "Remember the one rule of the vignette:",
      "content": "Remember the one rule of the vignette: create an atmosphere, not a story. Because there is limited space in a vignette, it's important to show, rather than tell the reader. So avoid inserting backstory or exposition into a vignette. Focus instead on creating a snapshot in the life of a character or a certain setting. A vignette can also come in the form of a blog entry or even a Twitter post. Usually, shorter vignettes are more difficult to write, as you need to create an atmosphere in very few words and evoke a reaction from your reader."
    },
    {
      "title": "Read examples of vignettes.",
      "content": "Read examples of vignettes. There are several great vignette examples, varying from very short to long. For example: The publication Vine Leaves Journal publishes vignettes, both short and long. One of the submissions from their first issue is a two-line vignette by the poet Patricia Ranzoni, called “Flashback”: “ the softness from dialing the phone/is like lifting the lid to my music box. ” Charles Dickens uses longer vignettes or “sketches” in his novel “Sketches by Boz” to explore London scenes and people. [3] X Research source The writer Sandra Cisneros has a collection of vignettes called “The House on Mango Street”, narrated by a young Latina girl living in Chicago."
    },
    {
      "title": "Analyze the examples.",
      "content": "Analyze the examples. Whether the vignette is two lines long or two paragraphs long, it should communicate a certain emotion or mood to the reader. Look closely at how the example vignettes use tone, language, and mood to evoke emotions in the reader. For example, the two-line vignette by the poet Patricia Ranzoni is a successful piece because it is both simple and complex. Simple in that it describes the feeling you might get as you dial the number of someone you are excited to talk to. But complex in that the vignette ties the excitement of dialing a number to the excitement of lifting a music box. So the vignette combines two images to create one emotion. It also uses “softness” to describe dialing the phone, which also connects to the softness of the lining of a music box, or the soft music that plays from a music box. With just two lines, the vignette effectively creates a certain mood for the reader. In Cisneros’ “The House on Mango Street”, there is a vignette called “Boys & Girls”. It is a longer vignette, four paragraphs long, or around 1,000 words. But it sums up the young narrator’s emotion towards the boys and girls in her neighborhood, as well as her relationship with her sister, Nenny. The narrator uses simple, direct language to describe the separate world of boys and girls in her neighborhood. Cisneros finishes the vignette with an image that sums up the narrator’s feelings. Someday I will have a best friend all my own. One I can tell my secrets to. One who will understand my jokes without my having to explain them. Until then I am a red balloon, a balloon tied to an anchor. The image of a “balloon tied to an anchor” adds color and texture to the vignette. The narrator’s feeling of being weighed down by her sister is perfectly summed up by the last image. So the reader is left with the feeling of being held down or tethered to someone, just like the narrator."
    },
    {
      "title": "Create an association diagram.",
      "content": "Create an association diagram. An association diagram is also known as a clustering technique. You will create a cluster or group of words around a theme or idea. [4] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Take out a sheet of paper. Write your main topic or subject in the middle of the paper. For example, “Spring”. Moving out from the center, write down other words that pop into your mind that relate to “Spring”. For example, for “Spring”, you might write “flowers”, “rain”, “Spring break”, “new life”. Don’t worry about organizing the words as you write. Simply let the words flow around the main topic. Once you feel you have written enough words around the main topic, start to cluster the words. Draw a circle around words that relate to each other and draw a line between the circled words to connect them. Continue doing this with the other words. Some of the terms may end up uncircled, but these lone words can still be useful. Focus on how the words relate to the main topic. If you have clustered together several words that relate to “new life”, for example, maybe this may be a good approach for the vignette. Or if there are a lot of clustered words that focus on “flowers\", this may be another way to approach “Spring.” Answer questions like: “I was surprised by…” or “I discovered…” For example, you may look over the clustered words and note “I was surprised by how often I mention my mother in relation to Spring.” Or, “I discovered I may want to write about how Spring means new life.”"
    },
    {
      "title": "Do a free-write.",
      "content": "Do a free-write. A free-write is a chance for you to let your thoughts flow on a piece of paper. [5] X Research source Write whatever comes into your mind and don’t judge what you are writing. Take out a piece of paper, or open a new document on your computer. Write the main topic at the top of the paper. Then, set a time limit of 10 minutes and start the free-write. [6] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source A good rule of thumb for the free-write is to not lift your pen from the paper, or your fingers from the keyboard. This means not re-reading the sentences you just wrote or going back over a line for spelling, grammar, or punctuation. If you feel you have run out of things to write down, write about your frustrations about not having anything else to say about the main topic. Stop writing once the timer is up. Read over the text. Though there may be some confusing or convoluted thoughts, there will also be sentences you may like or an insight that may be useful. Highlight or underline sentences or phrases you think may work in the vignette."
    },
    {
      "title": "Ask the six big questions.",
      "content": "Ask the six big questions. Take out a sheet of paper or open a new document. Write the main topic of the vignette at the top of the document. Then, write down six headings: Who? What? When? Where? Why? and How? [7] X Trustworthy Source University of North Carolina Writing Center UNC's on-campus and online instructional service that provides assistance to students, faculty, and others during the writing process Go to source Respond to each question with a phrase or sentence. For example, if your topic is “Spring”, you may answer Who? with “my mother and I in the garden”. You may answer When? with “A hot summer day in July when I was six years old.” You may answer Where? with “Miami, Florida.” You may answer Why? with “Because it was one of the happiest moments of my life.” And you may answer How? with “I was alone with my mother in the garden, without my sisters.” Look over your responses. Do you have more than one or two phrases for a certain question? Is there one question you had no answer for? If your answers reveal you know more about “where” and “why”, maybe this is where the strongest ideas for the vignette are."
    },
    {
      "title": "Decide on the style of the vignette.",
      "content": "Decide on the style of the vignette. Maybe you want to do a freestyle vignette where you create a scene or describe an object. Or perhaps you’d like to use the format of a letter or a blog post for the vignette. For example, a vignette about “Spring” could describe a scene in the garden with your mother, among the flowers and trees. Or it could be in the form of a letter to your mother about that day in Spring, among the flowers and trees."
    },
    {
      "title": "Add sensory details.",
      "content": "Add sensory details. Focus on the five senses: touch, taste, smell, sight, and sound. Could a certain detail in the vignette be stronger with a description of the smell of a flower or the softness of the petals of a flower? You can also add figurative language to strengthen the vignette, such as similes, metaphors, alliteration, and personification. But use these sparingly and only when you feel like a simile or metaphor will highlight the rest of the vignette. [8] X Research source For example, the use of the red balloon attached to an anchor in Cisneros’ “Boys & Girls” is an effective use of figurative language. But it works well because the rest of the vignette uses simple language, so the image at the end of the vignette lingers with the reader."
    },
    {
      "title": "Condense the vignette.",
      "content": "Condense the vignette. A good vignette should have a sense of urgency. This means cutting out details like what the character ate for breakfast or the color of the sky in the garden unless they are essential to the vignette. Only include scenes and moments that add urgency, and remove any details that slow down the pace of the vignette. [9] X Research source Look over the first two lines of the vignette. Does the vignette begin at the right moment? Is there a sense of urgency in the first two lines? Make sure your characters collide with each other very early in the vignette. See if you can edit the vignette so you set a scene in the least words possible."
    }
  ]
}