{
  "url": "https://www.wikihow.com/Store-Flaxseed",
  "title": "The Best Ways to Store & Keep Flaxseed Fresh",
  "steps": [
    {
      "title": "Leave flaxseed in its original packaging for 6-12 months.",
      "content": "Leave flaxseed in its original packaging for 6-12 months. Flaxseed is most often sold in vacuum-sealed bags or refrigerated pouches. One of these containers will work just fine for short-term storage, especially if you tend to go through the superfood in a hurry. Just zip or roll up the bag or pouch, slip a rubber band around it, and stick it in the refrigerator. [2] X Research source Keep your flaxseed on a central shelf so it will be in your line of sight when you open the fridge. That way, you won’t be as likely to forget about it."
    },
    {
      "title": "Transfer opened flaxseed to a glass mason jar.",
      "content": "Transfer opened flaxseed to a glass mason jar. Glass jars are by far the best storage method for oily grains like flaxseed. Not only do their canning lids lock down to form an airtight seal, they can also be washed and reused an infinite number of times. The fact that they’re transparent means it’s easier to identify what’s in the jar and see how much you have left at a glance, too. [3] X Research source Don’t forget to label your mason jars with the contents and expiration date. Glass in a nonreactive substance, so you won’t have to worry about the valuable nutrients in the flaxseed breaking down before their time."
    },
    {
      "title": "Stash your flaxseed in an airtight lidded container for 4-6 months.",
      "content": "Stash your flaxseed in an airtight lidded container for 4-6 months. Standard plastic storage containers are a fine choice for flaxseed that you’re planning on using within a couple months. They’re available in a variety of sizes, and you can almost always dig a spare out of the back of a cabinet or the bottom of a drawer. For freshness, look for containers with lids that seal tightly. [4] X Research source Stay away from plastics containing BPAs. It’s possible for these harmful chemicals to leach into foods that have been in storage for a while. [5] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Keep pre-portioned flaxseed in a plastic zipper bag for 1-2 weeks.",
      "content": "Keep pre-portioned flaxseed in a plastic zipper bag for 1-2 weeks. If you don’t have a more durable container on hand, a plastic bag will do. Funnel the flaxseed into the bag carefully to avoid spilling it and press out as much air as you can before sealing. Make sure the zip closure is snapped tight all the way across. One advantage of plastic bags is that they come in multiple sizes, which makes them useful for storing leftovers, meal prepping, and packing lunches. Plastic bags are more likely to break or allow air in, so they shouldn’t be used for storing sensitive grains like flaxseed for long periods."
    },
    {
      "title": "Opt for dark containers over clear ones.",
      "content": "Opt for dark containers over clear ones. Dark containers, like green glass and tinted or opaque Tupperware, admit less light, which is one of fresh flaxseed’s worst enemies. As such, they’ll provide longer-lasting results than transparent containers kept under the same conditions. [6] X Research source Avoid leaving flaxseed in brightly-lit areas, such as on the countertop in the path of the setting sun, when storing it at room temperature."
    },
    {
      "title": "Move freshly-ground flaxseed to an airtight container for 3-4 days.",
      "content": "Move freshly-ground flaxseed to an airtight container for 3-4 days. When whole flaxseed is reduced to small pieces, its fatty acids begin to break down rapidly, which can cause it to spoil in as little as a week when stored at room temperature. Make sure your grains go straight into a sealed jar or piece of Tupperware after they've been processed. This will help extend their shelf life to its maximum potential. Double check that the lid is nice and secure, and try not to open the container unless it's to portion out a scoop. Try to use up your ground flaxseed as soon as possible in order to take advantage of its full flavor and nutritional value. You may be able to stretch your ground flaxseed for as long as 2-3 months by finding room for it in the refrigerator."
    },
    {
      "title": "Refrigerate your flaxseed for up to a year.",
      "content": "Refrigerate your flaxseed for up to a year. The refrigerator’s dark, temperature-regulated conditions make it the perfect means of preserving freshly-opened flaxseed. Inside, the grains will be protected from heat and light, both of which can cause them to spoil prematurely. Best of all, almost any type of storage container can easily go into the fridge, provided it’s the right size. Whenever possible, the refrigerator should be your first choice for putting away flaxseed. Refrigerated flaxseed has the potential to last 6 whole months longer than flaxseed stored at room temperature. [7] X Research source"
    },
    {
      "title": "Freeze unused flaxseed to extend its shelf life to over a year.",
      "content": "Freeze unused flaxseed to extend its shelf life to over a year. If refrigerator space is limited, just look a few feet higher. Stashing your flaxseed in the freezer is a wise move if you know you’re not going to get around to using it for a while, or you prefer to buy it in bulk. It will stay good for a year or longer past its listed expiration date, since the surrounding temperature is so low. There’s no need to thaw frozen flaxseed prior to grinding it or adding it to food."
    },
    {
      "title": "Grind only as much as you plan on using right away.",
      "content": "Grind only as much as you plan on using right away. Hold off on processing your whole flaxseed until you’re ready to sprinkle some into a green smoothie or bowl or oats. Then, measure out the desired amount and return the rest to the pantry or refrigerator. It may be a little tedious, but it will greatly increase the lifespan of your supply. [8] X Research source Freezing ground flaxseed may keep it fresh for as long as 3 months. Even so, the sooner you put it to use, the better."
    },
    {
      "title": "Protect ground flaxseed from prolonged exposure.",
      "content": "Protect ground flaxseed from prolonged exposure. Anytime you’re grinding flaxseed, add it to your food or transfer it to its intended storage container without delay. The longer it remains out, the more likely it is to take on moisture. Even relatively dry air can kick off oxidation and lead to spoilage. Avoid grinding or opening a container of ground flaxseed in a steamy kitchen. Always reseal your storage container and return it to the refrigerator or freezer as soon as you’re finished portioning."
    },
    {
      "title": "Check the freshness of your flaxseed before using it.",
      "content": "Check the freshness of your flaxseed before using it. When flaxseed spoils, the fatty acids deteriorate, causing it to take on a rancid odor. Open up the container and give the flaxseed a whiff to make sure it’s okay to eat. If it smells questionable, it’s probably best to throw it away and spring for a new batch. [9] X Research source By contrast, fresh flaxseed will have a mild, nutty scent. Consuming spoiled flaxseed isn’t dangerous, but it may have an unpleasant taste or cause minor digestive issues."
    }
  ]
}