{
  "url": "https://www.wikihow.com/Stand-Correctly",
  "title": "How to Stand Correctly",
  "steps": [
    {
      "title": "Start with your feet.",
      "content": "Start with your feet. They should be hip-distance apart. If they are crossed, uncross them and try to keep them aligned with your hips. Keeping one foot slightly forward of the other can help relieve pressure from your lower back muscles. [2] X Research source Keep your feet pointed forward, not out to the sides."
    },
    {
      "title": "Move your body weight to the balls of your feet.",
      "content": "Move your body weight to the balls of your feet. If your weight was on the outside of your feet, you are pronated. If your weight was previously on the inside of your feet, you are supinated. Pronation and supination are common problems. However, they can result in ankle, leg, hip and back problems in the future. If it is very hard to move the weight to the balls of your feet, you can consult a podiatrist to get custom orthotics. They can help correct your posture."
    },
    {
      "title": "Don’t lock your knees.",
      "content": "Don’t lock your knees. There should be a very slight, almost imperceptible, bend in them. Locking your knees increases stress on your joints. [3] X Trustworthy Source Mayo Clinic Educational website from one of the world's leading hospitals Go to source"
    },
    {
      "title": "Adjust the curvature of your spine.",
      "content": "Adjust the curvature of your spine. Your lower back should have a slight curve to it. Some people may have too much of a curve in their lower back, called “hyperlordosis,” which is often caused by weak core muscles or excessive abdominal weight. Other people may stand with their pelvis tucked too far in, causing the lower back to be straight instead of maintaining its natural curve. This is called a “flat back” and is also unhealthy. It can be caused by sitting for too long in one position or by tightness in your core muscles. If you are prone to low back pain, try contracting your abdominal muscles a little. Imagine you have a corset that is pulling your stomach muscles in and upward. Your back will be supported. Don’t tilt your pelvis; use your abs to support your body. [4] X Research source It may take time to develop postural muscles in your legs, belly, back and shoulders. Keep with it for several months to get pain-relieving results."
    },
    {
      "title": "Shrug your shoulders and let your arms drop.",
      "content": "Shrug your shoulders and let your arms drop. Your arms should hang at your sides without too much tension. If your shoulders rise toward your ears, make an effort to drop them."
    },
    {
      "title": "Check your shoulders for “roundness.”",
      "content": "Check your shoulders for “roundness.” Sometimes people stand with rounded shoulders, which can lead to shoulder and neck pain. An easy way to check whether your shoulders are rounded or not is to stand in front of a mirror. Let your arms drop to your sides and hang naturally. If your knuckles face the front, your shoulders may be more rounded than is healthy. Focus on pulling your shoulders back just a bit to counteract this roundedness. You can improve your muscle balance and reduce rounded shoulders by strengthening your upper back and core muscles."
    },
    {
      "title": "Pinch your shoulder blades together about an inch (2.",
      "content": "Pinch your shoulder blades together about an inch (2. 5cm). People who work at computers can become hunched. Practice pinching your shoulder blades together to counteract the effects of computer work. [5] X Research source Don’t overcorrect by pulling your shoulder blades too far back. This can create a hinge effect at your lower back that can cause pain."
    },
    {
      "title": "Keep your head even.",
      "content": "Keep your head even. Try to avoid slumping forward. If your head slumps forward or down, bring it back so that your chin is parallel to the floor. Make sure that your head does not list to one side or the other. Keep your earlobes parallel to your shoulders. [6] X Research source Be sure not to overcorrect by hinging your head up, either. Your eyes should look straight ahead, not up to the ceiling or down to the floor. Imagine a string attached to the top of your head that is pulling you toward the ceiling. Your neck and head should be straight and upright."
    },
    {
      "title": "Check your posture with the wall test.",
      "content": "Check your posture with the wall test. Your spine has three natural curves that create places where your back should touch the wall first if you’re standing properly. [7] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source Stand against a vertical wall with your heels 2-4” from the wall. Make sure the back of your head, shoulder blades, and buttocks touch the wall. The back of your head should touch the wall due to the cervical curve. The back of your upper shoulders should touch the wall due to the thoracic curve. Your buttocks should touch the wall due to the lumbar curve. You should be able to slide your hand in between the wall and your lower back curve. If you can’t, your back may be too flat. If the gap is much thicker than your hand, tighten your abs to flatten your back slightly until it touches your hand. If you touch at other places, adjust your standing posture so that these three points hit the wall at once."
    },
    {
      "title": "Walk around for a few minutes to stretch your muscles.",
      "content": "Walk around for a few minutes to stretch your muscles. This is especially important after a day of sitting. If you can do stretching exercises such as yoga regularly, this can help develop flexibility in your muscles and improve posture. [8] X Research source"
    },
    {
      "title": "Balance on one leg while standing in front of a mirror.",
      "content": "Balance on one leg while standing in front of a mirror. Try to keep your body completely straight, instead of listing to one side. Hold this position for 30 seconds, then repeat on the other side."
    },
    {
      "title": "Work on improving your balance.",
      "content": "Work on improving your balance . Better balance increases strength and improves your posture. It can also reduce your risk of injury. [9] X Research source Stand on one foot and bring the opposite foot directly behind you about four inches. Bring it forward again, keeping it in line with your hip the whole time. Repeat 10-15 times on both sides. Stand on one foot. Lift one leg out to the side and hold the position for 1-5 seconds. Lower your leg. Repeat 10-15 times on both sides. [10] X Research source"
    },
    {
      "title": "Do wall squats.",
      "content": "Do wall squats. Wall squats can help strengthen your buttock muscles, which will help you stand correctly. Stand with your back against the wall. Your toes should be hip-width apart with toes slightly out. Slide your back down the wall and bend your knees. When your thighs are parallel to the ground, slide your back up the wall. Repeat 10 to 20 times. You can put an exercise ball between the wall and your lower back to help you keep your balance if you’re just beginning. Try doing it with a chair instead of a wall when you feel stronger. Lower yourself down without the help of the wall. When your buttocks brush the chair during the squat, straighten your legs."
    },
    {
      "title": "Place a broom handle or foam roller in front of you and slightly to the right.",
      "content": "Place a broom handle or foam roller in front of you and slightly to the right. Place your right hand atop the handle to use for stability. Lean forward and lift your right leg, trying to keep your body aligned the entire time. Repeat on the opposite side, taking 10 seconds to complete the exercise. As you get stronger, your trunk should become perpendicular to your standing leg."
    },
    {
      "title": "Avoid exercises that have you bend from your waist.",
      "content": "Avoid exercises that have you bend from your waist. Bending forward from the waist is bad for your posture and can also cause harm if you have osteoporosis. Toe touches, sit ups, and abdominal crunches should be avoided unless they are done under the supervision of a physical therapist or physician."
    },
    {
      "title": "Do planks.",
      "content": "Do planks. Plank exercises are excellent for strengthening your core muscles. Without a strong core, your body has to work hard to stand correctly, and may overuse some muscles and not use others. Plank exercises can help correct an excessive curve in your lower back, a flat back, uneven hips, and rounded shoulders. Lie on your stomach. Raise your body up so that your weight is resting on your toes and forearms. Press your palms together and keep your forearms planted firmly on the floor. Align your shoulders so that they are directly above your elbows. Look at the floor, keeping your head neutral. Contract your abdominal muscles to form your body in a straight line from your head to your toes. Make sure that your lower back doesn’t sink or arch up while you’re planking."
    },
    {
      "title": "Do side-lying leg raises.",
      "content": "Do side-lying leg raises . These exercises can help correct poor posture by strengthening your buttocks and lower back muscles. If these muscles are weak, you may have an improper arch or curve to your spine. Lie on one side. Prop your head up with one arm. Bend the knee that is on the ground to a 90 degree angle. Keep your hips level, not pushed too far forward or back. Contract your abdominal muscles and keep them tight as you perform the exercise. Keeping the top leg straight, lift it as far as you can without tilting your hips backward. You should feel your buttock muscles contract as you lift your leg. Slowly lower the leg to the ground. Repeat 8-10 times, then switch to the other side."
    },
    {
      "title": "Do back extensions.",
      "content": "Do back extensions. Weak back muscles can lead to a flat back and rounded shoulders. Back extensions can help strengthen these muscles and keep you standing correctly. The “cobra pose” in yoga can also help strengthen these muscles. Lie on your stomach. Bend your elbows and bring your arms to your side so that your head is resting on your hands. Using your forearms, press your upper body up from the ground. Keep your shoulders, back, and neck long as you arch backward. Don’t bend your neck backwards: keep it in line with your spine. Inhale, feeling your abdominal muscles stretch slightly. Hold your breath for 5 seconds, then slowly lower yourself to the floor again."
    },
    {
      "title": "Practice good posture.",
      "content": "Practice good posture. Standing for long periods of time can have similar effects to sitting for long periods of time. If you have weak muscles, such as the abdominal and glute muscles, your other muscles will get tighter. There has to be a balance. Avoid leaning on one leg. Shifting your weight from one hip to another is bad for your posture. If your buttock and core muscles are weak, you may tend to stand with more of your weight on one leg to use your lower back and hips to balance you. Stand with your weight distributed evenly between your legs. If your buttocks and core muscles are weak, do exercises to strengthen them such as planks, side-lying leg raises , and bridges. You can also squeeze your butt muscles while standing to make sure the glute muscles don’t get weak. Do this several times a day."
    },
    {
      "title": "Alternate between sitting and standing.",
      "content": "Alternate between sitting and standing. If possible, alternate the two positions every 30 minutes, for maximum benefit. Standing all day can have adverse affects on your health, just like sitting, because your joints are supporting you all day. Ideally, find a sit-stand workstation that can be used when sitting or standing. [11] X Research source"
    },
    {
      "title": "See if you can get an adjustable-height desk.",
      "content": "See if you can get an adjustable-height desk. They are made in desktop models that start at $200 and full-desk models that start at $900. People who are handy with do-it-yourself projects may find that they can create an adjustable height desk. Even placing your monitor, keyboard, and other work tools on elevated boxes can provide a more ergonomic workstation. Your standing desk should have your screen 20” to 28” from your eyes and allow you to hold your elbows at a 90-degree angle. [12] X Research source You can also use a footstool to take pressure off your back. Stand with one leg slightly bent, and the other leg on a small stool. Make sure you alternate legs every 15 to 20 minutes."
    },
    {
      "title": "Buy a cushioned mat to stand on.",
      "content": "Buy a cushioned mat to stand on. A small gel mat works well to give your feet extra support."
    },
    {
      "title": "Wear supportive shoes.",
      "content": "Wear supportive shoes. Don’t stand at work in heels or flat shoes without arch supports. Add arch supports to your shoes if they don’t have them already."
    },
    {
      "title": "Start with short, 10-minute, periods of standing.",
      "content": "Start with short, 10-minute, periods of standing. As you develop your postural muscles you can increase these periods. Standing too long too soon can result in a backache."
    },
    {
      "title": "Learn to break up your workday with standing activities and sitting activities.",
      "content": "Learn to break up your workday with standing activities and sitting activities. Standing while answering email, calling or doing research is advantageous because you are likely to do it for 30 minutes and move on. Typing and activities that require honed motor skills are easier to do when sitting."
    },
    {
      "title": "Substitute walking around for standing if your work doesn’t support an adjustable height desk.",
      "content": "Substitute walking around for standing if your work doesn’t support an adjustable height desk. Get up and walk around every 30 minutes to ensure that you are getting the exercise and stretching your body needs. [13] X Research source [14] X Research source"
    }
  ]
}