{
  "url": "https://www.wikihow.com/Use-a-Neti-Pot",
  "title": "How to Use a Neti Pot",
  "steps": [
    {
      "title": "Read the manufacturer’s instructions on how to clean your neti pot.",
      "content": "Read the manufacturer’s instructions on how to clean your neti pot. Before you use your neti pot, read through any instructions that came along with it to see what type of cleaning process is recommended. You can clean most neti pots with soap and warm water, but check to ensure that this is what is recommended for your neti pot. [1] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source"
    },
    {
      "title": "Wash your neti pot with dish soap and hot water before the first use.",
      "content": "Wash your neti pot with dish soap and hot water before the first use. Add a few drops of dish soap to the neti pot and then fill it with hot water. Swish the soapy water around so that it cleans all surfaces of the neti pot. Then, pour out the soapy water and rinse the neti pot thoroughly. [2] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source Rinse the neti pot 6 or 7 times to ensure that you have removed all of the soap residue."
    },
    {
      "title": "Let the neti pot air dry or wipe the inside with a clean paper towel.",
      "content": "Let the neti pot air dry or wipe the inside with a clean paper towel. The neti pot should be completely dry before you use it for the first time. Place the neti pot upside down on a clean towel or use a clean paper towel to dry the inside of the pot. Do not wipe out the inside of the neti pot with a used dish towel. Also, do not place it right side up to dry. It might collect dust or get dirty if you let it air dry this way."
    },
    {
      "title": "Wash and dry your hands",
      "content": "Wash and dry your hands to avoid contaminating the neti pot. Hold your hands under warm running water to wet them. Then, add about 1 teaspoon (5 mL) of liquid hand soap or rub your hands around a soap bar for a few seconds to lather up your hands. Rub the soap between your hands, into your fingertips, and around your fingernails. Then, hold your hands under warm, running water again to rinse away the soap. Dry your hands completely using a clean cloth or paper towel. [3] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source It takes about 20 seconds to thoroughly wash your hands. To time yourself, hum the “Happy Birthday” song to yourself 2 times. [4] X Trustworthy Source Centers for Disease Control and Prevention Main public health institute for the US, run by the Dept. of Health and Human Services Go to source"
    },
    {
      "title": "Measure out 32 fl oz (950 mL) of sterilized, distilled, or boiled water.",
      "content": "Measure out 32 fl oz (950 mL) of sterilized, distilled, or boiled water. To ensure that the water is safe to put into your nasal cavity, only use water that has been distilled, sterilized, or boiled and cooled. Pour the water into a clean glass container, such as a jar or a bowl. [5] X Research source You can purchase sterilized or distilled water at a grocery or drug store. Or, bring tap water to a boil and let it boil for about 5 minutes. Then, turn off the heat and let the water cool to room temperature."
    },
    {
      "title": "Mix 2 teaspoons (11 g) of finely ground non-iodized salt with the water.",
      "content": "Mix 2 teaspoons (11 g) of finely ground non-iodized salt with the water. Choose sea salt or kosher salt that has not had iodine added to it. Measure out the salt and pour it into the container with the water. [7] X Research source Do not use normal table salt. The additives in it can irritate your nose. You can also purchase saline solution if you do not want to make your own. Check your local drug store for saline solution that is meant for use with neti pots."
    },
    {
      "title": "Stir until the salt is dissolved and wait for the solution to cool.",
      "content": "Stir until the salt is dissolved and wait for the solution to cool. Use a clean metal spoon to stir the salt into the water. Keep stirring until the salt is completely dissolved. Once the solution looks clear and has cooled to room temperature, it is ready to use. [8] X Research source Place a lid on the container if you do not plan to use the solution right away. However, be sure to use the solution within 24 hours. Discard any unused solution at that point since bacteria may begin to grow in it."
    },
    {
      "title": "Fill the neti pot with the saline solution.",
      "content": "Fill the neti pot with the saline solution. The first step is to transfer the saline solution from the container to the neti pot. Pour it carefully to avoid spills and make sure it's not so warm that it will cause discomfort or burns."
    },
    {
      "title": "Lean over a sink with your neck straight and turn your head to 1 side.",
      "content": "Lean over a sink with your neck straight and turn your head to 1 side. Bend over the sink so that your upper body is at a 45-degree angle to your lower body. Then, turn your head to the side so that your ear is facing the sink. Keep your forehead at the same height as the chin, or slightly higher. Do not turn your head so far that your chin goes past your shoulder. Do not bend over so far that your chin is below your forehead."
    },
    {
      "title": "Breathe through your mouth while you are rinsing your nasal cavity.",
      "content": "Breathe through your mouth while you are rinsing your nasal cavity. You won’t be able to breathe through your nose while you are rinsing out your sinuses with the neti pot, so start breathing through your mouth. Take a few breaths to get used to it. Avoid talking or laughing so that the seal in your throat is not broken, allowing water in."
    },
    {
      "title": "Pour half of the water into your upper nostril.",
      "content": "Pour half of the water into your upper nostril. Press the spout against the inside of your nostril to form a seal. This will prevent water from flowing back out the same way it goes in. Raise the pot so the saline solution flows into the upper nostril and out of the lower nostril. This may feel a bit strange, like getting water up your nose while swimming. Empty ½ of the pot into your first nostril. The solution should pour out of your lower nostril and flow into the sink. If the water is splashing you, then lower yourself down closer to the sink. If the solution drains out of your mouth, lower your forehead slightly, but make sure to keep it above your chin."
    },
    {
      "title": "Repeat the process on the other side to rinse the other nostril.",
      "content": "Repeat the process on the other side to rinse the other nostril. Remove the neti pot from your nostril when you finish rinsing the first side. Then, turn your head in the opposite direction and repeat the same process. Use the other half of the saline solution to clear out your other nostril."
    },
    {
      "title": "Blow air through your nose to remove excess water.",
      "content": "Blow air through your nose to remove excess water. After you’ve drained the entire neti pot, keep your head over the sink and gently blow air out of your nose without using your fingers to pinch it. This will help to remove the excess water and some mucus as well. Do this until most of the dripping has subsided and you can breathe relatively easily again."
    },
    {
      "title": "Blow your nose",
      "content": "Blow your nose gently into a tissue. After fluid stops dripping freely from your nose into the sink, remove the rest of the water and completely clear your nose by blowing it into a tissue as you normally would. Apply gentle pressure to 1 side of your nostril as you blow into the tissue, then repeat on the other side. Be sure not to close off either nostril while blowing. Don’t blow too hard! Blow gently just as you normally would."
    },
    {
      "title": "Clean your neti pot after you are finished using it.",
      "content": "Clean your neti pot after you are finished using it. To prevent bacteria growth in and on your neti pot, give it a final wash before putting it away for storage. Use warm soap and water and allow the pot to air dry just as you did before. Store your neti pot in a cupboard or drawer to keep it clean and dust-free until the next time you use it."
    }
  ]
}