{
  "url": "https://www.wikihow.com/Use-Reflexology-to-Relieve-Chest-Pain",
  "title": "How to Use Reflexology to Relieve Chest Pain",
  "steps": [
    {
      "title": "Start by massaging your entire foot.",
      "content": "Start by massaging your entire foot. It can be difficult to determine the precise origin of chest pain, which can stem from stress, lung problems, digestion issues, or heart problems. [4] X Research source It is therefore best to start by massaging your entire foot, and then focusing in on areas you think might be to blame. This sort of general massage has been shown to have a positive therapeutic effect. [5] X Research source"
    },
    {
      "title": "Loosen up your foot.",
      "content": "Loosen up your foot. Hold the foot and gently rotate it at the ankle. Then rub all over your foot with both hands. Do this before applying any massage oil or moisturizing lotion. [6] X Research source"
    },
    {
      "title": "Apply moisturizing lotion.",
      "content": "Apply moisturizing lotion. Rub the lotion in your hands to warm it up, then apply it to the top of the foot, starting at the ankle and wiping down to the toes. Do the same for the bottom of the foot. [7] X Research source"
    },
    {
      "title": "Massage the toes first.",
      "content": "Massage the toes first. Starting with the big toe, pinch it between your index finger and thumb and use your thumb or thumb knuckle to gently press and massage the bottom of the toe for approximately 30 seconds. Twist the toe left and right, then push it down towards the sole of the foot. Repeat this procedure, spending approximately 15 seconds massaging each of the smaller toes. End by using your hand to gently press all the toes and the top of the foot down towards the sole of the foot[Image:Use Reflexology to Relieve Chest Pain Step 4 Version 2.jpg|center]]"
    },
    {
      "title": "Move on to the ball of the foot.",
      "content": "Move on to the ball of the foot. Grip the foot you are working on by the Achilles tendon above the heel to provide stability while you massage. Start nearest the big toe. Using your thumb or thumb knuckle, apply gentle pressure by pressing and holding for two seconds, or massaging with tiny circular motions. Move across the foot in three separate lines – top, middle, and bottom of the ball of the foot. Repeat these lines three times. [8] X Research source"
    },
    {
      "title": "Work on the midsection of your foot.",
      "content": "Work on the midsection of your foot. Grip your foot with both hands. Use your thumb knuckles if your thumbs get tired. [9] X Research source Start by applying gentle pressure as you pull your thumb across your foot, alternating hands – left to right for your right thumb, and right to left for your left thumb. Work in three lines, dragging each thumb 5 times per line. Next apply gentle pressure as you pull your thumbs down along the middle of your foot, working towards your heel. Again, work in three lines, dragging your left and right thumb 5 times per line. Massage the center of your foot by applying gentle pressure with you thumbs and moving in a clockwise direction."
    },
    {
      "title": "Rub the bottom of your foot in a clockwise motion.",
      "content": "Rub the bottom of your foot in a clockwise motion. Using both your thumbs, one atop the other, massage the bottom of your foot just above your heel with a clockwise motion. [10] X Research source"
    },
    {
      "title": "Massage the inside edge of your foot.",
      "content": "Massage the inside edge of your foot. Applying gentle pressure and using small circular motions, work your way down your instep from your big toe to your heel. Spend approximately two seconds on each point, and repeat the process three times. [11] X Research source"
    },
    {
      "title": "Finish with the heel and tops of the feet.",
      "content": "Finish with the heel and tops of the feet. Rub the heel in a circular motion with your thumb or knuckle for approximately 30 seconds. [12] X Research source Then use your thumbs to apply gentle pressure to the tops of the feet as you drag your thumbs along the spaces between your toes, which run from your toe webbing to the highest point of your foot. [13] X Research source"
    },
    {
      "title": "Concentrate on the areas you feel might be causing your chest pain.",
      "content": "Concentrate on the areas you feel might be causing your chest pain. Now that you have massaged your entire foot, return to the areas you feel might be causing the pain and spend extra time on them."
    },
    {
      "title": "Massage the balls of your feet below your little toes for lung problems.",
      "content": "Massage the balls of your feet below your little toes for lung problems. The reflexes for your lungs start at the base of your toes and extend down to the bottom of the ball of your foot, where the color of your skin changes. Also massage the corresponding area on the top of your foot."
    },
    {
      "title": "Work on the balls of your feet just below your big toes for heart problems.",
      "content": "Work on the balls of your feet just below your big toes for heart problems. According to reflexology theory, this should help for issues like arrhythmia."
    },
    {
      "title": "Concentrate on the neck reflexes at the base of your toes to relieve acid reflux, heartburn or other chest pain associated with your throat and esophagus.",
      "content": "Concentrate on the neck reflexes at the base of your toes to relieve acid reflux, heartburn or other chest pain associated with your throat and esophagus."
    },
    {
      "title": "Apply pressure to the reflex points for you stomach, small intestine, and gall bladder to treat digestive problems.",
      "content": "Apply pressure to the reflex points for you stomach, small intestine, and gall bladder to treat digestive problems. Your stomach reflex point is on the sole of your left foot just beneath the lung reflex point. The small intestine reflex is located on the soles of your feet in the arch area. The gal bladder reflex point is on the sole of your right foot, where the left hand thumb is in the picture above."
    },
    {
      "title": "Start by massaging your entire hand.",
      "content": "Start by massaging your entire hand. According to reflexology theory, this will help to relax you and flush toxins from your system. Also, general massage has been proven to reduce pain and improve quality of life. [14] X Research source"
    },
    {
      "title": "Warm up and relax your hand.",
      "content": "Warm up and relax your hand. Hand reflexology points are located more deeply than the similar points on your foot, so warming up your hand is very important to avoid pain. Gently rub massage oil or moisturizer into the wrist of your hand, using gentle, sweeping motions with your thumb for about 30 seconds. Continue these sweeping motions as you move up to the palm of the hand, sweeping from the inside of the palm to the edges for about 30 seconds. Turn you hand over and gently run your thumb from the webbing between your fingers to the top of your wrist. Grip each finger and give it a gentle side to side twist, rotating the knuckle joint. Move your hand up and repeat with the second joint and top joint of each finger. Repeat these steps with your other hand."
    },
    {
      "title": "Work on your fingers.",
      "content": "Work on your fingers. Starting with the tip of your thumb, use your thumb and index finger to squeeze and apply pressure in a gentle circular motion for 3 to 5 seconds. Work your way down your thumb two times, then repeat with your other fingers. Do the same for you other hand."
    },
    {
      "title": "Massage the palm of your hands.",
      "content": "Massage the palm of your hands. For each area of your palm, you will move downwards, then back up, and then to the side and start down again. At each point, apply gentle, rotational pressure for 3-5 seconds. Start on the soft padding under your fingers. Move on to the center of your palm. Work on the outer edge of your hand, starting under the little finger and continuing to the wrist. Massage the base of your hand, moving from your thumb to the outer edge of you hand. Finish by moving from left to right and back again across your wrist."
    },
    {
      "title": "Move on to the backs of your hands.",
      "content": "Move on to the backs of your hands. Remember to apply much less pressure, as the back of your hand is very sensitive. Starting at the knuckle at the base of your thumb, apply gentle, rotational pressure for 3 to 5 seconds. Work down to the wrist, then move sideways. Continue working from the knuckles to the wrist until you have covered the entire back of your hand. Apply gentle pressure as you work across your wrist."
    },
    {
      "title": "Concentrate on areas that you feel might be causing your chest pain.",
      "content": "Concentrate on areas that you feel might be causing your chest pain. Spend extra time on these areas, applying gentle rotational pressure as you work across them, point by point. Lung problems – Focus on the soft padding just below your fingers on the palm of your hand, and on the equivalent area on the back of your hand. Heart problems – Work on the fleshy area at the base of your thumbs. Digestive problems – Work on the areas from the base of your fingers to the last knuckle to stimulate your neck reflexes. Massage the center of your palms to stimulate your stomach and gall bladder. Work across the base of your palm to aid digestion in your small intestine. Stress related problems – Work on your entire finger to stimulate the reflex points associated with the head and neck in order to relieve stress."
    },
    {
      "title": "Start by massaging your entire ear.",
      "content": "Start by massaging your entire ear. According to reflexology theory, this will help to relax you and flush toxins from your system. Also, general massage has been proven to reduce pain and improve quality of life. [15] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source"
    },
    {
      "title": "Warm up your ears.",
      "content": "Warm up your ears. Rub your hands together quickly, then hold them over your ears for 15 seconds. Rub them again, and hold them over your ears for 15 seconds with the tops of your earlobes folded down."
    },
    {
      "title": "Massage your ear lobes.",
      "content": "Massage your ear lobes. The ear lobe contains reflex points for your head. Pinch and pull the lobe between your index finger and thumb for about 3 minutes. You can do both ears at the same time. [16] X Research source"
    },
    {
      "title": "Stimulate the insides of your ears.",
      "content": "Stimulate the insides of your ears. Place your index fingers in your ears and rotate them back and forth about 50 times to stimulate and relax your heart and lungs."
    },
    {
      "title": "Move on to the cymba conchae.",
      "content": "Move on to the cymba conchae. This the narrow part of your ear above the ridge that sits over the ear canal, and below another ridge of cartilage. Run your index finger back and forth along the cymba conchae of both ears about 50 times to stimulate the digestive system. [17] X Research source"
    },
    {
      "title": "Continue upward to the triangular fossa.",
      "content": "Continue upward to the triangular fossa. This is the small depression on the far side of the ridge of cartilage that forms the upper boundary of the cymba conchae. Press your index finger gently into the triangular fossa and rotate back and forth about 50 times. [18] X Research source"
    },
    {
      "title": "Run your thumbs along the upper, outer part of your ear.",
      "content": "Run your thumbs along the upper, outer part of your ear. This area – the helix and scaphoid fossa – consists of the curving cartilage at the top of your ear and the space just under it. It contains the reflex points for your arms and shoulders. Pinch it between your thumb and forefinger, then run your thumb down the area repeatedly until it is warm. [19] X Research source"
    },
    {
      "title": "Stimulate the surface from the concha to the cymba conchae.",
      "content": "Stimulate the surface from the concha to the cymba conchae. There is a ridge of cartilage above your ear lobes. Start by using your index fingers to apply gentle presser to the depression on the far side of that ridge. Now run your fingers along the cartilage ridge on the back of the ear and up to the cymba conchae, and back again. Do this 30 times."
    },
    {
      "title": "Pinch the tragus between thumb and forefinger and gently move it up and down.",
      "content": "Pinch the tragus between thumb and forefinger and gently move it up and down. The tragus is the flap of cartilage that protrudes over your ear canal. Move it up and down 30 times."
    },
    {
      "title": "Massage the back of your ear.",
      "content": "Massage the back of your ear. The back of the ear is divided into and upper, more flexible part, and a lower part that surrounds the ear canal and attaches to the ear lobe. Start by pinching the upper area between your index finger and thumb and pulling on it 30 times. Then gently rub the lower part with your thumb 30 times, using a downward motion."
    },
    {
      "title": "Concentrate on the reflex points connected to the areas you think are causing your chest pain.",
      "content": "Concentrate on the reflex points connected to the areas you think are causing your chest pain. Now that you have stimulated your entire ear, spend a little extra time on problem areas. At each point, work until you feel a warm sensation in your ear or until your feel discomfort. Lung and heart problems – Focus on the inside or your ear. Place your index fingers in your ear and rotate gently. You can also gently pull up, down, and to the sides to stimulate the inner ear. Digestive problems – Run your index finger back and forth over the cymba conchae to stimulate the reflex points associated with the stomach, intestines, liver, colon, spleen, and gall bladder. Stress related problems – Rub your ear lobe, and then run your index finger along the ridge of cartilage that forms the lower border of the cymba conchae and leads up to the triangular fossa. This will trigger the reflexes for your head, neck, and spine."
    }
  ]
}