{
  "url": "https://www.wikihow.com/Tell-if-You-Need-Wide-Shoes",
  "title": "How to Know If You Have Wide Feet & Need Wide Shoes",
  "steps": [
    {
      "title": "Discomfort or pain",
      "content": "Discomfort or pain If you frequently notice discomfort or pain while wearing shoes, it may be a sign that you have wide feet. This is especially true if the pain is in the toe area, sides, or ball of your foot. [1] X Research source"
    },
    {
      "title": "Pressure marks or discoloration",
      "content": "Pressure marks or discoloration When you take off your shoes, examine your feet for redness, indentations, or other visible irritation along the sides of your feet. Pressure marks or discoloration often indicate that your shoes are exerting excessive pressure because they’re too narrow. [2] X Research source"
    },
    {
      "title": "Toe or foot spillover",
      "content": "Toe or foot spillover When you wear sandals or other open-toed shoes, check to see if your toes or the sides of your feet spill over the edges of the shoe. If your toes extend beyond the shoe boundaries or the sides appear stretched, your shoes may not be wide enough. [3] X Research source"
    },
    {
      "title": "Numbness or tingling",
      "content": "Numbness or tingling If you frequently experience numbness or tingling in your toes, your shoes may not fit properly. Your shoes may be compressing the nerves in your foot due to their insufficient width, which, in turn, reduces your circulation. [4] X Research source"
    },
    {
      "title": "Flat feet",
      "content": "Flat feet While those with flat feet don’t always need wide shoes, this is often the case. Feet with collapsed and unsupported arches need more support than the average foot, and wide shoes provide more comfort and security than standard or narrow shoes. [5] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Bunions, corns, or hammer toes",
      "content": "Bunions, corns, or hammer toes In some cases, medical conditions like bunions and hammer toes are caused by wearing shoes that are too narrow, as this often causes inflammation or joint issues. To provide comfort and prevent these conditions from worsening, it’s often advised to wear wide shoes. [6] X Trustworthy Source Harvard Medical School Harvard Medical School's Educational Site for the Public Go to source Bunions occur when shoes that are too narrow put excessive pressure and strain on the joints of your feet. Hammer toes refer to the improper bending of the toes, as well as possible inflammation or pain in the first or second joints. Wearing shoes that are too tight may also lead to other issues like corns , calluses, and blisters ."
    },
    {
      "title": "Ill-fitting shoes",
      "content": "Ill-fitting shoes Shoe size refers to more than just length, so if you find yourself buying shoes that are the right length but feel too constricting, you may need wide shoes. Wearing ill-fitting shoes may cause your feet to cramp up and develop lesions, so it’s important to find a pair that fits properly. [7] X Research source If possible, avoid sizing up lengthwise and instead opt for a wide shoe. Wearing shoes that are too long can be uncomfortable and may cause you to trip more frequently."
    },
    {
      "title": "Morton’s neuroma",
      "content": "Morton’s neuroma Morton’s neuroma is a medical condition that causes pain and numbness in the ball of the foot and occurs when a nerve between the toes is thickened and irritated. Those with this condition often benefit from wearing wide shoes, as they offer relief by reducing pressure on the nerve and offering more space in the toe area. [8] X Research source"
    },
    {
      "title": "Professional feedback",
      "content": "Professional feedback Sometimes, the best way to determine your foot width is to consult a shoe-fitting professional, a podiatrist, or a chiropodist to get an accurate measurement. They can determine whether you have wide feet or another condition, provide advice on how to find your perfect fit and help you get custom orthotics if necessary. [9] X Research source"
    },
    {
      "title": "Trace the outline of your foot on a piece of paper.",
      "content": "Trace the outline of your foot on a piece of paper. Place a piece of paper larger than your foot on a flat, hard surface like the floor. Sit or stand in a comfortable, natural position and place your foot flat on the paper. Trace the outline of your foot, holding the pen or pencil vertically for accuracy. [10] X Research source"
    },
    {
      "title": "Measure the distance of the widest part of your foot.",
      "content": "Measure the distance of the widest part of your foot. Mark the points where the widest part of your foot touches the outline. For most people, this will be at the base of the big toe (the ball of the foot) and the outer edge of the pinky toe. Use a ruler or tape measure to measure the distance between these two marks. This is the width of your foot. [11] X Research source"
    },
    {
      "title": "Repeat with the other foot.",
      "content": "Repeat with the other foot. Once you have the measurement for one foot, repeat the outlining and measuring process with the other foot. Usually, one foot is slightly larger than the other, so use the larger measurement when determining your shoe size. [12] X Research source"
    },
    {
      "title": "Refer to a sizing chart to determine if you should buy a wide shoe size.",
      "content": "Refer to a sizing chart to determine if you should buy a wide shoe size. Once you have your measurements, refer to the size chart of the shoe brand you’re looking at or the shoe store you’re shopping in. Some brands may label their shoe widths differently, so this will help ensure you find the correct size . [13] X Research source Remember, your personal comfort matters more than the exact measurement. If you have specific preferences, medical conditions, or anything else that affects comfort, consider trying on a wider width than what your official measurement suggests."
    },
    {
      "title": "A wide foot is wider than the range for a regular-fit shoe.",
      "content": "A wide foot is wider than the range for a regular-fit shoe. The exact width for your feet to be considered wide varies depending on your shoe size. For example, a regular foot width for a size 7 is about 3.5 inches (89 mm), while a wide size 7 is between 3.75–4.25 inches (95–108 mm). Men’s shoes also tend to be wider than women’s, so keep that in mind when determining if you have a wide foot. [14] X Research source"
    },
    {
      "title": "Narrow",
      "content": "Narrow A narrow foot width is smaller than a medium or standard foot width. Narrow shoes are usually about 1 ⁄ 4 inch (6.4 mm) slimmer than the manufacturer’s standard width. Shoe widths vary depending on the manufacturer and style, so be sure to follow their guidelines when determining if you need narrow, standard, or wide shoes. [15] X Research source Common size labels: N, B for Men, 2A for women Note: The labels listed in this section are common ways of labeling shoe width, but the exact label may vary from brand to brand. Always check the brand’s sizing chart to be sure."
    },
    {
      "title": "Medium or standard",
      "content": "Medium or standard The “normal” shoe width is typically referred to as medium or standard depending on the brand. This size is the average foot width and length that manufacturers follow when making shoes and is the size most commonly found in stores. [16] X Research source Common size labels: M, D for men, B for women"
    },
    {
      "title": "Wide",
      "content": "Wide Wide-width feet and shoes are wider than standard shoes, providing more room at the forefoot and midfoot. Wide shoes are typically 1 ⁄ 4 inch (6.4 mm) wider than standard shoes and are designed for those who find standard shoes too constricting. Common size labels: W, 2E for men, D for women"
    },
    {
      "title": "Extra wide",
      "content": "Extra wide Some shoe brands also offer extra wide shoes, which offer maximum width. These shoes are designed for those with significantly wider feet or conditions that require extra space, like bunions. Common size labels: XW or EW, 4E for men, 2D for women In many cases, the more E’s there are on a shoe label, the wider the fit."
    },
    {
      "title": "Genetics",
      "content": "Genetics Wide feet are often genetic, meaning they could run in your family. Those who are genetically predisposed to wide feet are often born with them, or they may find that their feet widen over time as they age. Flat feet are also genetic, and many people with flat feet also have wide feet. [17] X Research source"
    },
    {
      "title": "Age",
      "content": "Age As you age, there’s a chance your feet can become wider. This is because aging causes ligaments to loosen, which in turn can cause the width of your foot to broaden. Other age-related medical conditions and injuries can also cause feet to widen either rapidly or over time. [18] X Research source"
    },
    {
      "title": "Deformities",
      "content": "Deformities If you have congenital or acquired foot or toe deformities, your feet may expand and become wider. Conditions like club foot, claw toe, and crossover toe often require wide shoes to keep the condition from worsening and to prevent issues like calluses and blisters. [19] X Research source"
    },
    {
      "title": "Incorrect footwear",
      "content": "Incorrect footwear If you consistently wear incorrect footwear for an extended period of time, it can physically change the shape of your foot. Shoes with small toe boxes or narrow forefoot widths can compress the foot and cause conditions like bunions and hammer toe. [20] X Research source"
    },
    {
      "title": "Pregnancy",
      "content": "Pregnancy When you’re pregnant, your feet may swell during the gestation period, which temporarily causes the foot to become wide or extra wide. While this should subside after the pregnancy is over, it is important to wear properly fitting shoes to ensure foot safety and decrease foot pain during the pregnancy. [21] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source"
    },
    {
      "title": "Medical conditions",
      "content": "Medical conditions Many medical conditions, including diabetes, kidney disease, and heart problems, often cause feet to widen due to edema, or swelling. In some cases, the swelling may decrease if the medical condition is addressed, but fluid retention or some medications may permanently make the foot wider. [22] X Research source"
    },
    {
      "title": "Not all shoes are available in wide width.",
      "content": "Not all shoes are available in wide width. Unfortunately, not all shoe brands make wide-width shoes, and those that do may not offer wide-width in every style. [23] X Research source If you’re shopping online, you may be able to search by width to see all of the available options."
    },
    {
      "title": "Open-sided shoes",
      "content": "Open-sided shoes Open-sided shoes tend to have a more relaxed fit, which is beneficial for those with wide feet. They provide extra space and comfort and are especially popular with those who have bunions or hammer toes. Open-sided shoes are extra comfortable if they’re made of a soft material, like suede. [24] X Research source"
    },
    {
      "title": "Open-toed sandals",
      "content": "Open-toed sandals Open-toed sandals are great options for those with wide feet, as they allow the toes to spread naturally. Just make sure your toes and the sides of your feet fit comfortably and don’t spill over the sides of the shoes. [25] X Research source"
    },
    {
      "title": "Almond and square-toed shoes",
      "content": "Almond and square-toed shoes Almond and square-toed shoes both offer a larger toe box, allowing your toes to spread out comfortably as you walk. This helps prevent the pinching sensation that often comes with wearing narrow shoes. [26] X Research source"
    },
    {
      "title": "Sneakers",
      "content": "Sneakers Many sneakers come with a broader toe box than other shoes, which provides more space and makes them more comfortable for those with wider feet. A lot of sneaker brands provide wide-width shoes, as well. [27] X Research source"
    },
    {
      "title": "Round-toed boots",
      "content": "Round-toed boots Round-toed boots offer space and comfort while providing a dressier look. They’re often designed to accommodate wider feet and provide flexibility and comfort for all-day wear. [28] X Research source"
    },
    {
      "title": "Platform sandals",
      "content": "Platform sandals Platform sandals typically come with padded insoles that provide extra support for wide feet. These shoes often look cute and trendy while allowing you to wear them for an extended time without discomfort."
    },
    {
      "title": "Therapeutic or orthopedic footwear",
      "content": "Therapeutic or orthopedic footwear Therapeutic and orthopedic footwear are available in wider widths and are designed for individuals with wide and/or flat feet. Consider trying custom orthopedic shoes or orthotic inserts if you struggle to find comfortable footwear. [29] X Research source"
    },
    {
      "title": "Are wide shoes better for flat feet?",
      "content": "Are wide shoes better for flat feet? Having flat feet doesn’t necessarily mean you need wide shoes, but there is often a correlation between the two. Flat feet occur when the arch of the foot collapses, which often makes the feet appear wider. Wearing wider shoes often offers better arch support and provides more comfort than normal-width shoes. [30] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source"
    },
    {
      "title": "Should I go up a size if I have wide feet?",
      "content": "Should I go up a size if I have wide feet? If possible, opt for wide-width shoes in your correct size for the best fit and the most comfort. However, not all shoe brands and styles offer wide-width, so in this case, your best option is to size up to get some extra space. Wearing shoes that are too tight can be uncomfortable and even cause medical conditions like bunions, calluses, or hammer toes. [31] X Research source"
    },
    {
      "title": "Can I wear wide-fit shoes if I have normal-width feet?",
      "content": "Can I wear wide-fit shoes if I have normal-width feet? People with standard-width feet may find wide-width shoes more comfortable, especially if they wear custom orthotics or spend a lot of time standing. While it’s usually okay to wear wide shoes if you have normal-width feet, keep in mind that wearing ill-fitting shoes may lead to discomfort, reduced support, and an increased risk of tripping. [32] X Research source"
    },
    {
      "title": "How much wider are wide shoes?",
      "content": "How much wider are wide shoes? In general, wide shoes are a 1⁄4 inch (6.4 mm) wider than standard shoes, and extra wide shoes are a 1⁄2 inch (13 mm) wider than standard. Wide shoes offer more space in the toe box, which accommodates tall and deep feet, as well as medical conditions like bunions and hammer toes. [33] X Research source"
    },
    {
      "title": "Are all shoes the same width?",
      "content": "Are all shoes the same width? No, shoes may vary in width depending on the brand and style. Therefore, you may need a wide width in one brand and a normal width in another. If possible, try shoes on before buying so you can find the perfect fit for you. Otherwise, use the brand’s sizing chart to find your size. [34] X Research source"
    }
  ]
}