{
  "url": "https://www.wikihow.com/When-to-Walk-Away-After-Home-Inspection",
  "title": "When to Walk Away After a Home Inspection",
  "steps": [
    {
      "title": "Schedule the inspection after you put your earnest money down.",
      "content": "Schedule the inspection after you put your earnest money down. The earnest money refers to the $1,000-10,000 deposit you put down after your offer is accepted. This money goes towards your down payment, and it proves that you have skin in the game and won’t disappear after signing the offer. Schedule your inspection after paying the earnest money. [1] X Research source A timeline typically kicks in when your offer is accepted, but it depends on the state and the market. You may have to complete the inspection within 3-7 days of the contract signing. You cannot lose your earnest money if your inspection reveals something worth walking away from so long as there is a state law allowing you to walk away or you have an inspection contingency in your contract."
    },
    {
      "title": "Ask tons of questions during the inspection to identify red flags.",
      "content": "Ask tons of questions during the inspection to identify red flags. A good inspector will explain what’s a big deal and what isn’t. You should walk away from the inspection feeling like you understand what every pipe, switch, and fixture is for! When you come across problems (and you will—even brand-new homes aren’t perfect), ask the inspector how big of a deal the problem is. They’ll explain the severity of the issue. [2] X Research source Ask for both the cost and the intensity of the issue. Some problems, like a dead outlet, may be cheap and quick fixes that require very little effort, time, and money. Other issues, like a structurally unsafe garage, may cost tens of thousands of dollars and take a long time to repair. This is why hiring a reputable, experienced inspector is so essential. Once the inspector wraps everything up, they’ll compile a report that includes recommendations for what should be fixed. You’ll get this report in 1-3 days after the inspection."
    },
    {
      "title": "Confirm with your broker that you have an inspection contingency.",
      "content": "Confirm with your broker that you have an inspection contingency. Some states have built-in laws protecting buyers after the home inspection, but talk to your broker to be sure. If there is no law, ask your broker to put an inspection contingency in the contract before you make your first offer. This way, you can call it quits if you find anything in the inspection that you aren’t comfortable with. [3] X Research source People occasionally waive inspection contingencies when the housing market is hot. As tempting as this may be, it’s extremely risky to give up your ability to walk and it is never recommended. [4] X Research source"
    },
    {
      "title": "The laws on when you can walk away differ from state to state.",
      "content": "The laws on when you can walk away differ from state to state. Every state has different laws when it comes to real estate deals, but you can typically walk away after the inspection. If you can’t, tell your broker to put an inspection contingency in the contract before you make your first offer. This way, you can call it quits if you find anything in the inspection that you aren’t comfortable with. [5] X Research source Remember, you get to ask the seller to fix any issues you run into. You don’t have to walk away until after you hear what they’re willing to fix. Then again, some problems may be so bad that no amount of work can make this appealing."
    },
    {
      "title": "Ongoing health risks",
      "content": "Ongoing health risks High levels of radon, black mold, carbon monoxide, lead-based paint, and signs of electrical fire damage are all potentially life-threatening problems that cannot be fixed cheaply (or potentially at all). If your inspection flags one of these major issues, you’re likely best off walking away. [6] X Research source Radon is a colorless gas that increases your risk of cancer. You can install a radon mitigation system, but the presence of radon at all can be very worrisome and if the system ever fails, you may not catch it in time. [7] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source Mold is problematic for two reasons. First, it’s a sign there’s a moisture/water issue elsewhere. Second, many species of mold, like black mold, can increase your risk for health issues. [8] X Trustworthy Source United States Environmental Protection Agency Independent U.S. government agency responsible for promoting safe environmental practices Go to source"
    },
    {
      "title": "Money pits",
      "content": "Money pits Money pits refer to problems that you’ll just keep throwing money at because the fixes are so inefficient and expensive. If you spot a major issue where the fix isn’t quick and easy, you may be better off moving on. [9] X Research source A leaky roof can be patched, but unless you completely replace it, another area is likely to going to start leaking eventually. Roof replacement can cost $3,000 to $20,000 depending on the size and material. You can patch cracked stucco, but the fact that it’s cracking at all is a sign all of it will eventually need to be replaced. Stucco replacement can cost up to $20 a square foot. You can kill a termite infestation, but there’s no way to know how deep the damage goes a lot of the time. You may need to disassemble entire walls to replace the joists. Termite damage can cost up to $100 per square foot."
    },
    {
      "title": "Structural issues",
      "content": "Structural issues You want nothing to do with a home that might collapse randomly. If the inspector finds any walls, floors, or rooms that are potentially unsafe to inhabit, you’re better off not playing with fire and moving on. While structural issues can be fixed, they can be extremely expensive, and there’s no guarantee you’ll permanently solve the problem. [10] X Research source Signs of structural issues include cracks in the foundation, leaning walls, bulges in walls, soil piling up in weird shapes around the exterior, uneven gaps on windows and doors, and sagging roofs. It can cost up to $10,000 or more to fix average structural damage. However, it can be very hard to know if the underlying problem (which is often invisible/underground) has been resolved entirely."
    },
    {
      "title": "Roofing problems",
      "content": "Roofing problems Any roof-related issue can be a serious pain to fix. Leaks, missing shingles, splotchy asphalt, and missing shingles, and damaged flashing are all signs there’s something wrong with the roof. While you can certainly replace a roof or fix an underlying issue, it can be a serious headache. Minor problems can have major underlying implications, and hiring someone to get up on the roof can be time consuming and expensive. [11] X Research source Home inspectors normally don’t get up on the roof unless there is direct roof access, which means they’ll need to lean on their naked eye to spot problems. As such, there’s always an added level of mystery and danger with roof issues."
    },
    {
      "title": "Pests and infestations",
      "content": "Pests and infestations Rat and termite damage can be costly, hidden, and dangerous. Getting rid of a wasp nest or clearing a bird’s nest is one thing, but termites, rats, racoons, and other pests can destroy parts of your home that you can’t possibly get a look at. On top of that, there’s the question of how the pests got in. Lastly, things like rat excrement can carry disease. All around, it’s a lot of potential issues for a buyer to live with. [12] X Research source If your inspection reveals signs of pest damage, you can hire a special pest inspector to determine just how serious the issue is."
    },
    {
      "title": "Water damage",
      "content": "Water damage It’s very hard to know just how deep a problem with water is. Water damage may not be the end of the world, but it can certainly be a good reason to walk away if there’s a serious underlying problem. For example, water in the basement could be a cracked sewer main that requires $10,000+ in repairs, or it could be a leaky water line on the sink, which is a $10 DIY repair. Just investigate carefully! [13] X Research source If you cannot find the source of water damage, it is very likely that you’re best-off walking away from the home."
    },
    {
      "title": "Electrical issues",
      "content": "Electrical issues Many electrical problems are fixable, but some of them can be dangerous. If the electrical panel in the basement is a rat’s nest of loose wires and mislabeled, it’s possible you’re walking into a dangerous and costly repair. [14] X Research source Other serious electrical issues include hot outlets, flickering lights, evidence of burning wires, and ungrounded fixtures. [15] X Research source Look at the quality of the work. DIY electrical work is a major red flag. If the problems are simple and easy to repair, like upgrading to GCFI outlets or capping a single loose wire, don’t worry."
    },
    {
      "title": "Mechanical problems",
      "content": "Mechanical problems A worn-down furnace or faulty fridge can be expensive to replace. Mechanical repairs are not typically worth walking away from on their own, but they do factor into the equation. These kinds of repairs are impossible to do on your own, and they tend to be on the pricier side. Even if nothing looks damaged, just note how run-down or old everything is, since these repairs will come up eventually. [16] X Research source Replacing a furnace or central air system can cost $2,000-10,000 depending on the size of your home. Appliances can run you $300-10,000 depending on how fancy you want to get and how many appliances need to be replaced. An AC condenser will likely run you $500-4,000 depending on the size of your home."
    },
    {
      "title": "Environmental and location-based risks",
      "content": "Environmental and location-based risks You can’t move a building, so walk if there are big environmental risks, like wildfires, floods, or earthquakes. Avoid buying a home right in the heart of a dangerous path. Avoid valleys in a flood zone, don’t buy directly over a fault line, and pass on homes in densely forested parts of a wildfire-prone area."
    },
    {
      "title": "Title issues",
      "content": "Title issues Always purchase title insurance to ensure the worst doesn’t happen. Most states require title insurance, but you absolutely need it if your state doesn’t. If the previous owner has lien on their property and you aren’t insured, your transaction could fall through. Even worse, you could end up in a legal battle or fall on the hook for some expensive costs. [17] X Research source Title insurance also protects you against easements, conflicting wills, encroachments, and all kinds of wacky, complicated legal issues that can come up."
    },
    {
      "title": "You should probably walk if the counterparty won’t negotiate.",
      "content": "You should probably walk if the counterparty won’t negotiate. After the inspection, you’ll work with your broker to send in a list of repair requests. If the counterparty refuses to work with you on key repairs, you should consider walking away. [18] X Research source Be reasonable with your requests. As tempting as it may be to ask for every single thing that came up in the inspection, you want to try and meet the seller halfway as a sign of good faith. When you can walk away from a home purchase depends on your state laws and the contract. In most cases, you’ll have 3-7 days after they respond to your repair requests. Many (if not most) sellers these days will deduct from the price of the home and offer credits instead of making the repairs themselves. This can be a good thing for you! If they offer $10,000 for a repair and you find someone to do it for $8,000, you came out ahead!"
    },
    {
      "title": "Hire specialty inspectors for unique problems that require more info.",
      "content": "Hire specialty inspectors for unique problems that require more info. Normal inspectors are generalists. If they spot something but they aren’t an expert on the issue (or can’t investigate due to technical limitations), hire a specialized inspector to perform a second inspection. Go back to the home to perform the special inspection to get the additional info you need. [19] X Trustworthy Source Consumer Reports Nonprofit organization dedicated to consumer advocacy and product testing Go to source For example, if the normal inspector stumbles across small holes in the basement that might be termites or could be normal wear-and-tear, reach out to a home inspector who specializes in pests and termite damage to confirm or disprove the general investor’s theory. You may need a special inspector to scope clogged pipes to see if they’re damaged, test for radon, analyze mold, or appraise foundation issues."
    },
    {
      "title": "When to walk is always subjective, so trust your gut here.",
      "content": "When to walk is always subjective, so trust your gut here. How you feel after the inspection means a lot. If your inspector was rattling off issues during the walkthrough and you go home feeling like this is just the wrong home for you, don’t go through with it. You should walk out of the inspection feeling good about it, not worried. You’ll know it when you find the right home for you! [20] X Research source It’s okay if a home has a major issue so long as you’re willing to tackle it. If a property has a damaged roof but it meets every single one of your requirements otherwise and you’re in love with it, maybe it’s worth it to you."
    },
    {
      "title": "Don’t talk yourself into a bad thing just because you’re tired of looking.",
      "content": "Don’t talk yourself into a bad thing just because you’re tired of looking. House hunting can be exhausting, but there are more fish in the sea. Even if you feel like there’s no more housing inventory in the area you’re looking, new homes come on the market all the time. It can hurt to feel like you got so close to closing with the inspection, but buying a home is a huge financial decision. Don’t rush it—you should be in love with your home. [21] X Research source At the same time, remember that there is no home out there that doesn’t have a least 1 defect that will come up at the inspection. It’s all a question of what you’re willing to live with."
    }
  ]
}