{
  "url": "https://www.wikihow.com/Write-an-Attorney-Client-Privilege-Email",
  "title": "How to Send a Privileged & Confidential Email to Your Attorney",
  "steps": [
    {
      "title": "Reference attorney-client privilege in the subject line.",
      "content": "Reference attorney-client privilege in the subject line. Include the words \"Privileged,\" \"Confidential,\" or \"Attorney-Client Communication\" in the subject line of your email. Make these words stand out as much as possible by typing them in all caps or putting asterisks on either side. [1] X Research source For example, if you write ***PRIVILEGED AND CONFIDENTIAL*** in the subject line of your email, it's less likely that anyone would miss it. Many attorneys add a disclaimer to the \"signature\" block of their emails stating that the material in their emails is subject to attorney-client privilege. However, these disclaimers don't provide blanket protection. A note in the subject line ensures that the recipient knows the email is privileged before they open it."
    },
    {
      "title": "Make your request for legal advice clear and specific.",
      "content": "Make your request for legal advice clear and specific. Not every conversation you have with an attorney is considered privileged, even if you're writing to an attorney you've specifically hired to represent you in a legal matter. The privilege only applies when you solicit legal advice. If you make this request upfront, there will be no room for debate regarding what the email is about. [2] X Trustworthy Source American Bar Association Leading professional organization of lawyers and law students Go to source For example, if you're in the process of getting a divorce and want advice on how to talk to your spouse about matters that concern your children, you might write: \"I am writing this email to request legal advice regarding communication with my spouse about our daughter's swimming lessons in a way that does not violate the judge's order.\""
    },
    {
      "title": "Discuss only legal advice in your emails.",
      "content": "Discuss only legal advice in your emails. In some contexts, you might have other things that you want to talk about with your attorney that don't have anything to do with legal advice. In those situations, it's better to write separate emails so that the communication you want to be confidential and privileged remains that way. [3] X Research source For example, suppose you've hired an attorney to represent you in a recent lawsuit against your company. You also want to talk to that attorney about how you can revise your vendor contracts to avoid similar lawsuits in the future. Advice on contracts would likely be considered business advice, rather than legal advice, so you should write two separate emails."
    },
    {
      "title": "Send the email to your attorney only.",
      "content": "Send the email to your attorney only. The attorney-client privilege only protects confidential communication between you and your attorney that is related to their legal representation of you. If you include anyone else in the conversation, the things you say in the email (or that the attorney says in reply) likely won't be considered privileged. [4] X Trustworthy Source American Bar Association Leading professional organization of lawyers and law students Go to source Even if someone else is involved in the matter that you're discussing with your attorney, it's better to email them separately. This may seem inefficient, but it ensures that your communications with your attorney remain privileged."
    },
    {
      "title": "Use a private email address to communicate with your attorney.",
      "content": "Use a private email address to communicate with your attorney. If you have an email account that others can access, that access could mean that any emails back and forth between you and your attorney are no longer privileged. This also applies to work email addresses, even if you're the owner of the company, if it's possible for anyone else to access your email account. [5] X Trustworthy Source American Bar Association Leading professional organization of lawyers and law students Go to source For example, if you have a household email address that both you and your spouse use, avoid using that email to communicate with your attorney (unless the attorney is representing both you and your spouse in the same legal matter). If you're in the habit of leaving your email inbox open on your home computer or if you receive email on a smartphone that other people in your home can access, create a separate email address that you only use for privileged communications with your attorney."
    },
    {
      "title": "",
      "content": "Subject line: PRIVILEGED COMMUNICATION Hello, [Attorney Name], I am writing this email to ask for your advice on how to begin a lawsuit against [Person or Company's Name] for [offense]. Please let me know what details and documentation you would need. I would like to get started as soon as possible. Sincerely, [Your Name]"
    },
    {
      "title": "Refrain from discussing emails from your attorney with others.",
      "content": "Refrain from discussing emails from your attorney with others. Even in a casual setting, making a comment such as \"my attorney advised me not to do that\" could result in an accidental waiver of your attorney-client privilege because you're discussing the content of the advice with someone else. If a subject comes up that you have advice from your attorney on, simply say that you're not at liberty to discuss it and change the topic of conversation. [6] X Trustworthy Source American Bar Association Leading professional organization of lawyers and law students Go to source Don't mention that you talked to your attorney about the topic at all if you want to avoid accidentally waiving your attorney-client privilege. For example, if someone asks you why you took a particular action, you wouldn't want to say \"I did what my attorney told me to do.\" With that kind of statement, you're basically telling the other person what your attorney told you in confidence."
    },
    {
      "title": "Ask your attorney before you share information with others.",
      "content": "Ask your attorney before you share information with others. If your attorney is advising you on a matter that potentially impacts others, you may want to share your attorney's advice with them. However, doing so could destroy the privileged nature of that communication if that person isn't substantially involved in the matter. [7] X Research source For example, suppose you've consulted an attorney for advice on a lawsuit recently filed against your company. You may want to share the attorney's advice with your business partner. However, if your partner isn't considered the attorney's client, this might mean that advice is no longer considered privileged. If you need to involve other people in a legal matter, your attorney can advise you on what to tell them and how so that your attorney-client privilege is preserved."
    },
    {
      "title": "Start a new email chain rather than forwarding or copying non-attorneys.",
      "content": "Start a new email chain rather than forwarding or copying non-attorneys. Email chains are dangerous for attorney-client privilege because someone in the chain could inadvertently hit \"reply all\" at any time and destroy the privilege. If you want to share information provided to you by your attorney, compose a new email to that person and relay that information separately. [8] X Research source Likewise, if you're forwarding an email or email chain to your attorney because it's relevant to your case, mark the email clearly as a forward, then compose a separate email in which you ask for legal advice or relay any confidential information. This also works in the reverse. If your attorney forwards you an email from someone else, or copies you on an email, start a new email chain rather than talking to your attorney in the same chain."
    },
    {
      "title": "Meet in person to convey particularly sensitive information.",
      "content": "Meet in person to convey particularly sensitive information. Even the most secure computers and email accounts are still not as secure as talking in person. Generally, it's best not to put the most sensitive information in writing. For example, if you're in the middle of a contentious divorce and you want to get your attorney's advice on damaging information you've learned about your spouse, meet with them in person rather than writing the information in an email. Call, rather than email, your attorney to let them know you want to meet to discuss a sensitive and confidential matter."
    },
    {
      "title": "Lock all devices that access privileged communications with strong passwords.",
      "content": "Lock all devices that access privileged communications with strong passwords. Use a password to lock devices that only you know. The best passwords include upper- and lower-case letters along with other characters (such as *, $, or %) that make them difficult for others to guess. Make them 16 characters long and unique for each account and device. [9] X Research source Set your devices so that they lock automatically if you're not using them for a couple of minutes, and make sure you close or lock the device if you walk away from it."
    },
    {
      "title": "Set up two-factor authentication (2FA) for added security.",
      "content": "Set up two-factor authentication (2FA) for added security. 2FA authentication requires you to follow at least two login steps before accessing your electronic device or email account. It may take you a little extra time to log in, but just think of it as a double layer of protection against hacking or spying. [10] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source For example, you can set up your Gmail account to require you to enter a password and enter a code sent to your cell phone number. You can also set up your smartphone to unlock only when you type in the proper passcode and use face-recognition technology."
    },
    {
      "title": "Log out of email accounts when you're done using them.",
      "content": "Log out of email accounts when you're done using them. You may have a habit of leaving your email account open on your home computer or your mobile device so you can access it quickly when you get an email. However, this habit also enables others to read potentially privileged emails you receive from your attorney, which can destroy the attorney-client privilege. [11] X Research source If you receive emails on a smartphone or other mobile device, turn off the \"preview\" function that allows you to see part of the email through a notification on your home or lock screen. If you leave your phone laying on a table where anyone can see the preview, you could destroy the privileged nature of an email from your attorney. On iOS : Open Settings, tap Notifications, and select the Mail app. Then tap Show Previews and select When Unlocked or Never. [12] X Research source On Android : Open the Gmail app, tap the Menu button in the top left corner, then tap Settings. Go to General settings, then tap Manage notifications. Toggle the button on the next screen to turn off your Gmail notifications. [13] X Research source"
    },
    {
      "title": "Send and receive emails only on devices that you control.",
      "content": "Send and receive emails only on devices that you control. Specific rules vary depending on where you live, but generally, it's best not to send privileged or confidential information to your attorney on a computer or other device that doesn't belong solely to you. In some states, judges have ruled that using a computer or server that belongs to someone else means they potentially have access to your email, even if you're using a password-protected email account. For example, if you're talking to an attorney about filing a discrimination lawsuit against your employer, wait until you get home to email them, rather than emailing them from your company computer. If the email passes through your company server, the company may have the right to access those emails."
    },
    {
      "title": "Access your electronic devices only on secure networks.",
      "content": "Access your electronic devices only on secure networks. A secured WiFi network is encrypted and requires a password. You can secure your home internet connection by creating a strong password and changing your router settings to secure your home internet as WPA 3 Personal or WPA2 personal. The latter will scramble any information coming out of your home via your WiFi. [14] X Trustworthy Source Federal Trade Commission Website with up-to-date information for consumers from the Federal Trade Commisson Go to source When you're out at coffee shops, restaurants, hotels, or airports, use a Virtual Private Network (VPN) to protect your device's information and IP address from being detected or hacked."
    },
    {
      "title": "Encrypt your emails if you communicate with your attorney regularly.",
      "content": "Encrypt your emails if you communicate with your attorney regularly. Most web-based email services use basic encryption called Transport Layer Security (TLS), but you can beef it up with client-side encryption apps or Chrome extensions. Once encrypted, the recipient will need a passkey to open and read the email. [15] X Research source For example, if you use Gmail, you can encrypt your emails using an encryption app like Virtru or a Chrome extension like FlowCrypt or Mailvelope . [16] X Research source If your attorney sends you documents to review and you save them on your computer, encrypt those files as well so that only you can open them and read them."
    }
  ]
}