{
  "url": "https://www.wikihow.com/Write-a-Monologue-for-a-Play",
  "title": "How to Write a Monologue for a Play",
  "steps": [
    {
      "title": "Decide the perspective of the monologue.",
      "content": "Decide the perspective of the monologue. The monologue should be from the perspective of one character in the play. Focusing on the point of view of one character can help to give the monologue purpose and a distinct character voice. [1] X Research source You can write a monologue for the main character to give them a chance to speak on their own, or for a minor character to give them a chance to finally express themselves."
    },
    {
      "title": "Determine the purpose of the monologue.",
      "content": "Determine the purpose of the monologue. Consider what the point of the monologue is, as it should serve a key purpose within the rest of the play. The monologue should reveal something to the audience that cannot be revealed through dialogue or character interaction. This could be a story, a secret, an answer to ongoing questions in the play, or an emotional release by a character. Your monologue should serve a clear purpose and act as a revelation for the speaker. The monologue should add tension, conflict, or emotion to the rest of the play and give the audience new insight into an existing issue or problem. For example, if there's a character who has been mute during the first act, they could have a monologue in the second act where they reveal why they are mute."
    },
    {
      "title": "Decide who will be addressed in the monologue.",
      "content": "Decide who will be addressed in the monologue. You should determine who your speaker will be talking to or addressing in the monologue so you can frame the monologue with the audience in mind. [2] X Expert Source Ben Whitehair Acting Coach Expert Interview. 3 June 2021. The monologue may be addressed to a specific character in the play, the speaker may be addressing themselves, or they may be addressing the audience. A monologue can address a specific character, especially if the speaker wants to express their emotions or feelings to them. The character can also express their thoughts or feelings about an event for the audience's benefit."
    },
    {
      "title": "Consider the beginning, middle, and end of the monologue.",
      "content": "Consider the beginning, middle, and end of the monologue. A good monologue will have a clear beginning, middle, and end. Like a mini-story, the monologue should also include a clear shift from the beginning to the end, where the speaker has a revelation or a realization. Your monologue should begin and end with a purpose. Create an outline that includes a beginning, middle, and end for the monologue. Note what will occur in each stage of the monologue. For example, you may write: “Beginning: Elena the mute speaks. Middle: Elena tells us why and how she became mute. Ending: Elena realizes she prefers staying silent to saying her thoughts out loud.” Alternatively, write the first and last lines of the monologue, then create the content between them to generate ideas and thoughts for the monologue."
    },
    {
      "title": "Read other monologues.",
      "content": "Read other monologues. You can get a better sense of structure for your monologue by reading monologues in other plays. These monologues have been written with the larger play in mind but they can also stand on their own as contained dramatic pieces. Several examples include: The Duchess of Berwick’s monologue in Oscar Wilde’s Lady Windermere’s Fan . [3] X Research source Jean’s monologue in August Strindberg’s Miss Julie . [4] X Research source Christy’s monologue in John Millington Synge’s The Playboy of the Western World . [5] X Research source “My Princesa” monologue by Antonia Rodriguez."
    },
    {
      "title": "Start the monologue with a hook.",
      "content": "Start the monologue with a hook. Your monologue should get the listener’s attention right away and draw them in. You want to hook your audience so they are willing to listen to your character’s monologue. The opening line of your monologue will set the tone for the rest of the piece and give the audience a sense of the characters voice’s and language. You may start the monologue with a big revelation right away, such as Christy’s monologue in John Millington Synge’s The Playboy of the Western World . [6] X Research source Christy's monologue tells the audience right away that the speaker killed his father. It then discusses the events leading up to the murder and how the speaker feels about his actions."
    },
    {
      "title": "Use your character’s voice and language.",
      "content": "Use your character’s voice and language. The monologue should be written from the perspective of one character and should feature their unique language and voice. A strong character voice in a monologue can go a long way to adding color, interest, and perspective to the piece. Use your character’s voice when you write the monologue and include any slang or particular phrasing they might use. For example, the “My Princesa” monologue is written from the perspective of a Latino father. He uses terms and sayings that are specific to him, such as “whoop his ass” and “Oh hell naw!” These make the monologue engaging and add character detail. Another example is The Duchess of Berwick’s monologue. Wilde uses the character’s casual, conversational tone to reveal the plot and keep the audience engaged. [7] X Research source"
    },
    {
      "title": "Allow your character to reflect on the past and the present.",
      "content": "Allow your character to reflect on the past and the present. Many monologues discuss the present action of the play by reflecting back on past events. You should strive to have a balance between reflection on the past and discussion of the present in your monologue. The past details should illuminate an event or character dilemma in the present. The character should try to use memory to address an issue in the present. [8] X Research source For example, in his monologue, Christy addresses his father's murder by reflecting on past choices and moments that may have lead to his pivotal decision."
    },
    {
      "title": "Add description and detail.",
      "content": "Add description and detail. Keep in mind your audience will not have the luxury of flipping to a visual image of what is happening in the monologue. All they can rely on is the words you use in the monologue to describe a certain moment or a certain detail. You should try to tie in as many of senses as you can in your monologue so the audience becomes immersed in the events in the monologue. [9] X Research source For example, Jean’s monologue opens with striking images of his childhood, “I lived in a hovel provided by the state, with seven brothers and sisters and a pig; out on a barren stretch where nothing grew, not even a tree...” The details in the monologue help to paint a clear picture of Jean’s childhood hovel. They also add to his character and help the reader get a better sense of his past."
    },
    {
      "title": "Include a moment of discovery.",
      "content": "Include a moment of discovery. Your monologue should include a moment of discovery or a revelation. This could be a moment of discovery for the speaker or a moment of discovery for the audience. Having a revelation in the monologue will give it purpose. The revelation should also up the stakes of the play so it contributes to the play as a whole. [10] X Research source For example, in his monologue, Christy reveals that his father was not a very considerate person or a good father. He explains that he did the world a favor by killing his father. [11] X Research source"
    },
    {
      "title": "Have a button ending.",
      "content": "Have a button ending. The monologue should have a clear ending or a button ending, where the thoughts expressed in the monologue are brought to a conclusion. The speaker should accept something, overcome an issue or obstacle, or make a decision about a conflict in the play. The decision moment should be clear and the speaker should speak with decisive action by the end of the monologue. [12] X Research source For example, in his monologue, Jean reveals that he tried to kill himself because he was born too low to be with Miss Julie. He then ends the monologue with a reflection on what he learned about his feelings for Miss Julie. [13] X Research source"
    },
    {
      "title": "Cut down the monologue to the essentials.",
      "content": "Cut down the monologue to the essentials. An effective monologue will not be too long or expansive. It should include the essentials of the monologue and hit the reader with just enough information to move the play forward. You should read over the monologue and revise it so it does not seem long-winded or overdone. Remove any redundant lines or awkward phrases. Cut out any words that do not add to the character’s voice or language. Include only the essential details in the monologue."
    },
    {
      "title": "Read the monologue out loud.",
      "content": "Read the monologue out loud. A monologue is written to be read out loud to an audience so you should test its effectiveness by reading it out to yourself or to a sympathetic audience. You should listen to ensure the monologue has a distinct character voice and uses language that suits the speaker. Note moments where the monologue is confusing or verbose. Simplify these areas so the monologue is easy to follow for the listener."
    },
    {
      "title": "Have an actor perform the monologue for you.",
      "content": "Have an actor perform the monologue for you. If possible, you should try to find an actor who can perform the monologue with you as the audience. You may ask a friend to perform the monologue or hire an actor. Getting a professional to read your monologue can help bring it to life and allow you to revise it for the stage."
    }
  ]
}