{
  "url": "https://www.wikihow.com/Use-Autosuggestion",
  "title": "How to Use Autosuggestion",
  "steps": [
    {
      "title": "Identify the things you want to change.",
      "content": "Identify the things you want to change. Decide what personality traits you want. Identify the bad habits you want to get rid of. Determine the obstacles you want to overcome. Choose something that you really desire. Make sure it is consistent with your other goals, specific and detailed, not harmful to others, and is challenging but realistic."
    },
    {
      "title": "Choose something believable.",
      "content": "Choose something believable. Make sure the autosuggestion is believable to yourself. If you don't believe it, then it will not work. For example, instead of saying “I make $100,000 per year,” say “I choose to earn $100, 000 per year.” [2] X Research source"
    },
    {
      "title": "Use emotions.",
      "content": "Use emotions. In order for an autosuggestion to work, it must trigger feelings. The more meaningful the autosuggestion is to you, the more effective it is. [3] X Research source"
    },
    {
      "title": "Use the first person.",
      "content": "Use the first person. The autosuggestions are for you and no one else. Don't make your autosuggestions based on what you want other people to be or how they think you should be. Make the autosuggestion what you want to be"
    },
    {
      "title": "Be positive.",
      "content": "Be positive. Autosuggestions are more effective when paired with positive thinking. Using positive statements also keep you motivated to accomplish your goals. Avoid negativity. Avoid using negative phrases such as “I cannot,” “I will not,” or “I do not want.” For example use “I am brave,” instead of “I am not afraid.”"
    },
    {
      "title": "Avoid creating a time limit.",
      "content": "Avoid creating a time limit. This can cause stress, which will interfere with your meditations and goals."
    },
    {
      "title": "Practice the autosuggestion you created.",
      "content": "Practice the autosuggestion you created. Use meditation, sleep, or writing to practice autosuggestion. The more your practice your autosuggestion, the faster it will work."
    },
    {
      "title": "Use meditation to autosuggest.",
      "content": "Use meditation to autosuggest. In a relaxed state, your mind is more open to new ideas and directions."
    },
    {
      "title": "Find somewhere comfortable.",
      "content": "Find somewhere comfortable. You want an environment that is comfortable and relaxing. Make sure it is a quiet place where you won't be disturbed."
    },
    {
      "title": "Use music.",
      "content": "Use music. Music is a great tool for relaxing your mind. Use music that helps you focus. Only use music if it helps you meditate. Do not use music if it distracts you."
    },
    {
      "title": "Sit comfortably.",
      "content": "Sit comfortably. Either sit crossed legged on the floor or in a chair with your legs uncrossed. Make sure that you are comfortable and well supported. It's best to keep both feet on the ground if you are sitting in a chair."
    },
    {
      "title": "Keep your eyes partially open.",
      "content": "Keep your eyes partially open. If you do not want to keep your eyes open, find a room with enough light to come through your eyelids. While relaxed, you might fall asleep."
    },
    {
      "title": "Make yourself relaxed.",
      "content": "Make yourself relaxed. While you sit comfortably, try to relax and let go of your thoughts. Breath deeply and regularly. Focus your attention on a point right below your navel. Once you are aware of this spot, only pay passive attention to it."
    },
    {
      "title": "Detach yourself.",
      "content": "Detach yourself. If a thought comes to you, do not engage it. Acknowledge the thought and let it go. You want to avoid active participation. Any active participation might make you tense and distract you."
    },
    {
      "title": "Repeat your autosuggestions.",
      "content": "Repeat your autosuggestions. Once you feel completely relaxed, repeat your autosuggestion to yourself. Put as much emotion as you can into the autosuggestion. Visualize yourself performing the autosuggestion."
    },
    {
      "title": "Spend at least twenty to thirty minutes in meditation regularly.",
      "content": "Spend at least twenty to thirty minutes in meditation regularly. You want to give yourself enough time to focus on the autosuggestions so that you can absorb them. [4] X Research source"
    },
    {
      "title": "Record your autosuggestion.",
      "content": "Record your autosuggestion. You can record your autosuggestion into a voice recorder or into a recording program on your phone. Make sure you put the recording on repeat so that it will play continuously while you're asleep. Make sure you record your autosuggestions in a strong, but soft voice. You want to it to be commanding yet gentle. If you don't like the sound of your voice, have a friend or family member record it using second person."
    },
    {
      "title": "Use the second person.",
      "content": "Use the second person. Unlike the other methods, you will use the second person. You are commanding yourself. For example, instead of saying “I am a courageous person,”say “you are a courageous person.”"
    },
    {
      "title": "Repeat each line ten times.",
      "content": "Repeat each line ten times. Make sure you repeat each line ten times before moving to the next sentence. Repeat each affirmation until you have a thirty minute recording."
    },
    {
      "title": "Use headphones while you are asleep.",
      "content": "Use headphones while you are asleep. Make sure the headphones allow you to sleep easily. For instance, if you sleep on your side, use earbuds to rest your head easier."
    },
    {
      "title": "Make yourself relax.",
      "content": "Make yourself relax. While you sit or lie comfortably, try to relax and let go of your thoughts. Breath deeply and regularly. The mind is most open to suggestion when it is relaxed."
    },
    {
      "title": "Listen to them as you fall asleep.",
      "content": "Listen to them as you fall asleep. The affirmations will be absorbed into your unconscious as you sleep."
    },
    {
      "title": "Use the recording for 14 consecutive nights.",
      "content": "Use the recording for 14 consecutive nights. Repetition will help you absorb the affirmation. After the 14-day period, move on to a new affirmation."
    },
    {
      "title": "Schedule a time.",
      "content": "Schedule a time. Pick a specific time to visualize your autosuggestions. Setting a schedule will help you maintain a consistent schedule, which will help the autosuggestions succeed. The moments before you sleep and when you awake are the best because you are more prone to suggestion."
    },
    {
      "title": "Make yourself relax.",
      "content": "Make yourself relax. While you sit comfortably, try to relax and let go of your thoughts. Breath deeply and regularly. Visualization and autosuggestion work best when you are relaxed since you mind is more open to suggestion."
    },
    {
      "title": "Close your eyes.",
      "content": "Close your eyes. You can stand or sit during this method with your eyes closed."
    },
    {
      "title": "Repeat your selected autosuggestion.",
      "content": "Repeat your selected autosuggestion. As you repeat your autosuggestions, visualize yourself experiencing them. Attach as much meaning as you can to what you imagine. The more emotion you put into the visualization, the more efficient it becomes. [5] X Research source"
    },
    {
      "title": "Make the images as vivid as possible.",
      "content": "Make the images as vivid as possible. Try to involve every sense as you imagine your autosuggestion coming to life. Try to see, hear, feel, smell, and touch the scene your picture."
    },
    {
      "title": "Attach emotion to the visualization.",
      "content": "Attach emotion to the visualization. Imagine how the autosuggestion would make you feel. Attach that feeling to what you picture. For example, if you see yourself getting a promotion, imagine how you would feel if that happened: happy, successful and self-assured."
    },
    {
      "title": "Act out your experience.",
      "content": "Act out your experience. Visualize scenes in which you are using your autosuggestion. Slightly move your body and use hand gestures as you would in a situation where you would use your autosuggestion. For example, if your autosuggestion is “I am a good public speaker,” then picture yourself giving a wonderful speech in front of an audience. Imagine yourself doing hand gestures and emphasizing your point."
    },
    {
      "title": "Repeat the visualization.",
      "content": "Repeat the visualization. Try to visualize two or three times a day. Make sure you practice the visualization consistently. Visualization and autosuggestion only work if you repeatedly do them."
    },
    {
      "title": "Fold a paper lengthwise.",
      "content": "Fold a paper lengthwise. Unfold the paper and write a list of negative things you wish to change down the left side. Write down everything that comes to mind. You want to be as spontaneous and genuine as possible."
    },
    {
      "title": "Listen to yourself.",
      "content": "Listen to yourself. Over the next few days, listen to yourself as you talk to other people. Focus on what you're saying. Write down every negative self-talk statement that you notice."
    },
    {
      "title": "Write positive statements.",
      "content": "Write positive statements. Rewrite every negative statement into a positive statement. Do this on the right side of paper. Use the most powerful words you can. For example, instead of saying “I'm smart,” say “I am intelligent and insightful.” [6] X Research source Avoid using the future tense. Say “I am” rather than “I will be.” If you feel uncomfortable saying “ I am,” you can say “I'm learning to...” or “I'm getting better at…” instead. Use a thesaurus if you cannot think of more powerful words."
    },
    {
      "title": "Fold the paper in half.",
      "content": "Fold the paper in half. Do not refer to the negative side again. You want your mind to think that you are done with those thoughts. Now, you will train it how to think positively."
    },
    {
      "title": "Place the folder paper where you'll see it.",
      "content": "Place the folder paper where you'll see it. Pin it to the refrigerator or tape it to a bathroom mirror. Make sure that the positive statement side is showing. You don't have to linger over the list. It's only there as reminder that you're transforming yourself."
    },
    {
      "title": "Pay attention to what you say.",
      "content": "Pay attention to what you say. Stop yourself anytime you say one of the old, negative statements. Once you stop yourself, say the new, positive statement immediately."
    }
  ]
}