{
  "url": "https://www.wikihow.com/Use-a-Pumice-Stone",
  "title": "Pumice Stone Uses: Tips, Tricks, & Techniques",
  "steps": [
    {
      "title": "Soak your calloused skin in warm water for 5 minutes.",
      "content": "Soak your calloused skin in warm water for 5 minutes. The feet are the most common part of the body to exfoliate with a pumice stone . Heels tend to develop a layer of hard, calloused skin that can become cracked or scaled. Additionally, your elbows may be another area that could benefit from exfoliation. Soak your calloused body part in warm water for about 5 minutes to soften the skin. [1] X Trustworthy Source Cleveland Clinic Educational website from one of the world's leading hospitals Go to source If you're working on your feet, fill a bowl with warm water and make a foot spa . Pumicing as part of your shower routine may be easiest for other body parts you want to exfoliate, like your legs. Use pumice stones for manicures by gently rubbing it across the skin around your nails."
    },
    {
      "title": "Wait until your dry skin has softened.",
      "content": "Wait until your dry skin has softened. Your dead skin will be easier to remove if it's soft and supple—see ya, scales! Touch your skin after around 5 minutes of soaking. If it still feels hard, wait a few more minutes (giving the water a warm-up if necessary). If it's soft to the touch, your skin is ready for the pumice stone. [2] X Research source"
    },
    {
      "title": "Wet the pumice stone in soapy water.",
      "content": "Wet the pumice stone in soapy water. Getting the pumice stone wet will help it slide more easily across your skin. Run the stone under warm water with a bit of mild soap, or dip it where you're soaking your skin to wet it thoroughly. [3] X Research source"
    },
    {
      "title": "Rub the pumice stone in circular motions over the calloused area.",
      "content": "Rub the pumice stone in circular motions over the calloused area. Use gentle, circular motions to slough away the dead skin like corns and calluses with the pumice stone. As you’ve soaked your skin so it's nice and soft, the dry, dead cells should come right off. Keep going until you remove all the dead skin and get to the fresh, supple skin underneath. [4] X Research source Don't press too hard. Light pressure is all that's needed—let the stone's surface do the work for you. If you're working on your feet, focus on the heels, the sides of your toes, and other areas where dry skin tends to build up."
    },
    {
      "title": "Rinse off the dead skin and go over any stubborn areas again.",
      "content": "Rinse off the dead skin and go over any stubborn areas again. Wash or wipe off the dead skin from the area you’re pumicing and take a look to see if you need to keep going. If you still see bits of dead skin, go over the area again with the pumice stone. Continue using the stone on the area until you're satisfied with the results. [5] X Research source Be careful not to rub your skin raw. Since the pumice stone will wear down slightly as you use it, turn it over for extended use. Rinse the pumice stone with water as you go to keep its surface clean and effective."
    },
    {
      "title": "Dry and moisturize your skin.",
      "content": "Dry and moisturize your skin. When you've finished exfoliating with the pumice stone, use a towel to pat your skin dry. Then, coat the area with an oil or lotion to lock in moisture. Your formerly calloused skin should now be soft, supple, and gleaming! [6] X Trustworthy Source American Academy of Dermatology Professional organization made of over 20,000 certified dermatologists Go to source Coconut oil , almond oil or body lotion are all awesome ways to condition your skin after pumicing. Repeat as often as needed to keep your skin in good shape."
    },
    {
      "title": "Scrub your pumice stone after each use.",
      "content": "Scrub your pumice stone after each use. Dead skin will build up in the stone's pores as you use it, so clean the stone after each use. Use a scrub brush to scrub the stone while holding it under running water. Add a bit of mild soap to help clean the stone completely. This way, your stone will be clean and ready for action the next time you need it. [7] X Research source Use a mild soap, like Dawn, to avoid damaging the stone."
    },
    {
      "title": "Allow your pumice stone to dry out completely.",
      "content": "Allow your pumice stone to dry out completely. Set the pumice stone in a dry place, so it doesn't stay damp between uses. Some pumice stones come with a string attached that allows you to hang the stone to dry. If you let the stone stay wet, bacteria could grow in the pores, making it unsafe to use. [8] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source"
    },
    {
      "title": "Boil your pumice every 2 weeks.",
      "content": "Boil your pumice every 2 weeks. If you use your pumice stone often, give it a deep cleaning every 2 weeks to ensure it isn't harboring bacteria. Bring a small pot of water to a full boil, drop in the stone, and boil it for 5 minutes. Use tongs to remove the stone from the water and allow it to dry completely before storing it. [9] X Trustworthy Source Michigan Medicine The University of Michigan's medical center, which provides patient care, supports research, and educates the public on health topics Go to source If you've used the stone on a dirty surface, add a capful of bleach to the water to ensure all the bacteria get killed."
    },
    {
      "title": "Replace your pumice stone every 2-4 weeks.",
      "content": "Replace your pumice stone every 2-4 weeks. Pumice is a soft stone that will eventually wear away with continued use or become unsanitary. When it gets too small to handle easily, or the surface becomes too smooth to be effective, spring for a new one. [10] X Research source"
    },
    {
      "title": "Use a pumice stone to remove hair.",
      "content": "Use a pumice stone to remove hair. The ancient Greeks used pumice to remove body hair, and because it’s so effective, people still do! Start by soaking your skin in the bath or the shower until it's warm and soft. Then, wet the pumice stone, and rub your skin using gentle, circular motions. Within 30 seconds, the area you're rubbing will be hair-free. [11] X Research source The effects of pumicing are similar to that of shaving. Because pumicing is an effective way to exfoliate, it also prevents ingrown hairs! Pumicing should not be painful. If you feel pain, make sure you aren't pressing too hard."
    },
    {
      "title": "Use a pumice stone to remove pills from clothing.",
      "content": "Use a pumice stone to remove pills from clothing. The soft, porous pumice surface is perfect for taking pills and lint off clothing . If you have a sweater you've wanted to clean up, start by laying it on a flat surface. Then, rub a dry pumice stone over the pilling in circular motions. Don't press too hard since you don't want to damage the fibers of the garment—gentle pressure is all that's needed to take the pills right off! [12] X Research source"
    },
    {
      "title": "Clean your toilet with a pumice stone.",
      "content": "Clean your toilet with a pumice stone. Pumice stones can even remove copper rings from the inside of a toilet—what can’t this little stone do? Put on a pair of nonporous cleaning gloves to start. Then, rub the pumice stone over the ring with scrubbing motions. Repeat until the ring is gone, and voila! [13] X Research source Use a pumice stone with toilet cleaner for more stubborn stains. Use separate stones for toilet cleaning and body use. Do not use the same stone for both purposes."
    },
    {
      "title": "Use a pumice stone to clean your oven.",
      "content": "Use a pumice stone to clean your oven. Thoroughly wet your pumice stone with water, then use scrubbing motions to remove built-up grime and grease on the outside and inside of your oven. Be sure to wet your pumice stone frequently to avoid scratching. [14] X Research source Add your favorite oven cleaner to your pumice stone for extra cleaning power."
    },
    {
      "title": "Try using a pumice stone as an essential oil diffuser.",
      "content": "Try using a pumice stone as an essential oil diffuser. If you’ve wanted to try a diffuser but have been hesitant due to the price, look no further than the humble pumice stone. Apply 1-2 drops of your favorite essential oil to a dry, clean pumice stone and hang it in a place you want to smell great! [15] X Research source You can also place it in a bowl or dish in high-traffic areas like your kitchen or living room."
    },
    {
      "title": "Remove pet hair and dander with a pumice stone.",
      "content": "Remove pet hair and dander with a pumice stone. We love our pets, but shedding on our upholstery and carpets can be frustrating! The great news is pumice stones are incredibly effective at lifting and collecting dirt and dander. Go over the area using short motions in one direction and watch as hair comes off with ease. [16] X Research source Pumice stones aren’t rough enough to damage or snag your furniture—just be sure to apply light pressure to the surface you’re removing pet hair from."
    }
  ]
}