{
  "url": "https://www.wikihow.com/Wear-a-Thick-Scarf",
  "title": "How to Wear a Thick Scarf",
  "steps": [
    {
      "title": "Take the scarf in both hands and drape it behind your neck.",
      "content": "Take the scarf in both hands and drape it behind your neck. Hold the scarf lengthwise in your hands so that the material makes a straight line. Dangle the fabric behind your neck so that two-thirds of the fabric rests over one shoulder and one third rests over the other. This will make the scarf easier to loop later on. [1] X Research source This method works best with a rectangular scarf or any scarf with a relatively short width. You can purchase one at most department stores."
    },
    {
      "title": "Bring the longer portion of the scarf over and around your shoulder.",
      "content": "Bring the longer portion of the scarf over and around your shoulder. Take the longer piece of scarf that’s dangling over your chest and flip it around so that it surrounds your neck completely. This keeps your neck warm while also creating a fashionable look. [2] X Research source"
    },
    {
      "title": "Pull the longer portion of the scarf back into its original position.",
      "content": "Pull the longer portion of the scarf back into its original position. Use 1 or both hands to bring the longer portion of the scarf back to its initial spot around your neck. The scarf will look more evenly distributed as it dangles down your chest. [3] X Research source Make sure that scarf isn’t tied too tightly around your neck."
    },
    {
      "title": "Tug both sides of the scarf to ensure that they’re equal in length.",
      "content": "Tug both sides of the scarf to ensure that they’re equal in length. Grab the bottom of each scarf piece and give them both a small tug to make sure that they’re even. It may help to do this in front of a mirror. [4] X Research source This classic scarf style goes with almost any look. Try wearing a scarf with a long-sleeved shirt or sweater, slim pants or skinny jeans, and ankle-high boots."
    },
    {
      "title": "Hold the scarf lengthwise in both hands so that the fabric is flat.",
      "content": "Hold the scarf lengthwise in both hands so that the fabric is flat. Extend your arms while holding the fabric in both hands. This ensures that the material is one flat layer when you begin the folding process. [5] X Research source You’ll want to use a larger scarf for this look. Use fabric that’s a large square or rectangle shape so you can fold it into a triangle. A blanket scarf is perfect for this! [6] X Expert Source Rachel Michael Personal Stylist Expert Interview. 30 November 2021."
    },
    {
      "title": "Fold the scarf in half so that it looks like a big triangle.",
      "content": "Fold the scarf in half so that it looks like a big triangle. Take the scarf fabric and fold it so that the opposite corners meet. Since this style aims to look like a big bandana, you’re essentially going to be folding your scarf like you would fold smaller bandana fabric. Make sure that the material is evenly distributed at the corners before you continue. [7] X Research source"
    },
    {
      "title": "Tie 2 folded ends of the triangle together around your neck with a basic knot.",
      "content": "Tie 2 folded ends of the triangle together around your neck with a basic knot . Use an underhand knot to tie the leftmost and rightmost corners of the fabric together along the back of your neck. This secures the fabric in place and keeps your neck cozy with a long bandana. [8] X Research source Take the ends of fabric that you used to tighten the knot and tuck them beneath the sides of the scarf. This style looks great with an open jacket. You can also try wearing it with a long-sleeved, knee-length dress. [9] X Research source"
    },
    {
      "title": "Extend your arms while holding the fabric lengthwise to flatten it to a single layer.",
      "content": "Extend your arms while holding the fabric lengthwise to flatten it to a single layer. Hold the corners of the fabric with your fingers and stretch your arms apart so that the fabric is as flat as possible. This will make it easier to fold and drape the scarf around yourself later on. [10] X Research source For this look, you’ll want to use a large blanket scarf. A normal rectangular scarf won’t be wide enough for this style."
    },
    {
      "title": "Fold the scarf in half so that the short ends are touching.",
      "content": "Fold the scarf in half so that the short ends are touching. Minimize the material by taking the scarf fabric and folding it in half. By making the surface area of the scarf smaller, it’ll be much easier to put the fabric over your shoulders later. [11] X Research source Make sure that the patterned side is facing outward when you fold the scarf."
    },
    {
      "title": "Secure the 2 adjacent ends together with an underhand knot.",
      "content": "Secure the 2 adjacent ends together with an underhand knot. Tie together the top corners of the scarf that you are holding in your hands. Use an underhand knot when securing them together, as this will be the easiest to manage with a bulkier fabric. By tying these corners together, you’ll be able to wear the scarf like a garment. [12] X Research source Make sure that you don’t tie the opposite corners together. Double-knot if necessary. To make sure that the corners are securely tied together, knot them again if the fabric allows."
    },
    {
      "title": "Open the fabric along the fold so that 2 openings are visible.",
      "content": "Open the fabric along the fold so that 2 openings are visible. Separate each side of the folded fabric so that you can see 2 openings on the left and right side of the knot. These will serve as the sleeve holes for your scarf cardigan. [13] X Research source"
    },
    {
      "title": "Slide your arms through the openings like you’re putting on a vest.",
      "content": "Slide your arms through the openings like you’re putting on a vest. Pretend that you’re trying on a vest as you stick your arms through the scarf openings. Slide the fabric into place so it rests securely on your shoulders and the knot is in the back. [14] X Research source This cardigan style looks great with a polo or long-sleeved button-down shirt. [15] X Research source It also looks very stylish when worn over a long, flowy dress and secured in place with a belt. [16] X Research source"
    },
    {
      "title": "Fold the infinity scarf and place it around your neck.",
      "content": "Fold the infinity scarf and place it around your neck. Flatten the looped material so that it looks like a straight line that matches or exceeds the length of your shoulder span. Put the scarf around the back of your neck so one side hangs over each of your shoulders. [17] X Expert Source Rachel Michael Personal Stylist Expert Interview. 30 November 2021. [18] X Research source The wider your scarf is, the cozier it will be. If you don’t want to buy an infinity scarf, you can knit or crochet one with thick yarn."
    },
    {
      "title": "Pull the right side of the scarf through the loop of material on the left side.",
      "content": "Pull the right side of the scarf through the loop of material on the left side. Take the right portion of the infinity scarf in one hand and hold it so that it remains flattened. Use your other hand to stretch apart the opening of the scarf. Pull the right piece of the scarf through the opening, and tug it tight. [19] X Research source"
    },
    {
      "title": "Center the scarf and untuck your hair if necessary.",
      "content": "Center the scarf and untuck your hair if necessary. Adjust with both hands to ensure that it’s centered, and take out any hair that’s still covered by the scarf. Use a mirror if you want to make sure that the material is aligned in the middle of your neck. [20] X Research source If you need extra assistance, feel free to ask a friend or family member for help. Infinity scarves work great with a cozy winter outfit, like a sweater or long-sleeved shirt."
    }
  ]
}