{
  "url": "https://www.wikihow.com/Take-Control-of-a-Relationship",
  "title": "How to Take Control of a Relationship",
  "steps": [
    {
      "title": "Improve your self-worth.",
      "content": "Improve your self-worth. Learn to value yourself more as a unique individual with just as many rights in your relationship as he has. Write down a list of your best qualities and also the qualities that you would like to improve on. Rather than conceptualizing your weakness as being bad, you can view them as things you have room to improve on. Another way to improve your self-worth is to stop comparing yourself to others. For one, you only see the side of others that they advertise to you; you aren't getting the full picture, which can lead to a warped perception. For example, you might feel like someone has it all going for them but on the inside he might be sad, afraid, or have low self-worth. Second, if improving yourself is important to you, why not just focus on yourself? Still a further way to improve your self-worth is to adopt a flexible self-view. That is, it is important to evaluate yourself based on your worth now, rather than trying to fit your worth into an outdated definition of yourself. For example, if you define high self-worth as being a good tennis player, because you were in high school, but you aren't so good at tennis anymore, you might suffer from low self-worth. Instead, focus on things that you are good at as an adult. For example, maybe you're a great parent or you are great at managing your money. Once you have improved your self-worth, you may feel you deserve more power, and this motivational force will help you obtain more power."
    },
    {
      "title": "Believe in yourself.",
      "content": "Believe in yourself. He may try to 'gaslight' you, by engaging in psychological manipulation that makes you question yourself. Do not fall for this. Instead, believe in yourself as a sane, rational, intelligent individual. [2] X Research source To believe in yourself, think about times you successfully made choices on your own that led to good outcomes. Reflect on these when you are doubting whether you can make good decisions on your own."
    },
    {
      "title": "Keep an ultimatum in mind (to yourself).",
      "content": "Keep an ultimatum in mind (to yourself). You may feel powerless because you feel trapped in your relationship. However, remember (to yourself) that if you are completely unhappy with your partner, you have the option of ending the relationship. Remind yourself that there are other people out there and you can have another relationship in the future - one that has more of a balanced power dynamic. In most cases, it is not a good idea to express this ultimatum to your partner, since doing so can damage your relationship. Instead, just remember this information when you are feeling completely out of control and powerless, as it can help you gain more confidence as you navigate your relationship. [3] X Research source An example of an ultimatum you might keep in mind to yourself is, \"if — after two months of not seeing any desired change, despite my explicitly telling my partner I would like us to have more of a balanced relationship and despite me actively trying to work with him to change the relationship for the better — I see no progress in that regard, I will end the relationship because it will mean I am still unhappy.\""
    },
    {
      "title": "Assess the nature of your relationship.",
      "content": "Assess the nature of your relationship. Make sure that you are in a relationship where it is worth gaining power back instead of just walking away. If you find yourself in an abusive relationship, whether that abuse is physical or psychological, ask yourself whether it is worth staying around. Signs of an abusive relationship include when your partner: Humiliates or embarrasses you. Engages in affairs. Ignores or excludes you. Threatens to physically harm you, or actually physically harms you. Showcases unreasonable jealousy. Demonstrates extreme moodiness. Guilt trips you. Threatens to kill himself if you leave. Uses money to control your behavior. Withdraws affection from you. Uses sarcasm towards you and a mean voice. Is Hypercritical of you."
    },
    {
      "title": "Stand up for yourself.",
      "content": "Stand up for yourself. You may have gotten in the habit of just going along with everything he says regardless of whether you agree with it. While it is normal to concede and give in to your partner's choices from time to time to be a generous loving relationship partner, it is not normal for one partner to always get his or her way. To gain back some power in your relationship, it can help to express your thoughts and opinions more. [4] X Expert Source Liana Georgoulis, PsyD Licensed Psychologist Expert Interview. 6 September 2018. [5] X Research source For example, say he always decides where you go out for dinner. If you don't feel like going to where he wants to, suggest a different place. If he ridicules you or says no, say that you no longer feel like going out for dinner. At the end of the day, for him to be in a relationship with you, you have to be an active willing participant; this fact, ultimately, can be used as a source of power for you."
    },
    {
      "title": "Have a conversation about power.",
      "content": "Have a conversation about power. It is possible that your partner does not realize that he has been exerting too much power in the relationship. So, before drawing any nasty conclusions about your partner, you should voice your concerns with him. Let him know that you feel that you have no or little control in the relationship and that you would like more. Be sure to lay out specific examples of ways that you would like more power. For example, if you feel that you are always spending time with his friends, but he never spends time with yours, let him know that you would like this area to be more balanced. Avoid making overarching statements about your partner, but instead point to specific examples. Overarching statements such as \"you're a power hungry jerk\" can be damaging and antagonizing. Instead, point to specifics such as, \"you seem to decide who we hang out with most of the time and I would like more of a say in that arena.\" [6] X Research source"
    },
    {
      "title": "Increase your independence.",
      "content": "Increase your independence. Maybe he has all the power because you have lost all independence in your life. If you are doing everything together and he is calling all the shots, it can easily begin to feel like you have no power. Work to develop your own interests. Through this you may form new friendships, all of which can help you increase your sense of independence. For example, you might start a hobby; this can help you become more independent by making your well-being less tied up in your partner. Depending on the hobby, it can also be a great way to find new friends; having friends is another way to increase your independence. [7] X Research source When you feel like your life outside of your relationship is rich, you will be less likely to feel that you \"need\" this other person, and less likely to give into his power antics. You may come to realize that you don't need him if he continues to be such an unfair partner; this realization (if both you and him come to it) can, in fact, increase your power. Reader Poll: We asked 563 wikiHow readers what activity, pursuit, or goal they were most motivated to pursue, and only 7% of them said Prioritizing social connections with friends and family. [Take Poll] Many people let relationships with friends and family slide when they get involved with someone new, but reconnecting with loved ones helps you gain perspective and regain control of your life."
    },
    {
      "title": "Use silence to your advantage.",
      "content": "Use silence to your advantage. He may be trying to express his power in your relationship by ridiculing you, calling you names, or otherwise being rude and insulting. If he is being unfair, mean, or destructive like this, rather than giving in to his provocations (which is probably what he wants), stay silent. This is a form of showing him that he doesn't have the power over you that he thinks he does (namely, power over your emotions and reactions). [8] X Research source When in doubt, think about how such \"non-violent, silent\" strategies have worked successfully throughout history, such as between Mahatma Gandhi and others and the British-ruled India."
    },
    {
      "title": "Try couples counseling.",
      "content": "Try couples counseling. One effective way to improve the power dynamic in your relationship is to work through your relationship issues with a qualified counselor. It can help to have a third party who is unbiased and can help you and your partner see the issues clearly. In addition, relationship counselors can help you to set goals and compromises that can help you have a more power-balanced relationship. [9] X Research source To find a psychologist near you, try this website: http://locator.apa.org/"
    },
    {
      "title": "Break any cycle of abuse.",
      "content": "Break any cycle of abuse. If you are someone who finds yourself in an abusive relationship, and you are having trouble getting out of it, there are a number of things you can do or look out for to help you break the cycle of abuse. Watch out for the honeymoon phase, where your abuser treats you very well after being nasty. Know that this is likely inauthentic and your abuser is only luring you back in so that he can abuse you again in the future. [10] X Research source Avoid rationalizing the abuse. Signs of rationalization can include things like \"he's not as bad as some partners I've heard about\" or \"he's only hit/screamed at me a couple of times\" [11] X Trustworthy Source HelpGuide Nonprofit organization dedicated to providing free, evidence-based mental health and wellness resources. Go to source Once you realize these are rationalizations you can dispel them and see more clearly. Understand his fear-based tactics. An abuser may certain tactics to retain power, such as threatening to commit suicide if you leave, making or carrying out threats of violence, calling you names, playing mind games, taking money or not allowing you to have money, or making light of the abuse or denying that it happened at all. If you understand your abuser's tricks, you will be more able to resist them by seeing them for what they are. For a full treatment on the subject, including information on restraining orders and escaping abuse in emergency situations, see: https://www.wikihow.com/Break-the-Cycle-of-Abuse"
    }
  ]
}