{
  "url": "https://www.wikihow.com/Take-Care-of-a-Lost-Pigeon",
  "title": "How to Take Care of a Lost Pigeon",
  "steps": [
    {
      "title": "Seek urgent care.",
      "content": "Seek urgent care. If the pigeon is shaking, bleeding, or vomiting, immediately take him to an avian veterinarian. If you are not sure where to take the pigeon, call the WildCare Hotline at (415) 456-7283. They can also tell you how to care for the pigeon. [1] X Research source Always seek urgent care if you have a baby pigeon. If the pigeon makes any type of squeaking or chirping sound, you have a juvenile pigeon."
    },
    {
      "title": "Get a ventilated box or cage.",
      "content": "Get a ventilated box or cage. A small cardboard box or a bird cage can be used to house the pigeon. If you use a cardboard box, poke small holes in the side of the box for ventilation. You could also place a screen on top of the box for ventilation. Line the bottom with a soft cloth or some paper towels. [2] X Research source An ideal cage would be at least 42″ wide, 27″ deep, and 30″ high. You can also use a small dog or cat crate. Any container that you use should protect the pigeon from any cats or dogs."
    },
    {
      "title": "Capture the pigeon.",
      "content": "Capture the pigeon. If the pigeon is tame or injured, you should be able to pick the pigeon up with your hands. If you can't pick the pigeon up, try throwing a towel over the bird and then scoop the pigeon in the towel and place it in the box. You can also use food to bait the pigeon into the container. [3] X Research source You can also walk behind the pigeon to get him to walk into the container or into a place where you can easily catch him. Grab him across the back and gently hold him with two hands."
    },
    {
      "title": "Care for a baby pigeon.",
      "content": "Care for a baby pigeon. If you have a baby pigeon, place him in a ventilated box with the heating pad turned on low. Half of the container should be heated and the other half should not. Baby pigeons have a special diet. Call the WildCare Hotline to get instructions to care for the pigeon and find a hospital or veterinarian for the baby pigeon. [4] X Research source Call the number before you feed the pigeon. Improper feeding can result in death or a serious injury."
    },
    {
      "title": "Give the pigeon clean water.",
      "content": "Give the pigeon clean water. Put water in a container that is at least 1 inch deep (e.g. old margarine tub). Water is more important than food if a pigeon is lost. The pigeon may be exhausted and not recognize the water. If you notice that the pigeon is not drinking, dribble a few drops of water into the container to make a splashing sound. If the pigeon looks super exhausted, put a teaspoon of Gatorade in two cups of water and give it to the pigeon. This will help replace lost electrolytes."
    },
    {
      "title": "Purchase pigeon feed.",
      "content": "Purchase pigeon feed. Pigeons eat grains and seeds. Go to a feed store to purchase pigeon feed. Pet stores usually do not carry pigeon feed. If you cannot go to a feed store, you can buy wild bird seed or dove and quail mix from the pet store. You can also give the pigeon uncooked popcorn, rice, split peas, barley, and buckwheat. Do not give your pigeon a slice of bread. Start by giving 2 tablespoons in the morning and see how much the pigeon eats. Adjust the amount until all of the food you provide in the morning is gone by the end of the day."
    },
    {
      "title": "Provide vegetables.",
      "content": "Provide vegetables. In addition to grains, your pigeon will enjoy eating vegetables 3 or 4 times a week. Chop or mince vegetables such as carrots, broccoli, snap peas, kale, cauliflower, dandelion greens, edamame, and bell peppers. Wash the vegetables to remove any chemicals before you feed them to your pigeon. [5] X Research source The vegetables should be placed in a small, separate dish. Start out with 2 tablespoons and reduce the amount based on how much your pigeon eats."
    },
    {
      "title": "Check for a leg band.",
      "content": "Check for a leg band. If you have found a racing pigeon, they will be wearing a leg band. The band will tell you where the bird is registered, the year the bird was hatched, the pigeon club, and the pigeon's unique number. Some bands may have the owner's name and contact information. If the bird does not have a band, it is a wild pigeon. If the leg band has the owner's contact information, contact the owner and let them know that you have their pigeon. If there is no contact information, you will have to read the leg band to determine who to contact."
    },
    {
      "title": "Read the leg band.",
      "content": "Read the leg band. The first 2 letters of the leg band will let you know which national organization that pigeon belongs to. You can then contact the organization and let them know that you have found one of their pigeons. All of these organizations have websites. Here are some common organizations: AU stands for the American Racing Pigeon Union. CU stands for the Canadian Racing Pigeon Union. [6] X Research source IF stands for International Federation of American Homing Pigeon Fanciers. [7] X Research source NPA stands for the National Pigeon Association. [8] X Research source If the band says “IFB” call 1-877-355-7727 or email them at foyspigeon@zoominternet.net. ADA stands for the American Dove Association and you can contact them at secretary@doveline.com. If the band has letters that you cannot identify, contact the American Racing Pigeon Union. They will help you find the owner. The Vancouver Poultry & Fancy Pigeon Association will also help you locate the owner if you are unable to do so. Email them at info@vancouverfancypigeon.ca."
    },
    {
      "title": "Release a wild pigeon.",
      "content": "Release a wild pigeon. If the pigeon does not have a leg band, it is most likely a wild pigeon. Do not keep a wild pigeon as your pet. It is better to take care of the pigeon for a few days until you can get him some help at a rescue society. [9] X Research source Most pigeons can find their way home after 1 or 2 days of rest, food, and water. Take the bird to an area without electrical wires and plenty of open space and release the pigeon. Again, you can call the WildCare Hotline at (415) 456-7283 to find a rescue place for the pigeon. Avoid calling your local humane society. They are more likely to euthanize the pigeon instead of providing care and releasing him back into the wild."
    }
  ]
}