{
  "url": "https://www.wikihow.com/Wash-Flannel-Sheets",
  "title": "How to Wash Flannel Sheets",
  "steps": [
    {
      "title": "Separate your sheets according to color.",
      "content": "Separate your sheets according to color. Before you begin washing, sort your bedding into two or more separate piles: lights, darks and colors. Washing dark or brightly colored sheets with white ones could cause bleeding or fading, leaving your sheets with a dingy, discolored look. [1] X Research source In addition to sorting lights and darks, it may also be a good idea to wash dissimilar colors like red and blue separately. As long as you don’t mix-and-match your flannel bedding, you should have no problem keeping it separated when it comes time to do laundry."
    },
    {
      "title": "Pre-treat flannel sheets with vinegar.",
      "content": "Pre-treat flannel sheets with vinegar. The first time you put your flannel bedding through the wash, add one half cup (120ml) of distilled white vinegar. The acidity in the vinegar will prevent pills from forming. It also has the added bonus of locking in colors, making them less likely to run during future washings. Pills are little clumps of tangled napping, or the loose fibers on the surface of flannel. Pilling occurs when fabrics like flannel aren’t properly maintained. Adding a splash of vinegar to the wash cycle now and then may also help keep your sheets fluffy and free of oily residue."
    },
    {
      "title": "Set the washing machine to a low temperature.",
      "content": "Set the washing machine to a low temperature. It’s best to wash your flannel sheets with warm water, although some manufacturers even recommend that the water be cold. Lower temperatures will be easier on the delicate structure of the fabric as well as the color. [2] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020. High temperatures can shrink the tiny fibers in flannel, resulting in pilling and a less comfortable sleeping experience. [3] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020."
    },
    {
      "title": "Add a small amount of mild detergent.",
      "content": "Add a small amount of mild detergent. Choose a detergent that’s been specially formulated for use on delicates. Be careful not to use more than necessary—some detergents contain chemicals that put fabrics (especially soft ones like flannel) in danger of fading. A color-protecting detergent will come in handy for preserving the look of brightly colored bedding. Add colored detergents to a laundry ball or the dispenser on the washing machine so you don’t have to pour them directly onto the sheets themselves."
    },
    {
      "title": "Wash the sheets on a gentle cycle.",
      "content": "Wash the sheets on a gentle cycle. A slow setting that uses minimal agitation is perfect for cleaning flannel sheets without harming the delicate weave of the threads. When you’re loading the washer, be sure to distribute the bedding evenly throughout the drum to prevent it from becoming bunched or tangled. [4] X Research source If your washing machine doesn’t have an option for different wash cycles, set it to a timed wash for the shortest duration. [5] X Research source"
    },
    {
      "title": "Dry the sheets on low heat.",
      "content": "Dry the sheets on low heat. As with washing, drying flannel sheets with too high a temperature may lead to shrinkage and pilling. To prevent this, always select the lowest available heat setting, or simply let your sheets tumble dry. It will take longer, but it will be worth it to preserve the comfortable feel of your bedding. [6] X Research source Give yourself plenty of time to get your laundry taken care of so you won’t have to worry about soggy sheets at bedtime."
    },
    {
      "title": "Allow the sheets to air dry.",
      "content": "Allow the sheets to air dry. If space permits, you might also choose to dry your flannel sheets by hanging them up. After removing the sheets from the washer and wringing out any excess water, stretch out the sheets to expose as much surface area as possible and hang them on a clothesline or drying rack. [7] X Research source Save money on your energy bill by getting the sheets started in the dryer, then letting them finish air drying. If it’s a nice day, you can speed up the drying process by placing the damp sheets in direct sunlight. Not only will the warmth of the sun help them dry faster, sunlight also makes a great natural disinfectant and deodorizer. [8] X Research source"
    },
    {
      "title": "Replace or put away the sheets.",
      "content": "Replace or put away the sheets. Once your sheets are dry, you can put them right back on your bed, or neatly fold them and stash them in the linen closet until cold weather comes around again. Leaving them to sit in a pile makes them more susceptible to wrinkles. Be sure to check your bedding for large pills, lint and loose threads. Give the sheets a good shake to fluff them up before making the bed."
    },
    {
      "title": "Treat stains right away.",
      "content": "Treat stains right away. Once stains set into a soft surface like flannel, they can be next to impossible to remove completely. In the event of spills, leaks and other accidents, blot the affected area with a damp cloth while it’s still wet. Afterwards, clean your bedding as usual, adding one quarter to one half a cup (60-120ml) of white vinegar to the washing machine as it fills. Use a mixture of warm water, hydrogen peroxide and mild liquid detergent to deal with substances that are likely to leave stains, like coffee or red wine. [9] X Research source Be careful not to scrub the sheets too forcefully—over time, it’s possible to wear holes into the fabric."
    },
    {
      "title": "Avoid using fabric softeners.",
      "content": "Avoid using fabric softeners. [10] X Expert Source Safir Ali Professional Dry Cleaner Expert Interview. 15 September 2020. Though they may sound like a good thing, the chemicals in fabric softeners have a tendency to coat and stiffen flannel fibers. Over time, this can leave your sheets feeling waxy. It’s also a good idea to say no to dryer sheets for the same reason. To keep older flannel sheets soft to the touch, try throwing a couple (clean) tennis balls into the dryer with them. The movement of the tennis balls will help loosen up clumped fibers. One of the main selling points of flannel is that it’s already soft, so there’s no need to use a lot of conditioners and other products to keep it that way. [11] X Research source"
    },
    {
      "title": "Change out your sheets periodically.",
      "content": "Change out your sheets periodically. Rather than constantly washing and reusing the same set of sheets, invest in one or two additional sets and cycle them out between uses. Each set will last longer, and you’ll appreciate the fresh new look your bed gets every time you do laundry. Remember to keep lights, darks and colored sheets separated in the wash."
    }
  ]
}