{
  "url": "https://www.wikihow.com/Use-a-Thermometer",
  "title": "How to Take a Temperature with a Thermometer",
  "steps": [
    {
      "title": "Use a digital thermometer in most cases.",
      "content": "Use a digital thermometer in most cases. Digital thermometers are accurate and easy to use. They can be used to take a temperature rectally (in the anus), in the armpit (an axillary measurement), or orally (in the mouth). [2] X Research source"
    },
    {
      "title": "Minimize contact with a temporal scanner.",
      "content": "Minimize contact with a temporal scanner. Non-contact infrared thermometers allow you to take someone’s temperature without touching them—you simply point the device at their forehead and press a button. However, factors including humidity and perspiration can alter the readings. If you choose this type of thermometer, make sure to follow the manufacturer’s instructions. [3] X Research source"
    },
    {
      "title": "Try a tympanic thermometer if you’ve been trained on how to use it.",
      "content": "Try a tympanic thermometer if you’ve been trained on how to use it. Tympanic thermometers measure temperature in the ear canal. However, if they aren’t calibrated or used correctly, they can give inaccurate readings. [4] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source If this is the only thermometer you have, you can use it, but a digital thermometer is generally a better choice. Avoid using a tympanic thermometer in a child under 3 months of age, as their ear canal may be too small to insert the probe into correctly. [5] X Trustworthy Source American Academy of Pediatrics Peer-reviewed medical and health resources from the American Academy of Pediatrics Go to source"
    },
    {
      "title": "Steer clear of pacifier thermometers and thermometer strips.",
      "content": "Steer clear of pacifier thermometers and thermometer strips. While convenient, these methods don’t always produce accurate readings. [6] X Research source A digital thermometer is a better option, especially for children."
    },
    {
      "title": "Avoid using mercury thermometers.",
      "content": "Avoid using mercury thermometers. While mercury-filled glass thermometers were a staple in the past, experts don’t recommend using them anymore. The glass can break, exposing you to mercury, which is poisonous. [7] X Research source Upgrade to a digital or temporal thermometer for a safer, more accurate way to take a temperature."
    },
    {
      "title": "Take rectal temperatures for the most accurate readings in small children.",
      "content": "Take rectal temperatures for the most accurate readings in small children. Have a healthcare provider show you how to take a rectal temperature properly before trying it at home. Cover the tip of a sanitized digital thermometer in petroleum jelly. Position your baby on their back and bend their knees, then gently insert the silver tip of the thermometer 1 inch (2.5 cm) into your baby’s rectum. Hold the thermometer in place with your fingers until it beeps (usually about 1 minute). At that point, you can remove the thermometer and check the temperature reading. [8] X Research source The American Academy of Pediatrics recommends using a regular digital thermometer to take a rectal (anal) temperature until your child is about 3 years of age. [9] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source If your child is under 3 months of age, the only way to get an accurate temperature is to take it rectally. [10] X Trustworthy Source American Academy of Pediatrics Peer-reviewed medical and health resources from the American Academy of Pediatrics Go to source"
    },
    {
      "title": "Measure temperature orally for an easy option.",
      "content": "Measure temperature orally for an easy option. Wash the probe of a digital thermometer with cool soapy water first. Then, place the tip of the thermometer under your tongue toward the back of your mouth. Hold it in place until the thermometer beeps while breathing through your nose. Remove it and read the temperature, then clean the thermometer again. [11] X Trustworthy Source National Health Service (UK) Public healthcare system of the UK Go to source If your child is under the age of 5, it’s unlikely you’ll get an accurate oral reading. Wait 15 minutes after drinking or eating to take a temperature orally for the most accurate reading. [12] X Trustworthy Source American Academy of Pediatrics Peer-reviewed medical and health resources from the American Academy of Pediatrics Go to source"
    },
    {
      "title": "Try an axillary reading only for screening.",
      "content": "Try an axillary reading only for screening. Taking your temperature in your armpit provides a less accurate reading than other locations, though it is the most convenient option. Before you start, make sure the armpit is dry. Place the tip of the thermometer into the middle of the armpit, directly against the skin, and hold your arm close to your side. Wait until the thermometer beeps to check the reading. [13] X Research source Wait at least one hour after heavy exercise or a hot bath before taking body temperature from the armpit or anywhere else. [14] X Research source For better accuracy, take readings from both armpits and then average the two temperatures together."
    },
    {
      "title": "Check your temperature using a temporal scanner if you have one.",
      "content": "Check your temperature using a temporal scanner if you have one. Enlist a helper for this as you can’t take your own temperature accurately with a non-contact infrared thermometer. First, make sure your forehead is clean, dry, and not blocked by your hair or anything else. Ask the person to point the device perpendicularly at your forehead at the distance specified in the manufacturer’s instructions (as this differs between brands). Then, they can simply press the button to get an instant reading. [15] X Trustworthy Source US Food and Drug Administration U.S. government agency responsible for promoting public health Go to source To use a temporal artery thermometer, place the thermometer in the middle of your forehead. Press the scan button and slowly move the thermometer across the forehead toward the ear, making sure it stays in contact with your skin the entire time. When you get the hairline, stop pressing the scan button, and read the temperature. [16] X Trustworthy Source Johns Hopkins Medicine Official resource database of the world-leading Johns Hopkins Hospital Go to source"
    },
    {
      "title": "Use a tympanic thermometer to take a reading from the ear.",
      "content": "Use a tympanic thermometer to take a reading from the ear. Tympanic thermometers sense reflected infrared (heat) emissions from the tympanic membrane (eardrum). [17] X Research source Turn on your tympanic thermometer, calibrate it if necessary, and place a disposable cover over the tip. Gently pull the ear back to straighten out the ear canal before inserting the tip of the thermometer into the ear. After about 2 seconds, the thermometer will beep and you can remove it to check the reading. [18] X Research source Contrary to popular belief, earwax or ear tubes won’t affect a tympanic reading. Do not use an ear thermometer on an ear that is infected, injured, or recovering from surgery."
    },
    {
      "title": "Average:",
      "content": "Average: 98.6 °F (37.0 °C). Additionally, any temperature within the 97.5–99.5 °F (36.4–37.5 °C) range is considered normal. [19] X Trustworthy Source Cedars Sinai Hospital Website of one of the world's leading hospitals Go to source However, the location where you measure the temperature affects the reading. A normal rectal temperature is 97.9–100.4 °F (36.6–38.0 °C), a normal tympanic temperature is 96.4–100.4 °F (35.8–38.0 °C), a normal oral temperature is 95.9–99.5 °F (35.5–37.5 °C), and a normal axillary temperature is 94.9–99.1 °F (34.9–37.3 °C). [20] X Trustworthy Source PubMed Central Journal archive from the U.S. National Institutes of Health Go to source This is because, in general: [21] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source A rectal (anal) temperature is 0.5-1°F (0.3-0.6°C) higher than an oral temperature. A tympanic (ear) temperature is 0.5-1°F (0.3-0.6°C) higher than an oral temperature. An axillary (armpit) temperature is 0.5-1°F (0.3-0.6°C) lower than an oral temperature. A temporal (forehead) temperature is 0.5-1°F (0.3-0.6°C) lower than an oral temperature."
    },
    {
      "title": "Low-Grade Fever:",
      "content": "Low-Grade Fever: 99.6–100.3 °F (37.6–37.9 °C). A low-grade fever isn’t usually a cause for concern, as it means your body is fighting off an illness. However, if you have a child under 3 months of age with any fever, contact their pediatrician. [22] X Trustworthy Source Cedars Sinai Hospital Website of one of the world's leading hospitals Go to source"
    },
    {
      "title": "High Fever:",
      "content": "High Fever: 102 °F (39 °C) or above. A high fever can be dangerous, so monitor it carefully. Call you doctor if your fever (of any grade) lasts more than 48 hours. If your child is older than 3 months but younger than 1 year, contact their pediatrician for a fever at or above 102 °F (39 °C). [23] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source For older children and adults, seek medical attention if you have a temperature over 105 °F (41 °C). [24] X Trustworthy Source MedlinePlus Collection of medical information sourced from the US National Library of Medicine Go to source Get emergency care right away if you have a fever and additional symptoms, including: [25] X Trustworthy Source Cedars Sinai Hospital Website of one of the world's leading hospitals Go to source Stiff neck Confusion Vomiting or diarrhea Seizure Irregular breathing Purple spotted rash Persistent sore throat Ear pain"
    }
  ]
}