{
  "url": "https://www.wikihow.com/Video-Call-on-Tango",
  "title": "How to Video Call on Tango",
  "steps": [
    {
      "title": "Install the Tango app for Android or iOS.",
      "content": "Install the Tango app for Android or iOS. Open the App Store (iOS) or Play Store (Android) on your mobile device, and then: Type “Tango” into the search field. Tap the Tango app in the search results. Tap “Get” or “Install” on the app page and then follow the prompts to install."
    },
    {
      "title": "Open Tango.",
      "content": "Open Tango. Once you’ve installed Tango, tap its icon on your home screen. Now you’ll be taken through a brief setup process."
    },
    {
      "title": "Enter your phone number and then tap “Next.”",
      "content": "Enter your phone number and then tap “Next.” Now you’ll see the “Create your profile!” screen."
    },
    {
      "title": "Choose an option to create a new account.",
      "content": "Choose an option to create a new account. Tango offers two options to get you started: Choose “Get From Facebook” to sign in to Tango with Facebook. This makes it easy to connect with your Facebook friends. Follow the prompts to link Tango to Facebook. If you’d rather not associate Tango with Facebook, enter your name and email address into the blanks provided, and then tap “Done.”"
    },
    {
      "title": "Navigate to the “Call” tab.",
      "content": "Navigate to the “Call” tab. Here you’ll find a list of your most recent calls, including those made from your regular phone app."
    },
    {
      "title": "Tap “New Call.”",
      "content": "Tap “New Call.” This link is at the top of the screen."
    },
    {
      "title": "Find the contact you want to call.",
      "content": "Find the contact you want to call. Scroll through the list of contacts until you find the name of the person with whom you’d like to video chat. [1] X Research source If you don’t see the video camera icon, this person has not yet set up their Tango account."
    },
    {
      "title": "Tap the video camera icon next to the contact’s name.",
      "content": "Tap the video camera icon next to the contact’s name. Tango will immediately start the video call. The person you’re calling will receive a notification on their device, letting them know that you’re trying to reach them by video call. Once they answer, you will be able to both see and hear them."
    },
    {
      "title": "Get to know the in-call controls.",
      "content": "Get to know the in-call controls. At the top of the screen, you’ll see 3 icons: Video camera: Tap this to toggle the video part of the call on and off. Microphone with a line through it: This will mute the sound of the call. Camera with arrows: Tap this to switch from the front camera to the back, and vice versa."
    },
    {
      "title": "Experiment with fun features.",
      "content": "Experiment with fun features. While you’re in a call, you’ll also see several round icons at the bottom of the screen: Mask: Tap this to choose a mask to “wear” over your face for the call. Face with cat ears: Tap this to choose an avatar to replace your image in the video call. You’ll still see the person with whom you’re chatting, but they’ll see your chosen avatar. Game controller: Tap this to see a list of games you can play while connected to this call. Smiley face: Tap this to choose from a variety of stickers, many of which are animated. Dice: Select a creative filter to change the color or saturation of your video."
    },
    {
      "title": "Tap the red phone icon to hang up the call.",
      "content": "Tap the red phone icon to hang up the call. The call will disconnect, and you will return to the main Tango screen."
    },
    {
      "title": "Tap the “Chat” tab.",
      "content": "Tap the “Chat” tab. Here you’ll find a list of your friends who already use Tango. This list was generated from your phone contacts (and your Facebook contacts, if you linked Tango to Facebook)."
    },
    {
      "title": "Tap “Add Friends” at the bottom of the Chat tab.",
      "content": "Tap “Add Friends” at the bottom of the Chat tab. If you want to make a video call to someone whose name doesn’t appear in your contacts list, you’ll need to invite them to Tango. You won’t be able to video call the person you invite until they accept your invitation. If the person you want to call is on Tango but not listed as one of your contacts, type their email address or phone number into the Search box, and then select their profile from the results. Tap the red paper airplane icon to send them a friend request."
    },
    {
      "title": "Tap “Invite via SMS, Email, WhatsApp, etc” to invite a friend to Tango.",
      "content": "Tap “Invite via SMS, Email, WhatsApp, etc” to invite a friend to Tango. Now you’ll choose the method for which you’ll send your friend a Tango invitation, such as your email or text messaging app."
    },
    {
      "title": "Tap the app you want to use to send the invitation.",
      "content": "Tap the app you want to use to send the invitation. The options vary depending on your device. Once you’ve made your choice, the app will open to an invitation message that’s ready to be sent. This message includes a link to download Tango."
    },
    {
      "title": "Choose a recipient and then tap “Send.”",
      "content": "Choose a recipient and then tap “Send.” You won’t be able to send this person a video call until they’ve accepted your invitation and created an account with Tango. The Tango app will notify you once they’ve signed up."
    }
  ]
}