{
  "url": "https://www.wikihow.com/Use-Your-Fingers-to-Do-the-9s-Times-Tables",
  "title": "How to Use Your Fingers to Do the 9s Times Tables",
  "steps": [
    {
      "title": "Understand that you cannot use this finger trick on numbers larger than 10.",
      "content": "Understand that you cannot use this finger trick on numbers larger than 10. The finger trick will allow you to calculate the times table from 9 x 1 to 9 x 10. Multiplying 9 by any larger number cannot be done using the finger trick. The finger trick also cannot be used to multiply 9 by fractions or any other number that is not an integer. [1] X Research source If you need to multiply 9 by any larger number, you can calculate the problem using a pencil and paper or use a calculator to solve the problem for you."
    },
    {
      "title": "Hold your hands up in front of you.",
      "content": "Hold your hands up in front of you. Make sure that your fingers are pointing up, that your hands are next to one another, and that your palms are facing away from your body. Your hands are the basis for calculating the 9s times table. [2] X Research source"
    },
    {
      "title": "Assign your fingers a number by counting upwards from left to right.",
      "content": "Assign your fingers a number by counting upwards from left to right. Begin with the pinkie of your left hand. This finger should be the finger that is furthest left. Call your left pinkie \"1.\" Then call your left ring finger \"2,\" and the middle finger of your left hand \"3.\" Continue counting up from left to right for all 10 fingers. The thumb of your right hand should be labeled \"6\" and the pinkie of your right hand should be labeled \"10\" if you have done this correctly. [3] X Research source"
    },
    {
      "title": "Determine what number you need to multiply by 9.",
      "content": "Determine what number you need to multiply by 9. Take a moment to think about which multiplication problem you are going to solve. Sometimes you might need to solve a problem that is assigned to you--for example, your teacher might ask you to solve the problem 9 x 6. Sometimes, you will have to determine the terms of the problem yourself, for example, if you wish to purchase 9 candy bars that cost $2.00 each. To determine how much you will be spending, you will have to multiply 9 x 2. [4] X Research source"
    },
    {
      "title": "Fold down the finger that matches the number you want to multiply by 9.",
      "content": "Fold down the finger that matches the number you want to multiply by 9. Take a look at your hands and your fingers. When you multiply 9 x 1, you will fold down your finger that was assigned the \"1\" spot: your left pinkie. When you multiply 9 x 2, you will fold down the finger that is second from the left: your left ring finger. When you multiply 9 x 6, you will fold down your finger in the \"6\" spot: your right thumb. Remember that you can solve any multiplication problem from 9 x 1 to 9 x 10 in this manner. Keep the proper finger folded as you move on to the next step in your calculation. [5] X Research source"
    },
    {
      "title": "Count the number of fingers that are to the left of the folded finger.",
      "content": "Count the number of fingers that are to the left of the folded finger. Ask yourself how many fingers are standing up to the left of the folded finger. For example, if you are solving the problem of 9 x 6, there should be five fingers (all the fingers on your left hand) standing up to the left of the folded sixth finger (your right thumb). If you are solving the problem of 9 x 1, there should be zero fingers standing up to the left of the folded first finger (your left pinkie)."
    },
    {
      "title": "Assign the number of fingers to the left of the folded finger the tens spot.",
      "content": "Assign the number of fingers to the left of the folded finger the tens spot. Most of the answers from the 9s times tables are two-digit numbers. The only exception is 9 x 1, whose answer is the single-digit number 9. The tens spot in your answer is determined by the number of fingers to the left of the folded finger. For example, if you are solving 9 x 6, you will see that you have five fingers to the left of the folded finger. This means that your answer will be fifty- something . In order to determine the precise answer, you will have to continue to the next step."
    },
    {
      "title": "Assign the number of fingers to the right of the folded finger the ones spot.",
      "content": "Assign the number of fingers to the right of the folded finger the ones spot. Take a look at your hands, with the proper finger still folded. Count the number of fingers that are to the right of the folded finger. This is the \"ones\" component in your answer. For example, if you are solving 9 x 6, you will see that you have four fingers to the right of the folded finger. This means that the ones digit in your answer will be 4."
    },
    {
      "title": "Put the tens spot and the ones spot together to get your answer.",
      "content": "Put the tens spot and the ones spot together to get your answer. By stitching together the number of fingers to the left of your folded finger (the tens spot) and the number of fingers to the right of your folded finger (the ones spot), you will get your final answer for that times table. [6] X Research source For example, if you are solving for 9 x 6, you will have 5 fingers to the left of the folded \"6\" finger and 4 fingers to the right of it. The 5 is in the tens spot and the 4 is in the ones spot. Put it together to get 54, which is the correct answer. If, however, you are solving for 9 x 8, you will have 7 fingers to the left of the folded \"8\" finger (your right middle finger) and 2 fingers to the right of it. The 7 is in the tens spot and the 2 is in the ones spot. Put it together to get 72, which is the correct answer."
    },
    {
      "title": "Check your work.",
      "content": "Check your work. Until you have the hang of the 9s times tables, you might want to take a few moments to check your work. For example, you might use a calculator to make sure that you are using the finger trick correctly. You can also use the repeated addition method, where you simply add together the proper number of groups of 9. (9 x 4 is the same is 9 + 9 + 9 + 9 = 36). There are a few other rules about the 9s times tables that can help keep you on the right track. These special qualities about 9s make it particularly easy to determine whether you have gotten the right answer using the finger trick."
    },
    {
      "title": "Remember that the digits of your answer should all add up to 9.",
      "content": "Remember that the digits of your answer should all add up to 9. The nines times table has the great trick that the digits of your answer always add up to 9. [7] X Research source This works as follows: 9 x 1 = 09. 0 + 9 = 9 9 x 2 = 18. 1 + 8 = 9 9 x 3 = 27. 2 + 7 = 9 9 x 4 = 36. 3 + 6 = 9. etc."
    },
    {
      "title": "Remember that the tens digit of 9 x some number will be some number minus one.",
      "content": "Remember that the tens digit of 9 x some number will be some number minus one. For example, the tens digit of 9 x 3 will be 3-1, or 2. Therefore the answer to 9 x 3 should begin with 2. Use this pattern to help keep you on track: if you find that your answer to 9 x 2 begins with a 4 (and not a 1), you know you have gone astray somewhere. [8] X Research source"
    }
  ]
}