{
  "url": "https://www.wikihow.com/Start-a-Car-with-a-Bad-Crankshaft-Sensor",
  "title": "How to Get a Vehicle with a Bad Crankshaft Sensor Started",
  "steps": [
    {
      "title": "Instead of trying to start the car, hire a tow truck if you can.",
      "content": "Instead of trying to start the car, hire a tow truck if you can. There is a hack that might work (heavy emphasis on “might”—it often won’t), but it carries the risk of starting a small fire in your engine or damaging a critical component. If you can swing it, call a tow truck to get your vehicle towed to the mechanic for further inspection. [1] X Research source You can also just try cranking the ignition a few times. Your vehicle might start if the sensor is only partially damaged or dirty. If you’re a gearhead who knows their way around a vehicle, go ahead and give the starter fluid hack a try if you want to."
    },
    {
      "title": "Spray starter fluid into the throttle body and crank the engine to start it.",
      "content": "Spray starter fluid into the throttle body and crank the engine to start it. Locate the crankshaft sensor in the back of the engine near the flywheel and unplug the sensor. Then, spritz some starter fluid in the engine mount’s opening where the throttle body is located (usually near the air sensor). Crank the engine and the starter fluid may ignite in the mount and kick your pistons into action. [2] X Research source Don’t drive around casually using this trick. Get your vehicle to a mechanic ASAP. Keep a fire extinguisher around when you do this. It’s possible you’ll accidentally start a small fire with this hack. If your crankshaft sensor is busted, your engine won’t know when it’s time to inject fuel for the spark plugs and combust. Spraying starter fluid may provide the fuel you need to start the engine."
    },
    {
      "title": "The crankshaft converts up-down energy into rotational energy.",
      "content": "The crankshaft converts up-down energy into rotational energy. Your engine’s pistons fire up and down to compress air and fuel in the combustion chamber when your vehicle is running. But how does that movement turn your wheels? The crankshaft! The crankshaft discs sit unevenly on a pulley and artificially pump your transmission, which turns your vehicle’s wheels. [3] X Research source In most vehicles, the crankshaft (and crankshaft sensor) should last the lifespan of the vehicle. These components shouldn’t fail under normal circumstances so long as you get regular maintenance."
    },
    {
      "title": "The crankshaft sensor basically keeps your engine informed and safe.",
      "content": "The crankshaft sensor basically keeps your engine informed and safe. The crankshaft sensor monitors the rotational speed and position of your crankshaft and then sends that information to your engine control unit (ECU) and powertrain control module (PCM). Picture the sensor like a news reporter for your vehicle. It tells the engine when and why it needs to make adjustments to avoid misfiring. If your crankshaft sensor is bad, your car usually won’t start. This is because your engine doesn’t get any information from the ECU or PCM regarding your crankshaft, so the vehicle will think there’s a transmission or fuel injection problem. Without a working crankshaft sensor, your engine and your crankshaft are inevitably going to mismatch even if you can get your car started. This may cause a misfire or stall."
    },
    {
      "title": "Check engine light",
      "content": "Check engine light turning on Your check engine light comes on when your ECU or PCM detect a problem with the health of the engine. A bad crankshaft sensor will send faulty readings to the engine, so your check engine light should always pop on if that sensor is bad."
    },
    {
      "title": "Extreme vibrations from your engine",
      "content": "Extreme vibrations from your engine When the sensor is working, your crankshaft will make adjustments as it spins to compensate for whatever is going on in your engine (and vice versa). Without that communication, your engine and crankshaft will churn at disagreeable speeds. This will cause serious juddering and rattling feelings in the hood of your vehicle. It’s also likely you notice these vibrations changing in intensity and scope. It might even come and go as the crankshaft and engine accidentally line up with one another."
    },
    {
      "title": "Bad engine performance",
      "content": "Bad engine performance You won’t get decent engine performance with the crankshaft and engine working independently of one another. You’ll also likely notice your vehicle kicking or sputtering when you accelerate as the crankshaft struggles to compensate for the increased combustion in the engine. If the sensor is moderately damaged, you may notice your car accelerates much more slowly than it should given how hard you press on the pedal."
    },
    {
      "title": "Misfiring",
      "content": "Misfiring If it sounds like your vehicle pops and bangs when you start it, it’s a major sign the crankshaft sensor isn’t working correctly. The engine is going to run into situations where there’s either too much gas or not enough of it, and the chaotic misfires will be fairly loud and violent."
    },
    {
      "title": "Engine stalling",
      "content": "Engine stalling If you can get your vehicle started, your engine is likely to eventually stall out if you keep driving. It’s just a probability game—eventually the crankshaft and engine will end up so out of sync that your engine can’t get the fuel, air, or spark it needs to continue running. [4] X Research source This is another good reason why you should contact a tow truck if your crankshaft sensor is bad. Even if you can get the vehicle started, it’s likely to stop running relatively soon."
    },
    {
      "title": "Hire a pro to do this if you aren’t confident working with cars.",
      "content": "Hire a pro to do this if you aren’t confident working with cars. It’ll only cost $300 at most if you need a new crankshaft sensor, and the risks of messing this repair up can lead to more additional damage to your crankshaft or engine. If you don’t have any experience working on vehicles, this is kind of a tricky DIY job. Take your vehicle to a mechanic to get the sensor repaired. [5] X Research source Even if you factor in the cost of a tow truck, this is one of the cheaper vehicle repairs out there."
    },
    {
      "title": "Purchase a replacement sensor for your vehicle to do it yourself.",
      "content": "Purchase a replacement sensor for your vehicle to do it yourself. Turn the vehicle off and remove the negative battery terminal . Then, locate the sensor and unplug the electrical connector. Use a wrench to remove the bolts and pull the old sensor out. Clean the area around the sensor with a dry rag and slide your new sensor into place. Tighten the bolts, connect the electrical cord, and put the battery terminal back where it belongs. [6] X Research source The crankshaft position sensor is almost always located in between the transmission and the engine. If your engine light doesn’t turn off but your symptoms all go away, you just need to reset the error codes with an OBD-2 device . Most crankshaft position sensors look like small 2–3 in (5.1–7.6 cm) L-shaped modules with 1-2 openings for bearings on them."
    }
  ]
}