{
  "url": "https://www.wikihow.com/Unlock-Your-Locked-GM-Theftlock-Radio",
  "title": "How to Unlock a GM Theftlock Radio: The Complete Guide",
  "steps": [
    {
      "title": "Turn on your car and start the radio.",
      "content": "Turn on your car and start the radio. To unlock your GM Theftlock Radio, you must first retrieve your radio ID code (a six-digit code) from the unit. A GM dealer will then use this code to generate an unlock code you can enter into the radio. First, start your vehicle like usual, or turn the key until it's in the “On” or “Accessory” position. Then, press the power button on the radio’s volume dial to turn on the radio. The digital display will read “LOC” if the radio is locked. [1] X Research source If you see \"InOP\" instead of \"LOC,\" too many wrong codes have been entered in a brief period. You will need to leave the radio powered on for up to an hour before you can make three more attempts. [2] X Research source If you don’t see “LOC” or \"InOP\" but your radio isn’t working, the issue lies elsewhere. Take your car to a qualified GM mechanic or car radio technician to have them diagnose the source of the problem. [3] X Research source GM Theftlock radios are designed to lock up automatically when the vehicle’s battery dies or becomes disconnected, though an electronic malfunction could also cause the Theftlock function to activate."
    },
    {
      "title": "Grab a piece of paper and something to write with.",
      "content": "Grab a piece of paper and something to write with. Unlocking your Theftlock radio requires entering a unique 4-digit numerical code. However, before you can do this, it will be necessary to write down two separate 3-digit numbers, which you’ll get by punching a series of buttons on the radio’s interface. This process is time-sensitive, so you'll need to write down the codes pretty quickly before they disappear. Most GM Theftlock radios only give you 10-15 seconds to perform each step in the process before the display resets itself."
    },
    {
      "title": "Press and hold presets 2 and 3 for six to ten seconds.",
      "content": "Press and hold presets 2 and 3 for six to ten seconds. Release the buttons once the first 3-digit number appears on the display. When the numbers finally appear, write them down quickly and accurately. They are the first three digits of your radio's identification code. [4] X Research source If this doesn't work, try pressing and holding 1 and 4 instead."
    },
    {
      "title": "Hit the AM/FM button to get the second half of your radio identification number.",
      "content": "Hit the AM/FM button to get the second half of your radio identification number. After you press the button, three more numbers will pop up on the radio’s display. These are the last three digits of your radio’s identification code. Write these numbers down alongside the first three digits. [5] X Research source If the numbers on the display do not change, the second three numbers are the same as the first. For example, if the first three digits were 112 , and pressing the AM/FM button did not change them, the first six numbers are 112-112 . Make sure the two sets of numbers are in the correct order. If you enter your radio identification number incorrectly, your attempt to unlock your radio will fail. You’ll need to confirm this 6-digit radio identification code with GM over the phone to unlock your radio."
    },
    {
      "title": "Dial 1-800-537-5140 to connect with GM’s toll-free radio hotline.",
      "content": "Dial 1-800-537-5140 to connect with GM’s toll-free radio hotline. Once you’re connected, you’ll be asked to provide your vehicle’s radio identification number, along with a special dealer access code. You’ll then be rewarded with a 4-digit retrieval code, allowing you to unlock your radio. [6] X Research source This is an automated line, so you won’t have to wait to talk to a live human being. You can call GM’s radio hotline for assistance at any time, day or night. You can contact your local GM dealership if you have trouble getting your unlock code from this phone number. GM dealerships can provide you with an unlock code for your GM Theftlock Radio once you give them your radio ID code."
    },
    {
      "title": "Enter the numbers 106010 followed by a .",
      "content": "Enter the numbers 106010 followed by a . Enter these numbers when prompted for a dealer access code. This is the most common code used by GM personnel to reset locked Theftlock radios. Key in each number carefully, then hit the sign to send your request through. [7] X Research source Under normal circumstances, a locked Theftlock radio must be reset by a licensed GM dealer, who uses a special code known only to dealership personnel. By entering the code yourself, you can avoid the trouble and expense of paying to have your vehicle’s radio unlocked at the dealership."
    },
    {
      "title": "Enter your vehicle's 6-digit radio ID code and press *.",
      "content": "Enter your vehicle's 6-digit radio ID code and press * . When prompted, refer to the two three-digit numerical codes you wrote down earlier and enter them as a single unbroken sequence using your phone's keypad. Once you’ve done that, press the * sign and prepare to receive your radio retrieval code. [9] X Research source Remember to read the numbers from left to right, and be careful not to accidentally include any other numbers or symbols. You should make a total of 7 button presses when it’s all said and done."
    },
    {
      "title": "Write down the 4-digit radio retrieval code as it’s recited to you.",
      "content": "Write down the 4-digit radio retrieval code as it’s recited to you. The automated voice on the other end of the line will only repeat the code once, so listen closely and have your pen and paper ready to record the numbers neatly and precisely. You now have all the information you need to unlock your radio. [10] X Research source If you don’t catch one or more numbers of the retrieval code, you’ll have no choice but to start the call over from the beginning."
    },
    {
      "title": "Turn on your car and your radio.",
      "content": "Turn on your car and your radio. Now that you have the unlock code from the dealership, unlocking your GM Theftlock radio is easy. Press the Power button on your GM radio to turn it on, and you should see the \"LOC\" message again."
    },
    {
      "title": "Use the hour (HR) button on the radio to enter the first two digits of the unlock code.",
      "content": "Use the hour (HR) button on the radio to enter the first two digits of the unlock code. With each button press, the number displayed will increase by 1. Continue ticking off the numbers in the hour position until they match the first half of the code provided to you by GM. If the first two digits of your radio retrieval code are “10,” for instance, you would need to push the hour button 10 times. On most Theftlock radios, you’ll find the time set buttons in the lower right-hand corner of the radio interface."
    },
    {
      "title": "Use the minute (MIN) button to enter the second two digits of the unlock code.",
      "content": "Use the minute (MIN) button to enter the second two digits of the unlock code. To finish entering the code, do the same thing you did to put in the first two digits, only this time with the numbers in the minute position. Double-check that each number in the code is correct before proceeding. [11] X Research source Holding the minute button will cycle through the numbers automatically, so you don’t have to keep pressing it repeatedly."
    },
    {
      "title": "Press the AM/FM button to unlock your radio.",
      "content": "Press the AM/FM button to unlock your radio. The display should now read \"SEC,\" meaning the radio has been unlocked. Switch on the radio and specify your audio input of choice, and it should begin playing as normal. It’s as simple as that! You can repeat this process to resume use of your Theftlock radio any time it locks up unexpectedly. If your radio is still locked or refusing to cooperate after you’ve entered your radio retrieval code, your best bet is to schedule an appointment at a GM dealership to have it looked at by a professional."
    },
    {
      "title": "Leave your battery on for 1 hour to clear an “INOP” message.",
      "content": "Leave your battery on for 1 hour to clear an “INOP” message. Some Theftlock radios will shut down altogether if you attempt to enter an incorrect radio retrieval code too many times. When this happens, the display will read “INOP,” short for “inoperable.” All you can do at this point is leave the key turned to the “On” position for a full hour and wait for the message to go away on its own."
    }
  ]
}